* %GOTO EDGACTRC1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
         EDGACTRC &LIST=NO,&DSECT=YES     **                            00150000
*********************************************************************** 00200000
*                                                                     * 00250000
*  RMM Inventory Management Activity File Record                      * 00300000
*                                                                     * 00350000
*********************************************************************** 00400000
* OS/390 DFSMSrmm V2R10                                               * 00450000
*                                                                     * 00500000
*PROPRIETARY V3 STATEMENT                                             * 00550000
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00600000
*"RESTRICTED MATERIALS OF IBM"                                        * 00650000
*5647-A01                                                             * 00700000
*(C) COPYRIGHT 1993,2000  IBM CORP.                                   * 00750000
*END PROPRIETARY V3 STATEMENT                                         * 00800000
*                                                                     * 00850000
*********************************************************************** 00900000
*                                                                     * 00950000
*   FUNCTION : EDGACTRC maps the RMM Inventory Management             * 01000000
*              Activity File Record                                   * 01050000
*                                                                     * 01100000
*   LOCATION : N/A                                                    * 01150000
*                                                                     * 01200000
*   METHOD OF ACCESS:                                                 * 01250000
*              ASSEMBLER - USING on ACTRC                             * 01300000
*              PL/X      - %INCLUDE EDGACTRC                          * 01350000
*                                                                     * 01400000
*   LISTING  : ASSEMBLER - specify LIST=YES on the macro              * 01450000
*              PL/X      - specify %IHALIST='YES' before INCLUDE      * 01500000
*                                                                     * 01550000
*********************************************************************** 01600000
*                                                                     * 01650000
*   CHANGE ACTIVITY:                                                  * 01700000
*                                                                     * 01750000
* $S5=OW24798,130,961112,GW : Audit Phase 1 SPE (part added)       @S5A 01800000
* $S7=OW30969,140,971217,GW : VRS Enhancements                     @S7A 01825000
* $LC=RMM150 ,150,980205,GW : Catalog Synchronization              @LCA 01837500
* $K1=K150603,150,980424,GW : Activity file for Catsynch           @K1A 01843700
* $LF=RMM210 ,210,990528,VD : RETAINBY and MOVEBY                  @LFA 01846800
* $K2=K160799,210,991125,GW : length of ACTRC_HDR_OPTIONS          @K2A 01848400
* $01=OW45053,210,000620,MWW: Add missing equ                      @01A 01849190
*                                                                     * 01850000
*********************************************************************** 01859990
* WARNING: When you change this macro, you MUST also                  * 01869980
*          Remember to update the Symbols in EDGACTSY.                * 01879970
*********************************************************************** 01900000
         PUSH  PRINT                                                    01950000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               02000000
         PRINT OFF                                                      02050000
.ASMLIST ANOP                                                           02100000
         SPACE 1                                                        02150000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02200000
         AGO   .GENSTRT                                                 02250000
.GENDSCT ANOP                                                           02300000
ACTRC DSECT                                                             02350000
.GENSTRT ANOP                                                           02400000
*********************************************************************** 02450000
*                                                                     * 02500000
*  ACTRC: RMM ACTIVITY file records                                   * 02550000
*                                                                     * 02600000
*********************************************************************** 02650000
*                                                                       02700000
ACTRC_RDW           DS  0F           record descriptor word             02750000
ACTRC_RDW_LEN       DS  H            record descriptor - length         02800000
ACTRC_RDW_SEG       DS  XL2          record descriptor - segment        02850000
*                                                                       02900000
*********************************************************************** 02950000
*  Common record prefix                                               * 03000000
*********************************************************************** 03050000
*                                                                       03100000
ACTRC_PREFIX        DS  0F           common prefix                      03150000
ACTRC_PRE_TYPE      DS  C            activity file record type          03200000
ACTRC_PRE_TYPE_HDR  EQU C'H'         header record                      03250000
ACTRC_PRE_TYPE_DSN  EQU C'D'         data set details record            03300000
ACTRC_PRE_TYPE_VOL  EQU C'V'         volume details record              03350000
                    DS  CL3          reserved                      @S7C 03400000
*                                                                       03450000
ACTRC_DATA          DS  0F           start overlay for details areas    03500000
*                                                                       03550000
*********************************************************************** 03600000
*  Header Record                                                      * 03650000
*********************************************************************** 03700000
*                                                                       03750000
ACTRC_HDR_DATA          ORG ACTRC_DATA    overlay for header data       03800000
*                                                                       03850000
ACTRC_HDR_RUN_DATE            DS  CL10   inventory management date      03900000
ACTRC_HDR_RUN_TIME            DS  CL6    inventory management time      03950000
ACTRC_HDR_VERIFY_DATE         DS  CL10   inventory mgmt. VERIFY date    04000000
*                                                                       04050000
ACTRC_HDR_EXEC                DS  0CL16  execution parameters           04100000
ACTRC_HDR_BACKUP              DS  C      BACKUP: Y/N                    04150000
ACTRC_HDR_DSTORE              DS  C      DSTORE: Y/N                    04200000
ACTRC_HDR_EXPROC              DS  C      EXPROC: Y/N                    04250000
ACTRC_HDR_RPTEXT              DS  C      RPTEXT: Y/N                    04300000
ACTRC_HDR_VRSEL               DS  C      VRSEL:  Y/N                    04350000
ACTRC_HDR_VERIFY              DS  C      VERIFY: Y/N                    04400000
ACTRC_HDR_DATE                DS  C      DATE for VERIFY run: Y/N       04450000
*                                                                       04500000
ACTRC_HDR_DATEFORM            DS  C      DATEFORM:                      04550000
ACTRC_HDR_DATEFORM_AMERICAN   EQU C'A'   American                       04600000
ACTRC_HDR_DATEFORM_EUROPEAN   EQU C'E'   European                       04650000
ACTRC_HDR_DATEFORM_ISO        EQU C'I'   ISO                            04700000
ACTRC_HDR_DATEFORM_JULIAN     EQU C'J'   Julian                         04750000
ACTRC_HDR_CATSYNCH            DS  C      CATSYNCH: Y/N             @K1A 04775000
                              DS  CL7    reserved                  @K1C 04787500
*                                                                       04800000
ACTRC_HDR_OPTIONS             DS  0CL31  parmlib options           @K2C 04850000
*                                                                       05000000
ACTRC_HDR_VRSJOBNAME          DS  C      VRSJOBNAME priority            05050000
ACTRC_HDR_VRSJOBNAME_FIRST    EQU C'1'   jobname first                  05100000
ACTRC_HDR_VRSJOBNAME_SECOND   EQU C'2'   jobname second                 05150000
*                                                                       05200000
ACTRC_HDR_VRSCHANGE           DS  C      VRSCHANGE:  V/I                05250000
ACTRC_HDR_VRSCHANGE_VERIFY    EQU C'V'   verify                         05300000
ACTRC_HDR_VRSCHANGE_INFO      EQU C'I'   information                    05350000
*                                                                       05400000
ACTRC_HDR_CATRETPD            DS  CL4    CATRETPD hours                 05450000
ACTRC_HDR_VRSMIN_COUNT        DS  CL10   VRSMIN minimum number of VRSs  05500000
*                                                                       05550000
ACTRC_HDR_VRSMIN_ACTION       DS  C      VRSMIN action:                 05600000
ACTRC_HDR_VRSMIN_ACTION_FAIL  EQU C'F'   fail                           05650000
ACTRC_HDR_VRSMIN_ACTION_WARN  EQU C'W'   warning                        05700000
ACTRC_HDR_VRSMIN_ACTION_INFO  EQU C'I'   information                    05750000
*                                                                       05752900
ACTRC_HDR_OPT_VRSEL           DS  C      VRSEL: N/O                @S7A 05755800
ACTRC_HDR_OPT_VRSEL_NEW       EQU C'N'   new                       @S7A 05758700
ACTRC_HDR_OPT_VRSEL_OLD       EQU C'O'   old                       @S7A 05761600
*                                                                       05764500
ACTRC_HDR_UNCATALOG           DS  C      UNCATALOG:                @S7A 05767400
ACTRC_HDR_UNCATALOG_NO        EQU C'N'   no                        @S7A 05770300
ACTRC_HDR_UNCATALOG_YES       EQU C'Y'   yes                       @S7A 05773200
ACTRC_HDR_UNCATALOG_SCRATCH   EQU C'S'   scratch volume only       @S7A 05776100
*                                                                       05779000
ACTRC_HDR_TPRACF              DS  C      TPRACF:                   @S7A 05781900
ACTRC_HDR_TPRACF_NONE         EQU C'N'   none                      @S7A 05784800
ACTRC_HDR_TPRACF_PREDEFINED   EQU C'P'   predefined profiles       @S7A 05787700
ACTRC_HDR_TPRACF_AUTOMATIC    EQU C'A'   automatic profiles        @S7A 05790600
*                                                                       05793500
ACTRC_HDR_SYSID               DS  CL8    SYSID:                    @S7A 05796400
*                                                                       05800000
ACTRC_HDR_CATSYSID            DS  C      CATSYSID:                 @LCA 05808300
ACTRC_HDR_CATSYSID_NOT_SET    EQU C'N'   not set                   @LCA 05816600
ACTRC_HDR_CATSYSID_SET        EQU C'Y'   set to 1-16 sysid's       @LCA 05824900
ACTRC_HDR_CATSYSID_SHARED     EQU C'*'   set to fully shared       @LCA 05833200
*                                                                       05834100
ACTRC_HDR_OPT_RETAINBY        DS  C      RETAINBY V/S              @LFA 05835000
ACTRC_HDR_OPT_RETAINBY_VOLUME EQU C'V'   volume                    @LFA 05835900
ACTRC_HDR_OPT_RETAINBY_SET    EQU C'S'   set                       @LFA 05836800
*                                                                       05837700
ACTRC_HDR_OPT_MOVEBY          DS  C      MOVEBY V/S                @LFA 05838600
ACTRC_HDR_OPT_MOVEBY_VOLUME   EQU C'V'   volume                    @LFA 05839500
ACTRC_HDR_OPT_MOVEBY_SET      EQU C'S'   set                       @LFA 05840400
*                                                                       05841500
ACTRC_HDR_LEN        EQU *-ACTRC_PREFIX  length of header record        05850000
*                                                                       05900000
*********************************************************************** 05950000
*  Data Set Record                                                    * 06000000
*********************************************************************** 06050000
*                                                                       06100000
ACTRC_DSN_DATA          ORG ACTRC_DATA   overlay for data set data      06150000
*                                                                       06200000
ACTRC_DSN_DSNAME              DS  CL44   data set name                  06250000
ACTRC_DSN_JOBNAME             DS  CL8    creating job name              06300000
ACTRC_DSN_VOL                 DS  CL6    volume serial number           06350000
ACTRC_DSN_DSEQ                DS  CL4    data set sequence number       06400000
ACTRC_DSN_FILESEQ             DS  CL4    physical file sequence number  06450000
ACTRC_DSN_CRDATE              DS  CL10   data set creation date         06500000
ACTRC_DSN_CRTIME              DS  CL6    data set creation time         06550000
ACTRC_DSN_LOC                 DS  CL8    volume location                06600000
ACTRC_DSN_DEST                DS  CL8    volume destination             06650000
ACTRC_DSN_SMS_MC              DS  CL8    SMS management class name      06700000
ACTRC_DSN_VRS_MV              DS  CL8    VRS management value name      06750000
*                                                                       06800000
ACTRC_DSN_CATLG               DS  C      data set catalog status        06850000
ACTRC_DSN_CATLG_YES           EQU C'Y'   cataloged                      06900000
ACTRC_DSN_CATLG_NO            EQU C'N'   not cataloged                  06950000
ACTRC_DSN_CATLG_FAILED        EQU C'F'   locate failed                  07000000
ACTRC_DSN_CATLG_UNKNOWN       EQU C'U'   current status unknown    @LCC 07050000
*                                                                       07100000
ACTRC_DSN_CYCLE               DS  CL10   primary vrs               @S7C*07115000
                                          data set cycle number    @S7C 07130000
ACTRC_DSN_2CYCLE              DS  CL10   secondary vrs             @S7A*07145000
                                          data set cycle number    @S7A 07160000
ACTRC_DSN_SUBCHAIN_DROP       DS  C      primary subchain          @S7A*07175000
                                          drop reason              @S7A 07190000
ACTRC_DSN_2SUBCHAIN_DROP      DS  C      secondary subchain        @S7A*07205000
                                          drop reason              @S7A 07220000
ACTRC_DSN_OLD_CATLG           DS  C      old catalog status        @LCA 07226000
ACTRC_DSN_NEW_CATLG           DS  C      new catalog status        @LCA 07232000
*                                                                       07238000
                              DS  CL31   reserved                  @LCC 07244000
*                                                                       07250000
ACTRC_DSN_CHANGE              DS  0CL8   changes to data set details    07300000
ACTRC_DSN_CHNG_VRS            DS  C      vital rec status:   Y/N        07341600
ACTRC_DSN_CHNG_RETDATE        DS  C      retention date:     Y/N        07383200
ACTRC_DSN_CHNG_MATCH          DS  C      matching VRS:       Y/N        07424800
ACTRC_DSN_CHNG_SUBCHAIN       DS  C      retaining Subchain: Y/N   @S7A 07466400
ACTRC_DSN_CHNG_CATALOG        DS  C      catalog status:     Y/N   @LCA 07494200
                              DS  CL3    reserved                  @LCC 07522000
*                                                                       07550000
ACTRC_DSN_OLD_VITAL           DS  C      old vital record status: Y/N   07600000
ACTRC_DSN_NEW_VITAL           DS  C      new vital record status: Y/N   07650000
*                                                                       07700000
ACTRC_DSN_DROP                DS  C      reason for non-retention:      07750000
ACTRC_DSN_DROP_WHILECATALOG   EQU C'W'   WHILECATALOG                   07800000
ACTRC_DSN_DROP_UNTILEXPIRED   EQU C'U'   UNTILEXPIRED                   07850000
ACTRC_DSN_DROP_CYCLES         EQU C'C'   cycles exceeded           @S7C 07861100
ACTRC_DSN_DROP_DAYS           EQU C'D'   days since creation       @S7A*07872200
                                          exceeded                 @S7A 07883300
ACTRC_DSN_DROP_LASTREF        EQU C'L'   days since last reference @S7A*07894400
                                          exceeded                 @S7A 07905500
ACTRC_DSN_DROP_EXTRADAYS      EQU C'X'   days since subchain start @S7A*07916600
                                          exceeded                 @S7A 07927700
ACTRC_DSN_DROP_BYDAYSCYCLE    EQU C'B'   by-days-cycles exceeded   @S7C 07938800
ACTRC_DSN_DROP_NO_MATCH       EQU C'N'   No VRS match                   07950000
ACTRC_DSN_DROP_DUP_GDG        EQU C'G'   GDG cycle; duplicate GDG       08000000
ACTRC_DSN_DROP_VOL_RELEASED   EQU C'V'   Volume released / scratch      08050000
*                                                                       08100000
ACTRC_DSN_NEW_LOC             DS  CL8    new required data set location 08150000
*                                                                       08200000
ACTRC_DSN_OLD_RETDATE         DS  CL10   old data set retention date:   08250000
ACTRC_DSN_NEW_RETDATE         DS  CL10   new data set retention date:   08300000
*                                        Format: as per DATEFORM parm.  08350000
*                                        Special date formats:          08400000
*                                        WHILECATLG                     08450000
*                                        CYCL/nnnnn                     08500000
*                                        CATRETPD                       08550000
*                                                                       08600000
ACTRC_DSN_OLD_MATCH           DS  0CL113 old matching VRS          @S7C 08650000
*                                                                       08700000
ACTRC_DSN_OLD_MTYPE           DS  C      old primary VRS type:     @S7C 08750000
ACTRC_DSN_OLD_MTYPE_DSN       EQU C'D'   data set name                  08800000
ACTRC_DSN_OLD_MTYPE_SMS       EQU C'S'   SMS mamagement class           08850000
ACTRC_DSN_OLD_MTYPE_VRS       EQU C'V'   VRS management value           08900000
ACTRC_DSN_OLD_MTYPE_MIX       EQU C'M'   DSN and VRS mgmt value         08950000
ACTRC_DSN_OLD_MTYPE_DSNSMS    EQU C'C'   DSN and SMS mgmt class         08975000
*                                                                       09000000
ACTRC_DSN_OLD_MMASK           DS  CL44   old primary VRS mask      @S7C 09014200
ACTRC_DSN_OLD_MJOB            DS  CL8    old primary VRS job name  @S7C 09028400
ACTRC_DSN_OLD_M2MASK          DS  CL8    old second. VRS mask      @S7A 09042600
ACTRC_DSN_OLD_M2JOB           DS  CL8    old second  VRS job name  @S7A 09056800
ACTRC_DSN_OLD_MNAME           DS  CL8    old primary VRS           @S7A*09071000
                                          subchain name            @S7A 09085200
ACTRC_DSN_OLD_MDATE           DS  CL10   old primary VRS           @S7A*09099400
                                          subchain start date      @S7A 09113600
ACTRC_DSN_OLD_M2NAME          DS  CL8    old second. VRS           @S7A*09127800
                                          subchain name            @S7A 09142000
ACTRC_DSN_OLD_M2DATE          DS  CL10   old second. VRS           @S7A*09156200
                                          subchain start date      @S7A 09170400
                              DS  CL8    reserved                  @S7C 09184600
*                                                                       09200000
ACTRC_DSN_NEW_MATCH           DS  0CL113 new matching VRS          @S7C 09237500
*                                                                       09275000
ACTRC_DSN_NEW_MTYPE           DS  C      old primary VRS type:     @S7C 09312500
ACTRC_DSN_NEW_MTYPE_DSN       EQU C'D'   data set name                  09350000
ACTRC_DSN_NEW_MTYPE_SMS       EQU C'S'   SMS mamagement class           09400000
ACTRC_DSN_NEW_MTYPE_VRS       EQU C'V'   VRS management value           09450000
ACTRC_DSN_NEW_MTYPE_MIX       EQU C'M'   DSN and VRS mgmt value         09500000
ACTRC_DSN_NEW_MTYPE_DSNSMS    EQU C'C'   DSN and SMS mgmt class    @01A 09519990
*                                                                       09550000
ACTRC_DSN_NEW_MMASK           DS  CL44   new primary VRS mask      @S7C 09564200
ACTRC_DSN_NEW_MJOB            DS  CL8    new primary VRS job name  @S7C 09578400
ACTRC_DSN_NEW_M2MASK          DS  CL8    new second. VRS mask      @S7A 09592600
ACTRC_DSN_NEW_M2JOB           DS  CL8    new second  VRS job name  @S7A 09606800
ACTRC_DSN_NEW_MNAME           DS  CL8    new primary VRS           @S7A*09621000
                                          subchain name            @S7A 09635200
ACTRC_DSN_NEW_MDATE           DS  CL10   new primary VRS           @S7A*09649400
                                          subchain start date      @S7A 09663600
ACTRC_DSN_NEW_M2NAME          DS  CL8    new second. VRS           @S7A*09677800
                                          subchain name            @S7A 09692000
ACTRC_DSN_NEW_M2DATE          DS  CL10   new second. VRS           @S7A*09706200
                                          subchain start date      @S7A 09720400
                              DS  CL8    reserved                  @S7C 09734600
*                                                                       09750000
ACTRC_DSN_LENGTH    EQU *-ACTRC_PREFIX   length of data set record      09800000
*                                                                       09850000
*********************************************************************** 09900000
*  Volume Record                                                      * 09950000
*********************************************************************** 10000000
*                                                                       10050000
ACTRC_VOL_DATA      ORG ACTRC_DATA       overlay for volume data        10100000
ACTRC_VOL_LEN       EQU *-ACTRC_PREFIX   length of volume record        10150000
*                                                                       10200000
*********************************************************************** 10250000
*  End of ACTRC assembler mapping                                     * 10300000
*********************************************************************** 10350000
*                                                                       10400000
                    ORG ,                skip past all data             10450000
ACTRC_LEN           EQU *-ACTRC_PREFIX   maximum record length          10500000
*                                                                       10550000
         POP   PRINT                                                    10600000
         MEND  , */                                                     10650000
*%EDGACTRC1:;                                                           10700000
*%IHALPUSH = '@LISTPUSH';                                               10750000
*%IHALOFF  = '@LISTOFF';                                                10800000
*%IHALPOP  = '@LISTPOP';                                                10850000
*IHALPUSH;                                                              10900000
*%IF IHALIST='YES' %THEN                                                10950000
* %GOTO EDGACTRC22;                                                     11000000
*IHALOFF;                                                               11050000
*%EDGACTRC22:; /* P L S M A P P I N G S T A R T */                      11100000
*/********************************************************************/ 11150000
*/*                                                                  */ 11200000
*/*  ACTRC: RMM ACTIVITY File Records                                */ 11250000
*/*                                                                  */ 11300000
*/********************************************************************/ 11350000
*                                                                       11400000
*DCL                                                                    11450000
*  1 ACTRC    BASED,                    ! activity record               11500000
*    2 ACTRC_RDW   BDY(WORD),           ! record descriptor word        11550000
*      3 ACTRC_RDW_LEN     FIXED(15),   ! record descriptor - length    11600000
*      3 ACTRC_RDW_SEG     BIT(16),     ! record descriptor - segment   11650000
*                                                                       11700000
*    /****************************************************************/ 11750000
*    /*  Common record prefix                                        */ 11800000
*    /****************************************************************/ 11850000
*                                                                       11900000
*    2 ACTRC_PREFIX,                    ! common prefix                 11950000
*      3 ACTRC_PRE_TYPE    CHAR(1),     ! activity file record type     12000000
*      3 *                 CHAR(3),     ! reserved                 @S7C 12050000
*                                                                       12100000
*    2 ACTRC_DATA  BDY(WORD) UNION,     ! overlay for details areas     12150000
*                                                                       12200000
*      /**************************************************************/ 12250000
*      /*  Header Record                                             */ 12300000
*      /**************************************************************/ 12350000
*                                                                       12400000
*      3 ACTRC_HDR_DATA,                       ! header data            12450000
*        4 ACTRC_HDR_RUN_DATE        CHAR(10), ! inventory mgmt date    12500000
*        4 ACTRC_HDR_RUN_TIME        CHAR(6),  ! inventory mgmt time    12550000
*        4 ACTRC_HDR_VERIFY_DATE     CHAR(10), ! inv mgmt VERIFY date   12600000
*                                                                       12650000
*        4 ACTRC_HDR_EXEC,                     ! execution parameters   12700000
*          5 ACTRC_HDR_BACKUP        CHAR(1),  ! BACKUP: Y/N            12750000
*          5 ACTRC_HDR_DSTORE        CHAR(1),  ! DSTORE: Y/N            12800000
*          5 ACTRC_HDR_EXPROC        CHAR(1),  ! EXPROC: Y/N            12850000
*          5 ACTRC_HDR_RPTEXT        CHAR(1),  ! RPTEXT: Y/N            12900000
*          5 ACTRC_HDR_VRSEL         CHAR(1),  ! VRSEL:  Y/N            12950000
*          5 ACTRC_HDR_VERIFY        CHAR(1),  ! VERIFY: Y/N            13000000
*          5 ACTRC_HDR_DATE          CHAR(1),  ! VERIFY DATE: Y/N       13050000
*          5 ACTRC_HDR_DATEFORM      CHAR(1),  ! DATEFORM:              13100000
*          5 ACTRC_HDR_CATSYNCH      CHAR(1),  ! CATSYNCH: Y/N     @K1A 13133300
*          5 *                       CHAR(7),  ! reserved          @K1C 13166600
*                                                                       13200000
*        4 ACTRC_HDR_OPTIONS,                                           13250000
*          5 ACTRC_HDR_VRSJOBNAME    CHAR(1),  ! VRSJOBNAME:            13300000
*          5 ACTRC_HDR_VRSCHANGE     CHAR(1),  ! VRSCHANGE:             13350000
*          5 ACTRC_HDR_CATRETPD      CHAR(4),  ! CATRETPD hours         13400000
*          5 ACTRC_HDR_VRSMIN_COUNT  CHAR(10), ! VRSMIN count           13450000
*          5 ACTRC_HDR_VRSMIN_ACTION CHAR(1),  ! VRSMIN action:         13500000
*          5 ACTRC_HDR_OPT_VRSEL     CHAR(1),  ! VRSEL: New/Old    @S7A 13510000
*          5 ACTRC_HDR_UNCATALOG     CHAR(1),  ! UNCATALOG:        @S7A 13520000
*          5 ACTRC_HDR_TPRACF        CHAR(1),  ! TPRACF:           @S7A 13530000
*          5 ACTRC_HDR_SYSID         CHAR(8),  ! SYSID:            @S7A 13540000
*          5 ACTRC_HDR_CATSYSID      CHAR(1),  ! CATSYSID:         @LCA 13545000
*          5 ACTRC_HDR_OPT_RETAINBY  CHAR(1),  ! RETAINBY:         @LFA 13546600
*          5 ACTRC_HDR_OPT_MOVEBY    CHAR(1),  ! MOVEBY:           @LFA 13548200
*                                                                       13550000
*                                                                       13600000
*      /**************************************************************/ 13650000
*      /*  Data Set Record                                           */ 13700000
*      /**************************************************************/ 13750000
*                                                                       13800000
*      3 ACTRC_DSN_DATA,                       ! data set details data  13850000
*        4 ACTRC_DSN_DSNAME          CHAR(44), ! data set name          13900000
*        4 ACTRC_DSN_JOBNAME         CHAR(8),  ! creating job name      13950000
*        4 ACTRC_DSN_VOL             CHAR(6),  ! volume serial number   14000000
*        4 ACTRC_DSN_DSEQ            CHAR(4),  ! data set sequence      14050000
*        4 ACTRC_DSN_FILESEQ         CHAR(4),  ! physical file sequence 14100000
*        4 ACTRC_DSN_CRDATE          CHAR(10), ! data set creation date 14150000
*        4 ACTRC_DSN_CRTIME          CHAR(6),  ! data set creation time 14200000
*        4 ACTRC_DSN_LOC             CHAR(8),  ! volume location        14250000
*        4 ACTRC_DSN_DEST            CHAR(8),  ! volume destination     14300000
*        4 ACTRC_DSN_SMS_MC          CHAR(8),  ! SMS mgmt class name    14350000
*        4 ACTRC_DSN_VRS_MV          CHAR(8),  ! VRS mgmt value name    14400000
*        4 ACTRC_DSN_CATLG           CHAR(1),  ! data set catlg status  14432500
*        4 ACTRC_DSN_CYCLE           CHAR(10), ! primary vrs data  @S7C 14465000
*                                              !  set cycle number @S7A 14480000
*        4 ACTRC_DSN_2CYCLE          CHAR(10), ! second. vrs data  @S7A 14495000
*                                              !  set cycle number @S7A 14510000
*        4 ACTRC_DSN_SUBCHAIN_DROP   CHAR(1),  ! primary subchain  @S7A 14525000
*                                              !  drop reason      @S7A 14540000
*        4 ACTRC_DSN_2SUBCHAIN_DROP  CHAR(1),  ! second. subchain  @S7A 14555000
*                                              !  drop reason      @S7A 14570000
*        4 ACTRC_DSN_OLD_CATLG       CHAR(1),  ! old catlg status  @LCA 14577500
*        4 ACTRC_DSN_NEW_CATLG       CHAR(1),  ! new catlg status  @LCA 14585000
*        4 *                         CHAR(31), ! reserved          @LCC 14592500
*                                                                       14600000
*        4 ACTRC_DSN_CHANGE,                   ! changes to data set .. 14650000
*          5 ACTRC_DSN_CHNG_VRS      CHAR(1),  ! vital status: Y/N      14700000
*          5 ACTRC_DSN_CHNG_RETDATE  CHAR(1),  ! retention date: Y/N    14750000
*          5 ACTRC_DSN_CHNG_MATCH    CHAR(1),  ! matching VRS: Y/N      14800000
*          5 ACTRC_DSN_CHNG_SUBCHAIN CHAR(1),  ! retaining        !@S7A 14825000
*                                              !  subchain: Y/N   !@S7A 14850000
*          5 ACTRC_DSN_CHNG_CATALOG  CHAR(1),  ! cat status: Y/N  !@LCA 14866600
*          5 *                       CHAR(3),  ! reserved         !@LCC 14883200
*                                                                       14900000
*        4 ACTRC_DSN_OLD_VITAL       CHAR(1),  ! old vital status: Y/N  14950000
*        4 ACTRC_DSN_NEW_VITAL       CHAR(1),  ! new vital status: Y/N  15000000
*        4 ACTRC_DSN_DROP            CHAR(1),  ! non-retention reason   15050000
*        4 ACTRC_DSN_NEW_LOC         CHAR(8),  ! new required location  15100000
*                                                                       15150000
*        4 ACTRC_DSN_OLD_RETDATE     CHAR(10), ! old retention date:    15200000
*        4 ACTRC_DSN_NEW_RETDATE     CHAR(10), ! new retention date:    15250000
*                                              ! Format: as DATEFORM()  15300000
*                                              ! Special date formats:  15350000
*                                              ! - WHILECATLG           15400000
*                                              ! - CYCL/nnnnn           15450000
*                                              ! - CATRETPD             15500000
*                                                                       15550000
*        4 ACTRC_DSN_OLD_MATCH,                ! old matching VRS       15600000
*          5 ACTRC_DSN_OLD_MTYPE     CHAR(1),  ! old primary VRS  !@S7C 15611300
*                                              !  type:           !@S7C 15622600
*          5 ACTRC_DSN_OLD_MMASK     CHAR(44), ! old primary VRS  !@S7C 15633900
*                                              !  mask            !@S7C 15645200
*          5 ACTRC_DSN_OLD_MJOB      CHAR(8),  ! old primary VRS  !@S7C 15656500
*                                              !  job name mask   !@S7C 15667800
*          5 ACTRC_DSN_OLD_M2MASK    CHAR(8),  ! old second. VRS  !@S7A 15679100
*                                              !  mask            !@S7A 15690400
*          5 ACTRC_DSN_OLD_M2JOB     CHAR(8),  ! old second. VRS  !@S7A 15701700
*                                              !  job name mask   !@S7A 15713000
*          5 ACTRC_DSN_OLD_MNAME     CHAR(8),  ! old primary VRS  !@S7A 15724300
*                                              !  subchain NAME   !@S7A 15735600
*          5 ACTRC_DSN_OLD_MDATE     CHAR(10), ! old primary VRS  !@S7A 15746900
*                                              !  subchain start  !@S7A 15758200
*                                              !  date            !@S7A 15769500
*          5 ACTRC_DSN_OLD_M2NAME    CHAR(8),  ! old second. VRS  !@S7A 15780800
*                                              !  subchain NAME   !@S7A 15792100
*          5 ACTRC_DSN_OLD_M2DATE    CHAR(10), ! old second. VRS  !@S7A 15803400
*                                              !  subchain start  !@S7A 15814700
*                                              !  date            !@S7A 15826000
*          5 *                       CHAR(8),  ! reserved         !@S7C 15837300
*                                                                       15850000
*        4 ACTRC_DSN_NEW_MATCH,                ! new matching VRS       15900000
*          5 ACTRC_DSN_NEW_MTYPE     CHAR(1),  ! new primary VRS  !@S7C 15911300
*                                              !  type:           !@S7C 15922600
*          5 ACTRC_DSN_NEW_MMASK     CHAR(44), ! new primary VRS  !@S7C 15933900
*                                              !  mask            !@S7C 15945200
*          5 ACTRC_DSN_NEW_MJOB      CHAR(8),  ! new primary VRS  !@S7C 15956500
*                                              !  job name mask   !@S7C 15967800
*          5 ACTRC_DSN_NEW_M2MASK    CHAR(8),  ! new second. VRS  !@S7A 15979100
*                                              !  mask            !@S7A 15990400
*          5 ACTRC_DSN_NEW_M2JOB     CHAR(8),  ! new second. VRS  !@S7A 16001700
*                                              !  job name mask   !@S7A 16013000
*          5 ACTRC_DSN_NEW_MNAME     CHAR(8),  ! new primary VRS  !@S7A 16024300
*                                              !  subchain NAME   !@S7A 16035600
*          5 ACTRC_DSN_NEW_MDATE     CHAR(10), ! new primary VRS  !@S7A 16046900
*                                              !  subchain start  !@S7A 16058200
*                                              !  date            !@S7A 16069500
*          5 ACTRC_DSN_NEW_M2NAME    CHAR(8),  ! new second. VRS  !@S7A 16080800
*                                              !  subchain NAME   !@S7A 16092100
*          5 ACTRC_DSN_NEW_M2DATE    CHAR(10), ! new second. VRS  !@S7A 16103400
*                                              !  subchain start  !@S7A 16114700
*                                              !  date            !@S7A 16126000
*          5 *                       CHAR(8),  ! reserved         !@S7C 16137300
*                                                                       16150000
*      /**************************************************************/ 16200000
*      /*  Volume Record                                             */ 16250000
*      /**************************************************************/ 16300000
*                                                                       16350000
*      3 ACTRC_VOL_DATA,                       ! volume data            16400000
*        4 *                        CHAR(0);   !                        16450000
*                                                                       16500000
*/********************************************************************/ 16550000
*/*  Constants                                                       */ 16600000
*/********************************************************************/ 16650000
*                                                                       16700000
*DCL                                                                    16750000
*  ACTRC_PRE_TYPE_HDR            CHAR(1)  CONSTANT('H'),                16800000
*  ACTRC_PRE_TYPE_DSN            CHAR(1)  CONSTANT('D'),                16850000
*  ACTRC_PRE_TYPE_VOL            CHAR(1)  CONSTANT('V'),                16900000
*                                                                       16950000
*  ACTRC_HDR_VRSJOBNAME_FIRST    CHAR(1)  CONSTANT('1'),                17000000
*  ACTRC_HDR_VRSJOBNAME_SECOND   CHAR(1)  CONSTANT('2'),                17050000
*                                                                       17100000
*  ACTRC_HDR_OPT_VRSEL_NEW       CHAR(1)  CONSTANT('N'),          !@S7A 17104100
*  ACTRC_HDR_OPT_VRSEL_OLD       CHAR(1)  CONSTANT('O'),          !@S7A 17108200
*                                                                       17112300
*  ACTRC_HDR_UNCATALOG_NO        CHAR(1)  CONSTANT('N'),          !@S7A 17116400
*  ACTRC_HDR_UNCATALOG_YES       CHAR(1)  CONSTANT('Y'),          !@S7A 17120500
*  ACTRC_HDR_UNCATALOG_SCRATCH   CHAR(1)  CONSTANT('S'),          !@S7A 17124600
*                                                                       17128700
*  ACTRC_HDR_TPRACF_NONE         CHAR(1)  CONSTANT('N'),          !@S7A 17132800
*  ACTRC_HDR_TPRACF_PREDEFINED   CHAR(1)  CONSTANT('P'),          !@S7A 17136900
*  ACTRC_HDR_TPRACF_AUTOMATIC    CHAR(1)  CONSTANT('A'),          !@S7A 17141000
*                                                                       17145100
*  ACTRC_HDR_CATSYSID_NOT_SET    CHAR(1)  CONSTANT('N'),          !@LCA 17146000
*  ACTRC_HDR_CATSYSID_SET        CHAR(1)  CONSTANT('Y'),          !@LCA 17146900
*  ACTRC_HDR_CATSYSID_SHARED     CHAR(1)  CONSTANT('*'),          !@LCA 17147800
*                                                                       17148700
*  ACTRC_HDR_OPT_RETAINBY_VOLUME CHAR(1)  CONSTANT('V'),          !@LFA 17148800
*  ACTRC_HDR_OPT_RETAINBY_SET    CHAR(1)  CONSTANT('S'),          !@LFA 17148900
*                                                                       17149000
*  ACTRC_HDR_OPT_MOVEBY_VOLUME   CHAR(1)  CONSTANT('V'),          !@LFA 17149100
*  ACTRC_HDR_OPT_MOVEBY_SET      CHAR(1)  CONSTANT('S'),          !@LFA 17149200
*                                                                       17149300
*  ACTRC_DSN_CATLG_YES           CHAR(1)  CONSTANT('Y'),                17150000
*  ACTRC_DSN_CATLG_NO            CHAR(1)  CONSTANT('N'),                17200000
*  ACTRC_DSN_CATLG_FAILED        CHAR(1)  CONSTANT('F'),                17250000
*  ACTRC_DSN_CATLG_UNKNOWN       CHAR(1)  CONSTANT('U'),                17300000
*                                                                       17350000
*  ACTRC_DSN_OLD_MTYPE_DSN       CHAR(1) CONSTANT('D'),           !@01A 17352990
*  ACTRC_DSN_OLD_MTYPE_SMS       CHAR(1) CONSTANT('S'),           !@01A 17355980
*  ACTRC_DSN_OLD_MTYPE_VRS       CHAR(1) CONSTANT('V'),           !@01A 17358970
*  ACTRC_DSN_OLD_MTYPE_MIX       CHAR(1) CONSTANT('M'),           !@01A 17361960
*  ACTRC_DSN_OLD_MTYPE_DSNSMS    CHAR(1) CONSTANT('C'),           !@01A 17364950
*                                                                       17367940
*  ACTRC_DSN_NEW_MTYPE_DSN       CHAR(1) CONSTANT('D'),           !@01A 17370930
*  ACTRC_DSN_NEW_MTYPE_SMS       CHAR(1) CONSTANT('S'),           !@01A 17373920
*  ACTRC_DSN_NEW_MTYPE_VRS       CHAR(1) CONSTANT('V'),           !@01A 17376910
*  ACTRC_DSN_NEW_MTYPE_MIX       CHAR(1) CONSTANT('M'),           !@01A 17379900
*  ACTRC_DSN_NEW_MTYPE_DSNSMS    CHAR(1) CONSTANT('C'),           !@01A 17382890
*                                                                       17385880
*  ACTRC_DSN_DROP_WHILECATALOG   CHAR(1)  CONSTANT('W'),                17400000
*  ACTRC_DSN_DROP_UNTILEXPIRED   CHAR(1)  CONSTANT('U'),                17450000
*  ACTRC_DSN_DROP_CYCLES         CHAR(1)  CONSTANT('C'),          !@S7C 17466600
*  ACTRC_DSN_DROP_DAYS           CHAR(1)  CONSTANT('D'),          !@S7C 17483200
*  ACTRC_DSN_DROP_LASTREF        CHAR(1)  CONSTANT('L'),          !@S7C 17499800
*  ACTRC_DSN_DROP_EXTRADAYS      CHAR(1)  CONSTANT('X'),          !@S7C 17516400
*  ACTRC_DSN_DROP_BYDAYSCYCLE    CHAR(1)  CONSTANT('B'),          !@S7C 17533000
*  ACTRC_DSN_DROP_NO_MATCH       CHAR(1)  CONSTANT('N'),                17550000
*  ACTRC_DSN_DROP_DUP_GDG        CHAR(1)  CONSTANT('G'),                17600000
*  ACTRC_DSN_DROP_VOL_RELEASED   CHAR(1)  CONSTANT('V');                17650000
*                                                                       17700000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   17750000
