* %GOTO EDGRKEXT1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
         EDGRKEXT &LIST=NO,&DSECT=YES     **                            00150000
*********************************************************************** 00200000
***                                                                  ** 00250000
***        RMM REPORT EXTRACT FILE VRS RECORD (RKEXT)                ** 00300000
***                                                                  ** 00350000
*********************************************************************** 00400000
** DFSMS/MVS 1.3.0 DFSMSrmm                                           * 00450000
**                                                                    * 00500000
**PROPRIETARY V3 STATEMENT                                            * 00536600
**LICENSED MATERIALS - PROPERTY OF IBM                                * 00573200
**"RESTRICTED MATERIALS OF IBM"                                       * 00609800
**5695-DF1                                                            * 00646400
**(C) COPYRIGHT 1979,1995  IBM CORP.                                  * 00683000
**END PROPRIETARY V3 STATEMENT                                        * 00719600
**                                                                    * 00756800
*********************************************************************** 00800000
***                                                                  ** 00850000
***                                                                  ** 00900000
***                                                                  ** 00950000
*** FUNCTION : EDGRKEXT MAPS THE RMM REPORT EXTRACT FILE VRS RECORD  ** 01000000
***                                                                  ** 01050000
*** LOCATION : N/A                                                   ** 01100000
***                                                                  ** 01150000
*** METHOD OF ACCESS:                                                ** 01200000
***            ASSEMBLER - USING ON RKEXT                            ** 01250000
***            PLAS      - %INCLUDE EDGRKEXT                         ** 01300000
***                                                                  ** 01350000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01400000
***            PLAS      - SPECIFY %IHALIST='YES' BEFORE INCLUDE     ** 01450000
***                                                                  ** 01500000
*** CHANGE ACTIVITY:                                                 ** 01550000
*** $S2=OW08149,950223,110,BDG: MACRO CREATED FOR VRS BY JOBNAME   @S2A 01600000
*** $01=OW20013,130,960417,MWW: Improve comments                @01A ** 01616600
***                             Correct errors in PLX mappings  @01A ** 01633200
*** $02=OW20699,960618,120,BG:  Change comment for RKRETNX      @02A ** 01638800
***                             Synchronize ASM and PL/X parts  @02A ** 01644400
*** $S7=OW30969,140,971217,AE : VRS Enhancements                @S7A ** 01647200
***                                                                  ** 01650000
*********************************************************************** 01700000
         PUSH  PRINT                                                    01750000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               01800000
         PRINT OFF                                                      01850000
.ASMLIST ANOP                                                           01900000
         SPACE 1                                                        01950000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02000000
         AGO   .GENSTRT                                                 02050000
.GENDSCT ANOP                                                           02100000
RKEXT    DSECT                                                          02150000
.GENSTRT ANOP                                                           02200000
*********************************************************************   02206200
* RKEXT:    This macro maps the information produced for VRS        *   02212400
*           records in the RMM report extract file.                 *   02218600
*           In this record the date format depends on the DATEFORM  *   02224800
*           selected by EDGHSKP execution parameter or the parmlib  *   02231000
*           specified value.                                        *   02237200
*********************************************************************   02243400
*                                                                       02250000
RKTYPE   DS    C                   RECORD TYPE - C'K'                   02300000
RKTYPE2  DS    C                   VRS TYPE. ONE OF:                    02350000
RKTYPVOL EQU   C'V'                VOLUME VRS C'V'                      02400000
RKTYPDSN EQU   C'D'                DATA SET VRS C'D'                    02450000
RKTYPNAM EQU   C'N'                NAME VRS C'N'                        02500000
         DS    C                   RESERVED                             02550000
RKDSNAME DS    CL44                DATA SET NAME MASK                   02600000
         ORG   RKDSNAME                                                 02850000
RKNAME   DS    CL8                 VRS NAME                             02900000
         ORG   RKDSNAME                                                 02950000
RKVOLSER DS    CL6                 VOLUME SERIAL MASK                   03000000
         ORG   *+38                                                     03100000
RKGENKEY DS    C                   DATA SET/VOLUME MASK CONTAINS        03140700
*                                  GENERIC CHARACTERS Y-YES, N-NO       03181400
*********************************************************************   03222100
*  Start of common fields:                                          *   03262800
*  The common fields are in the same place in each record type      *   03303500
*  in the report extract file.  This allows common processing of    *   03344200
*  these field across multiple record types.                        *   03384900
*********************************************************************   03425600
RKCRDATE DS    CL10                CREATE DATE of VRS record            03466300
RKCRTIME DS    CL6                 CREATE TIME (HHMMSS) of VRS record   03507000
RKCRSID  DS    CL8                 CREATE SYSTEM ID of VRS record       03547700
RKLCDATE DS    CL10                LAST CHANGE DATE of VRS record       03588400
RKLCTIME DS    CL6                 LAST CHANGE TIME (HHMMSS) of VRS     03629100
*                                  record                               03669800
RKLCUID  DS    CL8                 LAST CHANGE USER ID of VRS record    03710500
RKLCSID  DS    CL8                 LAST CHANGE SYSTEM ID of VRS record  03751200
*********************************************************************   03791900
*  End of common fields                                             *   03832600
*********************************************************************   03873300
RKCRTJBN DS    CL8                 JOBNAME MASK                         03914000
RKRETNC  DS    C                   RETAIN BASED ON                      03954700
*                                        NUMBER OF CYCLES Y/N           03995400
RKRETND  DS    C                   RETAIN BASED ON NUMBER OF            04036100
*                                        ELAPSED DAYS Y/N               04076800
RKRETNR  DS    C                   RETAIN BASED ON NUMBER OF            04117500
*                                        DAYS UNREFERENCED Y/N          04158200
RKRETNW  DS    C                   RETAIN ONLY WHILE DATA SET           04198900
*                                        IS CATALOGED Y/N               04239600
RKRETNX  DS    C                   RETAIN UNTIL EXPIRED Y/N             04280300
RKRETNXD DS    C                   RETAIN BASED ON EXTRA DAYS      @S7A 04289300
*                                   SINCE VRS MATCHED   Y/N        @S7A 04298300
RKRETNCD DS    C                   RETAIN BASED ON BYDAYSCYCLE     @S7A 04307300
*                                        ALL COPIES ON 1 DAY ARE   @S7A 04316300
*                                        TREATED AS 1 CYCLE Y/N    @S7A 04325300
RKRETAND DS    C                   RETENTION MUST BE ANDED WITH THE@S7A 04334300
*                                        NEXT VRS IN THE CHAIN Y/N @S7A 04343300
         DS    CL5                 RESERVED                        @S7C 04352300
RKDSNG   DS    C                   DATA SET NAME MASK IS FOR A GDG:     04361700
*                                  Y=GDG, P=PSEUDO-GDG ,N=NOGDG         04402400
RKLOCTYP DS    C                   LOCATION TYPE. ONE OF:               04443100
*                                  A-AUTO, M-MANUAL, S-STORE            04483800
*                                  OR BLANK                             04524500
RKLOC    DS    CL8                 NAME OF LOCATION TO BE STORED        04565200
*                                  ONE OF: HOME, STORAGE LOCATION,      04605900
*                                  OR SMS-DEFINED LIBRARY NAME          04646600
RKNEXT   DS    CL8                 NAME OF NEXT VRS IN THE CHAIN        04687300
RKCOUNT  DS    CL5                 VITAL RECORD COUNT                   04728000
*                                  (NUMBER OF CYCLES OR ELAPSED         04768700
*                                  DAYS OR VOLUMES TO BE KEPT IN        04809400
*                                  TOTAL)                               04850100
RKSTNUM  DS    CL5                 STORE KEEP NUMBER                    04890800
*                                  (NUMBER OF CYCLES OR                 04931500
*                                  DAYS OR VOLUMES TO BE KEPT IN        04972200
*                                  STORE)                               05012900
RKDELAY  DS    CL5                 NUMBER OF ELAPSED DAYS DELAY         05053600
*                                  BEFORE BEING SELECTED FOR THE        05094300
*                                  FIRST LOCATION                       05135000
RKOWNER  DS    CL8                 VITAL RECORD OWNER                   05175700
RKDELDAT DS    CL10                DATE THE VRS IS TO BE DELETED BY RMM 05216400
RKDESC   DS    CL30                DESCRIPTION                          05257100
RKRELOPT DS    0CL8                VRS RELEASE OPTIONS             @S7A 05265600
RKRELIXD DS    C                   IGNORE EXPDT      Y/N           @S7A 05274100
RKRELSI  DS    C                   SCRATCH IMMEDIATE Y/N           @S7A 05282600
         DS    CL6                 RESERVED                        @S7A 05291100
*                                                                       05300000
* END OF REPORT EXTRACT VRS RECORD                                      05350000
*                                                                       05400000
RKRCEND  DS    0C                  END OF RKEXT                         05450000
RKRCLNG  EQU   RKRCEND-RKEXT       MAX LENGTH OF RKEXT                  05500000
         POP   PRINT                                                    05700000
         MEND  , */                                                     05750000
*                                                                       05775000
*%EDGRKEXT1:;                                                           05800000
*%IHALPUSH = '@LISTPUSH';                                               05850000
*%IHALOFF  = '@LISTOFF';                                                05900000
*%IHALPOP  = '@LISTPOP';                                                05950000
*IHALPUSH;                                                              06000000
*%IF IHALIST='YES' %THEN                                                06050000
* %GOTO EDGRKEXT6;                                                      06100000
*IHALOFF;                                                               06150000
*%EDGRKEXT6:;                                                           06176200
*@EJECT;                                                                06202400
*/*   RMM REPORT EXTRACT FILE VRS RECORD */                             06228600
*DECLARE                                                                06254800
*  1 RKEXT BASED,               /* START OF STRUCTURE               */  06281000
*/*******************************************************************   06307600
* RKEXT:    This macro maps the information produced for VRS        *   06336400
*           records in the RMM report extract file.                 *   06365200
*           In this record the date format depends on the DATEFORM  *   06394000
*           selected by EDGHSKP execution parameter or the parmlib  *   06422800
*           specified value.                                        *   06451600
*********************************************************************/  06480400
*    2 RKTYPE CHAR(1),          /* RECORD TYPE C'K'                 */  06509200
*    2 RKTYPE2 CHAR(1),         /* VRS TYPE: ONE OF:                    06538000
*                                    V - VOLUME, D - DATA SET,          06566800
*                                    N - NAME                       */  06595600
*    2 *       CHAR(1),         /* RESERVED                         */  06624400
*    2 RKDSNAME CHAR(44),       /* DATA SET NAME MASK               */  06653200
*      3 RKNAME   CHAR(8),      /* VRS NAME                         */  06682000
*        4 RKVOLSER CHAR(6),    /* VOLUME SERIAL MASK               */  06710800
*    2 RKGENKEY CHAR(1),        /* DATA SET/VOLUME MASK CONTAINS        06739600
*                                  GENERIC CHARACTERS Y-YES, N-NO   */  06768400
*/*******************************************************************   06797200
*  Start of common fields:                                          *   06826000
*  The common fields are in the same place in each record type      *   06854800
*  in the report extract file.  This allows common processing of    *   06883600
*  these field across multiple record types.                        *   06912400
*********************************************************************/  06941200
*    2 RKCRDATE CHAR(10),       /* CREATE DATE of VRS record        */  06970000
*    2 RKCRTIME CHAR(6),        /* CREATE TIME of VRS record        */  06998800
*    2 RKCRSID CHAR(8),         /* CREATE SYSTEM ID of VRS record   */  07027600
*    2 RKLCDATE CHAR(10),       /* LAST CHANGE DATE of VRS record   */  07056400
*    2 RKLCTIME CHAR(6),        /* LAST CHANGE TIME (HHMMSST) of VRS    07085200
*                                  record                           */  07114000
*    2 RKLCUID CHAR(8),         /* LAST CHANGE USER ID of VRS record*/  07142800
*    2 RKLCSID CHAR(8),         /* LAST CHANGE SYSTEM ID of VRS rec */  07171600
*/*******************************************************************   07200400
*  End of common fields                                             *   07229200
*********************************************************************/  07258000
*    2 RKCRTJBN CHAR(8),        /* JOBNAME MASK                     */  07280600
*    2 RKRETNC  CHAR(1),        /* RETAIN BASED ON                      07303200
*                                        NUMBER OF CYCLES Y/N       */  07325800
*    2 RKRETND  CHAR(1),        /* RETAIN BASED ON                      07348400
*                                        NUMBER OF DAYS Y/N         */  07371000
*    2 RKRETNR  CHAR(1),        /* RETAIN BASED ON NUMBER OF            07393600
*                                  DAYS UNREFERENCED Y/N            */  07416200
*    2 RKRETNW  CHAR(1),        /* RETAIN WHILE DATA SET IS             07438800
*                                   CATALOGED Y/N                   */  07461400
*    2 RKRETNX  CHAR(1),        /* RETAIN UNTIL EXPIRED Y/N         */  07484000
*    2 RKRETNXD CHAR(1),        /* RETAIN BASED ON EXTRA DAYS   @S7A    07489000
*                                   SINCE VRS MATCHED   Y/N     @S7A*/  07494000
*    2 RKRETNCD CHAR(1),        /* RETAIN BASED ON BYDAYSCYCLE  @S7A    07499000
*                                     ALL COPIES ON 1 DAY ARE   @S7A    07504000
*                                     TREATED AS 1 CYCLE Y/N    @S7A*/  07509000
*    2 RKRETAND CHAR(1),        /* RETENTION MUST BE ANDED WITH THE     07514000
*                                     NEXT VRS IN THE CHAIN Y/N @S7A*/  07519000
*    2 *        CHAR(5),        /* RESERVED                     @S7C*/  07524000
*    2 RKDSNG   CHAR(1),        /* DATA SET NAME MASK IS FOR A GDG:     07529200
*                                  Y=GDG, P=PSEUDO-GDG ,N=NOGDG     */  07551800
*    2 RKLOCTYP CHAR(1),        /* LOCATION TYPE. ONE OF:               07574400
*                                  A-AUTO, M-MANUAL, S-STORE OR         07597000
*                                  BLANK                            */  07619600
*    2 RKLOC    CHAR(8),        /* NAME OF LOCATION TO BE STORED        07642200
*                                  ONE OF: HOME, STORAGE LOCATION,      07664800
*                                  OR SMS-DEFINED LIBRARY NAME      */  07687400
*    2 RKNEXT   CHAR(8),        /* NAME OF NEXT VRS IN THE CHAIN    */  07710000
*    2 RKCOUNT  CHAR(5),        /* VITAL RECORD COUNT                   07732600
*                                  (NUMBER OF CYCLES OR ELAPSED         07755200
*                                  DAYS OR VOLUMES TO BE KEPT IN        07777800
*                                  TOTAL)                           */  07800400
*    2 RKSTNUM  CHAR(5),        /* STORE KEEP NUMBER                    07823000
*                                  (NUMBER OF CYCLES OR                 07845600
*                                  DAYS OR VOLUMES TO BE KEPT IN        07868200
*                                  STORE)                           */  07890800
*    2 RKDELAY  CHAR(5),        /* NUMBER OF ELAPSED DAYS DELAY         07913400
*                                  BEFORE BEING SELECTED FOR THE        07936000
*                                  FIRST LOCATION                   */  07958600
*    2 RKOWNER  CHAR(8),        /* VITAL RECORD OWNER               */  07981200
*    2 RKDELDAT CHAR(10),       /* DATE THE VRS IS TO BE DELETED    */  08003800
*    2 RKDESC   CHAR(30),       /* DESCRIPTION                      */  08026400
*    2 RKRELOPT CHAR(8),        /* VRS RELEASE OPTIONS          @S7A*/  08030900
*      3 RKRELIXD CHAR(1),      /* IGNORE EXPDT      Y/N        @S7A*/  08035400
*      3 RKRELSI  CHAR(1),      /* SCRATCH IMMEDIATE Y/N        @S7A*/  08039900
*      3 *        CHAR(6),      /* RESERVED                     @S7A*/  08044400
*    2 RKRCEND  CHAR(0);        /* END OF RKEXT                     */  08049000
*                                                                       08071600
*DECLARE                                                                08094200
*    RKTYPVOL CHAR(1)           /* VOLUME VRS                       */  08116800
*            CONSTANT('V'),                                             08139400
*    RKTYPDSN CHAR(1)           /* DATASET VRS                      */  08162000
*            CONSTANT('D'),                                             08184600
*    RKTYPNAM CHAR(1)           /* NAME VRS                         */  08207200
*            CONSTANT('N'),                                             08229800
*    RKRCLNG    FIXED(16)       /* CB LENGTH                        */  08252400
*            CONSTANT(LENGTH(RKEXT));                                   08275000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   08300000
