* %GOTO EDGRREXT1; /* BILINGUAL MAPPING                                 00050000
         MACRO                                                          00100000
         EDGRREXT &LIST=NO,&DSECT=YES     **                            00150000
*********************************************************************** 00200000
***                                                                  ** 00250000
***      RMM REPORT EXTRACT FILE RACK NUMBER RECORD (RREXT)          ** 00300000
***                                                                  ** 00350000
*********************************************************************** 00400000
** DFSMS/MVS 1.1.0 DFSMSrmm                                           * 00450000
**                                                                    * 00500000
**PROPRIETARY V3 STATEMENT                                            * 00542800
**LICENSED MATERIALS - PROPERTY OF IBM                                * 00585600
**"RESTRICTED MATERIALS OF IBM"                                       * 00628400
**5695-DF1                                                            * 00671200
**(C) COPYRIGHT 1979,1993  IBM CORP.                                  * 00714000
**END PROPRIETARY V3 STATEMENT                                        * 00756800
*********************************************************************** 00800000
***                                                                  ** 00850000
***                                                                  ** 00900000
***                                                                  ** 00950000
*** FUNCTION : EDGRREXT MAPS THE RMM REPORT EXTRACT FILE RACK        ** 01000000
***            NUMBER RECORD                                         ** 01050000
***                                                                  ** 01100000
*** LOCATION : N/A                                                   ** 01150000
***                                                                  ** 01200000
*** METHOD OF ACCESS:                                                ** 01250000
***            ASSEMBLER - USING ON RREXT                            ** 01300000
***            PLAS      - %INCLUDE EDGRREXT                         ** 01350000
***                                                                  ** 01400000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 01450000
***            PLAS      - SPECIFY %IHALIST='YES' BEFORE INCLUDE     ** 01500000
***                                                                  ** 01550000
*** CHANGE ACTIVITY:                                                 ** 01600000
***            26/MAR/91    001/177178  REDUCE RECORD LENGTH   @001  ** 01650000
**      09/09/91 DSP   PRODUCT NAME CHANGE                         @RMM 01700000
*** DCR005 ,MC,110892, BILINGUAL MAINTENANCE                    @002 ** 01750000
***        ,WD,110992, correct copyright                        @003 */ 01800000
*** $04=OW06843,120,010894,WK : DELETE FIXED LEN. REPORT RECORD @04A ** 01825000
*** $05=OW15547,120,950713,WK : Add support for sample reports  @05A ** 01837500
*** $06=OW20013,130,960417,MWW: Improve comments                @06A ** 01843700
***                                                                  ** 01850000
*********************************************************************** 01900000
         PUSH  PRINT                                                    01950000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               02000000
         PRINT OFF                                                      02050000
.ASMLIST ANOP                                                           02100000
         SPACE 1                                                        02150000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              02200000
         AGO   .GENSTRT                                                 02250000
.GENDSCT ANOP                                                           02300000
RREXT    DSECT                                                          02350000
.GENSTRT ANOP                                                           02400000
*********************************************************************   02406200
* RREXT:    This macro maps the information produced for rack number*   02412400
*           records in the RMM report extract file.                 *   02418600
*           In this record the date format depends on the DATEFORM  *   02424800
*           selected by EDGHSKP execution parameter or the parmlib  *   02431000
*           specified value.                                        *   02437200
*********************************************************************   02443400
*                                                                       02450000
RRTYPE   DS    C                   RECORD TYPE - C'R'                   02453100
RRTYPE2  DS    C                   RACK RECORD ID: ONE OF:              02456200
RRTYPEE  EQU   C'E'                E - EMPTY RACK                       02459300
RRTYPEF  EQU   C'F'                F - FREE/SCRATCH RACK                02462400
RRTYPEU  EQU   C'U'                U - IN USE RACK                      02465500
         DS    CL2                 RESERVED                             02468600
RRRACK   DS    CL6                 RACK NUMBER                          02471700
RRNAME   DS    CL8                 MEDIA NAME                      @05C 02474800
RRUNIT   EQU   RRNAME,8            Old name for RRNAME field       @05A 02477900
         DS    CL30                RESERVED SO CRDATE IN SAMEPLACE      02481000
*********************************************************************   02484100
*  Start of common fields:                                          *   02487200
*  The common fields are in the same place in each record type      *   02490300
*  in the report extract file.  This allows common processing of    *   02493400
*  these field across multiple record types.                        *   02496500
*********************************************************************   02499600
RRCRDATE DS    CL10                CREATE DATE of rack record           02502700
RRCRTIME DS    CL6                 CREATE TIME (HHMMSS) of rack         02505800
*                                  record                               02508900
RRCRSID  DS    CL8                 CREATE SYSTEM ID of rack record      02512000
RRLCDATE DS    CL10                LAST CHANGE DATE of rack record      02515100
RRLCTIME DS    CL6                 LAST CHANGE TIME (HHMMSS) of rack    02518200
*                                  record                               02521300
RRLCUID  DS    CL8                 LAST CHANGE USER ID of rack          02524400
*                                  record                               02527500
RRLCSID  DS    CL8                 LAST CHANGE SYSTEM ID of rack        02530600
*                                  record                               02533700
*********************************************************************   02536800
*  End of common fields                                             *   02539900
*********************************************************************   02543000
RRVOLSER DS    CL6                 ASSIGNED VOLUME SERIAL NUMBER        02546100
*                                                                       02550000
* END OF REPORT EXTRACT RACK NUMBER RECORD                              02600000
*                                                                       03550000
RRRCEND  DS    0C                  END OF RREXT                    @001 03600000
RRRCLNG  EQU   RRRCEND-RREXT       MAX LENGTH OF RREXT                  03650000
         POP   PRINT                                                    03950000
         MEND  , */                                                     04000000
*%EDGRREXT1:;                                                           04050000
*%IHALPUSH = '@LISTPUSH';                                               04100000
*%IHALOFF  = '@LISTOFF';                                                04150000
*%IHALPOP  = '@LISTPOP';                                                04200000
*IHALPUSH;                                                              04250000
*%IF IHALIST='YES' %THEN                                                04300000
* %GOTO EDGRREXT6;                                                      04350000
*IHALOFF;                                                               04400000
*%EDGRREXT6:; /* P L S M A P P I N G S T A R T */                       04450000
*DCL                                                                    04500000
*  1 RREXT     BASED,            !                                 @04C 04526800
*/*******************************************************************   04553600
* RREXT:    This macro maps the information produced for rack number*   04580400
*           records in the RMM report extract file.                 *   04607200
*           In this record the date format depends on the DATEFORM  *   04634000
*           selected by EDGHSKP execution parameter or the parmlib  *   04660800
*           specified value.                                        *   04687600
*********************************************************************/  04714400
*    2 RRTYPE   CHAR(1),         ! RECORD TYPE - C'R'                   04741200
*    2 RRTYPE2  CHAR(1),         ! RACK RECORD ID: ONE OF:              04768000
*                                ! E - EMPTY RACK                       04794800
*                                ! F - FREE/SCRATCH RACK                04821600
*                                ! U - IN USE RACK                      04848400
*    2 *        CHAR(2),         ! RESERVED                             04875200
*    2 RRRACK   CHAR(6),         ! RACK NUMBER                          04902000
*    2 RRNAME   CHAR(8),         ! MEDIA NAME                      @05C 04928800
*      3 RRUNIT   CHAR(8),       ! Old name for RRNAME field       @05A 04955600
*    2 *        CHAR(30),        ! RESERVED SO CRDATE IN SAMEPLACE      04982400
*/*******************************************************************   05009200
*  Start of common fields:                                          *   05036000
*  The common fields are in the same place in each record type      *   05062800
*  in the report extract file.  This allows common processing of    *   05089600
*  these field across multiple record types.                        *   05116400
*********************************************************************/  05143200
*    2 RRCRDATE CHAR(10),        ! CREATE DATE of rack record           05170000
*    2 RRCRTIME CHAR(6),         ! CREATE TIME (HHMMSS) of rack         05196800
*                                ! record                               05223600
*    2 RRCRSID  CHAR(8),         ! CREATE SYSTEM ID of rack record      05250400
*    2 RRLCDATE CHAR(10),        ! LAST CHANGE DATE of rack record      05277200
*    2 RRLCTIME CHAR(6),         ! LAST CHANGE TIME (HHMMSS) of rack    05304000
*                                ! record                               05330800
*    2 RRLCUID  CHAR(8),         ! LAST CHANGE USER ID of rack          05357600
*                                ! record                               05384400
*    2 RRLCSID  CHAR(8),         ! LAST CHANGE SYSTEM ID of rack        05411200
*                                ! record                               05438000
*/*******************************************************************   05464800
*  End of common fields                                             *   05491600
*********************************************************************/  05518400
*    2 RRVOLSER CHAR(6),         ! ASSIGNED VOLUME SERIAL NUMBER        05545200
*    2 RRRCEND  CHAR(0);         ! END OF RREXT                         05572000
*DCL                                                                    05600000
*   RRTYPEE  CHAR(1) CONSTANT('E')   ,                                  05650000
*                                ! E - EMPTY RACK                       05700000
*   RRTYPEF  CHAR(1) CONSTANT('F')   ,                                  05750000
*                                ! F - FREE/SCRATCH RACK                05800000
*   RRTYPEU  CHAR(1) CONSTANT('U')   ;                                  05850000
*                                ! U - IN USE RACK                      05900000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   06050000
