* %GOTO EDGRXEXT1; /* BILINGUAL MAPPING                                 00010000
         MACRO                                                          00020000
         EDGRXEXT &LIST=NO,&DSECT=YES                                   00030000
*********************************************************************** 00040000
***                                                                  ** 00050000
***      RMM REPORT EXTRACT FILE EXTENDED EXTRACT RECORD (RXEXT)     ** 00060000
***                                                                  ** 00070000
*********************************************************************** 00080000
**  OS/390 DFSMSrmm V2R10                                             * 00099990
**                                                                    * 00109980
** PROPRIETARY V3 STATEMENT                                           * 00119970
** LICENSED MATERIALS - PROPERTY OF IBM                               * 00129960
** "RESTRICTED MATERIALS OF IBM"                                      * 00139950
** 5694-A01                                                           * 00149940
** (C) COPYRIGHT 2001 IBM CORP.                                       * 00159930
** END PROPRIETARY V3 STATEMENT                                       * 00169920
*********************************************************************** 00180000
***                                                                  ** 00190000
*** FUNCTION : EDGRXEXT MAPS THE RMM REPORT EXTRACT FILE EXTENDED    ** 00200000
***            RECORD                                                ** 00210000
***                                                                  ** 00220000
*** LOCATION : N/A                                                   ** 00230000
***                                                                  ** 00240000
*** METHOD OF ACCESS:                                                ** 00250000
***            ASSEMBLER - USING ON RXEXT                            ** 00260000
***            PLAS      - %INCLUDE EDGRXEXT                         ** 00270000
***                                                                  ** 00280000
*** LISTING  : ASSEMBLER - SPECIFY LIST=YES ON THE MACRO             ** 00290000
***            PLAS      - SPECIFY %IHALIST='YES' BEFORE INCLUDE     ** 00300000
***                                                                  ** 00310000
*** CHANGE ACTIVITY:                                                 ** 00320000
* $00=OW47651,150,010418,WS : Extended extract record              @00A 00330000
* $01=OW48921,150,010428,ZB : Creation System ID                   @01A 00334990
* $SC=OW49863,210,010410,AP : Minimal Bin Assignment               @SCA 00336980
*********************************************************************** 00340000
         PUSH  PRINT                                                    00350000
         AIF   ('&LIST' EQ 'YES').ASMLIST                               00360000
         PRINT OFF                                                      00370000
.ASMLIST ANOP                                                           00380000
         SPACE 1                                                        00390000
         AIF   ('&DSECT' EQ 'YES').GENDSCT                              00400000
         AGO   .GENSTRT                                                 00410000
.GENDSCT ANOP                                                           00420000
RXEXT    DSECT                                                          00430000
.GENSTRT ANOP                                                           00440000
*********************************************************************   00450000
* RXEXT:  The extended extract record is a combination of the       *   00467990
*         volume record and the dataset record with two additional  *   00475980
*         data elements:                                            *   00483970
*         XVMVDSNAM1   first dataset name of a volume set           *   00491960
*         XVVOLCNT     last volume sequence number of a volume set. *   00499950
*         In this record the date format depends on the DATEFORM    *   00507940
*         selected by EDGHSKP execution parameter or the parmlib    *   00515930
*         specified value.                                          *   00523920
*********************************************************************   00540000
*                                                                       00550000
RXTYPE   DS    C                   Record type - C'X'                   00567990
         DS    CL3                 Reserved                             00575980
XVVOLSER DS    CL6                 Volume serial number                 00583970
XVPVOL   DS    CL6                 Previous volume in sequence          00591960
XVNVOL   DS    CL6                 Next volume in sequence              00599950
         DS    CL6                 Reserved                             00607940
*********************************************************************   00620000
* XVMDMVID: Is a unique token assigned to every volume and every    *   00630000
*           data set in a multi-volume set.                         *   00640000
*********************************************************************   00650000
XVMDMVID DS    CL8                 Multi-dataset multi-volume id        00665990
         DS    CL12                Reserved                             00671980
*********************************************************************   00680000
*  Start of common fields:                                          *   00690000
*  The common fields are in the same place in each record type      *   00700000
*  in the report extract file.  This allows common processing of    *   00710000
*  these field across multiple record types.                        *   00720000
*********************************************************************   00730000
XVCRDATE DS    CL10                Create date of volume record         00747990
XVCRTIME DS    CL6                 Create time volume record (hhmmss)   00755980
XVCRSID  DS    CL8                 Create system id of volume record    00763970
XVLCDATE DS    CL10                Last change date of volume record    00771960
XVLCTIME DS    CL6                 Last change time of volume record    00779950
*                                  (hhmmss)                             00787940
XVLCUID  DS    CL8                 Last change user id of volume        00795930
*                                  record                               00810000
XVLCSID  DS    CL8                 Last change system id of volume      00820000
*                                  record                               00830000
*********************************************************************   00840000
*  End of common fields                                             *   00850000
*********************************************************************   00860000
XVEXPDTO DS    CL10                Expiration date  - original          00875990
XVEXPDT  DS    CL10                Expiration date  - current           00881980
XVDEN    DS    CL4                 Recording density                    00887970
XVCOMP   DS    C                   Compaction used - Y/N                00893960
XVDSNNO  DS    CL4                 Number of datasets on volume         00899950
XVTUSE   DS    CL10                Tape usage in Kbytes                 00905940
XVUSE    DS    CL4                 Volume use count                     00911930
XVLABNO1 DS    CL4                 Label no of first file               00917920
XVSTORID DS    CL8                 Current location name                00923910
*                                  one of:  SHELF,                      00929900
*                                           LOCAL,                      00935890
*                                           REMOTE,                     00941880
*                                           DISTANT,                    00947870
*                                           installation-defined store, 00953860
*                                           SMS-defined library name    00959850
XVDEST   DS    CL8                 Destination name                     00965840
*                                  one of:  SHELF,                      00971830
*                                           LOCAL,                      00977820
*                                           REMOTE,                     00983810
*                                           DISTANT,                    00989800
*                                           installation-defined store, 00995790
*                                           SMS-defined library name    01001780
*********************************************************************   01030000
* Bin Numbers: If a volume is not moving (XVTRANS=N), and is in a   *   01040000
*              storage location, XVSTBIN contains the current bin   *   01050000
*              number and XVOBIN the bin number in the previous     *   01060000
*              location.                                            *   01070000
*              If a volume is moving (XVTRANS=Y), and moving to a   *   01080000
*              storage location, XVSTBIN contains the target bin    *   01090000
*              number and XVOBIN the bin number in the source       *   01100000
*              location.                                            *   01110000
*********************************************************************   01120000
XVSTBIN  DS    CL6                 Bin number                           01139990
XVOBIN   DS    CL6                 Previous bin number                  01149980
XVSTDATE DS    CL10                Movement tracking date               01159970
XVRETDAT DS    CL10                Retention date calculated by VRS     01169960
XVLONLOC DS    CL8                 Loan location                        01179950
XVOLNLOC DS    CL8                 Previous loan location               01189940
XVLRDDAT DS    CL10                Date volume last read                01199930
XVLWTDAT DS    CL10                Date volume last written             01209920
*********************************************************************   01220000
* Assigned date and time:                                           *   01230000
*    These fields are set each time a volume changes either from    *   01240000
*    or to scratch status.                                          *   01250000
*********************************************************************   01260000
XVASDATE DS    CL10                Assigned date                        01278990
XVASTIME DS    CL6                 Assigned time (hhmmss)               01287980
XVOWNID  DS    CL8                 Volume owner userid                  01296970
XVCRUID  DS    CL8                 Creating userid                      01305960
XVCRJOB  DS    CL8                 Creating jobname                     01314950
XVSECLEV DS    CL8                 Security level - short               01323940
XVSECLNG DS    CL30                Security level - long                01332930
XVVOLSEQ DS    CL4                 Volume sequence number               01341920
XVSTATUS DS    CL8                 Volume status                        01350910
*                                  one of:     MASTER,                  01360000
*                                              USER,                    01370000
*                                              SCRATCH,                 01380000
*                                              INIT,                    01390000
*                                              ENTRY                    01400000
XVPENDRS DS    C                   Volume pending release - Y/N         01417990
XVVRS    DS    C                   Volume retained by VRS - Y/N         01425980
XVLOAN   DS    C                   Volume on loan - Y/N                 01433970
XVOPEN   DS    C                   Volume is opened - Y/N               01441960
XVOCER   DS    C                   Volume recorded by O/C/EOV - Y/N     01449950
XVDEFRET DS    C                   Parmlib default retention used       01457940
*                                  to generate the volume expdt - Y/N   01470000
XVPPTAPE DS    C                   Program product tape - Y/N           01480000
*********************************************************************   01490000
* Labels: The XVLABEL field provides information about what label   *   01500000
*         types may be written on the volume.  If BLP output has    *   01510000
*         been used, the volume may no longer match this            *   01520000
*         information.  Any BLP output beyond file 1 on a volume    *   01530000
*         is not recorded by RMM.                                   *   01540000
*********************************************************************   01550000
XVLABEL  DS    CL3                 Label type SL/AL/NL/SUL/AUL          01565990
XVBLP    DS    C                   Volume last written BLP Y/N          01571980
*********************************************************************   01580000
* Release Actions:  The following 5 fields list the actions to be   *   01590000
*              set for the volume when it is released.  These are   *   01600000
*              not the current actions.  See XVACTION for the       *   01610000
*              pending actions.                                     *   01620000
*********************************************************************   01630000
XVRETS   DS    CL8                 Return action - OWNER/SCRATCH        01647990
XVREPL   DS    C                   Replace on release - Y/N             01655980
XVINIT   DS    C                   Reinitialise - Y/N                   01663970
XVERASE  DS    C                   Security erase - Y/N                 01671960
XVNTFY   DS    C                   Notify owner - Y/N                   01679950
XVOWNAC  DS    C                   Owner access - R/U/A                 01687940
XVUSERAC DS    C                   User access - R/U                    01695930
XVVMUSE  DS    C                   VM use - Y/N                         01710000
XVMVSUSE DS    C                   MVS use - Y/N                        01720000
XVNAME   DS    CL8                 Media name                           01736990
XVUNIT   EQU   XVNAME,8            Old name for XVNAME field            01743980
XVRACK   DS    CL6                 Rack number                          01750970
XVTRERR  DS    CL4                 Temporary read errors                01757960
XVTWERR  DS    CL4                 Temporary write errors               01764950
XVPRERR  DS    CL4                 Permanent read errors                01771940
XVPWERR  DS    CL4                 Permanent write errors               01778930
*********************************************************************   01790000
* Product Information: Includes number, release and feature code    *   01800000
*********************************************************************   01810000
XVPPNUM  DS    CL8                 Program product number               01827990
XVVER    DS    CL6                 Version/release/mod number           01835980
XVFEAT   DS    CL4                 Feature code                         01843970
XVACCINF DS    CL40                Accounting information               01851960
XVUSEFLD DS    CL30                User description                     01859950
XVACCLST DS    CL3                 Number of access list entries        01867940
XVAUTIDS DS    CL96                Authorised user ids area             01875930
XVHLOC   DS    CL8                 home location name                   01890000
XVTRANS  DS    C                   Volume in transit - Y/N              01906990
XVLOCTYP DS    C                   Location type                        01913980
*                                  one of:  A-AUTO,                     01920970
*                                           M-MANUAL,                   01927960
*                                           S-STORE,                    01934950
*                                           blank                       01941940
XVDESTYP DS    C                   Destination type                     01948930
*                                  one of:  A-AUTO,                     01955920
*                                           M-MANUAL,                   01962910
*                                           S-STORE,                    01969900
*                                           blank                       01976890
XVOLOC   DS    CL8                 The previous location name           01983880
XVSGNAME DS    CL8                 Storage group name                   01990870
XVMEDREC DS    CL8                 Volume recording format              01997860
*                                  one of:  18TRACK,                    02004850
*                                           36TRACK,                    02011840
*                                           128TRACK,                   02018830
*                                           256TRACK                    02025820
XVMEDTY  DS    CL8                 Volume media type                    02032810
*                                  one of:  *,                          02039800
*                                           CST,                        02046790
*                                           ECCST,                      02053780
*                                           HPCT,                       02060770
*                                           EHPCT                       02067760
XVMEDCMP DS    CL8                 Compaction technique                 02074750
*                                  one of:  *,                          02081740
*                                           NONE,                       02088730
*                                           YES                         02095720
XVMEDATR DS    CL8                 Special attributes - NONE/RDCOMPAT   02102710
XVDSNAM1 DS    CL44                First file data set name             02109700
XVMVMODE DS    C                   Move mode - A-AUTOMOVE/M-MANUALMOVE  02116690
XVDSNREC DS    CL1                 Ds recording - Y/N                   02123680
XVALVERS DS    CL2                 ANSI label versions                  02150000
XVALCUR  EQU   XVALVERS,1          Current  label version               02160000
*                                  one of blank, 1,3, or 4.             02170000
XVALREQ  EQU   XVALVERS+1,1        Required label version               02180000
*                                  one of blank, 3, or 4.               02190000
XVBMEDN  DS    CL8                 Bin media name                       02206990
XVOBMEDN DS    CL8                 Previous bin media name              02213980
XVNLOC   DS    CL8                 Required location name - as          02220970
*                                  determined by VRS or command         02230000
XVLUDEV  DS    CL4                 Last used drive                      02240000
*********************************************************************   02250000
* Pending Actions:  The following fields list the actions required  *   02260000
*              for the volume.  See XVRETS for the actions set      *   02270000
*              when the volume is released.                         *   02280000
*********************************************************************   02290000
XVACTION DS    0CL8                                                     02307990
XVACTSCR DS    CL1                 Pending action:return to scratch Y/N 02315980
XVACTREP DS    CL1                 Pending action: replace volume   Y/N 02323970
XVACTRET DS    CL1                 Pending action: return to owner  Y/N 02331960
XVACTINI DS    CL1                 Pending action: initialize       Y/N 02339950
XVACTERA DS    CL1                 Pending action: erase            Y/N 02347940
XVACTNOT DS    CL1                 Pending action: notify           Y/N 02355930
XVACTRSV DS    CL2                 Reserved                             02363920
XVABEND  DS    CL1                 Data set closed by abend - Y/N       02371910
XVHOMTYP DS    CL1                 Home location type                   02379900
*                                  one of:  A-AUTO,                     02387890
*                                           M-MANUAL,                   02395880
*                                           blank                       02403870
XVNEXTYP DS    CL1                 Next location type                   02411860
*                                  one of:  A-AUTO,                     02419850
*                                           M-MANUAL,                   02427840
*                                           S-STORE,                    02435830
*                                           blank                       02443820
XVVOLTYPE DS    CL1                Volume type                          02451810
XVVOLTYPE_LOGICAL  EQU C'L',1,C'C'                                      02459800
XVVOLTYPE_PHYSICAL EQU C'P',1,C'C'                                      02467790
XVVOLTYPE_STACKED  EQU C'S',1,C'C'                                      02475780
*                                                                       02500000
XVVRSREL DS    0CL8                VRS release options                  02510000
XVRELIXD DS    CL1                 Ignore expdt      Y/N                02527990
XVRELSI  DS    CL1                 Scratch immediate Y/N                02535980
XVRELRSV DS    CL6                 Reserved                             02543970
XVCONTNR DS    CL16                In container name                    02551960
XVRQPRTY DS    CL4                 Movement priority                    02559950
XVCAPACITY DS  CL10                Volume capacity in Mbytes            02567940
XVRBYSET DS    C                   Volume retained by set - Y/N         02575930
XVSTACKVOL_ENABLED DS C            Stacked volume record enabled        02583920
*                                  and synchronized.                    02600000
XVEXPTOKEN         DS CL8          Export token                         02612990
*                                  Unique value created at start        02615980
*                                  of export to a new stacked           02620000
*                                  volume. All volumes in a stacked     02637990
*                                  volume have the same unique value    02645980
XVSTACKED_VOLCOUNT DS CL10         Count of volumes stacked on a        02653970
*                                  volume. Maintained if stacked        02661960
*                                  volume fully enabled.                02670000
XVPERCENT DS   CL3                 Volume percentage full               02682990
*********************************************************************   02687060
*        END OF VOLUME PART                                             02687150
*********************************************************************   02687240
*                                                                       02687330
         DS CL5                    Reserved for XVDSNNO            @SCC 02687420
         DS CL5                    Reserved for XVLABNO1           @SCA 02687510
XVDCRSID DS    CL8                 First file creation system ID   @01A 02687960
         DS    CL1                 Reserved                        @01C 02688950
*********************************************************************   02690000
*        END OF VOLUME PART                                             02700000
*********************************************************************   02710000
XVVOLCNT DS CL4                    Last volume sequence number          02729990
*                                  of a volume set                      02750000
*********************************************************************   02760000
*        START OF DATASET PART                                          02770000
*********************************************************************   02780000
         DS    CL4                 Reserved                             02795990
XDDSNAME DS    CL44                Data set name                        02801980
*********************************************************************   02810000
*  Start of common fields:                                          *   02820000
*  The common fields are in the same place in each record type      *   02830000
*  in the report extract file.  This allows common processing of    *   02840000
*  these field across multiple record types.                        *   02850000
*********************************************************************   02860000
XDCRDATE DS    CL10                Create date of data set record       02877990
XDCRTIME DS    CL6                 Create time (hhmmss) of data set     02885980
XDCRSID  DS    CL8                 Create system id of data set record  02893970
XDLCDATE DS    CL10                Last change date of data set record  02901960
XDLCTIME DS    CL6                 Last change time (hhmmss) of         02909950
*                                  data set record                      02920000
XDLCUID  DS    CL8                 Last change user id of data set      02930000
*                                  record                               02940000
XDLCSID  DS    CL8                 Last change system id of data set    02950000
*                                  record                               02960000
*********************************************************************   02970000
*  End of common fields                                             *   02980000
*********************************************************************   02990000
         DS    CL6                 Reserved                             03008990
XDDSNSEQ DS    CL4                 Data set sequence number             03017980
XDUNITAD DS    CL4                 Creating drive address               03026970
XDRECFM  DS    CL4                 Record format                        03035960
XDVOLSEQ DS    CL4                 Volume sequence number               03044950
XDLRECL  DS    CL6                 Logical record length                03053940
XDBLKSZ  DS    CL6                 Physical block size                  03062930
XDBLKCNT DS    CL8                 Block count                          03071920
XDOWNDSN DS    CL8                 Data set owner                       03080910
XDSECLEV DS    CL8                 Security level - short               03089900
XDSECLNG DS    CL30                Security level - long                03098890
XDCOMP   DS    C                   Compaction used - Y/N                03107880
XDLRDDAT DS    CL10                Date data set last read              03116870
XDLWTDAT DS    CL10                Date data set last written           03125860
XDMCNAME DS    CL8                 SMS management class                 03140000
XDVRSVAL DS    CL8                 VRS management value                 03150000
XDSGNAME DS    CL8                 SMS storage group name               03160000
XDSCNAME DS    CL8                 SMS storage class name               03170000
XDDCNAME DS    CL8                 SMS data class name                  03180000
XDCRTJBN DS    CL8                 Creating job name                    03196990
XDVRSTYP DS    CL1                 Matching VRS type                    03203980
*                                  one of:  D-dataset,                  03210970
*                                           S-smsmc,                    03217960
*                                           V-vrsmv,                    03224950
*                                           M-dataset and vrsmv         03231940
*                                           C-dataset and smsmc         03238930
XDVRSNAM DS    CL44                Matching VRS name                    03245920
XDVRSJBN DS    CL8                 Matching VRS job name mask           03252910
XDRETDAT DS    CL10                Retention date                       03259900
XDSTEPNM DS    CL8                 Creating step name                   03266890
XDDDNAME DS    CL8                 Creating DD name                     03273880
         DS    CL8                 Reserved                             03280870
*********************************************************************   03300000
* Data set size:  This is calculated by multiplying the blocksize   *   03310000
*                 with the number of blocks.                        *   03320000
*********************************************************************   03330000
XDDSSIZE DS    CL10                Approx. size of file Kbytes          03345990
XDABEND  DS    CL1                 Dset closed by abend   Y/N           03351980
*********************************************************************   03360000
* XDCAT: Set to 'Y' when opened after allocation determines VOLSER  *   03370000
*        by reference to the catalog. Once set to 'Y' it is never   *   03380000
*        changed.                                                   *   03390000
*********************************************************************   03400000
XDCAT    DS    CL1                 Dset used via catalog  Y/N           03417990
XDVRSR   DS    CL1                 Retained by VRS        Y/N           03425980
XDRSVMW1 DS    CL3                 Reserved                             03433970
XDLABNO  DS    CL4                 Label number label=(xx,ll)           03441960
*********************************************************************   03450000
* Primary VRS subchain name:                                        *   03460000
*                     This is the retaining VRS in the matching     *   03470000
*                     primary VRS chain.  It is set only if retained*   03480000
*                     by a NAME VRS subchain in the primary VRS.    *   03490000
*********************************************************************   03500000
XDVRSSCH DS    CL8                 Primary VRS subchain name            03515990
XDVRSXDS DS    CL10                Primary VRS subchain start date      03521980
*********************************************************************   03530000
* Retaining Secondary VRS name:                                     *   03540000
*                     Matching VRS name and job name are included   *   03550000
*                     where a secondary VRS also matches.           *   03560000
*                     The retaining VRS subchain NAME in this       *   03570000
*                     matching VRS is set if it is used to retain   *   03580000
*                     the data set.                                 *   03590000
*********************************************************************   03600000
XD2VNME  DS    CL8                 Secondary VRS name mask              03617990
XD2VJBN  DS    CL8                 Secondary VRS jobname mask           03625980
XD2VSCH  DS    CL8                 Secondary VRS subchain name          03633970
XD2VXDS  DS    CL10                Secondary VRS subchain startdate     03641960
XDTOTAL_BLKCNT DS CL10             Total block count across this        03649950
*                                    and previous volumes               03660000
XDPERCENT DS   CL3                 Percentage of volume used by         03670000
*                                                       data set        03680000
XDCPGM   DS    CL8                 Creating program name                03697990
XDLPGM   DS    CL8                 Last used program name               03705980
XDLJOB   DS    CL8                 Last use job name                    03713970
XDLSTEP  DS    CL8                 Last use step name                   03721960
XDLDDNM  DS    CL8                 Last use DD name                     03729950
XDLDEVN  DS    CL4                 Last use device number               03737940
*********************************************************************   03750000
*        End of data set part                                           03760000
*********************************************************************   03770000
*                                                                       03780000
XVMVDSNAM1 DS  CL44                First dsname of a volume set         03790000
*                                                                       03800000
*********************************************************************   03811990
*        Start of mixed data area                                       03813980
*********************************************************************   03815970
XDRES1          DS  CL5            Reserved for XDDSNSEQ           @SCA 03818650
XDRES2          DS  CL5            Reserved for XDLABNO            @SCA 03819340
XvDestBin       DS  CL6            Destination Bin number          @SCA 03820030
XvDestBinMedia  DS  CL8            Destination Bin Media name      @SCA 03820720
*                                                                       03821940
RXRCEND  DS    0C                  End of RXEXT                         03823930
RXRCLNG  EQU   RXRCEND-RXEXT       Length of RXEXT                      03825920
         POP   PRINT                                                    03830000
         MEND  , */                                                     03840000
*%EDGRXEXT1:;                                                           03850000
*%IHALPUSH = '@LISTPUSH';                                               03860000
*%IHALOFF  = '@LISTOFF';                                                03870000
*%IHALPOP  = '@LISTPOP';                                                03880000
*IHALPUSH;                                                              03890000
*%IF IHALIST='YES' %THEN                                                03900000
* %GOTO EDGRXEXT7;                                                      03910000
*IHALOFF;                                                               03920000
*%EDGRXEXT7:; /* P L S M A P P I N G S T A R T */                       03930000
*DCL                                                                    03940000
*  1 RXEXT    BASED,             !                                      03950000
*/*******************************************************************   03960000
* RXEXT:  The extended extract record is a combination of the       *   03972990
*         volume record and the dataset record with two additional  *   03975980
*         data elements:                                            *   03978970
*         XVMVDSNAM1  first dataset name of the volume set          *   03981960
*         XVVOLCNT    last volume sequence number of the volume set *   03984950
*         In this record the date format depends on the DATEFORM    *   03987940
*         selected by EDGHSKP execution parameter or the parmlib    *   03990930
*         specified value.                                          *   03993920
*                                                                   *   03996910
*   The PL/X structure is divided into 5 parts on structure level 2:*   03999900
*                                                                   *   04002890
*   2 XVEXT1      volume section 1: same as RVEXT1 in RVEXT         *   04005880
*                 (796 bytes)                                       *   04008870
*   2 XVVOLCNT    generated data element for X record               *   04011860
*   2 XDEXT1      dataset section 1: same as RDEXT1 in RDEXT        *   04014850
*                 (477 bytes)                                       *   04017840
*   2 XVMVDSNAM1  generated data element for X record               *   04020830
*   2 XXMERGED    mixed data area for data elements from the sec-   *   04023820
*                 tions RVEXT2 and RDEXT2                           *   04026810
*                                                                   *   04029800
*********************************************************************/  04050000
*   2 XVEXT1       ,             ! section 1 of volume record           04066990
*    3 RXTYPE   CHAR(1),         ! Record type - C'X'                   04073980
*    3 *        CHAR(3),         ! Reserved                             04080970
*    3 XVVOLSER CHAR(6),         ! Volume serial number                 04087960
*    3 XVPVOL   CHAR(6),         ! Previous volume in sequence          04094950
*    3 XVNVOL   CHAR(6),         ! Next volume in sequence              04101940
*    3 *        CHAR(6),         ! Reserved                             04108930
*/*******************************************************************   04120000
* XVMDMVID: Is a unique token assigned to every volume and every    *   04130000
*           data set in a multi-volume set.                         *   04140000
********************************************************************/   04150000
*    3 XVMDMVID CHAR(8),         ! Multi-dataset multi-volume id        04165990
*    3 *        CHAR(12),        ! Reserved                             04171980
*/*******************************************************************   04180000
*  Start of common fields:                                          *   04190000
*  The common fields are in the same place in each record type      *   04200000
*  in the report extract file.  This allows common processing of    *   04210000
*  these field across multiple record types.                        *   04220000
*********************************************************************/  04230000
*    3 XVCRDATE CHAR(10),        ! Create date of volume record         04247990
*    3 XVCRTIME CHAR(6),         ! Create time volume record (hhmmss)   04255980
*    3 XVCRSID  CHAR(8),         ! Create system id of volume record    04263970
*    3 XVLCDATE CHAR(10),        ! Last change date of volume record    04271960
*    3 XVLCTIME CHAR(6),         ! Last change time of volume record    04279950
*                                ! (hhmmss)                             04287940
*    3 XVLCUID  CHAR(8),         ! Last change user id of volume        04295930
*                                ! record                               04310000
*    3 XVLCSID  CHAR(8),         ! Last change system id of volume      04320000
*                                ! record                               04330000
*    3 XVEXPDTO CHAR(10),        ! Expiration date - original           04345990
*    3 XVEXPDT  CHAR(10),        ! Expiration date - current            04351980
*    3 XVDEN    CHAR(4),         ! Recording density                    04357970
*    3 XVCOMP   CHAR(1),         ! Compaction used - Y/N                04363960
*    3 XVDSNNO  CHAR(4),         ! Number of datasets on volume         04369950
*    3 XVTUSE   CHAR(10),        ! Tape usage in Kbytes                 04375940
*    3 XVUSE    CHAR(4),         ! Volume use count                     04381930
*    3 XVLABNO1 CHAR(4),         ! Label no of first file               04387920
*    3 XVSTORID CHAR(8),         ! Current location name                04393910
*                                ! one of:  SHELF,                      04399900
*                                !          LOCAL,                      04405890
*                                !          REMOTE,                     04411880
*                                !          DISTANT,                    04417870
*                                !          installation-defined store, 04423860
*                                !          SMS-defined library name    04429850
*    3 XVDEST   CHAR(8),         ! Destination name                     04435840
*                                ! one of:  SHELF,                      04441830
*                                !          LOCAL,                      04447820
*                                !          REMOTE,                     04453810
*                                !          DISTANT,                    04459800
*                                !          installation-defined store, 04465790
*                                !          SMS-defined library name    04471780
*/*******************************************************************   04500000
* Bin Numbers: If a volume is not moving (XVTRANS=N), and is in a   *   04510000
*              storage location, XVSTBIN contains the current bin   *   04520000
*              number and XVOBIN the bin number in the previous     *   04530000
*              location.                                            *   04540000
*              If a volume is moving (XVTRANS=Y), and moving to a   *   04550000
*              storage location, Xvstbin contains the target bin    *   04560000
*              number and XVOBIN the bin number in the source       *   04570000
*              location.                                            *   04580000
*********************************************************************/  04590000
*    3 XVSTBIN  CHAR(6),         ! Store bin number                     04609990
*    3 XVOBIN   CHAR(6),         ! Old bin number                       04619980
*    3 XVSTDATE CHAR(10),        ! Date stored                          04629970
*    3 XVRETDAT CHAR(10),        ! Retention date calculated by VRS     04639960
*    3 XVLONLOC CHAR(8),         ! Loan location                        04649950
*    3 XVOLNLOC CHAR(8),         ! Previous loan location               04659940
*    3 XVLRDDAT CHAR(10),        ! Date volume last read                04669930
*    3 XVLWTDAT CHAR(10),        ! Date volume last written             04679920
*/*******************************************************************   04690000
* Assigned date and time:                                           *   04700000
*    These fields are set each time a volume changes either from    *   04710000
*    or to scratch status.                                          *   04720000
*********************************************************************/  04730000
*    3 XVASDATE CHAR(10),        ! Assigned date                        04748990
*    3 XVASTIME CHAR(6),         ! Assigned time (hhmmss)               04757980
*    3 XVOWNID  CHAR(8),         ! Volume owner userid                  04766970
*    3 XVCRUID  CHAR(8),         ! Creating userid                      04775960
*    3 XVCRJOB  CHAR(8),         ! Creating jobname                     04784950
*    3 XVSECLEV CHAR(8),         ! Security level - short               04793940
*    3 XVSECLNG CHAR(30),        ! Security level - long                04802930
*    3 XVVOLSEQ CHAR(4),         ! Volume sequence number               04811920
*    3 XVSTATUS CHAR(8),         ! Volume status                        04820910
*                                ! one of:     MASTER,                  04830000
*                                !             USER,                    04840000
*                                !             SCRATCH,                 04850000
*                                !             INIT,                    04860000
*                                !             ENTRY,                   04870000
*    3 XVPENDRS CHAR(1),         ! Volume pending release - Y/N         04887990
*    3 XVVRS    CHAR(1),         ! Volume retained by VRS - Y/N         04895980
*    3 XVLOAN   CHAR(1),         ! Volume on loan - Y/N                 04903970
*    3 XVOPEN   CHAR(1),         ! Volume is opened - Y/N               04911960
*    3 XVOCER   CHAR(1),         ! Volume recorded by O/C/EOV - Y/N     04919950
*    3 XVDEFRET CHAR(1),         ! Parmlib default retention used       04927940
*                                ! to generate the volume expdt - Y/N   04940000
*    3 XVPPTAPE CHAR(1),         ! Program product tape - Y/N           04950000
*/*******************************************************************   04960000
* Labels: The XVLABEL field provides information about what label   *   04970000
*         types may be written on the volume.  If BLP output has    *   04980000
*         been used, the volume may no longer match this            *   04990000
*         information.  Any BLP output beyond file 1 on a volume    *   05000000
*         is not recorded by RMM.                                   *   05010000
*********************************************************************/  05020000
*    3 XVLABEL  CHAR(3),         ! Label type SL/AL/NL/SUL/AUL          05035990
*    3 XVBLP    CHAR(1),         ! Volume last written BLP Y/N          05041980
*/*******************************************************************   05050000
* Release Actions:  The following 5 fields list the actions to be   *   05060000
*              set for the volume when it is released.  These are   *   05070000
*              not the current actions.  See XVACTION for the       *   05080000
*              pending actions.                                     *   05090000
*********************************************************************/  05100000
*    3 XVRETS   CHAR(8),         ! Return action - owner/scratch        05117990
*    3 XVREPL   CHAR(1),         ! Replace on release - Y/N             05125980
*    3 XVINIT   CHAR(1),         ! Reinitialise - Y/N                   05133970
*    3 XVERASE  CHAR(1),         ! Security erase - Y/N                 05141960
*    3 XVNTFY   CHAR(1),         ! Notify owner - Y/N                   05149950
*    3 XVOWNAC  CHAR(1),         ! Owner access - R/U/A                 05157940
*    3 XVUSERAC CHAR(1),         ! User access - R/U                    05165930
*    3 XVVMUSE  CHAR(1),         ! VM use - Y/N                         05173920
*    3 XVMVSUSE CHAR(1),         ! MVS use - Y/N                        05181910
*    3 XVNAME   CHAR(8),         ! Media name                           05189900
*     7 XVUNIT  CHAR(8),         ! Media name                           05197890
*    3 XVRACK   CHAR(6),         ! Rack number                          05205880
*    3 XVTRERR  CHAR(4),         ! Temporary read errors                05213870
*    3 XVTWERR  CHAR(4),         ! Temporary write errors               05221860
*    3 XVPRERR  CHAR(4),         ! Permanent read errors                05229850
*    3 XVPWERR  CHAR(4),         ! Permanent write errors               05237840
*/*******************************************************************   05260000
* Product Information: Includes number, release and feature code    *   05270000
*********************************************************************/  05280000
*    3 XVPPNUM  CHAR(8),         ! Program product number               05297990
*    3 XVVER    CHAR(6),         ! Version/release/mod number           05305980
*    3 XVFEAT   CHAR(4),         ! Feature code                         05313970
*    3 XVACCINF CHAR(40),        ! Accounting information               05321960
*    3 XVUSEFLD CHAR(30),        ! User description                     05329950
*    3 XVACCLST CHAR(3),         ! Number of access list entries        05337940
*    3 XVAUTIDS CHAR(96),        ! Authorised user ids area             05345930
*    3 XVHLOC   CHAR(8),         ! Home location name                   05353920
*    3 XVTRANS  CHAR(1),         ! Volume in transit - Y/N              05361910
*    3 XVLOCTYP CHAR(1),         ! Location type                        05369900
*                                ! one of:  A-auto,                     05377890
*                                !          M-manual,                   05385880
*                                !          S-store,                    05393870
*                                !          blank                       05401860
*    3 XVDESTYP CHAR(1),         ! Destination type                     05409850
*                                ! one of:  A-auto,                     05417840
*                                !          M-manual,                   05425830
*                                !          S-store,                    05433820
*                                !          blank                       05441810
*    3 XVOLOC   CHAR(8),         ! The previous location name           05449800
*    3 XVSGNAME CHAR(8),         ! Storage group name                   05457790
*    3 XVMEDREC CHAR(8),         ! Volume recording format              05465780
*                                ! one of:  *,                          05473770
*                                !          18track,                    05481760
*                                !          36track,                    05489750
*                                !          128track,                   05497740
*                                !          256track                    05505730
*    3 XVMEDTY  CHAR(8),         ! Volume media type                    05513720
*                                ! one of:  *,                          05521710
*                                !          CST,                        05529700
*                                !          ECCST,                      05537690
*                                !          HPCT,                       05545680
*                                !          EHPCT                       05553670
*    3 XVMEDCMP CHAR(8),         ! Compaction technique                 05561660
*                                ! one of:  *,                          05569650
*                                !          NONE,                       05577640
*                                !          YES                         05585630
*    3 XVMEDATR CHAR(8),         ! Special attributes - NONE/RDCOMPAT   05593620
*    3 XVDSNAM1 CHAR(44),        ! First file data set name             05601610
*    3 XVMVMODE CHAR(1),         ! Move mode - A-automove/M-manualmove  05609600
*    3 XVDSNREC CHAR(1),         ! Data set recording - Y/N             05617590
*    3 XVALVERS CHAR(2),         ! ANSI label versions                  05625580
*      5 XVALCUR CHAR(1),        ! Current  label version               05633570
*      5 XVALREQ CHAR(1),        ! Required label version               05641560
*    3 XVBMEDN  CHAR(8),         ! Bin media name                       05649550
*    3 XVOBMEDN CHAR(8),         ! Old bin media name                   05657540
*    3 XVNLOC   CHAR(8),         ! Next location name                   05665530
*    3 XVLUDEV  CHAR(4),         ! Last used drive                      05673520
*/*******************************************************************   05690000
* Pending Actions:  The following fields list the actions required  *   05700000
*              for the volume.  See XVRETS for the actions set      *   05710000
*              when the volume is released.                         *   05720000
*********************************************************************/  05730000
*    3 XVACTION CHAR(8),         !                                      05747990
*      5 XVACTSCR CHAR(1),       ! Pending action:Return to scratch Y/N 05755980
*      5 XVACTREP CHAR(1),       ! Pending action: Replace volume   Y/N 05763970
*      5 XVACTRET CHAR(1),       ! Pending action: Return to owner  Y/N 05771960
*      5 XVACTINI CHAR(1),       ! Pending action: Initialize       Y/N 05779950
*      5 XVACTERA CHAR(1),       ! Pending action: Erase            Y/N 05787940
*      5 XVACTNOT CHAR(1),       ! Pending action: Notify           Y/N 05795930
*      5 XVACTRSV CHAR(2),       ! Reserved                             05803920
*    3 XVABEND  CHAR(1),         ! Dataset closed by abend - Y/N        05811910
*    3 XVHOMTYP CHAR(1),         ! Home location type                   05819900
*                                ! one of:  A-AUTO,                     05827890
*                                !          M-MANUAL,                   05835880
*                                !          blank                       05843870
*    3 XVNEXTYP CHAR(1),         ! Next location type                   05851860
*                                ! one of:  A-AUTO,                     05859850
*                                !          M-MANUAL,                   05867840
*                                !          S-STORE,                    05875830
*                                !          blank                       05883820
*    3 XVVOLTYPE CHAR(1),        ! Volume type                          05891810
*    3 XVVRSREL CHAR(8),         ! VRS release options                  05899800
*      5 XVRELIXD CHAR(1),       ! Release option:Ignore expdt      Y/N 05907790
*      5 XVRELSI  CHAR(1),       ! Release option:Scratch immediate Y/N 05915780
*      5 XVRELRSV CHAR(6),       ! Reserved                             05923770
*    3 XVCONTNR CHAR(16),        ! In container name                    05931760
*    3 XVRQPRTY CHAR(4),         ! Movement priority                    05939750
*    3 XVCAPACITY CHAR(10),      ! Volume capacity in Mbytes            05947740
*    3 XVRBYSET CHAR(1),         ! Volume is retained by set Y/N        05955730
*    3 XVSTACKVOL_ENABLED CHAR(1), ! Stacked volume records enabled     05963720
*                                  ! and synchronized                   05990000
*    3 XVEXPTOKEN CHAR(8),         ! Export token                       06002990
*                                  ! Unique value created at start      06005980
*                                  ! of export to a new stacked         06010000
*                                  ! volume.                            06020000
*    3 XVSTACKED_VOLCOUNT CHAR(10),  ! Count of volumes stacked on      06030000
*                                    ! a volume.                        06040000
*    3 XVPERCENT CHAR(3),          ! Volume percentage full             06052990
*/*******************************************************************   06057060
*  End of volume part                                               *   06057150
*********************************************************************/  06057240
*                                                                       06057330
*    3 *         CHAR(5),          ! Reserved for RVDSNNO          @SCC 06057420
*    3 *         CHAR(5),          ! Reserved for RVLABNO1         @SCA 06057510
*    3 XVDCRSID  CHAR(8),          ! First file creation system ID @01A 06057960
*    3 *         CHAR(1),          ! Reserved                      @01C 06058950
*/*******************************************************************   06060000
*  End of volume part section 1                                     *   06070000
*********************************************************************/  06080000
*   2 XVVOLCNT CHAR(4),          ! Last volume sequence number          06099990
*                                ! of a volume set                      06120000
*/*******************************************************************   06130000
*  Start of dataset part section 1                                  *   06140000
*********************************************************************/  06150000
*   2 XDEXT1           ,         ! Data set section 1                   06169990
*    3 *        CHAR(4),         ! Reserved                             06179980
*    3 XDDSNAME CHAR(44),        ! Data set name                        06189970
*    3 XDCRDATE CHAR(10),        ! Create date of data set record       06199960
*    3 XDCRTIME CHAR(6),         ! Create time (hhmmss) of data set     06209950
*    3 XDCRSID  CHAR(8),         ! Create system id of data set record  06219940
*    3 XDLCDATE CHAR(10),        ! Last change date of data set record  06229930
*    3 XDLCTIME CHAR(6),         ! Last change time (hhmmss) of         06239920
*                                ! data set record                      06290000
*    3 XDLCUID  CHAR(8),         ! Last change user id of data set      06300000
*                                ! record                               06310000
*    3 XDLCSID  CHAR(8),         ! Last change system id of data set    06320000
*                                ! record                               06330000
*/*******************************************************************   06340000
*  End of common fields                                             *   06350000
*********************************************************************/  06360000
*    3 *        CHAR(6),         ! Reserved                             06378990
*    3 XDDSNSEQ CHAR(4),         ! Data set sequence number             06387980
*    3 XDUNITAD CHAR(4),         ! Creating drive address               06396970
*    3 XDRECFM  CHAR(4),         ! Record format                        06405960
*    3 XDVOLSEQ CHAR(4),         ! Volume sequence number               06414950
*    3 XDLRECL  CHAR(6),         ! Logical record length                06423940
*    3 XDBLKSZ  CHAR(6),         ! Physical block size                  06432930
*    3 XDBLKCNT CHAR(8),         ! Block count                          06441920
*    3 XDOWNDSN CHAR(8),         ! Dataset owner                        06450910
*    3 XDSECLEV CHAR(8),         ! Security level - short               06459900
*    3 XDSECLNG CHAR(30),        ! Security level - long                06468890
*    3 XDCOMP   CHAR(1),         ! Compaction used - Y/N                06477880
*    3 XDLRDDAT CHAR(10),        ! Date data set last read              06486870
*    3 XDLWTDAT CHAR(10),        ! Date data set last written           06495860
*    3 XDMCNAME CHAR(8),         ! SMS management class                 06504850
*    3 XDVRSVAL CHAR(8),         ! VRS management value                 06513840
*    3 XDSGNAME CHAR(8),         ! SMS storage group name               06522830
*    3 XDSCNAME CHAR(8),         ! SMS storage class name               06531820
*    3 XDDCNAME CHAR(8),         ! SMS data class name                  06540810
*    3 XDCRTJBN CHAR(8),         ! Creating job name                    06549800
*    3 XDVRSTYP CHAR(1),         ! Matching VRS type                    06558790
*                                ! one of: D-dataset,                   06567780
*                                !         S-smsmc,                     06576770
*                                !         V-vrsmv,                     06585760
*                                !         M-dataset and vrsmv,         06594750
*                                !         C-dataset and smsmc          06603740
*    3 XDVRSNAM CHAR(44),        ! Matching VRS name                    06612730
*    3 XDVRSJBN CHAR(8),         ! Matching VRS job name mask           06621720
*    3 XDRETDAT CHAR(10),        ! Retention date                       06630710
*    3 XDSTEPNM CHAR(8),         ! Creating step name                   06639700
*    3 XDDDNAME CHAR(8),         ! Creating DD name                     06648690
*    3 *        CHAR(8),         ! Reserved                             06657680
*/*******************************************************************   06670000
* Data set size:  This is calculated by multiplying the blocksize   *   06680000
*                 with the number of blocks.                        *   06690000
*********************************************************************/  06700000
*    3 XDDSSIZE CHAR(10),        ! Approx. size of file Kbytes          06715990
*    3 XDABEND  CHAR(1),         ! Data set closed by abend  Y/N        06721980
*/*******************************************************************   06730000
* XDCAT: Set to 'Y' when opened after allocation determines VOLSER  *   06740000
*        by reference to the catalog. Once set to 'Y' it is never   *   06750000
*        changed.                                                   *   06760000
*********************************************************************/  06770000
*    3 XDCAT    CHAR(1),         ! Dset used via catalog Y/N            06787990
*    3 XDVRSR   CHAR(1),         ! Retained by VRS       Y/N            06795980
*    3 XDRSVMW1 CHAR(3),         ! Reserved                             06803970
*    3 XDLABNO  CHAR(4),         ! Label number label=(xx,ll)           06811960
*/*******************************************************************   06820000
* Primary VRS subchain name:                                        *   06830000
*                     This is the retaining VRS in the matching     *   06840000
*                     primary VRS chain.  It is set only if retained*   06850000
*                     by a NAME VRS subchain in the primary VRS.    *   06860000
*********************************************************************/  06870000
*    3 XDVRSSCH CHAR(8),         ! Primary VRS subchain name            06885990
*    3 XDVRSXDS CHAR(10),        ! Primary VRS subchain start date      06891980
*/*******************************************************************   06900000
* Retaining Secondary VRS name:                                     *   06910000
*                     Matching VRS name and job name are included   *   06920000
*                     where a secondary VRS also matches.           *   06930000
*                     The retaining VRS subchain NAME in this       *   06940000
*                     matching VRS is set if it is used to retain   *   06950000
*                     the data set.                                 *   06960000
*********************************************************************/  06970000
*    3 XD2VNME  CHAR(8),         ! Secondary VRS name mask              06987990
*    3 XD2VJBN  CHAR(8),         ! Secondary VRS jobname mask           06995980
*    3 XD2VSCH  CHAR(8),         ! Secondary VRS subchain name          07003970
*    3 XD2VXDS  CHAR(10),        ! Secondary VRS subchain startdate     07011960
*    3 XDTOTAL_BLKCNT CHAR(10),  ! Total block count across this        07019950
*                                !   and previous volumes               07030000
*    3 XDPERCENT CHAR(3),        ! Percentage of volume used by         07040000
*                                !                      data set        07050000
*    3 XDCPGM  CHAR(8),          ! Creating program name                07067990
*    3 XDLPGM  CHAR(8),          ! Last used program name               07075980
*    3 XDLJOB  CHAR(8),          ! Last use job name                    07083970
*    3 XDLSTEP CHAR(8),          ! Last use step name                   07091960
*    3 XDLDDNM CHAR(8),          ! Last use DD name                     07099950
*    3 XDLDEVN CHAR(4),          ! Last use device number               07107940
*/*******************************************************************   07120000
*  End of data set part section 1                                   *   07130000
*********************************************************************/  07140000
*                                                                       07150990
*   2 XVMVDSNAM1 CHAR(44),       ! First dsname of a volume set         07151980
*                                                                       07152970
*/*******************************************************************   07153960
*  Start of mixed data area from volume record section 2 and from   *   07154950
*                                data set record section 2          *   07155940
*********************************************************************/  07156930
*   2 XXMERGED ,                 ! Mixed area                           07157920
*    3 XVRES1 CHAR(5),           ! Reserved for XDDSNSEQ           @SCA 07159200
*    3 XVRES2 CHAR(5),           ! Reserved for XDLABNO            @SCA 07159490
*    3 XvDestBin      CHAR(6),   ! Destination Bin number          @SCA 07159780
*    3 XvDestBinMedia CHAR(8),   ! Destination Bin Media name      @SCA 07160070
*   2 RXRCEND  CHAR(0);          ! End of RXEXT                         07160890
*                                                                       07161880
*/*------------------------------------------------------------------*/ 07170000
*/*  Contants                                                        */ 07180000
*/*------------------------------------------------------------------*/ 07190000
*DCL                                                                    07210000
*  XVVOLTYPE_LOGICAL  CHAR(1) CONSTANT('L'),                            07220000
*  XVVOLTYPE_PHYSICAL CHAR(1) CONSTANT('P'),                            07230000
*  XVVOLTYPE_STACKED  CHAR(1) CONSTANT('S');                            07240000
*                                                                       07250000
*IHALPOP; /* P L S  M A P P I N G  C O M P L E T E */                   07260000
