*                                                                       00032100
* %DCL EDGXSF_INCLUDED CHAR EXT;                                        00064200
* %DEACTIVATE EDGXSF_INCLUDED;                                          00096300
* %IF EDGXSF_INCLUDED = '' %THEN                                        00128400
* %DO;                                                                  00160500
*/* Macro made bi-lingual on 97253. CBGEN compile date 97203         */ 00192600
*% /*                                                                   00224700
         MACRO                                                          00256800
         EDGXSF &DSECT=YES,&LIST=YES,&TITLE=YES                         00288900
         GBLC  &ZCBPRINT                                                00321000
         AIF   ('&LIST' EQ 'NONE').P0                                   00353100
         AIF   ('&TITLE' EQ 'NO').P5                                    00385200
 TITLE   'EDGXSF  - API - Structure Field Introducer           '        00417300
.P5      ANOP                                                           00449400
**/ EDGXSF_1:;                                                          00481500
*/********************************************************************/ 00502900
*/* OS/390 DFSMSrmm V2R10                                            */ 00524300
*/*                                                                  */ 00545700
*/*PROPRIETARY V3 STATEMENT                                          */ 00592500
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00639300
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00686100
*/*5647-A01                                                          */ 00732900
*/*(C) COPYRIGHT 1993,2000  IBM CORP.                                */ 00779700
*/*END PROPRIETARY V3 STATEMENT                                      */ 00826500
*/********************************************************************/ 00873700
*/*                                                                  */ 00930900
*/* 01 DESCRIPTIVE NAME:  API - Structure Field Introducer           */ 00963000
*/* 02  ACRONYM:  SFI                                                */ 00995100
*/*                                                                  */ 01027200
*/* 01 MACRO NAME:  EDGXSF                                           */ 01059300
*/*                                                                  */ 01091400
*/* 01 EXTERNAL CLASSIFICATION: GUPI                                 */ 01123500
*/* 01 END OF EXTERNAL CLASSIFICATION:                               */ 01155600
*/*                                                                  */ 01187700
*/* 01 DSECT NAME:                                                   */ 01219800
*/*      XSF_SFI                                                     */ 01251900
*/*                                                                  */ 01284000
*/* 01 COMPONENT:  DFSMSrmm                                          */ 01316100
*/*                                                                  */ 01348200
*/* 01 EYE-CATCHER:  NONE                                            */ 01380300
*/*                                                                  */ 01412400
*/* 01 STORAGE ATTRIBUTES:                                           */ 01444500
*/* 02  SUBPOOL:  User Specified                                     */ 01476600
*/* 02  KEY:      Any Key                                            */ 01508700
*/* 02  RESIDENCY:  31 Bit                                           */ 01540800
*/*                                                                  */ 01572900
*/* 01 SIZE:  Variable                                               */ 01605000
*/*             XSF_SFI -- X'0008' bytes                             */ 01637100
*/*                                                                  */ 01669200
*/* 01 CREATED BY:                                                   */ 01701300
*/*     Caller                                                       */ 01733400
*/*                                                                  */ 01765500
*/* 01 POINTED TO BY:                                                */ 01797600
*/*     N/A                                                          */ 01829700
*/*                                                                  */ 01861800
*/* 01 SERIALIZATION:                                                */ 01893900
*/*     N/A                                                          */ 01926000
*/*                                                                  */ 01958100
*/* 01 FUNCTION:                                                     */ 01990200
*/*                                                                  */ 02022300
*/* 02 The XSF_SFI area is initialized by DFSMSrmm when an           */ 02054400
*/*    API call is made via the EDGXCI executable macro              */ 02086500
*/*                                                                  */ 02118600
*/* 01 METHOD OF ACCESS:                                             */ 02150700
*/*                                                                  */ 02182800
*/* 02  ASM:                                                         */ 02214900
*/*                                                                  */ 02247000
*/*      EDGXSF                                                      */ 02279100
*/*                                                                  */ 02311200
*/*           DSECT=YES|NO  -- Request DSECT definition              */ 02343300
*/*           TITLE=YES|NO  -- Request Title                         */ 02375400
*/*           LIST=YES|NO   -- Request Listing definition            */ 02407500
*/*                                                                  */ 02439600
*/*      Default: DSECT=YES,TITLE=YES,LIST=YES                       */ 02471700
*/*                                                                  */ 02503800
*/*                                                                  */ 02535900
*/*                                                                  */ 02568000
*/* 02  PL/AS:                                                       */ 02600100
*/*                                                                  */ 02632200
*/*       %INCLUDE SYSLIB(EDGXSF)                                    */ 02664300
*/*                                                                  */ 02696400
*/* 01 DELETED BY:  Caller                                           */ 02728500
*/*                                                                  */ 02760600
*/* 01 FREQUENCY:   Used/Reused for each API call                    */ 02792700
*/*                                                                  */ 02824800
*/* 01 DEPENDENCIES:  None                                           */ 02856900
*/*                                                                  */ 02889000
*/* 01 DISTRIBUTION LIBRARY:  AMACLIB                                */ 02921100
*/*                                                                  */ 02953200
*/* 01 CHANGE ACTIVITY:                                              */ 02985300
*/*  $LA=RMM130 ,130,971211,JPH: DFSMSRMM USER API SUPPORT       @LAA*/ 03006700
*/*  $01=OW33699,130,980520,CHK: API FOR VRS ENHANCEMENT         @01A*/ 03028100
*/*  $K1=K151122,150,980703,CHK: ADD NEW 1.5 FIELDS TO API       @K1A*/ 03038800
*/*  $S8=OW36349,140,980901,CHK: VTS IMPORT/EXPORT               @S8A*/ 03044100
*/*  $LF=RMM210 ,210,990708,CHK: Volset support                  @LFA*/ 03045400
*/*  $LG=RMM210 ,210,990708,CHK: VTS Enhancement support         @LGA*/ 03046700
*/*  $S9=BLYTHE2,210,990825,CHK: Blythe 2 support                @S9A*/ 03048000
*/*  $02=OW40710,140,991006,CHK: Add creating program name       @02A*/ 03048700
*/*  $03=OW42648,150,000118,AH : Extra Days Retention            @03A*/ 03049100
*/*  $LX=OW43476,140,000322,VD : TCDB Processing Controls        @LXA*/ 03049290
*/*  $04=OW48865,210,010321,AH : PREACS/SMSACS parmlib option    @04A*/ 03049380
*/*  $05=OW48921,150,010427,ZB : Creation system ID SFI support  @05A*/ 03049430
*/*  $SC=OW48963,210,010507,CHK: Minimal Bin Assignment          @SCA*/ 03049450
*/*                                                                  */ 03049500
*/*END OF SPECIFICATIONS *********************************************/ 03081600
*% /*                                                                   03113700
.P0      ANOP                                                           03145800
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03177900
         AIF   ('&LIST' EQ 'YES').P2                                    03210000
.P1      ANOP                                                           03242100
         PUSH  PRINT                                                    03274200
         PRINT OFF                                                      03306300
.P2      ANOP                                                           03338400
*                                                                       03370500
* ********************************************************************  03402600
* *    Output Buffer                                                **  03434700
* ********************************************************************  03466800
*                                                                       03498900
         AIF   ('&DSECT' EQ 'YES').L0003A                               03531000
XSF_OUTBUF      DS   0F        Output Buffer                            03563100
         AGO   .L0004                                                   03595200
.L0003A  ANOP                                                           03627300
XSF_OUTBUF           DSECT    Output Buffer                             03659400
.L0004A  ANOP                                                           03691500
XSF_OUTBUF_BUFLNG    DS       1FL4    Buffer Length                     03723600
XSF_OUTBUF_RQDLNG    DS       1FL4    Required Buffer Length            03755700
XSF_OUTBUF_DATALNG   DS       1FL4    Length of Output Data             03787800
XSF_OUTBUF_FIELDS    DS       0C      Start of Structured Fields        03819900
*                                                                       03852000
* ********************************************************************  03884100
* *    Structured Field Introducers for Structured Fields           **  03916200
* ********************************************************************  03948300
*                                                                       03980400
         AIF   ('&DSECT' EQ 'YES').L0003B                               04012500
XSF_SFI         DS   0F        Structured Field Introducers             04044600
         AGO   .L0004B                                                  04076700
.L0003B  ANOP                                                           04108800
XSF_SFI         DSECT           Structured Field Introducers            04140900
.L0004B  ANOP                                                           04173000
XSF_SFI_LENGTH  DS   1FL2      Length                                   04205100
XSF_SFI_ID      DS   1CL0003   ID (identifier)                          04237200
                ORG  XSF_SFI_ID                                         04269300
XSF_SFI_IDVAL   DS   1CL0002   ID (Identifier Value)                    04301400
XSF_SFI_IDQUAL  DS   1CL0001   ID (Identifier Qualifier)                04333500
XSF_SFI_TYPE    DS   1FL1      Type                                     04365600
                DS   1CL0001   Reserved                                 04397700
XSF_SFI_DTYPE   DS   1FL1      Data type                                04429800
XSF_SFI_LEN     EQU  *-XSF_SFI                                          04461900
XSF_SFI_DATA    DS   0C        Start of Data                            04494000
*                                                                       04526100
* ********************************************************************  04558200
* *    Data Types (XSF_SFI_DTYPE)                                   **  04590300
* ********************************************************************  04622400
*                                                                       04654500
XSF_SFI_DTYPE_UNDEF     EQU  X'00' Undefined data                       04686600
XSF_SFI_DTYPE_CHAR_FIX  EQU  X'01' Fixed length n-byte character        04718700
XSF_SFI_DTYPE_BITFLAG   EQU  X'02' 1-byte bit flag byte (8 bits)        04750800
XSF_SFI_DTYPE_BIN8      EQU  X'03' 1-byte (hex) value                   04782900
XSF_SFI_DTYPE_BIN15     EQU  X'04' 2-byte hex value                     04815000
XSF_SFI_DTYPE_BIN31     EQU  X'05' 4-byte hex value                     04847100
XSF_SFI_DTYPE_CHAR_VAR  EQU  X'07' Variable length character            04879200
XSF_SFI_DTYPE_JDATE     EQU  X'09' 4-byte packed decimal date yyyydddC  04911300
XSF_SFI_DTYPE_TIME      EQU  X'0A' 4-byte packed decimal time hhmmsstC  04943400
*                                                                       04975500
* ********************************************************************  05007600
* ********************************************************************  05039700
* **   Group Begin and End SFIs                                     **  05071800
* ********************************************************************  05103900
* ********************************************************************  05136000
*                                                                       05168100
* ********************************************************************  05200200
* **   Begin and End ACCESS                                         **  05232300
* ********************************************************************  05264400
XSF_SFI_ID_ACCESS  EQU X'021000'                                        05296500
XSF_ACCESS_LENGTH  EQU X'0008'                                          05328600
                                                                        05360700
XSF_SFI_ID_EACCESS EQU X'021080'                                        05392800
XSF_EACCESS_LENGTH EQU X'0008'                                          05424900
* ********************************************************************  05457000
* **   Begin and End ACTIONS                                        **  05489100
* ********************************************************************  05521200
XSF_SFI_ID_ACTIONS  EQU X'022000'                                       05553300
XSF_ACTIONS_LENGTH  EQU X'0008'                                         05585400
                                                                        05617500
XSF_SFI_ID_EACTIONS EQU X'022080'                                       05649600
XSF_EACTIONS_LENGTH EQU X'0008'                                         05681700
* ********************************************************************  05713800
* **   Begin and End CNTL                                           **  05745900
* ********************************************************************  05778000
XSF_SFI_ID_CNTL   EQU X'024000'                                         05810100
XSF_CNTL_LENGTH   EQU X'0008'                                           05842200
                                                                        05874300
XSF_SFI_ID_ECNTL  EQU X'024080'                                         05906400
XSF_ECNTL_LENGTH  EQU X'0008'                                           05938500
* ********************************************************************  05970600
* **   Begin and End CONTROL                                        **  06002700
* ********************************************************************  06034800
XSF_SFI_ID_CONTROL  EQU X'025000'                                       06066900
XSF_CONTROL_LENGTH  EQU X'0008'                                         06099000
                                                                        06131100
XSF_SFI_ID_ECONTROL EQU X'025080'                                       06163200
XSF_ECONTROL_LENGTH EQU X'0008'                                         06195300
* ********************************************************************  06227400
* **   Begin and End DATASET                                        **  06259500
* ********************************************************************  06291600
XSF_SFI_ID_DATASET  EQU X'026000'                                       06323700
XSF_DATASET_LENGTH  EQU X'0008'                                         06355800
                                                                        06387900
XSF_SFI_ID_EDATASET EQU X'026080'                                       06420000
XSF_EDATASET_LENGTH EQU X'0008'                                         06452100
* ********************************************************************  06484200
* **   Begin and End LOCDEF                                         **  06516300
* ********************************************************************  06548400
XSF_SFI_ID_LOCDEF  EQU X'027000'                                        06580500
XSF_LOCDEF_LENGTH  EQU X'0008'                                          06612600
                                                                        06644700
XSF_SFI_ID_ELOCDEF EQU X'027080'                                        06676800
XSF_ELOCDEF_LENGTH EQU X'0008'                                          06708900
* ********************************************************************  06741000
* **   Begin and End MESSAGE                                        **  06773100
* ********************************************************************  06805200
XSF_SFI_ID_MESSAGE  EQU X'028000'                                       06837300
XSF_MESSAGE_LENGTH  EQU X'0008'                                         06869400
                                                                        06901500
XSF_SFI_ID_EMESSAGE EQU X'028080'                                       06933600
XSF_EMESSAGE_LENGTH EQU X'0008'                                         06965700
* ********************************************************************  06997800
* **   Begin and End MNTMSG                                         **  07029900
* ********************************************************************  07062000
XSF_SFI_ID_MNTMSG  EQU X'029000'                                        07094100
XSF_MNTMSG_LENGTH  EQU X'0008'                                          07126200
                                                                        07158300
XSF_SFI_ID_EMNTMSG EQU X'029080'                                        07190400
XSF_EMNTMSG_LENGTH EQU X'0008'                                          07222500
* ********************************************************************  07254600
* **   Begin and End MOVES                                          **  07286700
* ********************************************************************  07318800
XSF_SFI_ID_MOVES  EQU X'02A000'                                         07350900
XSF_MOVES_LENGTH  EQU X'0008'                                           07383000
                                                                        07415100
XSF_SFI_ID_EMOVES EQU X'02A080'                                         07447200
XSF_EMOVES_LENGTH EQU X'0008'                                           07479300
* ********************************************************************  07511400
* **   Begin and End OPTION                                         **  07543500
* ********************************************************************  07575600
XSF_SFI_ID_OPTION  EQU X'02B000'                                        07607700
XSF_OPTION_LENGTH  EQU X'0008'                                          07639800
                                                                        07671900
XSF_SFI_ID_EOPTION EQU X'02B080'                                        07704000
XSF_EOPTION_LENGTH EQU X'0008'                                          07736100
* ********************************************************************  07768200
* **   Begin and End OWNER                                          **  07800300
* ********************************************************************  07832400
XSF_SFI_ID_OWNER  EQU X'02C000'                                         07864500
XSF_OWNER_LENGTH  EQU X'0008'                                           07896600
                                                                        07928700
XSF_SFI_ID_EOWNER EQU X'02C080'                                         07960800
XSF_EOWNER_LENGTH EQU X'0008'                                           07992900
* ********************************************************************  08025000
* **   Begin and End PRODUCT                                        **  08057100
* ********************************************************************  08089200
XSF_SFI_ID_PRODUCT  EQU X'02D000'                                       08121300
XSF_PRODUCT_LENGTH  EQU X'0008'                                         08153400
                                                                        08185500
XSF_SFI_ID_EPRODUCT EQU X'02D080'                                       08217600
XSF_EPRODUCT_LENGTH EQU X'0008'                                         08249700
* ********************************************************************  08281800
* **   Begin and End RACK or BIN                                    **  08313900
* ********************************************************************  08346000
XSF_SFI_ID_RACK  EQU X'02E000'                                          08378100
XSF_RACK_LENGTH  EQU X'0008'                                            08410200
                                                                        08442300
XSF_SFI_ID_ERACK EQU X'02E080'                                          08474400
XSF_ERACK_LENGTH EQU X'0008'                                            08506500
* ********************************************************************  08538600
* **   Begin and End REJECT                                         **  08570700
* ********************************************************************  08602800
XSF_SFI_ID_REJECT  EQU X'02F000'                                        08634900
XSF_REJECT_LENGTH  EQU X'0008'                                          08667000
                                                                        08699100
XSF_SFI_ID_EREJECT EQU X'02F080'                                        08731200
XSF_EREJECT_LENGTH EQU X'0008'                                          08763300
* ********************************************************************  08795400
* **   Begin and End SECCLS                                         **  08827500
* ********************************************************************  08859600
XSF_SFI_ID_SECCLS  EQU X'030000'                                        08891700
XSF_SECCLS_LENGTH  EQU X'0008'                                          08923800
                                                                        08955900
XSF_SFI_ID_ESECCLS EQU X'030080'                                        08988000
XSF_ESECCLS_LENGTH EQU X'0008'                                          09020100
* ********************************************************************  09052200
* **   Begin and End SECLVL                                         **  09084300
* ********************************************************************  09116400
XSF_SFI_ID_SECLVL  EQU X'031000'                                        09148500
XSF_SECLVL_LENGTH  EQU X'0008'                                          09180600
                                                                        09212700
XSF_SFI_ID_ESECLVL EQU X'031080'                                        09244800
XSF_ESECLVL_LENGTH EQU X'0008'                                          09276900
* ********************************************************************  09309000
* **   Begin and End STAT                                           **  09341100
* ********************************************************************  09373200
XSF_SFI_ID_STAT  EQU X'032000'                                          09405300
XSF_STAT_LENGTH  EQU X'0008'                                            09437400
                                                                        09469500
XSF_SFI_ID_ESTAT EQU X'032080'                                          09501600
XSF_ESTAT_LENGTH EQU X'0008'                                            09533700
* ********************************************************************  09565800
* **   Begin and End STORE                                          **  09597900
* ********************************************************************  09630000
XSF_SFI_ID_STORE  EQU X'033000'                                         09662100
XSF_STORE_LENGTH  EQU X'0008'                                           09694200
                                                                        09726300
XSF_SFI_ID_ESTORE EQU X'033080'                                         09758400
XSF_ESTORE_LENGTH EQU X'0008'                                           09790500
* ********************************************************************  09822600
* **   Begin and End SYSRETC                                        **  09854700
* ********************************************************************  09886800
XSF_SFI_ID_SYSRETC  EQU X'034000'                                       09918900
XSF_SYSRETC_LENGTH  EQU X'0008'                                         09951000
                                                                        09983100
XSF_SFI_ID_ESYSRETC EQU X'034080'                                       10015200
XSF_ESYSRETC_LENGTH EQU X'0008'                                         10047300
* ********************************************************************  10079400
* **   Begin and End VLPOOL                                         **  10111500
* ********************************************************************  10143600
XSF_SFI_ID_VLPOOL  EQU X'035000'                                        10175700
XSF_VLPOOL_LENGTH  EQU X'0008'                                          10207800
                                                                        10239900
XSF_SFI_ID_EVLPOOL EQU X'035080'                                        10272000
XSF_EVLPOOL_LENGTH EQU X'0008'                                          10304100
* ********************************************************************  10336200
* **   Begin and End VOL                                            **  10368300
* ********************************************************************  10400400
XSF_SFI_ID_VOL     EQU X'036000'                                        10432500
XSF_VOLGRP_LENGTH  EQU X'0008'                                          10464600
                                                                        10496700
XSF_SFI_ID_EVOL    EQU X'036080'                                        10528800
XSF_EVOLGRP_LENGTH EQU X'0008'                                          10560900
* ********************************************************************  10593000
* **   Begin and End VOLUME                                         **  10625100
* ********************************************************************  10657200
XSF_SFI_ID_VOLUME  EQU X'037000'                                        10689300
XSF_VOLUME_LENGTH  EQU X'0008'                                          10721400
                                                                        10753500
XSF_SFI_ID_EVOLUME EQU X'037080'                                        10785600
XSF_EVOLUME_LENGTH EQU X'0008'                                          10817700
* ********************************************************************  10849800
* **   Begin and End VRS                                            **  10881900
* ********************************************************************  10914000
XSF_SFI_ID_VRS     EQU X'038000'                                        10946100
XSF_VRSGRP_LENGTH  EQU X'0008'                                          10978200
                                                                        11010300
XSF_SFI_ID_EVRS    EQU X'038080'                                        11042400
XSF_EVRSGRP_LENGTH EQU X'0008'                                          11074500
* ********************************************************************  11106600
* ********************************************************************  11138700
* *    Return and Reason Code SFIs                                  **  11170800
* ********************************************************************  11202900
* ********************************************************************  11235000
XSF_SFI_FRC_ID  EQU X'400000' Function Reason Code                      11267100
XSF_FRC_LENGTH  EQU X'000C'                                             11299200
XSF_FRC_DTYPE   EQU X'05'                                               11331300
* ********************************************************************  11363400
XSF_SFI_FRS_ID  EQU X'401000' Function Reason Code                      11395500
XSF_FRS_LENGTH  EQU X'000C'                                             11427600
XSF_FRS_DTYPE   EQU X'05'                                               11459700
* ********************************************************************  11491800
XSF_SFI_RSNC_ID EQU X'402000' Reason Code                               11523900
XSF_RSNC_LENGTH EQU X'000C'                                             11556000
XSF_RSNC_DTYPE  EQU X'05'                                               11588100
* ********************************************************************  11620200
XSF_SFI_RTNC_ID EQU X'403000' Return Code                               11652300
XSF_RTNC_LENGTH EQU X'000C'                                             11684400
XSF_RTNC_DTYPE  EQU X'05'                                               11716500
* ********************************************************************  11748600
XSF_SFI_SVCN_ID EQU X'404000' Service Name                              11780700
XSF_SVCN_LENGTH EQU X'0010'                                             11812800
XSF_SVCN_DTYPE  EQU X'07'                                               11844900
* ********************************************************************  11877000
* ********************************************************************  11909100
* **   Messages and Message Variable SFIs                           **  11941200
* ********************************************************************  11973300
* ********************************************************************  12005400
XSF_SFI_MSGL_ID EQU X'051000' Message Line                              12037500
XSF_MSGL_LENGTH EQU X'0103'                                             12069600
XSF_MSGL_DTYPE  EQU X'07'                                               12101700
* ********************************************************************  12133800
XSF_SFI_MSGN_ID EQU X'052000' Message Number                            12165900
XSF_MSGN_LENGTH EQU X'0010'                                             12198000
XSF_MSGN_DTYPE  EQU X'01'                                               12230100
* ********************************************************************  12262200
XSF_SFI_ENTN_ID EQU X'053000' Number of Entries                         12294300
XSF_ENTN_LENGTH EQU X'000C'                                             12326400
XSF_ENTN_DTYPE  EQU X'05'                                               12358500
* **************************************************************** @K1A 12360300
XSF_SFI_KEYF_ID EQU X'054000' From Key                             @K1A 12362100
XSF_KEYF_LENGTH EQU X'0040'                                        @K1A 12363900
XSF_KEYF_DTYPE  EQU X'07'                                          @K1A 12365700
* **************************************************************** @K1A 12367500
XSF_SFI_KEYT_ID EQU X'054200' To Key                               @K1A 12369300
XSF_KEYT_LENGTH EQU X'0040'                                        @K1A 12371100
XSF_KEYT_DTYPE  EQU X'07'                                          @K1A 12372900
* **************************************************************** @K1A 12374700
XSF_SFI_TYPF_ID EQU X'055000' Type from                            @K1A 12376500
XSF_TYPF_LENGTH EQU X'0010'                                        @K1A 12378300
XSF_TYPF_DTYPE  EQU X'07'                                          @K1A 12380100
* **************************************************************** @K1A 12381900
XSF_SFI_TYPT_ID EQU X'055200' Type to                              @K1A 12383700
XSF_TYPT_LENGTH EQU X'0010'                                        @K1A 12385500
XSF_TYPT_DTYPE  EQU X'07'                                          @K1A 12387300
* ********************************************************************  12390600
* ********************************************************************  12422700
* **   Output Data SFI IDs                                          **  12454800
* ********************************************************************  12486900
* *****************************************************************@01A 12490900
XSF_SFI_ABND_ID EQU X'800500' Abend while open                     @01A 12494900
XSF_ABND_LENGTH EQU X'0009'                                        @01A 12498900
XSF_ABND_DTYPE  EQU X'03'                                          @01A 12502900
*                                                                  @01A 12506900
XSF_ABND_DATA_NO  EQU X'00'                                        @01A 12510900
XSF_ABND_DATA_YES EQU X'01'                                        @01A 12514900
* ********************************************************************  12519000
XSF_SFI_ACCT_ID EQU X'800800' Accounting Source                         12551100
XSF_ACCT_LENGTH EQU X'0009'                                             12583200
XSF_ACCT_DTYPE  EQU X'03'                                               12615300
*                                                                       12647400
XSF_ACCT_DATA_JOB  EQU X'00'                                            12679500
XSF_ACCT_DATA_STEP EQU X'01'                                            12711600
* ********************************************************************  12743700
XSF_SFI_ACN_ID EQU X'801000' Account Number                             12775800
XSF_ACN_LENGTH EQU X'0030'                                              12807900
XSF_ACN_DTYPE  EQU X'07'                                                12840000
* *************************************************************** @04A  12843990
XSF_SFI_ACS_ID EQU X'801800' SMS ACS support                      @04A  12847980
XSF_ACS_LENGTH EQU X'0009'                                        @04A  12851970
XSF_ACS_DTYPE  EQU X'03'                                          @04A  12855960
*                                                                 @04A  12859950
XSF_ACS_DATA_NO  EQU X'00'                                        @04A  12863940
XSF_ACS_DATA_YES EQU X'01'                                        @04A  12867930
* ********************************************************************  12872100
XSF_SFI_ACT_ID EQU X'802000' Actions on Release                         12904200
XSF_ACT_LENGTH EQU X'0009'                                              12936300
XSF_ACT_DTYPE  EQU X'02'                                                12968400
*                                                                       13000500
XSF_ACT_FLAG_SCRATCH EQU X'80'                                          13032600
XSF_ACT_FLAG_REPLACE EQU X'40'                                          13064700
XSF_ACT_FLAG_INIT    EQU X'20'                                          13096800
XSF_ACT_FLAG_ERASE   EQU X'10'                                          13128900
XSF_ACT_FLAG_RETURN  EQU X'08'                                          13161000
XSF_ACT_FLAG_NOTIFY  EQU X'04'                                          13193100
* ********************************************************************  13225200
XSF_SFI_ADL_ID EQU X'803001' Address Line                               13257300
XSF_ADL_LENGTH EQU X'0030'                                              13289400
XSF_ADL_DTYPE  EQU X'07'                                                13321500
* ********************************************************************  13353600
XSF_SFI_ADTJ_ID EQU X'804000' Assigned Date                             13385700
XSF_ADTJ_LENGTH EQU X'000C'                                             13417800
XSF_ADTJ_DTYPE  EQU X'09'                                               13449900
* ********************************************************************  13482000
XSF_SFI_AST_ID EQU X'805000' Action Status                              13514100
XSF_AST_LENGTH EQU X'0009'                                              13546200
XSF_AST_DTYPE  EQU X'02'                                                13578300
*                                                                       13610400
XSF_AST_FLAG_PENDING   EQU X'80'                                        13642500
XSF_AST_FLAG_CONFIRMED EQU X'40'                                        13674600
XSF_AST_FLAG_COMPLETE  EQU X'20'                                        13706700
XSF_AST_FLAG_UNKNOWN   EQU X'10'                                        13738800
* ********************************************************************  13770900
XSF_SFI_ATM_ID EQU X'806000' Assigned Time                              13803000
XSF_ATM_LENGTH EQU X'000C'                                              13835100
XSF_ATM_DTYPE  EQU X'0A'                                                13867200
* ********************************************************************  13899300
XSF_SFI_AUD_ID EQU X'807000' SMF Audit Record Number                    13931400
XSF_AUD_LENGTH EQU X'000A'                                              13963500
XSF_AUD_DTYPE  EQU X'04'                                                13995600
* ********************************************************************  14027700
XSF_SFI_AVL_ID EQU X'808000' Volume Availability                        14059800
XSF_AVL_LENGTH EQU X'0009'                                              14091900
XSF_AVL_DTYPE  EQU X'02'                                                14124000
*                                                                       14156100
XSF_AVL_FLAG_PENDREL  EQU X'40'                                         14188200
XSF_AVL_FLAG_VITALRCD EQU X'20'                                         14220300
XSF_AVL_FLAG_ONLOAN   EQU X'08'                                         14252400
XSF_AVL_FLAG_OPEN     EQU X'04'                                         14284500
* ********************************************************************  14316600
XSF_SFI_BDTJ_ID EQU X'809000' Last CDS Backup Date                      14348700
XSF_BDTJ_LENGTH EQU X'000C'                                             14380800
XSF_BDTJ_DTYPE  EQU X'09'                                               14412900
* ********************************************************************  14445000
XSF_SFI_BIN_ID EQU X'80A000' Bin Number                                 14477100
XSF_BIN_LENGTH EQU X'000E'                                              14509200
XSF_BIN_DTYPE  EQU X'01'                                                14541300
* ********************************************************************  14573400
XSF_SFI_BKPP_ID EQU X'80B000' Backup Procedure Name                     14605500
XSF_BKPP_LENGTH EQU X'0010'                                             14637600
XSF_BKPP_DTYPE  EQU X'07'                                               14669700
* ********************************************************************  14701800
XSF_SFI_BLKC_ID EQU X'80C000' Block Count                               14733900
XSF_BLKC_LENGTH EQU X'000C'                                             14766000
XSF_BLKC_DTYPE  EQU X'05'                                               14798100
* ********************************************************************  14830200
XSF_SFI_BLKS_ID EQU X'80D000' Block Size                                14862300
XSF_BLKS_LENGTH EQU X'000C'                                             14894400
XSF_BLKS_DTYPE  EQU X'05'                                               14926500
* ********************************************************************  14958600
XSF_SFI_BLKT_ID EQU X'80D030' Total Block Count                   @S9A  14965000
XSF_BLKT_LENGTH EQU X'000C'                                       @S9A  14971400
XSF_BLKT_DTYPE  EQU X'05'                                         @S9A  14977800
* ********************************************************************  14984200
XSF_SFI_BLP_ID EQU X'80E000' BLP Option                                 14990700
XSF_BLP_LENGTH EQU X'0009'                                              15022800
XSF_BLP_DTYPE  EQU X'03'                                                15054900
*                                                                       15087000
XSF_BLP_DATA_RMM   EQU X'00'                                            15119100
XSF_BLP_DATA_NORMM EQU X'01'                                            15151200
* ********************************************************************  15183300
XSF_SFI_BMN_ID EQU X'80F000' Bin Number Media Name                      15215400
XSF_BMN_LENGTH EQU X'0010'                                              15247500
XSF_BMN_DTYPE  EQU X'07'                                                15279600
* ********************************************************************  15311700
XSF_SFI_BTM_ID EQU X'810000' Last CDS Backup Time                       15343800
XSF_BTM_LENGTH EQU X'000C'                                              15375900
XSF_BTM_DTYPE  EQU X'0A'                                                15408000
* ********************************************************************  15440100
XSF_SFI_CACT_ID EQU X'811000' Control Active Functions                  15472200
XSF_CACT_LENGTH EQU X'0009'                                             15504300
XSF_CACT_DTYPE  EQU X'02'                                               15536400
*                                                                       15568500
XSF_CACT_FLAG_BACKUP  EQU X'80'                                         15600600
XSF_CACT_FLAG_RESTORE EQU X'40'                                         15632700
XSF_CACT_FLAG_VERIFY  EQU X'20'                                         15664800
XSF_CACT_FLAG_EXPROC  EQU X'10'                                         15696900
XSF_CACT_FLAG_EXTRACT EQU X'08'                                         15729000
XSF_CACT_FLAG_DSTORE  EQU X'04'                                         15761100
XSF_CACT_FLAG_VRSEL   EQU X'02'                                         15793200
* **************************************************************** @K1A 15796700
XSF_SFI_CATS_ID EQU X'811800' CATSYSID value                       @K1A 15800200
XSF_CATS_LENGTH EQU X'0009'                                        @K1A 15803700
XSF_CATS_DTYPE  EQU X'03'                                          @K1A 15807200
*                                                                  @K1A 15810700
XSF_CATS_DATA_SET    EQU X'00'                                     @K1A 15814200
XSF_CATS_DATA_NOTSET EQU X'01'                                     @K1A 15817700
XSF_CATS_DATA_STAR   EQU X'02'                                     @K1A 15821200
* ********************************************************************  15825300
XSF_SFI_CDS_ID EQU X'812000' Control Data Set ID                        15857400
XSF_CDS_LENGTH EQU X'0010'                                              15889500
XSF_CDS_DTYPE  EQU X'07'                                                15921600
* ********************************************************************  15953700
XSF_SFI_CDTJ_ID EQU X'813000' Create Date                               15985800
XSF_CDTJ_LENGTH EQU X'000C'                                             16017900
XSF_CDTJ_DTYPE  EQU X'09'                                               16050000
* ********************************************************************  16082100
XSF_SFI_CJBN_ID EQU X'814000' Job Name                                  16114200
XSF_CJBN_LENGTH EQU X'0010'                                             16146300
XSF_CJBN_DTYPE  EQU X'07'                                               16178400
* ********************************************************************  16210500
XSF_SFI_CLIB_ID EQU X'815000' Current Library Name                      16242600
XSF_CLIB_LENGTH EQU X'0010'                                             16274700
XSF_CLIB_DTYPE  EQU X'07'                                               16306800
* ********************************************************************  16338900
XSF_SFI_CLS_ID EQU X'816000' Security Class Description                 16371000
XSF_CLS_LENGTH EQU X'0028'                                              16403100
XSF_CLS_DTYPE  EQU X'07'                                                16435200
* ********************************************************************  16467300
XSF_SFI_CNT_ID EQU X'817000' Bin, Rack or Volume Count                  16499400
XSF_CNT_LENGTH EQU X'000C'                                              16531500
XSF_CNT_DTYPE  EQU X'05'                                                16563600
* **************************************************************** @02A 16570000
XSF_SFI_CPGM_ID EQU X'817820' Creating program name                @02A 16576400
XSF_CPGM_LENGTH EQU X'0010'                                        @02A 16582800
XSF_CPGM_DTYPE  EQU X'01'                                          @02A 16589200
* ********************************************************************  16595700
XSF_SFI_CRP_ID EQU X'818000' CATRETPD Retention Period                  16627800
XSF_CRP_LENGTH EQU X'000C'                                              16659900
XSF_CRP_DTYPE  EQU X'05'                                                16692000
* **************************************************************** @K1A 16698400
XSF_SFI_CSDT_ID EQU X'818800' Catalog Synchronize date             @K1A 16704800
XSF_CSDT_LENGTH EQU X'000C'                                        @K1A 16711200
XSF_CSDT_DTYPE  EQU X'09'                                          @K1A 16717600
* ********************************************************************  16724100
XSF_SFI_CSG_ID EQU X'819000' Current Storage Group                      16756200
XSF_CSG_LENGTH EQU X'0010'                                              16788300
XSF_CSG_DTYPE  EQU X'07'                                                16820400
* **************************************************************** @K1A 16821300
XSF_SFI_CSTM_ID EQU X'819400' Catalog Synchronize time             @K1A 16822200
XSF_CSTM_LENGTH EQU X'000C'                                        @K1A 16823100
XSF_CSTM_DTYPE  EQU X'0A'                                          @K1A 16824000
* **************************************************************** @LGA 16824400
XSF_SFI_CSVE_ID EQU X'819600' Stacked volume enabled status        @LGA 16824800
XSF_CSVE_LENGTH EQU X'0009'                                        @LGA 16825200
XSF_CSVE_DTYPE  EQU X'03'                                          @LGA 16825600
*                                                                  @LGA 16826000
XSF_CSVE_DATA_NONE     EQU X'00'                                   @LGA 16826400
XSF_CSVE_DATA_ENABLED  EQU X'01'                                   @LGA 16826800
XSF_CSVE_DATA_DISABLED EQU X'02'                                   @LGA 16827200
XSF_CSVE_DATA_MIXED    EQU X'03'                                   @LGA 16827600
* **************************************************************** @01A 16828000
XSF_SFI_CTLG_ID EQU X'819800' Catalog status                       @01A 16829400
XSF_CTLG_LENGTH EQU X'0009'                                        @01A 16833900
XSF_CTLG_DTYPE  EQU X'03'                                          @01A 16838400
*                                                                  @01A 16842900
XSF_CTLG_DATA_UNKNOWN EQU X'00'                                    @01A 16847400
XSF_CTLG_DATA_NO      EQU X'01'                                    @K1A 16849100
XSF_CTLG_DATA_YES     EQU X'02'                                    @K1A 16850800
* ********************************************************************  16852500
XSF_SFI_CTM_ID EQU X'81A000' Create Time                                16884600
XSF_CTM_LENGTH EQU X'000C'                                              16916700
XSF_CTM_DTYPE  EQU X'0A'                                                16948800
* **************************************************************** @S8A 16955200
XSF_SFI_CTNR_ID EQU X'81A300' Container                            @S8A 16961600
XSF_CTNR_LENGTH EQU X'0018'                                        @S8A 16968000
XSF_CTNR_DTYPE  EQU X'07'                                          @S8A 16974400
* ********************************************************************  16980900
XSF_SFI_DBN_ID EQU X'81B000' Bin Numbers in DISTANT                     17013000
XSF_DBN_LENGTH EQU X'000C'                                              17045100
XSF_DBN_DTYPE  EQU X'05'                                                17077200
* **************************************************************** @SCA 17080190
XSF_SFI_DBIN_ID EQU X'81A600' Destination Bin number               @SCA 17083180
XSF_DBIN_LENGTH EQU X'000E'                                        @SCA 17086170
XSF_DBIN_DTYPE  EQU X'01'                                          @SCA 17089160
* **************************************************************** @SCA 17092150
XSF_SFI_DBMN_ID EQU X'81A700' Destination Bin media name           @SCA 17095140
XSF_DBMN_LENGTH EQU X'0010'                                        @SCA 17098130
XSF_DBMN_DTYPE  EQU X'01'                                          @SCA 17101120
* ********************************************************************  17109300
XSF_SFI_DC_ID EQU X'81C000' Data Class                                  17141400
XSF_DC_LENGTH EQU X'0010'                                               17173500
XSF_DC_DTYPE  EQU X'07'                                                 17205600
* ********************************************************************  17237700
XSF_SFI_DD_ID EQU X'81D000' DD Name                                     17269800
XSF_DD_LENGTH EQU X'0010'                                               17301900
XSF_DD_DTYPE  EQU X'07'                                                 17334000
* ********************************************************************  17366100
XSF_SFI_DDTJ_ID EQU X'81E000' Delete Date or Last Store Update Date     17398200
XSF_DDTJ_LENGTH EQU X'000C'                                             17430300
XSF_DDTJ_DTYPE  EQU X'09'                                               17462400
* ********************************************************************  17494500
XSF_SFI_DEN_ID EQU X'81F000' Media Density                              17526600
XSF_DEN_LENGTH EQU X'0009'                                              17558700
XSF_DEN_DTYPE  EQU X'03'                                                17590800
*                                                                       17622900
XSF_DEN_DATA_UNDEFINED EQU X'00'                                        17655000
XSF_DEN_DATA_1600      EQU X'01'                                        17687100
XSF_DEN_DATA_6250      EQU X'02'                                        17719200
XSF_DEN_DATA_3480      EQU X'03'                                        17751300
XSF_DEN_DATA_COMPACT   EQU X'04'                                        17783400
* ********************************************************************  17815500
XSF_SFI_DESC_ID EQU X'820000' Volume or VRS Description                 17847600
XSF_DESC_LENGTH EQU X'0026'                                             17879700
XSF_DESC_DTYPE  EQU X'07'                                               17911800
* ********************************************************************  17943900
XSF_SFI_DEST_ID EQU X'821000' Destination Name                          17976000
XSF_DEST_LENGTH EQU X'0010'                                             18008100
XSF_DEST_DTYPE  EQU X'07'                                               18040200
* ********************************************************************  18072300
XSF_SFI_DEV_ID EQU X'822000' Device Number                              18104400
XSF_DEV_LENGTH EQU X'000C'                                              18136500
XSF_DEV_DTYPE  EQU X'01'                                           @S9C 18168600
* ********************************************************************  18200700
XSF_SFI_DLRJ_ID EQU X'823000' Date Last Read                            18232800
XSF_DLRJ_LENGTH EQU X'000C'                                             18264900
XSF_DLRJ_DTYPE  EQU X'09'                                               18297000
* ********************************************************************  18329100
XSF_SFI_DLWJ_ID EQU X'824000' Date Last Written                         18361200
XSF_DLWJ_LENGTH EQU X'000C'                                             18393300
XSF_DLWJ_DTYPE  EQU X'09'                                               18425400
* ********************************************************************  18457500
XSF_SFI_DNM_ID EQU X'825000' Data Set Name Mask                         18489600
XSF_DNM_LENGTH EQU X'0034'                                              18521700
XSF_DNM_DTYPE  EQU X'07'                                                18553800
* *************************************************************** @S9A  18560200
XSF_SFI_DPCT_ID EQU X'825E00' Percent of Volume                   @S9A  18566600
XSF_DPCT_LENGTH EQU X'0009'                                       @S9A  18573000
XSF_DPCT_DTYPE  EQU X'03'                                         @S9A  18579400
* ********************************************************************  18585900
XSF_SFI_DPT_ID EQU X'826000' Owner''s Department                        18618000
XSF_DPT_LENGTH EQU X'0030'                                              18650100
XSF_DPT_DTYPE  EQU X'07'                                                18682200
* ********************************************************************  18714300
XSF_SFI_DRP_ID EQU X'827000' Default Retention Period                   18746400
XSF_DRP_LENGTH EQU X'000C'                                              18778500
XSF_DRP_DTYPE  EQU X'05'                                                18810600
* ********************************************************************  18842700
XSF_SFI_DSC_ID EQU X'828000' Data Set Count                             18874800
XSF_DSC_LENGTH EQU X'000C'                                              18906900
XSF_DSC_DTYPE  EQU X'05'                                                18939000
* ********************************************************************  18971100
XSF_SFI_DSEQ_ID EQU X'829000' Data Set Sequence                         19003200
XSF_DSEQ_LENGTH EQU X'000C'                                             19035300
XSF_DSEQ_DTYPE  EQU X'05'                                               19067400
* ********************************************************************  19099500
XSF_SFI_DSN_ID EQU X'82A000' Data Set Name                              19131600
XSF_DSN_LENGTH EQU X'0034'                                              19163700
XSF_DSN_DTYPE  EQU X'07'                                                19195800
* **************************************************************** @K1A 19199300
XSF_SFI_DSPD_ID EQU X'82A500' Disposition DD name                  @K1A 19202800
XSF_DSPD_LENGTH EQU X'0010'                                        @K1A 19206300
XSF_DSPD_DTYPE  EQU X'07'                                          @K1A 19209800
* **************************************************************** @K1A 19213300
XSF_SFI_DSPM_ID EQU X'82AA00' Disposition message prefix           @K1A 19216800
XSF_DSPM_LENGTH EQU X'0010'                                        @K1A 19220300
XSF_DSPM_DTYPE  EQU X'07'                                          @K1A 19223800
* ********************************************************************  19227900
XSF_SFI_DSR_ID EQU X'82B000' Data Set Recording                         19260000
XSF_DSR_LENGTH EQU X'0009'                                              19292100
XSF_DSR_DTYPE  EQU X'03'                                                19324200
*                                                                       19356300
XSF_DSR_DATA_OFF EQU X'00'                                              19388400
XSF_DSR_DATA_ON  EQU X'01'                                              19420500
* **************************************************************** @SCA 19420890
XSF_SFI_DSTT_ID EQU X'82B200' Destination Type                     @SCA 19421280
XSF_DSTT_LENGTH EQU X'0009'                                        @SCA 19421670
XSF_DSTT_DTYPE  EQU X'03'                                          @SCA 19422060
*                                                                  @SCA 19422450
XSF_DSTT_DATA_SHELF               EQU X'00'                        @SCA 19422840
XSF_DSTT_DATA_STORE_BUILTIN_BINS  EQU X'01'                        @SCA 19423230
XSF_DSTT_DATA_MANUAL              EQU X'02'                        @SCA 19423620
XSF_DSTT_DATA_AUTO                EQU X'03'                        @SCA 19424010
XSF_DSTT_DATA_STORE_BINS          EQU X'04'                        @SCA 19424400
XSF_DSTT_DATA_STORE_NOBINS        EQU X'05'                        @SCA 19424790
* *****************************************************************@05A 19426490
XSF_SFI_DSYS_ID EQU X'82BB00' Creation System ID for first file    @05A 19432480
XSF_DSYS_LENGTH EQU X'0010'                                        @05A 19438470
XSF_DSYS_DTYPE  EQU X'07'                                          @05A 19444460
* ********************************************************************  19452600
XSF_SFI_DTE_ID EQU X'82C000' Installation Date Format                   19484700
XSF_DTE_LENGTH EQU X'0009'                                              19516800
XSF_DTE_DTYPE  EQU X'03'                                                19548900
*                                                                       19581000
XSF_DTE_DATA_A  EQU X'01'                                               19613100
XSF_DTE_DATA_E  EQU X'02'                                               19645200
XSF_DTE_DATA_I  EQU X'03'                                               19677300
XSF_DTE_DATA_J  EQU X'04'                                               19709400
* ********************************************************************  19741500
XSF_SFI_DTM_ID EQU X'82D000' Last Store Update Run Time                 19773600
XSF_DTM_LENGTH EQU X'000C'                                              19805700
XSF_DTM_DTYPE  EQU X'0A'                                                19837800
* **************************************************************** @SCA 19841790
XSF_SFI_EBIN_ID EQU X'82D500' Extended Bin Enabled status          @SCA 19845780
XSF_EBIN_LENGTH EQU X'0009'                                        @SCA 19849770
XSF_EBIN_DTYPE  EQU X'03'                                          @SCA 19853760
*                                                                  @SCA 19857750
XSF_EBIN_DATA_DISABLED EQU X'00'                                   @SCA 19861740
XSF_EBIN_DATA_ENABLED  EQU X'01'                                   @SCA 19865730
* ********************************************************************  19869900
XSF_SFI_EMN_ID EQU X'82E000' Owner''s Node                              19902000
XSF_EMN_LENGTH EQU X'0010'                                              19934100
XSF_EMN_DTYPE  EQU X'07'                                                19966200
* ********************************************************************  19998300
XSF_SFI_EMU_ID EQU X'82F000' Owner''s User ID                           20030400
XSF_EMU_LENGTH EQU X'0010'                                              20062500
XSF_EMU_DTYPE  EQU X'07'                                                20094600
* ********************************************************************  20126700
XSF_SFI_ETL_ID EQU X'830000' Owner''s Ext Telephone Num                 20158800
XSF_ETL_LENGTH EQU X'001C'                                              20190900
XSF_ETL_DTYPE  EQU X'07'                                                20223000
* ********************************************************************  20255100
XSF_SFI_FCD_ID EQU X'831000' Product Feature Code                       20287200
XSF_FCD_LENGTH EQU X'000C'                                              20319300
XSF_FCD_DTYPE  EQU X'07'                                                20351400
* **************************************************************** @K1A 20355400
XSF_SFI_FCSP_ID EQU X'831800' Catalog Synchronize in progress      @K1A 20359400
XSF_FCSP_LENGTH EQU X'0009'                                        @K1A 20363400
XSF_FCSP_DTYPE  EQU X'03'                                          @K1A 20367400
*                                                                  @K1A 20371400
XSF_FCSP_DATA_NO  EQU X'00'                                        @K1A 20375400
XSF_FCSP_DATA_YES EQU X'01'                                        @K1A 20379400
* ********************************************************************  20383500
XSF_SFI_FDB_ID EQU X'832000' Free Bins in DISTANT Loc                   20415600
XSF_FDB_LENGTH EQU X'000C'                                              20447700
XSF_FDB_DTYPE  EQU X'05'                                                20479800
* ********************************************************************  20511900
XSF_SFI_FILE_ID EQU X'833000' Physical File Sequence                    20544000
XSF_FILE_LENGTH EQU X'000C'                                             20576100
XSF_FILE_DTYPE  EQU X'05'                                               20608200
* ********************************************************************  20640300
XSF_SFI_FLB_ID EQU X'834000' Free Bin Numbers in LOCAL                  20672400
XSF_FLB_LENGTH EQU X'000C'                                              20704500
XSF_FLB_DTYPE  EQU X'05'                                                20736600
* ********************************************************************  20768700
XSF_SFI_FOR_ID EQU X'835000' Owner''s Forename                          20800800
XSF_FOR_LENGTH EQU X'001C'                                              20832900
XSF_FOR_DTYPE  EQU X'07'                                                20865000
* ********************************************************************  20897100
XSF_SFI_FRB_ID EQU X'836000' Free Bin Numbers in REMOTE                 20929200
XSF_FRB_LENGTH EQU X'000C'                                              20961300
XSF_FRB_DTYPE  EQU X'05'                                                20993400
* ********************************************************************  21025500
XSF_SFI_FRK_ID EQU X'837000' Free Rack Num in Library                   21057600
XSF_FRK_LENGTH EQU X'000C'                                              21089700
XSF_FRK_DTYPE  EQU X'05'                                                21121800
* ********************************************************************  21153900
XSF_SFI_GRK_ID EQU X'838000' Generic Rack Number                        21186000
XSF_GRK_LENGTH EQU X'000E'                                              21218100
XSF_GRK_DTYPE  EQU X'01'                                                21250200
* ********************************************************************  21282300
XSF_SFI_HLOC_ID EQU X'839000' Home Location                             21314400
XSF_HLOC_LENGTH EQU X'0010'                                             21346500
XSF_HLOC_DTYPE  EQU X'07'                                               21378600
* **************************************************************** @SCA 21381590
XSF_SFI_HLOT_ID EQU X'839200' Home Location Type                   @SCA 21384580
XSF_HLOT_LENGTH EQU X'0009'                                        @SCA 21387570
XSF_HLOT_DTYPE  EQU X'03'                                          @SCA 21390560
*                                                                  @SCA 21393550
XSF_HLOT_DATA_SHELF               EQU X'00'                        @SCA 21396540
XSF_HLOT_DATA_MANUAL              EQU X'02'                        @SCA 21399530
XSF_HLOT_DATA_AUTO                EQU X'03'                        @SCA 21402520
* ********************************************************************  21410700
XSF_SFI_INTR_ID EQU X'83A000' Volume Intransit Status                   21442800
XSF_INTR_LENGTH EQU X'0009'                                             21474900
XSF_INTR_DTYPE  EQU X'03'                                               21507000
*                                                                       21539100
XSF_INTR_DATA_NO  EQU X'00'                                             21571200
XSF_INTR_DATA_YES EQU X'01'                                             21603300
* ********************************************************************  21635400
XSF_SFI_IPL_ID EQU X'83B000' Data Check Required in IPL                 21667500
XSF_IPL_LENGTH EQU X'0009'                                              21699600
XSF_IPL_DTYPE  EQU X'03'                                                21731700
*                                                                       21763800
XSF_IPL_DATA_NO  EQU X'00'                                              21795900
XSF_IPL_DATA_YES EQU X'01'                                              21828000
* ********************************************************************  21860100
XSF_SFI_ITL_ID EQU X'83C000' Owner''s Internal Tele Num                 21892200
XSF_ITL_LENGTH EQU X'0010'                                              21924300
XSF_ITL_DTYPE  EQU X'07'                                                21956400
* ********************************************************************  21988500
XSF_SFI_JDS_ID EQU X'83D000' Journal Name                               22020600
XSF_JDS_LENGTH EQU X'0034'                                              22052700
XSF_JDS_DTYPE  EQU X'07'                                                22084800
* ********************************************************************  22116900
XSF_SFI_JRNF_ID EQU X'83E000' JOURNALFULL Parmlib Value                 22149000
XSF_JRNF_LENGTH EQU X'000A'                                             22181100
XSF_JRNF_DTYPE  EQU X'04'                                               22213200
* ********************************************************************  22245300
XSF_SFI_JRNU_ID EQU X'83F000' Journal Percentage Used                   22277400
XSF_JRNU_LENGTH EQU X'000A'                                             22309500
XSF_JRNU_DTYPE  EQU X'04'                                               22341600
* ********************************************************************  22373700
XSF_SFI_LBL_ID EQU X'840000' Volume Label                               22405800
XSF_LBL_LENGTH EQU X'0009'                                              22437900
XSF_LBL_DTYPE  EQU X'02'                                                22470000
*                                                                       22502100
XSF_LBL_FLAG_NL  EQU X'20'                                              22534200
XSF_LBL_FLAG_AL  EQU X'10'                                              22566300
XSF_LBL_FLAG_SL  EQU X'08'                                              22598400
XSF_LBL_FLAG_BLP EQU X'02'                                              22630500
XSF_LBL_FLAG_UL  EQU X'01'                                              22662600
* ********************************************************************  22694700
XSF_SFI_LBN_ID EQU X'841000' Bin Numbers in LOCAL                       22726800
XSF_LBN_LENGTH EQU X'000C'                                              22758900
XSF_LBN_DTYPE  EQU X'05'                                                22791000
* ********************************************************************  22823100
XSF_SFI_LCID_ID EQU X'842000' Last Change User ID                       22855200
XSF_LCID_LENGTH EQU X'0010'                                             22887300
XSF_LCID_DTYPE  EQU X'07'                                               22919400
* ********************************************************************  22951500
XSF_SFI_LCT_ID EQU X'843000' Default Lines per Page                     22983600
XSF_LCT_LENGTH EQU X'000A'                                              23015700
XSF_LCT_DTYPE  EQU X'04'                                                23047800
* **************************************************************** @02A 23054200
XSF_SFI_LDD_ID EQU X'843B00' Last used dd name                     @02A 23060600
XSF_LDD_LENGTH EQU X'0010'                                         @02A 23067000
XSF_LDD_DTYPE  EQU X'01'                                           @02A 23073400
* ********************************************************************  23079900
XSF_SFI_LDDF_ID EQU X'844000' Location Definition Exists                23112000
XSF_LDDF_LENGTH EQU X'0009'                                             23144100
XSF_LDDF_DTYPE  EQU X'03'                                               23176200
*                                                                       23208300
XSF_LDDF_DATA_NO  EQU X'00'                                             23240400
XSF_LDDF_DATA_YES EQU X'01'                                             23272500
* ********************************************************************  23304600
XSF_SFI_LDEV_ID EQU X'845000' Last Drive                                23336700
XSF_LDEV_LENGTH EQU X'000C'                                             23368800
XSF_LDEV_DTYPE  EQU X'01'                                               23400900
* ********************************************************************  23433000
XSF_SFI_LDLC_ID EQU X'846000' Location Name                             23465100
XSF_LDLC_LENGTH EQU X'0010'                                             23497200
XSF_LDLC_DTYPE  EQU X'07'                                               23529300
* ********************************************************************  23561400
XSF_SFI_LDLT_ID EQU X'847000' Location Type                             23593500
XSF_LDLT_LENGTH EQU X'0009'                                             23625600
XSF_LDLT_DTYPE  EQU X'03'                                               23657700
*                                                                       23689800
XSF_LDLT_DATA_SHELF  EQU X'00'                                          23721900
XSF_LDLT_DATA_AUTO   EQU X'01'                                          23754000
XSF_LDLT_DATA_MANUAL EQU X'02'                                          23786100
XSF_LDLT_DATA_STORE  EQU X'03'                                          23818200
XSF_LDLT_DATA_HSTORE EQU X'04'                                     @05A 23828190
* ********************************************************************  23850300
XSF_SFI_LDMN_ID EQU X'848000' Location Media Name                       23882400
XSF_LDMN_LENGTH EQU X'0010'                                             23914500
XSF_LDMN_DTYPE  EQU X'07'                                               23946600
* ********************************************************************  23978700
XSF_SFI_LDMT_ID EQU X'849000' Location Management Type                  24010800
XSF_LDMT_LENGTH EQU X'0009'                                             24042900
XSF_LDMT_DTYPE  EQU X'03'                                               24075000
*                                                                       24107100
XSF_LDMT_DATA_UNDEFINED EQU X'00'                                       24139200
XSF_LDMT_DATA_BIN       EQU X'01'                                       24171300
XSF_LDMT_DATA_NOBINS    EQU X'02'                                       24203400
* ********************************************************************  24235500
XSF_SFI_LDPR_ID EQU X'84A000' Location Priority                         24267600
XSF_LDPR_LENGTH EQU X'000C'                                             24299700
XSF_LDPR_DTYPE  EQU X'05'                                               24331800
* ********************************************************************  24363900
XSF_SFI_LINE_ID EQU X'84B000' Output Data Line                          24396000
XSF_LINE_LENGTH EQU X'0008'                                             24428100
XSF_LINE_DTYPE  EQU X'07'                                               24460200
* **************************************************************** @02A 24466600
XSF_SFI_LJOB_ID EQU X'84B420' Last used job name                   @02A 24473000
XSF_LJOB_LENGTH EQU X'0010'                                        @02A 24479400
XSF_LJOB_DTYPE  EQU X'01'                                          @02A 24485800
* ********************************************************************  24492300
XSF_SFI_LOAN_ID EQU X'84C000' Loan Location                             24524400
XSF_LOAN_LENGTH EQU X'0010'                                             24556500
XSF_LOAN_DTYPE  EQU X'07'                                               24588600
* ********************************************************************  24620700
XSF_SFI_LOC_ID EQU X'84D000' Location                                   24652800
XSF_LOC_LENGTH EQU X'0010'                                              24684900
XSF_LOC_DTYPE  EQU X'07'                                                24717000
* ********************************************************************  24749100
XSF_SFI_LOCT_ID EQU X'84E000' Location Type                             24781200
XSF_LOCT_LENGTH EQU X'0009'                                             24813300
XSF_LOCT_DTYPE  EQU X'03'                                               24845400
*                                                                       24877500
XSF_LOCT_DATA_SHELF               EQU X'00'                             24909600
XSF_LOCT_DATA_STORE_BUILTIN_BINS  EQU X'01'                             24941700
XSF_LOCT_DATA_MANUAL              EQU X'02'                             24973800
XSF_LOCT_DATA_AUTO                EQU X'03'                             25005900
XSF_LOCT_DATA_STORE_BINS          EQU X'04'                             25038000
XSF_LOCT_DATA_STORE_NOBINS        EQU X'05'                             25070100
XSF_LOCT_DATA_INCTNR              EQU X'06'                        @LGA 25086100
* **************************************************************** @02A 25089300
XSF_SFI_LPGM_ID EQU X'84E760' Last used program name               @02A 25092500
XSF_LPGM_LENGTH EQU X'0010'                                        @02A 25095700
XSF_LPGM_DTYPE  EQU X'01'                                          @02A 25098900
* ********************************************************************  25102200
XSF_SFI_LRCL_ID EQU X'84F000' Logical Record Length                     25134300
XSF_LRCL_LENGTH EQU X'000C'                                             25166400
XSF_LRCL_DTYPE  EQU X'05'                                               25198500
* ********************************************************************  25230600
XSF_SFI_LRK_ID EQU X'850000' # Library Rack Numbers                     25262700
XSF_LRK_LENGTH EQU X'000C'                                              25294800
XSF_LRK_DTYPE  EQU X'05'                                                25326900
* **************************************************************** @02A 25327200
XSF_SFI_LSTP_ID EQU X'850370' Last used step name                  @02A 25327500
XSF_LSTP_LENGTH EQU X'0010'                                        @02A 25327800
XSF_LSTP_DTYPE  EQU X'01'                                          @02A 25328100
* **************************************************************** @K1A 25328500
XSF_SFI_LVC_ID EQU X'850500' Current label version                 @K1A 25330100
XSF_LVC_LENGTH EQU X'0009'                                         @K1A 25331700
XSF_LVC_DTYPE  EQU X'03'                                           @K1A 25333300
*                                                                  @K1A 25334900
XSF_LVC_DATA_NO       EQU X'00'                                    @K1A 25336500
XSF_LVC_DATA_VERSION1 EQU X'01'                                    @K1A 25338100
XSF_LVC_DATA_VERSION3 EQU X'03'                                    @K1A 25339700
XSF_LVC_DATA_VERSION4 EQU X'04'                                    @K1A 25341300
* **************************************************************** @K1A 25342900
XSF_SFI_LVN_ID EQU X'850A00' Required label version                @K1A 25344500
XSF_LVN_LENGTH EQU X'0009'                                         @K1A 25346100
XSF_LVN_DTYPE  EQU X'03'                                           @K1A 25347700
*                                                                  @K1A 25349300
XSF_LVN_DATA_NO EQU X'00'                                          @K1A 25351700
XSF_LVN_DATA_V3 EQU X'03'                                          @K1A 25354100
XSF_LVN_DATA_V4 EQU X'04'                                          @K1A 25355700
* ********************************************************************  25359000
XSF_SFI_MC_ID EQU X'851000' Management Class                            25391100
XSF_MC_LENGTH EQU X'0010'                                               25423200
XSF_MC_DTYPE  EQU X'07'                                                 25455300
* ********************************************************************  25487400
XSF_SFI_MDS_ID EQU X'852000' CDS Data Set Name                          25519500
XSF_MDS_LENGTH EQU X'0034'                                              25551600
XSF_MDS_DTYPE  EQU X'07'                                                25583700
* ********************************************************************  25615800
XSF_SFI_MDTJ_ID EQU X'853000' CDS Create Date                           25647900
XSF_MDTJ_LENGTH EQU X'000C'                                             25680000
XSF_MDTJ_DTYPE  EQU X'09'                                               25712100
* ********************************************************************  25744200
XSF_SFI_MEDA_ID EQU X'854000' Media Special Attributes                  25776300
XSF_MEDA_LENGTH EQU X'0009'                                             25808400
XSF_MEDA_DTYPE  EQU X'03'                                               25840500
*                                                                       25872600
XSF_MEDA_DATA_NONE     EQU X'00'                                        25904700
XSF_MEDA_DATA_READCOMP EQU X'01'                                        25936800
* ********************************************************************  25968900
XSF_SFI_MEDC_ID EQU X'855000' Media Compaction                          26001000
XSF_MEDC_LENGTH EQU X'0009'                                             26033100
XSF_MEDC_DTYPE  EQU X'03'                                               26065200
*                                                                       26097300
XSF_MEDC_DATA_UNDEFINED EQU X'00'                                       26129400
XSF_MEDC_DATA_NO        EQU X'01'                                       26161500
XSF_MEDC_DATA_YES       EQU X'02'                                       26193600
* ********************************************************************  26225700
XSF_SFI_MEDN_ID EQU X'856000' Media Name                                26257800
XSF_MEDN_LENGTH EQU X'0010'                                             26289900
XSF_MEDN_DTYPE  EQU X'07'                                               26322000
* ********************************************************************  26354100
XSF_SFI_MEDR_ID EQU X'857000' Media Recording Format                    26386200
XSF_MEDR_LENGTH EQU X'0009'                                             26418300
XSF_MEDR_DTYPE  EQU X'03'                                               26450400
*                                                                       26482500
XSF_MEDR_DATA_NONCART EQU X'00'                                    @S9C 26514600
XSF_MEDR_DATA_18TRK   EQU X'01'                                         26546700
XSF_MEDR_DATA_36TRK   EQU X'02'                                         26578800
XSF_MEDR_DATA_128TRK  EQU X'03'                                         26610900
XSF_MEDR_DATA_256TRK  EQU X'04'                                    @S9A 26626900
* ********************************************************************  26643000
XSF_SFI_MEDT_ID EQU X'858000' Media Type                                26675100
XSF_MEDT_LENGTH EQU X'0009'                                             26707200
XSF_MEDT_DTYPE  EQU X'03'                                               26739300
*                                                                       26771400
XSF_MEDT_DATA_UNDEFINED EQU X'00'                                       26803500
XSF_MEDT_DATA_CST       EQU X'01'                                       26835600
XSF_MEDT_DATA_ECCST     EQU X'02'                                       26867700
XSF_MEDT_DATA_HPCT      EQU X'03'                                       26899800
XSF_MEDT_DATA_EHPCT     EQU X'04'                                       26931900
* ********************************************************************  26964000
XSF_SFI_MFR_ID EQU X'859000' Source Location Name                       26996100
XSF_MFR_LENGTH EQU X'0010'                                              27028200
XSF_MFR_DTYPE  EQU X'07'                                                27060300
* ********************************************************************  27092400
XSF_SFI_MID_ID EQU X'85A000' Mount Message ID                           27124500
XSF_MID_LENGTH EQU X'0014'                                              27156600
XSF_MID_DTYPE  EQU X'07'                                                27188700
* **************************************************************** @SCA 27191690
XSF_SFI_MIV_ID EQU X'85A500' Moving-In Volume                      @SCA 27194680
XSF_MIV_LENGTH EQU X'0014'                                         @SCA 27197670
XSF_MIV_DTYPE  EQU X'01'                                           @SCA 27200660
* **************************************************************** @SCA 27203650
XSF_SFI_MOV_ID EQU X'85A900' Moving-Out Volume                     @SCA 27206640
XSF_MOV_LENGTH EQU X'0014'                                         @SCA 27209630
XSF_MOV_DTYPE  EQU X'01'                                           @SCA 27212620
* ********************************************************************  27220800
XSF_SFI_MOVM_ID EQU X'85B000' Move Mode                                 27252900
XSF_MOVM_LENGTH EQU X'0009'                                             27285000
XSF_MOVM_DTYPE  EQU X'03'                                               27317100
*                                                                       27349200
XSF_MOVM_DATA_AUTO   EQU X'00'                                          27381300
XSF_MOVM_DATA_MANUAL EQU X'01'                                          27413400
* ********************************************************************  27445500
XSF_SFI_MOP_ID EQU X'85C000' Master Overwrite                           27477600
XSF_MOP_LENGTH EQU X'0009'                                              27509700
XSF_MOP_DTYPE  EQU X'03'                                                27541800
*                                                                       27573900
XSF_MOP_DATA_ADD   EQU X'01'                                            27606000
XSF_MOP_DATA_LAST  EQU X'02'                                            27638100
XSF_MOP_DATA_MATCH EQU X'03'                                            27670200
XSF_MOP_DATA_USER  EQU X'04'                                            27702300
* ********************************************************************  27734400
XSF_SFI_MRP_ID EQU X'85D000' Maximum Retention Period                   27766500
XSF_MRP_LENGTH EQU X'000C'                                              27798600
XSF_MRP_DTYPE  EQU X'05'                                                27830700
* ********************************************************************  27862800
XSF_SFI_MSGF_ID EQU X'85E000' Case of Message Text                      27894900
XSF_MSGF_LENGTH EQU X'0009'                                             27927000
XSF_MSGF_DTYPE  EQU X'03'                                               27959100
*                                                                       27991200
XSF_MSGF_DATA_MIXED EQU X'00'                                           28023300
XSF_MSGF_DATA_UPPER EQU X'01'                                           28055400
* ********************************************************************  28087500
XSF_SFI_MST_ID EQU X'85F000' Move Status                                28119600
XSF_MST_LENGTH EQU X'0009'                                              28151700
XSF_MST_DTYPE  EQU X'03'                                                28183800
*                                                                       28215900
XSF_MST_DATA_UNKNOWN   EQU X'00'                                        28248000
XSF_MST_DATA_PENDING   EQU X'01'                                        28280100
XSF_MST_DATA_CONFIRMED EQU X'02'                                        28312200
XSF_MST_DATA_COMPLETE  EQU X'03'                                        28344300
* ********************************************************************  28376400
XSF_SFI_MTM_ID EQU X'860000' CDS Create Time                            28408500
XSF_MTM_LENGTH EQU X'000C'                                              28440600
XSF_MTM_DTYPE  EQU X'0A'                                                28472700
* ********************************************************************  28504800
XSF_SFI_MTO_ID EQU X'861000' Target Location Name                       28536900
XSF_MTO_LENGTH EQU X'0010'                                              28569000
XSF_MTO_DTYPE  EQU X'07'                                                28601100
* ********************************************************************  28633200
XSF_SFI_MTP_ID EQU X'862000' CDS Type                                   28665300
XSF_MTP_LENGTH EQU X'0009'                                              28697400
XSF_MTP_DTYPE  EQU X'03'                                                28729500
*                                                                       28761600
XSF_MTP_DATA_MASTER EQU X'00'                                           28793700
* ********************************************************************  28825800
XSF_SFI_MTY_ID EQU X'862800' Move Type                                  28857900
XSF_MTY_LENGTH EQU X'0009'                                              28890000
XSF_MTY_DTYPE  EQU X'03'                                                28922100
*                                                                       28954200
XSF_MTY_DATA_NOTRTS EQU X'00'                                           28986300
XSF_MTY_DATA_RTS    EQU X'01'                                           29018400
* ********************************************************************  29050500
XSF_SFI_MVBY_ID      EQU X'862B00' Move by                        @LFA  29054500
XSF_MVBY_LENGTH      EQU X'0009'                                  @LFA  29058500
XSF_MVBY_DTYPE       EQU X'03'                                    @LFA  29062500
*                                                                 @LFA  29066500
XSF_MVBY_DATA_VOLUME EQU X'00'                                    @LFA  29070500
XSF_MVBY_DATA_SET    EQU X'01'                                    @LFA  29074500
* ********************************************************************  29078500
XSF_SFI_MVS_ID EQU X'863000' MVS Use                                    29082600
XSF_MVS_LENGTH EQU X'0009'                                              29114700
XSF_MVS_DTYPE  EQU X'03'                                                29146800
*                                                                       29178900
XSF_MVS_DATA_NO  EQU X'00'                                              29211000
XSF_MVS_DATA_YES EQU X'01'                                              29243100
* ********************************************************************  29275200
XSF_SFI_NLOC_ID EQU X'865000' Required Location                         29307300
XSF_NLOC_LENGTH EQU X'0010'                                             29339400
XSF_NLOC_DTYPE  EQU X'07'                                               29371500
* **************************************************************** @SCA 29373490
XSF_SFI_NLOT_ID EQU X'865200' Required Location Type               @SCA 29375480
XSF_NLOT_LENGTH EQU X'0009'                                        @SCA 29377470
XSF_NLOT_DTYPE  EQU X'03'                                          @SCA 29379460
*                                                                  @SCA 29381450
XSF_NLOT_DATA_SHELF               EQU X'00'                        @SCA 29383440
XSF_NLOT_DATA_STORE_BUILTIN_BINS  EQU X'01'                        @SCA 29385430
XSF_NLOT_DATA_MANUAL              EQU X'02'                        @SCA 29387420
XSF_NLOT_DATA_AUTO                EQU X'03'                        @SCA 29389410
XSF_NLOT_DATA_STORE_BINS          EQU X'04'                        @SCA 29391400
XSF_NLOT_DATA_STORE_NOBINS        EQU X'05'                        @SCA 29393390
* ********************************************************************  29403600
XSF_SFI_NME_ID EQU X'866000' Security Class Name                        29435700
XSF_NME_LENGTH EQU X'0010'                                              29467800
XSF_NME_DTYPE  EQU X'07'                                                29499900
* ********************************************************************  29532000
XSF_SFI_NOT_ID EQU X'866800' Notify                                     29564100
XSF_NOT_LENGTH EQU X'0009'                                              29596200
XSF_NOT_DTYPE  EQU X'03'                                                29628300
*                                                                       29660400
XSF_NOT_DATA_NO  EQU X'00'                                              29692500
XSF_NOT_DATA_YES EQU X'01'                                              29724600
* ********************************************************************  29756700
XSF_SFI_NVL_ID EQU X'867000' Next Volume                                29788800
XSF_NVL_LENGTH EQU X'000E'                                              29820900
XSF_NVL_DTYPE  EQU X'01'                                                29853000
* ********************************************************************  29885100
XSF_SFI_NVRS_ID EQU X'868000' Next VRS Name                             29917200
XSF_NVRS_LENGTH EQU X'0010'                                             29949300
XSF_NVRS_DTYPE  EQU X'07'                                               29981400
* ********************************************************************  30013500
XSF_SFI_OAC_ID EQU X'869000' Owner Access                               30045600
XSF_OAC_LENGTH EQU X'0009'                                              30077700
XSF_OAC_DTYPE  EQU X'03'                                                30109800
*                                                                       30141900
XSF_OAC_DATA_READ   EQU X'00'                                           30174000
XSF_OAC_DATA_UPDATE EQU X'01'                                           30206100
XSF_OAC_DATA_ALTER  EQU X'02'                                           30238200
* ********************************************************************  30270300
XSF_SFI_OBMN_ID EQU X'86A000' Old Bin Number Media Name                 30302400
XSF_OBMN_LENGTH EQU X'0010'                                             30334500
XSF_OBMN_DTYPE  EQU X'07'                                               30366600
* ********************************************************************  30398700
XSF_SFI_OBN_ID EQU X'86B000' Old Bin Number                             30430800
XSF_OBN_LENGTH EQU X'000E'                                              30462900
XSF_OBN_DTYPE  EQU X'01'                                                30495000
* ********************************************************************  30527100
XSF_SFI_OCE_ID EQU X'86B800' Vol Info Recorded at OCEOV                 30559200
XSF_OCE_LENGTH EQU X'0009'                                              30591300
XSF_OCE_DTYPE  EQU X'03'                                                30623400
*                                                                       30655500
XSF_OCE_DATA_NO  EQU X'00'                                              30687600
XSF_OCE_DATA_YES EQU X'01'                                              30719700
* ********************************************************************  30751800
XSF_SFI_OLOC_ID EQU X'86C000' Old Location                              30783900
XSF_OLOC_LENGTH EQU X'0010'                                             30816000
XSF_OLOC_DTYPE  EQU X'07'                                               30848100
* **************************************************************** @SCA 30850090
XSF_SFI_OLOT_ID EQU X'86C200' Old Location Type                    @SCA 30852080
XSF_OLOT_LENGTH EQU X'0009'                                        @SCA 30854070
XSF_OLOT_DTYPE  EQU X'03'                                          @SCA 30856060
*                                                                  @SCA 30858050
XSF_OLOT_DATA_SHELF               EQU X'00'                        @SCA 30860040
XSF_OLOT_DATA_STORE_BUILTIN_BINS  EQU X'01'                        @SCA 30862030
XSF_OLOT_DATA_MANUAL              EQU X'02'                        @SCA 30864020
XSF_OLOT_DATA_AUTO                EQU X'03'                        @SCA 30866010
XSF_OLOT_DATA_STORE_BINS          EQU X'04'                        @SCA 30868000
XSF_OLOT_DATA_STORE_NOBINS        EQU X'05'                        @SCA 30869990
XSF_OLOT_DATA_INCTNR              EQU X'06'                        @SCA 30871980
* ********************************************************************  30880200
XSF_SFI_OPL_ID EQU X'86D000' Position of Rack Number or Pool ID         30912300
XSF_OPL_LENGTH EQU X'000A'                                              30944400
XSF_OPL_DTYPE  EQU X'04'                                                30976500
* ********************************************************************  31008600
XSF_SFI_OPM_ID EQU X'86E000' Operating Mode                             31040700
XSF_OPM_LENGTH EQU X'0009'                                              31072800
XSF_OPM_DTYPE  EQU X'03'                                                31104900
*                                                                       31137000
XSF_OPM_DATA_M  EQU X'01'                                               31169100
XSF_OPM_DATA_R  EQU X'02'                                               31201200
XSF_OPM_DATA_W  EQU X'03'                                               31233300
XSF_OPM_DATA_P  EQU X'04'                                               31265400
* ********************************************************************  31297500
XSF_SFI_OVL_ID EQU X'86F000' Position of Volume Serial                  31329600
XSF_OVL_LENGTH EQU X'000A'                                              31361700
XSF_OVL_DTYPE  EQU X'04'                                                31393800
* **************************************************************** @SCA 31399790
XSF_SFI_OVOL_ID EQU X'86F500' Old Volume                           @SCA 31405780
XSF_OVOL_LENGTH EQU X'000E'                                        @SCA 31411770
XSF_OVOL_DTYPE  EQU X'01'                                          @SCA 31417760
* ********************************************************************  31425900
XSF_SFI_OWN_ID EQU X'870000' Owner                                      31458000
XSF_OWN_LENGTH EQU X'0010'                                              31490100
XSF_OWN_DTYPE  EQU X'07'                                                31522200
* ********************************************************************  31554300
XSF_SFI_OXDJ_ID EQU X'871000' Original Expiration Date                  31586400
XSF_OXDJ_LENGTH EQU X'000C'                                             31618500
XSF_OXDJ_DTYPE  EQU X'09'                                               31650600
* *************************************************************** @04A  31652590
XSF_SFI_PACS_ID EQU X'871800' Pre-ACS support                     @04A  31654580
XSF_PACS_LENGTH EQU X'0009'                                       @04A  31656570
XSF_PACS_DTYPE  EQU X'03'                                         @04A  31658560
*                                                                 @04A  31660550
XSF_PACS_DATA_NO  EQU X'00'                                       @04A  31662540
XSF_PACS_DATA_YES EQU X'01'                                       @04A  31664530
* *************************************************************** @LGA  31667300
XSF_SFI_PDA_ID     EQU X'871E00' PDA state                        @LGA  31684000
XSF_PDA_LENGTH     EQU X'0009'                                    @LGA  31685300
XSF_PDA_DTYPE      EQU X'03'                                      @LGA  31686600
*                                                                 @LGA  31687900
XSF_PDA_DATA_OFF   EQU X'00'                                      @LGA  31689200
XSF_PDA_DATA_ON    EQU X'01'                                      @LGA  31690500
XSF_PDA_DATA_NONE  EQU X'02'                                      @LGA  31691800
* *************************************************************** @LGA  31693100
XSF_SFI_PDAC_ID    EQU X'871E10' PDA block count                  @LGA  31694400
XSF_PDAC_LENGTH    EQU X'0009'                                    @LGA  31695700
XSF_PDAC_DTYPE     EQU X'03'                                      @LGA  31697000
* *************************************************************** @LGA  31698300
XSF_SFI_PDAL_ID    EQU X'871E30' PDA log state                    @LGA  31699600
XSF_PDAL_LENGTH    EQU X'0009'                                    @LGA  31700900
XSF_PDAL_DTYPE     EQU X'03'                                      @LGA  31702200
*                                                                 @LGA  31703500
XSF_PDAL_DATA_OFF  EQU X'00'                                      @LGA  31704800
XSF_PDAL_DATA_ON   EQU X'01'                                      @LGA  31706100
* *************************************************************** @LGA  31707400
XSF_SFI_PDAS_ID    EQU X'871E90' PDA block size                   @LGA  31708700
XSF_PDAS_LENGTH    EQU X'0009'                                    @LGA  31710000
XSF_PDAS_DTYPE     EQU X'03'                                      @LGA  31711300
* ********************************************************************  31712600
XSF_SFI_PDS_ID EQU X'872000' Pool Description                           31714800
XSF_PDS_LENGTH EQU X'0030'                                              31746900
XSF_PDS_DTYPE  EQU X'07'                                                31779000
* ********************************************************************  31811100
XSF_SFI_PDSC_ID EQU X'873000' Product Description                       31843200
XSF_PDSC_LENGTH EQU X'0028'                                             31875300
XSF_PDSC_DTYPE  EQU X'07'                                               31907400
* ********************************************************************  31939500
XSF_SFI_PEND_ID EQU X'874000' Actions Pending                           31971600
XSF_PEND_LENGTH EQU X'0009'                                             32003700
XSF_PEND_DTYPE  EQU X'02'                                               32035800
*                                                                       32067900
XSF_PEND_FLAG_SCRATCH EQU X'80'                                         32100000
XSF_PEND_FLAG_REPLACE EQU X'40'                                         32132100
XSF_PEND_FLAG_INIT EQU X'20'                                            32164200
XSF_PEND_FLAG_ERASE EQU X'10'                                           32196300
XSF_PEND_FLAG_RETURN EQU X'08'                                          32228400
XSF_PEND_FLAG_NOTIFY EQU X'04'                                          32260500
* ********************************************************************  32292600
XSF_SFI_PID_ID EQU X'875000' Pool Prefix                                32324700
XSF_PID_LENGTH EQU X'000E'                                              32356800
XSF_PID_DTYPE  EQU X'07'                                                32388900
* ********************************************************************  32421000
XSF_SFI_PLN_ID EQU X'876000' Pool Name                                  32453100
XSF_PLN_LENGTH EQU X'0010'                                              32485200
XSF_PLN_DTYPE  EQU X'07'                                                32517300
* ********************************************************************  32549400
XSF_SFI_PNME_ID EQU X'877000' Product Software Name                     32581500
XSF_PNME_LENGTH EQU X'0026'                                             32613600
XSF_PNME_DTYPE  EQU X'07'                                               32645700
* ********************************************************************  32677800
XSF_SFI_PNUM_ID EQU X'878000' Software Product Number                   32709900
XSF_PNUM_LENGTH EQU X'0010'                                             32742000
XSF_PNUM_DTYPE  EQU X'07'                                               32774100
* ********************************************************************  32806200
XSF_SFI_PRD_ID EQU X'879000' Permanent Read Errors                      32838300
XSF_PRD_LENGTH EQU X'000C'                                              32870400
XSF_PRD_DTYPE  EQU X'05'                                                32902500
* ********************************************************************  32934600
XSF_SFI_PRF_ID EQU X'87A000' Pool Def RACF Option                       32966700
XSF_PRF_LENGTH EQU X'0009'                                              32998800
XSF_PRF_DTYPE  EQU X'03'                                                33030900
*                                                                       33063000
XSF_PRF_DATA_NO  EQU X'00'                                              33095100
XSF_PRF_DATA_YES EQU X'01'                                              33127200
* ********************************************************************  33159300
XSF_SFI_PRTY_ID EQU X'87B000' Priority                                  33191400
XSF_PRTY_LENGTH EQU X'000C'                                             33223500
XSF_PRTY_DTYPE  EQU X'05'                                               33255600
* ********************************************************************  33287700
XSF_SFI_PSFX_ID EQU X'87C000' Parmlib Member Suffix                     33319800
XSF_PSFX_LENGTH EQU X'000A'                                             33351900
XSF_PSFX_DTYPE  EQU X'01'                                               33384000
* ********************************************************************  33416100
XSF_SFI_PSN_ID EQU X'87D000' Pool Definition System ID                  33448200
XSF_PSN_LENGTH EQU X'0010'                                              33480300
XSF_PSN_DTYPE  EQU X'07'                                                33512400
* ********************************************************************  33544500
XSF_SFI_PTP_ID EQU X'87E000' Pool Def Pool Type                         33576600
XSF_PTP_LENGTH EQU X'0009'                                              33608700
XSF_PTP_DTYPE  EQU X'03'                                                33640800
*                                                                       33672900
XSF_PTP_DATA_SCRATCH EQU X'00'                                          33705000
XSF_PTP_DATA_RACK    EQU X'01'                                          33737100
* ********************************************************************  33769200
XSF_SFI_PVL_ID EQU X'87F000' Previous Volume                            33801300
XSF_PVL_LENGTH EQU X'000E'                                              33833400
XSF_PVL_DTYPE  EQU X'01'                                                33865500
* ********************************************************************  33897600
XSF_SFI_PWT_ID EQU X'880000' Permanent Write Errors                     33929700
XSF_PWT_LENGTH EQU X'000C'                                              33961800
XSF_PWT_DTYPE  EQU X'05'                                                33993900
* ********************************************************************  34026000
XSF_SFI_RBN_ID EQU X'881000' # Bin Numbers in REMOTE                    34058100
XSF_RBN_LENGTH EQU X'000C'                                              34090200
XSF_RBN_DTYPE  EQU X'05'                                                34122300
* *************************************************************** @LGA  34140300
XSF_SFI_RBYS_ID    EQU X'881200' Retain by set                    @LGA  34158400
XSF_RBYS_LENGTH    EQU X'0009'                                    @LGA  34162400
XSF_RBYS_DTYPE     EQU X'03'                                      @LGA  34166400
*                                                                 @LGA  34170400
XSF_RBYS_DATA_NO   EQU X'00'                                      @LGA  34174400
XSF_RBYS_DATA_YES  EQU X'01'                                      @LGA  34178400
* ********************************************************************  34182400
XSF_SFI_RCF_ID EQU X'882000' Installation RACF Support                  34186500
XSF_RCF_LENGTH EQU X'0009'                                              34218600
XSF_RCF_DTYPE  EQU X'03'                                                34250700
*                                                                       34282800
XSF_RCF_DATA_N  EQU X'01'                                               34314900
XSF_RCF_DATA_P  EQU X'02'                                               34347000
XSF_RCF_DATA_A  EQU X'03'                                               34379100
* ********************************************************************  34411200
XSF_SFI_RCFM_ID EQU X'883000' Record Format                             34443300
XSF_RCFM_LENGTH EQU X'000C'                                             34475400
XSF_RCFM_DTYPE  EQU X'07'                                               34507500
* ********************************************************************  34539600
XSF_SFI_RCK_ID EQU X'884000' Rack or Bin Number                         34571700
XSF_RCK_LENGTH EQU X'000E'                                              34603800
XSF_RCK_DTYPE  EQU X'01'                                                34635900
* ********************************************************************  34668000
XSF_SFI_RDTJ_ID EQU X'886000' Last CDS Extract Date                     34700100
XSF_RDTJ_LENGTH EQU X'000C'                                             34732200
XSF_RDTJ_DTYPE  EQU X'09'                                               34764300
* ********************************************************************  34796400
XSF_SFI_RET_ID EQU X'888000' Retention Type                             34828500
XSF_RET_LENGTH EQU X'000B'                                              34860600
XSF_RET_DTYPE  EQU X'03'                                                34892700
*                                                                       34924800
XSF_RET_DATA1_WHILEC   EQU X'01'                                        34956900
XSF_RET_DATA2_UNTILEXP EQU X'01'                                        34989000
XSF_RET_DATA3_CYCLES   EQU X'01'                                        35021100
XSF_RET_DATA3_DAYS     EQU X'02'                                        35053200
XSF_RET_DATA3_REFDAYS  EQU X'03'                                        35085300
XSF_RET_DATA3_VOLUMES  EQU X'04'                                        35117400
XSF_RET_DATA3_EXTDAYS  EQU X'05'                                   @01A 35128100
XSF_RET_DATA3_DAYCYCL  EQU X'06'                                   @01A 35138800
* ********************************************************************  35149500
XSF_SFI_RST_ID EQU X'88A000' Rack or Bin Status                         35181600
XSF_RST_LENGTH EQU X'0009'                                              35213700
XSF_RST_DTYPE  EQU X'03'                                                35245800
*                                                                       35277900
XSF_RST_DATA_EMPTY EQU X'00'                                            35310000
XSF_RST_DATA_FREE  EQU X'01'                                            35342100
XSF_RST_DATA_INUSE EQU X'02'                                            35374200
* *************************************************************** @LFA  35378200
XSF_SFI_RTBY_ID EQU X'88B900' Retain by                           @LFA  35382200
XSF_RTBY_LENGTH EQU X'0009'                                       @LFA  35386200
XSF_RTBY_DTYPE  EQU X'03'                                         @LFA  35390200
*                                                                 @LFA  35394200
XSF_RTBY_DATA_VOLUME EQU X'00'                                    @LFA  35398200
XSF_RTBY_DATA_SET    EQU X'01'                                    @LFA  35402200
* ********************************************************************  35406300
XSF_SFI_RTDJ_ID EQU X'88C000' Retention Date                            35438400
XSF_RTDJ_LENGTH EQU X'000C'                                             35470500
XSF_RTDJ_DTYPE  EQU X'09'                                               35502600
* ********************************************************************  35534700
XSF_SFI_RTM_ID EQU X'88E000' Last CDS Extract Time                      35566800
XSF_RTM_LENGTH EQU X'000C'                                              35598900
XSF_RTM_DTYPE  EQU X'0A'                                                35631000
* **************************************************************** @SCA 35634990
XSF_SFI_RUB_ID EQU X'88E500' Reuse Bin                             @SCA 35638980
XSF_RUB_LENGTH EQU X'0009'                                         @SCA 35642970
XSF_RUB_DTYPE  EQU X'03'                                           @SCA 35646960
*                                                                  @SCA 35650950
XSF_RUB_DATA_CONFIRMMOVE EQU X'00'                                 @SCA 35654940
XSF_RUB_DATA_STARTMOVE   EQU X'01'                                 @SCA 35658930
* ********************************************************************  35663100
XSF_SFI_SC_ID EQU X'890000' Storage Class                               35695200
XSF_SC_LENGTH EQU X'0010'                                               35727300
XSF_SC_DTYPE  EQU X'07'                                                 35759400
* ********************************************************************  35791500
XSF_SFI_SCST_ID EQU X'892000' Security Class Status                     35823600
XSF_SCST_LENGTH EQU X'0009'                                             35855700
XSF_SCST_DTYPE  EQU X'02'                                               35887800
*                                                                       35919900
XSF_SCST_FLAG_SMF    EQU X'80'                                          35952000
XSF_SCST_FLAG_MSGOPT EQU X'40'                                          35984100
XSF_SCST_FLAG_ERASE  EQU X'20'                                          36016200
* ********************************************************************  36048300
XSF_SFI_SC1_ID EQU X'894000' Store Number                               36080400
XSF_SC1_LENGTH EQU X'000C'                                              36112500
XSF_SC1_DTYPE  EQU X'05'                                                36144600
* ********************************************************************  36176700
XSF_SFI_SDTJ_ID EQU X'895000' Movement Tracking Date                    36208800
XSF_SDTJ_LENGTH EQU X'000C'                                             36240900
XSF_SDTJ_DTYPE  EQU X'09'                                               36273000
* ********************************************************************  36305100
XSF_SFI_SEC_ID EQU X'896000' Security Class Number                      36337200
XSF_SEC_LENGTH EQU X'0009'                                              36369300
XSF_SEC_DTYPE  EQU X'03'                                                36401400
* ********************************************************************  36433500
XSF_SFI_SEQ_ID EQU X'898000' Volume Sequence                            36465600
XSF_SEQ_LENGTH EQU X'000C'                                              36497700
XSF_SEQ_DTYPE  EQU X'05'                                                36529800
* ********************************************************************  36561900
XSF_SFI_SG_ID EQU X'89A000' Storage Group Name                          36594000
XSF_SG_LENGTH EQU X'0010'                                               36626100
XSF_SG_DTYPE  EQU X'07'                                                 36658200
* ********************************************************************  36690300
XSF_SFI_SID_ID EQU X'89B000' RMM System ID                              36722400
XSF_SID_LENGTH EQU X'0010'                                              36754500
XSF_SID_DTYPE  EQU X'07'                                                36786600
* ********************************************************************  36818700
XSF_SFI_SLM_ID EQU X'89C000' MAXHOLD Value                              36850800
XSF_SLM_LENGTH EQU X'000A'                                              36882900
XSF_SLM_DTYPE  EQU X'04'                                                36915000
* ********************************************************************  36947100
XSF_SFI_SMI_ID EQU X'89E000' Offset to Message ID                       36979200
XSF_SMI_LENGTH EQU X'000A'                                              37011300
XSF_SMI_DTYPE  EQU X'04'                                                37043400
* ********************************************************************  37044390
XSF_SFI_SMP_ID EQU X'89E210' SMSTAPE purge                         @LXA 37045380
XSF_SMP_LENGTH EQU X'0009'                                         @LXA 37046370
XSF_SMP_DTYPE  EQU X'03'                                           @LXA 37047360
*                                                                  @LXA 37048350
XSF_SMP_DATA_NO   EQU X'00'                                        @LXA 37049340
XSF_SMP_DATA_YES  EQU X'01'                                        @LXA 37050330
XSF_SMP_DATA_ASIS EQU X'02'                                        @LXA 37051320
* ********************************************************************  37052310
XSF_SFI_SMU_ID EQU X'89E220' SMSTAPE update                        @LXA 37053300
XSF_SMU_LENGTH EQU X'0009'                                         @LXA 37054290
XSF_SMU_DTYPE  EQU X'02'                                           @LXA 37055280
*                                                                  @LXA 37056270
XSF_SMU_DATA_EXITS    EQU X'80'                                    @LXA 37057260
XSF_SMU_DATA_SCRATCH  EQU X'40'                                    @LXA 37058250
XSF_SMU_DATA_COMMANDS EQU X'20'                                    @LXA 37059240
                                                                        37060230
* ********************************************************************  37075500
XSF_SFI_SOSJ_ID EQU X'89F000' Last XPROC Start Date                     37107600
XSF_SOSJ_LENGTH EQU X'000C'                                             37139700
XSF_SOSJ_DTYPE  EQU X'09'                                               37171800
* ********************************************************************  37203900
XSF_SFI_SOSP_ID EQU X'8A0000' Scratch Procedure Name                    37236000
XSF_SOSP_LENGTH EQU X'0010'                                             37268100
XSF_SOSP_DTYPE  EQU X'07'                                               37300200
* ********************************************************************  37332300
XSF_SFI_SOST_ID EQU X'8A1000' Last XPROC Start Time                     37364400
XSF_SOST_LENGTH EQU X'000C'                                             37396500
XSF_SOST_DTYPE  EQU X'0A'                                               37428600
* ********************************************************************  37460700
XSF_SFI_SSM_ID EQU X'8A2000' SMF Security Record Number                 37492800
XSF_SSM_LENGTH EQU X'000A'                                              37524900
XSF_SSM_DTYPE  EQU X'04'                                                37557000
* ********************************************************************  37589100
XSF_SFI_STEP_ID EQU X'8A3000' Step Name                                 37621200
XSF_STEP_LENGTH EQU X'0010'                                             37653300
XSF_STEP_DTYPE  EQU X'07'                                               37685400
* *************************************************************** @LGA  37691800
XSF_SFI_STVC_ID EQU X'8A3800' Stacked volume count                @LGA  37698200
XSF_STVC_LENGTH EQU X'000C'                                       @LGA  37704600
XSF_STVC_DTYPE  EQU X'05'                                         @LGA  37711000
* ********************************************************************  37717500
XSF_SFI_SUR_ID EQU X'8A4000' Owner''s Surname                           37749600
XSF_SUR_LENGTH EQU X'001C'                                              37781700
XSF_SUR_DTYPE  EQU X'07'                                                37813800
* ********************************************************************  37845900
XSF_SFI_SYS_ID EQU X'8A5000' Creating System ID                    @05C 37878000
XSF_SYS_LENGTH EQU X'0010'                                              37910100
XSF_SYS_DTYPE  EQU X'07'                                                37942200
* ********************************************************************  37974300
XSF_SFI_TAC_ID EQU X'8A6000' Reject Type                                38006400
XSF_TAC_LENGTH EQU X'0009'                                              38038500
XSF_TAC_DTYPE  EQU X'03'                                                38070600
*                                                                       38102700
XSF_TAC_DATA_ANYUSE EQU X'00'                                           38134800
XSF_TAC_DATA_OUTPUT EQU X'01'                                           38166900
* ********************************************************************  38199000
XSF_SFI_TRD_ID EQU X'8A7000' Temporary Read Errors                      38231100
XSF_TRD_LENGTH EQU X'000C'                                              38263200
XSF_TRD_DTYPE  EQU X'05'                                                38295300
* ********************************************************************  38298800
XSF_SFI_TVXP_ID EQU X'8A7900' TVEXT purge                          @03A 38302300
XSF_TVXP_LENGTH EQU X'0009'                                        @03A 38305800
XSF_TVXP_DTYPE  EQU X'03'                                          @03A 38309300
*                                                                  @03A 38312800
XSF_TVXP_DATA_RELEASE  EQU X'00'                                   @03A 38316300
XSF_TVXP_DATA_EXPIRE   EQU X'01'                                   @03A 38319800
XSF_TVXP_DATA_NONE     EQU X'02'                                   @03A 38323300
* ********************************************************************  38327400
XSF_SFI_TWT_ID EQU X'8A8000' Temporary Write Errors                     38359500
XSF_TWT_LENGTH EQU X'000C'                                              38391600
XSF_TWT_DTYPE  EQU X'05'                                                38423700
* ********************************************************************  38455800
XSF_SFI_TYP_ID EQU X'8A9000' VRS Type                                   38487900
XSF_TYP_LENGTH EQU X'0009'                                              38520000
XSF_TYP_DTYPE  EQU X'02'                                                38552100
*                                                                       38584200
XSF_TYP_FLAG_GDG      EQU X'80'                                         38616300
XSF_TYP_FLAG_PSEUDGDG EQU X'40'                                         38648400
XSF_TYP_FLAG_DSNAME   EQU X'20'                                         38680500
XSF_TYP_FLAG_VOLUME   EQU X'10'                                         38712600
XSF_TYP_FLAG_NAME     EQU X'08'                                         38744700
* ********************************************************************  38776800
XSF_SFI_UID_ID EQU X'8AB001' User ID                                    38808900
XSF_UID_LENGTH EQU X'0010'                                              38841000
XSF_UID_DTYPE  EQU X'07'                                                38873100
* ********************************************************************  38905200
XSF_SFI_UNC_ID EQU X'8AC000' Uncatalog Option                           38937300
XSF_UNC_LENGTH EQU X'0009'                                              38969400
XSF_UNC_DTYPE  EQU X'03'                                                39001500
*                                                                       39033600
XSF_UNC_DATA_N  EQU X'00'                                               39065700
XSF_UNC_DATA_Y  EQU X'01'                                               39097800
XSF_UNC_DATA_S  EQU X'02'                                               39129900
* ********************************************************************  39162000
XSF_SFI_USEC_ID EQU X'8AD000' Volume Use Count                          39194100
XSF_USEC_LENGTH EQU X'000C'                                             39226200
XSF_USEC_DTYPE  EQU X'05'                                               39258300
* ********************************************************************  39290400
XSF_SFI_USEM_ID EQU X'8AE000' Volume Usage (KB)                         39322500
XSF_USEM_LENGTH EQU X'000C'                                             39354600
XSF_USEM_DTYPE  EQU X'05'                                               39386700
* ********************************************************************  39418800
XSF_SFI_VAC_ID EQU X'8AF001' Volume Access                              39450900
XSF_VAC_LENGTH EQU X'0009'                                              39483000
XSF_VAC_DTYPE  EQU X'03'                                                39515100
*                                                                       39547200
XSF_VAC_DATA_NONE   EQU X'00'                                           39579300
XSF_VAC_DATA_READ   EQU X'01'                                           39611400
XSF_VAC_DATA_UPDATE EQU X'02'                                           39643500
* ********************************************************************  39675600
XSF_SFI_VACT_ID EQU X'8B0000' VRSMIN action                             39707700
XSF_VACT_LENGTH EQU X'0009'                                             39739800
XSF_VACT_DTYPE  EQU X'03'                                               39771900
*                                                                       39804000
XSF_VACT_DATA_FAIL EQU X'00'                                            39836100
XSF_VACT_DATA_INFO EQU X'01'                                            39868200
XSF_VACT_DATA_WARN EQU X'02'                                            39900300
* *****************************************************************@01A 39903800
XSF_SFI_VANX_ID EQU X'8B0800' Next VRS type                        @01A 39907300
XSF_VANX_LENGTH EQU X'0009'                                        @01A 39910800
XSF_VANX_DTYPE  EQU X'03'                                          @01A 39914300
*                                                                  @01A 39917800
XSF_VANX_DATA_NONE   EQU X'00'                                     @01A 39921300
XSF_VANX_DATA_NEXT   EQU X'01'                                     @01A 39924800
XSF_VANX_DATA_AND    EQU X'02'                                     @01A 39928300
* ********************************************************************  39932400
XSF_SFI_VCAP_ID EQU X'8B0B00' Volume Capacity                      @S9A 39938800
XSF_VCAP_LENGTH EQU X'000C'                                        @S9A 39945200
XSF_VCAP_DTYPE  EQU X'05'                                          @S9A 39951600
* ********************************************************************  39958000
XSF_SFI_VCHG_ID EQU X'8B1000' VRSCHANGE Value                           39964500
XSF_VCHG_LENGTH EQU X'0009'                                             39996600
XSF_VCHG_DTYPE  EQU X'03'                                               40028700
*                                                                       40060800
XSF_VCHG_DATA_INFO   EQU X'00'                                          40092900
XSF_VCHG_DATA_VERIFY EQU X'01'                                          40125000
* ********************************************************************  40157100
XSF_SFI_VDD_ID EQU X'8B2000' VRS Delay Days                             40189200
XSF_VDD_LENGTH EQU X'000A'                                              40221300
XSF_VDD_DTYPE  EQU X'04'                                                40253400
* ********************************************************************  40285500
XSF_SFI_VDTJ_ID EQU X'8B3000' Last Inven Mgt Proc Date                  40317600
XSF_VDTJ_LENGTH EQU X'000C'                                             40349700
XSF_VDTJ_DTYPE  EQU X'09'                                               40381800
* ********************************************************************  40413900
XSF_SFI_VER_ID EQU X'8B4000' Software Product Version                   40446000
XSF_VER_LENGTH EQU X'000E'                                              40478100
XSF_VER_DTYPE  EQU X'07'                                                40510200
* ********************************************************************  40542300
XSF_SFI_VJBN_ID EQU X'8B5000' Primary VRS Job Name                 @01C 40574400
XSF_VJBN_LENGTH EQU X'0010'                                             40606500
XSF_VJBN_DTYPE  EQU X'07'                                               40638600
* ********************************************************************  40670700
XSF_SFI_VLN_ID EQU X'8B6000' Number of Volumes                          40702800
XSF_VLN_LENGTH EQU X'000C'                                              40734900
XSF_VLN_DTYPE  EQU X'05'                                                40767000
* ********************************************************************  40799100
XSF_SFI_VM_ID EQU X'8B7000' VM Use                                      40831200
XSF_VM_LENGTH EQU X'0009'                                               40863300
XSF_VM_DTYPE  EQU X'03'                                                 40895400
*                                                                       40927500
XSF_VM_DATA_NO  EQU X'00'                                               40959600
XSF_VM_DATA_YES EQU X'01'                                               40991700
* ********************************************************************  41023800
XSF_SFI_VMIN_ID EQU X'8B8000' VRSMIN Count Value                        41055900
XSF_VMIN_LENGTH EQU X'000C'                                             41088000
XSF_VMIN_DTYPE  EQU X'05'                                               41120100
* ********************************************************************  41152200
XSF_SFI_VMV_ID EQU X'8B9000' VRS Management Value                       41184300
XSF_VMV_LENGTH EQU X'0010'                                              41216400
XSF_VMV_DTYPE  EQU X'07'                                                41248500
* ********************************************************************  41280600
XSF_SFI_VNME_ID EQU X'8BA000' Primary VRS Name                     @01C 41312700
XSF_VNME_LENGTH EQU X'0034'                                             41344800
XSF_VNME_DTYPE  EQU X'07'                                               41376900
* ********************************************************************  41409000
XSF_SFI_VOL_ID EQU X'8BC000' Volume Serial                              41441100
XSF_VOL_LENGTH EQU X'000E'                                              41473200
XSF_VOL_DTYPE  EQU X'01'                                                41505300
* **************************************************************** @S8A 41509300
XSF_SFI_VOLT_ID EQU X'8BC200' Volume Type                          @S8A 41513300
XSF_VOLT_LENGTH EQU X'0009'                                        @S8A 41517300
XSF_VOLT_DTYPE  EQU X'03'                                          @S8A 41521300
*                                                                  @S8A 41525300
XSF_VOLT_PHYSICAL EQU X'00'                                        @S8A 41529300
XSF_VOLT_LOGICAL  EQU X'01'                                        @S8A 41533300
* **************************************************************** @S9A 41534100
XSF_SFI_VPCT_ID EQU X'8BC300' Volume Percent Full                  @S9A 41534900
XSF_VPCT_LENGTH EQU X'0009'                                        @S9A 41535700
XSF_VPCT_DTYPE  EQU X'03'                                          @S9A 41536500
* ********************************************************************  41537400
XSF_SFI_VRC_ID EQU X'8BD000' Vital Record Count                         41569500
XSF_VRC_LENGTH EQU X'000C'                                              41601600
XSF_VRC_DTYPE  EQU X'05'                                                41633700
* ********************************************************************  41665800
XSF_SFI_VRJ_ID EQU X'8BE000' VRS Job Name                               41697900
XSF_VRJ_LENGTH EQU X'0009'                                              41730000
XSF_VRJ_DTYPE  EQU X'03'                                                41762100
*                                                                       41794200
XSF_VRJ_DATA_1 EQU X'01'                                                41826300
XSF_VRJ_DATA_2 EQU X'02'                                                41858400
* ********************************************************************  41890500
XSF_SFI_VRS_ID EQU X'8BF000' Vital Record Specification                 41922600
XSF_VRS_LENGTH EQU X'0034'                                              41954700
XSF_VRS_DTYPE  EQU X'07'                                                41986800
* **************************************************************** @01A 41988900
XSF_SFI_VRSI_ID EQU X'8BF500' Scratch Immediate                    @01A 41991000
XSF_VRSI_LENGTH EQU X'0009'                                        @01A 41993100
XSF_VRSI_DTYPE  EQU X'03'                                          @01A 41995200
*                                                                  @01A 41997300
XSF_VRSI_DATA_NO  EQU X'00'                                        @01A 41999400
XSF_VRSI_DATA_YES EQU X'01'                                        @01A 42001500
* **************************************************************** @01A 42003600
XSF_SFI_VRSL_ID EQU X'8BFA00' VRSEL value                          @01A 42005700
XSF_VRSL_LENGTH EQU X'0009'                                        @01A 42007800
XSF_VRSL_DTYPE  EQU X'03'                                          @01A 42009900
*                                                                  @01A 42012000
XSF_VRSL_DATA_OLD EQU X'00'                                        @01A 42014100
XSF_VRSL_DATA_NEW EQU X'01'                                        @01A 42016200
* ********************************************************************  42018900
XSF_SFI_VRSR_ID EQU X'8C0000' VRS Retained                              42051000
XSF_VRSR_LENGTH EQU X'0009'                                             42083100
XSF_VRSR_DTYPE  EQU X'03'                                               42115200
*                                                                       42147300
XSF_VRSR_DATA_NO  EQU X'00'                                             42179400
XSF_VRSR_DATA_YES EQU X'01'                                             42211500
* *****************************************************************@01A 42213500
XSF_SFI_VRXI_ID EQU X'8C0800' Expiration Date Ignore               @01A 42215500
XSF_VRXI_LENGTH EQU X'0009'                                        @01A 42217500
XSF_VRXI_DTYPE  EQU X'03'                                          @01A 42219500
*                                                                  @01A 42221500
XSF_VRXI_DATA_NO  EQU X'00'                                        @01A 42223500
XSF_VRXI_DATA_YES EQU X'01'                                        @01A 42225500
* *****************************************************************@01A 42227500
XSF_SFI_VSCD_ID EQU X'8C1000' Primary VRS Subchain start date      @01A 42229500
XSF_VSCD_LENGTH EQU X'000C'                                        @01A 42231500
XSF_VSCD_DTYPE  EQU X'09'                                          @01A 42233500
* *****************************************************************@01A 42235500
XSF_SFI_VSCN_ID EQU X'8C1800' Primary VRS Subchain name            @01A 42237500
XSF_VSCN_LENGTH EQU X'0010'                                        @01A 42239500
XSF_VSCN_DTYPE  EQU X'07'                                          @01A 42241500
* ********************************************************************  42243600
XSF_SFI_VST_ID EQU X'8C2000' Volume Status                              42275700
XSF_VST_LENGTH EQU X'0009'                                              42307800
XSF_VST_DTYPE  EQU X'02'                                                42339900
*                                                                       42372000
XSF_VST_FLAG_MASTER  EQU X'80'                                          42404100
XSF_VST_FLAG_SCRATCH EQU X'40'                                          42436200
XSF_VST_FLAG_USER    EQU X'20'                                          42468300
XSF_VST_FLAG_INIT    EQU X'10'                                          42500400
XSF_VST_FLAG_ENTRY   EQU X'08'                                          42532500
* ********************************************************************  42564600
XSF_SFI_VTM_ID EQU X'8C3000' Last Inven Mgt VRS Time                    42596700
XSF_VTM_LENGTH EQU X'000C'                                              42628800
XSF_VTM_DTYPE  EQU X'0A'                                                42660900
* ********************************************************************  42693000
XSF_SFI_VTYP_ID EQU X'8C4000' Primary VRS Type                     @01C 42725100
XSF_VTYP_LENGTH EQU X'0009'                                             42757200
XSF_VTYP_DTYPE  EQU X'03'                                               42789300
*                                                                       42821400
XSF_VTYP_DATA_UNDEFINED EQU X'00'                                       42853500
XSF_VTYP_DATA_DATASET   EQU X'01'                                       42885600
XSF_VTYP_DATA_SMSMC     EQU X'02'                                       42917700
XSF_VTYP_DATA_VRSMV     EQU X'03'                                       42949800
XSF_VTYP_DATA_DSNMV     EQU X'04'                                       42981900
XSF_VTYP_DATA_DSNMC     EQU X'05'                                  @01A 42997900
* ********************************************************************  43014000
*XSF_SFI_V1_ID EQU X'8C4800' TLCS V1                               @SCD 43066090
*XSF_V1_LENGTH EQU X'0009'                                         @SCD 43086080
*XSF_V1_DTYPE  EQU X'03'                                           @SCD 43106070
*                                                                       43142400
*XSF_V1_DATA_NO  EQU X'00'                                         @SCD 43194490
*XSF_V1_DATA_YES EQU X'01'                                         @SCD 43214480
* ********************************************************************  43238700
XSF_SFI_XDC_ID EQU X'8C5000' Expiration Date Check                      43270800
XSF_XDC_LENGTH EQU X'0009'                                              43302900
XSF_XDC_DTYPE  EQU X'03'                                                43335000
*                                                                       43367100
XSF_XDC_DATA_NO       EQU X'00'                                         43399200
XSF_XDC_DATA_YES      EQU X'01'                                         43431300
XSF_XDC_DATA_OPERATOR EQU X'02'                                         43463400
* ********************************************************************  43495500
XSF_SFI_XDTJ_ID EQU X'8C6000' Expiration Date                           43527600
XSF_XDTJ_LENGTH EQU X'000C'                                             43559700
XSF_XDTJ_DTYPE  EQU X'09'                                               43591800
* ********************************************************************  43623900
XSF_SFI_XTM_ID EQU X'8C7000' Last Inven Mgt Expir Time                  43656000
XSF_XTM_LENGTH EQU X'000C'                                              43688100
XSF_XTM_DTYPE  EQU X'0A'                                                43720200
* **************************************************************** @LGA 43720300
XSF_SFI_X100_ID EQU X'8C7800' Installation exit status EDGUX100    @LGA 43720400
XSF_X100_LENGTH EQU X'0009'                                        @LGA 43720500
XSF_X100_DTYPE  EQU X'03'                                          @LGA 43720600
*                                                                  @LGA 43720700
XSF_X100_DATA_NOEXIT    EQU X'00'                                  @LGA 43720800
XSF_X100_DATA_ENABLED   EQU X'01'                                  @LGA 43720900
XSF_X100_DATA_DISABLED  EQU X'02'                                  @LGA 43721000
* **************************************************************** @LGA 43721100
XSF_SFI_X200_ID EQU X'8C7801' Installation exit status EDGUX200    @LGA 43721200
XSF_X200_LENGTH EQU X'0009'                                        @LGA 43721300
XSF_X200_DTYPE  EQU X'03'                                          @LGA 43721400
*                                                                  @LGA 43721500
XSF_X200_DATA_NOEXIT    EQU X'00'                                  @LGA 43721600
XSF_X200_DATA_ENABLED   EQU X'01'                                  @LGA 43721700
XSF_X200_DATA_DISABLED  EQU X'02'                                  @LGA 43721800
* **************************************************************** @01A 43722000
XSF_SFI_2JBN_ID EQU X'8C8000' Secondary VRS jobname mask           @01A 43723800
XSF_2JBN_LENGTH EQU X'0010'                                        @01A 43725600
XSF_2JBN_DTYPE  EQU X'07'                                          @01A 43727400
* **************************************************************** @01A 43729200
XSF_SFI_2NME_ID EQU X'8C9000' Secondary VRS mask                   @01A 43731000
XSF_2NME_LENGTH EQU X'0010'                                        @01A 43732800
XSF_2NME_DTYPE  EQU X'07'                                          @01A 43734600
* **************************************************************** @01A 43736400
XSF_SFI_2SCD_ID EQU X'8CA000' Secondary VRS subchain start date    @01A 43738200
XSF_2SCD_LENGTH EQU X'000C'                                        @01A 43740000
XSF_2SCD_DTYPE  EQU X'09'                                          @01A 43741800
* **************************************************************** @01A 43743600
XSF_SFI_2SCN_ID EQU X'8CB000' Secondary VRS subchain name          @01A 43745400
XSF_2SCN_LENGTH EQU X'0010'                                        @01A 43747200
XSF_2SCN_DTYPE  EQU X'07'                                          @01A 43749000
.********************************************************************** 43752300
.********************************************************************** 43784400
.********************************************************************** 43816500
.L0002   ANOP                                                           43848600
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 43880700
         AIF   ('&LIST' EQ 'YES').P4                                    43912800
.P3      ANOP                                                           43944900
         POP   PRINT                                                    43977000
.P4      ANOP                                                           44009100
         MEND                                                           44041200
**/ EDGXSF_2:;                                                          44073300
* %EDGXSF_INCLUDED = 'YES';                                             44105400
* %DCL ZCBPRINT CHAR EXT;                                               44137500
* %DEACTIVATE ZCBPRINT;                                                 44169600
* %DCL EDGXSF_LIST CHAR EXT;                                            44201700
* %DEACTIVATE EDGXSF_LIST;                                              44233800
* %IF EDGXSF_LIST ^= 'NO' &                                             44265900
*    ZCBPRINT ^= 'NO' %THEN                                             44298000
*   %GOTO EDGXSF_3;                                                     44330100
*   @LIST PUSH NOECHO;                                                  44362200
*   @LIST NOASSEMBLE NOECHO;                                            44394300
*   @LIST OFF C NOECHO;                                                 44426400
* %EDGXSF_3:;                                                           44458500
*/* Start of PL/X Source                                             */ 44490600
*                                                                       44522700
* %DCL SFI_BASE CHAR;                                                   44554800
*                                                                       44586900
* %DCL XTYPE CHAR;                                                      44619000
*                                                                       44651100
* %IF XTYPE = '' %THEN              /* Check & set basing argument   */ 44683200
*    %XTYPE = 'BASED BDY(WORD)';    /* Set Default of Based          */ 44715300
*                                                                       44747400
*/********************************************************************/ 44779500
*/*    Output Buffer                                                **/ 44811600
*/********************************************************************/ 44843700
*                                                                       44875800
* DCL 1 XSF_OUTBUF XTYPE,           /* Output Buffer                 */ 44907900
*     2 XSF_OUTBUF_BUFLNG  FIXED(31),  /* Output Buffer Length       */ 44940000
*     2 XSF_OUTBUF_RQDLNG  FIXED(31),  /* Required Buffer Length     */ 44972100
*     2 XSF_OUTBUF_DATALNG FIXED(31),  /* Length of Output Data      */ 45004200
*     2 XSF_OUTBUF_FIELDS  CHAR(*);    /* Start of Structured Fields */ 45036300
*                                                                       45068400
*/********************************************************************/ 45100500
*/*    Structured Field Introducers for Structured Fields           **/ 45132600
*/********************************************************************/ 45164700
*                                                                       45196800
* DCL 1 XSF_SFI XTYPE,              /* Structured Field Introducers  */ 45228900
*     2 XSF_SFI_HD,                                                     45261000
*      3  XSF_SFI_LENGTH FIXED(15), /* LENGTH                        */ 45293100
*      3  XSF_SFI_ID     CHAR(3),   /* ID (IDENTIFIER)               */ 45325200
*         4  XSF_SFI_IDVAL  CHAR(2),   /* ID (IDENTIFIER VALUE)      */ 45357300
*         4  XSF_SFI_IDQUAL CHAR(1),   /* ID (IDENTIFIER QUALIFIER)  */ 45389400
*      3  XSF_SFI_TYPE   FIXED(8),  /* TYPE                          */ 45421500
*      3  *              CHAR(1),   /* RESERVED                      */ 45453600
*      3  XSF_SFI_DTYPE  FIXED(8),  /* DATA TYPE                     */ 45485700
*      2  XSF_SFI_DATA   CHAR(*);   /* START OF DATA                 */ 45517800
*                                                                       45549900
*/********************************************************************/ 45582000
*/*    Data Types (XSF_SFI_DTYPE)                                   **/ 45614100
*/********************************************************************/ 45646200
*                                                                       45678300
* DCL  XSF_SFI_DTYPE_UNDEF   BIT(8)  CONSTANT('00'X);                   45710400
*                                   /* Undefined data                */ 45742500
* DCL  XSF_SFI_DTYPE_CHAR_FIX   BIT(8)  CONSTANT('01'X);                45774600
*                                   /* n-byte character              */ 45806700
* DCL  XSF_SFI_DTYPE_BITFLAG BIT(8)  CONSTANT('02'X);                   45838800
*                                   /* 1-byte bit flag byte (8 bits) */ 45870900
* DCL  XSF_SFI_DTYPE_BIN8    BIT(8)  CONSTANT('03'X);                   45903000
*                                   /* 1-byte (hex) value            */ 45935100
* DCL  XSF_SFI_DTYPE_BIN15   BIT(8) CONSTANT('04'X);                    45967200
*                                   /* 2-byte hex value              */ 45999300
* DCL  XSF_SFI_DTYPE_BIN31   BIT(8) CONSTANT('05'X);                    46031400
*                                   /* 4-byte hex value              */ 46063500
* DCL  XSF_SFI_DTYPE_CHAR_VAR  BIT(8) CONSTANT('07'X);                  46095600
*                                   /* VARIABLE LENGTH CHARACTER     */ 46127700
* DCL  XSF_SFI_DTYPE_JDATE   BIT(8) CONSTANT('09'X);                    46159800
*                                   /* 4-byte packed decimal date       46191900
*                                          yyyydddc - c is sign      */ 46224000
* DCL  XSF_SFI_DTYPE_TIME    BIT(8) CONSTANT('0A'X);                    46256100
*                                   /* 4-byte packed decimal time       46288200
*                                          hhmmsstc - c is sign      */ 46320300
*                                                                       46352400
*/********************************************************************/ 46384500
*/**   Group SFIs                                                   **/ 46416600
*/********************************************************************/ 46448700
*                                                                       46480800
*/********************************************************************/ 46512900
*/**   Begin and End ACCESS                                         **/ 46545000
*/********************************************************************/ 46577100
*  DCL XSF_SFI_ACCESS      BIT(64) CONSTANT('0008021000000000'X);       46609200
*  DCL XSF_SFI_ID_ACCESS   BIT(24) CONSTANT('021000'X);                 46641300
*  DCL XSF_ACCESS_LENGTH   BIT(16) CONSTANT('0008'X);                   46673400
*                                      /*                            */ 46705500
*  DCL XSF_SFI_EACCESS     BIT(64) CONSTANT('0008021080000000'X);       46737600
*  DCL XSF_SFI_ID_EACCESS  BIT(24) CONSTANT('021080'X);                 46769700
*  DCL XSF_EACCESS_LENGTH  BIT(16) CONSTANT('0008'X);                   46801800
*/********************************************************************/ 46833900
*/**   Begin and End ACTIONS                                        **/ 46866000
*/********************************************************************/ 46898100
*  DCL XSF_SFI_ACTIONS     BIT(64) CONSTANT('0008022000000000'X);       46930200
*  DCL XSF_SFI_ID_ACTIONS  BIT(24) CONSTANT('022000'X);                 46962300
*  DCL XSF_ACTIONS_LENGTH  BIT(16) CONSTANT('0008'X);                   46994400
*                                      /*                            */ 47026500
*  DCL XSF_SFI_EACTIONS    BIT(64) CONSTANT('0008022080000000'X);       47058600
*  DCL XSF_SFI_ID_EACTIONS BIT(24) CONSTANT('022080'X);                 47090700
*  DCL XSF_EACTIONS_LENGTH BIT(16) CONSTANT('0008'X);                   47122800
*/********************************************************************/ 47154900
*/**   Begin and End CNTL                                           **/ 47187000
*/********************************************************************/ 47219100
*  DCL XSF_SFI_CNTL        BIT(64) CONSTANT('0008024000000000'X);       47251200
*  DCL XSF_SFI_ID_CNTL     BIT(24) CONSTANT('024000'X);                 47283300
*  DCL XSF_CNTL_LENGTH     BIT(16) CONSTANT('0008'X);                   47315400
*                                      /*                            */ 47347500
*  DCL XSF_SFI_ECNTL       BIT(64) CONSTANT('0008024080000000'X);       47379600
*  DCL XSF_SFI_ID_ECNTL    BIT(24) CONSTANT('024080'X);                 47411700
*  DCL XSF_ECNTL_LENGTH    BIT(16) CONSTANT('0008'X);                   47443800
*/********************************************************************/ 47475900
*/**   Begin and End CONTROL                                        **/ 47508000
*/********************************************************************/ 47540100
*  DCL XSF_SFI_CONTROL     BIT(64) CONSTANT('0008025000000000'X);       47572200
*  DCL XSF_SFI_ID_CONTROL  BIT(24) CONSTANT('025000'X);                 47604300
*  DCL XSF_CONTROL_LENGTH  BIT(16) CONSTANT('0008'X);                   47636400
*                                      /*                            */ 47668500
*  DCL XSF_SFI_ECONTROL    BIT(64) CONSTANT('0008025080000000'X);       47700600
*  DCL XSF_SFI_ID_ECONTROL BIT(24) CONSTANT('025080'X);                 47732700
*  DCL XSF_ECONTROL_LENGTH BIT(16) CONSTANT('0008'X);                   47764800
*/********************************************************************/ 47796900
*/**   Begin and End DATASET                                        **/ 47829000
*/********************************************************************/ 47861100
*  DCL XSF_SFI_DATASET     BIT(64) CONSTANT('0008026000000000'X);       47893200
*  DCL XSF_SFI_ID_DATASET  BIT(24) CONSTANT('026000'X);                 47925300
*  DCL XSF_DATASET_LENGTH  BIT(16) CONSTANT('0008'X);                   47957400
*                                      /*                            */ 47989500
*  DCL XSF_SFI_EDATASET    BIT(64) CONSTANT('0008026080000000'X);       48021600
*  DCL XSF_SFI_ID_EDATASET BIT(24) CONSTANT('026080'X);                 48053700
*  DCL XSF_EDATASET_LENGTH BIT(16) CONSTANT('0008'X);                   48085800
*/********************************************************************/ 48117900
*/**   Begin and End LOCDEF                                         **/ 48150000
*/********************************************************************/ 48182100
*  DCL XSF_SFI_LOCDEF      BIT(64) CONSTANT('0008027000000000'X);       48214200
*  DCL XSF_SFI_ID_LOCDEF   BIT(24) CONSTANT('027000'X);                 48246300
*  DCL XSF_LOCDEF_LENGTH   BIT(16) CONSTANT('0008'X);                   48278400
*                                      /*                            */ 48310500
*  DCL XSF_SFI_ELOCDEF     BIT(64) CONSTANT('0008027080000000'X);       48342600
*  DCL XSF_SFI_ID_ELOCDEF  BIT(24) CONSTANT('027080'X);                 48374700
*  DCL XSF_ELOCDEF_LENGTH  BIT(16) CONSTANT('0008'X);                   48406800
*/********************************************************************/ 48438900
*/**   Begin and End MESSAGE                                        **/ 48471000
*/********************************************************************/ 48503100
*  DCL XSF_SFI_MESSAGE     BIT(64) CONSTANT('0008028000000000'X);       48535200
*  DCL XSF_SFI_ID_MESSAGE  BIT(24) CONSTANT('028000'X);                 48567300
*  DCL XSF_MESSAGE_LENGTH  BIT(16) CONSTANT('0008'X);                   48599400
*                                      /*                            */ 48631500
*  DCL XSF_SFI_EMESSAGE    BIT(64) CONSTANT('0008028080000000'X);       48663600
*  DCL XSF_SFI_ID_EMESSAGE BIT(24) CONSTANT('028080'X);                 48695700
*  DCL XSF_EMESSAGE_LENGTH BIT(16) CONSTANT('0008'X);                   48727800
*/********************************************************************/ 48759900
*/**   Begin and End MNTMSG                                         **/ 48792000
*/********************************************************************/ 48824100
*  DCL XSF_SFI_MNTMSG      BIT(64) CONSTANT('0008029000000000'X);       48856200
*  DCL XSF_SFI_ID_MNTMSG   BIT(24) CONSTANT('029000'X);                 48888300
*  DCL XSF_MNTMSG_LENGTH   BIT(16) CONSTANT('0008'X);                   48920400
*                                      /*                            */ 48952500
*  DCL XSF_SFI_EMNTMSG     BIT(64) CONSTANT('0008029080000000'X);       48984600
*  DCL XSF_SFI_ID_EMNTMSG  BIT(24) CONSTANT('029080'X);                 49016700
*  DCL XSF_EMNTMSG_LENGTH  BIT(16) CONSTANT('0008'X);                   49048800
*/********************************************************************/ 49080900
*/**   Begin and End MOVES                                          **/ 49113000
*/********************************************************************/ 49145100
*  DCL XSF_SFI_MOVES       BIT(64) CONSTANT('000802A000000000'X);       49177200
*  DCL XSF_SFI_ID_MOVES    BIT(24) CONSTANT('02A000'X);                 49209300
*  DCL XSF_MOVES_LENGTH    BIT(16) CONSTANT('0008'X);                   49241400
*                                      /*                            */ 49273500
*  DCL XSF_SFI_EMOVES      BIT(64) CONSTANT('000802A080000000'X);       49305600
*  DCL XSF_SFI_ID_EMOVES   BIT(24) CONSTANT('02A080'X);                 49337700
*  DCL XSF_EMOVES_LENGTH   BIT(16) CONSTANT('0008'X);                   49369800
*/********************************************************************/ 49401900
*/**   Begin and End OPTION                                         **/ 49434000
*/********************************************************************/ 49466100
*  DCL XSF_SFI_OPTION      BIT(64) CONSTANT('000802B000000000'X);       49498200
*  DCL XSF_SFI_ID_OPTION   BIT(24) CONSTANT('02B000'X);                 49530300
*  DCL XSF_OPTION_LENGTH   BIT(16) CONSTANT('0008'X);                   49562400
*                                      /*                            */ 49594500
*  DCL XSF_SFI_EOPTION     BIT(64) CONSTANT('000802B080000000'X);       49626600
*  DCL XSF_SFI_ID_EOPTION  BIT(24) CONSTANT('02B080'X);                 49658700
*  DCL XSF_EOPTION_LENGTH  BIT(16) CONSTANT('0008'X);                   49690800
*/********************************************************************/ 49722900
*/**   Begin and End OWNER                                          **/ 49755000
*/********************************************************************/ 49787100
*  DCL XSF_SFI_OWNER       BIT(64) CONSTANT('000802C000000000'X);       49819200
*  DCL XSF_SFI_ID_OWNER    BIT(24) CONSTANT('02C000'X);                 49851300
*  DCL XSF_OWNER_LENGTH    BIT(16) CONSTANT('0008'X);                   49883400
*                                      /*                            */ 49915500
*  DCL XSF_SFI_EOWNER      BIT(64) CONSTANT('000802C080000000'X);       49947600
*  DCL XSF_SFI_ID_EOWNER   BIT(24) CONSTANT('02C080'X);                 49979700
*  DCL XSF_EOWNER_LENGTH   BIT(16) CONSTANT('0008'X);                   50011800
*/********************************************************************/ 50043900
*/**   Begin and End PRODUCT                                        **/ 50076000
*/********************************************************************/ 50108100
*  DCL XSF_SFI_PRODUCT     BIT(64) CONSTANT('000802D000000000'X);       50140200
*  DCL XSF_SFI_ID_PRODUCT  BIT(24) CONSTANT('02D000'X);                 50172300
*  DCL XSF_PRODUCT_LENGTH  BIT(16) CONSTANT('0008'X);                   50204400
*                                      /*                            */ 50236500
*  DCL XSF_SFI_EPRODUCT    BIT(64) CONSTANT('000802D080000000'X);       50268600
*  DCL XSF_SFI_ID_EPRODUCT BIT(24) CONSTANT('02D080'X);                 50300700
*  DCL XSF_EPRODUCT_LENGTH BIT(16) CONSTANT('0008'X);                   50332800
*/********************************************************************/ 50364900
*/**   Begin and End RACK or BIN                                    **/ 50397000
*/********************************************************************/ 50429100
*  DCL XSF_SFI_RACK        BIT(64) CONSTANT('000802E000000000'X);       50461200
*  DCL XSF_SFI_ID_RACK     BIT(24) CONSTANT('02E000'X);                 50493300
*  DCL XSF_RACK_LENGTH     BIT(16) CONSTANT('0008'X);                   50525400
*                                      /*                            */ 50557500
*  DCL XSF_SFI_ERACK       BIT(64) CONSTANT('000802E080000000'X);       50589600
*  DCL XSF_SFI_ID_ERACK    BIT(24) CONSTANT('02E080'X);                 50621700
*  DCL XSF_ERACK_LENGTH    BIT(16) CONSTANT('0008'X);                   50653800
*/********************************************************************/ 50685900
*/**   Begin and End REJECT                                         **/ 50718000
*/********************************************************************/ 50750100
*  DCL XSF_SFI_REJECT      BIT(64) CONSTANT('000802F000000000'X);       50782200
*  DCL XSF_SFI_ID_REJECT   BIT(24) CONSTANT('02F000'X);                 50814300
*  DCL XSF_REJECT_LENGTH   BIT(16) CONSTANT('0008'X);                   50846400
*                                      /*                            */ 50878500
*  DCL XSF_SFI_EREJECT     BIT(64) CONSTANT('000802F080000000'X);       50910600
*  DCL XSF_SFI_ID_EREJECT  BIT(24) CONSTANT('02F080'X);                 50942700
*  DCL XSF_EREJECT_LENGTH  BIT(16) CONSTANT('0008'X);                   50974800
*/********************************************************************/ 51006900
*/**   Begin and End SECCLS                                         **/ 51039000
*/********************************************************************/ 51071100
*  DCL XSF_SFI_SECCLS      BIT(64) CONSTANT('0008030000000000'X);       51103200
*  DCL XSF_SFI_ID_SECCLS   BIT(24) CONSTANT('030000'X);                 51135300
*  DCL XSF_SECCLS_LENGTH   BIT(16) CONSTANT('0008'X);                   51167400
*                                      /*                            */ 51199500
*  DCL XSF_SFI_ESECCLS     BIT(64) CONSTANT('0008030080000000'X);       51231600
*  DCL XSF_SFI_ID_ESECCLS  BIT(24) CONSTANT('030080'X);                 51263700
*  DCL XSF_ESECCLS_LENGTH  BIT(16) CONSTANT('0008'X);                   51295800
*/********************************************************************/ 51327900
*/**   Begin and End SECLVL                                         **/ 51360000
*/********************************************************************/ 51392100
*  DCL XSF_SFI_SECLVL      BIT(64) CONSTANT('0008031000000000'X);       51424200
*  DCL XSF_SFI_ID_SECLVL   BIT(24) CONSTANT('031000'X);                 51456300
*  DCL XSF_SECLVL_LENGTH   BIT(16) CONSTANT('0008'X);                   51488400
*                                      /*                            */ 51520500
*  DCL XSF_SFI_ESECLVL     BIT(64) CONSTANT('0008031080000000'X);       51552600
*  DCL XSF_SFI_ID_ESECLVL  BIT(24) CONSTANT('031080'X);                 51584700
*  DCL XSF_ESECLVL_LENGTH  BIT(16) CONSTANT('0008'X);                   51616800
*/********************************************************************/ 51648900
*/**   Begin and End STAT                                           **/ 51681000
*/********************************************************************/ 51713100
*  DCL XSF_SFI_STAT        BIT(64) CONSTANT('0008032000000000'X);       51745200
*  DCL XSF_SFI_ID_STAT     BIT(24) CONSTANT('032000'X);                 51777300
*  DCL XSF_STAT_LENGTH     BIT(16) CONSTANT('0008'X);                   51809400
*                                      /*                            */ 51841500
*  DCL XSF_SFI_ESTAT       BIT(64) CONSTANT('0008032080000000'X);       51873600
*  DCL XSF_SFI_ID_ESTAT    BIT(24) CONSTANT('032080'X);                 51905700
*  DCL XSF_ESTAT_LENGTH    BIT(16) CONSTANT('0008'X);                   51937800
*/********************************************************************/ 51969900
*/**   Begin and End STORE                                          **/ 52002000
*/********************************************************************/ 52034100
*  DCL XSF_SFI_STORE       BIT(64) CONSTANT('0008033000000000'X);       52066200
*  DCL XSF_SFI_ID_STORE    BIT(24) CONSTANT('033000'X);                 52098300
*  DCL XSF_STORE_LENGTH    BIT(16) CONSTANT('0008'X);                   52130400
*                                      /*                            */ 52162500
*  DCL XSF_SFI_ESTORE      BIT(64) CONSTANT('0008033080000000'X);       52194600
*  DCL XSF_ESTORE_LENGTH   BIT(16) CONSTANT('0008'X);                   52226700
*  DCL XSF_SFI_ID_ESTORE   BIT(24) CONSTANT('033080'X);                 52258800
*/********************************************************************/ 52290900
*/**   Begin and End SYSRETC                                        **/ 52323000
*/********************************************************************/ 52355100
*  DCL XSF_SFI_SYSRETC     BIT(64) CONSTANT('0008034000000000'X);       52387200
*  DCL XSF_SFI_ID_SYSRETC  BIT(24) CONSTANT('034000'X);                 52419300
*  DCL XSF_SYSRETC_LENGTH  BIT(16) CONSTANT('0008'X);                   52451400
*                                      /*                            */ 52483500
*  DCL XSF_SFI_ESYSRETC    BIT(64) CONSTANT('0008034080000000'X);       52515600
*  DCL XSF_SFI_ID_ESYSRETC BIT(24) CONSTANT('034080'X);                 52547700
*  DCL XSF_ESYSRETC_LENGTH BIT(16) CONSTANT('0008'X);                   52579800
*/********************************************************************/ 52611900
*/**   Begin and End VLPOOL                                         **/ 52644000
*/********************************************************************/ 52676100
*  DCL XSF_SFI_VLPOOL      BIT(64) CONSTANT('0008035000000000'X);       52708200
*  DCL XSF_SFI_ID_VLPOOL   BIT(24) CONSTANT('035000'X);                 52740300
*  DCL XSF_VLPOOL_LENGTH   BIT(16) CONSTANT('0008'X);                   52772400
*                                      /*                            */ 52804500
*  DCL XSF_SFI_EVLPOOL     BIT(64) CONSTANT('0008035080000000'X);       52836600
*  DCL XSF_SFI_ID_EVLPOOL  BIT(24) CONSTANT('035080'X);                 52868700
*  DCL XSF_EVLPOOL_LENGTH  BIT(16) CONSTANT('0008'X);                   52900800
*/********************************************************************/ 52932900
*/**   Begin and End VOL                                            **/ 52965000
*/********************************************************************/ 52997100
*  DCL XSF_SFI_VOLGRP      BIT(64) CONSTANT('0008036000000000'X);       53029200
*  DCL XSF_SFI_ID_VOL      BIT(24) CONSTANT('036000'X);                 53061300
*  DCL XSF_VOLGRP_LENGTH   BIT(16) CONSTANT('0008'X);                   53093400
*                                      /*                            */ 53125500
*  DCL XSF_SFI_EVOLGRP     BIT(64) CONSTANT('0008036080000000'X);       53157600
*  DCL XSF_SFI_ID_EVOL     BIT(24) CONSTANT('036080'X);                 53189700
*  DCL XSF_EVOLGRP_LENGTH  BIT(16) CONSTANT('0008'X);                   53221800
*/********************************************************************/ 53253900
*/**   Begin and End VOLUME                                         **/ 53286000
*/********************************************************************/ 53318100
*  DCL XSF_SFI_VOLUME      BIT(64) CONSTANT('0008037000000000'X);       53350200
*  DCL XSF_SFI_ID_VOLUME   BIT(24) CONSTANT('037000'X);                 53382300
*  DCL XSF_VOLUME_LENGTH   BIT(16) CONSTANT('0008'X);                   53414400
*                                      /*                            */ 53446500
*  DCL XSF_SFI_EVOLUME     BIT(64) CONSTANT('0008037080000000'X);       53478600
*  DCL XSF_SFI_ID_EVOLUME  BIT(24) CONSTANT('037080'X);                 53510700
*  DCL XSF_EVOLUME_LENGTH  BIT(16) CONSTANT('0008'X);                   53542800
*/********************************************************************/ 53574900
*/**   Begin and End VRS                                            **/ 53607000
*/********************************************************************/ 53639100
*  DCL XSF_SFI_VRSGRP      BIT(64) CONSTANT('0008038000000000'X);       53671200
*  DCL XSF_SFI_ID_VRS      BIT(24) CONSTANT('038000'X);                 53703300
*  DCL XSF_VRSGRP_LENGTH   BIT(16) CONSTANT('0008'X);                   53735400
*                                      /*                            */ 53767500
*  DCL XSF_SFI_EVRSGRP     BIT(64) CONSTANT('0008038080000000'X);       53799600
*  DCL XSF_SFI_ID_EVRS     BIT(24) CONSTANT('038080'X);                 53831700
*  DCL XSF_EVRSGRP_LENGTH  BIT(16) CONSTANT('0008'X);                   53863800
*                                                                       53895900
*/********************************************************************/ 53928000
*/*    Return and Reason Code SFI's                                 **/ 53960100
*/********************************************************************/ 53992200
*                                                                       54024300
*/********************************************************************/ 54056400
*  DCL XSF_SFI_FRC     BIT(64) CONSTANT('000C400000000005'X);           54088500
*                                      /*Function Return Code        */ 54120600
*  DCL XSF_SFI_FRC_ID    BIT(24) CONSTANT('400000'X);                   54152700
*  DCL XSF_FRC_LENGTH    BIT(16) CONSTANT('000C'X);                     54184800
*  DCL XSF_FRC_DTYPE     BIT(8)  CONSTANT('05'X);                       54216900
*/********************************************************************/ 54249000
*  DCL XSF_SFI_FRS     BIT(64) CONSTANT('000C401000000005'X);           54281100
*                                      /*Function Reason Code        */ 54313200
*  DCL XSF_SFI_FRS_ID    BIT(24) CONSTANT('401000'X);                   54345300
*  DCL XSF_FRS_LENGTH    BIT(16) CONSTANT('000C'X);                     54377400
*  DCL XSF_FRS_DTYPE     BIT(8)  CONSTANT('05'X);                       54409500
*/********************************************************************/ 54441600
*  DCL XSF_SFI_RSNC    BIT(64) CONSTANT('000C402000000005'X);           54473700
*                                      /*Reason Code                 */ 54505800
*  DCL XSF_SFI_RSNC_ID   BIT(24) CONSTANT('402000'X);                   54537900
*  DCL XSF_RSNC_LENGTH   BIT(16) CONSTANT('000C'X);                     54570000
*  DCL XSF_RSNC_DTYPE    BIT(8)  CONSTANT('05'X);                       54602100
*/********************************************************************/ 54634200
*  DCL XSF_SFI_RTNC    BIT(64) CONSTANT('000C403000000005'X);           54666300
*                                      /*Return Code                 */ 54698400
*  DCL XSF_SFI_RTNC_ID   BIT(24) CONSTANT('403000'X);                   54730500
*  DCL XSF_RTNC_LENGTH   BIT(16) CONSTANT('000C'X);                     54762600
*  DCL XSF_RTNC_DTYPE    BIT(8)  CONSTANT('05'X);                       54794700
*/********************************************************************/ 54826800
*  DCL XSF_SFI_SVCN    BIT(64) CONSTANT('0010404000000007'X);           54858900
*                                      /*Service Name                */ 54891000
*  DCL XSF_SFI_SVCN_ID   BIT(24) CONSTANT('404000'X);                   54923100
*  DCL XSF_SVCN_LENGTH   BIT(16) CONSTANT('0010'X);                     54955200
*  DCL XSF_SVCN_DTYPE    BIT(8)  CONSTANT('07'X);                       54987300
*/********************************************************************/ 55019400
*                                                                       55051500
*/********************************************************************/ 55083600
*/**   Messages and Message Variable SFIs                           **/ 55115700
*/********************************************************************/ 55147800
*                                                                       55179900
*/********************************************************************/ 55212000
*  DCL XSF_SFI_MSGL    BIT(64) CONSTANT('0103051000000007'X);           55244100
*                                      /*Message Line                */ 55276200
*  DCL XSF_SFI_MSGL_ID   BIT(24) CONSTANT('051000'X);                   55308300
*  DCL XSF_MSGL_LENGTH   BIT(16) CONSTANT('0103'X);                     55340400
*  DCL XSF_MSGL_DTYPE    BIT(8)  CONSTANT('07'X);                       55372500
*/********************************************************************/ 55404600
*  DCL XSF_SFI_MSGN    BIT(64) CONSTANT('0010052000000001'X);           55436700
*                                      /*Message Number              */ 55468800
*  DCL XSF_SFI_MSGN_ID   BIT(24) CONSTANT('052000'X);                   55500900
*  DCL XSF_MSGN_LENGTH   BIT(16) CONSTANT('0010'X);                     55533000
*  DCL XSF_MSGN_DTYPE    BIT(8)  CONSTANT('01'X);                       55565100
*/********************************************************************/ 55597200
*  DCL XSF_SFI_ENTN    BIT(64) CONSTANT('000C053000000005'X);           55629300
*                                      /*Number of Entries           */ 55661400
*  DCL XSF_SFI_ENTN_ID   BIT(24) CONSTANT('053000'X);                   55693500
*  DCL XSF_ENTN_LENGTH   BIT(16) CONSTANT('000C'X);                     55725600
*  DCL XSF_ENTN_DTYPE    BIT(8)  CONSTANT('05'X);                       55757700
*/*************************************************************/ ! @K1A 55758900
*  DCL XSF_SFI_KEYF    BIT(64) CONSTANT('0040054000000007'X);    ! @K1A 55760100
*                                                      ! From Key  @K1A 55761300
*  DCL XSF_SFI_KEYF_ID   BIT(24) CONSTANT('054000'X);            ! @K1A 55762500
*  DCL XSF_KEYF_LENGTH   BIT(16) CONSTANT('0040'X);              ! @K1A 55763700
*  DCL XSF_KEYF_DTYPE    BIT(8)  CONSTANT('07'X);                ! @K1A 55764900
*/*************************************************************/ ! @K1A 55766100
*  DCL XSF_SFI_KEYT    BIT(64) CONSTANT('0040054200000007'X);    ! @K1A 55767300
*                                                        ! To Key  @K1A 55768500
*  DCL XSF_SFI_KEYT_ID   BIT(24) CONSTANT('054200'X);            ! @K1A 55769700
*  DCL XSF_KEYT_LENGTH   BIT(16) CONSTANT('0040'X);              ! @K1A 55770900
*  DCL XSF_KEYT_DTYPE    BIT(8)  CONSTANT('07'X);                ! @K1A 55772100
*/*************************************************************/ ! @K1A 55773300
*  DCL XSF_SFI_TYPF    BIT(64) CONSTANT('0010055000000007'X);    ! @K1A 55774500
*                                                     ! Type from  @K1A 55775700
*  DCL XSF_SFI_TYPF_ID       BIT(24) CONSTANT('055000'X);        ! @K1A 55776900
*  DCL XSF_TYPF_LENGTH       BIT(16) CONSTANT('0010'X);          ! @K1A 55778100
*  DCL XSF_TYPF_DTYPE        BIT(8)  CONSTANT('07'X);            ! @K1A 55779300
*/*************************************************************/ ! @K1A 55780500
*  DCL XSF_SFI_TYPT    BIT(64) CONSTANT('0010055200000007'X);    ! @K1A 55781700
*                                                     ! Type to    @K1A 55782900
*  DCL XSF_SFI_TYPT_ID       BIT(24) CONSTANT('055200'X);        ! @K1A 55784100
*  DCL XSF_TYPT_LENGTH       BIT(16) CONSTANT('0010'X);          ! @K1A 55785300
*  DCL XSF_TYPT_DTYPE        BIT(8)  CONSTANT('07'X);            ! @K1A 55786500
*/********************************************************************/ 55789800
*                                                                       55821900
*/********************************************************************/ 55854000
*/**   Output Data SFIs                                             **/ 55886100
*/********************************************************************/ 55918200
*                                                                       55950300
*/*************************************************************/ ! @01A 55953500
*  DCL XSF_SFI_ABND    BIT(64) CONSTANT('0009800500000003'X);    ! @01A 55956700
*                                      /*Abend while open     */ ! @01A 55959900
*  DCL XSF_SFI_ABND_ID   BIT(24) CONSTANT('800500'X);            ! @01A 55963100
*  DCL XSF_ABND_LENGTH   BIT(16) CONSTANT('0009'X);              ! @01A 55966300
*  DCL XSF_ABND_DTYPE    BIT(8)  CONSTANT('03'X);                ! @01A 55969500
*                                                                ! @01A 55972700
*  DCL XSF_ABND_DATA_NO  BIN(8)  CONSTANT('00'X);                ! @01A 55975900
*  DCL XSF_ABND_DATA_YES BIN(8)  CONSTANT('01'X);                ! @01A 55979100
*/********************************************************************/ 55982400
*  DCL XSF_SFI_ACCT    BIT(64) CONSTANT('0009800800000003'X);           56014500
*                                      /*Accounting Source           */ 56046600
*  DCL XSF_SFI_ACCT_ID   BIT(24) CONSTANT('800800'X);                   56078700
*  DCL XSF_ACCT_LENGTH   BIT(16) CONSTANT('0009'X);                     56110800
*  DCL XSF_ACCT_DTYPE    BIT(8)  CONSTANT('03'X);                       56142900
*                                                                       56175000
*  DCL XSF_ACCT_DATA_JOB        BIN(8) CONSTANT('00'X);                 56207100
*  DCL XSF_ACCT_DATA_STEP       BIN(8) CONSTANT('01'X);                 56239200
*/********************************************************************/ 56271300
*  DCL XSF_SFI_ACN     BIT(64) CONSTANT('0030801000000007'X);           56303400
*                                      /*Account Number              */ 56335500
*  DCL XSF_SFI_ACN_ID    BIT(24) CONSTANT('801000'X);                   56367600
*  DCL XSF_ACN_LENGTH    BIT(16) CONSTANT('0030'X);                     56399700
*  DCL XSF_ACN_DTYPE     BIT(8)  CONSTANT('07'X);                       56431800
*/**************************************************************/! @04A 56434790
*  DCL XSF_SFI_ACS     BIT(64) CONSTANT('0009801800000003'X);    ! @04A 56437780
*                                      /* SMS ACS support */     ! @04A 56440770
*  DCL XSF_SFI_ACS_ID    BIT(24) CONSTANT('801800'X);            ! @04A 56443760
*  DCL XSF_ACS_LENGTH    BIT(16) CONSTANT('0009'X);              ! @04A 56446750
*  DCL XSF_ACS_DTYPE     BIT(8)  CONSTANT('03'X);                ! @04A 56449740
*                                                                ! @04A 56452730
*  DCL XSF_ACS_DATA_NO          BIN(8) CONSTANT('00'X);          ! @04A 56455720
*  DCL XSF_ACS_DATA_YES         BIN(8) CONSTANT('01'X);          ! @04A 56458710
*/********************************************************************/ 56463900
*  DCL XSF_SFI_ACT     BIT(64) CONSTANT('0009802000000002'X);           56496000
*                                      /*Actions on Release          */ 56528100
*  DCL XSF_SFI_ACT_ID    BIT(24) CONSTANT('802000'X);                   56560200
*  DCL XSF_ACT_LENGTH    BIT(16) CONSTANT('0009'X);                     56592300
*  DCL XSF_ACT_DTYPE     BIT(8)  CONSTANT('02'X);                       56624400
*                                                                       56656500
*  DCL XSF_ACT_FLAG_SCRATCH    BIT(8) CONSTANT('80'X);                  56688600
*  DCL XSF_ACT_FLAG_REPLACE    BIT(8) CONSTANT('40'X);                  56720700
*  DCL XSF_ACT_FLAG_INIT       BIT(8) CONSTANT('20'X);                  56752800
*  DCL XSF_ACT_FLAG_ERASE      BIT(8) CONSTANT('10'X);                  56784900
*  DCL XSF_ACT_FLAG_RETURN     BIT(8) CONSTANT('08'X);                  56817000
*  DCL XSF_ACT_FLAG_NOTIFY     BIT(8) CONSTANT('04'X);                  56849100
*/********************************************************************/ 56881200
*  DCL XSF_SFI_ADL     BIT(64) CONSTANT('0030803001000007'X);           56913300
*                                      /*Address Line                */ 56945400
*  DCL XSF_SFI_ADL_ID    BIT(24) CONSTANT('803001'X);                   56977500
*  DCL XSF_ADL_LENGTH    BIT(16) CONSTANT('0030'X);                     57009600
*  DCL XSF_ADL_DTYPE     BIT(8)  CONSTANT('07'X);                       57041700
*/********************************************************************/ 57073800
*  DCL XSF_SFI_ADTJ    BIT(64) CONSTANT('000C804000000009'X);           57105900
*                                      /*Assigned Date               */ 57138000
*  DCL XSF_SFI_ADTJ_ID   BIT(24) CONSTANT('804000'X);                   57170100
*  DCL XSF_ADTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     57202200
*  DCL XSF_ADTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       57234300
*/********************************************************************/ 57266400
*  DCL XSF_SFI_AST     BIT(64) CONSTANT('0009805000000002'X);           57298500
*                                      /*Action Status               */ 57330600
*  DCL XSF_SFI_AST_ID    BIT(24) CONSTANT('805000'X);                   57362700
*  DCL XSF_AST_LENGTH    BIT(16) CONSTANT('0009'X);                     57394800
*  DCL XSF_AST_DTYPE     BIT(8)  CONSTANT('02'X);                       57426900
*                                                                       57459000
*  DCL XSF_AST_FLAG_PENDING    BIT(8) CONSTANT('80'X);                  57491100
*  DCL XSF_AST_FLAG_CONFIRMED  BIT(8) CONSTANT('40'X);                  57523200
*  DCL XSF_AST_FLAG_COMPLETE   BIT(8) CONSTANT('20'X);                  57555300
*  DCL XSF_AST_FLAG_UNKNOWN    BIT(8) CONSTANT('10'X);                  57587400
*/********************************************************************/ 57619500
*  DCL XSF_SFI_ATM     BIT(64) CONSTANT('000C80600000000A'X);           57651600
*                                      /*Assigned Time               */ 57683700
*  DCL XSF_SFI_ATM_ID    BIT(24) CONSTANT('806000'X);                   57715800
*  DCL XSF_ATM_LENGTH    BIT(16) CONSTANT('000C'X);                     57747900
*  DCL XSF_ATM_DTYPE     BIT(8)  CONSTANT('0A'X);                       57780000
*/********************************************************************/ 57812100
*  DCL XSF_SFI_AUD     BIT(64) CONSTANT('000A807000000004'X);           57844200
*                                      /*SMF Audit Record Number     */ 57876300
*  DCL XSF_SFI_AUD_ID    BIT(24) CONSTANT('807000'X);                   57908400
*  DCL XSF_AUD_LENGTH    BIT(16) CONSTANT('000A'X);                     57940500
*  DCL XSF_AUD_DTYPE     BIT(8)  CONSTANT('04'X);                       57972600
*/********************************************************************/ 58004700
*  DCL XSF_SFI_AVL     BIT(64) CONSTANT('0009808000000002'X);           58036800
*                                      /*Volume Availability         */ 58068900
*  DCL XSF_SFI_AVL_ID    BIT(24) CONSTANT('808000'X);                   58101000
*  DCL XSF_AVL_LENGTH    BIT(16) CONSTANT('0009'X);                     58133100
*  DCL XSF_AVL_DTYPE     BIT(8)  CONSTANT('02'X);                       58165200
*                                                                       58197300
*  DCL XSF_AVL_FLAG_PENDREL    BIT(8) CONSTANT('40'X);                  58229400
*  DCL XSF_AVL_FLAG_VITALRCD   BIT(8) CONSTANT('20'X);                  58261500
*  DCL XSF_AVL_FLAG_ONLOAN     BIT(8) CONSTANT('08'X);                  58293600
*  DCL XSF_AVL_FLAG_OPEN       BIT(8) CONSTANT('04'X);                  58325700
*/********************************************************************/ 58357800
*  DCL XSF_SFI_BDTJ    BIT(64) CONSTANT('000C809000000009'X);           58389900
*                                      /*Last CDS Backup Date        */ 58422000
*  DCL XSF_SFI_BDTJ_ID   BIT(24) CONSTANT('809000'X);                   58454100
*  DCL XSF_BDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     58486200
*  DCL XSF_BDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       58518300
*/********************************************************************/ 58550400
*  DCL XSF_SFI_BIN     BIT(64) CONSTANT('000E80A000000001'X);           58582500
*                                      /*Bin Number                  */ 58614600
*  DCL XSF_SFI_BIN_ID    BIT(24) CONSTANT('80A000'X);                   58646700
*  DCL XSF_BIN_LENGTH    BIT(16) CONSTANT('000E'X);                     58678800
*  DCL XSF_BIN_DTYPE     BIT(8)  CONSTANT('01'X);                       58710900
*/********************************************************************/ 58743000
*  DCL XSF_SFI_BKPP    BIT(64) CONSTANT('001080B000000007'X);           58775100
*                                      /*Backup Procedure Name       */ 58807200
*  DCL XSF_SFI_BKPP_ID   BIT(24) CONSTANT('80B000'X);                   58839300
*  DCL XSF_BKPP_LENGTH   BIT(16) CONSTANT('0010'X);                     58871400
*  DCL XSF_BKPP_DTYPE    BIT(8)  CONSTANT('07'X);                       58903500
*/********************************************************************/ 58935600
*  DCL XSF_SFI_BLKC    BIT(64) CONSTANT('000C80C000000005'X);           58967700
*                                      /*Block Count                 */ 58999800
*  DCL XSF_SFI_BLKC_ID   BIT(24) CONSTANT('80C000'X);                   59031900
*  DCL XSF_BLKC_LENGTH   BIT(16) CONSTANT('000C'X);                     59064000
*  DCL XSF_BLKC_DTYPE    BIT(8)  CONSTANT('05'X);                       59096100
*/********************************************************************/ 59128200
*  DCL XSF_SFI_BLKS    BIT(64) CONSTANT('000C80D000000005'X);           59160300
*                                      /*Block Size                  */ 59192400
*  DCL XSF_SFI_BLKS_ID   BIT(24) CONSTANT('80D000'X);                   59224500
*  DCL XSF_BLKS_LENGTH   BIT(16) CONSTANT('000C'X);                     59256600
*  DCL XSF_BLKS_DTYPE    BIT(8)  CONSTANT('05'X);                       59288700
*/********************************************************************/ 59320800
*  DCL XSF_SFI_BLKT    BIT(64) CONSTANT('000C80D030000005'X);     !@S9A 59325300
*                                      /*Total Block Count           */ 59329800
*  DCL XSF_SFI_BLKT_ID   BIT(24) CONSTANT('80D030'X);             !@S9A 59334300
*  DCL XSF_BLKT_LENGTH   BIT(16) CONSTANT('000C'X);               !@S9A 59338800
*  DCL XSF_BLKT_DTYPE    BIT(8)  CONSTANT('05'X);                 !@S9A 59343300
*/********************************************************************/ 59347800
*  DCL XSF_SFI_BLP     BIT(64) CONSTANT('000980E000000003'X);           59352900
*                                      /*BLP Option                  */ 59385000
*  DCL XSF_SFI_BLP_ID    BIT(24) CONSTANT('80E000'X);                   59417100
*  DCL XSF_BLP_LENGTH    BIT(16) CONSTANT('0009'X);                     59449200
*  DCL XSF_BLP_DTYPE     BIT(8)  CONSTANT('03'X);                       59481300
*                                                                       59513400
*  DCL XSF_BLP_DATA_RMM         BIN(8) CONSTANT('00'X);                 59545500
*  DCL XSF_BLP_DATA_NORMM       BIN(8) CONSTANT('01'X);                 59577600
*/********************************************************************/ 59609700
*  DCL XSF_SFI_BMN     BIT(64) CONSTANT('001080F000000007'X);           59641800
*                                      /*Bin Number Media Name       */ 59673900
*  DCL XSF_SFI_BMN_ID    BIT(24) CONSTANT('80F000'X);                   59706000
*  DCL XSF_BMN_LENGTH    BIT(16) CONSTANT('0010'X);                     59738100
*  DCL XSF_BMN_DTYPE     BIT(8)  CONSTANT('07'X);                       59770200
*/********************************************************************/ 59802300
*  DCL XSF_SFI_BTM     BIT(64) CONSTANT('000C81000000000A'X);           59834400
*                                      /*Last CDS Backup Time        */ 59866500
*  DCL XSF_SFI_BTM_ID    BIT(24) CONSTANT('810000'X);                   59898600
*  DCL XSF_BTM_LENGTH    BIT(16) CONSTANT('000C'X);                     59930700
*  DCL XSF_BTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       59962800
*/********************************************************************/ 59994900
*  DCL XSF_SFI_CACT    BIT(64) CONSTANT('0009811000000002'X);           60027000
*                                      /*Control Active Functions    */ 60059100
*  DCL XSF_SFI_CACT_ID   BIT(24) CONSTANT('811000'X);                   60091200
*  DCL XSF_CACT_LENGTH   BIT(16) CONSTANT('0009'X);                     60123300
*  DCL XSF_CACT_DTYPE    BIT(8)  CONSTANT('02'X);                       60155400
*                                                                       60187500
*  DCL XSF_CACT_FLAG_BACKUP    BIT(8) CONSTANT('80'X);                  60219600
*  DCL XSF_CACT_FLAG_RESTORE   BIT(8) CONSTANT('40'X);                  60251700
*  DCL XSF_CACT_FLAG_VERIFY    BIT(8) CONSTANT('20'X);                  60283800
*  DCL XSF_CACT_FLAG_EXPROC    BIT(8) CONSTANT('10'X);                  60315900
*  DCL XSF_CACT_FLAG_EXTRACT   BIT(8) CONSTANT('08'X);                  60348000
*  DCL XSF_CACT_FLAG_DSTORE    BIT(8) CONSTANT('04'X);                  60380100
*  DCL XSF_CACT_FLAG_VRSEL     BIT(8) CONSTANT('02'X);                  60412200
*/*************************************************************/ ! @K1A 60415100
*  DCL XSF_SFI_CATS    BIT(64) CONSTANT('0009811800000003'X);    ! @K1A 60418000
*                                      /*CATSYSID value       */ ! @K1A 60420900
*  DCL XSF_SFI_CATS_ID         BIT(24) CONSTANT('811800'X);      ! @K1A 60423800
*  DCL XSF_CATS_LENGTH         BIT(16) CONSTANT('0009'X);        ! @K1A 60426700
*  DCL XSF_CATA_DTYPE          BIT(8)  CONSTANT('03'X);          ! @K1A 60429600
*                                                                ! @K1A 60432500
*  DCL XSF_CATS_DATA_SET       BIT(8) CONSTANT('00'X);           ! @K1A 60435400
*  DCL XSF_CATS_DATA_NOTSET    BIT(8) CONSTANT('01'X);           ! @K1A 60438300
*  DCL XSF_CATS_DATA_STAR      BIT(8) CONSTANT('02'X);           ! @K1A 60441200
*/********************************************************************/ 60444300
*  DCL XSF_SFI_CDS     BIT(64) CONSTANT('0010812000000007'X);           60476400
*                                      /*Control Data Set ID         */ 60508500
*  DCL XSF_SFI_CDS_ID    BIT(24) CONSTANT('812000'X);                   60540600
*  DCL XSF_CDS_LENGTH    BIT(16) CONSTANT('0010'X);                     60572700
*  DCL XSF_CDS_DTYPE     BIT(8)  CONSTANT('07'X);                       60604800
*/********************************************************************/ 60636900
*  DCL XSF_SFI_CDTJ    BIT(64) CONSTANT('000C813000000009'X);           60669000
*                                      /*Create Date                 */ 60701100
*  DCL XSF_SFI_CDTJ_ID   BIT(24) CONSTANT('813000'X);                   60733200
*  DCL XSF_CDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     60765300
*  DCL XSF_CDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       60797400
*/********************************************************************/ 60829500
*  DCL XSF_SFI_CJBN    BIT(64) CONSTANT('0010814000000007'X);           60861600
*                                      /*Job Name                    */ 60893700
*  DCL XSF_SFI_CJBN_ID   BIT(24) CONSTANT('814000'X);                   60925800
*  DCL XSF_CJBN_LENGTH   BIT(16) CONSTANT('0010'X);                     60957900
*  DCL XSF_CJBN_DTYPE    BIT(8)  CONSTANT('07'X);                       60990000
*/********************************************************************/ 61022100
*  DCL XSF_SFI_CLIB    BIT(64) CONSTANT('0010815000000007'X);           61054200
*                                      /*Current Library Name        */ 61086300
*  DCL XSF_SFI_CLIB_ID   BIT(24) CONSTANT('815000'X);                   61118400
*  DCL XSF_CLIB_LENGTH   BIT(16) CONSTANT('0010'X);                     61150500
*  DCL XSF_CLIB_DTYPE    BIT(8)  CONSTANT('07'X);                       61182600
*/********************************************************************/ 61214700
*  DCL XSF_SFI_CLS     BIT(64) CONSTANT('0028816000000007'X);           61246800
*                                      /*Security Class Description  */ 61278900
*  DCL XSF_SFI_CLS_ID    BIT(24) CONSTANT('816000'X);                   61311000
*  DCL XSF_CLS_LENGTH    BIT(16) CONSTANT('0028'X);                     61343100
*  DCL XSF_CLS_DTYPE     BIT(8)  CONSTANT('07'X);                       61375200
*/********************************************************************/ 61407300
*  DCL XSF_SFI_CNT     BIT(64) CONSTANT('000C817000000005'X);           61439400
*                                      /*Bin, Rack or Volume Count   */ 61471500
*  DCL XSF_SFI_CNT_ID    BIT(24) CONSTANT('817000'X);                   61503600
*  DCL XSF_CNT_LENGTH    BIT(16) CONSTANT('000C'X);                     61535700
*  DCL XSF_CNT_DTYPE     BIT(8)  CONSTANT('05'X);                       61567800
*/**************************************************************/! @02A 61572300
*  DCL XSF_SFI_CPGM      BIT(64) CONSTANT('0010817820000001'X);  ! @02A 61576800
*                                        ! Creating program name   @02A 61581300
*  DCL XSF_SFI_CPGM_ID   BIT(24) CONSTANT('817820'X);            ! @02A 61585800
*  DCL XSF_CPGM_LENGTH   BIT(16) CONSTANT('0010'X);              ! @02A 61590300
*  DCL XSF_CPGM_DTYPE    BIT(8)  CONSTANT('01'X);                ! @02A 61594800
*/********************************************************************/ 61599900
*  DCL XSF_SFI_CRP     BIT(64) CONSTANT('000C818000000005'X);           61632000
*                                      /*CATRETPD Retention Period   */ 61664100
*  DCL XSF_SFI_CRP_ID    BIT(24) CONSTANT('818000'X);                   61696200
*  DCL XSF_CRP_LENGTH    BIT(16) CONSTANT('000C'X);                     61728300
*  DCL XSF_CRP_DTYPE     BIT(8)  CONSTANT('05'X);                       61760400
*/*************************************************************/ ! @K1A 61764900
*  DCL XSF_SFI_CSDT    BIT(64) CONSTANT('000C818800000009'X);    ! @K1A 61769400
*                                      ! Catalog Synchronize date  @K1A 61773900
*  DCL XSF_SFI_CSDT_ID   BIT(24) CONSTANT('818800'X);            ! @K1A 61778400
*  DCL XSF_CSDT_LENGTH   BIT(16) CONSTANT('000C'X);              ! @K1A 61782900
*  DCL XSF_CSDT_DTYPE    BIT(8)  CONSTANT('09'X);                ! @K1A 61787400
*/********************************************************************/ 61792500
*  DCL XSF_SFI_CSG     BIT(64) CONSTANT('0010819000000007'X);           61824600
*                                      /*Current Storage Group       */ 61856700
*  DCL XSF_SFI_CSG_ID    BIT(24) CONSTANT('819000'X);                   61888800
*  DCL XSF_CSG_LENGTH    BIT(16) CONSTANT('0010'X);                     61920900
*  DCL XSF_CSG_DTYPE     BIT(8)  CONSTANT('07'X);                       61953000
*/*************************************************************/ ! @K1A 61953500
*  DCL XSF_SFI_CSTM    BIT(64) CONSTANT('000C81940000000A'X);    ! @K1A 61954000
*                                      ! Catalog Synchronize time  @K1A 61954500
*  DCL XSF_SFI_CSTM_ID   BIT(24) CONSTANT('819400'X);            ! @K1A 61955000
*  DCL XSF_CSTM_LENGTH   BIT(16) CONSTANT('000C'X);              ! @K1A 61955500
*  DCL XSF_CSTM_DTYPE    BIT(8)  CONSTANT('0A'X);                ! @K1A 61956000
*/*************************************************************/ ! @LGA 61956300
*  DCL XSF_SFI_CSVE    BIT(64) CONSTANT('0009819600000003'X);    ! @LGA 61956600
*                                 ! Stacked volume enabled status  @LGA 61956900
*  DCL XSF_SFI_CSVE_ID   BIT(24) CONSTANT('819600'X);            ! @LGA 61957200
*  DCL XSF_CSVE_LENGTH   BIT(16) CONSTANT('0009'X);              ! @LGA 61957500
*  DCL XSF_CSVE_DTYPE    BIT(8)  CONSTANT('03'X);                ! @LGA 61957800
*                                                                ! @LGA 61958100
*  DCL XSF_CSVE_DATA_NONE      BIN(8) CONSTANT('00'X);           ! @LGA 61958400
*  DCL XSF_CSVE_DATA_ENABLED   BIN(8) CONSTANT('01'X);           ! @LGA 61958700
*  DCL XSF_CSVE_DATA_DISABLED  BIN(8) CONSTANT('02'X);           ! @LGA 61959000
*  DCL XSF_CSVE_DATA_MIXED     BIN(8) CONSTANT('03'X);           ! @LGA 61959300
*/**************************************************************/! @01A 61959600
*  DCL XSF_SFI_CTLG      BIT(64) CONSTANT('0009819800000003'X);  ! @01A 61960000
*                                                ! Catalog Status  @01A 61963500
*  DCL XSF_SFI_CTLG_ID   BIT(24) CONSTANT('819800'X);            ! @01A 61967000
*  DCL XSF_CTLG_LENGTH   BIT(16) CONSTANT('0009'X);              ! @01A 61970500
*  DCL XSF_CTLG_DTYPE    BIT(8)  CONSTANT('03'X);                ! @01A 61974000
*                                                                ! @01A 61977500
*  DCL XSF_CTLG_DATA_UNKNOWN    BIN(8) CONSTANT('00'X);          ! @01A 61981000
*  DCL XSF_CTLG_DATA_NO         BIN(8) CONSTANT('01'X);          ! @K1A 61982300
*  DCL XSF_CTLG_DATA_YES        BIN(8) CONSTANT('02'X);          ! @K1A 61983600
*/********************************************************************/ 61985100
*  DCL XSF_SFI_CTM     BIT(64) CONSTANT('000C81A00000000A'X);           62017200
*                                      /*Create Time                 */ 62049300
*  DCL XSF_SFI_CTM_ID    BIT(24) CONSTANT('81A000'X);                   62081400
*  DCL XSF_CTM_LENGTH    BIT(16) CONSTANT('000C'X);                     62113500
*  DCL XSF_CTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       62145600
*/*************************************************************/ ! @S8A 62150100
*  DCL XSF_SFI_CTNR      BIT(64) CONSTANT('001881A300000007'X);  ! @S8A 62154600
*                                               ! Container        @S8A 62159100
*  DCL XSF_SFI_CTNR_ID    BIT(24) CONSTANT('81A300'X);           ! @S8A 62163600
*  DCL XSF_CTNR_LENGTH    BIT(16) CONSTANT('0018'X);             ! @S8A 62168100
*  DCL XSF_CTNR_DTYPE     BIT(8)  CONSTANT('07'X);               ! @S8A 62172600
*/********************************************************************/ 62177700
*  DCL XSF_SFI_DBN     BIT(64) CONSTANT('000C81B000000005'X);           62209800
*                                      /*Bin Numbers in DISTANT      */ 62241900
*  DCL XSF_SFI_DBN_ID    BIT(24) CONSTANT('81B000'X);                   62274000
*  DCL XSF_DBN_LENGTH    BIT(16) CONSTANT('000C'X);                     62306100
*  DCL XSF_DBN_DTYPE     BIT(8)  CONSTANT('05'X);                       62338200
*/*************************************************************/ ! @SCA 62340190
*  DCL XSF_SFI_DBIN    BIT(64) CONSTANT('000E81A600000001'X);    ! @SCA 62342180
*                                      ! Destination Bin number    @SCA 62344170
*  DCL XSF_SFI_DBIN_ID   BIT(24) CONSTANT('81A600'X);            ! @SCA 62346160
*  DCL XSF_DBIN_LENGTH   BIT(16) CONSTANT('000E'X);              ! @SCA 62348150
*  DCL XSF_DBIN_DTYPE    BIT(8)  CONSTANT('01'X);                ! @SCA 62350140
*/*************************************************************/ ! @SCA 62352130
*  DCL XSF_SFI_DBMN    BIT(64) CONSTANT('000E81A700000001'X);    ! @SCA 62354120
*                                     ! Destination Bin media name @SCA 62356110
*  DCL XSF_SFI_DBMN_ID   BIT(24) CONSTANT('81A700'X);            ! @SCA 62358100
*  DCL XSF_DBMN_LENGTH   BIT(16) CONSTANT('000E'X);              ! @SCA 62360090
*  DCL XSF_DBMN_DTYPE    BIT(8)  CONSTANT('01'X);                ! @SCA 62362080
*/********************************************************************/ 62370300
*  DCL XSF_SFI_DC      BIT(64) CONSTANT('001081C000000007'X);           62402400
*                                      /*Data Class                  */ 62434500
*  DCL XSF_SFI_DC_ID     BIT(24) CONSTANT('81C000'X);                   62466600
*  DCL XSF_DC_LENGTH     BIT(16) CONSTANT('0010'X);                     62498700
*  DCL XSF_DC_DTYPE      BIT(8)  CONSTANT('07'X);                       62530800
*/********************************************************************/ 62562900
*  DCL XSF_SFI_DD      BIT(64) CONSTANT('001081D000000007'X);           62595000
*                                      /*DD Name                     */ 62627100
*  DCL XSF_SFI_DD_ID     BIT(24) CONSTANT('81D000'X);                   62659200
*  DCL XSF_DD_LENGTH     BIT(16) CONSTANT('0010'X);                     62691300
*  DCL XSF_DD_DTYPE      BIT(8)  CONSTANT('07'X);                       62723400
*/********************************************************************/ 62755500
*  DCL XSF_SFI_DDTJ    BIT(64) CONSTANT('000C81E000000009'X);           62787600
*                                      /*Delete/Store Date           */ 62819700
*  DCL XSF_SFI_DDTJ_ID   BIT(24) CONSTANT('81E000'X);                   62851800
*  DCL XSF_DDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     62883900
*  DCL XSF_DDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       62916000
*/********************************************************************/ 62948100
*  DCL XSF_SFI_DEN     BIT(64) CONSTANT('000981F000000003'X);           62980200
*                                      /*Media Density               */ 63012300
*  DCL XSF_SFI_DEN_ID    BIT(24) CONSTANT('81F000'X);                   63044400
*  DCL XSF_DEN_LENGTH    BIT(16) CONSTANT('0009'X);                     63076500
*  DCL XSF_DEN_DTYPE     BIT(8)  CONSTANT('03'X);                       63108600
*                                                                       63140700
*  DCL XSF_DEN_DATA_UNDEFINED   BIN(8) CONSTANT('00'X);                 63172800
*  DCL XSF_DEN_DATA_1600        BIN(8) CONSTANT('01'X);                 63204900
*  DCL XSF_DEN_DATA_6250        BIN(8) CONSTANT('02'X);                 63237000
*  DCL XSF_DEN_DATA_3480        BIN(8) CONSTANT('03'X);                 63269100
*  DCL XSF_DEN_DATA_COMPACT     BIN(8) CONSTANT('04'X);                 63301200
*/********************************************************************/ 63333300
*  DCL XSF_SFI_DESC    BIT(64) CONSTANT('0026820000000007'X);           63365400
*                                      /*Volume or VRS Description   */ 63397500
*  DCL XSF_SFI_DESC_ID   BIT(24) CONSTANT('820000'X);                   63429600
*  DCL XSF_DESC_LENGTH   BIT(16) CONSTANT('0026'X);                     63461700
*  DCL XSF_DESC_DTYPE    BIT(8)  CONSTANT('07'X);                       63493800
*/********************************************************************/ 63525900
*  DCL XSF_SFI_DEST    BIT(64) CONSTANT('0010821000000007'X);           63558000
*                                      /*Destination Name            */ 63590100
*  DCL XSF_SFI_DEST_ID   BIT(24) CONSTANT('821000'X);                   63622200
*  DCL XSF_DEST_LENGTH   BIT(16) CONSTANT('0010'X);                     63654300
*  DCL XSF_DEST_DTYPE    BIT(8)  CONSTANT('07'X);                       63686400
*/********************************************************************/ 63718500
*  DCL XSF_SFI_DEV     BIT(64) CONSTANT('000C822000000001'X);    ! @S9C 63750600
*                                      /*Device Number               */ 63782700
*  DCL XSF_SFI_DEV_ID    BIT(24) CONSTANT('822000'X);                   63814800
*  DCL XSF_DEV_LENGTH    BIT(16) CONSTANT('000C'X);                     63846900
*  DCL XSF_DEV_DTYPE     BIT(8)  CONSTANT('01'X);                ! @S9C 63879000
*/********************************************************************/ 63911100
*  DCL XSF_SFI_DLRJ    BIT(64) CONSTANT('000C823000000009'X);           63943200
*                                      /*Date Last Read              */ 63975300
*  DCL XSF_SFI_DLRJ_ID   BIT(24) CONSTANT('823000'X);                   64007400
*  DCL XSF_DLRJ_LENGTH   BIT(16) CONSTANT('000C'X);                     64039500
*  DCL XSF_DLRJ_DTYPE    BIT(8)  CONSTANT('09'X);                       64071600
*/********************************************************************/ 64103700
*  DCL XSF_SFI_DLWJ    BIT(64) CONSTANT('000C824000000009'X);           64135800
*                                      /*Date Last Written           */ 64167900
*  DCL XSF_SFI_DLWJ_ID   BIT(24) CONSTANT('824000'X);                   64200000
*  DCL XSF_DLWJ_LENGTH   BIT(16) CONSTANT('000C'X);                     64232100
*  DCL XSF_DLWJ_DTYPE    BIT(8)  CONSTANT('09'X);                       64264200
*/********************************************************************/ 64296300
*  DCL XSF_SFI_DNM     BIT(64) CONSTANT('0034825000000007'X);           64328400
*                                      /*Data Set Name Mask          */ 64360500
*  DCL XSF_SFI_DNM_ID    BIT(24) CONSTANT('825000'X);                   64392600
*  DCL XSF_DNM_LENGTH    BIT(16) CONSTANT('0034'X);                     64424700
*  DCL XSF_DNM_DTYPE     BIT(8)  CONSTANT('07'X);                       64456800
*/*************************************************************/ ! @S9A 64461300
*  DCL XSF_SFI_DPCT    BIT(64) CONSTANT('0009825E00000003'X);    ! @S9A 64465800
*                                           ! Percent of Volume  ! @S9A 64470300
*  DCL XSF_SFI_DPCT_ID   BIT(24) CONSTANT('825E00'X);            ! @S9A 64474800
*  DCL XSF_DPCT_LENGTH   BIT(16) CONSTANT('0009'X);              ! @S9A 64479300
*  DCL XSF_DPCT_DTYPE    BIT(8)  CONSTANT('03'X);                ! @S9A 64483800
*/********************************************************************/ 64488900
*  DCL XSF_SFI_DPT     BIT(64) CONSTANT('0030826000000007'X);           64521000
*                                      /*Owner''s Department         */ 64553100
*  DCL XSF_SFI_DPT_ID    BIT(24) CONSTANT('826000'X);                   64585200
*  DCL XSF_DPT_LENGTH    BIT(16) CONSTANT('0030'X);                     64617300
*  DCL XSF_DPT_DTYPE     BIT(8)  CONSTANT('07'X);                       64649400
*/********************************************************************/ 64681500
*  DCL XSF_SFI_DRP     BIT(64) CONSTANT('000C827000000005'X);           64713600
*                                      /*Default Retention Period    */ 64745700
*  DCL XSF_SFI_DRP_ID    BIT(24) CONSTANT('827000'X);                   64777800
*  DCL XSF_DRP_LENGTH    BIT(16) CONSTANT('000C'X);                     64809900
*  DCL XSF_DRP_DTYPE     BIT(8)  CONSTANT('05'X);                       64842000
*/********************************************************************/ 64874100
*  DCL XSF_SFI_DSC     BIT(64) CONSTANT('000C828000000005'X);           64906200
*                                      /*Data Set Count              */ 64938300
*  DCL XSF_SFI_DSC_ID    BIT(24) CONSTANT('828000'X);                   64970400
*  DCL XSF_DSC_LENGTH    BIT(16) CONSTANT('000C'X);                     65002500
*  DCL XSF_DSC_DTYPE     BIT(8)  CONSTANT('05'X);                       65034600
*/********************************************************************/ 65066700
*  DCL XSF_SFI_DSEQ    BIT(64) CONSTANT('000C829000000005'X);           65098800
*                                      /*Data Set Sequence           */ 65130900
*  DCL XSF_SFI_DSEQ_ID   BIT(24) CONSTANT('829000'X);                   65163000
*  DCL XSF_DSEQ_LENGTH   BIT(16) CONSTANT('000C'X);                     65195100
*  DCL XSF_DSEQ_DTYPE    BIT(8)  CONSTANT('05'X);                       65227200
*/********************************************************************/ 65259300
*  DCL XSF_SFI_DSN     BIT(64) CONSTANT('003482A000000007'X);           65291400
*                                      /*Data Set Name               */ 65323500
*  DCL XSF_SFI_DSN_ID    BIT(24) CONSTANT('82A000'X);                   65355600
*  DCL XSF_DSN_LENGTH    BIT(16) CONSTANT('0034'X);                     65387700
*  DCL XSF_DSN_DTYPE     BIT(8)  CONSTANT('07'X);                       65419800
*/*************************************************************/ ! @K1A 65422200
*  DCL XSF_SFI_DSPD    BIT(64) CONSTANT('001082A500000007'X);    ! @K1A 65424600
*                                           ! Disposition DD name  @K1A 65427000
*  DCL XSF_SFI_DSPD_ID   BIT(24) CONSTANT('82A500'X);            ! @K1A 65429400
*  DCL XSF_DSPD_LENGTH   BIT(16) CONSTANT('0010'X);              ! @K1A 65431800
*  DCL XSF_DSPD_DTYPE    BIT(8)  CONSTANT('07'X);                ! @K1A 65434200
*/*************************************************************/ ! @K1A 65436600
*  DCL XSF_SFI_DSPM    BIT(64) CONSTANT('001082AA00000007'X);    ! @K1A 65439000
*                                    ! Disposition message prefix  @K1A 65441400
*  DCL XSF_SFI_DSPM_ID   BIT(24) CONSTANT('82AA00'X);            ! @K1A 65443800
*  DCL XSF_DSPM_LENGTH   BIT(16) CONSTANT('0010'X);              ! @K1A 65446200
*  DCL XSF_DSPM_DTYPE    BIT(8)  CONSTANT('07'X);                ! @K1A 65448600
*/********************************************************************/ 65451900
*  DCL XSF_SFI_DSR     BIT(64) CONSTANT('000982B000000003'X);           65484000
*                                      /*Data Set Recording          */ 65516100
*  DCL XSF_SFI_DSR_ID    BIT(24) CONSTANT('82B000'X);                   65548200
*  DCL XSF_DSR_LENGTH    BIT(16) CONSTANT('0009'X);                     65580300
*  DCL XSF_DSR_DTYPE     BIT(8)  CONSTANT('03'X);                       65612400
*                                                                       65644500
*  DCL XSF_DSR_DATA_OFF         BIN(8) CONSTANT('00'X);                 65676600
*  DCL XSF_DSR_DATA_ON          BIN(8) CONSTANT('01'X);                 65708700
*/*************************************************************/ ! @SCA 65710690
*  DCL XSF_SFI_DSTT    BIT(64) CONSTANT('000982B200000003'X);    ! @SCA 65712680
*                                      ! Destination Type          @SCA 65714670
*  DCL XSF_SFI_DSTT_ID   BIT(24) CONSTANT('82B200'X);            ! @SCA 65716660
*  DCL XSF_DSTT_LENGTH   BIT(16) CONSTANT('0009'X);              ! @SCA 65718650
*  DCL XSF_DSTT_DTYPE    BIT(8)  CONSTANT('03'X);                ! @SCA 65720640
*                                                                ! @SCA 65722630
*  DCL XSF_DSTT_DATA_SHELF              BIN(8) CONSTANT('00'X);  ! @SCA 65724620
*  DCL XSF_DSTT_DATA_STORE_BUILTIN_BINS BIN(8) CONSTANT('01'X);  ! @SCA 65726610
*  DCL XSF_DSTT_DATA_MANUAL             BIN(8) CONSTANT('02'X);  ! @SCA 65728600
*  DCL XSF_DSTT_DATA_AUTO               BIN(8) CONSTANT('03'X);  ! @SCA 65730590
*  DCL XSF_DSTT_DATA_STORE_BINS         BIN(8) CONSTANT('04'X);  ! @SCA 65732580
*  DCL XSF_DSTT_DATA_STORE_NOBINS       BIN(8) CONSTANT('05'X);  ! @SCA 65734570
*/********************************************************************/ 65740800
*  DCL XSF_SFI_DSYS    BIT(64) CONSTANT('001082BB00000007'X);    ! @05A 65744790
*                              ! Creation System ID for first file @05A 65748780
*  DCL XSF_SFI_DSYS_ID    BIT(24) CONSTANT('82BB00'X);           ! @05A 65752770
*  DCL XSF_DSYS_LENGTH    BIT(16) CONSTANT('0010'X);             ! @05A 65756760
*  DCL XSF_DSYS_DTYPE     BIT(8)  CONSTANT('07'X);               ! @05A 65760750
*/********************************************************************/ 65764740
*  DCL XSF_SFI_DTE     BIT(64) CONSTANT('000982C000000003'X);           65772900
*                                      /*Installation Date Format    */ 65805000
*  DCL XSF_SFI_DTE_ID    BIT(24) CONSTANT('82C000'X);                   65837100
*  DCL XSF_DTE_LENGTH    BIT(16) CONSTANT('0009'X);                     65869200
*  DCL XSF_DTE_DTYPE     BIT(8)  CONSTANT('03'X);                       65901300
*                                                                       65933400
*  DCL XSF_DTE_DATA_A           BIN(8) CONSTANT('01'X);                 65965500
*  DCL XSF_DTE_DATA_E           BIN(8) CONSTANT('02'X);                 65997600
*  DCL XSF_DTE_DATA_I           BIN(8) CONSTANT('03'X);                 66029700
*  DCL XSF_DTE_DATA_J           BIN(8) CONSTANT('04'X);                 66061800
*/********************************************************************/ 66093900
*  DCL XSF_SFI_DTM     BIT(64) CONSTANT('000C82D00000000A'X);           66126000
*                                      /*Last Store update run time  */ 66158100
*  DCL XSF_SFI_DTM_ID    BIT(24) CONSTANT('82D000'X);                   66190200
*  DCL XSF_DTM_LENGTH    BIT(16) CONSTANT('000C'X);                     66222300
*  DCL XSF_DTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       66254400
*/********************************************************************/ 66286500
*  DCL XSF_SFI_EMN     BIT(64) CONSTANT('001082E000000007'X);           66318600
*                                      /*Owner''s Node               */ 66350700
*  DCL XSF_SFI_EMN_ID    BIT(24) CONSTANT('82E000'X);                   66382800
*  DCL XSF_EMN_LENGTH    BIT(16) CONSTANT('0010'X);                     66414900
*  DCL XSF_EMN_DTYPE     BIT(8)  CONSTANT('07'X);                       66447000
*/*************************************************************/ ! @SCA 66449990
*  DCL XSF_SFI_EBIN    BIT(64) CONSTANT('000982D500000003'X);    ! @SCA 66452980
*                                   ! Extended Bin Enabled Status  @SCA 66455970
*  DCL XSF_SFI_EBIN_ID   BIT(24) CONSTANT('82D500'X);            ! @SCA 66458960
*  DCL XSF_EBIN_LENGTH   BIT(16) CONSTANT('0009'X);              ! @SCA 66461950
*  DCL XSF_EBIN_DTYPE    BIT(8)  CONSTANT('03'X);                ! @SCA 66464940
*                                                                ! @SCA 66467930
*  DCL XSF_EBIN_DATA_DISABLED  BIN(8) CONSTANT('00'X);           ! @SCA 66470920
*  DCL XSF_EBIN_DATA_ENABLED   BIN(8) CONSTANT('01'X);           ! @SCA 66473910
*/********************************************************************/ 66479100
*  DCL XSF_SFI_EMU     BIT(64) CONSTANT('001082F000000007'X);           66511200
*                                      /*Owner''s User ID            */ 66543300
*  DCL XSF_SFI_EMU_ID    BIT(24) CONSTANT('82F000'X);                   66575400
*  DCL XSF_EMU_LENGTH    BIT(16) CONSTANT('0010'X);                     66607500
*  DCL XSF_EMU_DTYPE     BIT(8)  CONSTANT('07'X);                       66639600
*/********************************************************************/ 66671700
*  DCL XSF_SFI_ETL     BIT(64) CONSTANT('001C830000000007'X);           66703800
*                                      /*Owner''s Ext Telephone Num  */ 66735900
*  DCL XSF_SFI_ETL_ID    BIT(24) CONSTANT('830000'X);                   66768000
*  DCL XSF_ETL_LENGTH    BIT(16) CONSTANT('001C'X);                     66800100
*  DCL XSF_ETL_DTYPE     BIT(8)  CONSTANT('07'X);                       66832200
*/********************************************************************/ 66864300
*  DCL XSF_SFI_FCD     BIT(64) CONSTANT('000C831000000007'X);           66896400
*                                      /*Product Feature Code        */ 66928500
*  DCL XSF_SFI_FCD_ID    BIT(24) CONSTANT('831000'X);                   66960600
*  DCL XSF_FCD_LENGTH    BIT(16) CONSTANT('000C'X);                     66992700
*  DCL XSF_FCD_DTYPE     BIT(8)  CONSTANT('07'X);                       67024800
*/*************************************************************/ ! @K1A 67029300
*  DCL XSF_SFI_FCSP    BIT(64) CONSTANT('0009831800000003'X);    ! @K1A 67033800
*                               ! Catalog Synchronize in progress  @K1A 67038300
*  DCL XSF_SFI_FCSP_ID   BIT(24) CONSTANT('831800'X);            ! @K1A 67042800
*  DCL XSF_FCSP_LENGTH   BIT(16) CONSTANT('0009'X);              ! @K1A 67047300
*  DCL XSF_FCSP_DTYPE    BIT(8)  CONSTANT('03'X);                ! @K1A 67051800
*/********************************************************************/ 67056900
*  DCL XSF_SFI_FDB     BIT(64) CONSTANT('000C832000000005'X);           67089000
*                                      /*Free Bins in DISTANT Loc    */ 67121100
*  DCL XSF_SFI_FDB_ID    BIT(24) CONSTANT('832000'X);                   67153200
*  DCL XSF_FDB_LENGTH    BIT(16) CONSTANT('000C'X);                     67185300
*  DCL XSF_FDB_DTYPE     BIT(8)  CONSTANT('05'X);                       67217400
*/********************************************************************/ 67249500
*  DCL XSF_SFI_FILE    BIT(64) CONSTANT('000C833000000005'X);           67281600
*                                      /*Physical File Sequence      */ 67313700
*  DCL XSF_SFI_FILE_ID   BIT(24) CONSTANT('833000'X);                   67345800
*  DCL XSF_FILE_LENGTH   BIT(16) CONSTANT('000C'X);                     67377900
*  DCL XSF_FILE_DTYPE    BIT(8)  CONSTANT('05'X);                       67410000
*/********************************************************************/ 67442100
*  DCL XSF_SFI_FLB     BIT(64) CONSTANT('000C834000000005'X);           67474200
*                                      /*Free Bin Numbers in LOCAL   */ 67506300
*  DCL XSF_SFI_FLB_ID    BIT(24) CONSTANT('834000'X);                   67538400
*  DCL XSF_FLB_LENGTH    BIT(16) CONSTANT('000C'X);                     67570500
*  DCL XSF_FLB_DTYPE     BIT(8)  CONSTANT('05'X);                       67602600
*/********************************************************************/ 67634700
*  DCL XSF_SFI_FOR     BIT(64) CONSTANT('001C835000000007'X);           67666800
*                                      /*Owner''s Forename           */ 67698900
*  DCL XSF_SFI_FOR_ID    BIT(24) CONSTANT('835000'X);                   67731000
*  DCL XSF_FOR_LENGTH    BIT(16) CONSTANT('001C'X);                     67763100
*  DCL XSF_FOR_DTYPE     BIT(8)  CONSTANT('07'X);                       67795200
*/********************************************************************/ 67827300
*  DCL XSF_SFI_FRB     BIT(64) CONSTANT('000C836000000005'X);           67859400
*                                      /*Free Bin Numbers in REMOTE  */ 67891500
*  DCL XSF_FRB_LENGTH    BIT(16) CONSTANT('000C'X);                     67923600
*  DCL XSF_SFI_FRB_ID    BIT(24) CONSTANT('836000'X);                   67955700
*  DCL XSF_FRB_DTYPE     BIT(8)  CONSTANT('05'X);                       67987800
*/********************************************************************/ 68019900
*  DCL XSF_SFI_FRK     BIT(64) CONSTANT('000C837000000005'X);           68052000
*                                      /*Free Rack Num in Library    */ 68084100
*  DCL XSF_SFI_FRK_ID    BIT(24) CONSTANT('837000'X);                   68116200
*  DCL XSF_FRK_LENGTH    BIT(16) CONSTANT('000C'X);                     68148300
*  DCL XSF_FRK_DTYPE     BIT(8)  CONSTANT('05'X);                       68180400
*/********************************************************************/ 68212500
*  DCL XSF_SFI_GRK     BIT(64) CONSTANT('000E838000000001'X);           68244600
*                                      /*Generic Rack Number         */ 68276700
*  DCL XSF_SFI_GRK_ID    BIT(24) CONSTANT('838000'X);                   68308800
*  DCL XSF_GRK_LENGTH    BIT(16) CONSTANT('000E'X);                     68340900
*  DCL XSF_GRK_DTYPE     BIT(8)  CONSTANT('01'X);                       68373000
*/********************************************************************/ 68405100
*  DCL XSF_SFI_HLOC    BIT(64) CONSTANT('0010839000000007'X);           68437200
*                                      /*Home Location               */ 68469300
*  DCL XSF_SFI_HLOC_ID   BIT(24) CONSTANT('839000'X);                   68501400
*  DCL XSF_HLOC_LENGTH   BIT(16) CONSTANT('0010'X);                     68533500
*  DCL XSF_HLOC_DTYPE    BIT(8)  CONSTANT('07'X);                       68565600
*/*************************************************************/ ! @SCA 68567590
*  DCL XSF_SFI_HLOT    BIT(64) CONSTANT('0009839200000003'X);    ! @SCA 68569580
*                                      ! Home Location Type        @SCA 68571570
*  DCL XSF_SFI_HLOT_ID   BIT(24) CONSTANT('839200'X);            ! @SCA 68573560
*  DCL XSF_HLOT_LENGTH   BIT(16) CONSTANT('0009'X);              ! @SCA 68575550
*  DCL XSF_HLOT_DTYPE    BIT(8)  CONSTANT('03'X);                ! @SCA 68577540
*                                                                ! @SCA 68579530
*  DCL XSF_HLOT_DATA_SHELF              BIN(8) CONSTANT('00'X);  ! @SCA 68581520
*  DCL XSF_HLOT_DATA_MANUAL             BIN(8) CONSTANT('02'X);  ! @SCA 68583510
*  DCL XSF_HLOT_DATA_AUTO               BIN(8) CONSTANT('03'X);  ! @SCA 68585500
*/********************************************************************/ 68597700
*  DCL XSF_SFI_INTR    BIT(64) CONSTANT('000983A000000003'X);           68629800
*                                      /*Volume Intransit Status     */ 68661900
*  DCL XSF_SFI_INTR_ID   BIT(24) CONSTANT('83A000'X);                   68694000
*  DCL XSF_INTR_LENGTH   BIT(16) CONSTANT('0009'X);                     68726100
*  DCL XSF_INTR_DTYPE    BIT(8)  CONSTANT('03'X);                       68758200
*                                                                       68790300
*  DCL XSF_INTR_DATA_NO         BIN(8) CONSTANT('00'X);                 68822400
*  DCL XSF_INTR_DATA_YES        BIN(8) CONSTANT('01'X);                 68854500
*/********************************************************************/ 68886600
*  DCL XSF_SFI_IPL     BIT(64) CONSTANT('000983B000000003'X);           68918700
*                                      /*Data Check Required in IPL  */ 68950800
*  DCL XSF_SFI_IPL_ID    BIT(24) CONSTANT('83B000'X);                   68982900
*  DCL XSF_IPL_LENGTH    BIT(16) CONSTANT('0009'X);                     69015000
*  DCL XSF_IPL_DTYPE     BIT(8)  CONSTANT('03'X);                       69047100
*                                                                       69079200
*  DCL XSF_IPL_DATA_NO          BIN(8) CONSTANT('00'X);                 69111300
*  DCL XSF_IPL_DATA_YES         BIN(8) CONSTANT('01'X);                 69143400
*/********************************************************************/ 69175500
*  DCL XSF_SFI_ITL     BIT(64) CONSTANT('001083C000000007'X);           69207600
*                                      /*Owner''s Internal Tele Num  */ 69239700
*  DCL XSF_SFI_ITL_ID    BIT(24) CONSTANT('83C000'X);                   69271800
*  DCL XSF_ITL_LENGTH    BIT(16) CONSTANT('0010'X);                     69303900
*  DCL XSF_ITL_DTYPE     BIT(8)  CONSTANT('07'X);                       69336000
*/********************************************************************/ 69368100
*  DCL XSF_SFI_JDS     BIT(64) CONSTANT('003483D000000007'X);           69400200
*                                      /*Journal Name                */ 69432300
*  DCL XSF_SFI_JDS_ID    BIT(24) CONSTANT('83D000'X);                   69464400
*  DCL XSF_JDS_LENGTH    BIT(16) CONSTANT('0034'X);                     69496500
*  DCL XSF_JDS_DTYPE     BIT(8)  CONSTANT('07'X);                       69528600
*/********************************************************************/ 69560700
*  DCL XSF_SFI_JRNF    BIT(64) CONSTANT('000A83E000000004'X);           69592800
*                                      /*JOURNALFULL Parmlib Value   */ 69624900
*  DCL XSF_SFI_JRNF_ID   BIT(24) CONSTANT('83E000'X);                   69657000
*  DCL XSF_JRNF_LENGTH   BIT(16) CONSTANT('000A'X);                     69689100
*  DCL XSF_JRNF_DTYPE    BIT(8)  CONSTANT('04'X);                       69721200
*/********************************************************************/ 69753300
*  DCL XSF_SFI_JRNU    BIT(64) CONSTANT('000A83F000000004'X);           69785400
*                                      /*Journal Percentage Used     */ 69817500
*  DCL XSF_SFI_JRNU_ID   BIT(24) CONSTANT('83F000'X);                   69849600
*  DCL XSF_JRNU_LENGTH   BIT(16) CONSTANT('000A'X);                     69881700
*  DCL XSF_JRNU_DTYPE    BIT(8)  CONSTANT('04'X);                       69913800
*/********************************************************************/ 69945900
*  DCL XSF_SFI_LBL     BIT(64) CONSTANT('0009840000000002'X);           69978000
*                                      /*Volume Label                */ 70010100
*  DCL XSF_SFI_LBL_ID    BIT(24) CONSTANT('840000'X);                   70042200
*  DCL XSF_LBL_LENGTH    BIT(16) CONSTANT('0009'X);                     70074300
*  DCL XSF_LBL_DTYPE     BIT(8)  CONSTANT('02'X);                       70106400
*                                                                       70138500
*  DCL XSF_LBL_FLAG_NL         BIT(8) CONSTANT('20'X);                  70170600
*  DCL XSF_LBL_FLAG_AL         BIT(8) CONSTANT('10'X);                  70202700
*  DCL XSF_LBL_FLAG_SL         BIT(8) CONSTANT('08'X);                  70234800
*  DCL XSF_LBL_FLAG_BLP        BIT(8) CONSTANT('02'X);                  70266900
*  DCL XSF_LBL_FLAG_UL         BIT(8) CONSTANT('01'X);                  70299000
*/********************************************************************/ 70331100
*  DCL XSF_SFI_LBN     BIT(64) CONSTANT('000C841000000005'X);           70363200
*                                      /*Bin Numbers in LOCAL        */ 70395300
*  DCL XSF_SFI_LBN_ID    BIT(24) CONSTANT('841000'X);                   70427400
*  DCL XSF_LBN_LENGTH    BIT(16) CONSTANT('000C'X);                     70459500
*  DCL XSF_LBN_DTYPE     BIT(8)  CONSTANT('05'X);                       70491600
*/********************************************************************/ 70523700
*  DCL XSF_SFI_LCID    BIT(64) CONSTANT('0010842000000007'X);           70555800
*                                      /*Last Change User ID         */ 70587900
*  DCL XSF_SFI_LCID_ID   BIT(24) CONSTANT('842000'X);                   70620000
*  DCL XSF_LCID_LENGTH   BIT(16) CONSTANT('0010'X);                     70652100
*  DCL XSF_LCID_DTYPE    BIT(8)  CONSTANT('07'X);                       70684200
*/********************************************************************/ 70716300
*  DCL XSF_SFI_LCT     BIT(64) CONSTANT('000A843000000004'X);           70748400
*                                      /*Default Lines per Page      */ 70780500
*  DCL XSF_SFI_LCT_ID    BIT(24) CONSTANT('843000'X);                   70812600
*  DCL XSF_LCT_LENGTH    BIT(16) CONSTANT('000A'X);                     70844700
*  DCL XSF_LCT_DTYPE     BIT(8)  CONSTANT('04'X);                       70876800
*/**************************************************************/! @02A 70881300
*  DCL XSF_SFI_LDD       BIT(64) CONSTANT('0010843B00000001'X);  ! @02A 70885800
*                                        ! Last used dd name       @02A 70890300
*  DCL XSF_SFI_LDD_ID    BIT(24) CONSTANT('843B00'X);            ! @02A 70894800
*  DCL XSF_LDD_LENGTH    BIT(16) CONSTANT('0010'X);              ! @02A 70899300
*  DCL XSF_LDD_DTYPE     BIT(8)  CONSTANT('01'X);                ! @02A 70903800
*/********************************************************************/ 70908900
*  DCL XSF_SFI_LDDF    BIT(64) CONSTANT('0009844000000003'X);           70941000
*                                      /*Location Definition Exists  */ 70973100
*  DCL XSF_SFI_LDDF_ID   BIT(24) CONSTANT('844000'X);                   71005200
*  DCL XSF_LDDF_LENGTH   BIT(16) CONSTANT('0009'X);                     71037300
*  DCL XSF_LDDF_DTYPE    BIT(8)  CONSTANT('03'X);                       71069400
*                                                                       71101500
*  DCL XSF_LDDF_DATA_NO         BIN(8) CONSTANT('00'X);                 71133600
*  DCL XSF_LDDF_DATA_YES        BIN(8) CONSTANT('01'X);                 71165700
*/********************************************************************/ 71197800
*  DCL XSF_SFI_LDEV    BIT(64) CONSTANT('000C845000000001'X);           71229900
*                                      /*Last Drive                  */ 71262000
*  DCL XSF_SFI_LDEV_ID   BIT(24) CONSTANT('845000'X);                   71294100
*  DCL XSF_LDEV_LENGTH   BIT(16) CONSTANT('000C'X);                     71326200
*  DCL XSF_LDEV_DTYPE    BIT(8)  CONSTANT('01'X);                       71358300
*/********************************************************************/ 71390400
*  DCL XSF_SFI_LDLC    BIT(64) CONSTANT('0010846000000007'X);           71422500
*                                      /*Location Name               */ 71454600
*  DCL XSF_SFI_LDLC_ID   BIT(24) CONSTANT('846000'X);                   71486700
*  DCL XSF_LDLC_LENGTH   BIT(16) CONSTANT('0010'X);                     71518800
*  DCL XSF_LDLC_DTYPE    BIT(8)  CONSTANT('07'X);                       71550900
*/********************************************************************/ 71583000
*  DCL XSF_SFI_LDLT    BIT(64) CONSTANT('0009847000000003'X);           71615100
*                                      /*Location Type               */ 71647200
*  DCL XSF_SFI_LDLT_ID   BIT(24) CONSTANT('847000'X);                   71679300
*  DCL XSF_LDLT_LENGTH   BIT(16) CONSTANT('0009'X);                     71711400
*  DCL XSF_LDLT_DTYPE    BIT(8)  CONSTANT('03'X);                       71743500
*                                                                       71775600
*  DCL XSF_LDLT_DATA_SHELF      BIN(8) CONSTANT('00'X);                 71807700
*  DCL XSF_LDLT_DATA_AUTO       BIN(8) CONSTANT('01'X);                 71839800
*  DCL XSF_LDLT_DATA_MANUAL     BIN(8) CONSTANT('02'X);                 71871900
*  DCL XSF_LDLT_DATA_STORE      BIN(8) CONSTANT('03'X);                 71904000
*  DCL XSF_LDLT_DATA_HSTORE     BIN(8) CONSTANT('04'X);          ! @05A 71913990
*/********************************************************************/ 71936100
*  DCL XSF_SFI_LDMN    BIT(64) CONSTANT('0010848000000007'X);           71968200
*                                      /*Location Media Name         */ 72000300
*  DCL XSF_SFI_LDMN_ID   BIT(24) CONSTANT('848000'X);                   72032400
*  DCL XSF_LDMN_LENGTH   BIT(16) CONSTANT('0010'X);                     72064500
*  DCL XSF_LDMN_DTYPE    BIT(8)  CONSTANT('07'X);                       72096600
*/********************************************************************/ 72128700
*  DCL XSF_SFI_LDMT    BIT(64) CONSTANT('0009849000000003'X);           72160800
*                                      /*Location Management Type    */ 72192900
*  DCL XSF_SFI_LDMT_ID   BIT(24) CONSTANT('849000'X);                   72225000
*  DCL XSF_LDMT_LENGTH   BIT(16) CONSTANT('0009'X);                     72257100
*  DCL XSF_LDMT_DTYPE    BIT(8)  CONSTANT('03'X);                       72289200
*                                                                       72321300
*  DCL XSF_LDMT_DATA_UNDEFINED  BIN(8) CONSTANT('00'X);                 72353400
*  DCL XSF_LDMT_DATA_BIN        BIN(8) CONSTANT('01'X);                 72385500
*  DCL XSF_LDMT_DATA_NOBINS     BIN(8) CONSTANT('02'X);                 72417600
*/********************************************************************/ 72449700
*  DCL XSF_SFI_LDPR    BIT(64) CONSTANT('000C84A000000005'X);           72481800
*                                      /*Location Priority           */ 72513900
*  DCL XSF_SFI_LDPR_ID   BIT(24) CONSTANT('84A000'X);                   72546000
*  DCL XSF_LDPR_LENGTH   BIT(16) CONSTANT('000C'X);                     72578100
*  DCL XSF_LDPR_DTYPE    BIT(8)  CONSTANT('05'X);                       72610200
*/********************************************************************/ 72642300
*  DCL XSF_SFI_LINE    BIT(64) CONSTANT('000884B000000007'X);           72674400
*                                      /*Output Data Line            */ 72706500
*  DCL XSF_SFI_LINE_ID   BIT(24) CONSTANT('84B000'X);                   72738600
*  DCL XSF_LINE_LENGTH   BIT(16) CONSTANT('0008'X);                     72770700
*  DCL XSF_LINE_DTYPE    BIT(8)  CONSTANT('07'X);                       72802800
*/**************************************************************/! @02A 72807300
*  DCL XSF_SFI_LJOB      BIT(64) CONSTANT('001084B420000001'X);  ! @02A 72811800
*                                        ! Last used job name      @02A 72816300
*  DCL XSF_SFI_LJOB_ID   BIT(24) CONSTANT('84B420'X);            ! @02A 72820800
*  DCL XSF_LJOB_LENGTH   BIT(16) CONSTANT('0010'X);              ! @02A 72825300
*  DCL XSF_LJOB_DTYPE    BIT(8)  CONSTANT('01'X);                ! @02A 72829800
*/********************************************************************/ 72834900
*  DCL XSF_SFI_LOAN    BIT(64) CONSTANT('001084C000000007'X);           72867000
*                                      /*Loan Location               */ 72899100
*  DCL XSF_SFI_LOAN_ID   BIT(24) CONSTANT('84C000'X);                   72931200
*  DCL XSF_LOAN_LENGTH   BIT(16) CONSTANT('0010'X);                     72963300
*  DCL XSF_LOAN_DTYPE    BIT(8)  CONSTANT('07'X);                       72995400
*/********************************************************************/ 73027500
*  DCL XSF_SFI_LOC     BIT(64) CONSTANT('001084D000000007'X);           73059600
*                                      /*Location                    */ 73091700
*  DCL XSF_SFI_LOC_ID    BIT(24) CONSTANT('84D000'X);                   73123800
*  DCL XSF_LOC_LENGTH    BIT(16) CONSTANT('0010'X);                     73155900
*  DCL XSF_LOC_DTYPE     BIT(8)  CONSTANT('07'X);                       73188000
*/********************************************************************/ 73220100
*  DCL XSF_SFI_LOCT    BIT(64) CONSTANT('000984E000000003'X);           73252200
*                                      /*Location Type               */ 73284300
*  DCL XSF_SFI_LOCT_ID   BIT(24) CONSTANT('84E000'X);                   73316400
*  DCL XSF_LOCT_LENGTH   BIT(16) CONSTANT('0009'X);                     73348500
*  DCL XSF_LOCT_DTYPE    BIT(8)  CONSTANT('03'X);                       73380600
*                                                                       73412700
*  DCL XSF_LOCT_DATA_SHELF              BIN(8) CONSTANT('00'X);         73444800
*  DCL XSF_LOCT_DATA_STORE_BUILTIN_BINS BIN(8) CONSTANT('01'X);         73476900
*  DCL XSF_LOCT_DATA_MANUAL             BIN(8) CONSTANT('02'X);         73509000
*  DCL XSF_LOCT_DATA_AUTO               BIN(8) CONSTANT('03'X);         73541100
*  DCL XSF_LOCT_DATA_STORE_BINS         BIN(8) CONSTANT('04'X);         73573200
*  DCL XSF_LOCT_DATA_STORE_NOBINS       BIN(8) CONSTANT('05'X);         73605300
*  DCL XSF_LOCT_DATA_INCTNR             BIN(8) CONSTANT('06'X);   !@LGA 73621300
*/**************************************************************/! @02A 73623600
*  DCL XSF_SFI_LPGM      BIT(64) CONSTANT('001084E760000001'X);  ! @02A 73625900
*                                        ! Last used program name  @02A 73628200
*  DCL XSF_SFI_LPGM_ID   BIT(24) CONSTANT('84E760'X);            ! @02A 73630500
*  DCL XSF_LPGM_LENGTH   BIT(16) CONSTANT('0010'X);              ! @02A 73632800
*  DCL XSF_LPGM_DTYPE    BIT(8)  CONSTANT('01'X);                ! @02A 73635100
*/********************************************************************/ 73637400
*  DCL XSF_SFI_LRCL    BIT(64) CONSTANT('000C84F000000005'X);           73669500
*                                      /*Logical Record Length       */ 73701600
*  DCL XSF_SFI_LRCL_ID   BIT(24) CONSTANT('84F000'X);                   73733700
*  DCL XSF_LRCL_LENGTH   BIT(16) CONSTANT('000C'X);                     73765800
*  DCL XSF_LRCL_DTYPE    BIT(8)  CONSTANT('05'X);                       73797900
*/********************************************************************/ 73830000
*  DCL XSF_SFI_LRK     BIT(64) CONSTANT('000C850000000005'X);           73862100
*                                      /*# Library Rack Numbers      */ 73894200
*  DCL XSF_SFI_LRK_ID    BIT(24) CONSTANT('850000'X);                   73926300
*  DCL XSF_LRK_LENGTH    BIT(16) CONSTANT('000C'X);                     73958400
*  DCL XSF_LRK_DTYPE     BIT(8)  CONSTANT('05'X);                       73990500
*/**************************************************************/! @02A 73990600
*  DCL XSF_SFI_LSTP      BIT(64) CONSTANT('0010850370000001'X);  ! @02A 73990700
*                                        ! Last used step name     @02A 73990800
*  DCL XSF_SFI_LSTP_ID   BIT(24) CONSTANT('850370'X);            ! @02A 73990900
*  DCL XSF_LSTP_LENGTH   BIT(16) CONSTANT('0010'X);              ! @02A 73991000
*  DCL XSF_LSTP_DTYPE    BIT(8)  CONSTANT('01'X);                ! @02A 73991100
*/*************************************************************/ ! @K1A 73991800
*  DCL XSF_SFI_LVC     BIT(64) CONSTANT('0009850500000003'X);    ! @K1A 73993100
*                                         ! Current label version  @K1A 73994400
*  DCL XSF_SFI_LVC_ID        BIT(24) CONSTANT('850500'X);        ! @K1A 73995700
*  DCL XSF_LVC_LENGTH        BIT(16) CONSTANT('0009'X);          ! @K1A 73997000
*  DCL XSF_LVC_DTYPE         BIT(8)  CONSTANT('03'X);            ! @K1A 73998300
*                                                                ! @K1A 73999600
*  DCL XSF_LVC_DATA_NO       BIN(8) CONSTANT('00'X);             ! @K1A 74000900
*  DCL XSF_LVC_DATA_VERSION1 BIN(8) CONSTANT('01'X);             ! @K1A 74002200
*  DCL XSF_LVC_DATA_VERSION3 BIN(8) CONSTANT('03'X);             ! @K1A 74003500
*  DCL XSF_LVC_DATA_VERSION4 BIN(8) CONSTANT('04'X);             ! @K1A 74004800
*/*************************************************************/ ! @K1A 74006100
*  DCL XSF_SFI_LVN     BIT(64) CONSTANT('0009850A00000003'X);    ! @K1A 74007400
*                                        ! Required label version  @K1A 74008700
*  DCL XSF_SFI_LVN_ID        BIT(24) CONSTANT('850A00'X);        ! @K1A 74010000
*  DCL XSF_LVN_LENGTH        BIT(16) CONSTANT('0009'X);          ! @K1A 74011300
*  DCL XSF_LVN_DTYPE         BIT(8)  CONSTANT('03'X);            ! @K1A 74012600
*                                                                ! @K1A 74013900
*  DCL XSF_LVN_DATA_NO       BIN(8) CONSTANT('00'X);             ! @K1A 74015200
*  DCL XSF_LVN_DATA_VERSION3 BIN(8) CONSTANT('03'X);             ! @K1A 74017800
*  DCL XSF_LVN_DATA_VERSION4 BIN(8) CONSTANT('04'X);             ! @K1A 74019100
*/********************************************************************/ 74022600
*  DCL XSF_SFI_MC      BIT(64) CONSTANT('0010851000000007'X);           74054700
*                                      /*Management Class            */ 74086800
*  DCL XSF_SFI_MC_ID     BIT(24) CONSTANT('851000'X);                   74118900
*  DCL XSF_MC_LENGTH     BIT(16) CONSTANT('0010'X);                     74151000
*  DCL XSF_MC_DTYPE      BIT(8)  CONSTANT('07'X);                       74183100
*/********************************************************************/ 74215200
*  DCL XSF_SFI_MDS     BIT(64) CONSTANT('0034852000000007'X);           74247300
*                                      /*CDS Data Set Name           */ 74279400
*  DCL XSF_SFI_MDS_ID    BIT(24) CONSTANT('852000'X);                   74311500
*  DCL XSF_MDS_LENGTH    BIT(16) CONSTANT('0034'X);                     74343600
*  DCL XSF_MDS_DTYPE     BIT(8)  CONSTANT('07'X);                       74375700
*/********************************************************************/ 74407800
*  DCL XSF_SFI_MDTJ    BIT(64) CONSTANT('000C853000000009'X);           74439900
*                                      /*CDS Create Date             */ 74472000
*  DCL XSF_SFI_MDTJ_ID   BIT(24) CONSTANT('853000'X);                   74504100
*  DCL XSF_MDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     74536200
*  DCL XSF_MDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       74568300
*/********************************************************************/ 74600400
*  DCL XSF_SFI_MEDA    BIT(64) CONSTANT('0009854000000003'X);           74632500
*                                      /*Media Special Attributes    */ 74664600
*  DCL XSF_SFI_MEDA_ID   BIT(24) CONSTANT('854000'X);                   74696700
*  DCL XSF_MEDA_LENGTH   BIT(16) CONSTANT('0009'X);                     74728800
*  DCL XSF_MEDA_DTYPE    BIT(8)  CONSTANT('03'X);                       74760900
*                                                                       74793000
*  DCL XSF_MEDA_DATA_NONE       BIN(8) CONSTANT('00'X);                 74825100
*  DCL XSF_MEDA_DATA_READCOMP   BIN(8) CONSTANT('01'X);                 74857200
*/********************************************************************/ 74889300
*  DCL XSF_SFI_MEDC    BIT(64) CONSTANT('0009855000000003'X);           74921400
*                                      /*Media Compaction            */ 74953500
*  DCL XSF_SFI_MEDC_ID   BIT(24) CONSTANT('855000'X);                   74985600
*  DCL XSF_MEDC_LENGTH   BIT(16) CONSTANT('0009'X);                     75017700
*  DCL XSF_MEDC_DTYPE    BIT(8)  CONSTANT('03'X);                       75049800
*                                                                       75081900
*  DCL XSF_MEDC_DATA_UNDEFINED  BIN(8) CONSTANT('00'X);                 75114000
*  DCL XSF_MEDC_DATA_NO         BIN(8) CONSTANT('01'X);                 75146100
*  DCL XSF_MEDC_DATA_YES        BIN(8) CONSTANT('02'X);                 75178200
*/********************************************************************/ 75210300
*  DCL XSF_SFI_MEDN    BIT(64) CONSTANT('0010856000000007'X);           75242400
*                                      /*Media Name                  */ 75274500
*  DCL XSF_SFI_MEDN_ID   BIT(24) CONSTANT('856000'X);                   75306600
*  DCL XSF_MEDN_LENGTH   BIT(16) CONSTANT('0010'X);                     75338700
*  DCL XSF_MEDN_DTYPE    BIT(8)  CONSTANT('07'X);                       75370800
*/********************************************************************/ 75402900
*  DCL XSF_SFI_MEDR    BIT(64) CONSTANT('0009857000000003'X);           75435000
*                                      /*Media Recording Format      */ 75467100
*  DCL XSF_SFI_MEDR_ID   BIT(24) CONSTANT('857000'X);                   75499200
*  DCL XSF_MEDR_LENGTH   BIT(16) CONSTANT('0009'X);                     75531300
*  DCL XSF_MEDR_DTYPE    BIT(8)  CONSTANT('03'X);                       75563400
*                                                                       75595500
*  DCL XSF_MEDR_DATA_NOTCART    BIN(8) CONSTANT('00'X);           !@S9C 75627600
*  DCL XSF_MEDR_DATA_18TRK      BIN(8) CONSTANT('01'X);                 75659700
*  DCL XSF_MEDR_DATA_36TRK      BIN(8) CONSTANT('02'X);                 75691800
*  DCL XSF_MEDR_DATA_128TRK     BIN(8) CONSTANT('03'X);                 75723900
*  DCL XSF_MEDR_DATA_256TRK     BIN(8) CONSTANT('04'X);           !@S9A 75739900
*/********************************************************************/ 75756000
*  DCL XSF_SFI_MEDT    BIT(64) CONSTANT('0009858000000003'X);           75788100
*                                      /*Media Type                  */ 75820200
*  DCL XSF_SFI_MEDT_ID   BIT(24) CONSTANT('858000'X);                   75852300
*  DCL XSF_MEDT_LENGTH   BIT(16) CONSTANT('0009'X);                     75884400
*  DCL XSF_MEDT_DTYPE    BIT(8)  CONSTANT('03'X);                       75916500
*                                                                       75948600
*  DCL XSF_MEDT_DATA_UNDEFINED  BIN(8) CONSTANT('00'X);                 75980700
*  DCL XSF_MEDT_DATA_CST        BIN(8) CONSTANT('01'X);                 76012800
*  DCL XSF_MEDT_DATA_ECCST      BIN(8) CONSTANT('02'X);                 76044900
*  DCL XSF_MEDT_DATA_HPCT       BIN(8) CONSTANT('03'X);                 76077000
*  DCL XSF_MEDT_DATA_EHPCT      BIN(8) CONSTANT('04'X);                 76109100
*/********************************************************************/ 76141200
*  DCL XSF_SFI_MFR     BIT(64) CONSTANT('0010859000000007'X);           76173300
*                                      /*Source Location Name        */ 76205400
*  DCL XSF_SFI_MFR_ID    BIT(24) CONSTANT('859000'X);                   76237500
*  DCL XSF_MFR_LENGTH    BIT(16) CONSTANT('0010'X);                     76269600
*  DCL XSF_MFR_DTYPE     BIT(8)  CONSTANT('07'X);                       76301700
*/********************************************************************/ 76333800
*  DCL XSF_SFI_MID     BIT(64) CONSTANT('001485A000000007'X);           76365900
*                                      /*Mount Message ID            */ 76398000
*  DCL XSF_SFI_MID_ID    BIT(24) CONSTANT('85A000'X);                   76430100
*  DCL XSF_MID_LENGTH    BIT(16) CONSTANT('0014'X);                     76462200
*  DCL XSF_MID_DTYPE     BIT(8)  CONSTANT('07'X);                       76494300
*/*************************************************************/ ! @SCA 76496290
*  DCL XSF_SFI_MIV     BIT(64) CONSTANT('000E85A500000001'X);    ! @SCA 76498280
*                                      ! Moving-In Volume          @SCA 76500270
*  DCL XSF_SFI_MIV_ID    BIT(24) CONSTANT('85A500'X);            ! @SCA 76502260
*  DCL XSF_MIV_LENGTH    BIT(16) CONSTANT('000E'X);              ! @SCA 76504250
*  DCL XSF_MIV_DTYPE     BIT(8)  CONSTANT('01'X);                ! @SCA 76506240
*/*************************************************************/ ! @SCA 76508230
*  DCL XSF_SFI_MOV     BIT(64) CONSTANT('000E85A900000001'X);    ! @SCA 76510220
*                                      ! Moving-Out Volume         @SCA 76512210
*  DCL XSF_SFI_MOV_ID    BIT(24) CONSTANT('85A900'X);            ! @SCA 76514200
*  DCL XSF_MOV_LENGTH    BIT(16) CONSTANT('000E'X);              ! @SCA 76516190
*  DCL XSF_MOV_DTYPE     BIT(8)  CONSTANT('01'X);                ! @SCA 76518180
*/********************************************************************/ 76526400
*  DCL XSF_SFI_MOVM    BIT(64) CONSTANT('000985B000000003'X);           76558500
*                                      /*Move Mode                   */ 76590600
*  DCL XSF_SFI_MOVM_ID   BIT(24) CONSTANT('85B000'X);                   76622700
*  DCL XSF_MOVM_LENGTH   BIT(16) CONSTANT('0009'X);                     76654800
*  DCL XSF_MOVM_DTYPE    BIT(8)  CONSTANT('03'X);                       76686900
*                                                                       76719000
*  DCL XSF_MOVM_DATA_AUTO       BIN(8) CONSTANT('00'X);                 76751100
*  DCL XSF_MOVM_DATA_MANUAL     BIN(8) CONSTANT('01'X);                 76783200
*/********************************************************************/ 76815300
*  DCL XSF_SFI_MOP     BIT(64) CONSTANT('000985C000000003'X);           76847400
*                                      /*Master Overwrite            */ 76879500
*  DCL XSF_SFI_MOP_ID    BIT(24) CONSTANT('85C000'X);                   76911600
*  DCL XSF_MOP_LENGTH    BIT(16) CONSTANT('0009'X);                     76943700
*  DCL XSF_MOP_DTYPE     BIT(8)  CONSTANT('03'X);                       76975800
*                                                                       77007900
*  DCL XSF_MOP_DATA_ADD         BIN(8) CONSTANT('01'X);                 77040000
*  DCL XSF_MOP_DATA_LAST        BIN(8) CONSTANT('02'X);                 77072100
*  DCL XSF_MOP_DATA_MATCH       BIN(8) CONSTANT('03'X);                 77104200
*  DCL XSF_MOP_DATA_USER        BIN(8) CONSTANT('04'X);                 77136300
*/********************************************************************/ 77168400
*  DCL XSF_SFI_MRP     BIT(64) CONSTANT('000C85D000000005'X);           77200500
*                                      /*Maximum Retention Period    */ 77232600
*  DCL XSF_SFI_MRP_ID    BIT(24) CONSTANT('85D000'X);                   77264700
*  DCL XSF_MRP_LENGTH    BIT(16) CONSTANT('000C'X);                     77296800
*  DCL XSF_MRP_DTYPE     BIT(8)  CONSTANT('05'X);                       77328900
*/********************************************************************/ 77361000
*  DCL XSF_SFI_MSGF    BIT(64) CONSTANT('000985E000000003'X);           77393100
*                                      /*Case of Message Text        */ 77425200
*  DCL XSF_SFI_MSGF_ID   BIT(24) CONSTANT('85E000'X);                   77457300
*  DCL XSF_MSGF_LENGTH   BIT(16) CONSTANT('0009'X);                     77489400
*  DCL XSF_MSGF_DTYPE    BIT(8)  CONSTANT('03'X);                       77521500
*                                                                       77553600
*  DCL XSF_MSGF_DATA_MIXED      BIN(8) CONSTANT('00'X);                 77585700
*  DCL XSF_MSGF_DATA_UPPER      BIN(8) CONSTANT('01'X);                 77617800
*/********************************************************************/ 77649900
*  DCL XSF_SFI_MST     BIT(64) CONSTANT('000985F000000003'X);           77682000
*                                      /*Move Status                 */ 77714100
*  DCL XSF_SFI_MST_ID    BIT(24) CONSTANT('85F000'X);                   77746200
*  DCL XSF_MST_LENGTH    BIT(16) CONSTANT('0009'X);                     77778300
*  DCL XSF_MST_DTYPE     BIT(8)  CONSTANT('03'X);                       77810400
*                                                                       77842500
*  DCL XSF_MST_DATA_UNKNOWN     BIN(8) CONSTANT('00'X);                 77874600
*  DCL XSF_MST_DATA_PENDING     BIN(8) CONSTANT('01'X);                 77906700
*  DCL XSF_MST_DATA_CONFIRMED   BIN(8) CONSTANT('02'X);                 77938800
*  DCL XSF_MST_DATA_COMPLETE    BIN(8) CONSTANT('03'X);                 77970900
*/********************************************************************/ 78003000
*  DCL XSF_SFI_MTM     BIT(64) CONSTANT('000C86000000000A'X);           78035100
*                                      /*CDS Create Time             */ 78067200
*  DCL XSF_SFI_MTM_ID    BIT(24) CONSTANT('860000'X);                   78099300
*  DCL XSF_MTM_LENGTH    BIT(16) CONSTANT('000C'X);                     78131400
*  DCL XSF_MTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       78163500
*/********************************************************************/ 78195600
*  DCL XSF_SFI_MTO     BIT(64) CONSTANT('0010861000000007'X);           78227700
*                                      /*Target Location Name        */ 78259800
*  DCL XSF_SFI_MTO_ID    BIT(24) CONSTANT('861000'X);                   78291900
*  DCL XSF_MTO_LENGTH    BIT(16) CONSTANT('0010'X);                     78324000
*  DCL XSF_MTO_DTYPE     BIT(8)  CONSTANT('07'X);                       78356100
*/********************************************************************/ 78388200
*  DCL XSF_SFI_MTP     BIT(64) CONSTANT('0009862000000003'X);           78420300
*                                      /*CDS type                    */ 78452400
*  DCL XSF_SFI_MTP_ID    BIT(24) CONSTANT('862000'X);                   78484500
*  DCL XSF_MTP_LENGTH    BIT(16) CONSTANT('0009'X);                     78516600
*  DCL XSF_MTP_DTYPE     BIT(8)  CONSTANT('03'X);                       78548700
*                                                                       78580800
*  DCL XSF_MTP_DATA_MASTER      BIN(8) CONSTANT('00'X);                 78612900
*/********************************************************************/ 78645000
*  DCL XSF_SFI_MTY     BIT(64) CONSTANT('0009862800000003'X);           78677100
*                                      /*MOVE type                   */ 78709200
*  DCL XSF_SFI_MTY_ID    BIT(24) CONSTANT('862800'X);                   78741300
*  DCL XSF_MTY_LENGTH    BIT(16) CONSTANT('0009'X);                     78773400
*  DCL XSF_MTY_DTYPE     BIT(8)  CONSTANT('03'X);                       78805500
*                                                                       78837600
*  DCL XSF_MTY_DATA_NOTRTS      BIN(8) CONSTANT('00'X);                 78869700
*  DCL XSF_MTY_DATA_RTS         BIN(8) CONSTANT('01'X);                 78901800
*/**************************************************************/! @LFA 78905000
*  DCL XSF_SFI_MVBY       BIT(64) CONSTANT('0009862B00000003'X); ! @LFA 78908200
*                                                      ! MOVE by   @LFA 78911400
*  DCL XSF_SFI_MVBY_ID       BIT(24) CONSTANT('862B00'X);        ! @LFA 78914600
*  DCL XSF_MVBY_LENGTH       BIT(16) CONSTANT('0009'X);          ! @LFA 78917800
*  DCL XSF_MVBY_DTYPE        BIT(8)  CONSTANT('03'X);            ! @LFA 78921000
*                                                                ! @LFA 78924200
*  DCL XSF_MVBY_DATA_VOLUME  BIN(8)  CONSTANT('00'X);            ! @LFA 78927400
*  DCL XSF_MVBY_DATA_SET     BIN(8)  CONSTANT('01'X);            ! @LFA 78930600
*/********************************************************************/ 78933900
*  DCL XSF_SFI_MVS     BIT(64) CONSTANT('0009863000000003'X);           78966000
*                                      /*MVS Use                     */ 78998100
*  DCL XSF_SFI_MVS_ID    BIT(24) CONSTANT('863000'X);                   79030200
*  DCL XSF_MVS_LENGTH    BIT(16) CONSTANT('0009'X);                     79062300
*  DCL XSF_MVS_DTYPE     BIT(8)  CONSTANT('03'X);                       79094400
*                                                                       79126500
*  DCL XSF_MVS_DATA_NO          BIN(8) CONSTANT('00'X);                 79158600
*  DCL XSF_MVS_DATA_YES         BIN(8) CONSTANT('01'X);                 79190700
*/********************************************************************/ 79222800
*  DCL XSF_SFI_NLOC    BIT(64) CONSTANT('0010865000000007'X);           79254900
*                                      /*Required Location           */ 79287000
*  DCL XSF_SFI_NLOC_ID   BIT(24) CONSTANT('865000'X);                   79319100
*  DCL XSF_NLOC_LENGTH   BIT(16) CONSTANT('0010'X);                     79351200
*  DCL XSF_NLOC_DTYPE    BIT(8)  CONSTANT('07'X);                       79383300
*/*************************************************************/ ! @SCA 79385290
*  DCL XSF_SFI_NLOT    BIT(64) CONSTANT('0009865200000003'X);    ! @SCA 79387280
*                                      ! Required Location Type    @SCA 79389270
*  DCL XSF_SFI_NLOT_ID   BIT(24) CONSTANT('865200'X);            ! @SCA 79391260
*  DCL XSF_NLOT_LENGTH   BIT(16) CONSTANT('0009'X);              ! @SCA 79393250
*  DCL XSF_NLOT_DTYPE    BIT(8)  CONSTANT('03'X);                ! @SCA 79395240
*                                                                ! @SCA 79397230
*  DCL XSF_NLOT_DATA_SHELF              BIN(8) CONSTANT('00'X);  ! @SCA 79399220
*  DCL XSF_NLOT_DATA_STORE_BUILTIN_BINS BIN(8) CONSTANT('01'X);  ! @SCA 79401210
*  DCL XSF_NLOT_DATA_MANUAL             BIN(8) CONSTANT('02'X);  ! @SCA 79403200
*  DCL XSF_NLOT_DATA_AUTO               BIN(8) CONSTANT('03'X);  ! @SCA 79405190
*  DCL XSF_NLOT_DATA_STORE_BINS         BIN(8) CONSTANT('04'X);  ! @SCA 79407180
*  DCL XSF_NLOT_DATA_STORE_NOBINS       BIN(8) CONSTANT('05'X);  ! @SCA 79409170
*/********************************************************************/ 79415400
*  DCL XSF_SFI_NME     BIT(64) CONSTANT('0010866000000007'X);           79447500
*                                      /*Security Class Name         */ 79479600
*  DCL XSF_SFI_NME_ID    BIT(24) CONSTANT('866000'X);                   79511700
*  DCL XSF_NME_LENGTH    BIT(16) CONSTANT('0010'X);                     79543800
*  DCL XSF_NME_DTYPE     BIT(8)  CONSTANT('07'X);                       79575900
*/********************************************************************/ 79608000
*  DCL XSF_SFI_NOT     BIT(64) CONSTANT('0009866800000003'X);           79640100
*                                      /*Notify                      */ 79672200
*  DCL XSF_SFI_NOT_ID    BIT(24) CONSTANT('866800'X);                   79704300
*  DCL XSF_NOT_LENGTH    BIT(16) CONSTANT('0009'X);                     79736400
*  DCL XSF_NOT_DTYPE     BIT(8)  CONSTANT('03'X);                       79768500
*                                                                       79800600
*  DCL XSF_NOT_DATA_NO          BIN(8) CONSTANT('00'X);                 79832700
*  DCL XSF_NOT_DATA_YES         BIN(8) CONSTANT('01'X);                 79864800
*/********************************************************************/ 79896900
*  DCL XSF_SFI_NVL     BIT(64) CONSTANT('000E867000000001'X);           79929000
*                                      /*Next Volume                 */ 79961100
*  DCL XSF_SFI_NVL_ID    BIT(24) CONSTANT('867000'X);                   79993200
*  DCL XSF_NVL_LENGTH    BIT(16) CONSTANT('000E'X);                     80025300
*  DCL XSF_NVL_DTYPE     BIT(8)  CONSTANT('01'X);                       80057400
*/********************************************************************/ 80089500
*  DCL XSF_SFI_NVRS    BIT(64) CONSTANT('0010868000000007'X);           80121600
*                                      /*Next VRS Name               */ 80153700
*  DCL XSF_SFI_NVRS_ID   BIT(24) CONSTANT('868000'X);                   80185800
*  DCL XSF_NVRS_LENGTH   BIT(16) CONSTANT('0010'X);                     80217900
*  DCL XSF_NVRS_DTYPE    BIT(8)  CONSTANT('07'X);                       80250000
*/********************************************************************/ 80282100
*  DCL XSF_SFI_OAC     BIT(64) CONSTANT('0009869000000003'X);           80314200
*                                      /*Owner Access                */ 80346300
*  DCL XSF_SFI_OAC_ID    BIT(24) CONSTANT('869000'X);                   80378400
*  DCL XSF_OAC_LENGTH    BIT(16) CONSTANT('0009'X);                     80410500
*  DCL XSF_OAC_DTYPE     BIT(8)  CONSTANT('03'X);                       80442600
*                                                                       80474700
*  DCL XSF_OAC_DATA_READ        BIN(8) CONSTANT('00'X);                 80506800
*  DCL XSF_OAC_DATA_UPDATE      BIN(8) CONSTANT('01'X);                 80538900
*  DCL XSF_OAC_DATA_ALTER       BIN(8) CONSTANT('02'X);                 80571000
*/********************************************************************/ 80603100
*  DCL XSF_SFI_OBMN    BIT(64) CONSTANT('001086A000000007'X);           80635200
*                                      /*Old Bin Number Media Name   */ 80667300
*  DCL XSF_SFI_OBMN_ID   BIT(24) CONSTANT('86A000'X);                   80699400
*  DCL XSF_OBMN_LENGTH   BIT(16) CONSTANT('0010'X);                     80731500
*  DCL XSF_OBMN_DTYPE    BIT(8)  CONSTANT('07'X);                       80763600
*/********************************************************************/ 80795700
*  DCL XSF_SFI_OBN     BIT(64) CONSTANT('000E86B000000001'X);           80827800
*                                      /*Old Bin Number              */ 80859900
*  DCL XSF_SFI_OBN_ID    BIT(24) CONSTANT('86B000'X);                   80892000
*  DCL XSF_OBN_LENGTH    BIT(16) CONSTANT('000E'X);                     80924100
*  DCL XSF_OBN_DTYPE     BIT(8)  CONSTANT('01'X);                       80956200
*/********************************************************************/ 80988300
*  DCL XSF_SFI_OCE     BIT(64) CONSTANT('000986B800000003'X);           81020400
*                                      /*Vol Info Recorded at OCEOV  */ 81052500
*  DCL XSF_SFI_OCE_ID    BIT(24) CONSTANT('86B800'X);                   81084600
*  DCL XSF_OCE_LENGTH    BIT(16) CONSTANT('0009'X);                     81116700
*  DCL XSF_OCE_DTYPE     BIT(8)  CONSTANT('03'X);                       81148800
*                                                                       81180900
*  DCL XSF_OCE_DATA_NO          BIN(8) CONSTANT('00'X);                 81213000
*  DCL XSF_OCE_DATA_YES         BIN(8) CONSTANT('01'X);                 81245100
*/********************************************************************/ 81277200
*  DCL XSF_SFI_OLOC    BIT(64) CONSTANT('001086C000000007'X);           81309300
*                                      /*Old Location                */ 81341400
*  DCL XSF_SFI_OLOC_ID   BIT(24) CONSTANT('86C000'X);                   81373500
*  DCL XSF_OLOC_LENGTH   BIT(16) CONSTANT('0010'X);                     81405600
*  DCL XSF_OLOC_DTYPE    BIT(8)  CONSTANT('07'X);                       81437700
*/*************************************************************/ ! @SCA 81439690
*  DCL XSF_SFI_OLOT    BIT(64) CONSTANT('000986C200000003'X);    ! @SCA 81441680
*                                      ! Old Location Type         @SCA 81443670
*  DCL XSF_SFI_OLOT_ID   BIT(24) CONSTANT('86C200'X);            ! @SCA 81445660
*  DCL XSF_OLOT_LENGTH   BIT(16) CONSTANT('0009'X);              ! @SCA 81447650
*  DCL XSF_OLOT_DTYPE    BIT(8)  CONSTANT('03'X);                ! @SCA 81449640
*                                                                ! @SCA 81451630
*  DCL XSF_OLOT_DATA_SHELF              BIN(8) CONSTANT('00'X);  ! @SCA 81453620
*  DCL XSF_OLOT_DATA_STORE_BUILTIN_BINS BIN(8) CONSTANT('01'X);  ! @SCA 81455610
*  DCL XSF_OLOT_DATA_MANUAL             BIN(8) CONSTANT('02'X);  ! @SCA 81457600
*  DCL XSF_OLOT_DATA_AUTO               BIN(8) CONSTANT('03'X);  ! @SCA 81459590
*  DCL XSF_OLOT_DATA_STORE_BINS         BIN(8) CONSTANT('04'X);  ! @SCA 81461580
*  DCL XSF_OLOT_DATA_STORE_NOBINS       BIN(8) CONSTANT('05'X);  ! @SCA 81463570
*  DCL XSF_OLOT_DATA_STORE_INCTNR       BIN(8) CONSTANT('06'X);  ! @SCA 81465560
*/********************************************************************/ 81469800
*  DCL XSF_SFI_OPL     BIT(64) CONSTANT('000A86D000000004'X);           81501900
*                                      /*Posn of Rack Num or Pool ID */ 81534000
*  DCL XSF_SFI_OPL_ID    BIT(24) CONSTANT('86D000'X);                   81566100
*  DCL XSF_OPL_LENGTH    BIT(16) CONSTANT('000A'X);                     81598200
*  DCL XSF_OPL_DTYPE     BIT(8)  CONSTANT('04'X);                       81630300
*/********************************************************************/ 81662400
*  DCL XSF_SFI_OPM     BIT(64) CONSTANT('000986E000000003'X);           81694500
*                                      /*Operating Mode              */ 81726600
*  DCL XSF_SFI_OPM_ID    BIT(24) CONSTANT('86E000'X);                   81758700
*  DCL XSF_OPM_LENGTH    BIT(16) CONSTANT('0009'X);                     81790800
*  DCL XSF_OPM_DTYPE     BIT(8)  CONSTANT('03'X);                       81822900
*                                                                       81855000
*  DCL XSF_OPM_DATA_M           BIN(8) CONSTANT('01'X);                 81887100
*  DCL XSF_OPM_DATA_R           BIN(8) CONSTANT('02'X);                 81919200
*  DCL XSF_OPM_DATA_W           BIN(8) CONSTANT('03'X);                 81951300
*  DCL XSF_OPM_DATA_P           BIN(8) CONSTANT('04'X);                 81983400
*/********************************************************************/ 82015500
*  DCL XSF_SFI_OVL     BIT(64) CONSTANT('000A86F000000004'X);           82047600
*                                      /*Position of Volume Serial   */ 82079700
*  DCL XSF_SFI_OVL_ID    BIT(24) CONSTANT('86F000'X);                   82111800
*  DCL XSF_OVL_LENGTH    BIT(16) CONSTANT('000A'X);                     82143900
*  DCL XSF_OVL_DTYPE     BIT(8)  CONSTANT('04'X);                       82176000
*/*************************************************************/ ! @SCA 82179990
*  DCL XSF_SFI_OVOL    BIT(64) CONSTANT('000E86F500000001'X);    ! @SCA 82183980
*                                      ! Old Volume                @SCA 82187970
*  DCL XSF_SFI_OVOL_ID   BIT(24) CONSTANT('86F500'X);            ! @SCA 82191960
*  DCL XSF_OVOL_LENGTH   BIT(16) CONSTANT('000E'X);              ! @SCA 82195950
*  DCL XSF_OVOL_DTYPE    BIT(8)  CONSTANT('01'X);                ! @SCA 82199940
*/********************************************************************/ 82208100
*  DCL XSF_SFI_OWN     BIT(64) CONSTANT('0010870000000007'X);           82240200
*                                      /*Owner                       */ 82272300
*  DCL XSF_SFI_OWN_ID    BIT(24) CONSTANT('870000'X);                   82304400
*  DCL XSF_OWN_LENGTH    BIT(16) CONSTANT('0010'X);                     82336500
*  DCL XSF_OWN_DTYPE     BIT(8)  CONSTANT('07'X);                       82368600
*/********************************************************************/ 82400700
*  DCL XSF_SFI_OXDJ    BIT(64) CONSTANT('000C871000000009'X);           82432800
*                                      /*Original Expiration Date    */ 82464900
*  DCL XSF_SFI_OXDJ_ID   BIT(24) CONSTANT('871000'X);                   82497000
*  DCL XSF_OXDJ_LENGTH   BIT(16) CONSTANT('000C'X);                     82529100
*  DCL XSF_OXDJ_DTYPE    BIT(8)  CONSTANT('09'X);                       82561200
*/**************************************************************/! @04A 82561290
*  DCL XSF_SFI_PACS    BIT(64) CONSTANT('0009871800000003'X);    ! @04A 82561380
*                                      /* Pre-ACS support */     ! @04A 82561470
*  DCL XSF_SFI_PACS_ID   BIT(24) CONSTANT('871800'X);            ! @04A 82561560
*  DCL XSF_PACS_LENGTH   BIT(16) CONSTANT('0009'X);              ! @04A 82561650
*  DCL XSF_PACS_DTYPE    BIT(8)  CONSTANT('03'X);                ! @04A 82561740
*                                                                ! @04A 82561830
*  DCL XSF_PACS_DATA_NO         BIN(8) CONSTANT('00'X);          ! @04A 82561920
*  DCL XSF_PACS_DATA_YES        BIN(8) CONSTANT('01'X);          ! @04A 82562010
*/**************************************************************/! @LGA 82562200
*  DCL XSF_SFI_PDA        BIT(64) CONSTANT('0009871E00000003'X); ! @LGA 82563200
*                                                    ! PDA state   @LGA 82564200
*  DCL XSF_SFI_PDA_ID     BIT(24) CONSTANT('871E00'X);           ! @LGA 82565200
*  DCL XSF_PDA_LENGTH     BIT(16) CONSTANT('0009'X);             ! @LGA 82566200
*  DCL XSF_PDA_DTYPE      BIT(8)  CONSTANT('03'X);               ! @LGA 82567200
*                                                                ! @LGA 82568200
*  DCL XSF_PDA_DATA_OFF   BIN(8)  CONSTANT('00'X);               ! @LGA 82569200
*  DCL XSF_PDA_DATA_ON    BIN(8)  CONSTANT('01'X);               ! @LGA 82570200
*  DCL XSF_PDA_DATA_NONE  BIN(8)  CONSTANT('02'X);               ! @LGA 82571200
*/**************************************************************/! @LGA 82572200
*  DCL XSF_SFI_PDAC       BIT(64) CONSTANT('0009871E10000003'X); ! @LGA 82573200
*                                                ! PDA block count @LGA 82574200
*  DCL XSF_SFI_PDAC_ID    BIT(24) CONSTANT('871E10'X);           ! @LGA 82575200
*  DCL XSF_PDAC_LENGTH    BIT(16) CONSTANT('0009'X);             ! @LGA 82576200
*  DCL XSF_PDAC_DTYPE     BIT(8)  CONSTANT('03'X);               ! @LGA 82577200
*/**************************************************************/! @LGA 82578200
*  DCL XSF_SFI_PDAL       BIT(64) CONSTANT('0009871E30000003'X); ! @LGA 82579200
*                                                ! PDA log state   @LGA 82580200
*  DCL XSF_SFI_PDAL_ID    BIT(24) CONSTANT('871E30'X);           ! @LGA 82581200
*  DCL XSF_PDAL_LENGTH    BIT(16) CONSTANT('0009'X);             ! @LGA 82582200
*  DCL XSF_PDAL_DTYPE     BIT(8)  CONSTANT('03'X);               ! @LGA 82583200
*                                                                ! @LGA 82584200
*  DCL XSF_PDAL_DATA_OFF  BIN(8)  CONSTANT('00'X);               ! @LGA 82585200
*  DCL XSF_PDAL_DATA_ON   BIN(8)  CONSTANT('01'X);               ! @LGA 82586200
*/**************************************************************/! @LGA 82587200
*  DCL XSF_SFI_PDAS       BIT(64) CONSTANT('0009871E90000003'X); ! @LGA 82588200
*                                               ! PDA block size   @LGA 82589200
*  DCL XSF_SFI_PDAS_ID    BIT(24) CONSTANT('871E90'X);           ! @LGA 82590200
*  DCL XSF_PDAS_LENGTH    BIT(16) CONSTANT('0009'X);             ! @LGA 82591200
*  DCL XSF_PDAS_DTYPE     BIT(8)  CONSTANT('03'X);               ! @LGA 82592200
*/********************************************************************/ 82593300
*  DCL XSF_SFI_PDS     BIT(64) CONSTANT('0030872000000007'X);           82625400
*                                      /*Pool Description            */ 82657500
*  DCL XSF_SFI_PDS_ID    BIT(24) CONSTANT('872000'X);                   82689600
*  DCL XSF_PDS_LENGTH    BIT(16) CONSTANT('0030'X);                     82721700
*  DCL XSF_PDS_DTYPE     BIT(8)  CONSTANT('07'X);                       82753800
*/********************************************************************/ 82785900
*  DCL XSF_SFI_PDSC    BIT(64) CONSTANT('0028873000000007'X);           82818000
*                                      /*Product Description         */ 82850100
*  DCL XSF_SFI_PDSC_ID   BIT(24) CONSTANT('873000'X);                   82882200
*  DCL XSF_PDSC_LENGTH   BIT(16) CONSTANT('0028'X);                     82914300
*  DCL XSF_PDSC_DTYPE    BIT(8)  CONSTANT('07'X);                       82946400
*/********************************************************************/ 82978500
*  DCL XSF_SFI_PEND    BIT(64) CONSTANT('0009874000000002'X);           83010600
*                                      /*Actions Pending             */ 83042700
*  DCL XSF_SFI_PEND_ID   BIT(24) CONSTANT('874000'X);                   83074800
*  DCL XSF_PEND_LENGTH   BIT(16) CONSTANT('0009'X);                     83106900
*  DCL XSF_PEND_DTYPE    BIT(8)  CONSTANT('02'X);                       83139000
*                                                                       83171100
*  DCL XSF_PEND_FLAG_SCRATCH   BIT(8) CONSTANT('80'X);                  83203200
*  DCL XSF_PEND_FLAG_REPLACE   BIT(8) CONSTANT('40'X);                  83235300
*  DCL XSF_PEND_FLAG_INIT      BIT(8) CONSTANT('20'X);                  83267400
*  DCL XSF_PEND_FLAG_ERASE     BIT(8) CONSTANT('10'X);                  83299500
*  DCL XSF_PEND_FLAG_RETURN    BIT(8) CONSTANT('08'X);                  83331600
*  DCL XSF_PEND_FLAG_NOTIFY    BIT(8) CONSTANT('04'X);                  83363700
*/********************************************************************/ 83395800
*  DCL XSF_SFI_PID     BIT(64) CONSTANT('000E875000000007'X);           83427900
*                                      /*Pool Prefix                 */ 83460000
*  DCL XSF_SFI_PID_ID    BIT(24) CONSTANT('875000'X);                   83492100
*  DCL XSF_PID_LENGTH    BIT(16) CONSTANT('000E'X);                     83524200
*  DCL XSF_PID_DTYPE     BIT(8)  CONSTANT('07'X);                       83556300
*/********************************************************************/ 83588400
*  DCL XSF_SFI_PLN     BIT(64) CONSTANT('0010876000000007'X);           83620500
*                                      /*Pool Name                   */ 83652600
*  DCL XSF_SFI_PLN_ID    BIT(24) CONSTANT('876000'X);                   83684700
*  DCL XSF_PLN_LENGTH    BIT(16) CONSTANT('0010'X);                     83716800
*  DCL XSF_PLN_DTYPE     BIT(8)  CONSTANT('07'X);                       83748900
*/********************************************************************/ 83781000
*  DCL XSF_SFI_PNME    BIT(64) CONSTANT('0026877000000007'X);           83813100
*                                      /*Product Software Name       */ 83845200
*  DCL XSF_SFI_PNME_ID   BIT(24) CONSTANT('877000'X);                   83877300
*  DCL XSF_PNME_LENGTH   BIT(16) CONSTANT('0026'X);                     83909400
*  DCL XSF_PNME_DTYPE    BIT(8)  CONSTANT('07'X);                       83941500
*/********************************************************************/ 83973600
*  DCL XSF_SFI_PNUM    BIT(64) CONSTANT('0010878000000007'X);           84005700
*                                      /*Software Product Number     */ 84037800
*  DCL XSF_SFI_PNUM_ID   BIT(24) CONSTANT('878000'X);                   84069900
*  DCL XSF_PNUM_LENGTH   BIT(16) CONSTANT('0010'X);                     84102000
*  DCL XSF_PNUM_DTYPE    BIT(8)  CONSTANT('07'X);                       84134100
*/********************************************************************/ 84166200
*  DCL XSF_SFI_PRD     BIT(64) CONSTANT('000C879000000005'X);           84198300
*                                      /*Permanent Read Errors       */ 84230400
*  DCL XSF_SFI_PRD_ID    BIT(24) CONSTANT('879000'X);                   84262500
*  DCL XSF_PRD_LENGTH    BIT(16) CONSTANT('000C'X);                     84294600
*  DCL XSF_PRD_DTYPE     BIT(8)  CONSTANT('05'X);                       84326700
*/********************************************************************/ 84358800
*  DCL XSF_SFI_PRF     BIT(64) CONSTANT('000987A000000003'X);           84390900
*                                      /*Pool Def RACF Option        */ 84423000
*  DCL XSF_SFI_PRF_ID    BIT(24) CONSTANT('87A000'X);                   84455100
*  DCL XSF_PRF_LENGTH    BIT(16) CONSTANT('0009'X);                     84487200
*  DCL XSF_PRF_DTYPE     BIT(8)  CONSTANT('03'X);                       84519300
*                                                                       84551400
*  DCL XSF_PRF_DATA_NO          BIN(8) CONSTANT('00'X);                 84583500
*  DCL XSF_PRF_DATA_YES         BIN(8) CONSTANT('01'X);                 84615600
*/********************************************************************/ 84647700
*  DCL XSF_SFI_PRTY    BIT(64) CONSTANT('000C87B000000005'X);           84679800
*                                      /*Priority                    */ 84711900
*  DCL XSF_SFI_PRTY_ID   BIT(24) CONSTANT('87B000'X);                   84744000
*  DCL XSF_PRTY_LENGTH   BIT(16) CONSTANT('000C'X);                     84776100
*  DCL XSF_PRTY_DTYPE    BIT(8)  CONSTANT('05'X);                       84808200
*/********************************************************************/ 84840300
*  DCL XSF_SFI_PSFX    BIT(64) CONSTANT('000A87C000000001'X);           84872400
*                                      /*Parmlib Member Suffix       */ 84904500
*  DCL XSF_SFI_PSFX_ID   BIT(24) CONSTANT('87C000'X);                   84936600
*  DCL XSF_PSFX_LENGTH   BIT(16) CONSTANT('000A'X);                     84968700
*  DCL XSF_PSFX_DTYPE    BIT(8)  CONSTANT('01'X);                       85000800
*/********************************************************************/ 85032900
*  DCL XSF_SFI_PSN     BIT(64) CONSTANT('001087D000000007'X);           85065000
*                                      /*Pool Definition System ID   */ 85097100
*  DCL XSF_SFI_PSN_ID    BIT(24) CONSTANT('87D000'X);                   85129200
*  DCL XSF_PSN_LENGTH    BIT(16) CONSTANT('0010'X);                     85161300
*  DCL XSF_PSN_DTYPE     BIT(8)  CONSTANT('07'X);                       85193400
*/********************************************************************/ 85225500
*  DCL XSF_SFI_PTP     BIT(64) CONSTANT('000987E000000003'X);           85257600
*                                      /*Pool Def Pool Type          */ 85289700
*  DCL XSF_SFI_PTP_ID    BIT(24) CONSTANT('87E000'X);                   85321800
*  DCL XSF_PTP_LENGTH    BIT(16) CONSTANT('0009'X);                     85353900
*  DCL XSF_PTP_DTYPE     BIT(8)  CONSTANT('03'X);                       85386000
*                                                                       85418100
*  DCL XSF_PTP_DATA_SCRATCH     BIN(8) CONSTANT('00'X);                 85450200
*  DCL XSF_PTP_DATA_RACK        BIN(8) CONSTANT('01'X);                 85482300
*/********************************************************************/ 85514400
*  DCL XSF_SFI_PVL     BIT(64) CONSTANT('000E87F000000001'X);           85546500
*                                      /*Previous Volume             */ 85578600
*  DCL XSF_SFI_PVL_ID    BIT(24) CONSTANT('87F000'X);                   85610700
*  DCL XSF_PVL_LENGTH    BIT(16) CONSTANT('000E'X);                     85642800
*  DCL XSF_PVL_DTYPE     BIT(8)  CONSTANT('01'X);                       85674900
*/********************************************************************/ 85707000
*  DCL XSF_SFI_PWT     BIT(64) CONSTANT('000C880000000005'X);           85739100
*                                      /*Permanent Write Errors      */ 85771200
*  DCL XSF_SFI_PWT_ID    BIT(24) CONSTANT('880000'X);                   85803300
*  DCL XSF_PWT_LENGTH    BIT(16) CONSTANT('000C'X);                     85835400
*  DCL XSF_PWT_DTYPE     BIT(8)  CONSTANT('05'X);                       85867500
*/********************************************************************/ 85899600
*  DCL XSF_SFI_RBN     BIT(64) CONSTANT('000C881000000005'X);           85931700
*                                      /*# Bin Numbers in REMOTE     */ 85963800
*  DCL XSF_SFI_RBN_ID    BIT(24) CONSTANT('881000'X);                   85995900
*  DCL XSF_RBN_LENGTH    BIT(16) CONSTANT('000C'X);                     86028000
*  DCL XSF_RBN_DTYPE     BIT(8)  CONSTANT('05'X);                       86060100
*/**************************************************************/! @LGA 86063300
*  DCL XSF_SFI_RBYS      BIT(64) CONSTANT('0009881200000003'X);  ! @LGA 86066500
*                                                ! Retain by set   @LGA 86069700
*  DCL XSF_SFI_RBYS_ID   BIT(24) CONSTANT('881200'X);            ! @LGA 86072900
*  DCL XSF_RBYS_LENGTH   BIT(16) CONSTANT('0009'X);              ! @LGA 86076100
*  DCL XSF_RBYS_DTYPE    BIT(8)  CONSTANT('03'X);                ! @LGA 86079300
*                                                                ! @LGA 86082500
*  DCL XSF_RBYS_DATA_NO  BIN(8)  CONSTANT('00'X);                ! @LGA 86085700
*  DCL XSF_RBYS_DATA_YES BIN(8)  CONSTANT('01'X);                ! @LGA 86088900
*/********************************************************************/ 86092200
*  DCL XSF_SFI_RCF     BIT(64) CONSTANT('0009882000000003'X);           86124300
*                                      /*Installation RACF Support   */ 86156400
*  DCL XSF_SFI_RCF_ID    BIT(24) CONSTANT('882000'X);                   86188500
*  DCL XSF_RCF_LENGTH    BIT(16) CONSTANT('0009'X);                     86220600
*  DCL XSF_RCF_DTYPE     BIT(8)  CONSTANT('03'X);                       86252700
*                                                                       86284800
*  DCL XSF_RCF_DATA_N           BIN(8) CONSTANT('01'X);                 86316900
*  DCL XSF_RCF_DATA_P           BIN(8) CONSTANT('02'X);                 86349000
*  DCL XSF_RCF_DATA_A           BIN(8) CONSTANT('03'X);                 86381100
*/********************************************************************/ 86413200
*  DCL XSF_SFI_RCFM    BIT(64) CONSTANT('000C883000000007'X);           86445300
*                                      /*Record Format               */ 86477400
*  DCL XSF_SFI_RCFM_ID   BIT(24) CONSTANT('883000'X);                   86509500
*  DCL XSF_RCFM_LENGTH   BIT(16) CONSTANT('000C'X);                     86541600
*  DCL XSF_RCFM_DTYPE    BIT(8)  CONSTANT('07'X);                       86573700
*/********************************************************************/ 86605800
*  DCL XSF_SFI_RCK     BIT(64) CONSTANT('000E884000000001'X);           86637900
*                                      /*Rack or Bin Number          */ 86670000
*  DCL XSF_SFI_RCK_ID    BIT(24) CONSTANT('884000'X);                   86702100
*  DCL XSF_RCK_LENGTH    BIT(16) CONSTANT('000E'X);                     86734200
*  DCL XSF_RCK_DTYPE     BIT(8)  CONSTANT('01'X);                       86766300
*/********************************************************************/ 86798400
*  DCL XSF_SFI_RDTJ    BIT(64) CONSTANT('000C886000000009'X);           86830500
*                                      /*Last CDS Extract Date       */ 86862600
*  DCL XSF_SFI_RDTJ_ID   BIT(24) CONSTANT('886000'X);                   86894700
*  DCL XSF_RDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     86926800
*  DCL XSF_RDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       86958900
*/********************************************************************/ 86991000
*  DCL XSF_SFI_RET     BIT(64) CONSTANT('000B888000000003'X);           87023100
*                                      /*Retention Type              */ 87055200
*  DCL XSF_SFI_RET_ID    BIT(24) CONSTANT('888000'X);                   87087300
*  DCL XSF_RET_LENGTH    BIT(16) CONSTANT('000B'X);                     87119400
*  DCL XSF_RET_DTYPE     BIT(8)  CONSTANT('03'X);                       87151500
*                                                                       87183600
*  DCL XSF_RET_DATA1_WHILEC     BIN(8) CONSTANT('01'X);                 87215700
*  DCL XSF_RET_DATA2_UNTILEXP   BIN(8) CONSTANT('01'X);                 87247800
*  DCL XSF_RET_DATA3_CYCLES     BIN(8) CONSTANT('01'X);                 87279900
*  DCL XSF_RET_DATA3_DAYS       BIN(8) CONSTANT('02'X);                 87312000
*  DCL XSF_RET_DATA3_REFDAYS    BIN(8) CONSTANT('03'X);                 87344100
*  DCL XSF_RET_DATA3_VOLUMES    BIN(8) CONSTANT('04'X);                 87376200
*  DCL XSF_RET_DATA3_EXTDAYS    BIN(8) CONSTANT('05'X);          ! @01A 87386900
*  DCL XSF_RET_DATA3_DAYCYCL    BIN(8) CONSTANT('06'X);          ! @01A 87397600
*/********************************************************************/ 87408300
*  DCL XSF_SFI_RST     BIT(64) CONSTANT('000988A000000003'X);           87440400
*                                      /*Rack or Bin Status          */ 87472500
*  DCL XSF_SFI_RST_ID    BIT(24) CONSTANT('88A000'X);                   87504600
*  DCL XSF_RST_LENGTH    BIT(16) CONSTANT('0009'X);                     87536700
*  DCL XSF_RST_DTYPE     BIT(8)  CONSTANT('03'X);                       87568800
*                                                                       87600900
*  DCL XSF_RST_DATA_EMPTY       BIN(8) CONSTANT('00'X);                 87633000
*  DCL XSF_RST_DATA_FREE        BIN(8) CONSTANT('01'X);                 87665100
*  DCL XSF_RST_DATA_INUSE       BIN(8) CONSTANT('02'X);                 87697200
*/**************************************************************/! @LFA 87700400
*  DCL XSF_SFI_RTBY       BIT(64) CONSTANT('000988B900000003'X); ! @LFA 87703600
*                                                    ! Retain by   @LFA 87706800
*  DCL XSF_SFI_RTBY_ID      BIT(24) CONSTANT('88B900'X);         ! @LFA 87710000
*  DCL XSF_RTBY_LENGTH      BIT(16) CONSTANT('0009'X);           ! @LFA 87713200
*  DCL XSF_RTBY_DTYPE       BIT(8)  CONSTANT('03'X);             ! @LFA 87716400
*                                                                ! @LFA 87719600
*  DCL XSF_RTBY_DATA_VOLUME  BIN(8)  CONSTANT('00'X);            ! @LFA 87722800
*  DCL XSF_RTBY_DATA_SET     BIN(8)  CONSTANT('01'X);            ! @LFA 87726000
*/********************************************************************/ 87729300
*  DCL XSF_SFI_RTDJ    BIT(64) CONSTANT('000C88C000000009'X);           87761400
*                                      /*Retention Date              */ 87793500
*  DCL XSF_SFI_RTDJ_ID   BIT(24) CONSTANT('88C000'X);                   87825600
*  DCL XSF_RTDJ_LENGTH   BIT(16) CONSTANT('000C'X);                     87857700
*  DCL XSF_RTDJ_DTYPE    BIT(8)  CONSTANT('09'X);                       87889800
*/********************************************************************/ 87921900
*  DCL XSF_SFI_RTM     BIT(64) CONSTANT('000C88E00000000A'X);           87954000
*                                      /*Last CDS Extract Time       */ 87986100
*  DCL XSF_SFI_RTM_ID    BIT(24) CONSTANT('88E000'X);                   88018200
*  DCL XSF_RTM_LENGTH    BIT(16) CONSTANT('000C'X);                     88050300
*  DCL XSF_RTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       88082400
*/*************************************************************/ ! @SCA 88085390
*  DCL XSF_SFI_RUB     BIT(64) CONSTANT('000988E500000003'X);    ! @SCA 88088380
*                                      ! Reuse Bin                 @SCA 88091370
*  DCL XSF_SFI_RUB_ID    BIT(24) CONSTANT('88E500'X);            ! @SCA 88094360
*  DCL XSF_RUB_LENGTH    BIT(16) CONSTANT('0009'X);              ! @SCA 88097350
*  DCL XSF_RUB_DTYPE     BIT(8)  CONSTANT('03'X);                ! @SCA 88100340
*                                                                ! @SCA 88103330
*  DCL XSF_RUB_DATA_CONFIRMMOVE BIN(8) CONSTANT('00'X);          ! @SCA 88106320
*  DCL XSF_RUB_DATA_STARTMOVE   BIN(8) CONSTANT('01'X);          ! @SCA 88109310
*/********************************************************************/ 88114500
*  DCL XSF_SFI_SC      BIT(64) CONSTANT('0010890000000007'X);           88146600
*                                      /*Storage Class               */ 88178700
*  DCL XSF_SFI_SC_ID     BIT(24) CONSTANT('890000'X);                   88210800
*  DCL XSF_SC_LENGTH     BIT(16) CONSTANT('0010'X);                     88242900
*  DCL XSF_SC_DTYPE      BIT(8)  CONSTANT('07'X);                       88275000
*/********************************************************************/ 88307100
*  DCL XSF_SFI_SCST    BIT(64) CONSTANT('0009892000000002'X);           88339200
*                                      /*Security Class Status       */ 88371300
*  DCL XSF_SFI_SCST_ID   BIT(24) CONSTANT('892000'X);                   88403400
*  DCL XSF_SCST_LENGTH   BIT(16) CONSTANT('0009'X);                     88435500
*  DCL XSF_SCST_DTYPE    BIT(8)  CONSTANT('02'X);                       88467600
*                                                                       88499700
*  DCL XSF_SCST_FLAG_SMF       BIT(8) CONSTANT('80'X);                  88531800
*  DCL XSF_SCST_FLAG_MSGOPT    BIT(8) CONSTANT('40'X);                  88563900
*  DCL XSF_SCST_FLAG_ERASE     BIT(8) CONSTANT('20'X);                  88596000
*/********************************************************************/ 88628100
*  DCL XSF_SFI_SC1     BIT(64) CONSTANT('000C894000000005'X);           88660200
*                                      /*Store Number                */ 88692300
*  DCL XSF_SFI_SC1_ID    BIT(24) CONSTANT('894000'X);                   88724400
*  DCL XSF_SC1_LENGTH    BIT(16) CONSTANT('000C'X);                     88756500
*  DCL XSF_SC1_DTYPE     BIT(8)  CONSTANT('05'X);                       88788600
*/********************************************************************/ 88820700
*  DCL XSF_SFI_SDTJ    BIT(64) CONSTANT('000C895000000009'X);           88852800
*                                      /*Movement Tracking Date      */ 88884900
*  DCL XSF_SFI_SDTJ_ID   BIT(24) CONSTANT('895000'X);                   88917000
*  DCL XSF_SDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     88949100
*  DCL XSF_SDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       88981200
*/********************************************************************/ 89013300
*  DCL XSF_SFI_SEC     BIT(64) CONSTANT('0009896000000003'X);           89045400
*                                      /*Security Class Number       */ 89077500
*  DCL XSF_SFI_SEC_ID    BIT(24) CONSTANT('896000'X);                   89109600
*  DCL XSF_SEC_LENGTH    BIT(16) CONSTANT('0009'X);                     89141700
*  DCL XSF_SEC_DTYPE     BIT(8)  CONSTANT('03'X);                       89173800
*/********************************************************************/ 89205900
*  DCL XSF_SFI_SEQ     BIT(64) CONSTANT('000C898000000005'X);           89238000
*                                      /*Volume Sequence             */ 89270100
*  DCL XSF_SFI_SEQ_ID    BIT(24) CONSTANT('898000'X);                   89302200
*  DCL XSF_SEQ_LENGTH    BIT(16) CONSTANT('000C'X);                     89334300
*  DCL XSF_SEQ_DTYPE     BIT(8)  CONSTANT('05'X);                       89366400
*/********************************************************************/ 89398500
*  DCL XSF_SFI_SG      BIT(64) CONSTANT('001089A000000007'X);           89430600
*                                      /*Storage Group Name          */ 89462700
*  DCL XSF_SFI_SG_ID     BIT(24) CONSTANT('89A000'X);                   89494800
*  DCL XSF_SG_LENGTH     BIT(16) CONSTANT('0010'X);                     89526900
*  DCL XSF_SG_DTYPE      BIT(8)  CONSTANT('07'X);                       89559000
*/********************************************************************/ 89591100
*  DCL XSF_SFI_SID     BIT(64) CONSTANT('001089B000000007'X);           89623200
*                                      /*SMF System ID               */ 89655300
*  DCL XSF_SFI_SID_ID    BIT(24) CONSTANT('89B000'X);                   89687400
*  DCL XSF_SID_LENGTH    BIT(16) CONSTANT('0010'X);                     89719500
*  DCL XSF_SID_DTYPE     BIT(8)  CONSTANT('07'X);                       89751600
*/********************************************************************/ 89783700
*  DCL XSF_SFI_SLM     BIT(64) CONSTANT('000A89C000000004'X);           89815800
*                                      /*MAXHOLD Value               */ 89847900
*  DCL XSF_SFI_SLM_ID    BIT(24) CONSTANT('89C000'X);                   89880000
*  DCL XSF_SLM_LENGTH    BIT(16) CONSTANT('000A'X);                     89912100
*  DCL XSF_SLM_DTYPE     BIT(8)  CONSTANT('04'X);                       89944200
*/********************************************************************/ 89976300
*  DCL XSF_SFI_SMI     BIT(64) CONSTANT('000A89E000000004'X);           90008400
*                                      /*Offset to Message ID        */ 90040500
*  DCL XSF_SFI_SMI_ID    BIT(24) CONSTANT('89E000'X);                   90072600
*  DCL XSF_SMI_LENGTH    BIT(16) CONSTANT('000A'X);                     90104700
*  DCL XSF_SMI_DTYPE     BIT(8)  CONSTANT('04'X);                       90136800
*/********************************************************************/ 90168900
*  DCL XSF_SFI_SMP     BIT(64) CONSTANT('000989E210000003'X);    ! @LXA 90170890
*                                      /*SMSTAPE purge          @LXA */ 90172880
*  DCL XSF_SFI_SMP_ID    BIT(24) CONSTANT('89E210'X);            ! @LXA 90174870
*  DCL XSF_SMP_LENGTH    BIT(16) CONSTANT('0009'X);              ! @LXA 90176860
*  DCL XSF_SMP_DTYPE     BIT(8)  CONSTANT('03'X);                ! @LXA 90178850
*/********************************************************************/ 90180840
*  DCL XSF_SFI_SMU     BIT(64) CONSTANT('000989E220000002'X);    ! @LXA 90182830
*                                      /*SMSTAPE update         @LXA */ 90184820
*  DCL XSF_SFI_SMU_ID    BIT(24) CONSTANT('89E220'X);            ! @LXA 90186810
*  DCL XSF_SMU_LENGTH    BIT(16) CONSTANT('0009'X);              ! @LXA 90188800
*  DCL XSF_SMU_DTYPE     BIT(8)  CONSTANT('02'X);                ! @LXA 90190790
*/********************************************************************/ 90192780
*  DCL XSF_SFI_SOSJ    BIT(64) CONSTANT('000C89F000000009'X);           90201000
*                                      /*Last XPROC Start Date       */ 90233100
*  DCL XSF_SFI_SOSJ_ID   BIT(24) CONSTANT('89F000'X);                   90265200
*  DCL XSF_SOSJ_LENGTH   BIT(16) CONSTANT('000C'X);                     90297300
*  DCL XSF_SOSJ_DTYPE    BIT(8)  CONSTANT('09'X);                       90329400
*/********************************************************************/ 90361500
*  DCL XSF_SFI_SOSP    BIT(64) CONSTANT('00108A0000000007'X);           90393600
*                                      /*Scratch Procedure Name      */ 90425700
*  DCL XSF_SFI_SOSP_ID   BIT(24) CONSTANT('8A0000'X);                   90457800
*  DCL XSF_SOSP_LENGTH   BIT(16) CONSTANT('0010'X);                     90489900
*  DCL XSF_SOSP_DTYPE    BIT(8)  CONSTANT('07'X);                       90522000
*/********************************************************************/ 90554100
*  DCL XSF_SFI_SOST    BIT(64) CONSTANT('000C8A100000000A'X);           90586200
*                                      /*Last XPROC Start Time       */ 90618300
*  DCL XSF_SFI_SOST_ID   BIT(24) CONSTANT('8A1000'X);                   90650400
*  DCL XSF_SOST_LENGTH   BIT(16) CONSTANT('000C'X);                     90682500
*  DCL XSF_SOST_DTYPE    BIT(8)  CONSTANT('0A'X);                       90714600
*/********************************************************************/ 90746700
*  DCL XSF_SFI_SSM     BIT(64) CONSTANT('000A8A2000000004'X);           90778800
*                                      /*SMF Security Record Number  */ 90810900
*  DCL XSF_SFI_SSM_ID    BIT(24) CONSTANT('8A2000'X);                   90843000
*  DCL XSF_SSM_LENGTH    BIT(16) CONSTANT('000A'X);                     90875100
*  DCL XSF_SSM_DTYPE     BIT(8)  CONSTANT('04'X);                       90907200
*/********************************************************************/ 90939300
*  DCL XSF_SFI_STEP    BIT(64) CONSTANT('00108A3000000007'X);           90971400
*                                      /*Step Name                   */ 91003500
*  DCL XSF_SFI_STEP_ID   BIT(24) CONSTANT('8A3000'X);                   91035600
*  DCL XSF_STEP_LENGTH   BIT(16) CONSTANT('0010'X);                     91067700
*  DCL XSF_STEP_DTYPE    BIT(8)  CONSTANT('07'X);                       91099800
*/**************************************************************/! @LGA 91104300
*  DCL XSF_SFI_STVC      BIT(64) CONSTANT('000C8A3800000005'X);  ! @LGA 91108800
*                                          ! Stacked volume count  @LGA 91113300
*  DCL XSF_SFI_STVC_ID   BIT(24) CONSTANT('8A3800'X);            ! @LGA 91117800
*  DCL XSF_STVC_LENGTH   BIT(16) CONSTANT('000C'X);              ! @LGA 91122300
*  DCL XSF_STVC_DTYPE    BIT(8)  CONSTANT('05'X);                ! @LGA 91126800
*/********************************************************************/ 91131900
*  DCL XSF_SFI_SUR     BIT(64) CONSTANT('001C8A4000000007'X);           91164000
*                                      /*Owner''s Surname            */ 91196100
*  DCL XSF_SFI_SUR_ID    BIT(24) CONSTANT('8A4000'X);                   91228200
*  DCL XSF_SUR_LENGTH    BIT(16) CONSTANT('001C'X);                     91260300
*  DCL XSF_SUR_DTYPE     BIT(8)  CONSTANT('07'X);                       91292400
*/********************************************************************/ 91324500
*  DCL XSF_SFI_SYS     BIT(64) CONSTANT('00108A5000000007'X);           91356600
*                                      /* Creating System ID     @05C*/ 91388700
*  DCL XSF_SFI_SYS_ID    BIT(24) CONSTANT('8A5000'X);                   91420800
*  DCL XSF_SYS_LENGTH    BIT(16) CONSTANT('0010'X);                     91452900
*  DCL XSF_SYS_DTYPE     BIT(8)  CONSTANT('07'X);                       91485000
*/********************************************************************/ 91517100
*  DCL XSF_SFI_TAC     BIT(64) CONSTANT('00098A6000000003'X);           91549200
*                                      /*Reject Type                 */ 91581300
*  DCL XSF_SFI_TAC_ID    BIT(24) CONSTANT('8A6000'X);                   91613400
*  DCL XSF_TAC_LENGTH    BIT(16) CONSTANT('0009'X);                     91645500
*  DCL XSF_TAC_DTYPE     BIT(8)  CONSTANT('03'X);                       91677600
*                                                                       91709700
*  DCL XSF_TAC_DATA_ANYUSE      BIN(8) CONSTANT('00'X);                 91741800
*  DCL XSF_TAC_DATA_OUTPUT      BIN(8) CONSTANT('01'X);                 91773900
*/********************************************************************/ 91806000
*  DCL XSF_SFI_TRD     BIT(64) CONSTANT('000C8A7000000005'X);           91838100
*                                      /*Temporary Read Errors       */ 91870200
*  DCL XSF_SFI_TRD_ID    BIT(24) CONSTANT('8A7000'X);                   91902300
*  DCL XSF_TRD_LENGTH    BIT(16) CONSTANT('000C'X);                     91934400
*  DCL XSF_TRD_DTYPE     BIT(8)  CONSTANT('05'X);                       91966500
*/********************************************************************/ 91998600
*  DCL XSF_SFI_TVXP    BIT(64) CONSTANT('00098A7900000003'X);    ! @03A 92003100
*                                      /*TVEXT purge            @03A */ 92007600
*  DCL XSF_SFI_TVXP_ID    BIT(24) CONSTANT('8A7900'X);           ! @03A 92012100
*  DCL XSF_TVXP_LENGTH    BIT(16) CONSTANT('0009'X);             ! @03A 92016600
*  DCL XSF_TVXP_DTYPE     BIT(8)  CONSTANT('03'X);               ! @03A 92021100
*/********************************************************************/ 92025600
*  DCL XSF_SFI_TWT     BIT(64) CONSTANT('000C8A8000000005'X);           92030700
*                                      /*Temporary Write Errors      */ 92062800
*  DCL XSF_SFI_TWT_ID    BIT(24) CONSTANT('8A8000'X);                   92094900
*  DCL XSF_TWT_LENGTH    BIT(16) CONSTANT('000C'X);                     92127000
*  DCL XSF_TWT_DTYPE     BIT(8)  CONSTANT('05'X);                       92159100
*/********************************************************************/ 92191200
*  DCL XSF_SFI_TYP     BIT(64) CONSTANT('00098A9000000002'X);           92223300
*                                      /*VRS Type                    */ 92255400
*  DCL XSF_SFI_TYP_ID    BIT(24) CONSTANT('8A9000'X);                   92287500
*  DCL XSF_TYP_LENGTH    BIT(16) CONSTANT('0009'X);                     92319600
*  DCL XSF_TYP_DTYPE     BIT(8)  CONSTANT('02'X);                       92351700
*                                                                       92383800
*  DCL XSF_TYP_FLAG_GDG        BIT(8) CONSTANT('80'X);                  92415900
*  DCL XSF_TYP_FLAG_PSEUDGDG   BIT(8) CONSTANT('40'X);                  92448000
*  DCL XSF_TYP_FLAG_DSNAME     BIT(8) CONSTANT('20'X);                  92480100
*  DCL XSF_TYP_FLAG_VOLUME     BIT(8) CONSTANT('10'X);                  92512200
*  DCL XSF_TYP_FLAG_NAME       BIT(8) CONSTANT('08'X);                  92544300
*/********************************************************************/ 92576400
*  DCL XSF_SFI_UID     BIT(64) CONSTANT('00108AB001000007'X);           92608500
*                                      /*User ID                     */ 92640600
*  DCL XSF_SFI_UID_ID    BIT(24) CONSTANT('8AB001'X);                   92672700
*  DCL XSF_UID_LENGTH    BIT(16) CONSTANT('0010'X);                     92704800
*  DCL XSF_UID_DTYPE     BIT(8)  CONSTANT('07'X);                       92736900
*/********************************************************************/ 92769000
*  DCL XSF_SFI_UNC     BIT(64) CONSTANT('00098AC000000003'X);           92801100
*                                      /*Uncatalog Option            */ 92833200
*  DCL XSF_SFI_UNC_ID    BIT(24) CONSTANT('8AC000'X);                   92865300
*  DCL XSF_UNC_LENGTH    BIT(16) CONSTANT('0009'X);                     92897400
*  DCL XSF_UNC_DTYPE     BIT(8)  CONSTANT('03'X);                       92929500
*                                                                       92961600
*  DCL XSF_UNC_DATA_N           BIN(8) CONSTANT('00'X);                 92993700
*  DCL XSF_UNC_DATA_Y           BIN(8) CONSTANT('01'X);                 93025800
*  DCL XSF_UNC_DATA_S           BIN(8) CONSTANT('02'X);                 93057900
*/********************************************************************/ 93090000
*  DCL XSF_SFI_USEC    BIT(64) CONSTANT('000C8AD000000005'X);           93122100
*                                      /*Volume Use Count            */ 93154200
*  DCL XSF_SFI_USEC_ID   BIT(24) CONSTANT('8AD000'X);                   93186300
*  DCL XSF_USEC_LENGTH   BIT(16) CONSTANT('000C'X);                     93218400
*  DCL XSF_USEC_DTYPE    BIT(8)  CONSTANT('05'X);                       93250500
*/********************************************************************/ 93282600
*  DCL XSF_SFI_USEM    BIT(64) CONSTANT('000C8AE000000005'X);           93314700
*                                      /*Volume Usage (KB)           */ 93346800
*  DCL XSF_SFI_USEM_ID   BIT(24) CONSTANT('8AE000'X);                   93378900
*  DCL XSF_USEM_LENGTH   BIT(16) CONSTANT('000C'X);                     93411000
*  DCL XSF_USEM_DTYPE    BIT(8)  CONSTANT('05'X);                       93443100
*/********************************************************************/ 93475200
*  DCL XSF_SFI_VAC     BIT(64) CONSTANT('00098AF001000003'X);           93507300
*                                      /*Volume Access               */ 93539400
*  DCL XSF_SFI_VAC_ID    BIT(24) CONSTANT('8AF001'X);                   93571500
*  DCL XSF_VAC_LENGTH    BIT(16) CONSTANT('0009'X);                     93603600
*  DCL XSF_VAC_DTYPE     BIT(8)  CONSTANT('03'X);                       93635700
*                                                                       93667800
*  DCL XSF_VAC_DATA_NONE        BIN(8) CONSTANT('00'X);                 93699900
*  DCL XSF_VAC_DATA_READ        BIN(8) CONSTANT('01'X);                 93732000
*  DCL XSF_VAC_DATA_UPDATE      BIN(8) CONSTANT('02'X);                 93764100
*/********************************************************************/ 93796200
*  DCL XSF_SFI_VACT    BIT(64) CONSTANT('00098B0000000003'X);           93828300
*                                      /*VRSMIN action               */ 93860400
*  DCL XSF_SFI_VACT_ID   BIT(24) CONSTANT('8B0000'X);                   93892500
*  DCL XSF_VACT_LENGTH   BIT(16) CONSTANT('0009'X);                     93924600
*  DCL XSF_VACT_DTYPE    BIT(8)  CONSTANT('03'X);                       93956700
*                                                                       93988800
*  DCL XSF_VACT_DATA_FAIL       BIN(8) CONSTANT('00'X);                 94020900
*  DCL XSF_VACT_DATA_INFO       BIN(8) CONSTANT('01'X);                 94053000
*  DCL XSF_VACT_DATA_WARN       BIN(8) CONSTANT('02'X);                 94085100
*/**************************************************************/! @01A 94088000
*  DCL XSF_SFI_VANX        BIT(64) CONSTANT('00098B0800000003'X);! @01A 94090900
*                                                 ! Next VRS type  @01A 94093800
*  DCL XSF_SFI_VANX_ID     BIT(24) CONSTANT('8B0800'X);          ! @01A 94096700
*  DCL XSF_VANX_LENGTH     BIT(16) CONSTANT('0009'X);            ! @01A 94099600
*  DCL XSF_VANX_DTYPE      BIT(8)  CONSTANT('03'X);              ! @01A 94102500
*                                                                ! @01A 94105400
*  DCL XSF_VANX_DATA_NONE  BIN(8) CONSTANT('00'X);               ! @01A 94108300
*  DCL XSF_VANX_DATA_NEXT  BIN(8) CONSTANT('01'X);               ! @01A 94111200
*  DCL XSF_VANX_DATA_AND   BIN(8) CONSTANT('02'X);               ! @01A 94114100
*/********************************************************************/ 94117200
*  DCL XSF_SFI_VCAP    BIT(64) CONSTANT('000C8B0B00000005'X);    ! @S9A 94121700
*                                      /*Volume Capacity             */ 94126200
*  DCL XSF_SFI_VCAP_ID   BIT(24) CONSTANT('8B0B00'X);            ! @S9A 94130700
*  DCL XSF_VCAP_LENGTH   BIT(16) CONSTANT('000C'X);              ! @S9A 94135200
*  DCL XSF_VCAP_DTYPE    BIT(8)  CONSTANT('05'X);                ! @S9A 94139700
*/********************************************************************/ 94144200
*  DCL XSF_SFI_VCHG    BIT(64) CONSTANT('00098B1000000003'X);           94149300
*                                      /*VRSCHANGE Value             */ 94181400
*  DCL XSF_SFI_VCHG_ID   BIT(24) CONSTANT('8B1000'X);                   94213500
*  DCL XSF_VCHG_LENGTH   BIT(16) CONSTANT('0009'X);                     94245600
*  DCL XSF_VCHG_DTYPE    BIT(8)  CONSTANT('03'X);                       94277700
*                                                                       94309800
*  DCL XSF_VCHG_DATA_INFO       BIN(8) CONSTANT('00'X);                 94341900
*  DCL XSF_VCHG_DATA_VERIFY     BIN(8) CONSTANT('01'X);                 94374000
*/********************************************************************/ 94406100
*  DCL XSF_SFI_VDD     BIT(64) CONSTANT('000A8B2000000004'X);           94438200
*                                      /*VRS Delay Days              */ 94470300
*  DCL XSF_SFI_VDD_ID    BIT(24) CONSTANT('8B2000'X);                   94502400
*  DCL XSF_VDD_LENGTH    BIT(16) CONSTANT('000A'X);                     94534500
*  DCL XSF_VDD_DTYPE     BIT(8)  CONSTANT('04'X);                       94566600
*/********************************************************************/ 94598700
*  DCL XSF_SFI_VDTJ    BIT(64) CONSTANT('000C8B3000000009'X);           94630800
*                                      /*Last Inven Mgt Proc Date    */ 94662900
*  DCL XSF_SFI_VDTJ_ID   BIT(24) CONSTANT('8B3000'X);                   94695000
*  DCL XSF_VDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     94727100
*  DCL XSF_VDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       94759200
*/********************************************************************/ 94791300
*  DCL XSF_SFI_VER     BIT(64) CONSTANT('000E8B4000000007'X);           94823400
*                                      /*Software Product Version    */ 94855500
*  DCL XSF_SFI_VER_ID    BIT(24) CONSTANT('8B4000'X);                   94887600
*  DCL XSF_VER_LENGTH    BIT(16) CONSTANT('000E'X);                     94919700
*  DCL XSF_VER_DTYPE     BIT(8)  CONSTANT('07'X);                       94951800
*/********************************************************************/ 94983900
*  DCL XSF_SFI_VJBN    BIT(64) CONSTANT('00108B5000000007'X);           95016000
*                                      /*Primary VRS Job Name    @01C*/ 95048100
*  DCL XSF_SFI_VJBN_ID   BIT(24) CONSTANT('8B5000'X);                   95080200
*  DCL XSF_VJBN_LENGTH   BIT(16) CONSTANT('0010'X);                     95112300
*  DCL XSF_VJBN_DTYPE    BIT(8)  CONSTANT('07'X);                       95144400
*/********************************************************************/ 95176500
*  DCL XSF_SFI_VLN     BIT(64) CONSTANT('000C8B6000000005'X);           95208600
*                                      /*Number of Volumes           */ 95240700
*  DCL XSF_SFI_VLN_ID    BIT(24) CONSTANT('8B6000'X);                   95272800
*  DCL XSF_VLN_LENGTH    BIT(16) CONSTANT('000C'X);                     95304900
*  DCL XSF_VLN_DTYPE     BIT(8)  CONSTANT('05'X);                       95337000
*/********************************************************************/ 95369100
*  DCL XSF_SFI_VM      BIT(64) CONSTANT('00098B7000000003'X);           95401200
*                                      /*VM Use                      */ 95433300
*  DCL XSF_SFI_VM_ID     BIT(24) CONSTANT('8B7000'X);                   95465400
*  DCL XSF_VM_LENGTH     BIT(16) CONSTANT('0009'X);                     95497500
*  DCL XSF_VM_DTYPE      BIT(8)  CONSTANT('03'X);                       95529600
*                                                                       95561700
*  DCL XSF_VM_DATA_NO           BIN(8) CONSTANT('00'X);                 95593800
*  DCL XSF_VM_DATA_YES          BIN(8) CONSTANT('01'X);                 95625900
*/********************************************************************/ 95658000
*  DCL XSF_SFI_VMIN    BIT(64) CONSTANT('000C8B8000000005'X);           95690100
*                                      /*VRSMIN Count Value          */ 95722200
*  DCL XSF_SFI_VMIN_ID   BIT(24) CONSTANT('8B8000'X);                   95754300
*  DCL XSF_VMIN_LENGTH   BIT(16) CONSTANT('000C'X);                     95786400
*  DCL XSF_VMIN_DTYPE    BIT(8)  CONSTANT('05'X);                       95818500
*/********************************************************************/ 95850600
*  DCL XSF_SFI_VMV     BIT(64) CONSTANT('00108B9000000007'X);           95882700
*                                      /*VRS Management Value        */ 95914800
*  DCL XSF_SFI_VMV_ID    BIT(24) CONSTANT('8B9000'X);                   95946900
*  DCL XSF_VMV_LENGTH    BIT(16) CONSTANT('0010'X);                     95979000
*  DCL XSF_VMV_DTYPE     BIT(8)  CONSTANT('07'X);                       96011100
*/********************************************************************/ 96043200
*  DCL XSF_SFI_VNME    BIT(64) CONSTANT('00348BA000000007'X);           96075300
*                                      /*Primary VRS Name        @01C*/ 96107400
*  DCL XSF_SFI_VNME_ID   BIT(24) CONSTANT('8BA000'X);                   96139500
*  DCL XSF_VNME_LENGTH   BIT(16) CONSTANT('0034'X);                     96171600
*  DCL XSF_VNME_DTYPE    BIT(8)  CONSTANT('07'X);                       96203700
*/********************************************************************/ 96235800
*  DCL XSF_SFI_VOL     BIT(64) CONSTANT('000E8BC000000001'X);           96267900
*                                      /*Volume Serial               */ 96300000
*  DCL XSF_SFI_VOL_ID    BIT(24) CONSTANT('8BC000'X);                   96332100
*  DCL XSF_VOL_LENGTH    BIT(16) CONSTANT('000E'X);                     96364200
*  DCL XSF_VOL_DTYPE     BIT(8)  CONSTANT('01'X);                       96396300
*/*************************************************************/ ! @S8A 96399500
*  DCL XSF_SFI_VOLT    BIT(64) CONSTANT('00098BC200000003'X);    ! @S8A 96402700
*                                                ! Volume Type     @S8A 96405900
*  DCL XSF_SFI_VOLT_ID   BIT(24) CONSTANT('8BC200'X);            ! @S8A 96409100
*  DCL XSF_VOLT_LENGTH   BIT(16) CONSTANT('0009'X);              ! @S8A 96412300
*  DCL XSF_VOLT_DTYPE    BIT(8)  CONSTANT('03'X);                ! @S8A 96415500
*                                                                ! @S8A 96418700
*  DCL XSF_VOLT_PHYSICAL BIN(8) CONSTANT('00'X);                 ! @S8A 96421900
*  DCL XSF_VOLT_LOGICAL  BIN(8) CONSTANT('01'X);                 ! @S8A 96425100
*/*************************************************************/ ! @S9A 96425500
*  DCL XSF_SFI_VPCT    BIT(64) CONSTANT('00098BC300000003'X);    ! @S9A 96425900
*                                           ! Volume Percent Full  @S9A 96426300
*  DCL XSF_SFI_VPCT_ID   BIT(24) CONSTANT('8BC300'X);            ! @S9A 96426700
*  DCL XSF_VPCT_LENGTH   BIT(16) CONSTANT('0009'X);              ! @S9A 96427100
*  DCL XSF_VPCT_DTYPE    BIT(8)  CONSTANT('03'X);                ! @S9A 96427500
*/********************************************************************/ 96428400
*  DCL XSF_SFI_VRC     BIT(64) CONSTANT('000C8BD000000005'X);           96460500
*                                      /*Vital Record Count          */ 96492600
*  DCL XSF_SFI_VRC_ID    BIT(24) CONSTANT('8BD000'X);                   96524700
*  DCL XSF_VRC_LENGTH    BIT(16) CONSTANT('000C'X);                     96556800
*  DCL XSF_VRC_DTYPE     BIT(8)  CONSTANT('05'X);                       96588900
*/********************************************************************/ 96621000
*  DCL XSF_SFI_VRJ     BIT(64) CONSTANT('00098BE000000003'X);           96653100
*                                      /*VRS Job Name                */ 96685200
*  DCL XSF_SFI_VRJ_ID    BIT(24) CONSTANT('8BE000'X);                   96717300
*  DCL XSF_VRJ_LENGTH    BIT(16) CONSTANT('0009'X);                     96749400
*  DCL XSF_VRJ_DTYPE     BIT(8)  CONSTANT('03'X);                       96781500
*                                                                       96813600
*  DCL XSF_VRJ_DATA_1           BIN(8) CONSTANT('01'X);                 96845700
*  DCL XSF_VRJ_DATA_2           BIN(8) CONSTANT('02'X);                 96877800
*/********************************************************************/ 96909900
*  DCL XSF_SFI_VRS     BIT(64) CONSTANT('00348BF000000007'X);           96942000
*                                      /*Vital Record Specification  */ 96974100
*  DCL XSF_SFI_VRS_ID    BIT(24) CONSTANT('8BF000'X);                   97006200
*  DCL XSF_VRS_LENGTH    BIT(16) CONSTANT('0034'X);                     97038300
*  DCL XSF_VRS_DTYPE     BIT(8)  CONSTANT('07'X);                       97070400
*/**************************************************************/! @01A 97072000
*  DCL XSF_SFI_VRSI      BIT(64) CONSTANT('00098BF500000003'X);  ! @01A 97073600
*                                             ! Scratch Immediate  @01A 97075200
*  DCL XSF_SFI_VRSI_ID   BIT(24) CONSTANT('8BF500'X);            ! @01A 97076800
*  DCL XSF_VRSI_LENGTH   BIT(16) CONSTANT('0009'X);              ! @01A 97078400
*  DCL XSF_VRSI_DTYPE    BIT(8)  CONSTANT('03'X);                ! @01A 97080000
*                                                                ! @01A 97081600
*  DCL XSF_VRSI_DATA_NO  BIN(8)  CONSTANT('00'X);                ! @01A 97083200
*  DCL XSF_VRSI_DATA_YES BIN(8)  CONSTANT('01'X);                ! @01A 97084800
*/**************************************************************/! @01A 97086400
*  DCL XSF_SFI_VRSL      BIT(64) CONSTANT('00098BFA00000003'X);  ! @01A 97088000
*                                                   ! VRSEL Value  @01A 97089600
*  DCL XSF_SFI_VRSL_ID   BIT(24) CONSTANT('8BFA00'X);            ! @01A 97091200
*  DCL XSF_VRSL_LENGTH   BIT(16) CONSTANT('0009'X);              ! @01A 97092800
*  DCL XSF_VRSL_DTYPE    BIT(8)  CONSTANT('03'X);                ! @01A 97094400
*                                                                ! @01A 97096000
*  DCL XSF_VRSL_DATA_OLD BIN(8)  CONSTANT('00'X);                ! @01A 97097600
*  DCL XSF_VRSL_DATA_NEW BIN(8)  CONSTANT('01'X);                ! @01A 97099200
*/********************************************************************/ 97102500
*  DCL XSF_SFI_VRSR    BIT(64) CONSTANT('00098C0000000003'X);           97134600
*                                      /*VRS Retained                */ 97166700
*  DCL XSF_SFI_VRSR_ID   BIT(24) CONSTANT('8C0000'X);                   97198800
*  DCL XSF_VRSR_LENGTH   BIT(16) CONSTANT('0009'X);                     97230900
*  DCL XSF_VRSR_DTYPE    BIT(8)  CONSTANT('03'X);                       97263000
*                                                                       97295100
*  DCL XSF_VRSR_DATA_NO         BIN(8) CONSTANT('00'X);                 97327200
*  DCL XSF_VRSR_DATA_YES        BIN(8) CONSTANT('01'X);                 97359300
*/**************************************************************/! @01A 97360700
*  DCL XSF_SFI_VRXI       BIT(64) CONSTANT('00098C0800000003'X); ! @01A 97362100
*                                         ! Expiration Date Ignore @01A 97363500
*  DCL XSF_SFI_VRXI_ID    BIT(24) CONSTANT('8C0800'X);           ! @01A 97364900
*  DCL XSF_VRXI_LENGTH    BIT(16) CONSTANT('0009'X);             ! @01A 97366300
*  DCL XSF_VRXI_DTYPE     BIT(8)  CONSTANT('03'X);               ! @01A 97367700
*                                                                ! @01A 97369100
*  DCL XSF_VRXI_DATA_NO   BIN(8)  CONSTANT('00'X);               ! @01A 97370500
*  DCL XSF_VRXI_DATA_YES  BIN(8)  CONSTANT('01'X);               ! @01A 97371900
*/**************************************************************/! @01A 97373300
*  DCL XSF_SFI_VSCD       BIT(64) CONSTANT('000C8C1000000009'X); ! @01A 97374700
*                                ! Primary VRS Subchain start date @01A 97376100
*  DCL XSF_SFI_VSCD_ID    BIT(24) CONSTANT('8C1000'X);           ! @01A 97377500
*  DCL XSF_VSCD_LENGTH    BIT(16) CONSTANT('000C'X);             ! @01A 97378900
*  DCL XSF_VSCD_DTYPE     BIT(8)  CONSTANT('09'X);               ! @01A 97380300
*/**************************************************************/! @01A 97381700
*  DCL XSF_SFI_VSCN       BIT(64) CONSTANT('00108C1800000007'X); ! @01A 97383100
*                                      ! Primary VRS Subchain name @01A 97384500
*  DCL XSF_SFI_VSCN_ID    BIT(24) CONSTANT('8C1800'X);           ! @01A 97385900
*  DCL XSF_VSCN_LENGTH    BIT(16) CONSTANT('0010'X);             ! @01A 97387300
*  DCL XSF_VSCN_DTYPE     BIT(8)  CONSTANT('07'X);               ! @01A 97388700
*/********************************************************************/ 97391400
*  DCL XSF_SFI_VST     BIT(64) CONSTANT('00098C2000000002'X);           97423500
*                                      /*Volume Status               */ 97455600
*  DCL XSF_SFI_VST_ID    BIT(24) CONSTANT('8C2000'X);                   97487700
*  DCL XSF_VST_LENGTH    BIT(16) CONSTANT('0009'X);                     97519800
*  DCL XSF_VST_DTYPE     BIT(8)  CONSTANT('02'X);                       97551900
*                                                                       97584000
*  DCL XSF_VST_FLAG_MASTER     BIT(8) CONSTANT('80'X);                  97616100
*  DCL XSF_VST_FLAG_SCRATCH    BIT(8) CONSTANT('40'X);                  97648200
*  DCL XSF_VST_FLAG_USER       BIT(8) CONSTANT('20'X);                  97680300
*  DCL XSF_VST_FLAG_INIT       BIT(8) CONSTANT('10'X);                  97712400
*  DCL XSF_VST_FLAG_ENTRY      BIT(8) CONSTANT('08'X);                  97744500
*/********************************************************************/ 97776600
*  DCL XSF_SFI_VTM     BIT(64) CONSTANT('000C8C300000000A'X);           97808700
*                                      /*Last Inven Mgt VRS Time     */ 97840800
*  DCL XSF_SFI_VTM_ID    BIT(24) CONSTANT('8C3000'X);                   97872900
*  DCL XSF_VTM_LENGTH    BIT(16) CONSTANT('000C'X);                     97905000
*  DCL XSF_VTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       97937100
*/********************************************************************/ 97969200
*  DCL XSF_SFI_VTYP    BIT(64) CONSTANT('00098C4000000003'X);           98001300
*                                      /*Primary VRS Type        @01C*/ 98033400
*  DCL XSF_SFI_VTYP_ID   BIT(24) CONSTANT('8C4000'X);                   98065500
*  DCL XSF_VTYP_LENGTH   BIT(16) CONSTANT('0009'X);                     98097600
*  DCL XSF_VTYP_DTYPE    BIT(8)  CONSTANT('03'X);                       98129700
*                                                                       98161800
*  DCL XSF_VTYP_DATA_UNDEFINED  BIN(8) CONSTANT('00'X);                 98193900
*  DCL XSF_VTYP_DATA_DATASET    BIN(8) CONSTANT('01'X);                 98226000
*  DCL XSF_VTYP_DATA_SMSMC      BIN(8) CONSTANT('02'X);                 98258100
*  DCL XSF_VTYP_DATA_VRSMV      BIN(8) CONSTANT('03'X);                 98290200
*  DCL XSF_VTYP_DATA_DSNMV      BIN(8) CONSTANT('04'X);                 98322300
*  DCL XSF_VTYP_DATA_DSNMC      BIN(8) CONSTANT('05'X);          ! @01A 98338300
*/********************************************************************/ 98354400
*/*DCL XSF_SFI_V1      BIT(64) CONSTANT('00098C4800000003'X)     @SCD*/ 98406490
*                                      /*TLCS V1                 @SCD*/ 98426480
*/*DCL XSF_SFI_V1_ID     BIT(24) CONSTANT('8C4800'X)             @SCD*/ 98446470
*/*DCL XSF_V1_LENGTH     BIT(16) CONSTANT('0009'X)               @SCD*/ 98466460
*/*DCL XSF_V1_DTYPE      BIT(8)  CONSTANT('03'X)                 @SCD*/ 98486450
*                                                                       98547000
*/*DCL XSF_V1_DATA_NO           BIN(8) CONSTANT('00'X)           @SCD*/ 98599090
*/*DCL XSF_V1_DATA_YES          BIN(8) CONSTANT('01'X)           @SCD*/ 98619080
*/********************************************************************/ 98643300
*  DCL XSF_SFI_XDC     BIT(64) CONSTANT('00098C5000000003'X);           98675400
*                                      /*Expiration Date Check       */ 98707500
*  DCL XSF_SFI_XDC_ID    BIT(24) CONSTANT('8C5000'X);                   98739600
*  DCL XSF_XDC_LENGTH    BIT(16) CONSTANT('0009'X);                     98771700
*  DCL XSF_XDC_DTYPE     BIT(8)  CONSTANT('03'X);                       98803800
*                                                                       98835900
*  DCL XSF_XDC_DATA_NO          BIN(8) CONSTANT('00'X);                 98868000
*  DCL XSF_XDC_DATA_YES         BIN(8) CONSTANT('01'X);                 98900100
*  DCL XSF_XDC_DATA_OPERATOR    BIN(8)  CONSTANT('02'X);                98932200
*/********************************************************************/ 98964300
*  DCL XSF_SFI_XDTJ    BIT(64) CONSTANT('000C8C6000000009'X);           98996400
*                                      /*Expiration Date             */ 99028500
*  DCL XSF_SFI_XDTJ_ID   BIT(24) CONSTANT('8C6000'X);                   99060600
*  DCL XSF_XDTJ_LENGTH   BIT(16) CONSTANT('000C'X);                     99092700
*  DCL XSF_XDTJ_DTYPE    BIT(8)  CONSTANT('09'X);                       99124800
*/********************************************************************/ 99156900
*  DCL XSF_SFI_XTM     BIT(64) CONSTANT('000C8C700000000A'X);           99189000
*                                      /*Last Inven Mgt Expir Time   */ 99221100
*  DCL XSF_SFI_XTM_ID    BIT(24) CONSTANT('8C7000'X);                   99253200
*  DCL XSF_XTM_LENGTH    BIT(16) CONSTANT('000C'X);                     99285300
*  DCL XSF_XTM_DTYPE     BIT(8)  CONSTANT('0A'X);                       99317400
*/**************************************************************/! @LGA 99317500
*  DCL XSF_SFI_X100      BIT(64) CONSTANT('00098C7800000003'X);  ! @LGA 99317600
*                                         ! EDGUX100 exit status   @LGA 99317700
*  DCL XSF_SFI_X100_ID   BIT(24) CONSTANT('8C7800'X);            ! @LGA 99317800
*  DCL XSF_X100_LENGTH   BIT(16) CONSTANT('0009'X);              ! @LGA 99317900
*  DCL XSF_X100_DTYPE    BIT(8)  CONSTANT('03'X);                ! @LGA 99318000
*/**************************************************************/! @LGA 99318100
*  DCL XSF_SFI_X200      BIT(64) CONSTANT('00098C7801000003'X);  ! @LGA 99318200
*                                          ! EDGUX200 exit status  @LGA 99318300
*  DCL XSF_SFI_X200_ID   BIT(24) CONSTANT('8C7801'X);            ! @LGA 99318400
*  DCL XSF_X200_LENGTH   BIT(16) CONSTANT('0009'X);              ! @LGA 99318500
*  DCL XSF_X200_DTYPE    BIT(8)  CONSTANT('03'X);                ! @LGA 99318600
*/**************************************************************/! @01A 99318700
*  DCL XSF_SFI_2JBN      BIT(64) CONSTANT('00108C8000000007'X);  ! @01A 99319800
*                                       ! Second VRS jobname mask  @01A 99321000
*  DCL XSF_SFI_2JBN_ID   BIT(24) CONSTANT('8C8000'X);            ! @01A 99322200
*  DCL XSF_2JBN_LENGTH   BIT(16) CONSTANT('0010'X);              ! @01A 99323400
*  DCL XSF_2JBN_DTYPE    BIT(8)  CONSTANT('07'X);                ! @01A 99324600
*/**************************************************************/! @01A 99325800
*  DCL XSF_SFI_2NME      BIT(64) CONSTANT('00108C9000000007'X);  ! @01A 99327000
*                                               ! Second VRS mask  @01A 99328200
*  DCL XSF_SFI_2NME_ID   BIT(24) CONSTANT('8C9000'X);            ! @01A 99329400
*  DCL XSF_2NME_LENGTH   BIT(16) CONSTANT('0010'X);              ! @01A 99330600
*  DCL XSF_2NME_DTYPE    BIT(8)  CONSTANT('07'X);                ! @01A 99331800
*/**************************************************************/! @01A 99333000
*  DCL XSF_SFI_2SCD      BIT(64) CONSTANT('000C8CA000000009'X);  ! @01A 99334200
*                             ! Secondary VRS subchain start date  @01A 99335400
*  DCL XSF_SFI_2SCD_ID   BIT(24) CONSTANT('8CA000'X);            ! @01A 99336600
*  DCL XSF_2SCD_LENGTH   BIT(16) CONSTANT('000C'X);              ! @01A 99337800
*  DCL XSF_2SCD_DTYPE    BIT(8)  CONSTANT('09'X);                ! @01A 99339000
*/**************************************************************/! @01A 99340200
*  DCL XSF_SFI_2SCN      BIT(64) CONSTANT('00108CB000000007'X);  ! @01A 99341400
*                                   ! Secondary VRS subchain name  @01A 99342600
*  DCL XSF_SFI_2SCN_ID   BIT(24) CONSTANT('8CB000'X);            ! @01A 99343800
*  DCL XSF_2SCN_LENGTH   BIT(16) CONSTANT('0010'X);              ! @01A 99345000
*  DCL XSF_2SCN_DTYPE    BIT(8)  CONSTANT('07'X);                ! @01A 99346200
*/********************************************************************/ 99349500
*/********************************************************************/ 99381600
* @LOGIC;                                                               99413700
* #PRAGMA TOOL=CBGEN;                                                   99445800
* #EPGRAGMA TOOL=CBGEN;                                                 99477900
* @ENDLOGIC;                                                            99510000
*/* End of PL/X Source                                               */ 99542100
* %IF EDGXSF_LIST ^= 'NO' &                                             99574200
*    ZCBPRINT ^= 'NO' %THEN                                             99606300
*   %GOTO EDGXSF_4;                                                     99638400
*   @LIST POP NOECHO;                                                   99670500
* %EDGXSF_4:;                                                           99702600
* %END;                                                                 99734700
