*%GOTO REDLA1;                      /* BILINGUAL MAPPING MACRO          00001000
         MACRO                                                          00002000
         ERBREDG3                                                       00003000
.*                                                                      00004000
.*   This macro maps fields of the sample header control block          00005000
.*   used by external                                                   00006000
.*   interfaces of the RMF monitor III data gatherer                    00007000
.*                              */                                      00008000
*%REDLA1: ;                                                             00009000
*/****  START OF SPECIFICATIONS  *************************************/ 00010000
*/**                                                                 */ 00011000
*/** MODULE-NAME = ERBREDG3                                          */ 00012000
*/**                                                                 */ 00013000
*/** DESCRIPTIVE-NAME MAPPING MACRO FOR MONITOR III DATA GATHERER    */ 00014000
*/**                           RESOURCE DATA RECORD                  */ 00015000
*/**                                                                 */ 00016000
*%GOTO REDLA1A;    /*                                                   00017000
         ERBCOPY1 Y1=1983,Y2=1990                                       00018000
         AGO .REDAS1                                                    00019000
.*                 */                                                   00020000
*%REDLA1A:;                                                             00021000
       ? ERBCOPY1 Y1(1983) Y2(1990);/*                           @Y1C*/ 00022000
*%GOTO REDLA1B;    /*                                                   00023000
.REDAS1  ANOP                                                           00024000
.*                 */                                                   00025000
*%REDLA1B:;                                                             00026000
*/**                                                                 */ 00027000
*/** FUNCTION = THIS MACRO MAPS ONE RMF MON III DATA GATHERER        */ 00028000
*/**                           RESOURCE DATA RECORD                  */ 00029000
*/**                                                                 */ 00030000
*/** NOTES:                                                      @B1C*/ 00031000
*/**                                                                 */ 00032000
*/**  1. THE MAPPING MACRO ERBSSHG3 MUST ALSO BE INCLUDED.       @B1C*/ 00033000
*/**                                                                 */ 00034000
*/**                                                                 */ 00035000
*/**  2. THIS DATA AGGREGATE IS STORED IN PERMANENT STORAGE.     @B1A*/ 00036000
*/**     ANY CHANGES MADE MUST BE REFLECTED IN THE REPORTER      @B1A*/ 00037000
*/**     CONVERSION PROCESS. ESPECIALLY THE CONTROL BLOCK        @B1A*/ 00038000
*/**     ERBVFMG3 NEEDS TO BE UPDATED.                           @B1A*/ 00039000
*/**                                                                 */ 00040000
*/** MODULE TYPE = MACRO                                             */ 00041000
*/**                                                                 */ 00042000
*/** PROCESSOR   = PL/AS  and ASSEMBLER                              */ 00043000
*/**                                                                 */ 00044000
*/** METHOD OF ACCESS                                                */ 00045000
*/**    BAL   - A DSECT is produced, perform USING on REDG3          */ 00046000
*/**    PL/AS - REDG3 IS DECLARED AS BASED STRUCTURES,               */ 00047000
*/**         REDG3PTR SHOULD BE DECLARED                             */ 00048000
*/**                                                                 */ 00049000
*/** METHOD OF INVOCATION                                            */ 00050000
*/**                                                                 */ 00051000
*/**   BAl    - ERBREDG3                                             */ 00052000
*/**   PL/AS  - PERCENT INCLUDE SYSLIB(ERBREDG3) SEMICOLON           */ 00053000
*/**                                                                 */ 00054000
*/** DISTRIBUTION LIBRARY: ARMFMAC1                              @B1A*/ 00055000
*/**                                                                 */ 00056000
*/** CHANGE ACTIVITY = SEE BELOW                                     */ 00057000
*/** $M0=MONIIIG,HRM3202,,PFU: MAPPING MACRO FOR RESOURCE DATA RECORD*/ 00058000
*/** $Q1=PERI,HRM3402,,PFU:  Performance improvements            @Q1A*/ 00059000
*/** $W1=OPER,JRM4411,,MLN: Operations Support                   @W1A*/ 00060000
*/** $Y1=XCF,HRM4420,,BHL: XCF support                           @Y1A*/ 00061000
*/** $B1=R430,HRM4430,,THE: Distribution lib in prolog           @B1A*/ 00062000
*/** JS: Adjust ENQ Delay handling for ENQs with ECBs        @YA58321*/ 00063000
*/** PFU: JES3 SP 5.1.1 support                              @WA06111*/ 00063500
*/****  END OF SPECIFICATIONS  ***************************************/ 00064000
*%GOTO REDLA2;     /*                                                   00065000
REDG3    DSECT               RESOURCE RECORD                            00066000
         DS    0F            Align on word boundary                     00067000
REDREDID DS    XL1           RED ID                                     00068000
REDUSRCB EQU   X'3F'         RES ID for USER EXIT                       00069000
REDFLAG1 DS    XL1           RED FLAG1                                  00070000
REDINVAL EQU   X'80'         USER EXIT DATA ARE INVALID FOR THIS SAMPLE 00071000
REDRETRY DS    H             NR OF RETRIES OF THE USER EXIT ROUTINE     00072000
REDFUWDO DS    F             OFFSET TO FIRST  USER EXIT RECORD          00073000
REDUSERL DS    H             LENGTH OF USER  EXIT RECORD                00074000
REDUSERN DS    H             NUMBER OF USER EXIT RECORDS                00075000
         MEND                                                           00076000
                             */                                         00077000
*%REDLA2:;                                                              00078000
    DCL                                                                 00079000
      REDPROCB BIT(8) CONSTANT('01'X),/* RES ID PROC                 */ 00080000
      REDDEVCB BIT(8) CONSTANT('02'X),/* RES ID DEV              @Q1C*/ 00081000
      REDSTOCB BIT(8) CONSTANT('03'X),/* RES ID STORAGE              */ 00082000
      REDJESCB BIT(8) CONSTANT('04'X),/* RES ID JES2/JES3        @Q1C*/ 00083000
                                     /*                          @Q1D*/ 00084000
      REDHSMCB BIT(8) CONSTANT('06'X),/* RES ID HSM                  */ 00085000
      REDENQCB BIT(8) CONSTANT('07'X),/* RES ID ENQ                  */ 00086000
      REDMNTCB BIT(8) CONSTANT('08'X),/* Res ID OPER MOUNT       @W1A*/ 00087000
      REDMESCB BIT(8) CONSTANT('09'X),/* Res ID OPER MESSAGE     @W1A*/ 00088000
      REDXCFCB BIT(8) CONSTANT('0A'X),/* Res ID XCF pending msg  @Y1A*/ 00089000
      REDUSRCB BIT(8) CONSTANT('3F'X),/* RES ID USER                 */ 00090000
      REDUSRCF FIXED(8) CONSTANT(01),/* RES INDEX USER               */ 00091000
      REDPROCF FIXED(8) CONSTANT(02),/* RES INDEX PROC               */ 00092000
      REDDEVCF FIXED(8) CONSTANT(03),/* RES INDEX DEVICE         @Q1C*/ 00093000
      REDSTOCF FIXED(8) CONSTANT(04),/* RES INDEX STORAGE            */ 00094000
      REDJESCF FIXED(8) CONSTANT(05),/* RES INDEX JES2/JES3      @Q1C*/ 00095000
                                    /*                          1@Q1D*/ 00096000
      REDHSMCF FIXED(8) CONSTANT(06),/* RES INDEX HSM                */ 00097000
      REDENQCF FIXED(8) CONSTANT(07),/* RES INDEX ENQ                */ 00098000
      REDMNTCF FIXED(8) CONSTANT(08),/* Res index OPER MOUNT     @W1A*/ 00099000
      REDMESCF FIXED(8) CONSTANT(09),/* Res index OPER MESSAGE   @W1A*/ 00100000
      REDXCFCF FIXED(8) CONSTANT(10),/* Res index XCF pending msg       00101000
                                                                 @Y1A*/ 00102000
      REDLASCF FIXED(8) CONSTANT(10);      /* LAST INDEX         @Y1C*/ 00103000
    DCL                                                                 00104000
      1 REDG3 BASED(REDG3PTR) BDY(WORD), /*  RESOURCE RECORD         */ 00105000
        3 REDREDID FIXED(8),        /* RED ID                    @Q1C*/ 00106000
            7 * BIT(2),             /*                               */ 00107000
            7 REDRESID BIT(6),      /* RESOURCE ID                   */ 00108000
        3 REDFLAG1 BIT(8),          /* RED FLAG1                     */ 00109000
            7 REDINVAL BIT(1),      /* THIS RESOURCE INVALID         */ 00110000
            7 REDUSE   BIT(1),      /* ON= USE records available @Q1A*/ 00111000
            7 REDWAI   BIT(1),      /* ON= WAIT records Available@Q1A*/ 00112000
            7 REDENQEF BIT(1),      /* ON= ENQ WAIT record with ECB     00113000
                                       valid only withing data          00114000
                                       gathering             @YA58321*/ 00115000
            7 REDJESXI BIT(1),      /* ON= JESXCF not initialized       00116190
                                                             @WA06111*/ 00116380
            7 * BIT(3),             /* Reserved              @WA06111*/ 00116570
        3 REDRETRY FIXED(15),       /* NR OF RETRY THIS RES          */ 00117000
        3 REDFUWDO FIXED(31),       /* OFFSET TO FIRST  USER/WAIT REC*/ 00118000
        3 REDUWDLE FIXED(15),       /* Length of UWD record      @Q1C*/ 00119000
          5 REDUSERL FIXED(15),     /* LENGTH OF USER RECORD         */ 00120000
            7 REDUWDL1 FIXED(8),    /* Short length of ENQ UWD          00121000
                                    record (without SYSTEM/JOBNAME)     00122000
                                                                 @Q1A*/ 00123000
            7 REDUWDL2 FIXED(8),    /* Total length of ENQ UWD          00124000
                                    record (with SYSTEM/JOBNAME) @Q1A*/ 00125000
        3 REDUWDNR FIXED(15),       /* Number of UWD records     @Q1C*/ 00126000
          5 REDUSERN FIXED(15),     /* NUMBER OF USER EXIT RECS      */ 00127000
        3 REDEND   CHAR(0) BDY(WORD);   /*  FORCE WORD BOUNDARY      */ 00128000
    DCL                                                                 00129000
      1 REDARRAY BASED(SHDG3PTR+SHDREDOF),/* ARRAY OF RESOURCE DATA     00130000
                                       RECORDS                       */ 00131000
        3 REDENTRY(REDLASCF) CHAR(LENGTH(REDG3));/* ENTRY IN RED        00132000
                                       ARRAY                         */ 00133000
