*/*      Bilingual Mapping Macro for SMF Record 72                      00050000
         MACRO                                                          00100000
         ERBSMF72 &STYPE                                             */ 00150000
*/*** START OF SPECIFICATIONS ****************************************  00200000
*                                                                    *  00250000
*01* Proprietary Statement:                                          *  00300000
         ERBCOPY1 Y1=1983                                        @A1C*/ 00350000
*       ?ERBCOPY1 Y1(1983);                                             00400000
*/*                                                                  *  00450000
*01* Macro Name: ERBSMF72                                            *  00500000
*                                                                    *  00550000
*01* Descriptive Name: SMF RECORD 72                                 *  00600000
*02* Acronym: SMF72                                                  *  00650000
*                                                                    *  00700000
*01* DSECT Name:                                                     *  00750000
*02*  Subtype 1: SMF72HDR, SMF72PRO, SMF72CTL, SMF72PGP              *  00800000
*02*  Subtype 2: SMF72HDR, SMF72PRO, R722WKL, R722DATA, R722SWRE @C1C*  00816600
*02*  Subtype 3: SMF72HDR, SMF72PRO, R723WMS, R723SSS, R723RGS,  @C1A*  00833200
*02*             R723SCS, R723RTS, R723WRS                       @C1A*  00849800
*02*  Subtype 4: SMF72HDR, SMF72PRO, R724DATA, R724SWRE          @C2A*  00866400
*                                                                    *  00883000
*                                                                    *  00900000
*01* Component: Resource Measurement Facility (27404)                *  00950000
*                                                                    *  01000000
*01* Eye-Catcher:   None                                             *  01050000
*02*  Offset: N/A                                                    *  01100000
*02*  Length: N/A                                                    *  01150000
*                                                                    *  01200000
*01* Storage Attributes:                                             *  01250000
*02*   Subpool:  see below                                           *  01300000
*03*      Subtype 1: 0                                               *  01350000
*03*      Subtype 2: 10                                              *  01400000
*03*      Subtype 3: 0                                           @C1A*  01416600
*03*      Subtype 4: 10                                          @C2A*  01433200
*02*   Key:  8                                                       *  01450000
*02*   Residency:  Above                                             *  01500000
*02*   Main Storage:  N/A                                            *  01550000
*02*   Auxiliary Storage:  N/A                                       *  01600000
*02*   Virtual Storage:  N/A                                         *  01650000
*                                                                    *  01700000
*01* Function = This macro maps the complete SMF Record type 72.     *  01750000
*           It has four subtypes                                 @C2C*  01800000
*           - Subtype 1 is created by RMF if workload activity       *  01850000
*             measurements are activated.                            *  01900000
*           - Subtype 2 is created by RMF MON III if SMF is          *  01950000
*             recording record type 72 subtype 2.                    *  02000000
*           - Subtype 3 is created by RMF MON I if workload      @C1A*  02007100
*             activity measurements are activated and the        @C1A*  02014200
*             system runs in GOAL mode                           @C1A*  02021300
*           - Subtype 4 is created by RMF MON III if SMF is      @C2A*  02028400
*             recording record type 72 subtype 4 and the         @C2A*  02035500
*             system runs in GOAL mode                           @C2A*  02042600
*                                                                    *  02050000
*           The record consists of 5 parts:                          *  02100000
*           1. The fixed portion of the SMF header.                  *  02150000
*              This mapping is invoked by calling ERBHDR macro.      *  02200000
*           2. The individual header extension which contains        *  02250000
*              offset/length/number triplets to address the          *  02300000
*              record parts following the RMF product section.       *  02350000
*           3. The RMF product section.                              *  02400000
*              This mapping is invoked by calling ERBPRO macro.      *  02450000
*           4. The RMF control sections.                             *  02500000
*           5. The RMF data sections.                                *  02550000
*                                                                    *  02600000
*01* Notes : None                                                    *  02650000
*                                                                    *  02700000
*01* Size:                                                           *  02750000
*       Subtype 1: SMF72PGS + (SMF72PGL * SMF72PGN)                  *  02800000
*       Subtype 2: SMF72SWS + (SMF72SWL*SMF72SWN)                    *  02850000
*       Subtype 3: depends on existence of R723WRS and number    @C1A*  02862500
*                  of entries in R723RTS                         @C1A*  02875000
*       Subtype 4: SMF72SPS + (SMF72SPL*SMF72SPN)                @C2A*  02887500
*                                                                    *  02900000
*   Subtype 1:                                                       *  02950000
*                                                                    *  03000000
*     - SMF header      :  36 bytes                              @C1A*  03050000
*     - Header extension:  16 bytes                                  *  03100000
*     - Product section : 104 bytes                              @C1A*  03128500
*       + depending on Type/Subtype (split records only)         @C1A*  03157000
*                          16 bytes Split/Reassembly static      @C1A*  03185500
*         + variable entry  4 bytes * SMFHDR extension triple    @C1A*  03214000
*     - Control section : 116 bytes (each)                       @C3A*  03242500
*     - Data section    : 232 bytes (each)                       @F1C*  00830002
*                                                                    *  03300000
*   Subtype 2:                                                       *  03350000
*                                                                    *  03400000
*     - SMF header      : see above                                  *  03450000
*     - Header extension:  24 bytes                                  *  03500000
*     - Product section : see above                                  *  03550000
*     - Control section :  20 bytes (each)                           *  03600000
*     - Data section 1  : 220 bytes (each)                       @D1C*  00910008
*     - Data section 2  :  68 bytes (each)                           *  03700000
*       (swap reasons)                                               *  03750000
*                                                                    *  03752200
*   Subtype 3:                                                   @C1A*  03754400
*                                                                    *  03756600
*     - SMF header      : see above                              @C1A*  03758800
*     - Header extension:  48 bytes                              @C1A*  03761000
*     - Product section : see above                              @C1A*  03763200
*     - Control section : 232 bytes                              @C1A*  03765400
*     - Period section  : 428 bytes (each, max 8 entries)        @F1C*  01010008
*     - Served          :  12 bytes (each)                       @C1A*  03769800
*     - Response Time   :  56 bytes (each)                       @C1A*  03772000
*     - Resource Group  :  52 bytes (each)                       @C1A*  03774200
*     - Work Manager    :  96 bytes (each)                       @E1A*  03776400
*                                                                    *  03778600
*   Subtype 4:                                                   @C2A*  03780800
*                                                                    *  03783000
*     - SMF header      : see above                              @C2A*  03785200
*     - Header extension:  16 bytes                              @C2A*  03787400
*     - Product section : see above                              @C2A*  03789600
*     - Data section 1  : 264 bytes (each)                       @D1C*  01120002
*     - Data section 2  :  68 bytes (each)                       @C2A*  03794000
*       (swap reasons)                                           @C2A*  03796200
*                                                                    *  03800000
*01* Method of Access: See below                                     *  03850000
*                                                                    *  03900000
*       BAL : ERBSMF72 type                                          *  01180002
*             If the type is not specified, all subtypes are         *  01190002
*             included.                                      @WA05544*  01200002
*                                                                    *  04000000
*       PL/X: %IFAR72n='YES' semicolon  n = subtype selected         *  04050000
*             %INCLUDE SYSLIB(ERBSMF72) semicolon                    *  04100000
*                                                                    *  04150000
*             If the preprocessor variable %IFAR72n is not set       *  04200000
*             in the including module, subtype 1 is included.        *  04250000
*                                                                    *  04300000
*01* Pointed to by: SMF72PTR                                         *  04350000
*                                                                    *  04400000
*01* Serialization: None                                             *  04450000
*                                                                    *  04500000
*01* Created by:                                                     *  04550000
*                                                                    *  04600000
*02*    Subtype 1: ERBMFDWS, ERBDUWKL                            @C1C*  04650000
*02*    Subtype 2: ERB3GSIS                                          *  04700000
*02*    Subtype 3: ERBMFDWM, ERBDUWKL                            @C1A*  04716600
*02*    Subtype 4: ERB3GSIS                                      @C2A*  04733200
*                                                                    *  04750000
*01* Deleted by:                                                     *  04800000
*                                                                    *  04850000
*02*    Subtype 1: ERBMFDTA after return from Report generator       *  04900000
*02*    Subtype 2: Not applicable                                    *  04950000
*02*    Subtype 3: Not applicable                                @C1A*  04966600
*02*    Subtype 4: Not applicable                                @C2A*  04983200
*                                                                    *  05000000
*01* Module-type: BILINGUAL MAPPING MACRO                            *  05050000
*                                                                    *  05100000
*01* Status: HRM6603                                             @E1C*  05150000
*                                                                    *  05200000
*01* Frequency: 1                                                    *  05250000
*                                                                    *  05300000
*01* Dependencies: None                                              *  05350000
*                                                                    *  05400000
*01* Serialization: None                                             *  05450000
*                                                                    *  05500000
*01* Distribution Library: ARMFMAC1                              @B1C*  05550000
*                                                                    *  05600000
*01* Change Activity = See below                                     *  05650000
*                                                                    *  05700000
* $N0=SMFFORMT,HRM3102,,FRS: NEW FOR RMF 3.1                     @N0A*  05750000
* $P1=SMF72ADJ,HRM3302,,FRY: NEW FOR RMF 3.3 WORKLOAD ACTIVITY   @P1A*  05800000
* $R0=220SUP,JRM3422,,WRC: RMF SUPPORT FOR MVS SP2.2.0           @R0A*  05850000
* REMOVE COMMENT FROM COLUMN 72 SO THE MACRO WILL ASSEMBLE   @YA04880*  05900000
* $W1=SMF,JRM4411,,BHL: SMF Record 72                            @W1A*  05950000
* $W2=SP310E,JRM4411,,PAE: Stor isolation for ESO hiperspaces    @W2A*  06000000
* Remove paranthesis after SETC so the macro will assemble   @YA18672*  06050000
* Make sure both the SMF72 subtypes 1 and 2 are assembled    @YA18672*  06100000
*   when requested.                                          @YA18672*  06150000
* $Y1=LJM,HRM4420,,LAH: Large Job Management Support             @Y1A*  06200000
* $A1=APPC,JRM4421,,BGBO: APPC tolerating support                @A1A*  06250000
* $A2=WSET,JRM4421,,BGBO: Working Set Management / Block Paging  @A2A*  06300000
* $B1=RTIME,HRM4430,,BHL: Response Time Support                  @B1A*  06350000
* $B2=OMVS,HRM4430,,RPT: OPEN/MVS Toleration Support             @B2A*  06400000
* $C1=WLM,HRM4440,,HKH: WLM support, new subtype 3               @C1A*  06410000
* $C2=WLM,HRM4440,,RTL: WLM support, new subtype 4               @C2A*  06420000
* $C3=WLM,HRM4440,,BHL: Workload Manager I                       @C3A*  06430000
* $C4=GWLM3,HRM5510,,HOL: Workload Manager - Monitor III         @C4A*  06440000
* LAN: Corrects SWAP Section Handling                        @WA03326*  06452052
*      Equivalent to OW01699                                 @WA03326*  06464052
* HOL: Corrects SWAP Section Handling                        @WA03509*  06476052
*      Equivalent to OW01699                                 @WA03509*  018100DI
* GBO: Cleanup of PADI-inconsistencies                       @WA05544*  018200 I
* $D1=CAP,HRM5520,,JKE: Captured Storage support                 @D1A*  018210 I
* $E1=WLM,HRM6603,,HOL: OS/390 WLM Support                       @E1A*  018210 I
* $E2=WLM,HRM6603,,HOL: I/O delay indicator for velocity         @E2A*  018210 I
* $F1=WLM,HRM6604,,HOL: WLM Batch Support                        @F1A*  018210 I
* $F2=WLM,HRM6604,,HOL: WLM Batch Support                        @F2A*  018210 I
* $I1=WLM,HRM7703,,HOL: Multisystem Enclave Support              @I1A*          
* $I2=WLM,HRM7703,,HOL: WLM Goal Mode Inhibitors                 @I2A*          
*                                                                    *  018300 I
****** End of Specifications *****************************************/ 06500000
*        %GOTO PLAS72;                                                  06550000
*/*                                                                     06600000
         SPACE 3                                                        06650000
**********************  COMMON SMF HEADER  **************************** 06700000
         ERBHDR 72                                                      06750000
         SPACE 3                                                        06800000
**********************  INDIVIDUAL HEADER EXTENSION  ****************** 06850000
SMF72HDX  DS   0F       Begin of individual header extension      @C4A  06864200
         SPACE 3                                                        06878400
         LCLC &X                                                  @C1A  06892600
&X       SETC   T'&STYPE                                          @C1A  06906800
         AIF    (&STYPE EQ 3).HDREXT3                             @C1A  06921000
         AIF    (&STYPE EQ 4).HDREXT4                             @C2A  06935200
SMF72WLS  DS   BL4      Offset to workload control section (Subtype 1)  06950000
*                       Offset to performance group/domain control      07000000
*                       section (Subtype 2)                             07050000
SMF72WLL  DS   BL2      Length of workload control section (Subtype 1)  07100000
*                       Length of performance group/domain control      07150000
*                       section (Subtype 2)                             07200000
SMF72WLN  DS   BL2      Number of workload control sections             07250000
*                       Number of performance group/domain control      07300000
*                       sections (Subtype 2)                            07350000
SMF72PGS  DS   BL4      Offset to performance group period              07400000
*                       data section (Subtype 1)                        07450000
*                       Offset to performance group/domain              07500000
*                       data section (Subtype 2)                        07550000
SMF72PGL  DS   BL2      Length of performance group period              07600000
*                       data section (Subtype 1)                        07650000
*                       Length of performance group/domain              07700000
*                       data section (Subtype 2)                        07750000
SMF72PGN  DS   BL2      Number of performance group period              07800000
*                       data section (Subtype 1)                        07850000
*                       Number to performance group/domain              07900000
*                       data section (Subtype 2)                        07950000
         SPACE 3                                                        08000000
         AIF    ('&X' EQ 'O').HDREXT2                             @B1A  08100000
         AIF    (&STYPE EQ 1).PROSEC                              @B1A  08150000
         AIF    (&STYPE EQ 2).HDREXT2                             @B1A  08200000
         AIF    (&STYPE EQ 3).HDREXT3                             @C1A  08225000
.HDREXT2 ANOP                                                     @B1A  08250000
*                                                                       08300000
SMF72SWS  DS   BL4      Offset to swap reason data section              08350000
*                       (Subtype 2 only)                          @B1A  08400000
SMF72SWL  DS   BL2      Length of swap reason data section              08450000
*                       (Subtype 2 only)                          @B1A  08500000
SMF72SWN  DS   BL2      Number of swap reason data sections             08550000
*                       (Subtype 2 only)                          @B1A  08600000
         SPACE 3                                                        08600800
         AIF    ('&X' EQ 'O').HDREXT3                             @C1A  08601600
         AIF    (&STYPE EQ 1).PROSEC                              @C1A  08602400
         AIF    (&STYPE EQ 2).PROSEC                              @C1A  08603200
.HDREXT3 ANOP                                                     @C1A  08604000
          ORG  SMF72HDX Subtype 3 header extension                @C4A  02370002
SMF723HX  DS   0CL48    Header extension                      @WA05544  02380002
SMF72WMS  DS   BL4      Offset to workload manager control        @C1A  08605600
*                       section (Subtype 3)                       @C1A  08606400
SMF72WML  DS   BL2      Length of workload manager control        @C1A  08607200
*                       section (Subtype 3)                       @C1A  08608000
SMF72WMN  DS   BL2      Number of workload manager control        @C1A  08608800
*                       section (Subtype 3)                       @C1A  08609600
SMF72SSS  DS   BL4      Offset to service class served data       @C1A  08610400
*                       section (Subtype 3)                       @C1A  08611200
SMF72SSL  DS   BL2      Length to service class served data       @C1A  08612000
*                       section (Subtype 3)                       @C1A  08612800
SMF72SSN  DS   BL2      Number of service class served data       @C1A  08613600
*                       sections (Subtype 3)                      @C1A  08614400
SMF72RGS  DS   BL4      Offset to resource group data section     @C1A  08615200
*                       (Subtype 3)                               @C1A  08616000
SMF72RGL  DS   BL2      Length of resource group data section     @C1A  08616800
*                       (Subtype 3)                               @C1A  08617600
SMF72RGN  DS   BL2      Number of resource group data sections    @C1A  08618400
*                       (Subtype 3)                               @C1A  08619200
SMF72SCS  DS   BL4      Offset to service class period data       @C1A  08620000
*                       section (Subtype 3)                       @C1A  08620800
SMF72SCL  DS   BL2      Length of service class period data       @C1A  08621600
*                       section (Subtype 3)                       @C1A  08622400
SMF72SCN  DS   BL2      Number of service class period data       @C1A  08623200
*                       section (Subtype 3)                       @C1A  08624000
SMF72RTS  DS   BL4      Offset to response time distribution      @C1A  08624800
*                       bucket data section (Subtype 3)           @C1A  08625600
SMF72RTL  DS   BL2      Length of response time distribution      @C1A  08626400
*                       bucket data section (Subtype 3)           @C1A  08627200
SMF72RTN  DS   BL2      Number of response time distribution      @C1A  08628000
*                       bucket data sections (Subtype 3)          @C1A  08628800
SMF72WRS  DS   BL4      Offset to work/resource manager state     @C1A  08629600
*                       (Subtype 3)                               @C1A  08630400
SMF72WRL  DS   BL2      Length of work/resource manager state     @C1A  08631200
*                       (Subtype 3)                               @C1A  08632000
SMF72WRN  DS   BL2      Number of work/resource manager state     @C1A  08632800
*                       (Subtype 3)                               @C1A  08633600
         SPACE 3                                                        08634400
         AIF    ('&X' EQ 'O').HDREXT4                             @C2A  08635200
         AIF    (&STYPE EQ 3).PROSEC                              @C2A  08636000
.HDREXT4 ANOP                                                     @C2A  08636800
          ORG  SMF72HDX Subtype 4 header extension                @C4A  02790002
SMF724HX  DS   0CL16    Header extension                      @WA05544  02800002
SMF72CPS  DS   BL4      Offset to service class period data       @C2A  08638400
*                       sections (Subtype 4)                      @C2A  08639200
SMF72CPL  DS   BL2      Length of service class period data       @C2A  08640000
*                       sections (Subtype 4)                      @C2A  08640800
SMF72CPN  DS   BL2      Number of service class period data       @C2A  08641600
*                       sections (Subtype 4)                      @C2A  08642400
SMF72SPS  DS   BL4      Offset to swap reason data                @C2A  08643200
*                       sections (Subtype 4)                      @C2A  08644000
SMF72SPL  DS   BL2      Length of swap reason data                @C2A  08644800
*                       sections (Subtype 4)                      @C2A  08645600
SMF72SPN  DS   BL2      Number of swap reason data                @C2A  08646400
*                       sections (Subtype 4)                      @C2A  08647200
         SPACE 3                                                        08650000
.PROSEC  ANOP                                                     @B1A  08700000
         SPACE 3                                                        08750000
**********************  COMMON RMF PRODUCT SECTION  ******************* 08800000
         ERBPRO 72                                                      08850000
         SPACE 3                                                        08900000
*                                                                       08950000
*                                                                 @B1D  09000000
         AIF    ('&X' EQ 'O').SUBTYP1                             @W1A  09050000
         AIF    (&STYPE EQ 1).SUBTYP1                             @W1A  09100000
         AIF    (&STYPE EQ 2).SUBTYP2                             @W1A  09150000
         AIF    (&STYPE EQ 3).SUBTYP3                             @C1A  09166600
         AIF    (&STYPE EQ 4).SUBTYP4                             @C2A  09183200
.SUBTYP1 ANOP                                                     @W1A  09200000
**********************  Control Section for Subtype I  **************** 09250000
**********************  WORKLOAD CONTROL SECTION  ********************* 09300000
SMF72CTL DSECT                                                          09350000
SMF72FG1  DS   BL1      FLAGS                                           09400000
*                       Reserved                                 @F1C   03110002
SMF72OVE  EQU  X'10'    WLM I/O Priority Management = YES        @F1A           
SMF72CAA  EQU  X'08'    RCAA data not available -                @C1A   09428400
*                       RC 08 RSN 0831 from IWMRCOLL             @C1A   09442600
SMF72ACN  EQU  X'04'    ACCOUNT INFORMATION                      @R0A   09456800
SMF72RPT  EQU  X'02'    REPORT CLASS                                    09471000
SMF72CHF  EQU  X'01'    CHANGE TO PERFORMANCE SENSITIVE                 09485200
*                       VARIABLE WAS MADE                               09500000
SMF72RV3  DS   BL1      RESERVED                                        09650000
SMF72SUB  DS   BL2      SUB-CATEGORY CODE,PERF.GROUP #                  09700000
SMF72HPG  DS   BL2      HIGHEST PERF GROUP(PG) # DEFINED IN IPS         09750000
SMF72IPS  DS   CL8      NAME OF INSTALLATION PERF SPEC                  09800000
          DS   CL3      Reserved                                 @A2C   09850000
          DS   CL3      Reserved                                 @A2C   09900000
SMF72ERF  DS   CL6      ERV RESOURCE MANAGER COEFFICIENT                09950000
SMF72ISD  DS   CL4      IOC SERVICE DEFINITION COEFFICIENT              10000000
SMF72CSD  DS   CL4      CPU SERVICE DEFINITION COEFFICIENT              10050000
SMF72RV4  DS   CL4      RESERVED SINCE RMF 4.2.0                        10100000
SMF72SSD  DS   CL4      SRB SERVICE DEFINITION COEFFICIENT              10150000
SMF72OPT  DS   CL8      NAME OF OPT                                     10200000
SMF72ICS  DS   CL8      NAME OF ICS                                     10250000
SMF72SYS  DS   CL4      SUBSYSTEM FOR THIS PGN                          10300000
SMF72CLS  DS   CL10     CLASS                                           10350000
SMF72USR  DS   CL10     USER ID                                         10400000
SMF72NAM  DS   CL10     TRANSACTION NAME FOR THIS PGN                   10450000
SMF72ADJ  DS   F        VALUE RMCTADJC - ADJ. FACTOR FOR CPU RATE @P1A  10500000
SMF72MSD  DS   CL8      MSO SERVICE DEFINITION COEFFICIENT        @Y1A  10550000
SMF72SRV  DS   CL10     Service class (SRVCLASS) as specified in  @C3A  10562500
*                       ICSMSRVC                                  @C3A  10575000
SMF72RV5  DS   BL2      Reserved                                  @C3A  10587500
          SPACE 3                                                       10600000
*************  PERF.GROUP PERIOD DATA SECTION  ************************ 10650000
SMF72WKL  DSECT                                                         03420002
SMF72PGP  DS   0C       Period data                           @WA05544  03430002
SMF72TTX  DS   BL4      # OF TERMINATED TRANSACTIONS                    10750000
SMF72ACT  DS   BL4      ALL TRANSACTIONS ACTIVE TIME-1K MIC SEC         10800000
SMF72SER  DS   BL4      ALL TRANSACTIONS SERVICE UNITS                  10850000
SMF72TTM  DS   BL4      TERM TRANS ELAPSED TIME-1K MIC SEC              10900000
          DS   BL4      Now reserved (was WLL up to 4.2.0)        @A2A  10950000
SMF72MTS  DS   BL4      MSO TOTAL SERVICE                               11000000
SMF72ITS  DS   BL4      I/O TOTAL SERVICE                               11050000
SMF72CTS  DS   BL4      CPU TOTAL SERVICE                               11100000
SMF72TAT  DS   BL4      TRANSACTION ACTIVE TIME IN STORAGE              11150000
SMF72SPP  DS   BL4      NO. SWAPS IN PERIOD                             11200000
SMF72CDN  DS   BL2      CURRENT DOMAIN NUMBER                           11250000
          DS   BL1      Reserved                                  @A2C  11300000
SMF72TSG  DS   BL1      TIME SLICE GROUP NUMBER                         11350000
SMF72STS  DS   BL4      SRB TOTAL SERVICE                               03570002
SMF72ETS  DS   0BL8     SUM OF SQUARES OF ENDED TRANS(8 BYTE-INT)       03580002
SMF72ET1  DS   BL4      WORD1-SUM OF SQUARES OF ENDED TRANS             11450000
SMF72ET2  DS   BL4      WORD2-SUM OF SQUARES OF ENDED TRANS             11500000
SMF72PIN  DS   BL4      NUMBER OF PAGE-INS                    @YA04880  03610002
SMF72FRS  DS   0BL8     ACTIVE FRAME TIME (8 BYTE-INT)        @WA05544  03620002
SMF72FT1  DS   BL4      WORD1-ACTIVE FRAME-TIME               @YA04880  11600000
SMF72FT2  DS   BL4      WORD2-ACTIVE FRAME-TIME               @YA04880  11650000
SMF72HIN  DS   BL4      Number of hiperspace page-ins             @W2A  11700000
SMF72HRM  DS   BL4      Number of hiperspace read misses          @W2A  11750000
SMF72BPI  DS   BL4      Number of blocked pages paged in          @A2A  11800000
SMF72PIE  DS   BL4      Single pages in from exp. incl. 1st page  @A2A  11850000
SMF72BPE  DS   BL4      Blocked pages in from exp. excl. 1st page @A2A  11900000
SMF72BKA  DS   BL4      Number of blocks paged in from AUX        @A2A  11950000
SMF72BKE  DS   BL4      Number of blocks paged in from expanded   @A2A  12000000
SMF72ERS  DS   0B       Expanded storage frame residency time     @A2A  12050000
*                       Units: 1024 microseconds                        12100000
SMF72ER1  DS   BL4         High order word                        @A2A  12150000
SMF72ER2  DS   BL4         Low  order word                        @A2A  12200000
SMF72RCT  DS   BL4      Region Control Task time                  @A2A  12250000
*                       Units: Microseconds                             12300000
SMF72IIT  DS   BL4      I/O interrupt processing time             @A2A  12350000
*                       Units: Microseconds                             12400000
SMF72HST  DS   BL4      Hiperspace service time                   @A2A  12450000
*                       Units: Microseconds                             12500000
SMF72TST  DS   BL4      Total system transaction time             @A1A  12550000
*                       Units: 1024 microseconds                        12600000
SMF72VEL  DS   0D       Execution velocity data                   @C1A  12610000
SMF72CUS  DS   BL4      CPU using samples. These are included in        12620000
*                       SMF72TOU.                                 @E1C          
SMF72TOT  DS   BL4      Total delay samples used in SRM's               12630000
*                       execution velocity calculation. With WLM's      03870002
*                       I/O support, this also includes I/O delay               
*                       samples, if SMF72OVE = true               @F1C          
SMF72SRS  DS   CL8      Total shared page residency time                03870107
*                       (1024 microseconds)                             03870202
*                       Format: long floating point               @D1A  03870302
SMF72SPA  DS   CL8      Total shared page-ins from auxiliary storage    03870407
*                       Format: long floating point               @D1A  03870502
SMF72SPE  DS   CL8      Total shared page-ins from expanded storage     03870607
*                       Format: long floating point               @D1A  03871002
SMF72ICT  DS   CL8      Total DASD I/O connect time in 128 microsecond          
*                       units. (long floating point)              @E1A          
SMF72IWT  DS   CL8      Total DASD I/O wait time (queue time + pending  12280802
*                       time in 128 microsecond units.) This field              
*                       does not include IOS queue time.                        
*                       (long floating point)                     @E1A  12281002
SMF72IDT  DS   CL8      Total DASD I/O disconnect time in               12280802
*                       in 128 microsecond units.                               
*                       (long floating point)                     @E1A  12281002
SMF72IRC  DS   F        Total DASD I/O count. This can be used with     12280802
*                       the above fields (SMF72ICT, SMF72IWT, and               
*                       SMF72IDT) to determine the average DASD                 
*                       response time for the period              @E1A  12281002
SMF72TOU  DS   F        Total usings. Velocity should be calculated             
*                       as SMF72TOU/(SMF72TOU+SMF72TOT).          @E1A          
SMF72IOU  DS   F        Total I/O usings. These are included in                 
*                       SMF72TOU. Only non paging DASD I/O can                  
*                       contribute to I/O using                   @E1A          
SMF72NDI  DS   F        Non DASD I/O using or delay               @E1A          
SMF72IOD  DS   F        Total I/O delays.                         @F1A          
SMF72TSA  DS   CL8      Total execution samples. It is the sum of               
*                       RCAETOTU, RCAETOTD, RCAEUNKN, and RCAEIDLE.             
*                       Also always includes I/O using/delay samples            
*                       whether or not I/O samples are included in              
*                       RCAETOTU or RCAETOTD, respectively.                     
*                       (long floating point)                     @F1A          
SMF72IOT  DS   CL8      Total DASD IOS queue time in 128 microsecond            
*                       units (long floating point)               @F1A          
SMF72QDT  DS   BL4      Total queue delay time. For batch jobs this             
*                       is the time jobs spent on the job queue while           
*                       eligible to run on some system. It represents           
*                       the time the jobs spent waiting for an                  
*                       initiator. For TSO users, this time can be a            
*                       portion of the LOGON process. For APPC this             
*                       is the time an APPC request spends on an APPC           
*                       queue. (1024 microsecond units)           @F1A          
SMF72ADT  DS   BL4      Total time batch jobs were ineligible to run            
*                       because a resource the job had affinity to              
*                       was unavailable. Only applies to batch work.            
*                       Zero for other work types. (1024 microsecond            
*                       units)                                    @F1A          
SMF72CVT  DS   BL4      Total time batch jobs spent in JCL conversion.          
*                       Only applies to batch work. Zero for other              
*                       work types. (1024 microsecond units)      @F1A          
SMF72IQT  DS   BL4      Total time batch jobs spend on job queue                
*                       (after JCL conversion) while ineligible to              
*                       run on any system for reasons other than                
*                       resource affinities. Only applies to batch              
*                       work. Zero for other work types.                        
*                       (1024 microsecond units)                  @F1A          
SMF72IEA  DS   BL4      Independent enclave total transaction active            
*                       time (in 1024 microsecond units) for enclaves           
*                       that originated on this system.           @I1A          
SMF72XEA  DS   BL4      Exported enclave total transaction active               
*                       time (in 1024 microsecond units).         @I1A          
SMF72FEA  DS   BL4      Foreign enclave total transaction active time           
*                       (in 1024 microsecond units).              @I1A          
          SPACE 3                                                       12650000
          AIF  ('&X' EQ 'O').SUBTYP2                          @YA18672  12700000
          MEXIT                                                   @W1A  12750000
.SUBTYP2  ANOP                                                    @W1A  12800000
**********************  Control Section for Subtype II  *************** 12850000
**********************  Workload Control Section  ********************* 12900000
R722WKL  DSECT                                                    @W1A  12950000
R722TSR   DS   BL2      Total number of small records in interval @W1A  13000000
          DS   BL2      Reserved for future use                   @W1A  13050000
R722TOT   DS   BL4      Total number of data sections in interval @W1A  13100000
R722NXT   DS   BL4      Number of data sections in following      @W1A  13150000
*                       records                                         13200000
R722IPS   DS   CL8      Name of IPS                               @W1A  13250000
          SPACE 3                                                       13300000
**********************  Data Section  ********************************* 13350000
R722DATA DSECT                                                    @W1A  13400000
R722PG    DS   BL2      Performance group number                  @W1A  13450000
R722DMN   DS   BL2      Domain number                             @W1A  04050002
R722CLR   DS   0C       Overdefinition                        @WA05544  04060002
R722USER  DS   BL4      Sum of all users found                    @W1A  13550000
R722ACTV  DS   BL4      Sum of all active users found             @W1A  13600000
R722PAGE  DS   BL4      Sum of all users delayed for paging             13650000
*                       at all samples.                           @B1C  13700000
R722SWAP  DS   BL4      Sum of all users delayed for swapping           13750000
*                       at all samples.                           @B1C  13800000
R722OUTR  DS   BL4      Sum of all out and ready users                  13850000
*                       at all samples.                           @B1C  13900000
R722ACTF  DS   BL4      Sum of all active frames.                 @B1C  13950000
*                       This field contains X'7FFFFFFF' if the          14000000
*                       value will not fit in the field.                14050000
*                       The field R722ACFF contains the value in        14100000
*                       floating point.                                 14150000
R722ACTS  DS   BL4      Sum of all active samples (except OUTR)   @W1A  14200000
R722IDLE  DS   BL4      Sum of all idle frames.                   @B1C  14250000
*                       This field contains X'7FFFFFFF' if the          14300000
*                       value will not fit in the field.                14350000
*                       The field R722IDLF contains the value in        14400000
*                       floating point.                                 14450000
R722IDLS  DS   BL4      Sum of all idle samples                   @W1A  14500000
R722PGIN  DS   BL4      Sum of all page-ins                       @W1A  14550000
R722SLOT  DS   BL4      Sum of all slots used                     @B1C  14600000
*                       This field contains X'7FFFFFFF' if the          14650000
*                       value will not fit in the field.                14700000
*                       The field R722SLTF contains the value in        14750000
*                       floating point.                                 14800000
R722DIV   DS   BL4      Sum of all DIV frames                     @B1C  14850000
*                       This field contains X'7FFFFFFF' if the          14900000
*                       value will not fit in the field.                14950000
*                       The field R722DIVF contains the value in        15000000
*                       floating point.                                 15050000
R722DIVS  DS   BL4      Sum of all DIV samples                    @W1A  15100000
R722FIX   DS   BL4      Sum of all fixed frames                   @B1C  15150000
*                       This field contains X'7FFFFFFF' if the          15200000
*                       value will not fit in the field.                15250000
*                       The field R722FIXF contains the value in        15300000
*                       floating point.                                 15350000
R722ET    DS   BL8      Total elapsed time for all transactions         15400000
*                       that ended in the group. Does not include       15450000
*                       queued time.                              @B1A  15500000
R722QT    DS   BL8      Total time spent on JES or APPC queues by       15550000
*                       all transactions that ended in the group. @B1A  15600000
R722END   DS   BL4      The number of transactions that ended in        15650000
*                       the group.                                @B1A  15700000
R722UPRO  DS   BL4      Total processor using samples for the group     15750000
*                                                                 @B1A  15800000
R722UDEV  DS   BL4      Total device using samples for the group  @B1A  15850000
R722DPRO  DS   BL4      Total processor delay samples for the group     15900000
*                                                                 @B1A  15950000
R722DDEV  DS   BL4      Total device delay samples for the group  @B1A  16000000
R722DSTO  DS   BL4      Total storage delay samples for the group @B1A  16050000
R722DJES  DS   BL4      Total JES delay samples for the group     @B1A  16100000
R722DHSM  DS   BL4      Total HSM delay samples for the group     @B1A  16150000
R722DXCF  DS   BL4      Total XCF delay samples for the group     @B1A  16200000
R722DENQ  DS   BL4      Total ENQ delay samples for the group     @B1A  16250000
R722DMNT  DS   BL4      Total mount delay samples for the group   @B1A  16300000
R722DMSG  DS   BL4      Total message delay samples for the group @B1A  16350000
R722UNKN  DS   BL4      Total unknown state samples for the group @B1A  16400000
R722VALD  DS   BL4      Total valid samples for the group               16450000
*                       (single state sum of all using, delay,          16500000
*                       idle and unknown)                         @B1A  16550000
R722LSCT  DS   BL4      Count of "long" logical swaps for the group     16600000
*                                                                 @B1A  16650000
R722ESCT  DS   BL4      Count of "long" swaps to expanded storage       16700000
*                       for the group                             @B1A  16750000
R722PSCT  DS   BL4      Count of "long" physical swaps for the group    16800000
R722LSCF  DS   BL4      Sum of all central frames for all logically     16850000
*                       swapped users at all samples.                   16900000
*                       Floating point.                           @B1A  16950000
R722LSEF  DS   BL4      Sum of all expanded frames for all logically    17000000
*                       swapped users at all samples.                   17050000
*                       Floating point.                           @B1A  17100000
R722LSSA  DS   BL4      Total logically swapped samples for the group   17150000
*                                                                 @B1A  17200000
R722PSEF  DS   BL4      Sum of all expanded frames for all swapped      17250000
*                       users (except logical) at all samples.          17300000
*                       Floating point.                           @B1A  17350000
R722PSSA  DS   BL4      Total swapped samples for the group             17400000
*                       (except logical)                          @B1A  17450000
R722VECT  DS   BL4      Total vector utilization time for the group     17500000
*                                                                 @B1A  17550000
R722ACFF  DS   BL4      Sum of all active frames.                       17600000
*                       Floating point.                           @B1A  17650000
R722IDLF  DS   BL4      Sum of all idle frames.                         17700000
*                       Floating point.                           @B1A  17750000
R722SLTF  DS   BL4      Sum of all slots used                           17800000
*                       Floating point.                           @B1A  17850000
R722DIVF  DS   BL4      Sum of all DIV frames.                          17900000
*                       Floating point.                           @B1A  17950000
R722FIXF  DS   BL4      Sum of all fixed frames.                        18000000
*                       Floating point.                           @B1A  04970002
R722TSV   DS   CL8      Sum of shared page views                        04970307
*                       Format: long floating point               @D1A  04970402
R722VIN   DS   CL8      Sum of shared pages in central storage, that    04970507
*                       are valid                                       04970602
*                       Format: long floating point               @D1A  04970702
R722VLC   DS   CL8      Sum of shared page validations                  04970807
*                       Format: long floating point               @D1A  04970902
R722GPI   DS   CL8      Sum of shared page-ins from auxiliary storage   04971007
*                       Format: long floating point               @D1A  04972002
          SPACE 3                                                       18100000
**********************  Swap reason data section  ********************* 18150000
R722SWRE DSECT                                                    @B1A  18200000
R722OR1   DS   BL4      STOR/OUTR delay samples for swap reason 1:      18250000
*                       Terminal output wait                  @WA01699  18300052
R722OR2   DS   BL4      STOR/OUTR delay samples for swap reason 2:      18350000
*                       Terminal input wait                   @WA01699  18400052
R722OR3   DS   BL4      STOR/OUTR delay samples for swap reason 3:      18450000
*                       Long wait                                 @B1A  18500000
R722OR4   DS   BL4      STOR/OUTR delay samples for swap reason 4:      18550000
*                       Auxiliary storage shortage                @B1A  18600000
R722OR5   DS   BL4      STOR/OUTR delay samples for swap reason 5:      18650000
*                       Real storage shortage                     @B1A  18700000
R722OR6   DS   BL4      STOR/OUTR delay samples for swap reason 6:      18750000
*                       Detected long wait                        @B1A  18800000
R722OR7   DS   BL4      STOR/OUTR delay samples for swap reason 7:      18850000
*                       Requested swap                            @B1A  18900000
R722OR8   DS   BL4      STOR/OUTR delay samples for swap reason 8:      18950000
*                       Enqueue exchange swap                     @B1A  19000000
R722OR9   DS   BL4      STOR/OUTR delay samples for swap reason 9:      19050000
*                       Exchange swap                             @B1A  19100000
R722OR10  DS   BL4      STOR/OUTR delay samples for swap reason 10:     19150000
*                       Unilateral swap                           @B1A  19200000
R722OR11  DS   BL4      STOR/OUTR delay samples for swap reason 11:     19250000
*                       Transition swap                           @B1A  19300000
R722OR12  DS   BL4      STOR/OUTR delay samples for swap reason 12:     19350000
*                       Improve central storage usage             @B1A  19400000
R722OR13  DS   BL4      STOR/OUTR delay samples for swap reason 13:     19450000
*                       Improve system paging rate                @B1A  19500000
R722OR14  DS   BL4      STOR/OUTR delay samples for swap reason 14:     19550000
*                       Make room for an out too long user        @B1A  19600000
R722OR15  DS   BL4      STOR/OUTR delay samples for swap reason 15:     19650000
*                       APPC wait                                 @B1A  19700000
R722OR16  DS   BL4      STOR/OUTR delay samples for swap reason 16:     19750000
*                       OMVS input wait                           @B2A  19800000
R722OR17  DS   BL4      STOR/OUTR delay samples for swap reason 17:     19850000
*                       OMVS output wait                          @B2A  19900000
          SPACE 3                                                       19900100
          AIF  ('&X' EQ 'O').SUBTYP3                              @C1A  19900200
          MEXIT                                                   @C1A  19900300
          SPACE 3                                                       19900400
.SUBTYP3  ANOP                                                    @C1A  19900500
**********************  Subtype III Data Sections  ******************** 19900600
**********************  Workload Manager Control Section  ************* 19900700
          SPACE 3                                                       19900800
R723WMS  DSECT                                                    @C1A  19900900
R723MSCF  DS   BL1      Service class flags                       @C1A  19901000
R723MRCL  EQU  X'80'    This is a report class (RCAARCL)          @C1A  19901100
R723MCAA  EQU  X'40'    RCAA data not available                   @C1A  19901200
*                       RC 08/RSN 0831 from IWMRCOLL              @C1A  19901300
R723MPOL  EQU  X'20'    SVPOL data not available                  @C1A  19901400
R723MOVE  EQU  X'10'    System is calculating velocity using      @E2A  19901400
*                       I/O delays.                               @E2A          
R723MCPP  EQU  X'08'    Indicator for CPU protection              @I2A          
R723MSTP  EQU  X'04'    Indicator for Storage protection          @I2A          
R723MDAT  EQU  X'02'    Indicator for dynamic alias tuning        @I2A          
R723MRS1  EQU  X'01'    Reserved                                  @I2C  19901500
R723MRS2  DS   BL3      Reserved                                  @C1A  19901600
R723MNSP  DS   CL8      Service policy name                       @C1A  19901700
R723MDSP  DS   CL32     Service policy description                @C1A  19901800
R723MTPA  DS   CL8      Local time/date (STCK format) of policy   @C1A  19901900
*                       activation                                @C1A  19902000
R723MCPU  DS   BL4      CPU service coefficient * 10,000          @C1A  19902100
*                       the number by which accumulated CPU       @C1A  19902200
*                       service units will be multiplied          @C1A  19902300
*                       weighted (SVPOLCPU)                       @C1A  19902400
R723MIOC  DS   BL4      I/O service coefficient * 10,000          @C1A  19902500
*                       the number by which accumulated I/O       @C1A  19902600
*                       service units will be multiplied          @C1A  19902700
*                       weighted (SVPOLIOC)                       @C1A  19902800
R723MMSO  DS   BL4      Storage service coefficient * 10,000      @C1A  19902900
*                       the number by which accumulated storage   @C1A  19903000
*                       service units will be multiplied          @C1A  19903100
*                       weighted (SVPOLMSO)                       @C1A  19903200
R723MSRB  DS   BL4      SRB service coefficient * 10,000          @C1A  19903300
*                       the number by which accumulated SRB       @C1A  19903400
*                       service units will be multiplied          @C1A  19903500
*                       weighted (SVPOLSRB)                       @C1A  19903600
R723MTVL  DS   BL4      Current sample interval (in milliseconds) @C1A  19903700
*                       This is the frequency with which WLM      @C1A  19903800
*                       samples delays reported in the RCAA       @C1A  19903900
R723MTV#  DS   BL4      Total number of times WLM sampling code   @C1A  19904000
*                       ran.  RMF issuing successive calls to     @C1A  19904100
*                       IWMRCOLL should not assume that WLM       @C1A  19904200
*                       sampling code ran at the interval         @C1A  19904300
*                       specified by R723MTVL between its calls.  @C1A  19904400
*                       This field can be used to translate       @C1A  19904500
*                       sampled state data into actual percentage @C1A  19904600
*                       of time                                   @C1A  19904700
R723MOPT  DS   CL2      OPT member suffix (from RCAAOPT)          @C1A  19904800
R723MRS3  DS   CL2      Reserved                                  @C1A  19904900
R723MWNM  DS   CL8      Workload group name                       @C1A  19905000
R723MWDE  DS   CL32     Workload group description                @C1A  19905100
R723MCNM  DS   CL8      Service/Report class name                 @C1A  19905200
R723MCDE  DS   CL32     Service/Report class description          @C1A  19905300
R723MCPG  DS   BL2      Number of service class periods           @C1A  19905400
*                       belonging to this service class.          @C1A  19905500
*                       Zero if report class.                     @C1A  19905600
R723MSUB  DS   BL1      Number of entries belonging to a          @C1A  19905700
*                       subsystem. (See R723MSEC for current      @C1A  19905800
*                       release value).                           @C1A  19905900
R723MRS4  DS   BL3      Reserved                                  @C1A  19906000
R723MERF  DS   CL6      ERV resource factor coefficient           @C1A  19906100
*                       (from RMPTOPE)                            @C1A  19906200
R723MADJ  DS   F        Value of RMCTADJC - adjustment factor     @C1A  19906300
*                       for CPU rate                              @C1A  19906400
R723MIDN  DS   CL8      Service definition name                   @C1A  19906500
R723MIDD  DS   CL32     Service definition description            @C1A  19906600
R723MTDI  DS   CL8      Local time/date (STCK format) the service @C1A  19906700
*                       definition was installed                  @C1A  19906800
R723MIDU  DS   CL8      Userid that installed the service         @C1A  19906900
*                       definition                                @C1A  19907000
R723MSEC  EQU  2        Number (constant) of entries belonging to @C1A  19907100
*                       a subsystem. In RMF510 this number is 2.  @C1A  19907200
*                       This number is kept in R723MSUB.          @C1A  19907300
          SPACE 3                                                       19907400
**********************  Service Classes being served  ***************** 19907500
          SPACE 3                                                       19907600
R723SSS  DSECT          Service classes being served by one or    @C1A  19907700
*                       more AS in service class R723MCNM         @C1A  19907800
R723SCSN  DS   CL8      Name of service class being served        @C1A  19907900
R723SCS#  DS   BL4      Number of times an AS running with this   @C1A  19908000
*                       service class (R723MCNM) served service   @C1A  19908100
*                       class (R723SCSN)                          @C1A  19908200
          SPACE 3                                                       19908300
**********************  Resource Group Data Section  ****************** 19908400
          SPACE 3                                                       19908500
R723RGS  DSECT                                                    @C1A  19908600
R723GGNM  DS   CL8      Resource group name                       @C1A  19908700
R723GGDE  DS   CL32     Resource group description                @C1A  19908800
R723GGLT  DS   BL1      Resource group flag bits                  @C1A  19908900
R723GMXS  EQU  X'80'    Maximum capacity was specified            @C1A  19909000
R723GMNS  EQU  X'40'    Minimum capacity was specified            @C1A  19909100
R723GRS1  EQU  X'3F'    Reserved                                  @C1A  19909200
R723GRS2  DS   BL3      Reserved                                  @C1A  19909300
R723GGMN  DS   F        If R723GMNS = ON, minimum capacity in     @C1A  19909400
*                       unweighted CPU service units per second   @C1A  19909500
R723GGMX  DS   F        If R723GMXS = ON, maximum capacity in     @C1A  19909600
*                       unweighted CPU service units per second   @C1A  19909700
          SPACE 3                                                       19909800
**********************  Service Class Period - GOALS  ***************** 19909900
          SPACE 3                                                       19910000
R723SCS  DSECT                                                    @C1A  19910100
R723CRTX  DS   BL2      Index into the response time distribution @C1A  19910200
*                       bucket. Entry 0 represents the            @C1A  19910300
*                       distribution map                          @C1A  19910400
R723CWMX  DS   BL2      Index into the work/resource manager      @C1A  19910500
*                       states area                               @C1A  19910600
R723CWMN  DS   BL2      Number of entries in the work/resource    @C1A  19910700
*                       manager states area associated with this  @C1A  19910800
*                       service class period (R723CWMX points to  @C1A  19910900
*                       the first entry)                          @C1A  19911000
R723CRS1  DS   BL1      reserved                                  @C1A  19911100
R723CADF  DS   BL1      Actuals data section flag                 @C1A  19911200
R723CRCA  EQU  X'80'    Resource consumption data actuals         @C1A  19911300
*                       (R723CRCD) are available                  @C1A  19911400
R723CRTA  EQU  X'40'    Response time data actuals (R723CRTD) are @C1A  19911500
*                       available                                 @C1A  19911600
R723CEDA  EQU  X'20'    General execution delay data actuals      @C1A  19911700
*                       (R723CGDE) are available                  @C1A  19911800
R723CRS5  EQU  X'1F'    Reserved                                  @C1A  06530002
R723COAL  DS   0C       Service class period goals            @WA05544  06540002
R723CPER  DS   BL1      Service class period number.              @C1A  19912000
R723CRTF  DS   BL1      Response time flags                       @C1A  19912100
R723CMIL  EQU  X'80'    Response time specified in milliseconds   @C1A  19912200
R723CSEC  EQU  X'40'    Response time specified in seconds        @C1A  19912300
R723CMIN  EQU  X'20'    Response time specified in minutes        @C1A  19912400
R723CHOU  EQU  X'10'    Response time specified in hours          @C1A  19912500
R723CRS2  EQU  X'0F'    Reserved                                  @C1A  19912600
R723CRGF  DS   BL1      Response time goal flags                  @C1A  19912700
R723CPRC  EQU  X'80'    Percentile response time goal             @C1A  19912800
R723CAVG  EQU  X'40'    Average response time goal                @C1A  19912900
R723CVEL  EQU  X'20'    Execution velocity goal                   @C1A  19913000
R723CDSC  EQU  X'10'    Discretionary goal                        @C1A  19913100
R723CSTM  EQU  X'08'    System specified goal                     @C1A  19913200
R723CRS3  EQU  X'07'    Reserved                                  @C1A  19913300
R723CRS4  DS   BL1      Reserved                                  @C1A  19913400
R723CVAL  DS   BL4      Response time goal - or                   @C1A  19913500
*                       Execution velocity goal - or zero if      @C1A  19913600
*                       discretionary, system, or no goal         @C1A  19913700
R723CPCT  DS   BL2      Goal percentile value                     @C1A  19913800
R723CIMP  DS   BL2      Relative importance of the goal to be     @C1A  19913900
*                       achieved for this service class period    @C1A  19914000
*                       (1=highest - 5=lowest)                    @C1A  19914100
R723CDUR  DS   BL4      Service class period duration in service  @C1A  19914200
*                       units, or zero for last period            @C1A  19914300
          SPACE 3                                                       19914400
**********************  SCP Resource Data - ACTUALS ******************* 19914500
          SPACE 3                                                       19914600
R723CRCD  DS   0D       Service class period resource data. All   @C1A  19914700
*                       service units are weighted by the         @C1A  19914800
*                       coefficients in the active policy         @C1A  19914900
          DS   0D                                                 @C1A  19915000
R723CSRV  DS   CL8      Total service units                       @C1A  19915100
*                       (floating point 64-bit long format)       @C1A  19915200
R723CCPU  DS   CL8      Total CPU service units                   @C1A  19915300
*                       (floating point 64-bit long format)       @C1A  19915400
R723CIOC  DS   CL8      Total I/O service units                   @C1A  19915500
*                       (floating point 64-bit long format)       @C1A  19915600
R723CMSO  DS   CL8      Total storage service units               @C1A  19915700
*                       (floating point 64-bit long format)       @C1A  19915800
R723CSRB  DS   CL8      Total SRB service units                   @C1A  19915900
*                       (floating point 64-bit long format)       @C1A  19916000
R723CPIR  DS   CL8      Total page-in count                       @C1A  19916100
*                       (floating point 64-bit long format)       @C1A  19916200
R723CHPI  DS   CL8      Total hiperspace page-in count            @C1A  19916300
*                       (floating point 64-bit long format)       @C1A  19916400
R723CBPI  DS   CL8      Total block page-in from aux count        @C1A  19916500
*                       (floating point 64-bit long format)       @C1A  19916600
R723CPIE  DS   CL8      Total page-in from expanded count         @C1A  19916700
*                       (floating point 64-bit long format)       @C1A  19916800
R723CBPE  DS   CL8      Total block page-in from expanded count   @C1A  19916900
*                       (floating point 64-bit long format)       @C1A  19917000
R723CBKA  DS   CL8      Total aux blocks paged in                 @C1A  19917100
*                       (floating point 64-bit long format)       @C1A  19917200
R723CBKE  DS   CL8      Total expanded blocks paged in            @C1A  19917300
*                       (floating point 64-bit long format)       @C1A  19917400
R723CPRS  DS   CL8      Total Page residency time                 @C1A  19917500
*                             (1024 microseconds)                 @C1A  19917600
*                       (floating point 64-bit long format)       @C1A  19917700
R723CERS  DS   CL8      Total Expanded page residency time        @C1A  19917800
*                             (1024 microseconds)                 @C1A  19917900
*                       (floating point 64-bit long format)       @C1A  19918000
R723CTRR  DS   CL8      Total in storage residency time           @C1A  19918100
*                       (floating point 64-bit long format)       @C1A  19918200
R723CTAT  DS   CL8      Total transaction active time             @C1A  19918300
*                             (1024 microseconds)                 @C1A  19918400
*                       (floating point 64-bit long format)       @C1A  19918500
R723CRCT  DS   CL8      Total RCT time (microseconds)             @C1A  19918600
*                       (floating point 64-bit long format)       @C1A  19918700
R723CIIT  DS   CL8      Total I/O interrupt time (microseconds)   @C1A  19918800
*                       (floating point 64-bit long format)       @C1A  19918900
R723CHST  DS   CL8      Total hiperspace service time             @C1A  19919000
*                       (microseconds)                            @C1A  19919100
*                       (floating point 64-bit long format)       @C1A  19919200
R723CSWC  DS   F        Total swap count                          @C1A  19919300
R723CCRM  DS   F        Total hiperspace eso read miss count      @C1A  19919400
          SPACE 3                                                       19919500
**********************  SCP Response Time Data - ACTUALS  ************* 19919600
          SPACE 3                                                       19919700
          DS   0D                                                 @C1A  19919800
R723CRTD  DS   0D       Service class period response time data   @C1A  19919900
R723CRCP  DS   F        Count of transaction completions          @C1A  19920000
R723CARC  DS   F        Count of transaction completed            @C1A  19920100
*                       abnormally                                @C1A  19920200
R723CNCP  DS   F        Count of transactions that completed      @C1A  19920300
*                       their execution phase                     @C1A  19920400
R723CANC  DS   F        Count of transactions that completed      @C1A  19920500
*                       their execution phase abnormally          @C1A  19920600
R723CTET  DS   CL8      Total transaction elapsed time            @C1A  19920700
*                             (1024 microseconds)                 @C1A  19920800
*                       (floating point 64-bit long format)       @C1A  19920900
R723CXET  DS   CL8      Total transaction execution time          @C1A  19921000
*                             (1024 microseconds)                 @C1A  19921100
*                       (floating point 64-bit long format)       @C1A  19921200
R723CETS  DS   CL8      Sum of transaction elapsed times squared  @C1A  19921300
*                             (1024 microseconds)                 @C1A  19921400
*                       (floating point 64-bit long format)       @C1A  19921500
          SPACE 3                                                       19921600
**********************  SCP General Execution Delays - ACTUALS  ******* 19921700
          SPACE 3                                                       19921800
R723CGDE  DS   0D       General execution delays                  @C1A  19921900
R723CEVD  DS   0D       Execution velocity data                   @C1A  19922000
R723CCUS  DS   F        CPU using samples. These are included in        19922100
*                       R723CTOU                                  @E1C          
R723CTOT  DS   F        Total delay samples used in SRM's execution     19922200
*                       velocity calculation. With WLM's I/O support,           
*                       this includes also I/O delay samples.     @E1C          
R723CEDL  DS   0D       General execution delays                  @C1A  19922300
R723CCDE  DS   F        CPU delay                                 @C1A  19922400
R723CCCA  DS   F        CPU capping delay. A TCB or SRB is marked @C1A  19922500
*                       non-dispatchable because a resource group @C1A  19922600
*                       maximum is being enforced. Note that the  @C1A  19922700
*                       R723CCCA is NOT a subset of R723CCDE      @C1A  19922800
R723CSWI  DS   F        Swap-in delay                             @C1A  19922900
R723CMPL  DS   F        MPL delay                                 @C1A  19923000
R723CAPR  DS   F        Aux page from private                     @C1A  19923100
R723CACO  DS   F        Aux page from common                      @C1A  19923200
R723CAXM  DS   F        Aux page from cross memory                @C1A  19923300
R723CVIO  DS   F        Aux page from VIO                         @C1A  19923400
R723CHSP  DS   F        Aux page from standard hiperspaces        @C1A  19923500
R723CCHS  DS   F        Aux page from eso hiperspaces             @C1A  19923600
R723CUNK  DS   F        Unknown                                   @C1A  19923700
R723CIDL  DS   F        Idle                                      @C1A  19923800
R723CPDE  DS   F        Resource group capping count              @C1A  19923900
R723CPQU  DS   F        Quiesce count                             @C1A  19924000
R723CSAC  DS   F        Sampled address space count. Number of    @C1A  19924100
*                       address spaces that contributed delay     @C1A  19924200
*                       and using samples to this service class.  @C1A  19924300
*                       These samples are not included in         @C1A  19924400
*                       R723CTOT.                                 @C1A  07800002
R723CSRS  DS   CL8      Total shared page residency time                07800307
*                       (1024 microseconds)                             07800402
*                       Format: long floating point               @D1A  07800502
R723CSPA  DS   CL8      Total shared page-ins from auxiliary storage    07800607
*                       Format: long floating point               @D1A  07800702
R723CSPE  DS   CL8      Total shared page-ins from expanded storage     07800807
*                       Format: long floating point               @D1A  07801002
*                                                                               
**********************  Addition Resource Consumption   ***************         
*                                                                               
R723CICT  DS   CL8      Total DASD I/O connect time in 128 micro-               
*                       seconds. Format: long floating point      @E1A          
R723CIWT  DS   CL8      Total DASD I/O wait time (queue time + pending          
*                       time in 128 microsecond units.)                         
*                       Format: long floating point               @E1A          
R723CIDT  DS   CL8      Total DASD I/O disconnect time in 128 micro-            
*                       seconds. Note: Does not include IOS queue               
*                       time. Format: long floating point         @E1A          
R723CIRC  DS   F        Total DASD I/O count. This can be used with             
*                       the above fields (R723CICT, R723CIWT, and               
*                       R723CIDT) to determine the average DASD                 
*                       response time for a period.                             
*                       Format: long floating point               @E1A          
*                                                                               
**********************  Addition General Execution Delay  *************         
*                                                                               
R723CTOU  DS F        Total usings. Velocity should be calculated as            
*                     R723CTOU/(R723CTOU+R723CTOT)                @E1A          
R723CIOU  DS F        Total I/O usings. These are included in R723CTOU.         
*                     Only non-paging DASD I/Os can contribute to               
*                     I/O usings.                                 @E1A          
*                                                                               
* The following delay counters are included in R723CTOT                         
*                                                                               
R723CIOD  DS F        DASD I/O delay samples                      @E1A          
R723CQ    DS F        Queue delay samples. Work is waiting for a                
*                     server                                      @E1A          
R723CSPV  DS F        Server private area paging delay samples    @E1A          
R723CSVI  DS F        Server space VIO paging delay samples       @E1A          
R723CSHS  DS F        Server hiperspace paging delay samples      @E1A          
R723CSMP  DS F        Server MPL delay samples                    @E1A          
R723CSSW  DS F        Server swap-in delay samples                @E1A          
*                                                                               
R723CNDI  DS F        Non DASD I/O using or delay samples         @E1A          
R723CTDQ  DS F        Total delay samples always including batch                
*                     queue delay. For service classes that contain             
*                     batch jobs that were not run in WLM managed               
*                     initiators the batch queue delay samples are              
*                     derived from the measured batch queue delay               
*                     time. For service classes that contain jobs               
*                     that ran in WLM managed initiators this value             
*                     is the same as R723CTOT. R723CTDQ can be                  
*                     used as a migration aid to determine what a               
*                     batch service class period's velocity will be             
*                     if its jobs are run in WLM managed initators              
*                                                                 @F2A          
R723CTSA  DS CL8      Total execution samples. It is the sum of                 
*                     RCAETOTU, RCAETOTD, RCAEUNKN, and RCAEIDLE.               
*                     Also always includes I/O using/delay samples              
*                     whether or not I/O samples are included in                
*                     RCAETOTU or RCAETOTD, respectively.                       
*                     (long floating point)                       @F1A          
*                                                                               
**********************  WLM Batch support *****************************         
*                                                                               
R723CIOT  DS CL8      Total DASD IOS queue time in 128 microsecond              
*                     units (long floating point)                 @F1A          
R723CQDT  DS CL8      Total queue delay time. For batch jobs this               
*                     is the time jobs spent on the job queue while             
*                     eligible to run on some system. It represents             
*                     the time the jobs spent waiting for an                    
*                     initiator. For TSO users, this time can be a              
*                     portion of the LOGON process. For APPC this               
*                     is the time an APPC request spends on an APPC             
*                     queue. (long floating point in 1024 micro-                
*                     second units)                               @F1A          
R723CADT  DS CL8      Total time batch jobs were ineligible to run              
*                     because a resource the job had affinity to                
*                     was unavailable. Only applies to batch work.              
*                     Zero for other work types. (long floating                 
*                     point in 1024 microsecond units)            @F1A          
R723CCVT  DS CL8      Total time batch jobs spent in JCL conversion.            
*                     Only applies to batch work. Zero for other                
*                     work types. (long floating point in 1024                  
*                     microsecond units)                          @F1A          
R723CIQT  DS CL8      Total time batch jobs spend on job queue                  
*                     (after JCL conversion) while ineligible to                
*                     run on any system for reasons other than                  
*                     resource affinities. Only applies to batch                
*                     work. Zero for other work types. (long                    
*                     floating point in 1024 microsecond units)   @F1A          
R723CIEA  DS CL8      Independent enclave total transaction active              
*                     time (in 1024 microsecond units) for enclaves             
*                     that originated on this system.             @I1A          
R723CXEA  DS CL8      Exported enclave total transaction active                 
*                     time (in 1024 microsecond units).           @I1A          
R723CFEA  DS CL8      Foreign enclave total transaction active time             
*                     (in 1024 microsecond units).                @I1A          
          SPACE 3                                                       19924600
**********************  Response Time Distribution Map  *************** 19924700
          SPACE 3                                                       19924800
*********************************************************************** 19924900
*                                                                     * 19925000
*  Response Time Distribution Map and Counts Table (Subtype 3)        * 19925100
*                                                                     * 19925200
*  This table defines up to 9 entries (in RMF 4.4.0 each entry        * 19925300
*  represents 14 response time distribution buckets) where            * 19925400
*                                                                     * 19925500
*           entry 0 is always the MAP and is addressed by the offset  * 19925600
*                 in the header extension SMF72RTS                    * 19925700
*           entry 1 - 8 (max number of periods for a service class)   * 19925800
*                 are the the counts for an associated service class  * 19925900
*                 period and addressed by an index from the service   * 19926000
*                 class period data section R723CRTX                  * 19926100
*                                                                     * 19926200
*  The MAP is the first entry (0) in this table and defines           * 19926300
*  a maximum percentage of a goal (i.e. 50, 70, 200, etc.).           * 19926400
*  When used in conjunction with a following entry (1-8) it           * 19926500
*  shows the number of transactions that completed in a               * 19926600
*  percentage of a a goal. The last entry in the array                * 19926700
*  contains x'FFFFFFFF'. This indicates that this bucket              * 19926800
*  includes all transactions that completed with longer               * 19926900
*  response times than the previous bucket.                           * 19927000
*                                                                     * 19927100
*  Entries 1-8 contains the number of transactions that               * 19927200
*  completed in the time period represented by that entry.            * 19927300
*  When used with entry 0 it shows a distribution of                  * 19927400
*  completions verses goals specified.                            @C1A* 19927500
*                                                                     * 19927600
*********************************************************************** 19927700
R723RTS  DSECT                                                    @C1A  19927800
R723TRDB  DS   F        Response time distribution map and counts @C1A  19927900
R723TENT  EQU  14       Number of entries in an array. For RMF510 @C1A  19928000
*                       this number is 14                         @C1A  19928100
          SPACE 3                                                       19928200
**********************  Work Manager/Resource Manager States  ********* 19928300
          SPACE 3                                                       19928400
R723WRS  DSECT          Work/Resource manager states section      @C1A  19928500
R723RENT  DS   0D       Entry in the subsystem work manager delay       19928600
*                       array. In RMF510 there are always two     @C1A  19928700
*                       entries for a subsystem, one for the      @C1A  19928800
*                       Begin_to_End phase and one for the        @C1A  19928900
*                       Execution phase, where the BtE entry is   @C1A  19929000
*                       always be the first                       @C1A  19929100
R723RTYP  DS   CL4      Subsystem name                            @C1A  19929200
R723RFLG  DS   BL1      Work/Resource manager flags               @C1A  19929300
R723RDBE  EQU  X'80'    Represents states sampled in the                19929400
*                       begin-to-end phase                        @C1A  19929500
R723REXE  EQU  X'40'    Represents states sampled in the          @C1A  19929600
*                       execution phase                           @C1A  19929700
R723RRS1  EQU  X'3F'    Reserved                                  @C1A  19929800
R723RRS2  DS   BL3      Reserved                                  @C1A  19929900
R723RESS  DS   F        Total number of transaction states              19930000
*                       sampled                                   @C1A  19930100
R723RACT  DS   F        Total number of active state samples      @C1A  19930200
R723RRDY  DS   F        Total number of ready state samples       @C1A  19930300
R723RIDL  DS   F        Total number of idle state samples. Idle  @C1A  19930400
*                       indicates that no work request is         @C1A  19930500
*                       available to the work manager that is     @C1A  19930600
*                       allowed to run.                           @C1A  19930700
R723RWLO  DS   F        Total number of waiting for lock state          19930800
*                       samples                                   @C1A  19930900
R723RWIO  DS   F        Total number of waiting for I/O state           19931000
*                       samples                                   @C1A  19931100
R723RWCO  DS   F        Total number of waiting for conversation        19931200
*                       state samples                             @C1A  19931300
R723RWDS  DS   F        Total number of waiting for distributed         19931400
*                       request state samples                     @C1A  19931500
R723RWSL  DS   F        Waiting for a session to be established         19931600
*                       locally                                   @C1A  19931700
R723RWSN  DS   F        Waiting for a session to be established         19931800
*                       somewhere in the network                  @C1A  19931900
R723RWSS  DS   F        Waiting for a session to be established         19932000
*                       somewhere in the sysplex                  @C1A  19932100
R723RWTM  DS   F        Waiting for a timer                       @C1A  19932200
R723RWO   DS   F        Waiting for another product               @C1A  19932300
R723RWMS  DS   F        Waiting for unidentified resource         @C1A  19932400
R723RSSL  DS   F        State representing transactions for             19932500
*                       which there are logical continuations           19932600
*                       on this MVS image                         @C1A  19932700
R723RSSS  DS   F        State representing transactions for             19932800
*                       which there are logical continuations           19932900
*                       on another MVS image in the sysplex       @C1A  19933000
R723RSSN  DS   F        State representing transactions for             19933100
*                       which there are logical continuations           19933200
*                       somewhere within the network              @C1A  19933300
*                                                                               
* Reserved fields                                                               
*                                                                               
          DS   F        Reserved                                  @E1A  19933100
          DS   F        Reserved                                  @E1A  19933100
          DS   F        Reserved                                  @E1A  19933100
          DS   F        Reserved                                  @E1A  19933100
R723RWNL  DS   F        Total number of state samples reflecting        19933100
*                       waiting for new latch                     @E1A  19933200
          SPACE 3                                                       19933400
          AIF  ('&X' EQ 'O').SUBTYP4                              @C2A  19933500
          MEXIT                                                   @C2A  19933600
          SPACE 3                                                       19933700
.SUBTYP4  ANOP                                                    @C2A  19933800
**********************  Control Section for Subtype IV  *************** 19933900
**********************  Data Section  ********************************* 19934000
R724DATA DSECT                                                    @C2A  19934100
R724PNAM  DS   CL8      Name of active service policy             @C2A  19934200
R724PTM   DS   BL8      Time policy was activated                       19934300
*                       Format: STORE CLOCK, Unit: local time     @C2A  19934400
R724LCNM  DS   CL8      Service class name                        @C2A  19934500
R724PER#  DS   BL1      Service class period number               @C2A  19934600
          DS   BL3      Free for future use                       @C2A  19934700
R724USER  DS   BL4      Sum of all users found                    @C2A  19934800
R724ACTV  DS   BL4      Sum of all active users found             @C2A  19934900
R724ACTS  DS   BL4      Sum of all active samples (except OUTR)   @C2A  19935000
R724IDLS  DS   BL4      Sum of all idle samples                   @C2A  19935100
R724PAGE  DS   BL4      Sum of all users delayed for paging             19935200
*                       at all samples                            @C2A  19935300
R724SWAP  DS   BL4      Sum of all users delayed for swapping           19935400
*                       at all samples                            @C2A  19935500
R724OUTR  DS   BL4      Sum of all out and ready users                  19935600
*                       at all samples                            @C2A  19935700
R724PGIN  DS   BL4      Sum of all page-ins                       @C2A  19935800
R724DIVS  DS   BL4      Sum of all DIV samples                    @C2A  19935900
R724LSSA  DS   BL4      Total logically swapped samples for the group   19936000
*                                                                 @C2A  19936100
R724PSSA  DS   BL4      Total swapped samples for the group             19936200
*                       (except logical)                          @C2A  19936300
R724UPRO  DS   BL4      Total processor using samples for the group     19936400
*                                                                 @C2A  19936500
R724UDEV  DS   BL4      Total device using samples for the group  @C2A  19936600
R724DPRO  DS   BL4      Total processor delay samples for the group     19936700
*                                                                 @C2A  19936800
R724DDEV  DS   BL4      Total device delay samples for the group  @C2A  19936900
R724DSTO  DS   BL4      Total storage delay samples for the group @C2A  19937000
R724DJES  DS   BL4      Total JES delay samples for the group     @C2A  19937100
R724DHSM  DS   BL4      Total HSM delay samples for the group     @C2A  19937200
R724DXCF  DS   BL4      Total XCF delay samples for the group     @C2A  19937300
R724DENQ  DS   BL4      Total ENQ delay samples for the group     @C2A  19937400
R724DMNT  DS   BL4      Total mount delay samples for the group   @C2A  19937500
R724DMSG  DS   BL4      Total message delay samples for the group @C2A  19937600
R724UNKN  DS   BL4      Total unknown state samples for the group @C2A  19937700
R724VALD  DS   BL4      Total valid samples for the group               19937800
*                       (single state sum of all using, delay,          19937900
*                       idle and unknown)                         @C2A  19938000
R724LSCT  DS   BL4      Count of "long" logical swaps for the group     19938100
*                                                                 @C2A  19938200
R724ESCT  DS   BL4      Count of "long" swaps to expanded storage       19938300
*                       for the group                             @C2A  19938400
R724PSCT  DS   BL4      Count of "long" physical swaps for the group    19938500
*                                                                 @C2A  19938600
R724ACTF  DS   D        Sum of all active frames                        19938700
*                       Format: long floating point               @C2A  19938800
R724IDLE  DS   D        Sum of all idle frames                          19938900
*                       Format: long floating point               @C2A  19939000
R724SLOT  DS   D        Sum of all slots used                           19939100
*                       Format: long floating point               @C2A  19939200
R724DIV   DS   D        Sum of all DIV frames                           19939300
*                       Format: long floating point               @C2A  19939400
R724FIX   DS   D        Sum of all fixed frames                         19939500
*                       Format: long floating point               @C2A  19939600
R724LSCF  DS   D        Sum of all central frames for all logically     19939700
*                       swapped users at all samples                    19939800
*                       Format: long floating point               @C2A  19939900
R724LSEF  DS   D        Sum of all expanded frames for all logically    19940000
*                       swapped users at all samples.                   19940100
*                       Format: long floating point               @C2A  19940200
R724PSEF  DS   D        Sum of all expanded frames for all swapped      19940300
*                       users (except logical) at all samples.          19940400
*                       Format: long floating point               @C2A  19940500
R724VECT  DS   D        Total vector utilization time for the group     19940600
*                       Format: long floating point                     19940700
*                       Unit: microseconds                        @C2A  19940800
R724ET    DS   D        Total elapsed time for all transactions         19940900
*                       that ended in the group. Does not include       19941000
*                       queued time.                                    19941100
*                       Format: long floating point                     19941200
*                       Unit: microseconds                        @C2A  19941300
R724QT    DS   D        Total time spent on JES or APPC queues by       19941400
*                       all transactions that ended in the group        19941500
*                       Format: long floating point                     19941600
*                       Unit: microseconds                        @C2A  19941700
R724END   DS   D        The number of transactions that ended in        19941800
*                       the group                                       19941900
*                       Format: long floating point                     19942000
*                       Unit: microseconds                        @C2A  09560002
R724TSV   DS   CL8      Sum of shared page views                        09560107
*                       Format: long floating point               @D1A  09560202
R724VIN   DS   CL8      Sum of shared pages in central storage, that    09560307
*                       are valid                                       09560402
*                       Format: long floating point               @D1A  09560502
R724VLC   DS   CL8      Sum of shared page validations                  09560607
*                       Format: long floating point               @D1A  09560702
R724GPI   DS   CL8      Sum of shared page-ins from auxiliary storage   09560807
*                       Format: long floating point               @D1A  09561002
          SPACE 3                                                       19942200
**********************  Swap reason data section  ********************* 19942300
R724SWRE DSECT                                                    @C2A  19942400
R724OR1   DS   BL4      STOR/OUTR delay samples for swap reason 1:      19942500
*                       Terminal output wait                  @WA03905  19942652
R724OR2   DS   BL4      STOR/OUTR delay samples for swap reason 2:      19942700
*                       Terminal input wait                   @WA03905  19942852
R724OR3   DS   BL4      STOR/OUTR delay samples for swap reason 3:      19942900
*                       Long wait                                 @C2A  19943000
R724OR4   DS   BL4      STOR/OUTR delay samples for swap reason 4:      19943100
*                       Auxiliary storage shortage                @C2A  19943200
R724OR5   DS   BL4      STOR/OUTR delay samples for swap reason 5:      19943300
*                       Real storage shortage                     @C2A  19943400
R724OR6   DS   BL4      STOR/OUTR delay samples for swap reason 6:      19943500
*                       Detected long wait                        @C2A  19943600
R724OR7   DS   BL4      STOR/OUTR delay samples for swap reason 7:      19943700
*                       Requested swap                            @C2A  19943800
R724OR8   DS   BL4      STOR/OUTR delay samples for swap reason 8:      19943900
*                       Enqueue exchange swap                     @C2A  19944000
R724OR9   DS   BL4      STOR/OUTR delay samples for swap reason 9:      19944100
*                       Exchange swap                             @C2A  19944200
R724OR10  DS   BL4      STOR/OUTR delay samples for swap reason 10:     19944300
*                       Unilateral swap                           @C2A  19944400
R724OR11  DS   BL4      STOR/OUTR delay samples for swap reason 11:     19944500
*                       Transition swap                           @C2A  19944600
R724OR12  DS   BL4      STOR/OUTR delay samples for swap reason 12:     19944700
*                       Improve central storage usage             @C2A  19944800
R724OR13  DS   BL4      STOR/OUTR delay samples for swap reason 13:     19944900
*                       Improve system paging rate                @C2A  19945000
R724OR14  DS   BL4      STOR/OUTR delay samples for swap reason 14:     19945100
*                       Make room for an out too long user        @C2A  19945200
R724OR15  DS   BL4      STOR/OUTR delay samples for swap reason 15:     19945300
*                       APPC wait                                 @C2A  19945400
R724OR16  DS   BL4      STOR/OUTR delay samples for swap reason 16:     19945500
*                       OMVS input wait                           @C2A  19945600
R724OR17  DS   BL4      STOR/OUTR delay samples for swap reason 17:     19945700
*                       OMVS output wait                          @C2A  19945800
          SPACE 3                                                       19945900
         MEND  ,                                                        19950000
*                       */                                              20000000
 %PLAS72:;                                                     /*@W1C*/ 20050000
*    /* COMMON SMF HEADER */                                            20100000
*?ERBHDR TYPE(72) ATTRIBUT(BASED(SMF72PTR));                            09990002
*   @SPACE;                       /*                         @WA05544*/ 10000002
*      2 SMF72HDX,                /* HEADER EXTENTION        @WA05544*/ 10010002
*    /* INDIVIDUAL HEADER EXTENTION */                                  20200000
*%IF IFAR721 = 'YES' %THEN %GOTO LHDX1; /* Subtype 1             @C4A*/ 20212500
*%IF IFAR722 = 'YES' %THEN %GOTO LHDX1; /* Subtype 2 (same as 1) @C4A*/ 20225000
*%IF IFAR723 = 'YES' %THEN %GOTO LHDX3; /* Subtype 3             @C1A*/ 20237500
*%IF IFAR724 = 'YES' %THEN %GOTO LHDX4; /* Subtype 4             @C2A*/ 20250000
*%LHDX1:;                                                    /*  @C4A*/ 20262500
*        3 SMF72WLS FIXED(31),    /* Offset to workload control         20300000
*                                    section (subytpe 1) or offset      20350000
*                                    to performance group/domain        20400000
*                                    control section (subtype 2)     */ 20450000
*        3 SMF72WLL FIXED(15),    /* Length of workload control         20500000
*                                    section (subytpe 1) or length      20550000
*                                    of performance group/domain        20600000
*                                    control section (subtype 2)     */ 20650000
*        3 SMF72WLN FIXED(15),    /* Number of workload control         20700000
*                                    sections (subytpe 1) or length     20750000
*                                    of performance group/domain        20800000
*                                    control sections (subtype 2)    */ 20850000
*        3 SMF72PGS FIXED(31),    /* Offset to performance group        20900000
*                                    period data section (subtype 1)    20950000
*                                    or offset to performance group/    21000000
*                                    domain control section             21050000
*                                    (subtype 2)                     */ 21100000
*        3 SMF72PGL FIXED(15),    /* Length of performance group        21150000
*                                    period data section (subtype 1)    21200000
*                                    or length of performance group/    21250000
*                                    domain control section             21300000
*                                    (subtype 2)                     */ 21350000
*        3 SMF72PGN FIXED(15)     /* Number of performance group        21400000
*                                    period data sections (subtype 1)   21450000
*                                    or number of performance group/    21500000
*                                    domain control sections            21550000
*                                    (subtype 2)                 @B1C*/ 21600000
*                                                                       21641600
*%IF IFAR722 ^= 'YES' %THEN %GOTO LHDX30; /* Not subtype 2       @C4C*/ 21683200
*/* Individual header extension for subtype 2                    @C4A*/ 21724800
*@SPACE;                                                                21766400
*                            ,    /* Continuation of SMF72HDX    @C4C*/ 21808000
*        3 SMF72SWS FIXED(31),    /* Offset to swap reason data         21850000
*                                    section (subtype 2 only)    @B1A*/ 21900000
*        3 SMF72SWL FIXED(15),    /* Length of swap reason data         21950000
*                                    section (subtype 2 only)    @B1A*/ 22000000
*        3 SMF72SWN FIXED(15)     /* Number of swap reason data         22050000
*                                    sections (subtype 2 only)   @B1A*/ 22100000
*                                                            /* 2@C4D*/ 22107100
*%LHDX30:;                                                   /*  @C4A*/ 22114200
                             ;    /* End of SMF72HDX             @C4A*/ 22121300
*%LHDX3:;                                                    /*  @C4A*/ 22128400
*%IF IFAR723 ^= 'YES' %THEN %GOTO LHDX4; /* Not subtype 3        @C4A*/ 22135500
*/* Individual header extension for subtype 3                    @C4A*/ 22142600
*@SPACE;                                                                22150000
*%IF IFAR721 = 'YES' | IFAR722 = 'YES' %THEN %DO;        /*  @WA05544*/ 10530002
*/*  Subtypes 1 or 2 are also included                           @C4A*/ 10540002
*                                                                       10550002
*   DECLARE                                                             10560002
*    1 SMF723HX DEFINED(SMF72HDX),/* Subtype 3 header extension  @C4A*/ 10570002
*%END;                                                   /*  @WA05544*/ 10580002
*%ELSE %DO;                                              /*  @WA05544*/ 10590002
*                                                                       10600002
*      3 SMF723HX,                /* Subtype 3 header extension  @C4A*/ 10610002
*%END;                                                   /*  @WA05544*/ 10611002
*                                                            /*  @C4D*/ 10612002
*        5 SMF72WMS FIXED(31),    /* Offset to workload manager         10613002
*                                    control section (subtype3)  @C1A*/ 10614002
*        5 SMF72WML FIXED(15),    /* Length of workload manager         10615002
*                                    control section                    22173800
*                                    (subtype 3)                 @C1A*/ 22175500
*        5 SMF72WMN FIXED(15),    /* Number of workload manager         10618002
*                                    control sections                   22178900
*                                    (subtype 3)                 @C1C*/ 22180600
*        5 SMF72SSS FIXED(31),    /* Offset to service class            10630002
*                                    served data (subtype 3)     @C1A*/ 22184000
*        5 SMF72SSL FIXED(15),    /* Length of service class            10650002
*                                    served data (subtype 3)     @C1A*/ 22187400
*        5 SMF72SSN FIXED(15),    /* Number of service class            10670002
*                                    served data (subtype 3)     @C1A*/ 22190800
*        5 SMF72RGS FIXED(31),    /* Offset to resource group data      10690002
*                                    section (subtype 3)         @C1A*/ 22194200
*        5 SMF72RGL FIXED(15),    /* Length of resource group data      10710002
*                                    section (subtype 3)         @C1A*/ 22197600
*        5 SMF72RGN FIXED(15),    /* Number of resource group data      10730002
*                                    sections (subtype 3)        @C1A*/ 22201000
*        5 SMF72SCS FIXED(31),    /* Offset to service class period     10750002
*                                    data section (subtype 3)    @C1A*/ 22204400
*        5 SMF72SCL FIXED(15),    /* Length of service class period     10770002
*                                    data section (subtype 3)    @C1A*/ 22207800
*        5 SMF72SCN FIXED(15),    /* Number of service class period     10790002
*                                    data section (subtype 3)    @C1A*/ 22211200
*        5 SMF72RTS FIXED(31),    /* Offset to response time            10810002
*                                    distribution bucket data section   22214600
*                                    (subtype 3)                 @C1A*/ 22216300
*        5 SMF72RTL FIXED(15),    /* Length of response time            10840002
*                                    distribution bucket data section   22219700
*                                    (subtype 3)                 @C1A*/ 22221400
*        5 SMF72RTN FIXED(15),    /* Number of response time            10870002
*                                    distribution bucket data sections  22224800
*                                    (subtype 3)                 @C1A*/ 22226500
*        5 SMF72WRS FIXED(31),    /* Offset to work/resource manager    10900002
*                                    state (subtype 3)           @C1A*/ 22229900
*        5 SMF72WRL FIXED(15),    /* Length of work/resource manager    10920002
*                                    state (subtype 3)           @C1A*/ 22233300
*        5 SMF72WRN FIXED(15);    /* Number of work/resource manager    10940002
*                                    state (subtype 3)           @C4C*/ 22236700
*                                                            /* 3@C4D*/ 22238400
*%LHDX4:;                                                    /*  @C4A*/ 22240100
*%IF IFAR724 ^= 'YES' %THEN %GOTO LPRO; /* Not subtype 4         @C4A*/ 22241800
*/* Individual header extension for subtype 4                    @C4A*/ 22243500
*%IF IFAR721 = 'YES' | IFAR722 = 'YES' %THEN %DO;     /*     @WA05544*/ 11000002
*/*  Subtypes 1 or 2 are also included                       @WA05544*/ 11010002
*                                                                       11020002
*   DECLARE                                                             11030002
*    1 SMF724HX DEFINED(SMF72HDX),/* Subtype 4 header ext    @WA05544*/ 11040002
*%END;                                                /*     @WA05544*/ 11050002
*%ELSE %DO;                                           /*     @WA05544*/ 11060002
*                                                                       22267300
*      3 SMF724HX,                /* Subtype 4 header ext    @WA05544*/ 11071002
*%END;                                                /*     @WA05544*/ 11072002
*        5 SMF72CPS FIXED(31),    /* Offset to service class period     11073002
*                                    data sections (subtype4)    @C2A*/ 22275800
*        5 SMF72CPL FIXED(15),    /* Length of service class period     11075002
*                                    data sections (subtype4)    @C2A*/ 22279200
*        5 SMF72CPN FIXED(15),    /* Number of service class period     11077002
*                                    data sections (subtype4)    @C2A*/ 22282600
*        5 SMF72SPS FIXED(31),    /* Offset to swap reason data         11079002
*                                    sections (subtype 4)        @C2A*/ 22286000
*        5 SMF72SPL FIXED(15),    /* Length of swap reason data         11090002
*                                    sections (subtype 4)        @C2A*/ 22289400
*        5 SMF72SPN FIXED(15);    /* Number of swap reason data         11110002
*                                    sections (subtype 4)        @C4C*/ 22292800
*@SPACE;                                                                22294500
 %LPRO:;                                                      /* @C1C*/ 22296200
*                                                             /* @C4D*/ 22297900
*    /* COMMON RMF PRODUCT SECTION */                                   22300000
*?ERBPRO TYPE(72) ATTRIBUT(BASED(ADDR(SMF72HDR)+SMF72PRS));             22350000
 @SPACE;                                                                22400000
 %IF IFAR721 = 'YES' %THEN %GOTO LR721;                      /* @C1A*/  22425000
 %IF IFAR722 = 'YES' %THEN %GOTO LR722;                       /*@W1A*/  22450000
 %IF IFAR723 = 'YES' %THEN %GOTO LR723;                      /* @C1A*/  22466600
 %IF IFAR724 = 'YES' %THEN %GOTO LR724;                      /* @C2A*/  22483200
 %LR721:;                                                     /*@W1A*/  22500000
 @SPACE;                                                                22550000
     /* Control Section for Subtype I                               */  22600000
*    /* WORKLOAD CONTROL SECTION */                                     22650000
*   DCL 1 SMF72CTL BASED(ADDR(SMF72HDR)+SMF72WLS),                      22700000
*        3 SMF72FG1 BIT(8),       /* FLAGS                           */ 22750000
*         4 *        BIT(3),      /* Reserved                    @F1C*/ 11290002
*         4 SMF72OVE BIT(1),      /* x'10' WLM I/O Priority Mgmt @F1A*/ 11290002
*         4 SMF72CAA BIT(1),      /* x'08' RCAA data not available,     22810000
*                                          RC 08/RSN 0831 from IWMRCOLL 22840000
*                                                                @C1A*/ 22870000
*         4 SMF72ACN BIT(1),      /* x'04' Account information          22900000
*                                          used                  @R0C*/ 22930000
*         4 SMF72RPT BIT(1),      /* x'02' Report Class              */ 22960000
*         4 SMF72CHF BIT(1),      /* x'01' Change to performance        22990000
*                                    sensitive variable was made     */ 23020000
*        3 SMF72RV3 BIT(8),       /* RESERVED                        */ 23050000
*        3 SMF72SUB CHAR(2),      /* SUB-CATEGORY CODE, PERF.GROUP # */ 23100000
*        3 SMF72HPG FIXED(15),    /* HIGHEST PERF GP # DEFINED IN IPS*/ 23150000
*        3 SMF72IPS CHAR(8),      /* NAME OF IPS(INSTAL PERF SPEC)   */ 23200000
*        3 *        CHAR(3),      /* Reserved                           23250000
*                                                                @A2C*/ 23300000
*        3 *        CHAR(3),      /* Reserved                           23350000
*                                                                @A2C*/ 23400000
*        3 SMF72ERF CHAR(6),      /* ERV RESOURCE MANAGER               23450000
*                                    COEFFICIENT                     */ 23500000
*        3 SMF72ISD CHAR(4),      /* IOC SERVICE DEFINITION             23550000
*                                    COEFFICIENT                     */ 23600000
*        3 SMF72CSD CHAR(4),      /* CPU SERVICE DEFINITION             23650000
*                                    COEFFICIENT                     */ 23700000
*        3 SMF72RV4 CHAR(4),      /* RESERVED SINCE RMF 4.2.0    @Y1C*/ 23750000
*                                                             /* @Y1D*/ 23800000
*        3 SMF72SSD CHAR(4),      /* SRB SERVICE DEFINITION             23850000
*                                    COEFFICIENT                     */ 23900000
*        3 SMF72OPT CHAR(8),      /* OPT MEMBER NAME                 */ 23950000
*        3 SMF72ICS CHAR(8),      /* ICS MEMBER NAME                 */ 24000000
*        3 SMF72SYS CHAR(4),      /* SUBSYSTEM FOR THIS PGN          */ 24050000
*        3 SMF72CLS CHAR(10),     /* CLASS FOR THIS PGN              */ 24100000
*        3 SMF72USR CHAR(10),     /* USERID FOR THIS PGN             */ 24150000
*        3 SMF72NAM CHAR(10),     /* TRANSACTION NAME FOR THIS PGN   */ 24200000
*        3 SMF72ADJ FIXED(31),    /* VALUE OF RMCTADJC           @P1A*/ 24250000
*        3 SMF72MSD CHAR(8),      /* MSO SERVICE COEFFICIENT     @C3C*/ 24270000
*        3 SMF72SRV CHAR(10),     /* Service class (SRVCLASS) as        24290000
*                                    specified in ICSMSRVC       @C3A*/ 24310000
*        3 SMF72RV5 CHAR(2);      /* Reserved                    @C3A*/ 24330000
*    /* PERFORMANCE GROUP PERIOD DATA */                                24350000
*   %IF SMFARRAY = 'YES' %THEN %GOTO ARR72;                             24400000
*   DCL 1 SMF72PGP BASED(ADDR(SMF72HDR)+SMF72PGS),                      24450000
*       %GOTO CONT72;                                                   24500000
*%ARR72:;                                                               24550000
*   DCL 1 SMF72PGP(*) BASED(ADDR(SMF72HDR)+SMF72PGS),                   24600000
*%CONT72:;                                                              11730002
*       2 SMF72WKL,               /*                         @WA05544*/ 11740002
*        3 SMF72TTX FIXED(32),    /* # OF TERMINATED TRANSACTIONS    */ 24700000
*        3 SMF72ACT FIXED(32),    /*ALL TRANS ACTIVE TIME-1K MIC SEC */ 24750000
*        3 SMF72SER FIXED(32),    /* ALL TRANS SERVICE UNITS         */ 24800000
*        3 SMF72TTM FIXED(32),    /*TERM TRANS ELAPSED TIME-1K MICSEC*/ 24850000
*        3 *        FIXED(31),    /* Now reserved (WLL up to 4.2.0)  */ 24900000
*        3 SMF72MTS FIXED(32),    /* MSO TOTAL SERVICE               */ 24950000
*        3 SMF72ITS FIXED(32),    /* I/O TOTAL SERVICE               */ 25000000
*        3 SMF72CTS FIXED(32),    /* CPU TOTAL SERVICE               */ 25050000
*        3 SMF72TAT FIXED(32),    /* TRANSACTION                        25100000
*                                    ACTIVE TIME IN                     25150000
*                                    STORAGE                         */ 25200000
*        3 SMF72SPP FIXED(32),    /* NO. SWAPS IN PERIOD             */ 25250000
*        3 SMF72CDN FIXED(16),    /* CURRENT DOMAIN NO.              */ 25300000
*        3 *        BIT(8),       /* Reserved                    @A2C*/ 25350000
*        3 SMF72TSG BIT(8),       /* TIME SLICE GRP NUMBER           */ 25400000
*        3 SMF72STS FIXED(32),    /* SRB TOTAL SERVICE               */ 25450000
*        3 SMF72ETS,              /* SUM-SQUARES ENDED TRANS         */ 25500000
*          4 SMF72ET1 FIXED(32),  /* WORD 1                          */ 25550000
*          4 SMF72ET2 FIXED(32),  /* WORD 2                          */ 25600000
*        3 SMF72PIN FIXED(32),    /* NUMBER OF PAGE-INS          @R0A*/ 25650000
*        3 SMF72FRS,              /* ACTIVE FRAME-TIME           @R0A*/ 25700000
*          4 SMF72FT1 FIXED(32),  /* WORD 1                      @R0A*/ 25750000
*          4 SMF72FT2 FIXED(32),  /* WORD 2                      @W2C*/ 25800000
*        3 SMF72HIN FIXED(32),    /* Num of hiperspace page-ins  @W2A*/ 25850000
*        3 SMF72HRM FIXED(32),    /* Num of hiperspace read miss @W2A*/ 25900000
*        3 SMF72BPI FIXED(32),    /* Number of blocked pages paged in.  25950000
*                                                                @A2A*/ 26000000
*        3 SMF72PIE FIXED(32),    /* Single pages in from expanded,     26050000
*                                    incl 1st page of each block @A2A*/ 26100000
*        3 SMF72BPE FIXED(32),    /* Blocked pages in from expanded,    26150000
*                                    not including 1st page      @A2A*/ 26200000
*        3 SMF72BKA FIXED(32),    /* Number of blocks paged in from     26250000
*                                    AUX                         @A2A*/ 26300000
*        3 SMF72BKE FIXED(32),    /* Number of blocks paged in from     26350000
*                                    expanded                    @A2A*/ 26400000
*        3 SMF72ERS,              /* Expanded storage frame residency   26450000
*                                    time                               26500000
*                                    Units: 1024 Microseconds    @A2A*/ 26550000
*          4 SMF72ER1 FIXED(32),  /* Word 1 of residency time    @A2A*/ 26600000
*          4 SMF72ER2 FIXED(32),  /* Word 2 of residency time    @A2A*/ 26650000
*        3 SMF72RCT FIXED(32),    /* Region Control Task time           26700000
*                                    Units: Microseconds         @A2A*/ 26750000
*        3 SMF72IIT FIXED(32),    /* I/O interrupt process. time        26800000
*                                    Units: Microseconds         @A2A*/ 26850000
*        3 SMF72HST FIXED(32),    /* Hiperspace service time            26900000
*                                    Units: Microseconds         @A2A*/ 26950000
*        3 SMF72TST FIXED(32),    /* Total system transaction time      27000000
*                                    of ended transactions              27050000
*                                    Units: 1024 Microseconds    @C1C*/ 27067800
*        3 SMF72VEL,              /* Execution velocity data     @C1A*/ 27085600
*          5 SMF72CUS FIXED(32),  /* CPU using samples. These are       27103400
*                                    included in SMF72TOU.       @E1C*/         
*          5 SMF72TOT FIXED(32),  /* Total delay samples used in        12260002
*                                    SRM's execution velocity           27139000
*                                    calculation. With WLM's I/O        12280002
*                                    support, this also includes        12280002
*                                    I/O delay samples, if SMF72OVE             
*                                    is true.                    @F1C*/         
*        ?ERBFITEM(3 SMF72SRS) FLOAT(56);, /* Total                     12280106
*                                    shared page residency              12280202
*                                    time (1024 microseconds)           12280302
*                                    (long floating point)       @D1A*/ 12280402
*        ?ERBFITEM(3 SMF72SPA) FLOAT(56);, /* Total shared page-ins     12280502
*                                    from auxiliary storage             12280602
*                                    (long floating point)       @D1A*/ 12280702
*        ?ERBFITEM(3 SMF72SPE) FLOAT(56);, /* Total shared page-ins     12280802
*                                    expanded storage                   12280902
*                                    (long floating point)       @E1C*/ 12281002
*        ?ERBFITEM(3 SMF72ICT) FLOAT(56);, /* Total DASD I/O connect    12280802
*                                    time in 128 microsecond units.     12280902
*                                    (long floating point)       @E1A*/ 12281002
*        ?ERBFITEM(3 SMF72IWT) FLOAT(56);, /* Total DASD I/O wait       12280802
*                                    time (queue time + pending time in 12280902
*                                    128 microsecond units. This field          
*                                    does not include IOS queue                 
*                                    time. (long floating point) @E1A*/ 12281002
*        ?ERBFITEM(3 SMF72IDT) FLOAT(56);, /* Total DASD I/O disconnect 12280802
*                                    time in 128 microsecond units.     12280902
*                                    (long floating point)       @E1A*/ 12281002
*        3 SMF72IRC FIXED(32),    /* Total DASD I/O count. This can be  12280802
*                                    used with the above fields         12280902
*                                    (SMF72ICT, SMF72IWT, and SMF72IDT)         
*                                    to determine the average DASD              
*                                    response time for the period.      12281002
*                                                                @E1A*/         
*        3 SMF72TOU FIXED(32),    /* Total usings. Velocity should              
*                                    be calculated as SMF72TOU /                
*                                    (SMF72TOU+SMF72TOT).        @E1A*/         
*        3 SMF72IOU FIXED(32),    /* Total I/O usings. These are                
*                                    included in SMF72TOU. Only non             
*                                    paging DASD I/O can contribute             
*                                    to I/O using                @E1A*/         
*        3 SMF72NDI FIXED(32),    /* Non DASD I/O using or delay @F1C*/         
*        3 SMF72IOD FIXED(32),    /* Total I/O delays.           @F1A*/         
*        ?ERBFITEM(3 SMF72TSA) FLOAT(56);, /*                                   
*                                    Total execution samples. It is             
*                                    the sum of RCAETOTU, RCAETOTD,             
*                                    RCAEUNKN, and RCAEIDLE.  Also              
*                                    always includes I/O                        
*                                    using/delay samples whether or             
*                                    not I/O samples are included               
*                                    in RCAETOTU or RCAETOTD,                   
*                                    respectively. (long floating               
*                                    point)                      @F1A*/         
*        ?ERBFITEM(3 SMF72IOT) FLOAT(56);, /*                                   
*                                    Total DASD IOS queue time in 128           
*                                    microsecond units (long floating           
*                                    point)                      @F1A*/         
*        3 SMF72QDT FIXED(32),    /* Total queue delay time. For                
*                                    batch jobs this is the time jobs           
*                                    spent on the job queue while               
*                                    eligible to run on some system.            
*                                    It represents the time the jobs            
*                                    spent waiting for an initiator.            
*                                    For TSO users, this time can be            
*                                    a portion of the LOGON process.            
*                                    For APPC this is the time an               
*                                    APPC request spends on an APPC             
*                                    queue. (long floating point in             
*                                    1024 micro- second units)   @F1A*/         
*        3 SMF72ADT FIXED(32),    /* Total time batch jobs were                 
*                                    ineligible to run because a                
*                                    resource the job had affinity to           
*                                    was unavailable. Only applies to           
*                                    batch work.  zero for other work           
*                                    types. (long floating point in             
*                                    1024 microsecond units)     @F1A*/         
*        3 SMF72CVT FIXED(32),    /* Total time batch jobs spent in             
*                                    JCL conversion.  Only applies to           
*                                    batch work. Zero for other work            
*                                    types. (long floating point in             
*                                    1024 microsecond units)     @F1A*/         
*        3 SMF72IQT FIXED(32),   /*  Total time batch jobs spend on             
*                                    job queue (after JCL conversion)           
*                                    while ineligible to run on any             
*                                    system for reasons other than              
*                                    resource affinities. Only                  
*                                    applies to batch work. Zero for            
*                                    other work types. (long floating           
*                                    point in 1024 microsecond units)           
*                                                                @I1C*/         
*        3 SMF72IEA FIXED(32),   /*  Independent enclave total                  
*                                    transaction active time (in                
*                                    1024 microsecond units) for                
*                                    enclaves that originated on                
*                                    this system.                @I1A*/         
*        3 SMF72XEA FIXED(32),   /*  Exported enclave total                     
*                                    transaction active time (in                
*                                    1024 microsecond units).    @I1A*/         
*        3 SMF72FEA FIXED(32);   /*  Foreign enclave total                      
*                                    transaction active time (in                
*                                    1024 microsecond units).    @I1A*/         
*%IF IFAR722 = 'YES' %THEN %GOTO LR722; /* Subtype 2 data        @C4A*/ 27174600
*%IF IFAR723 = 'YES' %THEN %GOTO LR723; /* Subtype 3 data        @C4A*/ 27192400
*%IF IFAR724 = 'YES' %THEN %GOTO LR724; /* Subtype 4 data        @C4A*/ 27210200
*%GOTO LR72END;                   /* Goto end of file            @C4A*/ 27228000
*@SPACE;                                                                27245800
*%LR722:;                                                      /*@W1A*/ 27263600
*                                                             /* @C4D*/ 27281400
 @SPACE;                                                                27300000
    /* Control Section for Subtype 2                                 */ 27350000
 DECLARE                                                                27400000
  1 R722WKL BASED(ADDR(SMF72HDR)+SMF72WLS),                    /*@W1A*/ 27450000
    3 R722TSR FIXED(16),            /* Total number of small records    27500000
                                       in interval               @W1A*/ 27550000
    3 *       CHAR(2),              /* Reserved for future use   @W1A*/ 27600000
    3 R722TOT FIXED(32),            /* Total number of data sections    27650000
                                       in interval               @W1A*/ 27700000
    3 R722NXT FIXED(32),            /* Number of data sections in       27750000
                                       following records         @W1A*/ 27800000
    3 R722IPS CHAR(8);              /* Name of IPS               @W1A*/ 27850000
 @SPACE;                                                                27900000
    /* Data Section                                                  */ 27950000
 DECLARE                                                                28000000
  1 R722DATA BASED(ADDR(SMF72HDR)+SMF72PGS),                   /*@W1A*/ 28050000
    3 R722PG   FIXED(15),           /* Performance group number  @W1A*/ 28100000
    3 R722DMN  FIXED(15),           /* Domain number             @W1A*/ 28150000
    3 R722CLR,                      /* This minor structure is          28200000
                                       cleared after a record is        28250000
                                       written.                  @W1A*/ 28300000
      5 R722USER FIXED(31),         /* Sum of all users found    @W1A*/ 28350000
      5 R722ACTV FIXED(31),         /* Sum of all active users found    28400000
                                                                 @W1A*/ 28450000
      5 R722PAGE FIXED(31),         /* Sum of all users delayed         28500000
                                       for paging at all samples.       28550000
                                                                 @B1C*/ 28600000
      5 R722SWAP FIXED(31),         /* Sum of all users delayed         28650000
                                       for swapping at all samples.     28700000
                                                                 @B1C*/ 28750000
      5 R722OUTR FIXED(31),         /* Sum of all out and ready         28800000
                                       users at all samples.     @B1C*/ 28850000
      5 R722ACTF FIXED(31),         /* Sum of all active frames.        28900000
                                       This field contains X'7FFFFFFF'  28950000
                                       if the value will not fit in     29000000
                                       the field.                       29050000
                                       The field R722ACFF contains      29100000
                                       the value in floating point.     29150000
                                                                 @B1C*/ 29200000
      5 R722ACTS FIXED(31),         /* Sum of all active samples        29250000
                                       (except OUTR)             @W1A*/ 29300000
      5 R722IDLE FIXED(31),         /* Sum of all idle frames           29350000
                                       This field contains X'7FFFFFFF'  29400000
                                       if the value will not fit in     29450000
                                       the field.                       29500000
                                       The field R722IDLF contains      29550000
                                       the value in floating point.     29600000
                                                                 @B1C*/ 29650000
      5 R722IDLS FIXED(31),         /* Sum of all idle samples   @W1A*/ 29700000
      5 R722PGIN FIXED(31),         /* Sum of all page-ins       @W1A*/ 29750000
      5 R722SLOT FIXED(31),         /* Sum of all slots used            29800000
                                       This field contains X'7FFFFFFF'  29850000
                                       if the value will not fit in     29900000
                                       the field.                       29950000
                                       The field R722SLTF contains      30000000
                                       the value in floating point.     30050000
                                                                 @B1C*/ 30100000
      5 R722DIV FIXED(31),          /* Sum of all DIV frames.           30150000
                                       This field contains X'7FFFFFFF'  30200000
                                       if the value will not fit in     30250000
                                       the field.                       30300000
                                       The field R722DIVF contains      30350000
                                       the value in floating point.     30400000
                                                                 @B1C*/ 30450000
      5 R722DIVS FIXED(31),         /* Sum of all DIV samples    @W1A*/ 30500000
      5 R722FIX FIXED(31),          /* Sum of all fixed frames          30550000
                                       This field contains X'7FFFFFFF'  30600000
                                       if the value will not fit in     30650000
                                       the field.                       30700000
                                       The field R722FIXF contains      30750000
                                       the value in floating point.     30800000
                                                                 @B1C*/ 30850000
      5 R722ET BIT(64),             /* Total elapsed time for all       30900000
                                       transactions that ended in       30950000
                                       the group. Does not include      31000000
                                       queued time.              @B1A*/ 31050000
      5 R722QT BIT(64),             /* Total time spent on JES or       31100000
                                       APPC queues by all transactions  31150000
                                       that ended in the group.  @B1A*/ 31200000
      5 R722END  FIXED(31),         /* The number of transactions       31250000
                                       that ended in the group.  @B1A*/ 31300000
      5 R722UPRO FIXED(31),         /* Total processor using samples    31350000
                                       for the group             @B1A*/ 31400000
      5 R722UDEV FIXED(31),         /* Total device using samples       31450000
                                       for the group             @B1A*/ 31500000
      5 R722DPRO FIXED(31),         /* Total processor delay samples    31550000
                                       for the group             @B1A*/ 31600000
      5 R722DDEV FIXED(31),         /* Total device delay samples       31650000
                                       for the group             @B1A*/ 31700000
      5 R722DSTO FIXED(31),         /* Total storage delay samples      31750000
                                       for the group             @B1A*/ 31800000
      5 R722DJES FIXED(31),         /* Total JES delay samples          31850000
                                       for the group             @B1A*/ 31900000
      5 R722DHSM FIXED(31),         /* Total HSM delay samples          31950000
                                       for the group             @B1A*/ 32000000
      5 R722DXCF FIXED(31),         /* Total XCF delay samples          32050000
                                       for the group             @B1A*/ 32100000
      5 R722DENQ FIXED(31),         /* Total ENQ delay samples          32150000
                                       for the group             @B1A*/ 32200000
      5 R722DMNT FIXED(31),         /* Total mount delay samples        32250000
                                       for the group             @B1A*/ 32300000
      5 R722DMSG FIXED(31),         /* Total message delay samples      32350000
                                       for the group             @B1A*/ 32400000
      5 R722UNKN FIXED(31),         /* Total unknown state samples      32450000
                                       for the group             @B1A*/ 32500000
      5 R722VALD FIXED(31),         /* Total valid samples for          32550000
                                       the group (single state sum      32600000
                                       of all using, delay, idle,       32650000
                                       and unknown)              @B1A*/ 32700000
      5 R722LSCT FIXED(31),         /* Count of "long" logical          32750000
                                       swaps for the group       @B1A*/ 32800000
      5 R722ESCT FIXED(31),         /* Count of "long" swaps to         32850000
                                       expanded storage for the group   32900000
                                                                 @B1A*/ 32950000
      5 R722PSCT FIXED(31),         /* Count of "long" physical         33000000
                                       swaps for the group       @B1A*/ 33050000
      5 R722LSCF CHAR(4),           /* Sum of all central frames        33100000
                                       for all logically swapped        33150000
                                       users at all samples.            33200000
                                       Floating point.           @B1A*/ 33250000
      5 R722LSEF CHAR(4),           /* Sum of all expanded frames       33300000
                                       for all logically swapped        33350000
                                       users at all samples.            33400000
                                       Floating point.           @B1A*/ 33450000
      5 R722LSSA FIXED(31),         /* Total logically swapped          33500000
                                       samples for the group     @B1A*/ 33550000
      5 R722PSEF CHAR(4),           /* Sum of all expanded frames       33600000
                                       for all swapped users (except    33650000
                                       logical) at all samples.         33700000
                                       Floating point.           @B1A*/ 33750000
      5 R722PSSA FIXED(31),         /* Total swapped samples for the    33800000
                                       group (except logical).   @B1A*/ 33850000
      5 R722VECT FIXED(31),         /* Total vector utilization         33900000
                                       time for the group.       @B1A*/ 33950000
      5 R722ACFF CHAR(4),           /* Sum of all active frames.        34000000
                                       Floating point.           @B1A*/ 34050000
      5 R722IDLF CHAR(4),           /* Sum of all idle frames.          34100000
                                       Floating point.           @B1A*/ 34150000
      5 R722SLTF CHAR(4),           /* Sum of all slots used            34200000
                                       Floating point.           @B1A*/ 34250000
      5 R722DIVF CHAR(4),           /* Sum of all DIV frames            34300000
                                       Floating point.           @B1A*/ 34350000
      5 R722FIXF CHAR(4),           /* Sum of all fixed frames.         13780002
                                       Floating point.           @B1A*/ 13790002
      ?ERBFITEM(5 R722TSV) FLOAT(56);, /* Sum of                        13790202
                                       shared page views                13790302
                                       (long floating point)     @D1A*/ 13790402
      ?ERBFITEM(5 R722VIN) FLOAT(56);, /* Sum of shared pages           13790502
                                       in central storage               13790602
                                       that are valid                   13790702
                                       (long floating point)     @D1A*/ 13790802
      ?ERBFITEM(5 R722VLC) FLOAT(56);, /* Sum of shared page            13790902
                                       validations                      13791002
                                       (long floating point)     @D1A*/ 13791102
      ?ERBFITEM(5 R722GPI) FLOAT(56);; /* Sum of shared page-ins        13791202
                                       from auxiliary storage           13791302
                                       (long floating point)     @D1A*/ 13792002
 @SPACE;                                                                34500000
    /* Swap reason data section                                      */ 34550000
 DECLARE                                                                34600000
  1 R722SWRE BASED(ADDR(SMF72HDR)+SMF72SWS),                  /* @B1A*/ 34650000
    3 R722OR1  FIXED(31),           /* STOR/OUTR delay samples for      34700000
                                       swap reason 1:                   34750000
                                       Terminal output wait  @WA01699*/ 34800052
    3 R722OR2  FIXED(31),           /* STOR/OUTR delay samples for      34850000
                                       swap reason 2:                   34900000
                                       Terminal input wait   @WA01699*/ 34950052
    3 R722OR3  FIXED(31),           /* STOR/OUTR delay samples for      35000000
                                       swap reason 3:                   35050000
                                       Long wait                 @B1A*/ 35100000
    3 R722OR4  FIXED(31),           /* STOR/OUTR delay samples for      35150000
                                       swap reason 4:                   35200000
                                       Auxiliary storage shortage       35250000
                                                                 @B1A*/ 35300000
    3 R722OR5  FIXED(31),           /* STOR/OUTR delay samples for      35350000
                                       swap reason 5:                   35400000
                                       Real storage shortage     @B1A*/ 35450000
    3 R722OR6  FIXED(31),           /* STOR/OUTR delay samples for      35500000
                                       swap reason 6:                   35550000
                                       Detected long wait        @B1A*/ 35600000
    3 R722OR7  FIXED(31),           /* STOR/OUTR delay samples for      35650000
                                       swap reason 7:                   35700000
                                       Requested swap            @B1A*/ 35750000
    3 R722OR8  FIXED(31),           /* STOR/OUTR delay samples for      35800000
                                       swap reason 8:                   35850000
                                       Enqueue exchange swap     @B1A*/ 35900000
    3 R722OR9  FIXED(31),           /* STOR/OUTR delay samples for      35950000
                                       swap reason 9:                   36000000
                                       Exchange swap             @B1A*/ 36050000
    3 R722OR10 FIXED(31),           /* STOR/OUTR delay samples for      36100000
                                       swap reason 10:                  36150000
                                       Unilateral swap           @B1A*/ 36200000
    3 R722OR11 FIXED(31),           /* STOR/OUTR delay samples for      36250000
                                       swap reason 11:                  36300000
                                       Transition swap           @B1A*/ 36350000
    3 R722OR12 FIXED(31),           /* STOR/OUTR delay samples for      36400000
                                       swap reason 12:                  36450000
                                       Improve central storage usage    36500000
                                                                 @B1A*/ 36550000
    3 R722OR13 FIXED(31),           /* STOR/OUTR delay samples for      36600000
                                       swap reason 13:                  36650000
                                       Improve system paging rate       36700000
                                                                 @B1A*/ 36750000
    3 R722OR14 FIXED(31),           /* STOR/OUTR delay samples for      36800000
                                       swap reason 14:                  36850000
                                       Make room for an out too long    36900000
                                       user                      @B1A*/ 36950000
    3 R722OR15 FIXED(31),           /* STOR/OUTR delay samples for      37000000
                                       swap reason 15:                  37050000
                                       APPC wait                 @B2C*/ 37100000
    3 R722OR16 FIXED(31),           /* STOR/OUTR delay samples for      37150000
                                       swap reason 16:                  37200000
                                       OMVS input wait           @B2A*/ 37250000
    3 R722OR17 FIXED(31);           /* STOR/OUTR delay samples for      37300000
                                       swap reason 17:                  37350000
                                       OMVS output wait          @B2A*/ 37400000
*%IF IFAR723 = 'YES' %THEN %GOTO LR723; /* Subtype 3 data        @C4A*/ 37450000
*%IF IFAR724 = 'YES' %THEN %GOTO LR724; /* Subtype 4 data        @C4A*/ 37500000
*%GOTO LR72END;                     /* Goto end of file          @C4A*/ 37550000
 @SPACE;                                                                37600000
 %LR723:;                                                      /*@C1A*/ 37650000
*                                                             /* @C4D*/ 37700000
 @SPACE;                                                                37750000
    /* Subtype III Data Sections                                     */ 37800000
    /* Workload Manager Control Section                              */ 37850000
 DECLARE                                                                37900000
  1 R723WMS  BASED(ADDR(SMF72HDR)+SMF72WMS),                  /* @C1A*/ 37950000
    3 R723MSCF BIT(8),              /* Service class flags       @C1A*/ 38000000
      5 R723MRCL BIT(1),            /* x'80' This is a report class     38050000
                                       (RCAARCL)                 @C1A*/ 38100000
      5 R723MCAA BIT(1),            /* x'40' RCAA data not available    38150000
                                       RC 08/RSN 0831 from IWMRCOLL     38200000
                                                                 @C1A*/ 38250000
      5 R723MPOL BIT(1),            /* x'20' SVPOL data not available   38300000
                                                                 @C1A*/ 38350000
      5 R723MOVE BIT(1),            /* x'10' System is calculating      38300000
                                       velocity using I/O delays @E2A*/ 38350000
      5 R723MCPP BIT(1),            /* x'08' Indicator for CPU                  
                                       protection                @I2A*/         
      5 R723MSTP BIT(1),            /* x'04' Indicator for storage              
                                       protection                @I2A*/         
      5 R723MDAT BIT(1),            /* x'02' Indicator for dynamic              
                                       alias tuning              @I2A*/         
      5 R723MRS1 BIT(1),            /* x'01' Reserved            @I2C*/ 38400000
    3 R723MRS2 CHAR(3),             /* Reserved                  @C1A*/ 38450000
    3 R723MNSP CHAR(8),             /* Policy name               @C1A*/ 38500000
    3 R723MDSP CHAR(32),            /* Policy description        @C1A*/ 38550000
    3 R723MTPA CHAR(8),             /* Local time/date (STCK format of  38600000
                                       policy activation         @C1A*/ 38650000
    3 R723MCPU FIXED(32),           /* CPU service coefficient * 10,000 38700000
                                       the number by which accumulated  38750000
                                       CPU service units will be        38800000
                                       multiplied                       38850000
                                       weighted (SVPOLCPU)       @C1A*/ 38900000
    3 R723MIOC FIXED(32),           /* I/O service coefficient * 10,000 38950000
                                       the number by which accumulated  39000000
                                       I/O service units will be        39050000
                                       multiplied                       39100000
                                       weighted (SVPOLIOC)       @C1A*/ 39150000
    3 R723MMSO FIXED(32),           /* Storage service coefficient      39200000
                                       * 10,000 the number by which     39250000
                                       accumulated storage service      39300000
                                       units will be multiplied         39350000
                                       - weighted (SVPOLMSO)     @C1A*/ 39400000
    3 R723MSRB FIXED(32),           /* SRB service coefficient * 10,000 39450000
                                       the number by which accumulated  39500000
                                       SRB service units will be        39550000
                                       multiplied                       39600000
                                       - weighted (SVPOLSRB)     @C1A*/ 39650000
    3 R723MTVL FIXED(32),           /* Current sample interval (in      39700000
                                       milliseconds).  This is the      39750000
                                       frequency with which WLM         39800000
                                       samples delays reported in the   39850000
                                       RCAA                      @C1A*/ 39900000
    3 R723MTV# FIXED(32),           /* Total number of times WLM        39950000
                                       sampling code ran.  A RMF        40000000
                                       issuing successive calls to      40050000
                                       IWMRCOLL should not assume that  40100000
                                       WLM sampling code ran at the     40150000
                                       interval specified by R723MTVL   40200000
                                       between its calls.  This field   40250000
                                       can be used to translate         40300000
                                       sampled state data into actual   40350000
                                       percentages of time.      @C1A*/ 40400000
    3 R723MOPT CHAR(2),             /* OPT member suffix                40450000
                                       (RCAAOPT)                 @C1A*/ 40500000
    3 R723MRS3 CHAR(2),             /* reserved                  @C1A*/ 40550000
    3 R723MWNM CHAR(8),             /* Workload group name       @C1A*/ 40600000
    3 R723MWDE CHAR(32),            /* Workload group                   40650000
                                       description               @C1A*/ 40700000
    3 R723MCNM CHAR(8),             /* Service/Report class name @C1A*/ 40750000
    3 R723MCDE CHAR(32),            /* Service/Report class             40800000
                                       description               @C1A*/ 40850000
    3 R723MCPG FIXED(15),           /* Number of service class periods  40900000
                                       belonging to this service class. 40950000
                                       Zero for a report class   @C1A*/ 41000000
    3 R723MSUB FIXED(8),            /* Number of entries belonging      41050000
                                       to a subsystem. (See R723MSEC    41100000
                                       for current release value).      41150000
                                                                 @C1A*/ 41200000
    3 R723MRS4 CHAR(3),             /* Reserved                  @C1A*/ 41250000
    3 R723MERF CHAR(6),             /* ERV resource factor coefficient  41300000
                                       (from RMPTOPE)            @C1A*/ 41350000
    3 R723MADJ FIXED(31),           /* Value of RMCTADJC - adjustment   41400000
                                       factor for CPU rate       @C1A*/ 41450000
    3 R723MIDN CHAR(8),             /* Service definition name   @C1A*/ 41500000
    3 R723MIDD CHAR(32),            /* Service definition description   41550000
                                                                 @C1A*/ 41600000
    3 R723MTDI CHAR(8),             /* Local time/date (STCK format)    41650000
                                       the service definition was       41700000
                                       installed                 @C1A*/ 41750000
    3 R723MIDU CHAR(8);             /* Userid that installed the        41800000
                                       service definition        @C1A*/ 41850000
 @SPACE;                                                                41900000
 DECLARE                                                                41950000
    R723MSEC FIXED(8) CONSTANT(2);  /* Number (constant) of entries     42000000
                                       belonging to a subsystem. In     42050000
                                       RMF510 this number is 2. This    42100000
                                       number is kept in R723MSUB.      42150000
                                                                 @C1A*/ 42200000
 @SPACE;                                                                42250000
    /* Service Classes being served                                  */ 42300000
 DECLARE                                                                42350000
  1 R723SSS  BASED(ADDR(SMF72HDR)+SMF72SSS), /* Service classes being   42400000
                                       served by one or more AS in      42450000
                                       service class R723MCNM    @C1A*/ 42500000
    3 R723SCSN CHAR(8),             /* Name of service class being      42550000
                                       served                    @C1A*/ 42600000
    3 R723SCS# FIXED(32);           /* Number of times an AS running    42650000
                                       with service class R723MCNM      42700000
                                       served service class             42750000
                                       R723SCSN                  @C1A*/ 42800000
 @SPACE;                                                                42850000
    /* Resource Group Data Section                                   */ 42900000
 DECLARE                                                                42950000
  1 R723RGS  BASED(ADDR(SMF72HDR)+SMF72RGS), /* Resource group          43000000
                                       data                      @C1A*/ 43050000
    3 R723GGNM CHAR(8),             /* Resource group name       @C1A*/ 43100000
    3 R723GGDE CHAR(32),            /* Resource group                   43150000
                                       description               @C1A*/ 43200000
    3 R723GGLT BIT(8),              /* Resource group flags      @C1A*/ 43250000
      5 R723GMXS BIT(1),            /* x'80' Maximum capacity was       43300000
                                       specified                 @C1A*/ 43350000
      5 R723GMNS BIT(1),            /* x'40' Minimum capacity was       43400000
                                       specified                 @C1A*/ 43450000
      5 R723GRS1 BIT(6),            /* Reserved                  @C1A*/ 43500000
    3 R723GRS2 CHAR(3),             /* Reserved                  @C1A*/ 43550000
    3 R723GGMN FIXED(32),           /* If R723GMNS = ON, minimum        43600000
                                       capacity in unweighted CPU       43650000
                                       service units per seconds,       43700000
                                       otherwise 0               @C1A*/ 43750000
    3 R723GGMX FIXED(32);           /* If R723GMXS = ON, maximum        43800000
                                       capacity in unweighted CPU       43850000
                                       service units per seconds,       43900000
                                       otherwise 0               @C1A*/ 43950000
 @SPACE;                                                                44000000
    /* Service Class Period Data - GOALS                             */ 44050000
 DECLARE                                                                44100000
  1 R723SCS  BASED(ADDR(SMF72HDR)+SMF72SCS),                  /* @C1A*/ 44150000
    3 R723CRTX FIXED(15),           /* Index into the response time     44200000
                                       distribution buckets. Entry 0    44250000
                                       represents the distribution      44300000
                                       map                       @C1A*/ 44350000
    3 R723CWMX FIXED(15),           /* Index into the work/resource     44400000
                                       manager states area       @C1A*/ 44450000
    3 R723CWMN FIXED(15),           /* Number of entries in the         44500000
                                       work/resource manager states     44550000
                                       area associated with this        44600000
                                       service class period (R723CWMX   44650000
                                       points to the first entry)       44700000
                                                                 @C1A*/ 44750000
    3 R723CRS1 CHAR(1),             /* Reserved                  @C1A*/ 44800000
    3 R723CADF BIT(8),              /*  Actuals data section flag       44850000
                                                                 @C1A*/ 44900000
      5 R723CRCA  BIT(1),           /* Resource consumption data        44950000
                                       actuals (R723CRCD) are           45000000
                                       available                 @C1A*/ 45050000
      5 R723CRTA  BIT(1),           /* Response time data actuals       45100000
                                       (R723CRTD) are available         45150000
                                                                 @C1A*/ 45200000
      5 R723CEDA  BIT(1),           /* General execution delay data     45250000
                                       actuals (R723CGDE) are           45300000
                                       available                 @C1A*/ 45350000
      5 R723CRS5  BIT(5),           /* Reserved                  @C1A*/ 45400000
    3 R723COAL,                     /* Service class period             45450000
                                       GOALS                     @C1A*/ 45500000
      5 R723CPER FIXED(8),          /* Service class period number.     45550000
                                                                 @C1A*/ 45600000
      5 R723CRTF BIT(8),            /* Response time flags       @C1A*/ 45650000
        7 R723CMIL BIT(1),          /* x'80' Response time specified in 45700000
                                       milliseconds              @C1A*/ 45750000
        7 R723CSEC BIT(1),          /* x'40' Response time specified in 45800000
                                       seconds                   @C1A*/ 45850000
        7 R723CMIN BIT(1),          /* x'20' Response time specified in 45900000
                                       minutes                   @C1A*/ 45950000
        7 R723CHOU BIT(1),          /* x'10' Response time specified in 46000000
                                       hours                     @C1A*/ 46050000
        7 R723CRS2 BIT(4),          /* Reserved                  @C1A*/ 46100000
      5 R723CRGF BIT(8),            /* Response time goal flags  @C1A*/ 46150000
        7 R723CPRC BIT(1),          /* x'80' Percentile response time   46200000
                                       goal                      @C1A*/ 46250000
        7 R723CAVG BIT(1),          /* x'40' Average response time      46300000
                                       goal                      @C1A*/ 46350000
        7 R723CVEL BIT(1),          /* x'20' Execution velocity goal    46400000
                                       goal                      @C1A*/ 46450000
        7 R723CDSC BIT(1),          /* x'10' Discretionary goal  @C1A*/ 46500000
        7 R723CSTM BIT(1),          /* x'08' System specified goal      46550000
                                                                 @C1A*/ 46600000
        7 R723CRS3 BIT(3),          /* Reserved                  @C1A*/ 46650000
      5 R723CRS4 CHAR(1),           /* Reserved                  @C1A*/ 46700000
      5 R723CVAL FIXED(32),         /* Response time goal - or          46750000
                                       Execution velocity goal - or     46800000
                                       zero if discretionary, system    46850000
                                       or no goal                @C1A*/ 46900000
      5 R723CPCT FIXED(16),         /* Goal percentile value     @C1A*/ 46950000
      5 R723CIMP FIXED(16),         /* Relative importance of the goal  47000000
                                       to be achieved for this service  47050000
                                       class period (1=highest,         47100000
                                       5=lowest)                 @C1A*/ 47150000
      5 R723CDUR FIXED(32),         /* Service class period duration in 47200000
                                       service units, or zero for last  47250000
                                       period                    @C1A*/ 47300000
 @SPACE;                                                                47350000
    /* SCP Resource Data - ACUTALS                                   */ 47400000
 @SPACE;                                                                47450000
    3 R723CRCD BDY(DWORD),          /* Service class period resource    47500000
                                       data. ALL service units are      47550000
                                       weighted by the coefficients     47600000
                                       in the active policy      @C1A*/ 47650000
      5 R723CSRV CHAR(8),           /* Total service units              47700000
                                       (floating point 64-bit long      47750000
                                       format)                   @C1A*/ 47800000
      5 R723CCPU CHAR(8),           /* Total CPU service units          47850000
                                       (floating point 64-bit long      47900000
                                       format)                   @C1A*/ 47950000
      5 R723CIOC CHAR(8),           /* Total IOC service units          48000000
                                       (floating point 64-bit long      48050000
                                       format)                   @C1A*/ 48100000
      5 R723CMSO CHAR(8),           /* Total storage service units      48150000
                                       (floating point 64-bit long      48200000
                                       format)                   @C1A*/ 48250000
      5 R723CSRB CHAR(8),           /* Total SRB service units          48300000
                                       (floating point 64-bit long      48350000
                                       format)                   @C1A*/ 48400000
      5 R723CPIR CHAR(8),           /* Total page-in count              48450000
                                       (floating point 64-bit long      48500000
                                       format)                   @C1A*/ 48550000
      5 R723CHPI CHAR(8),           /* Total hiperspace page-in count   48600000
                                       (floating point 64-bit long      48650000
                                       format)                   @C1A*/ 48700000
      5 R723CBPI CHAR(8),           /* Total block page-in from aux     48750000
                                       count (floating point 64-bit     48800000
                                       long format)              @C1A*/ 48850000
      5 R723CPIE CHAR(8),           /* Total page-in from expanded      48900000
                                       count (floating point 64-bit     48950000
                                       long format)              @C1A*/ 49000000
      5 R723CBPE CHAR(8),           /* Total block page-in from         49050000
                                       expanded count (floating point   49100000
                                       64-bit long format)       @C1A*/ 49150000
      5 R723CBKA CHAR(8),           /* Total aux blocks paged in        49200000
                                       (floating point 64-bit long      49250000
                                       format)                   @C1A*/ 49300000
      5 R723CBKE CHAR(8),           /* Total expanded blocks paged in   49350000
                                       (floating point 64-bit long      49400000
                                       format)                   @C1A*/ 49450000
      5 R723CPRS CHAR(8),           /* Total page residency time        49500000
                                       (1024 microsecond) (floating     49550000
                                        point 64-bit long format)       49600000
                                                                 @C1A*/ 49650000
      5 R723CERS CHAR(8),           /* Total expanded page residency    49700000
                                       time (1024 microseconds)         49750000
                                       (floating point 64-bit long      49800000
                                       format)                   @C1A*/ 49850000
      5 R723CTRR CHAR(8),           /* Total in storage residency time  49900000
                                       (1024 microsecond) (floating     49950000
                                        point 64-bit long format)       50000000
                                                                 @C1A*/ 50050000
      5 R723CTAT CHAR(8),           /* Total transaction active time    50100000
                                       (1024 microsecond) (floating     50150000
                                        point 64-bit long format)       50200000
                                                                 @C1A*/ 50250000
      5 R723CRCT CHAR(8),           /* Total RCT time (microseconds)    50300000
                                       (floating point 64-bit long      50350000
                                       format)                   @C1A*/ 50400000
      5 R723CIIT CHAR(8),           /* Total I/O interrupt time         50450000
                                       (microsecond) (floating          50500000
                                        point 64-bit long format)       50550000
                                                                 @C1A*/ 50600000
      5 R723CHST CHAR(8),           /* Total hiperspace service time    50650000
                                       (microseconds) (floating point   50700000
                                       64-bit long format)       @C1A*/ 50750000
      5 R723CSWC FIXED(32),         /* Total swap count          @C1A*/ 50800000
      5 R723CCRM FIXED(32),         /* Total hiperspace eso read miss   50850000
                                       count                     @C1A*/ 50900000
 @SPACE;                                                                50950000
    /* SCP Reponse Time Data - ACTUALS                               */ 51000000
 @SPACE;                                                                51050000
    3 R723CRTD BDY(DWORD),          /* Service class period response    51100000
                                       time data                 @C1A*/ 51150000
      5 R723CRCP FIXED(32),         /* Count of transaction completions 51200000
                                       for this period. This field      51250000
                                       includes transaction completions 51300000
                                       reported by subsystem work       51350000
                                       managers via the IWMRPT          51400000
                                       service                   @C1A*/ 51450000
      5 R723CARC FIXED(32),         /* Count of transaction that        51500000
                                       completed abnormally as reported 51550000
                                       by subsystem work manager. This  51600000
                                       value is not part of R723CRCP    51650000
                                       and should not be used for       51700000
                                       response time                    51750000
                                       calculations              @C1A*/ 51800000
      5 R723CNCP FIXED(32),         /* Count of transaction that        51850000
                                       completed their execution phase  51900000
                                       as reported by subsystem work    51950000
                                       managers via the IWMNTFY         52000000
                                       service                   @C1A*/ 52050000
      5 R723CANC FIXED(32),         /* Count of transaction that        52100000
                                       completed their execution phase  52150000
                                       abnormally as reported by        52200000
                                       subsystem work Manager. This     52250000
                                       value is not part of R723CNCP    52300000
                                       and should not be used for       52350000
                                       execution response time          52400000
                                       calculations              @C1A*/ 52450000
      5 R723CTET CHAR(8),           /* Total transaction elapsed        52500000
                                       (1024 microsecond) (floating     52550000
                                        point 64-bit long format)       52600000
                                                                 @C1A*/ 52650000
      5 R723CXET CHAR(8),           /* Total transaction execution      52700000
                                       time (1024 microseconds)         52750000
                                       (floating point 64-bit long      52800000
                                       format)                   @C1A*/ 52850000
      5 R723CETS CHAR(8),           /* Sum of transaction elapsed times 52900000
                                       squared (1024 microseconds)      52950000
                                       (floating point 64-bit long      53000000
                                        format)                  @C1A*/ 53050000
 @SPACE;                                                                53100000
    /* SCP General Execution Delays - ACTUALS                        */ 53150000
 @SPACE;                                                                53200000
    3 R723CGDE,                     /* General execution delay          53250000
                                       data                      @C1A*/ 53300000
      5 R723CEVD,                   /* Execution velocity data   @C1A*/ 53350000
        7 R723CCUS FIXED(32),       /* CPU using samples         @C1A*/ 53400000
        7 R723CTOT FIXED(32),       /* Total delay samples used in      53450000
                                       SRM's execution velocity         53500000
                                       calculation               @C1A*/ 53550000
      5 R723CEDL,                   /* General execution delays         53600000
                                       included in R723CTOT. Each       53650000
                                       dispatchable unit of work        53700000
                                       sampled can increase one of      53750000
                                       the CPU or paging delay          53800000
                                       samples                   @C1A*/ 53850000
        7 R723CCDE FIXED(32),       /* CPU delay. A TCB or SRB is       53900000
                                       waiting to be dispatched (other  53950000
                                       than the first in-line behind    54000000
                                       sampler) or a TCB is waiting for 54050000
                                       local lock                @C1A*/ 54100000
        7 R723CCCA FIXED(32),       /* CPU capping delay. A TCB or SRB  54150000
                                       is marked non-dispatchable       54200000
                                       because a resource group maximum 54250000
                                       is being enforced. Note that     54300000
                                       R723CCCA is NOT a subset of      54350000
                                       R723CCDE                  @C1A*/ 54400000
        7 R723CSWI FIXED(32),       /* Swap-in delay. Swap-in has       54450000
                                       started, but not completed       54500000
                                       completed                 @C1A*/ 54550000
        7 R723CMPL FIXED(32),       /* MPL delay. Ready but swap-in has 54600000
                                       not started               @C1A*/ 54650000
        7 R723CAPR FIXED(32),       /* AUX page from private     @C1A*/ 54700000
        7 R723CACO FIXED(32),       /* AUX page from common      @C1A*/ 54750000
        7 R723CAXM FIXED(32),       /* AUX page from cross memory       54800000
                                       memory                    @C1A*/ 54850000
        7 R723CVIO FIXED(32),       /* AUX page from VIO         @C1A*/ 54900000
        7 R723CHSP FIXED(32),       /* AUX page from standard           54950000
                                       hiperspaces               @C1A*/ 55000000
        7 R723CCHS FIXED(32),       /* AUX page from eso                55050000
                                       hiperspaces               @C1A*/ 55100000
      5 R723CUNK FIXED(32),         /* Unknown. Dispatchable unit or    55150000
                                       AS is waiting, but none of the   55200000
                                       above reasons apply. These       55250000
                                       samples are not included in      55300000
                                       R723CTOT                  @C1A*/ 55350000
      5 R723CIDL FIXED(32),         /* Idle. Work is in STIMER wait,    55400000
                                       TSO terminal wait, APPC wait, or 55450000
                                       is an initiator waiting for      55500000
                                       work. These samples are not      55550000
                                       included in R723CTOT      @C1A*/ 55600000
      5 R723CPDE FIXED(32),         /* Resource group capping count.    55650000
                                       Group maximum is being enforced  55700000
                                       for work in this service class.  55750000
                                       These samples are not included   55800000
                                       in R723CTOT               @C1A*/ 55850000
      5 R723CPQU FIXED(32),         /* Quiesce count. Some work in this 55900000
                                       service class has been reset via 55950000
                                       the RESET xxx, QUIESCE command.  56000000
                                       These samples are not included   56050000
                                       in R723CTOT               @C1A*/ 56100000
      5 R723CSAC FIXED(32),         /* Sampled address space count.     18130002
                                       Number of address spaces that    56200000
                                       contributed delay and using      56250000
                                       samples to this service class.   56300000
                                       These samples are not included   56350000
                                       in R723CTOT               @C1A*/ 18180002
      ?ERBFITEM(5 R723CSRS) FLOAT(56);, /* Total                        18180202
                                       shared page residency            18180302
                                       time (1024 microseconds)         18180402
                                       (long floating point)     @D1A*/ 18180502
      ?ERBFITEM(5 R723CSPA) FLOAT(56);, /* Total shared page-ins        18180602
                                       from auxiliary storage           18180702
                                       (long floating point)     @D1A*/ 18180802
      ?ERBFITEM(5 R723CSPE) FLOAT(56);, /* Total shared page-ins        18180902
                                       from expanded storage            18181002
                                       (long floating point)     @E1C*/ 18182002
 @SPACE;                                                                53100000
    /* SCP - Additional Resource Consumption Data                    */ 53150000
 @SPACE;                                                                53200000
    3 R723CARE,                     /* Resource consumption data        53250000
                                                                 @E1A*/ 53300000
      ?ERBFITEM(5 R723CICT) FLOAT(56);, /* Total DASD I/O connect time          
                                       in 128 microsecond units  @E1A*/         
      ?ERBFITEM(5 R723CIWT) FLOAT(56);, /* Total DASD I/O wait time             
                                       (queue time + pending time in            
                                       128 microsecond units)    @E1A*/         
      ?ERBFITEM(5 R723CIDT) FLOAT(56);, /* Total DASD I/O disconnect            
                                       time in 128 microsecond units.           
                                       Does not include IOS queue               
                                       time.                     @E1A*/         
      5 R723CIRC FIXED(32),         /* Total DASD I/O count. This               
                                       can be used with the above               
                                       fields (R723CICT, R723CIWT,              
                                       and R723CIDT) to determine the           
                                       average DASD resp. time for the          
                                       period.                                  
                                       (long floating point)     @E1A*/         
 @SPACE;                                                                53100000
    /* SCP - Additional General Execution Delay Data - Actuals       */ 53150000
 @SPACE;                                                                53200000
    3 R723CAGE,                     /* General execution delay data     53250000
                                       - actuals                 @E1A*/ 53300000
      5 R723CTOU FIXED(32),         /* Total usings. Velocity should            
                                       be calculated as R723CTOU/               
                                       (R723CTOU+R723CTOT).      @E1A*/         
      5 R723CIOU FIXED(32),         /* Total I/O usings. These are              
                                       included in R723CTOU. Only non-          
                                       paging DASD I/Os can contribute          
                                       to I/O usings.            @E1A*/         
      /* The following delay counters are included in R723CTOT       */         
      5 R723CIOD FIXED(32),         /* DASD I/O delay samples    @E1A*/         
      5 R723CQ   FIXED(32),         /* Queue delay samples. Work is             
                                       waiting for a server      @E1A*/         
      5 R723CSPV FIXED(32),         /* Server private area paging               
                                       delay samples             @E1A*/         
      5 R723CSVI FIXED(32),         /* Server space VIO paging delay            
                                       samples                   @E1A*/         
      5 R723CSHS FIXED(32),         /* Server hiperspace paging delay           
                                       samples                   @E1A*/         
      5 R723CSMP FIXED(32),         /* Server MPL delay samples  @E1A*/         
      5 R723CSSW FIXED(32),         /* Server swap-in delay samples             
                                                                 @E1A*/         
      /* Non DASD I/O using or delay samples                         */         
      5 R723CNDI FIXED(32),         /* Non DASD I/O using or delay              
                                       samples                   @F1C*/         
      5 R723CTDQ FIXED(32),         /* Total delay samples always               
                                       including batch queue delay.             
                                       For service classes that                 
                                       contain batch jobs that were             
                                       not run in WLM managed                   
                                       initiators the batch queue               
                                       delay samples are derived from           
                                       the measured batch queue delay           
                                       time.  For service classes               
                                       that contain jobs that ran in            
                                       WLM managed initiators this              
                                       value is the same as RCEATOTD.           
                                       RCAETOTDQ can be used as a               
                                       migration aid to determine               
                                       what a batch service class               
                                       period's velocity will be if             
                                       its jobs are run in WLM                  
                                       managed initators         @F2A*/         
      ?ERBFITEM(5 R723CTSA) Float(56);, /* Total execution samples. It          
                                       is the sum of RCAETOTU, RCAETOTD,        
                                       RCAEUNKN, and RCAEIDLE.  Also            
                                       always includes I/O                      
                                       using/delay samples whether or           
                                       not I/O samples are included             
                                       in RCAETOTU or RCAETOTD,                 
                                       respectively.                            
                                       (Long floating point)     @F1A*/         
      ?ERBFITEM(5 R723CIOT) Float(56);, /* Total DASD IOS queue time in         
                                       128 microsecond units (long              
                                       floating point)           @F1A*/         
      ?ERBFITEM(5 R723CQDT) Float(56);, /* Total queue delay time. For          
                                       batch jobs this is the time              
                                       jobs spent on the job queue              
                                       while eligible to run on some            
                                       system. It represents the time           
                                       the jobs spent waiting for an            
                                       initiator. For TSO users, this           
                                       time can be a portion of the             
                                       LOGON process. For APPC this             
                                       is the time an APPC request              
                                       spends on an APPC queue. (long           
                                       floating point in 1024 micro-            
                                       second units)             @F1A*/         
      ?ERBFITEM(5 R723CADT) Float(56);, /* Total time batch jobs were           
                                       ineligible to run because a              
                                       resource the job had affinity            
                                       to was unavailable. Only                 
                                       applies to batch work.  Zero             
                                       for other work types. (long              
                                       floating point in 1024                   
                                       microsecond units)        @F1A*/         
      ?ERBFITEM(5 R723CCVT) Float(56);, /* Total time batch jobs spent          
                                       in JCL conversion. Only applies          
                                       to batch work. Zero for other            
                                       work types. (long floating               
                                       point in 1024 microsecond                
                                       units)                    @F1A*/         
      ?ERBFITEM(5 R723CIQT) Float(56);, /* Total time batch jobs spend          
                                       on job queue (after JCL                  
                                       conversion) while ineligible             
                                       to run on any system for                 
                                       reasons other than resource              
                                       affinities. Only applies to              
                                       batch work. Zero for other               
                                       work types. (long floating               
                                       point in 1024 microsecond                
                                       units)                    @I1C*/         
      ?ERBFITEM(5 R723CIEA) Float(56);, /* Independent enclave total            
                                       transaction active time (in              
                                       1024 microsecond units) for              
                                       enclaves that originated on              
                                       this system.              @I1A*/         
      ?ERBFITEM(5 R723CXEA) Float(56);, /* Exported enclave total               
                                       transaction active time (in              
                                       1024 microsecond units).  @I1A*/         
      ?ERBFITEM(5 R723CFEA) Float(56);; /* Foreign enclave total                
                                       transaction active time (in              
                                       1024 microsecond units).  @I1A*/         
 @SPACE;                                                                56450000
    /*****************************************************************/ 56500000
    /*                                                               */ 56550000
    /* Response Time Distribution Map and Counts Table               */ 56600000
    /*                                                               */ 56650000
    /* This table defines up to 9 entries (in RMF 4.4.0 each entry   */ 56700000
    /* represents 14 response time distribution buckets) where       */ 56750000
    /*                                                               */ 56800000
    /*      entry 0 is always the MAP and is addressed by the offset */ 56850000
    /*            in the header extension SMF72RTS                   */ 56900000
    /*      entry 1 - 8 (max number of periods for a service class)  */ 56950000
    /*            are the the counts for an associated service class */ 57000000
    /*            period and addressed by an index from the service  */ 57050000
    /*            class period data section R723CRTX                 */ 57100000
    /*                                                               */ 57150000
    /* The MAP is the first entry (0) in this table and defines      */ 57200000
    /* a maximum percentage of a goal (i.e. 50, 70, 200, etc.).      */ 57250000
    /* When used in conjunction with a following entry (1-8) it      */ 57300000
    /* shows the number of transactions that completed in a          */ 57350000
    /* percentage of a a goal. The last entry in the array           */ 57400000
    /* contains x'FFFFFFFF'. This indicates that this bucket         */ 57450000
    /* includes all transactions that completed with longer          */ 57500000
    /* response times than the previous bucket.                      */ 57550000
    /*                                                               */ 57600000
    /* Entries 1-8 contains the number of transactions that          */ 57650000
    /* completed in the time period represented by that entry.       */ 57700000
    /* When used with entry 0 it shows a distribution of             */ 57750000
    /* completions verses goals specified.                       @C1A*/ 57800000
    /*                                                               */ 57850000
    /*****************************************************************/ 57900000
 @SPACE;                                                                57950000
 DECLARE                                                                58000000
  1 R723RTS  BASED(ADDR(SMF72HDR)+SMF72RTS), /* Response Time           58050000
                                       distribution              @C1A*/ 58100000
    3 R723TRDB (R723TENT) FIXED(32), /* Map or counts            @C1A*/ 58150000
 @SPACE;                                                                58200000
 R723TENT CONSTANT(14);             /* Number of entries in an array.   58250000
                                       For RMF 510 the number is 14.    58300000
                                                                 @C1A*/ 58350000
 @SPACE;                                                                58400000
    /* Work Manager / Resource Manager States                    @C1A*/ 58450000
 DECLARE                                                                58500000
  1 R723WRS  BASED(ADDR(SMF72HDR)+SMF72WRS),                 /*  @C1A*/ 58550000
    3 R723RENT,                     /* Entry in the subsystem work      58600000
                                       manager delay array. In RMF510   58650000
                                       there are always two entries     58700000
                                       for a subsystem, one for the     58750000
                                       Begin_to_End phase and one for   58800000
                                       the Execution phase, where the   58850000
                                       BtE entry is always the first    58900000
                                                                 @C1A*/ 58950000
      5 R723RTYP CHAR(4),           /* Subsystem type, as used in the   59000000
                                       classification rules specified   59050000
                                       in the WLM administrative        59100000
                                       application. The subsystem's     59150000
                                       documentation should explain the 59200000
                                       meaning that the product         59250000
                                       attributes to the various        59300000
                                       states                    @C1A*/ 59350000
      5 R723RFLG BIT(8),            /* Work/Resource manager flags      59400000
                                       flags                     @C1A*/ 59450000
        7 R723RDBE BIT(1),          /* x'80' Represents states sampled  59500000
                                       in the begin-to-end phase of a   59550000
                                       transaction               @C1A*/ 59600000
        7 R723REXE BIT(1),          /* x'40' Represents states sampled  59650000
                                       in the execution phase of a      59700000
                                       transaction               @C1A*/ 59750000
        7 R723RRS1 BIT(6),          /* Reserved                  @C1A*/ 59800000
      5 R723RRS2 CHAR(3),           /* Reserved                  @C1A*/ 59850000
      5 R723RESS FIXED(32),         /* Total number of transaction      59900000
                                       states sampled in the work phase 59950000
                                       specified by R723RFLG     @C1A*/ 60000000
      5 R723RACT FIXED(32),         /* Total number of active state     60050000
                                       samples. Active indicates that   60100000
                                       there is a program executing     60150000
                                       on behalf of the work request,   60200000
                                       from the perspective of the      60250000
                                       work manager. This does not mean 60300000
                                       that the program is active from  60350000
                                       the base control program's       60400000
                                       perspective               @C1A*/ 60450000
      5 R723RRDY FIXED(32),         /* Total number of ready state      60500000
                                       samples. Ready indicates that    60550000
                                       there is a program ready to      60600000
                                       execute on behalf of the work    60650000
                                       request described by the         60700000
                                       monitoring environment, but the  60750000
                                       work manager has given priority  60800000
                                       to another work request   @C1A*/ 60850000
      5 R723RIDL FIXED(32),         /* Total number of idle state       60900000
                                       samples. Idle indicates that     60950000
                                       no work reques is available      61000000
                                       to the work manager that is      61050000
                                       allowed to run.           @C1A*/ 61100000
      5 R723RWLO FIXED(32),         /* Total number of waiting for      61150000
                                       lock state samples        @C1A*/ 61200000
      5 R723RWIO FIXED(32),         /* Total number of waiting for      61250000
                                       I/O state samples. Waiting for   61300000
                                       I/O indicates that the work      61350000
                                       manager is waiting for an        61400000
                                       activity related to an I/O       61450000
                                       request. This may be an actual   61500000
                                       I/O operation or some other      61550000
                                       function associated with the     61600000
                                       I/O request               @C1A*/ 61650000
      5 R723RWCO FIXED(32),         /* Total number of waiting for      61700000
                                       conversation state samples.      61750000
                                       Waiting for conversation may     61800000
                                       have been used in conjunction    61850000
                                       with the WLM service IWMMSWCH    61900000
                                       to identify where the recipient  61950000
                                       of the conversation is           62000000
                                       located.  In this case, only     62050000
                                       the switched state will be       62100000
                                       recorded.                 @C1A*/ 62150000
      5 R723RWDS FIXED(32),         /* Total number of waiting for      62200000
                                       distributed request state        62250000
                                       samples.  Waiting for            62300000
                                       distributed request indicates a  62350000
                                       high level that some function    62400000
                                       or data must be routed prior to  62450000
                                       resumption of the work request.  62500000
                                       This is to be contrasted with    62550000
                                       waiting for conversation, which  62600000
                                       is a low level view of the       62650000
                                       precise resource that is         62700000
                                       needed.  A distributed request   62750000
                                       could involve waiting on a       62800000
                                       conversation as part of its      62850000
                                       processing                @C1A*/ 62900000
      5 R723RWSL FIXED(32),         /* Waiting for a session to be      62950000
                                       established locally, i.e. on     63000000
                                       the current MVS image     @C1A*/ 63050000
      5 R723RWSN FIXED(32),         /* Waiting for a session to be      63100000
                                       established somewhere in the     63150000
                                       network                   @C1A*/ 63200000
      5 R723RWSS FIXED(32),         /* Waiting for a session to be      63250000
                                       established somewhere in the     63300000
                                       sysplex                   @C1A*/ 63350000
      5 R723RWTM FIXED(32),         /* Waiting for a timer       @C1A*/ 63400000
      5 R723RWO  FIXED(32),         /* Waiting for another              63450000
                                       product                   @C1A*/ 63500000
      5 R723RWMS FIXED(32),         /* Waiting for unidentified         63550000
                                       resource, possibly among         63600000
                                       another more specific category,  63650000
                                       but which may not be readily     63700000
                                       determined                @C1A*/ 63750000
      5 R723RSSL FIXED(32),         /* State representing transactions  63800000
                                       for which there are logical      63850000
                                       continuations on this MVS        63900000
                                       image.  Subsystem work managers  63950000
                                       might set this state when they   64000000
                                       function ship a transaction to   64050000
                                       another component within the     64100000
                                       same MVS image            @C1A*/ 64150000
      5 R723RSSS FIXED(32),         /* State representing transactions  64200000
                                       for which there are logical      64250000
                                       continuations on another MVS     64300000
                                       image in the sysplex.            64350000
                                       Subsystem work managers might    64400000
                                       set this state when they         64450000
                                       function ship a transaction to   64500000
                                       another component on another     64550000
                                       MVS image within the             64600000
                                       sysplex                   @C1A*/ 64650000
      5 R723RSSN FIXED(32),         /* State representing transactions  64700000
                                       for which there are logical      64750000
                                       continuations somewhere within   64800000
                                       the network.  Subsystem work     64850000
                                       managers might set this state    64900000
                                       when they function ship a        64950000
                                       transaction to another           65000000
                                       component within the             65050000
                                       network                   @E1C*/ 65100000
      /* Reserved                                                    */         
      5 *        FIXED(32),         /* Reserved                  @E1A*/         
      5 *        FIXED(32),         /* Reserved                  @E1A*/         
      5 *        FIXED(32),         /* Reserved                  @E1A*/         
      5 *        FIXED(32),         /* Reserved                  @E1A*/         
      5 R723RWNL FIXED(32);         /* Total number of state samples            
                                       reflecting waiting for new               
                                       latch                     @E1A*/         
 @SPACE;                                                                65150000
*%IF IFAR724 = 'YES' %THEN %GOTO LR724; /* Subtype 4 data        @C4A*/ 65200000
*%GOTO LR72END;                     /* Goto end of file          @C4A*/ 65250000
 %LR724:;                                                     /* @C2A*/ 65300000
*                                                             /* @C4D*/ 65350000
 @SPACE;                                                                65400000
    /* Service Class Period Data Section (Subtype 4)             @C2A*/ 65450000
 DECLARE                                                                65500000
  1 R724DATA BASED(ADDR(SMF72HDR)+SMF72CPS),                  /* @C2A*/ 65550000
    3 R724PNAM CHAR(8),             /* Name of active service           65600000
                                       policy                    @C2A*/ 65650000
    3 R724PTM  CHAR(8),             /* Time policy was activated        65700000
                                       (Format: STORE CLOCK             65750000
                                        Unit: local time)        @C2A*/ 65800000
    3 R724LCNM CHAR(8),             /* Service class name        @C2A*/ 65850000
    3 R724PER# FIXED(8),            /* Service class period             65900000
                                       number                    @C2A*/ 65950000
    3 *        CHAR(3),             /* Free for future use       @C2A*/ 66000000
    3 R724USER FIXED(32),           /* Sum of all users found    @C2A*/ 66050000
    3 R724ACTV FIXED(32),           /* Sum of all active users found    66100000
                                                                 @C2A*/ 66150000
    3 R724ACTS FIXED(32),           /* Sum of all active samples        66200000
                                       (except OUTR)             @C2A*/ 66250000
    3 R724IDLS FIXED(32),           /* Sum of all idle samples   @C2A*/ 66300000
    3 R724PAGE FIXED(32),           /* Sum of all users delayed for     66350000
                                       paging at all samples     @C2A*/ 66400000
    3 R724SWAP FIXED(32),           /* Sum of all users delayed for     66450000
                                       swapping at all samples   @C2A*/ 66500000
    3 R724OUTR FIXED(32),           /* Sum of all out and ready         66550000
                                       users at all samples      @C2A*/ 66600000
    3 R724PGIN FIXED(32),           /* Sum of all page-ins       @C2A*/ 66650000
    3 R724DIVS FIXED(32),           /* Sum of all DIV samples    @C2A*/ 66700000
    3 R724LSSA FIXED(32),           /* Total logically swapped          66750000
                                       samples for the group     @C2A*/ 66800000
    3 R724PSSA FIXED(32),           /* Total swapped samples for the    66850000
                                       group (except logical)    @C2A*/ 66900000
    3 R724UPRO FIXED(32),           /* Total processor using samples    66950000
                                       for the group             @C2A*/ 67000000
    3 R724UDEV FIXED(32),           /* Total device using samples       67050000
                                       for the group             @C2A*/ 67100000
    3 R724DPRO FIXED(32),           /* Total processor delay samples    67150000
                                       for the group             @C2A*/ 67200000
    3 R724DDEV FIXED(32),           /* Total device delay samples       67250000
                                       for the group             @C2A*/ 67300000
    3 R724DSTO FIXED(32),           /* Total storage delay samples      67350000
                                       for the group             @C2A*/ 67400000
    3 R724DJES FIXED(32),           /* Total JES delay samples          67450000
                                       for the group             @C2A*/ 67500000
    3 R724DHSM FIXED(32),           /* Total HSM delay samples          67550000
                                       for the group             @C2A*/ 67600000
    3 R724DXCF FIXED(32),           /* Total XCF delay samples          67650000
                                       for the group             @C2A*/ 67700000
    3 R724DENQ FIXED(32),           /* Total ENQ delay samples          67750000
                                       for the group             @C2A*/ 67800000
    3 R724DMNT FIXED(32),           /* Total mount delay samples        67850000
                                       for the group             @C2A*/ 67900000
    3 R724DMSG FIXED(32),           /* Total message delay samples      67950000
                                       for the group             @C2A*/ 68000000
    3 R724UNKN FIXED(32),           /* Total unknown state samples      68050000
                                       for the group             @C2A*/ 68100000
    3 R724VALD FIXED(32),           /* Total valid samples for          68150000
                                       the group (single state sum      68200000
                                       of all using, delay, idle,       68250000
                                       and unknown)              @C2A*/ 68300000
    3 R724LSCT FIXED(32),           /* Count of "long" logical          68350000
                                       swaps for the group       @C2A*/ 68400000
    3 R724ESCT FIXED(32),           /* Count of "long" swaps to         68450000
                                       expanded storage for the group   68500000
                                                                 @C2A*/ 68550000
    3 R724PSCT FIXED(32),           /* Count of "long" physical         68600000
                                       swaps for the group       @C2A*/ 68650000
    3 R724ACTF CHAR(8) BDY(DWORD),  /* Sum of all active frames         68700000
                                       (long floating point)     @C2A*/ 68750000
    3 R724IDLE CHAR(8),             /* Sum of all idle frames           68800000
                                       (long floating point)     @C2A*/ 68850000
    3 R724SLOT CHAR(8),             /* Sum of all slots used            68900000
                                       (long floating point)     @C2A*/ 68950000
    3 R724DIV  CHAR(8),             /* Sum of all DIV frames            69000000
                                       (long floating point)     @C2A*/ 69050000
    3 R724FIX  CHAR(8),             /* Sum of all fixed frames          69100000
                                       (long floating point)     @C2A*/ 69150000
    3 R724LSCF CHAR(8),             /* Sum of all central frames        69200000
                                       for all logically swapped        69250000
                                       users at all samples             69300000
                                       (long floating point)     @C2A*/ 69350000
    3 R724LSEF CHAR(8),             /* Sum of all expanded frames       69400000
                                       for all logically swapped        69450000
                                       users at all samples             69500000
                                       (long floating point)     @C2A*/ 69550000
    3 R724PSEF CHAR(8),             /* Sum of all expanded frames       69600000
                                       for all swapped users (except    69650000
                                       logical) at all samples          69700000
                                       (long floating point)     @C2A*/ 69750000
    3 R724VECT CHAR(8),             /* Total vector utilization         69800000
                                       time for the group               69850000
                                       (Format: long floating point     69900000
                                        Unit: microseconds)      @C2A*/ 69950000
    3 R724ET   CHAR(8),             /* Total elapsed time for all       70000000
                                       transactions that ended in       70050000
                                       the group. Does not include      70100000
                                       queued time.                     70150000
                                       (Format: long floating point     70200000
                                        Unit: microseconds)      @C2A*/ 70250000
    3 R724QT   CHAR(8),             /* Total time spent on JES or       70300000
                                       APPC queues by all transactions  70350000
                                       that ended in the group          70400000
                                       (Format: long floating point     70450000
                                        Unit: microseconds)      @C2A*/ 70500000
    3 R724END  CHAR(8),             /* The number of transactions       21010002
                                       that ended in the group          70600000
                                       (Format: long floating point     70650000
                                        Unit: microseconds)      @C2A*/ 21040002
    ?ERBFITEM(3 R724TSV) FLOAT(56);, /* Sum of                          21040105
                                       shared page views                21040202
                                       (long floating point)     @D1A*/ 21040302
    ?ERBFITEM(3 R724VIN) FLOAT(56);, /* Sum of shared pages in central  21040402
                                       storage, that are valid          21040502
                                       (long floating point)     @D1A*/ 21040602
    ?ERBFITEM(3 R724VLC) FLOAT(56);, /* Sum of shared page validations  21040702
                                       (long floating point)     @D1A*/ 21040802
    ?ERBFITEM(3 R724GPI) FLOAT(56);; /* Sum of shared page-ins          21040902
                                       from auxiliary storage           21041002
                                       (long floating point)     @D1A*/ 21042002
 @SPACE;                                                                70750000
    /* Swap Reason Data Section (Subtype 4)                      @C2A*/ 70800000
 DECLARE                                                                70850000
  1 R724SWRE BASED(ADDR(SMF72HDR)+SMF72SPS),                  /* @C2A*/ 70900000
    3 R724OR1  FIXED(32),           /* STOR/OUTR delay samples for      70950000
                                       swap reason 1:                   71000000
                                       Terminal output wait  @WA03905*/ 71050052
    3 R724OR2  FIXED(32),           /* STOR/OUTR delay samples for      71100000
                                       swap reason 2:                   71150000
                                       Terminal input wait   @WA03905*/ 71200052
    3 R724OR3  FIXED(32),           /* STOR/OUTR delay samples for      71250000
                                       swap reason 3:                   71300000
                                       Long wait                 @C2A*/ 71350000
    3 R724OR4  FIXED(32),           /* STOR/OUTR delay samples for      71400000
                                       swap reason 4:                   71450000
                                       Auxiliary storage shortage       71500000
                                                                 @C2A*/ 71550000
    3 R724OR5  FIXED(32),           /* STOR/OUTR delay samples for      71600000
                                       swap reason 5:                   71650000
                                       Real storage shortage     @C2A*/ 71700000
    3 R724OR6  FIXED(32),           /* STOR/OUTR delay samples for      71750000
                                       swap reason 6:                   71800000
                                       Detected long wait        @C2A*/ 71850000
    3 R724OR7  FIXED(32),           /* STOR/OUTR delay samples for      71900000
                                       swap reason 7:                   71950000
                                       Requested swap            @C2A*/ 72000000
    3 R724OR8  FIXED(32),           /* STOR/OUTR delay samples for      72050000
                                       swap reason 8:                   72100000
                                       Enqueue exchange swap     @C2A*/ 72150000
    3 R724OR9  FIXED(32),           /* STOR/OUTR delay samples for      72200000
                                       swap reason 9:                   72250000
                                       Exchange swap             @C2A*/ 72300000
    3 R724OR10 FIXED(32),           /* STOR/OUTR delay samples for      72350000
                                       swap reason 10:                  72400000
                                       Unilateral swap           @C2A*/ 72450000
    3 R724OR11 FIXED(32),           /* STOR/OUTR delay samples for      72500000
                                       swap reason 11:                  72550000
                                       Transition swap           @C2A*/ 72600000
    3 R724OR12 FIXED(32),           /* STOR/OUTR delay samples for      72650000
                                       swap reason 12:                  72700000
                                       Improve central storage usage    72750000
                                                                 @C2A*/ 72800000
    3 R724OR13 FIXED(32),           /* STOR/OUTR delay samples for      72850000
                                       swap reason 13:                  72900000
                                       Improve system paging rate       72950000
                                                                 @C2A*/ 73000000
    3 R724OR14 FIXED(32),           /* STOR/OUTR delay samples for      73050000
                                       swap reason 14:                  73100000
                                       Make room for an out too long    73150000
                                       user                      @C2A*/ 73200000
    3 R724OR15 FIXED(32),           /* STOR/OUTR delay samples for      73250000
                                       swap reason 15:                  73300000
                                       APPC wait                 @C2A*/ 73350000
    3 R724OR16 FIXED(32),           /* STOR/OUTR delay samples for      73400000
                                       swap reason 16:                  73450000
                                       OMVS input wait           @C2A*/ 73500000
    3 R724OR17 FIXED(32);           /* STOR/OUTR delay samples for      73550000
                                       swap reason 17:                  73600000
                                       OMVS output wait          @C2A*/ 73650000
 @SPACE;                                                                73700000
 %LR72END:;                         /*                           @C1C*/ 73750000
