*/*      Bilingual Mapping Macro for SMF Record 74                      00001000
         MACRO                                                          00002000
         ERBSMF74 &STYPE                                             */ 00003000
*/*** START OF SPECIFICATIONS ****************************************  00004000
*                                                                    *  00005000
*01* Proprietary Statement:                                          *  00006000
         ERBCOPY1 Y1=1983                                        @A1C*/ 00007000
*       ?ERBCOPY1 Y1(1983);                                             00008000
*/*                                                                  *  00009000
*01* Macro Name: ERBSMF74                                            *  00010000
*                                                                    *  00011000
*01* Descriptive Name:  SMF RECORD 74 (Device, XCF, OMVS, XES,   @H1C*  00012000
*                       CACHE, HFS activity)                     @H1C*  00013000
*02* Acronym: SMF74                                                  *  00014000
*                                                                    *  00015000
*01* DSECT Name:                                                     *  00016000
*02*  Subtype 1: SMF74HDR SMF74PRO SMF74A SMF74B                     *  00017000
*02*  Subtype 2: SMF74HDR SMF74PRO R742CNTL R742SYS R742PTH R742MBR  *  00018000
*02*  Subtype 3: SMF74HDR SMF74PRO R743DATA                          *  00019000
*02*  Subtype 4: SMF74HDR SMF74PRO R744FLCF R744XCON R744GSRG        *  00020000
*                R744QSDS R744SREQ R744PROC                          *  00021000
*02*  Subtype 5: SMF74HDR SMF74PRO R745CNTL R745DEV R745XDEV     @E1A*  00022000
*                R7451DEV R745STAT                           @WA37816*  00023000
*02*  Subtype 6: SMF74HDR SMF74PRO R746GDAT R746GBUF R746FSYS    @H1A*  00024000
*02*  Subtype 7: SMF74HDR SMF74PRO R747GDAT R747SDAT R747PDAT    @I1A*  00025000
*02*             R747CDAT                                        @I1A*  00026000
*                                                                    *  00027000
*01* Component: Resource Measurement Facility (27404)                *  00028000
*                                                                    *  00029000
*01* Eye-Catcher: None                                               *  00030000
*02*  Offset: N/A                                                    *  00031000
*02*  Length: N/A                                                    *  00032000
*                                                                    *  00033000
*01* Storage Attributes:                                             *  00034000
*02*   Subpool: see below                                            *  00035000
*03*      Subtype 1: 0                                               *  00036000
*03*      Subtype 2: 10                                              *  00037000
*03*      Subtype 3: 10                                              *  00038000
*03*      Subtype 4: 10                                              *  00039000
*03*      Subtype 5: 0                                           @E1A*  00040000
*03*      Subtype 6: 10                                          @H1A*  00041000
*03*      Subtype 7: 0                                           @I1A*  00042000
*02*   Key:     8                                                    *  00043000
*02*   Residency: Any                                                *  00044000
*02*   Main Storage: N/A                                             *  00045000
*02*   Auxiliary Storage: N/A                                        *  00046000
*02*   Virtual Storage: N/A                                          *  00047000
*                                                                    *  00048000
*01* FUNCTION = This macro maps the complete SMF record type 74.     *  00049000
*              It has six subtypes:                              @H1C*  00050000
*              - Subtype 1 is created by Monitor I device activity   *  00051000
*                measurement.                                        *  00052000
*              - Subtype 2 is created by Monitor III XCF measurement.*  00053000
*                (Cross-System Coupling Facility)                @Y1A*  00054000
*              - Subtype 3 is created by Monitor III OMVS support.   *  00055000
*                                                                @B1A*  00056000
*              - Subtype 4 is created by Monitor III XES support.    *  00057000
*                                                                @C1A*  00058000
*              - Subtype 5 is created by Monitor I CACHE support     *  00059000
*                                                                @E1A*  00060000
*              - Subtype 6 is created by Monitor III HFS support.    *  00061000
*                                                                @H1A*  00062000
*              - Subtype 7 is created by Monitor I FICON         @I1A*  00063000
*                Director support.                               @I1A*  00064000
*              The record consists of the following parts.           *  00065000
*              1. The fixed portion of the SMF header.               *  00066000
*                 This mapping is included by calling ERBHDR macro.  *  00067000
*              2. The individual header extension which contains     *  00068000
*                 offset/length/number triplets to address the       *  00069000
*                 record parts following the RMF product section.    *  00070000
*              3. The RMF product section.                           *  00071000
*                 This mapping is included by calling ERB74PRO macro *  00072000
*              4. The control data section (not in subtype 4)        *  00073000
*              5. The data sections.                                 *  00074000
*                 - Subtype 1 has one type of data sections.     @Y1C*  00075000
*                 - Subtype 2 has three types of data sections.  @Y1A*  00076000
*                 - Subtype 3 has one data section               @B2A*  00077000
*                 - Subtype 4 has six data sections              @C1A*  00078000
*                 - Subtype 5 has five types of data sections    @G2C*  00079000
*                 - Subtype 6 has three types of data sections   @H1A*  00080000
*                 - Subtype 7 has four types of data sections    @I1A*  00081000
*                                                                    *  00082000
*01* NOTES: None                                                     *  00083000
*                                                                    *  00084000
*01* Size:                                                           *  00085000
*                                                                    *  00086000
*     Subtype 1:                                                     *  00087000
*                                                                    *  00088000
*        - Common header   :  36 bytes                               *  00089000
*        - Header extension:  16 bytes                               *  00090000
*        - Product section : see ERBPRO macro                        *  00091000
*        - Control section : 100 bytes (each)                        *  00092000
*        - Data section    : 156 bytes (each)                    @C2C*  00093000
*                                                                    *  00094000
*     Subtype 2:                                                     *  00095000
*                                                                    *  00096000
*        - Common header   :  36 bytes                               *  00097000
*        - Header extension:  24 bytes                               *  00098000
*        - Product section : see ERBPRO macro                        *  00099000
*        - Control section :  28 bytes (each)                        *  00100000
*        - Data section                                              *  00101000
*          -> System data  :  56 bytes (each)                        *  00102000
*          -> Path data    :  88 bytes (each)                        *  00103000
*          -> Member data  :  44 bytes (each)                        *  00104000
*                                                                    *  00105000
*     Subtype 3:                                                     *  00106000
*                                                                    *  00107000
*        - Common header   :  36 bytes                               *  00108000
*        - Header extension:   8 bytes                               *  00109000
*        - Product section : see ERBPRO macro                        *  00110000
*        - Data section :    140 bytes (each)                    @I5A*  00111000
*                                                                    *  00112000
*     Subtype 4:                                                     *  00113000
*                                                                    *  00114000
*        - Common header   :  36 bytes                               *  00115000
*        - Header extension:  56 bytes                               *  00116000
*        - Product section : see ERBPRO macro                        *  00117000
*        - Data section                                              *  00118000
*          -> Local CF     :  84 bytes (each)                        *  00119000
*          -> Connectivity :   8 bytes (each)                        *  00120000
*             (only available if R744FCEI is ON)                     *  00121000
*          -> Storage      :  28 bytes (each)                        *  00122000
*          -> Structure    :  32 bytes (each)                        *  00123000
*             (only available if R744FCEI is ON)                     *  00124000
*          -> Request      : 240 bytes (each)                        *  00125000
*          -> Processor    :  12 bytes (each)                        *  00126000
*                                                                    *  00127000
*     Subtype 5:                                                 @E1A*  00128000
*                                                                @E1A*  00129000
*        - Common header   :  36 bytes                           @E1A*  00130000
*        - Header extension:  40 bytes                           @G2C*  00131000
*        - Product section : see ERBPRO macro                    @E1A*  00132000
*        - Data section                                          @E1A*  00133000
*          -> control      :  44 bytes                           @G2C*  00134000
*          -> device       : 124 bytes (per device)              @E1A*  00135000
*          -> device_ext   :  88 bytes (per device)              @E1A*  00136000
*          -> device_ext1  :  88 bytes (per device)          @WA37816*  00137000
*          -> Status       :  72 bytes                           @G2C*  00138000
*                                                                    *  00139000
*     Subtype 6:                                                 @H1A*  00140000
*                                                                @H1A*  00141000
*        - Common header   :  36 bytes                           @H1A*  00142000
*        - Header extension:  24 bytes                           @H1A*  00143000
*        - Product section : see ERBPRO macro                    @H1A*  00144000
*        - Data section                                          @H1A*  00145000
*          -> global data  :  72 bytes                           @H1A*  00146000
*          -> global buffer:  32 bytes (per buffer, currently 4) @H1A*  00147000
*          -> file system  : 192 bytes (per file system)         @H1A*  00148000
*                                                                    *  00149000
*     Subtype 7:                                                 @I1A*  00150000
*                                                                @I1A*  00151000
*        - Common header    :  36 bytes                          @I1A*  00152000
*        - Header extension :  32 bytes                          @I1A*  00153000
*        - Product section  : see ERBPRO macro                   @I1A*  00154000
*        - Data section                                          @I1A*  00155000
*          -> global data   :  80 bytes                          @I1A*  00156000
*          -> switch data   :  48 bytes                          @I1A*  00157000
*          -> port data     :  72 bytes (per port section)       @I1A*  00158000
*          -> connector data:   8 bytes (per connector section)  @I1A*  00159000
*                                                                    *  00160000
*           SMF records cannot exceed a length of 32,756 bytes.      *  00161000
*           A Logical record which is longer than 32k is broken      *  00162000
*           into physical 32k records.                               *  00163000
*                                                                    *  00164000
*01* Method of Access: See below:                                    *  00165000
*                                                                    *  00166000
*    BAL : ERBSMF74 type                                             *  00167000
*          If 'type' is omitted, generates the mapping for   @WA05544*  00168000
*          all subtypes                                      @WA05544*  00169000
*                                                                    *  00170000
*    PL/X: %IFAR74n='YES' semicolon n = subtype selected             *  00171000
*          %INCLUDE SYSLIB(ERBSMF74) semicolon                       *  00172000
*                                                                    *  00173000
*          If the preprocessor variable %IFAR74n is not set          *  00174000
*          in the including module, subtype 1 is included.           *  00175000
*                                                                    *  00176000
*01* Pointed to by: SMF74PTR                                         *  00177000
*                                                                    *  00178000
*01* Serialization: None                                             *  00179000
*                                                                    *  00180000
*01* Created by:                                                     *  00181000
*                                                                    *  00182000
*02*     Subtype 1: ERBMFDDP                                         *  00183000
*02*     Subtype 2: ERB3GXCF                                         *  00184000
*02*     Subtype 3: ERB3GIXC                                         *  00185000
*02*     Subtype 4: ERB3GCFI                                         *  00186000
*02*     Subtype 5: ERBMFXCR                                         *  00187000
*02*     Subtype 6: ERB3GHFS                                     @H1A*  00188000
*02*     Subtype 7: ERBMFDFD                                     @I1A*  00189000
*                                                                    *  00190000
*01* Deleted by:                                                     *  00191000
*                                                                    *  00192000
*02*     Subtype 1: ERBMFDDP                                         *  00193000
*02*     Subtype 2: ERB3GXCF                                         *  00194000
*02*     Subtype 3: ERB3GIXC                                         *  00195000
*02*     Subtype 4: ERB3GCFI                                         *  00196000
*02*     Subtype 5: ERBMFXCR                                         *  00197000
*02*     Subtype 6: ERB3GHFS                                     @H1A*  00198000
*02*     Subtype 7: ERBMFDFD                                     @I1A*  00199000
*                                                                    *  00200000
*01* Module-type: BILINGUAL MAPPING MACRO                            *  00201000
*                                                                    *  00202000
*01* Status: HRM7703                                             @I1C*  00203000
*                                                                    *  00204000
*01* Frequency: 1                                                    *  00205000
*                                                                    *  00206000
*01* Dependencies: None                                              *  00207000
*                                                                    *  00208000
*01* Distribution Library: ARMFMAC1                              @B1C*  00209000
*                                                                    *  00210000
*01* CHANGE-ACTIVITY = SEE BELOW                                     *  00211000
*                                                                    *  00212000
*     $N0=MON1,HRM3102,,SHR: REWRITTEN FOR RMF 3.1               @N0A*  00213000
*     IMPROVEMENT FOR LONG RUNNING CHANNEL PROGRAMS          @ZA63802*  00214000
*     $P1=3090,HRM3302,,MLN: 3090 support                        @P1A*  00215000
*     $Q1=MISC,HRM3402,,SHR: Corrects ERBCOPY1 parameter syntax  @Q1A*  00216000
*     $U1=SGSUP,JRM3512,,KLZ: Storage group support              @U1A*  00217000
*     $U2=UCBDMC,JRM3512,,TJI: UCBDMC constraint relief          @U2A*  00218000
*     $Y1=XCF,HRM4420,,THE: XCF support                          @Y1A*  00219000
*     $Y2=DMSR,HRM4420,,THE: Model Type (SHARE SOMVSP87001)      @Y2A*  00220000
*     $Z1=OY29112,HRM4420,,WRC: Serial & switch Support          @Z1A*  00221000
*     $A1=DYNIO,JRM4421,,RV: Dynamic I/O Support                 @A1A*  00222000
*     $B1=TAPE,HRM4430,,HBE: Tape Allocation                     @B1A*  00223000
*     $B2=OMVS,HRM4430,,HUO: OPEN/MVS Kernel Activity Report     @B2A*  00224000
*     JS : Corrects Mismatch between PLX and Assembler Part  @YA62787*  00225000
*     LAN: Comment changes only (IODF creation date & time)  @YA64585*  00226000
*     $C1=XES,HRM4440,,AJU: XES/CF Support                       @C1A*  00227000
*     LAN: Corrects ORG statement of subtype 3               @YA66439*  00228000
*     $C2=PPSDV,HRM5510,,FF: Shared device report data gathering @C2A*  00229000
*      JS: Support for CTCs with special protocol            @WA03326*  00230000
*          ( never ending channel programs )                 @WA03326*  00231000
*          equivalent to OW00541                             @WA03326*  00232000
*     AJU: Coupling facility redesign (5.1.0 upgrade APAR)   @WA04653*  00233000
*     GBO: Cleanup of PADI-inconsistencies                   @WA05544*  00234000
*     PFU: Provide shared/assigned indication for shared     @WA07295*  00235000
*          device report                                     @WA07295*  00236000
*     DK: RMF SPE for MVS 5.2.2 OpenEdition Release 3        @WA10257*  00237000
*     AJU: Corrects comment for SMF74NUM and SMF74LCU        @WA16885*  00238000
*     SUW: Add flag SMF74DDT - Device disconnect time is     @WA15094*  00239000
*          invalid.                                          @WA15094*  00240000
*     JS: RMF Support for CF Cache Statistic                 @WA20293*  00241000
*     $E1=Cache,WA18886,,THE: Cache Controller Support           @E1A*  00242000
*     THE:  Year 2000 support. IODF creation date.           @WA19913*  00243000
*     AJU:  Update comments in subtype 5 STAT section        @WA22065*  00244000
*     AJU:  Completes description of R742PSTA, R745SS0       @WA22735*  00245000
*           R745SS1, R745SNS0 and R745SNS1                   @WA22735*  00246000
*     $F1=CF,HRM6604,,AJU: Add coupling fac. model description   @F1A*  00247000
*     $G1=CF,HRM6606,,AJU: Change comment of R744QSIZ            @G1A*  00248000
*     $G2=CACHE,HRM6606,,THE: Real Hardware CUID and             @G2A*  00249000
*           2105 support.                                    @WA37816*  00250000
*           Corrects Mismatch between PLX and Assembler Part     @G2A*  00251000
*     $G3=PAV,HRM6606,,PS: PAV Devices Support                   @G3A*  00252000
*     $H1=HFS,HRM6607,,SHR: HFS support                          @H1A*  00253000
*     THE:  2105 support and subtype 6 correction            @WA37816*  00254000
*     $I1=FCD,HRM7703,,SHR: FICON director support               @I1A*  00255000
*     $I2=TBIT,HRM7703,,SHR: Honors T-bit in SCHIB               @I2A*  00256000
*     $I3=MISC,HRM7703,,WLR: Correct calculation when CHPIDs set     *  00257000
*                            offline                             @I3A*  00258000
*     SHR: PAV device support                                @WA31701*  00259000
*     $I5=USS,HRM7703,,HOL: UNIX System Services Support         @I5A*  00260000
*     THE:  XCF path data section: Average I/O transfer time @WA41317*  00261000
*                                  R742PIOT added.           @WA41317*  00262000
*     FDL:  Corrects comments on subtype 3 (OMVS) record     @WA46170*  00262500
*     SHR: FICON director support enhancements               @WA46825*  00263290
*                                                                    *  00263580
****** END OF SPECIFICATIONS *****************************************/ 00264000
*        %GOTO PLS74;                                                   00265000
*/*                                                                     00266000
         SPACE 2                                                        00267000
**********************  COMMON SMF HEADER  **************************** 00268000
         ERBHDR 74                                                      00269000
         SPACE 3                                                        00270000
**********************  INDIVIDUAL HEADER EXTENSION  ****************** 00271000
         SPACE 3                                                        00272000
         LCLC  &X                                                 @Y1A  00273000
&X       SETC  T'&STYPE                                           @Y1A  00274000
         AIF   ('&X' EQ 'O').HDREXT1                              @Y1A  00275000
         AIF   (&STYPE EQ 1).HDREXT1                              @Y1A  00276000
         AIF   (&STYPE EQ 2).HDREXT2                              @Y1A  00277000
         AIF   (&STYPE EQ 3).HDREXT3                              @B2A  00278000
         AIF   (&STYPE EQ 4).HDREXT4                              @C1A  00279000
         AIF   (&STYPE EQ 5).HDREXT5                              @E1A  00280000
         AIF   (&STYPE EQ 6).HDREXT6                              @H1A  00281000
         AIF   (&STYPE EQ 7).HDREXT7                              @I1A  00282000
         SPACE 3                                                  @Y1A  00283000
.ERROR   MNOTE 8,'&STYPE INVALID RECORD SUBTYPE SPECIFIED'        @Y1A  00284000
.CONTB   ANOP                                                     @Y1A  00285000
         MEXIT                                                    @Y1A  00286000
.HDREXT1 ANOP                                                     @Y1A  00287000
         SPACE 3                                                        00288000
**********************  Subtype 1    **************************** @Y1A  00289000
         SPACE 3                                                        00290000
SMF74HDX DS    0CL16    TOTAL HEADER EXTENSION                @WA05544  00291000
SMF74DCS DS    BL4      OFFSET TO DEVICE CONTROL DATA SECTION           00292000
SMF74DCL DS    BL2      LENGTH OF DEVICE CONTROL DATA SECTION           00293000
SMF74DCN DS    BL2      NUMBER OF DEVICE CONTROL DATA SECTIONS          00294000
SMF74DDS DS    BL4      OFFSET TO DEVICE DATA SECTION                   00295000
SMF74DDL DS    BL2      LENGTH OF DEVICE DATA SECTION                   00296000
SMF74DDN DS    BL2      NUMBER OF DEVICE DATA SECTIONS                  00297000
         AIF   (&STYPE EQ 1).PROSEC                               @Y1A  00298000
         SPACE 3                                                        00299000
         ORG   SMF74DCS                                           @Y1A  00300000
.HDREXT2 ANOP                                                     @Y1A  00301000
**********************  Subtype 2    **************************** @Y1A  00302000
         SPACE 3                                                        00303000
SMF742HX DS    0CL32    Total Header extension                @WA05544  00304000
SMF742CO DS    BL4      Offset to control data section            @Y1A  00305000
SMF742CL DS    BL2      Length of control data section            @Y1A  00306000
SMF742CN DS    BL2      Number of control data sections           @Y1A  00307000
SMF742SO DS    BL4      Offset to system data section             @Y1A  00308000
SMF742SL DS    BL2      Length of system data section             @Y1A  00309000
SMF742SN DS    BL2      Number of system data sections            @Y1A  00310000
SMF742PO DS    BL4      Offset to path data section               @Y1A  00311000
SMF742PL DS    BL2      Length of path data section               @Y1A  00312000
SMF742PN DS    BL2      Number of path data sections              @Y1A  00313000
SMF742MO DS    BL4      Offset to member data section             @Y1A  00314000
SMF742ML DS    BL2      Length of member data section             @Y1A  00315000
SMF742MN DS    BL2      Number of member data sections            @Y1A  00316000
         SPACE 2                                                        00317000
         AIF   (&STYPE EQ 2).PROSEC                           @YA62787  00318000
         ORG   SMF742CO                                           @B2C  00319000
.HDREXT3 ANOP                                                     @B2A  00320000
**********************  Subtype 3    ************************ @YA62787  00321000
         SPACE 3                                                        00322000
SMF743HX DS    0CL8     Total Header extension                @WA05544  00323000
SMF743PO DS    BL4      Offset to data section                    @B2A  00324000
SMF743PL DS    BL2      Length of data section                @YA62787  00325000
SMF743PN DS    BL2      Number of data sections               @YA62787  00326000
         SPACE 2                                                        00327000
         AIF   (&STYPE EQ 3).PROSEC                               @B2A  00328000
         ORG SMF743PO                                             @C1C  00329000
.HDREXT4 ANOP                                                     @C1A  00330000
**********************  Subtype 4    **************************** @C1A  00331000
         SPACE 3                                                        00332000
SMF744HX DS    0CL56    Total Header extension                    @G1C  00333000
SMF744FO DS    BL4      Offset to local CF data section           @C1A  00334000
SMF744FL DS    BL2      Length of local CF data section           @C1A  00335000
SMF744FN DS    BL2      Number of local CF data sections          @C1A  00336000
SMF744XO DS    BL4      Offset to connectivity CF data section    @C1A  00337000
SMF744XL DS    BL2      Length of connectivity CF data section    @C1A  00338000
SMF744XN DS    BL2      Number of connectivity CF data section    @C1A  00339000
SMF744GO DS    BL4      Offset to storage CF data section         @C1A  00340000
SMF744GL DS    BL2      Length of storage CF data section         @C1A  00341000
SMF744GN DS    BL2      Number of storage CF data section         @C1A  00342000
SMF744QO DS    BL4      Offset to structure CF data section       @C1A  00343000
SMF744QL DS    BL2      Length of structure CF data section       @C1A  00344000
SMF744QN DS    BL2      Number of structure CF data section       @C1A  00345000
SMF744SO DS    BL4      Offset to request CF data section         @C1A  00346000
SMF744SL DS    BL2      Length of request CF data section         @C1A  00347000
SMF744SN DS    BL2      Number of request CF data section         @C1A  00348000
SMF744PO DS    BL4      Offset to processor CF data section       @C1A  00349000
SMF744PL DS    BL2      Length of processor CF data section       @C1A  00350000
SMF744PN DS    BL2      Number of processor CF data sections      @C1A  00351000
SMF744CO DS    BL4      Offset to CF Cache Data Section       @WA20293  00352000
SMF744CL DS    BL2      Length of CF Cache Data Section       @WA20293  00353000
SMF744CN DS    BL2      Number of CF Cache Data Sections      @WA20293  00354000
         SPACE 2                                                  @C1A  00355000
         AIF   (&STYPE EQ 4).PROSEC                               @E1C  00356000
         ORG SMF744FO                                             @C1A  00357000
.HDREXT5 ANOP                                                     @C1A  00358000
**********************  Subtype 5    **************************** @E1A  00359000
         SPACE 3                                                        00360000
SMF745HX DS    0CL40    Total Header extension                    @E1C  00361000
SMF745CO DS    BL4      Offset to control data section            @E1A  00362000
SMF745CL DS    BL2      Length of control data section            @E1A  00363000
SMF745CN DS    BL2      Number of control data sections           @E1A  00364000
SMF745DO DS    BL4      Offset to CACHE device data section       @E1A  00365000
SMF745DL DS    BL2      Length of CACHE device data section       @E1A  00366000
SMF745DN DS    BL2      Number of CACHE device data sections      @E1A  00367000
SMF745XO DS    BL4      Offset to CACHE device data extension     @E1A  00368000
SMF745XL DS    BL2      Length of CACHE device data extension     @E1A  00369000
SMF745XN DS    BL2      Number of CACHE device data extensions    @E1A  00370000
SMF745SO DS    BL4      Offset to CACHE status data section       @E1A  00371000
SMF745SL DS    BL2      Length of CACHE status data section       @E1A  00372000
SMF745SN DS    BL2      Number of CACHE status data sections      @E1A  00373000
SMF7451O DS    BL4      Offset to RAID rank data section      @WA37816  00374000
SMF7451L DS    BL2      Length of RAID rank data section      @WA37816  00375000
SMF7451N DS    BL2      Number of RAID rank data sections     @WA37816  00376000
         SPACE 2                                                  @C1A  00377000
         AIF   (&STYPE EQ 5).PROSEC                               @C1A  00378000
         ORG SMF745CO                                             @E1C  00379000
.HDREXT6 ANOP                                                     @H1A  00380000
**********************  Subtype 6    **************************** @H1A  00381000
         SPACE 3                                                        00382000
SMF746HX DS    0CL24    Total Header extension                    @H1A  00383000
SMF746DO DS    BL4      Offset to global data section         @WA37816  00384000
SMF746DL DS    BL2      Length of global data section         @WA37816  00385000
SMF746DN DS    BL2      Number of global data sections        @WA37816  00386000
SMF746BO DS    BL4      Offset to global buffer section           @H1A  00387000
SMF746BL DS    BL2      Length of global buffer section           @H1A  00388000
SMF746BN DS    BL2      Number of global buffer sections          @H1A  00389000
SMF746FO DS    BL4      Offset to file system data section        @H1A  00390000
SMF746FL DS    BL2      Length of file system data section        @H1A  00391000
SMF746FN DS    BL2      Number of file system data sections       @H1A  00392000
         AIF   (&STYPE EQ 6).PROSEC                               @I1A  00393000
         SPACE 3                                                        00394000
         ORG   SMF746DO                                           @I1A  00395000
.HDREXT7 ANOP                                                     @I1A  00396000
**********************  Subtype 7  ****************************** @I1A  00397000
         SPACE 3                                                        00398000
SMF747HX DS    0CL32    Total Header extension                    @I1A  00399000
SMF747GO DS    BL4      Offset to global data section             @I1A  00400000
SMF747GL DS    BL2      Length of global data section             @I1A  00401000
SMF747GN DS    BL2      Number of global data section             @I1A  00402000
SMF747SO DS    BL4      Offset to switch data section             @I1A  00403000
SMF747SL DS    BL2      Length of switch data section             @I1A  00404000
SMF747SN DS    BL2      Number of switch data sections            @I1A  00405000
SMF747PO DS    BL4      Offset to port data section               @I1A  00406000
SMF747PL DS    BL2      Length of port data section               @I1A  00407000
SMF747PN DS    BL2      Number of port data sections              @I1A  00408000
SMF747CO DS    BL4      Offset to port data section               @I1A  00409000
SMF747CL DS    BL2      Length of port data section               @I1A  00410000
SMF747CN DS    BL2      Number of port data sections              @I1A  00411000
         SPACE 2                                                        00412000
         AIF   (&STYPE NE 0).PROSEC                               @H1A  00413000
         ORG   SMF747GO                                           @I1C  00414000
.PROSEC  ANOP                                                     @Y1A  00415000
         SPACE 2                                                        00416000
**********************  COMMON RMF PRODUCT SECTION  ******************* 00417000
         ERBPRO 74                                                      00418000
         SPACE 2                                                        00419000
         AIF   (&STYPE EQ 2).SUBTYP2                              @Y1A  00420000
         AIF   (&STYPE EQ 3).SUBTYP3                              @B2A  00421000
         AIF   (&STYPE EQ 4).SUBTYP4                              @C1A  00422000
         AIF   (&STYPE EQ 5).SUBTYP5                              @E1A  00423000
         AIF   (&STYPE EQ 6).SUBTYP6                              @H1A  00424000
         AIF   (&STYPE EQ 7).SUBTYP7                              @I1A  00425000
*********************************************************************** 00426000
*                                                                     * 00427000
*              Relocate blocks for sub type 1 - Monitor I             * 00428000
*              Device data.                                           * 00429000
*                                                                     * 00430000
*********************************************************************** 00431000
         SPACE 2                                                        00432000
****************  Subtype 1 Device Control Section  ******************* 00433000
SMF74A   DSECT                                                          00434000
SMF74NXT DS    BL2      NUMBER OF DEVICE DATA SECTIONS IN FOLLOWING     00435000
*                       RECORDS FOR THIS CLASS                          00436000
SMF74TOT DS    BL2      NUMBER OF DEVICE DATA SECTIONS IN ALL           00437000
*                       RECORDS FOR THIS CLASS                          00438000
SMF74GEN DS    BL2      TOTAL NUMBER OF DEVICES SPECIFIED FOR ALL       00439000
*                       CLASSES AT SYSTEM GENERATION                    00440000
SMF74SUB DS    BL2      DEVICE CLASS CODE:                              00441000
*                       '0080'X - MAGNETIC TAPE DEVICES                 00442000
*                       '0040'X - COMMUNICATION EQUIPMENT               00443000
*                       '0020'X - DIRECT ACCESS DEVICES                 00444000
*                       '0010'X - GRAPHICS DEVICES                      00445000
*                       '0008'X - UNIT RECORD DEVICES                   00446000
*                       '0004'X - CHARACTER READER DEVICES              00447000
SMF74DFL DS    0BL2     Device class flags                    @WA05544  00448000
SMF74DCF DS    BL1      Processing flags for DASD device class    @U1A  00449000
SMF74NRF EQU   X'80'    1... ....  ON = Causes two report areas   @U1A  00450000
SMF74SGF EQU   X'40'    .1.. ....  ON = Causes sort by SG         @U1A  00451000
*                       ..11 1111  Not used                       @U1A  00452000
SMF74DMS DS    BL1      Message flags for DASD device class       @U1A  00453000
SMF74429 EQU   X'80'    1... ....  ON = Message ERB429I           @U1A  00454000
SMF74SME EQU   X'40'    .1.. ....  ON = SMS Interface Error       @U1A  00455000
*                       ..11 1111  Not used                       @U1A  00456000
         DS    CL2      Not used                                  @U1A  00457000
SMF74CDF DS    0CL12    Device class dependant fields         @WA05544  00458000
SMF74S15 DS    BL4      Reg 15 after SMS interface call (SSI RC)  @U1A  00459000
SMF74SRC DS    BL4      Return code from SMS interface  (SSOB RC) @U1A  00460000
SMF74SRS DS    BL4      Reason code from SMS interface  (SSOB RS) @U1A  00461000
SMF74TSR DS    BL2      Number of small records written for this  @A1A  00462000
*                       class during interval                     @A1A  00463000
SMF74CFL DS    BL1      Configuration Change Flags                @A1A  00464000
SMF74DCA EQU   X'80'    1... ....  ON = Config. Changed during    @A1A  00465000
*                                       interval                  @A1A  00466000
SMF74IAC EQU   X'40'    .1.. ....  ON = Config. Changed since IPL @A1A  00467000
SMF74IOD EQU   X'20'    ..1. ....  ON = System IPLed via IODF     @A1A  00468000
SMF74ICV EQU   X'10'    ...1 ....  ON = I/O Conf. Token is vaild  @A1A  00469000
*                       .... 1111  reserved                       @A1A  00470000
         DS    BL3      reserved                                  @A1A  00471000
SMF74TNM DS    CL44     IODF name                                 @A1A  00472000
SMF74TSF DS    CL2      Suffix of IODF Name                       @A1A  00473000
         DS    CL2      Reserved for Alignement                   @A1A  00474000
SMF74TOK DS    0CL16    IODF creation info                    @WA05544  00475000
SMF74TDT DS    CL8      IODF creation date mm/dd/yy           @YA64585  00476000
SMF74TTM DS    CL8      IODF creation time hh.mm.ss           @YA64585  00477000
         DS    CL2      Reserved for Alignement                   @B1A  00478000
SMF74MCT DS    BL4      Maximum number of allocated tape devices  @B1A  00479000
SMF74TDY DS    CL10     IODF creation date mm/dd/yyyy         @WA19913  00480000
         DS    CL2      Reserved for Alignement               @WA19913  00481000
         SPACE 2                                                        00482000
**************  Subtype 1 Device Data Section  ************************ 00483000
         SPACE 3                                                        00484000
SMF74B   DSECT                                                          00485000
SMF74NUM DS    BL2      DEVICE NUMBER IN THE RANGE X'0000' TO X'FFFF'   00486000
SMF74LCU DS    BL2      LOGICAL CONTROL UNIT NUMBER (0000 TO FFFF)      00487000
SMF74RV3 DS    BL1      internally used                           @P1C  00488000
SMF74CNF DS    BL1      DEVICE FLAGS:                                   00489000
SMF74QUL EQU   X'80'    1... ....   ON= QUEUE LENGTH INVALID            00490000
SMF74LCD EQU   X'40'    .1.. ....   ON= NO LCU DATA                     00491000
SMF74CMB EQU   X'20'    ..1. ....   ON= CMB DATA INVALID                00492000
SMF74DEL EQU   X'10'    ...1 ....   ON= Device has been deleted   @A1C  00493000
SMF74PAR EQU   X'08'    .... 1...   ON= ONLY PARTIAL STATISTICS         00494000
*                                       AVAILABLE                       00495000
SMF74MXB EQU   X'04'    .... .1..   ON= DEVICE IS MULTIPLE EXPOSURE     00496000
*                                       DEVICE; THIS IS BASE EXPOSURE   00497000
SMF74VAC EQU   X'02'    .... ..1.   ON= DATA RECORDED IS INVALID        00498000
*                                       BECAUSE DEVICE WAS VARIED       00499000
*                                       DURING INTERVAL                 00500000
SMF74STA EQU   X'01'    .... ...1   ON= DEVICE IS CURRENTLY ONLINE      00501000
SMF74SER DS    CL6      VOLUME SERIAL NUMBER OF MOUNTED VOLUME          00502000
SMF74TYP DS    BL4      UNIT TYPE                                       00503000
SMF74NUX DS    BL4      NUMBER OF EXPOSURES (IF MULTIPLE)               00504000
SMF74DTA DS    0CL80    Area to be cleared, if DYNIO          @WA05544  00505000
SMF74HWM DS    0CL24    Area to be cleared, if CMB data inv.  @WA05544  00506000
SMF74SSC DS    BL4      START SUBCHANNEL (SSCH) COUNT                   00507000
SMF74MEC DS    BL4      MEASUREMENT EVENT COUNT (NUMBER OF SSCH         00508000
*                       FOR WHICH CONNECT, PENDING, AND ACTIVE          00509000
*                       TIMES WERE STORED                               00510000
SMF74CNN DS    BL4      DEVICE CONNECT TIME                             00511000
SMF74PEN DS    BL4      DEVICE PENDING TIME                             00512000
SMF74ATV DS    BL4      DEVICE ACTIVE TIME                              00513000
SMF74DIS DS    BL4      DEVICE DISCONNECT TIME                          00514000
SMF74QUE DS    BL4      NUMBER OF REQUESTS QUEUED IN IOS FOR            00515000
*                       THIS DEVICE                                     00516000
SMF74UTL DS    BL4      NUMBER OF SAMPLES WHEN THE DEVICE WAS           00517000
*                       RESERVED, BUT AN SSCH HAD NOT BEEN ISSUED       00518000
SMF74RSV DS    BL4      NUMBER OF SAMPLES DURING THE MEASUREMENT        00519000
*                       INTERVAL THAT INDICATED THAT THE DEVICE         00520000
*                       WAS RESERVED                                    00521000
SMF74DSO DS    BL4      Not longer needed, new field is SMF74NDA  @U2C  00522000
*                       variable name is needed for conversion          00523000
SMF74ALC DS    BL4      NUMBER OF SAMPLES DURING THE MEASUREMENT        00524000
*                       INTERVAL THAT INDICATED THAT THE DEVICE         00525000
*                       WAS ALLOCATED                                   00526000
SMF74MTP DS    BL4      NUMBER OF SAMPLES DURING THE MEASUREMENT        00527000
*                       INTERVAL THAT INDICATED A MOUNT PENDING         00528000
*                       CONDITION                                       00529000
SMF74NRD DS    BL4      NUMBER OF SAMPLES DURING THE MEASUREMENT        00530000
*                       INTERVAL THAT INDICATED THAT THE DEVICE         00531000
*                       WAS NOT READY                                   00532000
SMF74COF DS    BL2      NUMBER OF REQUESTS WITH CONNECT TIME  @ZA63802  00533000
*                       OVERFLOW                              @ZA63802  00534000
SMF74ICT DS    BL2      invalid sample count                      @P1C  00535000
SMF74DVB DS    BL4      device busy delay time                    @P1A  00536000
SMF74CUB DS    BL4      control unit busy delay time              @P1A  00537000
SMF74CLF DS    BL1      Flags for each device class:              @U1A  00538000
SMF74RCF EQU   X'E0'    xxx. ....   DASD report control flags @WA05544  00539000
SMF74RNR EQU   X'80'    1... ....   Flag for number option active @U1A  00540000
SMF74RSG EQU   X'40'    .1.. ....   Flag for SG option active     @U1A  00541000
SMF74RCS EQU   X'20'    ..1. ....   Flag for SG name changed during     00542000
*                                   the interval                  @U1A  00543000
SMF74TCF EQU   X'1C'    ...x xx..   TAPE report control flags @WA05544  00544000
SMF74MTS EQU   X'10'    ...1 ....   Flag for open mount at interval     00545000
*                                   start                         @B1A  00546000
SMF74MTE EQU   X'08'    .... 1...   Flag for open mount at interval     00547000
*                                   end                           @B1A  00548000
*                       .... .1..   unused                        @U1A  00549000
SMF74CTC EQU   X'03'    .... ..xx   CTC  report control flags @WA05544  00550000
SMF74CLW EQU   X'02'    .... ..1.   CTC with special protocol @WA00541  00551000
*                       .... ...1   unused                    @WA00541  00552000
         DS    BL3      unused                                    @U1A  00553000
SMF74SGN DS    CL8      Storage Group Name                        @U1A  00554000
SMF74NDA DS    BL4      Total number of allocations in effect           00555000
*                       for the device                            @U2A  00556000
SMF74DA  DS    0CL16    Data area, not cleared                @WA05544  00557000
SMF74DEV DS    CL8      Device name                               @Y2A  00558000
SMF74CU  DS    CL8      Control unit name                         @Y2A  00559000
SMF74DPB DS    BL4      ESCON Director Port Busy Delay time       @Z1A  00560000
SMF74CNX DS    BL1      DEVICE FLAG Extensions:                   @A1C  00561000
SMF74DYC EQU   X'80'    1... .... Device Dynamically Changed      @A1A  00562000
SMF74DDT EQU   X'40'    .1.. .... ON = Device disconnect time is        00563000
*                                      invalid                @WA15094  00564000
SMF74PAV EQU   X'20'    ..1. .... ON = base exposure of a Parallel      00565000
*                                 Access Volume                   @G3A  00566000
SMF74NXC EQU   X'10'    ...1 .... ON = number of alias exposures        00567000
*                                 changed                         @G3A  00568000
SMF74NTF EQU   X'08'    .... 1... Timing facility not active      @I2A  00569000
*                       .... .111 Unused                          @I2C  00570000
         DS    BL1      Reserved                                  @B1C  00571000
SMF74MTC DS    BL2      Number of mounts                          @B1A  00572000
SMF74DCI DS    0CL29    SDEVICE configuration information     @WA05544  00573000
SMF74DTS DS    BL1      identify source of Token                  @C2A  00574000
SMF74SRD EQU   X'80'    1... .... self describing device          @C2A  00575000
SMF74SND EQU   X'40'    .1.. .... no self decribing device        @C2A  00576000
SMF74SCN EQU   X'20'    ..1. .... reserved for internal use only  @C2A  00577000
SMF74SHV EQU   X'10'    ...1 .... SMF74SHR is valid           @WA07295  00578000
SMF74SHR EQU   X'08'    .... 1... device is shared/assigned   @WA07295  00579000
*                                 to multiple systems         @WA07295  00580000
SMF74DCT DS    CL28     Configuration Token for selfdescribing    @C2A  00581000
*                       devices or 4-byte device number in EBCDIC @C2A  00582000
*                       format left justified with trailing blanks@C2A  00583000
         ORG   SMF74DCT                                       @WA05544  00584000
SMF74NDN DS    CL4      4-digit device number, if SMF74SND=1  @WA05544  00585000
SMF74NBL DS    CL24     Blanks, if SMF74SND=1                 @WA05544  00586000
         DS    BL3      unused                                    @C2A  00587000
         DS    BL4      Reserved                              @WA31701  00588000
SMF74PCT DS    BL4      Number of unsuccessful PAV samples    @WA31701  00589000
         AIF   ('&X' EQ 'O').SUBTYP2                              @Y1A  00590000
         MEXIT                                                    @Y1C  00591000
.SUBTYP2 ANOP                                                     @Y1A  00592000
         SPACE 2                                                        00593000
*********************************************************************** 00594000
*                                                                     * 00595000
*              Relocate blocks for sub type 2 - Monitor III           * 00596000
*              XCF data. (Cross-System Coupling Facility)             * 00597000
*                                                                     * 00598000
*********************************************************************** 00599000
         SPACE 2                                                        00600000
******  Subtype 2, Control Data Section ************************* @Y1A  00601000
         SPACE 3                                                        00602000
R742CNTL DSECT                                                    @Y1A  00603000
R742TSR  DS    BL2      Total number of small records             @Y1A  00604000
         DS    BL2      Unused                                    @Y1A  00605000
R742STOT DS    BL4      Total number of system data sections            00606000
*                       in large SMF record                       @Y1A  00607000
R742SNXT DS    BL4      Number of system data sections                  00608000
*                       in following small records                @Y1A  00609000
R742PTOT DS    BL4      Total number of path data sections              00610000
*                       in large SMF record                       @Y1A  00611000
R742PNXT DS    BL4      Number of path data sections                    00612000
*                       in following small records                @Y1A  00613000
R742MTOT DS    BL4      Total number of member data sections            00614000
*                       in large SMF record                       @Y1A  00615000
R742MNXT DS    BL4      Number of member data sections in following     00616000
*                       small records                             @Y1A  00617000
         SPACE 2                                                        00618000
***********  Subtype 2 System Data Section  ********************* @Y1A  00619000
         SPACE 3                                                        00620000
R742SYS  DSECT                                                    @Y1A  00621000
R742SNME DS    CL8      System name                               @Y1A  00622000
R742SSTF DS    BL1      Status flags                              @Y1A  00623000
R742SACT EQU   X'80'    1... .... System became active during           00624000
*                                 this interval                   @Y1A  00625000
R742SIAC EQU   X'40'    .1.. .... System became inactive during         00626000
*                                 this interval                   @Y1A  00627000
R742SRES EQU   X'20'    ..1. .... Counts reset by XCF during            00628000
*                                 this interval                   @Y1A  00629000
R742SPAR EQU   X'10'    .... 1... Partially not active during RMF       00630000
*                                 post processor interval.        @Y1A  00631000
*                       .... 1111 Unused                          @Y1A  00632000
R742SDIR DS    BL1      Direction                                 @Y1A  00633000
R742SIN  EQU   X'80'    1... ....   Inbound                       @Y1A  00634000
R742SOUT EQU   X'40'    .1.. ....   Outbound                      @Y1A  00635000
R742SLCL EQU   X'20'    ..1. ....   Local                         @Y1A  00636000
*                       ...1 1111   Reserved                      @Y1A  00637000
         DS    CL2      Unused                                    @Y1A  00638000
R742SPTH DS    BL4      Current number of paths in service.             00639000
*                       Zero for local entry.                           00640000
*                       If outbound entry, count is for indicated       00641000
*                       transport class.                          @Y1A  00642000
R742SBSY DS    BL4      Number of no buffer conditions.                 00643000
*                       For local or outbound entry, count is for       00644000
*                       indicated transport class.                @Y1A  00645000
R742SNOP DS    BL4      Number of no path conditions.                   00646000
*                       Zero for local entry.                           00647000
*                       For outbound entry, count is for                00648000
*                       indicated transport class.                @Y1A  00649000
R742SMXB DS    BL4      Maximum 1K blocks of message buffer space.      00650000
*                       For local or outbound entry, count is for       00651000
*                       indicated transport class.                @Y1A  00652000
R742SBIG DS    BL4      Number of message too big conditions.           00653000
*                       Zero for inbound entry.                   @Y1A  00654000
R742SFIT DS    BL4      Number of messages that fits in buffer.         00655000
*                       Zero for inbound entry.                   @Y1A  00656000
R742SSML DS    BL4      Number of message too small conditions.         00657000
*                       Zero for inbound entry.                   @Y1A  00658000
R742SOVR DS    BL4      Number of messages for which signalling         00659000
*                       service was optimized.                          00660000
*                       Zero for inbound entry.                   @Y1A  00661000
R742STCL DS    BL4      Message length for transport class.             00662000
*                       Zero for inbound entry.                   @Y1A  00663000
R742STCN DS    CL8      Transport class name.                           00664000
*                       Blanks for inbound entry.                 @Y1A  00665000
         SPACE 2                                                        00666000
***********  Subtype 2, Path Data Section  ********************** @Y1A  00667000
         SPACE 3                                                        00668000
R742PTH  DSECT                                                    @Y1A  00669000
R742PNME DS    CL8      System name                               @Y1A  00670000
R742PDEV DS    CL4      Device number                             @Y1A  00671000
R742PSTF DS    BL1      Status flags                              @Y1A  00672000
R742PACT EQU   X'80'    1... .... Path became active during             00673000
*                                 this interval                   @Y1A  00674000
R742PIAC EQU   X'40'    .1.. .... Path became inactive during           00675000
*                                 this interval                   @Y1A  00676000
R742PRES EQU   X'20'    ..1. .... Counts reset by XCF during            00677000
*                                 this interval                   @Y1A  00678000
R742PPAR EQU   X'10'    ...1 .... Partially not active during RMF       00679000
*                                 post processor interval.        @Y1A  00680000
*                       .... 1111 Unused                          @Y1A  00681000
R742PDIR DS    BL1      Direction path                            @Y1A  00682000
R742PIN  EQU   X'80'    1... ....   Inbound path                  @Y1A  00683000
R742POUT EQU   X'40'    .1.. ....   Outbound path                 @Y1A  00684000
*                       ..11 1111   Reserved                      @Y1A  00685000
R742PTYP DS    BL1      Path type indicator: '01'x for CTC,             00686000
*                       '03'x for list structure                  @C1A  00687000
         DS    CL1      Unused                                    @Y1A  00688000
R742PONA DS    CL8      Name of system on other end if known,           00689000
*                       otherwise blanks.                         @Y1A  00690000
R742PODV DS    CL4      Device number on other end if known,            00691000
*                       otherwise blanks.                         @Y1A  00692000
R742PSTA DS    BL1      Path status                               @Y1A  00693000
R742PST  EQU   X'80'    1... ....   Starting                      @Y1A  00694000
R742PRS  EQU   X'40'    .1.. ....   Restarting                    @Y1A  00695000
R742PWK  EQU   X'20'    ..1. ....   Working                       @Y1A  00696000
R742PSP  EQU   X'10'    ...1 ....   Stopping                      @Y1A  00697000
R742PLK  EQU   X'08'    .... 1...   Waiting for completion of           00698000
*                                   communication link            @Y1A  00699000
R742PNP  EQU   X'04'    .... .1..   Not operational. Path defined to    00700000
*                                   XCF but not usable untilhardware    00701000
*                                   and/or definition problems are      00702000
*                                   resolved                  @WA22735  00703000
R742PSF  EQU   X'02'    .... ..1.   Stop failed               @WA22735  00704000
R742PRB  EQU   X'01'    .... ...1   Rebuilding                @WA22735  00705000
         DS    CL3      Unused                                    @Y1A  00706000
R742PRET DS    BL4      Path retry limit                          @Y1A  00707000
R742PRST DS    BL4      Number of restarts                        @Y1A  00708000
R742PMXM DS    BL4      Maximum number of 1K blocks message buffer      00709000
*                       space.                                    @Y1A  00710000
R742PSIG DS    BL4      Number of outbound (inbound) signals sent       00711000
*                       (received) over path                      @Y1A  00712000
R742PQLN DS    BL4      Number of outbound signals pending transfer     00713000
*                       on path                                   @Y1A  00714000
R742PIBR DS    BL4      Number of inbound signals refused due to        00715000
*                       maximum message limit                     @Y1A  00716000
R742PSUS DS    BL4      Number of outbound signals satisfied by         00717000
*                       suspended path                            @Y1A  00718000
R742PAPP DS    BL4      Number of outbound signal requests satisfied    00719000
*                       by this path while active.                @Y1A  00720000
R742PTCN DS    CL8      Transport class name. Blanks for an             00721000
*                       inbound path.                             @Y1A  00722000
R742PSTR DS    CL16     Name of XES list structure being used as a      00723000
*                       path, blank for CTC's                     @C1A  00724000
R742PIOT DS    BL4      For inbound paths:                              00725000
*                       Average I/O transfer time for the most          00726000
*                       recently received signals.                      00727000
*                       Units: micro seconds.                           00728000
*                       Zero if not available.                          00729000
*                       X'FFFFFFFF' for overflow                        00730000
*                       (more than 35 minutes).               @WA41317  00731000
         SPACE 2                                                        00732000
***********  Subtype 2, Member Data Section  ******************** @Y1A  00733000
         SPACE 3                                                        00734000
R742MBR  DSECT                                                    @Y1A  00735000
R742MSYS DS    CL8      System name                               @Y1A  00736000
R742MGRP DS    CL8      Group name                                @Y1A  00737000
R742MMEM DS    CL16     Member name                               @Y1A  00738000
R742MSTF DS    BL1      Status flags                              @Y1A  00739000
R742MACT EQU   X'80'    1... .... Member became active during           00740000
*                                 this interval                   @Y1A  00741000
R742MIAC EQU   X'40'    .1.. .... Member became inactive during         00742000
*                                 this interval                   @Y1A  00743000
R742MRES EQU   X'20'    ..1. .... Counts reset by XCF during            00744000
*                                 this interval                   @Y1A  00745000
R742MPAR EQU   X'10'    ...1 .... Partially not active during RMF       00746000
*                                 post processor interval.        @Y1A  00747000
*                       .... 1111 Unused                          @Y1A  00748000
         DS    CL3      Unused                                    @Y1A  00749000
R742MSNT DS    BL4      Number of signals sent by member          @Y1A  00750000
R742MRCV DS    BL4      Number of signals received by member      @Y1A  00751000
         AIF   ('&X' EQ 'O').SUBTYP3                              @B2A  00752000
         MEXIT                                                    @B2A  00753000
.SUBTYP3 ANOP                                                     @B2A  00754000
         SPACE 2                                                  @B2A  00755000
*********************************************************************** 00756000
*                                                                     * 00757000
*              Relocate blocks for sub type 3 - Monitor III           * 00758000
*              OMVS data. (OPEN/MVS Kernel Activity Support)          * 00759000
*                                                                 @B2A* 00760000
*********************************************************************** 00761000
         SPACE 2                                                        00762000
******  Subtype 3, Data Section ********************************* @B2A  00763000
         SPACE 3                                                        00764000
R743DATA DSECT                                                          00765000
R743CYCU DS    BL4      Number of cycle units elapsed                   00766000
*                       between first and last measured sample    @B2A  00767000
R743CYCT DS    BL4      Cycle time value obtained from Monitor III      00768000
*                       options                                   @B2A  00769000
R743FLG  DS    BL4      Processing flags                          @B2A  00770000
R743TER  EQU   X'80000000'  OMVS terminated or reinstated this          00771000
*                           intervall when set                    @B2A  00772000
R743CHPR EQU   X'40000000'  Max. number of processes changed            00773000
*                           during reporting interval when set    @B2A  00774000
R743CHUS EQU   X'20000000'  Max. number of users changed during         00775000
*                           reporting interval when set           @B2A  00776000
R743CHPU EQU   X'10000000'  Max. number of processes per userchanged    00777000
*                           during reporting interval when set    @B2A  00778000
R743CHMS EQU   X'08000000'  Max. number of message queue ids changed    00779000
*                           during reporting interval when set@WA10257  00780000
R743CHSE EQU   X'04000000'  Max. number of semaphore ids changed        00781000
*                           during reporting interval when set@WA10257  00782000
R743CHSH EQU   X'02000000'  Max. number of shared memory ids changed    00783000
*                           during reporting interval when set@WA10257  00784000
R743CHSP EQU   X'01000000'  Max. number of shared memory pages changed  00785000
*                           during reporting interval when set@WA10257  00786000
R743CHMA EQU   X'00800000'  Max. number of memory map st pages changed  00787000
*                           during reporting interval when set@WA10257  00788000
R743CHPA EQU   X'00400000'  Max. number of shared stor pages changed    00789000
*                           during reporting interval when set@WA10257  00790000
*                           Reserved                              @B2A  00791000
R743CHLR EQU   X'00200000'  Max. size of shared library region changed  00792000
*                           during reporting interval when set    @I5A  00793000
R743CQSG EQU   X'00100000'  Max. number of queued signals per process   00794000
*                           changed during reporting interval when      00795000
*                           set                                   @I5A  00796000
R743SYSC DS    BL4      Total number of OMVS system calls invoked       00797000
*                       during the interval                       @B2A  00798000
R743SCMN DS    BL4      Min. number of OMVS system calls invoked        00799000
*                       during one cycle                          @B2A  00800000
R743SCMX DS    BL4      Max. number of OMVS system calls invoked        00801000
*                       during one cycle                          @B2A  00802000
R743CPU  DS    BL4      Total CPU time spent processing syscalls        00803000
*                       in OMVS during the interval               @B2A  00804000
R743CTMN DS    BL4      Min. CPU time spent processing syscalls in      00805000
*                       OMVS during one cycle                     @B2A  00806000
R743CTMX DS    BL4      Max. CPU time spent processing syscalls in      00807000
*                       OMVS during one cycle                     @B2A  00808000
R743OPR  DS    BL4      Count of times Fork/Dub failed because max.     00809000
*                       number of processes was exceeded during         00810000
*                       one cycle                                 @B2A  00811000
R743OPMN DS    BL4      Min. number of times Fork/Dub failed because    00812000
*                       max. number of processes was exceeded during    00813000
*                       one cycle                                 @B2A  00814000
R743OPMX DS    BL4      Max. number of times Fork/Dub failed because    00815000
*                       max. number of processes was exceeded during    00816000
*                       one cycle                                 @B2A  00817000
R743OUS  DS    BL4      Count of times Fork/Dub failed because max.     00818000
*                       number of users was exceeded during one cycle   00819000
*                                                                 @B2A  00820000
R743OUMN DS    BL4      Min. number of times Fork/Dub failed because    00821000
*                       max. number of users was exceeded during        00822000
*                       one cycle                                 @B2A  00823000
R743OUMX DS    BL4      Max. number of times Fork/Dub failed because    00824000
*                       max. number of users was exceeded during        00825000
*                       one cycle                                 @B2A  00826000
R743OPRU DS    BL4      Count of times Fork/Dub failed because max.     00827000
*                       number of proc's per user was exceeded during   00828000
*                       one cycle                                 @B2A  00829000
R743ORMN DS    BL4      Min. number of times Fork/Dub failed because    00830000
*                       max. number of processes per user was exceeded  00831000
*                       during one cycle                          @B2A  00832000
R743ORMX DS    BL4      Max. number of times Fork/Dub failed because    00833000
*                       max. number of processes per user was exceeded  00834000
*                       during one cycle                          @B2A  00835000
R743MAXP DS    BL2      Max. number of OMVS processes (const) @YA62787  00836000
R743MAXU DS    BL2      Max. number of OMVS users (const)         @B2A  00837000
R743MXPU DS    BL2      Max. number of OMVS processes per user (const)  00838000
*                                                                 @B2A  00839000
         DS    BL2      Unused                                    @B2A  00840000
R743CURP DS    BL4      Accumulated number of OMVS processes            00841590
*                       during the interval                   @WA46170  00842180
R743CPMN DS    BL2      Min. number of OMVS processes                   00843000
*                       during one cycle                          @B2A  00844000
R743CPMX DS    BL2      Max. number of OMVS processes                   00845000
*                       during one cycle                          @B2A  00846000
R743CURU DS    BL4      Accumulated number of OMVS users                00847590
*                       during the interval                   @WA46170  00848180
R743CUMN DS    BL2      Min. number of OMVS users                       00849000
*                       during one cycle                          @B2A  00850000
R743CUMX DS    BL2      Max. number of OMVS users                       00851000
*                       during one cycle                          @B2A  00852000
R743MMSG DS    BL4      Maximum number of message queue IDs (const.)    00853000
*                                                             @WA10257  00854000
R743MSEM DS    BL4      Maximum number of semaphore IDs (const.)        00855000
*                                                             @WA10257  00856000
R743MSHM DS    BL4      Maximum number of shared memory IDs (const.)    00857000
*                                                             @WA10257  00858000
R743MSPG DS    BL4      Maximum number of shared memory pages           00859000
*                       (const.)                              @WA10257  00860000
R743CMSG DS    BL4      Accumulated number of message queue IDs         00861000
*                       during one interval                   @WA10257  00862000
R743CMMN DS    BL4      Minimum number of message queue IDs per cycle   00863000
*                                                             @WA10257  00864000
R743CMMX DS    BL4      Maximum number of message queue IDs per cycle   00865000
*                                                             @WA10257  00866000
R743CSEM DS    BL4      Accumulated number of semaphore IDs during      00867000
*                       one interval                          @WA10257  00868000
R743CSMN DS    BL4      Minimum number of semaphore IDs per cycle       00869000
*                                                             @WA10257  00870000
R743CSMX DS    BL4      Maximum number of semaphore IDs per cycle       00871000
*                                                             @WA10257  00872000
R743CSHM DS    BL4      Accumulated number of shared memory IDs         00873000
*                       during one interval                   @WA10257  00874000
R743CHMN DS    BL4      Minimum number of shared memory IDs per cycle   00875000
*                                                             @WA10257  00876000
R743CHMX DS    BL4      Maximum number of shared memory IDs per cycle   00877000
*                                                             @WA10257  00878000
R743CSPG DS    BL4      Accumulated number of shared memory pages       00879000
*                       during one interval                   @WA10257  00880000
R743CGMN DS    BL4      Minimum number of shared memory pages per       00881000
*                       cycle                                 @WA10257  00882000
R743CGMX DS    BL4      Maximum number of shared memory pages per       00883000
*                       cycle                                 @WA10257  00884000
R743OMSG DS    BL4      Accumulated number of attempts to exceed        00885000
*                       maximum number of message queue IDs during      00886000
*                       one interval                          @WA10257  00887000
R743OMMN DS    BL4      Minimum number of attempts to exceed maximum    00888000
*                       number of message queue IDs per cycle @WA10257  00889000
R743OMMX DS    BL4      Maximum number of attempts to exceed maximum    00890000
*                       number of message queue IDs per cycle @WA10257  00891000
R743OSEM DS    BL4      Accumulated number of attempts to exceed        00892000
*                       maximum number of semaphore IDs during one      00893000
*                       interval                              @WA10257  00894000
R743OSMN DS    BL4      Minimum number of attempts to exceed maximum    00895000
*                       number of semaphore IDs per cycle     @WA10257  00896000
R743OSMX DS    BL4      Maximum number of attempts to exceed maximum    00897000
*                       number of semaphore IDs per cycle     @WA10257  00898000
R743OSHM DS    BL4      Accumulated number of attempts to exceed        00899000
*                       maximum number of shared memory IDs during      00900000
*                       one interval                          @WA10257  00901000
R743OHMN DS    BL4      Minimum number of attempts to exceed maximum    00902000
*                       number of shared memory IDs per cycle @WA10257  00903000
R743OHMX DS    BL4      Maximum number of attempts to exceed maximum    00904000
*                       number of shared memory IDs per cycle @WA10257  00905000
R743OSPG DS    BL4      Accumulated number of attempts to exceed        00906000
*                       maximum number of shared memory pages during    00907000
*                       one interval                          @WA10257  00908000
R743OGMN DS    BL4      Minimum number of attempts to exceed maximum    00909000
*                       number of shared memory pages per cycle         00910000
*                                                             @WA10257  00911000
R743OGMX DS    BL4      Maximum number of attempts to exceed maximum    00912000
*                       number of shared memory pages per cycle         00913000
*                                                             @WA10257  00914000
R743MMAP DS    BL4      Maximum number of memory map storage pages      00915000
*                       (const.)                              @WA10257  00916000
R743CMAP DS    BL4      Accumulated number of memory map storage        00917000
*                       pages during one interval             @WA10257  00918000
R743CAMN DS    BL4      Minimum number of memory map storage pages      00919000
*                       per cycle                             @WA10257  00920000
R743CAMX DS    BL4      Maximum number of memory map storage pages      00921000
*                       per cycle                             @WA10257  00922000
R743OMAP DS    BL4      Accumulated number of attempts to exceed        00923000
*                       maximum number of memory map storage pages      00924000
*                       during one interval                   @WA10257  00925000
R743OAMN DS    BL4      Minimum number of attempts to exceed maximum    00926000
*                       number of memory map storage pages per cycle    00927000
*                                                             @WA10257  00928000
R743OAMX DS    BL4      Maximum number of attempts to exceed maximum    00929000
*                       number of memory map storage pages per cycle    00930000
*                                                             @WA10257  00931000
R743MPAG DS    BL4      Maximum number of shared storage pages          00932000
*                       (const.)                              @WA10257  00933000
R743CPAG DS    BL4      Accumulated number of shared storage            00934000
*                       pages during one interval             @WA10257  00935000
R743CXMN DS    BL4      Minimum number of shared storage pages          00936000
*                       per cycle                             @WA10257  00937000
R743CXMX DS    BL4      Maximum number of shared storage pages          00938000
*                       per cycle                             @WA10257  00939000
R743OPAG DS    BL4      Accumulated number of attempts to exceed        00940000
*                       maximum number of shared storage pages          00941000
*                       during one interval                   @WA10257  00942000
R743OXMN DS    BL4      Minimum number of attempts to exceed maximum    00943000
*                       number of shared storage pages per cycle        00944000
*                                                             @WA10257  00945000
R743OXMX DS    BL4      Maximum number of attempts to exceed maximum    00946000
*                       number of shared storage pages per cycle        00947000
*                                                             @WA10257  00948000
R743MSLR DS    BL4      Maximum amount of storage available for         00949000
*                       shared library region (const. in MB)      @I5A  00950000
R743CSLR DS    BL4      Accumulated amount of shared library            00951000
*                       storage allocated in one interval (in MB) @I5A  00952000
R743CLMN DS    BL4      Minimum amount of shared library storage        00953000
*                       allocated per cycle                       @I5A  00954000
R743CLMX DS    BL4      Maximum number of shared library storage        00955000
*                       allocated per cycle                       @I5A  00956000
R743OSLR DS    BL4      Accumulated number of attempts to exceed        00957000
*                       maximum amount of shared library region         00958000
*                       size during one interval                  @I5A  00959000
R743OLMN DS    BL4      Minimum number of attempts to exceed maximum    00960000
*                       amount of shared library region per cycle @I5A  00961000
R743OLMX DS    BL4      Maximum number of attempts to exceed maximum    00962000
*                       amount of shared library region per cycle @I5A  00963000
R743MQDS DS    BL4      Maximum amount of queued signals allowed        00964000
*                       per process (const.)                      @I5A  00965000
R743OQDS DS    BL4      Accumulated number of attempts to exceed        00966000
*                       maximum amount of queued signals per            00967000
*                       interval                                  @I5A  00968000
R743OQMN DS    BL4      Minimum number of attempts to exceed maximum    00969000
*                       amount of queued signals per cycle        @I5A  00970000
R743OQMX DS    BL4      Maximum number of attempts to exceed maximum    00971000
*                       amount of queued signals per cycle        @I5A  00972000
         AIF   ('&X' EQ 'O').SUBTYP4                              @C1A  00973000
         MEXIT                                                    @C1A  00974000
.SUBTYP4 ANOP                                                     @C1A  00975000
         SPACE 2                                                        00976000
*********************************************************************** 00977000
*                                                                     * 00978000
*              Relocate blocks for sub type 4 - Monitor III           * 00979000
*              XES/CF data. (Cross- System Extended Services)         * 00980000
*                                                                     * 00981000
*********************************************************************** 00982000
         SPACE 2                                                        00983000
***********  Subtype 4 Local CF Data Section ******************** @C1A  00984000
         SPACE 3                                                        00985000
R744FLCF DSECT                                                    @C1A  00986000
R744FNAM DS    CL8      Name of Coupling Facility                 @C1A  00987000
R744FSYS DS    CL8      Name of this system (from IEASYSxx              00988000
*                       parmlib member, SYSNAME parameter)        @C1A  00989000
R744FFLG DS    BL1      Status flags                              @C1A  00990000
R744FCEI EQU   X'80'    1... .... Coupling Facility was connected       00991000
*                                 at the end of the interval      @C1A  00992000
R744FADI EQU   X'40'    .1.. .... Coupling Facility became active       00993000
*                                 during the interval             @C1A  00994000
R744FPEC EQU   X'20'    ..1. .... Permanent error in cycle gatherer     00995000
*                                 during the complete interval.   @C1A  00996000
*                       ...1 1111 Reserved                        @C1A  00997000
R744FFLC DS    BL1      Informational flags                       @I3A  00998000
R744FCHO EQU   X'80'    1... .... CHPIDs set offline during the         00999000
*                                 interval                        @I3A  01000000
*                       .111 1111 not used                        @I3A  01001000
         DS    BL1      Unused                                    @I3C  01002000
R744FAMV DS    BL1      IXLYAMDA Version                      @WA20293  01003000
R744FPAM DS    BL4      Number of pathes available to the CF      @C1A  01004000
R744FPBC DS    BL8      Number of times CF request failed               01005000
*                       due to path busy,                               01006000
*                       long floating point                       @C1A  01007000
R744FSCG DS    BL4      Number of subch. defined in the IOGEN     @C1A  01008000
R744FSCU DS    BL4      Number of subch. currently in use         @C1A  01009000
R744FSCL DS    BL4      Limit to subchannels that could be used   @C1A  01010000
R744FSCC DS    BL8      Subch. contention count (all subch. busy),      01011000
*                       long floating point                       @C1A  01012000
R744FTOR DS    BL8      Total number of requests from this system,      01013000
*                       long floating point                       @C1A  01014000
R744FAIL DS    BL8      Unsuccessful requests,                          01015000
*                       long floating point                       @C1A  01016000
R744FTIM DS    BL8      Summed Service Time for unsuccessful requests   01017000
*                       in microseconds                           @C1A  01018000
R744FSQU DS    BL8      Summed squares of service time                  01019000
*                       for unsuccessful requests                 @C1A  01020000
R744FCTM DS    BL8      Summed contention time for waiting for          01021000
*                       subchannels to become free (y-sec) for          01022000
*                       synchronous immediate operations      @WA20293  01023000
R744FCSQ DS    BL8      Summed squares of contention time for waiting   01024000
*                       for subchannels to become free (y-sec*squared)  01025000
*                       for synchronous immediate operations  @WA20293  01026000
R744FMOD DS    CL6      CF model, can have leading zeros,               01027000
*                       e.g. '009672'                             @F1A  01028000
R744FVER DS    CL3      CF version, e.g. 'C01'                    @F1A  01029000
         DS    BL3      Unused                                    @F1A  01030000
R744FLVL DS    BL4      CF level                                  @F1A  01031000
         SPACE 2                                                        01032000
***********  Subtype 4 Connectivity Data Section **************** @C1A  01033000
         SPACE 3                                                        01034000
R744XCON DSECT                                                    @C1A  01035000
R744XSYS DS    CL8      Name of remote system, also reporting           01036000
*                       on this CF. (from IEASYSxx parmlib member,      01037000
*                       SYSNAME parameter)                        @C1A  01038000
         SPACE 2                                                        01039000
***********  Subtype 4 Storage Data Section ********************* @C1A  01040000
         SPACE 3                                                        01041000
R744GSRG DSECT                                                    @C1A  01042000
R744GCSD DS    BL4      Total amount of control storage defined         01043000
*                       (units = 4K byte blocks)                  @C1A  01044000
R744GCSF DS    BL4      Total amount of free control storage            01045000
*                       (units = 4K byte blocks)                  @C1A  01046000
R744GTSD DS    BL4      Total amount of CF storage defined              01047000
*                       (units = 4K byte blocks)                  @C1A  01048000
R744GTSF DS    BL4      Total amount of free CF storage                 01049000
*                       (units = 4K byte blocks)                  @C1A  01050000
R744GDSA DS    BL4      Total amount of dump space allocated            01051000
*                       (units = 4K byte blocks)                  @C1A  01052000
R744GDSF DS    BL4      Amount of free dump space                       01053000
*                       (units = 4K byte blocks)                  @C1A  01054000
R744GDSR DS    BL4      Maximum amount of dump space requested          01055000
*                       (units = 4K byte blocks)                  @C1A  01056000
         SPACE 2                                                        01057000
***********  Subtype 4 Structure Data Section ******************* @C1A  01058000
         SPACE 3                                                        01059000
R744QSDS DSECT                                                    @C1A  01060000
R744QSTR DS    CL16     Name of structure allocated in this             01061000
*                       coupling facility                         @C1A  01062000
R744QSIZ DS    BL4      Structure size requested to be allocated        01063000
*                       (units = 4K byte blocks)                  @G1C  01064000
R744QVER DS    BL8      Structure Version number              @WA04653  01065000
R744QFLG DS    BL1      Status flags                          @WA04653  01066000
R744QACT EQU   X'80'    1... .... Active instance of structure          01067000
*                                 (normal case)               @WA04653  01068000
R744QRBN EQU   X'40'    .1.. .... New instance during rebuild @WA04653  01069000
R744QRBO EQU   X'20'    ..1. .... Old instance during rebuild @WA04653  01070000
R744QTRA EQU   X'10'    ...1 .... Instance is just being added or       01071000
*                                 deleted (in transition)     @WA04653  01072000
R744QHOL EQU   X'08'    .... 1... Instance in hold, deletion could      01073000
*                                 not be finished             @WA04653  01074000
R744QDPT EQU   X'04'    .... .1.. Dump was initiated for this           01075000
*                                 structure                   @WA04653  01076000
*                       .... ..11 Reserved                    @WA04653  01077000
         DS    BL3      Unused                                @WA04653  01078000
***********  Subtype 4 Request Data Section ********************* @C1A  01079000
         SPACE 3                                                        01080000
R744SREQ DSECT                                                    @C1A  01081000
R744SNAM DS    CL16     Name of structure connected to this             01082000
*                       system                                    @C1A  01083000
R744SVER DS    BL8      Structure Version number                  @C1A  01084000
R744STYP DS    BL1      Structure Type Identifier                 @C1A  01085000
R744SFLG DS    BL1      Status flags                              @C1A  01086000
R744SCEI EQU   X'80'    1... .... Structure was connected at the        01087000
*                                 end of the interval             @C1A  01088000
R744SADI EQU   X'40'    .1.. .... Structure became active during        01089000
*                                 the interval                    @C1A  01090000
*                       ..11 1111 Reserved                        @C1A  01091000
         DS    BL1      Unused                                @WA04653  01092000
R744SLEC DS    BL1      Lock structure only:                            01093000
*                       Lock table entry characteristic       @WA04653  01094000
R744SLEL DS    BL4      List structure only:                            01095000
*                       Limit on number of list entries           @C1A  01096000
R744SLEM DS    BL4      List structure only:                            01097000
*                       Maximum number of list entries                  01098000
*                       used during interval                      @C1A  01099000
R744SLTL DS    BL4      Lock structure only:                            01100000
*                       Limit on number of lock table entries     @C1A  01101000
R744SLTM DS    BL4      Lock structure only:                            01102000
*                       Maximum number of lock table entries            01103000
*                       used during interval                      @C1A  01104000
R744SSTA DS    BL8      Number of requests changed from                 01105000
*                       synchronous to asynchronous               @C1A  01106000
R744STRC DS    BL8      Total number of user requests completed,        01107000
*                       long floating point                   @WA04653  01108000
R744STAC DS    BL8      Total number of async. user req. completed,     01109000
*                       long floating point                   @WA04653  01110000
R744SARC DS    BL8      Count of number of times for async. requests    01111000
*                       executed by cf hardware,                        01112000
*                       long floating point                   @WA04653  01113000
R744SATM DS    BL8      Summed service time for async. requests         01114000
*                       in microseconds                           @C1A  01115000
R744SASQ DS    BL8      Summed squares of service time for              01116000
*                       asynchronous requests                     @C1A  01117000
R744SSRC DS    BL8      Count of number of times for sync. requests     01118000
*                       executed by cf hardware,                        01119000
*                       long floating point                   @WA04653  01120000
R744SSTM DS    BL8      Summed service time for sync. requests          01121000
*                       in microseconds                           @C1A  01122000
R744SSSQ DS    BL8      Summed squares of service time for              01123000
*                       synchronous requests                      @C1A  01124000
R744SQRC DS    BL8      Count of number of times for queued req.,       01125000
*                       long floating point                       @C1A  01126000
R744SQTM DS    BL8      Summed service time for queued requests         01127000
*                       in microseconds                           @C1A  01128000
R744SQSQ DS    BL8      Summed squares of service time for              01129000
*                       queued requests                           @C1A  01130000
R744SDRC DS    BL8      Number of times requests were delayed           01131000
*                       due to dump serialization,                      01132000
*                       long floating point                       @C1A  01133000
R744SDTM DS    BL8      Summed delay time for dump serialization        01134000
*                       in microseconds                           @C1A  01135000
R744SDSQ DS    BL8      Summed squares of delay time for                01136000
*                       dump serialization                        @C1A  01137000
R744SDMP DS    BL8      Number of times dump serialization was          01138000
*                       found for this structure (only for              01139000
*                       list and cache structures),                     01140000
*                       long floating point                       @C1A  01141000
R744SHTO DS    BL8      Total number of requests added to the           01142000
*                       high priority queue during interval,            01143000
*                       long floating point                   @WA04653  01144000
R744SHMN DS    BL4      Minimum number of requests added to the         01145000
*                       high priority queue within one cycle            01146000
*                       (this is a rate per cycle)            @WA04653  01147000
R744SHMX DS    BL4      Maximum number of requests added to the         01148000
*                       high priority queue within one cycle            01149000
*                       (this is a rate per cycle)            @WA04653  01150000
R744SLTO DS    BL8      Total number of requests added to the           01151000
*                       low priority queue during interval,             01152000
*                       long floating point                   @WA04653  01153000
R744SLMN DS    BL4      Minimum number of requests added to the         01154000
*                       low priority queue within one cycle             01155000
*                       (this is a rate per cycle)            @WA04653  01156000
R744SLMX DS    BL4      Maximum number of requests added to the         01157000
*                       low priority queue within one cycle             01158000
*                       (this is a rate per cycle)            @WA04653  01159000
R744SDTO DS    BL8      Total number of requests added to the dump      01160000
*                       queue since dump serialization is in progress,  01161000
*                       long floating point                   @WA04653  01162000
R744SDMN DS    BL4      Minimum number of requests added to the dump    01163000
*                       queue since dump serialization is in progress   01164000
*                       within one cycle                                01165000
*                       (this is a rate per cycle)            @WA04653  01166000
R744SDMX DS    BL4      Maximum number of requests added to the dump    01167000
*                       queue since dump serialization is in progress   01168000
*                       within one cycle                                01169000
*                       (this is a rate per cycle)            @WA04653  01170000
R744SCN  DS    BL8      Number of times any request encountered         01171000
*                       lock contention (lock structure only),          01172000
*                       long floating point                       @C1A  01173000
R744SFCN DS    BL8      Number of times any request encountered         01174000
*                       false lock contention (storage contention       01175000
*                       within the lock structure),                     01176000
*                       long floating point                       @C1A  01177000
R744SSIZ DS    BL4      Allocated size of structure                     01178000
*                       (units = 4K byte blocks)              @WA04653  01179000
R744SMAS DS    BL4      Maximum structure size                @WA04653  01180000
R744SMIS DS    BL4      Minimum structure size                @WA04653  01181000
R744SDEC DS    BL4      Cache structure only:                           01182000
*                       Total directory entry count           @WA04653  01183000
R744SDEL DS    BL4      Cache structure only:                           01184000
*                       Total data element count              @WA04653  01185000
R744SNLH DS    BL4      List structure only:                            01186000
*                       Number of list headers                @WA04653  01187000
R744SMAE DS    BL4      List structure only:                            01188000
*                       Maximum number of elements            @WA04653  01189000
R744SCUE DS    BL4      List structure only:                            01190000
*                       Current number of elements in use     @WA04653  01191000
R744CDSI DS    BL2      Index to first Cache Data Section     @WA20293  01192000
*                                                                       01193000
R744CDNE DS    BL2      Number of Cache Data Sections         @WA20293  01194000
         SPACE 2                                                        01195000
***********  Subtype 4 Processor Data Section ******************* @C1A  01196000
         SPACE 3                                                        01197000
R744PROC DSECT                                                    @C1A  01198000
R744PNUM DS    BL4      CPU number                                @C1A  01199000
R744PBSY DS    BL4      Busy time in microseconds                 @C1A  01200000
R744PWAI DS    BL4      Wait time in microseconds                 @C1A  01201000
         SPACE 2                                                        01202000
***********  Subtype 4 Cache  Data Section *******************@WA20293  01203000
R744CACH DSECT                                                @WA20293  01204000
R744CRHC DS    BL8      Read hit Counter                                01205000
*                       long floating point                   @WA20293  01206000
R744CRMD DS    BL8      Read miss, directory hit counter                01207000
*                       long floating point                   @WA20293  01208000
R744CRMA DS    BL8      Read miss, assignment suppressed counter        01209000
*                       long floating point                   @WA20293  01210000
R744CRMN DS    BL8      Read miss, name assigned counter                01211000
*                       long floating point                   @WA20293  01212000
R744CRMT DS    BL8      Read miss, target storage class full            01213000
*                       long floating point                   @WA20293  01214000
R744CWH0 DS    BL8      Write hit change bit 0 CTR                      01215000
*                       long floating point                   @WA20293  01216000
R744CWH1 DS    BL8      Write hit change bit 1 CTR                      01217000
*                       long floating point                   @WA20293  01218000
R744CWMN DS    BL8      Write miss not registered counter               01219000
*                       long floating point                   @WA20293  01220000
R744CWMI DS    BL8      Write miss invalid state counter                01221000
*                       long floating point                   @WA20293  01222000
R744CWMT DS    BL8      Write miss storage class full counter           01223000
*                       long floating point                   @WA20293  01224000
R744CDER DS    BL8      Directory entry reclaim counter                 01225000
*                       long floating point                   @WA20293  01226000
R744CDTR DS    BL8      Data entry reclaim counter                      01227000
*                       long floating point                   @WA20293  01228000
R744CXDR DS    BL8      XI directory reclaim counter                    01229000
*                       long floating point                   @WA20293  01230000
R744CXFW DS    BL8      XI write counter                                01231000
*                       long floating point                   @WA20293  01232000
R744CXNI DS    BL8      XI name invalidation counter                    01233000
*                       long floating point                   @WA20293  01234000
R744CXCI DS    BL8      XI co,plement invalidation counter              01235000
*                       long floating point                   @WA20293  01236000
R744CCOC DS    BL8      Castout Counter                                 01237000
*                       long floating point                   @WA20293  01238000
R744CRSM DS    BL8      Reference signal miss counter                   01239000
*                       long floating point                   @WA20293  01240000
R744CTSF DS    BL8      Target storage class full counter               01241000
*                       long floating point                   @WA20293  01242000
R744CDEC DS    BL4      Directory entry counter snapshot      @WA20293  01243000
R744CDAC DS    BL4      Data element counter snapshot         @WA20293  01244000
R744CTCC DS    BL4      Total changed counter                           01245000
*                       long floating point                   @WA20293  01246000
R744CDTA DS    BL4      Data area counter                               01247000
*                       long floating point                   @WA20293  01248000
R744CRLC DS    BL8      Completed reference list counter                01249000
*                       long floating point                   @WA20293  01250000
R744CPRL DS    BL8      partially completed reference list counter      01251000
*                       long floating point                   @WA20293  01252000
R744CXRL DS    BL8      XI for local cache vector index replacement     01253000
*                       long floating point                   @WA20293  01254000
R744CWUC DS    BL8      Write unchanged counter                         01255000
*                       long floating point                   @WA20293  01256000
         SPACE 3                                                        01257000
         AIF   ('&X' EQ 'O').SUBTYP5                              @E1A  01258000
         MEXIT                                                    @E1A  01259000
.SUBTYP5 ANOP                                                     @E1A  01260000
         SPACE 2                                                        01261000
*********************************************************************** 01262000
*                                                                     * 01263000
*              Relocate blocks for sub type 5 - Monitor I             * 01264000
*              CACHE controller support                           @E1A* 01265000
*                                                                     * 01266000
*********************************************************************** 01267000
         SPACE 2                                                        01268000
***********  Subtype 5 control data section  ******************** @E1A  01269000
         SPACE 3                                                        01270000
R745CNTL DSECT                                                    @E1A  01271000
R745CLVL DS    BL1      Gatherer level                            @E1A  01272000
R745CMDL DS    BL1      Caching subsystem model                   @E1A  01273000
R745CCNT DS    BL1      Record sequence number                    @E1A  01274000
R745CUID DS    CL1      Real control unit ID                  @WA37816  01275000
R745CSC  DS    BL1      Status code                               @E1A  01276000
*                       00 = successful processed                 @E1A  01277000
*                       04 = IOS return code.      R745CIOC ^= 0  @E1A  01278000
*                       08 = IDCSS01 return code.  R745CRTN ^= 0  @E1A  01279000
*                       98 = SYSTEM or USER ABEND. R745CAE  ^= 0  @E1A  01280000
R745CAE  DS    BL3      ABEND CODE (SDWACMPC)                     @E1A  01281000
*                       First  12 bits = System comletion code    @E1A  01282000
*                       Second 12 bits = User comletion code      @E1A  01283000
*                       First  12 bits = System comletion code    @E1A  01284000
*                       Second 12 bits = User comletion code      @E1A  01285000
R745CRTN DS    BL2      IDCSS01 return code. If not zero, no device     01286000
*                       data sections.                            @E1A  01287000
R745CIOC DS    BL1      IOS return code. If not zero, no device         01288000
*                       data sections.                            @E1A  01289000
         DS    CL1      Reserved                                  @E1A  01290000
R745CINT DS    BL4      Number of seconds since subsystem statistics    01291000
*                       last collected                            @E1A  01292000
R745CCMT DS    CL28     Hardware type/model of this control unit. @G2A  01293000
*                       Mapped by NEDID in IHACDR                 @G2A  01294000
         SPACE 2                                                        01295000
***********  Subtype 5 CACHE device data section **************** @E1A  01296000
         SPACE 3                                                        01297000
R745DEV  DSECT                                                    @E1A  01298000
R745DVOL DS    CL6      Volume serial of device                   @E1A  01299000
R745DFL4 DS    BL1      Flags                                     @E1A  01300000
R745DEV4 EQU   X'80'    1... .... 4 digit device addr.            @E1A  01301000
*                       .111 1111 Reserved                        @E1A  01302000
R745DCID DS    CL1      Real control unit ID                  @WA37816  01303000
R745DUNT DS    CL3      Unit addr. for sense CMD                  @E1A  01304000
         DS    CL1      Reserved                                  @E1A  01305000
R745DEVN DS    BL2      Device number (binary)                    @E1A  01306000
         DS    CL2      Reserved                                  @E1A  01307000
R745DCNT DS    CL108    Caching subsystem counts                  @E1A  01308000
         ORG   R745DCNT                                           @E1A  01309000
R745DFLG DS    BL1      Flags                                     @E1A  01310000
R745DNAV EQU   X'80'    1... .... Subsystem storage not available @E1A  01311000
*                       .111 .... Reserved                        @E1A  01312000
R745DFRM EQU   X'0F'    Format of data returned (4 bits)          @E1A  01313000
*                       .... 0000   40 bytes sense                @E1A  01314000
*                       .... 1111   44 bytes sense                @E1A  01315000
R745DVID DS    BL1      Device address                            @E1A  01316000
R745DVS1 DS    BL1      Addressed device status 1                 @E1A  01317000
R745DSDV EQU   X'C0'    Device caching status (2 bits)            @E1A  01318000
*                       00.. ....   Caching activated             @E1A  01319000
*                       01.. ....   Not used                      @E1A  01320000
*                       10.. ....   Deactivate pending            @E1A  01321000
*                       11.. ....   Caching deactivated           @E1A  01322000
R745DSFW EQU   X'30'    DASD fast write device status (2 bits)    @E1A  01323000
*                       ..00 ....   DFW allowed                   @E1A  01324000
*                       ..01 ....   DFW not used                  @E1A  01325000
*                       ..10 ....   DFW deactivate pending        @E1A  01326000
*                       ..11 ....   DFW deactivate                @E1A  01327000
R745DSPD EQU   X'08'    Primary of duplex pair                    @E1A  01328000
R745DSSD EQU   X'04'    Secondary of duplex pair                  @E1A  01329000
R745DSDP EQU   X'03'    Duplex pair status (2 bits)               @E1A  01330000
*                       .... ..00   Duplex pair available         @E1A  01331000
*                       .... ..01   Duplex pair pending           @E1A  01332000
*                       .... ..10   Failed duplex primary         @E1A  01333000
*                       .... ..11   Failed duplex not primary     @E1A  01334000
R745DVS2 DS    BL1      Addressed device status 2                 @E1A  01335000
R745DSDF EQU   X'80'    1... ....   Device is failed duplex       @E1A  01336000
R745DSPN EQU   X'40'    .1          Pinned data exits for device  @E1A  01337000
R745DSOD EQU   X'3F'    ..11 1111   Other device in duplex pair   @E1A  01338000
*                                   (6 relevant birs)             @E1A  01339000
R745DRCR DS    BL4      Search read caching requests              @E1A  01340000
*                       Format: floating point short              @E1A  01341000
R745DCRH DS    BL4      Search read caching hits                  @E1A  01342000
*                       Format: floating point short              @E1A  01343000
R745DWRC DS    BL4      Write caching requests                    @E1A  01344000
*                       Format: floating point short              @E1A  01345000
R745DWCH DS    BL4      Write caching requ. hits                  @E1A  01346000
*                       Format: floating point short              @E1A  01347000
R745DRSR DS    BL4      Read sequential requests                  @E1A  01348000
*                       Format: floating point short              @E1A  01349000
R745DRSH DS    BL4      Read sequential requ.hits                 @E1A  01350000
*                       Format: floating point short              @E1A  01351000
R745DWSR DS    BL4      Write sequential requests                 @E1A  01352000
*                       Format: floating point short              @E1A  01353000
R745DWSH DS    BL4      Write sequ. request hits                  @E1A  01354000
*                       Format: floating point short              @E1A  01355000
R745DRNR DS    BL4      Search read non-retentive requests        @E1A  01356000
*                       Format: floating point short              @E1A  01357000
R745DNRH DS    BL4      Search read non-retentive request hits    @E1A  01358000
*                       Format: floating point short              @E1A  01359000
R745DWNR DS    BL4      Write non-retentive requests              @E1A  01360000
*                       Format: floating point short              @E1A  01361000
R745DWNH DS    BL4      Write non-retentive hits                  @E1A  01362000
*                       Format: floating point short              @E1A  01363000
R745DICL DS    BL4      Inhibit cache load requests               @E1A  01364000
*                       Format: floating point short              @E1A  01365000
R745DBCR DS    BL4      Bypass cache requests                     @E1A  01366000
*                       Format: floating point short              @E1A  01367000
R745DTC  DS    BL4      Seq DASD to cache XFRs                    @E1A  01368000
*                       Format: floating point short              @E1A  01369000
R745DNTD DS    BL4      Normal cache requests DASD to CACHE XFRs  @E1A  01370000
*                       Format: floating point short              @E1A  01371000
R745DCTD DS    BL4      CACHE to DASD XFRs                        @E1A  01372000
*                       Format: floating point short              @E1A  01373000
R745DFWB DS    BL4      Fast write bypass count                   @E1A  01374000
*                       Format: floating point short              @E1A  01375000
R745DFWC DS    BL4      Fast write caching reqests                @E1A  01376000
*                       Format: floating point short              @E1A  01377000
R745DFWS DS    BL4      Fast write sequ. reqequessts              @E1A  01378000
*                       Format: floating point short              @E1A  01379000
R745DCRM DS    BL4      Record cache read misses                  @E1A  01380000
*                       Format: floating point short              @E1A  01381000
R745DSG2 DS    BL1      Device status group 2                     @E1A  01382000
R745DCOL EQU   X'C0'    Record cache optimization level (2 bits)  @E1A  01383000
*                       00.. ....   Full adapt rec cache          @E1A  01384000
*                       01.. ....   Adapt rec. cache writes       @E1A  01385000
*                       10.. ....   Rec cache on def ext          @E1A  01386000
*                       11.. ....   Track mode                    @E1A  01387000
R745DEFN EQU   X'20'    Data exits in failed NVS                  @E1A  01388000
R745DBDP EQU   X'10'    Defective battery destage pending         @E1Al 01389000
R745DVST EQU   X'0C'    Volume state (2 relevant bits)            @E1A  01390000
*                       .... 00..   Non spare                     @E1A  01391000
*                       .... 01..   Reserved                      @E1A  01392000
*                       .... 10..   Spare                         @E1A  01393000
*                       .... 11..   Broken spare                  @E1A  01394000
R745DPDT EQU   X'03'    Pinned data (2 relevant bits)             @E1A  01395000
*                       .... ..00   No pinned data & FW           @E1A  01396000
*                       .... ..01   Pinned data & not FW suspend  @E1A  01397000
*                       .... ..10   Reserved                      @E1A  01398000
*                       .... ..11   Pinned data & FW suspend      @E1A  01399000
         DS    CL1      Reserved                                  @E1A  01400000
R745DSID DS    BL2      Subsystem ID                              @E1A  01401000
R745DCWP DS    BL4      RCD cache write promotions                @E1A  01402000
*                       Format: floating point short              @E1A  01403000
R745DKDW DS    BL4      CKD writes                                @E1A  01404000
*                       Collected for 3990-03/06 and 2105     @WA37816  01405000
*                       Format: floating point short              @E1A  01406000
R745DKDH DS    BL4      CKD writes hits                           @E1A  01407000
*                       Collected for 3990-03/06 and 2105     @WA37816  01408000
*                       Format: floating point short              @E1A  01409000
R745DFWR DS    BL4      CFW bypass                                @E1A  01410000
*                       Collected for 3990-03/06 and 2105     @WA37816  01411000
*                       Format: floating point short              @E1A  01412000
         SPACE 2                                                        01413000
*******  Subtype 5, CACHE device data section extension     ***** @E1A  01414000
*******  This extension is not used by RMF and applies      ***** @E1A  01415000
*******  only to control unit 3990-03 and 3990-06.          ***** @E1A  01416000
*******  It is collected by RMF to provide the same data    ***** @E1A  01417000
*******  as in the corresponding CRR_record.                ***** @E1A  01418000
*******  The data, except the device number R745XDVN, are   ***** @E1A  01419000
*******  in short floating point format.                    ***** @E1A  01420000
         SPACE                                                          01421000
R745XDEV DSECT                                                    @E1A  01422000
R745XDVN DS    BL2      Device number (binary)                    @E1A  01423000
         DS    CL2      Reserved                                  @E1A  01424000
R745XCNT DS    CL84     Counts                                    @E1A  01425000
         ORG   R745XCNT                                           @E1A  01426000
R745XRSV DS    BL4      Lower interface I/O msec              @WA37816  01427000
R745XCTC DS    BL4      Not Used by RMF                           @E1A  01428000
R745XCTR DS    BL4      Not used by RMF                           @E1A  01429000
R745XVRD DS    BL4      Not used by RMF                           @E1A  01430000
R745XVRH DS    BL4      Not used by RMF                           @E1A  01431000
R745XVWR DS    BL4      Not used by RMF                           @E1A  01432000
R745XVWH DS    BL4      Not used by RMF                           @E1A  01433000
R745XSRR DS    BL4      Not used by RMF                           @E1A  01434000
R745XFRD DS    BL4      Not used by RMF                           @E1A  01435000
R745XWCC DS    BL4      Not used by RMF                           @E1A  01436000
R745XPRC DS    BL4      Not used by RMF                           @E1A  01437000
R745XCT1 DS    BL4      Not used by RMF                           @E1A  01438000
R745XCT2 DS    BL4      Not used by RMF                           @E1A  01439000
R745XCT3 DS    BL4      Not used by RMF                           @E1A  01440000
R745XCT4 DS    BL4      Not used by RMF                           @E1A  01441000
R745XCT5 DS    BL4      Not used by RMF                           @E1A  01442000
R745XCT6 DS    BL4      Not used by RMF                           @E1A  01443000
R745XCT7 DS    BL4      Not used by RMF                           @E1A  01444000
R745XCT8 DS    BL4      Not used by RMF                           @E1A  01445000
R745XCT9 DS    BL4      Not used by RMF                           @E1A  01446000
R745XCTA DS    BL4      Not used by RMF                           @E1A  01447000
         SPACE 2                                                        01448000
*******  Subtype 5, RAID rank Data Section  ***************** @WA37816  01449000
*******  All counters are in short floating point format. *** @WA37816  01450000
         SPACE                                                          01451000
R7451DEV DSECT                                                @WA37816  01452000
R7451DVN DS    BL2      Device number (binary)                @WA37816  01453000
         DS    CL2      Reserved                              @WA37816  01454000
R7451E1  DS    CL84     Data extension                        @WA37816  01455000
         ORG   R7451E1                                        @WA37816  01456000
R7451RSV DS    BL4      Lower interface I/O msec              @WA37816  01457000
*                       Floating point short                  @WA37816  01458000
R7451FLG DS    BL1      Flags:                                @WA37816  01459000
*                       0000 0000   No additional data        @WA37816  01460000
*                       0000 0001   RAID rank data            @WA37816  01461000
*******  RAID rank info ************************************* @WA37816  01462000
R7451AID DS    BL1      Device adapter ID                     @WA37816  01463000
R7451RID DS    BL2      RAID rank ID                          @WA37816  01464000
R7451HDD DS    BL1      Number of HDD in RAID rank            @WA37816  01465000
R7451RTY DS    BL1      RAID Rank type                            @I6C  01466000
*                       0     RAID-5                              @I6A  01467000
*                       1     JBOD (just a bunch of disks)        @I6A  01468000
*                       2     RAID 1/0                            @I6A  01469000
R7451HSS DS    BL2      HDD sector size                       @WA37816  01470000
*/**** All the following counts in this section ************* @WA37816  01471000
*/**** are in short floating point notation.    ************* @WA37816  01472000
R7451RRQ DS    BL4      RAID rank read requests               @WA37816  01473000
R7451WRQ DS    BL4      RAID rank write requests              @WA37816  01474000
R7451SR  DS    BL4      RR FB sectors read                    @WA37816  01475000
R7451SW  DS    BL4      RR FB sectors written                 @WA37816  01476000
R7451RMR DS    BL4      Record mode read request              @WA37816  01477000
R7451XSF DS    BL4      XRC or CC sidefile read requests      @WA37816  01478000
R7451XCW DS    BL4      XRC or CC contaminated writes         @WA37816  01479000
R7451TSP DS    BL4      Number of tracks transferred to secondary       01480000
*                       PPRC volume                           @WA37816  01481000
R7451NVS DS    BL4      NVS space allocation                  @WA37816  01482000
R7451RRT DS    BL4      RR read response time                 @WA37816  01483000
R7451WRT DS    BL4      RR write response time                @WA37816  01484000
R7451CT1 DS    BL4      Reserved                              @WA37816  01485000
R7451CT2 DS    BL4      Reserved                              @WA37816  01486000
R7451CT3 DS    BL4      Reserved                              @WA37816  01487000
R7451CT4 DS    BL4      Reserved                              @WA37816  01488000
R7451CT5 DS    BL4      Reserved                              @WA37816  01489000
R7451CT6 DS    BL4      Reserved                              @WA37816  01490000
R7451CT7 DS    BL4      Reserved                              @WA37816  01491000
         SPACE 2                                                        01492000
         SPACE 2                                                        01493000
***********  Subtype 5 CACHE control unit status data section *** @E1A  01494000
         SPACE 3                                                        01495000
R745STAT DSECT                                                    @E1A  01496000
R745SVOL DS    CL6      Volume serial of device                   @E1A  01497000
         DS    CL2      Reserved                                  @E1A  01498000
R745SUNT DS    CL3      Unit addr. for sense CMD                  @E1A  01499000
         DS    CL1      Reserved                                  @E1A  01500000
R745SDEV DS    BL2      Device number (binary)                    @E1A  01501000
R745SLN  DS    BL2      Length of data section                    @E1A  01502000
R745ST   DS    CL44     Caching status                            @E1A  01503000
         ORG   R745ST                                             @E1A  01504000
R745SFT  DS    BL1      Status data format                        @E1A  01505000
*                       ....0000   40 bytes sense                 @E1A  01506000
*                       ....1111   44 bytes sense                 @E1A  01507000
R745SDID DS    BL1      Device ID                                 @E1A  01508000
R745SNAD DS    BL1      Num. of attached devices                  @E1A  01509000
R745SNSS DS    BL1      Num. of statistic sets                    @E1A  01510000
R745SCS  DS    BL1      Caching status                            @E1A  01511000
R745SOS  EQU   X'E0'    Overall caching status (3 relevant bits)  @E1A  01512000
*                       000. ....   Caching active                @E1A  01513000
*                       001. ....   Pending active                @E1A  01514000
*                       010. ....   Subsystem error               @E1A  01515000
*                       011. ....   Reserved                      @E1A  01516000
*                       100. ....   Host or SF deac.              @E1A  01517000
*                       101. ....   Cache suspended               @E1A  01518000
*                       110. ....   Pending off in process        @E1A  01519000
*                       111. ....   Pending off failure           @E1A  01520000
R745SDS  EQU   X'10'    ...1 ....   Disabled for maintenance      @E1A  01521000
R745SIM  EQU   X'02'    .... ..1.   IML device not available      @E1A  01522000
R745SNR  EQU   X'01'    .... ...1   Non-retentive deactivated     @E1A  01523000
R745SVSS DS    BL1      Non-volatile storage stat.                @E1A  01524000
R745SNHT EQU   X'80'    1... ....   Host termination              @E1A  01525000
R745SNIS EQU   X'40'    .1.. ....   Problem termination           @E1A  01526000
R745SNDS EQU   X'10'    ...1 ....   Disabled for maintenance      @E1A  01527000
R745SNPE EQU   X'08'    .... 1...   Pending due to problem        @E1A  01528000
R745SCLN DS    BL2      Lng.of subsys. count area                 @E1A  01529000
         DS    CL2      Reserved                                  @E1A  01530000
R745SCNF DS    BL4      Configured subsystem storage              @E1A  01531000
R745SAVL DS    BL4      Available subsystem storage               @E1A  01532000
R745SPIN DS    BL4      Pinned subsystem storage                  @E1A  01533000
*                       Collected for 3990-03/06 and 2105     @WA37816  01534000
R745SOFF DS    BL4      Offline subsystem storage                 @E1A  01535000
*                       Collected for 3990-03/06 and 2105     @WA37816  01536000
R745SDS1 DS    BL1      Addressed device status 1                 @E1A  01537000
R745SDCS EQU   X'C0'    Device caching status (2 relevant bits)   @E1A  01538000
*                       00.. ....  Activated                      @E1A  01539000
*                       01.. ....  Not used                       @E1A  01540000
*                       10.. ....  Deactivate pending             @E1A  01541000
*                       11.. ....  Deactivated                    @E1A  01542000
R745SDFW EQU   X'30'    DASD fast write status (2 relevant bits)  @E1A  01543000
*                       ..00 ....  DFW allowed                    @E1A  01544000
*                       ..01 ....  Not used                       @E1A  01545000
*                       ..10 ....  Deactivate pending             @E1A  01546000
*                       ..11 ....  Deactivated                    @E1A  01547000
R745SPDP EQU   X'08'    .... 1...  Primary duplex pair            @E1A  01548000
R745SSDP EQU   X'04'    .... .1..  Secondary duplex pair          @E1A  01549000
R745SDPS EQU   X'03'    Duplex pair status (2 relevant bits)      @E1A  01550000
*                       .... ..00  Available                      @E1A  01551000
*                       .... ..01  Pending                        @E1A  01552000
*                       .... ..10  Failed primary                 @E1A  01553000
*                       .... ..11  Failed not prim.               @E1A  01554000
R745SDS2 DS    BL1      Addressed device status 2                 @E1A  01555000
R745SFDP EQU   X'80'    1... ....  Device is failed duplex        @E1A  01556000
R745SDPN EQU   X'40'    .1.. ....  Pinned data                    @E1A  01557000
R745SOD  EQU   X'3F'    ..11 1111  Other device in duplex               01558000
*                                  (3 relevant bits)              @E1A  01559000
R745SCNV DS    BL4      Config. non-volatile cache                @E1A  01560000
*                       Collected for 3990-03/06 and 2105     @WA37816  01561000
R745SPND DS    BL4      Pinned non-volatile cache                 @E1A  01562000
*                       Collected for 3990-03/06 and 2105     @WA37816  01563000
R745SG2  DS    BL1      Device status group 2                     @E1A  01564000
R745SCOL EQU   X'C0'    Cache optimization level (2 relevant bits)@E1A  01565000
*                       00.. ....   Rec. full adapt               @E1A  01566000
*                       01.. ....   Write rec adapt               @E1A  01567000
*                       10.. ....   Def ext record                @E1A  01568000
*                       11.. ....   Track mode                    @E1A  01569000
R745SFVS EQU   X'20'    ..1. ....   Data on failed NVS            @E1A  01570000
R745SDBP EQU   X'10'    ...1 ....   Defective battery destage           01571000
*                                   pending                       @E1A  01572000
R745SVST EQU   X'0C'    Volume state (2 relevant bits)            @E1A  01573000
*                       .... 00..   Non_spare                     @E1A  01574000
*                       .... 01..   Reserved                      @E1A  01575000
*                       .... 10..   Spare                         @E1A  01576000
*                       .... 11..   Broken spare                  @E1A  01577000
R745SPDA EQU   X'03'  Pinned data (2 relevant bits)               @E1A  01578000
*                       .... ..00   Not pinned & FW               @E1A  01579000
*                       .... ..01   Pinned & not FW suspend       @E1A  01580000
*                       .... ..10   Reserved                      @E1A  01581000
*                       .... ..11   Pinned & FW susp.             @E1A  01582000
R745SGL  DS    BL1      Gobal status                              @E1A  01583000
*                       1000  0000  X'80' CFW & DFW suspended     @E1A  01584000
R745SSID DS    CL2      Subsystem Id                              @E1A  01585000
R745SS0  DS    BL1      Reserved                              @WA22735  01586000
R745SS1  DS    BL1      Reserved                              @WA22735  01587000
R745SNS0 DS    BL1      Reserved                              @WA22735  01588000
R745SNS1 DS    BL1      Reserved                              @WA22735  01589000
         DS    CL12     Reserved                                  @G2A  01590000
         AIF   ('&X' EQ 'O').SUBTYP6                              @H1A  01591000
         MEXIT                                                    @H1A  01592000
.SUBTYP6 ANOP                                                     @H1A  01593000
         SPACE 2                                                        01594000
*********************************************************************** 01595000
*                                                                     * 01596000
*              Relocate blocks for subtype 6 - Monitor III            * 01597000
*              HFS data (Global and File System statistics).          * 01598000
*                                                                     * 01599000
*********************************************************************** 01600000
         SPACE 2                                                        01601000
***********  Subtype 6, HFS Global Data Section ***************** @H1A  01602000
         SPACE 3                                                        01603000
R746GDAT DSECT                                                    @H1A  01604000
R746GMXV DS    BL4      Value of VIRTUAL(MAX) (in MB)             @H1A  01605000
R746GUSV DS    BL4      Total amount (in pages) of virtual        @H1A  01606000
*                       storage assigned to I/O buffers           @H1A  01607000
R746GMNF DS    BL4      Value of FIXED(MIN) (in MB)               @H1A  01608000
R746GUSF DS    BL4      Total amount (in pages) of permanently    @H1A  01609000
*                       fixed storage assigned to I/O buffers     @H1A  01610000
R746GMC  DS    BL8      Number of times the metadata for a file   @H1A  01611000
*                       was found in virtual storage (cache)      @H1A  01612000
*                       during file lookup                        @H1A  01613000
*                       Format: long floating point               @H1A  01614000
R746GMNC DS    BL8      Number of times the metadata for a file   @H1A  01615000
*                       was not found in virtual storage (cache)  @H1A  01616000
*                       during file lookup and an index call was  @H1A  01617000
*                       necessary which may result in an I/O      @H1A  01618000
*                       Format: long floating point               @H1A  01619000
R746G1C  DS    BL8      Number of times the first page of a data  @H1A  01620000
*                       file was requested and found in virtual   @H1A  01621000
*                       storage (cache)                           @H1A  01622000
*                       Format: long floating point               @H1A  01623000
R746G1NC DS    BL8      Number of times the first page of a data  @H1A  01624000
*                       file was requested and not found in       @H1A  01625000
*                       virtual storage (cache) and a I/O was     @H1A  01626000
*                       necessary                                 @H1A  01627000
*                       Format: long floating point               @H1A  01628000
R746GLRC DS    BL4      Return code from OMVS BPX1PCT interface   @H1A  01629000
*                       for DisplayBufferLimits command           @H1A  01630000
R746GLRS DS    BL4      Reason code from OMVS BPX1PCT interface   @H1A  01631000
*                       for DisplayBufferLimits command           @H1A  01632000
R746GSRC DS    BL4      Return code from OMVS BPX1PCT interface   @H1A  01633000
*                       for DisplayGlobalStats command            @H1A  01634000
R746GSRS DS    BL4      Reason code from OMVS BPX1PCT interface   @H1A  01635000
*                       for DisplayGlobalStats command            @H1A  01636000
R746GSFL DS    BL1      Status flgags                             @H1A  01637000
R746GONR EQU   X'80'    1... .... OMVS kernel not ready           @H1A  01638000
R746GNBL EQU   X'40'    .1.. .... No buffer limit data            @H1A  01639000
R746GNGD EQU   X'20'    ..1. .... No global data                  @H1A  01640000
R746GPGD EQU   X'10'    ...1 .... Partial global data             @H1A  01641000
*                       .... 1111 Reserved                        @H1A  01642000
         DS    BL7      Reserved                                  @H1A  01643000
         SPACE 2                                                        01644000
***********  Subtype 6, HFS Global Buffer Section *************** @H1A  01645000
         SPACE 3                                                        01646000
R746GBUF DSECT                                                    @H1A  01647000
R746GSB  DS    BL2      Size of buffers in buffer pool (in pages) @H1A  01648000
R746GNDS DS    BL2      Number of data spaces for buffer pool     @H1A  01649000
R746GSBP DS    BL4      Size of buffer pool (in pages)            @H1A  01650000
R746GSBF DS    BL4      Size of permanently fixed buffers in      @H1A  01651000
*                       buffer pool (in pages)                    @H1A  01652000
         DS    BL4      Reserved                                  @H1A  01653000
R746GBF  DS    BL8      Number of times a buffer was already      @H1A  01654000
*                       fixed prior to an I/O request in buffer   @H1A  01655000
*                       pool                                      @H1A  01656000
*                       Format: long floating point               @H1A  01657000
R746GBNF DS    BL8      Number of times a buffer was not already  @H1A  01658000
*                       fixed prior to an I/O request in buffer   @H1A  01659000
*                       pool                                      @H1A  01660000
*                       Format: long floating point               @H1A  01661000
         SPACE 2                                                        01662000
***********  Subtype 6, HFS File System Section ***************** @H1A  01663000
         SPACE 3                                                        01664000
R746FSYS DSECT                                                    @H1A  01665000
R746FSNM DS    CL44     File system name (cataloged dataset name) @H1A  01666000
R746FSNL DS    BL1      Length of file system name                @H1A  01667000
R746FSFL DS    BL1      Status flags                              @H1A  01668000
R746FNHS EQU   X'80'    1... .... No HFS file system statistics   @H1A  01669000
R746FMTC EQU   X'40'    .1.. .... Mount time changed              @H1A  01670000
R746FFSM EQU   X'20'    ..1. .... File system now mounted         @H1A  01671000
*                       ...1 1111 Reserved                        @H1A  01672000
         DS    BL2      Reserved                                  @H1A  01673000
R746FCTM DS    BL8      Current timestamp (when data obtained)    @H1A  01674000
R746FMTM DS    BL8      Mount timestamp                           @H1A  01675000
R746FSF  DS    BL4      Size of file system (in pages)            @H1A  01676000
R746FPF  DS    BL4      Number of pages internally used by HFS    @H1A  01677000
R746FPD  DS    BL4      Number of pages used for the attribute    @H1A  01678000
*                       directory                                 @H1A  01679000
R746FPC  DS    BL4      Number of data buffer pages cached by     @H1A  01680000
*                       this file system                          @H1A  01681000
R746FSFI DS    BL8      Number of sequential file data I/O        @H1A  01682000
*                       requests issued                           @H1A  01683000
*                       Format: long floating point               @H1A  01684000
R746FRFI DS    BL8      Number of random file data I/O requests   @H1A  01685000
*                       issued                                    @H1A  01686000
*                       Format: long floating point               @H1A  01687000
R746FMC  DS    BL8      Number of times the metadata for a file   @H1A  01688000
*                       was found in virtual storage (cache)      @H1A  01689000
*                       during file lookup                        @H1A  01690000
*                       Format: long floating point               @H1A  01691000
R746FMNC DS    BL8      Number of times the metadata for a file   @H1A  01692000
*                       was not found in virtual storage (cache)  @H1A  01693000
*                       during file lookup and an index call was  @H1A  01694000
*                       necessary which may result in an I/O      @H1A  01695000
*                       Format: long floating point               @H1A  01696000
R746F1C  DS    BL8      Number of times the first page of a data  @H1A  01697000
*                       file was requested and found in virtual   @H1A  01698000
*                       storage (cache)                           @H1A  01699000
*                       Format: long floating point               @H1A  01700000
R746F1NC DS    BL8      Number of times the first page of a data  @H1A  01701000
*                       file was requested and not found in       @H1A  01702000
*                       virtual storage (cache) and a I/O was     @H1A  01703000
*                       necessary                                 @H1A  01704000
*                       Format: long floating point               @H1A  01705000
R746FINT DS    BL8      Number of index new tops                  @H1A  01706000
*                       Format: long floating point               @H1A  01707000
R746FIS  DS    BL8      Number of index splits                    @H1A  01708000
*                       Format: long floating point               @H1A  01709000
R746FIJ  DS    BL8      Number of index joins                     @H1A  01710000
*                       Format: long floating point               @H1A  01711000
R746FIRH DS    BL8      Number of index page read hits            @H1A  01712000
*                       Format: long floating point               @H1A  01713000
R746FIRM DS    BL8      Number of index page read misses          @H1A  01714000
*                       Format: long floating point               @H1A  01715000
R746FIWH DS    BL8      Number of index page write hits           @H1A  01716000
*                       Format: long floating point               @H1A  01717000
R746FIWM DS    BL8      Number of index page write misses         @H1A  01718000
*                       Format: long floating point               @H1A  01719000
R746FSRC DS    BL4      Return code from OMVS BPX1PCT interface   @H1A  01720000
*                       for DisplayFSStats command                @H1A  01721000
R746FSRS DS    BL4      Reason code from OMVS BPX1PCT interface   @H1A  01722000
*                       for DisplayFSStats command                @H1A  01723000
         AIF   ('&X' EQ 'O').SUBTYP7                              @I1A  01724000
         MEXIT                                                    @I1A  01725000
.SUBTYP7 ANOP                                                     @I1A  01726000
         SPACE 2                                                        01727000
*********************************************************************** 01728000
*                                                                     * 01729000
*              Relocate blocks for subtype 7 - Monitor I              * 01730000
*                     FICON Director Measurements.                    * 01731000
*                                                                     * 01732000
*********************************************************************** 01733000
         SPACE 2                                                        01734000
************ Subtype 7, FCD Global Data Section ***************** @I1A  01735000
         SPACE 3                                                        01736000
R747GDAT DSECT                                                    @I1A  01737000
R747GCFL DS    BL1      Configuration change flags                @I1A  01738000
R747GDCA EQU   X'80'    1... ....  ON = Config. changed during    @I1A  01739000
*                                       interval                  @I1A  01740000
R747GIAC EQU   X'40'    .1.. ....  ON = Config. changed since IPL @I1A  01741000
R747GIOD EQU   X'20'    ..1. ....  ON = System IPLed via IODF     @I1A  01742000
R747GICV EQU   X'10'    ...1 ....  ON = I/O conf. token is valid  @I1A  01743000
*                       .... 1111  Reserved                       @I1A  01744000
         DS    BL1      Reserved                                  @I1A  01745000
R747GNFD DS    BL2      Number of installed FCD switches          @I1A  01746000
R747GINM DS    CL44     IODF name                                 @I1A  01747000
R747GISF DS    CL2      Suffix of IODF name                       @I1A  01748000
R747GICI DS    0CL18    IODF creation info                        @I1A  01749000
R747GICD DS    CL10     IODF creation date mm/dd/yyyy             @I1A  01750000
R747GICT DS    CL8      IODF creation time hh.mm.ss               @I1A  01751000
         DS    BL12     Reserved                                  @I1A  01752000
         SPACE 2                                                        01753000
************ Subtype 7, FCD Switch Data Section ***************** @I1A  01754000
         SPACE 3                                                        01755000
R747SDAT DSECT                                                    @I1A  01756000
R747SDEV DS    BL2      Switch device number                      @I1A  01757000
R747SLSN DS    BL1      Logical switch number                     @I1A  01758000
R747SPFL DS    BL1      Switch processing flags                   @I1A  01759000
R747SVAR EQU   X'80'    Switch status changed                     @I1A  01760000
R747SNPC EQU   X'40'    Number of ports has changed               @I1A  01761000
*                       ..11 1111 Reserved                        @I1A  01762000
R747SND  DS    BL32     ND associated with switch device          @I1A  01763000
R747SNSP DS    BL2      Number of supported ports                 @I1A  01764000
R747SNIP DS    BL2      Number of installed ports                 @I1A  01765000
         DS    BL8      Reserved                                  @I1A  01766000
         SPACE 2                                                        01767000
************ Subtype 7, FCD Port Data Section ******************* @I1A  01768000
         SPACE 3                                                        01769000
R747PDAT DSECT                                                    @I1A  01770000
R747PNUM DS    BL1      Port number                               @I1A  01771000
R747PADR DS    BL1      Port address                              @I1A  01772000
R747PTFL DS    BL1      Port type flag                            @I1A  01773000
R747PSCU EQU   X'80'    1... .... Port type is single CU          @I1A  01774000
R747PMCU EQU   X'40'    .1.. .... Port type is multiple CUs       @I1A  01775000
R747PCHP EQU   X'20'    ..1. .... Port type is CHPID              @I1A  01776000
*                       ...1 1111 Reserved                        @I1A  01777000
R747PSFL DS    BL1      Status flags                              @I1A  01778000
R747PTNU EQU   X'80'    1... .... Port type is not unique         @I1A  01779000
R747PINU EQU   X'40'    .1.. .... Id is not unique or not known   @I1A  01780000
*                       ..11 .... Reserved                        @I1A  01781000
R747PVAR EQU   X'08'    .... 1... Port status changed             @I1A  01782000
R747PREM EQU   X'04'    .... .1.. Port has been removed           @I1A  01783000
R747PACT EQU   X'02'    .... ..1. Port has been activated         @I1A  01784000
R747PNMD EQU   X'01'    .... ...1 This entry doesn't contain      @I1A  01785000
*                                 measurement data                @I1A  01786000
R747PCU  DS    0BL2     Connector id (CU)                         @I1A  01787000
         DS    BL1      Reserved                                  @I1A  01788000
R747PCP  DS    BL1      Connector id (channel path)               @I1A  01789000
R747PCUN DS    BL1      Number of connecting CUs                  @I1A  01790000
R747PNPC DS    BL1      Number of connector sections              @I1A  01791000
R747PXPC DS    BL2      Index of first connector section          @I1A  01792000
         DS    BL6      Reserved                                  @I1A  01793000
R747PFPT DS    BL8      Frame pacing time (in units of 2.5        @I1A  01794000
*                       milli-seconds)                            @I1A  01795000
*                       Format: long floating point               @I1A  01796000
R747PNWR DS    BL8      Number of words received                  @I1A  01797000
*                       Format: long floating point               @I1A  01798000
R747PNWT DS    BL8      Number of words transmitted               @I1A  01799000
*                       Format: long floating point               @I1A  01800000
R747PNFR DS    BL8      Number of frames received                 @I1A  01801000
*                       Format: long floating point               @I1A  01802000
R747PNFT DS    BL8      Number of frames transmitted              @I1A  01803000
*                       Format: long floating point               @I1A  01804000
R747PNER DS    BL8      Number of errors                      @WA46825  01805990
*                       Format: long floating point               @I1A  01806980
         DS    BL8      Reserved                              @WA46825  01807970
         SPACE 2                                                        01809000
************ Subtype 7, FCD Connector Data Section ************** @I1A  01810000
         SPACE 3                                                        01811000
R747CDAT DSECT                                                    @I1A  01812000
R747CNUM DS    BL1      Port number                               @I1A  01813000
R747CADR DS    BL1      Port address                              @I1A  01814000
R747CTFL DS    BL1      Port type flag                            @I1A  01815000
R747CSCU EQU   X'80'    1... .... Port type is single CU          @I1A  01816000
R747CMCU EQU   X'40'    .1.. .... Port type is multiple CUs       @I1A  01817000
R747CCHP EQU   X'20'    ..1. .... Port type is CHPID              @I1A  01818000
*                       ...1 1111 Reserved                        @I1A  01819000
R747CSFL DS    BL1      Status flags                              @I1A  01820000
R747CTNU EQU   X'80'    1... .... Port type is not unique         @I1A  01821000
R747CINU EQU   X'40'    .1.. .... Id is not unique or not known   @I1A  01822000
*                       ..11 .... Reserved                        @I1A  01823000
R747CVAR EQU   X'08'    .... 1... Port status changed             @I1A  01824000
R747CREM EQU   X'04'    .... .1.. Port has been removed           @I1A  01825000
R747CACT EQU   X'02'    .... ..1. Port has been activated         @I1A  01826000
R747CNMD EQU   X'01'    .... ...1 This entry doesn't contain      @I1A  01827000
*                                 measurement data                @I1A  01828000
R747CCU  DS    0BL2     Connector id (CU)                         @I1A  01829000
         DS    BL1      Reserved                                  @I1A  01830000
R747CCP  DS    BL1      Connector id (channel path)               @I1A  01831000
R747CCUN DS    BL1      Number of connecting CUs                  @I1A  01832000
         DS    BL1      Reserved                                  @I1A  01833000
         MEND  ,                                                        01834000
                        */                                              01835000
*                                                                    */ 01836000
*%PLS74: ;                                                              01837000
*   /* COMMON SMF HEADER */                                             01838000
*   @SPACE;                                                             01839000
*?ERBHDR TYPE(74) ATTRIBUT(BASED(SMF74PTR));                            01840000
*%IF IFAR741 = 'YES' %THEN %GO TO LHDX741; /* Subtype 1          @Y1A*/ 01841000
*%IF IFAR742 = 'YES' %THEN %GO TO LHDX742; /* Subtype 2          @Y1A*/ 01842000
*%IF IFAR743 = 'YES' %THEN %GO TO LHDX743; /* Subtype 3          @B2A*/ 01843000
*%IF IFAR744 = 'YES' %THEN %GO TO LHDX744; /* Subtype 4          @C1A*/ 01844000
*%IF IFAR745 = 'YES' %THEN %GO TO LHDX745; /* Subtype 5          @E1A*/ 01845000
*%IF IFAR746 = 'YES' %THEN %GO TO LHDX746; /* Subtype 6          @H1A*/ 01846000
*%IF IFAR747 = 'YES' %THEN %GO TO LHDX747; /* Subtype 7          @I1A*/ 01847000
*%IFAR741 = 'YES';                /* No valid subtype, use default      01848000
*                                    subtype 1                   @Y1A*/ 01849000
*%LHDX741:;                       /* Subtype 1                   @Y1A*/ 01850000
*   @SPACE;                                                             01851000
*   /* Individual header extension for subtype 1  */                    01852000
*      2 SMF74HDX,                /* HEADER EXTENSION                */ 01853000
*       3 SMF74DCS FIXED(31),     /* OFFSET TO DEVICE CNTL SECTION   */ 01854000
*       3 SMF74DCL FIXED(15),     /* LENGTH OF DEVICE CNTL SECTION   */ 01855000
*       3 SMF74DCN FIXED(15),     /* NUMBER OF DEVICE CNTL SECTIONS  */ 01856000
*       3 SMF74DDS FIXED(31),     /* OFFSET TO DEVICE DATA SECTION   */ 01857000
*       3 SMF74DDL FIXED(15),     /* LENGTH OF DEVICE DATA SECTION   */ 01858000
*       3 SMF74DDN FIXED(15);     /* NUMBER OF DEVICE DATA SECTIONS  */ 01859000
*%IF IFAR742 ^= 'YES' %THEN %GO TO LHDX743; /* Not subtype 2     @B2C*/ 01860000
*%LHDX742:;                       /* Subtype 2                   @Y1A*/ 01861000
*   @SPACE;                                                             01862000
*   /* Individual header extension for subtype 2  */                    01863000
*%IF IFAR741 ^= 'YES' %THEN %GO TO LHDX7421; /* Not subtype 1    @Y1A*/ 01864000
*   DECLARE                                                             01865000
*      1 SMF742XH DEFINED(SMF74HDX), /* Header extension for            01866000
*                                      subtype 2                 @Y1A*/ 01867000
*%LHDX7421:;                        /* Subtype 2                 @Y1A*/ 01868000
*      2 SMF742HX,                  /* Header extension for subtype 2   01869000
*                                                                @Y1A*/ 01870000
*       3 SMF742CO FIXED(31),       /* Offset to control data section   01871000
*                                                                @Y1A*/ 01872000
*       3 SMF742CL FIXED(15),       /* Length of control data section   01873000
*                                                                @Y1A*/ 01874000
*       3 SMF742CN FIXED(15),       /* Number of control data sections  01875000
*                                                                @Y1A*/ 01876000
*       3 SMF742SO FIXED(31),       /* Offset to system data            01877000
*                                      section                   @Y1A*/ 01878000
*       3 SMF742SL FIXED(15),       /* Length of system data            01879000
*                                      section                   @Y1A*/ 01880000
*       3 SMF742SN FIXED(15),       /* Number of system data            01881000
*                                      section                   @Y1A*/ 01882000
*       3 SMF742PO FIXED(31),       /* Offset to path data section      01883000
*                                                                @Y1A*/ 01884000
*       3 SMF742PL FIXED(15),       /* Length of path data section      01885000
*                                                                @Y1A*/ 01886000
*       3 SMF742PN FIXED(15),       /* Number of path data sections     01887000
*                                                                @Y1A*/ 01888000
*       3 SMF742MO FIXED(31),       /* Offset to Member data section    01889000
*                                                                @Y1A*/ 01890000
*       3 SMF742ML FIXED(15),       /* Length of member data section    01891000
*                                                                @Y1A*/ 01892000
*       3 SMF742MN FIXED(15);       /* Number of member data sections   01893000
*                                                                @Y1A*/ 01894000
*%LHDX743:;                        /* Subtype 3                  @C1M*/ 01895000
*%IF IFAR743 ^= 'YES' %THEN %GO TO LHDX744; /* Not subtype 3     @C1C*/ 01896000
*   @SPACE;                                                             01897000
*   /* Individual header extension for subtype 3  */                    01898000
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') %THEN %GO TO LHDX7431;     01899000
*                                   /* Not subtype 1 + 2         @C1C*/ 01900000
*   DECLARE                                                             01901000
*      1 SMF743XH DEFINED(SMF74HDX),/* Header extension for             01902000
*                                      subtype 3                 @B2A*/ 01903000
*%LHDX7431:;                        /* Subtype 3                 @B2A*/ 01904000
*      2 SMF743HX,                  /* Header extension for subtype 3   01905000
*                                                                @B2A*/ 01906000
*       3 SMF743PO FIXED(31),       /* Offset to data section    @B2A*/ 01907000
*       3 SMF743PL FIXED(15),       /* Length of data section    @B2A*/ 01908000
*       3 SMF743PN FIXED(15);       /* Number of data sections   @B2A*/ 01909000
*                                                                       01910000
*%LHDX744:;                        /* Subtype 4                  @C1A*/ 01911000
*%IF IFAR744 ^= 'YES' %THEN %GO TO LHDX745;  /* Not subtype 4    @E1C*/ 01912000
*   @SPACE;                                                             01913000
*   /* Individual header extension for subtype 4  */                    01914000
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES')       01915000
*%THEN %GO TO LHDX7441;             /* Not subtype 1 + 2 + 3     @C1A*/ 01916000
*   DECLARE                                                             01917000
*      1 SMF744XH DEFINED(SMF74HDX),/* Header extension for             01918000
*                                      subtype 4                 @C1A*/ 01919000
*%LHDX7441:;                        /* Subtype 4                 @C1A*/ 01920000
*      2 SMF744HX,                  /* Header extension for subtype 4   01921000
*                                                                @C1A*/ 01922000
*       3 SMF744FO FIXED(31),       /* Offset to local CF data          01923000
*                                      section                   @C1A*/ 01924000
*       3 SMF744FL FIXED(15),       /* Length of local CF data          01925000
*                                      section                   @C1A*/ 01926000
*       3 SMF744FN FIXED(15),       /* Number of local CF data          01927000
*                                      sections                  @C1A*/ 01928000
*       3 SMF744XO FIXED(31),       /* Offset to connectivity data      01929000
*                                      section                   @C1A*/ 01930000
*       3 SMF744XL FIXED(15),       /* Length of connectivity data      01931000
*                                      section                   @C1A*/ 01932000
*       3 SMF744XN FIXED(15),       /* Number of connectivity data      01933000
*                                      sections                  @C1A*/ 01934000
*       3 SMF744GO FIXED(31),       /* Offset to storage data           01935000
*                                      section                   @C1A*/ 01936000
*       3 SMF744GL FIXED(15),       /* Length of storage data           01937000
*                                      section                   @C1A*/ 01938000
*       3 SMF744GN FIXED(15),       /* Number of storage data           01939000
*                                      sections                  @C1A*/ 01940000
*       3 SMF744QO FIXED(31),       /* Offset to structure data         01941000
*                                      section                   @C1A*/ 01942000
*       3 SMF744QL FIXED(15),       /* Length of structure data         01943000
*                                      section                   @C1A*/ 01944000
*       3 SMF744QN FIXED(15),       /* Number of structure data         01945000
*                                      sections                  @C1A*/ 01946000
*       3 SMF744SO FIXED(31),       /* Offset to request data           01947000
*                                      section                   @C1A*/ 01948000
*       3 SMF744SL FIXED(15),       /* Length of request data           01949000
*                                      section                   @C1A*/ 01950000
*       3 SMF744SN FIXED(15),       /* Number of request data           01951000
*                                      sections                  @C1A*/ 01952000
*       3 SMF744PO FIXED(31),       /* Offset to processor data         01953000
*                                      section                   @C1A*/ 01954000
*       3 SMF744PL FIXED(15),       /* Length of processor data         01955000
*                                      section                   @C1A*/ 01956000
*       3 SMF744PN FIXED(15),       /* Number of processor data         01957000
*                                      sections                  @C1A*/ 01958000
*       3 SMF744CO FIXED(31),       /* Offset to Cache Data Section     01959000
*                                                            @WA20293*/ 01960000
*       3 SMF744CL FIXED(15),       /* Length of Cache Data Section     01961000
*                                                            @WA20293*/ 01962000
*       3 SMF744CN FIXED(15);       /* Number of Cache Data Section     01963000
*                                                            @WA20293*/ 01964000
*                                                                       01965000
*%LHDX745:;                        /* Subtype 5                  @E1A*/ 01966000
*%IF IFAR745 ^= 'YES' %THEN %GO TO LHDX746;  /* Not subtype 5    @H1A*/ 01967000
*   @SPACE;                                                             01968000
*   /* Individual header extension for subtype 5  */                    01969000
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES') &     01970000
*    (IFAR744 ^= 'YES')                                                 01971000
*%THEN %GO TO LHDX7451;             /* Not subtype 1 + 2 + 3 + 4 @E1A*/ 01972000
*   DECLARE                                                             01973000
*      1 SMF745XH DEFINED(SMF74HDX),/* Header extension for             01974000
*                                      subtype 5                 @E1A*/ 01975000
*%LHDX7451:;                        /* Subtype 5                 @E1A*/ 01976000
*      2 SMF745HX,                  /* Header extension for             01977000
*                                      subtype 5                 @E1A*/ 01978000
*       3 SMF745CO FIXED(31),       /* Offset to control section @E1A*/ 01979000
*       3 SMF745CL FIXED(15),       /* Length of control section @E1A*/ 01980000
*       3 SMF745CN FIXED(15),       /* Number of control sections       01981000
*                                                                @E1A*/ 01982000
*       3 SMF745DO FIXED(31),       /* Offset to CACHE device data      01983000
*                                      section                   @E1A*/ 01984000
*       3 SMF745DL FIXED(15),       /* Length of CACHE device data      01985000
*                                      section                   @E1A*/ 01986000
*       3 SMF745DN FIXED(15),       /* Number of CACHE device data      01987000
*                                      sections                  @E1A*/ 01988000
*       3 SMF745XO FIXED(31),       /* Offset to CACHE device data      01989000
*                                      section extension         @E1A*/ 01990000
*       3 SMF745XL FIXED(15),       /* Length of CACHE device data      01991000
*                                      section extension         @E1A*/ 01992000
*       3 SMF745XN FIXED(15),       /* Number of CACHE device data      01993000
*                                      section extensions        @E1A*/ 01994000
*       3 SMF745SO FIXED(31),       /* Offset to CACHE status data      01995000
*                                      section                   @E1A*/ 01996000
*       3 SMF745SL FIXED(15),       /* Length of CACHE status data      01997000
*                                      section                   @E1A*/ 01998000
*       3 SMF745SN FIXED(15),       /* Number of CACHE status data      01999000
*                                      sections                  @G2C*/ 02000000
*       3 SMF7451O FIXED(31),       /* Offset to RAID rank data         02001000
*                                      section               @WA37816*/ 02002000
*       3 SMF7451L FIXED(15),       /* Length of RAID rank data         02003000
*                                      section               @WA37816*/ 02004000
*       3 SMF7451N FIXED(15);       /* Number of RAID rank data         02005000
*                                      sections                  @I4C*/ 02006000
*%LHDX746:;                         /* Subtype 6                 @H1A*/ 02007000
*%IF IFAR746 ^= 'YES' %THEN %GO TO LHDX747; /* Not subtype 6     @I1C*/ 02008000
*   @SPACE;                                                             02009000
*   /* Individual header extension for subtype 6  */                    02010000
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES') &     02011000
*    (IFAR744 ^= 'YES') & (IFAR745 ^= 'YES')                            02012000
*%THEN %GO TO LHDX7461;             /* Not subtype 1 + 2 + 3 + 4 + 5    02013000
*                                                                @H1A*/ 02014000
*   DECLARE                                                             02015000
*      1 SMF746XH DEFINED(SMF74HDX),/* Header extension for             02016000
*                                      subtype 6                 @H1A*/ 02017000
*%LHDX7461:;                        /* Subtype 6                 @H1A*/ 02018000
*      2 SMF746HX,                  /* Header extension for             02019000
*                                      subtype 6                 @H1A*/ 02020000
*       3 SMF746DO FIXED(31),       /* Offset to global data section    02021000
*                                                                @H1A*/ 02022000
*       3 SMF746DL FIXED(15),       /* Length of global data section    02023000
*                                                                @H1A*/ 02024000
*       3 SMF746DN FIXED(15),       /* Number of global data sections   02025000
*                                                                @H1A*/ 02026000
*       3 SMF746BO FIXED(31),       /* Offset to global buffer section  02027000
*                                                                @H1A*/ 02028000
*       3 SMF746BL FIXED(15),       /* Length of global buffer section  02029000
*                                                                @H1A*/ 02030000
*       3 SMF746BN FIXED(15),       /* Number of global buffer          02031000
*                                      sections                  @H1A*/ 02032000
*       3 SMF746FO FIXED(31),       /* Offset to file system section    02033000
*                                                                @H1A*/ 02034000
*       3 SMF746FL FIXED(15),       /* Length of file system section    02035000
*                                                                @H1A*/ 02036000
*       3 SMF746FN FIXED(15);       /* Number of file system sections   02037000
*                                                                @H1A*/ 02038000
*%LHDX747:;                         /* Subtype 7                 @I1A*/ 02039000
*%IF IFAR747 ^= 'YES' %THEN %GO TO LEHDX74;  /* Not subtype 7    @I1A*/ 02040000
*   @SPACE;                                                             02041000
*   /* Individual header extension for subtype 7  */                    02042000
*%IF (IFAR741 ^= 'YES') & (IFAR742 ^= 'YES') & (IFAR743 ^= 'YES') &     02043000
*    (IFAR744 ^= 'YES') & (IFAR745 ^= 'YES') & (IFAR746 ^= 'YES')       02044000
*%THEN %GO TO LHDX7471;             /* Not subtype 1 + 2 + 3 + 4 + 5    02045000
*                                      + 6                       @I1A*/ 02046000
*   DECLARE                                                             02047000
*      1 SMF747XH DEFINED(SMF74HDX),/* Header extension for             02048000
*                                      subtype 7                 @I1A*/ 02049000
*%LHDX7471:;                        /* Subtype 7                 @I1A*/ 02050000
*      2 SMF747HX,                  /* Header extension for             02051000
*                                      subtype 7                 @I1A*/ 02052000
*       3 SMF747GO FIXED(31),       /* Offset to global data section    02053000
*                                                                @I1A*/ 02054000
*       3 SMF747GL FIXED(15),       /* Length of global data section    02055000
*                                                                @I1A*/ 02056000
*       3 SMF747GN FIXED(15),       /* Number of global data sections   02057000
*                                                                @I1A*/ 02058000
*       3 SMF747SO FIXED(31),       /* Offset to switch data section    02059000
*                                                                @I1A*/ 02060000
*       3 SMF747SL FIXED(15),       /* Length of switch data section    02061000
*                                                                @I1A*/ 02062000
*       3 SMF747SN FIXED(15),       /* Number of switch data sections   02063000
*                                                                @I1A*/ 02064000
*       3 SMF747PO FIXED(31),       /* Offset to port data section      02065000
*                                                                @I1A*/ 02066000
*       3 SMF747PL FIXED(15),       /* Length of port data section      02067000
*                                                                @I1A*/ 02068000
*       3 SMF747PN FIXED(15),       /* Number of port data sections     02069000
*                                                                @I1A*/ 02070000
*       3 SMF747CO FIXED(31),       /* Offset to connector section      02071000
*                                                                @I1A*/ 02072000
*       3 SMF747CL FIXED(15),       /* Length of connector section      02073000
*                                                                @I1A*/ 02074000
*       3 SMF747CN FIXED(15);       /* Number of connector sections     02075000
*                                                                @I1A*/ 02076000
*%LEHDX74:;                         /* End of header extension   @Y1A*/ 02077000
*   @SPACE;                                                             02078000
*   /* COMMON RMF PRODUCT SECTION */                                    02079000
*   @SPACE;                                                             02080000
*?ERBPRO TYPE(74) ATTRIBUT(BASED(ADDR(SMF74HDR)+SMF74PRS));             02081000
*%IF IFAR741 = 'YES' %THEN %GO TO LDAT741; /* Subtype 1          @Y1A*/ 02082000
*%IF IFAR742 = 'YES' %THEN %GO TO LDAT742; /* Subtype 2          @Y1A*/ 02083000
*%IF IFAR743 = 'YES' %THEN %GO TO LDAT743; /* Subtype 3          @B2A*/ 02084000
*%IF IFAR744 = 'YES' %THEN %GO TO LDAT744; /* Subtype 4          @C1A*/ 02085000
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/ 02086000
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/ 02087000
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/ 02088000
*%LDAT741:;                         /* Subtype 1                 @Y1A*/ 02089000
*   @SPACE(2);                                                          02090000
*/********************************************************************/ 02091000
*/*                                                                  */ 02092000
*/*            Relocate blocks for sub type 1                        */ 02093000
*/*            Monitor I device data.                                */ 02094000
*/*                                                              @Y1A*/ 02095000
*/********************************************************************/ 02096000
*    @SPACE;                                                            02097000
*/****  Subtype 1, Monitor I Device data control section ******* @Y1C*/ 02098000
*    @SPACE;                                                            02099000
*   DECLARE                                                             02100000
*     1 SMF74A BASED(ADDR(SMF74HDR)+SMF74DCS) BDY(WORD),     /*  @U1C*/ 02101000
*       3 SMF74NXT FIXED(15),     /* NUMBER OF MEASUREMENTS IN FOLLOW.  02102000
*                                    RECORDS FOR THIS CLASS          */ 02103000
*       3 SMF74TOT FIXED(15),     /* TOTAL NUMBER OF MEASUREMENTS IN    02104000
*                                    ALL RECORDS FOR THIS CLASS      */ 02105000
*       3 SMF74GEN FIXED(15),     /* TOTAL NUMBER OF DEVICES SYSGENED   02106000
*                                    FOR ALL CLASSES                 */ 02107000
*       3 SMF74SUB CHAR(2),       /* UCB DEV TYPE CODE IN RIGHT BYTE */ 02108000
*       3 SMF74DFL BIT(16),       /* Device class flags          @U1A*/ 02109000
*         5 SMF74DCF BIT(8),      /* Flags for DASD class        @U1A*/ 02110000
*           7 SMF74NRF BIT(1),    /* Flag to cause two report areas     02111000
*                                                                @U1A*/ 02112000
*           7 SMF74SGF BIT(1),    /* Flag to cause sort by SG    @U1A*/ 02113000
*           7 *        BIT(6),    /* Unused                      @U1A*/ 02114000
*         5 SMF74DMS BIT(8),      /* Message flags. DASD class   @U1A*/ 02115000
*           7 SMF74429 BIT(1),    /* Message ERB429I             @U1A*/ 02116000
*           7 SMF74SME BIT(1),    /* SMS Interface Error         @U1A*/ 02117000
*           7 *        BIT(6),    /* unused                      @U1A*/ 02118000
*       3 *        CHAR(2),       /* unused                      @U1A*/ 02119000
*       3 SMF74CDF,               /* Device class dependend fields      02120000
*                                                                @U1A*/ 02121000
*         5 SMF74S15 FIXED(31),   /* Reg 15 after SMS interface call    02122000
*                                     (SSI RC)                   @U1A*/ 02123000
*         5 SMF74SRC FIXED(31),   /* Return code from SMS interface     02124000
*                                     (SSOB RC)                  @U1A*/ 02125000
*         5 SMF74SRS FIXED(31),   /* Reason code from SMS interface     02126000
*                                     (SSOB RS)                  @U1A*/ 02127000
*       3 SMF74TSR   FIXED(16),   /* Number of small records written    02128000
*                                    during interval             @A1A*/ 02129000
*       3 SMF74CFL   BIT(8),      /* Configuration Change Flags  @A1A*/ 02130000
*         5 SMF74DCA BIT(1),      /* Configuration Changed this         02131000
*                                    interval.                   @A1A*/ 02132000
*         5 SMF74IAC BIT(1),      /* Configuration Changed since        02133000
*                                    last IPL                    @A1A*/ 02134000
*         5 SMF74IOD BIT(1),      /* System IPLed via IODF       @A1A*/ 02135000
*         5 SMF74ICV BIT(1),      /* I/O Configuration Token is         02136000
*                                    valid.                      @A1A*/ 02137000
*         5 *        BIT(1),      /* reserved                    @A1A*/ 02138000
*       3 *          BIT(24),     /* reserved                    @A1A*/ 02139000
*       3 SMF74TNM   CHAR(44),    /* IODF Name                   @A1A*/ 02140000
*       3 SMF74TSF CHAR(2),        /* Suffix of IODF Name       @A1A*/  02141000
*       3 *        CHAR(2),        /* Reserved                  @A1A*/  02142000
*       3 SMF74TOK CHAR(16),       /* Configuration token       @A1A*/  02143000
*         5 SMF74TDT CHAR(8),      /* IODF creation date mm/dd/yy       02144000
*                                                           @YA64585*/  02145000
*         5 SMF74TTM CHAR(8),      /* IODF creation time hh.mm.ss       02146000
*                                                           @YA64585*/  02147000
*       3 *        CHAR(2),       /* Reserved                    @B1A*/ 02148000
*       3 SMF74MCT FIXED(32),     /* Maximum number of allocated        02149000
*                                    tape devices                @B1A*/ 02150000
*       3 SMF74TDY CHAR(10),      /* IODF creation date mm/dd/yyyy      02151000
*                                                            @WA19913*/ 02152000
*       3 *        CHAR(2);       /* Reserved                @WA19913*/ 02153000
*/*********  Subtype 1 Device Data Section  ******************** @Y1C*/ 02154000
*   @SPACE;                                                             02155000
*   DECLARE                                                             02156000
*     1 SMF74B                                                          02157000
*     %IF SMFARRAY ^= 'YES' %THEN                                       02158000
*     %GOTO SKS74ARY;                                                   02159000
*              (*)                                                      02160000
*     %SKS74ARY:;                                                       02161000
*                  BASED(ADDR(SMF74HDR)+SMF74DDS),                      02162000
*       3 SMF74NUM CHAR(2),       /* DEVICE NUMBER                   */ 02163000
*       3 SMF74LCU CHAR(2),       /* LOGICAL CONTROL UNIT NUMBER     */ 02164000
*       3 SMF74RV3 CHAR(1),       /* internally used             @P1C*/ 02165000
*       3 SMF74CNF BIT(8),        /* DEVICE FLAGS                    */ 02166000
*         5 SMF74QUL BIT(1),      /* =1 IF QUEUE LENGTH INVALID      */ 02167000
*         5 SMF74LCD BIT(1),      /* =1 IF NO LCU DATA               */ 02168000
*         5 SMF74CMB BIT(1),      /* =1 IF CMB DATA INVALID          */ 02169000
*         5 SMF74DEL BIT(1),      /* =1 Device has been deleted  @A1A*/ 02170000
*         5 SMF74PAR BIT(1),      /* =1 ONLY PARTIAL STATISTICS         02171000
*                                    AVAILABLE                       */ 02172000
*         5 SMF74MXB BIT(1),      /* =1 IF BASE EXPOSURE OF A           02173000
*                                    MULTIPLE EXPOSURE DEVICE        */ 02174000
*         5 SMF74VAC BIT(1),      /* DATA INVALID, VARIED ON OR OFF,    02175000
*                                    OR DYNAMIC RECONFIGURATION      */ 02176000
*         5 SMF74STA BIT(1),      /* =1 FOR ONLINE AT END OF INTERVAL*/ 02177000
*       3 SMF74SER CHAR(6),       /* VOLUME SERIAL NUMBER OF            02178000
*                                    MOUNTED VOLUME                  */ 02179000
*       3 SMF74TYP CHAR(4),       /* UNIT TYPE FROM UCBTYP FIELD     */ 02180000
*       3 SMF74NUX FIXED(32),     /* NUMBER OF EXPOSURES, IF MULTIPLE   02181000
*                                    EXPOSURE DEVICE                 */ 02182000
*      2 SMF74DTA,                /* BEGIN OF AREA TO BE ZEROED, IF     02183000
*                                    DEVICE HAS BEEN VARIED, OR IS      02184000
*                                    OFFLINE                         */ 02185000
*       3 SMF74HWM,               /* BEGIN OF AREA TO BE ZEROED, IF     02186000
*                                    HARDWARE (CMB) DATA ARE INVALID */ 02187000
*         5 SMF74SSC FIXED(32),   /* START SUBCHANNEL (SSCH) COUNT   */ 02188000
*         5 SMF74MEC FIXED(32),   /* MEASUREMENT EVENT COUNT (NUMBER    02189000
*                                    OF SSCH FOR WHICH CONNECT,         02190000
*                                    PENDING, AND ACTIVE TIME WERE      02191000
*                                    STORED                          */ 02192000
*         5 SMF74CNN FIXED(32),   /* DEVICE CONNECT TIME             */ 02193000
*         5 SMF74PEN FIXED(32),   /* DEVICE PENDING TIME             */ 02194000
*         5 SMF74ATV FIXED(32),   /* DEVICE ACTIVE TIME              */ 02195000
*         5 SMF74DIS FIXED(32),   /* DEVICE DISCONNECT TIME          */ 02196000
*       3 SMF74QUE FIXED(32),     /* NUMBER OF REQUESTS QUEUED IN       02197000
*                                    IOS FOR THIS DEVICE             */ 02198000
*       3 SMF74UTL FIXED(32),     /* NUMBER OF SAMPLES WHEN THE         02199000
*                                    DEVICE WAS RESERVED, BUT AN SSCH   02200000
*                                    HAD NOT BEEN ISSUED             */ 02201000
*       3 SMF74RSV FIXED(32),     /* NUMBER OF SAMPLES DURING THE       02202000
*                                    INTERVAL THAT INDICATED THAT THE   02203000
*                                    DEVICE WAS RESERVED             */ 02204000
*       3 SMF74DSO FIXED(32),     /* Not longer needed, new field       02205000
*                                    is SMF74NDA, variable name         02206000
*                                    is needed for conversion    @U2C*/ 02207000
*       3 SMF74ALC FIXED(32),     /* NUMBER OF SAMPLES DURING THE       02208000
*                                    INTERVAL THAT INDICATED THAT THE   02209000
*                                    DEVICE WAS ALLOCATED            */ 02210000
*       3 SMF74MTP FIXED(32),     /* NUMBER OF SAMPLES DURING THE       02211000
*                                    INTERVAL THAT INDICATED A MOUNT    02212000
*                                    PENDING CONDITION               */ 02213000
*       3 SMF74NRD FIXED(32),     /* NUMBER OF SAMPLES DURING THE       02214000
*                                    INTERVAL THAT INDICATED THAT THE   02215000
*                                    DEVICE WAS NOT READY            */ 02216000
*       3 SMF74COF FIXED(16),     /* NUMBER OF REQUESTS THAT HAD CONNECT02217000
*                                    TIME OVERFLOW          @ZA63802 */ 02218000
*       3 SMF74ICT FIXED(16),     /* invalid sample count        @P1C*/ 02219000
*       3 SMF74DVB FIXED(32),     /* device busy delay time      @P1A*/ 02220000
*       3 SMF74CUB FIXED(32),     /* control unit busy delay time@P1A*/ 02221000
*       3 SMF74CLF BIT(8),        /* Flags for each device class @U1A*/ 02222000
*         5 SMF74RCF BIT(3),      /* DASD Report Control Flags   @U1A*/ 02223000
*           7 SMF74RNR BIT(1),    /* Flag number option active   @U1A*/ 02224000
*           7 SMF74RSG BIT(1),    /* Flag SG option active       @U1A*/ 02225000
*           7 SMF74RCS BIT(1),    /* Flag for SG name changed during    02226000
*                                    the interval                @U1A*/ 02227000
*         5 SMF74TCF BIT(3),      /* Tape Report Control Flags   @B1A*/ 02228000
*           7 SMF74MTS BIT(1),    /* Open mount at interval             02229000
*                                    start                       @B1A*/ 02230000
*           7 SMF74MTE BIT(1),    /* Open mount at interval end  @B1A*/ 02231000
*           7 *        BIT(1),    /* unused                      @B1C*/ 02232000
*         5 SMF74CTC   BIT(2),    /* CTC Control Flags       @WA00541*/ 02233000
*           7 SMF74CLW BIT(1),    /* CTC with special protocol          02234000
*                                                            @WA00541*/ 02235000
*           7 *        BIT(1),    /*                         @WA00541*/ 02236000
*       3 *        CHAR(3),       /* unused                      @U1A*/ 02237000
*       3 SMF74SGN CHAR(8),       /* Storage Group Name          @U1A*/ 02238000
*       3 SMF74NDA FIXED(32),     /* Total number of allocations in     02239000
*                                    effect for the device       @Y2C*/ 02240000
*      2 SMF74DA,                 /* Data area, not cleared      @Y2A*/ 02241000
*       3 SMF74DEV CHAR(8),       /* Device name                 @Y2A*/ 02242000
*       3 SMF74CU  CHAR(8),       /* Control unit name           @Y2A*/ 02243000
*      2 SMF74DPB FIXED(32),      /* ES connection director port        02244000
*                                    busy delay time             @Z1A*/ 02245000
*      2 SMF74CNX  BIT(8),        /* Device Flag Extension              02246000
*                                    see also SMF74CNF above     @A1C*/ 02247000
*       3 SMF74DYC BIT(1),        /* Device Dynamically Changed  @A1A*/ 02248000
*       3 SMF74DDT BIT(1),        /* =1 If device disconnect time is    02249000
*                                    invalid                 @WA15094*/ 02250000
*       3 SMF74PAV BIT(1),        /* =1 If base exposure of a           02251000
*                                    Parallel Access Volume      @G3A*/ 02252000
*       3 SMF74NXC BIT(1),        /* =1 If number of alias exposures    02253000
*                                    changed                     @G3A*/ 02254000
*       3 SMF74NTF BIT(1),        /* Timing facility not active  @I2A*/ 02255000
*       3 *        BIT(3),        /* Reserved                    @I2C*/ 02256000
*      2 *         CHAR(1),       /* Reserved                    @B1C*/ 02257000
*      2 SMF74MTC FIXED(16),      /* Number of mount conditions  @B1A*/ 02258000
*                                                                       02259000
*      2 SMF74DCI,                /* Shared Device Report               02260000
*                                    Configuration Information   @C2A*/ 02261000
*        4 SMF74DTS FIXED(8),     /* indentify source of Token   @C2A*/ 02262000
*          6 SMF74SRD   BIT(1),   /* if set: self desc. device   @C2A*/ 02263000
*          6 SMF74SND   BIT(1),   /* if set: no self desc. device       02264000
*                                    4-byte device number stored @C2A*/ 02265000
*          6 SMF74SCN   BIT(1),   /* reserved for RMF internal use      02266000
*                                    only                        @C2A*/ 02267000
*          6 SMF74SHV   BIT(1),   /* ON = SMF74SHR indication is        02268000
*                                    valid                   @WA07295*/ 02269000
*          6 SMF74SHR   BIT(1),   /* ON = device is shared/assigned     02270000
*                                    to multiple systems     @WA07295*/ 02271000
*          6 *          BIT(3),   /* not used                    @C2A*/ 02272000
*        4 SMF74DCT,              /* Configuration Token for self-      02273000
*                                    describing devices or       @C2A*/ 02274000
*          6 SMF74NDN CHAR(4),    /* 4-byte device number in EBCDIC     02275000
*                                    format, if SMF74SND = 1     @C2A*/ 02276000
*          6 SMF74NBL CHAR(24),   /* blanks, if SMF74SND = 1     @C2A*/ 02277000
*      2 *         CHAR(3),       /* align word boundary         @G3C*/ 02278000
*      2 *         CHAR(4),       /* Reserved                @WA31701*/ 02279000
*      2 SMF74PCT  FIXED(32);     /* Number of unsuccessful PAV         02280000
*                                    samples                 @WA31701*/ 02281000
*%IF IFAR742 = 'YES' %THEN %GO TO LDAT742; /* Subtype 2          @Y1A*/ 02282000
*%IF IFAR743 = 'YES' %THEN %GO TO LDAT743; /* Subtype 3          @B2A*/ 02283000
*%IF IFAR744 = 'YES' %THEN %GO TO LDAT744; /* Subtype 4          @C1A*/ 02284000
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/ 02285000
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/ 02286000
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/ 02287000
*%GO TO LEND74;                     /* End of SMF record         @Y1A*/ 02288000
*%LDAT742:;                         /* Subtype 2                 @Y1A*/ 02289000
*   @SPACE(2);                                                          02290000
*/********************************************************************/ 02291000
*/*                                                                  */ 02292000
*/*            Relocate blocks for sub type 2 - Monitor III          */ 02293000
*/*            XCF data. (Cross-System Coupling Facility)            */ 02294000
*/*                                                                  */ 02295000
*/********************************************************************/ 02296000
*    @SPACE;                                                            02297000
*/****  Subtype 2, control data section ************************ @Y1A*/ 02298000
*    @SPACE;                                                            02299000
*   DECLARE                                                             02300000
*     1 R742CNTL BASED(ADDR(SMF74HDR)+SMF742CO) BDY(WORD),   /*  @Y1A*/ 02301000
*       3 R742TSR  FIXED(16),       /* Total number of small records    02302000
*                                                                @Y1A*/ 02303000
*       3 *        CHAR(2),         /* Reserved for future use   @Y1A*/ 02304000
*       3 R742STOT FIXED(32),       /* Total number of system           02305000
*                                      data sections in large           02306000
*                                      SMF record.               @Y1A*/ 02307000
*       3 R742SNXT FIXED(32),       /* Number of system                 02308000
*                                      data sections in                 02309000
*                                      following small records   @Y1A*/ 02310000
*       3 R742PTOT FIXED(32),       /* Total number of path             02311000
*                                      data sections in large           02312000
*                                      SMF record.               @Y1A*/ 02313000
*       3 R742PNXT FIXED(32),       /* Number of path                   02314000
*                                      data sections in                 02315000
*                                      following small records   @Y1A*/ 02316000
*       3 R742MTOT FIXED(32),       /* Total number of member           02317000
*                                      data sections in large           02318000
*                                      SMF record.               @Y1A*/ 02319000
*       3 R742MNXT FIXED(32);       /* Number of member data sections   02320000
*                                      in following records      @Y1A*/ 02321000
*    @SPACE(2);                                                         02322000
*/*********  Subtype 2, System Data Section  ******************* @Y1A*/ 02323000
*    @SPACE;                                                            02324000
*   DECLARE                                                             02325000
*     1 R742SYS    BASED(ADDR(SMF74HDR)+SMF742SO),                      02326000
*       3 R742SNME CHAR(8),         /* System name               @Y1A*/ 02327000
*       3 R742SSTF BIT(8),          /* Status flags              @Y1A*/ 02328000
*         5 R742SACT BIT(1),        /* System became active during      02329000
*                                      this interval             @Y1A*/ 02330000
*         5 R742SIAC BIT(1),        /* System became inactive during    02331000
*                                      this interval             @Y1A*/ 02332000
*         5 R742SRES BIT(1),        /* Counts reset by XCF during       02333000
*                                      this interval             @Y1A*/ 02334000
*         5 R742SPAR BIT(1),        /* Partially not active during RMF  02335000
*                                      post processor interval.  @Y1A*/ 02336000
*         5 *        BIT(4),        /* Unused                    @Y1A*/ 02337000
*       3 R742SDIR  BIT(8),         /* Direction                 @Y1A*/ 02338000
*         5 R742SIN  BIT(1),        /* Inbound                   @Y1A*/ 02339000
*         5 R742SOUT BIT(1),        /* Outbound                  @Y1A*/ 02340000
*         5 R742SLCL BIT(1),        /* Local                     @Y1A*/ 02341000
*         5 *        BIT(5),        /* Reserved                  @Y1A*/ 02342000
*       3 *        CHAR(2),         /* Unused                    @Y1A*/ 02343000
*       3 R742SPTH FIXED(32),       /* Current number of paths in       02344000
*                                      service.                         02345000
*                                      Zero for local entry. If         02346000
*                                      outbound entry, count is for     02347000
*                                      indicated transport class @Y1A*/ 02348000
*       3 R742SBSY FIXED(32),       /* Number of no buffer conditions.  02349000
*                                      For local or outbound entry,     02350000
*                                      count is for indicated           02351000
*                                      transport class.          @Y1A*/ 02352000
*       3 R742SNOP FIXED(32),       /* Number of no path conditions     02353000
*                                      Zero for local entry. For        02354000
*                                      outbound entry, count is for     02355000
*                                      indicated transport class @Y1A*/ 02356000
*       3 R742SMXB FIXED(32),       /* Maximum 1K blocks of message     02357000
*                                      buffer space. For local or       02358000
*                                      outbound entry, count is for     02359000
*                                      indicated transport class @Y1A*/ 02360000
*       3 R742SBIG FIXED(32),       /* Number of message too big        02361000
*                                      conditions. Zero for inbound     02362000
*                                      entry.                    @Y1A*/ 02363000
*       3 R742SFIT FIXED(32),       /* Number of messages that fits     02364000
*                                      in buffer. Zero for inbound      02365000
*                                      entry.                    @Y1A*/ 02366000
*       3 R742SSML FIXED(32),       /* Number of messages too small     02367000
*                                      conditions. Zero for inbound     02368000
*                                      entry.                    @Y1A*/ 02369000
*       3 R742SOVR FIXED(32),       /* Number of messages for which     02370000
*                                      signalling service was           02371000
*                                      optimized. Zero for inbound      02372000
*                                      entry.                    @Y1A*/ 02373000
*       3 R742STCL FIXED(32),       /* Message length for transport     02374000
*                                      class. Zero for inbound          02375000
*                                      entry.                    @Y1A*/ 02376000
*       3 R742STCN CHAR(8);         /* Transport class name. Blanks     02377000
*                                      for inbound entry.        @Y1A*/ 02378000
*    @SPACE;                                                            02379000
*/*********  Subtype 2, Path Data Section  ********************* @Y1A*/ 02380000
*    @SPACE;                                                            02381000
*   DECLARE                                                             02382000
*     1 R742PTH    BASED(ADDR(SMF74HDR)+SMF742PO),                      02383000
*       3 R742PNME CHAR(8),         /* System name               @Y1A*/ 02384000
*       3 R742PDEV CHAR(4),         /* Device number             @Y1A*/ 02385000
*       3 R742PSTF BIT(8),          /* Status flags              @Y1A*/ 02386000
*         5 R742PACT BIT(1),        /* Path became active during        02387000
*                                      this interval             @Y1A*/ 02388000
*         5 R742PIAC BIT(1),        /* Path became inactive during      02389000
*                                      this interval             @Y1A*/ 02390000
*         5 R742PRES BIT(1),        /* Counts reset by XCF during       02391000
*                                      this interval             @Y1A*/ 02392000
*         5 R742PPAR BIT(1),        /* Partially not active during RMF  02393000
*                                      post processor interval.  @Y1A*/ 02394000
*         5 *        BIT(4),        /* Unused                    @Y1A*/ 02395000
*       3 R742PDIR BIT(8),          /* Direction path            @Y1A*/ 02396000
*         5 R742PIN  BIT(1),        /* Inbound path              @Y1A*/ 02397000
*         5 R742POUT BIT(1),        /* Outbound path             @Y1A*/ 02398000
*         5 *        BIT(6),        /* Reserved                  @Y1A*/ 02399000
*       3 R742PTYP FIXED(8),        /* Path type indicator: '01'x for   02400000
*                                      CTC, '03'x for list structure    02401000
*                                                                @C1A*/ 02402000
*       3 *        CHAR(1),         /* Unused                    @Y1A*/ 02403000
*       3 R742PONA CHAR(8),         /* Name of system on other end if   02404000
*                                      known, otherwise blanks.  @Y1A*/ 02405000
*       3 R742PODV CHAR(4),         /* Device number on other end if    02406000
*                                      known, otherwise blanks.  @Y1A*/ 02407000
*       3 R742PSTA BIT(8),          /* Path status               @Y1A*/ 02408000
*         5 R742PST  BIT(1),        /* Starting                  @Y1A*/ 02409000
*         5 R742PRS  BIT(1),        /* Restarting                @Y1A*/ 02410000
*         5 R742PWK  BIT(1),        /* Working                   @Y1A*/ 02411000
*         5 R742PSP  BIT(1),        /* Stopping                  @Y1A*/ 02412000
*         5 R742PLK  BIT(1),        /* Waiting for completion of        02413000
*                                      communication link.       @Y1A*/ 02414000
*         5 R742PNP  BIT(1),        /* Not operational. Path defined to 02415000
*                                      XCF but not usable untilhardware 02416000
*                                      and/or definition problems are   02417000
*                                      resolved              @WA22735*/ 02418000
*         5 R742PSF  BIT(1),        /* Stop failed           @WA22735*/ 02419000
*         5 R742PRB  BIT(1),        /* Rebuilding            @WA22735*/ 02420000
*       3 *        CHAR(3),         /* Unused                    @Y1A*/ 02421000
*       3 R742PRET FIXED(32),       /* Path retry limit          @Y1A*/ 02422000
*       3 R742PRST FIXED(32),       /* Number of restarts        @Y1A*/ 02423000
*       3 R742PMXM FIXED(32),       /* Maximum number of 1K blocks      02424000
*                                      message buffer space.     @Y1A*/ 02425000
*       3 R742PSIG FIXED(32),       /* Number of outbound (inbound)     02426000
*                                      signals sent (received) over     02427000
*                                      path.                     @Y1A*/ 02428000
*       3 R742PQLN FIXED(32),       /* Number of outbound signals       02429000
*                                      pending transfer on path  @Y1A*/ 02430000
*       3 R742PIBR FIXED(32),       /* Number of inbound signals        02431000
*                                      refused due to maximum           02432000
*                                      message limit.            @Y1A*/ 02433000
*       3 R742PSUS FIXED(32),       /* Number of outbound signals       02434000
*                                      satisfied by suspended path.     02435000
*                                                                @Y1A*/ 02436000
*       3 R742PAPP FIXED(32),       /* Number of outbound signal        02437000
*                                      requests satisfied by this       02438000
*                                      path while active.        @Y1A*/ 02439000
*       3 R742PTCN CHAR(8),         /* Transport class name. Blanks     02440000
*                                      for an inbound path.      @C1C*/ 02441000
*       3 R742PSTR CHAR(16),        /* Name of XES list structure       02442000
*                                      being used as a path,            02443000
*                                      blank for CTC's       @WA41317*/ 02444000
*       3 R742PIOT FIXED(32);       /* For inbound paths:               02445000
*                                      Average I/O transfer time for    02446000
*                                      the most recently received       02447000
*                                      signals.                         02448000
*                                      Units: Micro Seconds.            02449000
*                                      Zero if not available.           02450000
*                                      X'FFFFFFFF' if overflow (more    02451000
*                                      than 35 minutes)      @WA41317*/ 02452000
*    @SPACE;                                                            02453000
*/*********  Subtype 2, Member Data Section  ******************* @Y1A*/ 02454000
*    @SPACE;                                                            02455000
*   DECLARE                                                             02456000
*     1 R742MBR    BASED(ADDR(SMF74HDR)+SMF742MO),                      02457000
*       3 R742MSYS CHAR(8),         /* System name               @Y1A*/ 02458000
*       3 R742MGRP CHAR(8),         /* Group name                @Y1A*/ 02459000
*       3 R742MMEM CHAR(16),        /* Member name               @Y1A*/ 02460000
*       3 R742MSTF BIT(8),          /* Status flags              @Y1A*/ 02461000
*         5 R742MACT BIT(1),        /* Member became active during      02462000
*                                      this interval             @Y1A*/ 02463000
*         5 R742MIAC BIT(1),        /* Member became inactive during    02464000
*                                      this interval             @Y1A*/ 02465000
*         5 R742MRES BIT(1),        /* Counts reset by XCF during       02466000
*                                      this interval             @Y1A*/ 02467000
*         5 R742MPAR BIT(1),        /* Partially not active during RMF  02468000
*                                      post processor interval.  @Y1A*/ 02469000
*         5 *        BIT(4),        /* Unused                    @Y1A*/ 02470000
*       3 *        CHAR(3),         /* Unused                    @Y1A*/ 02471000
*       3 R742MSNT FIXED(32),       /* Number of signals sent by        02472000
*                                      member.                   @Y1A*/ 02473000
*       3 R742MRCV FIXED(32);       /* Number of signals received by    02474000
*                                      member.                   @Y1A*/ 02475000
*%IF IFAR743 = 'YES' %THEN %GO TO LDAT743; /* Subtype 3          @B2A*/ 02476000
*%IF IFAR744 = 'YES' %THEN %GO TO LDAT744; /* Subtype 4          @C1A*/ 02477000
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/ 02478000
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/ 02479000
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/ 02480000
*%GO TO LEND74;                     /* End of SMF record         @B2A*/ 02481000
*%LDAT743:;                         /* Subtype 3                 @B2A*/ 02482000
*   @SPACE(2);                                                          02483000
*/********************************************************************/ 02484000
*/*                                                                  */ 02485000
*/*            Relocate blocks for sub type 3 - Monitor III          */ 02486000
*/*            OMVS data. (OPEN/MVS Kernel Activity Support)         */ 02487000
*/*                                                              @B2A*/ 02488000
*/********************************************************************/ 02489000
*    @SPACE;                                                            02490000
*/****  Subtype 3, data section ** ***************************** @B2A*/ 02491000
*    @SPACE;                                                            02492000
*   DECLARE                                                             02493000
*     1 R743DATA BASED(ADDR(SMF74HDR)+SMF743PO) BDY(WORD),   /*  @B2A*/ 02494000
*       3 R743CYCU FIXED(31),       /* Number of cycle units elapsed    02495000
*                                      between first and last           02496000
*                                      measured sample           @B2A*/ 02497000
*       3 R743CYCT FIXED(31),       /* Cycle time value obtained        02498000
*                                      from Monitor III options  @B2A*/ 02499000
*       3 R743FLG    BIT(32),       /* Processing flags          @B2A*/ 02500000
*         5 R743TER  BIT(1),        /* OMVS terminated or reinstated    02501000
*                                      this intervall when set   @B2A*/ 02502000
*         5 R743CHPR BIT(1),        /* Max. number of processes changed 02503000
*                                      during reporting interval        02504000
*                                      when set                  @B2A*/ 02505000
*         5 R743CHUS BIT(1),        /* Max. number of users changed     02506000
*                                      during reporting interval when   02507000
*                                      set                       @B2A*/ 02508000
*         5 R743CHPU BIT(1),        /* Max. number of processes per     02509000
*                                      user changed during reporting    02510000
*                                      intervall when set        @B2A*/ 02511000
*         5 R743CHMS BIT(1),        /* Max. number of message queue     02512000
*                                      ids changed during reporting     02513000
*                                      interval when set     @WA10257*/ 02514000
*         5 R743CHSE BIT(1),        /* Max. number of semaphore ids     02515000
*                                      changed during reporting         02516000
*                                      interval when set     @WA10257*/ 02517000
*         5 R743CHSH BIT(1),        /* Max. number of shared memory     02518000
*                                      ids changed during reporting     02519000
*                                      interval when set     @WA10257*/ 02520000
*         5 R743CHSP BIT(1),        /* Max. number of shared memory     02521000
*                                      pages changed during reporting   02522000
*                                      interval when set     @WA10257*/ 02523000
*         5 R743CHMA BIT(1),        /* Max. number of memory map st     02524000
*                                      pages changed during reporting   02525000
*                                      interval when set     @WA10257*/ 02526000
*         5 R743CHPA BIT(1),        /* Max. number of shared storage    02527000
*                                      pages changed during reporting   02528000
*                                      interval when set     @WA10257*/ 02529000
*         5 R743CHLR BIT(1),        /* Max. size of shared library      02530000
*                                      region changed during            02531000
*                                      reporting interval when set      02532000
*                                                                @I5A*/ 02533000
*         5 R743CQSG BIT(1),        /* Max. number of queued            02534000
*                                      signals per process changed      02535000
*                                      during reporting interval        02536000
*                                      when set                  @I5A*/ 02537000
*         5 *        BIT(20),       /* Reserved                  @I5C*/ 02538000
*       3 R743SYSC FIXED(32),       /* Total number of OMVS system      02539000
*                                      calls invoked during the         02540000
*                                      interval                  @B2A*/ 02541000
*       3 R743SCMN FIXED(31),       /* Min. number of OMVS system calls 02542000
*                                      invoked during one cycle  @B2A*/ 02543000
*       3 R743SCMX FIXED(31),       /* Max. number of OMVS system calls 02544000
*                                      invoked during one cycle  @B2A*/ 02545000
*       3 R743CPU  FIXED(32),       /* Total CPU time spent processing  02546000
*                                      syscalls in OMVS during the      02547000
*                                      interval                  @B2A*/ 02548000
*       3 R743CTMN FIXED(31),       /* Min. CPU time spent processing   02549000
*                                      syscalls in OMVS during one      02550000
*                                      cycle                     @B2A*/ 02551000
*       3 R743CTMX FIXED(31),       /* Max. CPU time spent processing   02552000
*                                      syscalls in OMVS during one      02553000
*                                      cycle                     @B2A*/ 02554000
*       3 R743OPR  FIXED(32),       /* Count of times Fork/Dub failed   02555000
*                                      because max. number of processes 02556000
*                                      was exceeded during one          02557000
*                                      cycle                     @B2A*/ 02558000
*       3 R743OPMN FIXED(31),       /* Min. mumber of times Fork/Dub    02559000
*                                      failed because max. number of    02560000
*                                      processes was exceeded during    02561000
*                                      one cycle                 @B2A*/ 02562000
*       3 R743OPMX FIXED(31),       /* Max. mumber of times Fork/Dub    02563000
*                                      failed because max. number of    02564000
*                                      processes was exceeded during    02565000
*                                      one cycle                 @B2A*/ 02566000
*       3 R743OUS  FIXED(32),       /* Count of times Fork/Dub failed   02567000
*                                      because max. number of users was 02568000
*                                      exceeded during one cycle @B2A*/ 02569000
*       3 R743OUMN FIXED(31),       /* Min. mumber of times Fork/Dub    02570000
*                                      failed because max. number of    02571000
*                                      users was exceeded during        02572000
*                                      one cycle                 @B2A*/ 02573000
*       3 R743OUMX FIXED(31),       /* Max. mumber of times Fork/Dub    02574000
*                                      failed because max. number of    02575000
*                                      users was exceeded during        02576000
*                                      one cycle                 @B2A*/ 02577000
*       3 R743OPRU FIXED(32),       /* Count of times Fork/Dub failed   02578000
*                                      because max. number of processes 02579000
*                                      per user was exceeded during     02580000
*                                      one cycle                 @B2A*/ 02581000
*       3 R743ORMN FIXED(31),       /* Min. number of times Fork/Dub    02582000
*                                      failed because max. number of    02583000
*                                      processes per user was exceeded  02584000
*                                      during one cycle          @B2A*/ 02585000
*       3 R743ORMX FIXED(31),       /* Max. number of times Fork/Dub    02586000
*                                      failed because max. number of    02587000
*                                      processes per user was exceeded  02588000
*                                      during one cycle          @B2A*/ 02589000
*       3 R743MAXP FIXED(15),       /* Max. number of OMVS processes    02590000
*                                      (const.)                  @B2A*/ 02591000
*       3 R743MAXU FIXED(15),       /* Max. number of OMVS users        02592000
*                                      (const.)                  @B2A*/ 02593000
*       3 R743MXPU FIXED(15),       /* Max. number of OMVS processes    02594000
*                                      per user (const.)         @B2A*/ 02595000
*       3 *        FIXED(15),       /* Unused                    @B2A*/ 02596000
*       3 R743CURP FIXED(32),       /* Accumulated number of OMVS       02597490
*                                      processes during the interval    02597980
*                                                            @WA46170*/ 02598470
*       3 R743CPMN FIXED(15),       /* Min. number of OMVS processes    02599000
*                                      during one cycle          @B2A*/ 02600000
*       3 R743CPMX FIXED(15),       /* Max. number of OMVS processes    02601000
*                                      during one cycle          @B2A*/ 02602000
*       3 R743CURU FIXED(32),       /* Accumulated number of OMVS       02603490
*                                      users during the interval        02603980
*                                                            @WA46170*/ 02604470
*       3 R743CUMN FIXED(15),       /* Min. number of OMVS users        02605000
*                                      during one cycle          @B2A*/ 02606000
*       3 R743CUMX FIXED(15),       /* Max. number of OMVS users        02607000
*                                      during one cycle      @WA10257*/ 02608000
*       3 R743MMSG FIXED(32),       /* Maximum number of message        02609000
*                                      queue IDs (const.)    @WA10257*/ 02610000
*       3 R743MSEM FIXED(32),       /* Maximum number of semaphore      02611000
*                                      IDs (const.)          @WA10257*/ 02612000
*       3 R743MSHM FIXED(32),       /* Maximum number of shared         02613000
*                                      memory IDs (const.)   @WA10257*/ 02614000
*       3 R743MSPG FIXED(32),       /* Maximum number of shared         02615000
*                                      memory pages (const.) @WA10257*/ 02616000
*       3 R743CMSG FIXED(32),       /* Accumulated number of message    02617000
*                                      queue IDs during one interval    02618000
*                                                            @WA10257*/ 02619000
*       3 R743CMMN FIXED(32),       /* Minimum number of message        02620000
*                                      queue IDs per cycle   @WA10257*/ 02621000
*       3 R743CMMX FIXED(32),       /* Maximum number of message        02622000
*                                      queue IDs per cycle   @WA10257*/ 02623000
*       3 R743CSEM FIXED(32),       /* Accumulated number of            02624000
*                                      semaphore IDs during one         02625000
*                                      interval              @WA10257*/ 02626000
*       3 R743CSMN FIXED(32),       /* Minimum number of semaphore      02627000
*                                      IDs per cycle         @WA10257*/ 02628000
*       3 R743CSMX FIXED(32),       /* Maximum number of semaphore      02629000
*                                      IDs per cycle         @WA10257*/ 02630000
*       3 R743CSHM FIXED(32),       /* Accumulated number of shared     02631000
*                                      memory IDs during one interval   02632000
*                                                            @WA10257*/ 02633000
*       3 R743CHMN FIXED(32),       /* Minimum number of shared         02634000
*                                      memory IDs per cycle  @WA10257*/ 02635000
*       3 R743CHMX FIXED(32),       /* Maximum number of shared         02636000
*                                      memory IDs per cycle  @WA10257*/ 02637000
*       3 R743CSPG FIXED(32),       /* Accumulated number of shared     02638000
*                                      memory pages during one          02639000
*                                      interval              @WA10257*/ 02640000
*       3 R743CGMN FIXED(32),       /* Minimum number of shared         02641000
*                                      memory pages per cycle           02642000
*                                                            @WA10257*/ 02643000
*       3 R743CGMX FIXED(32),       /* Maximum number of shared         02644000
*                                      memory pages per cycle           02645000
*                                                            @WA10257*/ 02646000
*       3 R743OMSG FIXED(32),       /* Accumulated number of attempts   02647000
*                                      to exceed maximum number of      02648000
*                                      message queue IDs during one     02649000
*                                      interval              @WA10257*/ 02650000
*       3 R743OMMN FIXED(32),       /* Minimum number of attempts to    02651000
*                                      exceed maximum number of         02652000
*                                      message queue IDs per cycle      02653000
*                                                            @WA10257*/ 02654000
*       3 R743OMMX FIXED(32),       /* Maximum number of attempts to    02655000
*                                      exceed maximum number of         02656000
*                                      message queue IDs per cycle      02657000
*                                                            @WA10257*/ 02658000
*       3 R743OSEM FIXED(32),       /* Accumulated number of attempts   02659000
*                                      to exceed maximum number of      02660000
*                                      semaphore IDs during one         02661000
*                                      interval              @WA10257*/ 02662000
*       3 R743OSMN FIXED(32),       /* Minimum number of attempts to    02663000
*                                      exceed maximum number of         02664000
*                                      semaphore IDs per cycle          02665000
*                                                            @WA10257*/ 02666000
*       3 R743OSMX FIXED(32),       /* Maximum number of attempts to    02667000
*                                      exceed maximum number of         02668000
*                                      semaphore IDs per cycle          02669000
*                                                            @WA10257*/ 02670000
*       3 R743OSHM FIXED(32),       /* Accumulated number of attempts   02671000
*                                      to exceed maximum number of      02672000
*                                      shared memory IDs during one     02673000
*                                      interval              @WA10257*/ 02674000
*       3 R743OHMN FIXED(32),       /* Minimum number of attempts to    02675000
*                                      exceed maximum number of         02676000
*                                      shared memory IDs per cycle      02677000
*                                                            @WA10257*/ 02678000
*       3 R743OHMX FIXED(32),       /* Maximum number of attempts to    02679000
*                                      exceed maximum number of         02680000
*                                      shared memory IDs per cycle      02681000
*                                                            @WA10257*/ 02682000
*       3 R743OSPG FIXED(32),       /* Accumulated number of attempts   02683000
*                                      to exceed maximum number of      02684000
*                                      shared memory pages during one   02685000
*                                      interval              @WA10257*/ 02686000
*       3 R743OGMN FIXED(32),       /* Minimum number of attempts to    02687000
*                                      exceed maximum number of         02688000
*                                      shared memory pages per cycle    02689000
*                                                            @WA10257*/ 02690000
*       3 R743OGMX FIXED(32),       /* Maximum number of attempts to    02691000
*                                      exceed maximum number of         02692000
*                                      shared memory pages per cycle    02693000
*                                                            @WA10257*/ 02694000
*       3 R743MMAP FIXED(32),       /* Maximum number of memory map     02695000
*                                      storage pages (const.)           02696000
*                                                            @WA10257*/ 02697000
*       3 R743CMAP FIXED(32),       /* Accumulated number of memory     02698000
*                                      map storage pages during one     02699000
*                                      interval              @WA10257*/ 02700000
*       3 R743CAMN FIXED(32),       /* Minimum number of memory map     02701000
*                                      storage pages per cycle          02702000
*                                                            @WA10257*/ 02703000
*       3 R743CAMX FIXED(32),       /* Maximum number of memory map     02704000
*                                      storage pages per cycle          02705000
*                                                            @WA10257*/ 02706000
*       3 R743OMAP FIXED(32),       /* Accumulated number of attempts   02707000
*                                      to exceed maximum number of      02708000
*                                      memory map storage pages         02709000
*                                      during one interval   @WA10257*/ 02710000
*       3 R743OAMN FIXED(32),       /* Minimum number of attempts to    02711000
*                                      exceed maximum number of         02712000
*                                      memory map storage pages per     02713000
*                                      cycle                 @WA10257*/ 02714000
*       3 R743OAMX FIXED(32),       /* Maximum number of attempts to    02715000
*                                      exceed maximum number of         02716000
*                                      memory map storage pages per     02717000
*                                      cycle                 @WA10257*/ 02718000
*       3 R743MPAG FIXED(32),       /* Maximum number of shared         02719000
*                                      storage pages (const.)           02720000
*                                                            @WA10257*/ 02721000
*       3 R743CPAG FIXED(32),       /* Accumulated number of shared     02722000
*                                      storage pages during one         02723000
*                                      interval              @WA10257*/ 02724000
*       3 R743CXMN FIXED(32),       /* Minimum number of shared         02725000
*                                      storage pages per cycle          02726000
*                                                            @WA10257*/ 02727000
*       3 R743CXMX FIXED(32),       /* Maximum number of shared         02728000
*                                      storage pages per cycle          02729000
*                                                            @WA10257*/ 02730000
*       3 R743OPAG FIXED(32),       /* Accumulated number of attempts   02731000
*                                      to exceed maximum number of      02732000
*                                      shared storage pages             02733000
*                                      during one interval   @WA10257*/ 02734000
*       3 R743OXMN FIXED(32),       /* Minimum number of attempts to    02735000
*                                      exceed maximum number of         02736000
*                                      shared storage pages per         02737000
*                                      cycle                 @WA10257*/ 02738000
*       3 R743OXMX FIXED(32),       /* Maximum number of attempts to    02739000
*                                      exceed maximum number of         02740000
*                                      shared storage pages per         02741000
*                                      cycle                     @I5C*/ 02742000
*       3 R743MSLR FIXED(32),       /* Maximum amount of storage        02743000
*                                      available for shared library     02744000
*                                      region (const. in MB)     @I5A*/ 02745000
*       3 R743CSLR FIXED(32),       /* Accumulated amount of shared     02746000
*                                      library storage allocated in     02747000
*                                      one interval (in MB)      @I5A*/ 02748000
*       3 R743CLMN FIXED(32),       /* Minimum amount of shared         02749000
*                                      library storage allocated per    02750000
*                                      cycle                     @I5A*/ 02751000
*       3 R743CLMX FIXED(32),       /* Maximum number of shared         02752000
*                                      library storage allocated per    02753000
*                                      cycle                     @I5A*/ 02754000
*       3 R743OSLR FIXED(32),       /* Accumulated number of attempts   02755000
*                                      to exceed maximum amount of      02756000
*                                      shared library region size       02757000
*                                      during one interval       @I5A*/ 02758000
*       3 R743OLMN FIXED(32),       /* Minimum number of attempts to    02759000
*                                      exceed maximum amount of shared  02760000
*                                      library region per cycle  @I5A*/ 02761000
*       3 R743OLMX FIXED(32),       /* Maximum number of attempts to    02762000
*                                      exceed maximum amount of shared  02763000
*                                      library region per cycle  @I5A*/ 02764000
*       3 R743MQDS FIXED(32),       /* Maximum amount of queued         02765000
*                                      signals allowed per process      02766000
*                                      (const.)                  @I5A*/ 02767000
*       3 R743OQDS FIXED(32),       /* Accumulated number of attempts   02768000
*                                      to exceed maximum amount of      02769000
*                                      queued signals per interval      02770000
*                                                                @I5A*/ 02771000
*       3 R743OQMN FIXED(32),       /* Minimum number of attempts to    02772000
*                                      exceed maximum amount of queued  02773000
*                                      signals per cycle         @I5A*/ 02774000
*       3 R743OQMX FIXED(32);       /* Maximum number of attempts to    02775000
*                                      exceed maximum amount of queued  02776000
*                                      signals per cycle         @I5A*/ 02777000
*    @SPACE(2);                                                         02778000
*%IF IFAR744 = 'YES' %THEN %GO TO LDAT744; /* Subtype 4          @C1A*/ 02779000
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/ 02780000
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/ 02781000
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/ 02782000
*%GO TO LEND74;                     /* End of SMF record         @C1A*/ 02783000
*%LDAT744:;                         /* Subtype 4                 @C1A*/ 02784000
*   @SPACE(2);                                                          02785000
*/********************************************************************/ 02786000
*/*                                                                  */ 02787000
*/*            Relocate blocks for sub type 4 - Monitor III          */ 02788000
*/*            XES/CF data (Cross- System Extended Services)         */ 02789000
*/*                                                                  */ 02790000
*/********************************************************************/ 02791000
*    @SPACE(2);                                                         02792000
*/*********  Subtype 4, Local CF Data Section ****************** @C1A*/ 02793000
*    @SPACE;                                                            02794000
*   DECLARE                                                             02795000
*     1 R744FLCF   BASED(ADDR(SMF74HDR)+SMF744FO),           /*  @C1A*/ 02796000
*       3 R744FNAM CHAR(8),         /* Name of Coupling Facility @C1A*/ 02797000
*       3 R744FSYS CHAR(8),         /* Name of this system              02798000
*                                      (from IEASYSxx parmlib           02799000
*                                       member, SYSNAME param.)  @C1A*/ 02800000
*       3 R744FFLG BIT(8),          /* Status Flags              @C1A*/ 02801000
*         5 R744FCEI BIT(1),        /* Coupling Facility was connected  02802000
*                                      to the system at the end         02803000
*                                      of the interval           @C1A*/ 02804000
*         5 R744FADI BIT(1),        /* Coupling Facility became active  02805000
*                                      during the interval       @C1A*/ 02806000
*         5 R744FPEC BIT(1),        /* Permanent erro in cycle gatherer 02807000
*                                      during complete interval  @C1A*/ 02808000
*         5 *        BIT(5),        /* Reserved                  @C1A*/ 02809000
*       3 R744FFLC BIT(8),          /* Informational flags       @I3A*/ 02810000
*         5 R744FCHO BIT(1),        /* CHPIDs set offline during the    02811000
*                                      interval                  @I3A*/ 02812000
*         5 *        BIT(7),        /* Not used                  @I3A*/ 02813000
*       3 *        BIT(8),          /* Reserved                  @I3C*/ 02814000
*       3 R744FAMV FIXED(8),        /* IXLYAMDA Version      @WA20293*/ 02815000
*       3 R744FPAM FIXED(31),       /* Number of paths available        02816000
*                                      to the CF                 @C1A*/ 02817000
*       3 R744FPBC CHAR(8),         /* Number of times CF requests      02818000
*                                      fail due to path busy,           02819000
*                                      long floating point       @C1A*/ 02820000
*       3 R744FSCG FIXED(31),       /* Number of subchannels            02821000
*                                      defined in the I/O gen    @C1A*/ 02822000
*       3 R744FSCU FIXED(31),       /* Number of subchannels            02823000
*                                      currently in use          @C1A*/ 02824000
*       3 R744FSCL FIXED(31),       /* Number of subchannels            02825000
*                                      that can be used (Limit)  @C1A*/ 02826000
*       3 R744FSCC CHAR(8),         /* Subchannel contetion count       02827000
*                                      (all subchannel busy),           02828000
*                                      long floating point       @C1A*/ 02829000
*       3 R744FTOR CHAR(8),         /* Total number of requests         02830000
*                                      from this system,                02831000
*                                      long floating point       @C1A*/ 02832000
*       3 R744FAIL CHAR(8),         /* Number of unsuccesful req.       02833000
*                                      from this system,                02834000
*                                      long floating point       @C1A*/ 02835000
*       3 R744FTIM CHAR(8),         /* Summed Service Time for          02836000
*                                      unsuccessful requests in         02837000
*                                      microseconds              @C1A*/ 02838000
*       3 R744FSQU CHAR(8),         /* Summed squares of serv. time     02839000
*                                      for unsucc. requests      @C1A*/ 02840000
*       3 R744FCTM CHAR(8),         /* Summed contention time           02841000
*                                      for waiting for subchannels      02842000
*                                      to become free (y-sec) for       02843000
*                                      synchronous immediate            02844000
*                                      operations            @WA20293*/ 02845000
*       3 R744FCSQ CHAR(8),         /* Summed squares of contention     02846000
*                                      time for waiting for             02847000
*                                      subchannels to become            02848000
*                                      free (y-sec *squared) for        02849000
*                                      synchronous immediate            02850000
*                                      operations            @WA20293*/ 02851000
*       3 R744FMOD CHAR(6),         /* CF model, can have leading       02852000
*                                      zeros, e.g. '009672'      @F1A*/ 02853000
*       3 R744FVER CHAR(3),         /* CF version, e.g. 'C01'    @F1A*/ 02854000
*       3 *        BIT(24),         /* Reserved                  @F1A*/ 02855000
*       3 R744FLVL FIXED(31);       /* CF level                  @F1A*/ 02856000
*    @SPACE(2);                                                         02857000
*/*********  Subtype 4, Connectivity Data Section ************** @C1A*/ 02858000
*    @SPACE;                                                            02859000
*   DECLARE                                                             02860000
*     1 R744XCON   BASED(ADDR(SMF74HDR)+SMF744XO),           /*  @C1A*/ 02861000
*       3 R744XSYS CHAR(8);         /* Name of remote system            02862000
*                                      also reporting on this           02863000
*                                      CF. From IEASYSxx parmlib        02864000
*                                      member, SYSNAME parameter @C1A*/ 02865000
*    @SPACE(2);                                                         02866000
*/*********  Subtype 4, Storage Data Section ******************* @C1A*/ 02867000
*    @SPACE;                                                            02868000
*   DECLARE                                                             02869000
*     1 R744GSRG   BASED(ADDR(SMF74HDR)+SMF744GO),           /*  @C1A*/ 02870000
*       3 R744GCSD FIXED(31),       /* Total amount of                  02871000
*                                      control storage defined          02872000
*                                      (units = 4K byte blocks)  @C1A*/ 02873000
*       3 R744GCSF FIXED(31),       /* Amount of free                   02874000
*                                      control storage                  02875000
*                                      (units = 4K byte blocks)  @C1A*/ 02876000
*       3 R744GTSD FIXED(31),       /* Total amount of                  02877000
*                                      CF storage defined               02878000
*                                      (units = 4K byte blocks)  @C1A*/ 02879000
*       3 R744GTSF FIXED(31),       /* Amount of free                   02880000
*                                      CF storage                       02881000
*                                      (units = 4K byte blocks)  @C1A*/ 02882000
*       3 R744GDSA FIXED(31),       /* Amount of                        02883000
*                                      dump space allocated             02884000
*                                      (units = 4K byte blocks)  @C1A*/ 02885000
*       3 R744GDSF FIXED(31),       /* Amount of free dump space        02886000
*                                      free dump space                  02887000
*                                      (units = 4K byte blocks)  @C1A*/ 02888000
*       3 R744GDSR FIXED(31);       /* Maximum amount of                02889000
*                                      dump space requested             02890000
*                                      (units = 4K byte blocks)  @C1A*/ 02891000
*    @SPACE(2);                                                         02892000
*/*********  Subtype 4, Structure Data Section ***************** @C1A*/ 02893000
*    @SPACE;                                                            02894000
*   DECLARE                                                             02895000
*     1 R744QSDS   BASED(ADDR(SMF74HDR)+SMF744QO),           /*  @C1A*/ 02896000
*       3 R744QSTR CHAR(16),        /* Name of structure allocated      02897000
*                                      in this Coupling Facility @C1A*/ 02898000
*       3 R744QSIZ FIXED(31),       /* Structure size requested to      02899000
*                                      be allocated                     02900000
*                                      (units = 4K byte blocks)  @G1C*/ 02901000
*       3 R744QVER BIT(64),         /* Structure Version number         02902000
*                                                            @WA04653*/ 02903000
*       3 R744QFLG BIT(8),          /* Status Flags          @WA04653*/ 02904000
*         5 R744QACT BIT(1),        /* Active instance of structure     02905000
*                                      (normal case)         @WA04653*/ 02906000
*         5 R744QRBN BIT(1),        /* New instance during rebuild      02907000
*                                                            @WA04653*/ 02908000
*         5 R744QRBO BIT(1),        /* Old instance during rebuild      02909000
*                                                            @WA04653*/ 02910000
*         5 R744QTRA BIT(1),        /* Instance is just being added or  02911000
*                                    deleted (in transition) @WA04653*/ 02912000
*         5 R744QHOL BIT(1),        /* Instance in hold, deletion       02913000
*                                      could not be finished @WA04653*/ 02914000
*         5 R744QDPT BIT(1),        /* Dump was initiated for this      02915000
*                                      structure             @WA04653*/ 02916000
*         5 *        BIT(2),        /* Reserved              @WA04653*/ 02917000
*       3 *        CHAR(3);         /* Reserved              @WA04653*/ 02918000
*    @SPACE(2);                                                         02919000
*/*********  Subtype 4, Request Data Section ******************* @C1A*/ 02920000
*    @SPACE;                                                            02921000
*   DECLARE                                                             02922000
*     1 R744SREQ   BASED(ADDR(SMF74HDR)+SMF744SO),           /*  @C1A*/ 02923000
*       3 R744SNAM CHAR(16),        /* Name of connected structure      02924000
*                                      in this Coupling Facility @C1A*/ 02925000
*       3 R744SVER BIT(64),         /* Structure Version number  @C1A*/ 02926000
*       3 R744STYP BIT(8),          /* Structure type identifier @C1A*/ 02927000
*       3 R744SFLG BIT(8),          /* Status Flags              @C1A*/ 02928000
*         5 R744SCEI BIT(1),        /* Structure was connected          02929000
*                                      to the system at the end         02930000
*                                      of the interval           @C1A*/ 02931000
*         5 R744SADI BIT(1),        /* Structure became active          02932000
*                                      during the interval       @C1A*/ 02933000
*         5 *        BIT(6),        /* Reserved                  @C1A*/ 02934000
*       3 *        BIT(8),          /* Reserved              @WA04653*/ 02935000
*       3 R744SLEC FIXED(8),        /* Lock structure only:             02936000
*                                      Lock table entry characteristic  02937000
*                                                            @WA04653*/ 02938000
*       3 R744SLEL FIXED(31),       /* List structure only:             02939000
*                                      Limit on number of list          02940000
*                                      entries                   @C1A*/ 02941000
*       3 R744SLEM FIXED(31),       /* List structure only:             02942000
*                                      Maximum number of list entries   02943000
*                                      used during interval      @C1A*/ 02944000
*       3 R744SLTL FIXED(31),       /* Lock structure only:             02945000
*                                      Limit on number of lock          02946000
*                                      table entries             @C1A*/ 02947000
*       3 R744SLTM FIXED(31),       /* Lock structure only:             02948000
*                                      Maximum number of lock table     02949000
*                                      entries used during interval     02950000
*                                                                @C1A*/ 02951000
*       3 R744SSTA CHAR(8),         /* Number of requests changed       02952000
*                                      from synchronous to              02953000
*                                      asynchronous,                    02954000
*                                      long floating point       @C1A*/ 02955000
*       3 R744STRC CHAR(8),         /* Total number of user requests    02956000
*                                      completed,                       02957000
*                                      long floating point   @WA04653*/ 02958000
*       3 R744STAC CHAR(8),         /* Total number of asynchronous     02959000
*                                      user requests completed,         02960000
*                                      long floating point   @WA04653*/ 02961000
*       3 R744SARC CHAR(8),         /* Count of number of times         02962000
*                                      for async. requests executed     02963000
*                                      by cf hardware,                  02964000
*                                      long floating point   @WA04653*/ 02965000
*       3 R744SATM CHAR(8),         /* Summed service time for          02966000
*                                      asynchronous requests            02967000
*                                      in microseconds           @C1A*/ 02968000
*       3 R744SASQ CHAR(8),         /* Summed squares of serv. time     02969000
*                                      for async. requests       @C1A*/ 02970000
*       3 R744SSRC CHAR(8),         /* Count of number of times         02971000
*                                      for sync. requests executed      02972000
*                                      by cf hardware,                  02973000
*                                      long floating point   @WA04653*/ 02974000
*       3 R744SSTM CHAR(8),         /* Summed service time for          02975000
*                                      synchronous requests             02976000
*                                      in microseconds           @C1A*/ 02977000
*       3 R744SSSQ CHAR(8),         /* Summed squares of serv. time     02978000
*                                      for sync. requests        @C1A*/ 02979000
*       3 R744SQRC CHAR(8),         /* Count of number of times         02980000
*                                      for queued requests,             02981000
*                                      long floating point       @C1A*/ 02982000
*       3 R744SQTM CHAR(8),         /* Summed queue delay time          02983000
*                                      in microseconds           @C1A*/ 02984000
*       3 R744SQSQ CHAR(8),         /* Summed squares of delay time     02985000
*                                      for queued requests       @C1A*/ 02986000
*       3 R744SDRC CHAR(8),         /* Number of times a request        02987000
*                                      was found delayed in case        02988000
*                                      of dump serailization,           02989000
*                                      long floating point       @C1A*/ 02990000
*       3 R744SDTM CHAR(8),         /* Summed dump delay time           02991000
*                                      in microseconds           @C1A*/ 02992000
*       3 R744SDSQ CHAR(8),         /* Summed squares of dump           02993000
*                                      delay time                @C1A*/ 02994000
*       3 R744SDMP CHAR(8),         /* Number of times dump             02995000
*                                      serialization was found          02996000
*                                      for this structure (list and     02997000
*                                      cache structures only),          02998000
*                                      long floating point       @C1A*/ 02999000
*       3 R744SHTO CHAR(8),         /* Total number of requests added   03000000
*                                      to the high priority queue       03001000
*                                      during interval,                 03002000
*                                      long floating point   @WA04653*/ 03003000
*       3 R744SHMN FIXED(31),       /* Minimum number of requests       03004000
*                                      added to the high priority       03005000
*                                      queue within one cycle           03006000
*                                      (this is a rate per cycle)       03007000
*                                                            @WA04653*/ 03008000
*       3 R744SHMX FIXED(31),       /* Maximum number of requests       03009000
*                                      added to the high priority       03010000
*                                      queue within one cycle           03011000
*                                      (this is a rate per cycle)       03012000
*                                                            @WA04653*/ 03013000
*       3 R744SLTO CHAR(8),         /* Total number of requests added   03014000
*                                      to the low priority queue        03015000
*                                      during interval,                 03016000
*                                      long floating point   @WA04653*/ 03017000
*       3 R744SLMN FIXED(31),       /* Minimum number of requests       03018000
*                                      added to the low priority        03019000
*                                      queue within one cycle           03020000
*                                      (this is a rate per cycle)       03021000
*                                                            @WA04653*/ 03022000
*       3 R744SLMX FIXED(31),       /* Maximum number of requests       03023000
*                                      added to the low priority        03024000
*                                      queue within one cycle           03025000
*                                      (this is a rate per cycle)       03026000
*                                                            @WA04653*/ 03027000
*       3 R744SDTO CHAR(8),         /* Total number of requests added   03028000
*                                      to the dump queue since dump     03029000
*                                      serialization is in progress,    03030000
*                                      long floating point   @WA04653*/ 03031000
*       3 R744SDMN FIXED(31),       /* Minimum number of requests       03032000
*                                      added to the dump queue since    03033000
*                                      dump serialization is in         03034000
*                                      progress within one cycle,       03035000
*                                      (rate per cycle)      @WA04653*/ 03036000
*       3 R744SDMX FIXED(31),       /* Maximum number of requests       03037000
*                                      added to the dump queue since    03038000
*                                      dump serialization is in         03039000
*                                      progress within one cycle,       03040000
*                                      (rate per cycle)      @WA04653*/ 03041000
*       3 R744SCN  CHAR(8),         /* Lock structure only:             03042000
*                                      Number of times any request      03043000
*                                      encountered lock contention,     03044000
*                                      long floating point       @C1A*/ 03045000
*       3 R744SFCN CHAR(8),         /* Lock structure only:             03046000
*                                      Number of times any request      03047000
*                                      encountered false lock           03048000
*                                      contention (storage contention   03049000
*                                      within the structure),           03050000
*                                      long floating point       @C1A*/ 03051000
*       3 R744SSIZ FIXED(31),       /* Allocated size of structure      03052000
*                                   (units = 4K byte blocks) @WA04653*/ 03053000
*       3 R744SMAS FIXED(31),       /* Maximum structure size           03054000
*                                                            @WA04653*/ 03055000
*       3 R744SMIS FIXED(31),       /* Minimum structure size           03056000
*                                                            @WA04653*/ 03057000
*       3 R744SDEC FIXED(31),       /* Cache structure only: Total      03058000
*                                      directory entry count @WA04653*/ 03059000
*       3 R744SDEL FIXED(31),       /* Cache structure only: Total      03060000
*                                      data element count    @WA04653*/ 03061000
*       3 R744SNLH FIXED(31),       /* List structure only: Number      03062000
*                                      of list headers       @WA04653*/ 03063000
*       3 R744SMAE FIXED(31),       /* List structure only: Maximum     03064000
*                                      number of elements    @WA04653*/ 03065000
*       3 R744SCUE FIXED(31),       /* List structure only:             03066000
*                                      Current number of elements       03067000
*                                      in use                @WA04653*/ 03068000
*       3 R744CDSI FIXED(15),       /* Index to first Cache Data        03069000
*                                      section               @WA20293*/ 03070000
*       3 R744CDNE FIXED(15);       /* Number of Cache Data Section     03071000
*                                      entries               @WA20293*/ 03072000
*    @SPACE(2);                                                         03073000
*/*********  Subtype 4, Processor Data Section ***************** @C1A*/ 03074000
*    @SPACE;                                                            03075000
*   DECLARE                                                             03076000
*     1 R744PROC   BASED(ADDR(SMF74HDR)+SMF744PO),           /*  @C1A*/ 03077000
*       3 R744PNUM FIXED(31),       /* CPU number                @C1A*/ 03078000
*       3 R744PBSY FIXED(32),       /* Busy time in microseconds @C1A*/ 03079000
*       3 R744PWAI FIXED(32);       /* Wait time in microseconds @C1A*/ 03080000
*    @SPACE(2);                                                         03081000
*/*********  Subtype 4, Cache Data Section ***************** @WA20293*/ 03082000
*    @SPACE;                                                            03083000
*   DECLARE                                                             03084000
*     1 R744CACH   BASED(ADDR(SMF74HDR)+SMF744CO),      /*   @WA20293*/ 03085000
*       3 R744CRHC CHAR(8),         /* Read hit Counter                 03086000
*                                      long floating point   @WA20293*/ 03087000
*       3 R744CRMD CHAR(8),         /* Read miss, directory             03088000
*                                      hit counter                      03089000
*                                      long floating point   @WA20293*/ 03090000
*       3 R744CRMA CHAR(8),         /* Read miss, assignment suppressed 03091000
*                                      counter                          03092000
*                                      long floating point   @WA20293*/ 03093000
*       3 R744CRMN CHAR(8),         /* Read miss, name assigned         03094000
*                                      counter                          03095000
*                                      long floating point   @WA20293*/ 03096000
*       3 R744CRMT CHAR(8),         /* Read miss, target storage class  03097000
*                                      full                             03098000
*                                      long floating point   @WA20293*/ 03099000
*       3 R744CWH0 CHAR(8),         /* Write hit change bit 0 CTR       03100000
*                                      long floating point   @WA20293*/ 03101000
*       3 R744CWH1 CHAR(8),         /* Write hit change bit 1 CTR       03102000
*                                      long floating point   @WA20293*/ 03103000
*       3 R744CWMN CHAR(8),         /* Write miss not registered        03104000
*                                      counter                          03105000
*                                      long floating point   @WA20293*/ 03106000
*       3 R744CWMI CHAR(8),         /* Write miss invalid state         03107000
*                                      counter                          03108000
*                                      long floating point   @WA20293*/ 03109000
*       3 R744CWMT CHAR(8),         /* Write miss storage class full    03110000
*                                      counter                          03111000
*                                      long floating point   @WA20293*/ 03112000
*       3 R744CDER CHAR(8),         /* Directory entry reclaim counter  03113000
*                                      long floating point   @WA20293*/ 03114000
*       3 R744CDTR CHAR(8),         /* Data entry reclaim counter       03115000
*                                      long floating point   @WA20293*/ 03116000
*       3 R744CXDR CHAR(8),         /* XI directory reclaim counter     03117000
*                                      long floating point   @WA20293*/ 03118000
*       3 R744CXFW CHAR(8),         /* XI write counter                 03119000
*                                      long floating point   @WA20293*/ 03120000
*       3 R744CXNI CHAR(8),         /* XI name invalidation counter     03121000
*                                      long floating point   @WA20293*/ 03122000
*       3 R744CXCI CHAR(8),         /* XI co,plement invalidation       03123000
*                                      counter                          03124000
*                                      long floating point   @WA20293*/ 03125000
*       3 R744CCOC CHAR(8),         /* Castout Counter                  03126000
*                                      long floating point   @WA20293*/ 03127000
*       3 R744CRSM CHAR(8),         /* Reference signal miss counter    03128000
*                                      long floating point   @WA20293*/ 03129000
*       3 R744CTSF CHAR(8),         /* Target storage class full        03130000
*                                      counter                          03131000
*                                      long floating point   @WA20293*/ 03132000
*       3 R744CDEC FIXED(32),       /* Directory entry counter          03133000
*                                      snapshot              @WA20293*/ 03134000
*       3 R744CDAC FIXED(32),       /* Data element counter             03135000
*                                      snapshot              @WA20293*/ 03136000
*       3 R744CTCC FIXED(32),       /* Total changed counter            03137000
*                                      long floating point   @WA20293*/ 03138000
*       3 R744CDTA FIXED(32),       /* Data area counter                03139000
*                                      long floating point   @WA20293*/ 03140000
*       3 R744CRLC CHAR(8),         /* Completed reference list         03141000
*                                      counter                          03142000
*                                      long floating point   @WA20293*/ 03143000
*       3 R744CPRL CHAR(8),         /* partially completed reference    03144000
*                                      list counter                     03145000
*                                      long floating point   @WA20293*/ 03146000
*       3 R744CXRL CHAR(8),         /* XI for local cache vector index  03147000
*                                      replacement                      03148000
*                                      long floating point   @WA20293*/ 03149000
*       3 R744CWUC CHAR(8);         /* Write unchanged counter          03150000
*                                      long floating point   @WA20293*/ 03151000
*%IF IFAR745 = 'YES' %THEN %GO TO LDAT745; /* Subtype 5          @E1A*/ 03152000
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/ 03153000
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/ 03154000
*%GO TO LEND74;                     /* End of SMF record         @E1A*/ 03155000
*%LDAT745:;                         /* Subtype 5                 @E1A*/ 03156000
*   @SPACE(2);                                                          03157000
*/********************************************************************/ 03158000
*/*                                                                  */ 03159000
*/*            Relocate blocks for sub type 5 - Monitor I            */ 03160000
*/*            CACHE data                                            */ 03161000
*/*                                                                  */ 03162000
*/********************************************************************/ 03163000
*    @SPACE(2);                                                         03164000
*/*********  Subtype 5, CACHE control section   **************** @E1A*/ 03165000
*    @SPACE;                                                            03166000
*   DECLARE                                                             03167000
*     1 R745CNTL   BASED(ADDR(SMF74HDR)+SMF745CO),           /*  @E1A*/ 03168000
*       3 R745CLVL FIXED(8),        /* Gatherer level            @E1A*/ 03169000
*       3 R745CMDL FIXED(8),        /* Caching subsystem model   @E1A*/ 03170000
*       3 R745CCNT FIXED(8),        /* Record sequence number    @E1A*/ 03171000
*       3 R745CUID CHAR(1),         /* Real control unit ID  @WA37816*/ 03172000
*       3 R745CSC  FIXED(8),        /* Status code               @E1A   03173000
*                                      00 = successful processed @E1A   03174000
*                                      04 = IOS return code      @E1A   03175000
*                                           R745CIOC ^= 0        @E1A   03176000
*                                      08 = IDCSS01 return code  @E1A   03177000
*                                           R745CRTN ^= 0        @E1A   03178000
*                                      98 = SYSTEM or USER ABEND @E1A   03179000
*                                           R745CEA  ^= 0        @E1A*/ 03180000
*       3 R745CAE  FIXED(24),       /* ABEND CODE (SDWACMPC)     @E1A   03181000
*                                      First  12 bits = System   @E1A   03182000
*                                             completion code    @E1A   03183000
*                                      Second 12 bits = User     @E1A   03184000
*                                             completion code    @E1A*/ 03185000
*       3 R745CRTN FIXED(16),       /* IDCSS01 return code.             03186000
*                                      If not zero,                     03187000
*                                      no device data sections.         03188000
*                                      SMF745DN = 0              @E1A*/ 03189000
*       3 R745CIOC FIXED(8),        /* IOS return code. If not zero,    03190000
*                                      no device data sections.         03191000
*                                      SMF745DN = 0              @E1A*/ 03192000
*       3 *        CHAR(1),         /* Reserved                  @E1A*/ 03193000
*       3 R745CINT FIXED(32),       /* Number of seconds since          03194000
*                                      subsystem statistics last        03195000
*                                      collected                 @G2C*/ 03196000
*       3 R745CCMT CHAR(28);        /* Hardware type/model of this      03197000
*                                      control unit. Mapped by          03198000
*                                      NEDID in IHACDR           @G2A*/ 03199000
*    @SPACE(2);                                                         03200000
*/*********  Subtype 5, CACHE device data section ************** @E1A*/ 03201000
*    @SPACE;                                                            03202000
*   DECLARE                                                             03203000
*     1 R745DEV    BASED(ADDR(SMF74HDR)+SMF745DO),           /*  @E1A*/ 03204000
*       3 R745DVOL CHAR(6),         /* Volume serial of device   @E1A*/ 03205000
*       3 R745DFL4,                 /* Flags                     @E1A*/ 03206000
*         5 R745DEV4 BIT(1),        /* B'1' 4 digit device addr. @E1A*/ 03207000
*         5 *        BIT(7),        /* Reserved                  @E1A*/ 03208000
*       3 R745DCID CHAR(1),         /* Real control unit ID  @WA37816*/ 03209000
*       3 R745DUNT CHAR(3),         /* Unit addr. for sense CMD  @E1A*/ 03210000
*       3 *        CHAR(1),         /* Reserved                  @E1A*/ 03211000
*       3 R745DEVN FIXED(16),       /* Device number (binary)    @E1A*/ 03212000
*       3 *        CHAR(2),         /* Reserved                  @E1A*/ 03213000
*       3 R745DCNT,                 /* Caching subsystem counts  @E1A*/ 03214000
*         5 R745DFLG,               /* Flags                     @E1A*/ 03215000
*           7 R745DNAV BIT(1),      /* Subsystem storage not            03216000
*                                      available                 @E1A*/ 03217000
*           7 *        BIT(3),      /* Reserved                  @E1A*/ 03218000
*           7 R745DFRM BIT(4),      /* Format of data returned   @E1A*/ 03219000
*                                   /* B'0000'  = 40 bytes sense @E1A*/ 03220000
*                                   /* B'1111'  = 44 bytes sense @E1A*/ 03221000
*         5 R745DVID FIXED(8),      /* Device address            @E1A*/ 03222000
*         5 R745DVS1,               /* Addressed device status 1 @E1A*/ 03223000
*           7 R745DSDV BIT(2),      /* Device caching status     @E1A*/ 03224000
*                                   /* B'00' = Caching activated @E1A*/ 03225000
*                                   /* B'01' = Not used          @E1A*/ 03226000
*                                   /* B'10' = Deactivate pend.  @E1A*/ 03227000
*                                   /* B'11' = Caching deactivated      03228000
*                                                                @E1A*/ 03229000
*           7 R745DSFW BIT(2),      /* DASD fast write device status    03230000
*                                                                @E1A*/ 03231000
*                                   /* B'00' = DFW allowed       @E1A*/ 03232000
*                                   /* B'01' = DFW not used      @E1A*/ 03233000
*                                   /* B'10' = DFW deact. pend.  @E1A*/ 03234000
*                                   /* B'11' = DFW deactivate    @E1A*/ 03235000
*           7 R745DSPD BIT(1),      /* Primary of duplex pair    @E1A*/ 03236000
*           7 R745DSSD BIT(1),      /* Secondary of duplex pair  @E1A*/ 03237000
*           7 R745DSDP BIT(2),      /* Duplex pair status        @E1A*/ 03238000
*                                   /* B'00' = Duplex pair available    03239000
*                                                                @E1A*/ 03240000
*                                   /* B'01' = Duplex pair pending      03241000
*                                                                @E1A*/ 03242000
*                                   /* B'10' = Failed duplex primary    03243000
*                                                                @E1A*/ 03244000
*                                   /* B'11' = Failed duplex not prim   03245000
*                                                                @E1A*/ 03246000
*         5 R745DVS2,               /* Addressed device status 2 @E1A*/ 03247000
*           7 R745DSDF BIT(1),      /* Device is failed duplex   @E1A*/ 03248000
*           7 R745DSPN BIT(1),      /* Pinned data exits for device     03249000
*                                                                @E1A*/ 03250000
*           7 R745DSOD BIT(6),      /* Other device in duplex pair      03251000
*                                                                @E1A*/ 03252000
*         5 R745DRCR CHAR(4),       /* Search read caching requ. @E1A*/ 03253000
*                                   /* Floating point short      @E1A*/ 03254000
*         5 R745DCRH CHAR(4),       /* Search read caching hits  @E1A*/ 03255000
*                                   /* Floating point short      @E1A*/ 03256000
*         5 R745DWRC CHAR(4),       /* Write caching requests    @E1A*/ 03257000
*                                   /* Floating point short      @E1A*/ 03258000
*         5 R745DWCH CHAR(4),       /* Write caching requ. hits  @E1A*/ 03259000
*                                   /* Floating point short      @E1A*/ 03260000
*         5 R745DRSR CHAR(4),       /* Read sequential requests  @E1A*/ 03261000
*                                   /* Floating point short      @E1A*/ 03262000
*         5 R745DRSH CHAR(4),       /* Read sequential requ.hits @E1A*/ 03263000
*                                   /* Floating point short      @E1A*/ 03264000
*         5 R745DWSR CHAR(4),       /* Write sequential requests @E1A*/ 03265000
*                                   /* Floating point short      @E1A*/ 03266000
*         5 R745DWSH CHAR(4),       /* Write sequ. request hits  @E1A*/ 03267000
*                                   /* Floating point short      @E1A*/ 03268000
*         5 R745DRNR CHAR(4),       /* Search read non-retentive        03269000
*                                      requests                  @E1A*/ 03270000
*                                   /* Floating point short      @E1A*/ 03271000
*         5 R745DNRH CHAR(4),       /* Search read non-retentive        03272000
*                                      request hits              @E1A*/ 03273000
*                                   /* Floating point short      @E1A*/ 03274000
*         5 R745DWNR CHAR(4),       /* Write non-retentive requests     03275000
*                                                                @E1A*/ 03276000
*                                   /* Floating point short      @E1A*/ 03277000
*         5 R745DWNH CHAR(4),       /* Write non-retentive hits  @E1A*/ 03278000
*                                   /* Floating point short      @E1A*/ 03279000
*         5 R745DICL CHAR(4),       /* Inhibit cache load req.   @E1A*/ 03280000
*                                   /* Floating point short      @E1A*/ 03281000
*         5 R745DBCR CHAR(4),       /* Bypass cache requests     @E1A*/ 03282000
*                                   /* Floating point short      @E1A*/ 03283000
*         5 R745DTC  CHAR(4),       /* Seq DASD to cache XFRs    @E1A*/ 03284000
*                                   /* Floating point short      @E1A*/ 03285000
*         5 R745DNTD CHAR(4),       /* Normal cache requests            03286000
*                                      DASD to CACHE XFRs        @E1A*/ 03287000
*                                   /* Floating point short      @E1A*/ 03288000
*         5 R745DCTD CHAR(4),       /* CACHE to DASD XFRs        @E1A*/ 03289000
*                                   /* Floating point short      @E1A*/ 03290000
*         5 R745DFWB CHAR(4),       /* Fast write bypass count   @E1A*/ 03291000
*                                   /* Floating point short      @E1A*/ 03292000
*         5 R745DFWC CHAR(4),       /* Fast write caching req.   @E1A*/ 03293000
*                                   /* Floating point short      @E1A*/ 03294000
*         5 R745DFWS CHAR(4),       /* Fast write sequ. req.     @E1A*/ 03295000
*                                   /* Floating point short      @E1A*/ 03296000
*         5 R745DCRM CHAR(4),       /* Record cache read misses  @E1A*/ 03297000
*                                   /* Floating point short      @E1A*/ 03298000
*         5 R745DSG2,               /* Device status group 2     @E1A*/ 03299000
*           7 R745DCOL BIT(2),      /* Record cache optimization        03300000
*                                      level                     @E1A*/ 03301000
*                                   /* B'00' = Full adapt rec cache     03302000
*                                                                @E1A*/ 03303000
*                                   /* B'01' = Adapt rec. cache writes  03304000
*                                                                @E1A*/ 03305000
*                                   /* B'10' = Rec cache on def ext     03306000
*                                                                @E1A*/ 03307000
*                                   /* B'11' = Track mode        @E1A*/ 03308000
*           7 R745DEFN BIT(1),      /* Data exits in failed NVS  @E1A*/ 03309000
*           7 R745DBDP BIT(1),      /* Defective battery destage        03310000
*                                      pending                   @E1A*/ 03311000
*           7 R745DVST BIT(2),      /* Volume state              @E1A*/ 03312000
*                                   /* B'00' = Non spare         @E1A*/ 03313000
*                                   /* B'01' = Reserved          @E1A*/ 03314000
*                                   /* B'10' = Spare             @E1A*/ 03315000
*                                   /* B'11' = Broken spare      @E1A*/ 03316000
*           7 R745DPDT BIT(2),      /* Pinned data               @E1A*/ 03317000
*                                   /* B'00' = No pinned data & FW      03318000
*                                                                @E1A*/ 03319000
*                                   /* B'01' = Pinned data & not        03320000
*                                              FW suspend        @E1A*/ 03321000
*                                   /* B'10' = Reserved          @E1A*/ 03322000
*                                   /* B'11' = Pinned data &            03323000
*                                              FW suspend        @E1A*/ 03324000
*         5 *        CHAR(1),       /* Reserved                  @E1A*/ 03325000
*         5 R745DSID FIXED(16),     /* Subsystem ID              @E1A*/ 03326000
*         5 R745DCWP CHAR(4),       /* RCD cache write promotions       03327000
*                                      Floating point short      @E1A*/ 03328000
*         5 R745DKDW CHAR(4),       /* CKD writes, collected     @E1A*/ 03329000
*                                   /* for 3990-03/06, 2105  @WA37816*/ 03330000
*                                   /* Floating point short      @E1A*/ 03331000
*         5 R745DKDH CHAR(4),       /* CKD write hits, collected @E1A*/ 03332000
*                                   /* for 3990-03/06, 2105  @WA37816*/ 03333000
*                                   /* Floating point short      @E1A*/ 03334000
*         5 R745DFWR CHAR(4);       /* CFW bypass, collected     @E1A*/ 03335000
*                                   /* for 3990-03/06, 2105  @WA37816*/ 03336000
*                                   /* Floating point short      @E1A*/ 03337000
*    @SPACE(2);                                                         03338000
*/*****  Subtype 5, CACHE device data section extension    ***** @E1A*/ 03339000
*/*****  This extension is not used by RMF and applies     ***** @E1A*/ 03340000
*/*****  only to control unit 3990-03 and 3990-06.         ***** @E1A*/ 03341000
*/*****  It is collected by RMF to provide the same data   ***** @E1A*/ 03342000
*/*****  as in the corresponding CRR_record.               ***** @E1A*/ 03343000
*/*****  The data, except the device number R745XDVN, are  ***** @E1A*/ 03344000
*/*****  in short floating point format.                   ***** @E1A*/ 03345000
*    @SPACE;                                                            03346000
*   DECLARE                                                             03347000
*     1 R745XDEV   BASED(ADDR(SMF74HDR)+SMF745XO),           /*  @E1A*/ 03348000
*       3 R745XDVN FIXED(16),       /* Device number (binary)    @E1A*/ 03349000
*       3 *        CHAR(2),         /* Reserved                  @E1A*/ 03350000
*       3 R745XCNT,                 /* Counts                    @E1A*/ 03351000
*         5 R745XRSV CHAR(4),       /* Lower interface I/O msec         03352000
*                                                            @WA37816*/ 03353000
*         5 R745XCTC CHAR(4),       /* Not Used by RMF           @E1A*/ 03354000
*         5 R745XCTR CHAR(4),       /* Not used by RMF           @E1A*/ 03355000
*         5 R745XVRD CHAR(4),       /* Not used by RMF           @E1A*/ 03356000
*         5 R745XVRH CHAR(4),       /* Not used by RMF           @E1A*/ 03357000
*         5 R745XVWR CHAR(4),       /* Not used by RMF           @E1A*/ 03358000
*         5 R745XVWH CHAR(4),       /* Not used by RMF           @E1A*/ 03359000
*         5 R745XSRR CHAR(4),       /* Not used by RMF           @E1A*/ 03360000
*         5 R745XFRD CHAR(4),       /* Not used by RMF           @E1A*/ 03361000
*         5 R745XWCC CHAR(4),       /* Not used by RMF           @E1A*/ 03362000
*         5 R745XPRC CHAR(4),       /* Not used by RMF           @E1A*/ 03363000
*         5 R745XCT1 CHAR(4),       /* Not used by RMF           @E1A*/ 03364000
*         5 R745XCT2 CHAR(4),       /* Not used by RMF           @E1A*/ 03365000
*         5 R745XCT3 CHAR(4),       /* Not used by RMF           @E1A*/ 03366000
*         5 R745XCT4 CHAR(4),       /* Not used by RMF           @E1A*/ 03367000
*         5 R745XCT5 CHAR(4),       /* Not used by RMF           @E1A*/ 03368000
*         5 R745XCT6 CHAR(4),       /* Not used by RMF           @E1A*/ 03369000
*         5 R745XCT7 CHAR(4),       /* Not used by RMF           @E1A*/ 03370000
*         5 R745XCT8 CHAR(4),       /* Not used by RMF           @E1A*/ 03371000
*         5 R745XCT9 CHAR(4),       /* Not used by RMF           @E1A*/ 03372000
*         5 R745XCTA CHAR(4);       /* Not used by RMF           @E1A*/ 03373000
*    @SPACE(2);                                                         03374000
*/*****  Subtype 5, RAID rank Data Section  **************** @WA37816*/ 03375000
*/*****  All counters are in short floating point format. ** @WA37816*/ 03376000
*    @SPACE;                                                            03377000
*   DECLARE                                                             03378000
*     1 R7451DEV   BASED(ADDR(SMF74HDR)+SMF7451O),        /* @WA37816*/ 03379000
*       3 R7451DVN FIXED(16),       /* Device number (binary)           03380000
*                                                            @WA37816*/ 03381000
*       3 *        CHAR(2),         /* Reserved              @WA37816*/ 03382000
*       3 R7451E1,                  /* Data extension        @WA37816*/ 03383000
*         5 R7451RSV CHAR(4),       /* Lower interface I/O msec         03384000
*                                      Floating point short  @WA37816*/ 03385000
*         5 R7451FLG BIT(8),        /* Flags:                @WA37816*/ 03386000
*                                   /* X'00' = No additional data       03387000
*                                                            @WA37816*/ 03388000
*                                   /* X'01' = RAID rank data           03389000
*                                                            @WA37816*/ 03390000
*/*****  RAID rank info ************************************ @WA37816*/ 03391000
*         5 R7451AID FIXED(8),      /* Device adapter ID     @WA37816*/ 03392000
*         5 R7451RID FIXED(16),     /* RAID rank ID          @WA37816*/ 03393000
*         5 R7451HDD FIXED(8),      /* Num. of HDD in RAID rank         03394000
*                                                            @WA37816*/ 03395000
*         5 R7451RTY CHAR(1),       /* RAID rank type            @I6C*/ 03396000
*                                   /* X'00' = RAID-5            @I6A*/ 03397000
*                                   /* X'01' = JBOD              @I6A*/ 03398000
*                                   /* X'02' = RAID 0/1          @I6A*/ 03399000
*         5 R7451HSS FIXED(16),     /* HDD sector size       @WA37816*/ 03400000
*/**** All the following counts in this section ************ @WA37816*/ 03401000
*/**** are in short floating point notation.    ************ @WA37816*/ 03402000
*         5 R7451RRQ CHAR(4),       /* RAID rank read requests          03403000
*                                                            @WA37816*/ 03404000
*         5 R7451WRQ CHAR(4),       /* RAID rank write requests         03405000
*                                                            @WA37816*/ 03406000
*         5 R7451SR  CHAR(4),       /* RR FB sectors read    @WA37816*/ 03407000
*         5 R7451SW  CHAR(4),       /* RR FB sectors written @WA37816*/ 03408000
*         5 R7451RMR CHAR(4),       /* Record mode read request         03409000
*                                                            @WA37816*/ 03410000
*         5 R7451XSF CHAR(4),       /* XRC or CC sidefile               03411000
*                                      read request          @WA37816*/ 03412000
*         5 R7451XCW CHAR(4),       /* XRC or CC contaminated           03413000
*                                      writes                @WA37816*/ 03414000
*         5 R7451TSP CHAR(4),       /* Number of tracks transferred     03415000
*                                      to secondary PPRC volume         03416000
*                                                            @WA37816*/ 03417000
*         5 R7451NVS CHAR(4),       /* NVS space allocation  @WA37816*/ 03418000
*         5 R7451RRT CHAR(4),       /* RR read response time @WA37816*/ 03419000
*         5 R7451WRT CHAR(4),       /* RR write response time           03420000
*                                                            @WA37816*/ 03421000
*         5 R7451CT1 CHAR(4),       /* Reserved              @WA37816*/ 03422000
*         5 R7451CT2 CHAR(4),       /* Reserved              @WA37816*/ 03423000
*         5 R7451CT3 CHAR(4),       /* Reserved              @WA37816*/ 03424000
*         5 R7451CT4 CHAR(4),       /* Reserved              @WA37816*/ 03425000
*         5 R7451CT5 CHAR(4),       /* Reserved              @WA37816*/ 03426000
*         5 R7451CT6 CHAR(4),       /* Reserved              @WA37816*/ 03427000
*         5 R7451CT7 CHAR(4);       /* Reserved              @WA37816*/ 03428000
*    @SPACE(2);                                                         03429000
*    @SPACE;                                                            03430000
*/*****  Subtype 5, CACHE control unit status data section ***** @E1A*/ 03431000
*    @SPACE;                                                            03432000
*   DECLARE                                                             03433000
*     1 R745STAT   BASED(ADDR(SMF74HDR)+SMF745SO),           /*  @E1A*/ 03434000
*       3 R745SVOL CHAR(6),         /* Volume serial of device   @E1A*/ 03435000
*       3 *        CHAR(2),         /* Reserved                  @E1A*/ 03436000
*       3 R745SUNT CHAR(3),         /* Unit addr. for sense CMD  @E1A*/ 03437000
*       3 *        CHAR(1),         /* Reserved                  @E1A*/ 03438000
*       3 R745SDEV FIXED(16),       /* Device number (binary)    @E1A*/ 03439000
*       3 R745SLN  FIXED(15),       /* Length of data section    @E1A*/ 03440000
*       3 R745ST,                   /* Caching status            @E1A*/ 03441000
*         5 R745SFT  BIT(8),        /* Status data format        @E1A*/ 03442000
*                                   /* B'....0000' = 40 bytes sense     03443000
*                                                                @E1A*/ 03444000
*                                   /* B'....1111' = 44 bytes sense     03445000
*                                                                @E1A*/ 03446000
*         5 R745SDID BIT(8),        /* Device ID                 @E1A*/ 03447000
*         5 R745SNAD BIT(8),        /* Num. of attached devices  @E1A*/ 03448000
*         5 R745SNSS BIT(8),        /* Num. of statistic sets    @E1A*/ 03449000
*         5 R745SCS,                /* Caching status            @E1A*/ 03450000
*           7 R745SOS  BIT(3),      /* Overall caching status    @E1A*/ 03451000
*                                   /* B'000' = Caching active   @E1A*/ 03452000
*                                   /* B'001' = Pending active   @E1A*/ 03453000
*                                   /* B'010' = Subsystem error  @E1A*/ 03454000
*                                   /* B'011' = Reserved         @E1A*/ 03455000
*                                   /* B'100' = Host or SF deac. @E1A*/ 03456000
*                                   /* B'101' = Cache suspended  @E1A*/ 03457000
*                                   /* B'110' = Pend. off in process    03458000
*                                                                @E1A*/ 03459000
*                                   /* B'111' = Pend. off failure       03460000
*                                                                @E1A*/ 03461000
*           7 R745SDS  BIT(1),      /* Disabled for maintenance  @E1A*/ 03462000
*           7 *        BIT(2),      /* Reserved                  @E1A*/ 03463000
*           7 R745SIM  BIT(1),      /* IML device not available  @E1A*/ 03464000
*           7 R745SNR  BIT(1),      /* Non-retentive deactivated @E1A*/ 03465000
*         5 R745SVSS,               /* Non-volatile storage stat.@E1A*/ 03466000
*           7 R745SNHT BIT(1),      /* Host termination          @E1A*/ 03467000
*           7 R745SNIS BIT(1),      /* Problem termination       @E1A*/ 03468000
*           7 *        BIT(1),      /* Reserved                  @E1A*/ 03469000
*           7 R745SNDS BIT(1),      /* Disabled for maintenance  @E1A*/ 03470000
*           7 R745SNPE BIT(1),      /* Pending due to problem    @E1A*/ 03471000
*           7 *        BIT(3),      /* Reserved                  @E1A*/ 03472000
*         5 R745SCLN FIXED(16),     /* Lng.of subsys. count area @E1A*/ 03473000
*         5 *        CHAR(2),       /* Reserved                  @E1A*/ 03474000
*         5 R745SCNF FIXED(32) BDY(WORD,3), /* Configured subsystem     03475000
*                                      storage                   @E1A*/ 03476000
*         5 R745SAVL FIXED(32) BDY(WORD,3), /*  Available subsystem     03477000
*                                      storage                   @E1A*/ 03478000
*         5 R745SPIN FIXED(32) BDY(WORD,3), /*  Pinned subsystem @E1A*/ 03479000
*                                   /* storage,collected for     @E1A*/ 03480000
*                                   /* 3990-03/06 and 2105   @WA37816*/ 03481000
*         5 R745SOFF FIXED(32) BDY(WORD,3), /* Offline subsystem @E1A*/ 03482000
*                                   /* storage, collected for    @E1A*/ 03483000
*                                   /* 3990-03/06 and 2105   @WA37816*/ 03484000
*         5 R745SDS1,               /* Addressed device status 1 @E1A*/ 03485000
*           7 R745SDCS BIT(2),      /* Device caching status     @E1A*/ 03486000
*                                   /* B'00' = Activated         @E1A*/ 03487000
*                                   /* B'01' = Not used          @E1A*/ 03488000
*                                   /* B'10' = Deactivate pend.  @E1A*/ 03489000
*                                   /* B'11' = Deactivated       @E1A*/ 03490000
*           7 R745SDFW BIT(2),      /* DASD fast write status    @E1A*/ 03491000
*                                   /* B'00' = DFW allowed       @E1A*/ 03492000
*                                   /* B'01' = Not used          @E1A*/ 03493000
*                                   /* B'10' = Deactivate pend.  @E1A*/ 03494000
*                                   /* B'11' = Deactivated       @E1A*/ 03495000
*           7 R745SPDP BIT(1),      /* Primary duplex pair       @E1A*/ 03496000
*           7 R745SSDP BIT(1),      /* Secondary duplex pair     @E1A*/ 03497000
*           7 R745SDPS BIT(2),      /* Duplex pair status        @E1A*/ 03498000
*                                   /* B'00' = Available         @E1A*/ 03499000
*                                   /* B'01' = Pending           @E1A*/ 03500000
*                                   /* B'10' = Failed primary    @E1A*/ 03501000
*                                   /* B'11' = Failed not prim.  @E1A*/ 03502000
*         5 R745SDS2,               /* Addressed device status 2 @E1A*/ 03503000
*           7 R745SFDP BIT(1),      /* Device is failed duplex   @E1A*/ 03504000
*           7 R745SDPN BIT(1),      /* Pinned data               @E1A*/ 03505000
*           7 R745SOD  BIT(6),      /* Other device in duplex    @E1A*/ 03506000
*         5 R745SCNV FIXED(32),     /* Config. non-volatile      @E1A*/ 03507000
*                                   /* cache, collected for      @E1A*/ 03508000
*                                   /* 3990-03/06 and 2105   @WA37816*/ 03509000
*         5 R745SPND FIXED(32),     /* Pinned non-volatile       @E1A*/ 03510000
*                                   /* cache, collected for      @E1A*/ 03511000
*                                   /* 3990-03/06 and 2105   @WA37816*/ 03512000
*         5 R745SG2,                /* Device status group 2     @E1A*/ 03513000
*           7 R745SCOL BIT(2),      /* Cache optimization level  @E1A*/ 03514000
*                                   /* B'00' = Rec. full adapt - @E1A*/ 03515000
*                                   /* B'01' = Write rec adapt - @E1A*/ 03516000
*                                   /* B'10' = Def ext record -- @E1A*/ 03517000
*                                   /* B'11' = Track mode        @E1A*/ 03518000
*           7 R745SFVS BIT(1),      /* Data on failed NVS        @E1A*/ 03519000
*           7 R745SDBP BIT(1),      /* Defective battery destage        03520000
*                                      pending                   @E1A*/ 03521000
*           7 R745SVST BIT(2),      /* Volume state              @E1A*/ 03522000
*                                   /* B'00' = Non_spare         @E1A*/ 03523000
*                                   /* B'01' = Reserved          @E1A*/ 03524000
*                                   /* B'10' = Spare             @E1A*/ 03525000
*                                   /* B'11' = Broken spare      @E1A*/ 03526000
*           7 R745SPDA BIT(2),      /* Pinned data               @E1A*/ 03527000
*                                   /* B'00' = Not pinned & FW   @E1A*/ 03528000
*                                   /* B'01' = Pinned & not FW suspend  03529000
*                                                                @E1A*/ 03530000
*                                   /* B'10' = Reserved          @E1A*/ 03531000
*                                   /* B'11' = Pinned & FW susp. @E1A*/ 03532000
*         5 R745SGL  BIT(8),        /* Global status             @E1A*/ 03533000
*                                   /* X'80' CFW & DFW suspended @E1A*/ 03534000
*         5 R745SSID CHAR(2),       /* Subsystem Id              @E1A*/ 03535000
*         5 R745SS0  BIT(8),        /* Reserved                  @G2C*/ 03536000
*         5 R745SS1  BIT(8),        /* Reserved                  @G2C*/ 03537000
*         5 R745SNS0 BIT(8),        /* Reserved                  @G2C*/ 03538000
*         5 R745SNS1 BIT(8),        /* Reserved                  @G2C*/ 03539000
*       3 *        CHAR(12);        /* Reserved                  @G2A*/ 03540000
*%IF IFAR746 = 'YES' %THEN %GO TO LDAT746; /* Subtype 6          @H1A*/ 03541000
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/ 03542000
*%GO TO LEND74;                     /* End of SMF record         @H1A*/ 03543000
*%LDAT746:;                         /* Subtype 6                 @H1A*/ 03544000
*   @SPACE(2);                                                          03545000
*/********************************************************************/ 03546000
*/*                                                                  */ 03547000
*/*            Relocate blocks for subtype 6 - Monitor III           */ 03548000
*/*            HFS data (Global and File System statistics).         */ 03549000
*/*                                                                  */ 03550000
*/********************************************************************/ 03551000
*    @SPACE(2);                                                         03552000
*/*** Subtype 6, HFS Global Data Section *********************** @H1A*/ 03553000
*    @SPACE;                                                            03554000
*   DECLARE                                                             03555000
*     1 R746GDAT BASED(ADDR(SMF74HDR)+SMF746DO),             /*  @H1A*/ 03556000
*       3 R746GMXV FIXED(32),       /* Value of VIRTUAL(MAX) (in MB)    03557000
*                                                                @H1A*/ 03558000
*       3 R746GUSV FIXED(32),       /* Total amount (in pages) of       03559000
*                                      virtual storage in use    @H1A*/ 03560000
*       3 R746GMNF FIXED(32),       /* Value of FIXED(MIN) (in MB)      03561000
*                                                                @H1A*/ 03562000
*       3 R746GUSF FIXED(32),       /* Total amount (in pages ) of      03563000
*                                      permanently fixed storage in     03564000
*                                      use                       @H1A*/ 03565000
*       3 R746GMC CHAR(8),          /* Number of times the metadata     03566000
*                                      for a file was found in virtual  03567000
*                                      storage (cache) during file      03568000
*                                      lookup, (long floating point)    03569000
*                                                                @H1A*/ 03570000
*       3 R746GMNC CHAR(8),         /* Number of times the metadata     03571000
*                                      for a file was not found in      03572000
*                                      virtual storage (cache) during   03573000
*                                      file lookup and an index call    03574000
*                                      was necessary which may result   03575000
*                                      in an I/O, (long floating        03576000
*                                      point)                    @H1A*/ 03577000
*       3 R746G1C CHAR(8),          /* Number of times the first page   03578000
*                                      of a data file was requested     03579000
*                                      and found in virtual storage     03580000
*                                      (cache), (long floating point)   03581000
*                                                                @H1A*/ 03582000
*       3 R746G1NC CHAR(8),         /* Number of times the first page   03583000
*                                      of a data file was requested     03584000
*                                      and not found in virtual         03585000
*                                      storage (cache) and a I/O was    03586000
*                                      necessary, (long floating        03587000
*                                      point)                    @H1A*/ 03588000
*       3 R746GLRC FIXED(32),       /* Return code from OMVS BPX1PCT    03589000
*                                      for DisplayBufferLimits command  03590000
*                                                                @H1A*/ 03591000
*       3 R746GLRS FIXED(32),       /* Reason code from OMVS BPX1PCT    03592000
*                                      for DisplayBufferLimits command  03593000
*                                                                @H1A*/ 03594000
*       3 R746GSRC FIXED(32),       /* Return code from OMVS BPX1PCT    03595000
*                                      for DisplayGlobalStats command   03596000
*                                                                @H1A*/ 03597000
*       3 R746GSRS FIXED(32),       /* Reason code from OMVS BPX1PCT    03598000
*                                      for DisplayGlobalStats command   03599000
*                                                                @H1A*/ 03600000
*       3 R746GSFL BIT(8),          /* Status Flags              @H1A*/ 03601000
*         5 R746GONR BIT(1),        /* OMVS kernel not ready     @H1A*/ 03602000
*         5 R746GNBL BIT(1),        /* No buffer limit data      @H1A*/ 03603000
*         5 R746GNGD BIT(1),        /* No global data            @H1A*/ 03604000
*         5 R746GPGD BIT(1),        /* Partial global data       @H1A*/ 03605000
*         5 * BIT(4),               /* Reserved                  @H1A*/ 03606000
*       3 * CHAR(7);                /* Reserved                  @H1A*/ 03607000
*    @SPACE(2);                                                         03608000
*/*** Subtype 6, HFS Global Buffer Section ********************* @H1A*/ 03609000
*    @SPACE;                                                            03610000
*   DECLARE                                                             03611000
*     1 R746GBUF BASED(ADDR(SMF74HDR)+SMF746BO),             /*  @H1A*/ 03612000
*       3 R746GSB  FIXED(16),       /* Size of buffers in buffer pool   03613000
*                                      (in pages)                @H1A*/ 03614000
*       3 R746GNDS FIXED(16),       /* Number of data spaces for        03615000
*                                      buffer pool               @H1A*/ 03616000
*       3 R746GSBP FIXED(32),       /* Size of buffer pool (in pages)   03617000
*                                                                @H1A*/ 03618000
*       3 R746GSBF FIXED(32),       /* Size of permanently fixed        03619000
*                                      buffers in buffer pool (in       03620000
*                                      pages)                    @H1A*/ 03621000
*       3 * FIXED(32),              /* Reserved                  @H1A*/ 03622000
*       3 R746GBF CHAR(8),          /* Number of times a buffer was     03623000
*                                      already fixed prior to an I/O    03624000
*                                      request in buffer pool, (long    03625000
*                                      floating point)           @H1A*/ 03626000
*       3 R746GBNF CHAR(8);         /* Number of times a buffer was     03627000
*                                      not already fixed prior to an    03628000
*                                      I/O request in buffer pool,      03629000
*                                      (long floating point)     @H1A*/ 03630000
*    @SPACE(2);                                                         03631000
*/*** Subtype 6, HFS File System Section *********************** @H1A*/ 03632000
*    @SPACE;                                                            03633000
*   DECLARE                                                             03634000
*     1 R746FSYS BASED(ADDR(SMF74HDR)+SMF746FO),             /*  @H1A*/ 03635000
*       3 R746FSNM CHAR(44),        /* File system name (catologed      03636000
*                                      dataset name)             @H1A*/ 03637000
*       3 R746FSNL FIXED(8),        /* Length of file system name       03638000
*                                                                @H1A*/ 03639000
*       3 R746FSFL BIT(8),          /* Status flags              @H1A*/ 03640000
*         5 R746FNHS BIT(1),        /* No HFS file system statistics    03641000
*                                                                @H1A*/ 03642000
*         5 R746FMTC BIT(1),        /* Mount time changed        @H1A*/ 03643000
*         5 R746FFSM BIT(1),        /* File system now mounted   @H1A*/ 03644000
*         5 * BIT(5),               /* Status flags              @H1A*/ 03645000
*       3 * CHAR(2),                /* Reserved                  @H1A*/ 03646000
*       3 R746FCTM CHAR(8),         /* Current timestamp (when data     03647000
*                                      obtained)                 @H1A*/ 03648000
*       3 R746FMTM CHAR(8),         /* Mount timestamp           @H1A*/ 03649000
*       3 R746FSF FIXED(32),        /* Size of file system (in pages)   03650000
*                                                                @H1A*/ 03651000
*       3 R746FPF FIXED(32),        /* Number of pages internally used  03652000
*                                      by HFS                    @H1A*/ 03653000
*       3 R746FPD FIXED(32),        /* Number of pages used for the     03654000
*                                      attribute directory       @H1A*/ 03655000
*       3 R746FPC FIXED(32),        /* Number of data buffer pages      03656000
*                                      cached by this file system       03657000
*                                                                @H1A*/ 03658000
*       3 R746FMD,                  /* Measurement data          @H1A*/ 03659000
*         5 R746FSFI CHAR(8),       /* Number of sequential file data   03660000
*                                      I/O requests issued, (long       03661000
*                                      floating point)           @H1A*/ 03662000
*         5 R746FRFI CHAR(8),       /* Number of random file data I/O   03663000
*                                      requests issued, (long floating  03664000
*                                      point)                    @H1A*/ 03665000
*         5 R746FMC CHAR(8),        /* Number of times the metadata     03666000
*                                      for a file was found in virtual  03667000
*                                      storage (cache) during file      03668000
*                                      lookup, (long floating point)    03669000
*                                                                @H1A*/ 03670000
*         5 R746FMNC CHAR(8),       /* Number of times the metadata     03671000
*                                      for a file was not found in      03672000
*                                      virtual storage (cache) during   03673000
*                                      file lookup and an index call    03674000
*                                      was necessary which may result   03675000
*                                      in an I/O, (long floating        03676000
*                                      point)                    @H1A*/ 03677000
*         5 R746F1C CHAR(8),        /* Number of times the first page   03678000
*                                      of a data file was requested     03679000
*                                      and found in virtual storage     03680000
*                                      (cache), (long floating point)   03681000
*                                                                @H1A*/ 03682000
*         5 R746F1NC CHAR(8),       /* Number of times the first page   03683000
*                                      of a data file was requested     03684000
*                                      and not found in virtual         03685000
*                                      storage (cache) and a I/O was    03686000
*                                      necessary, (long floating        03687000
*                                      point)                    @H1A*/ 03688000
*         5 R746FINT CHAR(8),       /* Number of index new tops, (long  03689000
*                                      floating point)           @H1A*/ 03690000
*         5 R746FIS CHAR(8),        /* Number of index splits, (long    03691000
*                                      floating point)           @H1A*/ 03692000
*         5 R746FIJ CHAR(8),        /* Number of index joins, (long     03693000
*                                      floating point)           @H1A*/ 03694000
*         5 R746FIRH CHAR(8),       /* Number of index page read hits,  03695000
*                                      (long floating point)     @H1A*/ 03696000
*         5 R746FIRM CHAR(8),       /* Number of index page read        03697000
*                                      misses, (long floating point)    03698000
*                                                                @H1A*/ 03699000
*         5 R746FIWH CHAR(8),       /* Number of index page write hits, 03700000
*                                      (long floating point)     @H1A*/ 03701000
*         5 R746FIWM CHAR(8),       /* Number of index page write       03702000
*                                      misses, (long floating point)    03703000
*                                                                @H1A*/ 03704000
*       3 R746FSRC FIXED(32),       /* Return code from OMVS BPX1PCT    03705000
*                                      for DisplayFSStats command       03706000
*                                                                @H1A*/ 03707000
*       3 R746FSRS FIXED(32);       /* Reason code from OMVS BPX1PCT    03708000
*                                      for DisplayFSStats command       03709000
*                                                                @H1A*/ 03710000
*%IF IFAR747 = 'YES' %THEN %GO TO LDAT747; /* Subtype 7          @I1A*/ 03711000
*%GO TO LEND74;                     /* End of SMF record         @I1A*/ 03712000
*%LDAT747:;                         /* Subtype 7                 @I1A*/ 03713000
*   @SPACE(2);                                                          03714000
*/********************************************************************/ 03715000
*/*                                                                  */ 03716000
*/*            Relocate blocks for subtype 7 - Monitor I             */ 03717000
*/*                   FICON Director Measurement.                    */ 03718000
*/*                                                                  */ 03719000
*/********************************************************************/ 03720000
*    @SPACE(2);                                                         03721000
*/*** Subtype 7, FCD Global Data Section *********************** @I1A*/ 03722000
*    @SPACE;                                                            03723000
*   DECLARE                                                             03724000
*     1 R747GDAT BASED(ADDR(SMF74HDR)+SMF747GO),             /*  @I1A*/ 03725000
*       3 R747GCFL BIT(8),          /* Configuration change flags       03726000
*                                                                @I1A*/ 03727000
*         5 R747GDCA BIT(1),        /* =1, Configuration changed        03728000
*                                      during interval           @I1A*/ 03729000
*         5 R747GIAC BIT(1),        /* =1, Configuration changed since  03730000
*                                      IPL                       @I1A*/ 03731000
*         5 R747GIOD BIT(1),        /* =1, System IPLed via IODF @I1A*/ 03732000
*         5 R747GICV BIT(1),        /* =1, I/O configuration token is   03733000
*                                      valid                     @I1A*/ 03734000
*         5 * BIT(4),               /* Reserved                  @I1A*/ 03735000
*       3 * CHAR(1),                /* Reserved                  @I1A*/ 03736000
*       3 R747GNFD FIXED(16),       /* Number of installed FCD          03737000
*                                      switches                  @I1A*/ 03738000
*       3 R747GINM CHAR(44),        /* IODF name                 @I1A*/ 03739000
*       3 R747GISF CHAR(2),         /* Suffix of IODF name       @I1A*/ 03740000
*       3 R747GICI CHAR(18),        /* IODF creation information @I1A*/ 03741000
*         5 R747GICD CHAR(10),      /* IODF creation date mm/dd/yyyy    03742000
*                                                                @I1A*/ 03743000
*         5 R747GICT CHAR(8),       /* IODF creation time hh.mm.ss      03744000
*                                                                @I1A*/ 03745000
*       3 * CHAR(12);               /* Reserved                  @I1A*/ 03746000
*    @SPACE(2);                                                         03747000
*/*** Subtype 7, FCD Switch Data Section *********************** @I1A*/ 03748000
*    @SPACE;                                                            03749000
*   DECLARE                                                             03750000
*     1 R747SDAT BASED(ADDR(SMF74HDR)+SMF747SO), /* Switch data         03751000
*                                      section                   @I1A*/ 03752000
*       3 R747SDEV FIXED(16),       /* Switch device number      @I1A*/ 03753000
*       3 R747SLSN FIXED(8),        /* Logical switch number     @I1A*/ 03754000
*       3 R747SPFL BIT(8),          /* Switch processing flags   @I1A*/ 03755000
*         5 R747SVAR BIT(1),        /* =1, status of switch has         03756000
*                                      changed                   @I1A*/ 03757000
*         5 R747SNPC BIT(1),        /* =1, number of ports has          03758000
*                                      changed                   @I1A*/ 03759000
*         5 * BIT(6),               /* Reserved                  @I1A*/ 03760000
*       3 R747SND CHAR(32),         /* ND associated with switch        03761000
*                                      device                    @I1A*/ 03762000
*       3 R747SNSP FIXED(16),       /* Number of supported ports for    03763000
*                                      this switch               @I1A*/ 03764000
*       3 R747SNIP FIXED(16),       /* Number of installed ports for    03765000
*                                      this switch               @I1A*/ 03766000
*       3 * CHAR(8);                /* Reserved                  @I1A*/ 03767000
*    @SPACE(2);                                                         03768000
*/*** Subtype 7, FCD Port Data Section ************************* @I1A*/ 03769000
*    @SPACE;                                                            03770000
*   DECLARE                                                             03771000
*     1 R747PDAT BASED(ADDR(SMF74HDR) + SMF747PO), /* Port data         03772000
*                                      section                   @I1A*/ 03773000
*       3 R747PNUM CHAR(1),         /* Port number               @I1A*/ 03774000
*       3 R747PADR CHAR(1),         /* Port address              @I1A*/ 03775000
*       3 R747PTFL BIT(8),          /* Port type flags           @I1A*/ 03776000
*         5 R747PSCU BIT(1),        /* Port type is single CU    @I1A*/ 03777000
*         5 R747PMCU BIT(1),        /* Port type is multiple CU  @I1A*/ 03778000
*         5 R747PCHP BIT(1),        /* Port type is CHPID        @I1A*/ 03779000
*         5 * BIT(5),               /* Reserved                  @I1A*/ 03780000
*       3 R747PSFL BIT(8),          /* Status flags              @I1A*/ 03781000
*         5 R747PTNU BIT(1),        /* Port type is not unique   @I1A*/ 03782000
*         5 R747PINU BIT(1),        /* Id is not unique or not known    03783000
*                                                                @I1A*/ 03784000
*         5 * BIT(2),               /* Reserved                  @I1A*/ 03785000
*         5 R747PVAR BIT(1),        /* Port status changed       @I1A*/ 03786000
*         5 R747PREM BIT(1),        /* Port has been removed     @I1A*/ 03787000
*         5 R747PACT BIT(1),        /* Port has been activated   @I1A*/ 03788000
*         5 R747PNMD BIT(1),        /* This entry doesn't contain       03789000
*                                      measurement data          @I1A*/ 03790000
*       3 R747PCU CHAR(2),          /* Connector id (CU)         @I1A*/ 03791000
*         5 * CHAR(1),              /* Reserved                  @I1A*/ 03792000
*         5 R747PCP CHAR(1),        /* Connector id (channel path)      03793000
*                                                                @I1A*/ 03794000
*       3 R747PCUN FIXED(8),        /* Number of connector CUs   @I1A*/ 03795000
*       3 R747PNPC FIXED(8),        /* Number of connector sections     03796000
*                                                                @I1A*/ 03797000
*       3 R747PXPC FIXED(16),       /* Index of first connector         03798000
*                                      section                   @I1A*/ 03799000
*       3 * CHAR(6),                /* Reserved                  @I1A*/ 03800000
*       3 R747PSTD,                 /* Statistical data      @WA46825*/ 03801990
*         ?ERBFITEM(5                                                   03802980
*             R747PFPT) FLOAT(56);, /* Frame pacing time in units of    03803970
*                                      2.5 micro-seconds (long          03804960
*                                      floating point)       @WA46825*/ 03805950
*         ?ERBFITEM(5                                                   03806940
*             R747PNWR) FLOAT(56);, /* Number of words received         03807930
*                                      (long floating point) @WA46825*/ 03808920
*         ?ERBFITEM(5                                                   03809910
*             R747PNWT) FLOAT(56);, /* Number of words transmitted      03810900
*                                      (long floating point) @WA46825*/ 03811890
*         ?ERBFITEM(5                                                   03812880
*             R747PNFR) FLOAT(56);, /* Number of frames received        03813870
*                                      (long floating point) @WA46825*/ 03814860
*         ?ERBFITEM(5                                                   03815850
*             R747PNFT) FLOAT(56);, /* Number of frames transmitted     03816840
*                                      (long floating point) @WA46825*/ 03817830
*         ?ERBFITEM(5                                                   03818820
*             R747PNER) FLOAT(56);, /* Number of errors (long floating  03819810
*                                      point)                @WA46825*/ 03820800
*       3 * CHAR(8),                /* Reserved              @WA46825*/ 03821790
*       3 * CHAR(0);                /* End of measurements       @I1A*/ 03823000
*    @SPACE(2);                                                         03824000
*/*** Subtype 7, FCD Connector Data Section ******************** @I1A*/ 03825000
*    @SPACE;                                                            03826000
*   DECLARE                                                             03827000
*     1 R747CDAT BASED(ADDR(SMF74HDR) + SMF747CO), /* Port data         03828000
*                                      section                   @I1A*/ 03829000
*       3 R747CNUM CHAR(1),         /* Port number               @I1A*/ 03830000
*       3 R747CADR CHAR(1),         /* Port address              @I1A*/ 03831000
*       3 R747CTFL BIT(8),          /* Port type flags           @I1A*/ 03832000
*         5 R747CSCU BIT(1),        /* Port type is single CU    @I1A*/ 03833000
*         5 R747CMCU BIT(1),        /* Port type is multiple CU  @I1A*/ 03834000
*         5 R747CCHP BIT(1),        /* Port type is CHPID        @I1A*/ 03835000
*         5 * BIT(5),               /* Reserved                  @I1A*/ 03836000
*       3 R747CSFL BIT(8),          /* Status flags              @I1A*/ 03837000
*         5 R747CTNU BIT(1),        /* Port type is not unique   @I1A*/ 03838000
*         5 R747CINU BIT(1),        /* Id is not unique or not known    03839000
*                                                                @I1A*/ 03840000
*         5 * BIT(2),               /* Reserved                  @I1A*/ 03841000
*         5 R747CVAR BIT(1),        /* Port status changed       @I1A*/ 03842000
*         5 R747CREM BIT(1),        /* Port has been removed     @I1A*/ 03843000
*         5 R747CACT BIT(1),        /* Port has been activated   @I1A*/ 03844000
*         5 R747CNMD BIT(1),        /* This entry doesn't contain       03845000
*                                      measurement data          @I1A*/ 03846000
*       3 R747CCU CHAR(2),          /* Connector id (CU)         @I1A*/ 03847000
*         5 * CHAR(1),              /* Reserved                  @I1A*/ 03848000
*         5 R747CCP CHAR(1),        /* Connector id (channel path)      03849000
*                                                                @I1A*/ 03850000
*       3 R747CCUN FIXED(8),        /* Number of connector CUs   @I1A*/ 03851000
*       3 * CHAR(1);                /* Reserved                  @I1A*/ 03852000
*%LEND74:;                                                              03853000
