*/* Bilingual Mapping Macro for SMF Record type 71                      00010003
         MACRO                                                          00020003
         ERBSMF71                                                       00030003
***** START OF SPECIFICATIONS ***************************************** 00040003
*                                                                     * 00050003
*01* Proprietary Statement:                                           * 00060003
         ERBCOPY1 Y1=1983                                        @A1C*/ 00070003
*       ?ERBCOPY1 Y1(1983);                                             00080003
*/*                                                                   * 00090003
*01* Macro Name: ERBSMF71                                             * 00100003
*                                                                     * 00110003
*01* Descriptive Name: SMF Record 71 (Paging Activity Measurement)    * 00120003
*02* Acronym: SMF71                                                   * 00130003
*                                                                     * 00140003
*01* DSECT names: SMF71HDR, SMF71PRO, SMF71PAG                        * 00150003
*                                                                     * 00160003
*01* Component: Resource Measurement Faciliy (27404)                  * 00170003
*                                                                     * 00180003
*01* Eye Catcher. None                                                * 00190003
*01   Offset: N/A                                                     * 00200003
*01   Length: N/A                                                     * 00210003
*                                                                     * 00220003
*01* Storage Attributes:                                              * 00230003
*02*  Subpool: 7                                                      * 00240003
*02*  Key: 8                                                          * 00250003
*02*  Residency:                                                      * 00260003
*02*  Main Storage: N/A                                               * 00270003
*02*  Auxiliary Storage: N/A                                          * 00280003
*02*  Virtual Storage: N/A                                            * 00290003
*                                                                     * 00300003
*01* Function = This macro maps the complete SMF record type 71.      * 00310003
*             The record is created by RMF if Paging Activity         * 00320003
*             measurements are activated.                             * 00330003
*             The record consists of 4 parts:                         * 00340003
*             1. The fixed portion of the SMF header.                 * 00350003
*                This mapping is invoked by calling macro ERBHDR.     * 00360003
*             2. The individual header extension which contains       * 00370003
*                offset/length/number triplets to address the         * 00380003
*                record parts following the RMF product section.      * 00390003
*             3. The RMF product section.                             * 00400003
*                This mapping is invoked by calling macro ERBPRO.     * 00410003
*             4. The RMF data sections:                               * 00420003
*                3.1 The paging data section                          * 00430003
*                3.2 The swap placement data section              @P1A* 00440003
*                                                                     * 00450003
*01* Notes: See below                                                 * 00460003
*          Dependencies: The number of swap placenment data           * 00470003
*          sections depends on the number of SRM swap reasons     @P1A* 00480003
*                                                                     * 00490003
*01* Size:                                                            * 00500003
*                                                                     * 00510003
*     - Common header:    36 bytes                                    * 00520003
*     - Header extension: 16 bytes                                    * 00530003
*     - Product section:  60 bytes                                    * 00540003
*     - Paging data section: 744 bytes                            @D1C* 00550005
*     - Swap Placement section: 407 bytes                         @B1C* 00560003
*       (SMF71NSR times SMF71SWP)                                 @B1C* 00570003
*                                                                     * 00580003
*01* Method of access: See below                                      * 00590003
*                                                                     * 00600003
*       BAL: ERBSMF71                                                 * 00610003
*                                                                     * 00620003
*       PL/X: %INCLUDE SYSLIB(ERBSMF71) semicolon                     * 00630003
*                                                                     * 00640003
*01* Pointed to by: SMF71PTR                                          * 00650003
*                                                                     * 00660003
*01* Serialization. None                                              * 00670003
*                                                                     * 00680003
*01* Created by: ERBMFDPP                                             * 00690003
*                                                                     * 00700003
*01* Deleted by: ERBMFRGM                                             * 00710003
*                                                                     * 00720003
*01* Module-type: BILINGUAL MAPPING MACRO                             * 00730003
*                                                                     * 00740003
*01* Status: HRM5520                                              @D2C* 00750003
*                                                                     * 00760003
*01* Frequency: 1                                                     * 00770003
*                                                                     * 00780003
*01* Dependencies: None                                               * 00790003
*                                                                     * 00800003
*01* Distribution Library: ARMFMAC1                               @B1C* 00810003
*                                                                     * 00820003
*01* Change Activity: See below                                       * 00830003
*                                                                     * 00840003
* $N0=SMFFORMT,HRM3102,,FRS: NEW FOR RMF 3.1                      @N0A* 00850003
* $P1=ES,HRM3302,,CIH: SP2.2 EXTENDED STORE                       @P1A* 00860003
* $Q1=MISC,HRM3402,,WEY: CSA FIXED FRAMES COUNT INTERFACE         @Q1A* 00870003
* REMOVE ASTERISKS SO THAT ERBPRO AND ERBHDR ARE CALLED       @YA01276* 00880003
*   $W1=SP310,HRM4410,,SOT: MVS SP 3.1.0 SUPPORT                  @W1A* 00890003
*   $W2=RCLS,HRM4410,,SOT: RMF collector service                  @W2A* 00900003
* $W3=VIOSPE,HRM4410,,PAE: SUPPORT FOR VIO TO EXT STORAGE     @YA09186* 00910003
* $W4=SP310E,JRM4411,,PAE: MVS SP 3.1.0E Support                  @W4A* 00920003
* SHR: Include FLPA/EFLPA frames and real frame zero          @YA34458* 00930003
* $W4=SP310E,JRM4411,,PAE: MVS SP 3.1.0E Support                  @W4A* 00940003
* $A1=APPC,JRM4421,,BAJU: APPC tolerating support                 @A1A* 00950003
* $A2=WSET,JRM4421,,JUR: Working set management/block paging      @A2A* 00960003
* $A9=PGRC,JRM4422,,DPN: Page Reclaim data fields deleted         @A9A* 00970003
* $B1=R430,HRM4430,,THE: Distribution lib in prolog               @B1A* 00980003
* $B2=R430,HRM4430,,WMH: Page Movement Time - CPU timer units     @B2A* 00990003
* $B3=OMVS,HRM4430,,RPT: OPEN/MVS Toleration Support              @B3A* 01000003
* $C1=MISC,HRM4440,,PFU: RSM Block Paging support enhancement     @C1A* 01010003
*  JS:Add SMF71PRC Field again to be available for PP Summary @YA62328* 01020003
*     Reports of Pre-421 SMF Records                                  * 01030003
* $C2=MISC,HRM5510,,VOH: Skip ASM part in PL/X (PTM KRN0041)      @C2A* 01040003
* $D1=CAP,HRM5520,,JKE: Captured Storage support                  @D1A* 01050003
* $D2=R520,HRM5520,,GBO: Cleanup of PADI-inconsistencies          @D2A* 01050103
* $F1=STOR,HRM6604,,AJU: New storage fields                       @F1A* 01050211
* $I1=BIT64,HRM7703,,VTH: 64 Bit real support                     @I1A* 01050312
*                                                                     * 01050412
****** END OF SPECIFICATIONS *****************************************/ 01060004
*        %GOTO PLS71;                                          /*@C2A*/ 01090003
         SPACE 3                                                        01100003
**********************  COMMON SMF HEADER  **************************** 01110003
         ERBHDR 71                                                      01120003
         SPACE 3                                                        01130003
**********************  INDIVIDUAL HEADER EXTENSION  ****************** 01140003
         SPACE                                                          01150003
SMF71HDX DS    0CL16    HEADER EXTENSION                          @D2A  01151003
SMF71PDS DS    BL4      OFFSET TO PAGING DATA SECTION                   01160003
SMF71PDL DS    BL2      LENGTH OF PAGING DATA SECTION                   01170003
SMF71PDN DS    BL2      NUMBER OF PAGING DATA SECTION                   01180003
SMF71SWS DS    BL4      OFFSET TO SWAP PLACEMENT DATA SECTION     @P1A  01190003
SMF71SWL DS    BL2      LENGTH OF SWAP PLACEMENT DATA SECTION     @P1A  01200003
SMF71SWN DS    BL2      NUMBER OF SWAP PLACEMENT DATA SECTION     @P1A  01210003
         SPACE 3                                                        01220003
**********************  COMMON RMF PRODUCT SECTION  ******************* 01230003
         ERBPRO 71                                                      01240003
         SPACE 3                                                        01250003
**********************  PAGING DATA SECTION  ************************** 01260003
SMF71PAG DSECT                                                          01270003
SMF71PIN DS    BL4      PAGE-INS EXCLUDING VIO AND SWAP                 01280003
SMF71POT DS    BL4      PAGE-OUTS EXCLUDING VIO AND SWAP                01290003
SMF71PRC DS    BL4      PAGE RECLAIMS EXCLUDING VIO           @YA62328  01300003
*                         ZERO VALUE FOR 421 AND HIGHER       @YA62328  01310003
SMF71SSQ DS    BL4      # OF MEMORY SWAP SEQUENCES                      01320003
SMF71SIN DS    BL4      SWAP-IN PAGES                                   01330003
SMF71SOT DS    BL4      SWAP-OUT PAGES                                  01340003
SMF71VIN DS    BL4      VIO PAGE-INS                                    01350003
SMF71VOT DS    BL4      VIO PAGE-OUTS                                   01360003
         DS    BL4      RESERVED                                  @A9C  01370003
SMF71SNI DS    BL4      SYSTEM PAGABLE AREAS NON-VIO PAGE-INS           01380003
SMF71SNO DS    BL4      SPA NON-VIO PAGE-OUTS                           01390003
         DS    BL4      RESERVED                                  @A9C  01400003
SMF71LNI DS    BL4      LPA PAGE-INS,NON-VIO AND NON-SWAP               01410003
         DS    BL4      RESERVED                                  @A9C  01420003
SMF71AFC DS    BL4      MAIN STORAGE AVAILABLE FRAME COUNT              01430003
SMF71TFC DS    BL4      MAIN STORAGE TOTAL FRAME COUNT                  01440003
SMF71TSC DS    BL4      AUX TOTAL SLOT COUNT                            01450003
SMF71DSC DS    BL4      AUX DATA SET SLOT COUNT                         01460003
SMF71VSC DS    BL4      AUX VIRTUAL MEMORY SLOT COUNT                   01470003
SMF71NSC DS    BL4      AUX UNALLOCATED SLOT COUNT                      01480003
SMF71FIN DS    BL4      NUMBER FRAMES IN NUCLEUS                        01490003
SMF71MNF DS    BL4      MIN AVAILABLE PAGE FRAMES                       01500003
SMF71MXF DS    BL4      MAX AVAILABLE PAGE FRAMES                       01510003
SMF71AVF DS    BL4      AVG AVAILABLE PAGE FRAMES                       01520003
SMF71MNP DS    BL4      MIN CSA PAGEABLE FRAMES                         01530003
SMF71MXP DS    BL4      MAX CSA PAGEABLE FRAMES                         01540003
SMF71AVP DS    BL4      AVG CSA PAGEABLE FRAMES                         01550003
SMF71MNS DS    BL4      MIN ADDR SPACE PAGEABLE FRAMES                  01560003
SMF71MXS DS    BL4      MAX ADDR SPACE PAGEABLE FRAMES                  01570003
SMF71AVS DS    BL4      AVG ADDR SPACE PAGEABLE FRAMES                  01580003
SMF71MNT DS    BL4      MIN TOTAL PAGEABLE FRAMES                       01590003
SMF71MXT DS    BL4      MAX TOTAL PAGEABLE FRAMES                       01600003
SMF71AVT DS    BL4      AVG TOTAL PAGEABLE FRAMES                       01610003
SMF71MNQ DS    BL4      MIN SQA FIXED FRAMES                            01620003
SMF71MXQ DS    BL4      MAX SQA FIXED FRAMES                            01630003
SMF71AVQ DS    BL4      AVG SQA FIXED FRAMES                            01640003
SMF71MNC DS    BL4      MIN CSA FIXED FRAMES                            01650003
SMF71MXC DS    BL4      MAX CSA FIXED FRAMES                            01660003
SMF71AVC DS    BL4      AVG CSA FIXED FRAMES                            01670003
SMF71MNR DS    BL4      MIN ADDRESS SPACE FIXED FRAMES (W/O LSQA)       01680003
SMF71MXR DS    BL4      MAX ADDRESS SPACE FIXED FRAMES (W/O LSQA)       01690003
SMF71AVR DS    BL4      AVG ADDRESS SPACE FIXED FRAMES (W/O LSQA)       01700003
SMF71MNX DS    BL4      MIN TOTAL FIXED FRAMES                          01710003
SMF71MXX DS    BL4      MAX TOTAL FIXED FRAMES                          01720003
SMF71AVX DS    BL4      AVG TOTAL FIXED FRAMES                          01730003
SMF71MNU DS    BL4      MIN AVAILABLE USER AUXILIARY SLOTS              01740003
SMF71MXU DS    BL4      MAX AVAILABLE USER AUXILIARY SLOTS              01750003
SMF71AVU DS    BL4      AVG AVAILABLE USER AUXILIARY SLOTS              01760003
SMF71MNV DS    BL4      MIN USER VIO AUXILIARY SLOTS                    01770003
SMF71MXV DS    BL4      MAX USER VIO AUXILIARY SLOTS                    01780003
SMF71AVV DS    BL4      AVG USER VIO AUXILIARY SLOTS                    01790003
SMF71MNM DS    BL4      MIN USER MEMORY AUXILIARY SLOTS                 01800003
SMF71MXM DS    BL4      MAX USER MEMORY AUXILIARY SLOTS                 01810003
SMF71AVM DS    BL4      AVG USER MEMORY AUXILIARY SLOTS                 01820003
SMF71MNB DS    BL4      MINIMUM UNAVAILABLE(BAD) USER SLOTS             01830003
SMF71MXB DS    BL4      MAXIMUM UNAVAILABLE(BAD) USER SLOTS             01840003
SMF71AVB DS    BL4      AVERAGE UNAVAILABLE(BAD) USER SLOTS             01850003
SMF71MNA DS    BL4      MIN TOTAL USER AUXILIARY SLOTS                  01860003
SMF71MXA DS    BL4      MAX TOTAL USER AUXILIARY SLOTS                  01870003
SMF71IS1 DS    BL2      INVALID SAMPLE TO BE SKIPPED BECAUSE THERE WERE 01880003
*                       ERRORS AT THE RSM FIXED FRAMES COUNTING         01890003
*                       INTERFACE (IARXCNTF)                      @Q1C  01900003
SMF71IS2 DS    BL2      INVALID SAMPLE TO BE SKIPPED BECAUSE THERE WERE 01910003
*                       NEGATIVE VALUES AT THE CALULATION OF THE        01920003
*                       FIXED CSA FRAMES COUNT                    @Q1C  01930003
SMF71VME DS    BL4      TOTAL VIO PAGES WRITTEN TO EXT STORAGE @YA09186 01940003
SMF71VMG DS    BL4      TOTAL VIO PAGES MIGRATED FROM EXT STORAGE       01950003
*                                                              @YA09186 01960003
SMF71VRE DS    BL4      TOTAL VIO PAGES READ FROM EXT STORAGE  @YA09186 01970003
SMF71MVE DS    BL4      Min VIO pages in Exp Storage              @W4C  01980003
SMF71XVE DS    BL4      Max VIO pages in Exp Storage              @W4C  01990003
SMF71AVE DS    BL4      Avg VIO pages in Exp Storage              @W4C  02000003
SMF71RSS DS    BL4      NUMBER REAL STORAGE SWAPS                       02010003
*                       NOT USED AS OF RMF330                     @P1C  02020003
SMF71EXS DS    BL4      NUMBER OF EXCHANGE SWAPS BASED                  02030003
*                       ON RECOMMENDATION VALUE                         02040003
*                       NOT USED AS OF RMF330                     @P1C  02050003
SMF71EES DS    BL4      NUMBER OF ENQUEUE EXCHANGE SWAPS                02060003
*                       NOT USED AS OF RMF330                     @P1C  02070003
SMF71TOS DS    BL4      NO. TERMINAL WAITS (OUTPUT) CANDIDATES          02080003
*                       NOT USED AS OF RMF330                     @P1C  02090003
SMF71TXS DS    BL4      NUMBER OF TRANSITION SWAPS                      02100003
*                       NOT USED AS OF RMF330                     @P1C  02110003
SMF71LGS DS    BL4      NUMBER OF LOGICAL SWAPS                         02120003
*                       NOT USED AS OF RMF330                     @P1C  02130003
SMF71LFS DS    BL4      NUMBER OF DETECTED LONG THINK TIME SWAPS        02140003
*                       NOT USED AS OF RMF330                     @P1C  02150003
SMF71LSS DS    BL4      NO. OF LOGICAL SWAPS OUTSTANDING AT START       02160003
*                       OF INTERVAL                                     02170003
*                       NOT USED AS OF RMF330                     @P1C  02180003
SMF71LSE DS    BL4      NO. OF LOGICAL SWAPS OUTSTANDING AT END         02190003
*                       OF INTERVAL                                     02200003
*                       NOT USED AS OF RMF330                     @P1C  02210003
SMF71NLP DS    BL4      Min total LPA frames                   @YA34458 02220003
SMF71XLP DS    BL4      Max total LPA frames                   @YA34458 02230003
SMF71ALP DS    BL4      Avg total LPA frames                   @YA34458 02240003
SMF71NLF DS    BL4      MIN LPA FIXED FRAMES                            02250003
SMF71XLF DS    BL4      MAX LPA FIXED FRAMES                            02260003
SMF71ALF DS    BL4      AVG LPA FIXED FRAMES                            02270003
SMF71NLS DS    BL4      MIN LSQA FIXED FRAMES                           02280003
SMF71XLS DS    BL4      MAX LSQA FIXED FRAMES                           02290003
SMF71ALS DS    BL4      AVG LSQA FIXED FRAMES                           02300003
SMF71MNL DS    BL4      MIN.NUMBER OF FIXED FRAMES BELOW 16 MEG         02310003
SMF71MXL DS    BL4      MAX.NUMBER OF FIXED FRAMES BELOW 16 MEG         02320003
SMF71AVL DS    BL4      AVG.NUMBER OF FIXED FRAMES BELOW 16 MEG         02330003
SMF71PMV DS    BL4      TOTAL PAGE MOVES                                02340003
SMF71OPT DS    CL8      SRM OPT MEMBER NAME                       @P1A  02350003
SMF71PES DS    BL4      TOTAL PAGE MOVES TO ES                    @P1A  02360003
SMF71PEA DS    BL4      TOTAL MIGRATIONS ES TO AUX                @P1A  02370003
SMF71AMN DS    BL4      MIN ES SLOTS AVAILABLE                    @P1A  02380003
SMF71AMX DS    BL4      MAX ES SLOTS AVAILABLE                    @P1A  02390003
SMF71ASA DS    BL4      AVG ES SLOTS AVAILABLE                    @P1A  02400003
SMF71LIC DS    BL4      MIN VALUE HIGH UIC                        @P1A  02410003
SMF71HIC DS    BL4      MAX VALUE HIGH UIC                        @P1A  02420003
SMF71ACA DS    BL4      AVG VALUE HIGH UIC                        @P1A  02430003
*                       SCALE FACTOR IS -1                        @P1A  02440003
SMF71LMA DS    BL4      MIN VALUE MIGRATION AGE                   @P1A  02450003
SMF71HMA DS    BL4      MAX VALUE MIGRATION AGE                   @P1A  02460003
SMF71AMA DS    BL4      AVG VALUE MIGRATION AGE                   @P1A  02470003
*                       SCALE FACTOR IS -1                        @P1A  02480003
SMF71CF  DS    BL4      NUMBER ES SLOTS INSTALLED                 @P1A  02490003
SMF71OLE DS    BL4      NUMBER ES SLOTS ONLINE AT END OF INTERVAL @P1A  02500003
SMF71RES DS    BL4      total pages read from ES - from RCEESREA  @W1A  02510003
SMF71MSR DS    BL4      min SQA pages in real stor                      02520003
*                           CTSQAF + CTRSQAF                      @W1A  02530003
SMF71XSR DS    BL4      max SQA pages in real stor                @W1A  02540003
SMF71ASR DS    BL4      avg SQA pages in real stor                @W1A  02550003
SMF71MSE DS    BL4      min SQA pages in ext. stor                      02560003
*                           CTTSQAF - CTRSQAF                     @W1A  02570003
SMF71XSE DS    BL4      max SQA pages in ext. stor                @W1A  02580003
SMF71ASE DS    BL4      avg SQA pages in ext. stor                @W1A  02590003
SMF71LME DS    BL4      min LPA pages in ext. stor                      02600003
*                           CTPLPAF - real                        @W1A  02610003
SMF71LXE DS    BL4      max LPA pages in ext. stor                @W1A  02620003
SMF71LAE DS    BL4      avg LPA pages in ext. stor                @W1A  02630003
SMF71CME DS    BL4      min CSA pages in ext. stor                      02640003
*                           CNTFTCSA - real                       @W1A  02650003
SMF71CXE DS    BL4      max CSA pages in ext. stor                @W1A  02660003
SMF71CAE DS    BL4      avg CSA pages in ext. stor                @W1A  02670003
SMF71MLR DS    BL4      min LSQA pages in real stor                     02680003
*                           CTLSQAF + CTRLSQAF                    @W1A  02690003
SMF71XLR DS    BL4      max LSQA pages in real stor               @W1A  02700003
SMF71ALR DS    BL4      avg LSQA pages in real stor               @W1A  02710003
SMF71MLE DS    BL4      min LSQA pages in ext. stor                     02720003
*                           CTTLSQAF - CTRLSQAF                   @W1A  02730003
SMF71XLE DS    BL4      max LSQA pages in ext. stor               @W1A  02740003
SMF71ALE DS    BL4      avg LSQA pages in ext. stor               @W1A  02750003
SMF71RME DS    BL4      min REG+SWA pages in ext. stor                  02760003
*                           - from RAXESCT                        @W1A  02770003
SMF71RXE DS    BL4      max REG+SWA pages in ext. stor            @W1A  02780003
SMF71RAE DS    BL4      avg REG+SWA pages in ext. stor            @W1A  02790003
SMF71ISC DS    BL4      no of invalid samples ret. from CLS       @W2A  02800003
SMF71HME DS    BL4      Total hiperspace pages written to Exp           02810003
*                        Storage                                  @W4A  02820003
SMF71HRE DS    BL4      Total hiperspace pages read from Exp            02830003
*                        Storage                                  @W4A  02840003
SMF71HMG DS    BL4      Total hiperspace pages migrated from Exp        02850003
*                        Storage to Auxiliary Storage             @W4A  02860003
SMF71HOT DS    BL4      Number of hiperspace page-outs            @W4A  02870003
SMF71HIN DS    BL4      Number of hiperspace page-ins             @W4A  02880003
SMF71MHE DS    BL4      min hiperspace pages in Exp Storage       @W4A  02890003
SMF71XHE DS    BL4      max hiperspace pages in Exp Storage       @W4A  02900003
SMF71AHE DS    BL4      avg hiperspace pages in Exp Storage       @W4A  02910003
SMF71BLP DS    BL4      blocked pages paged in                    @A2A  02920003
SMF71BLK DS    BL4      number of blocks paged in                 @A2A  02930003
SMF71PWS DS    BL4      primary work set pages migrated from ES   @A2A  02940003
SMF71FNM DS    BL4      ES frames freed without migration         @A2A  02950003
SMF71PMT DS    CL8      Steal timer - elapsed time spent in prefered    02960003
*                        steal - in CPU Timer units               @B2A  02970003
SMF71SBI DS    BL4      System Pageable Areas Block Page-Ins      @C1A  02980003
SMF71LBI DS    BL4      LPA Block Page Page-Ins                   @C1A  02990003
SMF71ASI DS    CL8      Number of page-ins from auxiliary storage       03000007
*                       for shared page groups                          03010003
*                       Format: long floating point               @D1A  03020003
SMF71ASO DS    CL8      Number of page-outs to auxiliary storage        03030007
*                       for shared page groups                          03040003
*                       Format: long floating point               @D1A  03050003
SMF71ESI DS    CL8      Number of page-ins from expanded storage        03060007
*                       for shared page groups                          03070003
*                       Format: long floating point               @D1A  03080003
SMF71ESO DS    CL8      Number of page-outs to expanded storage         03090007
*                       for shared page groups                          03100003
*                       Format: long floating point               @D1A  03110003
SMF71MGT DS    CL8      Minimum number of shared page groups in         03120007
*                       the system                                      03130003
*                       Format: long floating point               @D1A  03140003
SMF71XGT DS    CL8      Maximum number of shared page groups in         03150007
*                       the system                                      03160003
*                       Format: long floating point               @D1A  03170003
SMF71AGT DS    CL8      Average number of shared page groups in         03180007
*                       the system                                      03190003
*                       Format: long floating point               @D1A  03200003
SMF71MGC DS    CL8      Minimum number of shared page groups in         03210007
*                       central storage                                 03220003
*                       Format: long floating point               @D1A  03230003
SMF71XGC DS    CL8      Maximum number of shared page groups in         03240007
*                       central storage                                 03250003
*                       Format: long floating point               @D1A  03260003
SMF71AGC DS    CL8      Average number of shared page groups in         03270007
*                       central storage                                 03280003
*                       Format: long floating point               @D1A  03290003
SMF71MGE DS    CL8      Minimum number of shared page groups in         03300007
*                       expanded storage                                03310003
*                       Format: long floating point               @D1A  03320003
SMF71XGE DS    CL8      Maximum number of shared page groups in         03330007
*                       expanded storage                                03340003
*                       Format: long floating point               @D1A  03350003
SMF71AGE DS    CL8      Average number of shared page groups in         03360007
*                       expanded storage                                03370003
*                       Format: long floating point               @D1A  03380003
SMF71MGA DS    CL8      Minimum number of auxiliary slots in use        03390007
*                       for shared page groups                          03400003
*                       Format: long floating point               @D1A  03410003
SMF71XGA DS    CL8      Maximum number of auxiliary slots in use        03420007
*                       for shared page groups                          03430003
*                       Format: long floating point               @D1A  03440003
SMF71AGA DS    CL8      Average number of auxiliary slots in use        03450007
*                       for shared page groups                          03460003
*                       Format: long floating point               @D1A  03470003
SMF71MGF DS    CL8      Minimum number of shared page groups            03480007
*                       fixed in the system                             03490003
*                       Format: long floating point               @D1A  03500003
SMF71XGF DS    CL8      Maximum number of shared page groups            03510007
*                       fixed in the system                             03520003
*                       Format: long floating point               @D1A  03530003
SMF71AGF DS    CL8      Average number of shared page groups            03540007
*                       fixed in the system                             03550003
*                       Format: long floating point               @D1A  03560003
SMF71MGB DS    CL8      Minimum number of shared page groups            03570007
*                       fixed below 16MB in the system                  03580003
*                       Format: long floating point               @D1A  03590003
SMF71XGB DS    CL8      Maximum number of shared page groups            03600007
*                       fixed below 16MB in the system                  03610003
*                       Format: long floating point               @D1A  03620003
SMF71AGB DS    CL8      Average number of shared page groups            03630007
*                       fixed below 16MB in the system                  03640003
*                       Format: long floating point               @D1A  03650003
SMF71CAM DS    CL8      Minimum number of available central             03651008
*                       storage frames                                  03652008
*                       Format: long floating point               @F1A  03653008
SMF71CAX DS    CL8      Maximum number of available central             03654009
*                       storage frames                                  03655009
*                       Format: long floating point               @F1A  03656009
SMF71CAA DS    CL8      Average number of available central             03657009
*                       storage frames                                  03658009
*                       (rceafc-max(rceafcok,mccafcok*mccdefam))        03658109
*                       Format: long floating point               @F1A  03659009
SMF71CLM DS    CL8      Minimum number of low impact central            03659109
*                       storage frames                                  03659209
*                       Format: long floating point               @F1A  03659309
SMF71CLX DS    CL8      Maximum number of low impact central            03659409
*                       storage frames                                  03659509
*                       Format: long floating point               @F1A  03659609
SMF71CLA DS    CL8      Average number of low impact central            03659709
*                       storage frames                                  03659809
*                       Format: long floating point               @F1A  03660009
SMF71CMM DS    CL8      Minimum number of medium impact central         03660109
*                       storage frames                                  03660209
*                       Format: long floating point               @F1A  03660309
SMF71CMX DS    CL8      Maximum number of medium impact central         03660409
*                       storage frames                                  03660509
*                       Format: long floating point               @F1A  03660609
SMF71CMA DS    CL8      Average number of medium impact central         03660709
*                       storage frames                                  03660809
*                       Format: long floating point               @F1A  03660909
SMF71CHM DS    CL8      Minimum number of high impact central           03661009
*                       storage frames                                  03661109
*                       Format: long floating point               @F1A  03661209
SMF71CHX DS    CL8      Maximum number of high impact central           03661309
*                       storage frames                                  03661409
*                       Format: long floating point               @F1A  03661509
SMF71CHA DS    CL8      Average number of high impact central           03661609
*                       storage frames                                  03661709
*                       Format: long floating point               @F1A  03661809
SMF71EAM DS    CL8      Minimum number of available expanded            03661909
*                       storage frames, only valid in WLM Goal mode     03662009
*                       Format: long floating point               @F1A  03662109
SMF71EAX DS    CL8      Maximum number of available expanded            03662209
*                       storage frames, only valid in WLM Goal mode     03662309
*                       Format: long floating point               @F1A  03662409
SMF71EAA DS    CL8      Average number of available expanded            03662509
*                       storage frames, only valid in WLM Goal mode     03662609
*                       (rceaec-rceaecok)                               03662709
*                       Format: long floating point               @F1A  03662809
SMF71ELM DS    CL8      Minimum number of low impact expanded           03662909
*                       storage frames, only valid in WLM GOAL mode     03663009
*                       Format: long floating point               @F1A  03663109
SMF71ELX DS    CL8      Maximum number of low impact expanded           03663209
*                       storage frames, only valid in WLM Goal mode     03663309
*                       Format: long floating point               @F1A  03663409
SMF71ELA DS    CL8      Average number of low impact expanded           03663509
*                       storage frames, only valid in WLM Goal mode     03663609
*                       Format: long floating point               @F1A  03663709
SMF71EMM DS    CL8      Minimum number of medium impact expanded        03663809
*                       storage frames, only valid in WLM Goal mode     03663909
*                       Format: long floating point               @F1A  03664009
SMF71EMX DS    CL8      Maximum number of medium impact expanded        03664109
*                       storage frames, only valid in WLM Goal mode     03664209
*                       Format: long floating point               @F1A  03664309
SMF71EMA DS    CL8      Average number of medium impact expanded        03664409
*                       storage frames, only valid in WLM Goal mode     03664509
*                       Format: long floating point               @F1A  03664609
SMF71EHM DS    CL8      Minimum number of high impact expanded          03664709
*                       storage frames, only valid in WLM Goal mode     03664809
*                       Format: long floating point               @F1A  03664909
SMF71EHX DS    CL8      Maximum number of high impact expanded          03665009
*                       storage frames, only valid in WLM Goal mode     03665109
*                       Format: long floating point               @F1A  03665209
SMF71EHA DS    CL8      Average number of high impact expanded          03665309
*                       storage frames, only valid in WLM Goal mode     03665409
*                       Format: long floating point               @F1A  03665509
SMF71MVI DS    CL8      Minimum number of VIO pages in real             03665615
*                       storage (ESAME only)                            03665712
*                       Format: long floating point               @I1A  03665815
SMF71XVI DS    CL8      Maximum number of VIO pages in real             03665915
*                       storage (ESAME only)                            03666014
*                       Format: long floating point               @I1A  03666115
SMF71AVI DS    CL8      Average number of VIO pages in real             03666215
*                       storage (ESAME only)                            03666312
*                       Format: long floating point               @I1A  03666415
SMF71MHI DS    CL8      Minimum number of hiperspace pages in real      03666515
*                       storage (ESAME only)                            03666612
*                       Format: long floating point               @I1A  03666715
SMF71XHI DS    CL8      Maximum number of hiperspace pages in real      03666815
*                       storage (ESAME only)                            03666912
*                       Format: long floating point               @I1A  03667015
SMF71AHI DS    CL8      Average number of hiperspace pages in real      03667115
*                       storage (ESAME only)                            03667212
*                       Format: long floating point               @I1A  03667315
SMF71VWS DS    CL8      Number of VIO pages written to real             03667415
*                       storage (ESAME only)                            03667512
*                       Format: long floating point               @I1A  03667615
SMF71VRS DS    CL8      Number of VIO pages read from real              03667715
*                       storage (ESAME only)                            03667812
*                       Format: long floating point               @I1A  03667915
SMF71HWS DS    CL8      Number of hiperpace pages written to real       03668015
*                       storage (ESAME only)                            03668112
*                       Format: long floating point               @I1A  03668215
SMF71HRS DS    CL8      Number of hiperpace pages read from real        03668315
*                       storage (ESAME only)                            03668412
*                       Format: long floating point               @I1A  03668515
SMF71MFB DS    CL8      Min number of pages fixed between 16M and 2G    03668615
*                       (ESAME only)                                    03668712
*                       Format: long floating point               @I1A  03668815
SMF71XFB DS    CL8      Max number of pages fixed between 16M and 2G    03668915
*                       (ESAME only)                                    03669014
*                       Format: long floating point               @I1A  03669115
SMF71AFB DS    CL8      Avg number of pages fixed between 16M and 2G    03669216
*                       (ESAME only)                                    03669314
*                       Format: long floating point               @I1A  03669415
         SPACE 3                                                  @P1A  03670109
******************** SWAP PLACEMENT DATA SECTION  ********************* 03671003
* THE SWAP PLACEMENT DATA SECTION REPRESENTS A MATRIX OF SWAP         * 03680003
* PLACEMENT COUNTERS BY SWAP REASONS, WHEREAS THE SWAP REASONS        * 03690003
* ARE  :                                                              * 03700003
*    SWAP REASON 1  -  TERMINAL OUTPUT WAIT                           * 03710003
*    SWAP REASON 2  -  TERMINAL INPUT WAIT                            * 03720003
*    SWAP REASON 3  -  LONG WAIT                                      * 03730003
*    SWAP REASON 4  -  AUXILIARY STORAGE SHORTAGE                     * 03740003
*    SWAP REASON 5  -  REAL PAGEABLE STORAGE SHORTAGE                 * 03750003
*    SWAP REASON 6  -  DETECTED WAIT                                  * 03760003
*    SWAP REASON 7  -  REQUESTED (REQSWAP SYSEVENT)                   * 03770003
*    SWAP REASON 8  -  ENQUEUE EXCHANGE                               * 03780003
*    SWAP REASON 9  -  EXCHANGE ON RECOMMENDATION VALUE               * 03790003
*    SWAP REASON 10 -  UNILATERAL                                     * 03800003
*    SWAP REASON 11 -  TRANSITION TO NON-SWAPPABLE                    * 03810003
*    SWAP REASON 12 -  IMPROVE CENTRAL STORAGE USAGE              @A2A* 03820003
*    SWAP REASON 13 -  IMPROVE SYSTEM PAGING RATE                 @A2A* 03830003
*    SWAP REASON 14 -  MAKE ROOM TO SWAP IN AN OUT TOO LONG USER  @A2A* 03840003
*    SWAP REASON 15 -  APPC WAIT                                  @A1A* 03850003
*    SWAP REASON 16 -  OMVS INPUT WAIT                            @B3A* 03860003
*    SWAP REASON 17 -  OMVS OUTPUT WAIT                           @B3A* 03870003
*                                                                 @P1A* 03880003
         SPACE 3                                                        03890003
SMF71NSR EQU   17       Number of swap reasons for                      03900003
*                       the current release. If it does                 03910003
*                       not match the number of swap                    03920003
*                       sections below (in Post Proc.),                 03930003
*                       record has to be expanded                 @B3C  03940003
SMF71SWP DSECT                                                    @P1A  03950003
SMF71TOT DS    BL4      NUMBER OF TOTAL SWAP CANDIDATES           @P1A  03960003
SMF71AXD DS    BL4      PHYSICAL SWAPS DIRECTLY TO AUX STORAGE    @P1A  03970003
SMF71LES DS    BL4      OF LOGICALLY SWAPPED, TOTAL NUMBER PHYSI-       03980003
*                       CALLY SWAPPED TO EXTENDED STORAGE         @P1A  03990003
SMF71LAX DS    BL4      OF LOGICALLY SWAPPED, TOTAL NUMBER PHYSI-       04000003
*                       CALLY SWAPPED TO AUX STORAGE              @P1A  04010003
SMF71ESD DS    BL4      PHYSICAL SWAPS DIRECTLY TO EXTENDED STOR  @P1A  04020003
SMF71MIG DS    BL4      NUMBER OF PHYSICALLY SWAPPED MIGRATED     @P1A  04030003
*                       FROM EXTENDED TO AUX STORAGE              @P1A  04040003
         MEND  ,                                                        04050003
*                       */                                              04060003
*%PLS71: ;                                                              04070003
*                                                             /*1@C2D*/ 04080003
*    /* COMMON SMF HEADER */                                            04090003
*?ERBHDR TYPE(71) ATTRIBUT(BASED(SMF71PTR));                            04100003
*    /* INDIVIDUAL HEADER EXTENSION */                                  04110003
*      2 SMF71HDX,                /* HEADER EXTENTION                */ 04120003
*        3 SMF71PDS FIXED(31),    /* OFFSET TO PAGING DATA SECTION   */ 04130003
*        3 SMF71PDL FIXED(15),    /* LENGTH OF PAGING DATA SECTION   */ 04140003
*        3 SMF71PDN FIXED(15),    /* NUMBER OF PAGING DATA SECTIONS  */ 04150003
*        3 SMF71SWS FIXED(31),    /* OFFSET TO SWAP PLACEMENT DATA      04160003
*                                    SECTION                     @P1A*/ 04170003
*        3 SMF71SWL FIXED(15),    /* LENGTH OF SWAP PLACEMENT DATA      04180003
*                                    SECTION                     @P1A*/ 04190003
*        3 SMF71SWN FIXED(15);    /* NUMBER OF SWAP PLACEMENT DATA      04200003
*                                    SECTION                     @P1A*/ 04210003
*@SPACE;                                                                04220003
*    /* COMMON RMF PRODUCT SECTION */                                   04230003
*?ERBPRO TYPE(71) ATTRIBUT(BASED(ADDR(SMF71HDR)+SMF71PRS));             04240003
*    /* PAGING DATA SECTION */                                          04250003
*   DCL 1 SMF71PAG BASED(ADDR(SMF71HDR)+SMF71PDS),                      04260003
*        3 SMF71PIN FIXED(32),    /* PAGE-INS EXCLUDING VIO AND SWAP    04270003
*             (LPA,CSA, AND ADDRESS SPACE PAGE INS - NON VIO,           04280003
*             NON-SWAP, NON-BLOCK) - FROM RCETOTPI               @A2C*/ 04290003
*        3 SMF71POT FIXED(32),    /* PAGE-OUTS EXCLUDING VIO AND SWAP   04300003
*             (LPA, CSA, AND ADDRESS SPACE PAGE OUTS - NON VIO,         04310003
*                                          NON SWAP) - FROM RCETOTPO */ 04320003
*        3 SMF71PRC FIXED(32),    /* PAGE RECLAIMS EXCLUDING VIO        04330003
*                               ZERO VALUE FOR 421 AND LATER @YA62328*/ 04340003
*        3 SMF71SSQ FIXED(32),    /* # OF MEMORY SWAP SEQUENCES      */ 04350003
*        3 SMF71SIN FIXED(32),    /* SWAP-IN PAGES (ADDRESS SPACE       04360003
*             PAGE INS - NON VIO, SWAP) - FROM RCESWPPI              */ 04370003
*        3 SMF71SOT FIXED(32),    /* SWAP-OUT PAGES (ADDRESS SPACE      04380003
*             PAGE OUTS - NON VIO, SWAP) - FROM RCESWPPO             */ 04390003
*        3 SMF71VIN FIXED(32),    /* VIO PAGE-INS (ADDRESS SPACE PAGE   04400003
*             INS - VIO, NON SWAP) - FROM RCEVIOPI                   */ 04410003
*        3 SMF71VOT FIXED(32),    /* VIO PAGE-OUTS (ADDRESS SPACE       04420003
*             PAGE OUTS - VIO, NON SWAP) - FROM RCEVIOPO             */ 04430003
*        3 *        FIXED(32),    /* RESERVED                    @A9C*/ 04440003
*        3 SMF71SNI FIXED(32),    /* SYS PGABLE AREAS NON-VIO PAGE-IN   04450003
*             (LPA/CSA PAGE INS - NON VIO, NON SWAP) - FROM RCECOMPI */ 04460003
*        3 SMF71SNO FIXED(32),    /* SPA NON-VIO PAGE-OUTS              04470003
*             (LPA/CSA PAGE OUTS - NON VIO, NON SWAP) - FROM RCECOMPO*/ 04480003
*        3 *        FIXED(32),    /* RESERVED                    @A9C*/ 04490003
*        3 SMF71LNI FIXED(32),    /* (LPA PAGE INS - NON VIO, NON SWAP) 04500003
*                                    FROM RCELPAPI                   */ 04510003
*        3 *        FIXED(32),    /* RESERVED                    @A9C*/ 04520003
*        3 SMF71AFC FIXED(32),    /* MAIN STOR AVAILABLE FRAME COUNT    04530003
*                                    (SNAPSHOT OF UNUSED) FROM RCEAFC*/ 04540003
*        3 SMF71TFC FIXED(32),    /* MAIN STOR TOTAL FRAME COUNT        04550003
*             EXCLUDING NUCLEUS, BAD OR OFFLINE FRAMES-FROM RCEPOOL     04560003
*             incl. FLPA/EFLPA frames and real frame zero    @YA34458*/ 04570003
*        3 SMF71TSC FIXED(32),    /* AUX TOTAL SLOT COUNT (SNAPSHOT     04580003
*             OF LOCAL PAGE DS SLOTS) - FROM ASMSLOTS                */ 04590003
*        3 SMF71DSC FIXED(32),    /* AUX DATA SET SLOT COUNT (SNAPSHOT  04600003
*             OF LOCAL PAGE DS SLOTS FOR VIO PAGES) FROM ASMVSC      */ 04610003
*        3 SMF71VSC FIXED(32),    /* AUX VIRT MEMORY SLOT COUNT         04620003
*             (SNAPSHOT OF LOCAL PAGE DS SLOTS FOR NON VIO PAGES)       04630003
*                                                       FROM ASMNVSC */ 04640003
*        3 SMF71NSC FIXED(32),    /* AUX UNALLOCATED SLOT COUNT         04650003
*             (SNAPSHOT OF LOCAL PAGE DS SLOTS UNALLOCATED) - FROM      04660003
*                              ASMSLOTS MINUS ASMVSC+ASMNVSC+ASMERRS */ 04670003
*        3 SMF71FIN FIXED(32),    /* NO. FRAMES IN NUCLEUS CALCULATED   04680003
*             FROM ((CVTDOFFE-CVTDOFFS)+(CVTRWNE-CVTRWNS)+              04690003
*                  (CVTERWNE-CVTERWNS)+(CVTRONE-CVTRONS)) / 4096     */ 04700003
*        3 SMF71MNF FIXED(32),    /* MIN AVAIL. PAGE FRAMES -           04710003
*                                    FROM RCEAFC                     */ 04720003
*        3 SMF71MXF FIXED(32),    /* MAX AVAIL. PAGE FRAMES          */ 04730003
*        3 SMF71AVF FIXED(32),    /* AVG AVAIL. PAGE FRAMES          */ 04740003
*        3 SMF71MNP FIXED(32),    /* MIN CSA FRAMES - FROM              04750003
*                                    (RCECOMAL-RCELPAAL-RCESQAAL)    */ 04760003
*        3 SMF71MXP FIXED(32),    /* MAX CSA FRAMES                  */ 04770003
*        3 SMF71AVP FIXED(32),    /* AVG CSA FRAMES                  */ 04780003
*        3 SMF71MNS FIXED(32),    /* MIN ADDR SPACE FRAMES              04790003
*             - FROM (RCEPOOL-RCEAFC-RCECOMAL-RCELSAAL)              */ 04800003
*        3 SMF71MXS FIXED(32),    /* MAX ADDR SPACE FRAMES           */ 04810003
*        3 SMF71AVS FIXED(32),    /* AVG ADDR SPACE FRAMES           */ 04820003
*        3 SMF71MNT FIXED(32),    /* Min total frames - from            04830003
*                                    (RCEPOOL) + FLPA/EFLPA frames +    04840003
*                                    real frame zero         @YA34458*/ 04850003
*        3 SMF71MXT FIXED(32),    /* MAX TOTAL FRAMES                */ 04860003
*        3 SMF71AVT FIXED(32),    /* AVG TOTAL FRAMES                */ 04870003
*        3 SMF71MNQ FIXED(32),    /* MIN SQA FIXED FRAMES - FROM        04880003
*                                    RCESQAAL                        */ 04890003
*        3 SMF71MXQ FIXED(32),    /* MAX SQA FIXED FRAMES            */ 04900003
*        3 SMF71AVQ FIXED(32),    /* AVG SQA FIXED FRAMES            */ 04910003
*        3 SMF71MNC FIXED(32),    /* MIN CSA FIXED FRAMES - FROM        04920003
*                                    RCECOMFX-RCESQAAL)              */ 04930003
*        3 SMF71MXC FIXED(32),    /* MAX CSA FIXED FRAMES            */ 04940003
*        3 SMF71AVC FIXED(32),    /* AVG CSA FIXED FRAMES            */ 04950003
*        3 SMF71MNR FIXED(32),    /* MIN ADDRESS SPACE FIXED FRAMES     04960003
*             (WITHOUT LSQA) - FROM (RCETOTFX-(RCECOMFX+                04970003
*             RCELSAAL))                                             */ 04980003
*        3 SMF71MXR FIXED(32),    /* MAX ADDRESS SPACE FIXED FRAMES     04990003
*                                    (W/O LSQA)                      */ 05000003
*        3 SMF71AVR FIXED(32),    /* AVG ADDRESS SPACE FIXED FRAMES     05010003
*                                    (W/O LSQA)                      */ 05020003
*        3 SMF71MNX FIXED(32),    /* Min total fixed frames - from      05030003
*                                    (RCETOTFX) + FLPA/EFLPA frames     05040003
*                                                            @YA34458*/ 05050003
*        3 SMF71MXX FIXED(32),    /* MAX TOTAL FIXED FRAMES          */ 05060003
*        3 SMF71AVX FIXED(32),    /* AVG TOTAL FIXED FRAMES          */ 05070003
*        3 SMF71MNU FIXED(32),    /* MIN AVAILABLE LOCAL PAGE DATASET   05080003
*             SLOTS FROM (ASMSLOTS-(ASMVSC+ASMNVSC+ASMERRS))         */ 05090003
*        3 SMF71MXU FIXED(32),    /* MAX AVAILABLE LOCAL PAGE DATASET   05100003
*                                    SLOTS                           */ 05110003
*        3 SMF71AVU FIXED(32),    /* AVG AVAILABLE LOCAL PAGE DATASET   05120003
*                                    SLOTS                           */ 05130003
*        3 SMF71MNV FIXED(32),    /* MIN LOCAL PAGE DATASET SLOTS       05140003
*             ALLOCATED TO VIO PRIVATE AREA PAGES - FROM ASMVSC      */ 05150003
*        3 SMF71MXV FIXED(32),    /* MAX LOCAL PAGE DATASET SLOTS       05160003
*                     ALLOCATED TO VIO PRIVATE AREA PAGES            */ 05170003
*        3 SMF71AVV FIXED(32),    /* AVG LOCAL PAGE DATASET SLOTS       05180003
*                       ALLOCATED TO VIO PRIVATE AREA PAGES          */ 05190003
*        3 SMF71MNM FIXED(32),    /* MIN LOCAL PAGE DATA SET SLOTS      05200003
*                     ALLOCATED TO NON VIO PRIVATE AREA PAGES-          05210003
*                                              FROM ASMNVSC          */ 05220003
*        3 SMF71MXM FIXED(32),    /* MAX LOCAL PAGE DATASET SLOTS       05230003
*             ALLOCATED TO NON VIO PRIVATE AREA PAGES                */ 05240003
*        3 SMF71AVM FIXED(32),    /* AVG LOCAL PAGE DATASET SLOTS       05250003
*             ALLOCATED TO NON VIO PRIVATE AREA PAGES                */ 05260003
*        3 SMF71MNB FIXED(32),    /* MIN UNAVAILABLE(BAD) LOCAL PAGE    05270003
*                                    DATASET FROM ASMERRS            */ 05280003
*        3 SMF71MXB FIXED(32),    /* MAX UNAVAILABLE(BAD) LOCAL PAGE    05290003
*                                    DATA SET                        */ 05300003
*        3 SMF71AVB FIXED(32),    /* AVG UNAVAILABLE(BAD) LOCAL PAGE    05310003
*                                    DATA SET                        */ 05320003
*        3 SMF71MNA FIXED(32),    /* MIN TOTAL LOCAL PAGE DATASET       05330003
*                                    SLOTS FROM ASMSLOTS             */ 05340003
*        3 SMF71MXA FIXED(32),    /* MAX TOTAL LOCAL PAGE DATASET       05350003
*                                    SLOTS                           */ 05360003
*        3 SMF71IS1 FIXED(16),    /* INVALID SAMPLES TO BE SKIPPED      05370003
*                                    BECAUSE THERE WERE ERRORS AT THE   05380003
*                                    RSM FIXED FRAMES COUNTING          05390003
*                                    INTERFACE (IARXCNTF)        @Q1C*/ 05400003
*        3 SMF71IS2 FIXED(16),    /* INVALID SAMPLES TO BE SKIPPED      05410003
*                                    BECAUSE THERE WHERE NEGATIVE       05420003
*                                    VALUES AT THE CALCULATION OF THE   05430003
*                                    FIXED CSA FRAMES COUNT      @Q1C*/ 05440003
*        3 SMF71VME FIXED(32),    /* TOTAL VIO PAGES WRITTEN TO EXT     05450003
*                                    STORAGE - FROM RCEVIOME @YA09186*/ 05460003
*        3 SMF71VMG FIXED(32),    /* TOTAL VIO PAGES MIGRATED FROM EXT  05470003
*                                    STORAGE - FROM RCEVIOMG @YA09186*/ 05480003
*        3 SMF71VRE FIXED(32),    /* TOTAL VIO PAGES READ FROM EXT      05490003
*                                    STORAGE - FROM RCEVIORE @YA09186*/ 05500003
*        3 SMF71MVE FIXED(32),    /* Min VIO pages in Exp Storage       05510003
*                                    RAXVIOCT -                  @W4C*/ 05520003
*        3 SMF71XVE FIXED(32),    /* Max VIO pages in Exp Storage       05530003
*                                    RAXVIOCT -                  @W4C*/ 05540003
*        3 SMF71AVE FIXED(32),    /* Avg VIO pages in Exp Storage       05550003
*                                    RAXVIOCT -                  @W4C*/ 05560003
*        3 SMF71RSS FIXED(32),    /* NO. REAL PAGEABLE STORAGE SHORTAGE 05570003
*                                    SWAPS FROM RMCARSSC -              05580003
*                                    NOT USED AS OF RMF330       @P1C*/ 05590003
*        3 SMF71EXS FIXED(32),    /* NO. EXCHANGE SWAPS BASED ON        05600003
*                                    RECOMMENDATION VALUE FROM          05610003
*                                    RMCAEXSC -                         05620003
*                                    NOT USED AS OF RMF330       @P1C*/ 05630003
*        3 SMF71EES FIXED(32),    /* NO. ENQUEUE EXCHANGE SWAPS FROM    05640003
*                                    RMCANQSC -                         05650003
*                                    NOT USED AS OF RMF330       @P1C*/ 05660003
*        3 SMF71TOS FIXED(32),    /* NO. TERMINAL WAITS-(OUTPUT) SWAP   05670003
*                                    OUT CANDIDATES - FROM RMCATOSC -   05680003
*                                    NOT USED AS OF RMF330       @P1C*/ 05690003
*        3 SMF71TXS FIXED(32),    /* NO. TRANSITION SWAPS FROM          05700003
*                                    RMCATSSC -                         05710003
*                                    NOT USED AS OF RMF330       @P1C*/ 05720003
*        3 SMF71LGS FIXED(32),    /* NO. LOGICAL SWAP OUT CANDIATES     05730003
*                                    FROM RMCALSSC -                    05740003
*                                    NOT USED AS OF RMF330       @P1C*/ 05750003
*        3 SMF71LFS FIXED(32),    /* NO. DETECTED LONG THINK TIME SWAPS 05760003
*                                    FROM RMCALFSC -                    05770003
*                                    NOT USED AS OF RMF330       @P1C*/ 05780003
*        3 SMF71LSS FIXED(32),    /* NO. OF LOGICAL SWAPS OUTSTANDING   05790003
*                                    AT START OF INTERVAL - FROM        05800003
*                                    LSCTCNT                            05810003
*                                    NOT USED AS OF RMF330       @P1C*/ 05820003
*        3 SMF71LSE FIXED(32),    /* NO. OF LOGICAL SWAPS OUTSTANDING   05830003
*                                    AT END OF INTERVAL - FROM          05840003
*                                    LSCTCNT                            05850003
*                                    NOT USED AS OF RMF330       @P1C*/ 05860003
*        3 SMF71NLP FIXED(32),    /* Min LPA frames - from (CTLPAF)     05870003
*                                    + FLPA/EFLPA frames     @YA34458*/ 05880003
*        3 SMF71XLP FIXED(32),    /* MAX LPA FRAMES                  */ 05890003
*        3 SMF71ALP FIXED(32),    /* AVG LPA FRAMES                  */ 05900003
*        3 SMF71NLF FIXED(32),    /* Min LPA fixed frames - from        05910003
*                                    (CTFLPAF) + FLPA/EFLPA frames      05920003
*                                                            @YA34458*/ 05930003
*        3 SMF71XLF FIXED(32),    /* MAX LPA FIXED FRAMES            */ 05940003
*        3 SMF71ALF FIXED(32),    /* AVG LPA FIXED FRAMES            */ 05950003
*        3 SMF71NLS FIXED(32),    /* MIN LSQA FIXED FRAMES FROM         05960003
*                                    RCELSAAL                        */ 05970003
*        3 SMF71XLS FIXED(32),    /* MAX LSQA FIXED FRAMES           */ 05980003
*        3 SMF71ALS FIXED(32),    /* AVG LSQA FIXED FRAMES           */ 05990003
*        3 SMF71MNL FIXED(32),    /* Minimum number of fixed frames     06000003
*                                    below 16 MEG. - from (RCEBELFX)    06010003
*                                    + FLPA frames           @YA34458*/ 06020003
*        3 SMF71MXL FIXED(32),    /* MAXIMUM NUMBER OF FIXED FRAMES     06030003
*                                    BELOW 16 MEG.                   */ 06040003
*        3 SMF71AVL FIXED(32),    /* AVERAGE NUMBER OF FIXED FRAMES     06050003
*                                    BELOW 16 MEG.                   */ 06060003
*        3 SMF71PMV FIXED(32),    /* TOTAL PAGE MOVES                   06070003
*                                    - FROM (RCEPAGMV)               */ 06080003
*        3 SMF71OPT CHAR(8),      /* SRM OPT MEMBER NAME                06090003
*                                    - FROM RMPTOPTN             @P1A*/ 06100003
*        3 SMF71PES FIXED(32),    /* TOTAL PAGE MOVES TO ES -           06110003
*                                    - FROM RCEESWRT             @P1A*/ 06120003
*        3 SMF71PEA FIXED(32),    /* TOTAL MIGRATIONS FROM ES TO        06130003
*                                    AUX STORAGE                        06140003
*                                                                @A2C*/ 06150003
*        3 SMF71AMN FIXED(32),    /* MIN ES SLOTS AVAILABLE             06160003
*                                    - FROM RCEAEC               @P1A*/ 06170003
*        3 SMF71AMX FIXED(32),    /* MAX ES SLOTS AVAILABLE             06180003
*                                    - FROM RCEAEC               @P1A*/ 06190003
*        3 SMF71ASA FIXED(32),    /* AVG ES SLOTS AVAILABLE             06200003
*                                    - FROM RCEAEC               @P1A*/ 06210003
*        3 SMF71LIC FIXED(32),    /* MIN HIGH UIC                       06220003
*                                    - FROM MCVSTCRI             @P1A*/ 06230003
*        3 SMF71HIC FIXED(32),    /* MAX HIGH UIC                       06240003
*                                    - FROM MCVSTCRI             @P1A*/ 06250003
*        3 SMF71ACA FIXED(32),    /* AVG HIGH UIC                       06260003
*                                    - FROM MCVSTCRI -                  06270003
                                     SCALE FACTOR IS -1          @P1A*/ 06280003
*        3 SMF71LMA FIXED(32),    /* MIN MIGRATION AGE                  06290003
*                                    - FROM MCVMGAGE             @P1A*/ 06300003
*        3 SMF71HMA FIXED(32),    /* MAX MIGRATION AGE                  06310003
*                                    - FROM MCVMGAGE             @P1A*/ 06320003
*        3 SMF71AMA FIXED(32),    /* AVG MIGRATION AGE                  06330003
*                                    - FROM MCVMGAGE -                  06340003
                                     SCALE FACTOR IS -1          @P1A*/ 06350003
*        3 SMF71CF  FIXED(32),    /* NUMBER ES SLOTS INSTALLED          06360003
*                                    - SCCBNXSB * SCCBMESI       @P1A*/ 06370003
*        3 SMF71OLE FIXED(32),    /* NUMBER ES SLOTS ONLINE AT          06380003
*                                    END OF INTERVAL                    06390003
*                                    - FROM RCEESPL              @P1A*/ 06400003
*        3 SMF71RES FIXED(32),    /* total pages read from ES           06410003
*                                    - from RCEESREA             @W1A*/ 06420003
*        3 SMF71MSR FIXED(32),    /* min SQA pages in real stor         06430003
*                                    CTSQAF + CTRSQAF            @W1A*/ 06440003
*        3 SMF71XSR FIXED(32),    /* max SQA pages in real stor  @W1A*/ 06450003
*        3 SMF71ASR FIXED(32),    /* avg SQA pages in real stor  @W1A*/ 06460003
*        3 SMF71MSE FIXED(32),    /* min SQA pages in ext. stor         06470003
*                                    CTTSQAF - CTRSQAF           @W1A*/ 06480003
*        3 SMF71XSE FIXED(32),    /* max SQA pages in ext. stor  @W1A*/ 06490003
*        3 SMF71ASE FIXED(32),    /* avg SQA pages in ext. stor  @W1A*/ 06500003
*        3 SMF71LME FIXED(32),    /* min LPA pages in ext. stor         06510003
*                                    CTPLPAF - real              @W1A*/ 06520003
*        3 SMF71LXE FIXED(32),    /* max LPA pages in ext. stor  @W1A*/ 06530003
*        3 SMF71LAE FIXED(32),    /* avg LPA pages in ext. stor  @W1A*/ 06540003
*        3 SMF71CME FIXED(32),    /* min CSA pages in ext. stor         06550003
*                                    CNTFTCSA - real             @W1A*/ 06560003
*        3 SMF71CXE FIXED(32),    /* max CSA pages in ext. stor  @W1A*/ 06570003
*        3 SMF71CAE FIXED(32),    /* avg CSA pages in ext. stor  @W1A*/ 06580003
*        3 SMF71MLR FIXED(32),    /* min LSQA pages in real stor        06590003
*                                    CTLSQAF + CTRLSQAF          @W1A*/ 06600003
*        3 SMF71XLR FIXED(32),    /* max LSQA pages in real stor @W1A*/ 06610003
*        3 SMF71ALR FIXED(32),    /* avg LSQA pages in real stor @W1A*/ 06620003
*        3 SMF71MLE FIXED(32),    /* min LSQA pages in ext. stor        06630003
*                                    CTTLSQAF - CTRLSQAF         @W1A*/ 06640003
*        3 SMF71XLE FIXED(32),    /* max LSQA pages in ext. stor @W1A*/ 06650003
*        3 SMF71ALE FIXED(32),    /* avg LSQA pages in ext. stor @W1A*/ 06660003
*        3 SMF71RME FIXED(32),    /* min REG+SWA pages in ext.st.       06670003
*                                    - from RAXESCT              @W1A*/ 06680003
*        3 SMF71RXE FIXED(32),    /* max REG+SWA pages in ext.st.@W1A*/ 06690003
*        3 SMF71RAE FIXED(32),    /* avg REG+SWA pages in ext.st.@W1A*/ 06700003
*        3 SMF71ISC FIXED(32),    /* no of invalid samples returned     06710003
*                                    from RMF collector service  @PAC*/ 06720003
*        3 SMF71HME FIXED(32),    /* Total hiperspace pages written     06730003
*                                     to Exp Storage             @W4A*/ 06740003
*        3 SMF71HRE FIXED(32),    /* Total hiperspace pages read        06750003
*                                     from Exp Storage           @W4A*/ 06760003
*        3 SMF71HMG FIXED(32),    /* Total hiperspace pages migrated    06770003
*                                     from Exp Storage to Auxiliary     06780003
*                                     Storage                    @W4A*/ 06790003
*        3 SMF71HOT FIXED(32),    /* Number of hiperspace page-outs     06800003
*                                                                @W4A*/ 06810003
*        3 SMF71HIN FIXED(32),    /* Number of hiperspace page-ins      06820003
*                                                                @W4A*/ 06830003
*        3 SMF71MHE FIXED(32),    /* Min hiperspace pages in Exp        06840003
*                                     Storage                    @W4A*/ 06850003
*        3 SMF71XHE FIXED(32),    /* Max hiperspace pages in Exp        06860003
*                                     Storage                    @W4A*/ 06870003
*        3 SMF71AHE FIXED(32),    /* Avg hiperspace pages in Exp        06880003
*                                     Storage                    @W4A*/ 06890003
*        3 SMF71BLP FIXED(32),    /* Number of blocked pages paged in,  06900003
*                                     does not include VIO              06910003
*                                     or hiperspace              @A2A*/ 06920003
*        3 SMF71BLK FIXED(32),    /* Number of blocks paged in   @A2A*/ 06930003
*        3 SMF71PWS FIXED(32),    /* Number of primary working set      06940003
*                                     pages migrated from ES     @A2A*/ 06950003
*        3 SMF71FNM FIXED(32),    /* Number of expanded storage frames  06960003
*                                     freed without migration    @A2A*/ 06970003
*        3 SMF71PMT CHAR(8),      /* Steal Timer - elapsed time         06980003
*                                     spent in prefered steal -         06990003
*                                     in CPU Timer units         @C1C*/ 07000003
*        3 SMF71SBI FIXED(32),    /* System Pageable Areas Block        07010003
*                                     Page-Ins                   @C1A*/ 07020003
*        3 SMF71LBI FIXED(32),          /* LPA Block Page-Ins    @C1A*/ 07030003
*        ?ERBFITEM(3 SMF71ASI) FLOAT(56);,  /*                          07040006
*                                    Number of page-ins from            07050003
*                                    auxiliary storage for shared       07060003
*                                    page groups                        07070003
*                                    (long floating point)       @D1A*/ 07080003
*        ?ERBFITEM(3 SMF71ASO) FLOAT(56);, /* Number of page-outs       07090003
*                                    to auxiliary storage for           07100003
*                                    shared page groups                 07110003
*                                    (long floating point)       @D1A*/ 07120003
*        ?ERBFITEM(3 SMF71ESI) FLOAT(56);, /* Number of page-ins        07130003
*                                    from expanded storage for          07140003
*                                    shared page groups                 07150003
*                                    (long floating point)       @D1A*/ 07160003
*        ?ERBFITEM(3 SMF71ESO) FLOAT(56);, /* Number of page-outs       07170003
*                                    to expanded storage for            07180003
*                                    shared page groups                 07190003
*                                    (long floating point)       @D1A*/ 07200003
*        ?ERBFITEM(3 SMF71MGT) FLOAT(56);, /* Minimum number of         07210003
*                                    shared page groups                 07220003
*                                    in the system                      07230003
*                                    (long floating point)       @D1A*/ 07240003
*        ?ERBFITEM(3 SMF71XGT) FLOAT(56);, /* Maximum number of         07250003
*                                    shared page groups                 07260003
*                                    groups in the system               07270003
*                                    (long floating point)       @D1A*/ 07280003
*        ?ERBFITEM(3 SMF71AGT) FLOAT(56);, /* Average number of         07290003
*                                    shared page groups                 07300003
*                                    in the system                      07310003
*                                    (long floating point)       @D1A*/ 07320003
*        ?ERBFITEM(3 SMF71MGC) FLOAT(56);, /* Minimum number of         07330003
*                                    shared page groups                 07340003
*                                    in central storage                 07350003
*                                    (long floating point)       @D1A*/ 07360003
*        ?ERBFITEM(3 SMF71XGC) FLOAT(56);, /* Maximum number of         07370003
*                                 shared page groups                    07380003
*                                    in central storage                 07390003
*                                    (long floating point)       @D1A*/ 07400003
*        ?ERBFITEM(3 SMF71AGC) FLOAT(56);, /* Average number of         07410003
*                                    shared page groups                 07420003
*                                    in central storage                 07430003
*                                    (long floating point)       @D1A*/ 07440003
*        ?ERBFITEM(3 SMF71MGE) FLOAT(56);, /* Minimum number of         07450003
*                                    shared page groups                 07460003
*                                    in expanded storage                07470003
*                                    (long floating point)       @D1A*/ 07480003
*        ?ERBFITEM(3 SMF71XGE) FLOAT(56);, /* Maximum number of         07490003
*                                    shared page groups                 07500003
*                                    in expanded storage                07510003
*                                    (long floating point)       @D1A*/ 07520003
*        ?ERBFITEM(3 SMF71AGE) FLOAT(56);, /* Average number of         07530003
*                                    shared page groups                 07540003
*                                    in the central storage             07550003
*                                    (long floating point)       @D1A*/ 07560003
*        ?ERBFITEM(3 SMF71MGA) FLOAT(56);, /* Minimum number of         07570003
*                                    auxiliary slots in use for         07580003
*                                    shared page groups                 07590003
*                                    (long floating point)       @D1A*/ 07600003
*        ?ERBFITEM(3 SMF71XGA) FLOAT(56);, /* Maximum number of         07610003
*                                    auxiliary slots in use for         07620003
*                                    shared page groups                 07630003
*                                    (long floating point)       @D1A*/ 07640003
*        ?ERBFITEM(3 SMF71AGA) FLOAT(56);, /* Average number of         07650003
*                                    auxiliary slots in use for         07660003
*                                    shared page groups                 07670003
*                                    (long floating point)       @D1A*/ 07680003
*        ?ERBFITEM(3 SMF71MGF) FLOAT(56);, /* Minimum number of         07690003
*                                    shared page groups                 07700003
*                                    fixed in the system                07710003
*                                    (long floating point)       @D1A*/ 07720003
*        ?ERBFITEM(3 SMF71XGF) FLOAT(56);, /* Maximum number of         07730003
*                                    shared page groups                 07740003
*                                    fixed in the system                07750003
*                                    (long floating point)       @D1A*/ 07760003
*        ?ERBFITEM(3 SMF71AGF) FLOAT(56);, /* Average number of         07770003
*                                    shared page groups                 07780003
*                                    fixed in the system                07790003
*                                    (long floating point)       @D1A*/ 07800003
*        ?ERBFITEM(3 SMF71MGB) FLOAT(56);, /* Minimum number of         07810003
*                                    shared page groups                 07820003
*                                    fixed below 16MB in the system     07830003
*                                    (long floating point)       @D1A*/ 07840003
*        ?ERBFITEM(3 SMF71XGB) FLOAT(56);, /* Maximum number of         07850003
*                                    shared page groups                 07860003
*                                    fixed below 16MB in the system     07870003
*                                    (long floating point)       @D1A*/ 07880003
*        ?ERBFITEM(3 SMF71AGB) FLOAT(56);, /* Average number of         07890008
*                                    shared page groups                 07900003
*                                    fixed below 16MB in the system     07910003
*                                    (long floating point)       @D1A*/ 07920003
*        ?ERBFITEM(3 SMF71CAM) FLOAT(56);, /* Minimum number of         07921009
*                                    available central storage frames   07922008
*                                    (long floating point)       @F1A*/ 07924008
*        ?ERBFITEM(3 SMF71CAX) FLOAT(56);, /* Maximum number of         07924109
*                                    available central storage frames   07924209
*                                    (long floating point)       @F1A*/ 07924309
*        ?ERBFITEM(3 SMF71CAA) FLOAT(56);, /* Average number of         07924409
*                                    available central storage frames   07924509
*                              (rceafc-max(rceafcok,mccafcok*mccdefam)) 07924609
*                                    (long floating point)       @F1A*/ 07924709
*        ?ERBFITEM(3 SMF71CLM) FLOAT(56);, /* Minimum number of         07924809
*                                    low impact central storage frames  07924909
*                                    (long floating point)       @F1A*/ 07925009
*        ?ERBFITEM(3 SMF71CLX) FLOAT(56);, /* Maximum number of         07926009
*                                    low impact central storage frames  07927009
*                                    (long floating point)       @F1A*/ 07928009
*        ?ERBFITEM(3 SMF71CLA) FLOAT(56);, /* Average number of         07929009
*                                    low impact central storage frames  07929109
*                                    (long floating point)       @F1A*/ 07929309
*        ?ERBFITEM(3 SMF71CMM) FLOAT(56);, /* Minimum number of         07929409
*                                    medium impact central storage      07929509
*                                   frames (long floating point) @F1A*/ 07929609
*        ?ERBFITEM(3 SMF71CMX) FLOAT(56);, /* Maximum number of         07929709
*                                    medium impact central storage      07929809
*                                   frames (long floating point) @F1A*/ 07929909
*        ?ERBFITEM(3 SMF71CMA) FLOAT(56);, /* Average number of         07930009
*                                    medium impact central storage      07930109
*                                   frames (long floating point) @F1A*/ 07930209
*        ?ERBFITEM(3 SMF71CHM) FLOAT(56);, /* Minimum number of         07930309
*                                    high impact central storage frames 07930409
*                                    (long floating point)       @F1A*/ 07930509
*        ?ERBFITEM(3 SMF71CHX) FLOAT(56);, /* Maximum number of         07930609
*                                    high impact central storage frames 07930709
*                                    (long floating point)       @F1A*/ 07930809
*        ?ERBFITEM(3 SMF71CHA) FLOAT(56);, /* Average number of         07930909
*                                    high impact central storage frames 07931009
*                                    (long floating point)       @F1A*/ 07931109
*        ?ERBFITEM(3 SMF71EAM) FLOAT(56);, /* Minimum number of         07931209
*                                    available expanded storage frames  07931309
*                                    (long floating point)       @F1A*/ 07931409
*        ?ERBFITEM(3 SMF71EAX) FLOAT(56);, /* Maximum number of         07931509
*                                    available expanded storage frames  07931609
*                                    (long floating point)       @F1A*/ 07931709
*        ?ERBFITEM(3 SMF71EAA) FLOAT(56);, /* Average number of         07931809
*                                    available expanded storage frames  07931909
*                                    (rceaec-rceaecok)                  07932009
*                                    (long floating point)       @F1A*/ 07932109
*        ?ERBFITEM(3 SMF71ELM) FLOAT(56);, /* Minimum number of         07932210
*                                    low impact expanded storage frames 07932310
*                                    (long floating point)       @F1A*/ 07932409
*        ?ERBFITEM(3 SMF71ELX) FLOAT(56);, /* Maximum number of         07932510
*                                    low impact expanded storage frames 07932610
*                                    (long floating point)       @F1A*/ 07932709
*        ?ERBFITEM(3 SMF71ELA) FLOAT(56);, /* Average number of         07932810
*                                    low impact expanded storage frames 07932910
*                                    (long floating point)       @F1A*/ 07933009
*        ?ERBFITEM(3 SMF71EMM) FLOAT(56);, /* Minimum number of         07933110
*                                    medium impact expanded storage     07933210
*                                   frames (long floating point) @F1A*/ 07933309
*        ?ERBFITEM(3 SMF71EMX) FLOAT(56);, /* Maximum number of         07933410
*                                    medium impact expanded storage     07933510
*                                   frames (long floating point) @F1A*/ 07933609
*        ?ERBFITEM(3 SMF71EMA) FLOAT(56);, /* Average number of         07933710
*                                    medium impact expanded storage     07933810
*                                   frames (long floating point) @F1A*/ 07933909
*        ?ERBFITEM(3 SMF71EHM) FLOAT(56);, /* Minimum number of         07934010
*                                    high impact expanded storage frames07934110
*                                    (long floating point)       @F1A*/ 07934209
*        ?ERBFITEM(3 SMF71EHX) FLOAT(56);, /* Maximum number of         07934310
*                                    high impact expanded storage frames07934410
*                                    (long floating point)       @F1A*/ 07934509
*        ?ERBFITEM(3 SMF71EHA) FLOAT(56);, /* Average number of         07934612
*                                    high impact expanded storage frames07934710
*                                    (long floating point)       @F1A*/ 07934809
*        ?ERBFITEM(3 SMF71MVI) FLOAT(56);, /* Min. number of VIO        07934915
*                                    pages in real storage (ESAME mode) 07935012
*                                    (long floating point)       @I1A*/ 07935115
*        ?ERBFITEM(3 SMF71XVI) FLOAT(56);, /* Max. number of VIO        07935215
*                                    pages in real storage (ESAME mode) 07935313
*                                    (long floating point)       @I1A*/ 07935415
*        ?ERBFITEM(3 SMF71AVI) FLOAT(56);, /* Avg. number of VIO        07935515
*                                    pages in real storage (ESAME mode) 07935612
*                                    (long floating point)       @I1A*/ 07935715
*        ?ERBFITEM(3 SMF71MHI) FLOAT(56);, /* Min. number of hiperspace 07935815
*                                    pages in real storage (ESAME mode) 07935912
*                                    (long floating point)       @I1A*/ 07936015
*        ?ERBFITEM(3 SMF71XHI) FLOAT(56);, /* Max. number of hiperspace 07936115
*                                    pages in real storage (ESAME mode) 07936212
*                                    (long floating point)       @I1A*/ 07936315
*        ?ERBFITEM(3 SMF71AHI) FLOAT(56);, /* Avg. number of hiperspace 07936415
*                                    pages in real storage (ESAME mode) 07936512
*                                    (long floating point)       @I1A*/ 07936615
*        ?ERBFITEM(3 SMF71VWS) FLOAT(56);, /* Number of VIO pages       07936715
*                                    written to real storage (ESAME)    07936812
*                                    (long floating point)       @I1A*/ 07936915
*        ?ERBFITEM(3 SMF71VRS) FLOAT(56);, /* Number of VIO pages       07937015
*                                    read from real storage (ESAME)     07937112
*                                    (long floating point)       @I1A*/ 07937215
*        ?ERBFITEM(3 SMF71HWS) FLOAT(56);, /* Number of hipersp. pages  07937315
*                                    written to real storage (ESAME)    07937412
*                                    (long floating point)       @I1A*/ 07937515
*        ?ERBFITEM(3 SMF71HRS) FLOAT(56);, /* Number of hipersp. pages  07937615
*                                    read from real storage (ESAME)     07937712
*                                    (long floating point)       @I1A*/ 07937815
*        ?ERBFITEM(3 SMF71MFB) FLOAT(56);, /* Min number of pages fixed 07937915
*                                    between 16M and 2G (ESAME)         07938012
*                                    (long floating point)       @I1A*/ 07938115
*        ?ERBFITEM(3 SMF71XFB) FLOAT(56);, /* Max number of pages fixed 07938215
*                                    between 16M and 2G (ESAME)         07938314
*                                    (long floating point)       @I1A*/ 07938415
*        ?ERBFITEM(3 SMF71AFB) FLOAT(56);; /* Avg number of pages fixed 07938515
*                                    between 16M and 2G (ESAME)         07938614
*                                    (long floating point)       @I1A*/ 07938715
*/********************************************************************/ 07939009
*/*              SWAP PLACEMENT DATA SECTION                         */ 07940003
*/*                                                                  */ 07950003
*/* THE SWAP PLACEMENT DATA SECTION REPRESENTS A MATRIX OF SWAP      */ 07960003
*/* PLACEMENT COUNTERS BY SWAP REASONS, WHEREAS THE SWAP REASONS     */ 07970003
*/* ARE  :                                                           */ 07980003
*/*  SWAP REASON 1  -  TERMINAL OUTPUT WAIT                          */ 07990003
*/*  SWAP REASON 2  -  TERMINAL INPUT WAIT                           */ 08000003
*/*  SWAP REASON 3  -  LONG WAIT                                     */ 08010003
*/*  SWAP REASON 4  -  AUXILIARY STORAGE SHORTAGE                    */ 08020003
*/*  SWAP REASON 5  -  REAL PAGEABLE STORAGE SHORTAGE                */ 08030003
*/*  SWAP REASON 6  -  DETECTED WAIT                                 */ 08040003
*/*  SWAP REASON 7  -  REQUESTED (REQSWAP SYSEVENT)                  */ 08050003
*/*  SWAP REASON 8  -  ENQUEUE EXCHANGE                              */ 08060003
*/*  SWAP REASON 9  -  EXCHANGE ON RECOMMENDATION VALUE              */ 08070003
*/*  SWAP REASON 10 -  UNILATERAL                                    */ 08080003
*/*  SWAP REASON 11 -  TRANSITION TO NON-SWAPPABLE                   */ 08090003
*/*  SWAP REASON 12 -  IMPROVE CENTRAL STORAGE USAGE             @A2A*/ 08100003
*/*  SWAP REASON 13 -  IMPROVE SYSTEM PAGING RATE                @A2A*/ 08110003
*/*  SWAP REASON 14 -  MAKE ROOM TO SWAP IN AN OUT TOO LONG USER @A2A*/ 08120003
*/*  SWAP REASON 15 -  APPC WAIT                                 @A1A*/ 08130003
*/*  SWAP REASON 16 -  OMVS INPUT WAIT                           @B3A*/ 08140003
*/*  SWAP REASON 17 -  OMVS OUTPUT WAIT                          @B3A*/ 08150003
*/*                                                                  */ 08160003
*/* EXAMPLE : SMF71AXD(6) CONTAINS THE COUNT OF PHYSICAL SWAPS       */ 08170003
*/*           TO AUXILIARY STORAGE BECAUSE OF DETECTED WAIT.         */ 08180003
*/*                                                              @P1A*/ 08190003
*/********************************************************************/ 08200003
*                                                                       08210003
*   DCL SMF71NSR CONSTANT(17);    /* Number of swap reasons for         08220003
*                                    the current release. If it does    08230003
*                                    not match the number of swap       08240003
*                                    sections below (in Post Proc.),    08250003
*                                    record has to be expanded   @B2C*/ 08260003
*                                                                       08270003
*   %IF SMFARRAY = 'YES' %THEN %GOTO ARR71;                    /*@P1A*/ 08280003
*                                                                       08290003
*   DCL 1 SMF71SWP BASED(ADDR(SMF71HDR)+SMF71SWS),             /*@P1A*/ 08300003
*       %GOTO CONT71;                                          /*@P1A*/ 08310003
*%ARR71:;                                                      /*@P1A*/ 08320003
*   DCL 1 SMF71SWP(1:SMF71NSR) BASED(ADDR(SMF71HDR)+SMF71SWS), /*@A2C*/ 08330003
*%CONT71:;                                                     /*@P1A*/ 08340003
*        3 SMF71TOT FIXED(32),    /* TOTAL SWAP CANDIDATES              08350003
*                                    - FROM RMCATOSC             @P1A*/ 08360003
*        3 SMF71AXD FIXED(32),    /* PHYSICAL SWAPS DIRECTLY TO         08370003
*                                    AUXILIARY STORAGE                  08380003
*                                    - FROM SWCT                 @P1A*/ 08390003
*        3 SMF71LES FIXED(32),    /* OF THE LOGICALLY SWAPPED,          08400003
*                                    NUMBER OF PHYSICALLY SWAPPED       08410003
*                                    TO EXTENDED STORAGE                08420003
*                                    - FROM SWCT                 @P1A*/ 08430003
*        3 SMF71LAX FIXED(32),    /* OF THE LOGICALLY SWAPPED,          08440003
*                                    NUMBER OF PHYSICALLY SWAPPED       08450003
*                                    TO AUXILIARY STORAGE               08460003
*                                    - FROM SWCT                 @P1A*/ 08470003
*        3 SMF71ESD FIXED(32),    /* PHYSICAL SWAPS DIRECTLY TO         08480003
*                                    EXTENDED STORAGE                   08490003
*                                    - FROM SWCT                 @P1A*/ 08500003
*        3 SMF71MIG FIXED(32);    /* TOTAL NUMBER PHYSICALLY SWAPPED    08510003
*                                    MIGRATED FROM EXTENDED TO          08520003
*                                    AUXILIARY STORAGE                  08530003
*                                    - FROM SWCT                 @P1A*/ 08540003
