*        %GOTO PLS73;   /* BILINGUAL MAPPING                            00001001
         MACRO                                                          00002001
         ERBSMF73                                                       00003001
***** START OF SPECIFICATIONS ***************************************** 00004001
*   MODULE-NAME = ERBSMF73                                            * 00005001
*                                                                     * 00006001
*   DESCRIPTIVE-NAME = SEE BELOW                                      * 00007001
*                                                                     * 00008001
*           MAPPING MACRO FOR SMF RECORD TYPE 73 (CHANNEL MEASUREMENT)* 00009001
*                                                                     * 00010001
         ERBCOPY1 Y1=1983                                               00011001
*                                                                     * 00012001
*   FUNCTION : THIS MACRO MAPS THE COMPLETE SMF RECORD TYPE 73.       * 00013001
*              THE RECORD IS CREATED BY RMF IF CHANNEL ACTIVITY       * 00014001
*              MEASUREMENTS ARE ACTIVATED.                            * 00015001
*              THE RECORD CONSISTS OF 5 PARTS:                        * 00016001
*              1. THE FIXED PORTION OF THE SMF HEADER.                * 00017001
*                 THIS MAPPING IS INVOKED BY CALLING ERBHDR MACRO.    * 00018001
*              2. THE INDIVIDUAL HEADER EXTENSION WHICH CONTAINS      * 00019001
*                 OFFSET/LENGTH/NUMBER TRIPLETS TO ADDRESS THE        * 00020001
*                 RECORD PARTS FOLLOWING THE RMF PRODUCT SECTION.     * 00021001
*              3. THE RMF PRODUCT SECTION.                            * 00022001
*                 THIS MAPPING IS INVOKED BY CALLING ERBPRO MACRO.    * 00023001
*              4. THE RMF CONTROL SECTIONS                            * 00024001
*              5. THE RMF DATA SECTIONS                               * 00025001
*                                                                     * 00026001
*   NOTES : NONE                                                      * 00027001
*                                                                     * 00028001
*   MODULE-TYPE = BILINGUAL MAPPING MACRO                             * 00029001
*                                                                     * 00030001
*   METHOD OF INVOCATION = SEE BELOW                                  * 00031001
*                                                                     * 00032001
*      BAL - ERBSMF73                                                 * 00033001
*                                                                     * 00034001
*   DISTRIBUTION LIBRARY: ARMFMAC1                                @B1A* 00035001
*                                                                     * 00036001
*   CHANGE-ACTIVITY = SEE BELOW                                       * 00037001
*                                                                     * 00038001
* $N0=SMFFORMT,HRM3102,,FRS: NEW FOR RMF 3.1                      @N0A* 00039001
* $N1=PP,HRM3102,,NEL: PARTIAL STATISTICS ADDED                       * 00040001
* $P1=SRM,HRM3302,,THE: SRM SERVICE (SAD-STCPS)                   @P1A* 00041001
* $Z1=OY29112,HRM4420,,WRC: ESCA BASIS                            @Z1A* 00042001
* $Z2=OY29112,HRM4420,,WRC: SERIAL & SWITCH SUPPORT               @Z2A* 00043001
* $A1=DYNIO,JRM4421,,AB: DYNAMIC I/O SUPPORT                      @A1A* 00044001
*  RV, adjustment for dynamic I/O                             @YA45991* 00045001
* $BA=MIF,JRM4422,,BHL: ESCON Multiple Image Facility SPE         @BAA* 00046001
* $B1=R430,HRM4430,,BHL: Distribution lib in prolog               @B1A* 00047001
* LGO: INCLUDE CTC TYPES                                      @YA55031* 00048001
* LAN: Comment changes only (IODF creation date & time)       @YA64585* 00049001
* $C1=NEWCH,HRM5510,,FF: New channel support (OSA,ISC,Pacer)      @C1A* 00050001
* GBO: Cleanup of PADI-inconsistencies                        @WA05544* 00051001
* $D1=NEWISD,HRM5520,,FF: Integrated System Device            @WA10257* 00052001
* AJU: Actualize SMF73CPD comments                            @WA18557* 00052101
* THE: Year 2000 support. IODF creation date.                 @WA19913* 00052151
* $G1=ACR,HRM6606,,PS: Channel Type Support                       @G1A* 00052201
* $H1=FICON,HRM6607,,PS:  Fibre Channel Support                   @H1A*         
* $I1=DCM,HRM7703,,SHR: Dynamic CHPID Management support          @I1A*         
*                                                                     * 00052201
****** END OF SPECIFICATIONS ****************************************** 00052301
*  LENGTH FORMULA = SMF73HPS + (SMF73HPL*SMF73HPN)                      00052401
         SPACE 3                                                        00052501
**********************  COMMON SMF HEADER  **************************** 00052601
         ERBHDR 73                                                      00052701
         SPACE 3                                                        00052801
**********************  INDIVIDUAL HEADER EXTENSION  ****************** 00052901
SMF73HDX DS    0CL16    TOTAL HEADER EXTENSION                @WA05544  00053001
SMF73HIS DS    BL4      OFFSET TO CHANNEL CONTROL SECTION               00054001
SMF73HIL DS    BL2      LENGTH OF CHANNEL CONTROL SECTION               00055001
SMF73HIN DS    BL2      NUMBER OF CHANNEL CONTROL SECTIONS              00056001
SMF73HPS DS    BL4      OFFSET TO CHANNEL DATA SECTION                  00057001
SMF73HPL DS    BL2      LENGTH OF CHANNEL DATA SECTION                  00058001
SMF73HPN DS    BL2      NUMBER OF CHANNEL DATA SECTIONS                 00059001
         SPACE 3                                                        00060001
**********************  COMMON RMF PRODUCT SECTION  ******************* 00061001
         ERBPRO 73                                                      00062001
         SPACE 3                                                        00063001
**********************  CHANNEL CONTROL SECTION *********************** 00064001
SMF73CTL DSECT                                                          00065001
SMF73SMP DS    BL4      NUMBER OF SAMPLES, WEIGHTED BY SRM.       @P1C  00066001
SMF73CFL DS    BL1      Configuration change flags                @A1A  00067001
SMF73DCA EQU   X'80'    1... .... ON= Config. changed last intv.  @A1A  00068001
SMF73IAC EQU   X'40'    .1.. .... ON= Config. changed since IPL   @A1A  00069001
SMF73IOD EQU   X'20'    ..1. .... ON= System IPLed via IODF       @A1A  00070001
SMF73ICV EQU   X'10'    ...1 .... ON= I/O Token is valid          @A1A  00071001
SMF73REP EQU   X'08'    .... 1... ON= Record may include      @YA45991  00072001
*                                     invalid sections        @YA45991  00073001
SMF73CMF EQU   X'04'    .... .1.. ON= CPMF available              @BAA  00074001
SMF73MCG EQU   X'02'    .... ..1. Reserved for RMF use            @BAA  00075001
SMF73CMC EQU   X'01'    .... ...1 CPMF mode change used for       @H1C  00076001
*                                 duration report                 @H1C          
SMF73SFL DS    BL1      Status flags                              @I1A  00077001
SMF73CMH EQU   X'80'    1... .... ON= DCM supported by hardware   @I1A  00068001
SMF73CMD EQU   X'40'    .1.. .... ON= Configuration contains DCM  @I1A  00069001
*                                 managed channels                @I1A  00076001
*                       ..11 1111 CPMF mode change used for       @I1A  00076001
         DS    BL2      Reserved for future use                   @I1C  00077001
SMF73TNM DS    CL44     IODF name                                 @A1A  00078001
SMF73TSF DS    CL2      Suffix of IODF Name                       @A1A  00079001
         DS    CL2      Reserved for Alignment                    @A1A  00080001
SMF73TOK DS    0CL16    Partially token Info                  @WA05544  00081001
SMF73TDT DS    CL8      IODF creation date mm/dd/yy           @YA64585  00082001
SMF73TTM DS    CL8      IODF creation time hh.mm.ss           @YA64585  00083001
SMF73CRC DS    BL4      Count of times SRM has restarted the Channel    00084001
*                       Path Measurement Facility (CPMF)          @BAA  00085001
SMF73CSC DS    BL4      Last CPMF sample count                    @BAA  00086001
SMF73TDY DS    CL10     IODF creation date. mm/dd/yyyy        @WA19913  00086301
SMF73CMI DS    BL1      CPMF Mode Info                            @H1A          
*                       0 - CPMF not active                       @H1A          
*                       1 - Compatibility Mode                    @H1A          
*                       2 - Extended Mode                         @H1A          
         DS    CL1      Reserved for Alignment                    @H1C  00086601
         SPACE 3                                                        00087001
**********************  CHANNEL DATA SECTION ************************** 00088001
SMF73CHA DSECT                                                          00089001
SMF73PID DS    BL1      CHANNEL PATH IDENTIFICATIONS                    00090001
*                       THE RANGE OF VALUES IS 0 TO FF                  00091001
SMF73FG2 DS    BL1      CHANNEL FLAGS                                   00092001
SMF73RV3 EQU   X'C0'    RESERVED, BUT USED BY ERBDUCHA        @WA05544  00093001
SMF73BL  EQU   X'20'    BLOCK MULTIPLEXOR                               00094001
SMF73BY  EQU   X'10'    BYTE MULTIPLEXOR                                00095001
SMF73RV4 EQU   X'08'    RESERVED                                 @N1C   00096001
SMF73PAR EQU   X'04'    ONLY PARTIAL STATISTICS AVAILABLE        @N1A   00097001
SMF73VAC EQU   X'02'    DATA INVALID. CHANNEL PATH WAS VARIED DURING    00098001
*                       INTERVAL.                                       00099001
SMF73STA EQU   X'01'    CHANNEL PATH IS CURRENTLY ONLINE                00100001
SMF73FG3 DS    BL1      Channel flags extension                  @Z1A   00101001
SMF73CNC EQU   X'80'    ES CONNECTION CHANNEL                    @Z2A   00102001
SMF73DOC EQU   X'40'    ES CONNECTION DIRECTOR ATTACHED TO              00103001
*                       CHANNEL PATH                             @Z2A   00104001
SMF73CVC EQU   X'20'    ES CONVERSION CHANNEL                    @Z1A   00105001
SMF73MOD EQU   X'10'    Channel path modified                    @A1A   00106001
SMF73DEL EQU   X'08'    Channel path deleted                     @A1A   00107001
SMF73INS EQU   X'04'    Channel path inserted                    @A1A   00108001
SMF73VLD EQU   X'02'    Valid Channel Path this interval     @YA45991   00109001
SMF73SHR EQU   X'01'    Channel path is shared between logical          00110001
*                       partitions                               @BAA   00111001
SMF73FG4 DS    BL1      Channel path flags                       @BAC   00112001
SMF73NVL EQU   X'80'    Entry in CPMB was not valid.             @BAA   00113001
SMF73CC  EQU   X'40'    Channel path is CTC defined.         @YA55031   00114001
SMF73FXT EQU   X'20'    Channel conversion 3090                  @C1A   00115001
SMF73CPM EQU   X'08'    Channel path is DCM managed              @I1A   00115001
SMF73BSY DS    BL4      NUMBER OF SAMPLES IN WHICH THE CHANNEL PATH     00116001
*                       WAS BUSY. WEIGHTED BY SRM.               @P1C   00117001
SMF73PBY DS    BL4      Partition's channel path busy time since        00118001
*                       last RMF interval (in units of 1024             00119001
*                       microseconds)                            @BAA   00120001
SMF73PTI DS    BL4      Channel path measurement                        00121001
*                       interval time (in units of 1024 microseconds)   00122001
*                                                                @BAA   00123001
SMF73CPD DS    BL1      Channel path description. For an         @C1A   00124001
*                       explanation, you can issue the command   @G1C   00125001
*                       D M=CHP.                                 @G1C   00126001
*                                                              12@G1D   00130001
SMF73ACR DS    CL5      Channel path acronym                     @G1C           
SMF73CMG DS    BL1      CPMF Channel Measurement Group           @H1A           
SMF73FG5 DS    CL1      Channel path flags                       @H1C   00142001
SMF73MBV EQU   X'80'    CPMF Maximum Bus cycles Valid            @H1C           
SMF73MCV EQU   X'40'    CPMF Maximum Channel work units Valid    @H1C           
SMF73MWV EQU   X'20'    CPMF Maximum Write data units Valid      @H1C           
SMF73MRV EQU   X'10'    CPMF Maximum Read data units Valid       @H1C           
SMF73USV EQU   X'08'    CPMF data Unit Size Valid                @H1C           
SMF73CCM DS    CL48     CPMF Channel Measurements extended mode  @H1A           
**********************  Channel Extended Mode Section ****************  00088001
**********************  Channel Measurement Group 1 ******************  00088001
         ORG SMF73CCM                                                           
SMF73CM1 DS    0CL8     Channel data Measurement group 1         @H1A           
SMF73TUT DS    CL4      CPMF Total channel path busy Time in     @H1A           
*                       units of 128 microseconds                @H1A           
*                       short floating point                     @H1A           
SMF73PUT DS    CL4      CPMF LPAR channel path busy Time in      @H1A           
*                       units of 128 microseconds                @H1A           
*                       short floating point                     @H1A           
         DS    CL40     Reserved                                 @H1A           
**********************  Channel Measurement Group 2 ******************  00088001
         ORG SMF73CCM                                                           
SMF73CCC DS    0CL20    CPMF Channel Characteristics data        @H1A           
SMF73MBC DS    CL4      CPMF Maximum Bus Cycles per second       @H1A           
*                       short floating point                     @H1A           
SMF73MCU DS    CL4      CPMF Maximum Channel work Units per      @H1A           
*                       second short floating point              @H1A           
SMF73MWU DS    CL4      CPMF Maximum Write data Units per second @H1A           
*                       short floating point                     @H1A           
SMF73MRU DS    CL4      CPMF Maximum Read data Units per second  @H1A           
*                       short floating point                     @H1A           
SMF73US  DS    CL4      CPMF data Unit Size in bytes             @H1A           
*                       short floating point                     @H1A           
SMF73CCD DS    0CL28    CPMF Channel measurement group 2 Data    @H1A           
SMF73TBC DS    CL4      CPMF Total Bus Cycles count              @H1A           
*                       short floating point                     @H1A           
SMF73TUC DS    CL4      CPMF Total channel work Unit Count       @H1A           
*                       short floating point                     @H1A           
SMF73PUC DS    CL4      CPMF LPAR channel work Unit Count        @H1A           
*                       short floating point                     @H1A           
SMF73TWU DS    CL4      CPMF Total Write data Units count        @H1A           
*                       short floating point                     @H1A           
SMF73PWU DS    CL4      CPMF LPAR Write data Units count         @H1A           
*                       short floating point                     @H1A           
SMF73TRU DS    CL4      CPMF Total Read data Units count         @H1A           
*                       short floating point                     @H1A           
SMF73PRU DS    CL4      CPMF LPAR read data units count          @H1A           
*                       short floating point                     @H1A           
SMF73CPP DS    BL1      Channel path parameter                   @I1A           
         DS    CL3      Reserved                                 @I1A           
         MEND  ,                                                        00143001
*                       */                                              00144001
*%PLS73: ;                                                              00145001
*/*** START OF SPECIFICATIONS ****************************************/ 00146001
*/* MODULE-NAME = ERBSMF73                                           */ 00147001
*/*                                                                  */ 00148001
*/* DESCRIPTIVE-NAME = SEE MACMEAN                                   */ 00149001
*/*                                                                  */ 00150001
*/*         MAPPING MACRO FOR SMF RECORD TYPE 73(CHANNEL MEASUREMENT)*/ 00151001
*/*                                                                  */ 00152001
*       ?ERBCOPY1 Y1(1983);                                             00153001
*/*                                                                  */ 00154001
*/* FUNCTION : THIS MACRO MAPS THE COMPLETE SMF RECORD TYPE 73.      */ 00155001
*/*            THE RECORD IS CREATED BY RMF IF CHANNEL ACTIVITY      */ 00156001
*/*            MEASUREMENTS ARE ACTIVATED.                           */ 00157001
*/*            THE RECORD CONSISTS OF 5 PARTS:                       */ 00158001
*/*            1. THE FIXED PORTION OF THE SMF HEADER.               */ 00159001
*/*               THIS MAPPING IS INVOKED BY CALLING ERBHDR MACRO.   */ 00160001
*/*            2. THE INDIVIDUAL HEADER EXTENSION WHICH CONTAINS     */ 00161001
*/*               OFFSET/LENGTH/NUMBER TRIPLETS TO ADDRESS THE       */ 00162001
*/*               RECORD PARTS FOLLOWING THE RMF PRODUCT SECTION.    */ 00163001
*/*            3. THE RMF PRODUCT SECTION.                           */ 00164001
*/*               THIS MAPPING IS INVOKED BY CALLING ERBPRO MACRO.   */ 00165001
*/*            4. THE RMF CONTROL SECTIONS                           */ 00166001
*/*            5. THE RMF DATA SECTIONS                              */ 00167001
*/*                                                                  */ 00168001
*/* NOTES : NONE                                                     */ 00169001
*/*                                                                  */ 00170001
*/* MODULE-TYPE = BILINGUAL MAPPING MACRO                            */ 00171001
*/*                                                                  */ 00172001
*/* CHANGE-ACTIVITY =                                                */ 00173001
*/*                                                                  */ 00174001
*/* METHOD OF INVOCATION = SEE BELOW                                 */ 00175001
*/*                                                                  */ 00176001
*/*    PLS - %INCLUDE SYSLIB(ERBSMF73)                               */ 00177001
*/*                                                                  */ 00178001
*/* DISTRIBUTION LIBRARY: ARMFMAC1                               @B1A*/ 00179001
*/*                                                                  */ 00180001
*/* CHANGE-ACTIVITY =                                                */ 00181001
*/*                                                                  */ 00182001
*/* $N0=SMFFORMT,HRM3102,,FRS: NEW FOR RMF 3.1                   @N0A*/ 00183001
*/* $N1=PP,HRM3102,,NEL: PARTIAL STATISTICS ADDED                    */ 00184001
*/* $P1=SRM,HRM3302,,THE: SRM SERVICE (SAD-STCPS)                @P1A*/ 00185001
*/* $Z1=OY29112,HRM4420,,WRC: ESCA BASIS                         @Z1A*/ 00186001
*/* $Z2=OY29112,HRM4420,,WRC: SERIAL & SWITCH SUPPORT            @Z2A*/ 00187001
*/* $A1=DYNIO,JRM4421,,AB: DYNAMIC I/O SUPPORT                   @A1A*/ 00188001
*/*   RV, adjustment for dynamic I/O                         @YA45991*/ 00189001
*/* $BA=MIF,JRM4422,,BHL: ESCON Multiple Image Facility SPE      @BAA*/ 00190001
*/* $B1=R430,HRM4430,,BHL: Distribution lib in prolog            @B1A*/ 00191001
*/* LGO: Include CTC Types                                   @YA55031*/ 00192001
*/* LAN: Comment changes only (IODF creation date & time)    @YA64585*/ 00193001
*/* $C1=NEWCH,HRM5510,,FF: New channel support (OSA,ISC,Pacer)   @C1A*/ 00194001
*/* $D1=NEWISD,HRM5520,,FF: Integrated System Device         @WA10257*/ 00195001
*/* AJU: Actualize SMF73CPD comments                         @WA18557*/ 00196291
*/* THE: Year 2000 support. IODF creation date.              @WA19913*/ 00196581
*/* $G1=ACR,HRM6606,,PS: Channel Type Support                    @G1A*/         
*/* $H1=FICON,HRM6607,,PS:  Fibre Channel Support                @H1A*/         
*/* $I1=DCM,HRM7703,,SHR: Dynamic CHPID Management support       @I1A*/         
*/*                                                                  */ 00197001
*/**** END OF SPECIFICATIONS *****************************************/ 00198001
*/*LENGTH FORMULA = SMF73HPS+(SMF73HPL*SMF73HPN)                     */ 00199001
*    /* COMMON SMF HEADER */                                            00200001
*?ERBHDR TYPE(73) ATTRIBUT(BASED(SMF73PTR));                            00201001
*    /* INDIVIDUAL HEADER EXTENTION */                                  00202001
*      2 SMF73HDX,                /* HEADER EXTENTION                */ 00203001
*        3 SMF73HIS FIXED(31),    /* OFFSET TO CHANNEL PATH CONTROL     00204001
*                                    SECTION                         */ 00205001
*        3 SMF73HIL FIXED(15),    /* LENGTH OF CHANNEL PATH CONTROL     00206001
*                                    SECTION                         */ 00207001
*        3 SMF73HIN FIXED(15),    /* NUMBER OF CHANNEL PATH CONTROL     00208001
*                                    SECTIONS                        */ 00209001
*        3 SMF73HPS FIXED(31),    /* OFFSET TO CHANNEL PATH DATA        00210001
*                                    SECTION                         */ 00211001
*        3 SMF73HPL FIXED(15),    /* LENGTH OF CHANNEL PATH DATA        00212001
*                                    SECTION                         */ 00213001
*        3 SMF73HPN FIXED(15);    /* NUMBER OF CHANNEL PATH DATA        00214001
*                                    SECTIONS                        */ 00215001
*    /* COMMON RMF PRODUCT SECTION */                                   00216001
*?ERBPRO TYPE(73) ATTRIBUT(BASED(ADDR(SMF73HDR)+SMF73PRS));             00217001
*    /* CHANNEL PATH CONTROL SECTION */                                 00218001
*   DCL 1 SMF73CTL BASED(ADDR(SMF73HDR)+SMF73HIS),                      00219001
*        3 SMF73SMP FIXED(32),    /* NUMBER OF SAMPLES, WEIGHTED BY     00220001
*                                    SRM.                        @P1C*/ 00221001
*        3 SMF73CFL BIT(8),         /* Configuration change flags       00222001
*                                                                @A1A*/ 00223001
*          5 SMF73DCA BIT(1),       /* Configuration changed     @A1A*/ 00224001
*          5 SMF73IAC BIT(1),       /* Configuration changed since      00225001
*                                      last IPL                  @A1A*/ 00226001
*          5 SMF73IOD BIT(1),       /* System IPLed via IODF     @A1A*/ 00227001
*          5 SMF73ICV BIT(1),       /* I/O Token is valid        @A1A*/ 00228001
*          5 SMF73REP BIT(1),       /* Record may include invalid       00229001
*                                      data sections         @YA45991*/ 00230001
*          5 SMF73CMF BIT(1),       /* CPMF available            @BAA*/ 00231001
*          5 SMF73MCG BIT(1),       /* Reserved for RMF use      @BAA*/ 00232001
*          5 SMF73CMC BIT(1),       /* CPMF mode change used for        00233001
*                                      duration report           @H1A*/ 00233001
*        3 SMF73SFL BIT(8),         /* Status flags              @I1A*/ 00234001
*          5 SMF73CMH BIT(1),       /* DCM supported by the hardware    00224001
*                                                                @I1A*/ 00226001
*          5 SMF73CMD BIT(1),       /* Configuration contains DCM       00225001
*                                      managed channels          @I1A*/ 00225001
*          5 *        BIT(6),       /* Reserved for future use   @I1A*/ 00225001
*        3 *        CHAR(2),        /* Reserved for future use   @I1C*/ 00234001
*        3 SMF73TNM CHAR(44),       /* IODF name                 @A1A*/ 00235001
*        3 SMF73TSF CHAR(2),        /* Suffix of IODF Name       @A1A*/ 00236001
*        3 *        CHAR(2),        /* Reserved                  @A1A*/ 00237001
*        3 SMF73TOK CHAR(16),       /* Partially Token Info.     @A1A*/ 00238001
*          5 SMF73TDT CHAR(8),      /* IODF creation date mm/dd/yy      00239001
*                                                            @YA64585*/ 00240001
*          5 SMF73TTM CHAR(8),      /* IODF creation time hh.mm.ss      00241001
*                                                            @YA64585*/ 00242001
*        3 SMF73CRC FIXED(32),      /* Count of times SRM has           00243001
*                                      restarted the Channel Path       00244001
*                                      Measurement Facility (CPMF).     00245001
*                                                                @BAA*/ 00246001
*        3 SMF73CSC FIXED(32),      /* Last CPMF sample count    @BAA*/ 00247191
*        3 SMF73TDY CHAR(10),       /* IODF creation date               00247381
*                                      mm/dd/yyyy            @WA19913*/ 00247571
*        3 SMF73CMI FIXED(8),       /* CPMF mode info                           
*                                      0 - CPMF not active                      
*                                      1 - Compatibility Mode                   
*                                      2 - Extended Mode         @H1A*/         
*        3 *        CHAR(1);        /* Reserved                  @H1C*/ 00247761
*    /* CHANNEL PATH DATA SECTION */                                    00248001
*   %IF SMFARRAY ='YES' %THEN %GOTO ARR73;                              00249001
*  DCL 1 SMF73CHA BASED(ADDR(SMF73HDR)+SMF73HPS),                       00250001
*       %GOTO CONT73;                                                   00251001
*%ARR73:;                                                               00252001
*  DCL 1 SMF73CHA(*) BASED(ADDR(SMF73HDR)+SMF73HPS),                    00253001
*%CONT73:;                                                              00254001
*        3 SMF73PID CHAR(1),      /* CHANNEL PATH IDENTIFICATIONS.      00255001
*                                    THE RANGE OF VALUES IS 0 TO FF  */ 00256001
*        3 SMF73FG2 BIT(8),       /* CHANNEL FLAGS                   */ 00257001
*          5 SMF73RV3 BIT(2),     /* RESERVED, USED BY DUCHA @WA05544*/ 00258001
*          5 SMF73BL  BIT(1),     /* BLOCK MULTIPLEXOR               */ 00259001
*          5 SMF73BY  BIT(1),     /* BYTE MULTIPLEXOR                */ 00260001
*          5 SMF73RV4 BIT(1),     /* RESERVED                    @N1C*/ 00261001
*          5 SMF73PAR BIT(1),     /* ONLY PARTIAL STATISTICS     @N1A*/ 00262001
*          5 SMF73VAC BIT(1),     /* DATA INVALID. CHANNEL PATH WAS     00263001
*                                    VARIED DURING INTERVAL          */ 00264001
*          5 SMF73STA BIT(1),     /* CHANNEL PATH IS CURRENTLY ONLINE*/ 00265001
*        3 SMF73FG3 BIT(8),         /* Channel flags extension   @Z1A*/ 00266001
*          5 SMF73CNC BIT(1),     /* ES CONNECTION CHANNEL       @Z2A*/ 00267001
*          5 SMF73DOC BIT(1),     /* ES CONNECTION DIRECTOR ATTACHED    00268001
*                                    TO CHANNEL PATH             @Z2A*/ 00269001
*          5 SMF73CVC BIT(1),     /* ES CONVERSION CHANNEL       @Z1A*/ 00270001
*          5 SMF73MOD BIT(1),       /* Channel path modified     @A1A*/ 00271001
*          5 SMF73DEL BIT(1),       /* Channel path deleted      @A1A*/ 00272001
*          5 SMF73INS BIT(1),       /* Channel path inserted     @A1A*/ 00273001
*          5 SMF73VLD BIT(1),       /* Valid Path            @YA45991*/ 00274001
*          5 SMF73SHR BIT(1),       /* Channel path is shared between   00275001
*                                      logical partitions.       @BAA*/ 00276001
*        3 SMF73FG4 BIT(8),         /* Channel path flags        @BAC*/ 00277001
*          5 SMF73NVL BIT(1),       /* Entry in CPMB was not valid      00278001
*                                                                @BAA*/ 00279001
*          5 SMF73CC  BIT(1),       /* Channel path is CTC defined.     00280001
*                                                            @YA55031*/ 00281001
*          5 SMF73FXT BIT(1),       /* Channel conversion 3090   @C1A*/ 00282001
*          5 *        BIT(1),       /* Reserved                  @I1A*/ 00283001
*          5 SMF73CPM BIT(1),       /* Channel path is DCM managed      00282001
*                                                                @I1A*/ 00282001
*          5 *        BIT(3),       /* Reserved                  @I1C*/ 00283001
*        3 SMF73BSY FIXED(32),    /* NUMBER OF SAMPLES IN WICH THE      00284001
*                                    CHANNEL PATH WAS BUSY. WEIGHTED    00285001
*                                    BY SRM.                     @P1C*/ 00286001
*        3 SMF73PBY FIXED(32),    /* Partition's channel path busy      00287001
*                                    time since last interval (in       00288001
*                                    units of 1024 microseconds) @BAA*/ 00289001
*        3 SMF73PTI FIXED(32),    /* Channel path measurement           00290001
*                                    interval (in units of              00291001
*                                    1024 microseconds)          @BAA*/ 00292001
*        3 SMF73CPD FIXED(8),     /* Channel path description.          00293001
*                                    For an explanation, you can        00294001
*                                    issue the command D M=CHP.  @G1C*/ 00295001
*                                 /*                           12@G1D*/ 00299001
*        3 SMF73ACR CHAR(5),      /* Channel Path Acronym        @G1C*/         
*        3 SMF73CMG FIXED(8),     /* CPMF Channel Measurement                   
*                                    Group                       @H1A*/         
*        3 SMF73FG5 BIT(8),       /* Channel path Flags          @H1C*/         
*          5 SMF73MBV BIT(1),     /* CPMF Maximum Bus cyles Valid               
*                                                                @H1C*/         
*          5 SMF73MCV BIT(1),     /* CPMF Maximum Channel work                  
*                                    units Valid                 @H1C*/         
*          5 SMF73MWV BIT(1),     /* CPMF Maximum Write data                    
*                                    units Valid                 @H1C*/         
*          5 SMF73MRV BIT(1),     /* CPMF Maximum Read data units               
*                                    Valid                       @H1C*/         
*          5 SMF73USV BIT(1),     /* CPMF data Unit Size Valid   @H1C*/         
*          5 *        BIT(3),     /* Reserved for future use     @H1C*/         
*        3 SMF73CCM CHAR(48),     /* CPMF Channel Measurements          00312001
*                                    extended mode               @I1C*/         
*        3 SMF73CPP FIXED(8),     /* Channel path parameter      @I1A*/         
*        3 * CHAR(3);             /* Reserved                    @I1A*/ 00312001
*                                                                               
*  DCL 1 SMF73CM1 CHAR(48) BDY(WORD) BASED(ADDR(SMF73CCM)), /*          00253001
*                                    Channel data                               
*                                    Measurement group 1         @H1A*/         
*        ?ERBFITEM(3 SMF73TUT) FLOAT(24);, /*                                   
*                                    CPMF Total channel path                    
*                                    busy Time in units of 128                  
*                                    microseconds                               
*                                    short floating point        @H1A*/         
*        ?ERBFITEM(3 SMF73PUT) FLOAT(24);, /*                                   
*                                    CPMF LPAR channel path                     
*                                    busy Time in units of 128                  
*                                    microseconds                               
*                                    short floating point        @H1A*/         
*        3 *        CHAR(40);     /* Reserved                    @H1A*/         
*                                                                               
*  DCL 1 SMF73CM2 CHAR(48) BDY(WORD) BASED(ADDR(SMF73CCM)), /*          00253001
*                                    Channel data                               
*                                    data Measurement group 2    @H1A*/         
*        3 SMF73CCC,              /* CPMF Channel Characteristics               
*                                    data                        @H1A*/         
*          ?ERBFITEM(5 SMF73MBC) FLOAT(24);, /*                                 
*                                    CPMF Maximum Bus Cycles                    
*                                    per second                                 
*                                    short floating point        @H1A*/         
*          ?ERBFITEM(5 SMF73MCU) FLOAT(24);, /*                                 
*                                    CPMF Maximum Channel work                  
*                                    Units per second                           
*                                    short floating point        @H1A*/         
*          ?ERBFITEM(5 SMF73MWU) FLOAT(24);, /*                                 
*                                    CPMF Maximum Write data                    
*                                    Units per second                           
*                                    short floating point        @H1A*/         
*          ?ERBFITEM(5 SMF73MRU) FLOAT(24);, /*                                 
*                                    CPMF Maximum Read data                     
*                                    Units per second                           
*                                    short floating point        @H1A*/         
*          ?ERBFITEM(5 SMF73US) FLOAT(24);, /*                                  
*                                    CPMF data Unit Size in bytes               
*                                    short floating point        @H1A*/         
*                                                                               
*        3 SMF73CCD,              /* CPMF Channel measurement                   
*                                    group 2 Data                @H1A*/         
*          ?ERBFITEM(5 SMF73TBC) FLOAT(24);, /*                                 
*                                    CPMF Total Bus Cycles count                
*                                    short floating point        @H1A*/         
*          ?ERBFITEM(5 SMF73TUC) FLOAT(24);, /*                                 
*                                    CPMF Total channel work                    
*                                    Unit Count                                 
*                                    short floating point        @H1A*/         
*          ?ERBFITEM(5 SMF73PUC) FLOAT(24);, /*                                 
*                                    CPMF LPAR channel work Units               
*                                    Count short floating point  @H1A*/         
*          ?ERBFITEM(5 SMF73TWU) FLOAT(24);, /*                                 
*                                    CPMF Total Write data Units                
*                                    count short floating point  @H1A*/         
*          ?ERBFITEM(5 SMF73PWU) FLOAT(24);, /*                                 
*                                    CPMF LPAR Write data Units                 
*                                    count short floating point  @H1A*/         
*          ?ERBFITEM(5 SMF73TRU) FLOAT(24);, /*                                 
*                                    CPMF Total Read data Units                 
*                                    count short floating point  @H1A*/         
*          ?ERBFITEM(5 SMF73PRU) FLOAT(24);; /*                                 
*                                    CPMF LPAR Read data Units                  
*                                    count short floating point  @H1A*/         
*   DECLARE                                                                     
*   @SPACE;                                                                     
*     SMF73_ACR_LEN FIXED(31) CONSTANT(OFFSET(SMF73ACR)); /*                    
*                                      OFFSET of SMF73ACR        @G1A*/         
