*%GOTO   PLSMACRO;  /*                                                  00001000
         MACRO                                                          00002000
         ERBSMF79                                                       00003000
***** START OF SPECIFICATIONS ***************************************** 00004000
*                                                                     * 00005000
*   Macro Name: ERBSMF79                                              * 00006000
*                                                                     * 00007000
*   Descriptive Name: Mapping Macro for SMF record type 79            * 00008000
*                     (Monitor II)                                    * 00009000
*                                                                     * 00010000
*   DSECT names: SMF79HDR, SMF79PRO, R79CHL,                          * 00011000
*                R791ELEM,                                            * 00012000
*                R792ELEM,                                            * 00013000
*                R793,                                                * 00014000
*                R794,                                                * 00015000
*                R795ELEM,                                            * 00016000
*                R796ELEM,                                            * 00017000
*                R797ELEM,                                            * 00018000
*                R798ELEM,                                            * 00019000
*                R799ELEM,                                            * 00020000
*                R79AELEM,                                            * 00021000
*                R79BCNTL, R79BELEM,                                  * 00022000
*                R79CCNTL, R79CCHNL,                                  * 00023000
*                R79DCS, R79DCPD, R79DDS,                             * 00024000
*                R79EGD, R79ECS, R79ECPD, R79EDS                      * 00025000
*                R79FIRLM                                         @F1A* 00026000
*                                                                     * 00027000
*   Component: 27404                                                  * 00028000
*                                                                     * 00029000
         ERBCOPY1 Y1=1983                                         @A1C* 00030000
*                                                                     * 00031000
*   Function: This macro maps the complete SMF record                 * 00032000
*             type 79. The record consists of 5 parts:                * 00033000
*             1. The fixed portion of the SMF header.                 * 00034000
*                This mapping is invoked by calling macro ERBHDR.     * 00035000
*             2. The individual header extension which                * 00036000
*                contains offset/length/number triplets               * 00037000
*                to address the record parts following the            * 00038000
*                RMF product section.                                 * 00039000
*             3. The RMF product section.                             * 00040000
*                This mapping is invoked by calling macro ERBPRO.     * 00041000
*             4. The RMF data control section.                        * 00042000
*             5. The RMF data sections.                               * 00043000
*                                                                     * 00044000
*   Notes: None                                                       * 00045000
*                                                                     * 00046000
*   Method of access: See below                                       * 00047000
*                                                                     * 00048000
*   BAL: ERBSMF79                                                     * 00049000
*                                                                     * 00050000
*   Created by: ERBPCTBL                                              * 00051000
*                                                                     * 00052000
*   Pointed to by: local pointer                                      * 00053000
*                                                                     * 00054000
*   Subpool and Key: Subpool MFSBSUBP                                 * 00055000
*                                                                     * 00056000
*   Serialization: None                                               * 00057000
*                                                                     * 00058000
*   Size:  SMF79HDR   68                                              * 00059000
*          SMF79PRO   52                                              * 00060000
*          R79CHL    104                                              * 00061000
*          R791ELEM  164                                          @D2C* 00062000
*          R792ELEM  154                                          @C1C* 00063000
*          R793       54                                              * 00064000
*          R794      108                                          @Y4C* 00065000
*          R795ELEM   79                                          @C1C* 00066000
*          R796ELEM   86                                          @C2C* 00067000
*          R797ELEM   92                                              * 00068000
*          R798ELEM   52                                              * 00069000
*          R799ELEM  100                                          @G2C* 00070000
*          R79AELEM   64                                          @Y4C* 00071000
*          R79BCNTL    4                                              * 00072000
*          R79BELEM   98                                          @C2C* 00073000
*          R79CCNTL   16                                          @BAC* 00074000
*          R79CCHNL   24                                          @G1C* 00075000
*          R79DCS     12                                              * 00076000
*          R79DCPD    12                                              * 00077000
*          R79DDS     32                                              * 00078000
*          R79EGD      8                                              * 00079000
*          R79ECS     12                                              * 00080000
*          R79ECPD    32                                          @Z1C* 00081000
*          R79EDS     32                                          @I3C* 00082000
*          R79FIRLM   103                                         @F1A* 00083000
*                                                                     * 00084000
*   Deleted by:                                                       * 00085000
*                                                                     * 00086000
*   Distribution Library: ARMFMAC1                                    * 00087000
*                                                                     * 00088000
*   Change Activity: See below                                        * 00089000
*                                                                     * 00090000
*   $N0=MON1,HRM3102,,WBS: NEW FOR RMF 3.1                        @N0A* 00091000
*   CHANGE DECLARE FOR R79ACIDX SO THE VALUE IS UNSIGNED      @ZA69833* 00092000
*   REDEFINE R79IST                                           @ZA70287* 00093000
*   $O1=4381,JRM3212,,SHR: 4381 - SUPPORT                         @O1A* 00094000
*   $P1=SRM,HRM3302,,THE: SRM - SUPPORT  (SAD-STCPS)              @P1A* 00095000
*   $P2=ES,HRM3302,,KLZ: CHANGED LAYOUT / EXTENDED STORAGE        @P2A* 00096000
*   $P3=MON2,HRM3302,,FRY: CHANGED LAYOUT / DOMAIN REPORT         @P3A* 00097000
*   $P4=3090,HRM3302,,WEY: 3090 support                           @P4A* 00098000
*   $P5=3090,HRM3302,,MLN: 3090 support                           @P5A* 00099000
*   $E1=3351P,HRM3302,,FLJ: Support for 3351P                     @E1A* 00100000
*   $P6=ES,HRM3302,,KLZ: PTM   PA70089  / EXTENDED STORAGE        @P6A* 00101000
*   $Q1=MISC,HRM3402,,MLN: Converted to global ENQ                @Q1A* 00102000
*   $S1=TRQ,JRM3412,,WRC: Support for SP2.1.7 True Ready Queue    @S1A* 00103000
*   $Q2=MIG,HRM3402,,HEN: R794MAGE is moved and changed to            * 00104000
*                         fixed 31.                      OZ95298  @Q2A* 00105000
*   NO CHANGE - RESHIPPED TO SUPERCEDE OZ95298                @ZA98025* 00106000
*   $R0=220SUP,JRM3422,,WRC: SUPPORT FOR MVS SP2.2.0              @R0A* 00107000
*   $U1=SGSUP,JRM3512,,KLZ: Storage Group support                 @U1A* 00108000
*   $U2=UCBDMC,JRM3512,,TJI: UCBDMC constraint relief             @U2A* 00109000
*   $W1=SP310,HRM4410,,SOT: MVS SP 3.1.0 support                  @W1A* 00110000
*   $W2=SP310,HRM4410,,PAE: IARXC return code handling            @W2A* 00111000
*   $W3=LSCR,HRM4410,,BHL: Large systems constraint relief        @W3A* 00112000
*   $W4=APAR,HRM4410,,SOT: Integration of APAR OY05739            @W4A* 00113000
*   $W5=MISC,HRM4410,,PAE: ASCB frame count constraint relief     @W5A* 00114000
*   $W6=MISC,JRM4411,,SHR: Clean up to reduce compiler messages   @W6A* 00115000
*   $W7=SP310E,JRM4411,,PAE: MVS SP 3.1.0E Support                @W7A* 00116000
*   $W8=SP310E,JRM4411,,PAE: Stor isolation for ESO hiperspaces   @W8A* 00117000
*   $Y1=DMSR,HRM4420,,CLL: Model Type (SHARE SOMVSP87001)         @Y1A* 00118000
*   $Y2=LJM,HRM4420,,LAH: Large Job Management Support            @Y2A* 00119000
*   Expanded storage frame count constraint relief            @YA28328* 00120000
*   Support for MVS/ESA Large Job Management SPE              @YA20560* 00121000
*   $Z1=OY29112,HRM4420,,WRC: ESCA Basis                          @Z1A* 00122000
*   $Z2=OY29112,HRM4420,,WRC: Serial & Switch Supprt              @Z2A* 00123000
*   SHR: Include FLPA/EFLPA frames and real frame zero        @YA34458* 00124000
*   $A1=APPC,JRM4421,,BAJU: APPC tolerating support               @A1A* 00125000
*   $A2=WSET,JRM4421,,BB: Working Set Management / Block Paging   @A2A* 00126000
*   $A3=WSET,JRM4421,,RTN: Working Set Management / Block Paging  @A3A* 00127000
*   $A9=MISC,JRM4422,,DPN: Recompile                              @A9A* 00128000
*   RN:  Increases max number of channel paths per LCU to 8   @YA41310* 00129000
*   GBO: Fix 0C9 calculating AVERAGE TRANSACTION TIME         @YA41781* 00130000
*   PFU: Insert 4 Byte Field for EXCP count                   @YA42170* 00131000
*   $B1=R430,HRM4430,,HOL: Modifies DISTLIB statement             @B1A* 00132000
*   $B2=OMVS,HRM4430,,RPT: OPEN/MVS Toleration Support            @B2A* 00133000
*   $BA=MIF,JRM4422,,BHL: ESCON Multiple Image Facility SPE       @BAA* 00134000
*   LGO: INCLUDE CTC TYPES                                    @YA55031* 00135000
*   $C1=WLM2,HRM4440,,HKH: WLM support, subtypes 1, 2, 5, 8       @C1A* 00136000
*   $C2=4KUCB,HRM4440,,FF: Four Digit Device Numbers (>4K UCB)    @C2A* 00137000
*   LAN: Increase max number of channel paths for 308X/4381   @YA61897* 00138000
*   $C3=NEWCH,HRM5510,,FF: New channel support (OSA,ISC,Pacer)    @C3A* 00139000
*   HUE: ABEND0C9 in ERBRDEV due to invalid data because      @YA66876* 00140000
*        Mon I interval ended while ERBGDEV accessed EDDBB    @YA66876* 00141000
*   HUE: correct incompatible change from @YA55031            @YA67090* 00142000
*        may cause PP convertion errors (430 to 510), FF      @YA67090* 00143000
*   FF:  KRO0397: 0C4 with Reason Code 10 in ERBGENQR         @WA02579* 00144000
*   HUE: ABEND0C9 when dividing TCB time (from ASCBEJST)      @WA03326* 00145000
*        by 1000 as result does not fit in 31 bit field       @WA03326* 00146000
*        Equivalent to OW02302                                @WA03326* 00147000
*   BHL: LPAR enhancements                                    @WA05435* 00148000
* $D1=CAP,HRM5520,,JKE: Captured Storage support                  @D1A* 00149000
* $D2=R79,HRM5520,,DK: SMF Record 79(1) Enhancement for SDSF      @D2A* 00150000
* $D3=NEWISD,HRM5520,,FF: Integrated System Device            @WA10257* 00151000
*   SUW: Add new Flag R799DTF - Device connect or pending or  @WA15094* 00152000
*                               disconnect time is invalid    @WA15094* 00153000
* $E1=IPM,OW17898,,HBE: Enabling of M II reports                  @E1A* 00154000
*   AJU: Corrects comment for R793DQ and R792EXCT+R791EXCT    @WA19913* 00155000
* $E2=MISC,HRM6603,,HOL: Preemptable SRB support                  @E2A* 00156000
* $F1=IRLM,HRM6604,,HOL: IMS Long Lock Report                     @F1A* 00157000
* GUB: Additional field in 79.15 record                       @WA27252* 00158000
* FDL: Add ORG for header adjustment (PMR16340)               @WA28830* 00159000
* $G1=ACR,HRM6606,,PS: Channel Type Support                       @G1A* 00160000
* $G2=PAV,HRM6606,,PS: PAV device support                         @G2A* 00161000
* $H1=FICON,HRM6607,,PS:  Fibre Channel Support                   @H1A* 00162000
* $I1=MISC,HRM7703,,FDL: Correct comments on R79xCL               @I1A* 00163000
* $I2=TBIT,HRM7703,,SHR: Honors T-bit in SCHIB                    @I2A* 00164000
*  PS: R79CCPTS to small for values bigger than 16MB          @WA39393* 00165000
* SHR: PAV device support                                     @WA31701* 00166000
* $I3=DCM,HRM7703,,SHR: Dynamic CHPID Management support          @I3A* 00167000
* $I4=WLM,HRM7703,,HOL: SDSF Support                              @I4A* 00168000
* $I5=BIT64,HRM7703,,VTH: 64 Bit real support                     @I5A* 00169000
* GUB: WLM goal mode inhibitor removal                        @WA46476* 00170290
* GUB: Temporal affinity                                      @WA46622* 00170390
*                                                                     * 00170580
****** END OF SPECIFICATIONS ****************************************** 00171000
*  LENGTH FORMULA = SMF79ASS+(SMF79ASL*SMF79ASN)                        00172000
         SPACE 3                                                        00173000
**********************  COMMON SMF HEADER  **************************** 00174000
         ERBHDR 79                                                      00175000
         SPACE 3                                                        00176000
**********************  INDIVIDUAL HEADER EXTENSION  ****************** 00177000
SMF79MCS DS    F -                OFFSET TO MONITOR II CONTROL SECTION  00178000
SMF79MCL DS    H -                LENGTH OF MONITOR II CONTROL SECTION  00179000
SMF79MCN DS    H -                NUMBER OF MONITOR II CONTROL SECTION  00180000
SMF79ASS DS    F -                OFFSET TO DATA SECTION                00181000
SMF79ASL DS    H -                LENGTH OF DATA SECTION                00182000
SMF79ASN DS    H -                NUMBER OF DATA SECTION                00183000
SMF79DCS DS    F -                OFFSET TO DATA CONTROL SECTION        00184000
SMF79DCL DS    H -                LENGTH OF DATA CONTROL SECTION        00185000
SMF79DCN DS    H -                NUMBER OF DATA CONTROL SECTION        00186000
SMF79QSS DS    F -                OFFSET TO I/O QUEUING GLBL.SECT. @P4A 00187000
SMF79QSL DS    H -                LENGTH OF I/O QUEUING GLBL.SECT. @P4A 00188000
SMF79QSN DS    H -                NUMBER OF I/O QUEUING GLBL.SECT. @P4A 00189000
SMF79ENX EQU   *                  End of ind. header extension @WA28830 00190000
         SPACE 3                                                        00191000
**********************  Special 79.F Header Extension ***************** 00192000
         ORG   SMF79MCS                                            @F1A 00193000
SMF79FHX DS    0XL8                                            @WA28830 00194000
SMF79FPO DS    F                  Offset to IMS Long Lock Data Sct @F1A 00195000
SMF79FPL DS    H                  Length of IMS Long Lock Data Sct @F1A 00196000
SMF79FPN DS    H                  Number of IMS Long Lock Data Sct @F1A 00197000
SMF79FNX EQU   *                  End of 79.F header extension @WA28830 00198000
         ORG   SMF79ENX                                        @WA28830 00199000
         SPACE 3                                                        00200000
**********************  COMMON SMF PRODUCT SECTION  ******************* 00201000
         ERBPRO 79                                                      00202000
         SPACE 3                                                        00203000
**********************  MONITOR II CONTROL SECTION  ******************* 00204000
R79CHL   DSECT                    COMMON RECORD 79 HEADER               00205000
R79GTOD  DS    XL4 -              DATA GATHERER CALL TOD                00206000
R79LF2   DS    XL1 -              FLAG BYTE                             00207000
R79PAR   EQU   X'80' -            NOT ENOUGH RELOCATE SECTION TO        00208000
R79SG    EQU   X'40' -            Report to be sorted by SG        @U1A 00209000
R79RSM   EQU   X'20' -            Invalid RSM data obtained        @W2A 00210000
R79GOAL  EQU   X'10' -            System is in GOAL mode           @C1A 00211000
R79TRXI  EQU   X'08' -            Invalid transaction data         @C1A 00212000
R79SRMC  EQU   X'04' -            SRM mode changed                 @C1A 00213000
R79INV   EQU   X'02' -            invalid data from Mon I      @YA66876 00214000
*                                 (DEV PGSP IOQ)               @YA66876 00215000
*                                 COMPLETE DATA GATHERING               00216000
R79RV1   DS    XL1 -              RESERVED                              00217000
R79SES   DS    CL2 -              SESSION NAME                          00218000
R79RSV   DS    XL2 -              RESERVED                              00219000
R79USER  DS    XL2 -              USER FIELD                            00220000
R79RID   DS    CL8 -              MEASUREMENT NAME                      00221000
R79CTXTL DS    XL2 -              LEN OF COMMAND TEXT                   00222000
R79CTEXT DS    CL32 -             COMMAND TEXT                          00223000
R79DTXTL DS    XL2 -              LEN OF DEFAULT DR TEXT                00224000
R79DTEXT DS    CL32 -             DEFAULT DR TEXT                       00225000
R79IST   DS    CL4 -              MONITOR I INTERVAL START TIME         00226000
*                                 IN 0HHMMSSF FORMAT   @ZA70287         00227000
R79TSR   DS    XL2                Total number of small records    @W3A 00228000
         DS    XL2                Reserved for future use          @W3A 00229000
R79TOT   DS    XL4                Total number of data sections in      00230000
*                                 large record                     @W3A 00231000
R79NXT   DS    XL4                Number of data sections in following  00232000
*                                 small records                    @W3A 00233000
R79IWMTK DS    CL8                Token returned from IWMRCOLL          00234000
*                                 service                          @C1A 00235000
*                                                                       00236000
.STYP1   ANOP                                                           00237000
*                                                                       00238000
*        RELOCATE BLOCK FOR SUBTYPE 1                                   00239000
*                                                                       00240000
R791ELEM DSECT                    MAPPING OF ELEMENT                    00241000
R791ASID DS    XL2                ADDRESS SPACE IDENTIFIER              00242000
R791JBN  DS    CL8                NAME OF JOB                           00243000
R791DMN  DS    XL2                DOMAIN NUMBER                         00244000
*                                 not applicable in GOAL mode      @C1C 00245000
R791NPG  DS    XL2                PERFORMANCE GROUP                     00246000
*                                 not applicable in GOAL mode      @C1C 00247000
R791PGP  DS    XL2                PERFORMANCE GROUP PERIOD              00248000
*                                 not applicable in GOAL mode      @C1C 00249000
R791TTOD DS    XL4                REAL TIME INTO TRANSACTION            00250000
*                                 (MILLISECONDS)                        00251000
*                                 not used since rel 330                00252000
*                                                                       00253000
R791CL   DS    CL2                CURRENT LOCATION                      00254000
*                                                                       00255000
*                              CONTENTS   MEANING                       00256000
*                              --------   -------                       00257000
*                                   IN  - IN STORAGE                    00258000
*                                   OT  - SWAPPED OUT AND READY         00259000
*                                   LO  - LOGICALLY SWAPPED    @G537NLS 00260000
*                                   NS  - NON-SWAPPABLE                 00261000
*                                   WM  - WAIT QUEUE/MSO                00262000
*                                   WL  - WAIT QUEUE/LONG WAIT          00263000
*                                   WT  - WAIT QUEUE/TERM WAIT          00264000
*                                   WO  - WAIT QUEUE/other reasons @I1A 00265000
*                                   DL  - TSO user delayed by SRM       00266000
*                                         to meet response time         00267000
*                                         objective                @I1A 00268000
*                                   PR  - PRIVILEGED                    00269000
*                                   >>  - TRANSITIONING OUT             00270000
*                                   <<  - TRANSITIONING IN              00271000
R791TAS  DS    XL2                TYPE OF USER                          00272000
*                                                                       00273000
*                              CONTENTS   MEANING                       00274000
*                              --------   -------                       00275000
*                                   0 - BATCH                           00276000
*                                   1 - STARTED TASK                    00277000
*                                   2 - MOUNT TASK                      00278000
*                                   3 - TSO                             00279000
*                                   4 - ASCH                       @A1A 00280000
*                                   5   OMVS                       @B2A 00281000
R791SRC  DS    CL2                REASON LAST SWAP OUT                  00282000
*                                                                       00283000
*                              CONTENTS   MEANING                       00284000
*                              --------   -------                       00285000
*                                   TI - TERMINAL INPUT                 00286000
*                                   TO - TERMINAL OUTPUT                00287000
*                                   LW - LONG WAIT                      00288000
*                                   XS - AUX STORAGE SHORT              00289000
*                                   RS - REAL STORAGE SHORT             00290000
*                                   DW - DETECTED WAIT                  00291000
*                                   RQ - REQUESTED SWAP                 00292000
*                                   NQ - CAP ENQ                        00293000
*                                   EX - CAP EXCHANGE                   00294000
*                                   US - CAP UNI-SWAP                   00295000
*                                   TS - TRANSITION SWAP       @ZA27329 00296000
*                                   IC - Improve central storage usage  00297000
*                                                                  @A3A 00298000
*                                   IP - Improve system paging rate     00299000
*                                                                  @A3A 00300000
*                                   MR - Make room to swap in an        00301000
*                                        out-too-long user         @A3A 00302000
*                                   AW - APPC wait                 @A1A 00303000
*                                   IW - OMVS input wait           @B2A 00304000
*                                   OW - OMVS output wait          @B2A 00305000
*                                   00 - UNKNOWN                        00306000
*                                                                       00307000
R791DP   DS    XL2 -              DISPATCHER PRIORITY                   00308000
R791SEQN DS    XL2                RESERVED                         @S1C 00309000
R791RSV1 DS    XL2                Reserved since 4.1.0             @W5C 00310000
R791RSV2 DS    XL2                Reserved since 4.1.0             @W5C 00311000
R791SWC  DS    XL2                TRANSACTION SWAP COUNT                00312000
R791SWMR DS    XL2                SRM WORKLOAD RECOM VALUE              00313000
         DS    XL2                Reserved                         @A3C 00314000
         DS    XL2                Reserved                         @A3C 00315000
R791WMS  DS    XL4                SRM SSERVICE FOR THE CURRENT          00316000
*                                 TRANSACTION SINCE THE LAST SWAP IN    00317000
R791TCPU DS    XL4                Total CPU time consumed on behalf     00318000
*                                 of this address space in milliseconds 00319000
*                                 (ascbejst+ascbsrbt+assbasst)     @E2C 00320000
*                                 wraps after 4 Giga millisec. @WA02302 00321000
         DS    XL2                Reserved                         @A3C 00322000
         DS    XL2                Reserved                     @YA28328 00323000
R791ESCT DS    XL4                Number of expanded storage frames     00324000
*                                 used by job                  @YA28328 00325000
R791RSV3 DS    XL2                Reserved since 4.1.0             @W5C 00326000
R791PIN  DS    XL4                Page in count                    @W1A 00327000
R791TRTM DS    XL4                Transaction residency time       @W1A 00328000
R791FLG  DS    XL1                Flags                            @W1A 00329000
R791XM   EQU   X'80'              -- Cross memory address space    @W1A 00330000
R791PMON EQU   X'40'              On = data in R791CTAR is valid.       00331000
*                                  Off = not valid.                @A3A 00332000
R791VALV EQU   X'20'              On = data in R791VAL is valid.        00333000
*                                  Off = not valid.                @A3A 00334000
R791GOAL EQU   X'10'              On = system is in GOAL mode      @C1A 00335000
R791SRV  EQU   X'08'              On = this address space is a          00336000
*                                 server address space             @C1A 00337000
*                                  Off = GOAL specified for this        00338000
*                                  address space is being honored       00339000
*                                  by WLM                          @C1A 00340000
R791QSC  EQU   X'04'              On = address space has been           00341000
*                                 quiesced by a RESET command      @C1A 00342000
R791TXME EQU   X'02'              Like RASDTRXNMGMTEXEMPT          @I4A 00343000
R791TAFF EQU   X'01'              On = address space has temporal       00343300
*                                 affinities, same as RASDTAF  @WA46622 00343600
R791FLG2 DS    XL1                Additional flags                 @I4C 00344000
R791CPRC EQU   X'80'              Same as RASDCPROTCPU             @I4A 00345000
R791CPRE EQU   X'40'              Same as RASDASPROTSTG            @I4A 00346000
R791CPRI EQU   X'20'              Same as RASDCPROTSTG             @I4A 00347000
R791CPUP EQU   X'10'              Same as RASDCPUPROTECTED         @I4A 00348000
R791STOP EQU   X'08'              Same as RASDSTGPROTECTED         @I4A 00349000
R791FMCT DS    XL4                NUMBER OF REAL STORAGE FRAMES    @W5A 00350000
R791WSS  DS    XL4                WORKING SET AT LAST SWAP IN      @W5A 00351000
R791TWSS DS    XL4                SRM TARGET WORKING SET SIZE      @W5A 00352000
R791ESHP DS    XL4                Number of hiperspace expanded storage 00353000
*                                 pages used by job                @W7A 00354000
R791ESVI DS    XL4                Number of VIO expanded storage        00355000
*                                 pages used by job                @W7A 00356000
R791HIN  DS    XL4                Number of hiperspace page ins    @W8A 00357000
R791HRMS DS    XL4                Number of ESO hiperspace read         00358000
*                                 misses by job                    @W8A 00359000
R791BPIN DS    XL4                Number of blocked pages brought       00360000
*                                  in from DASD                    @A3A 00361000
R791PINE DS    XL4                Number of pages brought in from       00362000
*                                  expanded storage                @A3A 00363000
R791BPNE DS    XL4                Number of blocked pages brought       00364000
*                                  in from expanded storage        @A3A 00365000
R791CTAR DS    XL4                Central storage target number of      00366000
*                                  frames                          @A3A 00367000
R791VAL  DS    XL4                Recommendation value for WSM          00368000
*                                  managed address spaces          @A3A 00369000
R791SCL  DS    CL8                Service class name               @C1A 00370000
R791SCP  DS    BL2                Service class period             @C1A 00371000
R791WKLD DS    CL8                Workload name                    @C1A 00372000
R791RGRP DS    CL8                Resource group name              @C1A 00373000
R791SPI  DS    XL4                Number of page-ins from               00374000
*                                 auxiliary storage                     00375000
*                                 for shared page groups           @D1A 00376000
R791CMNI DS    XL4                Number of common pages for current    00377000
*                                 transaction (= R792CMNI)         @D2A 00378000
R791PNV  DS    XL4                Number of non-vio pages for current   00379000
*                                 transaction (= R792PNV)          @D2A 00380000
R791PVIO DS    XL4                Number of vio pages for current       00381000
*                                 transaction (= R792PVIO)         @D2A 00382000
R791EXCT DS    XL4                EXCP count for                        00383000
*                                 this step (= R792EXCT)           @D2A 00384000
R791TCPC DS    XL4                Total CPU time consumed in this       00385000
*                                 address space in milliseconds         00386000
*                                 (ascbejst+ascbsrbt+assbphtm)     @E2A 00387000
R791ASST DS    XL4                CPU time consumed by preemptible-     00388000
*                                 class SRBs running on behalf of       00389000
*                                 this address space in milliseconds    00390000
*                                 (assbasst)                       @E2A 00391000
R791PHTM DS    XL4                CPU time consumed by preemptible-     00392000
*                                 class SRBs running in this address    00393000
*                                 space in milliseconds (assbphtm) @E2A 00394000
R791RCL  DS    CL8                Report class name                @I4A 00395000
R791RLEN EQU   *-R791ELEM         LENGTH OF ONE RELOCATE BLOCK          00396000
R791FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00397000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00398000
.STYP2   ANOP                                                           00399000
*                                                                       00400000
*        RELOCATE BLOCK FOR SUBTYPE 2                                   00401000
*                                                                       00402000
*                                                                       00403000
R792ELEM DSECT                    MAPPING OF ELEMENT                    00404000
R792ASID DS    XL2                ASID ADDRESS SPACE IDENTIFIER         00405000
R792JBN  DS    CL8                NAME OF JOB                           00406000
R792DMN  DS    XL2                DOMAIN NUMBER                         00407000
*                                 not applicable in GOAL mode      @C1C 00408000
R792NPG  DS    XL2                PERFORMANCE GROUP                     00409000
*                                 not applicable in GOAL mode      @C1C 00410000
R792CL   DS    CL2                CURRENT LOCATION                      00411000
*                                                                       00412000
*                              CONTENTS   MEANING                       00413000
*                              --------   -------                       00414000
*                                   IN  - IN STORAGE                    00415000
*                                   OT  - SWAPPED OUT AND READY         00416000
*                                   LO  - LOGICALLY SWAPPED             00417000
*                                   NS  - NON-SWAPPABLE                 00418000
*                                   WM  - WAIT QUEUE/MSO                00419000
*                                   WL  - WAIT QUEUE/LONG WAIT          00420000
*                                   WT  - WAIT QUEUE/TERM WAIT          00421000
*                                   WO  - WAIT QUEUE/other reasons @I1A 00422000
*                                   DL  - TSO user delayed by SRM       00423000
*                                         to meet response time         00424000
*                                         objective                @I1A 00425000
*                                   PR  - PRIVILEGED                    00426000
*                                   >>  - TRANSITIONING OUT             00427000
*                                   <<  - TRANSITIONING IN              00428000
*                                                                       00429000
*                                                                       00430000
R792TAS  DS    XL2                TYPE OF USER                          00431000
*                                                                       00432000
*                              CONTENTS   MEANING                       00433000
*                              --------   -------                       00434000
*                                   0 - BATCH                           00435000
*                                   1 - STARTED TASK                    00436000
*                                   2 - MOUNT TASK                      00437000
*                                   3 - TSO                             00438000
*                                                                       00439000
*                                   4 - ASCH                       @A1A 00440000
*                                   5 - OMVS                       @B2A 00441000
*                                                                       00442000
R792TRC  DS    XL2                TRANSACTION COUNT                     00443000
R792TTOD DS    XL4                TRANSACTION ELAPSED TIME,             00444000
*                                 IN MILLISECONDS                       00445000
R792PRFX DS    XL4                NUMBER OF PRIVATE FIXED FRAMES        00446000
R792RSV1 DS    XL2                Reserved since 4.1.0             @W5C 00447000
R792SVAR DS    XL4                SRM SERVICE ABSORPTION RATE FOR STEP  00448000
R792TCPU DS    XL4                TOTAL TCB TIME FOR STEP          @R0C 00449000
*                                 IN MILLISECONDS                  @R0A 00450000
*                                 wraps after 4 Giga millisec. @WA02302 00451000
R792PSS  DS    0CL8               STEP PRODUCT OF FRAME IN MILLISECONDS 00452000
R792PSS1 DS    XL4                HIGH ORDER WORD                       00453000
R792PSS2 DS    XL4                LOW ORDER WORD                        00454000
R792EJST DS    XL4                Total CPU time consumed on behalf     00455000
*                                 of this address space in millisecs.   00456000
*                                 (ascbejst+ascbsrbt+assbasst)     @E2C 00457000
*                                 wraps after 4 Giga millisec. @WA02302 00458000
R792TSRM DS    XL4                TOTAL SRM SERVICE FOR STEP            00459000
R792RTM  DS    XL4                RESIDENT TIME FOR STEP IN SECONDS     00460000
R792EXCP DS    XL2                EXCP COUNT FOR STEP                   00461000
R792CMNI DS    XL4                NUMBER OF COMMON PAGES FOR CURRENT    00462000
*                                 TRANSACTION                           00463000
R792PNV  DS    XL4                NUMBER OF NON-VIO PAGES FOR CURRENT   00464000
*                                 TRANSACTION                           00465000
R792PVIO DS    XL4                NUMBER OF VIO PAGES FOR CURRENT       00466000
*                                 TRANSACTION                           00467000
R792FXBL DS    XL4                NUMBER OF FIXED FRAMES WHICH ARE      00468000
*                                 LOCATED BELOW 16M REAL                00469000
R792PSWP DS    XL4                NUMBER OF PAGES SWAPPED IN FOR        00470000
*                                 CURRENT TRANSACTION                   00471000
R792LPAI DS    XL4                NUMBER OF LPA PAGES SWAPPED IN FOR    00472000
*                                 CURRENT TRANSACTION                   00473000
R792CSAI DS    XL4                NUMBER OF CSA PAGES SWAPPED IN FOR    00474000
*                                 CURRENT TRANSACTION                   00475000
R792LSQA DS    XL4                NUMBER OF LSQA FIXED FRAMES           00476000
R792NLQF DS    XL4                NUMBER OF NON-LSQA FIXED FRAMES       00477000
R792TDEV DS    XL4                TOTAL DEVICE CONNECT TIME IN          00478000
*                                 MILLISECONDS                          00479000
R792RSV2 DS    XL2                Reserved since 4.1.0             @W5C 00480000
R792PIN  DS    XL4                PAGE-IN COUNT                         00481000
R792TRTM DS    XL4                TRANSACTION RESIDENCY TIME            00482000
R792FLG  DS    XL1                FLAGS:                                00483000
R792XM   EQU   X'80'              -- CROSS MEMORY ADDRESS SPACE         00484000
R792RSM  EQU   X'40'              Invalid RSM data for address          00485000
*                                      space obtained              @W2A 00486000
R792RSV3 EQU   X'20'              Reserved                         @C1A 00487000
R792GOAL EQU   X'10'              On = system is in GOAL mode      @C1A 00488000
R792SRV  EQU   X'08'              On = this address space is a          00489000
*                                 server address space             @C1A 00490000
*                                  Off = GOAL specified for this        00491000
*                                  address space is being honored       00492000
*                                  by WLM                          @C1A 00493000
R792QSC  EQU   X'04'              On = address space has been           00494000
*                                 quiesced by a RESET command      @C1A 00495000
R792TXME EQU   X'02'              Like RASDTRXNMGMTEXEMPT      @WA46476 00496090
R792TAFF EQU   X'01'              On = address space has temporal       00496120
*                                 affinities, same as RASDTAF  @WA46622 00496150
R792FLG2 DS    XL1                Additional flags             @WA46476 00496180
R792CPRC EQU   X'80'              Same as RASDCPROTCPU         @WA46476 00496270
R792CPRE EQU   X'40'              Same as RASDASPROTSTG        @WA46476 00496360
R792CPRI EQU   X'20'              Same as RASDCPROTSTG         @WA46476 00496450
R792CPUP EQU   X'10'              Same as RASDCPUPROTECTED     @WA46476 00496540
R792STOP EQU   X'08'              Same as RASDSTGPROTECTED     @WA46476 00496630
R792LSQR DS    XL4                LSQA pages in real storage            00497000
*                                      CNTFTN + CNTFRLSD           @W1A 00498000
R792LSQE DS    XL4                LSQA pages in ext. storage            00499000
*                                      CNTFTLSD - CNTFRLSD         @W1A 00500000
R792ARS  DS    XL4                AVG NUM OF REAL FRAMES FOR STEP  @W5A 00501000
R792TWSS DS    XL4                SRM TARGET WORKING SET SIZE           00502000
*                                 FOR THIS JOB                     @W5A 00503000
R792PHSP DS    XL4                Number of hiperspace pages            00504000
*                                 for current transaction          @W7A 00505000
R792EXCT DS    XL4                New 4-byte EXCP count field  @YA42170 00506000
R792SCL  DS    CL8                Service class name               @C1A 00507000
R792SCP  DS    BL2                Service class period             @C1A 00508000
R792WKLD DS    CL8                Workload name                    @C1A 00509000
R792RGRP DS    CL8                Resource group name              @C1A 00510000
         DS    XL2                Reserved                         @E2A 00511000
R792TCPC DS    XL4                Total CPU time consumed in this       00512000
*                                 address space in milliseconds.        00513000
*                                 (ascbejst+ascbsrbt+assbphtm)     @E2A 00514000
R792ASST DS    XL4                CPU time consumed by preemptible-     00515000
*                                 class SRBs running on behalf of       00516000
*                                 this address space in milliseconds.   00517000
*                                 (assbasst)                       @E2A 00518000
R792PHTM DS    XL4                CPU time consumed by preemptible-     00519000
*                                 class SRBs running in this address    00520000
*                                 space in milliseconds (assbphtm) @E2A 00521000
*                                                                       00522000
R792FXAB DS    XL4                Number of fixed frames between        00523000
*                                 16M and 2G (ESAME only)          @I5A 00524000
*                                                                       00525000
R792RLEN EQU   *-R792ELEM         LENGTH OF ONE RELOCATE BLOCK          00526000
R792FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00527000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00528000
.STYP3   ANOP                                                           00529000
*                                                                       00530000
*        RELOCATE BLOCK FOR SUBTYPE 3                                   00531000
*                                                                       00532000
*                                                                       00533000
R793     DSECT                    SCALAR RELOCATE SECTION               00534000
R793RSV1 DS    XL2                Reserved since 4.1.0             @W5C 00535000
R793CRI  DS    XL2                HIGH UIC COUNT                        00536000
R793SQA  DS    XL2                NUMBER OF FIXED SQA FRAMES            00537000
R793CMNF DS    XL2                NUMBER OF COMMON (LPA+CSA)            00538000
*                                 PAGEABLE AND FIXED FRAMES             00539000
R793CMFF DS    XL2                NUMBER OF COMMON (LPA+CSA)            00540000
*                                 FIXED FRAMES                          00541000
R793PRFX DS    XL2                NUMBER OF PRIVATE FIXED FRAMES        00542000
*                                 (LSQA+NON-LSQA)                       00543000
R793CPUU DS    XL2                PROCESSOR UTILIZATION (0-101)         00544000
R793DQ   DS    XL2                LENGTH OF OUT WAIT QUEUE     @WA19913 00545000
R793INC  DS    XL2                NUMBER OF ADDRESS SPACES IN STORAGE   00546000
*                                 (SRM IN QUEUE)                        00547000
R793OUTU DS    XL2                NUMBER OF ADDRESS SPACES OUT OF       00548000
*                                 STORAGE (SRM OUT QUEUE)               00549000
R793LCU  DS    XL2                RESERVED                              00550000
R793RSV4 DS    XL2                RESERVED LJM-SPE                 @Y2C 00551000
R793LPAF DS    XL2                Number of total LPA frames   @YA34458 00552000
R793CSAF DS    XL2                Number of total CSA frames   @YA34458 00553000
R793LPFX DS    XL2                NUMBER OF LPA FIXED FRAMES            00554000
R793CSFX DS    XL2                NUMBER OF CSA FIXED FRAMES            00555000
R793LSQA DS    XL2                NUMBER OF FIXED LSQA FRAMES           00556000
R793NLQF DS    XL2                NUMBER OF PRIVATE NON LSQA FIX FRAMES 00557000
R793LOUT DS    XL2                NUMBER OF ADDRESS SPACES LOGICALLY    00558000
*                                 SWAPPED OUT                           00559000
R793SQR  DS    XL4                SQA pages in real storage             00560000
*                                      CTSQAF + CTRSQAF            @W1A 00561000
R793SQE  DS    XL4                SQA pages in ext. storage             00562000
*                                      CTTSQAF - CTRSQAF           @W1A 00563000
R793LSQR DS    XL4                LSQA pages in real storage            00564000
*                                      CTLSQAF + CTRLSQAF          @W1A 00565000
R793LSQE DS    XL4                LSQA pages in ext. storage            00566000
*                                      CTTLSQAF - CTRLSQAF         @W1A 00567000
R793AFC  DS    XL4                NUMBER OF AVAILABLE FRAMES       @W5A 00568000
R793CUT  DS    XL4                MVS view of CPU utilization           00569000
*                                 (interval - wait time) if Monitor I   00570000
*                                 CPU gathering is active, otherwise    00571000
*                                 CCVUTILP value at end of interval.    00572000
*                                 (The interval length of the MVS       00573000
*                                 view value is either 5 seconds or     00574000
*                                 the Monitor I cycle time, if it is    00575000
*                                 larger than 5 seconds.)      @WA05435 00576000
R793RLEN EQU   *-R793             LENGTH OF ONE RELOCATE BLOCK          00577000
R793FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00578000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00579000
.STYP4   ANOP                                                           00580000
*                                                                       00581000
*        RELOCATE BLOCK FOR SUBTYPE 4                                   00582000
*                                                                       00583000
*                                                                       00584000
R794     DSECT                    SCALAR RELOCATE SECTION               00585000
R794CMNI DS    XL4                SYSTEM COMMON (LPA+CSA) PAGES IN      00586000
R794CMNO DS    XL4                SYSTEM COMMON (CSA) PAGES OUT         00587000
R794CMNR DS    XL4                SYSTEM COMMON (LPA+CSA) PAGES         00588000
*                                 RECLAIMED, not used since rel 330     00589000
R794SWPO DS    XL4                NUMBER OF SWAPS (OUT)            @P1C 00590000
R794PSPI DS    XL4                NUMBER OF PAGES SWAPPED IN            00591000
R794PSPO DS    XL4                NUMBER OF PAGES SWAPPED OUT           00592000
R794PRVI DS    XL4                NUMBER OF PRIVATE PAGES               00593000
*                                 (VIO+NON-VIO) SWAPPED IN              00594000
R794PRVO DS    XL4                NUMBER OF PRIVATE PAGES               00595000
*                                 (VIO+NON-VIO) SWAPPED OUT             00596000
R794PRVR DS    XL4                NUMBER OF PRIVATE PAGES               00597000
*                                 (VIO+NON-VIO) RECLAIMED               00598000
*                                 not used since rel 330                00599000
R794VIO  DS    XL4                NUMBER OF VIO PAGES (IN+OUT)          00600000
R794RSV1 DS    XL2                Reserved since 4.1.0             @W5C 00601000
R794CRI  DS    XL2                HIGH UIC COUNT                        00602000
R794ACRI DS    XL2                AVERAGE OF HIGH UIC COUNT             00603000
*                                 not used since rel 330                00604000
R794RV1  DS    XL2                RESERVED                              00605000
R794LPAI DS    XL4                SYSTEM LPA PAGES IN          @G537NLS 00606000
R794CSAI DS    XL4                SYSTEM CSA PAGES OUT         @G537NLS 00607000
R794LPAR DS    XL4                SYSTEM LPA PAGES RECLAIMED   @G537NLS 00608000
*                                 not used since rel 330                00609000
R794CSAR DS    XL4                SYSTEM CSA PAGES RECLAIMED   @G537NLS 00610000
*                                 not used since rel 330                00611000
R794RSV2 DS    XL2                Reserved since 4.1.0             @W5C 00612000
         DS    XL2                UNUSED (Was Migation age)        @Q2C 00613000
R794ERTE DS    XL4                NO. PAGES TO EXT. STORAGE        @P2A 00614000
R794EVAL DS    XL4                NO. OF EXTENDED STORAGE SLOTS         00615000
*                                 AVAIL. AND NOT IN USE            @P2A 00616000
R794ESSL DS    XL4                AVAILABLE FOR FUTURE USE         @P2A 00617000
R794MRTE DS    XL4                NO. OF PAGES MIGRATED FROM            00618000
*                                 EXT. STOR. TO AUX. STOR.         @P6A 00619000
R794MAGE DS    XL4                Migration age                    @Q2M 00620000
*                                                                  @P6D 00621000
R794AFC  DS    XL4                NUMBER AVAILABLE FRAMES          @W5A 00622000
R794TWSS DS    XL4                TARGET WORKING SETSIZE FOR THE COMMON 00623000
*                                 AREA                             @W5A 00624000
R794HSP  DS    XL4                Number of hiperspace pages            00625000
*                                 (In + Out)                       @W7A 00626000
R794PPIA DS    XL4                Number of blocked pages paged in      00627000
*                                 from AUX (private)               @A3A 00628000
R794LPIA DS    XL4                Number of blocks paged in from        00629000
*                                 AUX (private)                    @A3A 00630000
R794RLEN EQU   *-R794             LENGTH OF ONE RELOCATE BLOCK          00631000
R794FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00632000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00633000
.STYP5   ANOP                                                           00634000
*                                                                       00635000
*        RELOCATE BLOCK FOR SUBTYPE 5                                   00636000
*                                                                       00637000
R795ELEM DSECT                    MAPPING OF ELEMENT                    00638000
R795ASID DS    XL2                ADDRESS SPACE IDENTIFIER              00639000
R795JBN  DS    CL8                NAME OF JOB                           00640000
R795DMN  DS    XL2                DOMAIN NAME                           00641000
*                                 not applicable in GOAL mode      @C1C 00642000
R795NPG  DS    XL2                PERFORMANCE GROUP                     00643000
*                                 not applicable in GOAL mode      @C1C 00644000
R795PGP  DS    XL2                PERFORMANCE GROUP PERIOD              00645000
*                                 not applicable in GOAL mode      @C1C 00646000
R795TTOD DS    XL4                REAL TIME INTO TRANSACTION            00647000
R795CL   DS    CL2                CURRENT LOCATION                      00648000
*                                                                       00649000
*                              CONTENTS   MEANING                       00650000
*                              --------   -------                       00651000
*                                   IN - SWAPPED IN                     00652000
*                                   OT - SWAPPED OUT AND READY          00653000
*                                   LO - LOGICALLY SWAPPED OUT @G537NLS 00654000
*                                   NS - NON-SWAPPABLE                  00655000
*                                   WM - WAIT QUEUE/MSO                 00656000
*                                   WL - WAIT QUEUE/LONG WAIT           00657000
*                                   WT - WAIT QUEUE/TERM WAIT           00658000
*                                   WO - WAIT QUEUE/other reasons  @I1A 00659000
*                                   DL - TSO user delayed by SRM        00660000
*                                        to meet response time          00661000
*                                        objective                 @I1A 00662000
*                                   PR - PRIVLEDGED                     00663000
*                                   >> - TRANSITIONING OUT              00664000
*                                   << - TRANSITIONING IN               00665000
         SPACE                                                          00666000
R795TAS  DS    XL2                TYPE OF USER                          00667000
*                                                                       00668000
*                              CONTENTS   MEANING                       00669000
*                              --------   -------                       00670000
*                                   0 - BATCH                           00671000
*                                   1 - STARTED TASK                    00672000
*                                   2 - MOUNT TASK                      00673000
*                                   3 - TSO                             00674000
*                                   4 - ASCH                       @A1A 00675000
*                                   5 - OMVS                       @B2A 00676000
         SPACE                                                          00677000
R795TROD DS    CL4                TRANSACTION RESIDENT TIME             00678000
R795TCNT DS    XL2                TRANSACTION COUNT                     00679000
R795SWC  DS    XL2                TRANSACTION SWAP COUNT                00680000
R795CPUS DS    XL4                TOTAL PROCESSOR  SERVICE FOR          00681000
*                                 TRANSACTION (ZERO WHEN ASID IS OUT    00682000
*                                 OF STORAGE)                           00683000
R795MSOS DS    XL4                TOTAL MSO SERVICE FOR                 00684000
*                                 TRANSACTION (ZERO WHEN ASID IS OUT    00685000
*                                 OF STORAGE)                           00686000
R795IOCS DS    XL4                TOTAL IOC SERVICE FOR                 00687000
*                                 TRANSACTION (ZERO WHEN ASID IS OUT    00688000
*                                 OF STORAGE)                           00689000
R795WMS  DS    XL4                TOTAL SERVICE FOR                     00690000
*                                 TRANSACTION (ZERO WHEN ASID IS OUT    00691000
*                                 OF STORAGE)                           00692000
R795TOTL DS    XL4                TOTAL SERVIC FOR SESSION              00693000
*                                 (ZERO WHEN ASID IS OUT OF STORAGE)    00694000
R795TOT  DS    XL4                TOTAL SERVICE FOR TRANSACTION         00695000
*                                 SINCE LAST SWAP - IN                  00696000
R795SRBS DS    XL4                TOTAL SRB SERVICE FOR                 00697000
*                                 TRANSACTION (ZERO WHEN ASID IS OUT    00698000
*                                 OF STORAGE)                           00699000
R795FLG  DS    XL1                Flags                            @C1A 00700000
R795RSV1 EQU   X'E0'              Reserved                         @C1A 00701000
R795GOAL EQU   X'10'              On = system is in GOAL mode      @C1A 00702000
R795SRV  EQU   X'08'              On = this address space is a          00703000
*                                 server address space             @C1A 00704000
*                                  Off = GOAL specified for this        00705000
*                                  address space is being honored       00706000
*                                  by WLM                          @C1A 00707000
R795QSC  EQU   X'04'              On = address space has been           00708000
*                                 quiesced by a RESET command      @C1A 00709000
R795SCL  DS    CL8                Service class name               @C1A 00710000
R795SCP  DS    BL2                Service class period             @C1A 00711000
R795WKLD DS    CL8                Workload name                    @C1A 00712000
R795RGRP DS    CL8                Resource group name              @C1A 00713000
R795RLEN EQU   *-R795ELEM         LENGTH OF ONE RELOCATE BLOCK          00714000
R795FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00715000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00716000
.STYP6   ANOP                                                           00717000
*                                                                       00718000
*          RELOCATE BLOCK FOR SUBTYPE 6 - MONITOR 2                @L8A 00719000
*          ENQUEUE RESERVE                                         @L8A 00720000
*                                                                       00721000
R796ELEM DSECT                    MAPPING OF ELEMENT               @L8A 00722000
R796ASID DS    XL2                ADDRESS SPACE ID OF THE JOB WHICH@L8A 00723000
*                                 ISSUED THE RESERVE                    00724000
R796MAJ  DS    CL8                MAJOR NAME OF THE RESOURCE       @L8A 00725000
R796MIN  DS    CL44               MINOR NAME OF THE RESOURCE       @L8A 00726000
R796JBN  DS    CL8                NAME OF THE JOB IN WHICH THE     @L8A 00727000
*                                 RESERVE WAS ISSUED                    00728000
R796VOLS DS    CL6                VOLUME SERIAL OF THE VOLUME      @L8A 00729000
*                                 AGAINST WHICH THE RESERVE WAS ISSUED  00730000
R796UCB  DS    CL3                THE 3 DIGIT DEV NUMBER AGAINST   @C2C 00731000
*                                 THE RESERVE WAS ISSUED, OR "UCB" @C2C 00732000
*                                 IF UCBNAME = "UCB"               @C2A 00733000
R796REQ  DS    CL2                TYPE AND STATUS OF REQUEST FOR   @L8A 00734000
*                                 THE RESOURCEISSUED                    00735000
R796MINL DS    XL2                MINOR NAME LENGTH FOR REPORTING  @L8A 00736000
R796FLG  DS    XL1                DATA TYPE FLAGS                  @L8A 00737000
R796RESV EQU   X'80'              1... .... ON=DEVICE RESERVED BY       00738000
*                                           THIS CPU               @L8A 00739000
R796TRUN EQU   X'40'              .1.. .... ON=MINOR NAME TRUNCATED     00740000
*                                                                  @L8A 00741000
R796GLBL EQU   X'20'              ..1. .... ON=GLOBAL RESOURCE     @LCA 00742000
R796RESC EQU   X'10'              ...1 .... ON=RES REQU CONV TO         00743000
*                                           GLOBAL ENQ             @Q1A 00744000
*                                 .... XXXX RESERVED BITS          @L8A 00745000
R796SID  DS    CL8                SYSTEM ID OF THE JOB BY WHICH         00746000
*                                 THE RESERVE WAS ISSUED                00747000
R796DVN  DS    XL2                DEV NUMBER (BIN) FROM UCBCHAN    @C2A 00748000
*                                 R796DVN moved into REL BLOCK @WA02579 00749000
R796RLEN EQU   *-R796ELEM         LENGTH OF ONE RELOCATE BLOCK          00750000
R796FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00751000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00752000
.STYP7   ANOP                                                           00753000
*                                                                       00754000
*          RELOCATE BLOCK FOR SUBTYPE 7 - MONITOR 2                @L8A 00755000
*          ENQUEUE REQUESTS                                        @L8A 00756000
*                                                                  @L8A 00757000
R797ELEM DSECT                    MAPPING OF ELEMENT               @L8A 00758000
R797MAJ  DS    CL8                MAJOR NAME OF THE RESOURCE       @L8A 00759000
R797MIN  DS    CL44               MINOR NAME OF THE RESOURCE       @L8A 00760000
R797FLG  DS    XL1                DATA TYPE FLAGS                  @L8A 00761000
         SPACE                                                          00762000
R797GDET EQU   X'80'              1... .... ON=DETAIL DATA, OFF=SUMMARY 00763000
*                                           DATA                   @L8A 00764000
R797GMAJ EQU   X'40'              .1.. .... ON= MAJOR NAME IS           00765000
*                                           SPECIFIED              @L8A 00766000
R797GMIN EQU   X'20'              ..1. .... ON= MINOR NAME IS           00767000
*                                           SPECIFIED              @L8A 00768000
R797TRNC EQU   X'10'              ...1 .... ON=MINOR NAME               00769000
*                                           TRUNCATED              @L8A 00770000
R797GLBL EQU   X'08'              .... 1... ON=GLOBAL RESOURCE     @LCA 00771000
*                                                                  @L8A 00772000
R797ALLS EQU   X'04'              .... .1.. ON=RESOURCES IS HELD BY SYS 00773000
*                                                                  @L8A 00774000
R797ALLE EQU   X'02'              .... ..1. ON=ALL EXL OWNED HELD       00775000
*                                           BY SYS                 @L8A 00776000
         SPACE                                                          00777000
*                                 .... ...X RESERVED BITS          @LLA 00778000
R797MINL DS    XL4                MINOR NAME LENGTH FOR REPORTING       00779000
*                                                                  @L8A 00780000
R797OWN  DS    XL2                COUNT OF REQUESTS OWNING RESOURCE     00781000
*                                                                  @L8A 00782000
R797EXCW DS    XL2                COUNT EXCL REQS WAITING FOR RESOURCE  00783000
*                                                                  @L8A 00784000
R797SHRW DS    XL2                COUNT SHR REQS WAITING FOR RESOURCE   00785000
*                                                                  @L8A 00786000
R797REQ  DS    CL2                TYPE AND STATUS OF REQUEST       @L8A 00787000
*                                 FOR A RESOURCE                        00788000
R797JBN  DS    CL8                NAME OF JOB WHICH ISSUED THE ENQ @L8A 00789000
R797ASID DS    CL2                ADDRESS SPACE ID OF THE JOB WHICH     00790000
*                                 ISSUED THE ENQ                        00791000
R797SCOP DS    CL4                SCOPE OF THE RESOURCE                 00792000
R797RES  DS    CL2                RESERVED                         @L8A 00793000
R797SID  DS    CL8                SYSTEM ID OF JOB THAT ISSUED ENQ      00794000
         DS    XL3                RESERVED FOR ALIGNMENT                00795000
R797RLEN EQU   *-R797ELEM         LENGTH OF ONE RELOCATE BLOCK          00796000
R797FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00797000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00798000
.STYP8   ANOP                                                  @GM2EPDV 00799000
*                                                                       00800000
*           RELOCATE BLOCK FOR SUBTYPE 8 - MONITOR 2           @GM2EPDV 00801000
*           TRANSACTION ANALYSIS                               @GM2EPDV 00802000
*                                                                       00803000
R798ELEM DSECT                    MAPPING OF ELEMENT           @GM2EPDV 00804000
R798ICSI DS    CL2                ICS MEMBER NAME ID           @GM2EPDV 00805000
R798IPSI DS    CL2                IPS MEMBER NAME ID           @GM2EPDV 00806000
R798PGN  DS    XL2                PERFORMANCE GROUP NUMBER     @GM2EPDV 00807000
R798PGP  DS    XL2                PERFORMANCE GROUP PERIOD     @GM2EPDV 00808000
R798SYS  DS    CL4                SUBSYSTEM NAME               @GM2EPDV 00809000
R798TTX  DS    XL4                NUMBER OF ENDED TRANSACTIONS @GM2EPDV 00810000
R798TTM  DS    XL4                ELAPSED TIME OF ENDED TRANS FOR PGP,  00811000
*                                 IN 1024 MICROSECONDS         @GM2EPDV 00812000
R798CLS  DS    CL10               TRANSACTION CLASS NAME       @GM2EPDV 00813000
R798USR  DS    CL10               USERID                       @GM2EPDV 00814000
R798NAM  DS    CL10               TRANSACTION NAME             @GM2EPDV 00815000
R798FL1  DS    XL1                DATA TYPE FLAGS              @GM2EPDV 00816000
         SPACE                                                          00817000
R798RPT  EQU   X'80'              1... .... ON=RPT PGN,        @GM2EPDV 00818000
*                                           OFF=CONTROL PGN    @GM2EPDV 00819000
R798ACN  EQU   X'40'              .1.. .... ON=ACCTINFO USED       @R0A 00820000
*                                 ..XX XXXX RESERVED BITS          @R0C 00821000
         DS    XL5                RESERVED                         @C1C 00822000
R798TET  DS    0D                 ELAPSED TIME OF ENDED TRANS FOR PGP,  00823000
*                                 IN 1024 MICROSECONDS             @C1A 00824000
R798TET1 DS    F                  R798TET - WORD 1                 @C1A 00825000
R798TET2 DS    F                  R798TET - WORD 2                 @C1A 00826000
         SPACE                                                          00827000
R798RLEN EQU   *-R798ELEM         LENGTH OF ONE RELOCATE BLOCK          00828000
R798FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00829000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00830000
         SPACE 3                                                        00831000
.STYP9   ANOP                                                  @GM2EPDV 00832000
*                                                                       00833000
*           RELOCATE BLOCK FOR SUBTYPE 9 - MONITOR 2                    00834000
*                                                                       00835000
*           DEVICE DATA SECTION (ONE PER DEVICE)                        00836000
*                                                                       00837000
R799ELEM DSECT          MAPPING OF ELEMENT                              00838000
R799NUM  DS    PL2      DEVICE NUMBER IN THE RANGE X'0000' TO X'0FFF'   00839000
R799LCU  DS    BL2      LOGICAL CONTROL UNIT GROUP NUMBER 0 TO 255      00840000
R799RV0  DS    BL1      RESERVED                                        00841000
R799CNF  DS    BL1      DEVICE FLAGS:                                   00842000
R799QUL  EQU   X'80'    1... ....   ON= IOS Q-LENGTH INVALID            00843000
R799LCD  EQU   X'40'    .1.. ....   ON= NO LCU INFORMATION              00844000
R799CMB  EQU   X'20'    ..1. ....   ON= CMB DATA INVALID                00845000
R799DTF  EQU   X'10'    ...1 ....   ON= DEVICE CONNECT OR PENDING OR    00846000
*                                       DISCONNECT TIME IS INVALID      00847000
*                                                              @WA15094 00848000
*        EQU   X'08'    .... 1...   RESERVED                            00849000
R799MXB  EQU   X'04'    .... .1..   ON= DEVICE IS MULTIPLE EXPOSURE     00850000
*                                       DEVICE; THIS IS BASE EXPOSURE   00851000
R799VAC  EQU   X'02'    .... ..1.   ON= DATA RECORDED IS INVALID        00852000
*                                       BECAUSE DEVICE WAS VARIED       00853000
*                                       DURING INTERVAL                 00854000
R799STA  EQU   X'01'    .... ...1   ON= DEVICE IS CURRENTLY ONLINE      00855000
R799SER  DS    CL6      VOLUME SERIAL NUMBER OF MOUNTED VOLUME          00856000
R799TYP  DS    BL4      UNIT TYPE                                       00857000
R799NUX  DS    BL4      NUMBER OF EXPOSURES (IF MULTIPLE) 04143000      00858000
R799SSC  DS    BL4      START SUBCHANNEL (SSCH) COUNT                   00859000
R799MEC  DS    BL4      MEASUREMENT EVENT COUNT (NUMBER OF SSCH         00860000
*                       FOR WHICH CONNECT, PENDING, AND ACTIVE          00861000
*                       TIMES WERE STORED)                              00862000
R799CNN  DS    BL4      DEVICE CONNECT TIME                             00863000
R799PEN  DS    BL4      FUNCTION PENDING TIME                           00864000
R799ATV  DS    BL4      FUNCTION ACTIVE TIME                            00865000
R799DIS  DS    BL4      DEVICE DISCONNECT TIME                          00866000
R799QUE  DS    BL4      NUMBER OF REQUESTS QUEUED IN IOS FOR            00867000
*                       THIS DEVICE                                     00868000
R799UTL  DS    BL4      NUMBER OF SAMPLES WHEN THE DEVICE WAS           00869000
*                       RESERVED, BUT AN SSCH HAD NOT BEEN ISSUED       00870000
R799RSV  DS    BL4      NUMBER OF SAMPLES DURING THE MEASUREMENT        00871000
*                       INTERVAL THAT INDICATED THAT THE DEVICE         00872000
*                       WAS RESERVED                                    00873000
R799DSO  DS    BL4      reserved - do not use - variable name is        00874000
*                       needed for conversion                      @U1C 00875000
R799ALC  DS    BL4      NUMBER OF SAMPLES DURING THE MEASUREMENT        00876000
*                       INTERVAL THAT INDICATED THAT THE DEVICE         00877000
*                       WAS ALLOCATED                                   00878000
R799DVB  DS    BL4      device busy delay time                     @Z1C 00879000
*                       (3090,9021,9121,9221 support)                   00880000
R799CUB  DS    BL4      control unit busy delay time               @Z1C 00881000
*                       (3090,9021,9121,9221 support)                   00882000
R799ICT  DS    BL2      invalid sample count                       @Z1C 00883000
*                       (3090,9021,9121,9221 support)                   00884000
R799CNX  DS    BL1      Device flag extensions                     @G2A 00885000
R799PAV  EQU X'80'      1... .... =1 If base exposure of a Parallel     00886000
*                                 Access Volume                    @G2A 00887000
R799NXC  EQU X'40'      .1.. .... =1 If number of alias exposures       00888000
*                                 changed                          @G2A 00889000
R799NTF  EQU X'20'      Timing facility not active                 @I2A 00890000
R799RES  DS    BL1      reserved                                   @G2C 00891000
R799SGN  DS    CL8      Storage Group Name                         @U1A 00892000
R799NDA  DS    BL4      Total number of allocations in effect for the   00893000
*                       device                                     @U2A 00894000
R799DPB  DS    BL4      ESCON Director port busy delay time        @Z2A 00895000
         DS    BL4      Reserved                               @WA31701 00896000
R799PCT  DS    BL4      Number of unsuccessful PAV samples     @WA31701 00897000
R799RLEN EQU   *-R799ELEM         LENGTH OF ONE RELOCATE BLOCK          00898000
R799FLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00899000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00900000
.STYPA   ANOP                                                      @LBA 00901000
*                                                                       00902000
*           RELOCATE BLOCK FOR SUBTYPE A - MONITOR 2               @LBA 00903000
*           DISPLAY DOMAIN DATA                                    @LBA 00904000
*                                                                       00905000
R79AELEM DSECT                    MAPPING OF ELEMENT               @LBA 00906000
R79ATWSR DS    XL4                TIME WEIGHTED SERVICE RATE       @LBA 00907000
         DS    XL2                Reserved                         @A3C 00908000
R79ARUA  DS    XL2                AVERAGE NUMBER OF READY USERS    @LBA 00909000
R79RSV5  DS    XL2                RESERVED LJM-SPE                 @Y2C 00910000
R79ACMPL DS    XL2                CURRENT MPL VALUE                @LBA 00911000
R79AOUTU DS    XL2                AVERAGE NUMBER OF USERS SWAPPED OUT   00912000
R79AINCU DS    XL2                AVERAGE NUMBER OF SWAPPED IN-USER     00913000
         DS    XL2                Reserved                         @A3C 00914000
R79ACIDX DS    XL2                CONTENTION INDEX                 @LBA 00915000
R79ANSW  DS    XL2                NUMBER OF NON SWAPPABLE USERS         00916000
R79ADMNO DS    XL1                DOMAIN NUMBER                    @LBA 00917000
R79RESV1 DS    XL1                RESERVED. FORMER R79ADMLO        @P3C 00918000
R79RESV2 DS    XL1                RESERVED. FORMER R79ADMHI        @P3C 00919000
         DS    CL1                Reserved                         @A3C 00920000
R79AIPS  DS    CL2                CURRENT IPS                      @LBA 00921000
R79ACPU  DS    CL4                CPU SERVICE COEF.                @LBA 00922000
R79AIOS  DS    CL4                I/O SERVICE COEF.                @LBA 00923000
R79ARSV4 DS    CL4                RESERVED SINCE RMF 4.2.0         @Y2C 00924000
R79ASRB  DS    CL4                SRB SERVICE COEF.                @LBA 00925000
R79ATWET DS    CL4                AVERAGE FIRST PERIOD TSO TRANSACTION  00926000
*                                 RESPONSE TIME                         00927000
R79ADMLO DS    XL2                MIN MPL LEVEL                    @P3C 00928000
R79ADMHI DS    XL2                MAX MPL LEVEL                    @P3A 00929000
R79AMSO  DS    CL8                MAIN STORAGE SERVICE COEFICIENT  @Y2A 00930000
R79AIMPL DS    XL2                IN MPL Target                    @A3A 00931000
R79AOMPL DS    XL2                OUT MPL Target                   @A3A 00932000
R79ARLEN EQU   *-R79AELEM         LENGTH OF ONE RELOCATE BLOCK          00933000
R79AFLEN EQU   0                  LENGTH OF ONE FIXED BLOCK             00934000
*                                 WE ONLY HAVE RELOCATE BLOCKS          00935000
.STYPB   ANOP                                                      @LBA 00936000
*                                                                       00937000
*           RELOCATE BLOCK FOR SUBTYPE B - MONITOR 2               @LBA 00938000
*           PAGE/SWAP DATA                                         @LBA 00939000
*                                                                       00940000
R79BCNTL DSECT                    MAPPING OF COMMON DATA ELEMENT   @LBA 00941000
R79BETYP DS    CL1                SMF79 CHANNEL RECORD TYPE        @LBA 00942000
*                                 P - PAGE                         @LBA 00943000
*                                 S - SWAP                              00944000
         DS    CL3                RESERVED                              00945000
R79BFLEN EQU   *-R79BCNTL         LENGTH OF FIXED SECTION               00946000
         SPACE 3                                                        00947000
R79BELEM DSECT                    MAPPING OF ELEMENT               @LBA 00948000
R79BSALC DS    XL4                SLOTS IN THIS DATA SET           @LBA 00949000
R79BSAVL DS    XL4                SLOTS AVAILABLE                  @LBA 00950000
R79BSLBD DS    XL4                NUMBER OF BAD SLOTS              @LBA 00951000
R79BSUSE DS    XL4                ASM IN USE COUNT                 @LBA 00952000
R79BSIOS DS    XL4                I/O REQUESTS                     @LBA 00953000
R79BREQS DS    XL4                PAGES TRANSFERRED                @LBA 00954000
R79BFLG  DS    CL1                FLAGS                            @LBA 00955000
         SPACE                                                          00956000
R79BSBAD EQU   X'80'              1... .... BAD DATA SET INDICATOR      00957000
R79BPLPA EQU   X'40'              .1.. .... PLPA DATA SET               00958000
R79BCOMM EQU   X'20'              ..1. .... COMMON DATA SET             00959000
R79BDPLX EQU   X'10'              ...1 .... DUPLEX DATA SET             00960000
R79BLOCL EQU   X'08'              .... 1... LOCAL DATA SET              00961000
R79BPAGE EQU   X'04'              .... .1.. PAGE DATA                   00962000
R79BSWAP EQU   X'02'              .... ..1. SWAP DATA                   00963000
R79BVIO  EQU   X'01'              .... ...1 DATASET ACCEPTS VIO PAGES   00964000
         SPACE                                                          00965000
R79BDEV  DS    CL1                DEVICE TYPE CODE                 @LBA 00966000
R79BDADR DS    CL3                3 DIGIT DEV NUMBER OR "UCB",     @C2C 00967000
*                                 IF UCBNAME="UCB"                 @C2A 00968000
R79BVSER DS    CL6                VOLUME SERIAL                    @LBA 00969000
R79BDSN  DS    CL44               DATA SET NAME                    @LBA 00970000
R79BFL2  DS    CL1                FLAGS                        @ZA57889 00971000
R79BMEXP EQU   X'80'              MULTIPLE EXPOSURE DEVICE     @ZA57889 00972000
R79BALCU EQU   X'40'              ALTERNATE CONTROL UNIT DEVICE    @E1A 00973000
R79BDNM  EQU   X'20'              INDICATES IF FIELD R79BDEVN CONTAINS  00974000
*                                 A VALID DEVICE NAME              @Y1A 00975000
*                                                                  @Y1D 00976000
R79BDEVN DS    CL8                DEVICE NAME                      @Y1A 00977000
R79BCU   DS    CL8                CONTROL UNIT NAME                @Y1A 00978000
R79BRLEN EQU   *-R79BELEM         LENGTH OF RELOCATE SECTION            00979000
R79BDVN  DS    XL2                DEV NUMBER (BIN) FROM UCBCHAN    @C2A 00980000
.STYPC   ANOP                                                      @LBA 00981000
         SPACE 2                                                        00982000
************** CHANNEL PATH CONTROL SECTION *************************** 00983000
         SPACE                                                          00984000
R79CCNTL DSECT                                                          00985000
R79CSMP  DS    BL4                NUMBER OF SAMPLES, WEIGHTED BY SRM.   00986000
R79CFLAG DS    BL1                Flags                           @BAA  00987000
R79CCPMF EQU   X'80'              CPMF available                  @BAA  00988000
R79CCFGC EQU   X'40'              Configuration change            @E1A  00989000
R79CCMH  EQU   X'20'              DCM supported by the hardware   @I3A  00990000
R79CCMD  EQU   X'10'              Configuration contains DCM      @I3A  00991000
*                                 managed channels                @H1A  00992000
R79CRNA  EQU   X'08'              RMF address space not active    @I3A  00993000
R79CCMI  DS    BL1                CPMF mode info                  @H1A  00994000
*                                 0 - CPMF not active             @H1A  00995000
*                                 1 - Compatibility mode          @H1A  00996000
*                                 2 - Extended mode               @H1A  00997000
         DS    CL2                Reserved for future use         @H1C  00998000
R79CCFRC DS    BL4                CPMF restart count              @BAA  00999000
R79CCFSC DS    BL4                CPMF sample count               @BAA  01000000
*                                                                 @P1C  01001000
R79CFLEN EQU   *-R79CCNTL         LENGTH OF FIXED SECTION               01002000
         SPACE 2                                                        01003000
*                                                                       01004000
*              RELOCATE BLOCK FOR SUBTYPE C                             01005000
*                                                                       01006000
************** CHANNEL PATH DATA SECTION ****************************** 01007000
R79CCHNL DSECT                                                          01008000
R79CCPID DS    BL1                CHANNEL PATH IDENTIFICATIONS          01009000
*                                 THE RANGE OF VALUES IS 0 TO 111       01010000
R79CFG2  DS    CL1                CHANNEL FLAGS                         01011000
         SPACE                                                          01012000
R79CRV1  EQU   X'C0'              RESERVED                              01013000
R79CBL   EQU   X'20'              BLOCK MULTIPLEXER                     01014000
R79CBY   EQU   X'10'              BYTE MULTIPLEXER                      01015000
R79CCVC  EQU   X'08'              ES Conversion Channel           @Z1A  01016000
R79CCNC  EQU   X'04'              ES Connection Channel           @Z2A  01017000
R79CDOC  EQU   X'02'              ESCON Director on Chanel        @Z2A  01018000
R79CCC   EQU   X'01'              Channel to Channel          @YA67090  01019000
R79CFG3  DS    BL1                Channel flags continued         @BAA  01020000
R79CSHR  EQU   X'80'              Channel path is shared between        01021000
*                                 logical partitions.             @BAA  01022000
R79CNVL  EQU   X'40'              CPMF indication, this entry is        01023000
*                                 invalid                         @BAA  01024000
*                                 1 line deleted              @YA67090  01025000
R79CFXT  EQU   X'10'              Channel converter 3090          @C3A  01026000
R79CCPM  EQU   X'08'              Channel path is DCM managed     @I3A  01027000
R79CCPD  DS    BL1                Channel path description.       @C3A  01028000
*                                 For an explanation, you can     @G1C  01029000
*                                 issue the command D M=CHP.      @G1C  01030000
*                                                                9@G1D  01031000
*                                                                 @C3A  01032000
R79CBSY  DS    BL4                Number of samples in which the        01033000
*                                 channel path was busy,                01034000
*                                 weighted by SRM.                @BAC  01035000
R79CPBY  DS    BL4                Partitions channel-path-busy          01036000
*                                 time since last interval in           01037000
*                                 units of 128 microsecs          @BAA  01038000
R79CCPTX DS    0BL4               Extended last time stamp    @WA39393  01039000
         DS    BL1                Overflow area               @WA39393  01040000
R79CCPTS DS    BL3                Last CPMB entry time stamp in         01041000
*                                 units of 128 microsecs                01042000
*                                 (be aware that this value wraps       01043000
*                                 about every 35.79 minutes)      @BAA  01044000
R79CACR  DS    CL5                Channel path acronym            @G1A  01045000
R79CCMG  DS    BL1                CPMF Channel Measurement Group  @H1A  01046000
R79CFG4  DS    BL1                Channel Path Flags              @H1C  01047000
R79CMBV  EQU   X'80'              CPMF Maximum Bus cycles Valid   @H1C  01048000
R79CMCV  EQU   X'40'              CPMF Maximum Channel work units       01049000
*                                 Valid                           @H1C  01050000
R79CMWV  EQU   X'20'              CPMF Maximum Write data units         01051000
*                                 Valid                           @H1C  01052000
R79CMRV  EQU   X'10'              CPMF Maximum Read data units          01053000
*                                 Valid                           @H1C  01054000
R79CUSV  EQU   X'08'              CPMF data Unit Size Valid       @H1C  01055000
R79CCPP  DS    BL1                Channel path parameter          @I3C  01056000
R79CCCM  DS    CL48               CPMF Channel Measurement        @H1A  01057000
*                                 extended Mode                   @H1A  01058000
************** CHANNEL Measurement Group 1 **************************** 01059000
         ORG   R79CCCM                                            @H1A  01060000
R79CCM1  DS    0CL8               Channel data Measurement Group1 @H1A  01061000
R79CTUT  DS    BL4                CPMF Total channel path busy    @H1A  01062000
*                                 Time in units of                @H1A  01063000
*                                 128 microseconds                @H1A  01064000
R79CPUT  DS    BL4                CPMF LPAR channel path busy     @H1A  01065000
*                                 Time in units of                @H1A  01066000
*                                 128 microseconds                @H1A  01067000
         DS    CL40               Reserved                        @H1A  01068000
************** CHANNEL Measurement Group 2 **************************** 01069000
         ORG   R79CCCM                                            @H1A  01070000
R79CCCC  DS    0CL20              CPMF Channel Characteristics    @H1A  01071000
*                                 data                            @H1A  01072000
R79CMBC  DS    BL4                CPMF Maximum Bus Cycles per     @H1A  01073000
*                                 second                          @H1A  01074000
R79CMCU  DS    BL4                CPMF Maximum Channel work Units @H1A  01075000
*                                 per second                      @H1A  01076000
R79CMWU  DS    BL4                CPMF Maximum Write data Units   @H1A  01077000
*                                 per second                      @H1A  01078000
R79CMRU  DS    BL4                CPMF Maximum Read data Units    @H1A  01079000
*                                 per second                      @H1A  01080000
R79CUS   DS    BL4                CPMF data Unit Size in bytes    @H1A  01081000
R79CCCD  DS    0CL28              Channel Measurement Group 2     @H1A  01082000
*                                 Data                            @H1A  01083000
R79CTBC  DS    BL4                CPMF Total Bus Cycles Count     @H1A  01084000
R79CTUC  DS    BL4                CPMF Total channel work Unit    @H1A  01085000
*                                 Count                           @H1A  01086000
R79CPUC  DS    BL4                CPMF LPAR channel work Unit     @H1A  01087000
*                                 Count                           @H1A  01088000
R79CTWU  DS    BL4                CPMF Total Write data Units     @H1A  01089000
R79CPWU  DS    BL4                CPMF LPAR Write data Units      @H1A  01090000
R79CTRU  DS    BL4                CPMF Total Read data Units      @H1A  01091000
R79CPRU  DS    BL4                CPMF LPAR Read data Units       @H1A  01092000
         SPACE                                                          01093000
R79CRLEN EQU   *-R79CCHNL         LENGTH OF RELOCATE SECTION            01094000
.STYPD   ANOP                                                           01095000
*                                                                       01096000
*           RELOCATE BLOCK FOR SUBTYPE D - MONITOR 2                    01097000
*           I/O QUEUING SECTION (308X/LEAR)                        @P4C 01098000
*                                                                       01099000
*********************************************************************** 01100000
         SPACE 2                                                        01101000
**********************  I/O QUEUING CONFIGURATION CONTROL SECTION  **** 01102000
R79DCS   DSECT                                                          01103000
R79DID1  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P4C 01104000
*                                                                  @P4D 01105000
R79DNTR  DS    BL2      NUMBER OF DESCRIPTOR TRIPLETS                   01106000
R79DCPDS DS    BL4      OFFSET TO CONFIGURATION DATA SECTION            01107000
R79DCPDL DS    BL2      LENGTH OF CONFIGURATION DATA SECTION            01108000
R79DCPDN DS    BL2      NUMBER OF CONFIGURATION DATA SECTIONS           01109000
R79DCPDX EQU   8        NUMBER OF CONFIGURATION DATA SECTIONS  @YA61897 01110000
R79DCSL  EQU   (*-R79DCS)+R79DCPDX*R79DCPDY LENGTH OF CONFIGURATION     01111000
*                       CONTROL SECTION PLUS CONFIG DATA SECTIONS       01112000
R79DRLEN EQU   R79DCSL+R79DDSL  LENGTH OF A RELOCATE BLOCK              01113000
R79DFLEN EQU   0        LENGTH OF A FIXED BLOCK                         01114000
*                       (WE ONLY HAVE RELOCATE BLOCKS)                  01115000
R79DRMAX EQU   256      MAXIMUM NUMBER OF RELOCATE BLOCKS (MAXRB)       01116000
         SPACE 2                                                        01117000
**********************  I/O QUEUING CONFIGURATION DATA SECTION  ******* 01118000
R79DCPD  DSECT                                                          01119000
R79DCPID DS    BL1      CHANNEL PATH IDENTIFIER                         01120000
         SPACE ,                                                        01121000
R79DCPST DS    BL1      CHANNEL PATH STATUS                             01122000
R79DCPI  EQU   X'80'    CHANNEL PATH INSTALLED                          01123000
R79DCPO  EQU   X'40'    CHANNEL PATH ONLINE                             01124000
R79DCPV  EQU   X'20'    CHANNEL PATH VARIED                             01125000
R79DVPOF EQU   X'10'    PATH OFFLINE TO ALL DEVICES TO THE LCU     @P4A 01126000
R79DVP   EQU   X'08'    PATH CONNECTIVITY TO DEVICES OF THE LCU    @P4A 01127000
*                       HAS MANIPULATED VIA VARY PATH              @P4A 01128000
         SPACE ,                                                        01129000
R79DCUN  DS    BL2      NUMBER OF CONTROL UNITS ATTACHED                01130000
R79DCU   DS    0BL8     CONTROL UNITS ATTACHED TO THIS CHANNEL PATH     01131000
R79DCU1  DS    BL2      1ST CONTROL UNIT IDENTIFIER                     01132000
R79DCU2  DS    BL2      2ND CONTROL UNIT IDENTIFIER                     01133000
R79DCU3  DS    BL2      3RD CONTROL UNIT IDENTIFIER                     01134000
R79DCU4  DS    BL2      4TH CONTROL UNIT IDENTIFIER                     01135000
R79DCPDY EQU   *-R79DCPD LENGTH OF CONFIGURATION DATA SECTION           01136000
         SPACE 2                                                        01137000
**********************  I/O QUEUING DATA SECTION  ********************  01138000
R79DDS   DSECT                                                          01139000
         DS    BL1      RESERVED                                   @P4C 01140000
         SPACE ,                                                        01141000
R79DDST  DS    BL1      DATA STATUS                                     01142000
R79DCPS  EQU   X'80'    1... .... ON= NO STCPS DATA AVAILABLE           01143000
R79DNHMA EQU   X'20'    ..1. .... ON= NO HARDWARE MEASUREMENTS     @O1A 01144000
R79DICT  DS    BL2      COUNT OF SUCCESSIVE UNSUCCESSFUL SAMPLES        01145000
*                       IF THIS COUNT DIFFERS FROM ZERO, THE            01146000
*                       FOLLOWING FIELDS, BESIDES R79DABY, ARE          01147000
*                       NOT SET UP                                      01148000
R79DABY  DS    BL4      NUMBER OF SAMPLES WHEN ALL CHANNEL PATHS        01149000
*                       IN THE LCU WERE BUSY, VALID ONLY IF             01150000
*                       STCPS DATA AVAILABLE                            01151000
R79DTIS  DS    BL4      TOTAL NUMBER OF  INITIAL SELECTION ATTEMPTS     01152000
R79DSIS  DS    BL4      TOTAL NUMBER OF SUCCESSFUL SELECTION            01153000
*                       ATTEMPTS                                        01154000
R79DCUB  DS    BL4      TOTAL NUMBER OF UNSUCCESSFUL SELECTION          01155000
*                       ATTEMPTS DUE TO CONTROL UNIT BUSY               01156000
R79DDVB  DS    BL4      TOTAL NUMBER OF UNSUCCESSFUL SELECTION          01157000
*                       ATTEMPTS DUE TO DEVICE BUSY                     01158000
R79DQUE  DS    BL4      TOTAL NUMBER OF REQUESTS QUEUED FOR THE LCU     01159000
*                       (ACCUMULATED AT INITIAL SELECTION TIME)         01160000
*                       THE FIELD R79DQUE IS NOT SET UP FOR I/O    @O1A 01161000
*                       MEASUREMENT LEVEL X'02' LEAR PROCESSORS    @O1A 01162000
R79DID2  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P4A 01163000
         DS    BL2      RESERVED                                   @P4A 01164000
R79DDSL  EQU   *-R79DDS LENGTH OF DATA SECTION                          01165000
.STYPE   ANOP                                                      @P4A 01166000
*                                                                  @P4A 01167000
*           FIXED BLOCK FOR SUBTYPE E - MONITOR 2                  @P4A 01168000
*           I/O QUEUING SECTION (3090,9021,9121,9221)              @P4A 01169000
*                                                                  @P4A 01170000
*******************************************************************@P4A 01171000
         SPACE 2                                                   @P4A 01172000
**********************  GLOBAL I/O QUEUING SECTION                 @P4A 01173000
R79EGD   DSECT                                                     @P4A 01174000
         SPACE ,                                                        01175000
R79EGFLG DS    BL1      GLOBAL IOQ STATUS                          @P4A 01176000
R79EGCMF EQU   X'80'    1... .... ON= DATA IS INVALID DUE TO FAILURE    01177000
*                                     OF THE CHANNEL MEASUREMENT        01178000
*                                     FACILITY                     @P4A 01179000
R79EGDIF EQU   X'40'    .1.. .... ON= DIAGNOSE INTERFACE FAILURE   @P4A 01180000
R79EGDIR EQU   X'20'    ..1. .... ON= ESCON Director in Config.    @Z2A 01181000
R79EGSSQ EQU   X'10'    ...1 .... ON= CHSC store secondary queue        01182000
*                                     data not supported           @E1A 01183000
R79EGCMH EQU   X'08'    .... 1... ON= DCM is supported by hardware @I3A 01184000
R79EGCMD EQU   X'04'    .... .1.. ON= Configuration contains DCM   @I3A 01185000
*                                 managed channels                 @I3A 01186000
*                       .... ..11 Reserved                         @I3A 01187000
         DS    BL3      FOR ALIGNMENT ONLY                         @P4A 01188000
R79EGSAM DS    BL4      CPMT SAMPLE COUNT                          @P4A 01189000
         SPACE ,                                                        01190000
R79EFLEN EQU   *-R79EGD LENGTH OF A FIXED BLOCK                    @P4A 01191000
         SPACE 2                                                   @P4A 01192000
*                                                                  @P4A 01193000
*           RELOCATE BLOCK FOR SUBTYPE E - MONITOR 2               @P4A 01194000
*           I/O QUEUING SECTION (3090,9021,9121,9221)              @P4A 01195000
*                                                                  @P4A 01196000
*******************************************************************@P4A 01197000
         SPACE 2                                                   @P4A 01198000
**********************  I/O QUEUING CONFIGURATION CONTROL SECTION  @P4A 01199000
R79ECS   DSECT                                                     @P4A 01200000
R79EID1  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P4A 01201000
R79ENTR  DS    BL2      NUMBER OF DESCRIPTOR TRIPLETS              @P4A 01202000
R79ECPDS DS    BL4      OFFSET TO CONFIGURATION DATA SECTION       @P4A 01203000
R79ECPDL DS    BL2      LENGTH OF CONFIGURATION DATA SECTION       @P4A 01204000
R79ECPDN DS    BL2      NUMBER OF CONFIGURATION DATA SECTIONS      @P4A 01205000
R79ECPDX EQU   8        NUMBER OF CONFIGURATION DATA SECTIONS  @YA41310 01206000
R79ECSL  EQU   (*-R79ECS)+R79ECPDX*R79ECPDY LENGTH OF CONFIG.      @P4A 01207000
*                       CONTROL SECTION PLUS CONFIG DATA SECTIONS  @P4A 01208000
R79ERLEN EQU   R79ECSL+R79EDSL  LENGTH OF A RELOCATE BLOCK         @P4A 01209000
R79ERMAX EQU   256      MAXIMUM NUMBER OF RELOCATE BLOCKS (MAXRB)  @P4A 01210000
         SPACE 2                                                   @P4A 01211000
**********************  I/O QUEUING CONFIGURATION DATA SECTION  ***@P4A 01212000
R79ECPD  DSECT                                                     @P4A 01213000
R79ECPID DS    BL1      CHANNEL PATH IDENTIFIER                    @P4A 01214000
         SPACE ,                                                   @P4A 01215000
R79ECPST DS    BL1      CHANNEL PATH STATUS                        @P4A 01216000
R79ECPI  EQU   X'80'    CHANNEL PATH INSTALLED                     @P4A 01217000
R79ECPO  EQU   X'40'    CHANNEL PATH ONLINE                        @P4A 01218000
R79ECPV  EQU   X'20'    CHANNEL PATH VARIED                        @P4A 01219000
R79EVPOF EQU   X'10'    PATH OFFLINE TO ALL DEVICES OF THE LCU     @P4A 01220000
R79EVP   EQU   X'08'    PATH CONNECTIVITY TO DEVICES OF THE LCU    @P4A 01221000
*                       HAS MANIPULATED VIA VARY PATH              @P4A 01222000
R79ECPM  EQU   X'02'    Channel path is DCM managed                @I3A 01223000
R79ECPMR EQU   X'01'    CHPID manipulated, requiring data reset    @I3A 01224000
         SPACE ,                                                   @P4A 01225000
R79ECUN  DS    BL2      NUMBER OF CONTROL UNITS ATTACHED           @P4A 01226000
R79ECU   DS    0BL8     CONTROL UNITS ATTACHED TO THIS CHANNEL P.  @P4A 01227000
R79ECU1  DS    BL2      1ST CONTROL UNIT IDENTIFIER                @P4A 01228000
R79ECU2  DS    BL2      2ND CONTROL UNIT IDENTIFIER                @P4A 01229000
R79ECU3  DS    BL2      3RD CONTROL UNIT IDENTIFIER                @P4A 01230000
R79ECU4  DS    BL2      4TH CONTROL UNIT IDENTIFIER                @P4A 01231000
R79ECUB  DS    BL4      COUNT OF CU BUSY                           @P4A 01232000
R79EPT   DS    BL4      COUNT OF OPERATIONS ACCEPTED               @P4A 01233000
R79EPB   DS    BL4      CHANNEL PATH BUSY COUNT                    @P4A 01234000
R79EDPBC DS    BL4      Count of ESCON Director port busy          @Z2C 01235000
         DS    BL4      Reserved                                   @Z1A 01236000
R79ECPDY EQU   *-R79ECPD LENGTH OF CONFIGURATION DATA SECTION      @P4A 01237000
         SPACE 2                                                   @P4A 01238000
**********************  I/O QUEUING DATA SECTION  *****************@P4A 01239000
R79EDS   DSECT                                                     @P4A 01240000
R79EID2  DS    BL2      LOGICAL CONTROL UNIT IDENTIFIER            @P4A 01241000
R79EDST  DS    BL1      DATA STATUS                                @P4A 01242000
*        EQU   X'80'    RESERVED                                   @P4A 01243000
R79ENHMA EQU   X'40'    .1.. .... ON= NO HARDWARE MEASUREMENTS     @Z1C 01244000
R79ELDCM EQU   X'08'    .... 1... ON= LCU contains DCM managed     @I3A 01245000
*                       channels                                   @I3A 01246000
         DS    BL1      RESERVED                                   @P4A 01247000
R79EQSM  DS    BL4      QUEUED SUM ON THE CU-HDR QUEUE             @P4A 01248000
R79EQCT  DS    BL4      COUNT OF ENTRIES PLACED ON THE CU-HDR Q.   @P4A 01249000
R79EMCMN DS    BL2      Min number of DCM managed channels used    @I3A 01250000
R79EMCMX DS    BL2      Max number of DCM managed channels used    @I3A 01251000
R79EMCDF DS    BL2      Defined number of DCM managed channels     @I3A 01252000
         DS    BL2      Reserved                                   @I3A 01253000
R79EPTM  DS    BL4      Accumulated path taken count for DCM       @I3A 01254000
*                       managed channels                           @I3A 01255000
R79EDPBM DS    BL4      Accumulated director port busy count for   @I3A 01256000
*                       DCM managed channels                       @I3A 01257000
R79ECUBM DS    BL4      Accumulated control unit busy count for    @I3A 01258000
*                       DCM managed channels                       @I3A 01259000
R79EDSL  EQU   *-R79EDS LENGTH OF DATA SECTION                     @P4A 01260000
         SPACE 2                                                   @F1A 01261000
**********************  IMS Long Lock Data Section *************** @F1A 01262000
R79FIRLM DSECT                                                     @F1A 01263000
R79FISTN DS    CL16     IRLM Lock Structure Name                   @F1A 01264000
R79FDLKC DS    BL4      Dead Lock Cycle Number                     @F1A 01265000
R79FETYP DS    CL1      'B' = Blocker / 'W' = Waiter               @F1A 01266000
R79FAVL  DS    CL3      Reserved                                   @F1A 01267000
R79FWAIT DS    0C       Start of variable Section: Waiter data     @F1A 01268000
         ORG   R79FWAIT                                            @F1A 01269000
R79FBLKR DS    0C                                                  @F1A 01270000
R79FIMSI DS    CL8      IMS Subsystem ID                           @F1A 01271000
R79FPSTN DS    CL2      PST Number                                 @F1A 01272000
R79FPSBN DS    CL8      PSB Name                                   @F1A 01273000
R79FRGTY DS    CL1      Region Type                                @F1A 01274000
R79FRCVT DS    CL16     Recovery Token                             @F1A 01275000
R79FCTID DS    CL8      CICS Task ID (If CICS)                     @F1A 01276000
R79FLHTI DS    CL8      Lock Held Time-Duration                    @F1A 01277000
R79FLHCN DS    CL4      Max Lock Held-PSTLKHLD                     @F1A 01278000
R79FLKNA DS    CL16     Lock Name                                  @F1A 01279000
R79FTRNM DS    CL8      Transaction Name / Job Name            @WA27252 01280000
R79FRSNA DS    CL8      Resource (DB/Area) Name                    @F1A 01281000
R79FIRLL EQU   *-R79FIRLM   Length of data section                 @F1A 01282000
         SPACE 2                                                   @F1A 01283000
R79FRBAT EQU   X'80'    Region type = BATCH                        @F1A 01284000
R79FRBMP EQU   X'40'    Region type = BMP                          @F1A 01285000
R79FRIFP EQU   X'20'    Region type = IFP                          @F1A 01286000
R79FRCIC EQU   X'10'    Region type = CICS                         @F1A 01287000
R79FRMPP EQU   X'08'    Region type = MPP                          @F1A 01288000
R79FRDBC EQU   X'04'    Region type = DBCTL                        @F1A 01289000
******************* End IMS Long Lock Data Section *************** @F1A 01290000
         SPACE 2                                                   @F1A 01291000
         MEXIT                                                          01292000
.ERR     ANOP                                                           01293000
         MEND                                                           01294000
**/                                                                     01295000
 %PLSMACRO: ;                                                           01296000
*/*** START OF SPECIFICATIONS ****************************************/ 01297000
*/*                                                                  */ 01298000
*/* Macro Name: ERBSMF79                                             */ 01299000
*/*                                                                  */ 01300000
*/* Descriptive Name: Mapping Macro for SMF record type 79           */ 01301000
*/*                   (Monitor II)                                   */ 01302000
*/*                                                                  */ 01303000
*/* DSECT names: SMF79HDR, SMF79PRO, R79CHL,                         */ 01304000
*/*              further depending on subtype selected:              */ 01305000
*/*              R791ELEM,                                           */ 01306000
*/*              R792ELEM,                                           */ 01307000
*/*              R793,                                               */ 01308000
*/*              R794,                                               */ 01309000
*/*              R795ELEM,                                           */ 01310000
*/*              R796ELEM,                                           */ 01311000
*/*              R797ELEM,                                           */ 01312000
*/*              R798ELEM,                                           */ 01313000
*/*              R799ELEM,                                           */ 01314000
*/*              R79AELEM,                                           */ 01315000
*/*              R79BCNTL, R79BELEM,                                 */ 01316000
*/*              R79CCNTL, R79CCHNL,                                 */ 01317000
*/*              R79DCS, R79DCPD, R79DDS,                            */ 01318000
*/*              R79EGD, R79ECS, R79ECPD, R79EDS                     */ 01319000
*/*              R79FIRLM                                        @F1A*/ 01320000
*/*                                                                  */ 01321000
*/* Component: 27404                                                 */ 01322000
*/*                                                                  */ 01323000
*   ?ERBCOPY1 Y1(1983);                                        /*@A1C*/ 01324000
*/*                                                                  */ 01325000
*/* Function: This macro maps the complete SMF record                */ 01326000
*/*           type 79. The record consists of 5 parts:               */ 01327000
*/*           1. The fixed portion of the SMF header.                */ 01328000
*/*              This mapping is invoked by calling macro ERBHDR.    */ 01329000
*/*           2. The individual header extension which               */ 01330000
*/*              contains offset/length/number triplets              */ 01331000
*/*              to address the record parts following the           */ 01332000
*/*              RMF product section.                                */ 01333000
*/*           3. The RMF product section.                            */ 01334000
*/*              This mapping is invoked by calling macro ERBPRO.    */ 01335000
*/*           4. The RMF data control section.                       */ 01336000
*/*           5. The RMF data sections.                              */ 01337000
*/*                                                                  */ 01338000
*/* Notes: None                                                      */ 01339000
*/*                                                                  */ 01340000
*/* Method of access: See below                                      */ 01341000
*/*                                                                  */ 01342000
*/*    PL/AS:         see below                                      */ 01343000
*/*                                                                  */ 01344000
*/*            %IFAR79x='1' semicolon  x = subtype selected          */ 01345000
*/*            %INCLUDE SYSLIB(ERBSMF79)                             */ 01346000
*/*                                                                  */ 01347000
*/* Created by: ERBPCTBL                                             */ 01348000
*/*                                                                  */ 01349000
*/* Pointed to by: local pointer                                     */ 01350000
*/*                                                                  */ 01351000
*/* Subpool and Key: Subpool MFSBSUBP                                */ 01352000
*/*                                                                  */ 01353000
*/* Serialization: None                                              */ 01354000
*/*                                                                  */ 01355000
*/* Size:  SMF79HDR   68                                             */ 01356000
*/*        SMF79PRO   52                                             */ 01357000
*/*        R79CHL    104                                             */ 01358000
*/*        R791ELEM  118                                         @A3C*/ 01359000
*/*        R792ELEM  120                                             */ 01360000
*/*        R793       54                                             */ 01361000
*/*        R794      108                                         @A3C*/ 01362000
*/*        R795ELEM   60                                             */ 01363000
*/*        R796ELEM   84                                             */ 01364000
*/*        R797ELEM   92                                             */ 01365000
*/*        R798ELEM   52                                             */ 01366000
*/*        R799ELEM  100                                         @G2C*/ 01367000
*/*        R79AELEM   64                                         @A3C*/ 01368000
*/*        R79BCNTL    4                                             */ 01369000
*/*        R79BELEM   96                                         @Y2C*/ 01370000
*/*        R79CCNTL   16                                         @BAC*/ 01371000
*/*        R79CCHNL   24                                         @G1C*/ 01372000
*/*        R79DCS     12                                             */ 01373000
*/*        R79DCPD    12                                             */ 01374000
*/*        R79DDS     32                                             */ 01375000
*/*        R79EGD      8                                             */ 01376000
*/*        R79ECS     12                                             */ 01377000
*/*        R79ECPD    24                                             */ 01378000
*/*        R79EDS     12                                             */ 01379000
*/*        R79FIRLM  103                                         @F1A*/ 01380000
*/*                                                                  */ 01381000
*/* Deleted by: at termination                                       */ 01382000
*/*                                                                  */ 01383000
*/* Distribution Library: RMFMAC01                                   */ 01384000
*/*                                                                  */ 01385000
*/* Change Activity: See below                                       */ 01386000
*/*                                                                  */ 01387000
*/*   $N0=MON1,HRM3102,,WBS: NEW FOR RMF 3.1                     @N0A*/ 01388000
*/*   $O1=4381,JRM3212,,SHR: 4381 - support                      @O1A*/ 01389000
*/*   $P1=SRM,HRM3302,,THE: SRM - SUPPORT  (SAD-STCPS)           @P1A*/ 01390000
*/*   $P2=ES,HRM3302,,KLZ: CHANGED LAYOUT / EXTENDED STORAGE     @P2A*/ 01391000
*/*   $P3=MON2,HRM3302,,FRY: CHANGED LAYOUT / DOMAIN REPORT      @P3A*/ 01392000
*/*   $P4=3090,HRM3302,,WEY: 3090 support                        @P4A*/ 01393000
*/*   $P5=3090,HRM3302,,MLN: 3090 support                        @P5A*/ 01394000
*/*   $Q1=RESV,HRM3402,,MLN: Reserve conv to global, DCR2        @Q1A*/ 01395000
*/*   $S1=TRQ,JRM3412,,WRC: Support for SP2.1.7 True Ready Queue @S1A*/ 01396000
*/*   $Q2=MIG,HRM3402,,HEN: R794MAGE is moved and changed to         */ 01397000
*/*                         fixed 31.                   OZ95298  @Q2A*/ 01398000
*/*    NO CHANGE - RESHIPPED TO SUPERCEDE OZ95298            @ZA98025*/ 01399000
*/*   $R0=220SUP,JRM3422,,WRC: SUPPORT FOR MVS SP2.2.0           @R0A*/ 01400000
*/*   $U1=SGSUP,JRM3512,,KLZ: Storage Group support              @U1A*/ 01401000
*/*   $U2=UCBDMC,JRM3512,,TJI: UCBDMC constraint relief          @U2A*/ 01402000
*/*   $W1=SP310,HRM4410,,SOT: MVS SP 3.1.0 Support               @W1A*/ 01403000
*/*   $W2=SP310,HRM4410,,PAE: IARXC return code handling         @W2A*/ 01404000
*/*   $W3=LSCR,HRM4410,,BHL: Large systems constraint relief     @W3A*/ 01405000
*/*   $W4=APAR,HRM4410,,SOT: Integration of APAR OY05739         @W4A*/ 01406000
*/*   $W5=MISC,HRM4410,,PAE: ASCB frame count constraint relief  @W5A*/ 01407000
*/*   $W6=MISC,JRM4411,,SHR: Clean up to reduce compiler msgs    @W6A*/ 01408000
*/*   $W7=SP310E,JRM4411,,PEA: MVS SP 3.1.0E Support             @W7A*/ 01409000
*/*   $W8=SP310E,JRM4411,,PAE: Stor isolation for ESO hiperspaces@W8A*/ 01410000
*/*   $Y1=DMSR,HRM4420,,CLL: Model Type (SHARE SOMVSP87001)      @Y1A*/ 01411000
*/*   $Y2=LJM,HRM4420,,LAH: Large Job Management Support         @Y2A*/ 01412000
*/*   Expanded storage frame count constraint relief         @YA28328*/ 01413000
*/*   Support for MVS/ESA Large Job Management SPE           @YA20560*/ 01414000
*/*   $Z1=OY29112,JRM4411,,WRC: ESCA Basis                       @Z1A*/ 01415000
*/*   $Z2=OY29112,JRM4411,,WRC: Serial & Switch Support          @Z2A*/ 01416000
*/*   SHR: Include FLPA/EFLPA frames and real frame zero     @YA34458*/ 01417000
*/*   $A1=APPC,JRM4421,,BAJU: APPC tolerating support            @A1A*/ 01418000
*/*   $A2=WSET,JRM4421,,BB: Working Set Management /Block Paging @A2A*/ 01419000
*/*   $A3=WSET,JRM4421,,RTN: Working Set Management/Block Paging @A3A*/ 01420000
*/*   RN: Increases max number of channel paths per LCU to 8 @YA41310*/ 01421000
*/*   GBO:Fix 0C9 calculating AVERAGE TRANSACTION TIME       @YA41781*/ 01422000
*/*   PFU: Insert 4-byte EXCP count field                    @YA42170*/ 01423000
*/*   $BA=MIF,JRM4422,,BHL: ESCON Multiple Image Facility SPE    @BAA*/ 01424000
*/*   LGO: INCLUDE CTC TYPES                                 @YA55031*/ 01425000
*/*   $C1=WLM2,HRM4440,,HKH: WLM support, subtypes 1, 2, 5, 8    @C1A*/ 01426000
*/*   $C2=4KUCB,HRM4440,,FF: Four Digit Device Numbers (>4K UCB) @C2A*/ 01427000
*/*   LAN: Increase max number of channel paths for 308X/4381@YA61897*/ 01428000
*/*   $C3=NEWCH,HRM5510,,FF: New channel support (OSA,ISC,Pacer) @C3A*/ 01429000
*/*   HUE: ABEND0C9 in ERBRDEV due to invalid data because   @YA66876*/ 01430000
*/*        Mon I interval ended while ERBGDEV accessed EDDBB @YA66876*/ 01431000
*/*   $D3=NEWISD,HRM5520,,FF: Integrated System Device       @WA10257*/ 01432000
*/*   $E1=IPM,OW17898,,HBE: Enabling of M II reports             @E1A*/ 01433000
*/*   $E2=MISC,HRM6603,,HOL: Preemptable SRB support             @E2A*/ 01434000
*/*   $F1=IRLM,HRM6604,,HOL: IMS Long Lock Report                @F1A*/ 01435000
*/*   GUB: Additional field in 79.15 record                  @WA27252*/ 01436000
*/*   FDL: Add ORG for header adjustment (PMR16340)          @WA28830*/ 01437000
*/*   $G1=ACR,HRM6606,,PS: Channel Type Support                  @G1A*/ 01438000
*/*   $G2=PAV,HRM6606,,PS: PAV device support                    @G2A*/ 01439000
*/*   $H1=FICON,HRM6607,,PS:  Fibre Channel Support              @H1A*/ 01440000
*/*   $I1=MISC,HRM7703,,FDL: Correct comments on R79xCL          @I1A*/ 01441000
*/*   $I2=TBIT,HRM7703,,SHR: Honors T-bit in SCHIB               @I2A*/ 01442000
*/*    PS: R79CCPTS to small for values bigger than 16MB     @WA39393*/ 01443000
*/*   SHR: PAV device support                                @WA31701*/ 01444000
*/*   $I3=DCM,HRM7703,,SHR: Dynamic CHPID Management support     @I3A*/ 01445000
*/*   $I4=WLM,HRM7703,,HOL: SDSF Support                         @I4A*/ 01446000
*/*   $I5=BIT64,HRM7703,,VTH: 64 Bit real support                @I5A*/ 01447000
*/*   GUB: WLM goal mode inhibitor removal                   @WA46476*/ 01447500
*/*   GUB: Temporal affinity                                 @WA46622*/ 01447700
*/*                                                                  */ 01448000
*/**** END OF SPECIFICATIONS *****************************************/ 01449000
    @EJECT;                                                             01450000
*    /* COMMON SMF HEADER */                                            01451000
*?ERBHDR TYPE(79) ATTRIBUT(BASED(SMF79PTR));                            01452000
*   @SPACE;                                                             01453000
*    /* INDIVIDUAL HEADER EXTENSION */                                  01454000
*   @SPACE;                                                             01455000
 % IF IFAR79F='YES' %THEN %GOTO HX79F;                      /*   @F1A*/ 01456000
*/********************************************************************/ 01457000
*/*                                                              @F1A*/ 01458000
*/* It is only possible to include subtype 15 without any other  @F1A*/ 01459000
*/* subtype into a module. Subtype 15 will only be processed by  @F1A*/ 01460000
*/* Monitor II display session report IRLM.                      @F1A*/ 01461000
*/*                                                              @F1A*/ 01462000
*/********************************************************************/ 01463000
*      2 SMF79HDX,                /* HEADER EXTENTION                */ 01464000
*        3 SMF79MCS FIXED(31),    /* OFFSET TO MONITOR II CONTROL       01465000
*                                    SECTION                         */ 01466000
*        3 SMF79MCL FIXED(15),    /* LENGTH OF MONITOR II CONTROL       01467000
*                                    SECTION                         */ 01468000
*        3 SMF79MCN FIXED(15),    /* NUMBER OF MONITOR II CONTROL       01469000
*                                    SECTION                         */ 01470000
*        3 SMF79ASS FIXED(31),    /* OFFSET TO DATA SECTION          */ 01471000
*        3 SMF79ASL FIXED(15),    /* LENGTH OF DATA SECTION          */ 01472000
*        3 SMF79ASN FIXED(15),    /* NUMBER OF DATA SECTION          */ 01473000
*        3 SMF79DCS FIXED(31),    /* OFFSET TO DATA CONTROL SECTION  */ 01474000
*        3 SMF79DCL FIXED(15),    /* LENGTH OF DATA CONTROL SECTION  */ 01475000
*        3 SMF79DCN FIXED(15),    /* NUMBER OF DATA CONTROL SECTION  */ 01476000
*        3 SMF79QSS FIXED(31),    /* OFFSET IOQ GLOBAL SECTION   @P4A*/ 01477000
*        3 SMF79QSL FIXED(15),    /* LENGTH IOQ GLOBAL SECTION   @P4A*/ 01478000
*        3 SMF79QSN FIXED(15);    /* NUMBER IOQ GLOBAL SECTION   @P4A*/ 01479000
*@SPACE;                                                                01480000
 %GOTO L79PRO;                                              /*   @F1A*/ 01481000
 %HX79F:;                                                   /*   @F1A*/ 01482000
*      2 SMF79FHX,                /* 79 Subtype 15 Header Ext.   @F1A*/ 01483000
*        3 SMF79FPO FIXED(31),    /* Offset to IMS Long Lock Data       01484000
*                                    Section                     @F1A*/ 01485000
*        3 SMF79FPL FIXED(15),    /* Length of IMS Long Lock Data       01486000
*                                    Section                     @F1A*/ 01487000
*        3 SMF79FPN FIXED(15);    /* Number of IMS Long Lock Data       01488000
*                                    Sections                    @F1A*/ 01489000
*   @SPACE;                                                 /*   @F1A*/ 01490000
 %L79PRO:;                                                  /*   @F1A*/ 01491000
*    /*    COMMON RMF PRODUCT SECTION    */                             01492000
*   @SPACE;                                                             01493000
*?ERBPRO TYPE(79) ATTRIBUT(BASED(ADDR(SMF79HDR)+SMF79PRS));             01494000
*   @SPACE;                                                             01495000
 % IF IFAR79F='YES' %THEN %GOTO LR79F;                      /*   @F1A*/ 01496000
*    /*    MONITOR II  CONTROL SECTION   */                             01497000
*@SPACE;                                                                01498000
  DCL 1 R79CHL BASED(ADDR(SMF79HDR)+SMF79MCS) BDY(WORD),                01499000
                                    /* Common record 79 header   @W6C*/ 01500000
   3 R79GTOD CHAR(4),               /* Data gatherer call TOD    @W6C*/ 01501000
   3 R79LF2 BIT(8),                 /* Flag byte                 @W6C*/ 01502000
     5 R79PAR BIT(1),               /* Not enough relocate section to   01503000
                                       complete data gathering       */ 01504000
     5 R79SG BIT(1),                /* Report sorted by SG       @U1A*/ 01505000
     5 R79RSM BIT(1),               /* Invalid RSM data obtained @W2A*/ 01506000
     5 R79GOAL BIT(1),              /* System is in GOAL mode    @C1A*/ 01507000
     5 R79TRXI BIT(1),              /* Invalid transaction data  @C1A*/ 01508000
     5 R79SRMC BIT(1),              /* SRM mode changed          @C1A*/ 01509000
     5 R79INV BIT(1),               /* inval. data fr. Mon I @YA66876*/ 01510000
                                    /* (DEV PGSP IOQ)        @YA66876*/ 01511000
     5 * BIT(1),                    /* Reserved              @YA66876*/ 01512000
   3 R79RV1 FIXED(8),               /* Reserved                      */ 01513000
   3 R79SES CHAR(2),                /* Session name                  */ 01514000
   3 R79RSV FIXED(15),              /* Reserved                  @W6C*/ 01515000
   3 R79USER FIXED(15),             /* User field                @W6C*/ 01516000
   3 R79RID CHAR(8),                /* Measurement name              */ 01517000
   3 R79CTXTL FIXED(15),            /* Length of command text    @W6C*/ 01518000
   3 R79CTEXT CHAR(32),             /* Command text                  */ 01519000
   3 R79DTXTL FIXED(15),            /* Length default DR text    @W6C*/ 01520000
   3 R79DTEXT CHAR(32),             /* Default DR text               */ 01521000
   3 R79IST CHAR(4),                /* Monitor I interval start time    01522000
                                       in 0HHMMSSF format    @ZA70287*/ 01523000
   3 R79TSR FIXED(16),              /* Total number of small records    01524000
                                                                 @W3A*/ 01525000
   3 * CHAR(2),                     /* Reserved for future use   @W3A*/ 01526000
   3 R79TOT FIXED(32),              /* Total number of data sections    01527000
                                       in large record           @W3A*/ 01528000
   3 R79NXT FIXED(32),              /* Number of data sections in       01529000
                                       following small records   @W3A*/ 01530000
   3 R79IWMTK CHAR(8);              /* Token returned from IWMRCOLL     01531000
*                                      service                   @C1A*/ 01532000
*@SPACE;                                                                01533000
 % IF IFAR791='' %THEN %GOTO LR792;                                     01534000
  /*  */                                                                01535000
  DECLARE                                                               01536000
*    /*        Data section for subtype 1                               01537000
*              ASD and ASDJ data section  */                            01538000
*   @SPACE;                                                             01539000
  1 R791ELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD), /* Mapping of    01540000
                                       element                   @W6C*/ 01541000
   3 R791ASID FIXED(15),            /* ASID number               @W6C*/ 01542000
   3 R791JBN CHAR(8),               /* Name of job               @W6C*/ 01543000
   3 R791DMN FIXED(15),             /* Domain number                    01544000
                                       not applicable in GOAL mode      01545000
                                                                 @C1C*/ 01546000
   3 R791NPG FIXED(15),             /* Performance group                01547000
                                       not applicable in GOAL mode      01548000
                                                                 @C1C*/ 01549000
   3 R791PGP FIXED(15),             /* Performance group period         01550000
                                       not applicable in GOAL mode      01551000
                                                                 @C1C*/ 01552000
   3 R791TTOD FIXED(31),            /* Real time into transaction       01553000
                                       (milliseconds)                   01554000
                                       not used since rel 330    @W6C*/ 01555000
*   @SPACE;                                                             01556000
   3 R791CL CHAR(2),                /* Current location              */ 01557000
*   @SPACE;                                                             01558000
  /*                                Contents meaning                 */ 01559000
  /*                                -------- -------                 */ 01560000
  /*                                    IN - In storage              */ 01561000
  /*                                    OT - Swapped out and ready   */ 01562000
  /*                                    LO - Logically swapped out   */ 01563000
  /*                                    NS - Non swappable           */ 01564000
  /*                                    WM - Wait queue/MSO          */ 01565000
  /*                                    WL - Wait queue/long wait    */ 01566000
  /*                                    WT - Wait queue/term wait    */ 01567000
  /*                                    WO - Wait queue/others   @I1A*/ 01568000
  /*                                    DL - TSO user delayed by SRM */ 01569000
  /*                                         to meet response time   */ 01570000
  /*                                         objective           @I1A*/ 01571000
  /*                                    PR - Privileged              */ 01572000
  /*                                    >> - Transitioning out       */ 01573000
  /*                                    << - Transitioning in        */ 01574000
*   @SPACE;                                                             01575000
   3 R791TAS FIXED(15),             /* Type of user              @W6C*/ 01576000
*   @SPACE;                                                             01577000
  /*                                Contents meaning                 */ 01578000
  /*                                -------- -------                 */ 01579000
  /*                                    0  - Batch                   */ 01580000
  /*                                    1  - Started task            */ 01581000
  /*                                    2  - Mount task              */ 01582000
  /*                                    3  - TSO                     */ 01583000
  /*                                    4  - ASCH                @A1A*/ 01584000
  /*                                    5  - OMVS                @B2A*/ 01585000
*   @SPACE;                                                             01586000
   3 R791SRC CHAR(2),               /* Reason last swap out          */ 01587000
*   @SPACE;                                                             01588000
  /*                                Contents meaning                 */ 01589000
  /*                                -------- -------                 */ 01590000
  /*                                    TI - Terminal input          */ 01591000
  /*                                    TO - Terminal output         */ 01592000
  /*                                    LW - LONG WAIT               */ 01593000
  /*                                    XS - AUX storage short       */ 01594000
  /*                                    RS - Real storage short      */ 01595000
  /*                                    DW - Detected wait           */ 01596000
  /*                                    RQ - Requested swap          */ 01597000
  /*                                    NQ - CAP enqueue             */ 01598000
  /*                                    EX - CAP exchange            */ 01599000
  /*                                    US - CAP uni-swap            */ 01600000
  /*                                    TS - Transition              */ 01601000
  /*                                    IC - Improve central storage */ 01602000
  /*                                          usage              @A3A*/ 01603000
  /*                                    IP - Improve system paging   */ 01604000
  /*                                          rate               @A3A*/ 01605000
  /*                                    MR - Make room to swap in an */ 01606000
  /*                                          out-too-long user  @A3A*/ 01607000
  /*                                    AW - APPC wait           @A1A*/ 01608000
  /*                                    IW - OMVS input wait     @B2A*/ 01609000
  /*                                    OW - OMVS output wait    @B2A*/ 01610000
  /*                                    00 - Unknown                 */ 01611000
*   @SPACE;                                                             01612000
   3 R791DP FIXED(15),              /* Dispatcher priority       @W6C*/ 01613000
   3 R791SEQN FIXED(15),            /* Reserved                  @W6C*/ 01614000
   3 R791RSV1 FIXED(16),            /* Reserved since 4.1.0      @W6C*/ 01615000
   3 R791RSV2 FIXED(16),            /* Reserved since 4.1.0      @W6C*/ 01616000
   3 R791SWC FIXED(15),             /* Transaction swap count    @W6C*/ 01617000
   3 R791SWMR FIXED(15),            /* SRM workload recom value  @W6C*/ 01618000
   3 *        FIXED(15),            /* Reserved                  @A3C*/ 01619000
   3 *        FIXED(15),            /* Reserved                  @A3C*/ 01620000
   3 R791WMS FIXED(31) BDY(HWORD),  /* SRM service for the current      01621000
                                       transaction since the last       01622000
                                       swap in                   @W6C*/ 01623000
   3 R791TCPU FIXED(31) BDY(HWORD), /* Total CPU time consumed on       01624000
                                       behalf of this address space     01625000
                                       in milliseconds.                 01626000
                                       (ascbejst+ascbsrbt+assbasst)     01627000
                                                                 @E2C*/ 01628000
                               /* wraps after 4 Giga millisec@WA02302*/ 01629000
   3 *        FIXED(15),            /* Reserved                  @A3C*/ 01630000
   3 *      FIXED(16),              /* Reserved                         01631000
                                                             @YA28328*/ 01632000
   3 R791ESCT FIXED(31) BDY(HWORD), /* Number of expanded storage       01633000
                                       frames used by job    @YA28328*/ 01634000
   3 R791RSV3 FIXED(16),            /* Reserved since 4.1.0      @W6C*/ 01635000
   3 R791PIN FIXED(31),             /* Page in count             @W1A*/ 01636000
   3 R791TRTM FIXED(31),            /* Transaction residency time       01637000
                                                                 @W1A*/ 01638000
   3 R791FLG BIT(8),                /* Flags                     @W1A*/ 01639000
     4 R791XM BIT(1),               /* Cross memory address space       01640000
                                                                 @W1A*/ 01641000
     4 R791PMON BIT(1),             /* On = data in R791CTAR is valid.  01642000
                                       Off =  not valid.         @A3A*/ 01643000
     4 R791VALV BIT(1),             /* On = data in R791VAL is valid.   01644000
                                       Off =  not valid          @A3A*/ 01645000
     4 R791GOAL BIT(1),             /* On = system is in GOAL moed      01646000
                                                                 @C1A*/ 01647000
     4 R791SRV  BIT(1),             /* On = this address space is a     01648000
                                       server address space             01649000
                                       Off =  GOAL specified for this   01650000
                                       address space is being honored   01651000
                                       by wlm                    @C1A*/ 01652000
     4 R791QSC  BIT(1),             /* On = address space has been      01653000
                                       quiesced by a RESET command      01654000
                                                                 @C1A*/ 01655000
     4 R791TXME BIT(1),             /* Like RASDTRXNMGMTEXEMPT          01656000
                                                                 @I4A*/ 01657000
     4 R791TAFF BIT(1),             /* On = address space has temporal  01657200
                                       affinities, same as RASDTAF      01657400
                                                             @WA46622*/ 01657600
   3 R791FLG2 BIT(8),               /* Additional flags          @I4C*/ 01658000
     4 R791CPRC BIT(1),             /* Same as RASDCPROTCPU      @I4A*/ 01659000
     4 R791CPRE BIT(1),             /* Same as RASDASPROTSTG     @I4A*/ 01660000
     4 R791CPRI BIT(1),             /* Same as RASDCPROTSTG      @I4A*/ 01661000
     4 R791CPUP BIT(1),             /* Same as RASDCPUPROTECTED  @I4A*/ 01662000
     4 R791STOP BIT(1),             /* Same as RASDSTGPROTECTED  @I4A*/ 01663000
   3 R791FMCT FIXED(31) BDY(HWORD), /* Number of real storage frames    01664000
                                                                 @W6C*/ 01665000
   3 R791WSS  FIXED(31) BDY(HWORD), /* Working set at last swap in      01666000
                                                                 @W6C*/ 01667000
   3 R791TWSS FIXED(31) BDY(HWORD), /* SRM target working set sze @W7C*/01668000
   3 R791ESHP FIXED(31) BDY(HWORD), /* Number of hiperspace ES          01669000
                                        pages used by job         @W7A*/01670000
   3 R791ESVI FIXED(31) BDY(HWORD), /* Number of VIO ES pages used      01671000
                                        by job                    @W8C*/01672000
   3 R791HIN  FIXED(31) BDY(HWORD), /* Number of hiperspace page ins    01673000
                                        by job                    @W8A*/01674000
   3 R791HRMS FIXED(31) BDY(HWORD), /* Number of hiperspace read        01675000
                                        misses by job             @W8A*/01676000
   3 R791BPIN FIXED(31) BDY(HWORD), /* Number of blocked pages brought  01677000
                                        in from DASD              @A2A*/01678000
   3 R791PINE FIXED(31) BDY(HWORD), /* Number of single pages brought in01679000
                                        from expanded storage     @A2A*/01680000
   3 R791BPNE FIXED(31) BDY(HWORD), /* Number of blocked pages brought  01681000
                                        in from expanded storage  @A2A*/01682000
   3 R791CTAR FIXED(31) BDY(HWORD), /* Central storage target number of 01683000
                                        frames                    @A2A*/01684000
   3 R791VAL  FIXED(31) BDY(HWORD), /* Recommendation value for WSM     01685000
                                        managed address spaces.   @A3A*/01686000
   3 R791SCL  CHAR(8),              /* Service class name         @C1A*/01687000
   3 R791SCP  FIXED(15),            /* Service class period       @C1A*/01688000
   3 R791WKLD CHAR(8),              /* Workload name              @C1A*/01689000
   3 R791RGRP CHAR(8),              /* Resource group name        @C1A*/01690000
   3 R791SPI  FIXED(32),            /* Number of page-ins from          01691000
                                       auxiliary storage for shared     01692000
                                       page groups                @D1A*/01693000
   3 R791CMNI FIXED(31),            /* Number of common pages for       01694000
                                       current transaction       @D2A*/ 01695000
   3 R791PNV FIXED(31),             /* Number of non-VIO pages for      01696000
                                       current transaction       @D2A*/ 01697000
   3 R791PVIO FIXED(31),            /* Number of VIO pages for          01698000
                                       current transaction       @D2A*/ 01699000
   3 R791EXCT FIXED(32),            /* EXCP count for                   01700000
                                       this step                 @E2C*/ 01701000
   3 R791TCPC FIXED(32),            /* Total CPU time consumed in this  01702000
                                       address space in milliseconds.   01703000
                                       (ascbejst+ascbsrbt+assbphtm)     01704000
                                                                 @E2A*/ 01705000
   3 R791ASST FIXED(32),            /* CPU time consumed by preemptible 01706000
                                       class SRBs running on behalf of  01707000
                                       this AS in milliseconds.         01708000
                                       (assbasst)                @E2A*/ 01709000
   3 R791PHTM FIXED(32),            /* CPU time consumed by preemptible 01710000
                                       class SRBs running in this AS    01711000
                                       in millisecs. (assbphtm)  @I4C*/ 01712000
   3 R791RCL  CHAR(8);              /* Report class name         @I4A*/ 01713000
 %LR792: IF IFAR792='' %THEN %GOTO LR793;                               01714000
  /* */                                                                 01715000
  DECLARE                                                               01716000
*    /* Data section for subtype 2                                      01717000
*       ARD and ARDJ data section */                                    01718000
*   @SPACE;                                                             01719000
  1 R792ELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD), /* Mapping of    01720000
                                       element                   @W6C*/ 01721000
   3 R792ASID FIXED(15),            /* ASID number               @W6C*/ 01722000
   3 R792JBN CHAR(8),               /* Name of job               @W6C*/ 01723000
   3 R792DMN FIXED(15),             /* Domain number                    01724000
                                       not applicable in GOAL mode      01725000
                                                                 @C1C*/ 01726000
   3 R792NPG FIXED(15),             /* Performance group                01727000
                                       not applicable in GOAL mode      01728000
                                                                 @C1C*/ 01729000
   3 R792CL CHAR(2),                /* Current location          @W6C*/ 01730000
*   @SPACE;                                                             01731000
  /*                                Contents meaning                 */ 01732000
  /*                                -------- -------                 */ 01733000
  /*                                    IN - In storage              */ 01734000
  /*                                    OT - Swapped out and ready   */ 01735000
  /*                                    LO - Logically swapped out   */ 01736000
  /*                                    NS - Non swappable           */ 01737000
  /*                                    WM - Wait queue/MSO          */ 01738000
  /*                                    WL - Wait queue/long wait    */ 01739000
  /*                                    WT - Wait queue/term wait    */ 01740000
  /*                                    WO - Wait queue/others   @I1A*/ 01741000
  /*                                    DL - TSO user delayed by SRM */ 01742000
  /*                                         to meet response time   */ 01743000
  /*                                         objective           @I1A*/ 01744000
  /*                                    PR - Privileged              */ 01745000
  /*                                    >> - Transitioning out       */ 01746000
  /*                                    << - Transitioning in        */ 01747000
*   @SPACE;                                                             01748000
   3 R792TAS FIXED(15),             /* Type of user              @W6C*/ 01749000
*   @SPACE;                                                             01750000
  /*                                Contents meaning                 */ 01751000
  /*                                -------- -------                 */ 01752000
  /*                                    0  - Batch                   */ 01753000
  /*                                    1  - Started task            */ 01754000
  /*                                    2  - Mount task              */ 01755000
  /*                                    3  - TSO                     */ 01756000
  /*                                    4  - ASCH                @A1A*/ 01757000
  /*                                    5  - OMVS                @B2A*/ 01758000
*   @SPACE;                                                             01759000
   3 R792TRC FIXED(15),             /* Transaction count         @W6C*/ 01760000
   3 R792TTOD FIXED(31),            /* Transaction elapsed time, in     01761000
                                       milliseconds              @W6C*/ 01762000
   3 R792PRFX FIXED(31),            /* Number of private fixed frames   01763000
                                                                 @W6C*/ 01764000
   3 R792RSV1 FIXED(16),            /* Reserved since 4.1.0      @W6C*/ 01765000
   3 R792SVAR FIXED(31) BDY(HWORD), /* SRM service absorption rate      01766000
                                       for step                  @W6C*/ 01767000
   3 R792TCPU FIXED(32) BDY(HWORD), /* Total TCB time for step in       01768000
                                       milliseconds          @WA02302*/ 01769000
                               /* wraps after 4 Giga millisec@WA02302*/ 01770000
   3 R792PSS CHAR(8) BDY(HWORD),    /* Step product of frame in         01771000
                                       milliseconds              @W6C*/ 01772000
    4 R792PSS1 FIXED(32) BDY(HWORD),/* High order word           @W6C*/ 01773000
    4 R792PSS2 FIXED(32) BDY(HWORD),/* Low order word            @W6C*/ 01774000
*   @SPACE;                                                             01775000
   3 R792EJST FIXED(32) BDY(HWORD), /* Total CPU time consumed on       01776000
                                       behalf of this address space     01777000
                                       in milliseconds.                 01778000
                                       (ascbejst+ascbsrbt+assbasst)     01779000
                                                                 @E2C*/ 01780000
                               /* wraps after 4 Giga millisec@WA02302*/ 01781000
   3 R792TSRM FIXED(31) BDY(HWORD), /* Total SRM service for step       01782000
                                                                 @W6C*/ 01783000
   3 R792RTM  FIXED(31) BDY(HWORD), /* Resident time for step, in       01784000
                                       seconds                   @W6C*/ 01785000
   3 R792EXCP FIXED(15),            /* EXCP count for step       @W6C*/ 01786000
   3 R792CMNI FIXED(31),            /* Number of common pages for       01787000
                                       current transaction       @W6C*/ 01788000
   3 R792PNV FIXED(31),             /* Number of non-VIO pages for      01789000
                                       current transaction       @W6C*/ 01790000
   3 R792PVIO FIXED(31),            /* Number of VIO pages for          01791000
                                       current transaction       @W6C*/ 01792000
   3 R792FXBL FIXED(31),            /* Number of fixed frames which     01793000
                                       are located below 16M real       01794000
                                                                 @W6C*/ 01795000
   3 R792PSWP FIXED(31),            /* Number of pages swapped in       01796000
                                       for current transaction   @W6C*/ 01797000
   3 R792LPAI FIXED(31),            /* Number of LPA pages swapped in   01798000
                                       for current transaction   @W6C*/ 01799000
   3 R792CSAI FIXED(31),            /* Number of CSA pages swapped in   01800000
                                       for current transaction   @W6C*/ 01801000
   3 R792LSQA FIXED(31),            /* Number of LSQA fixed frames      01802000
                                                                 @W6C*/ 01803000
   3 R792NLQF FIXED(31),            /* Number of non-LSQA fixed frames  01804000
                                       for this job              @W4C*/ 01805000
   3 R792TDEV FIXED(31),            /* Total device connect time        01806000
                                       in milliseconds           @W6C*/ 01807000
   3 R792RSV2 FIXED(16),            /* Reserved since 4.1.0      @W6C*/ 01808000
   3 R792PIN FIXED(31) BDY(HWORD),  /* Page-in count             @W6C*/ 01809000
   3 R792TRTM FIXED(31) BDY(HWORD), /* Transaction residency time       01810000
                                                                 @W6C*/ 01811000
   3 R792FLG BIT(8),                /* Flags                     @W6C*/ 01812000
     4 R792XM BIT(1),               /* Cross memory address space    */ 01813000
     4 R792RSM BIT(1),              /* Invalid RSM data for address     01814000
                                       space obtained            @W2A*/ 01815000
     4 *        BIT(1),             /* Reserved                  @C1A*/ 01816000
     4 R792GOAL BIT(1),             /* On = system is in GOAL moed      01817000
                                                                 @C1A*/ 01818000
     4 R792SRV  BIT(1),             /* On = this address space is a     01819000
                                       server address space             01820000
                                       Off =  GOAL specified for this   01821000
                                       address space is being honored   01822000
                                       by wlm                    @C1A*/ 01823000
     4 R792QSC  BIT(1),             /* On = address space has been      01824000
                                       quiesced by a RESET command      01825000
                                                                 @C1A*/ 01826000
     4 R792TXME BIT(1),             /* Like RASDTRXNMGMTEXEMPT          01827080
                                                             @WA46476*/ 01827160
     4 R792TAFF BIT(1),             /* On = address space has temporal  01827180
                                       affinities, same as RASDTAF      01827200
                                                             @WA46622*/ 01827220
   3 R792FLG2 BIT(8),               /* Additional flags      @WA46476*/ 01827240
     4 R792CPRC BIT(1),             /* Same as RASDCPROTCPU  @WA46476*/ 01827320
     4 R792CPRE BIT(1),             /* Same as RASDASPROTSTG @WA46476*/ 01827400
     4 R792CPRI BIT(1),             /* Same as RASDCPROTSTG  @WA46476*/ 01827480
     4 R792CPUP BIT(1),             /* Same as RASDCPUPROTECTED         01827560
                                                             @WA46476*/ 01827640
     4 R792STOP BIT(1),             /* Same as RASDSTGPROTECTED         01827720
                                                             @WA46476*/ 01827800
   3 R792LSQR FIXED(31),            /* LSQA pages in real storage       01828000
                                                                 @W1A*/ 01829000
   3 R792LSQE FIXED(31),            /* LSQA pages in ext. storage       01830000
                                       CNTFTLSD - CNTFRLSD       @W6C*/ 01831000
   3 R792ARS  FIXED(31),            /* Avg number of real frames        01832000
                                       for step                  @W6C*/ 01833000
   3 R792TWSS FIXED(31),            /* SRM target working set size      01834000
                                       for this job               @W7C*/01835000
   3 R792PHSP FIXED(31),            /* Total hiperspace pages for       01836000
                                       current transaction    @YA42170*/01837000
   3 R792EXCT FIXED(32),            /* New EXCP count         @WA19913*/01838000
   3 R792SCL  CHAR(8),              /* Service class name         @C1A*/01839000
   3 R792SCP  FIXED(15),            /* Service class period       @C1A*/01840000
   3 R792WKLD CHAR(8),              /* Workload name              @C1A*/01841000
   3 R792RGRP CHAR(8),              /* Resource group name        @E2C*/01842000
   3 *        CHAR(2),              /* Reserved                   @E2A*/01843000
   3 R792TCPC FIXED(32),            /* Total CPU time consumed in this  01844000
                                       address space in milliseconds.   01845000
                                       (ascbejst+ascbsrbt+ascbphtm)     01846000
                                                                 @E2A*/ 01847000
   3 R792ASST FIXED(32),            /* CPU time consumed by preemptible 01848000
                                       class SRBs running on behalf of  01849000
                                       this AS in milliseconds.         01850000
                                       (assbasst)                @E2A*/ 01851000
   3 R792PHTM FIXED(32),            /* CPU time consumed by preemptible 01852000
                                       class SRBs running in this AS    01853000
                                       in millisecs. (assbphtm)  @E2A*/ 01854000
   3 R792FXAB FIXED(32);            /* Number of fixed frames between   01855000
                                       16M and 2G (ESAME mode only)     01856000
                                                                 @I5A*/ 01857000
 %LR793: IF IFAR793='' %THEN %GOTO LR794;                               01858000
  /* */                                                                 01859000
  DECLARE                                                               01860000
*    /* DATA SECTION FOR SUBTYPE 3                                      01861000
*       SRCS DATA SECTION  */                                           01862000
*   @SPACE;                                                             01863000
  1 R793 BASED(ADDR(SMF79HDR)+SMF79ASS), /*SCALAR RELOCATE SE*/         01864000
*   @SPACE;                                                             01865000
   3 R793RSV1 FIXED(16) BDY(BYTE),  /* Reserved since 4.1.0       @W5C*/01866000
   3 R793CRI  FIXED(15) BDY(BYTE),  /* HIGHEST UIC COUNT */             01867000
   3 R793SQA  FIXED(15) BDY(BYTE),  /* NUMBER OF FIXED SQA FRAMES */    01868000
   3 R793CMNF FIXED(15) BDY(BYTE),  /* NUMBER OF COMMON (LPA+CSA)       01869000
                                       PAGEABLE AND FIXED FRAMES    */  01870000
   3 R793CMFF FIXED(15) BDY(BYTE),  /* NUMBER OF COMMON (LPA+CSA)       01871000
                                       FIXED FRAMES      */             01872000
   3 R793PRFX FIXED(15) BDY(BYTE),  /* NUMBER OF PRIVATE FIXED FRAMES   01873000
                                       (LSQA+NON-LSQA)    */            01874000
   3 R793CPUU FIXED(15) BDY(BYTE),  /* PROCESSOR UTILIZATION (0-101) */ 01875000
   3 R793DQ   FIXED(15) BDY(BYTE),  /* LENGTH OF OUT WAIT QUEUE         01876000
                                                             @WA19913*/ 01877000
   3 R793INC  FIXED(15) BDY(BYTE),  /* NUMBER OF ADDRESS SPACES IN      01878000
                                       IN STORAGE (SRM IN QUEUE) */     01879000
   3 R793OUTU FIXED(15) BDY(BYTE),  /* NUMBER OF ADDRESS SPACES OUT     01880000
                                       OF STORAGE (SRM OUT QUEUE) */    01881000
   3 R793LCU  FIXED(15) BDY(BYTE),  /* RESERVED  */                     01882000
   3 R793RSV4 FIXED(15) BDY(BYTE),  /* RESERVED LJM-SPE         @Y2C*/  01883000
   3 R793LPAF FIXED(15) BDY(BYTE),  /* Number of total LPA frames       01884000
                                                             @YA34458*/ 01885000
   3 R793CSAF FIXED(15) BDY(BYTE),  /* Number of total CSA frames       01886000
                                                             @YA34458*/ 01887000
   3 R793LPFX FIXED(15) BDY(BYTE),  /* NUMBER OF LPA FIXED FRAMES   */  01888000
   3 R793CSFX FIXED(15) BDY(BYTE),  /* NUMBER OF CSA FIXED FRAMES   */  01889000
   3 R793LSQA FIXED(15) BDY(BYTE),  /* NUMBER OF FIXED LSQA FRAMES  */  01890000
   3 R793NLQF FIXED(15) BDY(BYTE),  /* NUMBER OF PRIVATE NON-LSQA       01891000
                                       FIXED FRAMES  */                 01892000
   3 R793LOUT FIXED(15) BDY(BYTE),  /* NUMBER OF ADDRESS SPACES         01893000
                                       LOGICALLY SWAPPED OUT      @W1C*/01894000
   3 R793SQR  FIXED(31) BDY(BYTE),  /* SQA pages in real storage        01895000
                                       CTSQAF + CTRSQAF           @W1A*/01896000
   3 R793SQE  FIXED(31) BDY(BYTE),  /* SQA pages in ext. storage        01897000
                                       CTTSQAF - CTRSQAF          @W1A*/01898000
   3 R793LSQR FIXED(31) BDY(BYTE),  /* LSQA pages in real storage       01899000
                                       CTLSQAF + CTRLSQAF         @W1A*/01900000
   3 R793LSQE FIXED(31) BDY(BYTE),  /* LSQA pages in ext. storage       01901000
                                       CTTLSQAF - CTRLSQAF        @W5C*/01902000
   3 R793AFC  FIXED(31) BDY(BYTE),  /* NUMBER OF AVAILABLE FRAMES       01903000
                                                             @WA05435*/ 01904000
   3 R793CUT  FIXED(31) BDY(BYTE);  /* MVS view of CPU utilization      01905000
                                       (interval - wait time) if        01906000
                                       Monitor I CPU gathering is       01907000
                                       active, otherwise CCVUTILP       01908000
                                       value at end of interval.        01909000
                                       (The interval length of the      01910000
                                       MVS view value is either         01911000
                                       5 seconds or the Monitor I       01912000
                                       cycle time, if it is larger      01913000
                                       than 5 seconds.)      @WA05435*/ 01914000
 %LR794: IF IFAR794='' %THEN %GOTO LR795;                               01915000
  /* */                                                                 01916000
  DECLARE                                                               01917000
*    /* DATA SECTION FOR SUBTYPE 4                                      01918000
*       SPAG DATA SECTION  */                                           01919000
*   @SPACE;                                                             01920000
  1 R794 BASED(ADDR(SMF79HDR)+SMF79ASS), /* SCALAR RELOCATE SEC */      01921000
*   @SPACE;                                                             01922000
   3 R794CMNI FIXED(31),            /* SYSTEM COMMON (LPA+CSA)          01923000
                                       PAGES IN */                      01924000
   3 R794CMNO FIXED(31),            /* SYSTEM COMMON (CSA) PAGES OUT */ 01925000
   3 R794CMNR FIXED(31),            /* SYSTEM COMMON (LPA+CSA)          01926000
                                       PAGES RECLAIMED, not used since  01927000
                                       rel 330                        */01928000
   3 R794SWPO FIXED(31),            /* NUMBER OF SWAP-OUT         @P1C*/01929000
   3 R794PSPI FIXED(31),            /* NUMBER OF PAGES SWAPPED IN */    01930000
   3 R794PSPO FIXED(31),            /* NUMBER OF PAGES SWAPPED OUT */   01931000
   3 R794PRVI FIXED(31),            /* NUMBER OF PRIVATE PAGES          01932000
                                       (VIO+NON-VIO) SWAPPED IN */      01933000
   3 R794PRVO FIXED(31),            /* NUMBER OF PRIVATE PAGES          01934000
                                       (VIO+NON-VIO) SWAPPED OUT */     01935000
   3 R794PRVR FIXED(31),            /* NUMBER OF PRIVATE PAGES          01936000
                                       (VIO+NON-VIO) RECLAIMED */       01937000
 /*                                    not used since rel 330         */01938000
   3 R794VIO  FIXED(31),            /* NUMBER OF VIO PAGES (IN+OUT) */  01939000
   3 R794RSV1 FIXED(16),            /* Reserved since 4.1.0      @W5C*/ 01940000
   3 R794CRI  FIXED(15),            /* HIGHEST UIC COUNT */             01941000
   3 R794ACRI FIXED(15),            /* AVERAGE OF HIGH UIC COUNT */     01942000
 /*                                    not used since rel 330         */01943000
   3 R794RV1  FIXED(15),            /* RESERVED                  */     01944000
   3 R794LPAI FIXED(31),            /* SYSTEM LPA PAGES IN */           01945000
   3 R794CSAI FIXED(31),            /* SYSTEM CSA PAGES OUT */          01946000
   3 R794LPAR FIXED(31),            /* SYSTEM LPA PAGES RECLAIMED */    01947000
 /*                                    not used since rel 330         */01948000
   3 R794CSAR FIXED(31),            /* SYSTEM CSA PAGES RECLAIMED */    01949000
 /*                                    not used since rel 330         */01950000
   3 R794RSV2 FIXED(15),            /* Reserved since 4.1.0      @W5C*/ 01951000
   3 *        FIXED(15),            /* Unused.(was Migratn. age) @Q2C*/ 01952000
   3 R794ERTE FIXED(31),            /* NO. PAGES TO EXT. STOR.   @P2A*/ 01953000
   3 R794EVAL FIXED(31),            /* NO. OF EXTENDED STORAGE SLOTS    01954000
                                       AVAIL. AND NOT IN USE     @P2A*/ 01955000
   3 R794ESSL FIXED(31),            /* AVAILABLE FOR FUTURE USE  @P2A*/ 01956000
   3 R794MRTE FIXED(31),            /* NO. OF PAGES MIGRATED FROM       01957000
                                       EXT. STOR. TO AUX. STOR.  @Q2C*/ 01958000
   3 R794MAGE FIXED(31),            /* Migration age             @W5C*/ 01959000
   3 R794AFC  FIXED(31),            /* NUMBER OF AVAILABLE FRAMES @W5A*/01960000
   3 R794TWSS FIXED(31),            /* TARGET WORKING SETSIZE FOR THE   01961000
                                       COMMON AREA                @W7A*/01962000
   3 R794HSP  FIXED(31),            /* Number of hiperspace pages       01963000
                                       (IN + OUT)                 @W7A*/01964000
   3 R794PPIA FIXED(31),            /* Number of blocked pages paged in 01965000
                                       from AUX (private)         @A2A*/01966000
   3 R794LPIA FIXED(31);            /* Number of blocks paged in        01967000
                                       from AUX (private)         @A2A*/01968000
 /*                                                              @P6D*/ 01969000
 %LR795: IF IFAR795='' %THEN %GOTO LR796;                               01970000
  /*    */                                                              01971000
 DECLARE                                                                01972000
*    /* DATA SECTION FOR SUBTYPE 5                                      01973000
*       ASRM AND ASRMJ DATA SECTION */                                  01974000
*   @SPACE;                                                             01975000
  1 R795ELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(BYTE),                  01976000
*   @SPACE;                                                             01977000
   3 R795ASID FIXED(15) BDY(BYTE),  /* ASID ADDRESS SPACE IDENTIFIER */ 01978000
   3 R795JBN CHAR(8)   BDY(BYTE),   /* NAME OF JOB */                   01979000
   3 R795DMN FIXED(15) BDY(BYTE),   /* DOMAIN NUMBER                    01980000
                                       not applicable in GOAL mode      01981000
                                                                 @C1C*/ 01982000
   3 R795NPG FIXED(15) BDY(BYTE),   /* PERFORMANCE GROUP                01983000
                                       not applicable in GOAL mode      01984000
                                                                 @C1C*/ 01985000
   3 R795PGP FIXED(15) BDY(BYTE),   /* PERFORMANCE GROUP PERIOD         01986000
                                       not applicable in GOAL mode      01987000
                                                                 @C1C*/ 01988000
   3 R795TTOD FIXED(31) BDY(BYTE),  /* REAL TIME INTO TRANSACTION */    01989000
*   @SPACE;                                                             01990000
   3 R795CL CHAR(2),                /* CURRENT LOCATION             */  01991000
*   @SPACE;                                                             01992000
  /*                               CONTENTS  MEANING                */  01993000
  /*                               --------  -------                */  01994000
  /*                                    IN - In storage              */ 01995000
  /*                                    OT - Swapped out and ready   */ 01996000
  /*                                    LO - Logically swapped out   */ 01997000
  /*                                    NS - Non swappable           */ 01998000
  /*                                    WM - Wait queue/MSO          */ 01999000
  /*                                    WL - Wait queue/long wait    */ 02000000
  /*                                    WT - Wait queue/term wait    */ 02001000
  /*                                    WO - Wait queue/others   @I1A*/ 02002000
  /*                                    DL - TSO user delayed by SRM */ 02003000
  /*                                         to meet response time   */ 02004000
  /*                                         objective           @I1A*/ 02005000
  /*                                    PR - Privileged              */ 02006000
  /*                                    >> - Transitioning out       */ 02007000
  /*                                    << - Transitioning in        */ 02008000
*   @SPACE;                                                             02009000
   3 R795TAS FIXED(15) BDY(BYTE),    /* TYPE OF USER              */    02010000
*   @SPACE;                                                             02011000
  /*                               CONTENTS  MEANING                */  02012000
  /*                               --------  -------                */  02013000
  /*                                    0  - BATCH                */    02014000
  /*                                    1  - STARTED TASK         */    02015000
  /*                                    2  - MOUNT TASK           */    02016000
  /*                                    3  - TSO                  */    02017000
  /*                                    4  - ASCH             @A1A*/    02018000
  /*                                    5  - OMVS             @B2A*/    02019000
*   @SPACE;                                                             02020000
   3 R795TROD FIXED(31) BDY(BYTE),      /*TRANSACTION RESIDENT TIME*/   02021000
   3 R795TCNT FIXED(15) BDY(BYTE),   /* TRANSACTION COUNT */            02022000
   3 R795SWC  FIXED(15) BDY(BYTE),   /* TRANSACTION SWAP COUNT */       02023000
   3 R795CPUS FIXED(31) BDY(BYTE),   /* TOTAL PROCESSOR SERVICE FOR     02024000
                                        TRANSACTION (ZERO WHEN ASID     02025000
                                        IS OUT OF STORAGE)  */          02026000
   3 R795MSOS FIXED(31) BDY(BYTE),   /* TOTAL MSO SERVICE FOR           02027000
                                        TRANSACTION (ZERO WHEN ASID     02028000
                                        IS OUT OF STORAGE)  */          02029000
   3 R795IOCS FIXED(31) BDY(BYTE),   /* TOTAL IOC SERVICE FOR           02030000
                                        TRANSACTION (ZERO WHEN ASID     02031000
                                        IS OUT OF STORAGE)  */          02032000
   3 R795WMS  FIXED(31) BDY(BYTE),   /* TOTAL SERVICE FOR               02033000
                                        TRANSACTION (ZERO WHEN ASID     02034000
                                        IS OUT OF STORAGE)  */          02035000
   3 R795TOTL FIXED(31) BDY(BYTE),   /* TOTAL SERVICE FOR SESSION       02036000
                                        (ZERO WHEN ASID                 02037000
                                        IS OUT OF STORAGE)  */          02038000
   3 R795TOT  FIXED(31) BDY(BYTE),   /* TOTAL SERVICE FOR TRANSACTION   02039000
                                        SINCE LAST SWAP - IN  */        02040000
   3 R795SRBS FIXED(31) BDY(BYTE),   /* TOTAL SRB SERVICE FOR           02041000
                                        TRANSACTION (ZERO WHEN ASID     02042000
                                        IS OUT OF STORAGE)  */          02043000
   3 R795FLG BIT(8),                /* Flags                     @W6C*/ 02044000
     4 *      BIT(3),               /* Reserved                  @C1A*/ 02045000
     4 R795GOAL BIT(1),             /* On = system is in GOAL moed      02046000
                                                                 @C1A*/ 02047000
     4 R795SRV  BIT(1),             /* On = this address space is a     02048000
                                       server address space             02049000
                                       Off =  GOAL specified for this   02050000
                                       address space is being honored   02051000
                                       by wlm                    @C1A*/ 02052000
     4 R795QSC  BIT(1),             /* On = address space has been      02053000
                                       quiesced by a RESET command      02054000
                                                                 @C1A*/ 02055000
   3 R795SCL  CHAR(8) BDY(BYTE),    /* Service class name         @C1A*/02056000
   3 R795SCP  FIXED(15) BDY(BYTE),  /* Service class period       @C1A*/02057000
   3 R795WKLD CHAR(8) BDY(BYTE),    /* Workload name              @C1A*/02058000
   3 R795RGRP CHAR(8) BDY(BYTE);    /* Resource group name        @C1A*/02059000
 %LR796: IF IFAR796='' %THEN %GOTO LR797;                               02060000
 DECLARE                                                                02061000
*    /* DATA SECTION FOR SUBTYPE 6                                      02062000
*       ENQUEUE RESERVE DATA SECTION */                                 02063000
*   @SPACE;                                                             02064000
  1 R796ELEM BASED(ADDR(SMF79HDR)+SMF79ASS), /* MAPPING OF ELEMENT*/    02065000
*   @SPACE;                                                             02066000
       3 R796ASID FIXED(15) BDY(BYTE), /* ADDRESS SPACE ID OF THE       02067000
                                      JOB WHICH ISSUED THE RESERVE */   02068000
       3 R796MAJ CHAR(8),          /* MAJOR NAME OF THE RESOURCE     */ 02069000
       3 R796MIN CHAR(44),         /* MINOR NAME OF THE RESOURCE     */ 02070000
       3 R796JBN CHAR(8),          /* NAME OF JOB IN WHICH THE          02071000
                                      RESERVE WAS ISSUED  */            02072000
       3 R796VOLS CHAR(6),         /* VOLUME SERIAL OF THE VOLUME       02073000
                                       AGAINST WHICH THE RESERVE WAS    02074000
                                       ISSUED    */                     02075000
       3 R796UCB CHAR(3) BDY(BYTE), /* THE 3 DIGIT DEV NUMBER           02076000
                                       AGAINST THE RESERVE WAS          02077000
                                       ISSUED, OR "UCB"                 02078000
                                       IF 4 DIGIT DEV NUMBER  @C2C*/    02079000
       3 R796REQ CHAR(2) BDY(BYTE),/* TYPE AND STATUS OF REQUEST FOR    02080000
                                      THE RESOURCE  */                  02081000
       3 R796MINL FIXED(16) BDY(BYTE),/* MINOR NAME LENGTH FOR          02082000
                                      REPORTING */                      02083000
*   @SPACE;                                                             02084000
       3 R796FLG BIT(8),           /* RESERVE FLAG BYTE  */             02085000
*   @SPACE;                                                             02086000
 /*                                   BIT   MEANING WHEN SET      */    02087000
 /*                                   ---   ----------------      */    02088000
         5 R796RESV BIT(1),        /*  0    ON=DEVICE RESERVED BY       02089000
                                               THIS CPU           */    02090000
         5 R796TRUN BIT(1),        /*  1    MINOR NAME TRUNCATED  */    02091000
         5 R796GLBL BIT(1),        /*  2    GLOBAL RESOURCE       */    02092000
         5 R796RESC BIT(1),        /*  3    Reserve request conv.       02093000
                                            to global ENQ     @Q1A*/    02094000
         5 R796RES  BIT(4),        /* 4-7   RESERVED          @Q1C*/    02095000
*   @SPACE;                                                             02096000
       3 R796SID  CHAR(8),         /*  SYSTEM ID OF THE JOB BY WHICH    02097000
                                       THE RESERVE WAS ISSUED @C2C*/    02098000
       3 R796DVN FIXED(16) BDY(BYTE);/*DEV NUMBER (BIN) FROM UCBCHAN    02099000
                                                              @C2A*/    02100000
*   @SPACE;                                                             02101000
 %LR797: IF IFAR797='' %THEN %GOTO LR798;                               02102000
 DECLARE                                                                02103000
*    /* DATA SECTION FOR SUBTYPE 7                                      02104000
*       ENQUEUE REQUESTS DATA SECTION */                                02105000
*   @SPACE;                                                             02106000
  1 R797ELEM BASED(ADDR(SMF79HDR)+SMF79ASS),                            02107000
*   @SPACE;                                                             02108000
       3 R797MAJ CHAR(8),          /* MAJOR NAME OF THE RESOURCE */     02109000
       3 R797MIN CHAR(44),         /* MINOR NAME OF THE RESOURCE */     02110000
       3 R797FLG BIT(8),           /* DATA TYPE FLAGS            @L8A*/ 02111000
*   @SPACE;                                                             02112000
 /*                            BIT          MEANING WHEN SET      */    02113000
 /*                            ---          ----------------      */    02114000
*   @SPACE;                                                             02115000
         5 R797GDET BIT(1), /* ON=DETAIL DATA, OFF=SUMMARY DATA  @L8A*/ 02116000
         5 R797GMAJ BIT(1), /* ON=MAJOR NAME IS SPECIFIED       @L8A*/  02117000
         5 R797GMIN BIT(1), /* ON=MINOR NAME IS SPECIFIED       @L8A*/  02118000
         5 R797TRNC BIT(1), /* ON=MINOR NAME TRUNCATION         @L8A*/  02119000
         5 R797GLBL BIT(1), /* ON=GLOBAL RESOURCE               @LCA*/  02120000
         5 R797ALLS BIT(1), /* ON=RESOURCES IS HELD BY SYS   */         02121000
         5 R797ALLE BIT(1), /* ON=ALL EXL OWNED HELD BY SYS  */         02122000
         5 R797RSV1 BIT(1),        /* RESERVED BITS            @LLA*/   02123000
*   @SPACE;                                                             02124000
       3 R797MINL FIXED(31) BDY(BYTE), /* MINOR NAME LENGHT FOR         02125000
                                          REPORTING */                  02126000
       3 R797OWN FIXED(15) BDY(BYTE),  /* COUNT OF REQUESTS OWNING      02127000
                                          RESOURCE               @L8A*/ 02128000
       3 R797EXCW FIXED(15) BDY(BYTE), /* COUNT OF EXCL REQS WAITING    02129000
                                          FOR RESOURCE  */              02130000
       3 R797SHRW FIXED(15) BDY(BYTE), /* COUNT OF SHR REQS WAITING FOR 02131000
                                          RESOURCE        */            02132000
       3 R797REQ CHAR(2),              /* TYPE AND STATUS OF REQUEST    02133000
                                          FOR A RESOURCE */             02134000
       3 R797JBN CHAR(8),              /* NAME OF JOB WHICH ISSUED      02135000
                                          THE ENQ */                    02136000
       3 R797ASID FIXED(15) BDY(BYTE), /* ADDRESS SPACE ID OF THE JOB   02137000
                                          WHICH ISSUED THE ENQ */       02138000
       3 R797SCOP CHAR(4),             /* SCOPE OF THE RESOURCE  */     02139000
       3 R797RES CHAR(2),              /* RESERVED               @L8A*/ 02140000
       3 R797SID CHAR(8),              /* SYSTEM ID OF JOB THAT         02141000
                                          ISSUED ENQ             @LCA*/ 02142000
       3 * CHAR(3);                    /* RESERVED                   */ 02143000
 %LR798: IF IFAR798='' %THEN %GOTO LR799;           /*       @GM2EPDV*/ 02144000
  /*   */                                                               02145000
 DECLARE                                                                02146000
       /* RELOCATE SECTION FOR SUBTYPE 8 - MONITOR II                   02147000
          TRANSACTION ACTIVITY                @GM2EPDV*/                02148000
*   @SPACE;                                                             02149000
 1 R798ELEM BASED(ADDR(SMF79HDR)+SMF79ASS), /* MAPPING OF ELEMENT*/     02150000
*   @SPACE;                                                             02151000
       3 R798ICSI CHAR(2),         /* ICS MEMBER NAME ID             */ 02152000
       3 R798IPSI CHAR(2),         /* IPS MEMBER NAME ID             */ 02153000
       3 R798PGN FIXED(15) BDY(BYTE), /* PERFORMANCE GROUP              02154000
                                         NUMBER                      */ 02155000
       3 R798PGP FIXED(15) BDY(BYTE), /* PERFORMANCE GROUP              02156000
                                         PERIOD                      */ 02157000
       3 R798SYS CHAR(4),          /* SUBSYSTEM NAME                 */ 02158000
       3 R798TTX FIXED(31) BDY(BYTE),  /* NUMBER OF ENDED               02159000
                                          TRANSACTIONS               */ 02160000
       3 R798TTM FIXED(32) BDY(BYTE),  /* ELAPSED TIME OF ENDED         02161000
                                          TRANSACTIONS FOR PGP, IN      02162000
                                          1024 MICROSECS.               02163000
                                          (UNSIGNED VALUE)   @YA41781*/ 02164000
       3 R798CLS CHAR(10),         /* TRANS. CLASS NAME              */ 02165000
       3 R798USR CHAR(10),         /* USERID                         */ 02166000
       3 R798NAM CHAR(10),         /* TRANS. NAME                    */ 02167000
*   @SPACE;                                                             02168000
       3 R798FL1 BIT(8),           /* DATA TYPE FLAGS                */ 02169000
           5 R798RPT BIT(1),       /* ON=RPT PGN,OFF=CONTROL PGN*/      02170000
           5 R798ACN BIT(1),       /* ON=ACCTINFO OPTION USED    @R0A*/ 02171000
           5 * BIT(6),             /* RESERVED BITS              @R0C*/ 02172000
       3 * CHAR(5),                /*                            @C1C*/ 02173000
       3 R798TET BDY(BYTE),            /* ELAPSED TIME OF ENDED         02174000
                                          TRANSACTIONS FOR PGP, IN      02175000
                                          1024 MICROSECS.               02176000
                                          (UNSIGNED VALUE)       @C1A*/ 02177000
           5 R798TET1 FIXED(32) BDY(BYTE), /* R798TET - word 1   @C1A*/ 02178000
           5 R798TET2 FIXED(32) BDY(BYTE); /* R798TET - word 2   @C1A*/ 02179000
*   @SPACE;                                                             02180000
 %LR799: IF IFAR799='' %THEN %GOTO LR79A;                               02181000
 /* RELOCATE BLOCK FOR SUBTYPE 9                                     */ 02182000
 /* MONITOR 2 DEVICE DATA SECTION                                    */ 02183000
 DCL  1 R799ELEM BASED(ADDR(SMF79HDR)+SMF79ASS),  /* MAPPING OF         02184000
                                     DEVICE DATA SECTION             */ 02185000
        3 R799NUM CHAR(2),        /* DEVICE NUMBER                   */ 02186000
        3 R799LCU CHAR(2),        /* LOGICAL CONTROL UNIT NUMBER     */ 02187000
        3 R799RV0 CHAR(1),        /* RESERVED                        */ 02188000
        3 R799CNF BIT(8),         /* DEVICE FLAGS                    */ 02189000
          5 R799QUL BIT(1),       /* =1 IF IOS Q-LENGTH INVALID      */ 02190000
          5 R799LCD BIT(1),       /* =1 IF NO LCUD INFORMATION       */ 02191000
          5 R799CMB BIT(1),       /* =1 IF CMB DATA INVALID          */ 02192000
          5 R799DTF BIT(1),       /* =1 IF DEVICE CONNECT OR PENDING    02193000
                                     OR DISCONNECT TIME IS INVALID      02194000
                                                             @WA15094*/ 02195000
          5 * BIT(1),             /* RESERVED                        */ 02196000
          5 R799MXB BIT(1),       /* =1 IF BASE EXPOSURE OF A           02197000
                                     MULTIPLE EXPOSURE DEVICE        */ 02198000
          5 R799VAC BIT(1),       /* DATA INVALID, VARIED ON OR OFF,    02199000
                                     OR DYNAMIC RECONFIGURATION      */ 02200000
          5 R799STA BIT(1),       /* =1 FOR ONLINE AT END OF INTERVAL*/ 02201000
        3 R799SER CHAR(6),        /* VOLUME SERIAL NUMBER OF            02202000
                                     MOUNTED VOLUME                  */ 02203000
        3 R799TYP FIXED(32),      /* UNIT TYPE FROM UCBTYP FIELD     */ 02204000
        3 R799NUX FIXED(32),      /* NUMBER OF EXPOSURE (IF MULTIPLE)*/ 02205000
        3 R799SSC FIXED(32),      /* START SUBCHANNEL (SSCH) COUNT   */ 02206000
        3 R799MEC FIXED(32),      /* MEASUREMENT EVENT COUNT (NUMBER    02207000
                                     OF SSCH FOR WHICH CONNECT,         02208000
                                     PENDING, AND ACTIVE TIME WERE      02209000
                                     STORED                          */ 02210000
        3 R799CNN FIXED(32),      /* DEVICE CONNECT TIME             */ 02211000
        3 R799PEN FIXED(32),      /* FUNCTION PENDING TIME           */ 02212000
        3 R799ATV FIXED(32),      /* FUNCTION ACTIV TIME             */ 02213000
        3 R799DIS FIXED(32),      /* DEVICE DISCONNECT TIME          */ 02214000
        3 R799QUE FIXED(32),      /* NUMBER OF REQUESTS QUEUED IN       02215000
                                     IOS FOR THIS DEVICE             */ 02216000
        3 R799UTL FIXED(32),      /* NUMBER OF SAMPLES WHEN THE         02217000
                                     DEVICE WAS RESERVED, BUT AN SSCH   02218000
                                     HAD NOT BEEN ISSUED             */ 02219000
        3 R799RSV FIXED(32),      /* NUMBER OF SAMPLES DURING THE       02220000
                                     INTERVAL THAT INDICATED THAT THE   02221000
                                     DEVICE WAS RESERVED             */ 02222000
        3 R799DSO FIXED(32),      /* reserved - do not use - variable   02223000
                                     is needed for conversion    @U2C*/ 02224000
        3 R799ALC FIXED(32),      /* NUMBER OF SAMPLES DURING THE       02225000
                                     INTERVAL THAT INDICATED THAT THE   02226000
                                     DEVICE WAS ALLOCATED            */ 02227000
        3 R799DVB FIXED(32),      /* device busy delay time             02228000
                                     (3090,9021,9121,9221 support)      02229000
                                                                 @Z1C*/ 02230000
        3 R799CUB FIXED(32),      /* control unit busy delay time       02231000
                                     (3090,9021,9121,9221 support)      02232000
                                                                 @Z1C*/ 02233000
        3 R799ICT FIXED(16),      /* invalid sample count               02234000
                                     (3090,9021,9121,9221 support)      02235000
                                                                 @Z1C*/ 02236000
        3 R799CNX FIXED(8),       /* Device flag extension       @G2A*/ 02237000
          5 R799PAV BIT(1),       /* =1 If base exposure of a           02238000
                                     Parallel Access Volume      @G2A*/ 02239000
          5 R799NXC BIT(1),       /* =1 If number of alias              02240000
                                     exposures changed           @G2A*/ 02241000
          5 R799NTF BIT(1),       /* Timing facility not active  @I2A*/ 02242000
          5 * BIT(5),             /* Reserved                    @I2C*/ 02243000
        3 R799RES FIXED(8),       /* reserved                    @G2C*/ 02244000
        3 R799SGN CHAR(8),        /* Storage Group Name          @U1C*/ 02245000
        3 R799NDA FIXED(32),      /* Total number of allocations in     02246000
                                     effect for the device       @Z1C*/ 02247000
        3 R799DPB FIXED(32),      /* ESCON Director port busy           02248000
                                     delay time                  @Z2C*/ 02249000
        3 * CHAR(4),                /* Reserved              @WA31701*/ 02250000
        3 R799PCT FIXED(32);        /* Number of unsuccessful PAV       02251000
                                       samples               @WA31701*/ 02252000
 %LR79A: IF IFAR79A='' %THEN %GOTO LR79B;                               02253000
   /*  */                                                               02254000
 DECLARE                                                                02255000
      /*  DATA SECTION FOR SUBTYPE A                                    02256000
          MONITOR 2 DISPLAY DOMAIN @LBA */                              02257000
*   @SPACE;                                                             02258000
  1 R79AELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD),                  02259000
*   @SPACE;                                                             02260000
       3 R79ATWSR FIXED(31),       /* TIME WEIGHTED SERVICE RATE @LBA*/ 02261000
       3 *        FIXED(15),       /* Reserved                   @A3C*/ 02262000
       3 R79ARUA FIXED(15),        /* AVERAGE NUMBER OF READY USERS */  02263000
       3 *        FIXED(15),       /* Reserved                   @A3C*/ 02264000
       3 R79ACMPL FIXED(15),       /* CURRENT MPL VALUE */              02265000
       3 R79AOUTU FIXED(15),       /* AVERAGE NUMBER OF USERS SWAPPED   02266000
                                      OUT */                            02267000
       3 R79AINCU FIXED(15),       /* AVERAGE NUMBER OF SWAPPED IN-     02268000
                                      USERS */                          02269000
       3 *        FIXED(15),       /* Reserved                   @A3C*/ 02270000
       3 R79ACIDX FIXED(16),       /* CONTENTION INDEX @ZA69833*/       02271000
       3 R79ANSW FIXED(15),        /* NUMBER OF NON SWAPPABLE USERS */  02272000
       3 R79ADMNO FIXED(8),        /* DOMAIN NUMBER @LBA*/              02273000
       3 R79RESV1 FIXED(8),        /* RESERVED. FORMER R79ADMLO @P3C*/  02274000
       3 R79RESV2 FIXED(8),        /* RESERVED. FORMER R79ADMHI @P3C*/  02275000
       3 *        CHAR(1),         /* Reserved                   @A3C*/ 02276000
       3 R79AIPS CHAR(2),          /* CURRENT IPS @LBA*/                02277000
       3 R79ACPU CHAR(4),          /* CPU SERVICE COEF. @LBA*/          02278000
       3 R79AIOS CHAR(4),          /* I/O SERVICE COEF. @LBA*/          02279000
       3 *       CHAR(4),          /* RESERVED SINCE RMF 4.2.0   @Y2C*/ 02280000
       3 R79ASRB CHAR(4),          /* SRB SERVICE COEF. @LBA*/          02281000
       3 R79ATWET CHAR(4),         /* AVERAGE FIRST PERIOD TSO          02282000
                                      TRANSACTION RESPONSE TIME */      02283000
       3 R79ADMLO FIXED(15),       /* MIN MPL LEVEL @P3C*/              02284000
       3 R79ADMHI FIXED(15),       /* MAX MPL LEVEL @P3A*/              02285000
       3 R79AMSO CHAR(8),          /* MAIN STORAGE SERVICE COEF. @A3C*/ 02286000
       3 R79AIMPL FIXED(15),       /* IN MPL Target              @A3A*/ 02287000
       3 R79AOMPL FIXED(15);       /* OUT MPL Target             @A3A*/ 02288000
 %LR79B: IF IFAR79B='' %THEN %GOTO LR79C;                               02289000
 DECLARE                                                                02290000
    /* CONTROL SECTION FOR SUBTYPE B                                    02291000
       MONITOR 2 PAGE/SWAP DATA  @LBA*/                                 02292000
*   @SPACE;                                                             02293000
  1 R79BCNTL BASED(ADDR(SMF79HDR)+SMF79DCS) BDY(WORD), /* COMMON        02294000
                                      DATA ELEMENT FOR PAGE / SWAP */   02295000
*   @SPACE;                                                             02296000
       3 R79BETYP CHAR(1),         /* SMF79 CHANNEL RECORD TYPE         02297000
                                      P - PAGE, S - SWAP             */ 02298000
       3 * CHAR(3);                /* RESERVED                       */ 02299000
*   @SPACE;                                                             02300000
 DECLARE                                                                02301000
    /* DATA SECTION FOR SUBTYPE B                                       02302000
       MONITOR 2 PAGE/SWAP DATA  @LBA*/                                 02303000
*   @SPACE;                                                             02304000
  1 R79BELEM BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD), /* DATA MAP      02305000
                                      FOR PAGE / SWAP */                02306000
*   @SPACE;                                                             02307000
       3 R79BSALC FIXED(32),       /* SLOTS IN THIS DATA SET @LBA*/     02308000
       3 R79BSAVL FIXED(32),       /* SLOTS AVAILABLE @LBA*/            02309000
       3 R79BSLBD FIXED(32),       /* NUMBER OF BAD SLOTS @LBA*/        02310000
       3 R79BSUSE FIXED(32),       /* ASM IN USE COUNT @LBA*/           02311000
       3 R79BSIOS FIXED(32),       /* I/O REQUESTS @LBA*/               02312000
       3 R79BREQS FIXED(32),       /* PAGES TRANSFERRED @LBA*/          02313000
*   @SPACE;                                                             02314000
       3 R79BFLG  BIT(8),          /* FLAGS @LBA*/                      02315000
         5 R79BSBAD BIT(1),        /* BAD DATA SET INDICATOR @LBA*/     02316000
         5 R79BPLPA BIT(1),        /* PLPA DATA SET @LBA*/              02317000
         5 R79BCOMM BIT(1),        /* COMMON DATA SET @LBA*/            02318000
         5 R79BDPLX BIT(1),        /* DUPLEX DATA SET @LBA*/            02319000
         5 R79BLOCL BIT(1),        /* LOCAL DATA SET @LBA*/             02320000
         5 R79BPAGE BIT(1),        /* PAGE DATA @LBA*/                  02321000
         5 R79BSWAP BIT(1),        /* SWAP DATA @LBA*/                  02322000
         5 R79BVIO  BIT(1),        /* DATASET ACCEPTS VIO PAGES  @LKA*/ 02323000
*   @SPACE;                                                             02324000
       3 R79BDEV  BIT(8),          /* DEVICE TYPE CODE @LBA*/           02325000
       3 R79BDADR CHAR(3),         /* 3 DIGIT DEV NUMBER, OR "UCB",     02326000
                                      IF 4 DIGIT DEV NUMBER      @C1C*/ 02327000
       3 R79BVSER CHAR(6),         /* VOLUME SERIAL @LBA*/              02328000
       3 R79BDSN  CHAR(44),        /* DATA SET NAME @LBA*/              02329000
       3 R79BFL2 BIT(8),           /*                        @ZA57889*/ 02330000
       4 R79BMEXP BIT(1),          /* MULTIPLE EXPOSURE DEVICE          02331000
                                      INDICATOR              @ZA57889*/ 02332000
       4 R79BALCU BIT(1),          /* ALTERNATE CONTROL UNIT DEVICE     02333000
                                      INDICATOR                  @E1A*/ 02334000
       4 R79BDNM BIT(1),           /* INDICATES IF FIELD R79BDEVN       02335000
                                      CONTAINS VALID DEVICE NAME @Y1A*/ 02336000
                                                              /* @Y1D*/ 02337000
       3 R79BDEVN CHAR(8),         /* DEVICE NAME                @Y1A*/ 02338000
       3 R79BCU   CHAR(8),         /* CONTROL UNIT NAME          @C2C*/ 02339000
       3 R79BDVN FIXED(16);        /* DEV NUMBER (BIN) FROM UCBCHAN     02340000
                                                                 @C2A*/ 02341000
*   @SPACE;                                                             02342000
 %LR79C: IF IFAR79C='' %THEN %GOTO LR79D;                               02343000
    @EJECT;                                                             02344000
     /* CHANNEL PATH CONTROL SECTION */                                 02345000
*   @SPACE;                                                             02346000
 DCL 1 R79CCNTL BASED(ADDR(SMF79HDR)+SMF79DCS) BDY(WORD),               02347000
       3 R79CSMP FIXED(31),         /* Number of samples weighted by    02348000
                                       SRM                       @BAC*/ 02349000
       3 R79CFLAG CHAR(4),          /* Flags                     @BAA*/ 02350000
         5 R79CFLG1 BIT(8),         /* Flags 1                   @BAA*/ 02351000
           7 R79CCPMF BIT(1),       /* CPMF available            @BAA*/ 02352000
           7 R79CCFGC BIT(1),       /* Configuration change      @E1A*/ 02353000
           7 R79CCMH BIT(1),        /* DCM supported by hardware @I3A*/ 02354000
           7 R79CCMD BIT(1),        /* Configuration contains DCM       02355000
                                       managed channels          @I3A*/ 02356000
           7 R79CRNA BIT(1),        /* RMF address space not active     02357000
                                                                 @I3A*/ 02358000
           7 * BIT(3),              /* Reserved                  @I3C*/ 02359000
         5 R79CCMI  FIXED(8),       /* CPMF mode info                   02360000
                                       0 - CPMF not active              02361000
                                       1 - Compatibility mode           02362000
                                       2 - Extended mode         @H1A*/ 02363000
         5 *         CHAR(2),       /* Reserved for future use   @H1C*/ 02364000
       3 R79CCFRC FIXED(32),        /* CPMF restart count        @BAA*/ 02365000
       3 R79CCFSC FIXED(32);        /* CPMF sample count         @BAA*/ 02366000
    @SPACE;                                                             02367000
    /* RELOCATE BLOCK FOR SUBTYPE C - MONITOR II                        02368000
       CHANNEL PATH DATA SECTION */                                     02369000
*   @SPACE;                                                             02370000
 DCL 1 R79CCHNL BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD),               02371000
       3 R79CCPID   CHAR(1),       /* CHANNEL PATH IDENTIFICATIONS.     02372000
                                      THE RANGE OF VALUES IS            02373000
                                      X'00' TO X'FF'                 */ 02374000
       3 R79CFG2    FIXED(8),      /* CHANNEL FLAGS                  */ 02375000
         5 R79CRV1  BIT(2),        /* RESERVED                       */ 02376000
         5 R79CBL   BIT(1),        /* BLOCK MULTIPLEXOR              */ 02377000
         5 R79CBY   BIT(1),        /* BYTE MULTIPLEXOR               */ 02378000
         5 R79CCVC  BIT(1),        /* ES Conversion Channel      @Z1A*/ 02379000
         5 R79CCNC  BIT(1),        /* ES Connection Channel      @Z2A*/ 02380000
         5 R79CDOC  BIT(1),        /* ESCON Director on Channel  @Z2A*/ 02381000
         5 R79CCC   BIT(1),        /* Channel to Channel     @YA67090*/ 02382000
       3 R79CFG3    FIXED(8),       /* Channel flags continued   @BAA*/ 02383000
         5 R79CSHR  BIT(1),         /* Channel path is shared between   02384000
                                       logical partitions        @BAA*/ 02385000
         5 R79CNVL  BIT(1),         /* CPMF indication, this entry      02386000
                                       is invalid                @BAA*/ 02387000
         5 *        BIT(1),         /* Res. for future use   @YA67090*/ 02388000
         5 R79CFXT  BIT(1),         /* Channel converter 3090    @C3A*/ 02389000
         5 R79CCPM  BIT(1),         /* Channel path is DCM managed      02390000
                                                                 @I3A*/ 02391000
         5 *        BIT(3),         /* Res. for future use       @I3C*/ 02392000
       3 R79CCPD  FIXED(8),         /* Channel path description.        02393000
                                       For an explanation, you          02394000
                                       can issue the command            02395000
                                       D M=CHP.                  @G1C*/ 02396000
                                    /*                          9@G1D*/ 02397000
                                                                        02398000
       3 R79CBSY    FIXED(32),      /* Number of samples the channel    02399000
                                       path was busy, weighted by       02400000
                                       SRM.                      @BAC*/ 02401000
       3 R79CPBY    FIXED(32),      /* Partitions channel-path-busy     02402000
                                       time in units of 128             02403000
                                       micro seconds             @BAA*/ 02404000
       3 R79CCPTX   FIXED(32),      /* Extended last time stamp         02405000
                                                             @WA39393*/ 02406000
         5 *        BIT(8),         /* Overflow area         @WA39393*/ 02407000
         5 R79CCPTS FIXED(24),      /* Last CPMB entry time stamp       02408000
                                       in units of 128 microseconds     02409000
                                       (be aware that this time value   02410000
                                       wraps about every 35.79 minutes) 02411000
                                                             @WA39393*/ 02412000
       3 R79CACR    CHAR(5),        /* Channel Path acronym      @G1A*/ 02413000
       3 R79CCMG    FIXED(8),       /* CPMF Channel Measurement         02414000
                                       Group                     @H1A*/ 02415000
       3 R79CFG4    BIT(8),         /* Channel Path Flags        @H1C*/ 02416000
         5 R79CMBV  BIT(1),         /* CPMF Maximum Bus cyles           02417000
                                       Valid                     @H1C*/ 02418000
         5 R79CMCV  BIT(1),         /* CPMF Maximum Channel work        02419000
                                       units Valid               @H1C*/ 02420000
         5 R79CMWV  BIT(1),         /* CPMF Maximum Write data          02421000
                                       units Valid               @H1C*/ 02422000
         5 R79CMRV  BIT(1),         /* CPMF Maximum Read data           02423000
                                       units Valid               @H1C*/ 02424000
         5 R79CUSV  BIT(1),         /* CPMF data Unit Size Valid @H1C*/ 02425000
         5 *        BIT(3),         /* Reserved for future use   @H1C*/ 02426000
       3 R79CCPP FIXED(8),          /* Channel path parameter    @I3C*/ 02427000
       3 R79CCCM    CHAR(48);       /* CPMF Channnel Measurements       02428000
                                       extended Mode             @H1A*/ 02429000
*   @SPACE;                                                             02430000
    DECLARE                                                             02431000
     1 R79CCM1  CHAR(48) BDY(WORD) BASED(ADDR(R79CCCM)), /*             02432000
                                       Channel data                     02433000
                                       Measurement group 1       @H1A*/ 02434000
       3 R79CTUT    FIXED(32),      /* CPMF Total channel path          02435000
                                       busy Time in units of            02436000
                                       128 microseconds          @H1A*/ 02437000
       3 R79CPUT    FIXED(32),      /* CPMF LPAR channel path           02438000
                                       busy Time in units of            02439000
                                       128 microseconds          @H1A*/ 02440000
       3 *          CHAR(40);       /* Reserved                  @H1A*/ 02441000
*   @SPACE;                                                             02442000
    DECLARE                                                             02443000
     1 R79CCM2  CHAR(48) BDY(WORD) BASED(ADDR(R79CCCM)), /*             02444000
                                       Channel                          02445000
                                       Measurement group 2       @H1A*/ 02446000
       3 R79CCCC,                   /* CPMF Channel Characteristics     02447000
                                       data                      @H1A*/ 02448000
         5 R79CMBC  FIXED(32),      /* CPMF Maximum Bus Cycles          02449000
                                       per second                @H1A*/ 02450000
         5 R79CMCU  FIXED(32),      /* CPMF Maximum Channel work        02451000
                                       Units per second          @H1A*/ 02452000
         5 R79CMWU  FIXED(32),      /* CPMF Maximum Write data          02453000
                                       Units per second          @H1A*/ 02454000
         5 R79CMRU  FIXED(32),      /* CPMF Maximum Read data           02455000
                                       Units per second          @H1A*/ 02456000
         5 R79CUS   FIXED(32),      /* CPMF data Unit Size in           02457000
                                       bytes                     @H1A*/ 02458000
       3 R79CCCD,                   /* CPMF Channel measurement         02459000
                                       group 2 Data              @H1A*/ 02460000
         5 R79CTBC    FIXED(32),    /* CPMF Total Bus Cycles            02461000
                                       Count                     @H1A*/ 02462000
         5 R79CTUC    FIXED(32),    /* CPMF Total channel work          02463000
                                       Unit Count                @H1A*/ 02464000
         5 R79CPUC    FIXED(32),    /* CPMF LPAR channel work           02465000
                                       Unit Count                @H1A*/ 02466000
         5 R79CTWU    FIXED(32),    /* CPMF Total Write data            02467000
                                       Units                     @H1A*/ 02468000
         5 R79CPWU    FIXED(32),    /* CPMF LPAR Write data             02469000
                                       Units                     @H1A*/ 02470000
         5 R79CTRU    FIXED(32),    /* CPMF Total Read data             02471000
                                       Units                     @H1A*/ 02472000
         5 R79CPRU    FIXED(32);    /* CPMF LPAR Read data Units @H1A*/ 02473000
*   @SPACE;                                                             02474000
    DECLARE                                                             02475000
*   @SPACE;                                                             02476000
      R79C_FIX_LEN FIXED(31) CONSTANT(                                  02477000
        LENGTH(SMF79HDR) + LENGTH(SMF79PRO) + LENGTH(R79CHL) +          02478000
        LENGTH(R79CCNTL)),          /*                           @E1A*/ 02479000
      R79C_VAR_LEN FIXED(31) CONSTANT(                                  02480000
        LENGTH(R79CCHNL)),          /*                           @E1A*/ 02481000
      R79C_ACR_LEN FIXED(31) CONSTANT(OFFSET(R79CACR)); /*              02482000
                                       OFFSET of R79CACR         @G1A*/ 02483000
*   @SPACE;                                                             02484000
 %LR79D: IF IFAR79D='' %THEN %GOTO LR79E;                               02485000
    /* RELOCATE BLOCK FOR SUBTYPE D - MONITOR 2 IOQ DATA */             02486000
*   @SPACE;                                                             02487000
    /* I/O QUEUING CONFIGURATION CONTROL SECTION */                     02488000
*   @SPACE;                                                             02489000
    DECLARE                                                             02490000
*     @SPACE;                                                           02491000
      1 R79DCS                      /* CONFIGURATION CONTROL SECTION */ 02492000
          BASED(ADDR(SMF79HDR)+SMF79DCS) BDY(WORD),                     02493000
        3 R79DID1 CHAR(2),          /* LOGICAL CONTROL UNIT             02494000
                                       IDENTIFIER                @P4C*/ 02495000
                                                               /*@P4D*/ 02496000
        3 R79DNTR FIXED(15),        /* NUMBER OF DESCRIPTOR TRIPLETS */ 02497000
        3 R79DCPDS FIXED(31),       /* OFFSET TO CONFIGURATION DATA     02498000
                                       SECTION                       */ 02499000
        3 R79DCPDL FIXED(15),       /* LENGTH OF CONFIGURATION DATA     02500000
                                       SECTION                       */ 02501000
        3 R79DCPDN FIXED(15);       /* NUMBER OF CONFIGURATION DATA     02502000
                                       SECTIONS                      */ 02503000
*   @SPACE;                                                             02504000
    /* CONFIGURATION DATA SECTION */                                    02505000
*   @SPACE;                                                             02506000
    DECLARE                                                             02507000
*     @SPACE;                                                           02508000
      1 R79DCPD                     /* CONFIGURATION DATA SECTION    */ 02509000
          BASED(ADDR(R79DCS)+R79DCPDS) BDY(WORD),                       02510000
        3 R79DCPID CHAR(1),         /* CHANNEL PATH IDENTIFIER       */ 02511000
        3 R79DCPST BIT(8),          /* CHANNEL PATH STATUS           */ 02512000
          5 R79DCPI BIT(1),         /* =1 IF CHANNEL PATH INSTALLED  */ 02513000
          5 R79DCPO BIT(1),         /* =1 IF CHANNEL PATH ONLINE     */ 02514000
          5 R79DCPV BIT(1),         /* =1 IF CHANNEL PATH VARIED     */ 02515000
          5 R79DVPOF BIT(1),        /* =1 IF PATH OFFLINE TO ALL        02516000
                                          DEVICES TO THE LCU     @P4A*/ 02517000
          5 R79DVP  BIT(1),         /* =1 PATH CONNECTIVITY TO DEVICES  02518000
                                          OF THE LCU HAS MANIPULATED    02519000
                                          VIA VARY PATH          @P4A*/ 02520000
          5 * BIT(3),               /* RESERVED                  @P4C*/ 02521000
        3 R79DCUN FIXED(15),        /* NUMBER OF CONTROL UNITS          02522000
                                       ATTACHED                      */ 02523000
        3 R79DCU CHAR(8),           /* CONTROL UNITS ATTACHED TO        02524000
                                       THIS CHANNEL PATH             */ 02525000
          5 R79DCU1 CHAR(2),        /* 1ST CONTROL UNIT IDENTIFIER   */ 02526000
          5 R79DCU2 CHAR(2),        /* 2ND CONTROL UNIT IDENTIFIER   */ 02527000
          5 R79DCU3 CHAR(2),        /* 3RD CONTROL UNIT IDENTIFIER   */ 02528000
          5 R79DCU4 CHAR(2);        /* 4TH CONTROL UNIT IDENTIFIER   */ 02529000
*   @SPACE;                                                             02530000
    /* I/O QUEUING DATA SECTION */                                      02531000
*   @SPACE;                                                             02532000
    DECLARE                                                             02533000
*   @SPACE;                                                             02534000
      1 R79DDS                      /* I/O QUEUING DATA SECTION      */ 02535000
          BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD),                     02536000
        3 * CHAR(1),                /* RESERVED                         02537000
                                                                 @P4C*/ 02538000
        3 R79DDST BIT(8),           /* DATA STATUS                   */ 02539000
          5 R79DCPS BIT(1),         /* =1 IF NO STCPS DATA AVAILABLE */ 02540000
          5 * BIT(1),               /* Reserved                  @O1C*/ 02541000
          5 R79DNHMA BIT(1),        /* =1 If no hardware measurements   02542000
                                       available                 @O1A*/ 02543000
          5 * BIT(5),               /* RESERVED                  @O1C*/ 02544000
        3 R79DICT FIXED(16),        /* COUNT OF SUCCESSIVE UNSUCCESSFUL 02545000
                                       SAMPLES, IF THIS COUNT DIFFERS   02546000
                                       FROM ZERO, THE FOLLOWING FIELDS, 02547000
                                       BESIDES R79DABY, ARE NOT         02548000
                                       SET UP                        */ 02549000
        3 R79DABY FIXED(32),        /* NUMBER OF SAMPLES WHEN ALL       02550000
                                       CHANNEL PATHS IN THE LCU         02551000
                                       WERE BUSY, VALID ONLY IF         02552000
                                       STCPS DATA AVAILABLE          */ 02553000
        3 R79DTIS FIXED(32),        /* TOTAL NUMBER OF INITIAL          02554000
                                       SELECTION ATTEMPTS            */ 02555000
        3 R79DSIS FIXED(32),        /* TOTAL NUMBER OF SUCCESSFUL       02556000
                                       SELECTION ATTEMPTS            */ 02557000
        3 R79DCUB FIXED(32),        /* TOTAL NUMBER OF UNSUCCESSFUL     02558000
                                       SELECTION ATTEMPTS DUE TO        02559000
                                       CONTROL UNIT BUSY             */ 02560000
        3 R79DDVB FIXED(32),        /* TOTAL NUMBER OF UNSUCCESSFUL     02561000
                                       SELECTION ATTEMPTS DUE TO        02562000
                                       DEVICE BUSY                   */ 02563000
        3 R79DQUE FIXED(32),        /* TOTAL NUMBER OF REQUESTS QUEUED  02564000
                                       FOR THE LCUG (ACCUMULATED AT     02565000
                                       INITIAL SELECTION TIME),         02566000
                                       THIS FIELD IS NOT SET UP FOR     02567000
                                       I/O MEASUREMENT LEVEL X'02'      02568000
                                       LEAR PROCESSORS           @P4C*/ 02569000
        3 R79DID2 CHAR(2),          /* LOGICAL CONTROL UNIT             02570000
                                       IDENTIFIER                @P4A*/ 02571000
        3 * CHAR(2);                /* FOR ALIGNMENT ONLY        @P4A*/ 02572000
*   @SPACE;                                                             02573000
                                                               /*@P4D*/ 02574000
                                                               /*@P4D*/ 02575000
                                                               /*@P4D*/ 02576000
                                                               /*@P4D*/ 02577000
                                                               /*@P4D*/ 02578000
                                                               /*@P4D*/ 02579000
 %LR79E: IF IFAR79E='' %THEN %GOTO LR79F;                               02580000
*   @SPACE;                                                             02581000
    DECLARE                                                             02582000
*     @SPACE;                                                           02583000
    /* FIXED BLOCK FOR SUBTYPE E - MONITOR 2 IOQ DATA            @P4A*/ 02584000
    /*                                3090,9021,9121,9221 proc.  @Z1C*/ 02585000
      1 R79EGD                      /* GLBL. I/O QUEUING SECTION @P4A*/ 02586000
          BASED(ADDR(SMF79HDR)+SMF79QSS) BDY(WORD),                     02587000
        3 R79EGFLG BIT(8),          /* GLOBAL IOQ STATUS         @P4A*/ 02588000
          5 R79EGCMF BIT(1),        /* =1 DATA IS INVALID DUE TO        02589000
                                          FAILURE OF THE CHANNEL        02590000
                                          MESUREMENT FACILITY    @P4A*/ 02591000
          5 R79EGDIF BIT(1),        /* =1 DIAGNOSE INTERFACE FAILURE    02592000
                                                                 @P4A*/ 02593000
          5 R79EGDIR BIT(1),        /* =1 ESCON Director in             02594000
                                       configuration             @Z1A*/ 02595000
          5 R79EGSSQ BIT(1),        /* =1 CHSC store secondary queue    02596000
                                       data not supported        @E1A*/ 02597000
          5 R79EGCMH BIT(1),        /* =1 DCM is supported by hardware  02598000
                                                                 @I3A*/ 02599000
          5 R79EGCMD BIT(1),        /* =1 Configuration contains DCM    02600000
                                       managed channels          @I3A*/ 02601000
          5 * BIT(2),               /* Reserved                  @I3C*/ 02602000
        3 * CHAR(3),                /* FOR ALIGNMENT ONLY        @P4A*/ 02603000
        3 R79EGSAM  FIXED(31);      /* CPMT SAMPLE COUNT         @P4A*/ 02604000
*   @SPACE;                                                             02605000
    /* RELOCATE BLOCKS FOR SUBTYPE E - MONITOR 2 IOQ DATA        @P4A*/ 02606000
    /*                                3090,9021,9121,9221 proc.  @Z1C*/ 02607000
*   @SPACE;                                                             02608000
    /* I/O QUEUING CONFIGURATION CONTROL SECTION @P4A*/                 02609000
*   @SPACE;                                                             02610000
    DECLARE                                                             02611000
*     @SPACE;                                                           02612000
      1 R79ECS                      /* CONFIGURATION CONTROL SECTION    02613000
                                                                 @P4A*/ 02614000
          BASED(ADDR(SMF79HDR)+SMF79DCS) BDY(WORD),                     02615000
        3 R79EID1 CHAR(2),          /* LOGICAL CONTROL UNIT             02616000
                                       IDENTIFIER                @P4A*/ 02617000
        3 R79ENTR FIXED(15),        /* NUMBER OF DESCRIPTOR TRIPLETS    02618000
                                                                 @P4A*/ 02619000
        3 R79ECPDS FIXED(31),       /* OFFSET TO CONFIGURATION DATA     02620000
                                       SECTION                   @P4A*/ 02621000
        3 R79ECPDL FIXED(15),       /* LENGTH OF CONFIGURATION DATA     02622000
                                       SECTION                   @P4A*/ 02623000
        3 R79ECPDN FIXED(15);       /* NUMBER OF CONFIGURATION DATA     02624000
                                       SECTIONS                  @P4A*/ 02625000
*   @SPACE;                                                             02626000
    /* CONFIGURATION DATA SECTION @P4A*/                                02627000
*   @SPACE;                                                             02628000
    DECLARE                                                             02629000
*     @SPACE;                                                           02630000
      1 R79ECPD                     /* CONFIGURATION DATA SECT.  @P4A*/ 02631000
          BASED(ADDR(R79ECS)+R79ECPDS) BDY(WORD),                       02632000
       2 R79ECPSD,                  /* CHANNEL PATH CONFIGURATION       02633000
                                       STATIC DATA               @P4A*/ 02634000
        3 R79ECPID CHAR(1),         /* CHANNEL PATH IDENTIFIER   @P4A*/ 02635000
        3 R79ECPST BIT(8),          /* CHANNEL PATH STATUS       @P4A*/ 02636000
          5 R79ECPI BIT(1),         /* =1 IF CHANNEL PATH INST.  @P4A*/ 02637000
          5 R79ECPO BIT(1),         /* =1 IF CHANNEL PATH ONLINE @P4A*/ 02638000
          5 R79ECPV BIT(1),         /* =1 IF CHANNEL PATH VARIED @P4A*/ 02639000
          5 R79EVPOF BIT(1),        /* =1 IF PATH OFFLINE TO ALL        02640000
                                          DEVICES TO THE LCU     @P4A*/ 02641000
          5 R79EVP  BIT(1),         /* =1 IF PATH CONNECTIVITY TO       02642000
                                          DEVICES OF THE LCU HAS        02643000
                                          MANIPULATED VIA VARY PATH     02644000
                                                                 @P4A*/ 02645000
          5 * BIT(1),               /* Reserved                  @I3A*/ 02646000
          5 R79ECPM  BIT(1),        /* =1 Channel path is DCM managed   02647000
                                                                 @I3A*/ 02648000
          5 R79ECPMR BIT(1),        /* =1 CHPID manipulated, requiring  02649000
                                       data reset                @I3A*/ 02650000
        3 R79ECUN FIXED(15),        /* NUMBER OF CONTROL UNITS          02651000
                                       ATTACHED                  @P4A*/ 02652000
        3 R79ECU CHAR(8),           /* CONTROL UNITS ATTACHED TO        02653000
                                       THIS CHANNEL PATH         @P4A*/ 02654000
          5 R79ECU1 CHAR(2),        /* 1ST CONTROL UNIT ID.      @P4A*/ 02655000
          5 R79ECU2 CHAR(2),        /* 2ND CONTROL UNIT ID.      @P4A*/ 02656000
          5 R79ECU3 CHAR(2),        /* 3RD CONTROL UNIT ID.      @P4A*/ 02657000
          5 R79ECU4 CHAR(2),        /* 4TH CONTROL UNIT ID.      @P4A*/ 02658000
       2 R79ECPCM,                  /* CHANNEL PATH CONFIGURATION       02659000
                                       MEASUREMENT DATA          @P4A*/ 02660000
        3 R79ECUB FIXED(31),        /* COUNT OF CU BUSY          @P4A*/ 02661000
        3 R79EPT  FIXED(31),        /* COUNT OF OPERATION ACCEPTED      02662000
                                       ON THIS CHANNEL PATH      @P4A*/ 02663000
        3 R79EPB  FIXED(31),        /* BUSY COUNT FOR                   02664000
                                       THIS CHANNEL PATH         @Z1C*/ 02665000
        3 R79EDPBC FIXED(31),       /* Number of initial selection      02666000
                                       attempts that were unsuccessful  02667000
                                       because ESCON Director port      02668000
                                       busy                      @Z2C*/ 02669000
        3 *       FIXED(31);        /* Reserved                  @Z1A*/ 02670000
*   @SPACE;                                                             02671000
    /* I/O QUEUING DATA SECTION */                                      02672000
*   @SPACE;                                                             02673000
    DECLARE                                                             02674000
*   @SPACE;                                                             02675000
      1 R79EDS                      /* I/O QUEUING DATA SECTION  @P4A*/ 02676000
          BASED(ADDR(SMF79HDR)+SMF79ASS) BDY(WORD),                     02677000
        3 R79EID2 CHAR(2),          /* LOGICAL CONTROL UNIT             02678000
                                       IDENTIFIER                @P4A*/ 02679000
        3 R79EDST BIT(8),           /* DATA STATUS               @P4A*/ 02680000
          5 * BIT(1),               /* RESERVED                  @P4A*/ 02681000
          5 R79ENHMA BIT(1),        /* =1 IF NO HARDWARE MEASUREMENTS   02682000
                                       AVAILABLE                 @P4A*/ 02683000
          5 * BIT(2),               /* Reserved                  @I3A*/ 02684000
          5 R79ELDCM BIT(1),        /* =1 LCU contains DCM managed      02685000
                                       channels                  @I3A*/ 02686000
          5 * BIT(3),               /* Reserved                  @I3C*/ 02687000
        3 * CHAR(1),                /* FOR ALIGNMENT ONLY        @P4A*/ 02688000
        3 R79EQSM FIXED(31),        /* ACCUMULATION OF CU-HDR Q LENGTH  02689000
                                                                 @P4A*/ 02690000
        3 R79EQCT FIXED(31),        /* Count of entries placed on       02691000
                                       the CU-HDR queue          @I3C*/ 02692000
        3 R79EMCMN FIXED(16),       /* Minimum number of DCM managed    02693000
                                       channels used             @I3A*/ 02694000
        3 R79EMCMX FIXED(16),       /* Maximum number of DCM managed    02695000
                                       channels used             @I3A*/ 02696000
        3 R79EMCDF FIXED(16),       /* Defined number of DCM managed    02697000
                                       channels                  @I3A*/ 02698000
        3 * FIXED(16),              /* Reserved                  @I3A*/ 02699000
        3 R79EDCMA,                 /* DCM managed channel accumulated  02700000
                                       measurements              @I3A*/ 02701000
          5 R79EPTM FIXED(32),      /* Accumulated path taken count     02702000
                                       for DCM managed channels  @I3A*/ 02703000
          5 R79EDPBM FIXED(32),     /* Accumulated director port busy   02704000
                                       count for DCM managed channels   02705000
                                                                 @I3A*/ 02706000
          5 R79ECUBM FIXED(32);     /* Accumulated control unit busy    02707000
                                       count for DCM managed channels   02708000
                                                                 @I3A*/ 02709000
                                                                        02710000
*   @SPACE;                                                             02711000
    DECLARE                                                             02712000
*   @SPACE;                                                             02713000
      R79E_FIX_LEN FIXED(31) CONSTANT(                                  02714000
        LENGTH(SMF79HDR) + LENGTH(SMF79PRO) + LENGTH(R79CHL) +          02715000
        LENGTH(R79EGD)),            /*                           @E1A*/ 02716000
      R79E_VAR_LEN FIXED(31) CONSTANT(                                  02717000
        LENGTH(R79ECS) + (8*LENGTH(R79ECPD)) +                          02718000
        LENGTH(R79EDS));            /*                           @E1A*/ 02719000
 %LR79F: IF IFAR79F='' %THEN %GOTO LR79END;                 /*   @F1A*/ 02720000
*/********************************************************************/ 02721000
*/*                                                              @F1A*/ 02722000
*/* SMF Type 79 Subtype 15 Data Section Mapping R79FIRLM         @F1A*/ 02723000
*/*                                                              @F1A*/ 02724000
*/********************************************************************/ 02725000
*   @SPACE;                                                 /*   @F1A*/ 02726000
    Declare                                                             02727000
      1 R79FIRLM Based(Addr(SMF79HDR)+SMF79FPO) BDY(BYTE),  /*   @F1A*/ 02728000
        3 R79FISTN Char(16),        /* IRLM Lock Structure Name  @F1A*/ 02729000
        3 R79FDLKC Fixed(32)                                            02730000
                   Boundary(BYTE),  /* Dead Lock Cycle Number    @F1A*/ 02731000
        3 R79FETYP Char(1),         /* 'B'=Blocker / 'W'=Waiter  @F1A*/ 02732000
        3 *        Char(3),         /* Reserved                  @F1A*/ 02733000
        3 R79FWAIT,                 /* Start of variable section:       02734000
                                       Waiter data               @F1A*/ 02735000
          5 R79FBLKR,               /* Blocker data              @F1A*/ 02736000
            7 R79FIMSI Char(8),     /* IMS Subsystem ID          @F1A*/ 02737000
            7 R79FPSTN Char(2),     /* PST Number                @F1A*/ 02738000
            7 R79FPSBN Char(8),     /* PSB Name                  @F1A*/ 02739000
            7 R79FRGTY Char(1),     /* Region Type               @F1A*/ 02740000
            7 R79FRCVT Char(16),    /* Recovery Token            @F1A*/ 02741000
            7 R79FCTID Char(8),     /* CICS Task ID (If CICS)    @F1A*/ 02742000
            7 R79FLHTI Char(8),     /* Scheduled elapsed time    @F1A*/ 02743000
            7 R79FLHCN Char(4),     /* Max Lock Held-PSTLKHLD    @F1A*/ 02744000
            7 R79FLKNA Char(16),    /* Lock Name                 @F1A*/ 02745000
            7 R79FTRNM Char(8),     /* Trans name / Job name @WA27252*/ 02746000
          5 R79FRSNA Char(8);       /* Resource (DB/Area) Name   @F1A*/ 02747000
*   @SPACE;                                                 /*   @F1A*/ 02748000
    Declare                                                             02749000
      R79FIRLL Fixed(31) Constant(Length(R79FIRLM));        /*   @F1A*/ 02750000
*   @SPACE;                                                 /*   @F1A*/ 02751000
    Declare                                                             02752000
      R79FRBAT Char(1) Constant('80'X),  /* Region type = BATCH  @F1A*/ 02753000
      R79FRBMP Char(1) Constant('40'X),  /* Region type = BMP    @F1A*/ 02754000
      R79FRIFP Char(1) Constant('20'X),  /* Region type = IFP    @F1A*/ 02755000
      R79FRCIC Char(1) Constant('10'X),  /* Region type = CICS   @F1A*/ 02756000
      R79FRMPP Char(1) Constant('08'X),  /* Region type = MPP    @F1A*/ 02757000
      R79FRDBC Char(1) Constant('04'X);  /* Region type = DBCTL  @F1A*/ 02758000
 %LR79END: ;                                                /*   @F1C*/ 02759000
