*%ERBSTGST:                         /* GLOBAL SUPERVISOR TABLE       */ 00001000
*  MACRO                                                                00002000
*        KEYS(                                                          00003000
*              ATTRIBUT             /* ATTRIBUTES OF THE STRUCTURE      00004000
*                                      PRODUCED BY THIS MACRO. (THE     00005000
*                                      BOUNDARY ATTRIBUTE IS APPENDED   00006000
*                                      TO IT.)                       */ 00007000
*            );                                                         00008000
* /* BILINGUAL (MAPPING) MACRO                                          00009000
         MACRO                                                          00010000
&STGSLBL ERBSTGST                                                       00011000
*                                                                       00012000
**/  BLOCKANSWER SKIP COLUMN(2);                                        00013000
*'/* START OF SPECIFICATIONS ****************************************/' 00014000
*'/*01* PROPRIETARY STATEMENT=                                      */' 00015000
*    ENDANSWER;                                                         00016000
*/*                                                                     00017000
        ERBCOPY1 ,                                                      00018000
**/  BLOCKANSWER SKIP COLUMN(2);                                        00019000
*'      ?ERBCOPY1;                                                    ' 00020000
*'/*                                                                */' 00021000
*'/*01* DESCRIPTIVE_NAME:  RMF Global Supervisor table              */' 00022000
*'/*02*  ACRONYM:  STGST                                            */' 00023000
*'/*                                                                */' 00024000
*'/*01* MACRO-NAME:  ERBSTGST                                       */' 00025000
*'/*                                                                */' 00026000
*'/*01* DSECT NAME:  "STGST", if used from PL/X.                    */' 00027000
*'/*                 Contents of name field, if used from           */' 00028000
*'/*                 ASSEMBLER.                                     */' 00029000
*'/*                                                                */' 00030000
*'/*01* COMPONENT:  Resource Measurement Facility (27404)           */' 00031000
*'/*                                                                */' 00032000
*'/*01* EYE-CATCHER:  STGS                                          */' 00033000
*'/*02*  OFFSET:  0                                                 */' 00034000
*'/*02*  LENGTH:  4                                                 */' 00035000
*'/*                                                                */' 00036000
*'/*01* STORAGE ATTRIBUTES:                                         */' 00037000
*'/*02*  SUBPOOL:  245 (ESQA)                                       */' 00038000
*'/*02*  KEY:      0                                                */' 00039000
*'/*02*  RESIDENCY:  ANY (above 16 MB boundary)                     */' 00040000
*'/*02*  MAIN STORAGE:  fixed                                       */' 00041000
*'/*02*  AUXILIARY STORAGE: N/A                                     */' 00042000
*'/*02*  VIRTUAL STORAGE:  N/A                                      */' 00043000
*'/*                                                                */' 00044000
*'/*01* SIZE: see Assembler listing                             @D1C*/' 00045000
*'/*                                                                */' 00046000
*'/*01* CREATED BY:                                                 */' 00047000
*'/*     ERBMFMFC                                                   */' 00048000
*'/*                                                                */' 00049000
*'/*01* POINTED TO BY:                                              */' 00050000
*'/*     CVTMFCTL field of data area CVT                            */' 00051000
*'/*                                                                */' 00052000
*'/*01* SERIALIZATION:                                              */' 00053000
*'/*     Not provided                                               */' 00054000
*'/*                                                                */' 00055000
*'/*01* FUNCTION:                                                   */' 00056000
*'/*02*  Mapping macro for the STGST. It contains RMF data          */' 00057000
*'/*     which must be fixed or be accessible from any address      */' 00058000
*'/*     space.                                                     */' 00059000
*'/*                                                                */' 00060000
*'/*01* METHOD OF ACCESS:                                           */' 00061000
*'/*02*  ASM:                                                       */' 00062000
*'/*      label ERBSTGST                                            */' 00063000
*'/*        where the optional label provides a DSECT by the same   */' 00064000
*'/*        name.                                                   */' 00065000
*'/*                                                                */' 00066000
*'/*02*  PL/X:                                                      */' 00067000
*'/*      .question mark.ERBSTGST ATTRIBUT(attributes)              */' 00068000
*'/*        where attributes are any acceptable PL/X attributes     */' 00069000
*'/*        for structure declarations.                             */' 00070000
*'/*                                                                */' 00071000
*'/*01* MODULE-TYPE: Bilingual mapping macro                        */' 00072000
*'/*                                                                */' 00073000
*'/*01* STATUS: HRM7703 - OS/390 2.10.0                         @I1C*/' 00074000
*'/*                                                                */' 00075000
*'/*01* DELETED BY: N/A                                             */' 00076000
*'/*                                                                */' 00077000
*'/*01* FREQUENCY: 1                                                */' 00078000
*'/*                                                                */' 00079000
*'/*01* DEPENDENCIES: None                                          */' 00080000
*'/*                                                                */' 00081000
*'/*01* DISTRIBUTION LIBRARY: ARMFMAC1                          @B3C*/' 00082000
*'/*                                                                */' 00083000
*'/*01* CHANGE ACTIVITY:                                            */' 00084000
*'/*                                                                */' 00085000
*'/* $LC=ENQGRS,HRM2405,,TSG: Support for GRS (RMF 2.4.0)       @LCA*/' 00086000
*'/* $N1=MON1,HRM3102,,FLS: RMF 3.1 Monitor I enhancements      @N1A*/' 00087000
*'/* $N4=MON1,HRM3102,,FLS: RMF 2.4.1 PTM PQQ0014 in RMF 3.1@PQQ0014*/' 00088000
*'/* $N2=MON1,HRM3102,,SHR: I/O queuing activity support        @N2A*/' 00089000
*'/* $N3=MON1,HRM3102,,OST: ERBCNFGC/R IOQ activity support     @N3A*/' 00090000
*'/* $M1=MONIIIC,HRM3202,,SAG: MONITOR III support              @M1A*/' 00091000
*'/* $V1=VSTOR,HRM3202,,RB: Virtual storage report              @V1A*/' 00092000
*'/* USE A RESERVED BYTE FOR A COUNT OF THE SKIPPED SAMPLES @ZA75097*/' 00093000
*'/* $O1=4381SP,JRM3212,,SHR: 4381 - support                    @O1A*/' 00094000
*'/* $P1=IOMLSP,HRM3302,,SHR: Remove I/O measurement level const@P1A*/' 00095000
*'/* $P2=ES,HRM3302,,CIH: SP2.2 Extended storage                @P2A*/' 00096000
*'/* $P3=OPTEX,HRM3302,,WEY: Expansion of the IOQ option        @P3A*/' 00097000
*'/* $P4=DAE,HRM3302,,THE: DAE service                          @P4A*/' 00098000
*'/* $P5=MISC,HRM3302,,SHR: Avoid duplicate use of CMB slots    @P5A*/' 00099000
*'/* $U1=SGSUP,jrm3512,,FDL: Storage Group Support              @U1A*/' 00100000
*'/* $W1=OY91297,HRM4410,,FRY: Synchronize termination          @W1A*/' 00101000
*'/* $W2=PLAS,HRM4410,,FRY: PLAS conversion                     @W2A*/' 00102000
*'/* $W3=RCLS,HRM4410,,SHR: Implementation of collector service @W3A*/' 00103000
*'/* $W4=MISC,HRM4410,,THE: Corrects APAR ZA79094.              @W4A*/' 00104000
*'/* $X0=OY11330,HRM4410,,WRC: PR/SM support                    @X0A*/' 00105000
*'/* $W5=SMF,JRM4411,,BHL: SMF record 72                        @W5A*/' 00106000
*'/* $Y2=DYNRES,HRM4420,,BB: Dynamic resource manager           @Y2A*/' 00107000
*'/* $Z1=OY29112,HRM4420,,WRC: ESCA basis                       @Z1A*/' 00108000
*'/* $Z2=OY29112,HRM4420,,WRC: Serial & Switch Support          @Z2A*/' 00109000
*'/* $A1=DYNIO,JRM4421,,RV: Dynamic I/O Support                 @A1A*/' 00110000
*'/*  WB: ABEND 0C4, corrects number of DDBs                @YA57961*/' 00111000
*'/* $B1=RTIME,HRM4430,,BHL: Response time support              @B1A*/' 00112000
*'/* $B2=R430,HRM4430,,RV: Dynamic I/O Consolidation            @B2A*/' 00113000
*'/* $B3=SYNC,HRM4430,,GBO: Synchronize Measurements            @B3A*/' 00114000
*'/* WB: ABEND 0C1 in ERBMFEAX when issuing the ACTIVATE            */' 00115000
*'/*        command                                         @YA58324*/' 00116000
*'/* HWG: Improves serialization between ERBMFTMA and       @YA56222*/' 00117000
*'/*      ERBMFPVS (SRB-routine)                            @YA56222*/' 00118000
*'/* HWG: Matches Assembler and PL/X part.                  @YA64112*/' 00119000
*'/* WBA: ABEND 0C4 in ERBMFDCQ after activate of dynamic           */' 00120000
*'/*      reconfiguration change.                           @YA63501*/' 00121000
*'/* $C1=RSDS,HRM4440,,DK: RMF Sysplex Data Server              @C1A*/' 00122000
*'/* $C2=WLM,HRM4440,,GBO: MVS Workload Manager support         @C2A*/' 00123000
*'/* $C3=ESYNC,HRM4440,,GBO: Synchronized Measurements Stage 2  @C3A*/' 00124000
*'/* $C4=WLM,HRM4440,,BHL: MVS Workload Manager support         @C4A*/' 00125000
*'/* $C5=R510,HRM5510,,PFU: KRO0012 Reuse LX value              @C5A*/' 00126000
*'/* LAN: Save CHSC command code at initialization phase    @YA60574*/' 00127000
*'/* $D1=OEM,HRM5520,,GBO: Seperate Gatherer/Reporter           @D1A*/' 00128000
*'/* SHR: Allows for SMF records 78, subtype 3, when        @WA04821*/' 00129000
*'/*      running under VM/ESA                              @WA04821*/' 00130000
*'/* HUE: introduce FRR recovery logic for cycle gatherers  @WA13001*/' 00131000
*'/* SHR: Provides LCU numbers for dedicated devices when   @WA12872*/' 00132000
*'/*      running under VM                                  @WA12872*/' 00133000
*'/* $E1=GRS,HRM6602,,PFU: GRS Star support                     @E1A*/' 00134000
*'/* $E2=PED,HRM6602,,SUW: OS/390 Product Enable/Disable        @E2A*/' 00135000
*'/* HBE: Prevents M2 from gathering inconsistent M1 data   @WA18557*/' 00136000
*'/* SHR: Adaptation to GRS changes                         @WA20587*/' 00137000
*'/* $E3=MISC,HRM6603,,HOL: Monitor II Library List Support     @E3A*/' 00138000
*'/* $F1=MISC,HRM6604,,AJU: Correct DS option proc. of RTY,STY  @F1A*/' 00139000
*'/* FDL: Synchronizes Mon. I and Mon. III when accessing   @WA29318*/' 00140000
*'/*      repository queues within ENQ dataspace ERBENQDS   @WA29318*/' 00141000
*'/* $G1=CF,HRM6606,,FDL: RMF data server master status         @G1A*/' 00142000
*'/* $G2=CACHE,HRM6606,,THE:  Real Hardware CUID                @G2A*/' 00143000
*'/* $G3=MISC,HRM6606,,FDL: Serialize Dynamic I/O Update        @G3A*/' 00144000
*'/*                        (FIN apar OW30536)                  @G3A*/' 00145000
*'/* $G4=MISC,HRM6606,,GUB: Year 2000 sliding window support    @G4A*/' 00146000
*'/*                        for IODF creation date                  */' 00147000
*'/* $I1=FCD,HRM7703,,SHR: FICON director support               @I1A*/' 00148000
*'/* $I2=XSVC,HRM7703,,SHR: Replaces extended SVC routines      @I2A*/' 00149000
*'/* $I3=DCM,HRM7703,,SHR: Dynamic CHPID Management support     @I3A*/' 00150000
*'/* FDL: Improves cache data gathering performance         @WA42945*/' 00151000
*'/* SHR: Quasi-ENF-33 listen exit and PAV enhancements     @WAxxxxx*/' 00151500
*'/*                                                                */' 00152000
*'/* END OF SPECIFICATIONS ******************************************/' 00153000
*    ENDANSWER;                     /*                                  00154000
&STGSLBL DSECT ,                    START OF GLOBAL SUPERVISOR TABLE    00155000
         DS    0D                   Doubleword boundary            @W1C 00156000
STGSNAME DS    CL4'STGS'            TABLE NAME FOR DUMP IDENTIFICATION  00157000
STGSSCT  DS    A                    ADDRESS OF SCT                      00158000
STGSTCB  DS    A                    ADDRESS OF RMF MAINLINE TCB         00159000
STGSASID DS    AL2                  RMF ASID                            00160000
STGSBITS DS    CL1                  RMF global bits                @W4C 00161000
STGSUBIT EQU   X'80'                User exit on                   @W4A 00162000
STGSSBIT EQU   X'40'                SET command issued             @W4A 00163000
STGSGCYC EQU   X'20'                ZZ session, cycle gatherer active   00164000
*                                                                  @W4A 00165000
STGSGINO EQU   X'10'                ZZ session, interval/event gatherer 00166000
*                                   only                           @W4A 00167000
STGSGINA EQU   X'08'                ZZ session, interval gatherer       00168000
*                                   active flag (set by ERBMFDTA)  @I2C 00169000
*                                   X'04' - X'01' not used     @WA18557 00170000
STGSLOCK DS    CL1                  TARGET OF TEST-AND-SET TO SERIALIZE 00171000
*                                   TIMER-DRIVEN SAMPLERS AND INTERVAL  00172000
*                                   INTERVAL MEASUREMENT GATHERERS.     00173000
*                                   (ERBMFEVT AND ERBMFDTS)        @I2C 00174000
STGSMMV  DS    A                    ADDRESS OF MFROUTER VECTOR TABLE    00175000
STGSCYC  DS    2F                   SAMPLING CYCLE INTERVAL, BIT 51     00176000
*                                         IS ONE MICROSECOND            00177000
STGSUSER DS    A                   USER WORD NUMBER ONE    @G527NJW     00178000
STGSUSE2 DS    A                   USER WORD TWO           @G527NJW     00179000
STGSNSKP DS    CL1                 NUM OF SKIPPED SAMPLES DUE TO        00180000
*                                  UNAVAILABLE LOCK            @ZA75097 00181000
****************************************************************** @C1C 00182000
STGSVER  DS    CL1                 STGST Version                   @C1A 00183000
STGCVER  EQU   X'02'               STGST Version for HRM6602       @E1C 00184000
STGSLEN  DS    CL2                 STGST Length                    @C1A 00185000
****************************************************************** @C1A 00186000
STGCSFLG DS    XL4                 Compare and Swap word containing     00187000
*                                  flags to serialize ERBMFPVS @YA64112 00188000
*                                  and ERBMFTMA.               @YA64112 00189000
         ORG   STGCSFLG            describe in more detail     @YA64112 00190000
         DS    XL1                 not used (part of CS word)  @YA64112 00191000
STGCSSRB EQU   X'80'               SRB routine running         @YA64112 00192000
STGCSTER EQU   X'40'               Termination activated       @YA64112 00193000
STGCSNSR EQU   X'20'               no SRB routine expected     @YA64112 00194000
STGCSSNC EQU   X'10'               1 = SRB has been scheduled and has   00195000
*                                  not yet completed execution @YA64112 00196000
         DS    XL3                 not used (part of Compare and Swap   00197000
*                                            word)             @YA64112 00198000
STGSEUC  DS    A                   POINTER TO USER SAMPLER @G527NJW     00199000
STGSDCBA DS    A                   ADDR OF MESSAGE DATA SET DCB    @N1A 00200000
STGSIOCH DS    A                   POINTER TO IOCHT                @N1A 00201000
STGSIODN DS    A                   POINTER TO IODNT                @N3A 00202000
STGSIOCT DS    A                   POINTER TO LCUT                 @N1A 00203000
STGETRML DS    CL4                 LOCAL TERMINATION BYTE          @LCA 00204000
STGETRMG DS    CL4                 GLOBAL TERMINATION BYTE         @LCA 00205000
*                                                                  @LBA 00206000
STGSCPU  DS    A                       CPU DATA ADDRESS            @LBA 00207000
STGSCHAN DS    A                       CHANNEL DATA ADDRESS        @LBA 00208000
STGSDEV  DS    A                       DEVICE DATA ADDRESS         @LBA 00209000
STGSPAG  DS    A                       PAGING DATA ADDRESS         @LBA 00210000
STGSPGSP DS    A                       PAGE SPACE DATA ADDRESS     @LBA 00211000
STGSENQ  DS    A                       ENQ data address is no      @E1C 00212000
*                                      longer used, the ENQ data   @E1C 00213000
*                                      structure is now located    @E1C 00214000
*                                      in private storage          @E1C 00215000
STGSWKLD DS    A                       WKLD DATA ADDRESS           @LBA 00216000
STGSTRC  DS    A                       TRACE DATA ADDRESS          @LBA 00217000
STGSIOQ  DS    A                       I/O QUEUING DATA ADDRESS    @N2A 00218000
STGSVSTG DS    A                       VIRTUAL STORAGE DATA ADDR   @V1A 00219000
*                                                                  @LBA 00220000
STGSCPUF DS    XL1                     CPU OPTIONS                 @LBA 00221000
STGSCHNF DS    XL1                     CHANNEL OPTIONS             @LBA 00222000
STGSDEVF DS    XL1                     DEVICE OPTION FLAGS         @LBA 00223000
STGSTAPE EQU   X'80'                   MAGNETIC TAPE DEVICE        @LBA 00224000
STGSTP   EQU   X'40'                   COMMUNICATION DEVICE        @LBA 00225000
STGSDA   EQU   X'20'                   DIRECT ACCESS DEVICE        @LBA 00226000
STGSGRAP EQU   X'10'                   GRAPHICS DEVICE             @LBA 00227000
STGSUNIT EQU   X'08'                   UNIT RECORD DEVICE          @LBA 00228000
STGSCRDR EQU   X'04'                   CHARACTER READER DEVICE     @LBA 00229000
STGSDVSO EQU   X'02'                   DEVICE SELECTIVITY OPTION   @N1A 00230000
STGSSGSO EQU   X'01'                   SG SELECTIVITY OPTION       @U1A 00231000
STGSPAGF DS    XL1                     PAGING OPTIONS              @LBA 00232000
STGSPGSF DS    XL1                     PAGE SPACE OPTIONS          @LBA 00233000
STGSENQF DS    XL1                     ENQ OPTIONS                 @LBA 00234000
STGSWKLF DS    XL1                     WKLD OPTIONS                @LBA 00235000
STGSTRCF DS    XL1                     TRACE OPTIONS               @LBA 00236000
STGSIOQF DS    XL1                     IOQ OPTIONS                 @N2A 00237000
STGSITAP EQU   X'80'                   MAGNETIC TAPE DEVICE        @P3A 00238000
STGSITP  EQU   X'40'                   COMMUNICATION DEVICE        @P3A 00239000
STGSIDA  EQU   X'20'                   DIRECT ACCESS DEVICE        @P3A 00240000
STGSIGRA EQU   X'10'                   GRAPHICS DEVICE             @P3A 00241000
STGSIUNI EQU   X'08'                   UNIT RECORD DEVICE          @P3A 00242000
STGSICRD EQU   X'04'                   CHARACTER READER DEVICE     @P3A 00243000
STGSLCSO EQU   X'02'                   LCU SELECTIVITY OPTION      @P3A 00244000
STGSVSTF DS    XL1                     VIRTUAL STORAGE OPTIONS     @V1A 00245000
         DS    XL2                     RESERVED, FOR ALIGNMENT     @V1A 00246000
STGSSAMP DS    F                       INTERVAL SAMPLE COUNT       @LBA 00247000
STGSMINT DS    F                   Projected interval length in    @B3C 00248000
*                                  Seconds/100 units               @B3C 00249000
STGSITIM DS    F                   Interval start time after       @B3C 00250000
*                                  midnight in Sec/100 units       @B3C 00251000
*                   MONITOR III SECTION                            @M1A 00252000
STGGSTPT DS    A                   PTR TO MONITOR III GLOBAL       @M1A 00253000
*                                  STORAGE TABLE EXTENSION         @M1A 00254000
*        4 ENQ related definitions no longer used                  @E1D 00255000
         DS    CL24                Reserved for future use         @E1C 00256000
*                   MISCELLANEOUS DEFINITIONS                      @O1A 00257000
STGSLWM  DS    F                   LOW WATER MARK FOR VSTOR        @V1A 00258000
STGSELWM DS    F                   LOW WATER MARK ABOVE 16M        @V1A 00259000
STGSIOML DS    CL1                     I/O MEASUREMENT LEVEL       @O1A 00260000
STGSBFLS DS    CL1                 PR/SM flags                     @Z1C 00261000
STGSBYMN EQU   X'80'               Indicates PR/SM machine         @Z1C 00262000
STGSAIDA EQU   X'40'               Indicates ESCA processor        @Z1A 00263000
STGSSERE EQU   X'20'               Indicates Serial enabled mach   @Z2A 00264000
STGSSWCH EQU   X'10'               Indicates switch in confign.    @Z2A 00265000
STGSNOCH EQU   X'08'               CHSC RC 4 and AIDA ON       @YA58324 00266000
STGSVM   EQU   X'04'               Running as guest under VM   @WA12872 00267000
STGSDCMH EQU   X'02'               DCM supported by hardware       @I3A 00268000
STGSDCMD EQU   X'01'               Configuration contains DCM      @I3A 00269000
*                                  managed channels                @I3A 00270000
STGSPRTN DS    CL1                 PR/SM Partition number          @Y1C 00271000
         DS    CL1                     RESERVED, FOR ALIGNMENT     @X0C 00272000
STGESSL  DS    F                   NUMBER OF EXTENDED STORAGE      @P2A 00273000
*                                  SLOTS INSTALLED                 @P2A 00274000
STGSDAE  DS    A                   ADDRESS OF MODULE AND           @P4A 00275000
*                                  CSECT NAME FOR DAE SERVICE      @P4A 00276000
         DS    A                   Reserved                        @C4D 00277000
STGSCLD  DS    A                   Address of collector data       @W3A 00278000
STGSTESY DS    D                   Doubleword for termina-         @W1A 00279000
*                                    tion/synchronization M I      @W1A 00280000
STGSINTL DS    F                   Length of Monitor I interval         00281000
*                                  or zero, if Monitor I is not         00282000
*                                  active                          @W5A 00283000
STGSSYNV DS    F                   SYNC minute value               @W5A 00284000
STGSSYNF DS    0F                  SYNC information                @B3C 00285000
STGSSYRM DS    C                   SYNC(RMF) flag                  @B3A 00286000
STGSSYNC EQU   X'80'               1... .... =ON SYNC(RMF,nn)      @B3A 00287000
STGSSOPT DS    AL1                 Sync option from M I            @B3A 00288000
*                                  options (option constants            00289000
*                                  declared below)                      00290000
         DS    CL2                 Reserved                        @B3A 00291000
STGSSNOP EQU   0                   0 = No M I Sync option active   @B3A 00292000
STGSSSMF EQU   1                   1 = SYNC(SMF)                   @B3A 00293000
STGSSRNO EQU   2                   2 = NOSYNC                      @B3A 00294000
STGSSRMF EQU   3                   3 = SYNC(RMF)                   @B3A 00295000
*                                                                       00296000
STGSSRMC DS    F                   SRM command count               @W5A 00297000
STGSTOKN DS    F                   Resource manager token          @Y2A 00298000
*                   Dynamic I/O Extension                               00299000
         DS    0F                  Doubleword Boundary                  00300000
STGSTES3 DS    F                   Termination Synchronization     @A1A 00301000
*                                  for M III Listen Exits               00302000
STGSSLET DS    A                   Pointer to Listen Exit Table    @A1A 00303000
STGSFIOC DS    A                   Address of ERBMFIOC             @A1A 00304000
STGSFBSR DS    A                   Address of ERBMFBSR             @A1A 00305000
STGSFLXP DS    A                   Address of ERBMFLXP             @A1A 00306000
STGSFSCS DS    A                   Address of ERBMFSCS             @A1A 00307000
STGSNFGR DS    A                   Address of ERBCNFGR             @A1A 00308000
*                                  Initialization Processing Flags @A1A 00309000
STGSDCFL DS    CL1                 Dynamic I/O Update Flags        @A1A 00310000
*                                  .1.. ....    (STGSDYN del.) @WA42945 00311000
STGSIAC  EQU   X'20'               ..1. .... =ON Configuration     @A1A 00312000
*                                       changed since last IPL     @A1A 00313000
STGSDYNA EQU   X'10'               ...1 .... =ON Dyn. I/O enabled  @A1A 00314000
STGSIOD  EQU   X'08'               .... 1... =ON IPL via IODF      @A1A 00315000
STGSICIV EQU   X'04'               .... .1.. =ON IODF Info valid   @A1A 00316000
STGSDCA  EQU   X'02'               .... ..1. =ON Conf. changed     @A1A 00317000
STGSINHB EQU   X'01'               .... ...1 =ON M I Dev/I/O Q_ing @A1A 00318000
*                                                Option inhibited  @A1A 00319000
STGSCNFL DS    CL1                 Configuration Table Build Flags @A1A 00320000
STGSCNIN EQU   X'80'               1... .... =ON Table Build       @A1A 00321000
*                                                in progress       @A1A 00322000
STGSCNRI EQU   X'40'               .1.. .... =ON Reinitialization  @A1A 00323000
*                                                required          @A1A 00324000
STGSCNUP EQU   X'20'               ..1. .... =ON Table Update      @A1A 00325000
*                                                in progress       @A1A 00326000
STGSCNTR EQU   X'10'               ...1 .... =ON Table Delete      @A1A 00327000
*                                                in progress       @A1A 00328000
*                                  ..11 1111 reserved              @A1A 00329000
STGSDVFL DS    CL1                 Device Table Build Flags        @A1A 00330000
STGSDVIN EQU   X'80'               1... .... =ON Device Initial.   @A1A 00331000
*                                                in progress       @A1A 00332000
STGSDVRI EQU   X'40'               .1.. .... =ON Reinitialization  @A1A 00333000
*                                                required          @A1A 00334000
*                                  ..1. .... =ON SMF record 74 @YA57961 00335000
*  NOT LONGER USED                               length changed    @A1A 00336000
*                                  ..11 1111 Reserved          @YA57961 00337000
STGSIOFL DS    CL1                 I/O Queueing Table Build Flags  @A1A 00338000
STGSIOIN EQU   X'80'               1... .... =ON I/O Q_ing Init.   @A1A 00339000
*                                                in progress       @A1A 00340000
STGSIORI EQU   X'40'               .1.. .... =ON Reinitialization  @A1A 00341000
*                                                required          @A1A 00342000
*                                  ..1. .... =ON SMF Record 78 @YA63501 00343000
*  NOT LONGER USED                               length changed    @A1A 00344000
*                                  ..11 1111 reserved          @YA63501 00345000
STGS3DFL DS    CL1                 Monitor 3 Device Table Build    @A1A 00346000
STGS3DIN EQU   X'80'               1... .... =ON Device Initial.   @A1A 00347000
*                                                in progress       @A1A 00348000
STGS3DRI EQU   X'40'               .1.. .... =ON Reinitialization  @A1A 00349000
*                                                required          @A1A 00350000
*                                  ..11 1111 reserved              @A1A 00351000
         DS    CL3                 reserved bytes                  @A1A 00352000
STGSUPCT DS    CL2                 I/O configuration update count  @A1A 00353000
*                                  I/O Configuration Inform. Area  @A1A 00354000
STGSTNM  DS    CL44                IODF Name                       @A1A 00355000
STGSTSF  DS    CL2                 Suffix of IODF Name             @A1A 00356000
STGSTSX  DS    CL2                 Suffix set by ERBMFEAX          @A1A 00357000
STGSTDT  DS    CL8                 IODF creation date              @A1A 00358000
STGSTTM  DS    CL8                 IODF creation time              @A1A 00359000
STGSTY1  DS    CL2                 First two bytes of IODF creation     00360000
*                                  date YYyy/mm/dd                 @G4C 00361000
STGSENF  DS    F                   ENF Synchronization Lock        @B2M 00362000
STGSDCS  EQU   X'80'               1... .... =ON ERBLXDCS active   @B2M 00363000
STGSDIO  EQU   X'40'               .1.. .... =ON Dynamic I/O       @B2M 00364000
*                                       update in progress (LXDIO) @B2M 00365000
*                                                                  @B2C 00366000
         DS    CL1                 Reserved for later use          @B1A 00367000
STGSIZZA EQU   X'80'               Monitor I initialization ERBMFIZZ    00368000
*                                  is active for the first time. @B1A   00369000
STGSCHFL DS    XL1                 CHSC support flags          @WA04821 00370000
STGSCSCL EQU   X'80'               1 = Store Channel Path Link Address  00371000
*                                  not supported               @WA04821 00372000
STGSCSSL EQU   X'40'               1 = Store Subchannel Link Address    00373000
*                                  not supported               @WA04821 00374000
STGSCSSC EQU   X'20'               1 = Store Subchannel Control Unit    00375000
*                                  Data not supported          @WA04821 00376000
STGSCSPQ EQU   X'10'               1 = Store Primary Queue Data not     00377000
*                                  supported                   @WA04821 00378000
STGSCSSQ EQU   X'08'               1 = Store Secondary Queue Data not   00379000
*                                  supported                   @WA04821 00380000
         DS    CL2                 Reserved                    @WA04821 00381000
*        ECB addresses, related to SRM SET command processing           00382000
         DS    A                   Reserved                        @C4D 00383000
         DS    A                   Reserved                        @C4D 00384000
         DS    A                   Reserved                        @C4D 00385000
*        Start and end address of IRARMWAR for page free                00386000
         DS    A                   Reserved                        @C4D 00387000
*        Cache configuration change control (M1/M3)            @WA42945 00388000
STGSCCC  DS    0F                  Cache configuration control @WA42945 00389000
STGSCCCF DS    XL1                 Cache configuration change  @WA42945 00390000
STGSCDY1 EQU   X'80'               1... .... =ON DYN I/O update    @G2A 00391000
*                                                (M1)  (moved) @WA42945 00392000
STGSCDY3 EQU   X'40'               .1.. .... =ON DYN I/O update    @G2A 00393000
*                                                (M3)          @WA42945 00394000
STGSCDV1 EQU   X'20'               ..1. .... =ON Device became online   00395000
*                                                (for M1)      @WA42945 00396000
STGSCDV3 EQU   X'10'               ...1 .... =ON Device became online   00397000
*                                                (for M3)      @WA42945 00398000
         DS    CL3                 Reserved for cache control  @WA42945 00399000
*                                                                       00400000
*        Extension for Synchronize Measurements                    @B3A 00401000
STGSSYME DS    0F                                                       00402000
STGSSCCE DS    F                   ECB to communicate SMF          @B3A 00403000
*                                  interval end from SMF listen         00404000
*                                  exit to interval control             00405000
STGSMFIE DS    CL8                 GMT SMF interval expiration     @B3A 00406000
*                                  token - STCK format                  00407000
*                                                                       00408000
STGSDCNE DS    F                   ECB to communicate Monitor 1    @B3A 00409000
*                                  (in)active to interval control       00410000
*                                                                       00411000
STGSCDIE DS    F                   ECB for communicating interval  @B3A 00412000
*                                  end from Interval control to         00413000
*                                  Monitor I                            00414000
*                                                                       00415000
         DS    CL36                Reserved                        @C3C 00416000
*                                  16 Lines deleted              16@C3D 00417000
*                                                                       00418000
         DS    CL36                Reserved                        @C3C 00419000
*                                  16 Lines deleted              16@C3D 00420000
*                                                                       00421000
STGS1I   DS    0F                  Information about last          @B3A 00422000
*                                  Monitor I Interval                   00423000
STGS1IET DS    CL8                 Interval expiration time token  @B3A 00424000
STGS1FLA DS    C                   M I interval flag bits          @B3A 00425000
STGS1ISC EQU   X'80'               M I interval was completely     @B3A 00426000
*                                  under SMF control                    00427000
         DS    CL3                 Reserved                        @B3A 00428000
*                                                                       00429000
*                                                                       00430000
STGSLSMF DS    C                   SMF Listen exit flags           @B3A 00431000
STGSLXSI EQU   X'80'               1... .... Listen exit inactive  @B3A 00432000
STGSLSMI EQU   X'40'               .1.. .... SMF signal: inactive  @B3A 00433000
*                                                                       00434000
*        RMF Address space information                                  00435000
STGSGRMF DS    0C                  Info about RMF address space    @C2A 00436000
STGSGFLG DS    CL1                 RMF global flags                @C3A 00437000
STGSGTER EQU   X'80'               RMF is terminating (P RMF)      @C3A 00438000
STGSATER EQU   X'40'               RMF is abnormally terminating   @E1A 00439000
STGSNEGP EQU   X'20'               No ENQ contention data due to GRS    00440000
*                                  system problems             @WA20587 00441000
STGSRREL DS    CL2                 Release of RMF                  @C3A 00442000
*                                                                       00443000
         DS    F                   Reserved (was STGSEOIC)         @C3C 00444000
*                                                                       00445000
*                                                                       00446000
STGSASCP DS    A                   Pointer to RMF's own                 00447000
*                                  ASCB control block                   00448000
*                                  (0, if RMF inactive)            @B3A 00449000
STGSSTTI DS    CL8                 Starttime of RMF control             00450000
*                                  address space, taken from            00451000
*                                  ASCBINTS field                       00452000
*                                  (0, if RMF inactive)            @B3A 00453000
*                                                                       00454000
*                                                                       00455000
STGRMFST DS    CL8                 RMF Address Space Space Token   @C2A 00456000
*                                                                       00457000
*        Sysplex Data Server                                            00458000
*                                                                       00459000
STGSDSGD DS    A                   Pointer to RMF Sysplex Data Server   00460000
*                                  Global Data Block               @C1A 00461000
*                                                                       00462000
*        Extended Synchronization info block                            00463000
*                                                                       00464000
STGSESYN DS    0F                  Extended Sync info block        @C3A 00465000
*                                                                       00466000
*                                                                       00467000
*                                                                       00468000
STGSELI  DS    0F                  Last interval information       @C3A 00469000
STGSLIST DS    CL8                 GMT Start time (STCK format)    @C3M 00470000
*                                  of last interval                @C3M 00471000
STGSLTZ  DS    CL8                 Time zone offset (TOD format):  @C3M 00472000
*                                  local time-GMT time             @C3M 00473000
*                                  of last interval                @C3M 00474000
STGSLILN DS    CL8                 Actual intvl-len (TOD-format)   @C3M 00475000
*                                  of last interval                @C3M 00476000
STGSLIET DS    CL8                 Interval expiration token       @C3M 00477000
*                                  of last interval                @C3M 00478000
STGSLFLA DS    C                   Flag bits                       @C3M 00479000
*                                  of last interval                @C3M 00480000
STGSLIES EQU   X'80'               'Ended under SMF control' bit   @C3M 00481000
*                                  of last interval                @C3M 00482000
         DS    CL3                 Reserved                        @C3M 00483000
STGSLPET DS    CL8                 Projected end time(STCK format) @C3A 00484000
*                                  of last interval                @C3A 00485000
STGSLOIL DS    F                   Interval length parameter (sec) @C3A 00486000
*                                  of last interval                @C3A 00487000
STGSLSYN DS    F                   Sync value parameter (sec)      @C3A 00488000
*                                  of last interval                @C3A 00489000
STGSLICT DS    F                   Interval counter                @C3A 00490000
*                                  of last interval                @C3A 00491000
STGSLTRA DS    A                   Address of Trace Table          @C3A 00492000
         DS    CL12                Reserved area for last interval @C3A 00493000
*                                                                       00494000
*                                                                       00495000
*                                                                       00496000
STGSECI  DS    0F                  Current interval information    @C3A 00497000
STGSCIST DS    CL8                 GMT Start time (STCK format)    @C3M 00498000
*                                  of current interval             @C3M 00499000
STGSCTZ  DS    CL8                 Time zone offset (TOD format):  @C3M 00500000
*                                  local time-GMT time             @C3M 00501000
*                                  of current interval             @C3M 00502000
STGSCILN DS    CL8                 Actual intvl-len (TOD-format)   @C3M 00503000
*                                  of current interval             @C3M 00504000
STGSCIET DS    CL8                 Interval expiration token       @C3M 00505000
*                                  of current interval             @C3M 00506000
STGSCFLA DS    C                   Flag bits                       @C3M 00507000
*                                  of current interval             @C3M 00508000
STGSCIES EQU   X'80'               'Ended under SMF control' bit   @C3M 00509000
*                                  of current interval             @C3M 00510000
         DS    CL3                 Reserved                        @C3M 00511000
STGSCPET DS    CL8                 Projected end time(STCK format) @C3A 00512000
*                                  of current interval             @C3A 00513000
STGSCOIL DS    F                   Interval length parameter (sec) @C3A 00514000
*                                  of current interval             @C3A 00515000
STGSCSYN DS    F                   Sync value parameter (sec)      @C3A 00516000
*                                  of current interval             @C3A 00517000
STGSCICT DS    F                   Interval counter                @C3A 00518000
*                                  of current interval             @C3A 00519000
STGSCTRA DS    A                   Address of Trace Table          @C3A 00520000
         DS    CL12                Reserved for current interval   @C3A 00521000
*                                                                       00522000
*                                                                       00523000
STGSE1I  DS    0F                  Last M1 interval information    @C3A 00524000
STGS1PET DS    CL8                 Projected end time(STCK format) @C3A 00525000
*                                  of last M I interval            @C3A 00526000
STGS1OIL DS    F                   Interval length parameter(sec)  @C3A 00527000
*                                  of last M I interval            @C3A 00528000
STGS1SYN DS    F                   Sync value parameter (sec)      @C3A 00529000
*                                  of last M I interval            @C3A 00530000
STGS1TZ  DS    CL8                 Time zone offset (TOD format):  @C3M 00531000
*                                  local time-GMT time             @C3M 00532000
*                                  of last M I interval            @C3M 00533000
*                                                                       00534000
*        WLM/SRM Support                                                00535000
*                                                                       00536000
STGWLMEX DS    0F                  WLM/SRM Extension               @C2A 00537000
*                                                                       00538000
STGWPCTA DS    F                   Token for program call entry    @C2A 00539000
*                                  tables for RMF common services  @C2A 00540000
STGWLPSL DS    F                   PC number "SaveListenExitRCAA"  @C2A 00541000
STGM2PCI DS    F                   PC number "Monitor 2 PC-call    @E3C 00542000
         DS    F                   PC number reserved              @C2A 00543000
STGWCSAR DS    A                   Pointer to CS info area         @C2A 00544000
STGWLXCE DS    F                   ECB to communicate SRM/WLM      @C2A 00545000
*                                  "change complete" to ERBMFCLS   @C2A 00546000
STGWLXFL DS    C                   WLM/SRM Listen Exit flags       @C2A 00547000
STGWLXIP EQU   X'80'               Listen exit curr. in progress   @C2A 00548000
STGWLXWI EQU   X'40'               WLM Listen exit inoperational   @C2A 00549000
STGWLXSI EQU   X'20'               SRM Listen exit inoperational   @C2A 00550000
         DS    CL3                 Reserved for WLM                @C2A 00551000
         DS    CL8                 Reserved for WLM                @C2A 00552000
STGSLXAR DS    0F                  Linkage Index (LX) area         @C5A 00553000
STGSLXFL DS    XL1                 LX flag byte                    @C5A 00554000
STGSLXIN EQU   X'80'               LX values installed             @C5A 00555000
         DS    XL3                 Reserved                        @C5A 00556000
STGSLXV1 DS    F                   LX value 1 used for Data Server @C5A 00557000
STGSLXV2 DS    F                   LX value 2 used for WLM support @C5A 00558000
*                                                                       00559000
STGSFRRP DS    A                   pointer to FRR extension used by     00560000
*                                  cycle gath. and ERBMFEVT    @WA13001 00561000
STGSPDGA DS    A                   Pointer to DG info area         @D1A 00562000
STGSFRSA DS    CL32                Floating Pt Reg Save Area       @D1A 00563000
STGSCNFX DS    F                   Address of ERBCNFGR/V       @WA12872 00564000
*        GRS Support                                               @E1A 00565000
STGSEQHP DS    A                   Address of EEQHD                @E1A 00566000
STGGLXDW DS    0D                  Guarantee DWord alignment       @E1A 00567000
STGGLXAC DS    F                   GRS listen exit active count    @E1A 00568000
STGGLXUC DS    F                   GRS listen exit update count    @E1A 00569000
STGSLSTT DS    CL8                 Latch set token for RMF AS      @E1A 00570000
STGCERST DS    CL8                 STOKEN of ENQ DS                @E1A 00571000
STGCERPT DS    A                   Address of repository header    @E1A 00572000
STGSEQDS DS    CL20                ENQ DS dump parm area           @E1A 00573000
*        OS/390 Product Enable/Disable Support                     @E2A 00574000
STGSEDIF DS    0CL10               OS/390 Enable/Disable info      @E2A 00575000
STGSEDSF DS    CL1                 Enable/Disable status flags     @E2A 00576000
STGSEDEN EQU   X'80'               1... .... RMF is enabled        @E2A 00577000
STGSEDDR EQU   X'40'               .1.. .... Deregister required   @E2A 00578000
         DS    CL1                 Reserved                        @E2A 00579000
STGSEDTK DS    CL8                 Enable/Disable token            @E2A 00580000
*        Dataserver status flags                                   @G1A 00581000
STGSDSFL DS    0CL1                Dataserver status               @G1A 00582000
STGSDSMS DS    X'80'               1... .... RMF master            @G1A 00583000
         DS    CL1                 Reserved                        @G1C 00584000
STG1RTYP DS    A                   Pointer to 1. DS RTY/STY list   @F1A 00585000
STG2RTYP DS    A                   Pointer to 2. DS RTY/STY list   @F1A 00586000
STGSFCD  DS    A                   Ptr to FCD data area            @I1A 00587000
STGSFCDS DS    A                   Ptr to FCD NMBR/EXNMBR          @I1A 00588000
*                                  selection table                 @I1A 00589000
STGSE33P DS    A                   Ptr to ERBMFE33 listen exit @WA46171 00590490
STGSIZSS DS    CL8                 Save field for ERBMFIZS         @I1A 00591000
*        Reserved space                                                 00592000
STGSRESV DS    CL40                Reserved                        @I1C 00593000
         MEXIT                                                          00594000
         MEND                                                           00595000
**/                                                                     00596000
*    DCL KEY CHAR;                  /* KEY WORD PRINTED IN COMMENT   */ 00597000
*                                                                       00598000
*    /* ANSWER BACK A COPY OF INVOKING STATEMENT                     */ 00599000
*    IF ATTRIBUT = '' THEN          /* IF NO STRUCTURE ATTRIBUTES WERE  00600000
*                                      INPUT, DO NOT PRINT KEY WORD  */ 00601000
*      KEY = '';                    /* KEY WORD IS BLANKS            */ 00602000
*    ELSE                                                               00603000
*      KEY = 'ATTRIBUT';            /* PRINT KEYWORD NAME            */ 00604000
*    ANS('/* ?'||MACLABEL||MACNAME||' '||MACLIST||KEY||ATTRIBUT||' */'  00605000
*       ) SKIP;                                                         00606000
*                                                                       00607000
*    /* ANSWER DECLARE, STRUCTURE NAME, INPUT ATTRIBUTES OF STRUCTURE*/ 00608000
*    /* AND BOUNDARY ATTRIBUTE.                                      */ 00609000
*    ANS(                                                               00610000
*              'DECLARE                                               ' 00611000
*       )SKIP;                                                          00612000
*    ANS(                                                               00613000
*          '  1 STGST               /* GLOBAL SUPERVISOR TABLE      */' 00614000
*       )SKIP;                                                          00615000
*    ANS(                                                               00616000
*              '        '||ATTRIBUT(1)||'                             ' 00617000
*       )SKIP;                                                          00618000
*    ANS(                                                               00619000
*              '        BDY(DWORD),                           /*@W1C*/' 00620000
*       )SKIP;                                                          00621000
*                                                                       00622000
*    /* ANSWER BACK THE STRUCTURE DEFINITION                         */ 00623000
*ANS(                                                                   00624000
*          '    2 STGSNAME          /* TABLE NAME (STGS)             */ 00625000
*                     CHAR(4),                                          00626000
*               2 STGSPAR1,         /* EVERYTHING MUST BE CLEARED AT    00627000
*                                      MFIMAINL INIT EXCEPT NAME, CNFG  00628000
*                                      PTRS AND ENQ BITS.        @N4C*/ 00629000
*               3 STGSSCT           /* ADDRESS OF SUPERVISOR CONTROL    00630000
*                                      TABLE (STSCT)             @N4C*/ 00631000
*                     PTR(31),                                          00632000
*               3 STGSTCB           /* TCB address of RMF address       00633000
*                                      space (ERBMFMFC)          @I2C*/ 00634000
*                     PTR(31),                                        ' 00635000
*   )SKIP;                                                              00636000
*ANS(                                                                   00637000
*          '    3 STGSASID          /* ASID of RMF address space        00638000
*                                      (ERBMFMFC)                @I2C*/ 00639000
*                     FIXED(15),                                      ' 00640000
*   )SKIP;                                                              00641000
*                                                                       00642000
*ANS(                                                                   00643000
*          '    3 STGSBITS BIT(8),  /*RMF GLOBAL BITS          @N4A*/   00644000
*                 4 STGSUBIT BIT(1), /*USER EXITS ON IF ONE@G527NJW*/   00645000
*                 4 STGSSBIT BIT(1), /* Set command issued @GM2EQJK*/   00646000
*                 4 STGSGCYC BIT(1), /* ZZ session, cycle gatherer      00647000
*                                       active                 @W4A*/   00648000
*                 4 STGSGINO BIT(1), /* ZZ session, interval/event      00649000
*                                       gatherer only          @W4A*/   00650000
*                 4 STGSGINA BIT(1), /* ZZ session, interval gatherer   00651000
*                                       active flag (set by             00652000
*                                       ERBMFDTA)              @I2C*/   00653000
*                 4 * BIT(3),        /* Not used           @WA18557*/'  00654000
*   )SKIP;                                                              00655000
*                                                                       00656000
*ANS(                                                                   00657000
*          '    3 STGSLOCK          /* TARGET OF TEST-AND-SET TO        00658000
*                                      SERIALIZE TIMER-DRIVEN SAMPLERS  00659000
*                                      AND INTERVAL MEASURMENT          00660000
*                                      GATHERERS. (ERBMFEVT AND         00661000
*                                      ERBMFDTS).                @I2C*/ 00662000
*                     CHAR(1),                                          00663000
*               3 STGSMMV           /* ADDRESS OF MFROUTER MG VECTOR    00664000
*                                      TABLE (MFMMV)           @N4A  */ 00665000
*                     PTR(31),                                          00666000
*               3 STGSCYC           /* RMF SAMPLING CYCLE PERIOD, IN    00667000
*                                      TIME OF DAY (TOD) CLOCK FORMAT   00668000
*                                                                @N4A*/ 00669000
*                     CHAR(8),                                        ' 00670000
*   )SKIP;                                                              00671000
*                                                                       00672000
*ANS(                                                                   00673000
*          '    3 STGSUSER          /* USER EXITS FIRST WORD     @N4A*/ 00674000
*                     FIXED(31),                                        00675000
*               3 STGSUSE2          /* USER EXIT SECOND WORD     @N4A*/ 00676000
*                 FIXED(31),                                            00677000
*               3 STGSNSKP          /* NUM OF SKIPPED SAMPLES DUE TO */ 00678000
*                 CHAR(1),          /* UNAVAIL. LOCK         @ZA75097*/ 00679000
*               3 STGSVER BIT(8),   /* STGST Version             @C1C*/ 00680000
*               3 STGSLEN FIXED(15),/* STGST Length              @C1A*/ 00681000
*               3 STGCSFLG          /* Compare and Swap word         */ 00682000
*                     FIXED(32),    /* containing flags to serialize */ 00683000
*                                   /* ERBMFTMA and ERBMFPVS @YA56222*/ 00684000
*                 5 STGCSSRB BIT(1),/* SRB running flag      @YA56222*/ 00685000
*                 5 STGCSTER BIT(1),/* termination flag      @YA56222*/ 00686000
*                 5 STGCSNSR BIT(1),/* no running SRB routine expected  00687000
*                                                            @YA56222*/ 00688000
*                 5 STGCSSNC BIT(1),/* 1 = SRB has been scheduled and   00689000
*                                      has not yet completed execution  00690000
*                                                            @YA56222*/ 00691000
*                 5 * BIT(28),      /* reserved              @YA56222*/ 00692000
*               3 STGSEUC           /* POINTER TO USER SAMPLER          00693000
*                                      EXIT WHICH GETS CONTROL FROM     00694000
*                                      ERBMFEVT                  @N4A*/ 00695000
*                     PTR(31),                                        ' 00696000
*   )SKIP;                                                              00697000
*ANS(                                                                   00698000
*          '    3 STGSDCBA          /* ADDR OF MESSAGE DATA SET DCB  */ 00699000
*                     PTR(31),      /*                           @N1A*/ 00700000
*               2 STGSIOCH          /* PTR TO IOCHT                  */ 00701000
*                     PTR(31),      /*                           @N1A*/ 00702000
*               2 STGSIODN          /* PTR TO IODNT                  */ 00703000
*                     PTR(31),      /*                           @N3A*/ 00704000
*               2 STGSIOCT          /* PTR TO LCUT               @N1A*/ 00705000
*                     PTR(31),                                        ' 00706000
*   )SKIP;                                                              00707000
*                                                                       00708000
*ANS(                                                                   00709000
*                                                                       00710000
*          '    2 STGETRML BIT(32), /* TERMINATION WORD FOR LOCAL ENQ   00711000
*                                      REQUEST                   @LCA*/ 00712000
*                 3 * BIT(8),       /*                           @LCA*/ 00713000
*                 4 STGTRQL BIT(1), /* TERMINATION REQUEST BIT FOR      00714000
*                                      LOCAL ENQ REQUEST         @LCA*/ 00715000
*                 4 STGEINPL BIT(1), /* LOCAL ENQ REQUEST IN            00716000
*                                       PROGRESS                 @LCA*/ 00717000
*                 4 * BIT(6),        /* RESERVED                 @LCA*/ 00718000
*                 3 * BIT(24),       /*                         @LCA*/' 00719000
*   )SKIP;                                                              00720000
*                                                                       00721000
*ANS(                                                                   00722000
*          '    2 STGETRMG BIT(32), /* TERMINATION BIT FOR GLOBAL ENQ   00723000
*                                      REQUEST                   @LCA*/ 00724000
*                 3 * BIT(8),       /*                           @LCA*/ 00725000
*                 4 STGTRQG BIT(1), /* TERMINATION REQUEST BIT FOR      00726000
*                                      GLOBAL ENQ REQUEST        @LCA*/ 00727000
*                 4 STGEINPG BIT(1), /* GLOBAL ENQ REQUEST IN           00728000
*                                       PROGRESS                 @LCA*/ 00729000
*                 4 * BIT(6),        /* RESERVED                 @LCA*/ 00730000
*                 3 * BIT(24),       /*                         @LCA*/' 00731000
*   )SKIP;                                                              00732000
*                                                                       00733000
*ANS(                                                                   00734000
*          '    /* THE FOLLOWING FIELDS ARE USED BY MONITOR I           00735000
*                  (MSCH COMPLETION AND LISTEN EXIT ROUTINES)           00736000
*                  AND/OR MONITOR II @N2C*/                             00737000
*               2 STGSPAR2,         /* FOR CLEARING BLOCK        @N4A*/ 00738000
*                 3 STGSCPU         /* PTR TO CPU DATA           @LBA*/ 00739000
*                     PTR(31),                                          00740000
*                 3 STGSCHAN        /* PTR TO CHANNEL DATA       @LBA*/ 00741000
*                     PTR(31),                                          00742000
*                 3 STGSDEV         /* PTR TO DEVICE DATA        @LBA*/ 00743000
*                     PTR(31),                                          00744000
*                 3 STGSPAG         /* PTR TO PAGING DATA        @LBA*/ 00745000
*                     PTR(31),                                        ' 00746000
*   )SKIP;                                                              00747000
*                                                                       00748000
*ANS(                                                                   00749000
*          '      3 STGSPGSP        /* PTR TO PAGESPACE DATA     @LBA*/ 00750000
*                     PTR(31),                                          00751000
*                 3 STGSENQ         /* ENQ data address is no longer    00752000
*                                      used, the ENQ data structure is  00753000
*                                      now located in private storage   00754000
*                                                                @E1C*/ 00755000
*                     PTR(31),                                          00756000
*                 3 STGSWKLD        /* PTR TO WLKD DATA          @LBA*/ 00757000
*                     PTR(31),                                          00758000
*                 3 STGSTRC         /* PTR TO TRACE DATA         @LBA*/ 00759000
*                     PTR(31),                                          00760000
*                 3 STGSIOQ         /* PTR TO I/O QUEUING DATA   @N2A*/ 00761000
*                     PTR(31),                                          00762000
*                 3 STGSVSTG  /* PTR TO VIRTUAL STORAGE DATA     @V1A*/ 00763000
*                     PTR(31),                                        ' 00764000
*   )SKIP;                                                              00765000
*                                                                       00766000
*ANS(                                                                   00767000
*          '      3 STGSCPUF        /* CPU OPTIONS               @LBA*/ 00768000
*                     BIT(8),                                           00769000
*                 3 STGSCHNF        /* CHANNEL OPTIONS           @LBA*/ 00770000
*                     BIT(8),                                         ' 00771000
*   )SKIP;                                                              00772000
*                                                                       00773000
*ANS(                                                                   00774000
*          '      3 STGSDEVF BIT(8),/* DEVICE OPTION FLAGS       @LBA*/ 00775000
*                   4 STGSTAPE      /* MAGNETIC TAPE DEVICE      @LBA*/ 00776000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00777000
*                                       SELECTED                 @LBA*/ 00778000
*                   4 STGSTP        /* COMMUNICATION DEVICES     @LBA*/ 00779000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00780000
*                                       SELECTED                 @LBA*/ 00781000
*                   4 STGSDA        /* DIRECT ACCESS DEVICES     @LBA*/ 00782000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00783000
*                                       SELECTED                @LBA*/' 00784000
*     )SKIP;                                                            00785000
*                                                                       00786000
*ANS(                                                                   00787000
*          '      4 STGSGRAP        /* GRAPHICS DEVICES          @LBA*/ 00788000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00789000
*                                       SELECTED                 @LBA*/ 00790000
*                   4 STGSUNIT      /* UNIT RECORD DEVICES       @LBA*/ 00791000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00792000
*                                       SELECTED                 @LBA*/ 00793000
*                   4 STGSCRDR      /* CHARACTER READER DEVICES  @LBA*/ 00794000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00795000
*                                       SELECTED                @LBA*/' 00796000
*     )SKIP;                                                            00797000
*                                                                       00798000
*ANS(                                                                   00799000
*          '        4 STGSDVSO      /* DEVICE SELECTIVITY OPTION @N1A*/ 00800000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00801000
*                                       SELECTED                 @LBA*/ 00802000
*                   4 STGSSGSO      /* SG Selectivity Option         */ 00803000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00804000
*                                       SELECTED                 @U1C*/ 00805000
*                                                                       00806000
*                 3 STGSPAGF        /* PAGING OPTIONS            @LBA*/ 00807000
*                     BIT(8),                                           00808000
*                 3 STGSPGSF        /* PAGESPACE OPTIONS         @LBA*/ 00809000
*                     BIT(8),                                           00810000
*                 3 STGSENQF        /* ENQ OPTIONS               @LBA*/ 00811000
*                     BIT(8),                                         ' 00812000
*   )SKIP;                                                              00813000
*                                                                       00814000
*ANS(                                                                   00815000
*          '      3 STGSWKLF        /* WLKD OPTIONS              @LBA*/ 00816000
*                     BIT(8),                                           00817000
*                 3 STGSTRCF        /* TRACE OPTIONS             @LBA*/ 00818000
*                     BIT(8),'                                          00819000
*     )SKIP;                                                            00820000
*ANS(                                                                   00821000
*          '      3 STGSIOQF        /* I/O QUEUING OPTIONS       @N2A*/ 00822000
*                     BIT(8),                                           00823000
*                   4 STGSITAP      /* MAGNETIC TAPE DEVICE      @P3A*/ 00824000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00825000
*                                       SELECTED                 @P3A*/ 00826000
*                   4 STGSITP       /* COMMUNICATION DEVICES     @P3A*/ 00827000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00828000
*                                       SELECTED                 @P3A*/ 00829000
*                   4 STGSIDA       /* DIRECT ACCESS DEVICES     @P3A*/ 00830000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00831000
*                                       SELECTED                @P3A*/' 00832000
*     )SKIP;                                                            00833000
*                                                                       00834000
*ANS(                                                                   00835000
*          '      4 STGSIGRA        /* GRAPHICS DEVICES          @P3A*/ 00836000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00837000
*                                       SELECTED                 @P3A*/ 00838000
*                   4 STGSIUNI      /* UNIT RECORD DEVICES       @P3A*/ 00839000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00840000
*                                       SELECTED                 @P3A*/ 00841000
*                   4 STGSICRD      /* CHARACTER READER DEVICES  @P3A*/ 00842000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00843000
*                                       SELECTED                @LBA*/' 00844000
*     )SKIP;                                                            00845000
*                                                                       00846000
*ANS(                                                                   00847000
*          '        4 STGSLCSO      /* LCU SELECTIVITY OPTION    @P3A*/ 00848000
*                       BIT(1),     /* 0-OPTION NOT SELECTED 1 OPTION   00849000
*                                       SELECTED                 @P3A*/ 00850000
*                   4 * BIT(1),     /* RESERVED                  @P3A*/ 00851000
*                                                                       00852000
*                 3 STGSVSTF        /* VIRTUAL STORAGE OPTIONS   @V1A*/ 00853000
*                     BIT(8),                                           00854000
*                 3 * BIT(16),      /* RESERVED, FOR ALIGNMENT  @V1A*/' 00855000
*   )SKIP;                                                              00856000
*                                                                       00857000
*ANS(                                                                   00858000
*          '   3 STGSSAMP FIXED(31),/* NUMBER OF SAMPLES TAKEN FOR      00859000
*                                      THE CURRENT INTERVAL      @N4A*/ 00860000
*              3 STGSMINT FIXED(32),/* Projected interval length in     00861000
*                                      Seconds/100 units                00862000
*                                      for the current interval  @B3C*/ 00863000
*              3 STGSITIM FIXED(32),/* Interval start time after        00864000
*                                      midnight in Sec/100 units        00865000
*                                      for the current interval  @B3C*/'00866000
*   )SKIP;                                                              00867000
*ANS(                                                                   00868000
*          '    /*           MONITOR III SECTION                 @M1A*/ 00869000
*               2 STGGSTPT          /* PTR TO MONITOR III GLOBAL @M1A*/ 00870000
*                     PTR(31),      /* STORAGE TABLE EXTENSION   @M1A*/ 00871000
*               /* 10 ENQ related definitions no longer used @E1D*/     00872000
*               2 * CHAR(24),       /* Reserved for future use   @E1C*/ 00873000
*               /* Miscellaneous definitions @O1A*/                   ' 00874000
*   )SKIP;                                                              00875000
* ANS(    '   2 STGSLWM FIXED(31),  /* LOW WATER MARK FOR VSTOR  @V1A*/ 00876000
*             2 STGSELWM FIXED(31), /* LOW WATER MARK ABOVE 16M  @V1A*/ 00877000
*               2 STGSIOML          /* I/O measurement level     @O1A*/ 00878000
*                   CHAR(1),                                            00879000
*               2 STGSBFLS BIT(8),  /* PR/SM flags               @Z1C*/ 00880000
*                 3 STGSBYMN BIT(1), /* PR/SM machine indicator  @Z1C*/ 00881000
*                 3 STGSAIDA BIT(1), /* ESCA processor           @Z1A*/ 00882000
*                 3 STGSSERE BIT(1), /* Serial enabled machine   @Z2A*/ 00883000
*                 3 STGSSWCH BIT(1), /* Switch in configuration  @Z2A*/ 00884000
*                 3 STGSNOCH BIT(1), /* CHSC RC 4 a. AIDA ON @YA58324*/ 00885000
*                 3 STGSVM   BIT(1), /* Running under VM     @WA12872*/ 00886000
*                 3 STGSDCMH BIT(1), /* DCM supported by hardware       00887000
*                                                                @I3A*/ 00888000
*                 3 STGSDCMD BIT(1), /* Configuration contains DCM      00889000
*                                      managed channels          @I3A*/ 00890000
*               2 STGSPRTN CHAR(1), /* PR/SM partition number    @Y1C*/ 00891000
*                                                                     ' 00892000
*   )SKIP;                                                              00893000
* ANS(    '     2 * CHAR(1),        /* Reserved, for alignment   @X0C*/ 00894000
*               2 STGESSL           /* NUMBER OF EXTENDED        @P2A*/ 00895000
*                   FIXED(31),      /* STORAGE SLOTS INSTALLED   @P2A*/ 00896000
*               2 STGSDAE           /* ADDRESS OF MODULE AND     @P4A*/ 00897000
*                   PTR(31),        /* CSECT NAME FOR DAE        @P4A*/ 00898000
*                                                                     ' 00899000
*   )SKIP;                                                              00900000
* ANS(    '     2 STGSPGPP PTR(31), /* Address of PGPER          @C4D*/ 00901000
*               2 STGSCLD PTR(31),  /* Ptr to collector data     @W3C*/ 00902000
*               2 STGSTESY CHAR(8)  /* Doubleword for termina-   @W1A*/ 00903000
*                     BDY(DWORD),   /* tion/synchronization M I  @W1A*/ 00904000
*                 3 STGSTERM        /* Termination information   @W1A*/ 00905000
*                     BIT(32),      /*                           @W1A*/ 00906000
*                   4 STGSTIP       /* Monitor I termination in  @W1A*/ 00907000
*                       BIT(1),     /*   process.                @W1A*/ 00908000
*                   4 * BIT(30),    /* Do not use this bits      @G3C*/ 00909000
*                   4 STGSATRM      /* Monitor I ABTERM 0FE      @G3A*/ 00910000
*                       BIT(1),     /*   issued by listen exit   @G3A*/ 00911000
*                 3 STGSNOEA        /* Number Of Event Arrivals  @G3C*/ 00912000
*                     FIXED(31)     /* (set in ERBMFEAR)         @W1A*/ 00913000
*                        BDY(WORD), /*    ....                   @B2C*/ 00914000
*                                                                     ' 00915000
*   )SKIP;                                                              00916000
* ANS(    '     2 STGSINTL FIXED(31),    /* Length of Monitor I         00917000
*                                      interval or zero, if Monitor I   00918000
*                                      is not active             @W5A*/ 00919000
*               2 STGSSYNV FIXED(31),    /* SYNC minute value    @W5A*/ 00920000
*               2 STGSSYNF BIT(32), /* SYNC minute flag          @W5A*/ 00921000
*                 3 STGSSYRM BIT(8),   /* SYNC(RMF) flags        @B3A*/ 00922000
*                   4 STGSSYNC BIT(1), /* SYNC(RMF) bit          @B3A*/ 00923000
*                   4 *        BIT(7), /* Reserved               @B3A*/ 00924000
*                 3 STGSSOPT FIXED(8), /* Sync option from M I          00925000
*                                      options (option constants        00926000
*                                      declared below)           @B3C*/ 00927000
*                 3 *     BIT(16),  /* Reserved                  @B3C*/ 00928000
*               2 STGSSRMC BIT(32), /* SRM command count         @W5A*/ 00929000
*               2 STGSTOKN FIXED(32), /* Resource manager token  @Y2A*/ 00930000
*                                                                     ' 00931000
*   )SKIP;                                                              00932000
* ANS(    '  /* Dynamic I/O Extension                            @A1A*/ 00933000
*            2 STGSTES3 FIXED(31)   /* Termination Synchron. for @A1A*/ 00934000
*                        BDY(WORD), /*    ....                   @B2C*/ 00935000
*              3 STGSN3EA FIXED(31), /* M III Listen Exits       @A1A*/ 00936000
*            2 STGSSLET PTR(31),    /* Pointer to Listen Exit           00937000
*                                      Event Table               @A1A*/ 00938000
*            2 STGSFIOC PTR(31),    /* Address of ERBMFIOC       @A1A*/ 00939000
*                                                                     ' 00940000
*   )SKIP;                                                              00941000
* ANS(    '                                                             00942000
*            2 STGSFBSR PTR(31),    /* Address of ERBMFBSR       @A1A*/ 00943000
*            2 STGSFLXP PTR(31),    /* Address of ERBMFLXP       @A1A*/ 00944000
*            2 STGSFSCS PTR(31),    /* Address of ERBMFSCS       @A1A*/ 00945000
*            2 STGSNFGR PTR(31),    /* Address of ERBCNFGR       @A1A*/ 00946000
*                                                                     ' 00947000
*   )SKIP;                                                              00948000
* ANS(    '  2 STGSINFL CHAR(8),    /* Initialization Processing        00949000
*                                      Flags                     @A1A*/ 00950000
*              4 STGSDCFL BIT(8),   /* Dynamic I/O update Flags  @A1A*/ 00951000
*                6 *       BIT(2),  /* reserved              @WA42945*/ 00952000
*                                                                     ' 00953000
*   )SKIP;                                                              00954000
* ANS(    '                                                             00955000
*                6 STGSIAC  BIT(1), /* Configuration has been           00956000
*                                      changed since last IPL    @A1A*/ 00957000
*                6 STGSDYNA BIT(1), /* Dynamic I/O enabled       @A1A*/ 00958000
*                6 STGSIOD  BIT(1), /* System IPLed via IODF     @A1A*/ 00959000
*                6 STGSICIV BIT(1), /* I/O Conf. Info. valid     @A1A*/ 00960000
*                6 STGSDCA BIT(1),  /* Configuration update             00961000
*                                      actually performed        @A1A*/ 00962000
*                6 STGSINHB BIT(1), /* Start of M I Device and          00963000
*                                      I/O Q_ing Option inhibit. @A1A*/ 00964000
*                                                                     ' 00965000
*   )SKIP;                                                              00966000
* ANS(    '    4 STGSCNFL BIT(8),   /* Configuration table build        00967000
*                                      flags                     @A1A*/ 00968000
*                6 STGSCNIN BIT(1), /* Init. in progress (updated       00969000
*                                      by CNFGF/CNFSR modules)   @A1A*/ 00970000
*                6 STGSCNRI BIT(1), /* Reinit. required (updated        00971000
*                                      by ERBLXDIO)              @A1A*/ 00972000
*                6 STGSCNUP BIT(1), /* Update of Conf. Tables in        00973000
*                                      Progress.                 @A1A*/ 00974000
*                6 STGSCNTR BIT(1), /* I/O Tables will be del.   @A1A*/ 00975000
*                6 *        BIT(4), /* reserved                  @A1A*/ 00976000
*                                                                     ' 00977000
*   )SKIP;                                                              00978000
* ANS(    '    4 STGSDVFL BIT(8),   /* Device Data Structure            00979000
*                                      build flags               @A1A*/ 00980000
*                6 STGSDVIN BIT(1), /* Init. in progress (updated       00981000
*                                      by ERBMFIDV)              @A1A*/ 00982000
*                6 STGSDVRI BIT(1), /* Reinit. required (updated        00983000
*                                      by ERBLXDIO)              @A1A*/ 00984000
*                6 *        BIT(1), /* Not longer used       @YA57961*/ 00985000
*                6 *        BIT(5), /* reserved                  @A1A*/ 00986000
*                                                                     ' 00987000
*   )SKIP;                                                              00988000
* ANS(    '    4 STGSIOFL BIT(8),   /* I/O Queuing Structure            00989000
*                                      build flags               @A1A*/ 00990000
*                6 STGSIOIN BIT(1), /* Init. in progress (updated       00991000
*                                      by ERBMFIOQ)              @A1A*/ 00992000
*                6 STGSIORI BIT(1), /* Reinit. required (updated        00993000
*                                      by ERBLXDIO)              @A1A*/ 00994000
*                6 *        BIT(1), /* Not longer used       @YA63501*/ 00995000
*                6 *        BIT(5), /* reserved                  @A1A*/ 00996000
*                                                                     ' 00997000
*   )SKIP;                                                              00998000
* ANS(    '    4 STGS3DFL BIT(8),   /* Monitor 3 device address         00999000
*                                      table build flags         @A1A*/ 01000000
*                6 STGS3DIN BIT(1), /* Init. in progress (updated       01001000
*                                      by ERB3GINI)              @A1A*/ 01002000
*                6 STGS3DRI BIT(1), /* Reinit. required (updated        01003000
*                                      by ERBLXDIO)              @A1A*/ 01004000
*                6 *       BIT(6),  /* reserved                  @A1A*/ 01005000
*              4 *         CHAR(3), /* reserved                  @A1A*/ 01006000
*            2 STGSUPCT FIXED(16),  /* I/O update count, used by        01007000
*                                      device and I/O queueing          01008000
*                                      data gatherer             @A1A*/ 01009000
*                                                                     ' 01010000
*   )SKIP;                                                              01011000
* ANS(    '  2 STGSICI,             /* I/O Configuration Infor-         01012000
*                                      mation Area               @A1A*/ 01013000
*              4 STGSTNM CHAR(44),  /* IODF Name of current I/O         01014000
*                                      configuration             @A1A*/ 01015000
*              4 STGSTSF CHAR(2),   /* Suffix of IODF Name       @A1A*/ 01016000
*              4 STGSTSX CHAR(2),   /* Suffix set by EAX         @A1A*/ 01017000
*                                                                     ' 01018000
*   )SKIP;                                                              01019000
* ANS(    '                                                             01020000
*              4 STGSTOK CHAR(16),  /* Partially Token Info.     @A1A*/ 01021000
*                6 STGSTDT CHAR(8), /* IODF creation date        @A1A*/ 01022000
*                6 STGSTTM CHAR(8), /* IODF creation time        @A1A*/ 01023000
*            2 STGSTY1 CHAR(2),     /* First two bytes of IODF creation 01024000
*                                      date YYyy/mm/dd           @G4C*/ 01025000
*            2 STGSENF   BIT(32)    /* ENF Signal Lock Word      @B2C*/ 01026000
*                        BDY(WORD), /*    ....                   @B2C*/ 01027000
*              4 STGSDCS BIT(1),    /* Dynamic I/O change flag          01028000
*                                      (Signal 31/ERBLXDCS)      @B2M*/ 01029000
*              4 STGSDIO BIT(1),    /* Dynamic I/O change complete      01030000
*                                      flag (Signal 32/ERBLXDIO) @B2M*/ 01031000
*              4 *       BIT(30),   /* reserved                  @B2C*/ 01032000
*            2 *       CHAR(1),     /* Reserved              @WA04821*/ 01033000
*              4 STGSIZZA BIT(1),   /* Monitor I initialization         01034000
*                                      ERBMFIZZ is active for the       01035000
*                                      first time.               @B1A*/ 01036000
*              4 *       BIT(7),    /* Reserved              @WA04821*/ 01037000
*                                                                     ' 01038000
*   )SKIP;                                                              01039000
* ANS(    '                                                             01040000
*            2 STGSCHFL BIT(8),     /* CHSC support flags    @WA04821*/ 01041000
*              4 STGSCSCL BIT(1),   /* 1 = Store Channel Path Link      01042000
*                                      Address not supported @WA04821*/ 01043000
*              4 STGSCSSL BIT(1),   /* 1 = Store Subchannel Link        01044000
*                                      Address not supported @WA04821*/ 01045000
*              4 STGSCSSC BIT(1),   /* 1 = Store Subchannel Control     01046000
*                                      Unit Data not supported          01047000
*                                                            @WA04821*/ 01048000
*              4 STGSCSPQ BIT(1),   /* 1 = Store Primary Queue Data     01049000
*                                      not supported         @WA04821*/ 01050000
*              4 STGSCSSQ BIT(1),   /* 1 = Store Secondary Queue Data   01051000
*                                      not supported         @WA04821*/ 01052000
*              4 * BIT(3),          /* Reserved              @WA04821*/ 01053000
*            2 *        CHAR(2),    /* CHSC command code     @WA04821*/ 01054000
*                                                                     ' 01055000
*   )SKIP;                                                              01056000
* ANS(    '                                                             01057000
*            2 * ,                  /* Reserved                  @B1A*/ 01058000
*              4 *        PTR(31),  /* Reserved (was STGSEADT)   @C4C*/ 01059000
*              4 *        PTR(31),  /* Reserved (was STGSEACL)   @C4C*/ 01060000
*              4 *        PTR(31),  /* Reserved (was STGSEAIZ)   @C4C*/ 01061000
*              4 *        PTR(31),  /* Reserved (was STGSIRAS)   @C4C*/ 01062000
*            2 STGSCCC    BIT(32),  /* Cache configuration control      01063000
*                                                            @WA42945*/ 01064000
*              4 STGSCCCF BIT(8),   /* Cache configuration change flags 01065000
*                                      set by listen exits via CS       01066000
*                                                            @WA42945*/ 01067000
*                6 STGSCDY1 BIT(1), /* DYN I/O update, CACHE for M1     01068000
*                                      (renamed and moved STGSDYN)      01069000
*                                                            @WA42945*/ 01070000
*                6 STGSCDY3 BIT(1), /* Dyn I/O update, Cache for M3     01071000
*                                                            @WA42945*/ 01072000
*                6 STGSCDV1 BIT(1), /* Device now online, M1 @WA42945*/ 01073000
*                6 STGSCDV3 BIT(1), /* Device now online, M3 @WA42945*/ 01074000
*                6 *        BIT(4), /* Reserved              @WA42945*/ 01075000
*              4 *        BIT(24),  /* Reserved for cache    @WA42945*/ 01076000
*                                                                     ' 01077000
*   )SKIP;                                                              01078000
* ANS(    '  /* Extension for Synchronize Measurements           @B3A*/ 01079000
*            2 STGSSYME,            /* Synchronize Measurements  @B3A*/ 01080000
*              4 STGSSCCE FIXED(32),/* ECB to communicate SMF           01081000
*                                      interval end from SMF listen     01082000
*                                      exit to interval control  @B3A*/ 01083000
*              4 STGSMFIE CHAR(8),  /* GMT SMF interval expiration      01084000
*                                      token - STCK format       @B3A*/ 01085000
*                                                                       01086000
*                                                                       01087000
*              4 STGSDCNE FIXED(32),/* ECB to communicate Monitor I     01088000
*                                      (in)active to interval control   01089000
*                                      module                    @B3A*/ 01090000
*              4 STGSCDIE FIXED(32),/* ECB for communicating            01091000
*                                      interval end from Interval       01092000
*                                      control module to M I     @B3A*/ 01093000
*              4 * CHAR(36),        /* Reserved-was STGSLI       @C3A*/ 01094000
*              4 * CHAR(36),        /* Reserved-was STGSCI       @C3A*/ 01095000
*                                   /* 32 Lines deleted        32@C3D*/ 01096000
*                                                                     ' 01097000
*   )SKIP;                                                              01098000
* ANS(    '                                                             01099000
*              4 STGS1I BDY(WORD),  /* Information about last           01100000
*                                      Monitor I interval        @B3A*/ 01101000
*                6 STGS1IET CHAR(8),/* M I interval expiration time     01102000
*                                      token                     @B3A*/ 01103000
*                6 STGS1FLA BIT(32),/* M I interval flag bits    @B3A*/ 01104000
*                 7 STGS1ISC BIT(1),/* M I interval was completely      01105000
*                                      under SMF control         @B3A*/ 01106000
*                 7 *       BIT(31),/* Reserved                  @B3A*/ 01107000
*                                                                     ' 01108000
*   )SKIP;                                                              01109000
* ANS(    '                                                             01110000
*              4 STGSLSMF BIT(8),   /* SMF Listen exit flags     @C3C*/ 01111000
*                6 STGSLXSI BIT(1), /* Listen exit set inactive         01112000
*                                      (in case of error)        @B3A*/ 01113000
*                6 STGSLSMI BIT(1), /* SMF has signalled                01114000
*                                      inactive                  @B3A*/ 01115000
*                6 *        BIT(6), /* Reserved                  @B3A*/ 01116000
*                                                                     ' 01117000
*   )SKIP;                                                              01118000
* ANS(    '  /* Information about RMF address space              @C2A*/ 01119000
*              4 STGSGRMF                                               01120000
*                  BOUNDARY(WORD,2),/* Info RMF address space    @C2A*/ 01121000
*                6 STGSGFLG BIT(8), /* RMF global Bits           @C3A*/ 01122000
*                 7 STGSGTER BIT(1),/* RMF is terminating(P RMF) @E1M*/ 01123000
*                 7 STGSATER BIT(1),/* RMF abnorm. terminating   @E1A*/ 01124000
*                 7 STGSNEGP BIT(1),/* No ENQ contention data due to    01125000
*                                      GRS system problems   @WA20587*/ 01126000
*                 7 * BIT(5),       /* Reserved              @WA20587*/ 01127000
*                6 STGSRREL BIT(16),/* Release of RMF            @C3A*/ 01128000
*                6 *      FIXED(32),/* Reserved (was STGSEOIC)   @C3A*/ 01129000
*                6 STGSASCP POINTER,/* Pointer to RMFs  own             01130000
*                                      ASCB control block               01131000
*                                      (0, if RMF inactive)      @B3A*/ 01132000
*                6 STGSSTTI CHAR(8),/* Starttime of RMF control         01133000
*                                      address space, taken from        01134000
*                                      ASCBINTS field                   01135000
*                                      (0, if RMF inactive)      @B3A*/ 01136000
*                6 STGRMFST CHAR(8),/* RMF Address Space Space Token    01137000
*                                                                @C2A*/ 01138000
*            /* RMF Sysplex Data Server                          @C1A*/ 01139000
*              4 STGSDSGD PTR(31),  /* RMF Sysplex Data Server          01140000
*                                      Global Data Block (DSGDB) @C1A*/ 01141000
*                                                                     ' 01142000
*   )SKIP;                                                              01143000
* ANS(    '  /* Extended Synchronization information             @C3A*/ 01144000
*              4 STGSESYN,          /* Extended Sync info block  @C3A*/ 01145000
*               5 STGSELI,          /* Last interval information @C3A*/ 01146000
*                6 STGSLIST CHAR(8),/* GMT Start time (STCK format)     01147000
*                                      of last interval          @C3M*/ 01148000
*                6 STGSLTZ  CHAR(8),/* Time zone offset (TOD format):   01149000
*                                      local time-GMT time              01150000
*                                      of last interval          @C3M*/ 01151000
*                6 STGSLILN CHAR(8),/* Actual intvl-len (TOD-format)    01152000
*                                      of last interval          @C3M*/ 01153000
*                6 STGSLIET CHAR(8),/* Interval expiration token        01154000
*                                      of last interval          @C3M*/ 01155000
*                6 STGSLFLA BIT(32),/* Flag bits                        01156000
*                                      of last interval          @C3M*/ 01157000
*                 7 STGSLIES BIT(1),/* "Ended under SMF control" bit    01158000
*                                      of last interval          @C3M*/ 01159000
*                 7 *       BIT(31),/* Reserved                  @C3M*/ 01160000
*                6 STGSLPET CHAR(8),/* Projected end time(STCK format)  01161000
*                                      of last interval          @C3A*/ 01162000
*                6 STGSLOIL FIXED(31),/* Interval length parameter(sec) 01163000
*                                      of last interval          @C3A*/ 01164000
*                6 STGSLSYN FIXED(31),/* Sync value parameter (sec)     01165000
*                                      of last interval          @C3A*/ 01166000
*                6 STGSLICT FIXED(31),/* Interval counter               01167000
*                                      of last interval          @C3A*/ 01168000
*                6 STGSLTRA POINTER,/* Trace table pointer       @C3A*/ 01169000
*                6 * CHAR(12),      /* Reserved area                    01170000
*                                      of last interval          @C3A*/ 01171000
*                                                                     ' 01172000
*   )SKIP;                                                              01173000
* ANS(    '     5 STGSECI,          /* CURR interval information @C3A*/ 01174000
*                6 STGSCIST CHAR(8),/* GMT Start time (STCK format)     01175000
*                                      of current interval       @C3M*/ 01176000
*                6 STGSCTZ  CHAR(8),/* Time zone offset (TOD format):   01177000
*                                      local time-GMT time              01178000
*                                      of current interval       @C3M*/ 01179000
*                6 STGSCILN CHAR(8),/* Actual intvl-len (TOD-format)    01180000
*                                      of current interval       @C3M*/ 01181000
*                6 STGSCIET CHAR(8),/* Interval expiration token        01182000
*                                      of current interval       @C3M*/ 01183000
*                6 STGSCFLA BIT(32),/* Flag bits                        01184000
*                                      of current interval       @C3M*/ 01185000
*                 7 STGSCIES BIT(1),/* "Ended under SMF control" bit    01186000
*                                      of current interval       @C3M*/ 01187000
*                 7 *       BIT(31),/* Reserved                  @C3M*/ 01188000
*                6 STGSCPET CHAR(8),/* Projected end time(STCK format)  01189000
*                                      of current interval       @C3A*/ 01190000
*                6 STGSCOIL FIXED(31),/* Interval length parameter(sec) 01191000
*                                      of current interval       @C3A*/ 01192000
*                6 STGSCSYN FIXED(31),/* Sync value parameter (sec)     01193000
*                                      of current interval       @C3A*/ 01194000
*                6 STGSCICT FIXED(31),/* Interval counter               01195000
*                                      of current interval       @C3A*/ 01196000
*                6 STGSCTRA POINTER,/* Trace table pointer       @C3A*/ 01197000
*                6 * CHAR(12),      /* Reserved area                    01198000
*                                      of current interval       @C3A*/ 01199000
*                                                                     ' 01200000
*   )SKIP;                                                              01201000
* ANS(    '    4 STGSE1I,           /* Extended SYNC information        01202000
*                                      for Monitor I             @C3A*/ 01203000
*               5 STGS1PET CHAR(8), /* Projected end time(STCK format)  01204000
*                                      of last M I interval      @C3A*/ 01205000
*               5 STGS1OIL FIXED(31),/* Interval length parameter(sec)  01206000
*                                      of last M I interval      @C3A*/ 01207000
*               5 STGS1SYN FIXED(31),/* Sync value parameter (sec)      01208000
*                                      of last M I interval      @C3A*/ 01209000
*               5 STGS1TZ  CHAR(8),  /* Time zone offset (TOD format):  01210000
*                                      local time-GMT time              01211000
*                                      of last M I interval      @C3M*/ 01212000
*                                                                     ' 01213000
*   )SKIP;                                                              01214000
* ANS(    '  /* WLM/SRM Support                                  @C2A*/ 01215000
*              4 STGWLMEX,          /* WLM/SRM Extension         @C2A*/ 01216000
*                6 STGWPCTA FIXED(31),/* Token for program call entry   01217000
*                                      tables of RMF CommServ    @C2A*/ 01218000
*                6 STGWLPSL FIXED(31),/* PC number "SaveListenExitRCAA" 01219000
*                                                                @C2A*/ 01220000
*                6 STGM2PCI FIXED(31),/* Monitor II PC-call      @E3C*/ 01221000
*                6 * FIXED(31),     /* PC number reserved        @C2A*/ 01222000
*                6 STGWCSAR POINTER,/* Pointer to CS info area   @C2A*/ 01223000
*                6 STGWLXCE FIXED(31),/* ECB to communicate SRM/WLM     01224000
*                                     "change complete" to MFCLS @C2A*/ 01225000
*                6 STGWLXFL BIT(32),/* WLM/SRM Listen Exit flags @C2A*/ 01226000
*                 7 STGWLXIP BIT(1),/* Listen exit in progress   @C2A*/ 01227000
*                 7 STGWLXWI BIT(1),/* WLM Listen exit inoper.   @C2A*/ 01228000
*                 7 STGWLXSI BIT(1),/* SRM Listen exit inoper.   @C2A*/ 01229000
*                 7 * BIT(29),      /* Reserved                  @C2A*/ 01230000
*                6 * CHAR(8),       /* Reserved for WLM/SRM      @C2A*/ 01231000
*                                                                     ' 01232000
*   )SKIP;                                                              01233000
* ANS(    '                                                             01234000
*             4  STGSLXAR BDY(WORD),/* Linkage index (LX) area.         01235000
                                       This area is not cleared         01236000
                                       when RMF is restarted     @C5A*/ 01237000
*              6 STGSLXFL  BIT(32), /* LX area flags             @C5A*/ 01238000
*                8 STGSLXIN BIT(1),  /* ON = LX values are valid @C5A*/ 01239000
*                8 *        BIT(31), /* reserved.                @C5A*/ 01240000
*              6 STGSLXV1  FIXED(32),/* LX value1. Valid if             01241000
                                        STGSLXIN = ON. Used for         01242000
                                        Data Server.             @C5A*/ 01243000
*              6 STGSLXV2  FIXED(32),/* LX value 2. Valid if            01244000
*                                        STGSLXIN = ON. Used for        01245000
                                         WLM support             @C5A*/ 01246000
*            2 STGSFRRP PTR(31),    /* pointer to FRR extension used    01247000
                                       by cycle gatherers and ERBMFEVT  01248000
                                                             @WA13001*/ 01249000
*                                   /* 1 line deleted        @WA04821*/ 01250000
*            2 STGSPDGA POINTER,    /* Pointer to DG info area   @D1A*/ 01251000
*            2 STGSFRSA CHAR(32),   /* Floating Pt Reg Save Area @D1A*/ 01252000
*            2 STGSCNFX PTR(31),    /* Address of ERBCNFGR/V @WA12872*/ 01253000
*            2 STGSEQHP PTR(31),    /* Address of EEQHD          @E1A*/ 01254000
*            2 STGGLXDW BDY(DWORD), /* GRS listen exit control,         01255000
*                                      updated via CDS           @E1A*/ 01256000
*              4 STGGLXAC FIXED(32),/* Concurrent active count   @E1A*/ 01257000
*              4 STGGLXUC FIXED(32),/* Update count              @E1A*/ 01258000
*            2 STGSLSTT CHAR(8),    /* Latch set token for RMF   @E1A*/ 01259000
*            2 STGCERST CHAR(8),    /* STOKEN of ENQ DS          @E1A*/ 01260000
*            2 STGCERPT PTR(31),    /* Address of repository hdr @E1A*/ 01261000
*            2 STGSEQDS CHAR(20) BDY(WORD), /* Data space DSPLIST       01262000
*                                      area                      @E1A*/ 01263000
*            2 STGSEDIF CHAR(10),   /* OS/390 Enable/Disable inf @E2A*/ 01264000
*              5 STGSEDSF BIT(8),   /* Enable/Disable status     @E2A*/ 01265000
*                7 STGSEDEN BIT(1), /* =1, RMF is enabled        @E2A*/ 01266000
*                7 STGSEDDR BIT(1), /* =1, Deregister is required@E2A*/ 01267000
*                7 * BIT(6),        /* Reserved                  @E2A*/ 01268000
*              5 * CHAR(1),         /* Reserved                  @E2A*/ 01269000
*              5 STGSEDTK CHAR(8),  /* Enable/Disable token      @E2A*/ 01270000
*            2 STGSDSFL BIT(8),     /* Dataserver status         @G1A*/ 01271000
*              5 STGSDSMS BIT(1),   /* = 1, RMF master           @G1A*/ 01272000
*              5 *        BIT(7),   /* Reserved                  @G1A*/ 01273000
*            2 * CHAR(1),           /* Reserved                  @G1C*/ 01274000
*            2 STG1RTYP POINTER,    /* Ptr to 1. DS RTY/STY list @F1A*/ 01275000
*            2 STG2RTYP POINTER,    /* Ptr to 2. DS RTY/STY list @F1A*/ 01276000
*            2 STGSFCD PTR(31),     /* Ptr to FCD data area      @I1A*/ 01277000
*            2 STGSFCDS PTR(31),    /* Ptr to FCD NMBR/EXNMBR           01278000
*                                      selection table           @I1A*/ 01279000
*            2 STGSE33P PTR(31),    /* Ptr to ERBMFE33 listen exit      01280290
*                                                            @WA46171*/ 01280580
*            2 STGSIZSS CHAR(8)                                         01281000
*                  BDY(DWORD),      /* Save field for ERBMFIZS   @I1A*/ 01282000
*            2 STGSRESV CHAR(40);   /* Reserved                  @I1C*/ 01283000
*                                                                     ' 01284000
*   )SKIP;                                                              01285000
* ANS(    '                                                             01286000
*             DECLARE (             /* Constants for STGSSOPT    @B3A*/ 01287000
*              STGSSNOP CONSTANT(0),/* No M I options active     @B3A*/ 01288000
*              STGSSSMF CONSTANT(1),/* SYNC(SMF) or M I down     @B3A*/ 01289000
*              STGSSRNO CONSTANT(2),/* NOSYNC                    @B3A*/ 01290000
*              STGSSRMF CONSTANT(3) /* SYNC(RMF,nn)              @B3A*/ 01291000
*              ) FIXED(8);          /*                           @B3A*/ 01292000
*                                                                     ' 01293000
*   )SKIP;                                                              01294000
* ANS(    '                                                             01295000
*             DECLARE               /* STGST Version for HRM5530 @E1C*/ 01296000
*              STGCVER  CONSTANT(''02''X) BIT(8);                       01297000
*             DECLARE               /* STGCSFLG constants    @YA56222*/ 01298000
*              SET_STGCSSRB CONSTANT(''80000000''X) BIT(32),            01299000
*                                   /* SRB routine running   @YA56222*/ 01300000
*              SET_STGCSTER CONSTANT(''40000000''X) BIT(32),            01301000
*                                   /* Termination activated @YA56222*/ 01302000
*              SET_STGCSNSR CONSTANT(''20000000''X) BIT(32),            01303000
*                                   /* no running SRB routine expected  01304000
*                                                            @YA56222*/ 01305000
*              SET_STGCSSNC CONSTANT(''10000000''X) BIT(32),            01306000
*                                   /* SRB has been scheduled and has   01307000
*                                      not yet completed execution      01308000
*                                                            @YA56222*/ 01309000
*              RESET_STGCSSRB CONSTANT(''7FFFFFFF''X) BIT(32),          01310000
*                                   /*no SRB routine running @YA56222*/ 01311000
*              RESET_STGCSSNC CONSTANT(''EFFFFFFF''X) BIT(32);          01312000
*                                   /* no SRB routine scheduled         01313000
*                                                            @YA56222*/ 01314000
*                                                                     ' 01315000
*   )SKIP;                                                              01316000
* ANS(    '                                                             01317000
*             DECLARE               /* Constants to serialize RMF       01318000
*                                      control and Mon. III  @WA29318*/ 01319000
*              ENQ_SER_QNAME_CC CHAR(8)                                 01320000
*                   CONSTANT(''SYSZERB ''), /* Queue name for ENQ/DEQ   01321000
*                                      serialization of access to       01322000
*                                      ERBENQDS queues       @WA29318*/ 01323000
*              ENQ_SER_RNAME_CC CHAR(17)                                01324000
*                   CONSTANT(''ENQ.SERIAL.RMF&M3''), /*                 01325000
*                                      Resource name for ENQ/DEQ        01326000
*                                      serialization of access to       01327000
*                                      ERBENQDS queues       @WA29318*/ 01328000
*                                                                       01329000
*              DIO_SER_RNAME_CC CHAR(19)                                01330000
*                   CONSTANT(''DIO.SERIAL.RMFDYNIO''); /*               01331000
*                                      Resource name to serialize RMF   01332000
*                                      control table update caused by   01333000
*                                      Dynamic I/O Configuration change 01334000
*                                                                @G3A*/ 01335000
*                                                                     ' 01336000
*   )SKIP;                                                              01337000
*  %END;                                                                01338000
