*/*                                                       */            00002200
*/*PROPRIETARY V3 STATEMENT                               */            00004400
*/*LICENSED MATERIALS - PROPERTY OF IBM                   */            00006600
*/*"RESTRICTED MATERIALS OF IBM"                          */            00008800
*/*5695-DF1                                               */            00011000
*/*(C) COPYRIGHT 1992  IBM CORP.                          */            00013200
*/*END PROPRIETARY V3 STATEMENT                           */            00016600
         MACRO                                                          00020000
&NAME    FREEBUF &DCB,&REG,&DUMMY=                                      00030000
         LCLB  &NOGO                                                    00040000
.* CHANGE ACTIVITY                                                      00046600
.*$L1=31BIT,JDZ1110,,SJPLRK:  31-BIT CALLER SUPPORT               @L1A  00053200
         AIF   ('&DCB' EQ '').E1                                        00060000
.R1      AIF   ('&REG' EQ '').E2                                        00080000
.R2      AIF   ('&REG(1)' EQ '0').E3                                    00100000
         AIF   ('&REG(1)' EQ '1' OR '&REG(1)' EQ '14').E3               00120000
         AIF   (&NOGO EQ 1).TERM                                        00130000
&NAME    IHBINNRA &DCB                                                  00140000
         SLR   14,14                                              @L1A  00153300
         ICM   14,7,21(1)                        LOAD BUFCB ADDR  @L1C  00166600
         MVC   0(4,&REG(1)),0(14)                ATTACH BUFFER TO CHAIN 00180000
         ST    &REG(1),0(0,14)                   PUT BUF ADDR IN BUFCB  00200000
         MEXIT                                                          00220000
.E1      IHBERMAC 06                                                    00240000
&NOGO    SETB  1                                                        00250000
         AGO   .R1                                                      00260000
.E2      IHBERMAC 18                                                    00280000
&NOGO    SETB  1                                                        00290000
         AGO   .R2                                                      00300000
.E3      IHBERMAC 37,,&REG                                              00320000
.TERM    MEND                                                           40320000
