*/********************************************************************/ 00001000
*/*                                                                  */ 00002000
*/*  MAPPING OF GTA FILES USED BY LCI PROCESSING                     */ 00003000
*/*                                                                  */ 00004000
*/*  MACRO VARIABLES:                                                */ 00005000
*/*             LCI_DSECT -- WHEN SET TO 'NO' THE MAPPINGS           */ 00006000
*/*                          ARE EXPANDED AS SIMPLE STRUCTURES       */ 00007000
*/*                          OTHERWISE THEY ARE EXPANDED AS          */ 00008000
*/*                          BASED STRUCTURES                        */ 00009000
*/*             LCI1_BASE -- SET TO BASING EXPRESSION FOR THE        */ 00010000
*/*                          LCI1REC STRUCTURE. IF THIS IS NOT       */ 00011000
*/*                          SET, LCI1REC USES 'CCALCI1P->GTPBUFAD'  */ 00012000
*/*                          AS ITS BASING EXPRESSION                */ 00013000
*/*             LCI2_BASE -- SET TO BASING EXPRESSION FOR THE        */ 00014000
*/*                          LCI2REC STRUCTURE. IF THIS IS NOT       */ 00015000
*/*                          SET, LCI2REC USES 'CCALCI2P->GTPBUFAD'  */ 00016000
*/*                          AS ITS BASING EXPRESSION                */ 00017000
*/*             LCI3_BASE -- SET TO BASING EXPRESSION FOR THE        */ 00018000
*/*                          LCI3REC STRUCTURE. IF THIS IS NOT       */ 00019000
*/*                          SET, LCI3REC USES 'CCALCI3P->GTPBUFAD'  */ 00020000
*/*                          AS ITS BASING EXPRESSION                */ 00021000
*/*             LCI4_BASE -- SET TO BASING EXPRESSION FOR THE        */ 00022000
*/*                          LCI4REC STRUCTURE. IF THIS IS NOT       */ 00023000
*/*                          SET, LCI4REC USES 'CCALCI4P->GTPBUFAD'  */ 00024000
*/*                          AS ITS BASING EXPRESSION                */ 00025000
*/*             LCIX_ATTR -- SET TO BASING EXPRESSION FOR THE        */ 00026000
*/*                          CCALCIEXT STRUCTURE. IF THIS IS NOT     */ 00027000
*/*                          SET, CCALCIEXT USES 'CCALCIPT'          */ 00028000
*/*                          AS ITS BASING EXPRESSION                */ 00029000
*/*                                                                  */ 00030000
*/*                                                                  */ 00031000
*/********************************************************************/ 00032000
*/*                                                                  */ 00033000
*/* ---------------------------------------------------------------- */ 00034000
*/* FLAG REASON  RELEASE   DATE   ORG  DESCRIPTION                   */ 00035000
*/* ---- ------- ------- -------- ---  ----------------------------- */ 00036000
*/* $L0= LCI001B  1B.00  12/09/96 MUD: LCI SUPPORT                   */ 00037000
*/* $P1= PUH0064  1B.00  04/23/97 MUD: LCI IN-PROCESS PROBLEM        */ 00038000
*/* $P2= PUH0090  1B.00  05/23/97 MUD: LCI IN-PROCESS PROBLEM WITH   */ 00039000
*/*                                     MULTIPLE MOVES               */ 00040000
*/* $L1= SSS0027  27.00  03/02/98 MUD: SHELL SCRIPT SUPPORT          */ 00041000
*/* $L2= SLS0027  27.00  07/03/98  RA: SYMBOLIC LINK SUPPORT         */ 00042000
*/*                                                                  */ 00043000
*/********************************************************************/ 00044000
*/*   CHANGE FLAG KEY: M@PNC                                         */ 00045000
*/*   WHERE:                                                         */ 00046000
*/*                                                                  */ 00047000
*/* M= MULTIPLE    P= DCRS = D,E,F,G    N= 0-9,A-Z     C= A = ADD    */ 00048000
*/*    FOR DELETE     RMPS = H,I,J,K    (USE '0' ONLY     C = CHANGE */ 00049000
*/*    FLAGS ONLY     LINE = L,M,N,O     WHEN ELEMENT     P = COPY   */ 00050000
*/*                   PTMS = P,Q,R,S     IS BEING         M = MOVE   */ 00051000
*/*                   APARS = 0-9        CREATED)         D = DELETE */ 00052000
*/********************************************************************/ 00053000
*     %IF LCI_DSECT = 'NO'          /*                               */ 00054000
*       %THEN                       /*                               */ 00055000
*        %DO;                       /*                               */ 00056000
*          %LCI1ATTR = ' ';         /*                               */ 00057000
*          %LCI2ATTR = ' ';         /*                               */ 00058000
*          %LCI3ATTR = ' ';         /*                           @P1A*/ 00059000
*          %LCI4ATTR = ' ';         /*                           @L1A*/ 00060000
*          %LCIXATTR = ' ';         /*                           @L1A*/ 00061000
*        %END;                      /*                               */ 00062000
*     %ELSE                         /*                               */ 00063000
*        %DO;                       /*                               */ 00064000
*          %IF LCIX_ATTR ^= ' '     /*                           @L1A*/ 00065000
*            %THEN                  /*                           @L1A*/ 00066000
*              %LCIXATTR = LCIX_ATTR; /*                         @L1A*/ 00067000
*          %ELSE                          /*                     @L1A*/ 00068000
*              %LCIXATTR = 'BASED(CCALCIPT)'; /*                 @L1A*/ 00069000
*          %IF LCI1_BASE ^= ' '     /*                               */ 00070000
*            %THEN                  /*                               */ 00071000
*              %LCI1ATTR = LCI1_BASE; /*                             */ 00072000
*          %ELSE                    /*                               */ 00073000
*              %LCI1ATTR = 'BASED(CCALCI1P->GTPBUFAD)';/*            */ 00074000
*          %IF LCI2_BASE ^= ' '     /*                               */ 00075000
*            %THEN                  /*                               */ 00076000
*              %LCI2ATTR = LCI2_BASE; /*                             */ 00077000
*          %ELSE                    /*                               */ 00078000
*              %LCI2ATTR = 'BASED(CCALCI2P->GTPBUFAD)';/*            */ 00079000
*          %IF LCI3_BASE ^= ' '     /*                           @P1A*/ 00080000
*            %THEN                  /*                           @P1A*/ 00081000
*              %LCI3ATTR = LCI3_BASE; /*                         @P1A*/ 00082000
*          %ELSE                    /*                           @P1A*/ 00083000
*              %LCI3ATTR = 'BASED(CCALCI3P->GTPBUFAD)';/*        @P1A*/ 00084000
*          %IF LCI4_BASE ^= ' '     /*                           @L1A*/ 00085000
*            %THEN                  /*                           @L1A*/ 00086000
*              %LCI4ATTR = LCI4_BASE; /*                         @L1A*/ 00087000
*          %ELSE                    /*                           @L1A*/ 00088000
*              %LCI4ATTR = 'BASED(CCALCI4P->GTPBUFAD)';/*        @L1A*/ 00089000
*        %END;                      /*                               */ 00090000
*                                                                       00091000
*       DECLARE                                                         00092000
*        1 CCALCIEXT LCIXATTR,      /*  CCA LCI EXTENSION DATA   @L1A*/ 00093000
*          3 CCALCIGTPS,            /*  GTP ADDRESSES            @L1A*/ 00094000
*            5 CCALCI1P PTR(31),    /*  LCI ELEMENT/ALIAS GTP @  @L1A*/ 00095000
*            5 CCALCI2P PTR(31),    /*  LCI DDNAME GTP @         @L1A*/ 00096000
*            5 CCALCI3P PTR(31),    /*  LCI NEW ELEMENT GTP @    @L1A*/ 00097000
*            5 CCALCI4P PTR(31);    /*  LCI HFS/SHELL GTP @      @L1A*/ 00098000
*                                                                       00099000
*       DECLARE                     /*                               */ 00100000
*         1 LCI1REC LCI1ATTR BDY(HWORD),/* LCI ELEMENT/ALIAS RECORD  */ 00101000
*           3 LCI1KEY,              /* RECORD KEY                    */ 00102000
*             5 LCI1TYPE FIXED(16), /* ELEMENT TYPE                  */ 00103000
*             5 LCI1ELNM CHAR(8),   /* ELEMENT NAME                  */ 00104000
*             5 LCI1ALNM CHAR(64),  /* ALIAS NAME                    */ 00105000
*               7 LCI1SYMLNK@ PTR(31) BDY(BYTE),/* SYMLINK CHN   @L2A*/ 00106000
*             5 LCI1LIB  CHAR(8),   /* LIBRARY DDNAME                */ 00107000
*             5 LCI1OTYP FIXED(16), /* OWNING ELEMENT TYPE           */ 00108000
*           3 LCI1NKEY,             /* NON-KEY FIELDS                */ 00109000
*             5 LCI1ACTN FIXED(8),  /* ACTION TYPE               @P1C*/ 00110000
*             5 LCI1FLGS BIT(8),    /*                           @P1A*/ 00111000
*               7 LCI1SKIP BIT(1),  /* SKIP THIS RECORD          @P1A*/ 00112000
*               7 * BIT(2),         /* RESERVED FOR COMPATIBILTY WITH   00113000
*                                       LCI4REC MAPPING          @L1A*/ 00114000
*               7 LCI1ONE BIT(1),   /* RCD IS FOR ONE SYMLINK -- DO NOT 00115000
*                                      TRAVERSE CHAIN            @L2A*/ 00116000
*               7 * BIT(4),         /*                           @L2C*/ 00117000
*             5 LCI1SEQ# FIXED(31) BDY(BYTE); /* LCI SEQUENCE #  @L1A*/ 00118000
*                                                                       00119000
*                                                                       00120000
*/* CONSTANTS FOR VALID VALUES FOR LCI1ACTN                          */ 00121000
*      DECLARE                                                          00122000
*           LCIACTUPD FIXED(8) CONSTANT(1), /*                       */ 00123000
*           LCIACTDEL FIXED(8) CONSTANT(2); /*                       */ 00124000
*                                                                       00125000
*/********************************************************************/ 00126000
*/* CONSTANTS FOR VALID VALUES FOR LCI1TYPE                          */ 00127000
*/*   ALL IOP ELEMENT TYPES AND IOPLMD ARE VALID VALUES              */ 00128000
*/*   AND ALSO THE FOLLOWING DEFINED CONSTANTS                       */ 00129000
*/********************************************************************/ 00130000
*                                                                       00131000
*      DECLARE                                                          00132000
*                                                                       00133000
*         /* FOR A SIDEDECK ELEMENT                                  */ 00134000
*         LCI1SDECK FIXED(16) CONSTANT('0DB0'X), /* THIS IS EQUIVALENT  00135000
*                                                  TO THE RELATIONSHIP  00136000
*                                                  VALUE SDCKLIB@     */00137000
*         /* FOR AN ALIAS TYPE                                        */00138000
*         LCI1ALIAS FIXED(16) CONSTANT('FEFE'X), /* SET TO HIGH VALUE   00139000
*                                                   TO PUT ALIASES AT   00140000
*                                                   END OF GTA FILE  */ 00141000
*         /* FOR A SYMLINK TYPE                                   @L2A*/00142000
*         LCI1SYMLINK FIXED(16) CONSTANT('FEFF'X); /* SET TO HIGH VALUE 00143000
*                                                   TO PUT SYMLINKS AT  00144000
*                                                   END OF GTA FILE.    00145000
*                                                   NOTE, THIS CONSTANT 00146000
*                                                   MAY BE USED TO SET  00147000
*                                                   FIELD LCI1TYPE OR   00148000
*                                                   LCI4TYPE      @L2A*/00149000
*                                                                       00150000
*       DECLARE                     /*                               */ 00151000
*         1 LCI2REC LCI2ATTR,       /* LCI LIBRARY DDNAME RECORD     */ 00152000
*           3 LCI2KEY,              /* RECORD KEY                    */ 00153000
*             5 LCI2ZON CHAR(7),    /* DDNAME'S ZONE (BLANK FOR SET TO  00154000
*                                           ZONE)                    */ 00155000
*             5 LCI2DDNM CHAR(8),   /* DDNAME                        */ 00156000
*           3 LCI2NKEY,             /* NON-KEY FIELDS                */ 00157000
*             5 LCI2FLGS BIT(8),    /* FLAGS                         */ 00158000
*               7 LCI2PATH BIT(1),  /* DD IS ALLOCATED TO A PATH     */ 00159000
*               7 LCI2INCL BIT(1),  /* INCLUDE IN LCI RECORDS    @P1A*/ 00160000
*               7 * BIT(6);         /* UNUSED                    @P1C*/ 00161000
*                                                                       00162000
*                                                                       00163000
*       DECLARE                     /*                           @P1A*/ 00164000
*         1 LCI3REC LCI3ATTR,       /* LCI NEW ELEMENT RECORD    @P1A*/ 00165000
*           3 LCI3KEY,              /* RECORD KEY                @P1A*/ 00166000
*             5 LCI3TYP FIXED(16),  /* TYPE OF ELEMENT OR LMOD   @P1A*/ 00167000
*             5 LCI3NAME CHAR(8),   /* ELEMENT NAME              @P1A*/ 00168000
*             5 LCI3SLIB CHAR(8),   /* SYSLIB NAME OR BLANK      @P2A*/ 00169000
*           3 LCI3NKEY,             /* NON-KEY FIELDS            @P1A*/ 00170000
*             5 LCI3OLDNM CHAR(8);  /* OLD NAME IF NEW DUE TO ++RENAME  00171000
*                                                                @P1A*/ 00172000
*                                                                       00173000
*       DECLARE                     /*                               */ 00174000
*         1 LCI4REC LCI4ATTR BDY(WORD), /* LCI HFS/SHSCRIPT REC  @L1A*/ 00175000
*           3 LCI4KEY,              /* RECORD KEY                @L1A*/ 00176000
*             5 LCI4STYP FIXED(16), /* SORTING TYPE CONTAINS:           00177000
*                                      '0000'X FOR ELEMENTS/LMODS       00178000
*                                      'FEFE'X FOR ALIASES       @L1A*/ 00179000
*             5 LCI4SEQ# FIXED(31) BDY(WORD,3), /*  LCI SEQUENCE        00180000
*                                                       NUMBER   @L1A*/ 00181000
*            4 LCI4KEY1,            /* PORTION OF LCI4REC THAT MAPS     00182000
*                                      THE LCI1KEY               @L1A*/ 00183000
*             5 LCI4TYPE FIXED(16), /* ELEMENT TYPE              @L1A*/ 00184000
*             5 LCI4ELNM CHAR(8),   /* ELEMENT NAME              @L1A*/ 00185000
*             5 LCI4ALNM CHAR(64),  /* ALIAS NAME                @L1A*/ 00186000
*               7 LCI4SYMLNK@ PTR(31) BDY(BYTE),/* SYMLINK CHN   @L2A*/ 00187000
*             5 LCI4LIB  CHAR(8),   /* LIBRARY DDNAME            @L1A*/ 00188000
*             5 LCI4OTYP FIXED(16), /* OWNING ELEMENT TYPE       @L1A*/ 00189000
*           3 LCI4NKEY,             /* NON-KEY FIELDS            @L1A*/ 00190000
*             5 LCI4ACTN FIXED(8),  /* ACTION TYPE               @L1A*/ 00191000
*             5 LCI4FLGS BIT(8),    /*                           @L1A*/ 00192000
*               7 LCI4SKIP BIT(1),  /* SKIP THIS RECORD          @L1A*/ 00193000
*               7 LCI4PRE  BIT(1),  /* SHELL INVOKED PRE HFSCOPY @L1A*/ 00194000
*               7 LCI4POST BIT(1),  /* SHELL INVOKED POSTHFSCOPY @L1A*/ 00195000
*               7 LCI4ONE BIT(1),   /* RCD IS FOR ONE SYMLINK -- DO NOT 00196000
*                                      TRAVERSE CHAIN            @L2A*/ 00197000
*               7 * BIT(4),         /*                           @L2A*/ 00198000
*             5 LCI4SHELL CHAR(8),  /* NAME OF INVOKED SHELL     @L1A*/ 00199000
*             5 LCI4SHPATH CHAR(8); /* DD/DDDEF OF SHSCRIPT'S PATH      00200000
*                                                                @L1A*/ 00201000
*                                                                       00202000
