 /*A000000-999999                                            @LCI0015*/ 00001000
*/********************************************************************/ 00002000
*/*                                                                  */ 00003000
*/* GIMMXLC - MAPPING MACRO FOR THE SMPDATA1 SMPDATA2 DATA SET       */ 00004000
*/*                                                                  */ 00005000
*/* COPYRIGHT = 5647-A01 (C) COPYRIGHT IBM CORPORATION 1998          */ 00006000
*/*             LICENSED MATERIALS - PROPERTY OF IBM                 */ 00007000
*/*                                                                  */ 00008000
*/********************************************************************/ 00009000
*%;                                 /* MACRO EXPANSION TEST          */ 00010000
*  %IF XPND_MAC_SW ^='N' %THEN                                          00011000
*     %GOTO XLC_XPEND;                                                  00012000
*%;                                                                     00013000
*@LIST OFF;                         /* MACRO EXPAND =NO              */ 00014000
*%;                                                                     00015000
*%XLC_XPEND:;                                                           00016000
*%;                                                                     00017000
*@SPACE;                                                                00018000
*/********************************************************************/ 00019000
*/*                                                                  */ 00020000
*/* THIS MACRO IS USED TO MAP RECORDS FOR THE SMPDATA1 AND SMPDATA2  */ 00021000
*/*      DATA SETS.                                                  */ 00022000
*/*                                                                  */ 00023000
*/* THE SMPDATA1\SMPDATA2 DATA SETS CONTAIN THE FOLLOWING RECORDS :  */ 00024000
*/*     HEADER TYPE 0  -  CONTAINS TARGET ZONE NAME AND TIMESTAMP    */ 00025000
*/*     TRAILER TYPE 0 -  CONTAINS TARGET ZONE NAME AND TIMESTAMP    */ 00026000
*/*     CONTINUE TYPE 0-  CONTAINS TARGET ZONE NAME AND TIMESTAMP    */ 00027000
*/*     SMP/E ENVIRONMENT RECORD TYPE 0                              */ 00028000
*/*                    -  CONTAINS COMMAND, VERSION INFO , SMP/E     */ 00029000
*/*                       TARGET ZONE CSI DATA SET NAME, CATALOG,    */ 00030000
*/*                       AND VOLUME INFO                            */ 00031000
*/*     SYSMOD  TYPE 0 -  CONTAINS  STATUS OF SYSMODS PROCESSED  @D1A*/ 00032000
*/*     LIBRARY TYPE 0 -  CONTAINS  TARGET LIBRARY INFO              */ 00033000
*/*     LIBRARY TYPE 1 -  CONTAINS  TARGET LIBRARY INFO  (USED IF    */ 00034000
*/*                       PATH NAME EXISTS)                          */ 00035000
*/*     ALIAS TYPE 0   -  CONTAINS ELEMENT ALIAS INFO                */ 00036000
*/*     ALIAS TYPE 1   -  CONTAINS ELEMENT SYMLINK INFO          @L2A*/ 00036500
*/*     ELEMENT TYPE 0 -  CONTAINS ELEMENT INFO                      */ 00037000
*/*     ELEMENT TYPE 1 -  CONTAINS ELEMENT INFO FOR ELEMENTS         */ 00037333
*/*                        THAT HAVE SHSCRIPT SUBENTRIES             */ 00037666
*/*                                                                  */ 00038000
*/********************************************************************/ 00039000
*/*                                                                  */ 00040000
*/* CHANGE_ACTIVITY                                                  */ 00041000
*/*                                                                  */ 00042000
*/* ---------------------------------------------------------------- */ 00043000
*/* FLAG REASON  RELEASE   DATE   ORG  DESCRIPTION                   */ 00044000
*/* ---- ------- ------- -------- ---  ----------------------------- */ 00045000
*/* $L0= LCI001B  1B.00  12/03/96 LMG: LCI SUPPORT                   */ 00046000
*/* $D1= DCR1504  1B.00  02/14/97 MUD: LCI DCR 15-04                 */ 00047000
*/* $D2= DCR1513  1B.00  09/04/97 MUD: LCI DCR 15-13                 */ 00048000
*/* $L1= SSS0027  27.00  03/02/98 MUD: SHELL SCRIPT SUPPORT          */ 00048500
*/* $L2= SLS0027  27.00  06/18/98  RA: SYMBOLIC LINK SUPPORT         */ 00048750
*/*                                                                  */ 00049000
*/********************************************************************/ 00050000
*/*   CHANGE FLAG KEY: M@PNC                                         */ 00051000
*/*   WHERE:                                                         */ 00052000
*/*                                                                  */ 00053000
*/* M= MULTIPLE    P= DCRS = D,E,F,G    N= 0-9,A-Z     C= A = ADD    */ 00054000
*/*    FOR DELETE     HDWE = H,I,J,K                      C = CHANGE */ 00055000
*/*    FLAGS ONLY     LINE = L,M,N,O                      P = COPY   */ 00056000
*/*                   PTMS = P,Q,R,S                      M = MOVE   */ 00057000
*/*                   APARS = 0-9                         D = DELETE */ 00058000
*/********************************************************************/ 00059000
 @EJECT;                            /*                               */ 00060000
                                                                        00061000
*/********************************************************************/ 00062000
*/*                                                                  */ 00063000
*/*   HEADER/TRAILER/CONTINUE RECORD                             @D2C*/ 00064000
*/*                                                                  */ 00065000
*/********************************************************************/ 00066000
                                                                        00067000
    DECLARE                                                             00068000
      1 H0T0REC BASED BDY(WORD),       /* HEADER/TRAILER RECORD      */ 00069000
          5 H0T0ID CHAR(2),            /* RECORD TYPE IDENTIFIER     */ 00070000
          5 TZNAME CHAR(7),            /* TARGET ZONE NAME           */ 00071000
          5 DATE CHAR(7),              /* DATE                       */ 00072000
            7 YEAR CHAR(4),            /* YEAR                       */ 00073000
            7 DAY  CHAR(3),            /* DAY                        */ 00074000
          5 TIME CHAR(6),              /* TIME                       */ 00075000
            7 HOUR CHAR(2),            /* HOUR                       */ 00076000
            7 MINUTE CHAR(2),          /* MINUTE                     */ 00077000
            7 SECOND CHAR(2),          /* SECOND                     */ 00078000
          5 ERRCNT CHAR(6),            /* COUNT OF SYSMODS IN ERROR  */ 00079000
          5 INCCNT CHAR(6),            /* COUNT OF INCOMPLETE SYSMODS*/ 00080000
          5 INSCNT CHAR(6),            /* COUNT OF SYSMODS APPLIES|     00081000
                                                  RESTORED           */ 00082000
          5 DELCNT CHAR(6),            /* COUNT OF SYSMODS DELETED   */ 00083000
          5 SUPCNT CHAR(6);            /* COUNT OF SUPERSEDED SYSMODS*/ 00084000
                                                                        00085000
*/********************************************************************/ 00086000
*/*                                                                  */ 00087000
*/*   SMP/E ENVIRONMENT RECORD                                       */ 00088000
*/*                                                                  */ 00089000
*/********************************************************************/ 00090000
    DECLARE                                                             00091000
      1 S0REC BASED BDY(WORD),         /* SMP/E ENVIRONMENT RECORD   */ 00092000
          5 S0ID CHAR(2),              /* RECORD TYPE IDENTIFIER     */ 00093000
          5 COMMAND CHAR(7),           /* SMP/E COMMAND              */ 00094000
          5 SMPLEVEL CHAR(8),                                           00095000
            7 VERSION CHAR(2),         /* OS/390 SMP/E VERSION       */ 00096000
            7 RELEASE CHAR(2),         /* OS/390 SMP/E RELEASE       */ 00097000
            7 MOD     CHAR(2),         /* OS/390 SMP/E MOD LEVEL     */ 00098000
            7 PTF     CHAR(2),         /* OS/390 SMP/E PTF LEVEL     */ 00099000
          5 TZCSID  CHAR(44),          /* SMP/E TARGET ZONE CSI         00100000
                                          DATA SET NAME              */ 00101000
          5 TZCSIC  CHAR(44),          /* SMP/E TARGET ZONE CSI         00102000
                                          CATALOG DATA SET NAME      */ 00103000
          5 TZCSIV  CHAR(6);           /* SMP/E TARGET ZONE CSI         00104000
                                          VOLUME NAME                */ 00105000
                                                                        00106000
                                                                        00107000
*/********************************************************************/ 00108000
*/*                                                                  */ 00109000
*/*   SYSMOD STATUS RECORD                                           */ 00110000
*/*                                                              @D1A*/ 00111000
*/********************************************************************/ 00112000
                                                                        00113000
    DECLARE                                                             00114000
      1 P0REC BASED BDY(WORD),         /* SYSMOD STATUS RECORD   @D1A*/ 00115000
          5 P0ID CHAR(2),              /* RECORD TYPE IDENTIFIER @D1A*/ 00116000
          5 P0_SYSMODID CHAR(7),       /* SYSMOD ID              @D1A*/ 00117000
          5 P0_STATUS CHAR(8),         /* STATUS OF SYSMOD       @D1A*/ 00118000
          5 P0_FMID CHAR(7),           /* FMID OF SYSMOD         @D1A*/ 00119000
          5 P0_TYPE CHAR(8);           /* SYSMOD TYPE            @D1A*/ 00120000
                                                                        00121000
*/********************************************************************/ 00122000
*/*                                                                  */ 00123000
*/*   LIBRARY TYPE 0 RECORD                                          */ 00124000
*/*                                                                  */ 00125000
*/********************************************************************/ 00126000
    DECLARE                                                             00127000
      1 L0REC BASED BDY(WORD),         /* LIBRARY TYPE 0 RECORD      */ 00128000
          5 L0ID CHAR(2),              /* RECORD TYPE IDENTIFIER     */ 00129000
          5 TLIBDDN CHAR(8),           /* TARGET LIBRARY DDNAME      */ 00130000
          5 SLIBDDN CHAR(8),           /* SMP/E SYSLIB DDNAME           00131000
                                          ASSOCIATED WITH CROSS-ZONE    00132000
                                          LIBRARY                    */ 00133000
          5 XZNAME  CHAR(7),           /* CROSS-ZONE NAME ASSOCIATED    00134000
                                          WITH CROSS-ZONE LIBRARY       00135000
                                          (FOR NON CROSS-ZONE LIBRARIES 00136000
                                           FIELD WILL BE BLANK)      */ 00137000
          5 LIBTYPE CHAR(8),           /* TYPE OF LIBRARY (PDS OR       00138000
                                           LIBRARY)                  */ 00139000
          5 TLIBVOL CHAR(6),           /* SMP/E TARGET LIBRARY VOLUME   00140000
                                           NAME                      */ 00141000
          5 TLIBDSN CHAR(44),          /* SMP/E TARGET LIBRARY          00142000
                                           DATA SET NAME             */ 00143000
          5 TLIBCAT CHAR(44);          /* SMP/E TARGET LIBRARY CATALOG  00144000
                                          DATA SET NAME              */ 00145000
                                                                        00146000
*/********************************************************************/ 00147000
*/*                                                                  */ 00148000
*/*   LIBRARY TYPE 1 RECORD                                          */ 00149000
*/*                                                                  */ 00150000
*/********************************************************************/ 00151000
    DECLARE                                                             00152000
      1 L1REC BASED BDY(WORD),         /* LIBRARY TYPE 1 RECORD      */ 00153000
          5 L1ID CHAR(2),              /* RECORD TYPE IDENTIFIER     */ 00154000
          5 TLIBDDN1 CHAR(8),          /* TARGET LIBRARY DDNAME      */ 00155000
          5 SLIBDDN1 CHAR(8),          /* SMP/E SYSLIB DDNAME           00156000
                                          ASSOCIATED WITH CROSS-ZONE    00157000
                                          LIBRARY                    */ 00158000
          5 XZNAME1  CHAR(7),          /* CROSS-ZONE NAME ASSOCIATED    00159000
                                          WITH CROSS-ZONE LIBRARY       00160000
                                          (FOR NON CROSS-ZONE LIBRARIES 00161000
                                           FIELD WILL BE BLANK)      */ 00162000
          5 LIBTYPE1 CHAR(8),          /* TYPE OF LIBRARY (PDS,         00163000
                                           LIBRARY OR SEQ)       @L2C*/ 00164000
          5 TLIBDSN1 CHAR(255);        /* SMP/E TARGET LIBRARY          00165000
                                           PATH NAME                 */ 00166000
*/********************************************************************/ 00167000
*/*                                                                  */ 00168000
*/*   ALIAS RECORD                                                   */ 00169000
*/*                                                                  */ 00170000
*/********************************************************************/ 00171000
    DECLARE                                                             00172000
      1 A0REC BASED BDY(WORD),          /* ALIAS   TYPE 0 RECORD     */ 00173000
          5 A0ID CHAR(2),               /* RECORD TYPE IDENTIFIER    */ 00174000
          5 ELEMNAME CHAR(8),          /* SMP/E ELEMENT OR LMOD NAME */ 00175000
          5 ELEMTYPE CHAR(12),         /* SMP/E ELEMENT OR LMOD TYPE */ 00176000
          5 ACTION   CHAR(8),          /* ACTION  AGAINST ALIAS OF      00177000
                                          SMP/E ELEMENT OR LMOD      */ 00178000
*/********************************************************************/ 00179000
*/*                                                                  */ 00180000
*/*    FOR TYPE DELETE: TARGET LIBRARY DDNAME FROM WHICH THE         */ 00181000
*/*                     ALIAS HAS BEEN DELETED                       */ 00182000
*/*    FOR TYPE ADDREP: TARGET LIBRARY DDNAME INTO WHICH THE         */ 00183000
*/*                     ALIAS HAS BEEN ADDED/REPLACED.               */ 00184000
*/*                                                                  */ 00185000
*/********************************************************************/ 00186000
          5 TLIBDDN2 CHAR(8),          /* TARGET LIBRARY DDNAME         00187000
                                          ASSOCIATED WITH SMP/E ELEMENT 00188000
                                          OR LMOD                    */ 00189000
          5 ALIAS   CHAR(64);          /* ALIAS NAME ASSOCIATED WITH    00190000
                                          SMP/E ELEMENT OR LMOD         00191000
                                          (IF HFS ELEMENT, IT IS THE    00192000
                                           LINKNAME)                 */ 00193000
                                                                        00194000
*/********************************************************************/ 00195000
*/*                                                                  */ 00196000
*/*   ALIAS TYPE 1 RECORD -- SYMLINKS FOR AN ELEMENT             @L2A*/ 00196041
*/*                                                                  */ 00196082
*/********************************************************************/ 00196123
                                                                        00196164
    DECLARE                                                             00196205
      1 A1REC  BASED BDY(WORD),        /* ALIAS TYPE 1 RECORD    @L2A*/ 00196246
          5 A1ID CHAR(2),              /* RECORD TYPE IDENTIFIER @L2A*/ 00196287
          5 A1ENAME CHAR(8),           /* SMP/E ELEMENT NAME     @L2A*/ 00196328
          5 A1ETYPE CHAR(12),          /* SMP/E HFS ELEMENT TYPE @L2A*/ 00196369
          5 A1ACTION  CHAR(8),         /* ACTION  AGAINST SYMLINK       00196410
                                                                 @L2A*/ 00196451
          /***********************************************************/ 00196492
          /* FOR TYPE DELETE: TARGET LIBRARY DDNAME FROM WHICH THE   */ 00196533
          /*                  SYMLINK HAS BEEN DELETED               */ 00196574
          /* FOR TYPE ADDREP: TARGET LIBRARY DDNAME INTO WHICH THE   */ 00196615
          /*                  SYMLINK HAS BEEN ADDED/REPLACED.   @L2A*/ 00196656
          /***********************************************************/ 00196697
          5 A1TLIBDDN CHAR(8),         /* TARGET LIBRARY DDNAME         00196738
                                          ASSOCIATED WITH SYMLINK@L2A*/ 00196779
          5 A1SYMLINK CHAR(1023);      /* SYMLINK VALUE          @L2A*/ 00196820
                                                                        00196861
*/********************************************************************/ 00196902
*/*                                                                  */ 00196943
*/*   ELEMENT RECORD                                                 */ 00197000
*/*                                                                  */ 00198000
*/*   AN E0 RECORD IS CREATED FOR EVERY UNIQUE LIBRARY THAT HAS AN   */ 00199000
*/*   ELEMENT CHANGE. ELEMENTS WITH MULTIPLE SYSLIBS WILL HAVE THE   */ 00200000
*/*   APPROPRIATE E0 RECORDS CREATED FOR EACH UNIQUE SYSLIB CHANGED. */ 00201000
*/*                                                                  */ 00202000
*/********************************************************************/ 00203000
    DECLARE                                                             00204000
      1 E0REC BASED BDY(WORD),         /* ELEMENT TYPE 0 RECORD      */ 00205000
          5 E0ID CHAR(2),              /* RECORD TYPE IDENTIFIER     */ 00206000
          5 EELEMNAME CHAR(8),         /* SMP/E ELEMENT OR LMOD NAME */ 00207000
          5 EELEMTYPE CHAR(12),        /* SMP/E ELEMENT OR LMOD TYPE */ 00208000
          5 EACTION   CHAR(8),         /* ACTION AGAINST                00209000
                                          SMP/E ELEMENT OR LMOD      */ 00210000
*/********************************************************************/ 00211000
*/*                                                                  */ 00212000
*/*    FOR TYPE DELETE: TARGET LIBRARY DDNAME FROM WHICH THE         */ 00213000
*/*                     ELEMENT HAS BEEN DELETED                     */ 00214000
*/*    FOR TYPE ADDREP: TARGET LIBRARY DDNAME INTO WHICH THE         */ 00215000
*/*                     ELEMENT HAS BEEN ADDED/REPLACED.             */ 00216000
*/*                                                                  */ 00217000
*/********************************************************************/ 00218000
          5 ETLIBDDN CHAR(8);          /* TARGET LIBRARY DDNAME         00219000
                                          ASSOCIATED WITH SMP/E ELEMENT 00220000
                                          OR LMOD                    */ 00221000
*/********************************************************************/ 00221030
*/*                                                                  */ 00221060
*/*   ELEMENT RECORD TYPE 1 - FOR ELEMENTS WITH SHSCRIPT             */ 00221090
*/*                                                              @L1A*/ 00221120
*/********************************************************************/ 00221150
    DECLARE                                                             00221180
      1 E1REC BASED BDY(WORD),         /* ELEMENT TYPE 1 RECORD  @L1A*/ 00221210
          5 E1ID CHAR(2),              /* RECORD TYPE IDENTIFIER @L1A*/ 00221240
          5 E1ENAME   CHAR(8),         /* SMP/E ELEMENT OR LMOD NAME    00221270
                                                                 @L1A*/ 00221300
          5 E1ETYPE   CHAR(12),        /* SMP/E ELEMENT TYPE     @L1A*/ 00221330
          5 E1ACTION  CHAR(8),         /* ACTION  AGAINST ELEMENT       00221360
                                                                 @L1A*/ 00221390
          /***********************************************************/ 00221420
          /* FOR TYPE DELETE: TARGET LIBRARY DDNAME FROM WHICH THE   */ 00221450
          /*                  ELEMENT HAS BEEN DELETED               */ 00221480
          /* FOR TYPE ADDREP: TARGET LIBRARY DDNAME INTO WHICH THE   */ 00221510
          /*                  ELEMENT HAS BEEN ADDED/REPLACED.   @L1A*/ 00221540
          /***********************************************************/ 00221570
          5 E1TLIBDDN CHAR(8),         /* TARGET LIBRARY DDNAME         00221600
                                          ASSOCIATED WITH ELEMENT       00221630
                                                                 @L1A*/ 00221660
          5 E1PHASE CHAR(8),           /* PHASE OF PROCESSING IN WHICH  00221690
                                          SHSCRIPT WAS INVOKED.         00221720
                                          VALID VALUES ARE:             00221750
                                            "PRE"                       00221780
                                            "POST"                      00221810
                                            "PRE,POST"          @L1A*/  00221840
          5 E1SHSCRIPT CHAR(263);     /* FULL PATH NAME OF THE SHELL    00221870
                                         SCRIPT WHICH WAS INVOKED TO    00221900
                                         COMPLETE THE INSTALLATION OF   00221930
                                         THIS ELEMENT           @L1A*/  00221960
                                                                        00222000
                                                                        00222500
    DECLARE                                                             00223000
          H0  CHAR(2) CONSTANT('H0'),  /* HEADER RECORD TYPE 0 ID    */ 00224000
          T0  CHAR(2) CONSTANT('T0'),  /* TRAILER RECORD TYPE 0 ID   */ 00225000
          C0  CHAR(2) CONSTANT('C0'),  /* CONTINUE RECORD TYPE 0 ID     00226000
                                                                 @D2A*/ 00227000
          S0  CHAR(2) CONSTANT('S0'),  /* SMP/E ENVIRONMENT RECORD      00228000
                                          TYPE 0 ID                  */ 00229000
          P0  CHAR(2) CONSTANT('P0'),  /* SYSMOD STATUS RECORD          00230000
                                          TYPE 0 ID              @D1A*/ 00231000
          L0  CHAR(2) CONSTANT('L0'),  /* LIBRARY RECORD TYPE 0 ID   */ 00232000
          L1  CHAR(2) CONSTANT('L1'),  /* LIBRARY RECORD TYPE 1 ID   */ 00233000
          A0  CHAR(2) CONSTANT('A0'),  /* ALIAS RECORD TYPE 0 ID     */ 00234000
          A1  CHAR(2) CONSTANT('A1'),  /* ALIAS RECORD TYPE 1 ID @L2A*/ 00234333
          E0  CHAR(2) CONSTANT('E0'),  /* ELEMENT RECORD TYPE 0  ID  */ 00234666
          E1  CHAR(2) CONSTANT('E1');  /* ELEMENT RECORD TYPE 1  @L1A*/ 00235332
                                                                        00236000
   /* CONSTANTS BELOW DEFINE VALID VALUES FOR P0_STATUS FIELD    @D1A*/ 00237000
                                                                        00238000
    DECLARE                                                             00239000
         STAT_APP CHAR(8) CONSTANT('APPLIED '), /*               @D1A*/ 00240000
         STAT_RES CHAR(8) CONSTANT('RESTORED'), /*               @D1A*/ 00241000
         STAT_ERR CHAR(8) CONSTANT('ERROR   '), /*               @D1A*/ 00242000
         STAT_INC CHAR(8) CONSTANT('INCMPLT '), /*               @D1A*/ 00243000
         STAT_SUP CHAR(8) CONSTANT('SUPD    '), /*               @D1A*/ 00244000
         STAT_DEL CHAR(8) CONSTANT('DELETED '); /*               @D1A*/ 00245000
                                                                        00246000
   /* CONSTANTS BELOW DEFINE VALID VALUES FOR P0_TYPE  FIELD    @D1A*/  00247000
                                                                        00248000
    DECLARE                                                             00249000
         TYPE_FUN CHAR(8) CONSTANT('FUNCTION'), /*               @D1A*/ 00250000
         TYPE_PTF CHAR(8) CONSTANT('PTF     '), /*               @D1A*/ 00251000
         TYPE_APAR CHAR(8) CONSTANT('APAR    '), /*              @D1A*/ 00252000
         TYPE_UMOD CHAR(8) CONSTANT('USERMOD '); /*              @D1A*/ 00253000
                                                                        00254000
