         MACRO                                                          03000003
&NAME    IA    &DL,&I                   INSERT FROM AREA                06000003
         GBLC  &DEF3890(250)                                   @ZA00766 06500003
         GBLA  &VAL3890(250)                                   @ZA00766 07000003
         LCLC  &LABEL                                          @ZA00766 07500003
         LCLA  &N,&NN,&RL,&M                                   @ZA00766 08000003
&M       SETA  1                                               @ZA00766 09000003
&N       SETA  &I                                                       10000003
&NN      SETA  &N-(&N/2)*2                                              12000003
.IA1     AIF   (N'&DL EQ 1).IA6                                         14000003
         AIF   ('&DL(1)' LT '16').IA2                                   16000003
         MNOTE 12,'***  IHB349  DISPLACEMENT NOT 0-15 DIGITS'           18000003
.IA2     AIF   ('&DL(2)' LT '17' AND '&DL(2)' NE '0').IA3               20000003
         MNOTE 12,'***  IHB350  LENGTH NOT 1-16 DIGITS'                 22000003
.IA3     ANOP                                                           24000003
         AIF   (&NN NE 1 AND &N LE 510).IA4                             26000003
         MNOTE 12,'***  IHB353  SAVE AREA STORAGE VALUE IS NOT EVEN OR X28000003
                IS GREATER THEN 510'                                    30000003
.IA4     ANOP                                                           32000003
&NAME    DC    0H'0',X'4C',AL1(16*&DL(1)+&DL(2)-1),AL2(&N)              34000003
         AGO   .END                                                     36000003
.IA6     ANOP                                                           38000003
         AIF   (&NN NE 1 AND &N LE 510).IA5                             40000003
         MNOTE 12,'***  IHB353  SAVE AREA STORAGE VALUE IS NOT EVEN OR X42000003
                IS GREATER THEN 510'                                    44000003
.IA5     ANOP                                                           46000003
.IA7     AIF   (&M GT 250).IA8                                 @ZA00766 46200003
&LABEL   SETC  '&DEF3890(&M)'                                  @ZA00766 46400003
         AIF   ('&DL'   EQ '&LABEL').IA9                       @ZA00766 46600003
&M       SETA  &M+1                                            @ZA00766 46800003
         AGO   .IA7                                            @ZA00766 47000003
.IA8     ANOP                                                  @ZA00766 47200003
         MNOTE 12,'***   IHB425 &DL NOT EQUATED IN DWF MACRO'  @ZA00766 47400003
.IA9     ANOP                                                  @ZA00766 47600003
&RL      SETA  &VAL3890(&M)                                    @ZA00766 47800003
&NAME    DC    0H'0',X'4C',AL1(&RL),AL2(&N)                    @ZA00766 48000003
.END     MEND                                                           63000003
