*  %GOTO CHKPRO; /*                                                     00100000
         MACRO                                                          00200000
         IAZCHK &LIST=NO,&DSECT=YES                                     00300000
*          */                                                           00400000
*  %CHKPRO: ;                                                           00500000
*/**** START OF SPECIFICATIONS *******************************          00600000
.****PROPRIETARY-STATEMENT************************************          00610000
.*01* PROPRIETARY STATEMENT:                                 *          00620000
.*                                                           *          00630000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00640000
.*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"            *          00650000
.*    5647-A01 (C) COPYRIGHT IBM CORP 1983, 1997             *          00660000
.*                                                           *          00670000
.*    STATUS:  JBB6604                                       *          00680000
.*                                                           *          00690000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00700000
**************************************************************          00710000
*                                                            *          00720000
*01* Descriptive name:  JES FSI checkpoint record area       *          00730000
*                                                            *          00800000
*02*  Acronym:  IAZCHK                                       *          00900000
*                                                            *          01000000
*01* Macro name:  IAZCHK                                     * @R04P498 01600000
*                                                            *          01610000
*01* DSECT name:  IAZCHK or CHK                              *          01620000
*01* Label prefix:  CHK                                      *          01630000
*                                                            *          01640000
*01* Component ID:  JES Common (SC141)                       *          01670000
*                                                            *          01671000
*01* External classification:  PSPI                          *          01673000
*01* End of external classification:                         *          01680000
*                                                            *          01687000
*01* Eye-catcher:  'CHK '                                    *          01688000
*02*  Offset:      CHKID-CHK                                 *          01696000
*02*  Length:      L'CHKID                                   *          01704000
*                                                            *          01712000
*01* Storage attributes:                                     *          01720000
*02*  Subpool:  Caller                                       *          01728000
*02*  Key:  Any                                              *          01736000
*02*  Residency:                                             *          01744000
*      Virtual and real storage are anywhere.                *          01752000
*                                                            *          01760000
*01* Size:                                                   *          01768000
*                                                            *          01776000
*     See CHKLEN                                             *          01784000
*                                                            *          01792000
*01* Created by:                                             *          01800000
*                                                            *          01808000
*     Caller of FSIREQ service                               *          01816000
*                                                            *          01824000
*01* Pointed to by:                                          *          01832000
*                                                            *          01840000
*     GDSCKPA  field of the IAZFSIP  data area when          *          01848000
*       FSIREQ REQUEST=FSIGDS                                *          01856000
*     CHKADR   field of the IAZFSIP  data area when          *          01864000
*       FSIREQ REQUEST=FSICKPT                               *          01872000
*                                                            *          01900000
*01* Serialization:                                          *          01910000
*                                                            *          01920000
*     None required                                          *          01930000
*                                                            *          01940000
*01* Function:                                               *          01950000
*                                                            *          01960000
*     This macro maps the data area describing the dataset   *          01970000
*     information needed to understand the progress being    *          01980000
*     made on the dataset by the processing FSA when a       *          01990000
*     significant point in logic was reached.  This          *          02000000
*     information is used if the processing needs to be      *          02010000
*     restarted, for example, a printer is repositioned      *          02020000
*     and needs to resume work on a piece of output.         *          02030000
*                                                            *          02040000
*01* Method of access:                                       *          02100000
*                                                            *          02200000
*02*  ASM:                                                   *          02300000
*      IAZCHK DSECT=YES|NO                                   *          02400000
*                                                            *          02500000
*        DSECT=YES  - Provided DSECT for IAZCHK              *          02600000
*                                                            *          02700000
*        DSECT=NO   - Provides storage definition for IAZCHK *          02800000
*                                                            *          02800200
*02*  PL/X:                                                  *          02800500
*                                                            *          02800800
*        %DCL CHKPTR PTR                                     *          02801100
*        %INCLUDE SYSLIB(IAZCHK)                             *          02801400
*                                                            *          02801700
*01* Used by:                                                *          02802000
*                                                            *          02802300
*     Functional Subsystem Interface                         *          02802600
*                                                            *          02802900
*01* Deleted by:                                             *          02803200
*                                                            *          02803500
*     Caller of FSIREQ service                               *          02805000
*                                                            *          02805200
*01* Frequency:                                              *          02805600
*                                                            *          02806000
*      1 per call to the Functional Subsystem Interface      *          02806400
*                                                            *          02806800
*01* Restrictions:                                           *          02807200
*                                                            *          02807600
*     None                                                   *          02808000
*                                                            *          02808400
****** END OF SPECIFICATIONS ********************************/          02808800
*/********************************************************************/ 02809200
*/*01* CHANGE ACTIVITY:                                              */ 02810000
*/*                                                                  */ 02820000
*/*               MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3, JBB1329)        */ 02830000
*/* $VC1PXXX=PTM      HJE5530 950915 VLC:  BCP PTM xxx Ext Classifi  */ 02840000
*/*                                                                  */ 02850000
*/* $R04LWLM=WLM      HJE6604 970317 J_K2: Misc fixes                */ 02860000
*/* $R04P498=WLM      HJE6604 970331 J_S1:                           */ 02870000
*/*                                                                  */ 02900000
*/* A000000-999999    CREATED FOR MVS 1.3.3                      @133*/ 02910000
*/********************************************************************/ 03000000
*/************************************************************          03010000
*01* NOTES:                                                  *          03020000
*     None                                                   *          03030000
*************************************************************/          03040000
*                                                                       03050000
*  %GOTO CHKDCL; /*                                                     03100000
         GBLB  &IAZCHK                                                  03200000
         AIF   (&IAZCHK).END                                            03300000
&IAZCHK  SETB  1                                                        03400000
         PUSH  PRINT                                                    03500000
         AIF   ('&LIST' EQ 'YES').MAP1                                  03600000
         PRINT OFF                                                      03700000
.MAP1    AIF   ('&DSECT' NE 'YES').NODSECT                              03800000
IAZCHK   DSECT                                                          03900000
         AGO   .MAP2                                                    04000000
.NODSECT ANOP                                                           04100000
IAZCHK   DS    0D                                                       04200000
.MAP2    ANOP                                                           04300000
CHK      EQU   IAZCHK              ALTERNATE DSECT NAME                 04400000
CHKID    DS    CL4'CHK '           CHKPT RECORD AREA ID                 04500000
CHKLNGTH DS    H                   CHKPT LENGTH                         04600000
         DS    H                   RESERVED                             04700000
CHKJESWK DS    CL64                TO BE FILLED IN BY JES               04800000
CHKRBA   DS    CL8                 JES EQUIVALENT OF A RBA              04900000
CHKDEV   DS    F                   DEVICE TYPE                          05000000
CHKMOD   DS    F                   MODEL NUMBER                         05100000
CHKCOPY  DS    F                   COPY COUNT                           05200000
CHKTRNC  DS    F                   TRANSMISSION COUNT                   05300000
CHKREC   DS    F                   LOGICAL RECORD COUNT(FROM SPOOL)     05400000
CHKPAGE  DS    F                   PHYSICAL SHEET COUNT                 05500000
CHKPROD  DS    CL8                 PRODUCT THAT CREATED CKPT REC        05600000
CHKVER   DS    F                   VERSION OF PRODUCT                   05700000
CHKRELS  DS    F                   RELEASE OF PRODUCT                   05800000
CHKMODF  DS    F                   MODIFICATION LEVEL OF PRODUCT        05900000
CHKSERV  DS    F                   SERVICE LEVEL OF PRODUCT             06000000
CHKLEN   EQU   *-CHK                                                    06100000
         POP   PRINT                                                    06200000
.END     MEND  , -         */                                           06300000
*  %CHKDCL: ;                                                           06400000
*DCL 1 IAZCHK BASED(CHKPTR) BDY(WORD), /*JES CHKPT RECORD AREA*/        06500000
*     3 CHK      CHAR(0) BDY(WORD),    /*JES CHKPT RECORD AREA*/        06600000
*     3 CHKID    CHAR(4),              /*CHKPT RECORD AREA ID='CHK '*/  06700000
*     3 CHKLNGTH FIXED(16),  /*CHKPT LENGTH       */                    06800000
*     3   *      FIXED(16),  /*RESERVED        */                       06900000
*     3 CHKJESWK CHAR(64),   /*TO BE FILLED IN BY JES        */         07000000
*     3 CHKRBA   CHAR(8),    /*JES EQUIVALENT OF A RBA       */         07100000
*     3 CHKDEV   FIXED(31),  /*DEVICE TYPE        */                    07200000
*     3 CHKMOD   FIXED(31),  /*MODEL NUMBER       */                    07300000
*     3 CHKCOPY  FIXED(31),  /*COPY COUNT         */                    07400000
*     3 CHKTRNC  FIXED(31),  /*TRANSMISSION COUNT */                    07500000
*     3 CHKREC   FIXED(31),  /*LOGICAL RECORD COUNT(FROM SPOOL)*/       07600000
*     3 CHKPAGE  FIXED(31),  /*PHYSICAL SHEET COUNT        */           07700000
*     3 CHKPROD  CHAR(8),    /*PRODUCT THAT CREATED CHKPT REC        */ 07800000
*     3 CHKVER   FIXED(31),  /*VERSION OF PRODUCT        */             07900000
*     3 CHKRELS  FIXED(31),  /*RELEASE OF PRODUCT        */             08000000
*     3 CHKMODF  FIXED(31),  /*MODIFICATION LEVEL OF PRODUCT        */  08100000
*     3 CHKSERV  FIXED(31),  /*SERVICE LEVEL OF PRODUCT        */       08200000
*     3    *     CHAR(0) BDY(WORD);                                     99999999
