*  %GOTO FSIPPRO; /*                                                    00100000
         MACRO                                                          00200000
         IAZFSIP &LIST=NO                                               00300000
****** START OF SPECIFICATIONS ******************************* @510P032 00303000
.****PROPRIETARY-STATEMENT************************************          00306000
.*01* PROPRIETARY STATEMENT:                                 *          00308000
.*                                                           *          00315000
.*   LICENSED MATERIALS-PROPERTY OF IBM                      *          00324000
.*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"             *          00333000
.*   5647-A01 (C) COPYRIGHT IBM CORP 1983, 2000              *          00342000
.*                                                           *          00360000
.*   STATUS:  HBB7703                                        *          00369000
.*                                                           *          00378000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00387000
*  */                                                          @510P032 00388000
*  %FSIPPRO: ; /*                                              @510P032 00389000
*                                                            *          00390000
*01* DESCRIPTIVE NAME:  Common Fixed Length Parameter List   *          00400000
*02*  ACRONYM:  IAZFSIP                                      *          00410000
*                                                            *          00420000
*01* MACRO NAME:  IAZFSIP                                    * @510P271 00430000
*                                                            *          00440000
*01* DSECT NAME:  IAZFSIP                                    *          00450000
*01* LABEL PREFIX:  FSI                                      *          00460000
*                                                            *          00470000
*01* COMPONENT ID:  JES2 (SC141)                             *          00480000
*                                                            *          00490000
*01* EXTERNAL CLASSIFICATION:  PSPI                          *          00500000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00510000
*                                                            *          00520000
*01* EYE-CATCHER:  None                                      *          00530000
*02*  OFFSET:      N/A                                       *          00540000
*02*  LENGTH:      N/A                                       *          00550000
*                                                            *          00560000
*01* STORAGE ATTRIBUTES:                                     *          00570000
*02*  SUBPOOL:  230                                          *          00580000
*02*  KEY:  1                                                *          00590000
*02*  RESIDENCY:                                             *          00600000
*      During FSS/FSA Connect processing, virtual storage    *          00608000
*      is anywhere if the FSS supports AMODE 31; otherwise,  *          00616000
*      it is below 16M.  During FSS/FSA Disconnect           *          00624000
*      processing, virtual storage is below 16M.  Real       *          00632000
*      storage is anywhere.  Storage is in the FSS address   *          00640000
*      space during normal FSS/FSA Connect/Disconnect        *          00648000
*      processing.  During abnormal FSS/FSA Disconnect       *          00656000
*      processing in job termination, storage is in the User *          00664000
*      address space.                                        *          00672000
*                                                            *          00680000
*01* SIZE:                                                   *          00688000
*                                                            *          00700000
*     See FSILEN                                             *          00710000
*                                                            *          00720000
*01* CREATED BY:                                             *          00730000
*                                                            *          00740000
*     Issuers of FSIREQ                                      *          00750000
*                                                            *          00760000
*01* POINTED TO BY:                                          *          00770000
*                                                            *          00800000
*     FSXBFSIP field of the $FSSXB data area.                *          00801000
*     FAXBFSIP field of the $FSAXB data area.                *          00810000
*     FAXBPOST field of the $FSAXB data area.                *          00819000
*     TTEFSIOA field of the $TTE data area.                  *          00828000
*                                                            *          00837000
*01* SERIALIZATION:                                          *          00846000
*                                                            *          00855000
*     None required                                          *          00864000
*                                                            *          00873000
*01* FUNCTION:                                               *          00882000
*                                                            *          00900000
*     Input parameter list for FSIREQ functions.             *          00910000
*                                                            *          00920000
*01* METHOD OF ACCESS:                                       *          00930000
*                                                            *          00940000
*02*  ASM:                                                   *          00950000
*      Specify IAZFSIP LIST=YES to cause this mapping to be  *          00960000
*      generated.  A USING must be done on field FSIPARM.    *          00970000
*                                                            *          00980000
*02*  PL/X:                                                  *          01000000
*      Specify a %INCLUDE SYSLIB(IAZFSIP) to cause this      *          01010000
*      mapping to be generated.                              *          01020000
*                                                            *          01030000
*01* USED BY:                                                *          01040000
*                                                            *          01050000
*     This parameter list is used by the Function System     *          01060000
*     Interface (FSI) to pass parameters into the various    *          01070000
*     FSI services.                                          *          01080000
*                                                            *          01090000
*01* DELETED BY:                                             *          01100000
*                                                            *          01110000
*     Issuers of FSIREQ                                      *          01120000
*                                                            *          01600000
*01* FREQUENCY:                                              *          01900000
*                                                            *          02000000
*     One per FSIREQ invocation.                             *          02100000
*                                                            *          02300000
*01* RESTRICTIONS:                                           *          02400000
*                                                            *          02500000
*     None                                                   *          02600000
*                                                            *          02800000
****** END OF SPECIFICATIONS ********************************/          02900000
*/********************************************************************/ 03000000
*/*01* CHANGE ACTIVITY:                                              */ 03010000
*/*                                                                  */ 03020000
*/*               MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3, JBB1329)        */ 03030000
*/*      @OZ78298 MVS/SP RELEASE 3 LEVEL 3                           */ 03040000
*/*      @OY21384 JBB2220 FSI TRACE SPE                      @OY34990*/ 03041000
*/*      PE APAR AGAINST OY34990                             @OY38410*/ 03041500
*/*                                                                  */ 03042000
*/*                                                                  */ 03043000
*/* $313ISP1=FSI      JBB3313 880306 SRP:  Data fields in new ext.   */ 03044000
*/* $313P009=PTM      JBB3313 880602 SRP:  TOKEN & reserved word     */ 03045000
*/* $313P022=PTM      JBB3313 880720 WXC:  Macro compile error       */ 03046000
*/* $313P040=PTM      JBB3313 880910 WXC:  Mismatch in bilingual mac */ 03047000
*/* $313D007=DCR      JBB3313 881028 WXC:  Enforce trailer page      */ 03048000
*/* $313P132=PTM      JBB3313 890105 WXC:  Delete extra reserved     */ 03048500
*/*                                                                  */ 03048600
*/* $410D017=DCR      HBB4410 891024 RPG:  DCR 017 PRINTER SUPPORT   */ 03050000
*/*                                                                  */ 03051000
*/* $510LFDD=4-DIGIT  HBB5510 930414 T_K1: 4-Digit Device Support    */ 03052000
*/* $510P271=PTM      HBB5510 930902 T_K1: PIG2271 Showhdrs          */ 03053000
*/* $510P032=PTM      HBB5510 930916 T_K1: PIG3032 Fix showhdr       */ 03054000
*/* $OW07588=OW07588  HBB5520 950120 T_H:  OW07588: LRECL, RECFM     */ 03054500
*/*                                                                  */ 03054600
*/* $R03P581=PQC0581  HBB6603 960903 T_H:  RELDS flag RDSSTAT        */ 03054700
*/*                                                                  */ 03054800
*/* $R05LOPI=OPI      HJE6605 970611 JMS:  IAZFSIP                   */ 03054900
*/*                                                                  */ 03054930
*/* $R10LCPM=COPYMARK HJE7703 990929 TJW:  COPYMARK=NONE support     */ 03054960
*/*                                                                  */ 03055000
*/*01* A000000-999999    CREATED FOR MVS 1.3.3                   @133*/ 03060000
*/********************************************************************/ 03100000
*/************************************************************          03110000
*01* NOTES:                                                  *          03120000
*                                                            *          03130000
*     None.                                                  *          03140000
*                                                            *          03150000
*************************************************************/          03160000
*  %GOTO FSIPDCL;   /*                                                  03200000
         GBLB  &IAZFSIP                                                 03300000
         AIF   (&IAZFSIP).END                                           03400000
&IAZFSIP SETB  1                                                        03500000
         PUSH  PRINT                                                    03600000
         AIF   ('&LIST' EQ 'YES').MAP1                                  03700000
         PRINT OFF                                                      03800000
.MAP1    ANOP                                                           03900000
         SPACE 1                                                        04000000
*********************************************************************** 04100000
*                                                                     * 04200000
*        FIXED LENGTH FSI PARAMETER LIST HEADER                       * 04300000
*                                                                     * 04400000
*********************************************************************** 04500000
         SPACE 1                                                        04600000
IAZFSIP  DSECT                                                          04610000
FSIPARM  DS    0F                  FSI PARAMETER LIST                   04700000
FSILEN   DS    F                   LENGTH OF CONTIGUOUS FSI            C04800000
                                     PARAMETER LIST            @OY15325 04810000
FSIFUNC  DS    F                   FUNCTION ID NUMBER                   04900000
         SPACE 1                                                        04910000
FSIORDER EQU   1                       ORDER FUNCTION NUMBER            05000000
FSIPOST  EQU   2                       POST FUNCTION NUMBER             05100000
FSIGDS   EQU   3                       GETDS FUNCTION NUMBER            05200000
FSIGREC  EQU   4                       GETREC FUNCTION NUMBER           05300000
FSIFREC  EQU   5                       FREEREC FUNCTION NUMBER          05400000
FSIRDS   EQU   6                       RELDS FUNCTION NUMBER            05500000
FSICKPT  EQU   7                       CHKPT FUNCTION NUMBER            05600000
FSISEND  EQU   8                       SEND FUNCTION NUMBER             05700000
FSIMAXFN EQU   8                       MAXIMUM FUNCTION NUMBER          05800000
FSICON   EQU   254                     CONNECT FUNCTION NUMBER          05900000
FSIDCON  EQU   255                     DISCONNECT FUNCTION NUMBER       06000000
         EJECT                                                          06010000
FSIFSID  DS    0F                  FSS/FSA IDENTIFIER                   06100000
FSIFSSID DS    H                       FSS PART OF FSID                 06200000
FSIFSAID DS    H                       FSA PART OF FSID                 06300000
FSIRESN  DS    F                   REASON CODE FOR FUNCTION FAILURE     06400000
FSITEXT  DS    AL4                 Ptr to user specified data  @OY34990 06410000
FSIPEXT  DS    A                   ADDRESS OF EXTENSION AREA   @313ISP1 06500000
FSIFEND  DS    0F                  ORG POINT FOR FUNCT DEPENDENT AREAS  06600000
FSIFSIZ  EQU   *-FSIPARM           FSI HEADER LENGTH                    06700000
         EJECT                                                          06800000
*********************************************************************** 06900000
*                                                                     * 07000000
*        CONNECT/DISCONNECT FUNCTION DEPENDENT AREA                   * 07100000
*                                                                     * 07200000
*********************************************************************** 07300000
         SPACE 1                                                        07400000
         ORG   FSIFEND                                                  07500000
CDFPARM  EQU   *                   CONNECT/DISCON FUNC DPNDT AREA       07600000
CDFSSIID EQU   53                  CONNECT/DISCON SSI REQ (SSOBFUNC)    07700000
CDFFLGR1 DS    AL1                 REQUEST FLAG BYTES                   07800000
CDFNORM  EQU   B'10000000'             SPECIFIES NORMAL DISCONNECT      07900000
CDFABNOR EQU   B'01000000'             SPECIFIES ABNORMAL DISCONNECT    08000000
CDFFLGR2 DS    AL1                 FUNCTIONS WHICH INVOLVE OP. INTER.  C08100000
                                     SAME AS ORDIVF1 BIT DEFINITIONS    08200000
CDFFL2BT EQU   B'10000000'             BTS INTERVENTION        @OZ78298 08210000
CDFFL2FL EQU   B'01000000'             FLASH INTERVENTION      @OZ78298 08220000
CDFFL2FO EQU   B'00100000'             FORMS INTERVENTION      @OZ78298 08230000
CDFFL2CF EQU   B'00010000'             CONTINUOUS FORMS        @OZ78298 08240000
         SPACE 1                                                        08250000
CDFTOKEN DS    AL1                 RESERVED FOR JES                     08300000
CDFFLGR3 DS    AL1                 FUNCTIONS SUPPORTED BY              C08400000
                                    THE FSS                    @OY31210 08405000
CDFFL3MS EQU   B'10000000'             EXTENDED MESSAGE ROUTING        C08410000
                                       IS SUPPORTED            @OY15325 08420000
CDFFL331 EQU   B'01000000'             AMODE 31 is supported   @410D017 08430000
CDFFL34D EQU   B'00100000'             4-Digit Device Numbers  @510LFDD 08440000
*------------------------------------------------------------* @OW21924 08442000
*        THE FOLLOWING THREE BITS ARE MUTUALLY EXCLUSIVE OF  * @OW21924 08448000
*        EACH OTHER.  IF NONE IS SPECIFIED, IT IS ASSUMED AS * @OW21924 08454000
*        IF CDF3NOIP IS SPECIFIED.                           * @OW21924 08460000
*------------------------------------------------------------* @OW21924 08466000
CDF3IP   EQU   B'00010000'             IP-ADDRESS IS SUPPORTED @OW21924 08472000
CDF3NOIP EQU   B'00001000'             IP-ADDR NOT SUPPORTED   @OW21924 08478000
CDF3BOTH EQU   B'00000100'             BOTH IP & NON-IP        @OW21924 08484000
         SPACE 1                                                        08490000
CDFSTOR  DS    AL4                 ADDRESS OF CONTIGUOUS SSOB/SSIB PAIR 08500000
CDFSTORH EQU   X'80'                 HIGH ORDER BIT OF STOR FOR SSI     08600000
CDFFDATA DS    F                   VALUE RETURNED ON POST AND ORDER     08800000
CDFIDNO  DS    F                   NUMBER OF ID PAIRS IN CDFIDNA AREA   08900000
CDFIDNA  DS    AL4                 ADDRESS OF THE FSS/FSA ROUTINE IDS  C09000000
                                       AND THEIR RESPECTIVE ADDRESSES   09100000
CDFSSID  DS    CL4                 NAME OF THE JES TO BE CONNECTED      09200000
CDFEXTN  DS    A                   RESERVED POINTER            @OZ78298 09210000
CDFFLGS1 DS    AL1                 FUNCTIONS SUPPORTED BY JES  @OY31210 09211000
CDFS1INT EQU   B'10000000'         JES SUPPORTS FSA UNSOLICITED        C09212000
                                    SENDS FOR INTERVENTION             C09213000
                                    CONDITIONS                 @OY31210 09214000
CDFS1ETE EQU   B'01000000'         EXTENDED JES SUPPORT FOR            C09215000
                                    ENVIRONMENTAL TYPE ERRORS  @OY31210 09216000
CDFS1A31 EQU   B'00100000'         JES Supports AMODE 31       @410D017 09216300
CDFS1ESS EQU   B'00010000'         JES Supports ESS keywords   @410D017 09216700
CDFS14DG EQU   B'00001000'         JES Supports 4-Digit Device @510LFDDC09217100
                                    Numbers                    @510LFDD 09217500
CDFS1DNR EQU   B'00000100'         Jes Supports Device Not     @OW27145C09217900
                                   Responding Conditions       @OW27145 09218300
CDFS1EXT EQU   B'00000010'         JES supports extended send  @R05LOPIC09218700
                                    types                      @R05LOPI 09219100
         DS    AL3                 RESERVED                    @OY31210 09219500
         DS    2F                  RESERVED                    @OY31210 09220000
         DS    0F                  BOUNDARY ALIGNMENT                   09300000
CDFSIZ   EQU   *-CDFPARM           CONNECT/DISCONNECT AREA LENGTH       09400000
CDFSIZ1  EQU   CDFSIZ+FSIFSIZ                                           09500000
         EJECT                                                          09600000
*********************************************************************** 09700000
*                                                                     * 09800000
*        CONNECT IDENTIFIER AND ROUTINE ADDRESS AREA.                 * 09900000
*                                                                     * 10000000
*        THIS AREA CONSISTS OF PAIRS OF FUNCTION IDS                  * 10100000
*        CORRESPONDING ROUTINE ADDRESSES.  THE ID-ADDRESS             * 10200000
*        PAIR CAN BE IN ANY ORDER.  THE NUMBER OF PAIRS               * 10300000
*        IS SPECIFIED IN CDFIDNO.                                     * 10400000
*                                                                     * 10500000
*********************************************************************** 10600000
         SPACE 1                                                        10700000
CDFPAIRS DS    0F                  ID/ADDRESS PAIRS                     10800000
CDFID    DS    F                   FUNCTION ID OF 1ST ADDRESS           10900000
CDFAD    DS    AL4                 ADDRESS OF 1ST ID                    11000000
         DS    0F                  BOUNDARY ALIGNMENT                   11100000
CDFIDSZ  EQU   *-CDFID             CDFIDS AREA LENGTH                   11200000
         SPACE 2                                                        11201000
*********************************************************************** 11202000
*                                                                     * 11203000
*        CONNECT/DISCONNECT FUNCTION RETURN CODE DEFINITIONS          * 11204000
*                                                                     * 11205000
*        NOTE: THESE ARE DEFINED HERE FOR SP 1.3.3 COMPATABILITY,     * 11206000
*        REFER TO JES DOCUMENTATION/LISTINGS FOR FURTHER DEFINITIONS  * 11207000
*                                                                     * 11208000
*********************************************************************** 11209000
         SPACE 1                                                        11210000
CDFIFC   EQU   4                   INVALID FUNCTION CODE                11211000
CDFIFSID EQU   8                   INVALID FSS ID                       11212000
CDFIFAID EQU   12                  INVALID FSA ID                       11213000
CDFIGM   EQU   16                  GETMAIN FAILURE                      11214000
CDFICN   EQU   20                  FSA CONNECT BEFORE FSS CONNECT       11215000
CDFICNFA EQU   24                  FSA NOT/ALREADY CONNECTED            11216000
CDFICNFS EQU   28                  FSS NOT/ALREADY CONNECTED            11217000
CDFIFREE EQU   32                  FREEMAIN FAILURE                     11218000
CDFILOAD EQU   36                  LOAD ERROR                           11219000
         EJECT                                                          11300000
*********************************************************************** 13500000
*                                                                     * 13600000
*        STANDARD BASE SECTION OF ORDER FUNCTION DEPENDENT AREA       * 13700000
*                                                                     * 13800000
*********************************************************************** 13900000
         SPACE 1                                                        14000000
         ORG   FSIFEND                                                  14100000
ORDPARM  EQU   *                   ORDER FUNCTION DEPENDENT AREA        14200000
ORDFLGS1 DS    AL1                 STATUS FLAG BYTE                     14300000
ORDSRESP EQU   B'10000000'             RESPONSE IS ORDRSPAD NOW         14400000
ORDARESP EQU   B'01000000'             RESPONSE WILL RETURN LATER       14500000
         DS    AL3                 RESERVED                             14510000
         SPACE 1                                                        14520000
ORDFDATA DS    AL4                 RETURNED DATA SPECIFIED ON CONNECT   14700000
ORDRSPAD DS    AL4                 RESPONSE AREA ADDRESS                14800000
ORDID    DS    H                   HOLDS THE ORDER NUMBER (ID)          14900000
         SPACE 1                                                        14910000
ORDSPFSS EQU   4                       STOP FSS ORDER ID                15000000
ORDSTFSA EQU   8                       START FSA ORDER ID               15100000
ORDSPFSA EQU   12                      STOP FSA ORDER ID                15200000
ORDSTDEV EQU   16                      START DEVICE ORDER ID            15300000
ORDSPDEV EQU   20                      STOP DEVICE ORDER ID             15400000
ORDQUERY EQU   24                      QUERY ORDER ID                   15500000
ORDSET   EQU   28                      SET ORDER ID                     15600000
ORDSYNC  EQU   32                      SYNC ORDER ID                    15700000
ORDINTV  EQU   36                      INTERVENTION ORDER ID            15800000
         SPACE 1                                                        15810000
         DS    H                   RESERVED                             15900000
         DS    F                   RESERVED                             15910000
ORDBEND  DS    0F                  ORG POINT FOR ORDDATA                16000000
ORDBSIZ  EQU   *-ORDPARM           ORDER AREA LENGTH                    16100000
ORDBSIZ1 EQU   ORDBSIZ+FSIFSIZ                                          16200000
         EJECT                                                          16300000
*********************************************************************** 16400000
*                                                                     * 16500000
*        ORDER DATA ASSOCIATED WITH 'START/STOP DEVICE/FSA/FSS' ORDER * 16600000
*                                                                     * 16700000
*********************************************************************** 16800000
         SPACE 1                                                        16900000
         ORG   ORDBEND                                                  17000000
ORDSS    EQU   *                   DATA FOR START/STOP ORDERS           17100000
ORDSSSP  DS    AL4                 POINTER TO START/STOP PARMS @OZ78298 17200000
ORDSSF1  DS    AL1                 FLAG BYTE (REQUEST TYPE)             17300000
ORDSSNO  EQU   B'10000000'              NORMAL TERMINATION REQUESTED    17400000
ORDSSAB  EQU   B'01000000'              ABNORMAL TERMINATION REQUESTED  17500000
ORDSSDU  EQU   B'00001000'              DUMP REQUESTED ON STOP          17600000
         SPACE 1                                                        17610000
         DS    AL1                 RESERVED                    @OZ78298 17620000
ORDSSMX  DS    H                   MAX NUMBER OF FSAS PER FSS           17800000
ORDSSID  DS    0F                  FSA IDENTIFIER TO START/STOP         17900000
ORDSSSI  DS    H                        FSS PART OF THE ID              18000000
ORDSSAI  DS    H                        FSA PART OF THE ID              18100000
ORDSSAD4 DS    CL4                 Dev Addr in 4-digit format  @510LFDD 18110000
ORDSSAD  EQU   ORDSSAD4,3          Dev Addr in 3-digit format  @510LFDD 18111000
ORDSSNA  DS    CL8                 DEV NAME IN PRINTABLE FORM           18300000
ORDSSXT  DS    AL4                 RESERVED POINTER            @OZ78298 18310000
ORDSSSP2 DS    AL4                 POINTER TO MESSAGE ROUTING          C18311000
                                        AREA FOR FSA RELATED           C18312000
                                        MESSAGES.              @OY15325 18314000
         DS    2F                  RESERVED                    @OY15325 18316000
ORDSSEND DS    0F                  START/STOP MAIN PARM LIST END       C18320000
                                                               @OZ78298 18320100
ORDSSSZ  EQU   *-ORDSS             VARIABLE ORDER DATA SIZE             18500000
ORDSSSZ1 EQU   ORDSSSZ+ORDBSIZ+FSIFSIZ     SIZE OF ST/STOP PARMS       C18501000
                                                               @OZ78298 18505000
         SPACE 1                                                        18510000
*                                                                       18520000
*        DEVICE INITIALIZATION PARMS ASSOCIATED WITH START FSA          18530000
*                                                                       18540000
*        THE DEVICE INITIALIZATION PARMS SHOULD NOT BE         @OY15325 18541000
*        ASSUMED TO BE CONTIGUOUS WITH THE CONTIGUOUS          @OY15325 18542000
*        HEADER, BASE, AND ORDER DEPENDENT SECTIONS OF         @OY15325 18543000
*        THE START FSA ORDER PARAMETER LIST.  FOR THIS         @OY15325 18544000
*        REASON, WHEN ACCESSING THIS AREA THE FIELD            @OY15325 18545000
*        ORDSSSP SHOULD BE USED TO OBTAIN ITS LOCATION         @OY15325 18546000
*                                                              @OY15325 18547000
*        THE LENGTH OF THIS AREA IS NOT INCLUDED IN FSILEN     @OY15325 18548000
*                                                              @OY15325 18549000
         SPACE 1                                                        18550000
ORDSSP1  EQU   *                   INIT PARMS AREA FOR START FSA       C18560000
                                                               @OZ78298 18560100
ORDSSPF1 DS    AL1                 FLAG BYTE 1 (INITIAL SETTINGS)      C18561000
                                                               @OZ78298 18561500
ORDSSS1  EQU   B'10000000'              INITIALIZE SINGLE SPACING      C18562000
                                                               @OZ78298 18562500
ORDSSS2  EQU   B'01000000'              INITIALIZE DOUBLE SPACING      C18563000
                                                               @OZ78298 18563500
ORDSSS3  EQU   B'00100000'              INITIALIZE TRIPLE SPACING      C18564000
                                                               @OZ78298 18564500
ORDSSSR  EQU   B'00010000'              INIT. DS SPECIFIED SPACING     C18565000
                                                               @OZ78298 18565500
ORDSSPF2 DS    AL1                 FLAG BYTE 2 (INITIAL SETTINGS)      C18566000
                                                               @OZ78298 18566500
ORDSSKP  EQU   B'10000000'              INITIALIZE PAGE CKPT INTV      C18567000
                                                               @OZ78298 18567500
ORDSSKT  EQU   B'01000000'              INITIALIZE TIME CKPT INTV      C18568000
                                                               @OZ78298 18568500
ORDSSKN  EQU   B'00100000'              INITIALIZE CKPT DISABLED       C18569000
                                                               @OZ78298 18569500
ORDSSPF3 DS    AL1                 FLAG BYTE 3 (INITIAL SETTINGS)      C18570000
                                                               @OZ78298 18570100
ORDSSDN  EQU   B'10000000'              INIT. NPRO TIMER DISABLED      C18571000
                                                               @OZ78298 18571500
ORDSSIN  EQU   B'01000000'              INIT. NPRO TIMER VALUE @OZ78298 18572000
         SPACE 1                                                        18660000
         DS    AL1                 RESERVED                    @OZ78298 18670000
ORDSSKI  DS    F                   INITIAL CHECKPOINT INTERVAL @OZ78298 18680000
ORDSSNI  DS    F                   INITIAL NPRO TIME INTERVAL  @OZ78298 18690000
ORDSSND1 DS    0F                  DEVICE INIT PARMS END       @OY15325 18695000
ORDSSPZ  EQU   *-ORDSSP1           SIZE OF SUB-PARM AREA       @OZ78298 18700000
ORDSSPZ1 EQU   ORDSSPZ+ORDSSSZ1    SIZE OF START FSA +                 C18710000
                                      SUB-PARAMETERS           @OY15325 18712000
         SPACE 1                                               @OY15325 18714000
*                                                              @OY15325 18716000
*        MESSAGE ROUTING INFORMATION FOR FSA RELATED MESSAGES  @OY15325 18718000
*                                                              @OY15325 18720000
*        THE MESSAGE ROUTING AREA SHOULD NOT BE ASSUMED        @OY15325 18723000
*        TO BE CONTIGUOUS WITH THE START FSA PARAMETER         @OY15325 18726000
*        LIST OR DEVICE INITIALIZATION PARMS.  FOR THIS        @OY15325 18729000
*        REASON, WHEN ACCESSING THIS AREA THE FIELD            @OY15325 18732000
*        ORDSSSP2 SHOULD BE USED TO OBTAIN ITS LOCATION        @OY15325 18735000
*                                                              @OY15325 18738000
*        THE LENGTH OF THIS AREA IS NOT INCLUDED IN FSILEN     @OY15325 18741000
*                                                              @OY15325 18744000
         SPACE 1                                               @OY15325 18747000
ORDSS2   EQU   *                   MESSAGE PARMS AREA FOR              C18750000
                                        START FSA              @OY15325 18753000
ORDSS2LN DS    H                   LENGTH OF THIS AREA         @OY15325 18756000
ORDSS2FL DS    X                   MESSAGE ROUTING FLAG        @OY15325 18759000
ORDSS2CS EQU   B'10000000'         CONSOLE ID SPECIFIED        @OY15325 18762000
         DS    X                   RESERVED                    @OY15325 18765000
ORDSS2RC DS    CL16                MCS ROUTING CODE MASK FOR           C18768000
                                        FSA RELATED MESSAGES   @OY15325 18771000
ORDSS2CN DS    F                   CONSOLE ID IN WTO FORMAT FOR        C18774000
                                        FSA RELATED MESSAGES   @OY15325 18777000
         DS    3F                  RESERVED                    @OY15325 18780000
ORDSSND2 DS    0F                  END OF SECTION              @OY15325 18783000
ORDSS2PZ EQU   *-ORDSS2            SIZE OF SUB-PARM AREA       @OY15325 18786000
ORDSS2Z2 EQU   ORDSS2PZ+ORDSSPZ1   SIZE OF START FSA + DEV. INIT +     C18789000
                                        MESSAGE ROUTING PARMS  @OY15325 18792000
         EJECT                                                 @OY15325 18795000
*********************************************************************** 18800000
*                                                                     * 18900000
*        ORDER DATA ASSOCIATED WITH THE 'SET' ORDER                   * 19000000
*                                                                     * 19100000
*********************************************************************** 19200000
         SPACE 1                                                        19300000
         ORG   ORDBEND                                                  19400000
ORDST    EQU   *                   DATA FOR SET ORDER                   19500000
ORDSTR1  DS    AL1                 REQUEST FLAG BYTE           @OZ78298 19600000
ORDSTSN  EQU   B'10000000'              SET NPRO INTERVAL      @OZ78298 19700000
ORDSTDN  EQU   B'01000000'              DISABLE NPRO TIMER     @OZ78298 19800000
         SPACE 1                                                        19900000
         DS    AL3                 RESERVED                             20300000
ORDSTNI  DS    F                   NPRO INTERVAL (IN SECONDS)  @OZ78298 20400000
ORDSTXT  DS    AL4                 RESERVED POINTER            @OZ78298 20500000
         DS    3F                  RESERVED                    @OZ78298 20510000
         DS    0F                  BOUNDARY ALIGNMENT                   20600000
ORDSTSZ  EQU   *-ORDST             VARIABLE ORDER DATA SIZE             20700000
ORDTSZ   EQU   ORDSTSZ             SET ORDER SIZE (FOR SP 1.3.3)       C20710000
                                                               @OZ78298 20710100
ORDSTSZ1 EQU   ORDSTSZ+ORDBSIZ+FSIFSIZ                                  20800000
         EJECT                                                          20900000
*********************************************************************** 21000000
*                                                                     * 21100000
*        ORDER DATA ASSOCIATED WITH THE 'SYNCH' ORDER                 * 21200000
*                                                                     * 21300000
*********************************************************************** 21400000
         SPACE 1                                                        21500000
         ORG   ORDBEND                                                  21600000
ORDSY    EQU   *                   DATA FOR SYNCH ORDER                 21700000
ORDSYR1  DS    AL1                 REQUEST FLAG BYTE (SYNCH ACTION)    C21710000
                                        (IF ZERO, SYNCH TO OOP)        C21720000
                                                               @OZ78298 21720100
ORDSYBCP EQU   B'10000000'              SYNCH TO PREVIOUS CKPT.        C21730000
                                                               @OZ78298 21730100
ORDSYFCP EQU   B'01000000'              SYNCH TO NEXT CHECKPOINT       C21740000
                                                               @OZ78298 21740100
ORDSYBTM EQU   B'00100000'              SYNCH TO TO BEGINNING OF       C21750000
                                         CURRENT TRANSMISSION  @OZ78298 21760000
ORDSYETM EQU   B'00010000'              SYNCH TO END OF CURRENT        C21770000
                                         TRANSMISSION          @OZ78298 21780000
ORDSYBDS EQU   B'00001000'              SYNCH TO BEGINNING OF DS       C21790000
                                                               @OZ78298 21790100
ORDSYEDS EQU   B'00000100'              SYNCH TO END OF DATA SET       C21800000
                                                               @OZ78298 21801000
         SPACE 1                                                        21810000
ORDSYR2  DS    AL1                 REQUEST FLAG BYTE (REPOSITION)      C21820000
                                                               @OZ78298 21820100
ORDSYRI  EQU   B'10000000'              INCREMENT PAGE POSITION        C21830000
                                                               @OZ78298 21830100
ORDSYRD  EQU   B'01000000'              DECREMENT PAGE POSITION        C21840000
                                                               @OZ78298 21840100
ORDSYNR  EQU   B'00100000'              DO NOT REPOSITION PAST END     C21850000
                                         OF DATA SET AT OOP    @OZ78298 21860000
         SPACE 1                                                        21870000
ORDSYR3  DS    AL1                 REQUEST FLAG BYTE (UPDATE)          C21880000
                                        (DEVICE RELATED ITEMS) @OZ78298 21890000
ORDSYS1  EQU   B'10000000'              SET SINGLE SPACE       @OZ78298 21900000
ORDSYS2  EQU   B'01000000'              SET DOUBLE SAPCE       @OZ78298 21910000
ORDSYS3  EQU   B'00100000'              SET TRIPLE SPACE       @OZ78298 21920000
ORDSYSR  EQU   B'00010000'              USE DS SPECIFIED SPACING       C21930000
                                                               @OZ78298 21930100
ORDSYKP  EQU   B'00001000'              PAGE INTERVAL CKPTS    @OZ78298 21940000
ORDSYKT  EQU   B'00000100'              TIME INTERVAL CKPTS    @OZ78298 21950000
ORDSYKN  EQU   B'00000010'              DISABLE CHECKPOINTING  @OZ78298 21960000
ORDSYRL  EQU   B'00000001'              RELOAD RESOURCES FOR THE       C21970000
                                          DATA SET AT OOP      @OZ78298 21980000
         SPACE 1                                                        21990000
ORDSYR4  DS    AL1                 REQUEST FLAG BYTE (UPDATE)          C22000000
                                        (DATA SET RELATED ITEMS)       C22010000
                                                               @OZ78298 22010100
ORDSYCI  EQU   B'10000000'              INCREMENT COPY COUNT   @OZ78298 22020000
ORDSYCD  EQU   B'01000000'              DECREMENT COPY COUNT   @OZ78298 22030000
ORDSYCR  EQU   B'00100000'              REPLACE COPY COUNT     @OZ78298 22040000
         SPACE 1                                                        22050000
ORDSYR5  DS    AL1                 REQUEST FLAG BYTE (INTERRUPT)       C22060000
                                                               @OZ78298 22060100
ORDSYDC  EQU   B'10000000'              DS AT OOP IS COMPLETE  @OZ78298 22600000
ORDSYDI  EQU   B'01000000'              DS AT OOP IS INCOMPLETE        C22700000
                                                               @OZ78298 22700100
ORDSYVA  EQU   B'00100000'              CHKPT FOR OOP DS IS VALID      C22701000
                                                               @OZ78298 22701500
ORDSYNV  EQU   B'00010000'              CHKPT FOR OOP DS IS INVALD     C22702000
                                                               @OZ78298 22707000
         SPACE 1                                               @OY15325 22713100
ORDSYR6  DS    AL1                 REQUEST FLAG BYTE (MISC.)   @OZ78298 22723100
ORDSYMV  EQU   B'10000000'              PRINT ORDSYMSG ON THE OUTPUT   C22733100
                                          OF THE DATA SET BEING SYNCED  22743100
ORDSYDS  EQU   B'01000000'              REJECT SYNCH IF DATA SET NOT   C22753100
                                          ACTIVE AT OOP                 22763100
ORDSYSP  EQU   B'00100000'              JOB TRAILER PAGE IS REQUIRED   C22863100
                                          FOR THE DD AT OOP    @OZ78298 22963100
ORD6EOG  EQU   B'00010000'              End of Output Group    @410D017 22970000
ORD6CLP  EQU   B'00001000'              Clear the pipeline     @OW46639 22980000
         SPACE 1                                                        23200000
         DS    AL1                 RESERVED STATUS FLAG BYTE   @OZ78298 23300000
         DS    AL1                 RESERVED                    @OZ78298 23310000
ORDSYNP  DS    F                   NO. OF PAGES TO REPOSITION  @OZ78298 23320000
ORDSYKI  DS    F                   CHECKPOINT INTERVAL (SEC OR PG)     C23330000
                                                               @OZ78298 23330100
ORDSYCP  DS    H                   COPY COUNT VALUE            @OZ78298 23340000
         DS    XL2                 RESERVED                    @OZ78298 23350000
ORDSYSMX DS    AL4                 PTR TO SET ORDER PARM LIST          C23360000
                                    (LENGTH OF SET ORDER NOT           C23361000
                                     INCLUDED IN FSILEN)       @OY15325 23364000
ORDSYXTN DS    AL4                 RESERVED POINTER            @OZ78298 23370000
         DS    3F                  RESERVED                    @OZ78298 23380000
ORDSYMSG DS    CL120               MESSAGE TEXT TO BE PRESENTED ON     C23400000
                                    USERS OUTPUT                        23500000
         DS    0F                  BOUNDARY ALIGNMENT                   23600000
ORDSYSZ  EQU   *-ORDSY             VARIABLE ORDER DATA SIZE             23700000
ORDSYSZ1 EQU   ORDSYSZ+ORDBSIZ+FSIFSIZ                                  23800000
         EJECT                                                          23900000
*********************************************************************** 24000000
*                                                                     * 24100000
*        ORDER DATA ASSOCIATED WITH 'INTERVENTION' ORDER              * 24200000
*                                                                     * 24300000
*********************************************************************** 24400000
         SPACE 1                                                        24500000
         ORG   ORDBEND                                                  24600000
ORDIV    EQU   *                   INTERVENTION ORDER                   24700000
ORDIVF1  DS    AL1                 FLAG BYTE 1 - INTERVENTION TYPE      24710000
ORDIVRBT EQU   B'10000000'              BTS INTERVENTION REQUEST       C24720000
                                                               @OZ78298 24720100
ORDIVRFL EQU   B'01000000'              FLASH INTERVENTION REQUEST     C24730000
                                                               @OZ78298 24730100
ORDIVRFO EQU   B'00100000'              FORMS INTERVENTION REQUEST     C24740000
                                                               @OZ78298 24740100
ORDIVRCF EQU   B'00010000'              CONT. FORMS INTRVNTN REQST     C24750000
                                                               @OZ78298 24750100
         SPACE 1                                                        24760000
ORDIVF2  DS    AL1                 FLAG BYTE 2 - UPDATE TYPE   @OZ78298 24770000
ORDIVUBT EQU   B'10000000'              BTS TOKEN UPDATE REQUEST       C24780000
                                                               @OZ78298 24780100
ORDIVUFL EQU   B'01000000'              FLASH TOKEN UPDATE REQUEST     C24790000
                                                               @OZ78298 24790100
ORDIVUFO EQU   B'00100000'              FORMS TOKEN UPDATE REQUEST     C24800000
                                                               @OZ78298 24801000
ORDIVUCF EQU   B'00010000'              CONT. FORMS UPDATE REQUEST     C24810000
                                                               @OZ78298 24810100
         SPACE 1                                                        24820000
         DS    AL2                 RESERVED                             24830000
ORDIVBTT DS    CL8                 TOKEN FOR BTS INTERVENTION  @OZ78298 24840000
ORDIVFLT DS    CL8                 TOKEN FOR FLASH INTERVENTION        C24850000
                                                               @OZ78298 24850100
ORDIVFOT DS    CL8                 TOKEN FOR FORMS INTERVENTION        C24860000
                                                               @OZ78298 24860100
ORDIVCFT DS    CL8                 TOKEN FOR CFS INTERVENTION  @OZ78298 24870000
ORDIVXTN DS    AL4                 RESERVED POINTER            @OZ78298 24880000
         DS    3F                  RESERVED                    @OZ78298 24980000
         DS    0F                  BOUNDARY ALIGNMENT                   25400000
ORDIVSZ  EQU   *-ORDIV             VARIABLE ORDER DATA SIZE             25500000
ORDIVSZ1 EQU   ORDIVSZ+ORDBSIZ+FSIFSIZ                                  25600000
         EJECT                                                          25700000
*********************************************************************** 25800000
*                                                                     * 25900000
*        GETDS FUNCTION DEPENDENT AREA                                * 26000000
*                                                                     * 26100000
*********************************************************************** 26200000
         SPACE 1                                                        26300000
         ORG   FSIFEND                                                  26400000
GDSPARM  EQU   *                   GETDS FUNCTION DEPENDENT AREA        26500000
         SPACE 1                                                        26600000
GDSFLGR1 DS    AL1                 REQUEST FLAG BYTE 1                  26700000
GDSJHDR  EQU   B'10000000'             JOB HEADER PAGE REQUIRED         26800000
GDSJTRL  EQU   B'01000000'             JOB TRAILER PAGE REQUIRED        26900000
GDSHDR   EQU   B'00100000'             DATA SET HEADER PAGE REQUIRED    27000000
GDSHTDS  EQU   B'00010000'             DATA SET RTND TO BE ON SAME     C27100000
                                            PAGE AS JOB HEADER         C27200000
                                            OR TRAILER PAGE             27300000
GDSFRMRK EQU   B'00001000'             FORMS MARK REQUIRED              27400000
GDSCMC   EQU   B'00000100'             COPY MARK TO BE CHNGED ON DS     27500000
GDSCMCPY EQU   B'00000010'             COPY MARK TO BE CHNGED ON COPIES 27600000
GDSTRKDS EQU   B'00000001'             TRACK DATA SET AND ISSUE SEND   C27700000
                                         WHEN DATA SET REACHES OOP      27800000
         SPACE 1                                                        27900000
GDSFLGR2 DS    AL1                 REQUEST FLAG BYTE 2         @OZ78298 28000000
GDSJHSWB EQU   B'10000000'             USE SWBS DEFINED FOR JOB        C28010000
                                            HEADER PAGE        @OZ78298 28020000
GDSJTSWB EQU   B'01000000'             USE SWBS DEFINED FOR JOB        C28030000
                                            TRAILER PAGE       @OZ78298 28040000
GDS2EOG  EQU   B'00100000'             End of Output Group     @410D017 28050000
GDS2CMNO EQU   B'00010000'             COPY MARK to be         @R10LCPMC28060000
                                         supressed             @R10LCPM 28070000
         SPACE 1                                                        28100000
GDSFLGS1 DS    AL1                 STATUS FLAG BYTE                     28200000
GDSCKP   EQU   B'10000000'             CHECKPOINT AREA FILLED IN        28300000
GDSALLOC EQU   B'01000000'             DATA SET ALLOCATED ID IN GDSID   28400000
GDSJNEWS EQU   B'00100000'             DATA SET IS JESNEWS     @313D007 28410000
GDSNALLC EQU   B'00001000'             DATA SET NOT ALLOCATED           28500000
GDSRSTCT EQU   B'00000100'             PAGE/REC COUNTS TO BE RESET     C28510000
                                                               @OZ78298 28510100
GDSSJERR EQU   B'00000010'             ERROR IN SJF PROCESSING @OZ78298 28520000
         SPACE 1                                                        28600000
         DS    AL1                 STATUS FLAG BYTE RESERVED            28700000
         SPACE 1                                                        28800000
GDSCKPL  DS    F                   LENGTH OF CHKPT AREA SUPPLIED        28900000
GDSCKPA  DS    AL4                 POINTER TO CHECKPOINT AREA           29000000
GDSJSPA  DS    AL4                 POINTER TO JSPA                      29100000
GDSDDTK  DS    0XL8                DD SWB TOKEN                         29500000
GDSDDRS  DS    A                     SWB- RESERVED                      29600000
GDSDDPT  DS    A                     SWB- PTR TO ADDR OF SWB CHAIN      29700000
GDSOUTK  DS    0XL8                OUTPUT SWB TOKEN                     29710000
GDSOUTRS DS    A                     SWB- RESERVED                      29720000
GDSOUTPT DS    A                     SWB- PTR TO ADDR OF SWB CHAIN      29730000
GDSJDVTN DS    CL8                 JDVT NAME USED AT CREATION           29800000
GDSDSID  DS    CL12                DATA SET IDENTIFIER                  29900000
GDSEXTN  DS    AL4                 RESERVED POINTER            @OZ78298 29910000
GDSRECFM DS    XL1                 Data set record format      @OW07588 29920000
GDSMRECL DS    XL2                 Maximum ds record length    @OW07588 29930000
         DS    XL1                 Reserved for future use     @OW07588 29940000
         DS    2F                  RESERVED                    @OW07588 29950000
GDSSJMSG DS    CL80                MSG TEXT FOR SJF ERROR      @OZ78298 29960000
         DS    0F                  BOUNDARY ALIGNMENT                   30000000
GDSSIZ   EQU   *-GDSPARM           GETDS AREA LENGTH                    30100000
GDSSIZ1  EQU   GDSSIZ+FSIFSIZ                                           30200000
         EJECT                                                          30300000
**********************************************************************  30400000
*                                                                    *  30500000
*        GETREC FUNCTION DEPENDENT AREA                              *  30600000
*                                                                    *  30700000
**********************************************************************  30800000
         SPACE 1                                                        30900000
         ORG   FSIFEND                                                  31000000
GLRPARM  EQU   *                   GETREC FUNCTION DEPENDENT AREA       31100000
GLRFLGR1 DS    AL1                 REQUEST FLAG BYTE                    31200000
GLRREC1  EQU   B'10000000'             REQUEST FIRST REC IN DS          31300000
GLRRECN  EQU   B'01000000'             REQUEST NEXT SEQUENTIAL REC      31400000
GLRRECS  EQU   B'00100000'             REQUEST SPECIFIED REC            31500000
         SPACE 1                                                        31600000
         DS    AL1                 REQUEST FLAG BYTE RESERVED           31700000
         SPACE 1                                                        31800000
GLRFLGS1 DS    AL1                 STATUS FLAG BYTE                     31900000
GLREOF   EQU   B'10000000'             END OF FILE INDICATOR            32000000
GLRNBA   EQU   B'01000000'             NO BUFFERS AVAILABLE             32100000
GLRIPL   EQU   B'00100000'             INVALID PARAMETER LIST  @OZ78298 32200000
GLRIOE   EQU   B'00010000'             I/O ERROR ENCOUNTERED   @OZ78298 32300000
GLRLGE   EQU   B'00001000'             LOGIC ERROR OR ABEND OCCURD     C32400000
                                                               @OZ78298 32401000
GLRNOI   EQU   B'00000100'             NO INDEX RETURNED       @OZ78298 32500000
         SPACE 1                                                        32600000
         DS    AL1                 STATUS FLAG BYTE RESERVED            32700000
         SPACE 1                                                        32800000
GLRINDX  DS    AL4                 POINTER TO RETURNED INDEX            32900000
GLRECID  DS    XL8                 SPOOL RECORD ID (SEE IDXRECID)       33000000
GLRDSID  DS    CL12                DS INDENTIFIER                       33100000
GLREXTN  DS    AL4                 RESERVED POINTER            @OZ78298 33110000
         DS    3F                  RESERVED                    @OZ78298 33120000
         DS    0F                  BOUNDARY ALIGNMENT                   33200000
GLRSIZ   EQU   *-GLRPARM           GETREC AREA LENGTH                   33300000
GLRSIZ1  EQU   GLRSIZ+FSIFSIZ                                           33400000
         SPACE 2                                                        33500000
*********************************************************************** 33600000
*                                                                     * 33700000
*        FREEREC FUNCTION DEPENDENT AREA                              * 33800000
*                                                                     * 33900000
*********************************************************************** 34000000
         SPACE 1                                                        34100000
         ORG   FSIFEND                                                  34200000
FLRPARM  EQU   *                   FREEREC FUNCTION DEPENDENT AREA      34300000
         SPACE 1                                                        34400000
FLRINDX  DS    AL4                 POINTER TO INDEX TO BE FREED        C34500000
                                                               @OZ78298 34501000
FLRDSID  DS    CL12                DS IDENTIFIER                        34600000
FLREXTN  DS    AL4                 RESERVED POINTER            @OZ78298 34610000
         DS    3F                  RESERVED                    @OZ78298 34620000
         DS    0F                  BOUNDARY ALIGNMENT                   34700000
FLRSIZ   EQU   *-FLRPARM           FREEREC AREA LENGTH                  34800000
FLRSIZ1  EQU   FLRSIZ+FSIFSIZ                                           34900000
         EJECT                                                          35000000
*********************************************************************** 35100000
*                                                                     * 35200000
*        RELDS FUNCTION DEPENDENT AREA                                * 35300000
*                                                                     * 35400000
*********************************************************************** 35500000
         SPACE 1                                                        35600000
         ORG   FSIFEND                                                  35700000
RDSPARM  EQU   *                   RELDS FUNCTION DEPENDENT AREA        35800000
RDSFLGS1 DS    AL1                 DATA SET STATUS FLAG BYTE            35900000
RDSDONE  EQU   B'10000000'             DS COMPLETELY PROCESSED          36000000
RDSINC   EQU   B'01000000'             DS NOT COMPLETELY PROCESSED      36100000
RDSCKPI  EQU   B'00100000'             DS CHKPT INVALID                 36200000
RDSUNPR  EQU   B'00010000'             DS UNPRINTABLE          @OZ78298 36210000
RDSSTAT  EQU   RDSFLGS1            Alternate name for RDSFLGS1 @R03P581 36220000
         SPACE 1                                                        36300000
         DS    AL3                 RESERVED                             36400000
         SPACE 1                                                        36500000
RDSDSID  DS    CL12                DATA SET IDENTIFIER                  36600000
RDSEXTN  DS    AL4                 RESERVED POINTER            @313P009 36605000
RDSMIDSE DS    CL8                 MESSAGE ID INDICATING DATASET ERROR C36610000
                                                               @313ISP1 36620000
         DS    F                   RESERVED                    @313ISP1 36700000
         DS    0F                                              @313P009 36710000
RDSSIZ   EQU   *-RDSPARM           RELDS AREA LENGTH                    36800000
RDSSIZ1  EQU   RDSSIZ+FSIFSIZ                                           36900000
         SPACE 2                                                        37000000
*********************************************************************** 37100000
*                                                                     * 37200000
*        CHKPT FUNCTION DEPENDENT AREA                                * 37300000
*                                                                     * 37400000
*********************************************************************** 37500000
         SPACE 1                                                        37600000
         ORG   FSIFEND                                                  37700000
CHKPARM  EQU   *                   CHKPT FUNCTION DEPENDENT AREA        37800000
         SPACE 1                                                        37900000
CHKADR   DS    AL4                 POINTER TO CHKPT BUFFER              38000000
         SPACE 1                                                        38010000
CHKFLGR1 DS    AL1                 REQUEST FLAG BYTE           @OZ78298 38020000
CHKFCWRT EQU   B'10000000'          FORCE A WRITE OF THE CHK REC       C38030000
                                                               @OZ78298 38030100
         DS    AL1                 RESERVED                    @OZ78298 38040000
         SPACE 1                                                        38050000
CHKFLGS1 DS    AL1                 STATUS FLAG BYTE            @OZ78298 38060000
CHKFCERR EQU   B'10000000'          PERMANENT ERROR ATTEMPTING CHECK-  C38070000
                                    POINT WRITE, REQUEST IGNORED       C38080000
                                                               @OZ78298 38080100
         DS    AL1                 RESERVED                    @OZ78298 38090000
CHKDSID  DS    CL12                DS IDENTIFIER                        38100000
CHKEXTN  DS    AL4                 RESERVED POINTER            @OZ78298 38110000
         DS    3F                  RESERVED                    @OZ78298 38120000
         DS    0F                  BOUNDARY ALIGNMENT                   38200000
CHKSIZ   EQU   *-CHKPARM           CHKPT AREA LENGTH                    38300000
CHKSIZ1  EQU   CHKSIZ+FSIFSIZ                                           38400000
         EJECT                                                          38500000
*********************************************************************** 38600000
*                                                                     * 38700000
*        POST FUNCTION DEPENDENT AREA                                 * 38800000
*                                                                     * 38900000
*********************************************************************** 39000000
         SPACE 1                                                        39100000
         ORG   FSIFEND                                                  39200000
POSTPARM EQU   *                   POST FUNCTION DEPENDENT AREA         39300000
POSTFLS1 DS    AL1                 STATUS FLAG BYTE                     39400000
POSTGDS  EQU   B'10000000'             GETDS REQUEST SATISFIED          39500000
         SPACE 1                                                        39600000
         DS    AL3                 RESERVED                             39700000
         SPACE 1                                                        39800000
POSFDATA DS    F                   RETURNED CONNECT DATA                39900000
         DS    F                   RESERVED                             39910000
POSTSIZ  EQU   *-POSTPARM          POST AREA LENGTH                     40000000
POSTSIZ1 EQU   POSTSIZ+FSIFSIZ                                          40100000
         SPACE 3                                                        40200000
*********************************************************************** 40300000
*                                                                     * 40400000
*        SEND FUNCTION DEPENDENT AREA                                 * 40500000
*                                                                     * 40600000
*********************************************************************** 40700000
         SPACE 1                                                        40800000
         ORG   FSIFEND                                                  40900000
SNDPARM  EQU   *                   SEND FUNCTION DEPENDENT AREA         41000000
SNDTYPE  DS    AL1                 SEND FLAG BYTE                       41100000
SNDTYRSP EQU   B'10000000'             RESPONSE TO AN ORDER             41200000
SNDTYTDS EQU   B'01000000'             SEND REQUESTED VIA GDSFLGR1     C41300000
                                         INDICATING DS REACHED OOP      41400000
SNDTYFIT EQU   B'00100000'             REQUEST FOR FSA TERM    @OZ90000 41410000
SNDTYINT EQU   B'00010000'             UNSOLICITED DEVICE              C41412000
                                         INTERVENTION DETECTED         C41414000
                                         FROM THE FSA          @OY31210 41416000
SNDTYICL EQU   B'00001000'             UNSOLICITED DEVICE              C41418000
                                         INTERVENTION CLEARED          C41420000
                                         FROM THE FSA          @OY31210 41422000
SNDTYDNR EQU   B'00000100'             Unsolicited device not  @OW27145C41423000
                                         Responding RECVD      @OW27145C41424000
                                         From the FSA          @OW27145 41425000
SNDTYDCL EQU   B'00000010'             Unsolicited device not  @OW27145C41426000
                                         Responding CLEARED    @OW27145C41427000
                                         From the FSA          @OW27145 41428000
SNDTYEXT EQU   B'00000001'             Extended send type      @R05LOPIC41428200
                                         specified             @R05LOPI 41428800
         SPACE 1                                               @R05LOPI 41430000
SNDTYP2  DS    XL1                 Extended send type          @R05LOPI 41432000
SNDE58OK EQU   1                   Unsolicited request to      @R05LOPIC41440000
                                     issue an EOD-OK ENF58     @R05LOPIC41448000
                                     signal                    @R05LOPI 41456000
SNDE58ER EQU   2                   Unsolicited request to      @R05LOPIC41464000
                                     issue an EOD-Error ENF58  @R05LOPIC41472000
                                     signal                    @R05LOPI 41480000
         DS    XL2                 Reserved                    @R05LOPI 41500000
SNDRSPTR DS    AL4                 RESPONSE AREA POINTER FOR           C41600000
                                     UNSOLICITED SEND REQUESTS          41700000
         DS    F                   RESERVED                             41800000
         DS    0F                  BOUNDARY ALIGNMNET                   41900000
SNDSIZ   EQU   *-SNDPARM           SEND AREA LENGTH                     42000000
SNDSIZ1  EQU   SNDSIZ+FSIFSIZ                                           42020000
         EJECT                                                 @OY34990 42040000
*********************************************************************** 42060000
*                                                                     * 42080000
*     USER DEFINED TRACE DATA AREA.                                   * 42082000
*                                                                     * 42084000
*      Pointed to by field FSITEXT in Parameter List Header.          * 42086000
*                                                                     * 42088000
*********************************************************************** 42090000
         SPACE 1                                                        42092000
FSIUDATA DSECT                     User defined trace data.    @OY34990 42094000
FSIUDLEN DS    F                   Length of user data area, this      C42096000
                                    includes the length word and the   C42098000
                                    routine name as well as the user   C42101100
                                    trace data in FSIUDTXT. Must be    C42101400
                                    2K or less.                @OY34990 42101700
FSIUDNAM DS    CL8                 Routine name generating the         C42102000
                                    FSIREQ.                    @OY34990 42102300
FSIUDTXT DS    0C                  User specified data that is to      C42102600
                                    be placed in the GTF trace when    C42102900
                                    GTF tracing is turned on.  @OY34990 42103200
         EJECT                                                 @313ISP1 42103500
*********************************************************************** 42104000
*                                                                     * 42106000
*        EXTENSION AREA DEFINITION. POINTED TO BY FIELD FSIPEXT.      * 42108000
*                                                                     * 42110000
*********************************************************************** 42112000
         SPACE 1                                               @313ISP1 42114000
FSIED    DSECT                                                 @313ISP1 42116000
FSIEXNUM DS    H                   NUMBER OF EXTENSIONS        @313ISP1 42118000
FSIEXLEN DS    H                   LENGTH OF ALL EXTENSIONS    @313ISP1 42120000
FSIEHID  DS    CL4                 EXTENSION HEADER ID         @313ISP1 42122000
         DS    F                   RESERVED                    @313ISP1 42124000
         DS    F                   RESERVED                    @313ISP1 42126000
         DS    F                   RESERVED                    @313ISP1 42128000
         DS    F                   RESERVED                    @313ISP1 42130000
FSIEXEND DS    0F                  END OF DEFINITION AREA      @313P009 42131000
FSIEDSZE EQU   *-FSIEXNUM          SIZE OF DEFINITION AREA     @313ISP1 42132000
         SPACE 1                                               @313ISP1 42134000
*********************************************************************** 42136000
*                                                                     * 42138000
*        START OF EXTENSION AREA FOR GETDS. THIS EXTENSION FOLLOWS    * 42140000
*        THE FOUR(4) WORD RESERVED AREA IN THE EXTENSION DEFINITION   * 42142000
*        AREA.                                                        * 42144000
*                                                                     * 42146000
*********************************************************************** 42148000
         SPACE 1                                               @313ISP1 42150000
FSIEA    DSECT                                                 @313ISP1 42152000
FSIEGLEN DS    H                   EXTENSION AREA LENGTH       @313ISP1 42154000
FSIEGVSN DS    H                   VERSION NUMBER FIELD        @313ISP1 42156000
FSIEGFID DS    F                   EXTENSION ID IDENTIFYING GETDS      C42158000
                                                               @313ISP1 42160000
FSIEGUTK DS    CL80                USER TOKEN                  @313P009 42162000
FSIEGRTK DS    CL80                RESOURCE TOKEN              @313P009 42164000
FSIEGOGT DS    CL20                OUTPUT GROUP TOKEN          @313D007 42165000
FSIEASZE EQU   *-FSIEGLEN          SIZE OF GETDS EXT. AREA     @313ISP1 42166000
FSIEGVNM EQU   2                   CURRENT VERSION NUMBER      @313ISP1 42168000
         POP   PRINT                                                    42200000
.END     MEND  , - */                                                   42300000
*%FSIPDCL: ;                                                            42400000
*/********************************************************************/ 42500000
*/*                                                                  */ 42600000
*/*    FIXED LENGTH FSI PARAMETER LIST HEADER                        */ 42700000
*/*                                                                  */ 42800000
*/********************************************************************/ 42900000
*@SPACE;                                                                43000000
*DCL 1 IAZFSIP BASED(FSIPPTR) BDY(WORD), /*FSI PARAMETER LIST        */ 43100000
*     3 FSIPARM   CHAR(0) BDY(WORD),  /*FSI PARAMETER LIST        */    43200000
*     3 FSILEN    FIXED(31),   /*LENGTH OF CONTIGUOUS FSI               43300000
*                                 PARAMETER LIST             @OY15325*/ 43310000
*     3 FSIFUNC   FIXED(31),   /*FUNCTION ID NUMBER*/                   43400000
*     3 FSIFSID   FIXED(32),   /*FSS/FSA IDENTIFIER*/                   43500000
*       5 FSIFSSID FIXED(16),      /*FSS PART OF ID */                  43600000
*       5 FSIFSAID FIXED(16),      /*FSA PART OF ID */                  43700000
*     3 FSIRESN   FIXED(31),   /*REASON CODE FOR FUNCTION FAILURE*/     43800000
*     3 FSITEXT   PTR(31),     /*Ptr to user specified data  @OY34990*/ 43810000
*     3 FSIPEXT   PTR(31),     /*ADDRESS OF EXTENSION AREA @313ISP1*/   43900000
*     3 FSIFEND   CHAR(0) BDY(WORD);  /*ORG PNT FUNC DEPENDENT AREA*/   44000000
*DCL FSIORDER     FIXED(31) CONSTANT(1);  /*ORDER FUNCTION NUMBER*/     44100000
*DCL FSIPOST      FIXED(31) CONSTANT(2);  /*POST FUNCTION NUMBER*/      44200000
*DCL FSIGDS       FIXED(31) CONSTANT(3);  /*GETDS FUNCTION NUMBER*/     44300000
*DCL FSIGREC      FIXED(31) CONSTANT(4);  /*GETREC FUNCTION NUMBER*/    44400000
*DCL FSIFREC      FIXED(31) CONSTANT(5);  /*FREEREC FUNCTION NUMBER*/   44500000
*DCL FSIRDS       FIXED(31) CONSTANT(6);  /*RELDS FUNCTION NUMBER*/     44600000
*DCL FSICKPT      FIXED(31) CONSTANT(7);  /*CHKPT FUNCTION NUMBER*/     44700000
*DCL FSISEND      FIXED(31) CONSTANT(8);  /*SEND FUNCTION NUMBER*/      44800000
*DCL FSIMAXFN     FIXED(31) CONSTANT(8);  /*FSI MAXIMUM FUNCTION NUM*/  44900000
*DCL FSICON       FIXED(31) CONSTANT(254); /*CONNECT FUNCTION NUMBER*/  45000000
*DCL FSIDCON      FIXED(31) CONSTANT(255); /*DISCONNECT FUNCTION NUM*/  45100000
*@EJECT;                                                                45200000
*/********************************************************************/ 45300000
*/*                                                                  */ 45400000
*/*   CONNECT/DISCONNECT FUNCTION DEPENDENT AREA                     */ 45500000
*/*                                                                  */ 45600000
*/********************************************************************/ 45700000
*@SPACE;                                                                45800000
*DCL CDFSSIID FIXED(15) CONSTANT(53); /*CON/DISCON SSIREQ (SSOBFUNC) */ 45900000
*DCL CDFSSOBP FIXED(31) BASED;        /*WORD USED FOR SSOB PTR */       46000000
*DCL 1 CDFPARM BASED(ADDR(FSIFEND)),  /*CON/DISCON FUNC DPNDNT AREA*/   46100000
*     3 CDFFLGR1  BIT(8),      /*REQUEST FLAG BYTES*/                   46200000
*      5 CDFNORM  BIT(1),      /*    SPECIFIES NORMAL DISCONNECT*/      46300000
*      5 CDFABNOR BIT(1),      /*    SPECIFIES ABNORMAL DISCONNECT*/    46400000
*     3 CDFFLGR2  BIT(8),      /*OPERATOR INTERVENTION FUNCTIONS*/      46500000
*      5 CDFFL2BT BIT(1),      /*    BTS INTERVTN REQUESTED  @OZ78298*/ 46510000
*      5 CDFFL2FL BIT(1),      /*    FLASH INTERVTN REQUESTED           46520000
*                                                            @OZ78298*/ 46520100
*      5 CDFFL2FO BIT(1),      /*    FORMS INTERVTN REQUESTED           46530000
*                                                            @OZ78298*/ 46530100
*      5 CDFFL2CF BIT(1),      /*    CONTINUOUS FORMS INTERVTN          46540000
*                                                            @OZ78298*/ 46540100
*     3 CDFTOKEN  BIT(8),      /*RESERVED FOR JES*/                     46600000
*     3 CDFFLGR3  BIT(8),      /*FUNCTIONS SUPPORTED BY                 46700000
*                                 THE FSS                    @OY31210*/ 46705000
*      5 CDFFL3MS  BIT(1),     /*   EXTENDED MESSAGE ROUTING            46710000
*                                   IS SUPPORTED             @OY15325*/ 46720000
*      5 CDFFL331  BIT(1),     /*   AMODE 31 is supported    @410D017*/ 46730000
*      5 CDFFL34D  BIT(1),     /*   4-Digit Device Numbers   @510LFDD*/ 46740000
*/*--------------------------------------------------------* @OW21924*/ 46746000
*/*      THE FOLLOWING THREE BITS ARE MUTUALLY EXCLUSIVE OF* @OW21924*/ 46752000
*/*      EACH OTHER.  IF NONE IS SPECIFIED, IT IS ASSUMED  * @OW21924*/ 46758000
*/*      AS IF CDF3NOIP IS SPECIFIED.                      * @OW21924*/ 46764000
*/*--------------------------------------------------------* @OW21924*/ 46770000
*      5 CDF3IP    BIT(1),     /*   IP-ADDRESS IS SUPPORTED  @OW21924*/ 46776000
*      5 CDF3NOIP  BIT(1),     /*   IP-ADDR IS NOT SUPPORTED @OW21924*/ 46782000
*      5 CDF3BOTH  BIT(1),     /*   BOTH IP & NON-IP         @OW21924*/ 46788000
*@SPACE;                                                                46794000
*     3 CDFSTOR   PTR(31),     /*ADDRESS TO CONTIGOUS SSOB/SSIB PAIR*/  46800000
*      5 CDFSTORH  BIT(1),     /*HIGH ORDER BIT OF STOR FOR SSI */      46900000
*     3 CDFFDATA  PTR(31),     /*VALUE RETURNED ON POST AND ORDER*/     47100000
*     3 CDFIDNO   FIXED(31),   /*NUMBER OF ID PAIRS IN CDFIDNA AREA*/   47200000
*     3 CDFIDNA   PTR(31),     /*ADDRESS OF THE FSS/FSA ROUTINE IDS     47300000
*                                   AND THEIR RESPECTIVE ADDRESSES*/    47400000
*     3 CDFSSID   CHAR(4),     /*NAME OF THE JES TO BE CONNECTED*/      47500000
*     3 CDFEXTN   PTR(31),     /*RESERVED POINTER            @OZ78298*/ 47510000
*     3 CDFFLGS1  BIT(8),      /*FUNCTIONS SUPPORTED BY JES  @OY31210*/ 47511000
*      5 CDFS1INT  BIT(1),     /*JES SUPPORTS FSA UNSOLICITED           47512000
*                                 SENDS FOR INTERVENTION                47513000
*                                 CONDITIONS                 @OY31210*/ 47514000
*      5 CDFS1ETE  BIT(1),     /*EXTENDED JES SUPPORT FOR               47515000
*                                 ENVIRONMENTAL TYPE ERRORS  @OY31210*/ 47516000
*      5 CDFS1A31  BIT(1),     /*JES Supports AMODE 31       @410D017*/ 47516100
*      5 CDFS1ESS  BIT(1),     /*JES Supports ESS keywords   @410D017*/ 47516400
*      5 CDFS14DG  BIT(1),     /*JES Supports 4-Digit Device            47516600
*                                 Numbers                    @510LFDD*/ 47516800
*      5 CDFS1DNR  BIT(1),     /*JES Supports Device Not Responding     47517300
*                                Conditions                  @OW27145*/ 47517800
*      5 CDFS1EXT  BIT(1),     /* JES supports extended send types      47518300
*                                                            @R05LOPI*/ 47518800
*     3    *      PTR(24),     /*RESERVED                    @OY31210*/ 47519300
*     3    *      CHAR(2*4),   /*RESERVED                    @OY31210*/ 47520000
*     3    *      CHAR(0) BDY(WORD);                                    47600000
*@SPACE;                                                                47700000
*/********************************************************************/ 47800000
*/*                                                                  */ 47810000
*/*        CONNECT IDENTIFIER AND ROUTINE ADDRESS AREA               */ 47900000
*/*            THIS AREA CONSISTS OF PAIRS OF FUNCTION IDS AND       */ 48000000
*/*            CORRESPONDING ROUTINE ADDRESSES.  THE ID-             */ 48100000
*/*            ADDRESS PAIR CAN BE IN ANY ORDER.                     */ 48200000
*/*            THE NUMBER OF PAIRS IS SPECIFIED IN CDFIDNO.          */ 48300000
*/*                                                                  */ 48400000
*/********************************************************************/ 48500000
*@SPACE;                                                                48600000
*DCL 1 CDFPAIRS(*) BASED(CDFIDNA) BDY(WORD),                            48700000
*      3  CDFID    FIXED(31),   /*FUNCTION ID OF 1ST ADDRESS*/          48800000
*      3  CDFAD    PTR(31);     /*ADDRESS OF 1ST ID*/                   48900000
*@EJECT;                                                                49900000
*/********************************************************************/ 51100000
*/*                                                                  */ 51200000
*/*   STANDARD BASE SECTION OF ORDER FUNCTION DEPENDENT AREA         */ 51300000
*/*                                                                  */ 51400000
*/********************************************************************/ 51500000
*DCL 1 ORDPARM BASED(ADDR(FSIFEND)),  /*ORDER FUNC DEPENDENT AREA*/     51600000
*     3 ORDFLGS1  BIT(8),              /*STATUS FLAG BYTE*/             51700000
*      5 ORDSRESP BIT(1),                  /*RESPONSE IN ORDSPAD NOW*/  51800000
*      5 ORDARESP BIT(1),                  /*RESPONSE WILL RET LATER*/  51900000
*     3   *       PTR(24),            /*RESERVED FOR FUTURE USE*/       52000000
*     3 ORDFDATA  PTR(31),            /*RET DATA SPECIFIED ON CONNCT*/  52100000
*     3 ORDSPAD   PTR(31),            /*RESPONSE AREA ADDRESS        */ 52200000
*     3 ORDID     FIXED(16),          /*HOLDS THE ORDER NUMBER (ID)*/   52300000
*     3   *       FIXED(15),          /*RESERVED*/                      52400000
*     3   *       FIXED(31),          /*RESERVED*/                      52410000
*     3 ORDBEND   CHAR(0) BDY(WORD);  /*SERVES AS ORG PNT FOR ORDATA*/  52500000
*DCL ORDSPFSS     FIXED(16) CONSTANT(4);   /*STOP FSS ORDER ID*/        52600000
*DCL ORDSTFSA     FIXED(16) CONSTANT(8);   /*START FSA ORDER ID*/       52700000
*DCL ORDSPFSA     FIXED(16) CONSTANT(12);  /*STOP FSA ORDER ID*/        52800000
*DCL ORDSTDEV     FIXED(16) CONSTANT(16);  /*START DEVICE ORDER ID*/    52900000
*DCL ORDSPDEV     FIXED(16) CONSTANT(20);  /*STOP DEVICE ORDER ID*/     53000000
*DCL ORDQUERY     FIXED(16) CONSTANT(24);  /*QUERY ORDER ID*/           53100000
*DCL ORDSET       FIXED(16) CONSTANT(28);  /*SET ORDER ID*/             53200000
*DCL ORDSYNC      FIXED(16) CONSTANT(32);  /*SYNC ORDER ID*/            53300000
*DCL ORDINTV      FIXED(16) CONSTANT(36);  /*INTERVENTION ORDER ID*/    53400000
*@EJECT;                                                                53500000
*/********************************************************************/ 53600000
*/*                                                                  */ 53700000
*/*    ORDER DATA ASSOCIATED WITH THE 'START/STOP                    */ 53800000
*/*      DEVICE/FSS/FSA' ORDER                                       */ 53900000
*/*                                                                  */ 54000000
*/********************************************************************/ 54100000
*@SPACE;                                                                54200000
*DCL 1 ORDSS   BASED(ADDR(ORDBEND)),   /*DATA FOR START/STOP ORDERS */  54300000
*     3 ORDSSSP  PTR(31),              /*PTR TO START/STOP PARMS        54400000
*                                                            @OZ78298*/ 54401000
*     3 ORDSSF1  BIT(8),               /*FLAG BYTE (REQUEST)*/          54500000
*      5 ORDSSNO  BIT(1),                   /*NORM TERM REQUESTED*/     54600000
*      5 ORDSSAB  BIT(1),                   /*ABNORM TERM REQUESTED*/   54700000
*      5  *       BIT(2),                   /*RESERVED*/                54800000
*      5 ORDSSDU  BIT(1),                   /*DUMP REQSTD ON STOP*/     54900000
*     3   *      BIT(8),               /*RESERVED            @OZ78298*/ 55000000
*     3 ORDSSMX  FIXED(15),            /*MAX NUMB OF FSA'S PER FSS*/    55100000
*     3 ORDSSID  FIXED(31),            /*FSA IDENT TO START/STOP*/      55200000
*      5 ORDSSSI FIXED(15),                 /*FSS PART OF THE ID*/      55300000
*      5 ORDSSAI FIXED(15),                 /*FSA PART OF THE ID*/      55400000
*     3 ORDSSAD4 CHAR(4),              /*4-digit Dev Addr    @510LFDD*/ 55410000
*      5 ORDSSAD CHAR(3),                /* 3-digit Dev Addr @510LFDD*/ 55410100
*      5  *      CHAR(1),                /* Last digit       @510LFDD*/ 55412000
*     3 ORDSSNA  CHAR(8),              /*DEV NAME - PRINTABLE FORM */   55424000
*     3 ORDSSXT  PTR(31),              /*RESERVED POINTER    @OZ78298*/ 55428000
*     3 ORDSSSP2 PTR(31),              /*POINTER TO MESSAGE ROUTING     55432000
*                                           AREA FOR FSA RELATED        55436000
*                                           MESSAGES.        @OY15325*/ 55440000
*     3   *      CHAR(2*4),            /*RESERVED            @OY15325*/ 55444000
*     3 ORDSSEND CHAR(0) BDY(WORD);    /*START/STOP MAIN PARMS END      55448000
*                                                            @OZ78298*/ 55452000
*@SPACE;                                                                55456000
*/*                                                                  */ 55460000
*/*    DEVICE INITIALIZATION PARMS ASSOCIATED WITH START FSA         */ 55464000
*/*                                                                  */ 55468000
*/*    THE DEVICE INITIALIZATION PARMS SHOULD NOT BE         @OY15325*/ 55472000
*/*    ASSUMED TO BE CONTIGUOUS WITH THE CONTIGUOUS          @OY15325*/ 55476000
*/*    HEADER, BASE, AND ORDER DEPENDENT SECTIONS OF         @OY15325*/ 55480000
*/*    THE START FSA ORDER PARAMETER LIST.  FOR THIS         @OY15325*/ 55484000
*/*    REASON, WHEN ACCESSING THIS AREA THE FIELD            @OY15325*/ 55488000
*/*    ORDSSSP SHOULD BE USED TO OBTAIN ITS LOCATION         @OY15325*/ 55492000
*/*                                                          @OY15325*/ 55496000
*/*    THE LENGTH OF THIS AREA IS NOT INCLUDED IN FSILEN     @OY15325*/ 55500000
*/*                                                          @OY15325*/ 55504000
*DCL 1 ORDSSP1  BASED(ADDR(ORDSSEND)), /*INITL PARMS FOR START FSA      55508000
*                                                            @OZ78298*/ 55512000
*     3 ORDSSPF1 BIT(8),               /*FLAG BYTE 1 (INITIAL)          55516000
*                                                            @OZ78298*/ 55520000
*      5 ORDSSS1  BIT(1),                   /*INITIAL SINGLE SPACE      55524000
*                                                            @OZ78298*/ 55528000
*      5 ORDSSS2  BIT(1),                   /*INITIAL DOUBLE SPACE      55532000
*                                                            @OZ78298*/ 55536000
*      5 ORDSSS3  BIT(1),                   /*INITIAL TRIPLE SPACE      55540000
*                                                            @OZ78298*/ 55544000
*      5 ORDSSSR  BIT(1),                   /*INIT. DS SPECD SPACE      55548000
*                                                            @OZ78298*/ 55552000
*      5 *        BIT(4),                   /* RESERVED      @OZ78298*/ 55556000
*     3 ORDSSPF2 BIT(8),               /*FLAG BYTE 2 (INITIAL)          55560000
*                                                            @OZ78298*/ 55564000
*      5 ORDSSKP  BIT(1),                   /*INITIAL PAGE CKPT INTV    55568000
*                                                            @OZ78298*/ 55572000
*      5 ORDSSKT  BIT(1),                   /*INITIAL TIME CKPT INTV    55576000
*                                                            @OZ78298*/ 55580000
*      5 ORDSSKN  BIT(1),                   /*INIT. CKPT DISABLED       55584000
*                                                            @OZ78298*/ 55588000
*      5 *        BIT(5),                   /* RESERVED      @OZ78298*/ 55592000
*     3 ORDSSPF3 BIT(8),               /*FLAG BYTE 3 (INITIAL)          55596000
*                                                            @OZ78298*/ 55600000
*      5 ORDSSDN  BIT(1),                   /*INIT. NPRO TIMER OFF      55602000
*                                                            @OZ78298*/ 55604000
*      5 ORDSSIN  BIT(1),                   /*INITIAL NPRO TIMER        55606000
*                                                            @OZ78298*/ 55607000
*      5 *        BIT(6),                   /* RESERVED      @OZ78298*/ 55608500
*     3 *        BIT(8),               /*RESERVED            @OZ78298*/ 55608600
*     3 ORDSSKI  FIXED(31),            /*INITIAL CKPT INTERVAL          55609600
*                                                            @OZ78298*/ 55610600
*     3 ORDSSNI  FIXED(31),            /*INITIAL NPRO TIMER INTVL       55611600
*                                                            @OZ78298*/ 55612600
*     3 ORDSSND1 CHAR(0) BDY(WORD);    /*END OF SECTION      @OY15325*/ 55613600
*@SPACE;                                                                55614600
*/*                                                          @OY15325*/ 55615600
*/*    MESSAGE ROUTING FOR FSA RELATED MESSAGES              @OY15325*/ 55616600
*/*                                                          @OY15325*/ 55617600
*/*    THE MESSAGE ROUTING AREA SHOULD NOT BE ASSUMED        @OY15325*/ 55617800
*/*    TO BE CONTIGUOUS WITH THE START FSA PARAMETER         @OY15325*/ 55618000
*/*    LIST OR DEVICE INITIALIZATION PARMS.  FOR THIS        @OY15325*/ 55625000
*/*    REASON, WHEN ACCESSING THIS AREA THE FIELD            @OY15325*/ 55632000
*/*    ORDSSSP2 SHOULD BE USED TO OBTAIN ITS LOCATION        @OY15325*/ 55639000
*/*                                                          @OY15325*/ 55646000
*/*    THE LENGTH OF THIS AREA IS NOT INCLUDED IN FSILEN     @OY15325*/ 55653000
*/*                                                          @OY15325*/ 55660000
*DCL 1 ORDSS2   BASED(ADDR(ORDSSND1)), /*MESSAGE PARMS AREA FOR         55667000
*                                             START FSA      @OY15325*/ 55674000
*     3 ORDSS2LN FIXED(15),            /*LENGTH OF THIS AREA @OY15325*/ 55681000
*     3 ORDSS2FL BIT(8),               /*MESSAGE ROUTING FLAG           55688000
*                                                            @OY15325*/ 55695000
*       5 ORDSS2CS BIT(1),             /*CONSOLE ID USED     @OY15325*/ 55702000
*     3   *      CHAR(1),              /*RESERVED            @OY15325*/ 55709000
*     3 ORDSS2RC CHAR(16),             /*MCS ROUTING CODE MASK          55716000
*                                             FOR FSA RELATED           55723000
*                                             MESSAGES       @OY15325*/ 55730000
*     3 ORDSS2CN FIXED(31),            /*CONSOLE ID IN WTO FORMAT       55737000
*                                             FOR FSA RELATED           55744000
*                                             MESSAGES       @OY15325*/ 55751000
*     3   *      CHAR(3*4),            /*RESERVED            @OY15325*/ 55758000
*     3 ORDSSND2 CHAR(0) BDY(WORD);    /*END OF SECTION      @OY15325*/ 55765000
*@EJECT;                                                                55772000
*/********************************************************************/ 55800000
*/*                                                                  */ 55900000
*/*    ORDER DATA ASSOCIATED WITH THE 'SET' ORDER                    */ 56000000
*/*                                                                  */ 56100000
*/********************************************************************/ 56200000
*@SPACE;                                                                56300000
*DCL 1 ORDST   BASED(ADDR(ORDBEND)),  /*DATA FOR SET ORDER*/            56400000
*     3 ORDSTR1 BIT(8),              /*REQUEST FLAG BYTE     @OZ78298*/ 56500000
*      5 ORDSTSN BIT(1),                   /*SET NPRO INTERVAL          56600000
*                                                            @OZ78298*/ 56601000
*      5 ORDSTDN BIT(1),                   /*DISABLE NPRO TIMER         56700000
*                                                            @OZ78298*/ 56701000
*     3    *    PTR(24),             /*RESERVED*/                       57200000
*     3 ORDSTNI FIXED(31),           /*NPRO TIME INTRVL IN SECS         57300000
*                                                            @OZ78298*/ 57301000
*     3 ORDSTXT PTR(31),             /*RESERVED POINTER      @OZ78298*/ 57410000
*     3    *    CHAR(3*4);           /*RESERVED              @OZ78298*/ 57420000
*@EJECT;                                                                57500000
*/********************************************************************/ 57600000
*/*                                                                  */ 57700000
*/*    ORDER DATA ASSOCIATED WITH THE 'SYNCH' ORDER                  */ 57800000
*/*                                                                  */ 57900000
*/********************************************************************/ 58000000
*@SPACE;                                                                58100000
*DCL 1 ORDSY   BASED(ADDR(ORDBEND)),  /*DATA FOR SYNCH ORDER*/          58200000
*     3 ORDSYR1  BIT(8),           /*REQUEST FLAG BYTE (SYNCH ACTION)   58210000
*                                         (IF ZERO, SYNCH TO OOP)       58220000
*                                                            @OZ78298*/ 58220100
*      5 ORDSYBCP BIT(1),               /*SYNCH TO PREVIOUS CKPT        58230000
*                                                            @OZ78298*/ 58230100
*      5 ORDSYFCP BIT(1),               /*SYNCH TO NEXT CKPT @OZ78298*/ 58240000
*      5 ORDSYBTM BIT(1),               /*SYNCH TO BEGINNING OF         58250000
*                                          CURRENT TRANSMISSION         58260000
*                                                            @OZ78298*/ 58260100
*      5 ORDSYETM BIT(1),               /*SYNCH TO END OF CURRENT       58270000
*                                          TRANSMISSION      @OZ78298*/ 58280000
*      5 ORDSYBDS BIT(1),               /*SYNCH TO BEG. OF DS           58290000
*                                                            @OZ78298*/ 58290100
*      5 ORDSYEDS BIT(1),               /*SYNCH TO END OF DS @OZ78298*/ 58300000
*     3 ORDSYR2  BIT(8),           /*REQUEST FLAG BYTE (REPOSITION)     58310000
*                                                            @OZ78298*/ 58310100
*      5 ORDSYRI  BIT(1),               /*INCREMENT PAGE POSITION       58320000
*                                                            @OZ78298*/ 58320100
*      5 ORDSYRD  BIT(1),               /*DECREMENT PAGE POSITION       58330000
*                                                            @OZ78298*/ 58330100
*      5 ORDSYNR  BIT(1),               /*DO NOT REPOSITION PAST END    58340000
*                                          OF DATA SET AT OOP           58350000
*                                                            @OZ78298*/ 58350100
*     3 ORDSYR3  BIT(8),           /*REQUEST FLAG BYTE (UPDATE)         58360000
*                                       (DEVICE RELATED ITEMS)          58370000
*                                                            @OZ78298*/ 58370100
*      5 ORDSYS1 BIT(1),                /*SET SINGLE SPACE   @OZ78298*/ 58380000
*      5 ORDSYS2 BIT(1),                /*SET DOUBLE SPACE   @OZ78298*/ 58390000
*      5 ORDSYS3 BIT(1),                /*SET TRIPLE SPACE   @OZ78298*/ 58400000
*      5 ORDSYSR BIT(1),                /*USE DS SPECIFIED SPACE        58410000
*                                                            @OZ78298*/ 58410100
*      5 ORDSYKP BIT(1),                /*PAGE INTERVAL CKPTS           58420000
*                                                            @OZ78298*/ 58420100
*      5 ORDSYKT BIT(1),                /*TIME INTERVAL CKPTS           58430000
*                                                            @OZ78298*/ 58430100
*      5 ORDSYKN BIT(1),                /*DISABLE CHECKPOINTING         58440000
*                                                            @OZ78298*/ 58440100
*      5 ORDSYRL BIT(1),                /*RELOAD RESOURCES FOR          58450000
*                                          DATA SET AT OOP   @OZ78298*/ 58460000
*     3 ORDSYR4  BIT(8),           /*REQUEST FLAG BYTE (UPDATE)         58470000
*                                       (DATA SET RELATED ITEMS)        58480000
*                                                            @OZ78298*/ 58480100
*      5 ORDSYCI BIT(1),                /*INCREMENT COPY COUNT          58490000
*                                                            @OZ78298*/ 58490100
*      5 ORDSYCD BIT(1),                /*DECREMENT COPY COUNT          58500000
*                                                            @OZ78298*/ 58501000
*      5 ORDSYCR BIT(1),                /*REPLACE COPY COUNT @OZ78298*/ 58510000
*     3 ORDSYR5  BIT(8),           /*REQUEST FLAG BYTE (INTERRUPT)      58520000
*                                                            @OZ78298*/ 58520100
*      5 ORDSYDC BIT(1),                /*DS AT OOP COMPLETE @OZ78298*/ 58530000
*      5 ORDSYDI BIT(1),                /*DS AT OOP INCOMPLETE          58540000
*                                                            @OZ78298*/ 58540100
*      5 ORDSYVA BIT(1),                /*CKPT FOR OOP DS VALID         58550000
*                                                            @OZ78298*/ 58550100
*      5 ORDSYNV BIT(1),                /*CKPT FOR OOP DS INVALID       58560000
*                                                            @OZ78298*/ 58560100
*     3 ORDSYR6  BIT(8),           /*REQUEST FLAG BYTE (MISC.)          58590000
*                                                            @OZ78298*/ 58590100
*      5 ORDSYMV BIT(1),                /*PRINT ORDSYMSG ON DATA SET    58600000
*                                         AT OOP             @OZ78298*/ 58610000
*      5 ORDSYDS BIT(1),                /*REJECT SYNCH IF DATA          58620000
*                                         SET NOT ACTIVE AT OOP         58630000
*                                                            @OZ78298*/ 58630100
*      5 ORDSYSP BIT(1),                /*JOB TRAILER PAGE IS           58631100
*                                          REQUIRED FOR DS AT OOP       58632100
*                                                            @OZ78298*/ 58633100
*      5 ORD6EOG BIT(1),                /*End of Output Group           58634000
*                                                            @410D017*/ 58636000
*      5 ORD6CLP BIT(1),                /*Clear the pipeline            58637000
*                                                            @OW46639*/ 58638000
*     3    *     PTR(8),           /*RESERVED STATUS FLAG BYTE          58640000
*                                                            @OZ78298*/ 58640100
*     3    *     PTR(8),           /*RESERVED                @OZ78298*/ 58650000
*     3 ORDSYNP  FIXED(31),        /*NO. OF PGS TO REPOS. (SIGNED)      58660000
*                                                            @OZ78298*/ 58660100
*     3 ORDSYKI  FIXED(31),        /*CHECKPOINT INTERVAL (SEC OR PGS)   58670000
*                                                            @OZ78298*/ 58670100
*     3 ORDSYCP  FIXED(15),        /*NUMBER OF COPIES (SIGNED)          58680000
*                                                            @OZ78298*/ 58680100
*     3    *     PTR(15),          /*RESERVED                @OZ78298*/ 58690000
*     3 ORDSYSMX PTR(31),          /*PTR TO SET ORDER PARM LIST         58700000
*                                     (LENGTH OF SET ORDER NOT          58701000
*                                      INCLUDED IN FSILEN)   @OY15325*/ 58704000
*     3 ORDSYXTN PTR(31),          /*RESERVED POINTER        @OZ78298*/ 58710000
*     3    *     CHAR(3*4),        /*RESERVED                @OZ78298*/ 58711000
*     3 ORDSYMSG CHAR(120);        /*MESSAGE TEXT TO BE PRESENTED       58720000
*                                      ON THE DATA SET AT OOP */        58730000
*@SPACE(4);                                                             58740000
*/********************************************************************/ 60400000
*/*                                                                  */ 60500000
*/*    ORDER DATA ASSOCIATED WITH  'INTERVENTION'                    */ 60600000
*/*                                                                  */ 60700000
*/********************************************************************/ 60800000
*@SPACE;                                                                60900000
*DCL 1 ORDIV   BASED(ADDR(ORDBEND)), /*INTERVENTION ORDER  */           61000000
*     3 ORDIVF1  BIT(8),             /*FLAG BYTE 1 - INTERVTN TYPE      61010000
*                                                            @OZ78298*/ 61010100
*      5 ORDIVRBT BIT(1),               /*BTS INTERVTN REQUESTED        61020000
*                                                            @OZ78298*/ 61020100
*      5 ORDIVRFL BIT(1),               /*FLASH INTERVTN REQUESTED      61030000
*                                                            @OZ78298*/ 61030100
*      5 ORDIVRFO BIT(1),               /*FORMS INTERVTN REQUESTED      61040000
*                                                            @OZ78298*/ 61040100
*      5 ORDIVRCF BIT(1),               /*CONT. FORMS INTERVTN REQ      61050000
*                                                            @OZ78298*/ 61050100
*     3 ORDIVF2  BIT(8),             /*FLAG BYTE 2 - UPDATE TYPE        61060000
*                                                            @OZ78298*/ 61060100
*      5 ORDIVUBT BIT(1),               /*BTS UPDATE REQUESTED          61070000
*                                                            @OZ78298*/ 61070100
*      5 ORDIVUFL BIT(1),               /*FLASH UPDATE REQUESTED        61080000
*                                                            @OZ78298*/ 61080100
*      5 ORDIVUFO BIT(1),               /*FORMS UPDATE REQUESTED        61090000
*                                                            @OZ78298*/ 61090100
*      5 ORDIVUCF BIT(1),               /*CONT. FORMS UPDATE REQST      61100000
*                                                            @OZ78298*/ 61101000
*     3   *      PTR(16),            /*RESERVED*/                       61110000
*     3 ORDIVBTT CHAR(8),            /*TOKEN FOR BTS INTERVENTION       61120000
*                                                            @OZ78298*/ 61120100
*     3 ORDIVFLT CHAR(8),            /*TOKEN FOR FLASH INTERVENTION     61130000
*                                                            @OZ78298*/ 61130100
*     3 ORDIVFOT CHAR(8),            /*TOKEN FOR FORMS INTERVENTION     61140000
*                                                            @OZ78298*/ 61140100
*     3 ORDIVCFT CHAR(8),            /*TOKEN FOR CFS INTERVENTION       61150000
*                                                            @OZ78298*/ 61150100
*     3 ORDIVXTN PTR(31),            /*RESERVED POINTER      @OZ78298*/ 61160000
*     3   *      CHAR(3*4);          /*RESERVED              @OZ78298*/ 61260000
*@EJECT;                                                                61700000
*/********************************************************************/ 61800000
*/*                                                                  */ 61900000
*/*   GETDS FUNCTION DEPENDENT AREA                                  */ 62000000
*/*                                                                  */ 62100000
*/********************************************************************/ 62200000
*@SPACE;                                                                62300000
*DCL 1 GDSPARM BASED(ADDR(FSIFEND)),  /*GETDS FUNC DEPENDENT AREA*/     62400000
*@SPACE;                                                                62500000
*     3 GDSFLGR1  BIT(8),           /*REQUEST FLAG BYTE 1 */            62600000
*      5 GDSJHDR  BIT(1),                  /*JOB HEAD PAGE REQUIRED*/   62700000
*      5 GDSJTRL  BIT(1),                  /*JOB TRAIL PAGE REQUIRED*/  62800000
*      5 GDSHDR   BIT(1),                  /*DS HEAD PAGE REQUIRED*/    62900000
*      5 GDSHTDS  BIT(1),                  /*DS RTND TO BE ON SAME      63000000
*                                                PAGE AS JOB HEAD       63100000
*                                                OR TRAIL PAGE*/        63200000
*      5 GDSFRMRK BIT(1),                 /*FORMS MARK REQUIRED*/       63300000
*      5 GDSCMC   BIT(1),                 /*COPY MARK TO BE CHANGED     63400000
*                                                ON DATA SET*/          63500000
*      5 GDSCMCPY BIT(1),                 /*COPY MARK TO BE CHANGED     63600000
*                                                ON COPIES*/            63700000
*      5 GDSTRKDS BIT(1),                 /*TRACK THE DATA SET AND      63800000
*                                             SEND AT OOP*/             63900000
*     3 GDSFLGR2  BIT(8),           /*REQUEST FLAG BYTE 2    @OZ78298*/ 64000000
*      5 GDSJHSWB BIT(1),                 /*USE SWBS DEFINED FOR JOB    64010000
*                                                HEADER PAGE @OZ78298*/ 64020000
*      5 GDSJTSWB BIT(1),                 /*USE SWBS DEFINED FOR JOB    64030000
*                                                TRAILER PG  @OZ78298*/ 64040000
*      5 GDS2EOG  BIT(1),                 /*End of Output Group         64050000
*                                                            @410D017*/ 64060000
*      5 GDS2CMNO BIT(1),                 /*COPY MARKS to be            64070000
*                                                supressed   @R10LCPM*/ 64080000
*     3 GDSFLGS1  BIT(8),           /*STATUS FLAG BYTE*/                64100000
*      5 GDSCKP   BIT(1),                 /*CHECKPOINT ARE FILLED IN*/  64200000
*      5 GDSALLOC BIT(1),                 /*DS ALLOCATED- ID IN GDSID*/ 64300000
*      5 GDSJNEWS BIT(1),                 /*DATA SET IS JESNEWS         64310000
*                                                            @313D007*/ 64320000
*      5   *      BIT(1),                 /*RESERVED*/                  64400000
*      5 GDSNALLC BIT(1),                 /*DS NOT ALLOCATED*/          64500000
*      5 GDSRSTCT BIT(1),                 /*PAGE/REC CNT TO BE RESET    64510000
*                                                            @OZ78298*/ 64510100
*      5 GDSSJERR BIT(1),                 /*ERROR IN SJF PROCESSING     64520000
*                                                            @OZ78298*/ 64520100
*     3    *      PTR(8),           /*STATUS FLAG BYTE RESERVED*/       64600000
*     3 GDSCKPL   FIXED(31),        /*LENGTH OF CHKPT AREA SUPPLIED*/   64700000
*     3 GDSCKPA   PTR(31),          /*POINTER TO CHKPT AREA*/           64800000
*     3 GDSJSPA   PTR(31),          /*POINTER TO JSPA*/                 64900000
*     3 GDSDDTK  CHAR(8) BDY(WORD), /*DD SWB TOKEN*/                    65300000
*      5 GDSDDRS   PTR(31),            /*RESERVED*/                     65400000
*      5 GDSDDPT   PTR(31),            /*PTR TO ADDR OF SWB CHAIN*/     65500000
*     3 GDSOUTK  CHAR(8) BDY(WORD), /*OUTPUT SWB TOKEN*/                65510000
*      5 GDSOUTRS  PTR(31),            /*RESERVED*/                     65520000
*      5 GDSOUTPT  PTR(31),            /*PTR TO ADDR OF SWB CHAIN*/     65530000
*     3 GDSJDVTN  CHAR(8),          /*JDVT NAME USED AT CREATION*/      65600000
*     3 GDSDSID   CHAR(12),         /*DATA SET IDENTIFIER*/             65700000
*     3 GDSEXTN   PTR(31),          /*RESERVED POINTER       @OZ78298*/ 65710000
*     3 GDSRECFM  BIT(8),           /*Data set record format @OW07588*/ 65710200
*     3 GDSMRECL  BIT(16),          /*Maximum ds record len  @OW07588*/ 65710400
*     3    *      CHAR(1),          /*Reserved for future use@OW07588*/ 65710600
*     3    *      CHAR(2*4),        /*RESERVED               @OW07588*/ 65711000
*     3 GDSSJMSG  CHAR(80);         /*MSG TEXT FOR SJF ERROR @OZ78298*/ 65720000
*@EJECT;                                                                65730000
*/********************************************************************/ 65900000
*/*                                                                  */ 66000000
*/*   GETREC FUNCTION DEPENDENT AREA                                 */ 66100000
*/*                                                                  */ 66200000
*/********************************************************************/ 66300000
*@SPACE;                                                                66400000
*DCL 1 GLRPARM BASED(ADDR(FSIFEND)),  /*GETREC FUNC DEPENDENT AREA*/    66500000
*     3 GLRFLGR1  BIT(8),             /*REQUEST FLAG BYTE*/             66600000
*      5 GLRREC1  BIT(1),                 /*REQUEST FIRST REC IN DS*/   66700000
*      5 GLRRECN  BIT(1),                 /*REQUEST NEXT SEQUENTL REC*/ 66800000
*      5 GLRRECS  BIT(1),                 /*REQUEST SPECIFIED REC*/     66900000
*@SPACE;                                                                67000000
*     3   *       PTR(8),             /*REQUEST FLAG BYTE RESERVED      67100000
*                                                            @OZ78298*/ 67101000
*@SPACE;                                                                67200000
*     3 GLRFLGS1  BIT(8),             /*STATUS FLAG BYTE*/              67300000
*      5 GLREOF   BIT(1),                 /*END OF FILE INDICATOR*/     67400000
*      5 GLRNBA   BIT(1),                 /*NO BUFFERS AVAILABLE*/      67500000
*      5 GLRIPL   BIT(1),                 /*INVALID PARAMETER LIST      67600000
*                                                            @OZ78298*/ 67601000
*      5 GLRIOE   BIT(1),                 /*I/O ERROR ENCOUNTERED       67800000
*                                                            @OZ78298*/ 67801000
*      5 GLRLGE   BIT(1),                 /*LOGIC ERROR/ABEND OCCURED   67900000
*                                                            @OZ78298*/ 67901000
*      5 GLRNOI   BIT(1),                 /*NO INDEX RETURNED           67910000
*                                                            @OZ78298*/ 67910100
*@SPACE;                                                                68000000
*     3   *       PTR(8),             /*STATUS FLAG BYTE RESERVED*/     68100000
*@SPACE;                                                                68200000
*     3 GLRINDX   PTR(31),            /*POINTER TO RETURNED INDEX*/     68300000
*     3 GLRECID   CHAR(8),            /*POINTER TO REC ON SPOOL*/       68400000
*     3 GLRDSID   CHAR(12),           /*DS IDENTIFIER*/                 68500000
*     3 GLREXTN   PTR(31),            /*RESERVED POINTER     @OZ78298*/ 68510000
*     3   *       CHAR(3*4);          /*RESERVED             @OZ78298*/ 68520000
*@SPACE(2);                                                             68610000
*/********************************************************************/ 68700000
*/*                                                                  */ 68800000
*/*   FREEREC FUNCTION DEPENDENT AREA                                */ 68900000
*/*                                                                  */ 69000000
*/********************************************************************/ 69100000
*@SPACE;                                                                69200000
*DCL 1 FLRPARM BASED(ADDR(FSIFEND)),  /*FREEREC FUNC DEPENDENT AREA*/   69300000
*@SPACE;                                                                69400000
*     3 FLRINDX   PTR(31),            /*POINTER TO INDEX FREED          69500000
*                                                            @OZ78298*/ 69501000
*     3 FLRDSID   CHAR(12),           /*DS INDENTIFIER*/                69600000
*     3 FLREXTN   PTR(31),            /*RESERVED POINTER     @OZ78298*/ 69610000
*     3    *      CHAR(3*4);          /*RESERVED             @OZ78298*/ 69620000
*@EJECT;                                                                69710000
*/********************************************************************/ 69800000
*/*                                                                  */ 69900000
*/*   RELDS FUNCTION DEPENDENT AREA                                  */ 70000000
*/*                                                                  */ 70100000
*/********************************************************************/ 70200000
*@SPACE;                                                                70300000
*DCL 1 RDSPARM BASED(ADDR(FSIFEND)),  /*RELDS FUNC DEPENDENT AREA*/     70400000
*     3 RDSSTAT   BIT(8),             /*DATA SET STATUS BYTE*/          70500000
*     4 RDSFLGS1  BIT(8),             /*Alternate name for RDSSTAT      70510000
*                                                            @R03P581*/ 70520000
*      5 RDSDONE  BIT(1),                /*DS COMPLETELY PROCESSED*/    70600000
*      5 RDSINC   BIT(1),                /*DS NOT ENTIRELY PROCESSED*/  70700000
*      5 RDSCKPI  BIT(1),                /*DS CHKPT INVALID*/           70800000
*      5 RDSUNPR  BIT(1),                /*DS UNPRINTABLE    @OZ78298*/ 70810000
*@SPACE;                                                                70900000
*     3    *      PTR(24),            /*RESERVED*/                      71000000
*@SPACE;                                                                71100000
*     3 RDSDSID   CHAR(12),           /*DATA SET IDENTIFIER*/           71200000
*     3 RDSEXTN   CHAR(4),            /*RESERVED             @313P009*/ 71205000
*     3 RDSMIDSE  CHAR(8),            /*MESSAGE ID           @313ISP1*/ 71210000
*     3    *      FIXED(31);          /*RESERVED             @313P022*/ 71211000
*@SPACE(2);                                                             71220000
*/********************************************************************/ 71400000
*/*                                                                  */ 71500000
*/*   CHKPT FUNCTION DEPENDENT AREA                                  */ 71600000
*/*                                                                  */ 71700000
*/********************************************************************/ 71800000
*@SPACE;                                                                71900000
*DCL 1 CHKPARM BASED(ADDR(FSIFEND)),  /*CHKPT FUNC DEPENDENT AREA*/     72000000
*@SPACE;                                                                72100000
*     3 CHKADR    PTR(31),            /*POINTER TO CHKPT BUFFER*/       72200000
*     3 CHKFLGR1  BIT(8),             /*REQUEST FLAG BYTE    @OZ78298*/ 72210000
*      5 CHKFCWRT BIT(1),               /*FORCE WRITE OF THE CHK REC    72220000
*                                                            @OZ78298*/ 72220100
*     3    *      PTR(8),             /*RESERVED             @OZ78298*/ 72230000
*     3 CHKFLGS1  BIT(8),             /*STATUS FLAG BYTE     @OZ78298*/ 72240000
*      5 CHKFCERR BIT(1),               /*PERMANENT ERROR ATTEMPTING    72250000
*                                         CHK WRITE, REQUEST IGNORED    72260000
*                                                            @OZ78298*/ 72260100
*     3    *      PTR(8),             /*RESERVED             @OZ78298*/ 72270000
*     3 CHKDSID   CHAR(12),           /*DS IDENTIFIER        @OZ78298*/ 72303000
*     3 CHKEXTN   PTR(31),            /*RESERVED POINTER     @OZ78298*/ 72313000
*     3    *      CHAR(3*4);          /*RESERVED             @OZ78298*/ 72323000
*@EJECT;                                                                72400000
*/********************************************************************/ 72500000
*/*                                                                  */ 72600000
*/*  POST FUNCTION DEPENDENT AREA                                    */ 72700000
*/*                                                                  */ 72800000
*/********************************************************************/ 72900000
*@SPACE;                                                                73000000
*DCL 1 POSTPARM BASED(ADDR(FSIFEND)), /*POST FUNC DEPENDENT AREA*/      73100000
*     3 POSTFLS1  BIT(8),               /*STATUS FLAG BYTE*/            73200000
*      5 POSTGDS  BIT(1),                    /*GETDS REQST SATISFD*/    73300000
*@SPACE;                                                                73400000
*     3    *      PTR(24),             /*RESERVED*/                     73500000
*@SPACE;                                                                73600000
*     3 POSFDATA  PTR(31),             /*RETURNED CONNECT DATA*/        73700000
*     3    *      FIXED(31);           /*RESERVED*/                     73710000
*@SPACE(3);                                                             73810000
*/********************************************************************/ 73900000
*/*                                                                  */ 74000000
*/*  SEND FUNCTION DEPENDENT AREA                                    */ 74100000
*/*                                                                  */ 74200000
*/********************************************************************/ 74300000
*@SPACE;                                                                74400000
*/*  Extended send types                                     @R05LOPI*/ 74410000
*DCL SNDE58OK  FIXED(8) CONSTANT(1);  /* Unsolicited request to issue   74420000
*                                        an EOD-OK ENF58 signal         74430000
*                                                            @R05LOPI*/ 74440000
*DCL SNDE58ER  FIXED(8) CONSTANT(2);  /* Unsolicited request to issue   74450000
*                                        an EOD_Error ENF58 signal      74460000
*                                                            @R05LOPI*/ 74470000
*@SPACE;                                                                74480000
*DCL 1 SNDPARM BASED(ADDR(FSIFEND)),  /*SEND FUNC DEPENDENT AREA*/      74500000
*     3 SNDTYPE   BIT(8),              /* SEND FLAG BYTE */             74600000
*      5 SNDTYRSP BIT(1),                 /*RESPONSE TO AN ORDER*/      74700000
*      5 SNDTYTDS BIT(1),                 /*SEND REQUESTED VIA GDSFLGR1 74800000
*                                         INDICATING DS REACHED OOP*/   74900000
*      5 SNDTYFIT BIT(1),                 /*REQUEST FOR FSA INIT TERM   74910000
*                                                            @OZ90000*/ 74920000
*      5 SNDTYINT BIT(1),                 /*UNSOLICITED DEVICE          74930000
*                                           INTERVENTION DETECTED       74940000
*                                           FROM THE FSA     @OY31210*/ 74950000
*      5 SNDTYICL BIT(1),                 /*UNSOLICITED DEVICE          74960000
*                                           INTERVENTION CLEARED        74970000
*                                           FROM THE FSA     @OY31210*/ 74980000
*      5 SNDTYDNR BIT(1),                 /*Unsolicited device not      74990000
*                                           Responding RECVD            75000000
*                                           From the FSA     @OW27145*/ 75010000
*      5 SNDTYDCL BIT(1),                 /*Unsolicited device not      75020000
*                                           Responding CLEARED          75030000
*                                           From the FSA     @OW27145*/ 75040000
*      5 SNDTYEXT BIT(1),                 /*Extended send type          75050000
*                                           specified        @R05LOPI*/ 75060000
*@SPACE;                                                                75100000
*     3  SNDTYP2  FIXED(8),            /* Extended send type @R05LOPI*/ 75110000
*     3     *     PTR(16),             /*RESERVED            @R05LOPI*/ 75200000
*     3  SNDRSPTR PTR(31),             /*RESPONSE AREA POINTER FOR      75300000
*                                          UNSOLICITED SENDS */         75400000
*     3     *     FIXED(31);           /*RESERVED*/                     75410000
*@EJECT;                                                                75410400
*/********************************************************************/ 75410800
*/*                                                                  */ 75411200
*/*  USER DEFINED TRACE DATA AREA.                                   */ 75411600
*/*                                                                  */ 75412000
*/*      Pointed to by field FSITEXT in Parameter List Header.       */ 75412400
*/*                                                                  */ 75412800
*/********************************************************************/ 75413200
*@SPACE;                                                                75413600
*DCL 1 FSIUDATA BASED(FSITEXT),  /* User defined trace data. @OY34990*/ 75414000
*     3 FSIUDLEN FIXED(31),      /* Length of user data area, this      75414400
*                                   includes the length word and the    75414800
*                                   routine name as well as the user    75415200
*                                   trace data in FSIUDTXT. Must be     75415600
*                                   2K or less.              @OY34990*/ 75416000
*     3 FSIUDNAM CHAR(8),        /* Routine name generating the         75416400
*                                   FSIREQ.                  @OY34990*/ 75416800
*     3 FSIUDTXT CHAR(*);        /* User specified data that is to      75417200
*                                   be placed in the GTF trace when     75417600
*                                   GTF tracing is turned on @OY34990*/ 75418000
*@EJECT;                                                                75420000
*/********************************************************************/ 75430000
*/*                                                                  */ 75440000
*/*  EXTENSION AREA DEFINITION                                       */ 75450000
*/*                                                                  */ 75460000
*/********************************************************************/ 75470000
*DCL 1 FSIED BASED(FSIPEXT) BDY(WORD),  /*GETDS EXT. AREA    @313P040*/ 75480000
*     3 FSIEXNUM FIXED(15),        /*NUMBER OF EXTENSIONS    @313ISP1*/ 75490000
*     3 FSIEXLEN FIXED(15),        /*LENGTH OF EXTENSIONS    @313P022*/ 75500000
*     3 FSIEHID  CHAR(4),          /*EXTENSION HEADER ID     @313P022*/ 75510000
*     3 *         FIXED(31),       /*RESERVED                @313P022*/ 75520000
*     3 *         FIXED(31),       /*RESERVED                @313P022*/ 75530000
*     3 *         FIXED(31),       /*RESERVED                @313P022*/ 75540000
*     3 *         FIXED(31);       /*RESERVED                @313P040*/ 75550000
*@SPACE;                                                                75560000
*/********************************************************************/ 75570000
*/*                                                                  */ 75580000
*/* EXTENSION AREA FOR GETDS                                         */ 75590000
*/*                                                                  */ 75600000
*/********************************************************************/ 75610000
*@SPACE;                                                                75620000
*DCL 1 FSIEA BASED,             /*EXTENSION AREA FOR GETDS   @313P040*/ 75625000
*     3 FSIEGLEN FIXED(15),     /*LENGTH OF EXTENSION AREA   @313ISP1*/ 75630000
*     3 FSIEGVSN FIXED(15),     /*VERSION NUMBER             @313ISP1*/ 75640000
*     3 FSIEGFID FIXED(31),     /*FUNCTION ID                @313ISP1*/ 75650000
*     3 FSIEGUTK CHAR(80),      /*USER TOKEN                 @313P009*/ 75660000
*     3 FSIEGRTK CHAR(80),      /*RESOURCE TOKEN             @313D007*/ 75670000
*     3 FSIEGOGT CHAR(20);      /*OUTPUT GROUP TOKEN         @313D007*/ 75680000
*DCL FSIEGVNM FIXED(31) CONSTANT(2); /*CURRENT VERSION NO.   @313ISP1*/ 99999999
