          MACRO                                                         00100000
          IAZSMF58 ,                                                    00200000
*/********************************************************************/ 00300000
*/*MODULE NAME = IAZSMF58                                            */ 00400000
*/*                                                                  */ 00500000
*/*DESCRIPTIVE NAME = JES SMF NETWORK SIGNOFF RECORD                 */ 00600000
*/********************************************************************/ 00700000
.*                                                                   *  01300000
.* COPYRIGHT = LICENSED MATERIALS-PROPERTY OF IBM                    *  01310000
.*             THIS MACRO IS "RESTRICTED MATERIALS OF IBM"           *  01320000
.*             5645-001 (C) COPYRIGHT IBM CORP 1983, 1997            *  01330000
.*                                                                   *  01340000
.* STATUS = HBB6603                                                  *  01400000
.*                                                                   *  01500000
.*01* EXTERNAL CLASSIFICATION:  NONE                                 *  01510000
.*01* END OF EXTERNAL CLASSIFICATION:                                *  01520000
.*                                                                   *  01530000
.* MODULE TYPE = MACRO                                               *  01600000
.*                                                                   *  01700000
.* INVOCATION =                                                      *  01800000
.*               BAL  - IAZSMF58 (NO DSECT CREATED - START OF RECORD *  01900000
.*               PL/S - NONE                                         *  02000000
.*                                                                   *  02010000
.* CHANGE ACTIVITY:                                                  *  02100000
.*                                                                   *  02200000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3, JBB1329)        *  02300000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02310000
.*                                                                   *  02400000
.* A000000-999999    CREATED FOR MVS 1.3.3                         @133 02420000
.*********************************************************************  02500000
         SPACE 2                                                        02600000
* SWITCH TO DETERMINE WHETHER TO GENERATE EQUATES FOR WRITING REC       02700000
         GBLB  &EQUSW                                                   02800000
         SPACE 1                                                        02900000
SMFRCD58 EQU   *                   START OF RECORD                      03000000
SMF58PTR EQU   *                   HEADER SEGMENT              @OZ82688 03100000
SMF58LEN DS    CL2                 RECORD LENGTH                        03200000
SMF58SEG DS    CL2                 SEGMENT DESCRIPTOR                   03300000
         SPACE 2                                                        03400000
*  BEGINNING OF JMR OR HASP SMF RECORD                                  03500000
         SPACE 1                                                        03600000
SMF58FLG DC    BL1'0'              HEADER FLAG BYTE                     03700000
SMF58RTY DC    BL1'0'              RECORD TYPE                          03800000
SMF58TME DC    BL4'0'              TOD, USING FORMAT FROM TIME MACRO    03900000
SMF58DTE DC    PL4'0000'           DATE IN PACKD DECIMAL FORM  00YYDDDF 04000000
SMF58SID DC    CL4' '              SYSTEM IDENTIFICATION                04100000
         SPACE 2                                                        04200000
* HEADER FOR HASP SUBSYS RECORD TYPES 58                                04300000
SMFJ58   EQU   58                  NETWORK SIGNOFF REC TYPE    @OZ82688 04400000
         SPACE 1                                                        04500000
SMF58SBS DC    XL2'0002'           HASP SUBSYSTEM ID                    04600000
SMF58HSP EQU   X'0002'                JES2 ID                           04700000
SMF58SUB DC    BL2'0'              RECORD SUBTYPE                       04800000
SMF58LRR DC    BL2'0'              LENGTH OF REST OF RECORD             04900000
         AIF (NOT &EQUSW).SKIP                                          05000000
SMF58STR EQU   *-SMF58LEN          LENGTH OF HEADING SECTIONS           05100000
.SKIP    ANOP                                                           05200000
* BEGINNING OF HASP TYPE 58 NETWORK SIGNOFF RECORD AFTER TWO HDRS       05300000
         SPACE 1                                                        05400000
SMF58NNM DC    CL8' '              NODE NAME                            05500000
SMF58MEM DC    BL1'0'              MEMBER NUMBER                        05600000
SMF58RV1 DC    BL1'0'              RESERVED                             05700000
SMF58LNM DC    CL8' '              LINE NAME                            05800000
SMF58END DS    0C                  END OF TYPE 58 RECORD                05900000
         MEND                                                           99999999
