*        %GOTO SSNUCMTS;          /* Bilingual Mapping Macro            00100000
         MACRO                                                          00200000
         IAZSSNU                                                        00300000
*                                                                       00400000
.* **PROPRIETARY-STATEMENT********************************************* 00405000
.*                                                                    * 00414000
.*   LICENSED MATERIALS-PROPERTY OF IBM                               * 00423000
.*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      * 00432000
.*   5645-001 (C) COPYRIGHT IBM CORP 1990, 1997                       * 00441000
.*                                                                    * 00459000
.*   STATUS:  HBB6603                                                 * 00468000
.*                                                                    * 00477000
.*01* EXTERNAL CLASSIFICATION:  GUPI                                  * 00478000
.*01* END OF EXTERNAL CLASSIFICATION:                                 * 00480000
.*                                                                    * 00482000
.* **END-OF-PROPRIETARY-STATEMENT************************************** 00486000
.*/      %SSNUCMTS: ;                                             /* */ 00500000
*/**** START OF SPECIFICATIONS ***************************************/ 00600000
*/*                                                                  */ 00700000
*/*    MODULE NAME = IAZSSNU                                         */ 00800000
*/*                                                                  */ 00900000
*/*    DESCRIPTIVE NAME = JES NOTIFY USER MSG SERVICE SSOB EXTENSION */ 01000000
*/*                                                                  */ 01100000
*/*    FUNCTION = This macro provides the mapping of the SSOB        */ 02200000
*/*                extension used to request service of the          */ 02300000
*/*                Notify User SSI-to send messages to other system  */ 02400000
*/*                destinations.                                     */ 02500000
*/*                                                                  */ 02600000
*/*  MODULE TYPE = MACRO                                             */ 02700000
*/*                                                                  */ 02800000
*/*    NOTES =                                                       */ 02900000
*/*                                                                  */ 03000000
*/*        Bilingual Mapping Macro (PL/AS and BAL)                   */ 03100000
*/*                                                                  */ 03200000
*/*      DEPENDENCIES =                                              */ 03300000
*/*                                                                  */ 03400000
*/*        PL/AS Version = This macro uses the macro variable        */ 03500000
*/*                    SSNU_ATRB. SSNU_ATRB must be declared and     */ 03600000
*/*                    set to valid control block attributes         */ 03700000
*/*                    before the macro is invoked.                  */ 03800000
*/*                                                                  */ 03900000
*/*        BAL Version = None.                                       */ 04000000
*/*                                                                  */ 04100000
*/*      RESTRICTIONS =                                              */ 04200000
*/*                                                                  */ 04300000
*/*        PL/AS Version = None                                      */ 04400000
*/*                                                                  */ 04500000
*/*        BAL Version = None                                        */ 04600000
*/*                                                                  */ 04700000
*/********************************************************************/ 04800000
*/*                                                                  */ 04900000
*/*    METHOD OF INVOCATION =                                        */ 05000000
*/*                                                                  */ 05100000
*/*      PL/AS VERSION = %DCL SSNU_ATRB CHAR                         */ 05200000
*/*                      %SSNU_ATRB = 'value'                        */ 05300000
*/*                      %INCLUDE SYSLIB(IAZSSNU)                    */ 05400000
*/*                                                                  */ 05500000
*/*         where value is valid control block attributes, such as   */ 05600000
*/*         'BASED(SSOBINDV)'.                                       */ 05700000
*/*                                                                  */ 05800000
*/*         In addition, the SSOB header field SSOBINDV should       */ 05900000
*/*         always be initialized by the caller to point             */ 06000000
*/*         to the functional extension.                             */ 06100000
*/*                                                                  */ 06200000
*/*------------------------------------------------------------------*/ 06300000
*/*                                                                  */ 06400000
*/*      BAL VERSION = IAZSSNU                                       */ 06500000
*/*                                                                  */ 06600000
*/*         If the IEFJSSOB macro is used to define the SSOB header  */ 06700000
*/*         and any extensions are generated by that macro, then     */ 06800000
*/*         SSOBGN will be defined by IEFJSSOB.  Otherwise, you must */ 06900000
*/*         define that label immediately following the SSOB header. */ 07000000
*/*                                                                  */ 07100000
*/*         In addition, the SSOB header field SSOBINDV should       */ 07200000
*/*         always be initialized by the caller to point             */ 07300000
*/*         to the functional extension.                             */ 07400000
*/*                                                                  */ 07500000
*/********************************************************************/ 07600000
*/*                                                                  */ 07700000
*/*    CREATED BY = caller of SSI function 'SSOBSSNU' = 75           */ 07800000
*/*                                                                  */ 07900000
*/*    POINTED TO BY = SSOBINDV in the SSOB header.                  */ 08000000
*/*                                                                  */ 08100000
*/*    DELETED BY = caller                                           */ 08200000
*/*                                                                  */ 08300000
*/*    SERIALIZATION = None                                          */ 08400000
*/*                                                                  */ 08500000
*/*    STORAGE ATTRIBUTES =                                          */ 08600000
*/*                                                                  */ 08700000
*/*      ALLOCATION METHOD = any but alet qualified storage          */ 08800000
*/*      SUBPOOL           = caller                                  */ 08900000
*/*      KEY               = supervisor state                        */ 09000000
*/*      SIZE              = see SSNUSIZE                            */ 09100000
*/*      RESIDENCY, REAL   = any                                     */ 09200000
*/*                VIRTUAL = any                                     */ 09300000
*/*      FREQUENCY         = 1 per call to function code 75          */ 09400000
*/*                                                                  */ 09500000
*/*    COMPONENT = JES Common Library                                */ 09600000
*/*                                                                  */ 09700000
*/*    DISTRIBUTION LIBRARY = SYS1.MACLIB                            */ 09800000
*/*                                                                  */ 09900000
*/*  CHANGE ACTIVITY                                                 */ 10000000
*/*                                                                  */ 10100000
*/*  $VC1PB36=PTM      HJE6603 951109 VLC:  BCP Ext.Classifications  */ 10110000
*/*  $VC1P036=PTM      HJE6603 951208 VLC:  BCP PR20036 Ext.Class    */ 10120000
*/*                                                                  */ 10200000
*/* A000000-999999          Created for MVS 4.1.0            @410D017*/ 10210000
*/**** END OF SPECIFICATIONS *****************************************/ 10300000
*/*                                                                  */ 10700000
* % GOTO END_OF_ASM_SSNU; /*                                            10800000
*                                                                       10900000
**************************************************************          11000000
*                                                            *          11100000
*   Constants for Notify User Message Router SSI Extension   *          11200000
*                                                            *          11300000
**************************************************************          11400000
*                                                                       11500000
*        FUNCTION VALUE FOR SSOBFUNC                                    11600000
SSOBSSNU EQU   75               JES Notify User Function ID             11700000
*                                                                       11800000
*        RETURN CODE VALUES FOR SSOBRETN                                11900000
SSNUOK   EQU   0                  Notify Request Successful             12000000
SSNUOKB  EQU   4                  Notify Request Success BUT            12100000
SSNUERR  EQU   8                  Notify Request Error see             C12200000
                                    SSNUERCD for reason code            12210000
SSNUNEX  EQU   12                 Notify no extension found             12220000
*                                                                       12300000
*        REASON CODE VALUES FOR SSNUERCD                                12400000
SSNURQOK EQU   0                  Notify Request Successful             12500000
SSNUMSGT EQU   4                  Notify Successful BUT msg             12600000
*                                   truncated                           12700000
SSNUEXC  EQU   8                  Exit cancelled notify                 12710000
SSNUNUSR EQU   12                 No userid specified                   12800000
SSNUINVD EQU   16                 Notify Invalid destination            12900000
SSNUIVID EQU   20                 Invalid SSNU extension id             13000000
SSNUIVER EQU   24                 Invalid SSNU version                  13100000
SSNUNOST EQU   28                 No storage to process req             13200000
SSNUNOAU EQU   32                 No authorization                      13300000
SSNUMSGE EQU   36                 Error in msg specification   @410P362 13310000
*                                                                       13400000
**************************************************************          13500000
*                                                            *          13600000
*   SSI SSOB Extension for Notify User Message Router-SSNU   *          13700000
*                                                            *          13800000
**************************************************************          13900000
*                                                                       14000000
         ORG   SSOBGN                                                   14100000
SSNUBGN  EQU   *                                                        14200000
SSNUID   DC    CL4'SSNU'          Extension Identifier                  14300000
SSNULEN  DC    AL2(SSNUSIZE)      Length of SSOB Extensn area           14400000
SSNUVER  DS    BL1                Service Version Number                14500000
SSNUCVER EQU   1                  Service Version Number                14600000
*                                 of IAZSSNU - Version 4.1.0            14700000
*                                  SSNUVER  MUST = SSNUCVER             14800000
SSNURSV1 DS    BL1                Reserved                              14900000
*                                                                       15000000
SSNUERCD DS    H                  Reason code for Error RC              15100000
SSNUFLG1 DS    BL1                Flag Byte 1                           15200000
SSNU1MLO EQU   X'80'               Send msg IFF user log'd on           15300000
SSNURSV2 DS    BL1                Reserved                              15400000
*                                                                       15500000
SSNUTKNA DS    A                  Address of user token(opt)            15600000
*                                                                       15700000
SSNUNODE DS    CL8                Receiving NODE name                   15800000
SSNUUSER DS    CL8                Receiving USERID                      15900000
SSNUMLEN DS    H                  Length of msg to be sent              16000000
SSNURSV4 DS    H                  Reserved                              16100000
SSNUMSG  DS    A                  Address of msg to be sent             16200000
*                                                                       16300000
         DS    F                  Reserved for future use               16310000
         DS    F                  Reserved for future use               16320000
*                                                                       16400000
*        To allow for compatibility between versions, add               16410000
*        new areas here.                                                16420000
*                                                                       16430000
SSNUSIZE EQU   *-SSNUBGN          SSOB Extension length                 16500000
SSNULEN8 EQU   SSOBHSIZ+SSNUSIZE  Total SSOB Length w/NU Ext            16600000
.*                                                                      16700000
         MEND  ,                                                        16800000
.*                                                                      16900000
**/                                                                     17000000
* % END_OF_ASM_SSNU: ;                                                  17100000
*/*                                                                  */ 17200000
*/********************************************************************/ 17300000
*/*                                                                  */ 17400000
*/*    Constants for Notify User Message Router--SSNU                */ 17500000
*/*                                                                  */ 17600000
*/********************************************************************/ 17700000
*/*                                                                  */ 17800000
*/*     FUNCTION VALUE FOR SSOBFUNC                                  */ 17900000
* DCL SSOBSSNU  FIXED(15)  CONSTANT(75); /*Notify User Msg Routr ID  */ 18000000
*/*                                                                  */ 18100000
*/*     RETURN CODE VALUES FOR SSOBRETN                              */ 18200000
* DCL SSNUOK   FIXED(31) CONSTANT(0); /* Notify Request Successful   */ 18300000
* DCL SSNUOKB  FIXED(31) CONSTANT(4); /* Notify Successful BUT       */ 18400000
* DCL SSNUERR  FIXED(31) CONSTANT(8); /* Notify Request Error           18500000
*                                          see SSNUERCD for reason   */ 18510000
* DCL SSNUNEX  FIXED(31) CONSTANT(12); /*Notify no extension found   */ 18520000
*/*                                                                  */ 18600000
*/*     REASON CODE VALUES FOR SSNUERCD                              */ 18700000
* DCL SSNURQOK FIXED(31) CONSTANT(0); /* Notify Request successful   */ 18800000
* DCL SSNUMSGT FIXED(31) CONSTANT(4); /* Message truncated           */ 18900000
* DCL SSNUEXC  FIXED(31) CONSTANT(8); /* Exit cancelled notify      */  18910000
* DCL SSNUNUSR FIXED(31) CONSTANT(12); /*No userid specified         */ 19000000
* DCL SSNUINVD FIXED(31) CONSTANT(16); /*Notify Invalid destination  */ 19100000
* DCL SSNUIVID FIXED(31) CONSTANT(20); /*Invalid SSNU extension id   */ 19200000
* DCL SSNUIVER FIXED(31) CONSTANT(24); /* Invalid SSNU version       */ 19300000
* DCL SSNUNOST FIXED(31) CONSTANT(28); /* No storage for request     */ 19400000
* DCL SSNUNOAU FIXED(31) CONSTANT(32); /* No authorization           */ 19500000
* DCL SSNUMSGE FIXED(31) CONSTANT(36); /* Error in msg specification    19510000
*                                                            @410P362*/ 19520000
*/*                                                                  */ 19600000
*/*     ID VALUE FOR SSNUID                                          */ 19700000
* DCL SSNUCID   CHAR(4) CONSTANT('SSNU'); /* Notify User Msg Router     19800000
*                                              SSOB Extension ID     */ 19900000
*/*                                                                  */ 20000000
*/*     SERVICE VERSION NUMBER VALUE FOR SSNUSVRN                    */ 20100000
* DCL SSNUCVER  FIXED(8)  CONSTANT(1); /* Version 4.1.0              */ 20200000
*/*                                                                  */ 20300000
*/********************************************************************/ 20400000
*/*                                                                  */ 20500000
*/*    SSI SSOB Extension for Notify User Message Router-SSNU        */ 20600000
*/*                                                                  */ 20700000
*/********************************************************************/ 20800000
*/*                                                                  */ 20900000
*DECLARE                                                                21000000
*   1   SSNUBGN   SSNU_ATRB,                                            21100000
*     3  SSNUID    CHAR(4),        /* Extension Identifier           */ 21200000
*     3  SSNULEN   FIXED(15),      /* Length of SSOB Extension area  */ 21300000
*     3  SSNUVER   FIXED(8),       /* Service Version Number         */ 21400000
*     3  SSNURSV1  FIXED(8),       /*   Reserved                     */ 21500000
*     3  SSNUERCD  FIXED(16),      /* Reason code for Error RC       */ 21600000
*     3  SSNUFLG1  BIT(8),         /* Flag Byte 1                    */ 21700000
*        5 SSNU1MLO BIT(1),        /*  Send msg IFF user log'd on ind*/ 21800000
*        5 *        BIT(7),        /*   Reserved                     */ 21900000
*     3  SSNURSV2  FIXED(8),       /*   Reserved                     */ 22000000
*     3  SSNUTKNA  PTR(31),        /* Address of user token (opt)    */ 22100000
*     3  SSNUNODE  CHAR(8),        /* Receiving NODE name            */ 22200000
*     3  SSNUUSER  CHAR(8),        /* Receiving USERID               */ 22300000
*     3  SSNUMLEN  FIXED(16),      /* Length of msg to be sent       */ 22400000
*     3  SSNURSV4  FIXED(16),      /*   Reserved                     */ 22500000
*     3  SSNUMSG   POINTER(31),    /* Address of msg to be sent      */ 22600000
*     3  *         FIXED(31),      /* Reserved for future use        */ 22610000
*     3  *         FIXED(31);      /* Reserved for future use        */ 22620000
*/*                                                                  */ 22700000
*/*      To allow for compatibility between versions, add            */ 22710000
*/*      new areas here.                                             */ 22720000
*/*                                                                  */ 22800000
* % IAZSSNUEND: ;                                                       22900000
*/*                          END OF MACRO                            */ 99999999
