          MACRO                                                         00100000
          IAZSMF54 ,                                                    00200000
*/********************************************************************/ 00300000
*/*MODULE NAME = IAZSMF54                                            */ 00400000
*/*                                                                  */ 00500000
*/*DESCRIPTIVE NAME = JES SMF SPOOL INTEGRITY EVENT RECORD           */ 00600000
*/********************************************************************/ 00700000
.*                                                                   *  01300000
.* COPYRIGHT = LICENSED MATERIALS-PROPERTY OF IBM                    *  01310000
.*             THIS MACRO IS "RESTRICTED MATERIALS OF IBM"           *  01320000
.*             5645-001 (C) COPYRIGHT IBM CORP 1983, 1997            *  01330000
.*                                                                   *  01340000
.* STATUS = HBB6603                                                  *  01400000
.*                                                                   *  01500000
.*01* EXTERNAL CLASSIFICATION:  NONE                                 *  01510000
.*01* END OF EXTERNAL CLASSIFICATION:                                *  01520000
.*                                                                   *  01530000
.* MODULE TYPE = MACRO                                               *  01600000
.*                                                                   *  01700000
.* INVOCATION =                                                      *  01800000
.*               BAL  - IAZSMF54 (NO DSECT CREATED - START OF RECORD *  01900000
.*                       IS AT SMFRCD54 )                            *  02000000
.*               PL/S - NONE                                         *  02100000
.*                                                                   *  02110000
.* CHANGE ACTIVITY:                                                  *  02200000
.*                                                                   *  02300000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3, JBB1329)        *  02400000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02410000
.*                                                                   *  02500000
.* A000000-999999    CREATED FOR MVS 1.3.3                         @133 02520000
.*********************************************************************  02600000
         SPACE 2                                                        02700000
SMFRCD54 EQU   *                   START OF RECORD                      02800000
SMF54PTR EQU   *                   HEADER SEGMENT              @OZ82688 02900000
SMF54LEN DS    CL2                 RECORD LENGTH                        03000000
SMF54SEG DS    CL2                 SEGMENT DESCRIPTOR                   03100000
         SPACE 2                                                        03200000
*  BEGINNING OF JMR OR HASP SMF RECORD                                  03300000
         SPACE 1                                                        03400000
SMF54FLG DC    BL1'0'              HEADER FLAG BYTE                     03500000
SMF54RTY DC    BL1'0'              RECORD TYPE                          03600000
SMF54TME DC    BL4'0'              TOD, USING FORMAT FROM TIME MACRO    03700000
SMF54DTE DC    PL4'0000'           DATE IN PACKD DECIMAL FORM  00YYDDDF 03800000
SMF54SID DC    CL4' '              SYSTEM IDENTIFICATION                03900000
         SPACE 2                                                        04000000
* HEADER FOR HASP SUBSYSTEM RECORD TYPES 54                             04100000
SMFJ54   EQU   54                  SPOOL INTEGRITY EVENT REC   @OZ82688 04200000
         SPACE 1                                                        04300000
SMF54POF DC    BL2'0'              OFFSET TO PRODUCT SECTION            04400000
SMF54PRL DC    BL2'0'              LENGTH OF PRODUCT SECTION            04500000
SMF54PRN DC    BL2'0'              NUMBER OF PRODUCT SECTION            04600000
SMF54IDO DC    BL2'0'              OFFSET TO ID SECTION                 04700000
SMF54IDL DC    BL2'0'              LENGTH OF ID SECTION                 04800000
SMF54IDN DC    BL2'0'              NUMBER OF ID SECTION                 04900000
         SPACE 1                                                        05000000
* PRODUCT SECTION HASP SUBSYSTEM RECORD TYPE 54                         05100000
         SPACE 1                                                        05200000
SMF54SUB DC    BL2'0'              SUBTYPE ID NUMBER                    05300000
SMF54LON EQU   1                      LOGON EVENT                       05400000
SMF54VER DC    CL2'01'             RECORD VERSION NUMBER                05500000
SMF54SYS DC    CL4'JES2'           SUBSYSTEM NAME                       05600000
SMF54IDS DS    0C                  DEFINE START OF ID SECTION           05700000
         SPACE 2                                                        05800000
* ID SECTION OF HASP 54 (SNA) INTEGRITY RECORD AFTER TWO HDRS           05900000
         SPACE 1                                                        06000000
SMF54RMT DC    CL8' '              REMOTE NAME                          06100000
SMF54RPW DC    CL8' '              REMOTE PASSWORD                      06200000
SMF54PSW DC    CL8' '              LINE PASSWORD                        06300000
SMF54END DS    0C                  END OF TYPE 54 RECORD                06400000
         MEND                                                           99999999
