          MACRO                                                         00100000
          IAZSMF55 ,                                                    00200000
*/********************************************************************/ 00300000
*/*MODULE NAME = IAZSMF55                                            */ 00400000
*/*                                                                  */ 00500000
*/*DESCRIPTIVE NAME = JES SMF NETWORK SIGNON RECORD                  */ 00600000
*/********************************************************************/ 00700000
.*                                                                   *  01300000
.* COPYRIGHT = LICENSED MATERIALS-PROPERTY OF IBM                    *  01310000
.*             THIS MACRO IS "RESTRICTED MATERIALS OF IBM"           *  01320000
.*             5645-001 (C) COPYRIGHT IBM CORP 1983, 1997            *  01330000
.*                                                                   *  01340000
.* STATUS = HBB6603                                                  *  01400000
.*                                                                   *  01500000
.*01* EXTERNAL CLASSIFICATION:  NONE                                 *  01510000
.*01* END OF EXTERNAL CLASSIFICATION:                                *  01520000
.*                                                                   *  01530000
.* MODULE TYPE = MACRO                                               *  01600000
.*                                                                   *  01700000
.* INVOCATION =                                                      *  01800000
.*               BAL  - IAZSMF55 (NO DSECT CREATED - START OF RECORD *  01900000
.*                       IS AT SMFRCD55 )                            *  02000000
.*               PL/S - NONE                                         *  02100000
.*                                                                   *  02110000
.* CHANGE ACTIVITY:                                                  *  02200000
.*                                                                   *  02300000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3, JBB1329)        *  02400000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02410000
.*                                                                   *  02500000
.* A000000-999999    CREATED FOR MVS 1.3.3                         @133 02520000
.*********************************************************************  02600000
         SPACE 2                                                        02700000
* SWITCH TO DETERMINE WHETHER TO GENERATE EQUATES FOR WRITING REC       02800000
         GBLB  &EQUSW                                                   02900000
         SPACE 1                                                        03000000
SMFRCD55 EQU   *                   START OF RECORD                      03100000
SMF55PTR EQU   *                   HEADER SEGMENT              @OZ82688 03200000
SMF55LEN DS    CL2                 RECORD LENGTH                        03300000
SMF55SEG DS    CL2                 SEGMENT DESCRIPTOR                   03400000
         SPACE 2                                                        03500000
*  BEGINNING OF JMR OR HASP SMF RECORD                                  03600000
         SPACE 1                                                        03700000
SMF55FLG DC    BL1'0'              HEADER FLAG BYTE                     03800000
SMF55RTY DC    BL1'0'              RECORD TYPE                          03900000
SMF55TME DC    BL4'0'              TOD, USING FORMAT FROM TIME MACRO    04000000
SMF55DTE DC    PL4'0000'           DATE IN PACKD DECIMAL FORM  00YYDDDF 04100000
SMF55SID DC    CL4' '              SYSTEM IDENTIFICATION                04200000
         SPACE 2                                                        04300000
* HEADER FOR HASP SUBSYS RECORD TYPE 55                                 04400000
SMFJ55   EQU   55                  NETWORK SIGNON RECORD TYPE  @OZ82688 04500000
         SPACE 1                                                        04600000
SMF55SBS DC    XL2'0002'           HASP SUBSYSTEM ID                    04700000
SMF55HSP EQU   X'0002'                JES2 ID                           04800000
SMF55SUB DC    BL2'0'              RECORD SUBTYPE                       04900000
SMF55LRR DC    BL2'0'              LENGTH OF REST OF RECORD             05000000
         AIF (NOT &EQUSW).SKIP                                          05100000
SMF55STR EQU   *-SMF55LEN          LENGTH OF HEADING SECTIONS           05200000
         SPACE 2                                                        05300000
.SKIP    ANOP                                                           05400000
* BEGINNING OF HASP TYPE 55 NETWORKING SIGNON RECORD AFTER 2 HDRS       05500000
         SPACE 1                                                        05600000
SMF55NNM DC    CL8' '              NODE NAME                            05700000
SMF55MEM DC    BL1'0'              MEMBER NUMBER                        05800000
SMF55FG1 DC    BL1'0'              SIGNON STATUS FLAGS                  05900000
SMF55RSO EQU   B'10000000'            RESPONSE SIGNON                   06000000
SMF55LPW DC    CL8' '              LINE PASSWORD                        06100000
SMF55NPW DC    CL8' '              NODE PASSWORD                        06200000
SMF55LNM DC    CL8' '              LINE NAME                            06300000
SMF55END DS    0C                  END OF TYPE 55 RECORD                06400000
         MEND                                                           99999999
