*%GOTO IAZPRO47;           /*                                           00100000
         MACRO                                                          00200000
         IAZSMF47 ,                                                  */ 00300000
*%IAZPRO47:;                                                            00400000
*/********************************************************************/ 00500000
*/*MODULE NAME = IAZSMF47                                            */ 00600000
*/*                                                                  */ 00700000
*/*DESCRIPTIVE NAME = JES SMF SUBSYSTEM EVENT START                  */ 00800000
*/********************************************************************/ 00900000
*%GOTO IAZ47;                                                        /* 01000000
.*                                                                   *  01600000
.* COPYRIGHT = LICENSED MATERIALS-PROPERTY OF IBM                    *  01610000
.*             THIS MACRO IS "RESTRICTED MATERIALS OF IBM"           *  01620000
.*             5645-001 (C) COPYRIGHT IBM CORP 1983, 1997            *  01630000
.*                                                                   *  01640000
.* STATUS = HBB6603                                                  *  01700000
.*                                                                   *  01800000
.*01* EXTERNAL CLASSIFICATION:  NONE                                 *  01810000
.*01* END OF EXTERNAL CLASSIFICATION:                                *  01820000
.*                                                                   *  01830000
.* MODULE TYPE = MACRO                                               *  01900000
.*                                                                   *  02000000
.* INVOCATION =                                                      *  02100000
.*               BAL  - IAZSMF47 (NO DSECT CREATED - START OF RECORD *  02200000
.*                       IS AT SMFRCD47 )                            *  02300000
.*               PL/S - %INCLUDE SYSLIB(IAZSMF47)                    *  02400000
.*                      DCL SMF47PTR PTR                             *  02500000
.*                                                                   *  02510000
.* CHANGE ACTIVITY:                                                  *  02600000
.*                                                                   *  02700000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  02800000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02810000
.*                                                                   *  02900000
.* A000000-999999    CREATED FOR MVS  1.3.3                       @133  02910000
.*********************************************************************  03000000
         SPACE 2                                                        03100000
*SWITCH TO DETERMINE WHETHER TO GENERATE EQUATES FOR WRITING REC        03200000
         GBLB  &EQUSW                                                   03300000
         SPACE 1                                                        03400000
* SUBSYSTEM EVENT START RECORD TYPE 47                                  03500000
         DS    0F       ALIGN TO FULL WORD BOUNDRY                      03600000
SMFRCD47 EQU   *        START OF RECORD                                 03700000
SMF47PTR EQU   *        HEADER SEGMENT                         @OZ82688 03800000
SMF47LEN DS    BL2      RECORD LENGTH                                   03900000
SMF47SEG DS    BL2      SEGMENT DESCRIPTOR                              04000000
SMF47FLG DS    BL1      HEADER FLAG BYTE                                04100000
SMF47RTY DS    BL1      RECORD TYPE 47                                  04200000
SMFJ47   EQU   47          START SUBSYSTEM EVENT ID            @OZ82688 04300000
SMF47TME DS    BL4      TOD FROM TIME MACRO BINARY                      04400000
SMF47DTE DS    PL4      DATE FROM TIME MACRO                            04500000
SMF47SID DS    CL4      SYSTEM IDENTIFICATION                           04600000
* SUBSYSTEM IDENTIFICATION SECTION                                      04700000
SMF47SBS DS    BL2      SUBSYSTEM IDENTIFIER                            04800000
SMF47HSP EQU   X'0002'     JES2 ID                                      04900000
*                       X'0005' JES3                                    05000000
*                       X'0006' SS06                                    05100000
SMF47RSV DS    BL2      RESV                                            05200000
SMF47LRR DS    BL2      LGTH OF REMAINDER OF RECORD                     05300000
*                       (NOT INCLUDING THIS FIELD)                      05400000
SMF47SBG EQU   *        SUBSYSTEM SECTION BEGINNING                     05500000
* JES2 AND JES3 SECTION                                                 05600000
SMF47EVT DS    BL2      EVENT STARTING                                  05700000
SMF47SON EQU   1        TERMINAL SIGNED ON                              05800000
SMF47STL EQU   2        LINE STARTED                                    05900000
SMF47LON EQU   4        TERMINAL LOGGED ON                              06000000
* BEGINNING OF GENERAL SECTION                                          06100000
SMF47LN1 DS    BL2      LGTH OF THIS SECTION(INCLUDING SELF-26)         06200000
SMF47RMT DS    CL8      REMOTE NAME                                     06300000
SMF47LIN DS    CL8      LINE NAME                                       06400000
SMF47PSW DS    CL8      PASSWORD                                        06500000
* BEGINNING OF SIGNON MESSAGE SECTION                                   06600000
* THIS SECTION EXISTS ONLY FOR SIGNON EVENT STARTS                      06700000
SMF47LN2 DS    BL2      LGTH OF THIS SECTION(INCLUDING SELF-38)         06800000
SMF47MSG DS    CL36     MESSAGE FOR SIGNON, COLUMNS 35-70 OF            06900000
*                       SIGNON CARD.                                    07000000
SMF47RVJ DS    CL8      RESERVED FOR JES3                               07100000
SMF47RVU DS    CL4      RESERVED FOR USER                               07200000
SMF47END DS    0X       END OF JES3 RECORD                              07300000
SMF47SIZ DS    0XL(SMF47END-SMFRCD47)  SIZE OF JES3 47 RECORD           07400000
         ORG   SMF47SBG                                                 07500000
* SS06 SECTION                                                          07600000
SMF47LCF DS    BL1      LOGON CONDITION FLAG                            07700000
SMF47UNL EQU   128      USER NOT LOGGED OFF                             07800000
SMF47CWK EQU   32       CONTINUE WORKSPACE EXISTED AT LOGON             07900000
SMF47SPA EQU   4        SERVICE PROGRAM ACCOUNT RECORD                  08000000
SMF47ULK EQU   1        USER LOCKED                                     08100000
SMF47UID DS    BL3      USER ID                                         08200000
SMF47LTC DS    BL1      LIBRARY TYPE CODE                               08300000
SMF47PLI DS    BL3      PROJECT LIB ID                                  08400000
SMF47JID DS    CL6      JOB ENTRY ID CODE                               08500000
SMF47LAA DS    BL1      LANGUAGE ATTRIBUTE ASSIGNED                     08600000
SMF47PCI DS    BL1      PRIVILEGED CLASS INDICATORS                     08700000
SMF47DSL DS    BL4      DASD SPACE IN LIBRARY                           08800000
*                       (1K UNITS)                                      08900000
SMF47DPL DS    BL4      DASD SPACE PROJECT/PUBLIC                       09000000
*                       LIBRARIES(1K UNITS)                             09100000
         ORG   SMF47SBG                                                 09200000
         SPACE 2                                                        09300000
         AIF (NOT &EQUSW).SKIP                                          09400000
*      LENGTH EQUATES                                                   09500000
SMF47L1  EQU   SMF47LN2-SMF47LN1   LEN OF GENERAL SECTION               09600000
SMF47L2  EQU   SMF47MSG+L'SMF47MSG-SMF47LN2  LEN OF SIGNON MSG SEC      09700000
SMF47L3  EQU   SMF47MSG+L'SMF47MSG-SMF47LEN  LEN OF TYPE 47 RECORD      09800000
SMF47L4  EQU   SMF47LN2-SMF47LEN   LEN OF RECORD - MESSAGE SECTION      09900000
.SKIP    ANOP                                                           10000000
         MEND                                                        */ 10100000
 %IAZ47: ;                                                              10200000
 %  DCL   EQUSW FIXED EXTERNAL; /* SWITCH TO DETERMINE WHETHER TO       10300000
                                   GENERATE EQUATES FOR WRITING REC  */ 10400000
    DCL 1 SMFRCD47 BASED(SMF47PTR) BDY(WORD),                           10500000
 /* RECORD TYPE 47 - SUBSYSTEM EVENT START                           */ 10600000
         3 SMF47LEN FIXED(15),    /* RDW RECORD LENGTH               */ 10700000
         3 SMF47SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 10800000
         3 SMF47FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 10900000
         3 SMF47RTY FIXED(8),     /* RECORD TYPE 47                  */ 11000000
         3 SMF47TME FIXED(31) BDY(BYTE), /* TOD RECORD WRITTEN       */ 11100000
         3 SMF47DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 11200000
         3 SMF47SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 11300000
                                  /* SUBSYSTEM IDENTIFICATION SECTION*/ 11400000
         3 SMF47SBS FIXED(15),    /* SUBSYSTEM IDENTIFIER            */ 11500000
                                  /* 2 JES2                          */ 11600000
                                  /* 5 JES3                          */ 11700000
                                  /* 6 SS06                          */ 11800000
         3 SMF47RSV CHAR(2),      /* RESV                            */ 11900000
         3 SMF47LRR PTR(15),      /* LGTH OF REMAINDER OF RECORD        12000000
                                     (NOT INCLUDING THIS FIELD)      */ 12100000
         3 SMF47SBG CHAR(28),     /* SUBSYSTEM SECTION               */ 12200000
 /* JES2 AND JES3 SUBSYSTEM DATA                                     */ 12300000
          5 SMF47EVT FIXED(15) BDY(BYTE), /* EVENT TYPE STARTING     */ 12400000
            7 *        BIT(13),            /* RESERVED               */ 12500000
            7 SMF47LON BIT(1),            /* TERMINAL LOGGED ON      */ 12600000
            7 SMF47STL BIT(1),            /* LINE STARTED            */ 12700000
            7 SMF47SON BIT(1),     /* TERMINAL SIGNED ON             */ 12800000
                                  /* GENERAL SECTION                 */ 12900000
        4 SMF47GN,                /* BEGINING OF GENERAL SECT.       */ 13000000
          5 SMF47LN1 PTR(15) BDY(BYTE), /* LGTH OF GENERAL SECTION   */ 13100000
          5 SMF47RMT CHAR(8),     /* REMOTE NAME                     */ 13200000
          5 SMF47LIN CHAR(8),     /* LINE NAME                       */ 13300000
          5 SMF47PSW CHAR(8);     /* PASSWORD                        */ 13400000
    DCL 1 SMF47A BASED(ADDR(SMF47LN1)+SMF47LN1) BDY(HWORD),             13500000
                                  /* MESSAGE SECTION FOR SIGNON      */ 13600000
         3 SMF47LN2 PTR(15),      /* LGTH OF MESSAGE SECTION         */ 13700000
         3 SMF47MSG CHAR(36),     /* MESSAGE FOR SIGNON, COLUMNS        13800000
                                     35-70 OF SIGNON CARD.           */ 13900000
         3 SMF47RVJ CHAR(8),      /* RESERVED FOR JES3               */ 14000000
         3 SMF47RVU CHAR(4),      /* RESERVED FOR USER               */ 14100000
         3 SMF47END CHAR(0);      /* END OF JES3 RECORD              */ 14200000
 /* SS06 SUBSYSTEM DATA                                              */ 14300000
    DCL 1 SMF47PCO BASED(ADDR(SMF47SBG)),                               14400000
         3 SMF47LCF BIT(8),       /* LOGON CONDITION FLAG            */ 14500000
           5 SMF47UNL BIT(1),     /* USER NOT LOGGED OFF             */ 14600000
           5 SMF47RV1 BIT(1),     /* RESERVED                        */ 14700000
           5 SMF47CWK BIT(1),     /* CONTINUE WORKSPACE EXISTED         14800000
                                     AT LOGON                        */ 14900000
           5 SMF47RV2 BIT(2),     /* RESERVED                        */ 15000000
           5 SMF47SPA BIT(1),     /* SERVICE PROGRAM ACCOUNT            15100000
                                     RECORD                          */ 15200000
           5 SMF47RV3 BIT(1),     /* RESERVED                        */ 15300000
           5 SMF47ULK BIT(1),     /* USER LOCKED                     */ 15400000
         3 SMF47UID CHAR(3),      /* USER ID                         */ 15500000
         3 SMF47LTC CHAR(1),      /* LIBRARY TYPE                    */ 15600000
         3 SMF47PLI CHAR(3),      /* PROJECT LIB ID                  */ 15700000
         3 SMF47JID CHAR(6),      /* JOB ENTRY ID CODE               */ 15800000
         3 SMF47LAA CHAR(1),      /* LANGUAGE ATTRIBUTE ASSIGNED        15900000
                                                                     */ 16000000
         3 SMF47PCI CHAR(1),      /* PRIVILEGED CLASS INDICATORS        16100000
                                                                     */ 16200000
         3 SMF47DSL FIXED(31),    /* DASD SPACE IN LIBRARY              16300000
                                     (1K UNITS)                      */ 16400000
         3 SMF47DPL FIXED(31);    /* DASD SPACE PROJECT/PUBLIC          16500000
                                     LIBRARIES (1K UNITS)            */ 16600000
 %IF EQUSW=0 %THEN %GOTO SKIP47;                                        16700000
 /*     EQUATES USED FOR WRITING RECORD                              */ 16800000
    DCL   SMFJ47 FIXED(8) CONSTANT(47), /* STRT SUBSYS EVENT ID      */ 16900000
          SMF47L1 FIXED(32) CONSTANT(LENGTH(SMF47GN)),                  17000000
                                       /* LEN OF GENERAL SECTION     */ 17100000
          SMF47L2 FIXED(32) CONSTANT(LENGTH(SMF47MSG)+                  17200000
                         LENGTH(SMF47LN2)),  /* LEN SIGN ON SECT     */ 17300000
          SMF47L3 FIXED(32) CONSTANT(LENGTH(SMFRCD47)+SMF47L2),         17400000
                                       /* LEN OF JES2 TYPE 47        */ 17500000
          SMF47L4 FIXED(32) CONSTANT(LENGTH(SMFRCD47)),                 17600000
                                       /* LEN OF REC - MSG SECT      */ 17700000
          SMF47HSP FIXED(32) CONSTANT(2); /* JES2 ID                 */ 17800000
 %SKIP47: ;                                                             99999999
