*%GOTO IAZPRO43;       /*                                               00100000
        MACRO                                                           00200000
        IAZSMF43 ,                                                   */ 00300000
*%IAZPRO43:   ;                                                         00400000
*/********************************************************************/ 00500000
*/*MODULE NAME = IAZSMF43                                            */ 00600000
*/*                                                                  */ 00700000
*/*DESCRIPTIVE NAME = JES SMF SUBSYSTEM START RECORD                 */ 00800000
*/********************************************************************/ 00900000
*%GOTO IAZ43;                                                        /* 01000000
.*                                                                   *  01600000
.* COPYRIGHT = LICENSED MATERIALS-PROPERTY OF IBM                    *  01610000
.*             THIS MACRO IS "RESTRICTED MATERIALS OF IBM"           *  01620000
.*             5647-A01 (C) COPYRIGHT IBM CORP 1983, 1997            *  01630000
.*                                                                   *  01640000
.* STATUS = JBB6604                                                  *  01700000
.*                                                                   *  01800000
.*01* EXTERNAL CLASSIFICATION:  NONE                                 *  01810000
.*01* END OF EXTERNAL CLASSIFICATION:                                *  01820000
.*                                                                   *  01830000
.* MODULE TYPE = MACRO                                               *  01900000
.*                                                                   *  02000000
.* INVOCATION =                                                      *  02100000
.*               BAL  - IAZSMF43 (NO DSECT CREATED - START OF RECORD *  02200000
.*                       IS AT SMFRCD43 )                            *  02300000
.*               PL/S - %INCLUDE SYSLIB(IAZSMF43)                    *  02400000
.*                      DCL SMF43PTR PTR                             *  02500000
.*                                                                   *  02510000
.* CHANGE ACTIVITY:                                                  *  02600000
.*                                                                   *  02700000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  02800000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02810000
.*                                                                   *  02815000
.* $510P519=PTM      HBB5510 930518 T_K1: PIG1519 4-Digit Support    *  02820000
.*                                                                   *  02830000
.* $R04P025=WLM      HJE6604 960912 TJW:  Restart bit for JES3        * 02840000
.*                                                                   *  02900000
.* A000000-999999    CREATED FOR MVS 1.3.3                        @133  02910000
.*********************************************************************  03000000
         SPACE 2                                                        03100000
*SWITCH TO DETERMINE WHETHER TO GENERATE EQUATES FOR WRITING REC        03200000
         GBLB  &EQUSW                                                   03300000
         SPACE 1                                                        03400000
* SUBSYSTEM START RECORD TYPE 43                                        03500000
         DS    0F       ALIGNMENT TO FULL WORD BOUNDRY                  03600000
SMFRCD43 EQU   *        START OF RECORD                                 03700000
SMF43PTR EQU   *        HEADER SEGMENT                         @OZ82688 03800000
SMF43LEN DS    BL2      RECORD LENGTH                                   03900000
SMF43SEG DS    BL2      SEGMENT DESCRIPTOR                              04000000
SMF43FLG DS    BL1      HEADER FLAG BYTE                                04100000
SMF43RTY DS    BL1      RECORD TYPE 43                                  04200000
SMFJ43   EQU   43        START SUBSYSTEM RECORD TYPE           @OZ82688 04300000
SMF43TME DS    BL4      TOD FROM TIME MACRO BINARY                      04400000
SMF43DTE DS    PL4      DATE FROM TIME MACRO                            04500000
SMF43SID DS    CL4      SYSTEM IDENTIFIER                               04600000
* SUBSYSTEM IDENTIFICATION SECTION                                      04700000
SMF43SBS DS    BL2      SUBSYSTEM IDENTIFIER                            04800000
SMF43HSP EQU   X'0002'      JES2 ID                                     04900000
*                       X'0005' JES3                                    05000000
*                       X'0006' SS06                                    05100000
SMF43RSV DS    BL2      RESV                                            05200000
SMF43LRR DS    BL2      LGTH OF REMAINDER OF RECORD                     05300000
*                       (NOT INCLUDING THIS FIELD)                      05400000
SMF43SBP EQU   *        SUBSYSTEM SECTION BEGINNING                     05500000
* JES2 AND JES3 COMMON SECTION                                          05600000
SMF43RV1 DS    BL2      RESV                                            05700000
SMF43RST DS    BL1      START RECORD FLAGS                              05800000
SMF$ESYS EQU   X'80'    IF 1 THEN SMF43EID FIELD IS RESTART SYSTEM ID   05900000
*                                                                       06000000
SMF43CLD EQU   X'80'    COLD START (JES3)                               06100000
SMF43WRM EQU   X'40'    WARM START                                      06200000
SMF43HOT EQU   X'20'    HOT START                                       06300000
SMF43ANL EQU   X'10'    QUEUE ANALYSIS REQUIRED                         06400000
SMF43GBL EQU   X'08'    GLOBAL SYSTEM                                   06500000
SMF43LCL EQU   X'04'    LOCAL SYSTEM                                    06600000
SMF43REF EQU   X'02'    Configuration refresh was requested    @R04P025 06700000
SMF43DSI EQU   X'01'    DYNAMIC SYSTEM INTERCHANGE                      06800000
SMF43SBG EQU   *        JES2,JES3 UNCOMMON SECTIONS                     06900000
* JES2 SECTION                                                          07000000
SMF43OPT DS    BL1      JES2 OPTIONS                                    07100000
*                       BIT MEANING WHEN SET                            07200000
*                        0 - FORMAT THE SPOOL                           07300000
*                        1 - COLD START                                 07400000
*                        2 - REQUEST INIT AUTO                          07500000
*                        3 - LIST REPLACEMENTS                          07600000
*                        4-7 RESV                                       07700000
SMF43EID DS    CL4      SYSTEM ID OF SYSTEM TO BE WARMSTARTED IF        07800000
*                       &ESYS OR 0 FOR START JES 2                      07900000
         ORG   SMF43SBG                                                 08000000
* JES3 SECTION                                                          08100000
SMF43RV2 DS    BL1      RESERVED FLAGS                                  08200000
SMF43US1 DS    BL1      USER FLAGS                                      08300000
SMF43NMU DS    CL1      INITIALIZATION DECK ORIGIN TYPE                 08400000
SMF43ORG DS    CL8      INITIALIZATION DECK ORIGIN                      08500000
*                        TYPE-ORIGIN CONTENTS                           08600000
*                        N-MEMBER NAME(JCL DEFAULT)                     08700000
*                        M-MEMBER NAME(OPER CHOICE)                     08800000
*                        U-UNIT ADDRESS(OP CHOICE)                      08900000
SMF43UN4 EQU   SMF43ORG,4     4-Digit Device Number            @510P519 08910000
SMF43UNT EQU   SMF43ORG,3     3-Digit Device Number            @510P519 09000000
SMF43PJ3 DS    CL4       JES3 PROCEDURE NAME                            09100000
SMF43RVJ DS    CL8       RESERVED FOR JES3                              09200000
SMF43RVU DS    CL4       RESERVED FOR USER                              09300000
SMF43END DS    0X        END OF JES3 RECORD                             09400000
SMF43SIZ DS    0XL(SMF43END-SMFRCD43) SIZE OF JES3 SMF43 RECORD         09500000
         ORG   SMF43SBP                                                 09600000
* SS06 SECTION                                                          09700000
SMF43PRC DC    CL8' '   SS06 START PROC NAME                            09800000
SMF43INT DC    CL73' '  INITIALIZATION                                  09900000
         SPACE 2                                                        10000000
         AIF (NOT &EQUSW).SKIP                                          10100000
*      LENGTH EQUATES                                                   10200000
SMF43L1  EQU   SMF43EID+L'SMF43EID-SMF43LEN  LEN OF TYPE 43 RECORD      10300000
SMF43L2  EQU   SMF43EID+L'SMF43EID-SMF43RV1  LEN OF JES2 SECTION        10400000
.SKIP    ANOP                                                           10500000
         MEND                                                        */ 10600000
 %IAZ43: ;                                                              10700000
 %  DCL   EQUSW FIXED EXTERNAL; /*SWITCH TO DETERMINE WHETHER TO        10800000
                                  GENERATE EQUATES FOR WRITING REC   */ 10900000
    DCL 1 SMFRCD43 BASED(SMF43PTR) BDY(WORD),                           11000000
 /* RECORD TYPE 43 - SUBSYSTEM START                                 */ 11100000
        2 SMF43BAS,               /* BEGINING OF BASE SECTION        */ 11200000
         3 SMF43LEN FIXED(15),    /* RDW RECORD LENGTH               */ 11300000
         3 SMF43SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 11400000
         3 SMF43FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 11500000
         3 SMF43RTY FIXED(8),     /* RECORD TYPE 43                  */ 11600000
         3 SMF43TME FIXED(31) BDY(BYTE), /* TOD RECORD WRITTEN       */ 11700000
         3 SMF43DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 11800000
         3 SMF43SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 11900000
                                  /* SUBSYSTEM IDENTIFICATION SECTION*/ 12000000
         3 SMF43SBS FIXED(15),    /* SUBSYSTEM IDENTIFIER            */ 12100000
                                  /* 2 JES2                          */ 12200000
                                  /* 5 JES3                          */ 12300000
                                  /* 6 SS06                          */ 12400000
         3 SMF43RSV CHAR(2),      /* RESV                            */ 12500000
         3 SMF43LRR PTR(15),      /* LGTH OF REMAINDER OF RECORD        12600000
                                     (NOT INCLUDING THIS FIELD)      */ 12700000
         3 SMF43SBP CHAR(0),      /* SUBSYSTEM SECTION               */ 12800000
 /* JES2 AND JES3 COMMON SECTION                                     */ 12900000
       2 SMF43J2,                 /* BEGINING OF JES2 SECTION        */ 13000000
         3 SMF43RV1 CHAR(2),      /* RESV                            */ 13100000
         3 SMF43RST BIT(8),       /* START RECORD FLAGS              */ 13200000
          5 SMF$ESYS BIT(1),      /* IF 1 THEN SMF43EID FIELD IS        13300000
                                RESTARTED SYSTEM ID. IF 0 THEN SMF43EID 13400000
                               FIELD IS FOR START JES2 AND IS ZEROES */ 13500000
            7 SMF43CLD BIT(1),    /* COLD START (JES3)               */ 13600000
          5 SMF43WRM BIT(1),      /* WARM START                      */ 13700000
          5 SMF43HOT BIT(1),      /* HOT START                       */ 13800000
          5 SMF43ANL BIT(1),      /* QUEUE ANALYSIS REQUIRED         */ 13900000
          5 SMF43GBL BIT(1),      /* GLOBAL SYSTEM                   */ 14000000
          5 SMF43LCL BIT(1),      /* LOCAL SYSTEM                    */ 14100000
          5 SMF43REF BIT(1),      /* Configuration refresh was          14200000
                                     requested               @R04P025*/ 14210000
          5 SMF43DSI BIT(1),      /* DYNAMIC SYSTEM INTERCHANGE         14300000
                                                                     */ 14400000
        3 SMF43SBG CHAR(5),       /* JES2,JES3 UNCOMMON AREA         */ 14500000
 /* JES2 SUBSYSTEM DATA                                              */ 14600000
          5 SMF43OPT BIT(8),      /* STARTING OPTIONS                   14700000
                                     0 - FORMAT THE SPOOL               14800000
                                     1 - COLD START                     14900000
                                     2 - REQUEST INITIATOR AUTO         15000000
                                     3 - LIST REPLACEMENTS              15100000
                                     4-7 RESERVED                    */ 15200000
          5 SMF43EID CHAR(4);  /* SYSTEM ID OF SYSTEM TO BE WARMSTARTED 15300000
                                IF $ESYS OR 0 FOR START JES2         */ 15400000
                                                                        15500000
 /* JES3 SUBSYSTEM DATA                                              */ 15600000
  DCL 1 SMF43JS3 BASED(ADDR(SMF43SBG)),                    /*        */ 15700000
         3 SMF43RV2 BIT(8),    /* RESERVED FLAGS                     */ 15800000
         3 SMF43US1 BIT(8),    /* USER FLAGS                         */ 15900000
         3 SMF43NMU CHAR(1),   /* INITIALIZATION DECK                   16000000
                                  ORIGIN TYPE                        */ 16100000
         3 SMF43ORG CHAR(8),   /* INITIALIZATION DECK                   16200000
                                  ORIGIN                                16300000
                               TYPE-ORIGIN CONTENTS                     16400000
                               N-MEMBER NAME(JCL DEFAULT)               16500000
                               M-MEMBER NAME(OPER CHOICE)               16600000
                               U-UNIT ADDRESS (OP CHOICE)            */ 16700000
           5 SMF43UN4 CHAR(4), /* 4-Digit Device Number      @510P519*/ 16710000
             7 SMF43UNT CHAR(3), /* 3-Digit Device Number    @510P519*/ 16800000
         3 SMF43PJ3 CHAR(4),   /* JES3 PROCEDURE NAME                */ 16900000
         3 SMF43RVJ CHAR(8),   /* RESERVED FOR JES3                  */ 17000000
         3 SMF43RVU CHAR(4),   /* RESERVED FOR USER                  */ 17100000
         3 SMF43END CHAR(0);   /* END OF JES3 RECORD                 */ 17200000
 /* SS06 SUBSYSTEM DATA                                              */ 17300000
    DCL 1 SMF43PCO BASED(ADDR(SMF43SBP)),      /*                    */ 17400000
         3 SMF43PRC CHAR(8),       /* SS06 START PROC NAME           */ 17500000
         3 SMF43INT CHAR(73);      /* INITIALIZATION OPTIONS         */ 17600000
 %IF EQUSW=0 %THEN %GOTO SKIP43;                                        17700000
 /*      EQUATES USED TO WRITE SMF RECORDS                           */ 17800000
    DCL   SMFJ43 FIXED(8) CONSTANT(43), /* START SUBSYS REC TYPE     */ 17900000
          SMF43L2 FIXED(32) CONSTANT(LENGTH(SMF43J2)),                  18000000
                                       /* LEN JES2 SECTION           */ 18100000
          SMF43L1 FIXED(32) CONSTANT(SMF43L2+LENGTH(SMF43BAS)),         18200000
                                       /* LEN J2 TYPE 43             */ 18300000
          SMF43HSP FIXED(32) CONSTANT(2); /* JES2 ID                 */ 18400000
 %SKIP43:  ;                                                            99999999
