          MACRO                                                         00100000
          IAZSMF56 ,                                                    00200000
*/********************************************************************/ 00300000
*/*MODULE NAME = IAZSMF56                                            */ 00400000
*/*                                                                  */ 00500000
*/*DESCRIPTIVE NAME = JES SMF NETWORK INTEGRITY RECORD               */ 00600000
*/********************************************************************/ 00700000
.*                                                                   *  01300000
.* COPYRIGHT = LICENSED MATERIALS-PROPERTY OF IBM                    *  01310000
.*             THIS MACRO IS "RESTRICTED MATERIALS OF IBM"           *  01320000
.*             5645-001 (C) COPYRIGHT IBM CORP 1983, 1997            *  01330000
.*                                                                   *  01340000
.* STATUS = HBB6603                                                  *  01400000
.*                                                                   *  01500000
.*01* EXTERNAL CLASSIFICATION:  NONE                                 *  01510000
.*01* END OF EXTERNAL CLASSIFICATION:                                *  01520000
.*                                                                   *  01530000
.* MODULE TYPE = MACRO                                               *  01600000
.*                                                                   *  01700000
.* INVOCATION =                                                      *  01800000
.*               BAL  - IAZSMF56 (NO DSECT CREATED - START OF RECORD *  01900000
.*                       IS AT SMFRCD56 )                            *  02000000
.*               PL/S - NONE                                         *  02100000
.*                                                                   *  02110000
.* CHANGE ACTIVITY:                                                  *  02200000
.*                                                                   *  02300000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  02400000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02410000
.*                                                                   *  02500000
.* A000000-999999    CREATED FOR MVS 1.3.3                         @133 02520000
.*********************************************************************  02600000
         SPACE 2                                                        02700000
SMFRCD56 EQU   *                   START OF RECORD                      02800000
SMF56PTR EQU   *                   HEADER SEGMENT              @OZ82688 02900000
SMF56LEN DS    CL2                 RECORD LENGTH                        03000000
SMF56SEG DS    CL2                 SEGMENT DESCRIPTOR                   03100000
         SPACE 2                                                        03200000
*  BEGINNING OF JMR OR HASP SMF RECORD                                  03300000
         SPACE 1                                                        03400000
SMF56FLG DC    BL1'0'              HEADER FLAG BYTE                     03500000
SMF56RTY DC    BL1'0'              RECORD TYPE                          03600000
SMF56TME DC    BL4'0'              TOD, USING FORMAT FROM TIME MACRO    03700000
SMF56DTE DC    PL4'0000'           DATE IN PACKD DECIMAL FORM  00YYDDDF 03800000
SMF56SID DC    CL4' '              SYSTEM IDENTIFICATION                03900000
         SPACE 2                                                        04000000
* HEADER FOR HASP SUBSYS RECORD TYPE 56                                 04100000
SMFJ56   EQU   56                  NETWORK INTEGRITY REC TYPE  @OZ82688 04200000
         SPACE 1                                                        04300000
SMF56SBS DC    XL2'0002'           HASP SUBSYSTEM ID                    04400000
SMF56HSP EQU   X'0002'                JES2 ID                           04500000
SMF56SUB DC    BL2'0'              RECORD SUBTYPE                       04600000
SMF56LRR DC    BL2'0'              LENGTH OF REST OF RECORD             04700000
* BEGINNING OF HASP TYPE 56 NETWORKING SIGNON RECORD AFTER 2 HDRS       04800000
         SPACE 1                                                        04900000
SMF56NNM DC    CL8' '              NODE NAME                            05000000
SMF56MEM DC    BL1'0'              MEMBER NUMBER                        05100000
SMF56FG1 DC    BL1'0'              SIGNON STATUS FLAGS                  05200000
SMF56RSO EQU   B'10000000'             RESPONSE SIGNON                  05300000
SMF56LPW DC    CL8' '              LINE PASSWORD                        05400000
SMF56NPW DC    CL8' '              NODE PASSWORD                        05500000
SMF56LNM DC    CL8' '              LINE NAME                            05600000
SMF56END DS    0C                  END OF TYPE 56 RECORD                05700000
         MEND                                                           99999999
