         MACRO                                                          00010000
         IAZSMF84 &SUBTYPE=,                                            00020000
*/********************************************************************/ 00030000
*/*MODULE-NAME = IAZSMF84                                            */ 00040000
*/*                                                                  */ 00050000
*/* DESCRIPTIVE-NAME = SMF RECORD 84                                 */ 00060000
*/********************************************************************/ 00070000
.*                                                                   *  00080000
.*    COPYRIGHT = LICENSED MATERIALS-PROPERTY OF IBM          #0733@MEC 00090000
.*                THIS MACRO IS "RESTRICTED MATERIALS OF IBM" #0733@MEA 00100000
.*                5647-A01 (C) COPYRIGHT IBM CORP 1983, 1999         *  00110000
.*                                                                   *  00120000
.*   STATUS =     HBB6608                                          @RJC 00150000
.*                                                                   *  00160000
.*01* EXTERNAL CLASSIFICATION:  NONE                                 *  00162000
.*01* END OF EXTERNAL CLASSIFICATION:                                *  00164000
.*                                                                   *  00166000
.*   MODULE TYPE = MACRO                                             *  00170000
.*                                                                   *  00180000
.*   INVOCATION =                                                    *  00190000
.*                BAL - IAZSMF84 SUBTYPE=NN                   #0275@MEC 00200000
.*                                                                   *  00210000
.*     PARAMETER = SUBTYPE                                           *  00220000
.*                                                                   *  00230000
.*     TYPE = KEYWORD                                                *  00240000
.*                                                                   *  00250000
.*     NN = SUBTYPE INDICATOR, ACCEPTED VALUES ARE:                  *  00260000
.*          0  -  NO SUBTYPES, JUST MAPS FOR COMMON SECTIONS         *  00270000
.*          1  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00280000
.*                SUBTYPE 1                                          *  00290000
.*          2  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00300000
.*                SUBTYPE 2                                          *  00310000
.*          3  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00320000
.*                SUBTYPE 3                                          *  00330000
.*          4  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00340000
.*                SUBTYPE 4                                          *  00350000
.*          5  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00360000
.*                SUBTYPE 5                                          *  00370000
.*          6  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00380000
.*                SUBTYPE 6                                          *  00390000
.*          7  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00400000
.*                SUBTYPE 7                                          *  00410000
.*          8  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00420000
.*                SUBTYPE 8                                          *  00430000
.*          9  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00440000
.*                SUBTYPE 9                                          *  00450000
.*         10  -  Generate mapping for all common sections, and    @RWA 00451000
.*                subtype 10                                       @RWA 00452000
.*        ALL  -  GENERATE MAPPING FOR ALL COMMON SECTIONS, AND      *  00460000
.*                MAPPING FOR ALL SUBTYPES                           *  00470000
.*                                                                   *  00480000
.*                PL/S - NONE                                        *  00490000
.*                                                                   *  00500000
.*  FUNCTION = This macro maps the SMF record type 84 record.      @RWC 00510000
.*             It has the following subtypes:                      @RWC 00520000
.*                                                                 @RWA 00525000
.*             - SUBTYPE 1 IS CREATED BY THE FCT ANALYSIS RECORD     *  00530000
.*               GENERATOR                                           *  00540000
.*                                                                 @RWA 00545000
.*             - SUBTYPE 2 IS CREATED BY THE FCT SUMMARY AND         *  00550000
.*               HIGHLIGHT RECORD GENERATOR                          *  00560000
.*                                                                 @RWA 00565000
.*             - SUBTYPE 3 IS CREATED BY THE SPOOL DATA MANAGEMENT   *  00570000
.*               RECORD GENERATOR                                    *  00580000
.*                                                                 @RWA 00585000
.*             - SUBTYPE 4 IS CREATED BY THE RESQUEUE CELL POOL,   @MPC 00590000
.*               JCT ACCESS METHOD, AND JES3 CONTROL BLOCK         @MPA 00600000
.*               RECORD GENERATOR                                  @MPC 00610000
.*                                                                 @RWA 00615000
.*             - SUBTYPE 5 IS CREATED BY THE JOB ANALYSIS RECORD     *  00620000
.*               GENERATOR                                           *  00630000
.*                                                                 @RWA 00635000
.*             - SUBTYPE 6 IS CREATED BY THE JES3 HOT SPOT ANALYSIS  *  00640000
.*               RECORD GENERATOR                                    *  00650000
.*                                                                 @RWA 00655000
.*             - SUBTYPE 7 IS CREATED BY THE JES3 INTERNAL READER DSP*  00660000
.*               ANALYSIS RECORD GENERATOR                           *  00670000
.*                                                                 @RWA 00675000
.*             - SUBTYPE 8 IS CREATED BY THE JES3 SUBSYSTEM INTERFACE*  00680000
.*               (SSI) RESPONSE RECORD GENERATOR                     *  00690000
.*                                                                 @RWA 00695000
.*             - SUBTYPE 9 IS CREATED BY THE JES3 SSI DESTINATION    *  00700000
.*               QUEUE RECORD GENERATOR                              *  00710000
.*             THE RECORD CONSISTS OF FOLLOWING PARTS:               *  00720000
.*             - THE SMF HEADER;                                     *  00730000
.*             - THE JMF PRODUCT SECTION;                            *  00740000
.*             - THE JMF GENERAL INFORMATION SECTION;                *  00750000
.*             - THE FCT ANALYSIS SUBTYPE WHICH JES3 GENERAL         *  00760000
.*               INFORMATION SECTION AND AN FCT AND AWAIT ANALYSIS   *  00770000
.*               SECTION;                                            *  00780000
.*             - THE FCT SUMMARY AND HIGHLIGHT SUBTYPE WHICH CONSISTS*  00790000
.*               OF AN FCT SUMMARY SECTION, FCT AND AWAIT HIGHLIGHT  *  00800000
.*               SECTION AND A JES3 WAIT ANALYSIS DATA SECTION;      *  00810000
.*             - THE SDM SUBTYPE WHICH CONSISTS OF A GENERAL SDM SEC-*  00820000
.*               TION, SPOOL DATASET DESCRIPTION SECTION, SPOOL PARTI*  00830000
.*               TION DESCRIPTION SECTION, SPOOL SPACE UTILIZATION   *  00840000
.*               SNAPSHOT SECTION, SINGLE TRACK TABLE SPACE ALLOCATIO*  00850000
.*               SNAPSHOT SECTION, SPOOL I/O ACTIVITY -- BUFFERS READ*  00860000
.*               AND WRITTEN -- SECTION, BUFFERS CHAINING     #0508@MEC 00870000
.*               BY SPOOL DATASET SECTION AND MINIMAL/MARGINAL TRACK *  00880000
.*               CONDITION SECTION;                                  *  00890000
.*             - THE RESQUEUE CELLPOOL AND CONTROL BLOCK SUBTYPE     *  00900000
.*               CONSISTS OF RESQUEUE CELL POOL STATISTICS AND JES3  *  00910000
.*               CONTROL BLOCK UTILIZATION RECORD;                   *  00920000
.*             - THE JOB ANALYSIS SUBTYPE CONSISTS OF A JOB ANALYSIS *  00930000
.*               SECTION, JES3 FUNCTION SUMMARY SECTION, AND JES3    *  00940000
.*               WORK-TO-D0 QUEUE SECTION;                           *  00950000
.*             - THE INTERNAL READER DSP ANALYSIS SUBTYPE;           *  00960000
.*             - THE JES3 SSI RESPONSE SUBTYPE;                      *  00970000
.*             - THE JES3 SSI DESTINATION QUEUE SUBTYPE.             *  00980000
.*                                                                 @RWA 00981000
.*             - Subtype 10 is created by the WLM analysis         @RWA 00982000
.*               record generator.                                 @RWA 00983000
.*                                                                 @RWA 00984000
*                                                                    *  00990000
* CHANGE ACTIVITY =                                                  *  01000000
*                                                                    *  01010000
*     $M0= SP311    HJS3311 880428 PD1JF:        SP3.1.1       @OY16159 01020000
*     $ME= JMF311   HJS3311 880201 PD1JF:        SP3.1.1      #0776@MEC 01030000
*     $MP= RESJCT   HJS3311 880111 PD0DR:        SP3.1.1           @MPA 01040000
*     $MD= SMSSTG2  HJS3312 880603 PD0PW:        SP3.1.2       @OY16159 01050000
*     $MR= SP312    HJS3312 880502 PD1JF:        SP3.1.2       @OY16159 01060000
*                                                                    *  01062000
*     $PF= 4DIGIT   HJS5511 930414 PD0TK:        SP5.1.1             *  01065000
*     $RJ= OS140    HJS6604 970212 PD0DR:        OS2.4.0           @RJA 01065500
*                                                                    *  01066000
*     $MF= WLM      JBB6604 970221 J_K2: record 84                   *  01067000
*     $RW= WLMBATCH HBB6608 981012 PD0DR:        OS2.8.0           @RWA 01067001
*                                                                     * 01070000
* A000000-999999          Created for MVS  3.1.1                   @311 01075000
*********************************************************************** 01080000
         SPACE 2                                                        01090000
*******************************************************************     01100000
*                                                                 *     01110000
*             SMF 84 HEADER                                       *     01120000
*                                                                 *     01130000
*******************************************************************     01140000
SMF84HDR DSECT                                                          01150000
SMF84PTR EQU   *                                                        01160000
SMF84LEN DS    H            RECORD LENGTH                               01170000
SMF84SEG DS    H            SEGMENT DESCRIPTOR                          01180000
SMF84FLG DS    X            SYSTEM INDICATOR                            01190000
*        EQU   X'80'        RESERVED                           #569@MEA 01200000
SMF84STI EQU   X'40'        SUBTYPE INDICATOR INDICATES WHICH  #0733MEC 01210000
*                            SUBSYSTEM IS BEING USED           #0733MEA 01220000
*        EQU   X'20'        RESERVED                           #569@MEA 01230000
*        EQU   X'10'        RESERVED                           #569@MEA 01240000
*        EQU   X'08'        RESERVED                           #569@MEA 01250000
*        EQU   X'04'        MVS/XA                            #0733@MEC 01260000
*        EQU   X'02'        VS2                                #569@MEA 01270000
*        EQU   X'01'        VS1                                #569@MEA 01280000
SMF84RTY DS    X            RECORD TYPE (84 OR X'54')         #0275@MEC 01290000
SMF84TME DS    PL4          TIME, IN HUNDREDS OF A SECOND WHEN#0275@MEC 01300000
*                           RECORD WAS WRITTEN  (SET BY SMF)  #0733@MEC 01310000
SMF84DTE DS    PL4          DATE RECORD WAS WRITTEN, IN THE FORM        01320000
*                           00YYDDDF WHERE F IS THE SIGN      #0275@MEC 01330000
*                           (SET BY SMF)                      #0733@MEA 01340000
SMF84SID DS    XL4          SYSTEM IDENTIFICATION (SET BY SMF)#0733@MEC 01350000
SMF84SBS DS    H            SUBSYSTEM IDENTIFICATION --                 01360000
*                            X'0005' SIGNIFIES JES3                     01370000
SMF84SGN DS    H            SEGMENT NUMBER                     #569@MEC 01380000
SMF84FL1 DS    X            FLAG BYTE 1 FOR SMF TYPE 84        #569@MEA 01390000
SMF84LST EQU   X'80'        LAST SMF SEGMENT INDICATOR         #569@MEA 01400000
SMF84VER DS    X            SMF84 VERSION NUMBER               @OY34777 01410000
*                           DEFAULT IS '00'                    @OY34777 01413000
SMF84V2  EQU   X'02'        TEMPORARY FIX INDICATOR            @OY34777 01416000
SMF84V3  EQU   X'03'        OS390 2.4.0                            @RJA 01418000
SMF84STY DS    H            RECORD SUBTYPE                              01420000
SMF84TRN DS    H            NUMBER OF TRIPLETS IN THIS RECORD           01430000
*                                                              #569@MED 01440000
SMF84PRS DS    F            OFFSET TO JMF PRODUCT SECTION               01450000
SMF84PRL DS    H            LENGTH OF JMF PRODUCT SECTION               01460000
SMF84PRN DS    H            NUMBER OF JMF PRODUCT SECTIONS    #0733@MEC 01470000
SMF84GNS DS    F            OFFSET TO JMF GENERAL SECTION               01480000
SMF84GNL DS    H            LENGTH OF JMF GENERAL SECTION               01490000
SMF84GNN DS    H            NUMBER OF JMF GENERAL SECTIONS              01500000
SMF84J1O DS    F            OFFSET TO JMF DATA SECTION                  01510000
SMF84J1L DS    H            LENGTH OF JMF DATA SECTION                  01520000
SMF84J1N DS    H            NUMBER OF JMF DATA SECTIONS                 01530000
SMF84SZ1 EQU   *-SMF84LEN   SIZE OF SMF HEADER                          01540000
         SPACE ,                                                        01550000
         AIF   ('&SUBTYPE' EQ 'ALL').PROSEC                             01560000
         AIF   ('&SUBTYPE' EQ '0').PROSEC                               01570000
         AIF   ('&SUBTYPE' EQ '1').PROSEC                               01580000
         AIF   ('&SUBTYPE' EQ '2').PROSEC                               01590000
         AIF   ('&SUBTYPE' EQ '3').PROSEC                               01600000
         AIF   ('&SUBTYPE' EQ '4').PROSEC                               01610000
         AIF   ('&SUBTYPE' EQ '5').PROSEC                               01620000
         AIF   ('&SUBTYPE' EQ '6').PROSEC                               01630000
         AIF   ('&SUBTYPE' EQ '7').PROSEC                               01640000
         AIF   ('&SUBTYPE' EQ '8').PROSEC                               01650000
         AIF   ('&SUBTYPE' EQ '9').PROSEC                               01660000
         AIF   ('&SUBTYPE' EQ '10').PROSEC                         @RWA 01661000
         SPACE 3                                                        01670000
.ERROR   MNOTE 8, &SUBTYPE INVALID RECORD SUBTYPE SPECIFIED             01680000
.CONTB   ANOP                                                           01690000
         MEXIT                                                          01700000
         SPACE 1                                                        01710000
.PROSEC  ANOP                                                           01720000
         SPACE 2                                                        01730000
*******************************************************************     01740000
*                                                                 *     01750000
*          SMF 84 PRODUCT SECTION                                 *     01760000
*                                                                 *     01770000
*******************************************************************     01780000
SMF84PRO DSECT                                                          01790000
R84MFVER DS    H            JMF VERSION NUMBER                          01800000
R84PRDNM DS    CL8          PRODUCT NAME (I.E., SC1BA    )              01810000
R84INTST DS    PL4          TOD JMF MEASUREMENT INTERVAL STARTED,       01820000
*                           IN THE FORM HHMMSSTF, F = SIGN,   #0733@MEC 01830000
*                           T IS TENTHS OF SECONDS            #0733@MEA 01840000
R84SDATE DS    PL4          DATE JMF MEASUREMENT INTERVAL STARTED,      01850000
*                           IN THE FORM 00YYDDDF, WHERE F IS THE SIGN   01860000
R84INTEN DS    PL4          TOD JMF MEASUREMENT INTERVAL ENDED,         01870000
*                           IN THE FORM HHMMSSTF, F = SIGN,   #0733@MEC 01880000
*                           T IS TENTHS OF SECONDS            #0733@MEA 01890000
R84EDATE DS    PL4          DATE JMF MEASUREMENT INTERVAL ENDED,        01900000
*                           IN THE FORM 00YYDDDF, WHERE F IS THE SIGN   01910000
R84INTER DS    PL4          JMF INTERVAL LENGTH IN SECONDS    #0776@MEC 01920000
*                                                            2#0776@MED 01930000
R84MFCYC DS    PL4          JMF SAMPLING CYCLE LENGTH IN THE  #0275@MEC 01940000
*                           FORM OF 00SSSTTF, F = SIGN,       #0402@MEC 01950000
*                           (TAKEN FROM THE CYCLE OPTION)     #0275@MEC 01960000
         DS    XL2          RESERVED FOR DEVELOPMENT          #0275@MEA 01970000
R84SAMPL DS    F            NUMBER OF JMF SAMPLES                       01980000
R84MFCMD DS    CL80         *CALL,JMF COMMAND                           01990000
R84MVSRL DS    CL8          MVS SOFTWARE LEVEL (CONSISTS OF AN          02000000
*                           ACRONYM AND THE VERSION, RELEASE, AND       02010000
*                           MODIFICATION LEVEL NUMBERS)                 02020000
R84JESRL DS    CL8          JES3 RELEASE LEVEL                          02030000
R84CPUM  DS    CL4          CPU MODEL NUMBER                            02040000
R84RSTO  DS    F            REAL STORAGE SIZE IN K            #0360@MEC 02050000
R84CPUNM DS    CL8          CPU SERIAL NUMBER                           02060000
R84CPUID DS    CL4          JES3 CPU ID                       #0275@MEC 02070000
R84MPNAM DS    CL8          MAIN PROCESSOR NAME                         02080000
R84J3FLG DS    X            JES3 STATUS INDICATOR FLAG                  02090000
R84J3PRO EQU   X'80'        JES3 PROCESSOR INDICATOR:         #0275@MEC 02100000
*                             OFF MEANS JES3 GLOBAL                     02110000
*                             ON  MEANS JES3 LOCAL                      02120000
R84J3APG EQU   X'40'        JES3 IS IN THE APG PRIORITY LEVEL           02130000
R84J3SWP EQU   X'20'        JES3 IS NON-SWAPPABLE                       02140000
         DS    XL1          RESERVED                                    02150000
R84JPRTY DS    H            JES3 DISPATCHING PRIORITY                   02160000
R84JMFMN DS    F            MIN. JMF OVERHEAD IN MICROSECONDS #0615@MEC 02170000
R84JMFMX DS    F            MAX. JMF OVERHEAD IN MICROSECONDS #0615@MEC 02180000
R84JMFAV DS    F            AVG. JMF OVERHEAD IN MICROSECONDS #0615@MEC 02190000
*                           % OF JMF INTERVAL TIME = JMF AVG   @OY20511 02200000
*                           TIME * JMF SAMPLES / JMF INTERVAL  @OY20511 02210000
*                           TIME IN MICROSECONDS * 100         @OY20511 02220000
R84MVSMN DS    F            MIN. MVS OVERHEAD IN MICROSECONDS #0615@MEC 02230000
R84MVSMX DS    F            MAX. MVS OVERHEAD IN MICROSECONDS #0615@MEC 02240000
R84MVSAV DS    F            AVG. MVS OVERHEAD IN MICROSECONDS #0615@MEC 02250000
*                           % OF JMF INTERVAL TIME = MVS AVG   @OY20511 02260000
*                           TIME * JMF SAMPLES / JMF INTERVAL  @OY20511 02260100
*                           TIME IN MICROSECONDS * 100         @OY20511 02260200
R84PSSZ1 EQU   *-R84MFVER   SIZE OF JMF PRODUCT SECTION                 02280000
         SPACE 2                                                        02290000
*******************************************************************     02300000
*                                                                 *     02310000
*         SMF 84 GENERAL SECTION                                  *     02320000
*                                                                 *     02330000
*******************************************************************     02340000
SMF84GS  DSECT                                                          02350000
R84CPUSC DS    F            CPU BUSY SAMPLE COUNT                       02360000
R84NPA   DS    F            IATNUC POSTED-ACTIVE COUNT;                 02370000
*                           % OF IATNUC POSTED-ACTIVE = IATNUC POSTED-  02380000
*                           ACTIVE COUNT / CPU BUSY SAMPLE COUNT * 100  02390000
R84APA   DS    F            IATAUX POSTED-ACTIVE COUNT;                 02400000
*                           % OF IATAUX POSTED-ACTIVE = IATAUX POSTED-  02410000
*                           ACTIVE COUNT / CPU BUSY SAMPLE COUNT * 100  02420000
R84NPNA  DS    F            IATNUC POSTED--NOT-ACTIVE COUNT;            02430000
*                           % OF IATNUC POSTED-NOT-ACTIVE = IATNUC      02440000
*                           POSTED-NOT-ACTIVE COUNT / CPU BUSY SAMPLE   02450000
*                           COUNT * 100                                 02460000
R84APNA  DS    F            IATAUX POSTED--NOT-ACTIVE COUNT;            02470000
*                           % OF IATAUX POSTED-NOT-ACTIVE = IATAUX      02480000
*                           POSTED-NOT-ACTIVE COUNT / CPU BUSY SAMPLE   02490000
*                           COUNT * 100                                 02500000
R84NNP   DS    F            IATNUC NOT-POSTED COUNT;                    02510000
*                           % OF IATNUC NOT-POSTED = IATNUC NOT-POSTED  02520000
*                           COUNT / CPU BUSY SAMPLE COUNT * 100         02530000
R84ANP   DS    F            IATAUX NOT-POSTED COUNT;                    02540000
*                           % OF IATAUX NOT-POSTED = IATAUX NOT-POSTED  02550000
*                           COUNT / CPU BUSY SAMPLE COUNT * 100         02560000
R84NNW   DS    F            IATNUC NONSTANDARD-WAIT COUNT;              02570000
*                           % OF IATNUC NONSTANDARD-WAIT = IATNUC NON-  02580000
*                           STANDARD WAIT COUNT / CPU BUSY SAMPLE COUNT 02590000
*                           * 100                                       02600000
R84ANW   DS    F            IATAUX NONSTANDARD-WAIT COUNT;              02610000
*                           % OF IATAUX NONSTANDARD-WAIT = IATAUX NON-  02620000
*                           STANDARD-WAIT COUNT / CPU BUSY SAMPLE COUNT 02630000
*                           * 100                                       02640000
R84NSLLR DS    F            IATNUC SUSPENDED-LOCAL-LOCK-REQUEST COUNT;  02650000
*                           % OF IATNUC SUSPENDED-LOCAL-LOCK-REQUEST =  02660000
*                           IATNUC SUSPENDED-LOCAL-LOCK-REQUEST COUNT / 02670000
*                           CPU BUSY SAMPLE COUNT * 100                 02680000
R84ASLLR DS    F            IATAUX SUSPENDED-LOCAL-LOCK-REQUEST COUNT;  02690000
*                           % OF IATAUX SUSPENDED-LOCAL-LOCK-REQUEST =  02700000
*                           IATAUX SUSPENDED-LOCAL-LOCK-REQUEST COUNT   02710000
*                           / CPU BUSY SAMPLE COUNT * 100               02720000
R84NSO   DS    F            IATNUC SUSPENDED-OTHER COUNT;               02730000
*                           % OF IATNUC SUSPENDED-OTHER = IATNUC        02740000
*                           SUSPENDED-OTHER COUNT / CPU BUSY SAMPLE     02750000
*                           COUNT * 100                                 02760000
R84ASO   DS    F            IATAUX SUSPENDED-OTHER COUNT;               02770000
*                           % OF IATAUX SUSPENDED-OTHER = IATAUX        02780000
*                           SUSPENDED-OTHER COUNT / CPU BUSY SAMPLE     02790000
*                           COUNT * 100                                 02800000
R84GISZ1 EQU   *-R84CPUSC   SIZE OF JMF GENERAL INFO SECTION            02810000
         EJECT                                                          02820000
         AIF   ('&SUBTYPE' EQ '1').SUBTYP1                     #695@MEA 02830000
         AIF   ('&SUBTYPE' EQ '2').SUBTYP2                     #695@MEA 02840000
         AIF   ('&SUBTYPE' EQ '3').SUBTYP3                              02850000
         AIF   ('&SUBTYPE' EQ '4').SUBTYP4                              02860000
         AIF   ('&SUBTYPE' EQ '5').SUBTYP5                              02870000
         AIF   ('&SUBTYPE' EQ '6').SUBTYP6                              02880000
         AIF   ('&SUBTYPE' EQ '7').SUBTYP7                              02890000
         AIF   ('&SUBTYPE' EQ '8').SUBTYP8                              02900000
         AIF   ('&SUBTYPE' EQ '9').SUBTYP9                              02910000
         AIF   ('&SUBTYPE' EQ '10').SUBTY10                        @RWA 02911000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP1                   #695@MEA 02920000
         MEXIT                                                 #695@MEA 02930000
.SUBTYP1 ANOP                                                           02940000
*******************************************************************     02950000
*                                                                 *     02960000
*          SUBTYPE 1  HEADER SECTION                           #569@MEC 02970000
*                                                                 *     02980000
*******************************************************************     02990000
SMF84JS3 DSECT                                                          03000000
R84JES3O DS    F        OFFSET TO JES3 GENERAL INFO. SECTION   #569@MEA 03010000
R84IRBSC DS    F        OFFSET TO THE IRB SECTION              @OY16159 03020000
R84FCTO  DS    F        OFFSET TO FCT AND AWAIT ANALYSIS SECTION        03030000
R84FFLG1 DS    X        MISC. FLAG                             #569@MEA 03040000
R84JSSEC EQU   X'80'    RECORD CONTAINS JES3 GENERAL INFO. SEC #569@MEA 03050000
R84FCSEC EQU   X'40'    RECORD CONTAINS FCT AND AWAIT ANALYSIS #569@MEA 03060000
*                       SECTION                                #569@MEA 03070000
R84RBSEC EQU   X'20'    RECORD CONTAINS IRB SECTION            @OY16159 03080000
         DS    XL3      RESERVED                               #569@MEA 03090000
R84JS3S0 EQU   *-R84JES3O SIZE OF SUBTYPE 1 HEADER             #569@MEA 03100000
***************************************************************#569@MEA 03110000
*   JES3 GENERAL INFORMATION SECTION                          *#569@MEA 03120000
***************************************************************#569@MEA 03130000
R84JES3  DSECT                                                 #569@MEA 03140000
*******************************************************************     03150000
*   PAGING INFORMATION                                            *     03160000
*******************************************************************     03170000
R84FOE   DS    F        NUMBER OF FIXED PAGES                           03180000
R84FOESZ DS    F        TOTAL SIZE OF ALL FIX PAGES IN K      #0360@MEC 03190000
R84SLOT  DS    F        AUXILIARY SLOT COUNT                            03200000
R84SLOTS DS    F        TOTAL SIZE OF ALL AUXILIARY SLOTS IN K#0360@MEC 03210000
R84JPIN  DS    F        JES3 PAGE-INS DURING JMF MONITORING             03220000
R84JPOUT DS    F        JES3 PAGE-OUTS DURING JMF MONITORING            03230000
R84JPREC DS    F        JES3 PAGE-RECLAIMS DURING JMF MONITORING        03240000
R84JPGCT DS    F        JES3 PAGING COUNT DURING JMF          #0409@MEC 03250000
*                       MONITORING                            #0409@MEA 03260000
**************************************************************#0409@MEA 03270000
* JES3 PAGING RATE PER SECOND DURING JMF MONITORING = (THE   *#0409@MEA 03280000
* TOTAL NUMBER OF PAGE-IN'S AND PAGE-OUT'S DURING JMF MON-   *#0409@MEA 03290000
* ITORING ( I.E. JES3 PAGING COUNT, R84JPGCT ))/ JMF INTERVAL* @OY16159 03300000
* LENGTH IN SECONDS (R84INTER). THEN RESULTS IN THE FORMAT   * @OY16159 03310000
* OF XXX.XX PAGES/SECOND                                     * @OY16159 03320000
**************************************************************#0409@MEA 03330000
R84SPGCT DS    F        SYSTEM PAGING COUNT (NON-SWAPPABLE    #0409@MEC 03340000
*                       AND NON-VIO) DURING JMF MONITORING    #0409@MEC 03350000
**************************************************************#0409@MEA 03360000
* SYSTEM PAGING RATE PER SECOND DURING JMF MONITORING = (THE *#0409@MEA 03370000
* TOTAL NUMBER OF SYSTEM PAGE-IN'S AND PAGE-OUT'S DURING JMF *#0615@MEC 03380000
* MONITORING ( I.E. SYSTEM PAGING COUNT, R84SPGCT )) / JMF   * @OY16159 03390000
* INTERVAL LENGTH IN SECONDS (R84INTER).  RESULTS IN THE     * @OY16159 03400000
* FORMAT OF XXX.XX PAGES/SECOND                              *#0776@MEC 03410000
**************************************************************#0409@MEA 03420000
         SPACE 1                                                        03430000
**********************************************************************  03440000
*   JES3 WORKING SET INFORMATION                                     *  03450000
**********************************************************************  03460000
R84WSPLO DS    F        LOW RANGE OF WORKING SET PLOT SCALE             03470000
*                       IN K                                  #0361@MEA 03480000
R84WSPHI DS    F        HIGH RANGE OF WORKING SET PLOT SCALE            03490000
*                       IN K                                  #0361@MEA 03500000
R84WSINC DS    F        INCREMENT FOR WORKING SET PLOT IN K   #0360@MEC 03510000
R84WSMIN DS    F        MINIMUM WORKING SET SIZE IN K                   03520000
R84WSMAX DS    F        MAXIMUM WORKING SET SIZE IN K                   03530000
R84WSAVG DS    F        AVERAGE WORKING SET SIZE IN K                   03540000
R84JMFSZ DS    F        JMF SIZE THAT IS INCLUDED IN WORKING SET SIZE   03550000
*                       IN K                                  #0361@MEA 03560000
R84WSPTN DS    F        TOTAL NUMBER OF WORKING SET PLOT COUNTER        03570000
*                       ENTRIES                                         03580000
R84WSPTO DS    F        OFFSET OF 1ST WORKING SET PLOT COUNTER ENTRY    03590000
         SPACE 1                                                        03600000
**********************************************************************  03610000
*   JES3 SUBTASKS INFORMATION                                        *  03620000
**********************************************************************  03630000
R84ONES  DS    F            COUNT FOR ONE JES3 SUBTASK POSTED;          03640000
*                           % OF ONE JES3 SUBTASK POSTED = ONE JES3SUB  03650000
*                           TASK POSTED COUNT / CPU BUSY SAMPLE COUNT   03660000
*                           * 100                                       03670000
R84TWOS  DS    F            COUNT FOR TWO JES3 SUBTASKS POSTED          03680000
*                           CONCURRENTLY;                               03690000
*                           % OF TWO JES3 SUBTASK POSTED CONCURRENTLY   03700000
*                           = TWO JES3 SUBTASK POSTED CONCURRENTLY      03710000
*                           COUNT / CPU BUSY SAMPLE COUNT * 100         03720000
R84THREE DS    F            COUNT FOR THREE JES3 SUBTASKS POSTED        03730000
*                           CONCURRENTLY;                               03740000
*                           % OF THREE JES3 SUBTASK POSTED CONCURRENTLY 03750000
*                           = THREE JES3 SUBTASK POSTED CONCURRENTLY/   03760000
*                           CPU BUSY SAMPLE COUNT * 100                 03770000
R84FOURS DS    F            COUNT FOR FOUR OR MORE JES3 SUBTASK POSTED  03780000
*                           CONCURRENTLY;                               03790000
*                           % OF FOUR OR MORE JES3 SUBTASKS POSTED      03800000
*                           CONCURRENTLY = FOUR OR MORE JES3 SUBTASKS   03810000
*                           POSTED CONCURRENTLY COUNT / CPU BUSY SAMPLE 03820000
*                           COUNT * 100                                 03830000
R84SUBNM DS    F            TOTAL NUMBER OF JES3 SUBTASK ENTRIES        03840000
R84SUBOF DS    F            OFFSET OF THE 1ST JES3-SUBTASK ENTRY        03850000
R84NNFCT DS    F            IATNUC POSTED-BUT-NO-FCT-POSTED COUNT;      03860000
*                           % OF IATNUC POSTED-BUT-NO-FCT-POSTED =      03870000
*                           IATNUC POSTED-BUT-NO-FCT-POSTED COUNT /     03880000
*                           (IATNUC POSTED-ACTIVE COUNT + IATNUC        03890000
*                           POSTED-NOT-ACTIVE COUNT) * 100    #0371@MEC 03900000
R84ANFCT DS    F            IATAUX POSTED-BUT-NO-FCT-POSTED COUNT;      03910000
*                           % OF IATAUX POSTED-BUT-NO-FCT-POSTED =      03920000
*                           IATAUX POSTED-BUT-NO-FCT-POSTED COUNT /     03930000
*                           (IATAUX POSTED-ACTIVE COUNT + IATAUX        03940000
*                           POSTED-NOT-ACTIVE COUNT) * 100    #0371@MEC 03950000
R84JS3S1 EQU   *-R84FOE     SIZE OF JES3 GENERAL INFO. SECTION #569@MEC 03960000
         SPACE 1                                                        03970000
*********************************************************************   03980000
*   THE FOLLOWING DSECT WILL MAP EACH JES3 SUBTASK ENTRY            *   03990000
*********************************************************************   04000000
R84SUB   DSECT                                                          04010000
R84SSEQN DS    F            SUBTASK SEQUENCE NUMBER           #0371@MEC 04020000
R84SNAME DS    CL8          SUBTASK NAME                                04030000
R84SPPC  DS    F            SUBTASK POSTED COUNT;                       04040000
*                           % OF SUBTASK POSTED =             #0371@MEA 04050000
*                           SUBTASK POSTED COUNT /            #0371@MEA 04060000
*                           CPU BUSY SAMPLE COUNT * 100       #0371@MEA 04070000
*                                                              @OY34777 04075000
R84TSKSZ EQU   *-R84SSEQN   SIZE OF JES3 SUBTASK ENTRY                  04080000
         SPACE 1                                                        04090000
*********************************************************************** 04100000
*   THE FOLLOWING DSECT WILL MAP EACH WORKING SET PLOT COUNTER ENTRY  * 04110000
*********************************************************************** 04120000
R84WSPLT DSECT          WORKING SET PLOT ENTRY                          04130000
R84WSPTS DS    F        WORKING SET PLOT SCALE                          04140000
R84WSPTC DS    F        COUNT FOR WORKING SET SIZE FOR ABOVE            04150000
*                                                              @OY34777 04155000
R84WSPS1 EQU   *-R84WSPTS SIZE OF JES3 WORKING SET PLOT COUNTER ENTRY   04160000
*                       MENTIONED SCALE                                 04170000
         SPACE 2                                                        04180000
************************************************************** @OY16159 04190000
*                                                            * @OY16159 04200000
*          SUBTYPE 1 -- IRB HEADER SECTION                   * @OY16159 04210000
*                                                            * @OY16159 04220000
************************************************************** @OY16159 04230000
R84IRBH  DSECT                                                 @OY16159 04240000
R84NIRBO DS    F        OFFSET OF THE FIRST NUC IRB TAB ENTRY  @OY16159 04250000
R84NIRBC DS    F        TOTAL NUMBER OF JES3 IRBS IN IATNUC    @OY16159 04260000
R84NTOTA DS    F        TOTAL NUM OF ACTIVE NUC IRB ENTRIES    @OY16159 04270000
R84NTOTS DS    F        TOTAL NUM OF SUSPENDED NUC IRB ENTRIES @OY16159 04280000
R84NTOTO DS    F        TOTAL NUM OF IN-OS-WAIT IRB ENTRIES    @OY16159 04290000
*                       IN IATNUC                              @OY16159 04300000
R84AIRBO DS    F        OFFSET OF THE FIRST AUX IRB TAB ENTRY  @OY16159 04310000
R84AIRBC DS    F        TOTAL NUMBER OF JES3 IRBS IN IATAUX    @OY16159 04320000
R84ATOTA DS    F        TOTAL NUM OF ACTIVE AUX IRB ENTRIES    @OY16159 04330000
R84ATOTS DS    F        TOTAL NUM OF SUSPENDED AUX IRB ENTRIES @OY16159 04340000
R84ATOTO DS    F        TOTAL NUM OF IN-OS-WAIT IRB ENTRIES    @OY16159 04350000
*                       IN IATAUX                              @OY16159 04360000
R84IRBFG DS    X        MISC. FLAG FOR THE IRB SECTION         @OY16159 04370000
R84NUCOV EQU   X'40'    NUC IRB TABLE HAS OVERFLOWED           @OY16159 04380000
R84AUXOV EQU   X'80'    AUX IRB TABLE HAS OVERFLOWED           @OY16159 04390000
         DS    XL3      RESERVED                               @OY16159 04400000
R84IRBHS EQU   *-R84NIRBO SIZE OF THE IRB HEADER SECTION       @OY16159 04410000
************************************************************** @OY16159 04420000
*    THE FOLLOWING IS A MAPPING FOR EACH IRB TABLE ENTRY     * @OY16159 04430000
*   NUC IRB AND AUX IRB BOTH USE THIS MAPPING FOR ITS TABLE  * @OY16159 04440000
************************************************************** @OY16159 04450000
R84IRBD  DSECT                                                 @OY16159 04460000
R84IRBNM DS    CL8      NAME OR ADDRESS OF THE JES3 IRB        @OY16159 04470000
R84IRBAC DS    F        COUNT FOR ACTIVE JES3 IRB              @OY16159 04480000
R84IRBSU DS    F        COUNT FOR SUSPENDED JES3 IRB           @OY16159 04490000
R84IRBWT DS    F        COUNT FOR IN-OS-WAIT JES3 IRB          @OY16159 04500000
*                                                              @OY34777 04505000
R84IRBSZ EQU   *-R84IRBNM SIZE OF JES3 IRB TABLE ENTRY         @OY16159 04510000
*******************************************************************     04520000
*                                                                 *     04530000
*          SUBTYPE 1 -- FCT AND AWAIT ANALYSIS HEADER SECTION  #569@MEC 04540000
*                                                                 *     04550000
*******************************************************************     04560000
SMF84FAW DSECT                                                          04570000
R84FAWLN DS    F        LENGTH OF THE FCT AND AWAIT SECTION   #0371@MEC 04580000
R84NMFMA DS    F        COUNT FOR MULTI-FUNCTION MONITOR ACTIVE IN      04590000
*                       IATNUC; % OF SAMPLES = MFM ACTIVE IN IATNUC     04600000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            04610000
*                       % OF IATNUC = MFM ACTIVE IN IATNUC COUNT /      04620000
*                       IATNUC POSTED-ACTIVE COUNT * 100      #0615@MEC 04630000
R84NMFMS DS    F        COUNT FOR MULTI-FUNCTION MONITOR SUSPENDED IN   04640000
*                       IATNUC;                                         04650000
*                       % OF SAMPLES = MFM SUSPENDED IN IATNUC          04660000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             04670000
R84NMFMW DS    F        COUNT FOR MULTI-FUNCTION MONITOR IN-OS-WAIT IN  04680000
*                       IATNUC; % OF SAMPLES = MFM IN-OS-WAIT IN        04690000
*                       IATNUC COUNT / CPU BUSY SAMPLE COUNT * 100      04700000
*                                                            9#0406@MRD 04710000
R84AMFMA DS    F        COUNT FOR MULTI-FUNCTION MONITOR ACTIVE IN      04720000
*                       IATAUX; % OF SAMPLES = MFM ACTIVE IN  #0615@MEC 04730000
*                       IATAUX CNT / CPU BUSY SAMPLE CNT *100;#0615@MEC 04740000
*                       % OF IATAUX = MFM ACTIVE IN IATAUX CNT#0615@MEC 04750000
*                       / IATAUX POSTED-ACTIVE COUNT * 100    #0615@MEC 04760000
R84AMFMS DS    F        COUNT FOR MULTI-FUNCTION MONITOR SUSPENDED IN   04770000
*                       IATAUX;  % OF SAMPLES = MFM SUSPENDED IN IATAUX 04780000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             04790000
R84AMFMW DS    F        COUNT FOR MULTI-FUNCTION MONITOR IN-OS-WAIT IN  04800000
*                       IATAUX; % OF SAMPLES = MFM IN-OS-WAIT IN IATAUX 04810000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             04820000
*                                                            9#0406@MRD 04830000
R84FCTN  DS    H        TOTAL NUMBER OF FCT ENTRIES                     04840000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0411@MEA 04850000
R84FCTOF DS    F        OFFSET OF THE FIRST FCT ENTRY                   04860000
R84FASZ1 EQU   *-R84FAWLN   SIZE OF THE FCT AND AWAIT SECTION           04870000
*********************************************************************** 04880000
*   THE FOLLOWING IS A MAPPING FOR EACH FCT ENTRY                     * 04890000
*********************************************************************** 04900000
R84FCT   DSECT                                                          04910000
R84FSEQN DS    H        FCT SEQUENCE NUMBER                             04920000
         DS    H        RESERVED                               #569@MEA 04930000
R84FNEXT DS    F        LENGTH OF THIS FCT ENTRY               @OY16159 04940000
*                       ALSO USED AS OFFSET TO NEXT FCT,UNLESS#0479@MRA 04950000
*                       THIS IS THE LAST FCT                  #0479@MRA 04960000
R84FNAM  DS    CL8      DSP NAME                                        04970000
R84FDEV  DS    CL8      DEVICE NAME                                     04980000
R84FPRTY DS    H        FCT PRIORITY                                    04990000
R84FCXOF DS    H        Offset of FCT entry extension from the     @RJC 05000000
*                         start of the this FCT entry              @RJA 05005000
R84FFCT  DS    F        FCT ON FCT CHAIN COUNT;                         05010000
*                       % OF SAMPLES = FCT ON FCT CHAIN COUNT           05020000
*                       / CPU BUSY SAMPLE COUNT * 100         #0285@MEC 05030000
R84FNUC  DS    F        FCT IN IATNUC MODE COUNT;                       05040000
*                       % OF SAMPLES = FCT IN IATNUC MODE COUNT         05050000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05060000
*                       % OF FCT = FCT IN IATNUC MODE COUNT             05070000
*                       / FCT ON FCT CHAIN COUNT * 100                  05080000
R84FAUX  DS    F        FCT IN IATAUX MODE COUNT;                       05090000
*                       % OF SAMPLES = FCT IN IATAUX MODE COUNT         05100000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05110000
*                       % OF FCT = FCT IN IATAUX MODE COUNT / #0615@MEC 05120000
*                       FCT ON FCT CHAIN COUNT * 100                    05130000
*********************************************************************** 05140000
*   ACTIVITY UNDER IATNUC MODE                                        * 05150000
*********************************************************************** 05160000
R84FNFPA DS    F        COUNT FOR FCT POSTED-ACTIVE IN IATNUC;          05170000
*                       % OF SAMPLES = FCT POSTED-ACTIVE IN IATNUC      05180000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05190000
*                       % OF IATNUC = FCT POSTED-ACTIVE IN IATNUC COUNT 05200000
*                       / IATNUC POSTED-ACTIVE COUNT * 100;             05210000
*                       % OF FCT = FCT POSTED-ACTIVE IN IATNUC COUNT    05220000
*                       / FCT ON FCT CHAIN COUNT * 100                  05230000
R84FNFNA DS    F        COUNT FOR FCT POSTED-NOT ACTIVE IN IATNUC;      05240000
*                       % OF SAMPLES = FCT POSTED-NOT ACTIVE IN IATNUC  05250000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05260000
*                       % OF FCT = FCT POSTED-NOT ACTIVE IN IATNUC      05270000
*                       COUNT / FCT ON FCT CHAIN COUNT * 100            05280000
R84FNFNP DS    F        COUNT FOR FCT NOT POSTED IN IATNUC;             05290000
*                       % OF SAMPLES = FCT NOT POSTED IN IATNUC COUNT   05300000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05310000
*                       % OF FCT = FCT NOT POSTED IN IATNUC COUNT /     05320000
*                       FCT ON FCT CHAIN COUNT * 100                    05330000
R84FNFW  DS    F        COUNT FOR FCT IN-OS-WAIT IN IATNUC;             05340000
*                       % OF SAMPLES = FCT IN-OS-WAIT IN IATNUC COUNT   05350000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05360000
*                       % OF FCT = FCT IN-OS-WAIT IN IATNUC COUNT /     05370000
*                       FCT ON FCT CHAIN COUNT * 100                    05380000
R84FNFS  DS    F        COUNT FOR FCT SUSPENDED--LOCAL LOCK REQUEST IN  05390000
*                       IATNUC;                                         05400000
*                       % OF SAMPLES = FCT SUSPENDED--LOCAL LOCK        05410000
*                       REQUEST IN IATNUC / CPU BUSY SAMPLE COUNT * 100 05420000
*                       % OF FCT =  FCT SUSPENDED--LOCAL LOCK REQUEST   05430000
*                       IN IATNUC COUNT / FCT ON FCT CHAIN COUNT * 100  05440000
R84FNFSO DS    F        COUNT FOR FCT SUSPENDED--OTHER IN IATNUC;       05450000
*                       % OF SAMPLES = FCT SUSPENDED--OTHER IN IATNUC   05460000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05470000
*                       % OF FCT =  FCT SUSPENDED--OTHER IN IATNUC      05480000
*                       COUNT / FCT ON FCT CHAIN COUNT * 100            05490000
R84FNENT DS    H        TOTAL NUMBER OF FCT AWAIT ENTRIES IN IATNUC     05500000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0286@MEA 05510000
R84FNOFF DS    F        OFFSET OF THE 1ST AWAIT ENTRY IN IATNUC         05520000
*                                                              @OY34777 05525000
*********************************************************************** 05530000
*   ACTIVITY UNDER IATAUX MODE                                        * 05540000
*********************************************************************** 05550000
R84FAFPA DS    F        COUNT FOR FCT POSTED-ACTIVE IN IATAUX;          05560000
*                       % OF SAMPLES = FCT POSTED-ACTIVE IN IATAUX      05570000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05580000
*                       % OF IATAUX = FCT POSTED-ACTIVE IN IATAUX COUNT 05590000
*                       / IATAUX POSTED-ACTIVE COUNT * 100;             05600000
*                       % OF FCT = FCT POSTED-ACTIVE IN IATAUX COUNT    05610000
*                       / FCT ON FCT CHAIN COUNT * 100                  05620000
R84FAFNA DS    F        COUNT FOR FCT POSTED-NOT ACTIVE IN IATAUX;      05630000
*                       % OF SAMPLES = FCT POSTED-NOT ACTIVE IN IATAUX  05640000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05650000
*                       % OF FCT = FCT POSTED-NOT ACTIVE IN IATAUX      05660000
*                       COUNT / FCT ON FCT CHAIN COUNT * 100            05670000
R84FAFNP DS    F        COUNT FOR FCT NOT POSTED IN IATAUX;             05680000
*                       % OF SAMPLES = FCT NOT POSTED IN IATAUX COUNT   05690000
*                       / CPU BUSY SAMPLE COUNT * 100;                  05700000
*                       % OF FCT = FCT NOT POSTED IN IATAUX COUNT /     05710000
*                       FCT ON FCT CHAIN COUNT * 100                    05720000
R84FAFW  DS    F        COUNT FOR FCT IN-OS-WAIT IN IATNUC;             05730000
*                       % OF SAMPLES = FCT IN-OS-WAIT IN IATAUX COUNT / 05740000
*                       CPU BUSY SAMPLE COUNT * 100;                    05750000
*                       % OF FCT = FCT IN-OS-WAIT IN IATAUX COUNT / FCT 05760000
*                       ON FCT CHAIN COUNT * 100                        05770000
R84FAFS  DS    F        COUNT FOR FCT SUSPENDED--LOCAL LOCK REQUEST IN  05780000
*                       IATAUX;                                         05790000
*                       % OF SAMPLES = FCT SUSPENDED--LOCAL LOCK        05800000
*                       REQUEST IN IATAUX COUNT / CPU BUSY SAMPLE COUNT 05810000
*                       * 100;                                          05820000
*                       % OF FCT =  FCT SUSPENDED--LOCAL LOCK REQUEST   05830000
*                       IN IATAUX COUNT / FCT ON FCT CHAIN COUNT * 100  05840000
R84FAFSO DS    F        COUNT FOR FCT SUSPENDED--OTHER IN IATAUX;       05850000
*                       % OF SAMPLES = FCT SUSPENDED--OTHER IN IATAUX   05860000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100;            05870000
*                       % OF FCT =  FCT SUSPENDED--OTHER IN IATAUX      05880000
*                       COUNT / FCT ON FCT CHAIN COUNT * 100            05890000
R84FAENT DS    H        TOTAL NUMBER OF FCT AWAIT ENTRIES IN IATAUX     05900000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0286@MEA 05910000
R84FAOFF DS    F        OFFSET OF THE 1ST AWAIT ENTRY IN IATAUX         05920000
*                                                              @OY34777 05925000
R84FCSZ1 EQU   *-R84FSEQN   SIZE OF THE FCT ENTRY                       05930000
         EJECT ,                                                   @RJA 05930100
***************************************************************    @RJA 05930200
*                                                             *    @RJA 05930300
*        FCT Entry Extension.                                 *    @RJA 05930400
*                                                             *    @RJA 05930500
***************************************************************    @RJA 05930600
R84FCTX  DSECT ,                   FCT Entry Extension             @RJA 05930700
R84FCXLN DC    H'0'                Length of extension.  Use       @RJA 05930800
*                                    this field to determine       @RJA 05930900
*                                    what data is present in       @RJA 05931000
*                                    extension.                    @RJA 05931100
*                                                                  @RJA 05931200
R84FCXRS DC    H'0'                Reserved for development        @RJA 05931300
*                                                                  @RJA 05931400
R84MRFRI DC    F'0'                Number of multi-record file     @RJA 05931500
*                                    read I/O's                    @RJA 05931600
R84MRFWI DC    F'0'                Number of multi-record file     @RJA 05931700
*                                    write I/O's                   @RJA 05931800
R84SRFRI DC    F'0'                Number of single record         @RJA 05931900
*                                    file read I/O's               @RJA 05932000
R84SRFRB DC    F'0'                Number of single record         @RJA 05932100
*                                    file buffers read             @RJA 05932200
R84SRFWI DC    F'0'                Number of single record         @RJA 05932300
*                                    file write I/O's              @RJA 05932400
R84SRFWB DC    F'0'                Number of single record         @RJA 05932500
*                                    file buffers written          @RJA 05932600
*                                                                  @RJA 05932700
R84FCXR2 DC    25F'0'              Reserved for development        @RJA 05932800
*                                                                  @RJA 05939700
R84FCXSZ EQU   *-R84FCTX           Size of FCT entry extension     @RJA 05939800
         EJECT ,                                                   @RJA 05939900
*********************************************************************** 05940000
*   THE FOLLOWING IS A MAPPING FOR EACH FCT AWAIT ENTRY               * 05950000
*********************************************************************** 05960000
R84AWAIT DSECT                                                          05970000
         SPACE 1                                               @OY16159 05980000
*-------------------------------------------------------------*@OY16159 05990000
*        FCT AWAIT FLAG ONE                                   *@OY16159 06000000
*-------------------------------------------------------------*@OY16159 06010000
R84AWFL1 DS    X         FCT AWAIT FLAG 1                               06020000
R84AWGS  EQU   X'80'     AWAIT IS FOR GENERALIZED SUBTASK               06030000
R84AWRJP EQU   X'40'     AWAIT IS FOR RJP I/O                           06040000
R84AWRS  EQU   X'20'     AWAIT IS FOR SPECIALIZED RESCHEDULING          06050000
R84AWCAT EQU   X'10'     AWAIT IS FOR CATALOG LOCATE                    06060000
R84AWGAV EQU   X'08'     AWAIT IS FOR GENERALIZED SUBTASK TO BECOME     06070000
*                        AVAILABLE                                      06080000
R84AWMVC EQU   X'04'     AWAIT IS FOR MVS/CI                   @OY16159 06090000
R84AWRCD EQU   X'02'     AWAIT is described by a reason code       @RJA 06091000
*                          (see IATYAWR for the definitions        @RJA 06092000
*                          of the reason codes)                    @RJA 06093000
         SPACE 1                                               @OY16159 06100000
*-------------------------------------------------------------*@OY16159 06110000
*        FCT AWAIT FLAG TWO                                   *@OY16159 06120000
*-------------------------------------------------------------*@OY16159 06130000
R84AWFL2 DS    X         FCT AWAIT FLAG 2                               06140000
R84AWSTD EQU   X'80'     AWAIT IS STANDARD AWAIT                        06150000
R84AWALD EQU   X'40'     AWAIT IS FOR ALOAD OF A MODULE                 06160000
R84AWFDB EQU   X'20'     AWAIT IS FOR FDB I/O                           06170000
R84AWSDM EQU   X'10'     AWAIT IS FOR SDM                               06180000
R84AWENQ EQU   X'08'     AWAIT IS FOR AENQ ON A RESOURCE                06190000
R84AWCNB EQU   X'04'     AWAIT IS FOR CONSOLE BUFFERS                   06200000
R84AWUNK EQU   X'02'     AWAIT IS UNKNOWN                               06210000
         SPACE 1                                               @OY16159 06220000
*-------------------------------------------------------------*@OY16159 06230000
*        FCT AWAIT FLAG THREE                                 *@OY16159 06240000
*-------------------------------------------------------------*@OY16159 06250000
R84AWFL3 DS    X         FCT AWAIT FLAG 3                      @OY16159 06260000
R84AWLCS EQU   1         AWAIT IS FOR LOCATE SCHEDULE          @OY16159 06270000
R84AWCTS EQU   2         AWAIT IS FOR CATALOG SETUP            @OY16159 06280000
         SPACE 1                                               @OY16159 06290000
         DS    XL1       RESERVED FOR DEVELOPMENT              @OY16159 06300000
R84AWUSE DS    F         AWAIT IN USE COUNT;                            06310000
*                        % OF SAMPLES = AWAIT IN USE COUNT / CPU BUSY   06320000
*                        SAMPLE COUNT * 100;                            06330000
*                        % OF FCT = AWAIT IN USE COUNT / FCT ON FCT     06340000
*                        CHAIN COUNT * 100                              06350000
R84AWPA  DS    F         COUNT FOR AWAIT POSTED-ACTIVE;                 06360000
*                        % OF SAMPLES = AWAIT POSTED-ACTIVE COUNT /     06370000
*                        CPU BUSY SAMPLE COUNT * 100;                   06380000
*                        % OF NUC OR AUX MODE = AWAIT POSTED-ACTIVE     06390000
*                        COUNT / IATNUC OR IATAUX POSTED-ACTIVE COUNT;  06400000
*                        * 100;                                         06410000
*                        % OF FCT = AWAIT POSTED-ACTIVE COUNT / FCT     06420000
*                        ON FCT CHAIN COUNT * 100                       06430000
R84AWPNA DS    F         COUNT FOR AWAIT POSTED-NOT ACTIVE;             06440000
*                        % OF SAMPLES = AWAIT POSTED-NOT ACTIVE COUNT / 06450000
*                        CPU BUSY SAMPLE COUNT * 100;                   06460000
*                        % OF FCT = AWAIT POSTED-NOT ACTIVE COUNT /     06470000
*                        FCT ON FCT CHAIN COUNT * 100                   06480000
R84AWNP  DS    F         COUNT FOR AWAIT NOT POSTED;                    06490000
*                        % OF SAMPLES = AWAIT NOT POSTED COUNT /        06500000
*                        CPU BUSY SAMPLE COUNT * 100;                   06510000
*                        % OF FCT = AWAIT NOT POSTED COUNT / FCT        06520000
*                        ON FCT CHAIN COUNT * 100                       06530000
R84AWAVG DS    F         AVERAGE AWAIT DURATION TIME                    06540000
R84AWTOT DS    F         TOTAL AWAIT DURATION TIME                      06550000
R84AWMAX DS    F         MAXIMUM AWAIT DURATION TIME                    06560000
R84AWMOD DS    CL8       MODULE NAME FOR MAXIMUM AWAIT                  06570000
R84AWDIS DS    F         MODULE DISPLACEMENT TO MAXIMUM AWAIT           06580000
         DS    XL8       RESERVED FOR DEVELOPMENT              @OY16159 06590000
*                                                              @OY34777 06595000
*********************************************************************** 06600000
*    FOR STANDARD AWAIT (WHEN R84AWFL2 = X'80')                       * 06610000
*********************************************************************** 06620000
R84STDAW DS    CL8       STANDARD AWAIT NAME                            06630000
         DS    XL12      RESERVED FOR DEVELOPMENT             #0411@MEA 06640000
R84STDSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06650000
*********************************************************************** 06660000
*    FOR ALOAD AWAIT (WHEN R84AWFL2 = X'40')                          * 06670000
*********************************************************************** 06680000
         ORG   R84STDAW                                                 06690000
R84MODNM DS    CL8       MODULE NAME                                    06700000
         DS    XL12      RESERVED FOR DEVELOPMENT             #0411@MEA 06710000
R84MODSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06720000
*********************************************************************** 06730000
*    FOR FDB AWAIT (WHEN R84AWFL2 = X'20')                            * 06740000
*********************************************************************** 06750000
         ORG   R84STDAW                                                 06760000
R84FDBIO DS    CL6        INPUT/OUTPUT FDB;                             06770000
R84FDBRF DS    CL3        MRF OR SRF                                    06780000
         DS    X          UNUSED                                        06790000
R84FDBTY DS    CL3        I/O OR BLANKS                                 06800000
         DS    XL7        RESERVED FOR DEVELOPMENT            #0411@MEA 06810000
R84FDBSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06820000
*********************************************************************** 06830000
*    FOR SDM AWAIT (WHEN R84AWFL2 = X'10')                            * 06840000
*********************************************************************** 06850000
         ORG   R84STDAW                                                 06860000
R84SDMTY DS    CL20       SDM AWAIT TYPE; BUFFERS OR FILE DIRECTORY     06870000
*                         SPACE 1                                       06880000
R84SDMSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06890000
*********************************************************************** 06900000
*    FOR AENQ AWAIT (WHEN R84AWFL2 = X'08')                           * 06910000
*********************************************************************** 06920000
         ORG   R84STDAW                                                 06930000
R84ENQRN DS    CL8        AENQ RESOURCE NAME                            06940000
         DS    XL12       RESERVED FOR DEVELOPMENT            #0411@MEA 06950000
R84ENQSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   06960000
*********************************************************************** 06970000
*    FOR CONSOLE BUFFERS AWAIT (WHEN R84AWFL2 = X'04')                * 06980000
*********************************************************************** 06990000
         ORG   R84STDAW                                                 07000000
R84CNBTY DS    CL8        CONSOLE BUFFERS AWAIT TYPE                    07010000
         DS    XL12       RESERVED FOR DEVELOPMENT            #0411@MEA 07020000
R84CNBSZ EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   07030000
         SPACE 1                                                   @RJA 07030500
*******************************************************************@RJA 07031000
*    For AWAITs when an AWAIT reason code is used to describe      @RJA 07031500
*    the AWAIT (when R84AWFL1 = R84AWRCD).                         @RJA 07032000
*******************************************************************@RJA 07032500
         ORG   R84STDAW                                            @RJA 07033000
R84AWRSN DS    XL2                 AWAIT reason code               @RJA 07033500
R84AWRSV DS    X                   Reserved for development        @RJA 07034000
R84AWDLN DS    X                   AWAIT data length or zero       @RJA 07034500
R84AWDAT DS    CL16                Up to 16 bytes of AWAIT         @RJA 07035000
*                                    related data or zeroes        @RJA 07035100
R84AWCSZ EQU   *-R84AWFL1          Size of the AWAIT entry         @RJA 07035200
         SPACE 1                                                   @RJA 07036000
**********************************************************************  07040000
*    FOR UNKNOWN AWAIT (WHEN R84AWFL2 = X'02')                       *  07050000
**********************************************************************  07060000
         ORG   R84STDAW                                                 07070000
R84AWMSK DS    X          AWAIT MASK                                    07080000
         DS    XL3        UNUSED                              #0286@MEC 07090000
R84AWADR DS    F          AWAIT ADDRESS                                 07100000
         DS    XL12       RESERVED FOR DEVELOPMENT            #0411@MEA 07110000
R84AWSZ1 EQU   *-R84AWFL1 SIZE OF THE FCT AWAIT ENTRY                   07120000
         SPACE 2                                                        07130000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP2                  #0622@MEA 07140000
         MEXIT                                                #0622@MEA 07150000
.SUBTYP2 ANOP                                                           07160000
*********************************************************************** 07170000
*                                                                     * 07180000
*      RELOCATE BLOCK FOR SUBTYPE 2 - FCT SUMMARY AND HIGHLIGHT DATA  * 07190000
*                                                                     * 07200000
*      THERE ARE 3 DATA SECTION:  1) FCT SUMMARY, 2) FCT AWAIT AND    * 07210000
*      HIGHLIGHT, 3) JES3 WAIT ANALYSIS                               * 07220000
*                                                                     * 07230000
*********************************************************************** 07240000
         SPACE 2                                                        07250000
*******************************************************************     07260000
*                                                                 *     07270000
*                  SUBTYPE 2  --  HEADER                       #569@MEC 07280000
*                                                                 *     07290000
*******************************************************************     07300000
SMF84HR2 DSECT                                                 #693@MEC 07310000
R84FCTNM DS    F        NUMBER OF FCT ENTRIES                           07320000
R84FSMLN DS    F        LENGTH OF THE FCT SUMMARY SECTION               07330000
R84FSMOF DS    F        OFFSET TO THE FIRST FCT SUMMARY ENTRY #0615@MEC 07340000
R84FAHOF DS    F        OFFSET OF THE FCT AWAIT AND HIGHLIGHT SECTION   07350000
R84WAITO DS    F        OFFSET OF THE JES3 WAIT ANALYSIS SECTION        07360000
R84S2FLG DS    X'00'    SUBTYPE-2 HEADER FLAG                  #569@MEA 07370000
R84SFCT  EQU   X'80'    FCT SUMMARY AND HIGHLIGHT SEGMENT      #691@MEA 07380000
R84WAIT  EQU   X'40'    WAIT ANALYSIS SEGMENT                  #569@MEA 07390000
         DS    XL3      RESERVED FOR DEVELOPMENT               #569@MEA 07400000
R84FSSZ1 EQU   *-R84FCTNM SIZE OF THE SUBTYPE 2 HEADER                  07410000
*********************************************************************** 07420000
*         SUBTYPE 2  --  FCT SUMMARY SECTION                   #569@MEA 07430000
*                                                              #569@MEA 07440000
*   THE FOLLOWING IS A MAPPING FOR EACH FCT SUMMARY ENTRY             * 07450000
*********************************************************************** 07460000
R84FCTSM DSECT                                                          07470000
R84FSNUM DS    F        FCT SEQUENCE NUMBER                             07480000
R84FSNAM DS    CL8      DSP NAME                                        07490000
R84DEV   DS    CL8      DEVICE                                          07500000
R84FSPRT DS    H        FCT PRIORITY                                    07510000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0286@MEA 07520000
R84FCHN  DS    F        FCT ON FCT CHAIN COUNT;                         07530000
*                       % OF FCT ON FCT CHAIN = FCT ON FCT CHAIN        07540000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             07550000
R84FSNUC DS    F        FCT IN IATNUC MODE COUNT;                       07560000
*                       % OF FCT IN IATNUC MODE = FCT IN IATNUC MODE    07570000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             07580000
R84FSAUX DS    F        FCT IN IATAUX MODE COUNT;                       07590000
*                       % OF FCT IN IATAUX MODE = FCT IN IATAUX MODE    07600000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             07610000
R84FNPA  DS    F        COUNT FOR FCT POSTED-ACTIVE IN IATNUC;          07620000
*                       % OF FCT POSTED-ACTIVE IN IATNUC = FCT POSTED-  07630000
*                       ACTIVE IN IATNUC COUNT / CPU BUSY SAMPLE COUNT  07640000
*                       * 100                                           07650000
R84FAPA  DS    F        COUNT FOR FCT POSTED-ACTIVE IN IATAUX;          07660000
*                       % OF FCT POSTED-ACTIVE IN IATAUX = FCT POSTED-  07670000
*                       ACTIVE IN IATAUX COUNT / CPU BUSY SAMPLE COUNT  07680000
*                       * 100                                           07690000
R84FNPNA DS    F        COUNT FOR FCT POSTED-NOT-ACTIVE IN IATNUC       07700000
*                       % OF FCT POSTED-NOT-ACTIVE IN IATNUC = FCT      07710000
*                       POSTED-NOT-ACTIVE IN IATNUC COUNT / CPU         07720000
*                       BUSY SAMPLE COUNT * 100                         07730000
R84FAPNA DS    F        COUNT FOR FCT POSTED-NOT-ACTIVE IN IATAUX;      07740000
*                       % OF FCT POSTED-NOT-ACTIVE IN IATNUC = FCT      07750000
*                       POSTED-NOT-ACTIVE IN IATAUX COUNT / CPU BUSY    07760000
*                       SAMPLE COUNT * 100                              07770000
R84FNNP  DS    F        COUNT FOR FCT NOT-POSTED IN IATNUC;             07780000
*                       % OF FCT NOT-POSTED IN IATNUC = FCT NOT-POSTED  07790000
*                       IN IATNUC COUNT / CPU BUSY SAMPLE COUNT * 100   07800000
R84FANP  DS    F        COUNT FOR FCT NOT-POSTED IN IATAUX;             07810000
*                       % OF FCT NOT-POSTED IN IATAUX = FCT NOT-POSTED  07820000
*                       IN IATAUX COUNT / CPU BUSY SAMPLE COUNT * 100   07830000
R84FNSOS DS    F        COUNT FOR FCT IN-OS-WAIT IN IATNUC;             07840000
*                       % OF FCT IN-OS-WAIT IN IATNUC = FCT IN-OS-WAIT  07850000
*                       IN IATNUC COUNT / CPU BUSY SAMPLE COUNT * 100   07860000
R84FASOS DS    F        COUNT FOR FCT IN-OS-WAIT IN IATAUX;             07870000
*                       % OF FCT IN-OS-WAIT IN IATAUX = FCT IN-OS-WAIT  07880000
*                       IN IATAUX COUNT  / CPU BUSY SAMPLE COUNT * 100  07890000
*                                                              @OY34777 07895000
R84FESZ1 EQU   *-R84FSNUM SIZE OF THE FCT SUMMARY ENTRY                 07900000
         SPACE 2                                                        07910000
*******************************************************************     07920000
*                                                                 *     07930000
*          SUBTYPE 2  --  FCT AND AWAIT HIGHLIGHT SECTION         *     07940000
*                                                                 *     07950000
*******************************************************************     07960000
SMF84FAH DSECT                                                          07970000
R84FHLNG DS    F        LENGTH OF THE FCT AND AWAIT HIGHLIGHT SECTION   07980000
*******************************************************************     07990000
*    THE 5 MOST ACTIVE FCT S IN IATNUC.                           *     08000000
*******************************************************************     08010000
R84N1MA  DS    5F       1ST MOST ACTIVE FCT IN IATNUC          @OY34777 08020000
R84N2MA  DS    5F       2ND MOST ACTIVE FCT IN IATNUC          @OY34777 08030000
R84N3MA  DS    5F       3RD MOST ACTIVE FCT IN IATNUC          @OY34777 08040000
R84N4MA  DS    5F       4TH MOST ACTIVE FCT IN IATNUC          @OY34777 08050000
R84N5MA  DS    5F       5TH MOST ACTIVE FCT IN IATNUC          @OY34777 08060000
*********************************************************************** 08070000
*    THE 5 MOST ACTIVE FCT S IN IATAUX.                               * 08080000
*********************************************************************** 08090000
R84A1MA  DS    5F       1ST MOST ACTIVE FCT IN IATAUX          @OY34777 08100000
R84A2MA  DS    5F       2ND MOST ACTIVE FCT IN IATAUX          @OY34777 08110000
R84A3MA  DS    5F       3RD MOST ACTIVE FCT IN IATAUX          @OY34777 08120000
R84A4MA  DS    5F       4TH MOST ACTIVE FCT IN IATAUX          @OY34777 08130000
R84A5MA  DS    5F       5TH MOST ACTIVE FCT IN IATAUX          @OY34777 08140000
*********************************************************************** 08150000
*    THE 5 MOST POSTED-NOT ACTIVE FCT S IN IATNUC.                    * 08160000
*********************************************************************** 08170000
R84N1PNA DS    5F       1ST MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08180000
R84N2PNA DS    5F       2ND MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08190000
R84N3PNA DS    5F       3RD MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08200000
R84N4PNA DS    5F       4TH MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08210000
R84N5PNA DS    5F       5TH MOST POSTED-NOT-ACTIVE FCT IN NUC  @OY34777 08220000
*********************************************************************** 08230000
*    THE 5 MOST POSTED-NOT ACTIVE FCT S IN IATAUX.                    * 08240000
*********************************************************************** 08250000
R84A1PNA DS    5F       1ST MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08260000
R84A2PNA DS    5F       2ND MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08270000
R84A3PNA DS    5F       3RD MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08280000
R84A4PNA DS    5F       4TH MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08290000
R84A5PNA DS    5F       5TH MOST POSTED-NOT-ACTIVE FCT IN AUX  @OY34777 08300000
*********************************************************************** 08310000
*    THE 5 MOST IN-OS-WAIT FCT S IN IATNUC                            * 08320000
*********************************************************************** 08330000
R84N1OSW DS    5F       1ST MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08340000
R84N2OSW DS    5F       2ND MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08350000
R84N3OSW DS    5F       3RD MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08360000
R84N4OSW DS    5F       4TH MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08370000
R84N5OSW DS    5F       5TH MOST IN-OS-WAIT FCT IN IATNUC      @OY34777 08380000
*********************************************************************** 08390000
*    THE 5 MOST IN-OS-WAIT FCT S IN IATAUX                            * 08400000
*********************************************************************** 08410000
R84A1OSW DS    5F        1ST MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08420000
R84A2OSW DS    5F        2ND MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08430000
R84A3OSW DS    5F        3RD MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08440000
R84A4OSW DS    5F        4TH MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08450000
R84A5OSW DS    5F        5TH MOST IN-OS-WAIT FCT IN IATAUX     @OY34777 08460000
*********************************************************************** 08470000
*    THE 10 BIGGEST JES3 AWAIT BOTTLENECKS                            * 08480000
*********************************************************************** 08490000
R84AW1BN DS    12F       1ST BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08500000
R84AW2BN DS    12F       2ND BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08510000
R84AW3BN DS    12F       3RD BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08520000
R84AW4BN DS    12F       4TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08530000
R84AW5BN DS    12F       5TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08540000
R84AW6BN DS    12F       6TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08550000
R84AW7BN DS    12F       7TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08560000
R84AW8BN DS    12F       8TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08570000
R84AW9BN DS    12F       9TH BIGGEST JES3 AWAIT BOTTLENECK     @OY34777 08580000
R84AWABN DS    12F       10TH BIGGEST JES3 AWAIT BOTTLENECK    @OY34777 08590000
*********************************************************************** 08600000
*    DMJA FCT SUMMARY SECTION                                         * 08610000
*********************************************************************** 08620000
R84DMMXA DS    F         MAXIMUM ACTIVE DMJA FCTS ALLOWED               08630000
R84DMMN  DS    F         MINIMUM NUMBER OF ACTIVE DMJA FCTS             08640000
R84DMMX  DS    F         MAXIMUM NUMBER OF ACTIVE DMJA FCTS             08650000
R84DMAV  DS    F         AVERAGE NUMBER OF ACTIVE DMJA FCTS             08660000
R84FHSZ1 EQU   *-R84FHLNG SIZE OF THE FCT AWAIT HIGHLIGHT ENTRY         08670000
*********************************************************************** 08680000
*    EACH OF THE 5 MOST ACTIVE, 5 MOST POSTED-NOT-ACTIVE AND 5 MOST   * 08690000
*    IN-OS-WAIT ENTRIES CAN BE MAPPED BY THE FOLLOWING FORMAT.        * 08700000
*                                                             #0479@MRA 08710000
*    NOTE:  R84TPA IS NOT USED FOR IN-OS-WAIT AND POSTED-NOT- #0479@MRA 08720000
*           ACTIVE                                            #0479@MRA 08730000
*********************************************************************** 08740000
R845MOST DSECT                                                          08750000
R84FSQNM DS    F         FCT SEQUENCE NUMBER                            08760000
R84FNAME DS    CL8       DSP NAME                                       08770000
R84TPA   DS    F         TASK COUNT;                          #0479@MRC 08780000
R84FPA   DS    F         FCT COUNT;                           #0479@MRC 08790000
*                        % OF SAMPLES = FCT COUNT /           #0479@MRC 08800000
*                        CPU BUSY SAMPLE * 100;                         08810000
*                        % OF TASK = FCT COUNT /              #0479@MRC 08820000
*                        TASK COUNT * 100;                    #0479@MRC 08830000
*                                                              @OY34777 08835000
R84MOSZ1 EQU   *-R84FSQNM SIZE OF THE "5 MOST ..." ENTRY      #0479@MRC 08840000
*********************************************************************** 08850000
*    EACH OF THE 10 BIGGEST JES3 AWAIT BOTTLENECK ENTRY CAN BE MAPPED * 08860000
*    BY THE FOLLOWING FORMAT.                                         * 08870000
*********************************************************************** 08880000
R84BNECK DSECT                                                          08890000
R84BSEQN DS    F         FCT SEQUENCE NUMBER                            08900000
R84BNAME DS    CL8       DSP NAME                                       08910000
R84BTSK  DS    CL8       TASK NAME                                      08920000
R84BADAT DS    CL8       Up to 8 bytes of AWAIT data               @RJC 08930000
R84BEQNM EQU   R84BADAT,8  Old field name no longer used           @RJA 08931000
R84BRSN  DS    X         REASON FOR AWAITING                            08940000
R84BENQ  EQU   X'80'     AENQ                                           08950000
R84BSDMF EQU   X'40'     SDM - WAITING FOR FILE DIRECTORY               08960000
R84BSDMB EQU   X'20'     SDM - WAITING FOR JSAM BUFFERS                 08970000
R84BCNB  EQU   X'10'     CONSOLE BUFFERS                                08980000
R84BCAT  EQU   X'08'     CATALOG LOCATE                                 08990000
R84BLOCS EQU   X'04'     LOCATE SCHEDULE                       @OY16159 09000000
R84BAWRC EQU   X'02'     AWAIT reason code describes the           @RJA 09003000
*                          AWAIT bottleneck                        @RJA 09006000
R84BARSN DC    XL2'00'   AWAIT reason code                         @RJC 09010000
R84BADLN DC    X'00'     AWAIT data length or zero                 @RJA 09015000
R84BCNNM DS    CL8       Old field name no longer used             @RJC 09020000
R84BTOTD DS    F         TOTAL AWAIT DURATION TIME =          #0615@MEC 09030000
*                        (IN HUNDREDTHS OF SECONDS)           #0615@MEA 09040000
*                        NOT POSTED (TOTAL DURATION) COUNT *  #0615@MEA 09050000
*                        JMF CYCLE TIME.                      #0615@MEA 09060000
R84BMAXD DS    F         MAXIMUM AWAIT DURATION TIME =        #0622@MEC 09070000
*                        (IN HUNDREDTHS OF SECONDS)           #0615@MEA 09080000
*                        MAXIMUM AWAIT DURATION COUNT *       #0615@MEA 09090000
*                        JMF CYCLE TIME.                      #0615@MEA 09100000
*                                                              @OY34777 09105000
R84BNSZ1 EQU   *-R84BSEQN SIZE OF THE AWAIT BOTTLENECK ENTRY            09110000
*******************************************************************     09120000
*                                                                 *     09130000
*          SUBTYPE 2  --  JES3 WAIT ANALYSIS SECTON               *     09140000
*                                                                 *     09150000
*******************************************************************     09160000
SMF84WT  DSECT                                                          09170000
R84WTLNG DS    F        LENGTH OF THE JES3 WAIT ANALYSIS SECTION        09180000
R84WTNUM DS    F        TOTAL NUMBER OF WAIT ANALYSIS ENTRIES           09190000
R84WTOFF DS    F        OFFSET OF THE 1ST ENTRY                         09200000
*                                                             #0497@MED 09210000
R84WTSZ1 EQU   *-R84WTLNG SIZE OF THE JES3 WAIT ANALYSIS SECTION        09220000
**********************************************************************  09230000
*    EACH IATNUC AND IATAUX WAIT ANALYSIS ENTRY CAN BE MAPPED BY THE *  09240000
*    FOLLOWING FORMAT.                                               *  09250000
**********************************************************************  09260000
R84WTNUC DSECT                                                          09270000
R84WTNAM DS    CL8      DSP NAME                                        09280000
R84WTFSN DS    F        FCT SEQUENCE NUMBER                             09290000
R84WTTSK DS    CL8      TASK NAME                                       09300000
R84WTFOS DS    F        COUNT FOR FCT IN OS WAIT;                       09310000
*                       % OF FCT IN OS WAIT = FCT IN OS WAIT / JMF      09320000
*                       SAMPLE COUNT  * 100                             09330000
R84WTFLG DS    X        TYPE OF A WAIT                                  09340000
R84WTPAG EQU   X'80'    PAGE FAULT                                      09350000
R84WTSVC EQU   X'40'    SVC WAIT                                        09360000
R84WTLOD EQU   X'20'    LOAD WAIT                                       09370000
         DS    XL3      RESERVED                                        09380000
*                                                              @OY34777 09385000
*********************************************************************** 09390000
*    THE FOLLOWING FIELDS ARE APPLICABLE ONLY TO PAGE FAULT           * 09400000
*********************************************************************** 09410000
R84PADR  DS    F        ADDRESS OF WHERE THE PAGE FAULT OCCURED         09420000
R84PNAM  DS    CL8      MODULE NAME                                     09430000
R84PMOF  DS    F        OFFSET INTO THE MODULE                          09440000
R84PCNT  DS    F        PAGE FAULT COUNT                                09450000
         DS    3F       RESERVED                                        09460000
R84WTPS1 EQU   *-R84WTNAM SIZE OF IATNUC/AUX JES3 WAIT ANALYSIS ENTRY   09470000
*********************************************************************** 09480000
*    THE FOLLOWING FIELDS ARE APPLICABLE ONLY TO SVC WAIT             * 09490000
*********************************************************************** 09500000
         ORG   R84PADR                                                  09510000
R84SNUM  DS    F        SVC NUMBER                                      09520000
R84SNAM  DS    CL8      SVC NAME                                        09530000
R84SADR  DS    F        ADDRESS OF WHERE THE SVC WAIT OCCURED           09540000
R84SMNAM DS    CL8      MODULE NAME                                     09550000
R84SMOFS DS    F        OFFSET INTO THE MODULE                          09560000
R84SCNT  DS    F        SVC COUNT                                       09570000
R84WTSS1 EQU   *-R84WTNAM SIZE OF IATNUC/AUX JES3 WAIT ANALYSIS ENTRY   09580000
**********************************************************************  09590000
*    THE FOLLOWING FIELDS ARE APPLICABLE ONLY TO LOAD WAIT           *  09600000
**********************************************************************  09610000
         ORG   R84PADR                                                  09620000
R84LMNAM DS    CL8      LOADING MODULE NAME                             09630000
R84LCNT  DS    F        LOAD COUNT                                      09640000
         DS    5F       RESERVED                                        09650000
R84WTLS1 EQU   *-R84WTNAM SIZE OF IATNUC/AUX JES3 WAIT ANALYSIS ENTRY   09660000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP3                            09670000
         MEXIT                                                          09680000
.SUBTYP3 ANOP                                                           09690000
*********************************************************************** 09700000
*                                                                     * 09710000
*      RELOCATE BLOCK FOR SUBTYPE 3 - SPOOL DATA MANAGEMENT SECTION   * 09720000
*                                                                     * 09730000
*      THERE ARE 8 DATA SECTIONS:  1) GENERAL SDM DATA SECTION,       * 09740000
*      2) SPOOL DATA DESCRIBTION SECTION, 3) SPOOL PARTITION DESCRIP- * 09750000
*      TION SECTION, 4) SPOOL SPACE UTILIZATION SNAPSHOT SECTION,     * 09760000
*      5) SINGLE TRACK TABLE SPACE ALLOCATION SNAPSHOT SECTION,       * 09770000
*      6) SPOOL I/O ACTIVITY -- BUFFERS READ AND WRITTEN,     #0508@MEC 09780000
*      7) BUFFERS CHAINING BY SPOOL DATASET SECTION AND 8) MINIMAL/   * 09790000
*      MARGINAL TRACK CONDITION SECTION.                              * 09800000
*                                                                     * 09810000
*********************************************************************** 09820000
*******************************************************************     09830000
*                                                                 *     09840000
*          SUBTYPE 3  --  GENERAL SDM DATA SECTION                *     09850000
*                                                                 *     09860000
*******************************************************************     09870000
SMF84SDM DSECT                  GENERAL SDM DATA SECTION                09880000
R84SDMLN DS    F        LENGTH OF THE SDM SECTION                       09890000
R84BUFSZ DS    F        SPOOL BUFFER SIZE                               09900000
R84NBFPG DS    F        NUMBER OF BUFFERS PER 4K PAGE                   09910000
R84FDENT DS    F        FILE DIRECTORY ENTRIES                          09920000
R84SPDSU DS    F        NUMBER OF SPOOL DATASETS IN USE                 09930000
R84JSAMB DS    F        NUMBER OF JSAM BUFFERS                          09940000
R84JSAMT DS    F        JSAM THRESHOLD FOR JSAM MINBUF CONDITION        09950000
R84PBUFC DS    F        NUMBER OF PROTECTED USAM BUFFERS IN CSA         09960000
R84PBUFA DS    F        NUMBER OF PROTECTED USAM BUFFERS IN AUX         09970000
R84UPBUF DS    F        NUMBER OF UNPROTECTED USAM BUFFERS PER OPEN     09980000
*                       USAM DATASET                                    09990000
R84MAXB  DS    F        MAXIMUM DATA BYTES IN A USAM BUFFERS            10000000
R84DSENT DS    F        TOTAL NUMBER OF SPOOL DATASET DESCRIPTION       10010000
*                       ENTRIES                                         10020000
R84DSOFF DS    F        OFFSET OF THE 1ST SPOOL DATASET DESCRIPTION     10030000
*                       ENTRY                                           10040000
R84PRENT DS    F        TOTAL NUMBER OF SPOOL PARTITION DESCRIPTION     10050000
*                       ENTRIES                                         10060000
R84PROFF DS    F        OFFSET OF THE 1ST SPOOL PARTITION DESCRIPTION   10070000
*                       ENTRY                                           10080000
R84SUENT DS    F        TOTAL NUMBER OF SPOOL SPACE UTILIZATION SNAP-   10090000
*                       SHOT ENTRIES                                    10100000
R84SUOFF DS    F        ADDRESS OF THE 1ST SPOOL SPACE UTILIZATION      10110000
*                       SNAPSHOT ENTRY                                  10120000
R84STENT DS    F        TOTAL NUMBER OF SINGLE TRACK TABLE SPACE        10130000
*                       ALLOCATION SNAPSHOT ENTRIES                     10140000
R84STOFF DS    F        OFFSET OF THE 1ST SINGLE TRACK TABLE SPACE      10150000
*                       ALLOCATION SNAPSHOT ENTRY             #0615@MEC 10160000
R84IOENT DS    F        TOTAL NUMBER OF SPOOL I/O ACTIVITY -- BUFFER    10170000
*                       READ AND WRITTEN -- ENTRIES           #0508@MEC 10180000
R84IOOFF DS    F        OFFSET OF THE 1ST SPOOL I/O ACTIVITY --         10190000
*                       BUFFERS READ AND WRITTEN ENTRY         #569@MEC 10200000
R84BCENT DS    F        TOTAL NUMBER OF BUFFER CHAINING BY SPOOL        10210000
*                       DATASET ENTRIES                                 10220000
R84BCOFF DS    F        OFFSET OF THE 1ST BUFFER CHAINING BY SPOOL      10230000
*                       DATASET ENTRY                                   10240000
**********************************************************************  10250000
*   SDM EXCEPTIONAL CONDITIONS                                       *  10260000
**********************************************************************  10270000
R84JSAMU DS    F        COUNT FOR JSAM UNAVAILABLE BUFFERS;             10280000
*                       % OF JSAM UNAVAILABLE BUFFERS = JSAM UNAVAIL-   10290000
*                       ABLE BUFFERS COUNT/CPU BUSY SAMPLE    #0402@MEC 10300000
*                       COUNT * 100                                     10310000
R84USAMU DS    F        COUNT FOR USAM UNAVAILABLE BUFFERS;             10320000
*                       % OF USAM UNAVAILABLE BUFFERS = USAM UNAVAILA-  10330000
*                       BLE BUFFERS COUNT / CPU BUSY SAMPLE COUNT       10340000
*                       * 100                                           10350000
R84MMENT DS    F        TOTAL NUMBER OF MINIMAL/MARGINAL TRACK          10360000
*                       CONDITION ENTRIES                               10370000
R84MMOFF DS    F        OFFSET OF THE 1ST MINIMAL/MARGINAL TRACK CONDI- 10380000
*                       TION ENTRY                                      10390000
R84AWBUF DS    F        AWAITS OF BUFFERS DURING MONITORING             10400000
R84AWEVR DS    F        AWAITS OF BUFFERS EVER                          10410000
R84SDSZ1 EQU   *-R84SDMLN SIZE OF GENERAL SDM DATA SECTION              10420000
*******************************************************************     10430000
*                                                                 *     10440000
*          SUBTYPE 3  --  SPOOL DATASET DESCRIPTION SECTION       *     10450000
*                                                                 *     10460000
*******************************************************************     10470000
R84SDMDS DSECT                                                          10480000
R84DSDSN DS    H        DATASET NUMBER                                  10490000
R84DSDDN DS    CL8      DDNAME                                          10500000
R84DSPRT DS    CL8      PARTITION NAME                                  10510000
R84DSFLG DS    X        EXTENT STATUS FLAG                              10520000
R84DSUNV EQU   X'80'    EXTENT UNAVAILABLE                              10530000
R84DSDRN EQU   X'40'    EXTENT MOVED TO DRAINING PARTITION              10540000
R84DSHLD EQU   X'20'    EXTENT HELD                                     10550000
R84DSUSE EQU   X'10'    EXTENT IN USE                                   10560000
R84DSDVA DS    CL3      DEVICE ADDRESS                                  10570000
R84DSVLS DS    CL6      VOLSER                                          10580000
R84DSDVT DS    CL7      DEVICE TYPE                                     10590000
         DS    X        UNUSED                                          10600000
R84DSLWC DS    H        LOW CYLINDER                                    10610000
R84DSLWH DS    H        LOW HEAD                                        10620000
R84DSHIC DS    H        HIGH CYLINDER                                   10630000
R84DSHIH DS    H        HIGH HEAD                                       10640000
R84DSRT  DS    H        RECORDS PER TRACKS                              10650000
R84DSRTG DS    H        RECORDS PER TRACK GROUP                         10660000
R84DSBUF DS    F        BUFFER SIZE IN BYTES                            10670000
R84DSDV4 DS    CL4      4-Digit Device Address                     @PFA 10672000
*                                                              @OY34777 10675000
R84DSSZ1 EQU   *-R84DSDSN SIZE OF SPOOL DATASET DESCRIPTION ENTRY       10680000
*******************************************************************     10690000
*                                                                 *     10700000
*          SUBTYPE 3  --  SPOOL PARTITION DESCRIPTION SECTION     *     10710000
*                                                                 *     10720000
*******************************************************************     10730000
**********************************************************************  10740000
*   THE FOLLOWING IS A MAPPING FOR SPOOL PARTITION DESCRIPTION ENTRY *  10750000
**********************************************************************  10760000
R84SDMPR DSECT                                                          10770000
R84PRPRT DS    CL8      PARTITION NAME                                  10780000
R84PRMIN DS    X        MINIMAL SPOOL THRESHOLD %                       10790000
R84PRMRG DS    X        MARGINAL SPOOL THRESHOLD %                      10800000
R84PROVP DS    CL8      OVERFLOW PARTITION NAME                         10810000
R84PRFLG DS    X        SPART ENTRY FLAG FIELD                          10820000
R84PRDEF EQU   X'80'    DEFAULT PARTITION INDICATOR                     10830000
         DS    XL1      RESERVED FOR DEVELOPMENT              #0403@MEA 10840000
*                                                              @OY34777 10845000
R84PRSZ1 EQU   *-R84PRPRT SIZE OF SPOOL PARTITION DESCRIPTION ENTRY     10850000
*******************************************************************     10860000
*                                                                 *     10870000
*         SUBTYPE 3  --  SPOOL SPACE UTILIZATION SNAPSHOT SECTION *     10880000
*                                                                 *     10890000
*******************************************************************     10900000
**********************************************************************  10910000
*   THE FOLLOWING IS A MAPPING FOR SPOOL SPACE UTILIZATION SNAPSHOT  *  10920000
*   ENTRY.                                                           *  10930000
**********************************************************************  10940000
R84SDMSU DSECT                                                          10950000
R84SUPRT DS    CL8      PARTITION NAME                                  10960000
R84SUDDN DS    CL8      DDNAME                                          10970000
R84SUDEF DS    F        TRACK GROUPS DEFINED                            10980000
R84SUALO DS    F        TRACK GROUPS ALLOCATED;                         10990000
*                       % OF TRACK GROUPS ALLOCATED = TRACK GROUPS      11000000
*                       ALLOCATED / TRACK GROUPS DEFINED * 100          11010000
*                                                              @OY34777 11015000
R84SUSZ1 EQU   *-R84SUPRT SIZE OF SPOOL SPACE UTILIZATION SNAPSHOT      11020000
*******************************************************************     11030000
*                                                                 *     11040000
*  SUBTYPE 3  --  SINGLE TRACK TABLE SPACE UTILIZATION SECTION#0402@MEC 11050000
*                                                                 *     11060000
*******************************************************************     11070000
**********************************************************************  11080000
* THE FOLLOWING IS A MAPPING FOR SINGLE TRACK TABLE SPACE UTILIZATION*  11090000
* ENTRY.                                                             *  11100000
**********************************************************************  11110000
R84SDMST DSECT                                                          11120000
R84STDSN DS    H        DATASET NUMBER                                  11130000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 11140000
R84STDDN DS    CL8      DDNAME                                          11150000
R84STLWC DS    H        LOW CYLINDER                                    11160000
R84STLWH DS    H        LOW HEAD                                        11170000
R84STHIC DS    H        HIGH CYLINDER                                   11180000
R84STHIH DS    H        HIGH HEAD                                       11190000
R84STDEF DS    F        RECORDS DEFINED                                 11200000
R84STALO DS    F        RECORDS ALLOCATED;                              11210000
*                       % OF RECORDS ALLOCATED = RECORDS ALLOCATED /    11220000
*                       RECORDS DEFINED * 100                           11230000
R84STFLG DS    X        SINGLE TRACK TABLE FLAG                         11240000
R84STEXP EQU   X'80'    EXPANSION INDICATOR FOR ANY OR ALL SUBSEQUENT   11250000
*                       STT ENTRIES THAT MATCHES DATASET NUMBER         11260000
         DS    XL3      RESERVED FOR DEVELOPMENT              #0615@MEC 11270000
*                                                              @OY34777 11275000
R84STSZ1 EQU   *-R84STDSN SIZE OF SINGLE TRACK SPACE UTILIZATION        11280000
*******************************************************************     11290000
*                                                                 *     11300000
*          SUBTYPE 3  --  SPOOL I/O ACTIVITY SECTION              *     11310000
*                                                                 *     11320000
* NOTE: TO CALCULATE BUFFERS READ AND WRITTEN PER SECOND, USE #0508@MEA 11330000
*       THE FOLLOWING FORMULA:                                #0508@MEA 11340000
*             NUMBER OF BUFFERS READ/WRITTEN PER SECOND = I/O #0508@MEA 11350000
*             COUNT / JMF REPORT INTERVAL LENGTH IN SECONDS   #0508@MEA 11360000
*******************************************************************     11370000
**********************************************************************  11380000
*   THE FOLLOWING IS A MAPPING FOR SPOOL I/O ACTIVITY ENTRY          *  11390000
**********************************************************************  11400000
R84SDMIO DSECT                                                          11410000
R84IOVLS DS    CL6      VOLSER                                          11420000
R84IODDN DS    CL8      DDNAME                                          11430000
         DS    XL2      UNUSED                                          11440000
R84IOTOT DS    F        TOTAL I/O COUNTS                                11450000
R84IOLOC DS    F        I/O COUNTS FOR LOW NUMBER CYLINDERS             11460000
R84IO2CY DS    F        I/O COUNTS FOR 2 CYLINDERS                      11470000
R84IO3CY DS    F        I/O COUNTS FOR 3 CYLINDERS                      11480000
R84IO4CY DS    F        I/O COUNTS FOR 4 CYLINDERS                      11490000
R84IO5CY DS    F        I/O COUNTS FOR 5 CYLINDERS                      11500000
R84IO6CY DS    F        I/O COUNTS FOR 6 CYLINDERS                      11510000
R84IO7CY DS    F        I/O COUNTS FOR 7 CYLINDERS                      11520000
R84IO8CY DS    F        I/O COUNTS FOR 8 CYLINDERS                      11530000
R84IO9CY DS    F        I/O COUNTS FOR 9 CYLINDERS                      11540000
R84IOHIC DS    F        I/O COUNTS FOR HIGH NUMBER CYLINDERS            11550000
*                                                              @OY34777 11555000
R84IOSZ1 EQU   *-R84IOVLS SIZE OF SPOOL I/O ACTIVITY ENTRY              11560000
*******************************************************************     11570000
*                                                                 *     11580000
*          SUBTYPE 3  --  BUFFERS CHAINING BY SPOOL DATASET       *     11590000
*                                                                 *     11600000
*******************************************************************     11610000
**********************************************************************  11620000
*   THE FOLLOWING IS A MAPPING FOR BUFFERS CHAINING BY SPOOL DATASET *  11630000
*   ENTRY.                                                           *  11640000
**********************************************************************  11650000
R84SDMBC DSECT                                                          11660000
R84BCDSN DS    H        DATASET NUMBER                                  11670000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 11680000
R84BCTOT DS    F        TOTAL I/O BUFFER COUNT                #0403@MEC 11690000
*                                                             #0403@MED 11700000
R84BC1B  DS    F        COUNT FOR 1 CHAINED BUFFER;                     11710000
*                       % OF 1 CHAINED BUFFER = 1 CHAINED BUFFER COUNT  11720000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11730000
R84BC2B  DS    F        COUNT FOR 2 CHAINED BUFFERS;                    11740000
*                       % OF 2 CHAINED BUFFER = 2 CHAINED BUFFER COUNT  11750000
*                       / TOTAL I/O BUFFER COUNT * 100        #0615@MEC 11760000
R84BC3B  DS    F        COUNT FOR 3 CHAINED BUFFERS;                    11770000
*                       % OF 3 CHAINED BUFFER = 3 CHAINED BUFFER COUNT  11780000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11790000
R84BC4B  DS    F        COUNT FOR 4 CHAINED BUFFERS;                    11800000
*                       % OF 4 CHAINED BUFFER = 4 CHAINED BUFFER COUNT  11810000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11820000
R84BC5B  DS    F        COUNT FOR 5 CHAINED BUFFERS;                    11830000
*                       % OF 5 CHAINED BUFFER = 5 CHAINED BUFFER COUNT  11840000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11850000
R84BC6B  DS    F        COUNT FOR 6 CHAINED BUFFERS;                    11860000
*                       % OF 6 CHAINED BUFFER = 6 CHAINED BUFFER COUNT  11870000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11880000
R84BC7B  DS    F        COUNT FOR 7 CHAINED BUFFERS;                    11890000
*                       % OF 7 CHAINED BUFFER = 7 CHAINED BUFFER COUNT  11900000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11910000
R84BC8B  DS    F        COUNT FOR 8 CHAINED BUFFERS;                    11920000
*                       % OF 8 CHAINED BUFFER = 8 CHAINED BUFFER COUNT  11930000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11940000
R84BC9B  DS    F        COUNT FOR 9 CHAINED BUFFERS;                    11950000
*                       % OF 9 CHAINED BUFFER = 9 CHAINED BUFFER COUNT  11960000
*                       / TOTAL I/O BUFFER COUNT * 100        #0403@MEC 11970000
R84BC10B DS    F        COUNT FOR 10 CHAINED BUFFERS;                   11980000
*                       % OF 10 CHAINED BUFFER = 10 CHAINED   #0403@MEC 11990000
*                       BUFFER COUNT / TOTAL I/O BUFFER COUNT #0403@MEC 12000000
*                       * 100                                           12010000
R84BC11B DS    F        COUNT FOR 11 OR MORE CHAINED BUFFERS;           12020000
*                       % OF 11 OR MORE CHAINED BUFFERS = 11 OR MORE    12030000
*                       BUFFER COUNT / TOTAL I/O BUFFER COUNT #0403@MEC 12040000
*                       * 100                                           12050000
*                                                              @OY34777 12055000
R84BCSZ1 EQU   *-R84BCDSN SIZE OF BUFFERS BY SPOOL DATASET ENTRY        12060000
*******************************************************************     12070000
*                                                                 *     12080000
*          SUBTYPE 3  --  MINIMAL/MARGINAL TRACK CONDITION        *     12090000
*                                                                 *     12100000
*******************************************************************     12110000
**********************************************************************  12120000
*   THE FOLLOWING IS A MAPPING FOR MINIMAL/MARGINAL TRACK CONDITION  *  12130000
*   ENTRY                                                            *  12140000
**********************************************************************  12150000
R84SDMMM DSECT                                                          12160000
R84MMPRT DS    CL8      PARTITION NAME                                  12170000
R84MMMIN DS    F        COUNT OF SAMPLES PARTITION IN MINIMAL TRACK     12180000
*                       CONDITION;                                      12190000
*                       % MINIMAL = COUNT OF SAMPLES IN MINIMAL TRACK   12200000
*                       CONDITION / CPU BUSY SAMPLE COUNT * 100         12210000
R84MMMRG DS    F        COUNT OF SAMPLES PARTITION IN MARGINAL TRACK    12220000
*                       CONDITION;                                      12230000
*                       % MARGINAL = COUNT OF SAMPLES IN MARGINAL       12240000
*                       TRACK CONDITION / CPU BUSY SAMPLE COUNT * 100   12250000
*                                                              @OY34777 12255000
R84MMSZ1 EQU   *-R84MMPRT SIZE OF MIN/MARG. TRACK CONDITION ENTRY       12260000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP4                            12270000
         MEXIT                                                          12280000
.SUBTYP4 ANOP                                                           12290000
***************************************************************    @MPC 12300000
*                                                             *    @MPC 12310000
*   RELOCATE BLOCK FOR SUBTYPE 4 - RESQUEUE CELL POOL         *    @MPC 12320000
*   STATISTICS, JCT ACCESS METHOD STATISTICS AND CONTROL      *    @MPC 12330000
*   BLOCK UTILIZATION.                                        *    @MPA 12340000
*                                                             *    @MPC 12350000
*    THERE ARE 3 DATA SECTIONS:                               *    @MPC 12360000
*                                                             *    @MPA 12370000
*    1) RESQUEUE CELL POOL STATISTICS                         *    @MPC 12380000
*    2) JCT ACCESS METHOD STATISTICS                          *    @MPC 12390000
*    3) CONTROL BLOCK UTILIZATION.                            *    @MPA 12400000
*                                                             *    @MPA 12410000
***************************************************************    @MPC 12420000
         SPACE 2                                                        12430000
**************************************************************#0402@MEC 12440000
*                                                            *#0402@MEC 12450000
*    SUBTYPE 4  --  RESQUEUE CELL POOL STATISTICS SECTION    *#0402@MEC 12460000
*                                                            *#0402@MEC 12470000
**************************************************************#0402@MEC 12480000
SMF84RSQ DSECT                                                          12490000
R84JCOFF DS    F        OFFSET TO JCT ACCESS METHOD SECTION        @MPC 12500000
R84CBOFF DS    F        OFFSET TO JES3 CONTROL BLOCK UTILIZATION   @MPA 12510000
R84CIEXT DS    H        TOTAL NUMBER OF CI SECONDARY EXTENTS IN POOL    12520000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 12530000
R84CICEL DS    F        TOTAL NUMBER OF CI RESQUEUES IN POOL            12540000
R84CIUSE DS    F        TOTAL NUMBER OF CI RESQUEUES USED IN POOL       12550000
R84CIRQP DS    F        NUMBER OF CI RESQUEUES IN PRIMARY EXTENT        12560000
R84NCISX DS    F        NUMBER OF CI RSQ 2NDARY EXTENT ENTRIES          12570000
R84CISXO DS    F        OFFSET TO 1ST CI RSQ 2NDARY EXTENT ENTRY        12580000
R84MNEXT DS    H        TOTAL NUMBER OF MAIN SECONDARY EXTENTS IN POOL  12590000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 12600000
R84MNCEL DS    F        TOTAL NUMBER OF MAIN RESQUEUES IN POOL          12610000
R84MNUSE DS    F        TOTAL NUMBER OF MAIN RESQUEUE USED IN POOL      12620000
R84MNRQP DS    F        TOTAL NUMBER OF MAIN RESQUEUES IN PRIMARY       12630000
*                       EXTENT                                          12640000
R84NMNSX DS    F        NUMBER OF MAIN RSQ 2NDARY EXTENT ENTRIES        12650000
R84MNSXO DS    F        OFFSET TO 1ST MAIN RSQ 2NDARY EXTENT ENTRY      12660000
R84OSEXT DS    H        TOTAL NUMBER OF OUTSERV SECONDARY EXTENTS IN    12670000
*                       POOL                                            12680000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 12690000
R84OSCEL DS    F        TOTAL NUMBER OF OUTSERV RESQUEUES IN POOL       12700000
R84OSUSE DS    F        TOTAL NUMBER OF OUTSERV RESQUEUES USED IN POOL  12710000
R84OSRQP DS    F        NUMBER OF OUTSERV RESQUEUES IN PRIMARY EXTENT   12720000
R84NOSSX DS    F        NUMBER OF OS RSQ 2NDARY EXTENT ENTRIES          12730000
R84OSSXO DS    F        OFFSET TO 1ST OS RSQ 2NDARY EXTENT ENTRY        12740000
R84CMEXT DS    H        TOTAL NUMBER OF COMMON SECONDARY EXTENTS IN     12750000
*                       POOL                                            12760000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 12770000
R84CMCEL DS    F        TOTAL NUMBER OF COMMON RESQUEUES IN POOL        12780000
R84CMUSE DS    F        TOTAL NUMBER OF COMMON RESQUEUES USED IN POOL   12790000
R84CMRQP DS    F        TOTAL NUMBER OF COMMON RESQUEUES IN PRIMARY     12800000
*                       EXTENT                                          12810000
R84NCMSX DS    F        NUMBER OF COMMON RSQ 2NDARY EXTENT ENTRIES      12820000
R84CMSXO DS    F        OFFSET TO 1ST COMMON RSQ 2NDARY EXTENT ENTRY    12830000
R84RQSZ1 EQU   *-R84JCOFF SIZE OF RESQ CELL POOL STAT. SECTION     @MPC 12840000
************************************************************** @OY20511 12842000
*   EACH RESQUEUE SECONDARY EXTENT WILL BE MAPPED BY THIS      @OY20511 12844000
*   FIELD                                                      @OY20511 12846000
************************************************************** @OY20511 12848000
R84RQEXT DSECT                                                          12850000
R84RQSXT DS    F        NUMBER OF CI, MAIN, OUTSERV, OR COMMON @OY20511 12860000
*                       RESQUEUES FOR SECONDARY EXTENT         @OY20511 12870000
*                                                              @OY20511 12880000
R84RQXSZ EQU   *-R84RQEXT SIZE OF RESQ 2NDARY EXTENT ENTRY     @OY20511 12890000
         EJECT ,                                                   @MPA 12900000
***************************************************************    @MPA 12910000
*                                                             *    @MPA 12920000
*    SUBTYPE 4  --  JCT ACCESS METHOD STATISTICS SECTION      *    @MPA 12930000
*                                                             *    @MPA 12940000
***************************************************************    @MPA 12950000
SMF84JCT DSECT ,                                                   @MPA 12960000
*                                                                  @MPA 12970000
***************************************************************    @MPA 12980000
*        JCT DATA SET INFORMATION                             *    @MPA 12990000
***************************************************************    @MPA 13000000
R84SZJCT DS    F        SIZE OF A JCT (IN BYTES)                   @MPA 13010000
R84REDIO DS    F        NUMBER OF JCT READ I/O'S                   @MPA 13020000
R84WRTIO DS    F        NUMBER OF JCT WRITE I/O'S                  @MPA 13030000
R84JBADD DS    F        NUMBER OF JOBS ADDED TO JOB QUEUE          @MPA 13040000
R84JBDEL DS    F        NUMBER OF JOBS DELETED FROM JOB QUEUE      @MPA 13050000
*                                                                  @MPA 13060000
***************************************************************    @MPA 13070000
*        JCT DATA SPACE INFORMATION                           *    @MPA 13080000
***************************************************************    @MPA 13090000
R84DSPFL DS    X        JCT DATA SPACE FLAG ONE                    @MPA 13100000
R84DSDIS EQU   X'80'    THE JCT DATA SPACE WAS DISABLED DURING     @MPA 13110000
*                       SOME PORTION OF THE INTERVAL.  THE         @MPA 13120000
*                       REMAINDER OF THE JCT DATA SPACE            @MPA 13130000
*                       INFORMATION IS ZERO                        @MPA 13140000
*                                                                  @MPA 13150000
R84JRSVD DS    XL3      RESERVED FOR DEVELOPMENT                   @MPA 13160000
*                                                                  @MPA 13170000
R84DSPSZ DS    F        MAXIMUM JCT DATA SPACE SIZE (IN            @MPA 13180000
*                       HUNDRETHS OF A MEGABYTE)                   @MPA 13190000
*                                                                  @MPA 13200000
*-------------------------------------------------------------*    @MPA 13210000
*        JCT DATA SPACE PAGE FAULT INFORMATION                *    @MPA 13220000
*-------------------------------------------------------------*    @MPA 13230000
R84RDINS DC    F'0'     NUMBER OF JCT READ REQUESTS WHERE THE      @MPA 13240000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13250000
*                       WERE IN REAL STORAGE                       @MPA 13260000
*                                                                  @MPA 13270000
R84PRINS DC    F'0'     PERCENT OF JCT READ REQUESTS WHERE THE     @MPA 13280000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13290000
*                       WERE IN REAL STORAGE (IN HUNDRETHS OF      @MPA 13300000
*                       A PERCENT)                                 @MPA 13310000
*                                                                  @MPA 13320000
R84RDNIS DC    F'0'     NUMBER OF JCT READ REQUESTS WHERE THE      @MPA 13330000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13340000
*                       WERE ---NOT--- IN REAL STORAGE             @MPA 13350000
*                                                                  @MPA 13360000
R84PRNIS DC    F'0'     PERCENT OF JCT READ REQUESTS WHERE THE     @MPA 13370000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13380000
*                       WERE ---NOT--- IN REAL STORAGE (IN         @MPA 13390000
*                       HUNDRETHS OF A PERCENT)                    @MPA 13400000
*                                                                  @MPA 13410000
R84WTINS DC    F'0'     NUMBER OF JCT WRITE REQUESTS WHERE THE     @MPA 13420000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13430000
*                       WERE IN REAL STORAGE                       @MPA 13440000
*                                                                  @MPA 13450000
R84PWINS DC    F'0'     PERCENT OF JCT WRITE REQUESTS WHERE THE    @MPA 13460000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13470000
*                       WERE IN REAL STORAGE (IN HUNDRETHS OF      @MPA 13480000
*                       A PERCENT)                                 @MPA 13490000
*                                                                  @MPA 13500000
R84WTNIS DC    F'0'     NUMBER OF JCT WRITE REQUESTS WHERE THE     @MPA 13510000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13520000
*                       WERE ---NOT--- IN REAL STORAGE             @MPA 13530000
*                                                                  @MPA 13540000
R84PWNIS DC    F'0'     PERCENT OF JCT WRITE REQUESTS WHERE THE    @MPA 13550000
*                       CORRESPONDING JCT DATA SPACE PAGE(S)       @MPA 13560000
*                       WERE ---NOT--- IN REAL STORAGE (IN         @MPA 13570000
*                       HUNDRETHS OF A PERCENT)                    @MPA 13580000
*                                                                  @MPA 13590000
*-------------------------------------------------------------*    @MPA 13600000
*        JCT DATA SPACE PAGE USAGE INFORMATION                *    @MPA 13610000
*-------------------------------------------------------------*    @MPA 13620000
R84DUSMN DC    F'0'     MINIMUM NUMBER OF JCT DATA SPACE PAGES     @MPA 13630000
*                       IN USE                                     @MPA 13640000
R84DUSAV DC    F'0'     AVERAGE NUMBER OF JCT DATA SPACE PAGES     @MPA 13650000
*                       IN USE                                     @MPA 13660000
R84DUSMX DC    F'0'     MAXIMUM NUMBER OF JCT DATA SPACE PAGES     @MPA 13670000
*                       IN USE                                     @MPA 13680000
*                                                                  @MPA 13690000
*-------------------------------------------------------------*    @MPA 13700000
*        JCT DATA SPACE PAGE UTILIZATION.  THESE VALUES SHOW  *    @MPA 13710000
*        THE PERCENTAGE OF THE TOTAL JCT DATA SPACE PAGES     *    @MPA 13720000
*        THAT CONTAIN ALLOCATED JCTS.                         *    @MPA 13730000
*-------------------------------------------------------------*    @MPA 13740000
R84DUTMN DC    F'0'     MINIMUM JCT DATA SPACE PAGE UTILIZATION    @MPA 13750000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 13760000
R84DUTAV DC    F'0'     AVERAGE JCT DATA SPACE PAGE UTILIZATION    @MPA 13770000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 13780000
R84DUTMX DC    F'0'     MAXIMUM JCT DATA SPACE PAGE UTILIZATION    @MPA 13790000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 13800000
*                                                                  @MPA 13810000
*-------------------------------------------------------------*    @MPA 13820000
*        JCT DATA SPACE PAGE RELEASE INFORMATION              *    @MPA 13830000
*-------------------------------------------------------------*    @MPA 13840000
R84PGSRL DC    F'0'     NUMBER OF JCT DATA SPACE PAGES RELEASED    @MPA 13850000
*                                                                  @MPA 13860000
*                                                                  @MPA 13870000
***************************************************************    @MPA 13880000
*        JQE INFORMATION                                      *    @MPA 13890000
***************************************************************    @MPA 13900000
*                                                                  @MPA 13910000
*-------------------------------------------------------------*    @MPA 13920000
*        JQE STORAGE REQUIREMENTS                             *    @MPA 13930000
*-------------------------------------------------------------*    @MPA 13940000
R84JQ0SZ DC    F'0'     JQE0 TABLE SIZE (IN HUNDRETHS OF A         @MPA 13950000
*                       KILOBYTE)                                  @MPA 13960000
R84JQ1SZ DC    F'0'     JQE1 TABLE SIZE (IN HUNDRETHS OF A         @MPA 13970000
*                       KILOBYTE)                                  @MPA 13980000
R84JQ2SZ DC    F'0'     JQE2 TABLE SIZE (IN HUNDRETHS OF A         @MPA 13990000
*                       KILOBYTE)                                  @MPA 14000000
R84JQ3SZ DC    F'0'     JQE3 TABLE SIZE (IN HUNDRETHS OF A         @MPA 14010000
*                       KILOBYTE)                                  @MPA 14020000
R84JQ4SZ DC    F'0'     JQE4 TABLE SIZE (IN HUNDRETHS OF A         @MPA 14030000
*                       KILOBYTE)                                  @MPA 14040000
*                                                                  @MPA 14050000
*-------------------------------------------------------------*    @MPA 14060000
*        JQE4 STORAGE USAGE INFORMATION                       *    @MPA 14070000
*-------------------------------------------------------------*    @MPA 14080000
R84JUSMN DC    F'0'     MINIMUM NUMBER OF JQE4'S IN USE            @MPA 14090000
R84JUSAV DC    F'0'     AVERAGE NUMBER OF JQE4'S IN USE            @MPA 14100000
R84JUSMX DC    F'0'     MAXIMUM NUMBER OF JQE4'S IN USE            @MPA 14110000
*                                                                  @MPA 14120000
*-------------------------------------------------------------*    @MPA 14130000
*        JQE4 STORAGE UTILIZATION.  THESE VALUES SHOW THE     *    @MPA 14140000
*        PERCENTAGE OF THE TOTAL JQE4 PAGES THAT CONTAIN      *    @MPA 14150000
*        ALLOCATED JQE4'S.                                    *    @MPA 14160000
*-------------------------------------------------------------*    @MPA 14170000
R84JUTMN DC    F'0'     MINIMUM JQE4 STORAGE UTILIZATION           @MPA 14180000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 14190000
R84JUTAV DC    F'0'     AVERAGE JQE4 STORAGE UTILIZATION           @MPA 14200000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 14210000
R84JUTMX DC    F'0'     MAXIMUM JQE4 STORAGE UTILIZATION           @MPA 14220000
*                       (IN HUNDRETHS OF A PERCENT)                @MPA 14230000
*                                                                  @MPA 14240000
*                                                                  @MPA 14250000
R84JCTSZ EQU   *-SMF84JCT  SIZE OF JCT ACCESS METHOD STATISTICS    @MPA 14260000
*                        SECTION                                   @MPA 14270000
         EJECT ,                                                   @MPA 14280000
*******************************************************************@MPM 14290000
*                                                                 *     14300000
*          SUBTYPE 4  --  JES3 CONTROL BLOCK UTILIZATION SECTION  *     14310000
*                                                                 *     14320000
*******************************************************************     14330000
R84J3CB  DSECT                                                          14340000
*********************************************************************   14350000
*                 FCT ENTRY USAGE                                   *   14360000
*********************************************************************   14370000
R84FCTPR DS    F        TOTAL NUMBER OF PREALLOCATED FCTS               14380000
R84FCTPM DS    F        TOTAL NUMBER OF PERMANENT FCTS                  14390000
R84FCTMN DS    F        MINIMUM NUMBER OF FCT ENTRIES USED              14400000
R84FCTMX DS    F        MAXIMUM NUMBER OF FCT ENTRIES USED              14410000
R84FCTAV DS    F        AVERAGE NUMBER OF FCT ENTRIES USED              14420000
*********************************************************************   14430000
*                        CONSOLE BUFFER USAGE                       *   14440000
*********************************************************************   14450000
R84PCNBF DS    F        TOTAL NUMBER OF PREALLOCATED CONSOLE BUFFERS    14460000
R84PCBPT DS    F        TOTAL NUMBER OF PREALLOCATED CONSOLE BUFFER     14470000
*                       POINTERS                                        14480000
R84PDDBL DS    F        TOTAL NUMBER OF PREALLOCATED DOM DATA BLOCKS    14490000
R84MNCBU DS    F        MINIMUM NUMBER OF CONSOLE BUFFERS USED          14500000
R84MNBPU DS    F        MINIMUM NUMBER OF CONS. BUF. PTRS USED          14510000
R84MNDBU DS    F        MINIMUN NUMBER OF DOM DATA BLOCKS USED          14520000
R84MXCBU DS    F        MAXIMUM NUMBER OF CONSOLE BUFFERS USED          14530000
R84MXBPU DS    F        MAXIMUM NUMBER OF CONS. BUF. PTRS USED          14540000
R84MXDBU DS    F        MAXIMUM NUMBER OF DOM DATA BLOCKS USED          14550000
R84AVCBU DS    F        AVERAGE NUMBER OF CONSOLE BUFFERS USED          14560000
R84AVBPU DS    F        AVERAGE CONSOLSE BUFFER POINTERS USED #0451@MEC 14570000
R84AVDBU DS    F        AVERAGE NUMBER OF DOM DATA BLOCKS USED          14580000
R84SZCPE DS    F        SIZE OF CONSOLE BUFFER PRIMARY EXTENT           14590000
R84SCBSE DS    F        SIZE OF CONSOLE BUFFER SECONDARY EXTENT         14600000
R84CBSEL DS    H        SIZE OF CONS BUFF SECONDARY EXT LIMIT #0410@MEC 14610000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0410@MEA 14620000
R84TNRCB DS    F        TOTAL NUMBER OF RESERVED CONSOLE BUFFERS        14630000
R84CBSEU DS    H        NUMBER OF CONSOLE BUFFER SECONDARY EXTENTS      14640000
*                       IN USE                                          14650000
R84BPSEU DS    H        NUMBER OF BUFFER POINTER SECONDARY EXTENTS      14660000
*                       IN USE                                          14670000
R84DBSEU DS    H        NUMBER OF DOM DATA BLOCK SECONDARY EXTENTS      14680000
*                       IN USE                                          14690000
R84SEMAX DS    H        MAXIMUM NUMBER OF SECONDARY EXTENTS EVER USED   14700000
R84RBMAX DS    F        MAXIMUM NUMBER OF RESERVED BUFFERS EVER USED    14710000
R84SCBEE DS    F        COUNT FOR SECONDARY CONSOLE           #0451@MEC 14720000
*                       BUFFER EXTENTS EXCEEDED;              #0451@MEC 14730000
*                       % OF SECONDARY CONSOLE BUFFER EXTENTS EXCEEDED  14740000
*                       = SECONDARY CONSOLE BUFFER EXTENTS    #0451@MEC 14750000
*                       * 100 / JMF SAMPLE COUNT              #0503@MEC 14760000
R84SCBPE DS    F        COUNT FOR SECONDARY CONSOLE           #0451@MEC 14770000
*                       BUFFER POINTER EXTENTS EXCEEDED;      #0451@MEC 14780000
*                       % OF SECONDARY CONSOLE BUFFER POINTER EXTENTS   14790000
*                       EXCEEDED =  SECONDARY CONSOLE BUFFER POINTER    14800000
*                       EXTENTS * 100 / JMF SAMPLE COUNT      #0503@MEC 14810000
R84SAQPE DS    F        COUNT FOR SECONDARY ACTION            #0451@MEC 14820000
*                       QUEUE POINTER EXTENTS EXCEEDED;       #0451@MEC 14830000
*                       % OF SECONDARY ACTION QUEUE POINTER EXTENTS     14840000
*                       EXCEEDED = SECONDARY ACTION QUEUE POINTER       14850000
*                       EXTENTS * 100 / JMF SAMPLE COUNT      #0503@MEC 14860000
*********************************************************************   14870000
*                           JSAM BUFFER USAGE                       *   14880000
*********************************************************************   14890000
R84TOTJB DS    H        TOTAL DEFINED JSAM BUFFERS                      14900000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 14910000
R84MNJBU DS    F        MINIMUM JSAM BUFFERS USED                       14920000
R84MXJBU DS    F        MAXIMUM JSAM BUFFERS USED                       14930000
R84AVJBU DS    F        AVERAGE JSAM BUFFERS USED                       14940000
*                                                              @OY34777 14945000
**********************************************************************  14950000
*                     USAM (PROTECTED) BUFFER USAGE                  *  14960000
**********************************************************************  14970000
R84TOTUB DS    H        TOTAL DEFINED USAM BUFFERS                      14980000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 14990000
R84MNUBU DS    F        MINIMUM USAM BUFFERS USED                       15000000
R84MXUBU DS    F        MAXIMUM USAM BUFFERS USED                       15010000
R84AVUBU DS    F        AVERAGE USAM BUFFERS USED                       15020000
*********************************************************************   15030000
*                        STAGING AREA USAGE                         *   15040000
*********************************************************************   15050000
R84SSAPE DS    H        SIZE OF STAGING AREA PRIMARY EXTENT             15060000
*                       IN 'K' BYTES                          #0451@MEA 15070000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 15080000
R84TNPSA DS    F        TOTAL NUMBER OF PRIMARY STAGING AREAS           15090000
R84SSASE DS    H        SIZE OF STAGING AREA SECONDARY EXTENT           15100000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0403@MEA 15110000
R84TNSSA DS    F        TOTAL NUMBER OF SECONDARY STAGING AREAS         15120000
R84SASEL DS    H        STAGING AREA SECONDARY EXTENT LIMIT   #0410@MEC 15130000
R84MNSAL DS    H        MINIMAL STAGING AREA LIMIT            #0410@MEC 15140000
*                       % OF TOTAL STAGING AREAS DEFINED =    #0503@MEA 15150000
*                       R84MNSAL * 100 / R84TNSAD             #0503@MEA 15160000
*                                                            3#0503@MED 15170000
R84SASIZ DS    F        STAGING AREA SIZE                               15180000
R84TNSAD DS    F        TOTAL NUMBER OF STAGING AREAS DEFINED           15190000
R84MCSAI DS    F        MAXIMUM CSA STAGING AREAS FOR INTERVAL @OY34777 15200000
R84MASAI DS    F        MAXIMUM AUXILIARY STAGING AREAS DURING @OY34777 15210000
*                       THIS INTERVAL.                         @OY34777 15220000
R84ASACS DS    F        ACTIVE STAGING AREA COUNT FROM SVT (SVTSACNT)   15230000
R84ACSCS DS    F        ACTIVE CSA STAGING AREA COUNT FROM              15240000
*                       SVT (SVTCSACT)                                  15250000
R84AASCS DS    F        ACTIVE AUXILIARY STAGING AREA COUNT FROM        15260000
*                       SVT (SVTXSACT)                                  15270000
R84MCSAU DS    F        MAXIMUM CSA STAGING AREAS EVER USED             15280000
R84MASAU DS    F        MAXIMUM AUXILIARY STAGING AREAS EVER USED       15290000
R84PUSAE DS    F        COUNT FOR USER MEMORY                 #0451@MEC 15300000
*                       STAGING AREA LIMIT EXCEEDED;          #0451@MEC 15310000
*                       % OF USER MEMORY STAGING AREA LIMIT EXCEEDED    15320000
*                       = USER MEMORY STAGING AREA LIMIT      #0503@MEC 15330000
*                       EXCEEDED COUNT / JMF SAMPLE COUNT *   #0503@MEC 15340000
*                       100                                   #0616@MEC 15350000
R84PMSAE DS    F        COUNT FOR MINIMAL STAGING             #0451@MEC 15360000
*                       AREA LIMIT EXCEEDED;                  #0451@MEA 15370000
*                       % OF MINIMAL STAGING AREA LIMIT EXCEEDED =      15380000
*                       MINIMAL STAGING AREA LIMIT EXCEEDED   #0616@MEC 15390000
*                       COUNT / JMF SAMPLE COUNT * 100        #0503@MEA 15400000
*********************************************************************   15410000
*                       TOTAL ACTIVE STAGING AREAS                  *   15420000
*********************************************************************   15430000
*                                                             #0451@MED 15440000
R84MNTSA DS    F        MINIMUM NUMBER OF ACTIVE STAGING AREAS          15450000
R84MXTSA DS    F        MAXIMUM NUMBER OF ACTIVE STAGING AREAS          15460000
R84AVTSA DS    F        AVERAGE NUMBER OF ACTIVE STAGING AREAS          15470000
*********************************************************************   15480000
*                        CSA ACTIVE STAGING AREAS                   *   15490000
*********************************************************************   15500000
R84MNCSA DS    F         MINIMUM OF CSA ACTIVE STAGING AREAS            15510000
R84MXCSA DS    F         MAXIMUM OF CSA ACTIVE STAGING AREAS            15520000
R84AVCSA DS    F         AVERAGE OF CSA ACTIVE STAGING AREAS            15530000
*********************************************************************   15540000
*                      AUXILIARY ACTIVE STAGING AREAS               *   15550000
*********************************************************************   15560000
R84MNASA DS    F         MINIMUM OF AUXILIARY ACTIVE STAGING AREAS      15570000
R84MXASA DS    F         MAXIMUM OF AUXILIARY ACTIVE STAGING AREAS      15580000
R84AVASA DS    F         AVERAGE OF AUXILIARY ACTIVE STAGING AREAS      15590000
************************************************************** @OY34777 15591000
*                      JSAM BUFFER EXTENT AREAS                @OY34777 15592000
************************************************************** @OY34777 15593000
R84JBPSZ DS    F         SIZE OF PRIMARY EXTENT                @OY34777 15594000
R84JBSSZ DS    F         SIZE OF SECONDARY EXTENT              @OY34777 15595000
R84JBLIM DS    F         NUMBER OF SECONDARY EXTENTS ALLOWED   @OY34777 15596000
R84J3SZ1 EQU   *-R84FCTPR SIZE OF CONTROL BLOCK UTILIZATION SECTION     15600000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP5                            15610000
         MEXIT                                                          15620000
.SUBTYP5 ANOP                                                           15630000
*********************************************************************   15640000
*                                                                   *   15650000
*   RELOCATE BLOCK FOR SUBTYPE 5 - JOB SECTION                 #569@MEC 15660000
*                                                                   *   15670000
*    THERE ARE 3 DATA SECTIONS:  1) JES3 WORK-TO-DO QUEUE,     #569@MEC 15680000
*     2) JOB ANALYSIS AND  3) JES3 FUNCTION SUMMARY SECTION    #569@MEC 15690000
*********************************************************************   15700000
         SPACE 2                                                        15710000
*******************************************************************     15720000
*                                                                 *     15730000
*                  SUBTYPE 5   HEADER                          #569@MEC 15740000
*                                                                 *     15750000
*******************************************************************     15760000
SMF84JOB DSECT                                                          15770000
R84JBLNG DS    F          LENGTH OF THE JOB ANALYSIS SECTION   #569@MEC 15780000
R84JBNUM DS    F          TOTAL NUMBER OF JES3 JOB ANALYSIS ENTRIES     15790000
R84WTDO  DS    F          OFFSET OF WORK-TO-DO ANALYSIS SECTION#569@MEC 15800000
R84JBOF  DS    F          OFFSET TO THE JOB ANALYSIS SECTION   #569@MEC 15810000
R84FSUMO DS    F          OFFSET OF JES3 FUNCTION SUMMARY SECTION       15820000
R84PLOTO DS    F          OFFSET OF PLOT SECTION                        15830000
R84S5FLG DS    X'00'      JOB ENTRY HEADER FLAG                #569@MEA 15840000
R84JAS   EQU   X'80'      JOB ANALYSIS SEGMENT INDICATOR       #569@MEA 15850000
R84FSS   EQU   X'40'      FUNCTION SUMMARY SEGMENT INDICATOR   #569@MEA 15860000
R84PLT1  EQU   X'20'      INITIATOR PLOT SECTION INDICATOR     #569@MEA 15870000
R84PLT2  EQU   X'10'      RQINDEX PLOT SECTION SEGMENT         #569@MEA 15880000
R84PLT3  EQU   X'08'      DEVICE CLASS PLOT SECTION SEGMENT    #569@MEA 15890000
R84PLT4  EQU   X'04'      SETNAME PLOT SECTION SEGMENT         #569@MEA 15900000
R84PLT5  EQU   X'02'      JOB CLASS PLOT SECTION SEGMENT       #569@MEA 15910000
         DS    XL3        RESERVED FOR DEVELOPMENT             #569@MEA 15920000
R84JBSZ1 EQU   *-R84JBLNG SIZE OF THE JOB HEADER               #569@MEC 15930000
         SPACE 2                                               #569@MEA 15940000
***************************************************************#569@MEA 15950000
*                                                              #569@MEA 15960000
*          SUBTYPE 5  --  JES3 WORK-TO-DO SECTION              #569@MEA 15970000
*                                                              #569@MEA 15980000
***************************************************************#569@MEA 15990000
SMF84WTD DSECT                                                 #569@MEA 16000000
R84WKLNG DS    F        LEN OF JSS WORK-TO-DO QUEUE SECTION    #569@MEA 16010000
R84RDYMN DS    F        MIN QUEUE LEN FOR THE JSS-READY QUEUE  #569@MEA 16020000
R84RDYMX DS    F        MAX QUEUE LEN FOR THE JSS-READY QUEUE  #569@MEA 16030000
R84RDYAV DS    F        AV QUEUE LEN FOR THE JSS-READY QUEUE   #569@MEA 16040000
R84CATMN DS    F        MIN QUEUE LEN FOR THE CATLG-WAIT QUEUE @OY16159 16050000
R84CATMX DS    F        MAX QUEUE LEN FOR THE CATLG-WAIT QUEUE @OY16159 16060000
R84CATAV DS    F        AV QUEUE LEN FOR THE CATLG-WAIT QUEUE  @OY16159 16070000
R84RSQMN DS    F        MIN QUEUE LEN FOR THE RQ-WAIT QUEUE    #569@MEA 16080000
R84RSQMX DS    F        MAX QUEUE LEN FOR THE RQ-WAIT QUEUE    #569@MEA 16090000
R84RSQAV DS    F        AV QUEUE LEN FOR THE RQ-WAIT QUEUE     #569@MEA 16100000
R84PLBMN DS    F        MIN QUEUE LEN FOR THE PROCLIB-WAIT QUEU#569@MEA 16110000
R84PLBMX DS    F        MAX QUEUE LEN FOR THE PROCLIB-WAIT QUEU#569@MEA 16120000
R84PLBAV DS    F        AV QUEUE LEN FOR THE PROCLIB-WAIT QUEUE#569@MEA 16130000
R84MCGMN DS    F        MIN QUEUE LEN FOR THE MAIN-WAIT QUEUE  #569@MEA 16140000
R84MCGMX DS    F        MAX QUEUE LEN FOR THE MAIN-WAIT QUEUE  #569@MEA 16150000
R84MCGAV DS    F        AV QUEUE LEN FOR THE MAIN-WAIT QUEUE   #569@MEA 16160000
R84DSPMN DS    F        MIN QUEUE LEN FOR THE DSP-WAIT QUEUE   #569@MEA 16170000
R84DSPMX DS    F        MAX QUEUE LEN FOR THE DSP-WAIT QUEUE   #569@MEA 16180000
R84DSPAV DS    F        AV QUEUE LEN FOR THE DSP-WAIT QUEUE    #569@MEA 16190000
R84MPLMN DS    F        MIN QUEUE LEN FOR THE MPLOC-WAIT QUEUE @OY16159 16200000
R84MPLMX DS    F        MAX QUEUE LEN FOR THE MPLOC-WAIT QUEUE @OY16159 16210000
R84MPLAV DS    F        AV QUEUE LEN FOR THE MPLOC-WAIT QUEUE  @OY16159 16220000
R84DUPMN DS    F        MIN QUEUE LEN FOR THE DUP JOBNAME Q    @OW18785 16222000
R84DUPMX DS    F        MAX QUEUE LEN FOR THE DUP JOBNAME Q    @OW18785 16224000
R84DUPAV DS    F        AV QUEUE LEN FOR THE DUP JOBNAME QUEUE @OW18785 16226000
R84JBSZ4 EQU   *-R84WKLNG  SIZE OF WORK TO DO SECTION          #569@MEA 16230000
         EJECT                                                 #569@MEA 16240000
***************************************************************#569@MEA 16250000
*                                                              #569@MEA 16260000
*          SUBTYPE 5  --  JOB ANALYSIS SECTION                 #569@MEA 16270000
*                                                              #569@MEA 16280000
*                                                              #569@MEA 16290000
*                R84JOB                 R84STAT                #569@MEA 16300000
*               +-------+   R84JBGOF  +-----------+            #569@MEA 16310000
*    R84NXTJB   |///////|---------->  |  GMS/MDS  |            #569@MEA 16320000
*        +------|///////|             +-----------+            #569@MEA 16330000
*        |      |///////|------+      |///////////|            #569@MEA 16340000
*        |      +-------+      |      +-----------+            #569@MEA 16350000
*        |                     +--->  |  JSTAT    |            #569@MEA 16360000
*        |                  R84JSTOF  +-----------+            #569@MEA 16370000
*        |                                                     #569@MEA 16380000
*        |       R84JOB                                        #569@MEA 16390000
*        |      +-------+                                      #569@MEA 16400000
*        +----->|///////|                                      #569@MEA 16410000
*               |///////|                                      #569@MEA 16420000
*               |///////|                                      #569@MEA 16430000
*               +-------+                                      #569@MEA 16440000
*                                                              #569@MEA 16450000
*   EACH JOB ANALYSIS ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT   *   16460000
*********************************************************************   16470000
R84JOB   DSECT                                                          16480000
R84JBNAM DS    CL8        JOB NAME                                      16490000
R84JBID  DS    CL8        JOB ID                                        16500000
         DS    XL3        UNUSED                                        16510000
R84JBRQP DS    XL1        JOB RESQUEUE PRIORITY                         16520000
R84JBCLS DS    CL8        JOB CLASS                                     16530000
R84JSGRP DS    CL8        GROUP NAME                                    16540000
R84NXTJB DS    F          OFFSET TO NEXT JOB ANALYSIS ENTRY    #569@MEA 16550000
R84JSTAT DS    F          TOTAL NUMBER OF JOBSTAT ENTRIES               16560000
R84JSTOF DS    F          OFFSET OF THE 1ST JOBSTAT ENTRY               16570000
R84JBGMS DS    F          TOTAL NUMBER OF GMS/MDS  ENTRIES              16580000
R84JBGOF DS    F          OFFSET OF THE 1ST GMS/MDS  ENTRY              16590000
*                                                              @OY34777 16595000
R84JBSZ2 EQU   *-R84JBNAM SIZE OF EACH JOB ANALYSIS ENTRY               16600000
*********************************************************************   16610000
*   EACH JOB STAT ENTRY AND GMS/MDS ENTRY CAN BE MAPPED BY    #0488@MEC 16620000
*   THE FOLLOWING FORMAT.                                     #0488@MEA 16630000
*********************************************************************   16640000
R84STAT  DSECT                                                          16650000
R84JBFNM DS    CL33       ACTIVE FUNCTION, DSP, OR PROC NAME            16660000
         DS    CL3        RESERVED FOR DEVELOPMENT                      16670000
R84JBJSR DS    X          JSTAT REASON (USED FOR MDS/GMS ONLY)          16680000
*                         NOTE: REFERENCE FIELD R84JSJSR FOR  #0615@MEA 16690000
*                         A LIST OF POSSIBLE JSTAT REASONS    #0615@MEA 16700000
         DS    XL3        RESERVED FOR DEVELOPMENT            #0488@MEA 16710000
R84JBFTM DS    F          ACTIVE FUNCTION TIME IN SECONDS     #0488@MEC 16720000
*                                                              @OY34777 16725000
R84JBSZ3 EQU   *-R84JBFNM SIZE OF EACH JOB STAT ENTRY                   16730000
*                                                            25#569@MED 16740000
         SPACE 2                                                        16750000
*******************************************************************     16760000
*                                                                 *     16770000
*          SUBTYPE 5  --  JES3 FUNCTION SUMMARY SECTION           *     16780000
*                                                                 *     16790000
*******************************************************************     16800000
SMF84FSM DSECT                                                          16810000
R84JSLNG DS    F        LENGTH OF THE FUNCTION  SUMMARY SECTION#569@MEC 16820000
R84JSNUM DS    F        TOTAL NUMBER OF JES3 FUNCTION SUMMARY ENTRIES   16830000
R84JSOF  DS    F        OFFSET OF THE 1ST JES3 FUNCTION SUMMARY ENTRY   16840000
R84GSNUM DS    F        TOTAL NUMBER OF GMS/MDS SUMMARY ENTRIES#569@MEM 16850000
R84GSOF  DS    F        OFFSET OF THE 1ST GMS/MDS SUMMARY ENTRY#569@MEM 16860000
**********************************************************************  16870000
*   MDS AND GMS SCHEDULING ANALYSIS SUMMARY INFORMATION              *  16880000
**********************************************************************  16890000
R84ALRET DS    F        ALLOCATION ATTEMPT  RETRIES DURING    #0718@MEC 16900000
*                       JMF INTERVAL. (= R84ATMPT+R84ARLSK)   #0718@MEC 16910000
R84ARLSK DS    F        ALLOCATION ATTEMPTS REJECTED WITHOUT  #0718@MEC 16920000
*                       READING JST DURING JMF INTERVAL       #0718@MEC 16930000
R84ATMPT DS    F        ALLOCATION ATTEMPTS ALLOWED TO READ   #0718@MEC 16940000
*                       JST DURING JMF INTERVAL               #0718@MEA 16950000
R84ARLF  DS    F        ALLOCATION ATTEMPTS REJECTED AFTER    #0718@MEC 16960000
*                       READING JST DURING JMF INTERVAL       #0718@MEC 16970000
R84SUCCS DS    F        SUCCESSFUL ALLOCATIONS DURING JMF     #0718@MEC 16980000
*                       INTERVAL                              #0718@MEA 16990000
*                                                              @OY34777 16995000
R84JBSZ5 EQU   *-R84JSLNG SIZE OF JES3 FUNCTION SUMRY SEC HDR  #569@MEC 17000000
**********************************************************************  17010000
*   EACH JES3 FUNCTION SUMMARY AND GMS/MDS SUMMARY ENTRY CAN  #0488@MEC 17020000
*   BE MAPPED BY THE FOLLOWING ENTRY.                         #0488@MEC 17030000
**********************************************************************  17040000
R84JFSUM DSECT                                                          17050000
R84JSNAM DS    CL33     JES3 FUNCTION NAME OR DSP NAME                  17060000
         DS    XL3      RESERVED FOR DEVELOPMENT                        17070000
R84JSJSR DS    X        RQJSTAT SCHEDULING BYPASS CODE        #0488@MEC 17080000
*                       X'01' - INSUFFICIENT STORAGE          #0488@MEA 17090000
*                       X'02' - TLIMIT EXCEEDED               #0488@MEA 17100000
*                       X'03' - I/O RATE INAPPROPRIATE        #0488@MEA 17110000
*                       X'04' - NO MATCH ON RQMAINS           #0488@MEA 17120000
*                       X'05' - CHOICE INAPPROPRIATE          #0488@MEA 17130000
*                       X'06' - NO MATCH ON CONTROL PROG. TYPE#0488@MEA 17140000
*                       X'07' - JOB CLASS NOT ENABLED         #0488@MEA 17150000
*                       X'08' - LSTOR UPDATE PENDING          #0488@MEA 17160000
*                       X'09' - CLASS CAN'T RUN ON THIS MAIN  #0488@MEA 17170000
*                       X'0A' - MIX INAPPROPRIATE (1)         #0488@MEA 17180000
*                       X'0B' - FIT INAPPROPRIATE (1)         #0488@MEA 17190000
*                       X'0C' - FIT INAPPROPRIATE (2)         #0488@MEA 17200000
*                       X'0D' - MIX INAPPROPRIATE (2)         #0488@MEA 17210000
*                       X'0E' - JOB IN HOLD OR ACTIVE         #0488@MEA 17220000
*                       X'0F' - RQINDEX NOT IN SELECT         #0488@MEA 17230000
*                       X'10' - JOB IS IN DJC HOLD            #0488@MEA 17240000
*                       X'11' - MINPART NOT AVAILABLE         #0488@MEA 17250000
*                       X'12' - GROUP DISABLED ON THIS MAIN   #0488@MEA 17260000
*                       X'13' - MAIN IS OFFLINE               #0488@MEA 17270000
*                       X'14' - TDEPTH EXCEEDED               #0488@MEA 17280000
*           THE REMAINING GMS BYPASS CODES ARE SET BY JMF     #0488@MEA 17290000
*                       X'7E' - NO GROUP INITIATORS STARTED   #0488@MEA 17300000
*                       X'7F' - ALL GROUP INITIATORS IN USE   #0488@MEA 17310000
* STORAGE DECLARATIONS FOR THE 'MDS SCHEDULING BYPASS REASONS'#0488@MEA 17320000
*                       X'80' - RESOURCE UPDATE ONLY          #0488@MEA 17330000
*                       X'81' - JOB HOLD STATUS               #0488@MEA 17340000
*                       X'82' - MAX REGION SIZE EXCEEDED      #0488@MEA 17350000
*                       X'83' - RESTART JOB PASS ONLY         #0488@MEA 17360000
*                       X'84' - ELIGIBLE MAIN NOT ONLINE OR IP#0488@MEA 17370000
*                               IPLED                         #0488@MEA 17380000
*                       X'85' - INCORRECT CONTROL PROGRAM TYPE#0488@MEA 17390000
*                       X'86' - GMS GROUP OR CLASS NOT ENABLED#0488@MEA 17400000
*                       X'87' - REQUIRED RESOURCE NOT AVAILABL#0488@MEA 17410000
*                       X'88' - DEVICE POOL FENCE NOT BUILT   #0488@MEA 17420000
*                       X'89' - MAIN SETUP DEPTH EXCEEDED     #0488@MEA 17430000
*                       X'8A' - JOB CLASS SETUP DEPTH EXCEEDED#0488@MEA 17440000
*                       X'8B' - FAILED PREALLOCATION SCAN     #0488@MEA 17450000
*                       X'FF' - JOB SELECTED FOR A MAIN       #0488@MEA 17460000
         DS    XL3      RESERVED FOR DEVELOPMENT               #693@MEA 17470000
R84JSAV  DS    F        AVERAGE FUNCTION TIME IN SECONDS      #0488@MEC 17480000
R84JSCNT DS    F        ACTIVE JOB COUNT                                17490000
R84JSMIN DS    F        MINIMUM FUNCTION TIME IN SECONDS      #0488@MEC 17500000
R84JSMAX DS    F        MAXIMUM FUNCTION TIME IN SECONDS      #0488@MEC 17510000
R84JSMNJ DS    CL8      JOB ID FOR THE MINIMUM FUNCTION TIME            17520000
R84JSMXJ DS    CL8      JOB ID FOR THE MAXIMUM FUNCTION TIME            17530000
*                                                              @OY34777 17535000
R84JBSZ6 EQU   *-R84JSNAM SIZE OF EACH JES3 FUNCTION SUMMARY ENTRY      17540000
*******************************************************************     17550000
*                                                                 *     17560000
*          SUBTYPE 5  --  PLOT SECTION                            *     17570000
*                                                                 *     17580000
*  NOTE: EACH PLOT COUNTER ENTRY CONTAINS TWO FIELDS: SCALE   #0488@MEA 17590000
*        AND COUNT. THE SCALE FIELD REFERS TO THE VALUE ALONG #0488@MEA 17600000
*        THE VERTICAL LINE.  THE COUNT FIELD CAN BE USED TO   #0488@MEA 17610000
*        CALCULATE THE POINTS ON THE HORIZONTAL LINE. YOU CAN #0488@MEA 17620000
*        CALCULATE THE PERCENTAGE OF JMF INTERVAL TIME SPENT  #0733@MEC 17630000
*        AT THE GIVEN SCALE (RECORDED BY THE PREVIOUS FIELD)  #0488@MEA 17640000
*        BY THE FOLLOWING FORMULA:                            #0488@MEA 17650000
*        % OF JMF INTERVAL TIME = COUNT / JOB SAMPLE COUNT    #0488@MEA 17660000
*                                 (R84JOBCG) * 100            #0488@MEA 17670000
*******************************************************************     17680000
SMF84PLT DSECT                                                          17690000
R84PLTLN DS    F        LENGTH OF PLOT SECTION                #0227@MEC 17700000
R84JOBCG DS    F        NUMBER OF JOB SAMPLE COUNTS           #0488@MEA 17710000
R84INITN DS    F        NUMBER OF PLOTS FOR "JOBS IN          #0227@MEC 17720000
*                       EXECUTION BY MAIN PROCESSOR"                    17730000
R84INITO DS    F        OFFSET TO THE 1ST ENTRY OF "JOBS IN   #0227@MEC 17740000
*                       EXECUTION BY MAIN  PROCESSOR"                   17750000
R84RQNXN DS    F        NUMBER OF PLOTS FOR "JOB Q LENGTH      #569@MEM 17760000
*                       BY JES3 FUNCTION"                      #569@MEM 17770000
R84RQNXO DS    F        OFFSET TO 1ST ENTRY OF "JOB Q LENGTH   #569@MEM 17780000
*                       BY JES3 FUNCTION"                      #569@MEM 17790000
R84DCLSN DS    F        NUMBER OF PLOTS FOR "ALLOCATED JES3    #569@MEM 17800000
*                       DEVICES BY DEVICE  CLASS"              #569@MEM 17810000
R84DCLSO DS    F        OFFSET TO THE 1ST ENTRY OF             #569@MEM 17820000
*                       "ALLOCATED JES3 DEVICES BY DEVICE CLASS#569@MEM 17830000
R84SETNN DS    F        NUMBER OF PLOTS FOR "ALLOCATED         #569@M3M 17840000
*                       JES3 DEVICES BY SETNAME"               #569@M3M 17850000
R84SETNO DS    F        OFFSET TO THE 1ST ENTRY OF             #569@M3M 17860000
*                       "ALLOCATED JES3 DEVICES BY SETNAME"    #569@M3M 17870000
R84JCLSN DS    F        NUMBER OF PLOTS FOR "JOBS IN          #0227@MEC 17880000
*                       EXECUTION BY JOB CLASS GROUP"                   17890000
R84JCLSO DS    F        OFFSET TO THE 1ST ENTRY OF "JOBS      #0227@MEC 17900000
*                       IN EXECUTION BY JOB CLASS GROUP"                17910000
R84PLTSZ EQU   *-R84PLTLN  SIZE OF PLOT SECTION                         17920000
*******************************************************************     17930000
*   THE FOLLOWING DSECT WILL MAP EACH "JOBS IN EXECUTION BY MAIN  *     17940000
*   PROCESSOR (I.E. INITIATOR PLOT)"  ENTRY                       *     17950000
*******************************************************************     17960000
R84IPLOT DSECT                                                          17970000
R84INEXT DS    F        OFFSET TO NEXT INITIATOR PLOT ENTRY             17980000
R84INAME DS    CL8      PROCESSOR NAME                                  17990000
R84IFLG  DS    XL1      FLAG BYTE 1                                     18000000
R84IGBL  EQU   X'80'    JES3 GLOBAL                                     18010000
R84ILCL  EQU   X'40'    JES3 LOCAL                                      18020000
         DS    XL3      RESERVED                                        18030000
R84IINIT DS    F        COUNT FOR STARTED INITIATORS                    18040000
R84IPLLO DS    F        SMALLEST SCALE FOR INITIATOR PLOT     #0227@MEC 18050000
R84IPLHI DS    F        LARGEST SCALE FOR INITIATOR PLOT      #0227@MEC 18060000
R84IPLIN DS    F        INCREMENT FOR PLOTTING INITIATOR PLOT           18070000
R84IPTMN DS    F        MINIMUM PLOT VALUE FOR INITIATOR PLOT           18080000
R84IPTMX DS    F        MAXIMUM PLOT VALUE FOR INITIATOR PLOT           18090000
R84IPTAV DS    F        AVERAGE PLOT VALUE FOR INITIATOR PLOT           18100000
R84IPTN  DS    F        NUMBER OF INITIATOR PLOT COUNTER ENTRIES        18110000
R84IPTO  DS    F        OFFSET TO 1ST INITIATOR PLOT COUNTER ENTRY      18120000
*                                                              @OY34777 18125000
R84ISZ1  EQU   *-R84INEXT  LENGTH OF INITIATOR PLOT ENTRY               18130000
*******************************************************************     18140000
*  THE FOLLOWING DSECT WILL MAP EACH INITIATOR PLOT COUNTER ENTRY *     18150000
*******************************************************************     18160000
R84IPT   DSECT                                                          18170000
R84IPTS  DS    F        INITIATOR PLOT SCALE                            18180000
R84IPTC  DS    F        COUNT FOR INITIATOR PLOT SCALE                  18190000
*                                                              @OY34777 18195000
R84IPSZ1 EQU   *-R84IPTS LENGTH OF INIT. PLOT COUNTER ENTRY   #0227@MEC 18200000
*******************************************************************     18210000
*THE FOLLOWING DSECT WILL MAP EACH "JOBS IN EXECUTION BY JOB CLASS*     18220000
*GROUP" ENTRY                                                     *     18230000
*******************************************************************     18240000
R84JPLOT DSECT                                                          18250000
R84JNEXT DS    F        OFFSET TO NEXT ENTRY FOR "JOBS IN               18260000
*                       EXECUTION BY JOB CLASS GROUP"                   18270000
R84JNAME DS    CL8      PROCESSOR NAME                                  18280000
R84JCGRP DS    CL8      JOB CLASS GROUP NAME                  #0227@MEA 18290000
R84JCSIN DS    F        COUNT FOR STARTED INITIATORS          #0227@MEA 18300000
R84JPLLO DS    F        SMALLEST SCALE FOR JOB CLASS PLOT     #0227@MEA 18310000
R84JPLHI DS    F        LARGEST SCALE FOR JOB CLASS PLOT      #0227@MEA 18320000
R84JPLIN DS    F        INCREMENT FOR PLOTTING JOB CLASS PLOT #0227@MEA 18330000
R84JPTMN DS    F        MINIMUM PLOT VALUE FOR JOB CLASS PLOT #0227@MEA 18340000
R84JPTMX DS    F        MAXIMUM PLOT VALUE FOR JOB CLASS PLOT #0227@MEA 18350000
R84JPTAV DS    F        AVERAGE PLOT VALUE FOR JOB CLASS PLOT #0227@MEA 18360000
R84JPTN  DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR JOB#0227@MEA 18370000
*                       CLASS PLOT                            #0227@MEA 18380000
R84JPTO  DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY      #0227@MEA 18390000
*                       FOR JOB CLASS PLOT                    #0227@MEA 18400000
*                                                            4#0227@MED 18410000
*                                                              @OY34777 18415000
R84JSZ1  EQU   *-R84JNEXT  LENGTH OF JOB CLASS GROUP ENTRY              18420000
*                                                           18#0227@MED 18430000
*******************************************************************     18440000
*   THE FOLLOWING DSECT WILL MAP EACH JOB CLASS GROUP PLOT COUNTER*     18450000
*   ENTRY                                                         *     18460000
*******************************************************************     18470000
R84JCPT  DSECT                                                          18480000
R84JPTS  DS    F        JOB CLASS GROUP PLOT SCALE                      18490000
R84JPTC  DS    F        COUNT FOR JOB CLASS GROUP PLOT SCALE            18500000
*                                                              @OY34777 18505000
R84JPSZ1 EQU   *-R84JCPT  LENGTH OF JOB CLASS GROUP PLOT COUNTER ENT    18510000
*******************************************************************     18520000
* THE FOLLOWING DSECT WILL MAP EACH "ALLOCATED JES3 DEVICES BY    *     18530000
* DEVICE CLASS (I.E. DEVICE PLOT)" ENTRY                          *     18540000
*******************************************************************     18550000
R84DPLOT DSECT                                                #0227@MEC 18560000
R84DNEXT DS    F        OFFSET TO NEXT DEVICE PLOT                      18570000
R84DFLG  DS    XL1      FLAG BYTE 1                                     18580000
R84DTA   EQU   X'80'    TAPE DEVICE                                     18590000
R84DDA   EQU   X'40'    DIRECT ACCESS DEVICE                            18600000
R84DUR   EQU   X'20'    UNIT RECORD DEVICE                              18610000
R84DGR   EQU   X'10'    GRAPHICS DEVICE                                 18620000
         DS    XL1      RESERVED                              #0227@MEC 18630000
R84DNAME DS    CL2      DEVICE NAME                           #0227@MEC 18640000
R84DCNT  DS    F        COUNT FOR TOTAL NUMBER OF DEVICES               18650000
R84DPLLO DS    F        SMALLEST SCALE FOR DEVICE PLOT        #0227@MEC 18660000
R84DPLHI DS    F        LARGEST SCALE FOR DEVICE PLOT         #0227@MEC 18670000
R84DPLIN DS    F        INCREMENT FOR PLOTTING DEVICE PLOT              18680000
R84DPTMN DS    F        MINIMUM PLOT VALUE FOR DEVICE PLOT              18690000
R84DPTMX DS    F        MAXIMUM PLOT VALUE FOR DEVICE PLOT              18700000
R84DPTAV DS    F        AVERAGE PLOT VALUE FOR DEVICE PLOT              18710000
R84DPTN  DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR              18720000
*                       DEVICE PLOT                                     18730000
R84DPTO  DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY                18740000
*                       FOR DEVICE PLOT                                 18750000
*                                                              @OY34777 18755000
R84DSZ1  EQU   *-R84DNEXT    LENGTH OF DEVICE PLOT ENTRY                18760000
*******************************************************************     18770000
*   THE FOLLOWING DSECT WILL MAP EACH DEVICE PLOT COUNTER ENTRY   *     18780000
*******************************************************************     18790000
R84DPT   DSECT                                                          18800000
R84DPTS  DS    F        DEVICE PLOT SCALE                               18810000
R84DPTC  DS    F        COUNT FOR DEVICE PLOT SCALE                     18820000
*                                                              @OY34777 18825000
R84DPSZ1 EQU   *-R84DPTS    LENGTH OF DEVICE PLOT COUNTER ENTRY         18830000
*******************************************************************     18840000
*   THE FOLLOWING DSECT WILL MAP EACH "ALLOCATED JES3 DEVICES BY  *     18850000
*   SETNAME (I.E. SETNAME PLOT)" ENTRY                            *     18860000
*******************************************************************     18870000
R84SPLOT DSECT                                                #0227@MEC 18880000
R84SNEXT DS    F        OFFSET TO NEXT SETNAME PLOT                     18890000
R84SMPCN DS    CL8      PROCESSOR NAME                        #0499@MEC 18900000
R84SFLG  DS    XL1      FLAG BYTE 1                                     18910000
R84SGBL  EQU   X'80'    JES3 GLOBAL                                     18920000
R84SLCL  EQU   X'40'    JES3 LOCAL                                      18930000
         DS    XL3      RESERVED                                        18940000
R84SXTYP DS    CL8      SETNAME DEVICE NAME                   #0227@MEA 18950000
R84SXTOT DS    F        TOTAL SETNAME DEVICES                 #0227@MEA 18960000
R84SPLLO DS    F        SMALLEST SCALE FOR SETNAME PLOT       #0227@MEA 18970000
R84SPLHI DS    F        LARGEST SCALE FOR SETNAME PLOT        #0227@MEA 18980000
R84SPLIN DS    F        INCREMENT FOR PLOTTING SETNAME PLOT   #0227@MEA 18990000
R84SPTMN DS    F        MINIMUM PLOT VALUE FOR SETNAME PLOT   #0227@MEA 19000000
R84SPTMX DS    F        MAXIMUM PLOT VALUE FOR SETNAME PLOT   #0227@MEA 19010000
R84SPTAV DS    F        AVERAGE PLOT VALUE FOR SETNAME PLOT   #0227@MEA 19020000
R84SPTN  DS    F        NUMBER OF SETNAME PLOT COUNTER ENTRIES#0227@MEA 19030000
R84SPTO  DS    F        OFFSET TO 1ST SETNAME PLOT COUNTER ENT#0227@MEA 19040000
*                                                            2#0227@MED 19050000
R84SSZ1  EQU   *-R84SNEXT   LENGTH OF SETNAME PLOT ENTRY      #0227@MEC 19060000
         ORG   R84SPTMN                                       #0227@MEA 19070000
R84XJMIN DS    F        MINIMUM PLOT VALUE FOR J TYPE DEVICES.#0227@MEA 19080000
*                       J TYPE DEVICES ARE SETUP DEVICES THAT #0227@MEA 19090000
*                       ARE ALLOCATED BY JES3.                #0227@MEA 19100000
R84XJMAX DS    F        MAXIMUM PLOT VALUE FOR J TYPE DEVICES #0227@MEA 19110000
R84XJAVG DS    F        AVERAGE PLOT VALUE FOR J TYPE DEVICES #0227@MEA 19120000
R84XJPTN DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR    #0227@MEA 19130000
*                       J TYPE DEVICES                        #0227@MEA 19140000
R84XJPTO DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY FOR  #0227@MEA 19150000
*                       J TYPE DEVICES.                       #0227@MEA 19160000
R84XXMIN DS    F        MINIMUM PLOT VALUE FOR X TYPE DEVICES;#0227@MEA 19170000
*                       X TYPE DEVICES ARE SETUP DEVICES THAT #0227@MEA 19180000
*                       IN EXECUTION ON MAIN (CLASS 1 DEVICES #0227@MEA 19190000
*                       ONLY).                                #0227@MEA 19200000
R84XXMAX DS    F        MAXIMUM PLOT VALUE FOR X TYPE DEVICES #0227@MEA 19210000
R84XXAVG DS    F        AVERAGE PLOT VALUE FOR X TYPE DEVICES #0227@MEA 19220000
R84XXPTN DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR    #0227@MEA 19230000
*                       X TYPE DEVICES                        #0227@MEA 19240000
R84XXPTO DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY FOR  #0227@MEA 19250000
*                       X TYPE DEVICES                        #0227@MEA 19260000
R84XMMIN DS    F        MINIMUM PLOT VALUE FOR M TYPE DEVICES;#0227@MEA 19270000
*                       M TYPE DEVICES ARE SETUP DEVICES THAT #0227@MEA 19280000
*                       ARE ALLOCATED BY MVS.                 #0227@MEA 19290000
R84XMMAX DS    F        MAXIMUM PLOT VALUE FOR M TYPE DEVICES #0227@MEA 19300000
R84XMAVG DS    F        AVERAGE PLOT VALUE FOR M TYPE DEVICES #0227@MEA 19310000
R84XMPTN DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR M  #0227@MEA 19320000
*                       TYPE DEVICES                          #0227@MEA 19330000
R84XMPTO DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY FOR  #0227@MEA 19340000
*                       M TYPE DEVICES                        #0227@MEA 19350000
*                                                              @OY34777 19355000
R84SSZ2  EQU   *-R84SNEXT  LENGTH OF XTYPE PLOT ENTRY         #0227@MEA 19360000
*                                                           43#0227@MED 19370000
**************************************************************#0227@MEC 19380000
* THE FOLLOWING DSECT WILL MAP EACH SETNAME, X TYPE, J TYPE, *#0227@MEC 19390000
* OR M TYPE PLOT COUNTER ENTRY                               *#0227@MEC 19400000
**************************************************************#0227@MEC 19410000
R84XPT   DSECT                                                          19420000
R84XPTS  DS    F        XTYPE PLOT SCALE                      #0227@MEC 19430000
R84XPTC  DS    F        COUNT FOR XTYPE PLOT SCALE                      19440000
*                                                              @OY34777 19445000
R84XPSZ1 EQU   *-R84XPTS    LENGTH OF XTYPE PLOT COUNTER ENTRY          19450000
*******************************************************************     19460000
*THE FOLLOWING DSECT WILL MAP EACH "JES3 Q LENGTH BY JES3 FUNCTION*     19470000
*   (I.E. RQINDEX PLOT)" ENTRY                                    *     19480000
*******************************************************************     19490000
R84RPLOT DSECT                                                #0227@MEC 19500000
R84RNEXT DS    F        OFFSET TO NEXT RQINDEX PLOT                     19510000
R84RQNAM DS    CL33     NAME OF RQINDEX                                 19520000
         DS    XL3      RESERVED                                        19530000
R84RPLLO DS    F        SMALLEST SCALE FOR RQINDEX PLOT       #0227@MEC 19540000
R84RPLHI DS    F        LARGEST SCALE FOR RQINDEX PLOT        #0227@MEC 19550000
R84RPLIN DS    F        INCREMENT FOR PLOTTING RQINDEX PLOT             19560000
R84RPTMN DS    F        MINIMUM PLOT VALUE FOR RQINDEX PLOT             19570000
R84RPTMX DS    F        MAXIMUM PLOT VALUE FOR RQINDEX PLOT             19580000
R84RPTAV DS    F        AVERAGE PLOT VALUE FOR RQINDEX PLOT             19590000
R84RPTN  DS    F        NUMBER OF PLOT COUNTER ENTRIES FOR              19600000
*                       RQINDEX PLOT                                    19610000
R84RPTO  DS    F        OFFSET TO 1ST PLOT COUNTER ENTRY                19620000
*                       FOR RQINDEX PLOT                                19630000
*                                                              @OY34777 19635000
R84RSZ1  EQU   *-R84RNEXT  LENGTH OF RQINDEX PLOT ENTRY                 19640000
*******************************************************************     19650000
*   THE FOLLOWING DSECT WILL MAP EACH RQINDEX PLOT COUNTER ENTRY  *     19660000
*******************************************************************     19670000
R84RQPTS DS    F        RQINDEX PLOT SCALE                              19680000
R84RQPTC DS    F        COUNT FOR RQINDEX PLOT SCALE                    19690000
*                                                              @OY34777 19695000
R84RQPS1 EQU   *-R84RQPTS  LENGTH OF RQINDEX PLOT COUNTER ENTRY         19700000
         SPACE ,                                                        19710000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP6                            19720000
         MEXIT                                                          19730000
.SUBTYP6 ANOP                                                           19740000
*******************************************************************     19750000
*                                                                 *     19760000
*          SUBTYPE 6  --  HOT SPOT ANALYSIS SECTION               *     19770000
*                                                                 *     19780000
*******************************************************************     19790000
         SPACE 2                                                        19800000
SMF84HSP DSECT                                                          19810000
R84SPLNG DS    F        LENGTH OF THE JES3 HOT SPOT ANALYSIS SECTION    19820000
R84SPNUM DS    F        TOTAL NUMBER OF HOT SPOT ENTRIES                19830000
R84SPOF  DS    F        OFFSET OF THE 1ST HOT SPOT ENTRY                19840000
R84SPOT  DS    CL8      SPOT = VALUE                          #0415@MEC 19850000
R84WIDTH DS    CL8      WIDTH = VALUE                         #0415@MEC 19860000
R84NAME  DS    CL8      NAME = VALUE                          #0415@MEC 19870000
R84HFCT  DS    CL8      HFCT = VALUE                          #0415@MEC 19880000
R84HSPFL DS    X'00'    HOT SPOT FLAG                         #0586@MEA 19890000
R84HSPOV EQU   X'80'    HOT SPOT TABLE EXCEEDED FLAG          #0586@MEA 19900000
         DS    XL3      RESERVED FOR DEVELOPMENT              #0586@MEA 19910000
*                                                            3#0415@MED 19920000
R84SPSZ1 EQU   *-R84SPLNG SIZE OF JES3 HOT SPOT ANALYSIS HEADER         19930000
**********************************************************************  19940000
*   EACH HOT SPOT ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT.       *  19950000
**********************************************************************  19960000
R84HSP   DSECT                                                          19970000
R84SCSCT DS    CL8      CSECT NAME                                      19980000
R84STYPE DS    CL2      CSECT TYPE                                      19990000
         DS    XL2      RESERVED FOR DEVELOPMENT              #0415@MEC 20000000
R84SSTRT DS    F        STARTING ADDRESS OR DISPLACEMENT      #0611@MEC 20010000
R84SEND  DS    F        ENDING ADDRESS OR DISPLACEMENT        #0611@MEC 20020000
R84SPCNT DS    F        CSECT REFERENCE COUNT;                          20030000
*                       % OF RUN ACTIVE--OVERALL = CSECT REFERENCE      20040000
*                       COUNT / CPU BUSY SAMPLE COUNT * 100             20050000
R84SPNRF DS    F        CSECT REFERENCE COUNT IN IATNUC;                20060000
*                       % OF RUN ACTIVE--IATNUC = CSECT REFERENCE       20070000
*                       COUNT IN IATNUC / CPU BUSY SAMPLE COUNT * 100;  20080000
*                       % OF TASK ACTIVE--IATNUC = CSECT REFERENCE      20090000
*                       COUNT IN IATNUC / IATNUC POSTED-ACTIVE COUNT    20100000
*                       * 100                                           20110000
R84SPARF DS    F        CSECT REFERENCE COUNT IN IATAUX;                20120000
*                       % OF RUN ACTIVE--IATAUX = CSECT REFERENCE COUNT 20130000
*                       IN IATAUX / CPU BUSY SAMPLE COUNT * 100;        20140000
*                       % OF TASK ACTIVE--IATAUX = CSECT REFERENCE      20150000
*                       COUNT IN IATAUX / IATAUX POSTED-ACTIVE COUNT    20160000
*                       * 100                                           20170000
*                                                              @OY34777 20175000
R84SPSZ2 EQU   *-R84SCSCT SIZE OF JES3 HOT SPOT ANALYSIS HEADER         20180000
         SPACE ,                                                        20190000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP7                            20200000
         MEXIT                                                          20210000
.SUBTYP7 ANOP                                                           20220000
*******************************************************************     20230000
*                                                                 *     20240000
*          SUBTYPE 7  --  JES3 INTERNAL READER DSP ANALYSIS       *     20250000
*                                                                 *     20260000
*******************************************************************     20270000
         SPACE 2                                                        20280000
SMF84IR  DSECT                                                          20290000
R84IRLNG DS    F        LENGTH OF THE JES3 INTERNAL READER DSP ANALYSIS 20300000
*                       SECTION                                         20310000
R84IRMN  DS    F        MINIMUM NUMBER OF ACTIVE INTERNAL READER DSPS   20320000
R84IRMX  DS    F        MAXIMUM NUMBER OF ACTIVE INTERNAL READER DSPS   20330000
R84IRAV  DS    F        AVERAGE NUMBER OF ACTIVE INTERNAL READER DSPS   20340000
R84IRIR  DS    F        AVERAGE NUMBER OF IDLE INTERNAL READER DSPS     20350000
R84IRHWM DS    F        INTERNAL READER DSP HIGH WATER MARK    @OY16159 20360000
R84IRATM DS    F        ACTIVE-INTRDR-AT-MAX COUNT;                     20370000
*                       % OF ACTIVE-INTRDR-AT-MAX = ACTIVE-INTRDR-AT-   20380000
*                       MAX COUNT / JMF SAMPLE COUNT * 100              20390000
R84IRAT0 DS    F        NO-INTRDR-ACTIVE COUNT;                         20400000
*                       % OF ACTIVE-INTRDR-AT-ZERO = NO-INTRDR-ACTIVE   20410000
*                       COUNT / JMF SAMPLE COUNT * 100                  20420000
R84IRAVL DS    F        AVERAGE LENGTH OF THE INTRDR QUEUE              20430000
R84IRMXA DS    F        MAXIMUM INTERNAL READER DSPS ALLOWED;  @OY16159 20440000
*                       IF IT IS 0000FFFF, THERE IS NO LIMIT   @OY16159 20450000
*                       ON INTRDR DSPS ALLOWED                 @OY16159 20460000
R84IRSZ1 EQU   *-R84IRLNG SIZE OF INTRDR DSP ANALYSIS SECTION           20470000
         SPACE ,                                                        20480000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP8                            20490000
         MEXIT                                                          20500000
.SUBTYP8 ANOP                                                           20510000
*******************************************************************     20520000
*                                                                 *     20530000
*          SUBTYPE 8  --  JES3 SSI RESPONSE TIME ANALYSIS         *     20540000
*                                                                 *     20550000
*******************************************************************     20560000
         SPACE 2                                                        20570000
SMF84SSI DSECT                                                          20580000
R84SILNG DS    F        LENGTH OF THE SSI RESPONSE TIME SECTION         20590000
R84SSIN  DS    F        TOTAL NUMBER OF SSI ENTRIES                     20600000
R84SSIO  DS    F        OFFSET OF THE 1ST SSI ENTRY                     20610000
R84SISZ1 EQU   *-R84SILNG SIZE OF SSI RESPONSE TIME ANALYSIS            20620000
**********************************************************************  20630000
*   EACH SSI ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT             *  20640000
**********************************************************************  20650000
R84SSI   DSECT                                                          20660000
R84SIFN  DS    CL12     SSI FUNCTION CODE NAME                          20670000
R84SIREQ DS    F        NUMBER OF REQUESTS RECEIVED                     20680000
R84SIRSP DS    F        NUMBER OF RESPONSES RECEIVED                    20690000
R84SIMIN DS    F        MINIMUM RESPONSE TIME IN MICROSECONDS  @OY16159 20700000
R84SIMAX DS    F        MAXIMUM RESPONSE TIME IN MICROSECONDS  @OY16159 20710000
R84SIAVG DS    F        AVERAGE RESPONSE TIME IN MICROSECONDS  @OY16159 20720000
*                                                              @OY34777 20725000
R84SISZ2 EQU   *-R84SIFN  SIZE OF EACH SSI RESPONSE TIME ENTRY          20730000
         SPACE ,                                                        20740000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTYP9                            20750000
         MEXIT                                                          20760000
.SUBTYP9 ANOP                                                           20770000
*******************************************************************     20780000
*                                                                 *     20790000
*          SUBTYPE 9  --  JES3 SSI DESTINATION QUEUE ANALYSIS     *     20800000
*                                                                 *     20810000
*******************************************************************     20820000
         SPACE 2                                                        20830000
SMF84DSQ DSECT                                                          20840000
R84DQLNG DS    F        LENGTH OF THE SSI DESTINATION QUEUE SECTION     20850000
R84DQNUM DS    F        TOTAL NUMBER OF SSI DESTINATION ENTRIES         20860000
R84DQOF  DS    F        OFFSET OF THE 1ST SSI DESTINATION QUEUE ENTRY   20870000
R84DQSZ1 EQU   *-R84DQLNG SIZE OF SSI DEST QUEUE ANALYSIS HEADER        20880000
**********************************************************************  20890000
*   EACH SSI DESTINATION ENTRY CAN BE MAPPED BY THE FOLLOWING FORMAT.*  20900000
**********************************************************************  20910000
R84DSQ   DSECT                                                          20920000
R84DQNAM DS    CL30     SSI DESTINATION QUEUE NAME                      20930000
*                                                              @OY34777 20930100
R84DQFLG DS    X        DYNAMIC DESTQ FLAG BYTE                @OY16159 20940000
R84DGFSS EQU   X'80'    DYN DESTQ / GLOBAL / FSS ONLY ENTRY    @OY16159 20950000
R84DGFSA EQU   X'40'    DYN DESTQ / GLOBAL / FSS/FSA ENTRY     @OY16159 20960000
R84DLFSS EQU   X'20'    DYN DESTQ / LOCAL / FSS ONLY ENTRY     @OY16159 20970000
R84DLFSA EQU   X'10'    DYN DESTQ / LOCAL / FSS/FSA ENTRY      @OY16159 20980000
         DS    X        RESERVED FOR DEVELOPMENT              #0286@MEA 20990000
R84FSSNM DS    CL8      FSS NAME (GLOBAL/DYN DESTQ;            @OY16159 21000000
*                       HEX ZEROS IF GLOBAL/NOT DYN DESTQ)     @OY16159 21010000
         ORG   R84FSSNM                                        @OY16159 21020000
R84FSSID DS    XL2      FSS ID ( LOCAL/DYN DESTQ)              @OY16159 21030000
*                       (REDEFINES 1ST TWO BYTES OF R85FSSNM)  @OY16159 21040000
         ORG   ,                                               @OY16159 21050000
R84FSANM DS    CL8      FSA NAME (GLOBAL/DYN DESTQ AND FSS/FSA @OY16159 21060000
*                       ENTRY. HEX ZEROS IF GLOBAL/NOT DYN     @OY16159 21070000
*                       DESTQ, OR IF GLOBAL/DYN DESTQ AND      @OY16159 21080000
*                       FSS ONLY ENTRY).                       @OY16159 21090000
         ORG   R84FSANM                                        @OY16159 21100000
R84FSAID DS    XL2      FSA ID  (LOCAL/DYN DESTQ)              @OY16159 21110000
*                       (HEX ZEROS IF LOCAL/DYN DESTQ AND FSS  @OY16159 21120000
*                       ONLY ENTRY). (REDEFINES 1ST TWO BYTES  @OY16159 21130000
*                       OF R84FSANM).                          @OY16159 21140000
         ORG   ,                                               @OY16159 21150000
************************************************************** @OY16159 21160000
*                                                              @OY16159 21170000
* THE FOLLOWING TABLE SHOWS THE CONTENTS OF R84DQFLG,          @OY16159 21180000
* R84FSSNM/R84FSSID, AND R84FSANM/R84FSAID FOR THE VARIOUS     @OY16159 21190000
* TYPES OF RECORDS MAPPED HERE. (A = ALPHANUMERIC CHARACTER,   @OY16159 21200000
* X = HEXADECIMAL BYTE, AND Z = HEX ZEROS BYTE).               @OY16159 21210000
*                                                              @OY16159 21220000
* TYPE                 R84DQFLG  R84FSSNM    R84FSANM          @OY16159 21230000
*                                /R84FSSID   /R84FSAID         @OY16159 21240000
* NON-DYN.             X'00'     ZZZZZZZZ    ZZZZZZZZ          @OY16159 21250000
* DYN. GLOBAL FSS ONLY X'80'     AAAAAAAA    ZZZZZZZZ          @OY16159 21260000
* DYN. GLOBAL FSS/FSA  X'40'     AAAAAAAA    AAAAAAAA          @OY16159 21270000
* DYN. LOCAL  FSS ONLY X'20'     XXZZZZZZ    ZZZZZZZZ          @OY16159 21280000
* DYN. LOCAL  FSS/FSA  X'10'     XXZZZZZZ    XXZZZZZZ          @OY16159 21290000
*                                                             #0418@MED 21300000
R84DQMAX DS    F        MAXIMUM DESTINATION QUEUE LENGTH                21310000
R84DQMIN DS    F        MINIMUM DESTINATION QUEUE LENGTH                21320000
R84DQAVG DS    F        AVERAGE DESTINATION QUEUE LENGTH                21330000
*                                                              @OY34777 21335000
R84DQSZ2 EQU   *-R84DQNAM SIZE OF EACH SSI DEST QUEUE ANALYSIS ENTRY    21340000
         SPACE ,                                                   @RWA 21350000
         AIF   ('&SUBTYPE' EQ 'ALL').SUBTY10                       @RWA 21360000
         MEXIT ,                                                   @RWA 21370000
.SUBTY10 ANOP  ,                                                   @RWA 21380000
         EJECT ,                                                   @RWA 21390000
***************************************************************    @RWA 21400000
*                                                             *    @RWA 21410000
*        The following maps the subtype 10 - Workload Manager *    @RWA 21420000
*        (WLM) information.                                   *    @RWA 21430000
*                                                             *    @RWA 21440000
*        The WLM information consists of the following data   *    @RWA 21450000
*        sections:                                            *    @RWA 21460000
*                                                             *    @RWA 21470000
*        (1) WLM General section - contains offsets to the    *    @RWA 21480000
*            other sections.                                  *    @RWA 21490000
*                                                             *    @RWA 21500000
*        (2) Service class section - Information is collected *    @RWA 21510000
*            for each service class that had activity during  *    @RWA 21520000
*            the sampling interval.  The following sections   *    @RWA 21530000
*            are created for each service class:              *    @RWA 21540000
*                                                             *    @RWA 21550000
*            -- Service class fixed section - Contains the    *    @RWA 21560000
*               service class name and offsets to the other   *    @RWA 21570000
*               sections.                                     *    @RWA 21580000
*                                                             *    @RWA 21590000
*            -- Service class non-system information -        *    @RWA 21600000
*               Contains non-system related information such  *    @RWA 21610000
*               as the number of jobs in MDS, GMS etc.        *    @RWA 21620000
*                                                             *    @RWA 21630000
*            -- Service class system information - one entry  *    @RWA 21640000
*               for every system that had activity during     *    @RWA 21650000
*               the sampling interval.                        *    @RWA 21660000
*                                                             *    @RWA 21670000
*-------------------------------------------------------------*    @RWA 21680000
*                                                             *    @RWA 21690000
*        The SMF 84 record for WLM has the following format.  *    @RWA 21700000
*        If all of the information fits into a single SMF     *    @RWA 21710000
*        buffer, the SMF record looks like this:              *    @RWA 21720000
*                                                             *    @RWA 21730000
*        -- SMF 84 header                                     *    @RWA 21740000
*        -- SMF 84 product section                            *    @RWA 21750000
*        -- SMF 84 general section                            *    @RWA 21760000
*                                                             *    @RWA 21770000
*        -- WLM General/subtype 10 section                    *    @RWA 21780000
*                                                             *    @RWA 21790000
*           -- Service Class Fixed Section - Srvclass #1      *    @RWA 21800000
*              -- Service Class - Non-system info             *    @RWA 21810000
*              -- Service Class - System info #1              *    @RWA 21820000
*                    .                                        *    @RWA 21830000
*                    .                                        *    @RWA 21840000
*                    .                                        *    @RWA 21850000
*              -- Service Class - System info #n              *    @RWA 21860000
*                                                             *    @RWA 21870000
*           -- Service Class Fixed Section - Srvclass #2      *    @RWA 21880000
*                    .                                        *    @RWA 21890000
*                    .                                        *    @RWA 21900000
*                    .                                        *    @RWA 21910000
*                                                             *    @RWA 21920000
*-------------------------------------------------------------*    @RWA 21930000
*                                                             *    @RWA 21940000
*        If one or more service classes will not fit into     *    @RWA 21950000
*        a single buffer, the first buffer will look like     *    @RWA 21960000
*        the first example, but the second through nth        *    @RWA 21970000
*        buffers will look like this:                         *    @RWA 21980000
*                                                             *    @RWA 21990000
*        -- SMF 84 header                                     *    @RWA 22000000
*                                                             *    @RWA 22010000
*        -- WLM General/subtype 10 section                    *    @RWA 22020000
*                                                             *    @RWA 22030000
*           -- Service Class Fixed Section - Srvclass #n      *    @RWA 22040000
*              -- Service Class - Non-system info             *    @RWA 22050000
*              -- Service Class - System info #1              *    @RWA 22060000
*                    .                                        *    @RWA 22070000
*                    .                                        *    @RWA 22080000
*                    .                                        *    @RWA 22090000
*              -- Service Class - System info #n              *    @RWA 22100000
*                                                             *    @RWA 22110000
*           -- Service Class Fixed Section - Srvclass #n+1    *    @RWA 22120000
*                    .                                        *    @RWA 22130000
*                    .                                        *    @RWA 22140000
*                    .                                        *    @RWA 22150000
*                                                             *    @RWA 22160000
*-------------------------------------------------------------*    @RWA 22170000
*                                                             *    @RWA 22180000
*        It is also possible that the system specific         *    @RWA 22190000
*        information for a service class will not fit into    *    @RWA 22200000
*        a single buffer.  In this case, the information      *    @RWA 22210000
*        will be continued in the next buffer.  When this     *    @RWA 22220000
*        happens, the offset in the next buffer to the        *    @RWA 22230000
*        non-system specific information will be zero because *    @RWA 22240000
*        the non-system information exists in the previous    *    @RWA 22250000
*        buffer.                                              *    @RWA 22260000
*                                                             *    @RWA 22270000
*        The continuation buffer will look like this:         *    @RWA 22280000
*                                                             *    @RWA 22290000
*                                                             *    @RWA 22300000
*        -- SMF 84 header                                     *    @RWA 22310000
*                                                             *    @RWA 22320000
*        -- WLM General/subtype 10 section                    *    @RWA 22330000
*                                                             *    @RWA 22340000
*           -- Service Class Fixed Section                    *    @RWA 22350000
*              -- Service Class - System info #m              *    @RWA 22360000
*                    .                                        *    @RWA 22370000
*                    .                                        *    @RWA 22380000
*                    .                                        *    @RWA 22390000
*              -- Service Class - System info #n              *    @RWA 22400000
*                                                             *    @RWA 22410000
*           -- Service Class Fixed Section                    *    @RWA 22420000
*                    .                                        *    @RWA 22430000
*                    .                                        *    @RWA 22440000
*                    .                                        *    @RWA 22450000
*                                                             *    @RWA 22460000
***************************************************************    @RWA 22470000
         SPACE 1                                                   @RWA 22480000
***************************************************************    @RWA 22490000
*                                                             *    @RWA 22500000
*        Subtype 10 - WLM General Section                     *    @RWA 22510000
*                                                             *    @RWA 22520000
***************************************************************    @RWA 22530000
SMF84WLM DSECT ,                   WLM General Data Section        @RWA 22540000
R84WLMLN DS    F                   Length of the WLM general       @RWA 22550000
*                                    section                       @RWA 22560000
*                                                                  @RWA 22570000
R84SRVOF DS    F                   Offset to from this section     @RWA 22580000
*                                    to the first service          @RWA 22590000
*                                    class section or zero         @RWA 22600000
*                                                                  @RWA 22610000
R84WLMGR DS    20F                 Reserved for IBM                @RWA 22620000
*                                                                  @RWA 22630000
R84WLMEN DS    0F                  End of WLM general section      @RWA 22640000
R84WLMSZ EQU   *-SMF84WLM          Size of WLM general section     @RWA 22650000
         SPACE 1                                                   @RWA 22660000
***************************************************************    @RWA 22670000
*                                                             *    @RWA 22680000
*        Subtype 10 - Service Class Fixed Section             *    @RWA 22690000
*                                                             *    @RWA 22700000
***************************************************************    @RWA 22710000
R84_SRVCLASS  DSECT ,              Service Class Fixed Section     @RWA 22720000
R84_SRVCLEN   DS  F                Length of this section          @RWA 22730000
*                                                                  @RWA 22740000
R84_SRVCNAME  DS  CL8              Service class name              @RWA 22750000
*                                                                  @RWA 22760000
R84_SRVCSMPC  DS  F                Number of samples this          @RWA 22770000
*                                    service class was found       @RWA 22780000
*                                                                  @RWA 22790000
R84_SRVCNXOF  DS  F                Offset from this section        @RWA 22800000
*                                    to the next service           @RWA 22810000
*                                    class fixed section in        @RWA 22820000
*                                    this buffer                   @RWA 22830000
*                                                                  @RWA 22840000
R84_SRVNSYOF  DS  F                Offset from this section to     @RWA 22850000
*                                    the non-system specific       @RWA 22860000
*                                    information for this          @RWA 22870000
*                                    service class.  This will     @RWA 22880000
*                                    be zero if this is a          @RWA 22890000
*                                    continuation buffer for       @RWA 22900000
*                                    system specific               @RWA 22910000
*                                    information.                  @RWA 22920000
*                                                                  @RWA 22930000
R84_SRVSYSOF  DS  F                Offset from this section to     @RWA 22940000
*                                    the system specific           @RWA 22950000
*                                    information for this          @RWA 22960000
*                                    service class in this         @RWA 22970000
*                                    buffer                        @RWA 22980000
*                                                                  @RWA 22990000
R84_SRVCRSV1  DS  4F               Reserved for IBM                @RWA 23000000
*                                                                  @RWA 23010000
R84_SRVCFEND  DS  0F               End of fixed section            @RWA 23020000
R84_SRVCFSIZ  EQU *-R84_SRVCLASS   Size of fixed section           @RWA 23030000
         EJECT ,                                                   @RWA 23040000
***************************************************************    @RWA 23050000
*                                                             *    @RWA 23060000
*        Subtype 10 - Service Class Non-System Specific       *    @RWA 23070000
*                     Section                                 *    @RWA 23080000
*                                                             *    @RWA 23090000
***************************************************************    @RWA 23100000
R84_SRVCNSYS  DSECT ,              Non-System Specific Section     @RWA 23110000
*                                                                  @RWA 23120000
R84_NSYSLEN   DS  F                Length of this section          @RWA 23130000
         SPACE 1                                                   @RWA 23140000
*-------------------------------------------------------------*    @RWA 23150000
*        Start of sampling counts where we track the minimum, *    @RWA 23160000
*        maximum, and average number of jobs.                 *    @RWA 23170000
*-------------------------------------------------------------*    @RWA 23180000
R84_NSYCCNTS  DS  0F               Start of sampling counts        @RWA 23190000
         SPACE 1                                                   @RWA 23200000
*-------------------------------------------------------------*    @RWA 23210000
*        Main service wait and MDS sampling counts.           *    @RWA 23220000
*-------------------------------------------------------------*    @RWA 23230000
R84_MAINW     DS  0F               Main service wait counts        @RWA 23240000
R84_MAINWMIN  DS  F                Minimum count                   @RWA 23250000
R84_MAINWMAX  DS  F                Maximum count                   @RWA 23260000
R84_MAINWAVG  DS  F                Average count                   @RWA 23270000
*                                                                  @RWA 23280000
R84_MDS       DS  0F               MDS counts                      @RWA 23290000
R84_MDSMIN    DS  F                Minimum count                   @RWA 23300000
R84_MDSMAX    DS  F                Maximum count                   @RWA 23310000
R84_MDSAVG    DS  F                Average count                   @RWA 23320000
         SPACE 1                                                   @RWA 23330000
*-------------------------------------------------------------*    @RWA 23340000
*        GMS sampling counts.                                 *    @RWA 23350000
*-------------------------------------------------------------*    @RWA 23360000
R84_GMS       DS  0F               GMS total counts                @RWA 23370000
R84_GMSMIN    DS  F                Minimum count                   @RWA 23380000
R84_GMSMAX    DS  F                Maximum count                   @RWA 23390000
R84_GMSAVG    DS  F                Average count                   @RWA 23400000
*                                                                  @RWA 23410000
R84_MOFNC     DS  0F               Main offline/not connected      @RWA 23420000
R84_MOFNCMIN  DS  F                Minimum count                   @RWA 23430000
R84_MOFNCMAX  DS  F                Maximum count                   @RWA 23440000
R84_MOFNCAVG  DS  F                Average count                   @RWA 23450000
*                                                                  @RWA 23460000
R84_GRPDS     DS  0F               Group disabled                  @RWA 23470000
R84_GRPDSMIN  DS  F                Minimum count                   @RWA 23480000
R84_GRPDSMAX  DS  F                Maximum count                   @RWA 23490000
R84_GRPDSAVG  DS  F                Average count                   @RWA 23500000
*                                                                  @RWA 23510000
R84_JBHLD     DS  0F               Job held                        @RWA 23520000
R84_JBHLDMIN  DS  F                Minimum count                   @RWA 23530000
R84_JBHLDMAX  DS  F                Maximum count                   @RWA 23540000
R84_JBHLDAVG  DS  F                Average count                   @RWA 23550000
*                                                                  @RWA 23560000
R84_CLSDS     DS  0F               Class disabled                  @RWA 23570000
R84_CLSDSMIN  DS  F                Minimum count                   @RWA 23580000
R84_CLSDSMAX  DS  F                Maximum count                   @RWA 23590000
R84_CLSDSAVG  DS  F                Average count                   @RWA 23600000
*                                                                  @RWA 23610000
R84_SCHEN     DS  0F               Scheduling environment is       @RWA 23620000
*                                    not available                 @RWA 23630000
R84_SCHENMIN  DS  F                Minimum count                   @RWA 23640000
R84_SCHENMAX  DS  F                Maximum count                   @RWA 23650000
R84_SCHENAVG  DS  F                Average count                   @RWA 23660000
*                                                                  @RWA 23670000
R84_SPOOL     DS  0F               Spool space shortage            @RWA 23680000
R84_SPOOLMIN  DS  F                Minimum count                   @RWA 23690000
R84_SPOOLMAX  DS  F                Maximum count                   @RWA 23700000
R84_SPOOLAVG  DS  F                Average count                   @RWA 23710000
*                                                                  @RWA 23720000
R84_TDEPT     DS  0F               TDEPTH reached                  @RWA 23730000
R84_TDEPTMIN  DS  F                Minimum count                   @RWA 23740000
R84_TDEPTMAX  DS  F                Maximum count                   @RWA 23750000
R84_TDEPTAVG  DS  F                Average count                   @RWA 23760000
*                                                                  @RWA 23770000
R84_TLIMT     DS  0F               TLIMIT exceeded                 @RWA 23780000
R84_TLIMTMIN  DS  F                Minimum count                   @RWA 23790000
R84_TLIMTMAX  DS  F                Maximum count                   @RWA 23800000
R84_TLIMTAVG  DS  F                Average count                   @RWA 23810000
*                                                                  @RWA 23820000
R84_MDEPT     DS  0F               MDEPTH reached                  @RWA 23830000
R84_MDEPTMIN  DS  F                Minimum count                   @RWA 23840000
R84_MDEPTMAX  DS  F                Maximum count                   @RWA 23850000
R84_MDEPTAVG  DS  F                Average count                   @RWA 23860000
*                                                                  @RWA 23870000
R84_MLIMT     DS  0F               MLIMIT exceeded                 @RWA 23880000
R84_MLIMTMIN  DS  F                Minimum count                   @RWA 23890000
R84_MLIMTMAX  DS  F                Maximum count                   @RWA 23900000
R84_MLIMTAVG  DS  F                Average count                   @RWA 23910000
         SPACE 1                                                   @RWA 23920000
*-------------------------------------------------------------*    @RWA 23930000
*        SYSPLEX sampling counts.                             *    @RWA 23940000
*-------------------------------------------------------------*    @RWA 23950000
R84_PLELG     DS  0F               Number of jobs eligible to      @RWA 23960000
*                                    run anywhere in the           @RWA 23970000
*                                    SYSPLEX                       @RWA 23980000
R84_PLELGMIN  DS  F                Minimum count                   @RWA 23990000
R84_PLELGMAX  DS  F                Maximum count                   @RWA 24000000
R84_PLELGAVG  DS  F                Average count                   @RWA 24010000
*                                                                  @RWA 24020000
R84_PLINE     DS  0F               Number of jobs ineligible       @RWA 24030000
*                                    to run anywhere in the        @RWA 24040000
*                                    SYSPLEX for reasons           @RWA 24050000
*                                    other than class limits       @RWA 24060000
R84_PLINEMIN  DS  F                Minimum count                   @RWA 24070000
R84_PLINEMAX  DS  F                Maximum count                   @RWA 24080000
R84_PLINEAVG  DS  F                Average count                   @RWA 24090000
*                                                                  @RWA 24100000
R84_PLLMT     DS  0F               Number of jobs ineligible       @RWA 24110000
*                                    to run anywhere in the        @RWA 24120000
*                                    SYSPLEX because of            @RWA 24130000
*                                    class limits                  @RWA 24140000
R84_PLLMTMIN  DS  F                Minimum count                   @RWA 24150000
R84_PLLMTMAX  DS  F                Maximum count                   @RWA 24160000
R84_PLLMTAVG  DS  F                Average count                   @RWA 24170000
*                                                                  @RWA 24180000
R84_PLEXE     DS  0F               Number of jobs in execution     @RWA 24190000
*                                    somewhere in the SYSPLEX      @RWA 24200000
R84_PLEXEMIN  DS  F                Minimum count                   @RWA 24210000
R84_PLEXEMAX  DS  F                Maximum count                   @RWA 24220000
R84_PLEXEAVG  DS  F                Average count                   @RWA 24230000
         SPACE 1                                                   @RWA 24240000
R84_NSYSRSV1  DS  6F               Reserved for IBM                @RWA 24250000
         SPACE 1                                                   @RWA 24260000
*-------------------------------------------------------------*    @RWA 24270000
*        End of non-system service class section.             *    @RWA 24280000
*-------------------------------------------------------------*    @RWA 24290000
R84_NSYSEND   DS  0F               End of section                  @RWA 24300000
R84_NSYSSIZE  EQU *-R84_SRVCNSYS   Size of section                 @RWA 24310000
         EJECT ,                                                   @RWA 24320000
***************************************************************    @RWA 24330000
*                                                             *    @RWA 24340000
*        Subtype 10 - Service Class System Specific Section   *    @RWA 24350000
*                                                             *    @RWA 24360000
***************************************************************    @RWA 24370000
R84_SRVCSYS   DSECT ,              System Specific Service         @RWA 24380000
*                                    Class Section                 @RWA 24390000
*                                                                  @RWA 24400000
R84_SYSLEN    DS  F                Length of this section          @RWA 24410000
*                                                                  @RWA 24420000
R84_SYSNXOF   DS  F                Offset of next system           @RWA 24430000
*                                    specific information for      @RWA 24440000
*                                    this service class in         @RWA 24450000
*                                    this buffer                   @RWA 24460000
*                                                                  @RWA 24470000
R84_SYSNAME   DS  CL8              System name                     @RWA 24480000
*                                                                  @RWA 24490000
R84_SYELG     DS  0F               Number of jobs eligible to      @RWA 24500000
*                                    run on this system            @RWA 24510000
R84_SYELGMIN  DS  F                Minimum count                   @RWA 24520000
R84_SYELGMAX  DS  F                Maximum count                   @RWA 24530000
R84_SYELGAVG  DS  F                Average count                   @RWA 24540000
*                                                                  @RWA 24550000
R84_SYINE     DS  0F               Number of jobs ineligible       @RWA 24560000
*                                    to run on this system         @RWA 24570000
R84_SYINEMIN  DS  F                Minimum count                   @RWA 24580000
R84_SYINEMAX  DS  F                Maximum count                   @RWA 24590000
R84_SYINEAVG  DS  F                Average count                   @RWA 24600000
*                                                                  @RWA 24610000
R84_SYEXE     DS  0F               Number of jobs in execution     @RWA 24620000
*                                    on this system                @RWA 24630000
R84_SYEXEMIN  DS  F                Minimum count                   @RWA 24640000
R84_SYEXEMAX  DS  F                Maximum count                   @RWA 24650000
R84_SYEXEAVG  DS  F                Average count                   @RWA 24660000
*                                                                  @RWA 24670000
R84_SYSRSVD1  DS  6F               Reserved for IBM                @RWA 24680000
*                                                                  @RWA 24690000
R84_SYSEND    DS  0F               End of system specific          @RWA 24700000
*                                    section                       @RWA 24710000
R84_SYSSIZE   EQU *-R84_SRVCSYS    Size of system specific         @RWA 24720000
*                                    section                       @RWA 24730000
         MEXIT ,                                                   @RWA 24740000
         MEND                                                           99999999
