*%GOTO IAZPRO26;         /*                                             00100000
         MACRO                                                          00200000
         IAZSMF26 ,                                                  */ 00300000
*%IAZPRO26: ;                                                           00400000
*/********************************************************************/ 00500000
*/*MODULE NAME = IAZSMF26                                            */ 00600000
*/*                                                                  */ 00700000
*/*DESCRIPTIVE NAME = JES SMF PURGE RECORD                           */ 00800000
*/********************************************************************/ 00900000
*%GOTO IAZ26;                                                        /* 01000000
.*                                                                   *  01600000
.* COPYRIGHT = LICENSED MATERIALS-PROPERTY OF IBM                    *  01610000
.*             THIS MACRO IS "RESTRICTED MATERIALS OF IBM"           *  01620000
.*             5647-A01 (C) COPYRIGHT IBM CORP 1983, 2000            *  01630000
.*                                                                   *  01640000
.*  STATUS = HBB7703                                                 *  01700000
.*                                                                   *  01800000
.*01* EXTERNAL CLASSIFICATION:  NONE                                 *  01810000
.*01* END OF EXTERNAL CLASSIFICATION:                                *  01820000
.*                                                                   *  01830000
.*  MODULE TYPE = MACRO                                              *  01900000
.*                                                                   *  02000000
.*  INVOCATION =                                                     *  02100000
.*               BAL  - IAZSMF26 (NO DSECT CREATED - START OF RECORD *  02200000
.*                       IS AT SMFRCD26 )                            *  02300000
.*               PL/S - %INCLUDE SYSLIB(IAZSMF26)                    *  02400000
.*                      DCL SMF26PTR PTR                             *  02500000
.*                                                                   *  02510000
.* CHANGE ACTIVITY:                                                  *  02600000
.*                                                                   *  02700000
.*                MVS/SP RELEASE 3 LEVEL 3 (SP1.3.3,JBB1329,JBB2125) *  02800000
.*                THIS MACRO ADDED TO SC141 VIA OZ81648              *  02810000
.* $R042449=10X      HJE4430 920504 J_K2: SMF 26 Additions            * 02820000
.*                                                                   *  02830000
.* $R04LWLM=WLM      HJE6604 970128 J_K2: Queue Management           *  02840000
.* $R04LWLM=WLM      HJE6604 970203 J_K2: WLM job queue support      *  02850000
.* $R04LWLM=WLM      HJE6604 970317 J_K2: Misc fixes                 *  02860000
.* $R04P596=WLM      HJE6604 970429 J_K2: SCHENV -> SMF 26           *  02870000
.*                                                                   *  02880000
.* $R10P377=BASEQ    HJE7703 000302 J_K2: PLX fixes                  *  02890000
.*                                                                   *  02900000
.* A000000-999999    CREATED FOR MVS 1.3.3                        @133  02910000
.*********************************************************************  03000000
         SPACE 2                                                        03100000
* SWITCH TO DETERMINE WHETHER TO GENERATE EQUATES FOR WRITING REC       03200000
         GBLB  &EQUSW                                                   03300000
         SPACE 1                                                        03400000
* THIS RECORD IS WRITTEN WHEN A JOB IS READY TO BE PURGED FOR           03500000
* BOTH FOREGROUND AND BACKGROUND JOBS IN THE SYSTEM.                    03600000
         DS    0F       ALIGN TO FULL WORD BOUNDRY                      03700000
SMFRCD26 EQU   *        START OF RECORD                                 03800000
SMF26PTR EQU   *        HEADER SEGMENT  (LGTH 46 WITHOUT RDW)  @OZ82688 03900000
SMF26LEN DS    BL2      RECORD LENGTH                                   04000000
SMF26SEG DS    BL2      SEGMENT DESCRIPTOR                              04100000
SMF26FLG DS    BL1      HEADER FLAG BYTE                                04200000
SMF26RTY DS    BL1      RECORD TYPE 26                                  04300000
SMFJ26   EQU   26          PURGE RECORD TYPE                   @OZ82688 04400000
SMF26TME DS    BL4      TOD FROM TIME MACRO BINARY                      04500000
SMF26DTE DS    PL4      DATE FROM TIME MACRO                            04600000
SMF26SID DS    CL4      SYSTEM INDICATOR                                04700000
SMF26JBN DS    CL8      JOB NAME                                        04800000
SMF26RST DS    BL4      RDR START TIME, TIME JOB CARD 1ST READ          04900000
SMF26RSD DS    PL4      READER START DATE                               05000000
SMF26UIF DS    CL8      USER IDENTIFICATION FIELD                       05100000
SMF26RSV DS    BL4      RESV                                            05200000
SMF26SBS DS    BL2      SUBSYSTEM GENERATING ID(JES2=2, JES3=5)         05300000
SMF26HSP EQU   X'0002'     JES2 ID                                      05400000
SMF26IND DS    BL2      INDICATORS                                      05500000
SMF26DES EQU   X'8000'  DESCRIPTIVE SECTION PRESENT                     05600000
SMF26EVT EQU   X'4000'  EVENT SECTION PRESENT                           05700000
SMF26ATU EQU   X'2000'  ACTUALS SECTION PRESENT                         05800000
SMF26NTW EQU   X'1000'  NETWORK SECTION PRESENT                         05900000
SMF26J2R EQU   X'0800'  JES2 ROUTING SECTION PRESENT                    06000000
SMF26JXP EQU   X'0400'  JES PRINTER SECTION  PRESENT                    06100000
SMF26SPL EQU   X'0200'  JES2 SPOOL USE SECTION PRESENT                  06200000
SMF26ACP EQU   X'0100'  Triplets Section present               @R042449 06210000
* BEGINNING OF DESCRIPTIVE SECTION                                      06300000
SMF26LN1 DS    BL2      LGTH OF THIS SECTION INCLUDING SELF             06400000
SMF26RV1 DS    BL2      RESV                                            06500000
SMF26IN2 DS    BL1      ADDITIONAL JOB INFORMATION(JES2 ONLY)           06600000
SMF26BCH EQU   X'80'    BIT 0 - BACKGROUND BATCH                        06700000
SMF26FTS EQU   X'40'    1 - FOREGROUND TIME SHARING                     06800000
SMF26STK EQU   X'20'    2 - SYSTEM TASK                                 06900000
SMF26NOJ EQU   X'10'    3 - NO JOURNAL OPTION                           07000000
SMF26NOU EQU   X'08'    4 - NO OUTPUT OPTION                            07100000
SMF26SCN EQU   X'04'    5 - TYPRUN=SCAN                                 07200000
SMF26CPY EQU   X'02'    6 - TYPRUN=COPY                                 07300000
SMF26JBF EQU   X'01'    7 - RESTART=Y                                   07400000
         ORG   SMF26IN2                                                 07500000
SMF26IN3 DS    BL1      ADDITIONAL JOB INFORMATION(JES3 ONLY)           07600000
SMF26DJC EQU    X'80'   BIT 0 - DEPENDENT JOB(//*NET JOB                07700000
*                           PROCESSED)                                  07800000
SMF26DLJ EQU    X'40'   1 - JOB SPECIFIED DEADLINE SCHEDULING           07900000
SMF26DLM EQU    X'20'   2 - DEADLINE JOB MET DEADLINE                   08000000
SMF26PRJ EQU    X'10'   3 - //*PROCESS STMT PROCESSED                   08100000
SMF26NJX EQU    X'08'   4 - JOB LEFT SYSTEM VIA NJP(NETWORK             08200000
*                           JOB PROCESSING)                             08300000
SMF26NJE EQU    X'04'   5 - JOB ENTERED SYSTEM VIA NJP                  08400000
SMF26DJO EQU    X'02'   6 - JOB LEFT SYSTEM VIA DJ(DUMP JOB)            08500000
SMF26DJE EQU    X'01'   7 - JOB ENTERED SYSTEM VIA DJ                   08600000
SMF26INF DS    BL1      JOB INFORMATION                                 08700000
SMF26JCP EQU   X'80'    0 - JOB PRIORITY EXTERNALLY ASSIGNED            08800000
*                          (JES2-VIA /*PRIORITY STMT)                   08900000
*                          (JES3-VIA PRTY PARM ON JOB STMT)             09000000
SMF26STU EQU    X'40'   1 - SETUP JOB                                   09100000
*                          (JES2-/*SETUP STMT PROCESSED)                09200000
*                          (JES3-PROCESSED BY PREEXEC SETUP)            09300000
SMF26TRH EQU    X'20'   2 - JOB HELD VIA TYPERUN=HOLD                   09400000
SMF26NLG EQU    X'10'   3 - JOB REQUESTED NO JES JOB LOG(JES2)          09500000
SMF26XBC EQU    X'08'   4 - EXEC BATCHING JOB (JES2 ONLY)               09600000
SMF26EIR EQU    X'04'   5 - JOB ENTERED VIA INTERNAL RDR                09700000
SMF26MRE EQU    X'02'   6 - JOB WAS RERUN BY JES                        09800000
SMF26OPC EQU    X'01'   7 - OPER CANCELLED JOB BY JES CMND              09900000
SMF26JNM DS    CL4      JES ASSIGNED JOB #                              10000000
SMF26JID DS    CL8      JOB ID OF FORM XXX0YYYY WHERE YYYY IS           10100000
*                       JES ASSIGNED JOB # & XXX IS                     10200000
*                       'JOB' - NORMAL JES JOB                          10300000
*                       'STC' - STARTED TASK CONTROL                    10400000
*                       'TSU' - TSO USER                                10500000
SMF26NAM DS    CL20     PROGRAMMER'S NAME FROM JOB CARD                 10600000
SMF26MSG DS    CL1      MESSAGE CLASS FROM JOB CARD                     10700000
SMF26CLS DS    CL1      JOB CLASS FROM JOB CARD                         10800000
SMF26XPI DS    BL1      INITIAL JOB PRIORITY                            10900000
SMF26XPS DS    BL1      SELECTION PRIORITY AT TIME JOB SELECTED         11000000
SMF26IX2 DS    BL1      Additional JOB information (JES2 ONLY) @R042449 11100000
SMF26JDL EQU   X'80'    Job delayed (at least once) due to             C11110000
                          duplicate jobname                    @R042449 11120000
SMF26JOL EQU   X'40'    Job purged as a result of spool                C11130000
                          offload                              @R042449 11140000
SMF26OPS DS    BL1      Reserved                               @R042449 11200000
SMF26LOC DS    BL2      INPUT ROUTE CODE OR ZERO (JES2 ONLY)            11300000
         ORG   SMF26IX2                                        @R042449 11400000
SMF26RV8 DS    XL4      RESERVED(JES3)                                  11500000
SMF26DEV DS    CL8      LOG INPUT DEV NAME OF WHERE JOB READ            11600000
*                       USERID IF TSO SUBMIT                            11700000
*                       SYSTEM NAME IF NJP                              11800000
SMF26ACT DS    CL4      PROGRAMMER'S ACCOUNTING # (JES2 ONLY)           11900000
SMF26ROM DS    CL4      PROGRAMMER'S ROOM # (JES2 ONLY)                 12000000
         ORG   SMF26ACT                                                 12100000
SMF26RVA DS    XL8      RESERVED(JES3)                                  12200000
SMF26XTM DS    BL4      ESTIMATED EXECUTION TIME(SEC)                   12300000
SMF26ELN DS    BL4      ESTIMATED OUTPUT LINES                          12400000
SMF26EPU DS    BL4      ESTIMATED OUTPUT PUNCHED CARDS                  12500000
*                                                                       12600000
SMF26J2D EQU   *        JES2 ONLY DESCRIPTIVE SECTION                   12700000
SMF26FRM DS    CL4      DEFAULT OUTPUT FORM #                           12800000
SMF26CYP DS    BL2      PRINT COPY COUNT IF FOR ALL OF JOB              12900000
SMF26LIN DS    BL2      LINES PER PAGE                                  13000000
SMF26PRR DS    BL2      DEFAULT PRINT DESTINATION                       13100000
SMF26PUR DS    BL2      DEFAULT PUNCH DESTINATION                       13200000
SMF26PDD DS    CL8      JES2 PROC DDNAME FOR JCL CONVERSION             13300000
         ORG   SMF26J2D                                                 13400000
SMF26J3D EQU   *        JES3 ONLY DESCRIPTIVE SECTION                   13500000
SMF26DTY DS    CL1      DEADLINE SCHEDULE TYPE                          13600000
SMF26RV6 DS    BL3      RESERVED                                        13700000
SMF26IGP DS    CL8      LOG INPUT DEV GROUP NAME(JOB SOURCE)            13800000
SMF26PD3 DS    CL8      PROCEDURE DD NAME                               13900000
SMF26NJO DS    CL8      SYS NAME TO WHICH JOB SENT VIA NJP              14000000
SMF26NJI DS    CL8      SYS FROM WHICH JOB RECEIVED VIA NJP             14100000
SMF26NET DS    CL8      ID OF DEPENDENT JOB NET TO WHICH                14200000
*                       THIS JOB BELONGS(FROM //*NET STMT)              14300000
SMF26DTM DS    BL4      DEADLINE SCHEDULE TIME                          14400000
SMF26DDT DS    PL4      DEADLINE SCHEDULE DATE                          14500000
SMF26CLN DS    CL8      JOB CLASS NAME                                  14600000
* BEGINNING OF EVENT SECTION                                            14700000
         ORG   SMF26LN1 ORG TO BEGIN OF VARIABLE SECTION                14800000
SMF26LN2 DS    BL2      LGTH OF THIS SECTION(INCLUDING SELF   )         14900000
SMF26RV2 DS    BL2      RESV                                            15000000
SMF26RPT DS    BL4      READER STOP TIME                                15100000
SMF26RPD DS    PL4      READER STOP DATE                                15200000
SMF26CST DS    BL4      CONVERTER START TIME                            15300000
SMF26CSD DS    PL4      CONVERTER START DATE                            15400000
SMF26CPT DS    BL4      CONVERTER STOP TIME                             15500000
SMF26CPD DS    PL4      CONVERTER STOP DATE                             15600000
SMF26XST DS    BL4      EXECUTION START TIME                            15700000
SMF26XSD DS    PL4      EXECUTION START DATE                            15800000
SMF26XPT DS    BL4      EXECUTION STOP TIME                             15900000
SMF26XPD DS    PL4      EXECUTION STOP DATE                             16000000
SMF26OST DS    BL4      OUTPUT PROCESSOR START TIME                     16100000
SMF26OSD DS    PL4      OUTPUT PROCESSOR START DATE                     16200000
SMF26OPT DS    BL4      OUTPUT PROCESSOR STOP TIME                      16300000
SMF26OPD DS    PL4      OUTPUT PROCESSOR STOP DATE                      16400000
* BEGINNING OF ACTUALS SECTION                                          16500000
         ORG   SMF26LN1 ORG TO BEGIN OF VARIABLE SECTION                16600000
SMF26LN3 DS    BL2      LGTH OF THIS SECTION(INCLUDING SELF   )         16700000
SMF26RV4 DS    BL2      RESV                                            16800000
SMF26ICD DS    BL4      # OF INPUT CARDS (JCL AND DATA)                 16900000
SMF26XLN DS    BL4      OUTPUT LINES GENERATED TO SPOOL                 17000000
SMF26XPU DS    BL4      OUTPUT PUNCH CARDS GENERATED TO SPOOL           17100000
SMF26RID DS    CL4      INPUT PROCESSOR SYSTEM ID                       17200000
SMF26CID DS    CL4      JCL CONVERSION PROCESSOR SYSTEM ID              17300000
SMF26XID DS    CL4      EXECUTION PROCESSOR SYSTEM ID                   17400000
SMF26OID DS    CL4      OUTPUT PROCESSOR SYSTEM ID                      17500000
SMF26JAF DS    CL42     JOB ACCT FIELDS (MAX. LEN 42)                   17600000
.*     BEGINNING OF JES3 NETWORK SECTION                                17700000
NJEJMR   DS    0F                                                       17800000
NJEJMRID DC    CL8'NJEJMR'                                              17900000
NJEJMRLN DS    H -      LENGTH OF NJEJMR                                18000000
NJEJOBNO DS    H -      ORIGIN NODE JOB NUMBER                          18100000
NJEJOBNM DS    CL8 -    JOB NAME                                        18200000
NJEXEQN  DS    CL8 -    EXECUTION NODE                                  18300000
NJEPRGMR DS    CL20 -   PROGRAMMER NAME                                 18400000
NJEUSRID DS    CL8 -    TSO USER ID                                     18500000
NJEACCT  DS    CL8 -    NETWORK ACCT NUM                                18600000
NJEDEPT  DS    CL8 -    PROGRAMMER DEPT NUM                             18700000
NJEBLDG  DS    CL8 -    PROGRAMMER BLDG NUM                             18800000
NJEROOM  DS    CL8 -    PROGRAMMER ROOM NUM                             18900000
NJEXEQU  DS    CL8 -    EXECUTION USER ID                               19000000
NJETRANS DS    F -      NUM OF XMIT BUFFERS                             19100000
NJEJMREN DS    0F                                                       19200000
NJEJMRSZ DS    0XL(NJEJMREN-NJEJMR)                                     19300000
SMF26SRC DS    CL4      NUMBER OF SPOOL RECORDS                         19400000
*      BEGINNING OF NETWORK SECTION                                     19500000
         ORG   SMF26LN1 ORG TO BEGINNING OF VARIABLE SECTION            19600000
SMF26LN4 DS    BL2      LENGTH OF THIS SECTION(INCLUDING SELF)          19700000
SMF26RV5 DS    BL2      RESERVED                                        19800000
SMF26NID DS    CL4      JOB TRANSMITTER SYSTEM IDENTIFIER               19900000
SMF26NST DS    BL4      JOB TRANSMITTER START TIME                      20000000
SMF26NSD DS    PL4      JOB TRANSMITTER START DATE                      20100000
SMF26NPT DS    BL4      JOB TRANSMITTER STOP TIME                       20200000
SMF26NPD DS    PL4      JOB TRANSMITTER STOP DATE                       20300000
SMF26NAC DS    CL8      NETWORK ACCOUNTING NUMBER                       20400000
SMF26NJB DS    CL8      Original job identification            @R042449 20500000
SMF26NDV DS    CL8      JOB TRANSMITTER DEVICE NAME                     20600000
SMF26NON DS    CL8      Original node name                     @R042449 20700000
SMF26NXN DS    CL8      EXECUTION NODE NAME                             20800000
SMF26NNM DS    CL8      NEXT NODE NAME                                  20900000
SMF26NLN DS    CL8      LAST NODE NAME                                  21000000
SMF26SUI DS    CL8      Submitting Userid                      @R042449 21010000
SMF26NN  DS    CL8      JOB End Execution Notify Node          @R042449 21020000
SMF26NU  DS    CL8      Job End Execution Notify Userid        @R042449 21030000
.*     BEGINNING OF  ROUTING SECTION                                    21100000
         ORG   SMF26LN1 ORG TO BEGINNING OF VARIABLE SECTION            21200000
SMF26LN5 DS    BL2      LGTH OF THIS SECTION                            21300000
SMF26INR DS    CL4      INPUT ROUTING                                   21400000
SMF26PRD DS    CL4      DEFAULT PRINT DESTINATION                       21500000
SMF26PUD DS    CL4      DEFAULT PUNCH DESTINATION                       21600000
.*     BEGINNING OF  PRINT SECTION                                      21700000
         ORG   SMF26LN1 ORG TO BEGINNING OF VARIABLE SECTION            21800000
SMF26LN6 DS    BL2      LGTH OF THIS SECTION                            21900000
SMF26EBT DS    CL4      ESTIMATED BYTE COUNT                            22000000
SMF26XBT DS    CL4      ACTUAL BYTE COUNT                               22100000
SMF26EPG DS    CL4      ESTIMATED PAGE COUNT                            22200000
SMF26XPG DS    CL4      ACTUAL PAGE COUNT                               22300000
SMF26EFM DS    CL8      EXPANDED FORMS ID                               22400000
         SPACE 1                                               @R042449 22402000
************************************************************** @R042449 22404000
*                                                            * @R042449 22406000
*        This is the header for all future extensions to the * @R042449 22408000
*        SMF 26 record.  Sections beyond this point must be  * @R042449 22410000
*        accessed by using the values stored in the triplets * @R042449 22412000
*        (below) that contain the offset, length, and number * @R042449 22414000
*        of sections of the type corresponding to the triplet* @R042449 22416000
*        New sections will be appended to this header and    * @R042449 22418000
*        their presence can be detected by an increase in the* @R042449 22420000
*        number of triplets and by a non-zero section offset,* @R042449 22422000
*        length and number of sections.                      * @R042449 22424000
*                                                            * @R042449 22426000
************************************************************** @R042449 22428000
         SPACE 1                                               @R042449 22430000
         ORG   SMF26LN1 Org to beginning of variable section   @R042449 22432000
SMF26LN7 DS    BL2      Length of triplet section              @R042449 22434000
SMF26OAG DS    FL4      Offset of accounting section           @R042449 22436000
SMF26LAG DS    BL2      Length of accounting section           @R042449 22438000
SMF26NAG DS    BL2      Number of accounting sections          @R042449 22440000
SMF26OWL DS    FL4      Offset of Work Load Manager section    @R04LWLM 22440100
SMF26LWL DS    BL2      Length of Work Load Manager section    @R04LWLM 22440400
SMF26NWL DS    BL2      Number of Work Load Manager sections   @R04LWLM 22440700
.*     Beginning of Work Load Manager section                  @R04LWLM 22441000
         SPACE 1                                               @R04LWLM 22441300
SMF26WCL DS    CL8      Service class queue name               @R04LWLM 22441600
SMF26WOC DS    CL8      Original Service class                 @R04LWLM 22441900
SMF26WIN DS    B        Indicators                             @R04LWLM 22442200
SMF26WLM EQU   B'10000000'  Job ran in MODE=WLM                @R04LWLM 22442500
SMF26SJB EQU   B'01000000'  Job ran because of $S J            @R04LWLM 22442800
         SPACE 1                                               @R04LWLM 22443100
SMF26WJC DS    CL8      Eight character job class              @R04LWLM 22443400
SMF26WSE DS    CL16     Scheduling environment (SCHENV)        @R04P596 22443500
.*     Beginning of Accounting Section                         @R042449 22443700
         SPACE 1                                               @R042449 22444000
SMF26LN8 DS    BL2      Length of Accounting Section           @R042449 22446000
SMF26NRA DS    FL1      Number of accounting pairs that follow @R042449 22448000
         SPACE 1                                               @R042449 22450000
************************************************************** @R042449 22452000
*                                                            * @R042449 22454000
*        Accounting pairs are of the form:                   * @R042449 22456000
*                                                            * @R042449 22458000
*          AL1(length),C'string of length "length"'          * @R042449 22460000
*                                                            * @R042449 22462000
*        A length of 0 indicates an omitted field            * @R042449 22464000
*                                                            * @R042449 22466000
************************************************************** @R042449 22468000
         SPACE 1                                               @R042449 22470000
SMF26AC1 DS    0FL1,0C                                         @R042449 22472000
         SPACE 2                                                        22500000
         AIF (NOT &EQUSW).SKIP                                          22600000
*      LENGTH EQUATES                                                   22700000
SMF26L1  EQU   SMF26PDD+L'SMF26PDD-SMF26LN1  DESCRIPTIVE SECT LEN       22800000
SMF26L2  EQU   SMF26OPD+L'SMF26OPD-SMF26LN2  EVENT SECTION LENGTH       22900000
SMF26L3  EQU   SMF26OID+L'SMF26OID-SMF26LN3  ACTUALS SECTION LEN        23000000
SMF26L4  EQU   SMF26NU+L'SMF26NU-SMF26LN4    NETWORK SECTION LEN       C23100000
                                                               @R042449 23110000
SMF26L5  EQU   SMF26PUD+L'SMF26PUD-SMF26LN5  ROUTING SECTION LEN        23200000
SMF26L6  EQU   SMF26EFM+L'SMF26EFM-SMF26LN6  PRINT SECTION LEN          23300000
SMF26L7  EQU   SMF26NWL+L'SMF26NWL-SMF26LN7  Triplets sect len @OW29442 23310000
SMF26L9  EQU   SMF26WSE+L'SMF26WSE-SMF26WCL  WLM section len   @R04P596 23320000
         SPACE 1                                               @OW31833 23324000
************************************************************** @OW31833 23328000
*                                                            * @OW31833 23332000
*        SMF26L10 is used for the total length of the        * @OW31833 23336000
*        triplet section and any fixed length section that   * @OW31833 23340000
*        may follow.  This equate is used to ensure          * @OW31833 23344000
*        compatability between a low level JES assembled     * @OW31833 23348000
*        with a higher level BCP maclib.  For example, a     * @OW31833 23352000
*        HJE5520 JES2 assembled with a JBB6604 BCP will      * @OW31833 23356000
*        include the WLM triplet section as part of the      * @OW31833 23360000
*        SMF26L10 equate.  If new triplet sections are added * @OW31833 23364000
*        in the future, the SMF26L10 equate must be changed  * @OW31833 23368000
*        to add the length of the new section.               * @OW31833 23372000
*                                                            * @OW31833 23376000
************************************************************** @OW31833 23380000
         SPACE 1                                               @OW31833 23384000
SMF26L10 EQU   SMF26L7+SMF26L9               Triplet + WLM len @OW31833 23388000
SMF26SZ1 EQU   L'SMF26JBN+L'SMF26RST+L'SMF26RSD  LENGTH OF JOB NAME,   C23400000
                             AND RDR START TIME AND DATE FOR MOVE       23500000
SMF26SZ2 EQU   SMF26NLN+L'SMF26NLN-SMF26NID  LEN OF NETWORK FIELDS      23600000
SMF26SZ3 EQU   L'SMF26RPT+L'SMF26RPD  LEN OF RDR FIELDS FOR MOVE        23700000
SMF26SZ4 EQU   L'SMF26PRR+L'SMF26PUR  LEN OF PRPU ROUTES FOR MOVE       23800000
SMF26SZ5 EQU   SMF26NU+L'SMF26NU-SMF26NAC-1 LEN OF NET FIELDS          C23900000
                                                               @R042449 23910000
SMF26LN  EQU   SMF26IND+L'SMF26IND-SMF26LEN  LEN OF BASE + HEADER       24000000
SMF26TLN EQU   SMF26LN+SMF26L1+SMF26L2+SMF26L3+SMF26L4+SMF26L5+SMF26L6 C24100000
                                TOTAL LENGTH OF TYPE 26 RECORD          24200000
.SKIP    ANOP                                                           24300000
         MEND       */                                                  24400000
 %IAZ26:;                                                               24500000
 %  DCL  EQUSW FIXED EXTERNAL; /*SWITCH TO DETERMINE WHETHER TO         24600000
                                 GENERATE EQUATES FOR WRITING REC    */ 24700000
    DCL 1 SMFRCD26 BASED(SMF26PTR) BDY(WORD),                           24800000
 /* RECORD TYPE 26 - JOB PURGE BY SUBSYSTEM                          */ 24900000
 /* WRITTEN WHEN ALL SYSOUT FINISHED FOR JOB(FORE & BACKGROUND)      */ 25000000
        2 SMF26BHD,               /* BEGINING BASE+HDR               */ 25100000
         3 SMF26LEN FIXED(15),    /* RDW RECORD LENGTH               */ 25200000
         3 SMF26SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 25300000
         3 SMF26FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 25400000
         3 SMF26RTY FIXED(8),     /* RECORD TYPE 26                  */ 25500000
         3 SMF26TME FIXED(31) BDY(BYTE), /* TOD RECORD WRITTEN       */ 25600000
         3 SMF26DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 25700000
         3 SMF26SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 25800000
         3 SMF26JBN CHAR(8),      /* JOB NAME                        */ 25900000
         3 SMF26RST FIXED(31) BDY(BYTE), /*READER START TIME(.01 SEC)*/ 26000000
         3 SMF26RSD CHAR(4),      /* READER START DATE               */ 26100000
         3 SMF26UIF CHAR(8),      /* USER IDENTIFICATION FIELD       */ 26200000
         3 SMF26RSV CHAR(4),      /* RESV                            */ 26300000
         3 SMF26SBS FIXED(15),    /* SUBSYSTEM ID, JES2-2 JES3-5     */ 26400000
         3 SMF26IND BIT(16),      /* SECTION INDICATORS              */ 26500000
          5 SMF26DES BIT(1),      /* DESCRIPTIVE SECTION PRESENT     */ 26600000
          5 SMF26EVT BIT(1),      /* EVENT SECTION PRESENT           */ 26700000
          5 SMF26ATU BIT(1),      /* ACTUALS SECTION PRESENT         */ 26800000
          5 SMF26NTW BIT(1),      /* NETWORK SECTION PRESENT         */ 26900000
          5 SMF26J2R BIT(1),      /* ROUTING SECT PRESENT            */ 27000000
          5 SMF26JXP BIT(1),      /* PRINTER SECTION PRESENT         */ 27100000
          5 SMF26SPL BIT(1),      /* JES2 SPOOL USE SECT PRESENT     */ 27200000
          5 SMF26ACP BIT(1),      /* Triplets Section present           27210000
                                                             @PKB2449*/ 27220000
          5 * BIT(8),             /* RESV                            */ 27300000
 /* DESCRIPTIVE SECTION BEGINS                                       */ 27400000
       2 SMF26DS BDY(HWORD),      /* BEGINNING OF DESCR SECT @PKB2449*/ 27500000
         3 SMF26LN1 PTR(15),      /* LGTH OF DESCRIPTIVE SECTION     */ 27600000
         3 SMF26RV1 CHAR(2),      /* RESV                            */ 27700000
         3 SMF26IN2 BIT(8),     /*ADDITIONAL JOB INFO (JES2 ONLY)    */ 27800000
          4 SMF26IN3 BIT(8),    /*   ADDITIONAL JOB INFO (JES3 ONLY) */ 27900000
           5 SMF26BCH BIT(1),   /*  0-BACKGROUND JOB                 */ 28000000
             6 SMF26DJC BIT(1), /*    0-DEPENDENT JOB(NET JOB           28100000
                                                 PROCESSED           */ 28200000
           5 SMF26FTS BIT(1),   /*  1-FOREGROUND TIME SHARING        */ 28300000
             6 SMF26DLJ BIT(1), /*    1-JOB SPECIFIED DEADLINE          28400000
                                            SCHEDULING               */ 28500000
           5 SMF26STK BIT(1),   /*  2-SYSTEM TASK                    */ 28600000
             6 SMF26DLM BIT(1), /*    2-JOB MET DEADLINE             */ 28700000
           5 SMF26NOJ BIT(1),   /*  3-NO JOURNAL OPTION              */ 28800000
             6 SMF26PRJ BIT(1), /*    3-PROCESS STMT PROCESSED       */ 28900000
           5 SMF26NOU BIT(1),   /*  4-NO OUTPUT OPTION               */ 29000000
             6 SMF26NJX BIT(1), /*    4-JOB LEFT SYSTEM VIA NJP      */ 29100000
           5 SMF26SCN BIT(1),   /*  5-TYPRUN=SCAN                    */ 29200000
             6 SMF26NJE BIT(1), /*    5-JOB ENTERED SYS VIA NJP      */ 29300000
           5 SMF26CPY BIT(1),   /*  6-TYPRUN=COPY                    */ 29400000
             6 SMF26DJO BIT(1), /*    6-JOB LEFT SYSTEM VIA DJ       */ 29500000
           5 SMF26JBF BIT(1),   /*  7-RESTART=Y                      */ 29600000
             6 SMF26DJE BIT(1), /*    7-JOB ENTERED SYS VIA DJ       */ 29700000
         3 SMF26INF BIT(8),       /* JOB INFORMATION                 */ 29800000
           5 SMF26JCP BIT(1),     /* 0-JOB PRIORITY EXTERNALLY ASSIGNED 29900000
                                       JES2-VIA  PRIORITY STMT          30000000
                                       JES3-VIA PRTY PARM ON JOB STMT*/ 30100000
           5 SMF26STU BIT(1),     /* 1-SETUP JOB                        30200000
                                       JES2- SETUP STMT PROCESSED       30300000
                                     JES3-PROCESSED BY PRE-EXEC STEUP*/ 30400000
           5 SMF26TRH BIT(1),     /* 2-JOB HELD VIA 'TYPERUN=HOLD'   */ 30500000
           5 SMF26NLG BIT(1),     /* 3-JOB REQUESTED NO JES JOB LOG     30600000
                                       (JES2 ONLY)                   */ 30700000
           5 SMF26XBC BIT(1),     /* 4-EXEC BATCH JOB(JES2)          */ 30800000
           5 SMF26EIR BIT(1),     /* 5-JOB ENTERED VIA INTERNAL RDR  */ 30900000
           5 SMF26MRE BIT(1),     /* 6-JOB WAS RERUN BY JES          */ 31000000
           5 SMF26OPC BIT(1),     /* 7-OPER CANCELED VIA CMND        */ 31100000
         3 SMF26JNM CHAR(4),      /* JES ASSIGNED JOB NUMBER         */ 31200000
         3 SMF26JID CHAR(8),      /*JOB ID OF FORM XXX0YYYY WHERE YYYY  31300000
                                     IS JES ASSIGNED JOB # & XXX IS     31400000
                                     'JOB' - NORMAL JES JOB             31500000
                                     'STC' - STARTED TASK CONTROL       31600000
                                     'TSU' - TSO USER                */ 31700000
         3 SMF26NAM CHAR(20),     /* PROGRAMMER'S NAME FROM JOB CARD */ 31800000
         3 SMF26MSG CHAR(1),      /* MESSAGE CLASS FROM JOB CARD     */ 31900000
         3 SMF26CLS CHAR(1),      /* JOB CLASS FROM JOB CARD         */ 32000000
         3 SMF26XPI FIXED(8),     /* INITIAL JOB PRIORITY            */ 32100000
         3 SMF26XPS FIXED(8),     /* SELECTION PRI AT SELECTION      */ 32200000
         3 SMF26RV8 FIXED(32) BDY(BYTE), /* Reserved (JES3)  @PKB2449*/ 32300000
           5 SMF26IX2 BIT(8),     /* Additional JOB info     @PKB2449*/ 32400000
             7 SMF26JDL BIT(1),   /* Job delayed (at least once)        32410000
                                       due TO duplicate jobname         32420000
                                                             @PKB2449*/ 32430000
             7 SMF26JOL BIT(1),   /* Job purged as a result of          32440000
                                       SPOOL OFFLOAD         @PKB2449*/ 32450000
           5 SMF26OPS FIXED(8),   /*OUTPUT PRI AT SELECTION-JES2 ONLY*/ 32500000
           5 SMF26LOC FIXED(15) BDY(Byte), /* INPUT ROUTE CODE OR 0     32600000
                                                             @PKB2449*/ 32610000
         3 SMF26DEV CHAR(8),      /* LOG DEV NAME OF WHERE JOB READ     32700000
                                     USERID IF TSO SUBMIT               32800000
                                     SYSTEM NAME IF NJP              */ 32900000
         3 SMF26RVA CHAR(8),      /* RESERVED (JES3)                 */ 33000000
           5 SMF26ACT CHAR(4),    /* PROGRAMMER'S ACCT #(JES2 ONLY)  */ 33100000
           5 SMF26ROM CHAR(4),    /* PROGRAMMER'S ROOM #(JES2 ONLY)  */ 33200000
         3 SMF26XTM FIXED(31) BDY(BYTE), /* Est Exec Time (Sec)         33300000
                                                             @PKB2449*/ 33310000
         3 SMF26ELN FIXED(31) BDY(BYTE), /* Est Output Lines @PKB2449*/ 33400000
         3 SMF26EPU FIXED(31) BDY(BYTE), /* Est Output cards @PKB2449*/ 33500000
         3 SMF26J2D CHAR(20),     /* JES2 ONLY DESCRIPTIVE SECTION   */ 33600000
           5 SMF26FRM CHAR(4),    /* DEFAULT OUTPUT FORM NUMBER      */ 33700000
           5 SMF26CYP FIXED(15) BDY(BYTE), /* PRINT COPY                33800000
                                     COUNT FOR ALL OF JOB            */ 33900000
           5 SMF26LIN FIXED(15) BDY(BYTE), /* LINES PER PAGE         */ 34000000
           5 SMF26PRR FIXED(15) BDY(BYTE), /* DEFAULT PRINT DESTINATION 34100000
                                              OR ZERO                */ 34200000
           5 SMF26PUR FIXED(15) BDY(BYTE), /* DEFAULT PUNCH DESTINATION 34300000
                                              OR ZERO                */ 34400000
           5 SMF26PDD CHAR(8);    /* JES2 PROC DDN - JCL CNVT        */ 34500000
 DCL 1 SMF26J3D BASED(ADDR(SMF26J2D)),                    /*         */ 34600000
         3 SMF26DTY CHAR(1),      /* DEADLINE SCHEDULE TYPE          */ 34700000
         3 SMF26RV6 CHAR(3),      /* RESERVED                        */ 34800000
         3 SMF26IGP CHAR(8),      /* LOG INPUT DEV GP NAM(JOB SOURCE)*/ 34900000
         3 SMF26PD3 CHAR(8),      /* PROCEDURE DD NAME               */ 35000000
         3 SMF26NJO CHAR(8),      /* SYS NAME WHERE JOB SENT VIA NJP */ 35100000
         3 SMF26NJI CHAR(8),      /* SYS WHICH SENT JOB VIA NJP      */ 35200000
         3 SMF26NET CHAR(8),      /* ID OF DEPENDENT JOB NET TO WHICH   35300000
                                    THIS JOB BELONGS(FROM // NET STMT   35400000
                                                             @PKB2449*/ 35410000
         3 SMF26DTM FIXED(31) BDY(BYTE),   /*DEADLINE SCH TOD        */ 35500000
         3 SMF26DDT CHAR(4),      /* DEADLINE SCHEDULE DATE          */ 35600000
         3 SMF26CLN CHAR(8);      /* JOB CLASS NAME                  */ 35700000
 /* EVENT SECTION BEGINS HERE                                        */ 35800000
    DCL 1 SMF26A BASED(ADDR(SMF26LN1)+SMF26LN1) BDY(WORD),              35900000
         3 SMF26LN2 PTR(15),      /* LGTH OF EVENT SECTION           */ 36000000
         3 SMF26RV2 CHAR(2),      /* RESV                            */ 36100000
         3 SMF26RPT FIXED(31),    /* TOD READER STOP                 */ 36200000
         3 SMF26RPD CHAR(4),      /* READER STOP DATE                */ 36300000
         3 SMF26CST FIXED(31),    /* TOD CNVT START                  */ 36400000
         3 SMF26CSD CHAR(4),      /* CNVT START DATE                 */ 36500000
         3 SMF26CPT FIXED(31),    /* TOD CNVT STOP                   */ 36600000
         3 SMF26CPD CHAR(4),      /* CNVT STOP DATE                  */ 36700000
         3 SMF26XST FIXED(31),    /* TOD EXEC START                  */ 36800000
         3 SMF26XSD CHAR(4),      /* EXEC START DATE                 */ 36900000
         3 SMF26XPT FIXED(31),    /* TOD EXEC STOP                   */ 37000000
         3 SMF26XPD CHAR(4),      /* EXEC STOP DATE                  */ 37100000
         3 SMF26OST FIXED(31),    /* TOD OUTPUT PROCESSOR START      */ 37200000
         3 SMF26OSD CHAR(4),      /* OUTPUT PROCESSOR START DATE     */ 37300000
         3 SMF26OPT FIXED(31),    /* TOD OUTPUT PROCESSOR STOP       */ 37400000
         3 SMF26OPD CHAR(4);      /* OUTPUT PROCESSOR STOP DATE      */ 37500000
 /* ACTUALS SECTION BEGINS HERE                                      */ 37600000
    DCL 1 SMF26B BASED(ADDR(SMF26LN2)+SMF26LN2) BDY(WORD),              37700000
         3 SMF26LN3 PTR(15),      /* LGTH OF ACTUALS SECTION         */ 37800000
         3 SMF26RV4 CHAR(2),      /* RESV                            */ 37900000
         3 SMF26ICD FIXED(31),    /* # INPUT CARDS(JCL + DATA)       */ 38000000
         3 SMF26XLN FIXED(31),    /* OUTPUT LINES GENERATER TO SPOOL */ 38100000
         3 SMF26XPU FIXED(31),    /* OUTPUT PUNCH CARDS GEN TO SPOOL */ 38200000
         3 SMF26RID CHAR(4),    /* INPUT PROCESSOR SYSTEM ID         */ 38300000
         3 SMF26CID CHAR(4),      /* JCL CONVERSION PROCESSOR           38400000
                                    SYSTEM ID @Z30AQPF*/                38500000
         3 SMF26XID CHAR(4),  /* EXECUTION PROCESSOR SYS ID         */  38600000
         3 SMF26OID CHAR(4),  /* OUTPUT PROCESSOR SYSTEM ID         */  38700000
         3 SMF26JAF CHAR(42), /* JOB ACCT FIELDS(MAX LEN 42)        */  38800000
 /* JES3 NETWORKING SECTION STARTS HERE                              */ 38900000
         3 NJEJMR BDY(BYTE),    /*                                   */ 39000000
            5 NJEJMRID   CHAR(8), /*                                 */ 39100000
            5 NJEJMRLN   FIXED(15) BDY(BYTE), /*                        39200000
                                       LENGTH OF NJEJMR              */ 39300000
            5 NJEJOBNO   FIXED(15) BDY(BYTE), /*                        39400000
                                       ORIGIN NODE JOB NUM           */ 39500000
            5 NJEJOBNM   CHAR(8), /* JOB NAME                        */ 39600000
            5 NJEXEQN    CHAR(8), /* EXECUTION NODE                  */ 39700000
            5 NJEPRGMR   CHAR(20), /* PROGRAMMER NAME                */ 39800000
            5 NJEUSRID   CHAR(8), /* TSO USER ID                     */ 39900000
            5 NJEACCT    CHAR(8), /* NETWORK ACCT NUM                */ 40000000
            5 NJEDEPT    CHAR(8), /* PROGRAMMER DEPT NUM             */ 40100000
            5 NJEBLDG    CHAR(8), /* PROGRAMMER BLDG NUM             */ 40200000
            5 NJEROOM    CHAR(8), /* PROGRAMMER ROOM NUM             */ 40300000
            5 NJEXEQU    CHAR(8), /* EXECUTION USER ID               */ 40400000
            5 NJETRANS   FIXED(31) BDY(BYTE), /*                        40500000
                                      NUM OF XMIT BUFFERS            */ 40600000
         3 SMF26SRC CHAR(4);    /* NUMBER OF SPOOL RECORDS           */ 40700000
 /*    BEGINNING OF NETWORK SECTION                                  */ 40800000
  DCL 1 SMF26C BASED(ADDR(SMF26LN3)+SMF26LN3) BDY(WORD), /*          */ 40900000
        3 SMF26LN4 PTR(15),   /* LENGTH OF THIS SECTION              */ 41000000
        3 SMF26RV5 CHAR(2),   /* RESERVED                            */ 41100000
      2 SMF26NF,              /* START OF NETWORK FIELDS             */ 41200000
        3 SMF26NID CHAR(4),   /* JOB TRANSMITTER SYSTEM ID.          */ 41300000
        3 SMF26NST FIXED(31), /* JOB TRANSMITTER START TIME          */ 41400000
        3 SMF26NSD CHAR(4),   /* JOB TRANSMITTER START DATE          */ 41500000
        3 SMF26NPT FIXED(31), /* JOB TRANSMITTER STOP TIME           */ 41600000
        3 SMF26NPD CHAR(4),   /* JOB TRANSMITTER STOP DATE           */ 41700000
      2 SMF26LNF,             /* USED FOR LEN NET FIELDS             */ 41800000
        3 SMF26NAC CHAR(8),   /* NETWORK ACCOUNTING NUMBER           */ 41900000
        3 SMF26NJB CHAR(8),   /* Original job identifier     @PKB2449*/ 42000000
        3 SMF26NDV CHAR(8),   /* JOB TRANSMITTER DEVICE NAME         */ 42100000
        3 SMF26NON CHAR(8),   /* Original  node name         @PKB2449*/ 42200000
        3 SMF26NXN CHAR(8),   /* EXECUTION NODE NAME                 */ 42300000
        3 SMF26NNM CHAR(8),   /* NEXT NODE NAME                      */ 42400000
        3 SMF26NLN CHAR(8),   /* LAST NODE NAME              @PKB2449*/ 42500000
        3 SMF26SUI CHAR(8),   /* Submitting Userid           @PKB2449*/ 42510000
        3 SMF26NN  CHAR(8),   /* JOB End Exec Notify Node    @PKB2449*/ 42520000
        3 SMF26NU  CHAR(8);   /* JOB End Exec Notify Userid  @PKB2449*/ 42530000
 /* ROUTING SECTION BEGINS HERE                                      */ 42600000
  DCL 1 SMF26D BASED(ADDR(SMF26LN4)+SMF26LN4) BDY(WORD), /*          */ 42700000
        3 SMF26LN5 FIXED(15),  /* LENGTH OF THIS SECTION             */ 42800000
        3 SMF26INR CHAR(4),    /* INPUT ROUTING                      */ 42900000
        3 SMF26PRD CHAR(4),    /* DEFAULT PRINT DEST                 */ 43000000
        3 SMF26PUD CHAR(4);    /* DEFAULT PUNCH DEST                 */ 43100000
   /* PRINT SECTION STARTS HERE                                      */ 43200000
  DCL 1 SMF26P BASED(ADDR(SMF26LN5)+SMF26LN5) BDY(WORD), /*          */ 43300000
        3 SMF26LN6 FIXED(15),  /* LENGTH OF THIS SECTION             */ 43400000
        3 SMF26EBT FIXED(31) BDY(HWORD), /* ESTIMATED # OF BYTES     */ 43500000
        3 SMF26XBT FIXED(31) BDY(HWORD), /* ACTUAL # OF BYTES        */ 43600000
        3 SMF26EPG FIXED(31) BDY(HWORD), /* ESTIMATED # OF PAGES     */ 43700000
        3 SMF26XPG FIXED(31) BDY(HWORD), /* ACTUAL # OF PAGES        */ 43800000
        3 SMF26EFM CHAR(8);              /* EXPANDED FORMS ID        */ 43900000
   /* Triplet section starts here                            @PKB2449*/ 43904000
 Dcl  1 SMF26TRP BASED(ADDR(SMF26LN6)+SMF26LN6),           /*@PKB2449*/ 43911000
        3 SMF26LN7 FIXED(15),    /* Length of this section   @PKB2449*/ 43918000
        3 SMF26OAG FIXED(31) BDY(BYTE), /*  Offset of                   43925000
                                            Acct section     @PKB2449*/ 43932000
        3 SMF26LAG FIXED(15), /* Length of Acct section      @PKB2449*/ 43939000
        3 SMF26NAG FIXED(15), /* Number of Acct sections     @R10P377*/ 43946000
        3 SMF26OWL FIXED(31) BDY(BYTE), /*  Offset of                   43946400
                                            WLM SECTION      @R04LWLM*/ 43947000
        3 SMF26LWL FIXED(15), /* Length of WLM section       @R04LWLM*/ 43947600
        3 SMF26NWL FIXED(15); /* Number of WLM sections      @R04LWLM*/ 43948200
   /* Work Load Manager section starts here                  @R04LWLM*/ 43948800
 Dcl  1 SMF26AB Based(Addr(SMFRCD26)+SMF26OWL),            /*@R10P377*/ 43949400
        3 SMF26WCL CHAR(8),  /* Service class queue name     @R04LWLM*/ 43950000
        3 SMF26WOC CHAR(8),  /* Original service class       @R10P377*/ 43950300
        3 SMF26WIN BIT(8),   /* Indicators                   @R04LWLM*/ 43950600
          5 SMF26WLM BIT(1), /* Job run under WLM Init       @R04LWLM*/ 43951200
          5 SMF26SJB BIT(1), /* Job ran because of $S J      @R04LWLM*/ 43951500
        3 SMF26WJC CHAR(8),  /* Job class                    @R04LWLM*/ 43951800
        3 SMF26WSE CHAR(16); /* SCHENV                       @R10P377*/ 43952400
   /* ACCOUNTING Section starts here                         @PKB2449*/ 43953000
 Dcl  1 SMF26AA Based(Addr(SMFRCD26)+SMF26OAG),            /*@R10P377*/ 43960000
        3 SMF26LN8 Fixed(15), /* Len of this section         @PKB2449*/ 43967000
        3 SMF26NRA Fixed(8), /* Nr of accouting pairs        @PKB2449*/ 43974000
        3 SMF26AC1 Fixed(8); /* Length of first string       @PKB2449*/ 43981000
 %IF EQUSW=0 %THEN %GOTO SKIP26;                                        44000000
 /*    LENGTH EQUATES FOR WRITING THIS SMF RECORD                    */ 44100000
  DCL   SMFJ26 FIXED(8) CONSTANT(26),     /* PURGE RECORD TYPE       */ 44200000
        SMF26L1 FIXED(32) CONSTANT(LENGTH(SMF26DS)),                    44300000
                                         /* LEN DESCRIPTIVE SECT     */ 44400000
        SMF26L2 FIXED(32) CONSTANT(LENGTH(SMF26A)),                     44500000
                                         /* LEN EVENTS SECT          */ 44600000
        SMF26L3 FIXED(32) CONSTANT(LENGTH(SMF26B)-LENGTH(SMF26JAF)),    44700000
                                         /* LEN ACTUALS SECTION      */ 44800000
        SMF26L4 FIXED(32) CONSTANT(LENGTH(SMF26C)),                     44900000
                                         /* LEN NETWORK SECTION      */ 45000000
        SMF26L5 FIXED(32) CONSTANT(LENGTH(SMF26D)),                     45100000
                                         /* LEN ROUTING SECTION      */ 45200000
        SMF26L6 FIXED(32) CONSTANT(LENGTH(SMF26P)),                     45300000
                                         /* LEN PRINT SECTION        */ 45400000
        SMF26SZ1 FIXED(32) CONSTANT(LENGTH(SMF26JBN)+LENGTH(SMF26RST)+  45500000
                             LENGTH(SMF26RSD)),                         45600000
                                         /* LEN JOB NAME RDR START TIME 45700000
                                              AND DATE               */ 45800000
        SMF26SZ2 FIXED(32) CONSTANT(LENGTH(SMF26LNF)+LENGTH(SMF26NET)), 45900000
                                         /* LEN OF NETWRK FIELDS     */ 46000000
        SMF26SZ3 FIXED(32) CONSTANT(LENGTH(SMF26RPT)+LENGTH(SMF26RPD)), 46100000
                                         /* LEN OF RDR FIELDS        */ 46200000
        SMF26SZ4 FIXED(32) CONSTANT(LENGTH(SMF26PRR)+LENGTH(SMF26PUR)), 46300000
                                         /* LEN OF PRPU ROUTES       */ 46400000
        SMF26SZ5 FIXED(32) CONSTANT(LENGTH(SMF26LNF)-1),                46500000
                                         /* LEN OF NET FIELDS        */ 46600000
        SMF26LN FIXED(32) CONSTANT(LENGTH(SMF26BHD)),                   46700000
                                         /* LEN OF BASE + HDR        */ 46800000
        SMF26TLN FIXED(32) CONSTANT(SMF26LN+SMF26L1+SMF26L2+SMF26L3+    46900000
                             SMF26L4+SMF26L5+SMF26L6),                  47000000
                                         /* TOTAL LEN JES2 TY 26     */ 47100000
        SMF26HSP FIXED(32) CONSTANT(2);  /* JES2 ID                  */ 47200000
 %SKIP26:  ;                                                            99999999
