* %GOTO SSSTCMT;              /*                               @R04LSDS 00010000
         MACRO                                                 @R04LSDS 00020000
         IAZSSST &DSECT=NO                                              00030000
*          */                                                  @R04LSDS 00040000
*  %SSSTCMT: ;                                                          00050000
*/**** START OF SPECIFICATIONS ******************************* @R04LSDS 00060000
.****PROPRIETARY-STATEMENT************************************          00070000
.*01* PROPRIETARY STATEMENT:                                 *          00080000
.*                                                           *          00090000
.*    LICENSED MATERIALS-PROPERTY OF IBM                     *          00100000
.*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"            *          00110000
.*    5647-A01 (C) COPYRIGHT IBM CORP 1997, 1999             *          00120000
.*                                                           *          00130000
.*    STATUS:  JBB6607                                       *          00140000
.*                                                           *          00150000
.****END-OF-PROPRIETARY-STATEMENT*****************************          00160000
*                                                            *          00170000
*01* DESCRIPTIVE NAME:  SSOB Extension for Extended Status   *          00180000
*02*  ACRONYM:  IAZSSST                                      *          00190000
*                                                            *          00200000
*01* MACRO NAME:  IAZSSST                                    *          00210000
*                                                            *          00220000
*01* DSECT NAME:  STAT                                       *          00230000
*01* LABEL PREFIX:  STAT                                     *          00240000
*                                                            *          00250000
*01* COMPONENT ID:  JES Common (SC141)                       *          00260000
*                                                            *          00270000
*01* EXTERNAL CLASSIFICATION:                                *          00280000
*02*  GUPI:  BASE                                            *          00290000
*02*  DMTI:  FIELDS                                          *          00300000
*            STATSTRP  STATSTOR  STATSTID  STATSTHL          *          00310000
*            STATSTSP  STATSTPL  STATSTTL  STATSTNX          *          00320000
*            STATSTCP  STATSTBG  STATTRKP  STATTKID          *          00330000
*            STATTKHL  STATTKRS  STATTKR2  STATTKNX          *          00340000
*            STATTKSN  STATTKTK  STATTKPR  STATPERF          *          00350000
*01* END OF EXTERNAL CLASSIFICATION:                         *          00360000
*                                                            *          00370000
*01* EYE-CATCHER:  'STAT'                                    *          00380000
*02*  OFFSET:      4                                         *          00390000
*02*  LENGTH:      4                                         *          00400000
*                                                            *          00410000
*01* STORAGE ATTRIBUTES:                                     *          00420000
*02*  SUBPOOL:  any                                          *          00430000
*02*  KEY:  Key of SSI caller                                *          00440000
*02*  RESIDENCY: Any                                         *          00450000
*                                                            *          00460000
*01* SIZE:                                                   *          00470000
*                                                            *          00480000
*     See STATSIZE equate                                    *          00490000
*                                                            *          00500000
*01* CREATED BY:  Caller of SSI                              *          00510000
*                                                            *          00520000
*01* POINTED TO BY:  SSOBINDV in the IEFSSOBH mapping macro  *          00530000
*                                                            *          00540000
*01* SERIALIZATION: None required                            *          00550000
*                                                            *          00560000
*01* FUNCTION:                                               *          00570000
*                                                            *          00580000
*     Defines the SSOB extension used to request status      *          00590000
*     information for jobs in the JES queue.                 *          00600000
*                                                            *          00610000
*01* METHOD OF ACCESS:                                       *          00620000
*                                                            *          00630000
*02*  ASM:                                                   *          00640000
*      IAZSSST DSECT=YES|NO                                  *          00650000
*                                                            *          00660000
*        DSECT=YES  - Provided DSECT for STAT                *          00670000
*                                                            *          00680000
*        DSECT=NO   - Provides storage definition for STAT   *          00690000
*                                                            *          00700000
*        If DSECT=NO is specified, then you must ensure      *          00710000
*        that label SSOBGN is defined.  This can be          *          00720000
*        accomplished by either using the IEFJSSOB macro     *          00730000
*        to define the SSOB header along with at least one   *          00740000
*        extension.  Otherwise, you must define label        *          00750000
*        SSOBGN immediately following the SSOB header.       *          00760000
*                                                            *          00770000
*02*  PL/X:                                                  *          00780000
*                                                            *          00790000
*        %DCL SSOBST CHAR                                    * @R04LSDS 00800000
*        %SSOBST = 'value'         (see description below)   * @R04LSDS 00810000
*        %INCLUDE SYSLIB(IAZSSST)                            * @R04LSDS 00820000
*                                                            * @R04LSDS 00830000
*        SSOBST is a global variable that determines SSST's  * @R04LSDS 00840000
*        attributes.  The variable should be set to a valid  * @R04LSDS 00850000
*        control block attribute, such as 'BASED(SSOBINDV)'  * @R04LSDS 00860000
*        or '' (null).  The default is '' (null).            * @R04LSDS 00870000
*                                                            *          00880000
*01* DELETED BY:  Caller of SSI                              *          00890000
*                                                            *          00900000
*01* FREQUENCY: 1 per Extended Status SSI request            *          00910000
*                                                            *          00920000
*01* RESTRICTIONS:  None                                     *          00930000
*                                                            *          00940000
*01* NOTES:                                                  *          00950000
*                                                            *          00960000
*        In the following description of fields, the         *          00970000
*        notation before the field description can be one    *          00980000
*        of the following:                                   *          00990000
*                                                            *          01000000
*              I.    Input (appl always supplies information)*          01010000
*              IS    Input (used for selection of jobs)      *          01020000
*              IS*   Same as IS, but field supports wild     *          01030000
*                    cards:                                  *          01040000
*                      * = any zero or more characters       *          01050000
*                      ? = any single character              *          01060000
*              O.    Output (appl receives information)      *          01070000
*                                                            *          01080000
****** END OF SPECIFICATIONS ********************************/          01090000
*/********************************************************************* 01100000
*01* CHANGE ACTIVITY:                                                 * 01110000
* $R03P038=PQC1038  HBB6603 960408 TJW:  Correct alignment            * 01120000
* $R03P660=PQC1660  HBB6603 960626 TJW:  Expand STTRDEVN field        * 01130000
*                                                                     * 01140000
* $R04LSDS=WLM      HJE6604 961202 TJW:  STATUS2 updates - SDSF       * 01150000
* $R04LWLM=WLM      HJE6604 970128 TJW:  WLM Sampling code            * 01160000
* $R04P651=WLM      HJE6604 970619 CLW:  IAZSSST for PTM 150          * 01165000
*                                                                     * 01170000
* $R05LOPI=OPI      HJE6605 970520 JMS:  Macro updates                * 01180000
* $R05P404=OPI      HJE6605 970814 JMS:  Update fields in IAZSSST     * 01220000
*                                                                     * 01221000
* $R07P243=BASEQ    HJE6607 980627 J_K2: Doc units of measure         * 01224000
*                                                                     * 01230000
*01* A000000-999999    CREATED FOR MVS OS 1.3.0                @R03LSTA 01240000
**********************************************************************/ 01250000
*  %GOTO IAZSSST_PLX; /*                                       @R04LSDS 01260000
         SPACE 1                                                        01270000
SSOBESTA EQU   80                  Extended Status ID (SSOBFUNC)        01280000
         SPACE 1                                                        01290000
         AIF   ('&DSECT' EQ 'YES').STAT010                              01300000
         AIF   ('&DSECT' EQ 'NO').STAT020                               01310000
         MNOTE 8,'IAZSSST:  DSECT MUST BE EITHER YES OR NO'             01320000
         AGO   .END                                                     01330000
.STAT010 ANOP                                                           01340000
STAT     DSECT                     SSOB extension mapping - STAT        01350000
         AGO   .STAT030                                                 01360000
.STAT020 ANOP                                                           01370000
         ORG   SSOBGN                                                   01380000
STAT     DS    0D                  SSOB extension mapping - STAT       C01390000
                                                               @R03P038 01400000
.STAT030 ANOP                                                           01410000
*                                                                       01420000
*  Extended Status return codes (SSOBRETN)                              01430000
*                                                                       01440000
STATRTOK EQU   0                   Everything is ok                     01450000
STATINVA EQU   4                   Invalid search arguments             01460000
STATLERR EQU   8                   Logic error (See the reason codes   C01470000
                                     defined for STATREAS)              01480000
STATINVT EQU   12                  Unsupported call type (STATTYPE)     01490000
         SPACE 1                                                        01500000
STATLEN  DC    Y(STATSIZE)         I.Length of status extension         01510000
STATEYE  DC    C'STAT'             I.Eye catcher                        01520000
         SPACE 1                                                        01530000
**************************************************************          01540000
*                                                            *          01550000
*        There are two 2 byte versions for this SSOB         *          01560000
*        extension.  STATVER is the version provided by the  *          01570000
*        caller.  They indicate the level of the control     *          01580000
*        block they are passing to the service.  As new      *          01590000
*        input fields are added to the service, the caller   *          01600000
*        provided version indicates what the service is to   *          01610000
*        consider valid.                                     * @R05LOPI 01620000
*                                                            *          01630000
*        STATVERO is the version information returned from   *          01640000
*        the service.  This implies what fields the service  *          01650000
*        actually examined and what data is returned.  If    *          01660000
*        the service is at a level higher than the level of  *          01670000
*        the caller, STATVERO may be higher than STATVER.    *          01680000
*        In this case, only the fields valid at the STATVER  *          01690000
*        level are actually examined or set.                 *          01700000
*                                                            *          01710000
*        The 2 bytes of version information is a 1 byte      *          01720000
*        level number (changed only when a new release adds  *          01730000
*        significant function) and a 1 byte modifier         *          01740000
*        (changed only when function is added via service).  *          01750000
*                                                            *          01760000
**************************************************************          01770000
         SPACE 1                                                        01780000
STATVER  DC    0FL2'0'             I.SSOB version                       01790000
STATVERL DC    AL1(STATCVRL)           I.SSOB version level             01800000
STATVERM DC    AL1(STATCVRM)           I.SSOB version modifier          01810000
         SPACE 1                                                        01820000
STATV010 EQU   X'0100'               Initial version of macro           01830000
STATV020 EQU   X'0200'               WLM support               @R04LSDS 01840000
STATV030 EQU   X'0300'               Client print support      @R05LOPI 01850000
         SPACE 1                                               @R05LOPI 01860000
STATCVRL EQU   3                     Current version level     @R05LOPI 01870000
STATCVRM EQU   0                     Current version modifier           01880000
         SPACE 1                                                        01890000
STATVERO DC    FL2'0'              O.Subsystem version/modifier         01900000
         SPACE 1                                                        01910000
STATREAS DC    FL1'0'              O.Reason code associated with       C01920000
                                     SSOBRETN value of STATLERR         01930000
STATRDST EQU   4                   STATDEST is not valid                01940000
STATRJBL EQU   8                   STATJBIL is not valid                01950000
STATRJBH EQU   12                  STATJBIH is not valid                01960000
STATRJLM EQU   16                  STATJBIH is less than STATJBIL       01970000
STATRCLS EQU   20                  STATCLSL is not a valid job class    01980000
STATRVOL EQU   24                  STATSVOL is set but STATVOL is null C01990000
                                     or STATVOL specifies an volume    C02000000
                                     serial name that is not valid      02010000
STATRPHZ EQU   28                  STATPHAZ is not valid or not        C02020000
                                     supported on this subsystem        02030000
STATRQUE EQU   32                  Unable to access job queues          02040000
STATREYE EQU   36                  STATEYE is not set to C'STAT'        02050000
STATRLEN EQU   40                  STATLEN is too short                 02060000
STATRJBN EQU   44                  STATJOBN is not a valid job name     02070000
STATROWN EQU   48                  STATOWNR is not a valid userid       02080000
STATRSYS EQU   52                  STATSYS is not a valid system name   02090000
STATRMEM EQU   56                  STATMEMB is not a valid member name  02100000
STATRCST EQU   60                  STATSEL2 specifies to select only   C02110000
                                     non-batch jobs and batch job      C02120000
                                     class filering (STATSCLS) was     C02130000
                                     requested.                         02140000
STATROJB EQU   64                  STATOJBI is not valid                02150000
STATRSEC EQU   68                  STATSECL is not valid                02160000
STATRORG EQU   72                  STATORGN is not valid                02170000
STATRXEQ EQU   76                  STATXEQN is not valid                02180000
STATRPRI EQU   80                  STATPRIO is not valid                02190000
STATRSVC EQU   84                  STATSRVC is not valid       @R04LSDS 02200000
STATRSEN EQU   88                  STATSENV is not valid       @R04LSDS 02210000
STATRSCT EQU   92                  STATCTKN is not valid       @R05LOPI 02220000
STATRSCR EQU   96                  STATSCRE is not valid       @R05LOPI 02230000
STATRSSD EQU   100                 STATSDES is not valid       @R05LOPI 02240000
STATRSSC EQU   104                 STATSCLA is not valid       @R05LOPI 02250000
STATRSXW EQU   108                 STATSWTR is not valid       @R05LOPI 02260000
STATRECJ EQU   112                 STATSCTK & STATSJBI are     @R05LOPIC02270000
                                     mutually exclusive        @R05LOPI 02280000
         SPACE 1                                                        02290000
STATREA2 DC    FL1'00'             Secondary reason code.  This field  C02300000
                                     can be used to further qualify    C02310000
                                     an error.                          02320000
STATTYPE DC    0XL1'00',AL1(STATTERS)  I.Type of call                   02330000
STATTERS EQU   1                   Request type of Terse/Quick @R05LOPIC02340000
                                     data to include only job  @R05LOPIC02350000
                                     level data.  Data         @R05LOPIC02360000
                                     returned requires no I/O  @R05LOPIC02370000
                                     on behalf of the JES.     @R05LOPI 02380000
*        EQU   2                   Reserved for future use              02390000
STATMEM  EQU   3                   Request type of memory management   C02400000
                                     The status support provided by    C02410000
                                     the JES does memory management    C02420000
                                     on behalf of the caller.  When    C02430000
                                     the caller is finished with the   C02440000
                                     results of its Verbose or Terse   C02450000
                                     request, a memory management call C02460000
                                     should be made in order that the  C02470000
                                     memory allocated by the JES on    C02480000
                                     behalf of the caller is released.  02490000
STATOUTT EQU   4                   Request type of Terse/quick @R05LOPIC02500000
                                     data to include           @R05LOPIC02510000
                                     information on SYSOUT.    @R05LOPIC02520000
                                     Data returned requires    @R05LOPIC02530000
                                     no I/O on behalf of the   @R05P404C02540000
                                     JES. (only valid for      @R05LOPIC02550000
                                     STATV030 and above        @R05LOPIC02560000
                                     callers)                  @R05LOPI 02570000
         DC    AL2(0)              Reserved for future use and must    C02580000
                                     be zero                            02590000
         SPACE 1                                                        02600000
**************************************************************          02610000
*                                                            *          02620000
*        STATSTRP is an anchor for use by the subsystems     *          02630000
*        that respond to this request.  It is expected that  *          02640000
*        the caller will set this to zero the FIRST time an  *          02650000
*        SSOB extension is used and from that point on it    *          02660000
*        will be managed by the subsystems.                  *          02670000
*                                                            *          02680000
**************************************************************          02690000
         SPACE 1                                                        02700000
STATSTRP DS    A                   Storage management anchor            02710000
         SPACE 1                                                        02720000
**************************************************************          02730000
*                                                            *          02740000
*        STATTRKP is a chain of diagnostic response areas    *          02750000
*        built by the subsystems.  It contains information   *          02760000
*        about each subsystem that responds to a request     *          02770000
*        (including individual return codes).  It is         *          02780000
*        expected that the caller will set this to zero the  *          02790000
*        FIRST time an SSOB extension is used and from that  *          02800000
*        point on it will be managed by the subsystems.      *          02810000
*                                                            *          02820000
**************************************************************          02830000
         SPACE 1                                                        02840000
STATTRKP DS    A                   Diagnostic response area anchor      02850000
         EJECT                                                          02860000
**************************************************************          02870000
*                                                            *          02880000
*        Begin input-only fields                             *          02890000
*                                                            *          02900000
**************************************************************          02910000
         SPACE 1                                                        02920000
STATSEL1 DC    B'00000000'         IS.Job selection flags               02930000
         SPACE 1                                                        02940000
STATSCLS EQU   B'10000000'           Use STATCLSL as a filter           02950000
STATSDST EQU   B'01000000'           Use STATDEST as a filter           02960000
STATSJBN EQU   B'00100000'           Use STATJOBN as a filter           02970000
STATSJBI EQU   B'00010000'           Use STATJBIL and STATJBIH as      C02980000
                                       filters.  Mutually      @R05LOPIC02990000
                                       exclusive with STATSCTK @R05LOPI 03000000
STATSOJI EQU   B'00001000'           Use STATOJBI as a filter           03010000
STATSOWN EQU   B'00000100'           Use STATOWNR as a filter           03020000
STATSSEC EQU   B'00000010'           Use STATSECL as a filter           03030000
         SPACE 1                                                        03040000
STATSEL2 DC    B'00000000'         IS.More Job selection flags          03050000
STATSSTC EQU   B'10000000'           Select Started Tasks (STCs)       C03060000
                                       (see note in STATSTYP)           03070000
STATSTSU EQU   B'01000000'           Select Time Sharing Users (TSUs)  C03080000
                                       (see note in STATSTYP)           03090000
STATSJOB EQU   B'00100000'           Select batch jobs (JOBs)          C03100000
                                       (see note in STATSTYP)           03110000
STATSAPC EQU   B'00010000'           Select APPC Initiator             C03120000
                                       (see note in STATSTYP)           03130000
*              B'00001111'           Reserved for future JOB types      03140000
*                                      and must be zero                 03150000
STATSTYP EQU   B'11111111'           If none of these bits is on, then C03160000
                                       selection will be as if ALL of  C03170000
                                       the bits are on.                 03180000
         SPACE 1                                                        03190000
STATSEL3 DC    B'00000000'         IS.More job selection flags          03200000
STATSPRI EQU   B'10000000'           Use STATPRIO as a filter           03210000
STATSVOL EQU   B'01000000'           Select Jobs based on the volume   C03220000
                                       serial list in STATVOL           03230000
STATSPHZ EQU   B'00100000'           Use STATPHAZ as a filter           03240000
         SPACE 1                                                        03250000
* Note: If the following two bits are both on or both off then the      03260000
* hold state of the job will not be considered.                         03270000
         SPACE 1                                                        03280000
STATSHLD EQU   B'00010000'           Select jobs which are held         03290000
STATSNHL EQU   B'00001000'           Select jobs which are not held     03300000
STATSSYS EQU   B'00000100'           Select jobs which are     @R03P067C03310000
                                       active on STATSYS       @R03P067 03320000
STATSMEM EQU   B'00000010'           Select jobs which are     @R03P067C03330000
                                       active on STATMEMB      @R03P067 03340000
STATSPOS EQU   B'00000001'           Return queue position     @R04LSDSC03350000
                                       information             @R04LSDS 03360000
         SPACE 1                                                        03370000
STATSEL4 DC    B'00000000'         IS.More job selection flags          03380000
STATSORG EQU   B'10000000'           Use STATORGN as a filter           03390000
STATSXEQ EQU   B'01000000'           Use STATXEQN as a filter           03400000
STATSSRV EQU   B'00100000'           Use STATSRVC as a filter  @R04LSDS 03410000
STATSSEN EQU   B'00010000'           Use STATSENV as a filter  @R04LSDS 03420000
*              B'00001111'           Reserved for future use   @R04LSDS 03430000
         SPACE 1                                                        03440000
STATSSL1 DC    B'00000000'         IS.SYSOUT selection flag    @R05LOPI 03450000
STATSCTK EQU   B'10000000'           Use STATCTKN as a filter. @R05LOPIC03460000
                                      Mutually exclusive with  @R05LOPIC03470000
                                      STATSJBI                 @R05LOPI 03480000
STATSSOW EQU   B'01000000'           Use STATSCRE as a filter  @R05LOPI 03490000
STATSSDS EQU   B'00100000'           Use STATSDES as a filter  @R05LOPI 03500000
STATSSCL EQU   B'00010000'           Use STATSCLA as a filter  @R05LOPI 03510000
STATSSWR EQU   B'00001000'           Use STATSWTR as a filter  @R05LOPI 03520000
         SPACE 1                                               @R05LOPI 03530000
* STATSSHL and STATSSNH refer to the HOLD state of the SYSOUT. @R05LOPI 03540000
* Hold in this case refers to the hold set by HOLD=YES on the  @R05LOPI 03550000
* DD card (or OUTDISP=HOLD on the OUTPUT card).                @R05LOPI 03560000
* Note: If the following two bits are both on or both off then @R05LOPI 03570000
* the hold state of the SYSOUT will not be considered.         @R05LOPI 03580000
         SPACE 1                                               @R05LOPI 03590000
STATSSHL EQU   B'00000100'           Select held SYSOUT        @R05LOPI 03600000
STATSSNH EQU   B'00000010'           Select non-held SYSOUT    @R05LOPI 03610000
*              B'00000001'           Reserved for future use   @R05LOPI 03620000
         DC    1B'00000000'        Reserved for future use and @R05LOPIC03630000
                                     must be zero              @R05LOPI 03640000
         SPACE 1                                                        03650000
STATJOBN DC    CL8' '              IS*.Jobname used for selection (if  C03660000
                                     STATSJBN on).                      03670000
STATJBIL DC    CL8' '              IS.Low jobid used for selection     C03680000
                                     (if STATSJBI on).                  03690000
STATJBIH DC    CL8' '              IS.High jobid used for selection    C03700000
                                      (if STATSJBI on).  This value    C03710000
                                      must be null or at least as high C03720000
                                      as STATJBIL.                      03730000
STATOJBI DC    CL8' '              IS.Original job id for selection    C03740000
                                     (if STATSOJI on).                  03750000
STATOWNR DC    CL8' '              IS*.Owning userid used for          C03760000
                                     selection (if STATSOWN on)         03770000
STATSECL DC    CL8' '              IS*.SECLABEL used for selection     C03780000
                                     (if STATSSEC on)                   03790000
STATDEST DC    CL18' '             IS*.Default print or punch          C03800000
                                     destination value used for        C03810000
                                     selection (if STATSDST on).        03820000
STATORGN DC    CL8' '              IS.Origin node name for selection   C03830000
                                     (if STATSORG on)                   03840000
STATXEQN DC    CL8' '              IS.Execution node name for          C03850000
                                     selection (if STATSXEQ on)         03860000
STATCLSL DC    CL8' '              IS.Job class used for selection.    C03870000
                                     The job class is 1 to 8           C03880000
                                     characters in length               03890000
STATVOL  DC    4CL6' '             IS.List of SPOOL volume serial      C03900000
                                      numbers. When STATSVOL is on,    C03910000
                                      jobs are selected if and only if C03920000
                                      the job has output on at least   C03930000
                                      one of the volumes listed.       C03940000
                                      (JES2 only)                       03950000
STATSYS  DS    CL8' '              IS*.MVS system name where job is    C03960000
                                      active.  Used for selection if   C03970000
                                      STASSYS is on                     03980000
STATMEMB DS    CL8' '              IS*.JES member name where job is    C03990000
                                      active.  Used for selection if   C04000000
                                      STASMEM is on                     04010000
STATPRIO DS    X'00'               IS.Job Priority used for selection  C04020000
                                      (if STATSPRI is on)               04030000
STATPHAZ DC    AL1(*-*)            IS.Job phase.  When STATSPHZ is on  C04040000
                                      jobs are selected if and only if C04050000
                                      they are in this phase.           04060000
         SPACE 1                                                        04070000
**************************************************************          04080000
*                                                            *          04090000
*        Possible values for STATPHAZ                        *          04100000
*                                                            *          04110000
**************************************************************          04120000
         SPACE 1                                                        04130000
*------------------------------------------------------------*          04140000
*                                                            *          04150000
*        The following are job phases that are exist when    *          04160000
*        the job is running under JES3.                      *          04170000
*                                                            *          04180000
*------------------------------------------------------------*          04190000
         SPACE 1                                                        04200000
STAT_NOSUB  EQU 1                    No subchain exists                 04210000
STAT_FSSCI  EQU 2                    Active in CI in an FSS            C04220000
                                      address space                     04230000
STAT_PSCBAT EQU 3                    Awaiting postscan (batch)          04240000
STAT_PSCDSL EQU 4                    Awaiting postscan (demsel)         04250000
STAT_FETCH  EQU 5                    Awaiting volume fetch              04260000
STAT_VOLWT  EQU 6                    Awaiting start setup               04270000
STAT_SYSSEL EQU 7                    Awaiting/active in MDS            C04280000
                                       system select processing         04290000
STAT_ALLOC  EQU 8                    Awaiting resource allocation       04300000
STAT_VOLUAV EQU 9                    Awaiting unavailable VOL(s)        04310000
STAT_VERIFY EQU 10                   Awaiting volume mounts             04320000
STAT_SYSVER EQU 11                   Awaiting/active in MDS            C04330000
                                       system verify processing         04340000
STAT_ERROR  EQU 12                   Error during MDS processing        04350000
STAT_SELECT EQU 13                   Awaiting selection on main         04360000
STAT_ONMAIN EQU 14                   Scheduled on main                  04370000
*           EQU 15                   Reserved (obsolete - ASP)          04380000
*           EQU 16                   Reserved (obsolete - ASP)          04390000
STAT_BRKDWN EQU 17                   Awaiting breakdown                 04400000
STAT_RESTRT EQU 18                   Awaiting MDS restart proc.         04410000
STAT_DONE   EQU 19                   Main and MDS proc. complete        04420000
STAT_OUTPT  EQU 20                   Awaiting output service            04430000
STAT_OUTQUE EQU 21                   Awaiting output service WTR        04440000
STAT_OSWAIT EQU 22                   Awaiting rsvd services             04450000
STAT_CMPLT  EQU 23                   Output service complete            04460000
STAT_DEMSEL EQU 24                   Awaiting selection on main        C04470000
                                      (demand select job)               04480000
STAT_EFWAIT EQU 25                   Ending function rq waiting        C04490000
                                       or i/o completion                04500000
STAT_EFBAD  EQU 26                   Ending function rq not Processed   04510000
STAT_MAXNDX EQU 27                   Maximum rq index value             04520000
         SPACE 1                                                        04530000
*------------------------------------------------------------*          04540000
*                                                            *          04550000
*        The following are job phases that are exist when    *          04560000
*        the job is running under JES2.  Phases that are     *          04570000
*        common between JES2 and JES3 are listed above and   *          04580000
*        commented below.                                    *          04590000
*                                                            *          04600000
*------------------------------------------------------------*          04610000
         SPACE 1                                                        04620000
STAT_INPUT  EQU 128                  Active in input processing         04630000
STAT_WTCONV EQU 129                  Awaiting conversion                04640000
STAT_CONV   EQU 130                  Active in conversion               04650000
*    VOLWT  EQU 6                    Awaiting SETUP                     04660000
STAT_SETUP  EQU 131                  Active in SETUP                    04670000
*    SELECT EQU 13                   Awaiting execution                 04680000
*    ONMAIN EQU 14                   Actively executing                 04690000
STAT_SPIN   EQU 132                  Active in spin                     04700000
STAT_WTBKDN EQU 133                  Awaiting output                    04710000
*    BRKDWN EQU 17                   Active in output                   04720000
*    OUTPT  EQU 20                   Awaiting hardcopy                  04730000
STAT_WTPURG EQU 134                  Awaiting purge                     04740000
STAT_PURG   EQU 135                  Active in purge                    04750000
STAT_RECV   EQU 136                  Active on NJE sysout receiver      04760000
STAT_WTXMIT EQU 137                  Awaiting NJE transmission          04770000
STAT_XMIT   EQU 138                  Active on NJE Job transmitter      04780000
         SPACE 1                                               @R04LSDS 04790000
*------------------------------------------------------------* @R04LSDS 04800000
*                                                            * @R04LSDS 04810000
*        The following are job phases are used for selection * @R04LSDS 04820000
*        (STATPHAZ) and are composits of the other phases.   * @R04LSDS 04830000
*        The output field STTRPHAZ will never indicate a job * @R04LSDS 04840000
*        is in this phase.                                   * @R04LSDS 04850000
*                                                            * @R04LSDS 04860000
*------------------------------------------------------------* @R04LSDS 04870000
         SPACE 1                                               @R04LSDS 04880000
STAT_EXEC   EQU 253                  Job has not completed     @R04LSDSC04890000
                                       execution               @R04LSDS 04900000
STAT_POSTEX EQU 254                  Job has completed         @R04LSDSC04910000
                                       execution               @R04LSDS 04920000
         EJECT ,                                               @R04LSDS 04930000
************************************************************** @R04LSDS 04940000
*                                                            * @R04LSDS 04950000
*        The following fields are only honored if the input  * @R04LSDS 04960000
*        version is at least version 2 and the JES           * @R04LSDS 04970000
*        processing the request is at least at a version 2   * @R04LSDS 04980000
*        level of support.                                   * @R04LSDS 04990000
*                                                            * @R04LSDS 05000000
************************************************************** @R04LSDS 05010000
         SPACE 1                                               @R04LSDS 05020000
STATSRVC DC    CL8' '              IS.WLM service class for    @R04LSDSC05030000
                                     selection (if STATSSRV is @R04LSDSC05040000
                                     on)                       @R04LSDS 05050000
STATSENV DC    CL16' '             IS*.WLM Scheduling environ  @R04LSDSC05060000
                                     for selection (if         @R04LSDSC05070000
                                     STATSSEN is on)           @R04LSDS 05080000
         SPACE 1                                               @R04LSDS 05090000
************************************************************** @R04LSDS 05100000
*                                                            * @R04LSDS 05110000
*        Instead of passing data back to the processing      * @R04LSDS 05120000
*        routine in storage obtained by the subsystem, data  * @R04LSDS 05130000
*        can be passed to a processing routine one block at  * @R04LSDS 05140000
*        a time.  The processing routine is given control in * @R04LSDS 05150000
*        AMODE 31 with a PSW key and supervisor state of the * @R04LSDS 05160000
*        caller of the SSI.  The register convention are as  * @R04LSDS 05170000
*        follows:                                            * @R04LSDS 05180000
*                                                            * @R04LSDS 05190000
*    R0        n/a                                           * @R04LSDS 05200000
*    R1        STATPARM parm list address                    * @R04LSDS 05210000
*    R2-R12    n/a                                           * @R04LSDS 05220000
*    R13       Available save area                           * @R04LSDS 05230000
*    R14       return address                                * @R04LSDS 05240000
*    R15       entry address                                 * @R04LSDS 05250000
*                                                            * @R04LSDS 05260000
*        Note: Even if you use a processing routine, you     * @R04LSDS 05270000
*        still must make a memory management call.           * @R04LSDS 05280000
*                                                            * @R04LSDS 05290000
************************************************************** @R04LSDS 05300000
         SPACE 1                                               @R04LSDS 05310000
STATRTN  DC    A(*-*)              I.Data processing routine   @R04LSDS 05320000
STATRPRM DC    F'0'                I.Routine parameter area    @R04LSDS 05330000
         DC    4F'0'               Reserved for future use and @R04LSDSC05340000
                                     must be zero              @R04LSDS 05350000
         EJECT                                                          05360000
**************************************************************          05370000
*                                                            *          05380000
*        Begin output-only fields                            *          05390000
*                                                            *          05400000
**************************************************************          05410000
         SPACE 1                                                        05420000
STATJOBF DC    A(*-*)              O.Address of first Job Queue        C05430000
                                     Element                            05440000
STATNRJQ DC    F'0'                O.Number of jobs found               05450000
         DC    F'0'                Reserved for future use and @R03P038C05460000
                                     must be zero              @R03P038 05470000
STATPERF DC    D'0'                O.Performance index for last        C05480000
                                     performed request                  05490000
         DC    12F'0'              Reserved for future use and must be C05500000
                                   zero.                                05510000
         DS    0D                  Ensure size Dword aligned   @R03P038 05520000
STATSIZ1 EQU   *-STAT             Original size of SSOB extension       05530000
STATSIZ2 EQU   *-STAT              Version 2 size of SSOB      @R05LOPIC05540000
                                    extension                  @R05LOPI 05550000
         EJECT ,                                               @R05LOPI 05560000
************************************************************** @R05LOPI 05570000
*                                                            * @R05LOPI 05580000
*        Begin SYSOUT input only fields                      * @R05LOPI 05590000
*                                                            * @R05LOPI 05600000
*        The following fields are only honored if the input  * @R05LOPI 05610000
*        version and the JES processing the request are at   * @R05LOPI 05620000
*        a STATV030 or higher level of support.              * @R05LOPI 05630000
*                                                            * @R05LOPI 05640000
************************************************************** @R05LOPI 05650000
         SPACE 1                                               @R05LOPI 05660000
STATCTKN DC    A(*-*)              IS. Address of client token @R05LOPIC05670000
                                     for selection (if         @R05LOPIC05680000
                                     STATSCTK on).             @R05LOPI 05690000
STATSCRE DC    CL8' '              IS*.SYSOUT owner (creator)  @R05LOPIC05700000
                                     for selection (if         @R05LOPIC05710000
                                     STATSSOW is on).          @R05LOPI 05720000
STATSDES DC    CL18' '             IS*.SYSOUT destination      @R05LOPIC05730000
                                     for selection (if         @R05LOPIC05740000
                                     STATSSDS is on).          @R05LOPI 05750000
STATSCLA DC    CL8' '              IS. SYSOUT class for        @R05LOPIC05760000
                                     selection (if STATSSCL    @R05LOPIC05770000
                                     is on).                   @R05LOPI 05780000
STATSWTR DC    CL8' '              IS*.SYSOUT writer name for  @R05LOPIC05790000
                                     selection (if STATSSWR    @R05LOPIC05800000
                                     is on).                   @R05LOPI 05810000
         SPACE 1                                               @R05LOPI 05820000
         DC    32F'0'              Reserved for future use     @R05LOPIC05830000
                                     and must be zero          @R05LOPI 05840000
STATSIZ3 EQU   *-STAT              Version 3 size of SSOB      @R05LOPIC05850000
                                     extension                 @R05LOPI 05860000
STATSIZE EQU   *-STAT             Length of enhanced status SSOB ext    05870000
SSSTLEN8 EQU   SSOBHSIZ+STATSIZE  Total SSOB Length w/ST Ext            05880000
         EJECT ,                                                        05890000
**************************************************************          05900000
*                                                            *          05910000
*        Storage management fields for use by the subsystems *          05920000
*        only.  STATSTRP points to a chain of these control  *          05930000
*        blocks.  All storage will be obtained in KEY 1.     *          05940000
*                                                            *          05950000
**************************************************************          05960000
         SPACE 1                                                        05970000
STATSTOR DSECT ,                   Storage management DSECT             05980000
STATSTID DC    CL8'STATSTOR'       Full eyecatcher                      05990000
STATSTHL DC    AL2(STATSTBG-STATSTOR)  Length of header area            06000000
         DS    AL2                 Reserved for future use              06010000
STATSTSP DS    X                   Subpool of area                      06020000
STATSTPL EQU   230                   Recommended subpool to use         06030000
STATSTTL DS    AL3                 Total length of area (this          C06040000
                                   includes the header)                 06050000
STATSTNX DS    A                   Pointer to next area                 06060000
STATSTCP DS    A                   Pointer to 1st available            C06070000
                                     byte in this area                  06080000
STATSTBG DS    0A                  Start of data area                   06090000
         EJECT ,                                                        06100000
**************************************************************          06110000
*                                                            *          06120000
*        Diagnostic work areas used by the subsystems to     *          06130000
*        return individual return codes for a request.       *          06140000
*        STATTRKP points to a chain of these control blocks. *          06150000
*        Storage is allocated from the normal storage        *          06160000
*        management pool.                                    *          06170000
*                                                            *          06180000
**************************************************************          06190000
         SPACE 1                                                        06200000
STATTRAK DSECT ,                   Diagnostic data DSECT                06210000
STATTKID DC    CL8'STATTRAK'       Full eyecatcher                      06220000
STATTKHL DC    AL2(STATTKND-STATTRAK)  Length of header area            06230000
STATTKVR DS    XL2                 Copy of STATVERO                     06240000
STATTKNX DS    A                   Address of next area                 06250000
STATTKSN DS    CL4                 Subsystem name                       06260000
STATTKRS DS    FL1                 Copy of STATREAS                     06270000
STATTKSK EQU   X'FF'                 Reason code if member skipped      06280000
STATTKR2 DS    FL1                 Copy of STATREA2                     06290000
         DS    XL2                 Reserved for future use              06300000
STATTKTK DS    XL8                 Token for use by subsystem           06310000
STATTKPR DS    D                   Copy of STATPERF                     06320000
STATTKND EQU   *                   End of area                          06330000
         EJECT ,                                                        06340000
************************************************************** @R04LSDS 06350000
*                                                            * @R04LSDS 06360000
*        STATPARM DSECT is passed to the processing routine  * @R04LSDS 06370000
*        in register 1.                                      * @R04LSDS 06380000
*                                                            * @R04LSDS 06390000
*        STATPWRK is set to zero the first time the routine  * @R04LSDS 06400000
*        is called and then not reset until all elements for * @R04LSDS 06410000
*        a particular subsystem are processed.  The routine  * @R04LSDS 06420000
*        can use this to pass data between calls (until      * @R04LSDS 06430000
*        a second subsystem starts processing the request).  * @R04LSDS 06440000
*                                                            * @R04LSDS 06450000
************************************************************** @R04LSDS 06460000
         SPACE 1                                               @R04LSDS 06470000
STATPARM DSECT ,                   Routine parm list           @R04LSDS 06480000
STATPSIZ DS    H                   Size of parameter list      @R04LSDS 06490000
STATPVER DS    XL2                 Copy of STATVERO            @R04LSDS 06500000
STATPPRM DS    F                   Parm passed in STATRPRM     @R04LSDS 06510000
STATPWRK DS    F                   Work area                   @R04LSDS 06520000
STATPELM DS    A                   Addr of Job Queue Element   @R04LSDS 06530000
STATPLEN EQU   *-STATPARM          Length of area              @R04LSDS 06540000
         EJECT ,                                               @R04LSDS 06550000
**************************************************************          06560000
*                                                            *          06570000
*        Job Queue Element prologue                          *          06580000
*                                                            *          06590000
*        Data returned from this interface has the following *          06600000
*        format:                                             *          06610000
*                                                            *          06620000
*        +----------------+   +-->+----------------+         *          06630000
*        |Job data prolog |   |   |Job data prolog |         *          06640000
*        |STJQNEXT       -----+   |STJQNEXT       ---->0     *          06650000
*        |+--------------+|       |+--------------+|         *          06660000
*        ||Job data hdr  ||       ||Job data hdr  ||         *          06670000
*        ||+------------+||       ||+------------+||         *          06680000
*        |||Terse data  |||       |||Terse data  |||         *          06690000
*        ||+------------+||       ||+------------+||         *          06700000
*        ||+------------+||       ||+------------+||         *          06710000
*        |||Other data  |||       |||Other data  |||         *          06720000
*        ||+------------+||       ||+------------+||         *          06730000
*        |+--------------+|       |+--------------+|         *          06740000
*        +----------------+       +----------------+         *          06750000
*                                                            *          06760000
*        STJQNEXT is a pointer linking job information areas *          06770000
*        together.  To get from the prolog to the job data   *          06780000
*        header, use the STJQOHDR field.  To get from the    *          06790000
*        Job header data to the terse data section, use the  *          06800000
*        STHDSIZE equate.  To move from section to section   *          06810000
*        add the section length (eg STTRLEN) to the start    *          06820000
*        of a section.                                       *          06830000
*                                                            *          06840000
*        NOTE:  You should not use the section equates       *          06850000
*        (with the exception of STHDSIZE) to move from one   *          06860000
*        section of the data to another.  You should always  *          06870000
*        use the section length fields.                      * @R05LOPI 06880000
*                                                            *          06890000
**************************************************************          06900000
         SPACE 1                                                        06910000
STATJQ   DSECT ,                   Job data section prolog              06920000
STJQEYE  DC    C'SJQE'             Eye catcher                          06930000
STJQOHDR DC    Y(STJQSIZE)         Offset to first section              06940000
         DC    XL2'0'              Reserved for future use              06950000
STJQNEXT DC    A(*-*)              Address of next Job Queue Element    06960000
STJQSE   DC    A(*-*)              Address of first SYSOUT     @R05LOPIC06970000
                                     element                   @R05LOPI 06980000
STJQOSS  DC    CL4' '              Name of Subsystem which created     C06990000
                                     this Job Queue Element             07000000
         DC    A(*-*)              Reserved for future use              07010000
STJQSIZE EQU   *-STATJQ            Size of prologue                     07020000
         SPACE 1                                                        07030000
**************************************************************          07040000
*                                                            *          07050000
*        Section type flags                                  *          07060000
*                                                            *          07070000
*        General conventions for section number assignment   *          07080000
*        Bits  Value  meaning                                *          07090000
*        ----  -----  -------------------------------------  *          07100000
*        0-1   00     job level section                      *          07110000
*              01     SYSOUT level section                   * @R05LOPI 07120000
*        2     0      quick/terse data section               * @R05LOPI 07130000
*              1      reserved                               *          07140000
*        3-7   00000  overall header section                 *          07150000
*              xxxxx  section number                         *          07160000
*                                                            *          07170000
**************************************************************          07180000
         SPACE 1                                                        07190000
STHD1HDR EQU   B'00000000'         First Header Section type            07200000
         SPACE 1                                                        07210000
STTRTERS EQU   B'00000001'         Job level terse section     @R05LOPI 07220000
STJ2TERS EQU   B'00000010'         JES2 Terse section type              07230000
STAFFIN  EQU   B'00000011'         Affinity section type                07240000
STSCHED  EQU   B'00000100'         Scheduling section          @R04LSDS 07250000
         SPACE 1                                               @R05LOPI 07260000
STSH1HDR EQU   B'01000000'         First SYSOUT section type   @R05LOPI 07270000
         SPACE 1                                               @R05LOPI 07280000
STSTTERS EQU   B'01000001'         SYSOUT level terse section  @R05LOPI 07290000
STS2TERS EQU   B'01000010'         JES2 SYSOUT section         @R05LOPI 07300000
STS3TERS EQU   B'01000011'         JES3 SYSOUT section         @R05LOPI 07310000
         SPACE 1                                                        07320000
**************************************************************          07330000
*                                                            *          07340000
*        Job Queue Element First Header Section              *          07350000
*                                                            *          07360000
**************************************************************          07370000
         SPACE 1                                                        07380000
STATJQHD DSECT ,                   Job data section header              07390000
STHDLEN  DC    AL2(0)              Length of entire job header         C07400000
                                   (Max value is 65535)                 07410000
STHDTYPE DC    AL1(STHD1HDR)       Type of this header                  07420000
STHDMOD  DC    AL1(STHD1MOD)       Modifier                             07430000
STHD1MOD EQU   0                   First Header Section modifier        07440000
STHDSIZE EQU   *-STATJQHD          Size of First Header Section         07450000
         SPACE 1                                                        07460000
**************************************************************          07470000
*                                                            *          07480000
*        Job Queue Element Quick/Terse Section               * @R05LOPI 07490000
*                                                            *          07500000
*        Data in this section is "easy" for the JES to       *          07510000
*        fetch.  No disk I/O is necessary to get this        *          07520000
*        information.  At least one terse section is always  *          07530000
*        returned.                                           *          07540000
*                                                            *          07550000
**************************************************************          07560000
         SPACE 1                                                        07570000
STATJQTR DSECT ,                   Job data terse section               07580000
STTRLEN  DC    Y(STTRSIZE)         Length of terse section              07590000
STTRTYPE DC    AL1(STTRTERS)       Type of this header                  07600000
STTRMOD  DC    AL1(STTRTMOD)       Modifier                             07610000
STTRTMOD EQU   0                   Terse section modifier               07620000
         SPACE 1                                                        07630000
STTRNAME DC    CL8' '              Job Name                             07640000
STTRJID  DC    CL8' '              Job Identifier                       07650000
STTROJID DC    CL8' '              Original Job Identifier              07660000
STTRCLAS DC    CL8' '              Job Class                            07670000
STTRONOD DC    CL8' '              Origin Node (node of submittal)      07680000
STTRXNOD DC    CL8' '              Execution Node                       07690000
STTRPRND DC    CL8' '              Default Print Node                   07700000
STTRPRRE DC    CL8' '              Default Print Remote Name            07710000
STTRPUND DC    CL8' '              Default Punch Node                   07720000
STTRPURE DC    CL8' '              Default Punch Remote Name            07730000
STTROUID DC    CL8' '              Owner userid                         07740000
STTRSECL DC    CL8' '              SECLABEL for job                     07750000
STTRSYS  DC    CL8' '              MVS system on which the job is      C07760000
                                     active (blanks if not active)      07770000
STTRMEM  DC    CL8' '              JES2 member on which the job is     C07780000
                                     active (blanks if not active)      07790000
STTRDEVN DC    CL18' '             Name of device job is active on     C07800000
                                     (if job is active on a device)     07810000
STTRPHAZ DC    AL1(*-*)            Phase job is in (see STAT_ equates  C07820000
                                     for an enumeration)                07830000
STTRHOLD DC    AL1(*-*)            Job hold indicator                   07840000
STTRJNHL EQU   1                     Job is not held                    07850000
STTRJHLD EQU   2                     Job is held                        07860000
STTRJDUP EQU   3                     Job held for duplicate job name    07870000
         SPACE 1                                                        07880000
STTRJTYP DC    AL1(*-*)            Job type                             07890000
STTRSTC  EQU   1                     Started Task (STC)                 07900000
STTRTSU  EQU   2                     Time Sharing User (TSU)            07910000
STTRJOB  EQU   3                     Batch job (JOB)                    07920000
STTRAPPC EQU   4                     APPC Initiator                     07930000
         SPACE 1                                                        07940000
STTRPRIO DC    X'0'                Job priority                         07950000
         SPACE 1                                                        07960000
STTRARMS DC    B'00000000'         Jobs ARM status                      07970000
STTRARMR EQU   B'10000000'           Job is ARM registered              07980000
STTRARMW EQU   B'01000000'           Job is awaiting ARM restart        07990000
         SPACE 1                                                        08000000
         DC    XL1'00'             Reserved                    @R04LSDS 08010000
*------------------------------------------------------------* @R04LSDS 08020000
*        The max return code consists of a 1 byte indicator  * @R04LSDS 08030000
*        of how the job completed followed by a 3 byte       * @R04LSDS 08040000
*        code.  The code is available only for conditions    * @R04LSDS 08050000
*        followed by a '+' sign.  If the job ABENDed or      * @R04LSDS 08060000
*        failed in end of memory, either the first 12 bits   * @R04LSDS 08070000
*        of STTRMXCC are set to the System ABEND code or     * @R04LSDS 08080000
*        the last 12 bits are set to the user ABEND code.    * @R04LSDS 08090000
*        If the job ended by completion code, STTRMXCC is    * @R04LSDS 08100000
*        completion code of the last step executed.          * @R04LSDS 08110000
*------------------------------------------------------------* @R04LSDS 08120000
STTRMXRC DC    0F'0'               Max return code             @R04LSDS 08130000
STTRXIND DS    X                   Job completion indicator    @R04LSDS 08140000
STTRXAB  EQU   X'80'               ABEND code exists                    08150000
STTRXCDE EQU   X'40'               Completion code exists               08160000
*              X'3F'               Specific completion type             08170000
STTRXUNK EQU   0                     No completion info        @R04LSDS 08180000
STTRXNRM EQU   1                     Job ended normally  +     @R04LSDS 08190000
STTRXCC  EQU   2                     Job ended by CC     +     @R04LSDS 08200000
STTRXJCL EQU   3                     Job had a JCL error       @R04LSDS 08210000
STTRXCAN EQU   4                     Job was canceled          @R04LSDS 08220000
STTRXABN EQU   5                     Job ABENDed         +     @R04LSDS 08230000
STTRXCAB EQU   6                     Converter ABENDed         @R04LSDS 08240000
STTRXSEC EQU   7                     Security error            @R04LSDS 08250000
STTRXEOM EQU   8                     Job failed in EOM   +     @R04LSDS 08260000
STTRMXCC DS    XL3                 Completion code (set for    @R04LSDSC08270000
                                     '+' conditions)           @R04LSDS 08280000
         SPACE 1                                                        08290000
STTRSIZE EQU   *-STATJQTR          Size of Terse Information            08300000
         SPACE 1                                                        08310000
**************************************************************          08320000
*                                                            *          08330000
*        Job Queue Element JES2 Terse Section                *          08340000
*                                                            *          08350000
*        This section contains general information that is   *          08360000
*        only meaningful if the job is owned by a JES2       *          08370000
*        subsystem.                                          *          08380000
*                                                            *          08390000
**************************************************************          08400000
         SPACE 1                                                        08410000
STATJ2TR DSECT ,                   JES2 terse data area                 08420000
STJ2LEN  DC    Y(STJ2SIZE)         Length of JES2 terse section         08430000
STJ2TYPE DC    AL1(STJ2TERS)       Type of this header                  08440000
STJ2MOD  DC    AL1(STJ2TMOD)       Modifier                             08450000
STJ2TMOD EQU   0                   JES2 Terse section modifier          08460000
         SPACE 1                                                        08470000
STJ2FLG1 DC    B'00000000'         General flag byte                    08480000
STJ21PRO EQU   B'10000000'           Job is protected                   08490000
STJ21IND EQU   B'01000000'           Job is set to independent mode     08500000
STJ21SYS EQU   B'00100000'           Job represents a system data set   08510000
STJ21CNW EQU   B'00010000'           Job can be converted only   @R03ABC08520000
                                       by CNVT PCEs that can     @R03ABC08530000
                                       wait for OS resources     @R03AB 08540000
         SPACE 1                                                        08550000
         DC    XL3'00'             Reserved for future use              08560000
STJ2JKEY DC    XL4'00000000'       Job key                              08570000
STJ2SPOL DC    XL8'00'             Spool data token                     08580000
STJ2SPAC DC    F'0'                Number of track groups of spool     C08590000
                                     space used by this job (if set    C08600000
                                     to -1 then count not available)    08610000
STJ2SIZE EQU   *-STATJ2TR          Length of section                    08620000
         SPACE 1                                                        08630000
**************************************************************          08640000
*                                                            *          08650000
*        Job Queue Element member affinity section           *          08660000
*                                                            *          08670000
*        This section describes the system affinity assigned *          08680000
*        to a job.  This section is present only if there    *          08690000
*        is an affinity assigned to the job                  *          08700000
*                                                            *          08710000
**************************************************************          08720000
         SPACE 1                                                        08730000
STATAFFS DSECT ,                   Member affinity data area            08740000
STAFLEN  DC    Y(*-*)              Length of affinity section           08750000
STAFTYPE DC    AL1(STAFFIN)        Type of this header                  08760000
STAFMOD  DC    AL1(STAFTMOD)       Modifier                             08770000
STAFTMOD EQU   0                   Affinity section modifier            08780000
         SPACE 1                                                        08790000
STAFNUM  DC    AL2(*-*)            Number of member names               08800000
         DC    XL2'0'              Reserved                             08810000
STAFMEMB DC    0CL8' '             First member name                    08820000
STAFSIZE EQU   *-STATAFFS          Length of basic section              08830000
         SPACE 1                                               @R04LSDS 08840000
************************************************************** @R04LSDS 08850000
*                                                            * @R04LSDS 08860000
*        Job Queue Element execution scheduling section      * @R04LSDS 08870000
*                                                            * @R04LSDS 08880000
*        This section describes information for jobs         * @R04LSDS 08890000
*        scheduled for execution.  There are 2 modifiers for * @R04LSDS 08900000
*        this section.  The first is for the basic           * @R04LSDS 08910000
*        scheduling parameters, the second is a list of      * @R04LSDS 08920000
*        system where the required scheduling environment is * @R04LSDS 08930000
*        available.  This section is present only for jobs   * @R04LSDS 08940000
*        that have not completed execution.                  * @R04LSDS 08950000
*                                                            * @R04LSDS 08960000
************************************************************** @R04LSDS 08970000
         SPACE 1                                               @R04LSDS 08980000
STATSCHD DSECT ,                   Scheduling data area        @R04LSDS 08990000
STSCLEN  DC    Y(*-*)              Length of scheduling data   @R04LSDS 09000000
STSCTYPE DC    AL1(STSCHED)        Type of this header         @R04LSDS 09010000
STSCMOD  DC    AL1(STSCTMOD)       Modifier                    @R04LSDS 09020000
STSCTMOD EQU   0                   Scheduling data modifier    @R04LSDS 09030000
         SPACE 1                                               @R04LSDS 09040000
STSCAHLD DC    B'0'                Reasons why job won't run   @R04LSDS 09050000
STSCJCLS EQU   B'10000000'           Job class held            @R04LSDS 09060000
STSCJCLM EQU   B'01000000'           Job class limit reached   @R04LSDS 09070000
STSCJSCH EQU   B'00100000'           Scheduling environment    @R04LSDS 09080000
STSCJAFF EQU   B'00010000'           System affinity           @R04LWLM 09090000
STSCJSPL EQU   B'00001000'           SPOOLs not available      @R04LWLM 09100000
STSCJBSY EQU   B'00000100'           Job busy on device        @R04LWLM 09110000
STSCNOSY EQU   B'00000001'           No system with the right  @R04LWLMC09120000
                                       combination of          @R04LWLMC09130000
                                         resources             @R04LWLM 09140000
         SPACE 1                                               @R04LSDS 09150000
STSCFLG1 DC    B'0'                Flag byte                   @R04LSDS 09160000
STSC1JCM EQU   B'10000000'           Jobclass mode of JQE      @R04LSDSC09170000
                                      Off = JES, On = WLM      @R04LSDS 09180000
         DS    XL2                 Reserved                    @R04LSDS 09190000
         SPACE 1                                               @R04LSDS 09200000
STSCSRVC DC    CL8' '              WLM service class           @R04LSDS 09210000
         SPACE 1                                               @R04LSDS 09220000
*------------------------------------------------------------* @R04LSDS 09230000
*        STSCESTT is the estimated time to execution.  This  * @R04LSDS 09240000
*        value is only available if the following are true:  * @R04LSDS 09250000
*         - Job is awaiting execution                        * @R04LSDS 09260000
*         - Job is scheduled to a WLM managed job class      * @R04LSDS 09270000
*         - Job is not held (duplicate job name, operator    * @R04LSDS 09280000
*           hold, etc)                                       * @R04LSDS 09290000
*         - Member it has affinity to is available           * @R04LSDS 09300000
*         - The scheduling environment is available          * @R04LSDS 09310000
*------------------------------------------------------------* @R04LSDS 09320000
STSCESTT DS    F                   Estimated time to           @R04LWLMC09330000
                                     execution in seconds      @R04LWLM 09340000
STSCSENV DC    CL16' '             WLM Scheduling environment  @R04LSDS 09350000
         SPACE 1                                               @R04LSDS 09360000
*------------------------------------------------------------* @R04LSDS 09370000
*        STSCQPOS is the position of the job on the WLM      * @R04LSDS 09380000
*        service class queue.  STSCQNUM is the total number  * @R04LSDS 09390000
*        of jobs on the service class queue.  Jobs which     * @R04LSDS 09400000
*        are not currently eligible to execute are not       * @R04LSDS 09410000
*        included in these counts.  The count values are     * @R04LSDS 09420000
*        only returned if the flag STATSPOS is set in        * @R04LSDS 09430000
*        STATSEL3 on input.                                  * @R04LSDS 09440000
*        These values are only set to a non-zero value       * @R04LSDS 09450000
*        when the following are true:                        * @R04LSDS 09460000
*         - Job is awaiting execution                        * @R04LSDS 09470000
*         - Job is scheduled to a WLM managed job class      * @R04LSDS 09480000
*         - Job is not held (job hold or class queue hold)   * @R04LSDS 09490000
*         - Member it has affinity to is available           * @R04LSDS 09500000
*         - The scheduling environment is available          * @R04LSDS 09510000
*------------------------------------------------------------* @R04LSDS 09520000
         SPACE 1                                               @R04LSDS 09530000
STSCQPOS DS    F                   Position of this job on     @R04LSDSC09540000
                                    WLM service class queue    @R04LSDS 09550000
STSCQNUM DS    F                   Number of jobs on WLM       @R04LSDSC09560000
                                    WLM service class queue    @R04LSDS 09570000
STSCQACT DS    F                   Number of active jobs in    @R04LSDSC09580000
                                    this WLM service class     @R04LSDS 09590000
*------------------------------------------------------------* @R04P651 09600000
*        STSCAVGQ and STSCQDLY are the component parts used  * @R04P651 09610000
*        in calculating the estimated time to execution,     * @R04P651 09620000
*        and are set only when STSCESTT is also set.         * @R04P651 09630000
*------------------------------------------------------------* @R04P651 09640000
STSCAVGQ DS    F                   Average queue time for      @R04P651C09650000
                                     this job's srvclass in    @R07P243C09660000
                                     seconds                   @R07P243 09665000
STSCQTIM DS    F                   Queue time for this job     @R07P243C09670000
                                     in TOD clock units (bit   @R07P243C09672000
                                     31 = 1.04... seconds)     @R07P243 09675000
STSCSIZE EQU   *-STATSCHD          Length of basic section     @R04LSDS 09680000
         SPACE 1                                               @R04LSDS 09690000
*------------------------------------------------------------* @R04LSDS 09700000
*        This section lists the system names on which the    * @R04LSDS 09710000
*        scheduling environment required by the job is       * @R04LSDS 09720000
*        available.  This section is only returned if the    * @R04LSDS 09730000
*        job requires a scheduling environment and that      * @R04LSDS 09740000
*        environment is available on at least one system.    * @R04LSDS 09750000
*------------------------------------------------------------* @R04LSDS 09760000
         SPACE 1                                               @R04LSDS 09770000
STATSCHS DSECT ,                   Schedule systems section    @R04LSDS 09780000
STSSLEN  DC    Y(*-*)              Length of sched sys section @R04LSDS 09790000
STSSTYPE DC    AL1(STSCHED)        Type of this header         @R04LSDS 09800000
STSSMOD  DC    AL1(STSSTMOD)       Modifier                    @R04LSDS 09810000
STSSTMOD EQU   1                   Schedulable system section  @R04LSDS 09820000
STSSNUM  DC    AL2(*-*)            Number of system names      @R04LSDS 09830000
         DC    XL2'0'              Reserved                    @R04LSDS 09840000
STSSSYS  DC    0CL8' '             First system name           @R04LSDS 09850000
STSSSIZE EQU   *-STATSCHS          Length of basic section     @R04LSDS 09860000
         EJECT ,                                               @R05LOPI 09870000
************************************************************** @R05LOPI 09880000
*                                                            * @R05LOPI 09890000
*        SYSOUT element prologue                             * @R05LOPI 09900000
*                                                            * @R05LOPI 09910000
*        SYSOUT data returned via this interface is chained  * @R05LOPI 09920000
*        from a job queue element as follows:                * @R05LOPI 09930000
*                                                            * @R05LOPI 09940000
*   +--->+----------------+   +-->+----------------+         * @R05LOPI 09950000
*   |    |Job data prolog |   |   |Job data prolog |         * @R05LOPI 09960000
*   |    |STJQNEXT       -----+   |STJQNEXT       ---->0     * @R05LOPI 09970000
*   | +---STJQSE          |       |STJQSE         ---->....  * @R05LOPI 09980000
*   | |  |  :             |       |  :             |         * @R05LOPI 09990000
*   | |  |  :             |       |  :             |         * @R05LOPI 10000000
*   | |  +----------------+       +----------------+         * @R05LOPI 10010000
*   | |                                                      * @R05LOPI 10020000
*   | +->+----------------+   +-->+----------------+         * @R05LOPI 10030000
*   |    |SYSOUT prologue |   |   |SYSOUT prologue |         * @R05LOPI 10040000
*   |    |STSEJNXT       -----+   |STSEJNXT       ---->0     * @R05LOPI 10050000
*   +-----STSEJOB-------------<----STSEJOB         |         * @R05LOPI 10060000
*        |+--------------+|       |+--------------+|         * @R05LOPI 10070000
*        ||SYSOUT header ||       ||SYSOUT header ||         * @R05LOPI 10080000
*        ||+------------+||       ||+------------+||         * @R05LOPI 10090000
*        |||Terse data  |||       |||Terse data  |||         * @R05LOPI 10100000
*        ||+------------+||       ||+------------+||         * @R05LOPI 10110000
*        ||+------------+||       ||+------------+||         * @R05LOPI 10120000
*        |||Other data  |||       |||Other data  |||         * @R05LOPI 10130000
*        ||+------------+||       ||+------------+||         * @R05LOPI 10140000
*        |+--------------+|       |+--------------+|         * @R05LOPI 10150000
*        +----------------+       +----------------+         * @R05LOPI 10160000
*                                                            * @R05LOPI 10170000
*        STJQSE points to the first SYSOUT prologue.         * @R05LOPI 10180000
*        STSEJNXT is a pointer linking SYSOUT information    * @R05LOPI 10190000
*        areas for a job together.  To get from the SYSOUT   * @R05LOPI 10200000
*        prologue to the SYSOUT data header, use the         * @R05LOPI 10210000
*        STSEOHDR field.  To get from the SYSOUT header data * @R05LOPI 10220000
*        to the terse data section, use the STSHSIZE equate. * @R05LOPI 10230000
*        To move from section to section add the section     * @R05LOPI 10240000
*        length (eg STSTLEN) to the start of a section.      * @R05LOPI 10250000
*                                                            * @R05LOPI 10260000
*        NOTE:  You should not use the section equates       * @R05LOPI 10270000
*        (with the exception of STSHSIZE) to move from one   * @R05LOPI 10280000
*        section of the data to another.  You should always  * @R05LOPI 10290000
*        use the section length fields.                      * @R05LOPI 10300000
*                                                            * @R05LOPI 10310000
************************************************************** @R05LOPI 10320000
         SPACE 1                                               @R05LOPI 10330000
STATSE   DSECT ,                   SYSOUT data section prolog  @R05LOPI 10340000
STSEEYE  DC    C'SOUT'             Eye catcher                 @R05LOPI 10350000
STSEOHDR DC    Y(STSESIZE)         Offset to first section     @R05LOPI 10360000
         DC    XL2'0'              Reserved for future use     @R05LOPI 10370000
STSEJNXT DC    A(*-*)              Address of next SYSOUT data @R05LOPIC10380000
                                    element                    @R05LOPI 10390000
STSEJOB  DC    A(*-*)              Address of associated job   @R05LOPIC10400000
                                    queue data element         @R05LOPI 10410000
         DC    A(*-*)              Reserved for future use     @R05LOPI 10420000
STSESIZE EQU   *-STATSE            Size of prologue            @R05LOPI 10430000
         SPACE 1                                               @R05LOPI 10440000
************************************************************** @R05LOPI 10450000
*                                                            * @R05LOPI 10460000
*        SYSOUT Element First Header Section                 * @R05LOPI 10470000
*                                                            * @R05LOPI 10480000
************************************************************** @R05LOPI 10490000
         SPACE 1                                               @R05LOPI 10500000
STATSEHD DSECT ,                   SYSOUT section header       @R05LOPI 10510000
STSHLEN  DC    AL2(0)              Length of entire SYSOUT     @R05LOPIC10520000
                                   header (Max value is 65535) @R05LOPI 10530000
STSHTYPE DC    AL1(STSH1HDR)       Type of this header         @R05LOPI 10540000
STSHMOD  DC    AL1(STSH1MOD)       Modifier                    @R05LOPI 10550000
STSH1MOD EQU   0                   1st Header Section modifier @R05LOPI 10560000
STSHSIZE EQU   *-STATSEHD          Size of 1st Header Section  @R05LOPI 10570000
         SPACE 1                                               @R05LOPI 10580000
************************************************************** @R05LOPI 10590000
*                                                            * @R05LOPI 10600000
*        SYSOUT Element Quick/Terse Section                  * @R05LOPI 10610000
*                                                            * @R05LOPI 10620000
*        Data in this section is "easy" for the JES to       * @R05LOPI 10630000
*        fetch.  Minimal overhead is necessary to get this   * @R05LOPI 10640000
*        information.  At least one terse section is always  * @R05LOPI 10650000
*        returned if SYSOUT data was requested.              * @R05LOPI 10660000
*                                                            * @R05LOPI 10670000
************************************************************** @R05LOPI 10680000
         SPACE 1                                               @R05LOPI 10690000
STATSETR DSECT ,                   SYSOUT terse section        @R05LOPI 10700000
STSTLEN  DC    Y(STSTSIZE)         Length of terse section     @R05LOPI 10710000
STSTTYPE DC    AL1(STSTTERS)       Type of this header         @R05LOPI 10720000
STSTMOD  DC    AL1(STSTTMOD)       Modifier                    @R05LOPI 10730000
STSTTMOD EQU   0                   Terse section modifier      @R05LOPI 10740000
         SPACE 1                                               @R05LOPI 10750000
STSTOUID DC    CL8' '              SYSOUT owner (creator)      @R05LOPI 10760000
STSTSECL DC    CL8' '              SECLABEL for SYSOUT         @R05LOPI 10770000
STSTDEST DC    CL18' '             SYSOUT destination          @R05LOPI 10780000
STSTCLAS DC    CL8' '              SYSOUT class                @R05LOPI 10790000
STSTNREC DC    FL4'0'              Record count                @R05LOPI 10800000
STSTPAGE DC    FL4'0'              Page count                  @R05LOPI 10810000
STSTLNCT DC    FL4'0'              Line count                  @R05P404 10820000
STSTBYCT DC    2FL4'0'             Byte count after blank      @R05P404C10830000
                                     truncation                @R05P404C10840000
                                     63 bit right justified    @R05P404 10850000
STSTFORM DC    CL8' '              Forms                       @R05LOPI 10860000
STSTFCB  DC    CL8' '              FCB                         @R05LOPI 10870000
STSTUCS  DC    CL8' '              UCS                         @R05LOPI 10880000
STSTXWTR DC    CL8' '              External writer name        @R05LOPI 10890000
STSTPMDE DC    CL8' '              Processing mode             @R05LOPI 10900000
STSTFLSH DC    CL8' '              Flash                       @R05LOPI 10910000
STSTCHAR DC    4CL4' '             Printer translate table     @R05P404 10920000
STSTMODF DC    CL4' '              MODIFY=(modname)            @R05P404 10930000
STSTMODC DC    XL1'0'              MODIFY=(,trc)               @R05P404 10940000
         SPACE 1                                               @R05P404 10950000
         DC    XL3'0'              Reserved for future use     @R05P404 10960000
         SPACE 1                                                        10970000
STSTSYS  DC    CL8' '              MVS system on which the     @R05LOPIC10980000
                                     SYSOUT is active (blanks  @R05LOPIC10990000
                                     if not active)            @R05LOPI 11000000
STSTMEM  DC    CL8' '              JES member on which the     @R05LOPIC11010000
                                     SYSOUT is active (blanks  @R05LOPIC11020000
                                     if not active)            @R05LOPI 11030000
STSTDEVN DC    CL18' '             Name of device on which the @R05LOPIC11040000
                                     SYSOUT is active (blanks  @R05LOPIC11050000
                                     if not active)            @R05LOPI 11060000
         SPACE 1                                               @R05LOPI 11070000
STSTHSTA DC    B'00000000'         SYSOUT hold state           @R05LOPI 11080000
STSTHOPR EQU   B'10000000'           SYSOUT is held due to     @R05LOPIC11090000
                                     operator command          @R05LOPI 11100000
STSTHUSR EQU   B'01000000'           SYSOUT is currently held  @R05LOPIC11110000
                                     (eg HOLD=YES on the DD or @R05LOPIC11120000
                                     OUTDISP=HOLD or LEAVE)    @R05LOPI 11130000
STSTHSYS EQU   B'00100000'           SYSOUT is in a system     @R05LOPIC11140000
                                     hold (see STSTHRSN for    @R05LOPIC11150000
                                     reason).                  @R05LOPI 11160000
STSTHTSO EQU   B'00010000'           SYSOUT is held for TSO,   @R05P404C11170000
                                       JES3 only               @R05P404 11180000
STSTHXWT EQU   B'00001000'           SYSOUT is held for        @R05P404C11190000
                                       external writer.        @R05P404C11200000
                                       JES3 only               @R05P404 11210000
         SPACE 1                                               @R05LOPI 11220000
STSTHRSN DC    XL1'0'              Reason for system hold (see @R05LOPIC11230000
                                     fields OHLDJxxx in        @R05LOPIC11240000
                                     IAZOHLD for meaning)      @R05LOPI 11250000
         SPACE 1                                               @R05LOPI 11260000
STSTDISP DC    B'00000000'         Output disposition          @R05P404 11270000
STSTDHLD EQU   B'10000000'           OUTDISP=HOLD              @R05P404 11280000
STSTDLVE EQU   B'01000000'           OUTDISP=LEAVE             @R05P404 11290000
STSTDWRT EQU   B'00100000'           OUTDISP=WRITE             @R05P404 11300000
STSTDKEP EQU   B'00010000'           OUTDISP=KEEP              @R05P404 11310000
         SPACE 1                                               @R05LOPI 11320000
STSTFLG1 DC    B'00000000'         General flag byte           @R05LOPI 11330000
STST1BRT EQU   B'10000000'           BURST=YES                 @R05LOPI 11340000
STST1DSI EQU   B'01000000'           3540 held data set        @R05LOPI 11350000
STST1IPA EQU   B'00100000'           Destination has an IPADDR @R05LOPI 11360000
STST1CPD EQU   B'00010000'           Schedulable element has   @R05LOPIC11370000
                                     page mode data            @R05LOPI 11380000
STST1SPN EQU   B'00001000'           SPIN data set             @R05P404 11390000
         SPACE 1                                               @R05LOPI 11400000
STSTPRIO DC    XL1'0'              SYSOUT priority             @R05LOPI 11410000
         SPACE 1                                               @R05LOPI 11420000
************************************************************** @R05LOPI 11430000
*                                                            * @R05LOPI 11440000
*        The SYSOUT identifier (STSTSOID) is a EBCDIC value  * @R05LOPI 11450000
*        associated with this SYSOUT that can be used in     * @R05LOPI 11460000
*        operator commands.  The exact contents vary based   * @R05LOPI 11470000
*        on whether JES2 or JES3 owns the SYSOUT and the     * @R05LOPI 11480000
*        release of JES processing the SSI request.          * @R05LOPI 11490000
*                                                            * @R05LOPI 11500000
************************************************************** @R05LOPI 11510000
         SPACE 1                                               @R05LOPI 11520000
STSTSOID DC    CL44' '             EBCDIC SYSOUT identifier    @R05LOPI 11530000
         SPACE 1                                               @R05LOPI 11540000
************************************************************** @R05LOPI 11550000
*                                                            * @R05LOPI 11560000
*        The SYSOUT client token (STSTCTKN) is a token that  * @R05LOPI 11570000
*        can be used on various APIs to access a specific    * @R05LOPI 11580000
*        piece of SYSOUT.  The token returned may NOT be the * @R05LOPI 11590000
*        same as the one returned on a SYSOUT allocation     * @R05LOPI 11600000
*        or used in ENF processing.  It may also be          * @R05LOPI 11610000
*        different from the TOKEN passed for selection in    * @R05LOPI 11620000
*        STATCTKN.  If you are tracking SYSOUT with a token  * @R05LOPI 11630000
*        received from allocation, do NOT replace it with    * @R05LOPI 11640000
*        this token.                                         * @R05LOPI 11650000
*                                                            * @R05LOPI 11660000
************************************************************** @R05LOPI 11670000
         SPACE 1                                               @R05LOPI 11680000
STSTCTKN DC    XL80'00'            SYSOUT client token         @R05LOPI 11690000
         SPACE 1                                               @R05LOPI 11700000
STSTSIZE EQU   *-STATSETR          Size of Terse Information   @R05LOPI 11710000
         SPACE 1                                               @R05LOPI 11720000
************************************************************** @R05LOPI 11730000
*                                                            * @R05LOPI 11740000
*        SYSOUT Element JES2 Terse Section                   * @R05LOPI 11750000
*                                                            * @R05LOPI 11760000
*        This section contains general information that is   * @R05LOPI 11770000
*        only meaningful if the job is owned by a JES2       * @R05LOPI 11780000
*        subsystem.                                          * @R05LOPI 11790000
*                                                            * @R05LOPI 11800000
************************************************************** @R05LOPI 11810000
         SPACE 1                                               @R05LOPI 11820000
STATSJ2T DSECT ,                   JES2 terse data area        @R05LOPI 11830000
STS2LEN  DC    Y(STS2SIZE)         Len of JES2 terse section   @R05LOPI 11840000
STS2TYPE DC    AL1(STS2TERS)       Type of this header         @R05LOPI 11850000
STS2MOD  DC    AL1(STS2TMOD)       Modifier                    @R05LOPI 11860000
STS2TMOD EQU   0                   JES2 Terse section modifier @R05LOPI 11870000
         SPACE 1                                               @R05LOPI 11880000
STS2FLG1 DC    B'00000000'         General flags               @R05LOPI 11890000
STS21DSH EQU   B'10000000'           JOE has been cloned (all  @R05P404C11900000
                                     data sets must be         @R05LOPIC11910000
                                     processed identically     @R05LOPIC11920000
                                     by SAPI)                  @R05LOPI 11930000
STS21TSO EQU   B'01000000'           JOE is available for TSO  @R05P404C11940000
                                     OUTPUT processing         @R05LOPI 11950000
         SPACE 1                                               @R05LOPI 11960000
STS2OGNM DC    CL26' '             SYSOUT group name           @R05LOPI 11970000
STS2CRTM DC    XL4'00'             JOE creation time (STCK     @R05LOPIC11980000
                                     format)                   @R05LOPI 11990000
         SPACE 1                                               @R05LOPI 12000000
STS2SIZE EQU   *-STATSJ2T          Length of section           @R05LOPI 12010000
         SPACE 1                                               @R05LOPI 12020000
************************************************************** @R05LOPI 12030000
*                                                            * @R05LOPI 12040000
*        SYSOUT Element JES3 Terse Section                   * @R05LOPI 12050000
*                                                            * @R05LOPI 12060000
*        This section contains general information that is   * @R05LOPI 12070000
*        only meaningful if the job is owned by a JES3       * @R05LOPI 12080000
*        subsystem.                                          * @R05LOPI 12090000
*                                                            * @R05LOPI 12100000
************************************************************** @R05LOPI 12110000
         SPACE 1                                               @R05LOPI 12120000
STATSJ3T DSECT ,                   JES3 terse data area        @R05LOPI 12130000
STS3LEN  DC    Y(STS3SIZE)         Len of JES3 terse section   @R05LOPI 12140000
STS3TYPE DC    AL1(STS3TERS)       Type of this header         @R05LOPI 12150000
STS3MOD  DC    AL1(STS3TMOD)       Modifier                    @R05LOPI 12160000
STS3TMOD EQU   0                   JES3 Terse section modifier @R05LOPI 12170000
STS3FLG1 DC    B'00000000'         General flags               @R05P404 12180000
STS31XSY EQU   B'10000000'           Extended keywords used    @R05P404 12190000
         SPACE 1                                               @R05LOPI 12200000
STS3SIZE EQU   *-STATSJ3T          Length of section           @R05LOPI 12210000
         MEND  ,          */                                            12220000
* %IAZSSST_PLX: ;                                                       12230000
*  %IF SSOBST = '' %THEN                                                12240000
*    %SSOBST = 'BDY(DWORD)';                                            12250000
*  DCL SSOBESTA FIXED(15) CONSTANT(80); /* Function ID (SSOBFUNC)    */ 12260000
*  DCL STATV010 FIXED(15) CONSTANT('0100'X); /* Version 1 level      */ 12270000
*  DCL STATV020 FIXED(15) CONSTANT('0200'X); /* Version 2 level      */ 12280000
*  DCL STATV030 FIXED(15) CONSTANT('0300'X); /* Version 3 level         12290000
*                                          Client print      @R05LOPI*/ 12300000
*  DCL STATCVRL FIXED(8)  CONSTANT(3);  /* Current version level        12310000
*                                                            @R05LOPI*/ 12320000
*  DCL STATCVRM FIXED(8)  CONSTANT(0);  /* Current version modifier  */ 12330000
*/********************************************************************/ 12340000
*/*   Extended Status return codes (SSOBRETN)                        */ 12350000
*/********************************************************************/ 12360000
*  DCL STATRTOK FIXED(31) CONSTANT(0);  /* Everything is ok          */ 12370000
*  DCL STATINVA FIXED(31) CONSTANT(4);  /* Invalid search arguments  */ 12380000
*  DCL STATLERR FIXED(31) CONSTANT(8);  /* Logic error (See the         12390000
*                                          reason codes defined for     12400000
*                                          STATREAS)                 */ 12410000
*  DCL STATINVT FIXED(31) CONSTANT(12); /* Unsupported call type        12420000
*                                          (STATTYPE)                */ 12430000
*/********************************************************************/ 12440000
*/*   Reason codes associated with SSOBRETN value of STATLERR        */ 12450000
*/********************************************************************/ 12460000
*  DCL STATRDST FIXED(8) CONSTANT(4);  /* STATDEST is not valid      */ 12470000
*  DCL STATRJBL FIXED(8) CONSTANT(8);  /* STATJBIL is not valid      */ 12480000
*  DCL STATRJBH FIXED(8) CONSTANT(12); /* STATJBIH is not valid      */ 12490000
*  DCL STATRJLM FIXED(8) CONSTANT(16); /* STATJBIH is less than         12500000
*                                         STATJBIL                   */ 12510000
*  DCL STATRCLS FIXED(8) CONSTANT(20); /* STATCLSL is not a valid       12520000
*                                         job class                  */ 12530000
*  DCL STATRVOL FIXED(8) CONSTANT(24); /* STATSVOL is set but           12540000
*                                         STATVOL is not or STATVOL     12550000
*                                         specifies an volume serial    12560000
*                                         name that is not valid     */ 12570000
*  DCL STATRPHZ FIXED(8) CONSTANT(28); /* STATPHAZ is not valid or      12580000
*                                         not supported on this         12590000
*                                         subsystem                  */ 12600000
*  DCL STATRQUE FIXED(8) CONSTANT(32); /* Unable to access job          12610000
*                                         queues                     */ 12620000
*  DCL STATREYE FIXED(8) CONSTANT(36); /* STATEYE is not set to         12630000
*                                         C'STAT'                    */ 12640000
*  DCL STATRLEN FIXED(8) CONSTANT(40); /* STATLEN is too short       */ 12650000
*  DCL STATRJBN FIXED(8) CONSTANT(44); /* STATJOBN is not a valid       12660000
*                                         job name                   */ 12670000
*  DCL STATROWN FIXED(8) CONSTANT(48); /* STATOWNR is not a valid       12680000
*                                         userid                     */ 12690000
*  DCL STATRSYS FIXED(8) CONSTANT(52); /* STATSYS is not a valid        12700000
*                                         system name                */ 12710000
*  DCL STATRMEM FIXED(8) CONSTANT(56); /* STATMEMB is not a valid       12720000
*                                         member name                */ 12730000
*  DCL STATRCST FIXED(8) CONSTANT(60); /* STATSEL2 specifies to         12740000
*                                         select only non-batch jobs    12750000
*                                         and batch job class           12760000
*                                         filering (STATSCLS) was       12770000
*                                         requested.                 */ 12780000
*  DCL STATROJB FIXED(8) CONSTANT(64); /* STATOJBI is not valid      */ 12790000
*  DCL STATRSEC FIXED(8) CONSTANT(68); /* STATSECL is not valid      */ 12800000
*  DCL STATRORG FIXED(8) CONSTANT(72); /* STATORGN is not valid      */ 12810000
*  DCL STATRXEQ FIXED(8) CONSTANT(76); /* STATXEQN is not valid      */ 12820000
*  DCL STATRPRI FIXED(8) CONSTANT(80); /* STATPRIO is not valid      */ 12830000
*  DCL STATRSVC FIXED(8) CONSTANT(84); /* STATSRVC is not valid      */ 12840000
*  DCL STATRSEN FIXED(8) CONSTANT(88); /* STATSENV is not valid      */ 12850000
*  DCL STATRSCT FIXED(8) CONSTANT(92); /* STATCTKN is not valid         12860000
*                                                            @R05LOPI*/ 12870000
*  DCL STATRSCR FIXED(8) CONSTANT(96); /* STATSCRE is not valid         12880000
*                                                            @R05LOPI*/ 12890000
*  DCL STATRSSD FIXED(8) CONSTANT(100); /* STATSDES is not valid        12900000
*                                                            @R05LOPI*/ 12910000
*  DCL STATRSSC FIXED(8) CONSTANT(104); /* STATSCLA is not valid        12920000
*                                                            @R05LOPI*/ 12930000
*  DCL STATRSXW FIXED(8) CONSTANT(108); /* STATSWTR is not valid        12940000
*                                                            @R05LOPI*/ 12950000
*  DCL STATRECJ FIXED(8) CONSTANT(112); /* STATSCTK & STATSJBI are      12960000
*                                         mutually exclusive @R05LOPI*/ 12970000
*/********************************************************************/ 12980000
*/*   Type of call (STATTYPE)                                        */ 12990000
*/********************************************************************/ 13000000
*  DCL STATTERS FIXED(8) CONSTANT(1);  /* Request type of               13010000
*                                         Terse/Quick data to include   13020000
*                                         only job level data.  Data    13030000
*                                         returned requires no I/O      13040000
*                                         on behalf of the JES       */ 13050000
*  DCL STATMEM  FIXED(8) CONSTANT(3);  /* Request type of memory        13060000
*                                         management The status         13070000
*                                         support provided by the       13080000
*                                         JES does memory management    13090000
*                                         on behalf of the caller.      13100000
*                                         When the caller is            13110000
*                                         finished with the results     13120000
*                                         of its Verbose or Terse       13130000
*                                         request, a memory             13140000
*                                         management call should be     13150000
*                                         made in order that the        13160000
*                                         memory allocated by the       13170000
*                                         JES on behalf of the          13180000
*                                         caller is released.        */ 13190000
*  DCL STATOUTT FIXED(8) CONSTANT(4);  /* Request type of Terse/quick   13200000
*                                         data to include information   13210000
*                                         on SYSOUT.  Data returned     13220000
*                                         requires no I/O on behalf     13230000
*                                         of the JES (only valid for    13240000
*                                         version STATV030 and above    13250000
*                                         callers)           @R05P404*/ 13260000
*  DCL STATSIZ1 FIXED(31) CONSTANT(280); /* Original size of            13270000
*                                         SSOB extension     @R05LOPI*/ 13280000
*  DCL STATSIZE FIXED(31) CONSTANT(Length(STAT)); /* Length of          13290000
*                                         enhanced status SSOB ext   */ 13300000
*/********************************************************************/ 13310000
*/*      Possible values for STATPHAZ                                */ 13320000
*/********************************************************************/ 13330000
*/*------------------------------------------------------------------*/ 13340000
*/*      The following are job phases that are exist when            */ 13350000
*/*      the job is running under JES3.                              */ 13360000
*/*------------------------------------------------------------------*/ 13370000
* DCL STAT_NOSUB  FIXED(8) CONSTANT(1);  /* No subchain exists       */ 13380000
* DCL STAT_FSSCI  FIXED(8) CONSTANT(2);  /* Active in CI in an FSS      13390000
*                                           address space            */ 13400000
* DCL STAT_PSCBAT FIXED(8) CONSTANT(3);  /* Awaiting postscan           13410000
*                                           (batch)                  */ 13420000
* DCL STAT_PSCDSL FIXED(8) CONSTANT(4);  /* Awaiting postscan           13430000
*                                           (demsel)                 */ 13440000
* DCL STAT_FETCH  FIXED(8) CONSTANT(5);  /* Awaiting volume fetch    */ 13450000
* DCL STAT_VOLWT  FIXED(8) CONSTANT(6);  /* Awaiting start setup     */ 13460000
* DCL STAT_SYSSEL FIXED(8) CONSTANT(7);  /* Awaiting/active in MDS      13470000
*                                           system select processing */ 13480000
* DCL STAT_ALLOC  FIXED(8) CONSTANT(8);  /* Awaiting resource           13490000
*                                           allocation               */ 13500000
* DCL STAT_VOLUAV FIXED(8) CONSTANT(9);  /* Awaiting unavailable        13510000
*                                           VOL(s)                   */ 13520000
* DCL STAT_VERIFY FIXED(8) CONSTANT(10); /* Awaiting volume mounts   */ 13530000
* DCL STAT_SYSVER FIXED(8) CONSTANT(11); /* Awaiting/active in MDS      13540000
*                                           system verify processing */ 13550000
* DCL STAT_ERROR  FIXED(8) CONSTANT(12); /* Error during MDS            13560000
*                                           processing               */ 13570000
* DCL STAT_SELECT FIXED(8) CONSTANT(13); /* Awaiting selection on       13580000
*                                           main                     */ 13590000
* DCL STAT_ONMAIN FIXED(8) CONSTANT(14); /* Scheduled on main        */ 13600000
*/*                        CONSTANT(15)     Reserved (obsolete- ASP) */ 13610000
*/*                        CONSTANT(16)     Reserved (obsolete- ASP) */ 13620000
* DCL STAT_BRKDWN FIXED(8) CONSTANT(17); /* Awaiting breakdown       */ 13630000
* DCL STAT_RESTRT FIXED(8) CONSTANT(18); /* Awaiting MDS restart        13640000
*                                           proc.                    */ 13650000
* DCL STAT_DONE   FIXED(8) CONSTANT(19); /* Main and MDS proc.          13660000
*                                           complete                 */ 13670000
* DCL STAT_OUTPT  FIXED(8) CONSTANT(20); /* Awaiting output service  */ 13680000
* DCL STAT_OUTQUE FIXED(8) CONSTANT(21); /* Awaiting output service     13690000
*                                           WTR                      */ 13700000
* DCL STAT_OSWAIT FIXED(8) CONSTANT(22); /* Awaiting rsvd services   */ 13710000
* DCL STAT_CMPLT  FIXED(8) CONSTANT(23); /* Output service complete  */ 13720000
* DCL STAT_DEMSEL FIXED(8) CONSTANT(24); /* Awaiting selection on       13730000
*                                           main (demand select job) */ 13740000
* DCL STAT_EFWAIT FIXED(8) CONSTANT(25); /* Ending function rq waiting  13750000
*                                           or i/o completion        */ 13760000
* DCL STAT_EFBAD  FIXED(8) CONSTANT(26); /* Ending function rq not      13770000
*                                           Processed                */ 13780000
* DCL STAT_MAXNDX FIXED(8) CONSTANT(27); /* Maximum rq index value   */ 13790000
*/*------------------------------------------------------------------*/ 13800000
*/*      The following are job phases that are exist when            */ 13810000
*/*      the job is running under JES2.  Phases that are             */ 13820000
*/*      common between JES2 and JES3 are listed above and           */ 13830000
*/*      commented below.                                            */ 13840000
*/*------------------------------------------------------------------*/ 13850000
*  DCL STAT_INPUT  FIXED(8) CONSTANT(128); /* Active in input           13860000
*                                             processing             */ 13870000
*  DCL STAT_WTCONV FIXED(8) CONSTANT(129); /* Awaiting conversion    */ 13880000
*  DCL STAT_CONV   FIXED(8) CONSTANT(130); /* Active in conversion   */ 13890000
*/*         VOLWT           CONSTANT(6)       Awaiting SETUP         */ 13900000
*  DCL STAT_SETUP  FIXED(8) CONSTANT(131); /* Active in SETUP        */ 13910000
*/*         SELECT FIXED(8) CONSTANT(13)      Awaiting execution     */ 13920000
*/*         ONMAIN FIXED(8) CONSTANT(14)      Actively executing     */ 13930000
*  DCL STAT_SPIN   FIXED(8) CONSTANT(132); /* Active in spin         */ 13940000
*  DCL STAT_WTBKDN FIXED(8) CONSTANT(133); /* Awaiting output        */ 13950000
*/*         BRKDWN FIXED(8) CONSTANT(17)      Active in output       */ 13960000
*/*         OUTPT  FIXED(8) CONSTANT(20)      Awaiting hardcopy      */ 13970000
*  DCL STAT_WTPURG FIXED(8) CONSTANT(134); /* Awaiting purge         */ 13980000
*  DCL STAT_PURG   FIXED(8) CONSTANT(135); /* Active in purge        */ 13990000
*  DCL STAT_RECV   FIXED(8) CONSTANT(136); /* Active on NJE sysout      14000000
*                                             receive                */ 14010000
*  DCL STAT_WTXMIT FIXED(8) CONSTANT(137); /* Awaiting NJE job          14020000
*                                             transmission           */ 14030000
*  DCL STAT_XMIT   FIXED(8) CONSTANT(138); /* Active on NJE Job         14040000
*                                             transmitter            */ 14050000
*/*--------------------------------------------------------- @R04LSDS*/ 14060000
*/*      The following are job phases are used for selection @R04LSDS*/ 14070000
*/*      (STATPHAZ) and are composites of the other phases.  @R04LSDS*/ 14080000
*/*      The output field STTRPHAZ will never indicate a job @R04LSDS*/ 14090000
*/*      is in this phase.                                   @R04LSDS*/ 14100000
*/*--------------------------------------------------------- @R04LSDS*/ 14110000
*  DCL STAT_EXEC   FIXED(8) CONSTANT(253); /* Job has not completed     14120000
*                                             execution      @R04LSDS*/ 14130000
*  DCL STAT_POSTEX FIXED(8) CONSTANT(254); /* Job has completed         14140000
*                                             execution      @R04LSDS*/ 14150000
*/********************************************************************/ 14160000
*/*      Extended status SSOB extension                              */ 14170000
*/********************************************************************/ 14180000
*  DECLARE                                                              14190000
*   1       STAT          SSOBST,                                       14200000
*     2       STATLEN     FIXED(15), /* Length of status extension   */ 14210000
*     2       STATEYE     CHAR(4),   /* Eye catcher                  */ 14220000
*/********************************************************************/ 14230000
*/*      There are two 2 byte versions for this SSOB                 */ 14240000
*/*      extension.  STATVER is the version provided by the          */ 14250000
*/*      caller.  They indicate the level of the control             */ 14260000
*/*      block they are passing to the service.  As new              */ 14270000
*/*      input fields are added to the service, the caller           */ 14280000
*/*      provided version indicates what the service is to           */ 14290000
*/*      considered valid.                                           */ 14300000
*/*                                                                  */ 14310000
*/*      STATVERO is the version information returned from           */ 14320000
*/*      the service.  This implies what fields the service          */ 14330000
*/*      actually examined and what data is returned.  If            */ 14340000
*/*      the service is at a level higher than the level of          */ 14350000
*/*      the caller, STATVERO may be higher than STATVER.            */ 14360000
*/*      In this case, only the fields valid at the STATVER          */ 14370000
*/*      level are actually examined or set.                         */ 14380000
*/*                                                                  */ 14390000
*/*      The 2 bytes of version information is a 1 byte              */ 14400000
*/*      level number (changed only when a new release adds          */ 14410000
*/*      significant function) and a 1 byte modifier                 */ 14420000
*/*      (changed only when function is added via service).          */ 14430000
*/********************************************************************/ 14440000
*     2       STATVER     FIXED(16), /* SSOB version                 */ 14450000
*       3       STATVERL  FIXED(8),  /* SSOB version level           */ 14460000
*       3       STATVERM  FIXED(8),  /* SSOB version modifier        */ 14470000
*     2       STATVERO    FIXED(16), /* Subsystem version/modifier   */ 14480000
*     2       STATREAS    FIXED(8),  /* Reason code associated with     14490000
*                                       SSOBRETN value of STATLERR   */ 14500000
*     2       STATREA2    FIXED(8),  /* Secondary reason code.  This    14510000
*                                       field can be used to further    14520000
*                                       qualify an error.            */ 14530000
*     2       STATTYPE    FIXED(8),  /* Type of call                 */ 14540000
*     2       *           FIXED(16), /* Reserved                     */ 14550000
*/********************************************************************/ 14560000
*/*      STATSTRP is an anchor for use by the subsystems             */ 14570000
*/*      that respond to this request.  It is expected that          */ 14580000
*/*      the caller will set this to zero the FIRST time an          */ 14590000
*/*      SSOB extension is used and from that point on it            */ 14600000
*/*      will be managed by the subsystems.                          */ 14610000
*/********************************************************************/ 14620000
*     2       STATSTRP    PTR(31),   /* Storage management anchor    */ 14630000
*/********************************************************************/ 14640000
*/*      STATTRKP is a chain of diagnostic response areas            */ 14650000
*/*      built by the subsystems.  It contains information           */ 14660000
*/*      about each subsystem that responds to a request             */ 14670000
*/*      (including individual return codes).  It is                 */ 14680000
*/*      expected that the caller will set this to zero the          */ 14690000
*/*      FIRST time an SSOB extension is used and from that          */ 14700000
*/*      point on it will be managed by the subsystems.              */ 14710000
*/********************************************************************/ 14720000
*     2       STATTRKP    PTR(31),   /* Diagnostic response area        14730000
*                                       anchor                       */ 14740000
*/********************************************************************/ 14750000
*/*      Begin input-only fields                                     */ 14760000
*/********************************************************************/ 14770000
*     2       STATSEL1    BIT(8),    /* Job selection flags          */ 14780000
*       3       STATSCLS  BIT(1),    /* Use STATCLSL as a filter     */ 14790000
*       3       STATSDST  BIT(1),    /* Use STATDEST as a filter     */ 14800000
*       3       STATSJBN  BIT(1),    /* Use STATJOBN as a filter     */ 14810000
*       3       STATSJBI  BIT(1),    /* Use STATJBIL and STATJBIH as    14820000
*                                       filters.  Mutually exclusive    14830000
*                                       with STATSCTK        @R05LOPI*/ 14840000
*       3       STATSOJI  BIT(1),    /* Use STATOJBI as a filter     */ 14850000
*       3       STATSOWN  BIT(1),    /* Use STATOWNR as a filter     */ 14860000
*       3       STATSSEC  BIT(1),    /* Use STATSECL as a filter     */ 14870000
*       3       *         BIT(1),    /* Reserved                     */ 14880000
*/* If none of the following bits is on, then selection will be as   */ 14890000
*/* if ALL of the bits are on.                                       */ 14900000
*     2       STATSEL2    BIT(8),    /* More Job selection flags     */ 14910000
*       3       STATSSTC  BIT(1),    /* Select Started Tasks (STCs)     14920000
*                                       (see note in STATSTYP)       */ 14930000
*       3       STATSTSU  BIT(1),    /* Select Time Sharing Users       14940000
*                                       (TSUs) (see note in STATSTYP)*/ 14950000
*       3       STATSJOB  BIT(1),    /* Select batch jobs (JOBs)        14960000
*                                       (see note in STATSTYP)       */ 14970000
*       3       STATSAPC  BIT(1),    /* Select APPC Initiator           14980000
*                                       (see note in STATSTYP)       */ 14990000
*       3       *         BIT(4),    /* Reserved for future JOB types   15000000
*                                       and must be zero             */ 15010000
*     2       STATSEL3    BIT(8),    /* More job selection flags     */ 15020000
*       3       STATSPRI  BIT(1),    /* Use STATPRIO as a filter     */ 15030000
*       3       STATSVOL  BIT(1),    /* Select Jobs based on the volume 15040000
*                                       serial list in STATVOL       */ 15050000
*       3       STATSPHZ  BIT(1),    /* Use STATPHAZ as a filter     */ 15060000
*/* Note: If the following two bits are both on or both off then the */ 15070000
*/* hold state of the job will not be considered.                    */ 15080000
*       3       STATSHLD  BIT(1),    /* Select jobs which are held   */ 15090000
*       3       STATSNHL  BIT(1),    /* Select jobs which are not       15100000
*                                       held                         */ 15110000
*       3       STATSSYS  BIT(1),    /* Select jobs which are           15120000
*                                       active on STATSYS            */ 15130000
*       3       STATSMEM  BIT(1),    /* Select jobs which are           15140000
*                                       active on STATMEMB           */ 15150000
*       3       STATSPOS  BIT(1),    /* Return queue pos     @R04LSDS*/ 15160000
*     2       STATSEL4    BIT(8),    /* More job selection flags     */ 15170000
*       3       STATSORG  BIT(1),    /* Use STATORGN as a filter     */ 15180000
*       3       STATSXEQ  BIT(1),    /* Use STATXEQN as a filter     */ 15190000
*       3       STATSSRV  BIT(1),    /* Use STATSRVC as a filter     */ 15200000
*       3       STATSSEN  BIT(1),    /* Use STATSENV as a filter     */ 15210000
*       3       *         BIT(4),    /* Reserved for future use      */ 15220000
*     2       STATSSL1    BIT(8),    /* SYSOUT selection flag           15230000
*                                                            @R05LOPI*/ 15240000
*       3       STATSCTK  BIT(1),    /* Use STATCTKN as a filter.       15250000
*                                       Mutually exclusive with         15260000
*                                       STATSJBI             @R05LOPI*/ 15270000
*       3       STATSSOW  BIT(1),    /* Use STATSCRE as a filter        15280000
*                                                            @R05LOPI*/ 15290000
*       3       STATSSDS  BIT(1),    /* Use STATSDES as a filter        15300000
*                                                            @R05LOPI*/ 15310000
*       3       STATSSCL  BIT(1),    /* Use STATSCLA as a filter        15320000
*                                                            @R05LOPI*/ 15330000
*       3       STATSSWR  BIT(1),    /* Use STATSWTR as a filter        15340000
*                                                            @R05LOPI*/ 15350000
* /* STATSSHL and STATSSNH refer to the HOLD state of the SYSOUT.    */ 15360000
* /* Hold in this case refers to the hold set by HOLD=YES on the     */ 15370000
* /* DD card (or OUTDISP=HOLD on the OUTPUT card).           @R05LOPI*/ 15380000
* /* Note: If the following two bits are both on or both off then    */ 15390000
* /* the hold state of the SYSOUT will not be considered.    @R05LOPI*/ 15400000
*       3       STATSSHL  BIT(1),    /* Select held SYSOUT              15410000
*                                                            @R05LOPI*/ 15420000
*       3       STATSSNH  BIT(1),    /* Select non-held SYSOUT          15430000
*                                                            @R05LOPI*/ 15440000
*       3       *         BIT(1),    /* Reserved for future use         15450000
*                                                            @R05LOPI*/ 15460000
*     2       *           BIT(8),    /* Reserved for future use      */ 15470000
*     2       STATJOBN    CHAR(8),   /* Jobname used for selection      15480000
*                                       (if STATSJBN on).            */ 15490000
*     2       STATJBIL    CHAR(8),   /* Low jobid used for selection    15500000
*                                       (if STATSJBI on).            */ 15510000
*     2       STATJBIH    CHAR(8),   /* High jobid used for selection   15520000
*                                       (if STATSJBI on).  This value   15530000
*                                       must be null or at least as     15540000
*                                       high as STATJBIL.            */ 15550000
*     2       STATOJBI    CHAR(8),   /* Original job id for selection   15560000
*                                       (if STATSOJI on).            */ 15570000
*     2       STATOWNR    CHAR(8),   /* Owning userid used for          15580000
*                                       selection (if STATSOWN on)   */ 15590000
*     2       STATSECL    CHAR(8),   /* SECLABEL used for selection     15600000
*                                       (if STATSSEC on)             */ 15610000
*     2       STATDEST    CHAR(18),  /* Default print or punch          15620000
*                                       destination value used for      15630000
*                                       selection (if STATSDST on).  */ 15640000
*     2       STATORGN    CHAR(8),   /* Origin node name for selection  15650000
*                                       (if STATSORG on)             */ 15660000
*     2       STATXEQN    CHAR(8),   /* Execution node name for         15670000
*                                       selection (if STATSXEQ on)   */ 15680000
*     2       STATCLSL    CHAR(8),   /* Job class used for selection.   15690000
*                                       The job class is 1 to 8         15700000
*                                       characters in length         */ 15710000
*     2       STATVOL(4)  CHAR(6),   /* List of SPOOL volume serial     15720000
*                                       numbers. When STATSVOL is on,   15730000
*                                       jobs are selected if and only   15740000
*                                       if the job has output on at     15750000
*                                       least one of the volumes        15760000
*                                       listed. (JES2 only)          */ 15770000
*     2       STATSYS     CHAR(8),   /* MVS system name where job is    15780000
*                                       active.  Used for selection     15790000
*                                       if STASSYS is on             */ 15800000
*     2       STATMEMB    CHAR(8),   /* JES member name where job is    15810000
*                                       active.  Used for selection     15820000
*                                       if STASMEM is on             */ 15830000
*     2       STATPRIO    FIXED(8),  /* Job Priority used for           15840000
*                                       selection (if STATSPRI is on)*/ 15850000
*     2       STATPHAZ    FIXED(8),  /* Job phase.  When STATSPHZ is    15860000
*                                       on jobs are selected if and     15870000
*                                       only if they are in this        15880000
*                                       phase.                       */ 15890000
*/********************************************************************/ 15900000
*/*      The following fields are only honored if the input          */ 15910000
*/*      version is at least version 2 and the JES                   */ 15920000
*/*      processing the request is at least at a version 2           */ 15930000
*/*      level of support.                                           */ 15940000
*/********************************************************************/ 15950000
*     2       STATSRVC    CHAR(8),   /* WLM service class for           15960000
*                                       selection (if STATSSRV is       15970000
*                                       on)                          */ 15980000
*     2       STATSENV    CHAR(16),  /* WLM Scheduling environ          15990000
*                                       for selection (if               16000000
*                                       STATSSEN is on)              */ 16010000
*/********************************************************************/ 16020000
*/*      Instead of passing data back to the processing              */ 16030000
*/*      routine in storage obtained by the subsystem, data          */ 16040000
*/*      can be passed to a processing routine one block at          */ 16050000
*/*      a time.  The processing routine is given control in         */ 16060000
*/*      AMODE 31 with a PSW key and supervisor state of the         */ 16070000
*/*      caller of the SSI.  The register convention are as          */ 16080000
*/*      follows:                                                    */ 16090000
*/*                                                                  */ 16100000
*/*  R0        n/a                                                   */ 16110000
*/*  R1        STATPARM parm list address                            */ 16120000
*/*  R2-R12    n/a                                                   */ 16130000
*/*  R13       Available save area                                   */ 16140000
*/*  R14       return address                                        */ 16150000
*/*  R15       entry address                                         */ 16160000
*/*                                                                  */ 16170000
*/*      Note: Even if you use a processing routine, you             */ 16180000
*/*      still must make a memory management call.                   */ 16190000
*/********************************************************************/ 16200000
*     2       STATRTN     PTR(31),   /* Data processing routine      */ 16210000
*     2       STATRPRM    FIXED(31), /* Routine parameter area       */ 16220000
*     2       *(4)        FIXED(31), /* Reserved for future use and     16230000
*                                       must be zero                 */ 16240000
*/********************************************************************/ 16250000
*/*      Begin output-only fields                                    */ 16260000
*/********************************************************************/ 16270000
*     2       STATJOBF    PTR(31),   /* Address of first Job Queue      16280000
*                                       Element                      */ 16290000
*     2       STATNRJQ    FIXED(31), /* Number of jobs found         */ 16300000
*     2       *           FIXED(31), /* Reserved for future use and     16310000
*                                       must be zero                 */ 16320000
*     2 STATPERF CHAR(8) BDY(DWORD), /* Performance index for last      16330000
*                                       performed request            */ 16340000
*     2       *(12)       FIXED(31), /* Reserved for future use and     16350000
*                                       must be zero.                */ 16360000
*     2       *  CHAR(0) BDY(DWORD), /* Ensure size Dword aligned       16370000
*                                                            @R05LOPI*/ 16380000
*     2       STATCTKN   PTR(31),    /* Address of client token         16390000
*                                       for selection (if STATSCTK      16400000
*                                       on).                 @R05LOPI*/ 16410000
*     2       STATSCRE   CHAR(8),    /* SYSOUT owner (creator) for      16420000
*                                       selection (if STATSSOW on)      16430000
*                                                            @R05LOPI*/ 16440000
*     2       STATSDES   CHAR(18),   /* SYSOUT destination for          16450000
*                                       selection (if STATSSDS on)      16460000
*                                                            @R05LOPI*/ 16470000
*     2       STATSCLA   CHAR(8),    /* SYSOUT class for selection      16480000
*                                       (if STATSSCL on)     @R05LOPI*/ 16490000
*     2       STATSWTR   CHAR(8),    /* SYSOUT writer name for          16500000
*                                       selection (if STATSSWR on)      16510000
*                                                            @R05LOPI*/ 16520000
*     2       *(32)      FIXED(31);  /* Reserved for future use and     16530000
*                                       must be zero.        @R05LOPI*/ 16540000
*/********************************************************************/ 16550000
*/*                                                                  */ 16560000
*/*      STATPARM DSECT is passed to the processing routine          */ 16570000
*/*      in register 1.                                              */ 16580000
*/*                                                                  */ 16590000
*/*      STATPWRK is set to zero the first time the routine          */ 16600000
*/*      is called and then not reset until all elements for         */ 16610000
*/*      a particular subsystem are processed.  The routine          */ 16620000
*/*      can use this to pass data between calls (until              */ 16630000
*/*      a second subsystem starts processing the request).          */ 16640000
*/********************************************************************/ 16650000
*  DECLARE                                                              16660000
*   1       STATPARM      BASED,     /* Routine parm list            */ 16670000
*     2       STATPSIZ    FIXED(15), /* Size of parameter list       */ 16680000
*     2       STATPVER    FIXED(15), /* Copy of STATVERO             */ 16690000
*     2       STATPPRM    FIXED(31), /* Parm passed in STATRPRM      */ 16700000
*     2       STATPWRK    FIXED(31), /* Work area                    */ 16710000
*     2       STATPELM    PTR(31);   /* Addr of Job Queue Element    */ 16720000
*/********************************************************************/ 16730000
*/*      Job Queue Element prologue                                  */ 16740000
*/*                                                                  */ 16750000
*/*      Data returned from this interface has the following         */ 16760000
*/*      format:                                                     */ 16770000
*/*                                                                  */ 16780000
*/*      +----------------+   +-->+----------------+                 */ 16790000
*/*      |Job data prolog |   |   |Job data prolog |                 */ 16800000
*/*      |STJQNEXT       -----+   |STJQNEXT       ---->0             */ 16810000
*/*      |+--------------+|       |+--------------+|                 */ 16820000
*/*      ||Job data hdr  ||       ||Job data hdr  ||                 */ 16830000
*/*      ||+------------+||       ||+------------+||                 */ 16840000
*/*      |||Terse data  |||       |||Terse data  |||                 */ 16850000
*/*      ||+------------+||       ||+------------+||                 */ 16860000
*/*      ||+------------+||       ||+------------+||                 */ 16870000
*/*      |||Other data  |||       |||Other data  |||                 */ 16880000
*/*      ||+------------+||       ||+------------+||                 */ 16890000
*/*      |+--------------+|       |+--------------+|                 */ 16900000
*/*      +----------------+       +----------------+                 */ 16910000
*/*                                                                  */ 16920000
*/*      STJQNEXT is a pointer linking job information areas         */ 16930000
*/*      together.  To get from the prolog to the job data           */ 16940000
*/*      header, use the STJQOHDR field.  To get from the            */ 16950000
*/*      Job header data to the terse data section, use the          */ 16960000
*/*      STHDSIZE equate.  To move from section to section           */ 16970000
*/*      add the section length (eg STTRLEN) to the start            */ 16980000
*/*      of a section.                                               */ 16990000
*/*                                                                  */ 17000000
*/********************************************************************/ 17010000
*  DECLARE                                                              17020000
*   1       STATJQ        BASED,     /* Job Section prolog           */ 17030000
*     2       STJQEYE     CHAR(4),   /* Eye catcher                  */ 17040000
*     2       STJQOHDR    FIXED(15), /* Offset to first section      */ 17050000
*     2       *           FIXED(15), /* Reserved for future use      */ 17060000
*     2       STJQNEXT    PTR(31),   /* Address of next Job Queue       17070000
*                                       Element                      */ 17080000
*     2       STJQSE      PTR(31),   /* Address of first SYSOUT         17090000
*                                       element              @R05LOPI*/ 17100000
*     2       STJQOSS     CHAR(4),   /* Name of Subsystem which         17110000
*                                       created this Job Queue          17120000
*                                       Element                      */ 17130000
*     2       *           FIXED(31); /* Reserved for future use      */ 17140000
*/********************************************************************/ 17150000
*/*      Section type flags                                          */ 17160000
*/*                                                                  */ 17170000
*/*      General conventions for section number assignment           */ 17180000
*/*      Bits  Value  meaning                                        */ 17190000
*/*      ----  -----  -------------------------------------          */ 17200000
*/*      0-1   00     job level section                              */ 17210000
*/*            01     SYSOUT level section                   @R05LOPI*/ 17220000
*/*      2     0      quick/terse data section               @R05LOPI*/ 17230000
*/*            1      reserved                                       */ 17240000
*/*      3-7   00000  overall header section                         */ 17250000
*/*            xxxxx  section number                                 */ 17260000
*/********************************************************************/ 17270000
* DCL STHD1HDR FIXED(8) CONSTANT('00'X); /* First Header Section type*/ 17280000
* DCL STTRTERS FIXED(8) CONSTANT('01'X); /* Job level terse section  */ 17290000
* DCL STJ2TERS FIXED(8) CONSTANT('02'X); /* JES2 Terse section type  */ 17300000
* DCL STAFFIN  FIXED(8) CONSTANT('03'X); /* Affinity section type    */ 17310000
* DCL STSCHED  FIXED(8) CONSTANT('04'X); /* Scheduling sect  @R04LSDS*/ 17320000
* DCL STSH1HDR FIXED(8) CONSTANT('40'X); /* First SYSOUT section type   17330000
*                                                            @R05LOPI*/ 17340000
* DCL STSTTERS FIXED(8) CONSTANT('41'X); /* SYSOUT level terse          17350000
*                                           section          @R05LOPI*/ 17360000
* DCL STS2TERS FIXED(8) CONSTANT('42'X); /* JES2 SYSOUT section         17370000
*                                                            @R05LOPI*/ 17380000
* DCL STS3TERS FIXED(8) CONSTANT('43'X); /* JES3 SYSOUT section         17390000
*                                                            @R05LOPI*/ 17400000
*/********************************************************************/ 17410000
*/*                                                                  */ 17420000
*/*      Job Queue Element First Header Section                      */ 17430000
*/*                                                                  */ 17440000
*/********************************************************************/ 17450000
* DCL STHD1MOD FIXED(8) CONSTANT(0); /* First Header Section            17460000
*                                       modifier                     */ 17470000
*  DECLARE                                                              17480000
*   1       STATJQHD      BASED,     /* Job data section header      */ 17490000
*     2       STHDLEN     FIXED(16), /* Length of entire job header     17500000
*                                       (Max value is 65535)         */ 17510000
*     2       STHDTYPE    FIXED(8),  /* Type of this header          */ 17520000
*     2       STHDMOD     FIXED(8);  /* Modifier                     */ 17530000
* DCL STHDSIZE FIXED(15) CONSTANT(LENGTH(STATJQHD));  /* Size of        17540000
*                                           First Header Section     */ 17550000
*/********************************************************************/ 17560000
*/*                                                                  */ 17570000
*/*      Job Queue Element Quick/Terse Section                       */ 17580000
*/*                                                                  */ 17590000
*/*      Data in this section is "easy" for the JES to               */ 17600000
*/*      fetch.  No disk I/O is necessary to get this                */ 17610000
*/*      information.  At least one terse section is always          */ 17620000
*/*      returned.                                                   */ 17630000
*/*                                                                  */ 17640000
*/********************************************************************/ 17650000
* DCL STTRTMOD FIXED(8) CONSTANT(0); /* Terse section modifier       */ 17660000
*  DECLARE                                                              17670000
*   1       STATJQTR      BASED,     /* Job data terse section       */ 17680000
*     2       STTRLEN     FIXED(16), /* Length of terse section      */ 17690000
*     2       STTRTYPE    FIXED(8),  /* Type of this header          */ 17700000
*     2       STTRMOD     FIXED(8),  /* Modifier                     */ 17710000
*     2       STTRNAME    CHAR(8),   /* Job Name                     */ 17720000
*     2       STTRJID     CHAR(8),   /* Job Identifier               */ 17730000
*     2       STTROJID    CHAR(8),   /* Original Job Identifier      */ 17740000
*     2       STTRCLAS    CHAR(8),   /* Job Class                    */ 17750000
*     2       STTRONOD    CHAR(8),   /* Origin Node (node of            17760000
*                                       submittal)                   */ 17770000
*     2       STTRXNOD    CHAR(8),   /* Execution Node               */ 17780000
*     2       STTRPRND    CHAR(8),   /* Default Print Node           */ 17790000
*     2       STTRPRRE    CHAR(8),   /* Default Print Remote Name    */ 17800000
*     2       STTRPUND    CHAR(8),   /* Default Punch Node           */ 17810000
*     2       STTRPURE    CHAR(8),   /* Default Punch Remote Name    */ 17820000
*     2       STTROUID    CHAR(8),   /* Owner userid                 */ 17830000
*     2       STTRSECL    CHAR(8),   /* SECLABEL for job             */ 17840000
*     2       STTRSYS     CHAR(8),   /* MVS system on which the job     17850000
*                                       is active (blanks if not        17860000
*                                       active)                      */ 17870000
*     2       STTRMEM     CHAR(8),   /* JES2 member on which the job    17880000
*                                       is active (blanks if not        17890000
*                                       active)                      */ 17900000
*     2       STTRDEVN    CHAR(18),  /* Name of device job is active    17910000
*                                       on (if job is active on a       17920000
*                                       device)                      */ 17930000
*     2       STTRPHAZ    FIXED(8),  /* Phase job is in (see STAT_      17940000
*                                       constants above for an          17950000
*                                       enumeration)                 */ 17960000
*     2       STTRHOLD    FIXED(8),  /* Job hold indicator           */ 17970000
*     2       STTRJTYP    FIXED(8),  /* Job type                     */ 17980000
*     2       STTRPRIO    FIXED(8),  /* Job priority                 */ 17990000
*     2       STTRARMS    BIT(8),    /* Jobs ARM status              */ 18000000
*       3       STTRARMR  BIT(1),    /* Job is ARM registered        */ 18010000
*       3       STTRARMW  BIT(1),    /* Job is awaiting ARM restart  */ 18020000
*       3       *         BIT(6),    /* Reserved                     */ 18030000
*     2       *           CHAR(1),   /* Reserved             @R04LSDS*/ 18040000
*     2       STTRMXRC    FIXED(32), /* Max return code      @R04LSDS*/ 18050000
*       3     STTRXIND    FIXED(8),  /* Job completion ind   @R04LSDS*/ 18060000
*       3     STTRMXCC    FIXED(24); /* Completion code      @R04LSDS*/ 18070000
*/*------------------------------------------------------------------*/ 18080000
*/*   Job Hold Indicator (STTRHOLD) constants                        */ 18090000
*/*------------------------------------------------------------------*/ 18100000
* DCL STTRJNHL FIXED(8) CONSTANT(1); /* Job is not held              */ 18110000
* DCL STTRJHLD FIXED(8) CONSTANT(2); /* Job is held                  */ 18120000
* DCL STTRJDUP FIXED(8) CONSTANT(3); /* Job held for duplicate job      18130000
*                                       name                         */ 18140000
*/*------------------------------------------------------------------*/ 18150000
*/*   Job Type (STTRJTYP) constants                                  */ 18160000
*/*------------------------------------------------------------------*/ 18170000
* DCL STTRSTC  FIXED(8) CONSTANT(1); /* Started Task (STC)           */ 18180000
* DCL STTRTSU  FIXED(8) CONSTANT(2); /* Time Sharing User (TSU)      */ 18190000
* DCL STTRJOB  FIXED(8) CONSTANT(3); /* Batch job (JOB)              */ 18200000
* DCL STTRAPPC FIXED(8) CONSTANT(4); /* APPC Initiator               */ 18210000
*/*--------------------------------------------------------- @R04LSDS*/ 18220000
*/*   Job Completion indicator (STTRXIND) constants.         @R04LSDS*/ 18230000
*/*   Values with a '+' also have a corresponding value set  @R04LSDS*/ 18240000
*/*   in STTRMXCC.                                           @R04LSDS*/ 18250000
*/*--------------------------------------------------------- @R04LSDS*/ 18260000
* DCL STTRXUNK FIXED(8) CONSTANT(0); /* No completion info   @R04LSDS*/ 18270000
* DCL STTRXNRM FIXED(8) CONSTANT(1); /* Job ended normally + @R04LSDS*/ 18280000
* DCL STTRXCC  FIXED(8) CONSTANT(2); /* Job ended by CC    + @R04LSDS*/ 18290000
* DCL STTRXJCL FIXED(8) CONSTANT(3); /* Job had a JCL error  @R04LSDS*/ 18300000
* DCL STTRXCAN FIXED(8) CONSTANT(4); /* Job was canceled     @R04LSDS*/ 18310000
* DCL STTRXABN FIXED(8) CONSTANT(5); /* Job ABENDed        + @R04LSDS*/ 18320000
* DCL STTRXCAB FIXED(8) CONSTANT(6); /* Converter ABENDed    @R04LSDS*/ 18330000
* DCL STTRXSEC FIXED(8) CONSTANT(7); /* Security error       @R04LSDS*/ 18340000
* DCL STTRXEOM FIXED(8) CONSTANT(8); /* Job failed in EOM  + @R04LSDS*/ 18350000
*/********************************************************************/ 18360000
*/*      Job Queue Element JES2 Terse Section                        */ 18370000
*/*                                                                  */ 18380000
*/*      This section contains general information that is           */ 18390000
*/*      only meaningful if the job is owned by a JES2               */ 18400000
*/*      subsystem.                                                  */ 18410000
*/********************************************************************/ 18420000
* DCL STJ2TMOD FIXED(8) CONSTANT(0); /* JES2 terse section modifier  */ 18430000
*  DECLARE                                                              18440000
*   1       STATJ2TR      BASED,     /* JES2 terse data area         */ 18450000
*     2       STJ2LEN     FIXED(16), /* Length of JES2 terse section */ 18460000
*     2       STJ2TYPE    FIXED(8),  /* Type of this header          */ 18470000
*     2       STJ2MOD     FIXED(8),  /* Modifier                     */ 18480000
*     2       STJ2FLG1    BIT(8),    /* General flag byte            */ 18490000
*       3       STJ21PRO  BIT(1),    /* Job is protected             */ 18500000
*       3       STJ21IND  BIT(1),    /* Job is set to independent       18510000
*                                       mode                         */ 18520000
*       3       STJ21SYS  BIT(1),    /* Job represents a system         18530000
*                                       data set                     */ 18540000
*       3       STJ21CNW  BIT(1),    /* Job can be converted only       18550000
*                                       by CNVT PCEs that can           18560000
*                                       wait for OS resources        */ 18570000
*       3       *         BIT(4),    /* Reserved                     */ 18580000
*     2       *           CHAR(3),   /* Reserved for future use      */ 18590000
*     2       STJ2JKEY    FIXED(32), /* Job key                      */ 18600000
*     2       STJ2SPOL    CHAR(8),   /* Spool data token             */ 18610000
*     2       STJ2SPAC    FIXED(31); /* Number of track groups of       18620000
*                                       spool space used by this job    18630000
*                                       (if set to -1 then count not    18640000
*                                       available)                   */ 18650000
*/********************************************************************/ 18660000
*/*      Job Queue Element member affinity section                   */ 18670000
*/*                                                                  */ 18680000
*/*      This section describes the system affinity assigned         */ 18690000
*/*      to a job.  This section is present only if there            */ 18700000
*/*      is an affinity assigned to the job                          */ 18710000
*/********************************************************************/ 18720000
* DCL STAFTMOD FIXED(8) CONSTANT(0); /* Affinity section modifier    */ 18730000
*  DECLARE                                                              18740000
*   1       STATAFFS      BASED,     /* Member affinity data area    */ 18750000
*     2       STAFLEN     FIXED(16), /* Length of affinity section   */ 18760000
*     2       STAFTYPE    FIXED(8),  /* Type of this header          */ 18770000
*     2       STAFMOD     FIXED(8),  /* Modifier                     */ 18780000
*     2       STAFNUM     FIXED(16), /* Number of member names       */ 18790000
*     2       *           FIXED(16), /* Reserved                     */ 18800000
*     2       STAFMEMB(*) CHAR(8);   /* First member name    @R04LSDS*/ 18810000
*/********************************************************** @R04LSDS*/ 18820000
*/*      Job Queue Element execution scheduling section      @R04LSDS*/ 18830000
*/*                                                          @R04LSDS*/ 18840000
*/*      This section describes information for jobs         @R04LSDS*/ 18850000
*/*      scheduled for execution.  There are 2 modifiers for @R04LSDS*/ 18860000
*/*      this section.  The first is for the basic           @R04LSDS*/ 18870000
*/*      scheduling parameters, the second is a list of      @R04LSDS*/ 18880000
*/*      system where the required scheduling environment is @R04LSDS*/ 18890000
*/*      available.  This section is present only for jobs   @R04LSDS*/ 18900000
*/*      that have not completed execution.                  @R04LSDS*/ 18910000
*/********************************************************** @R04LSDS*/ 18920000
* DCL STSCTMOD FIXED(8) CONSTANT(0); /* Sched sect modifier  @R04LSDS*/ 18930000
*  DECLARE                                                              18940000
*   1       STATSCHD      BASED,     /* Scheduling section   @R04LSDS*/ 18950000
*     2       STSCLEN     FIXED(16), /* Len of sched data    @R04LSDS*/ 18960000
*     2       STSCTYPE    FIXED(8),  /* Type of this header  @R04LSDS*/ 18970000
*     2       STSCMOD     FIXED(8),  /* Modifier             @R04LSDS*/ 18980000
*     2       STSCAHLD    BIT(8),    /* Why job won't run    @R04LSDS*/ 18990000
*       3       STSCJCLS  BIT(1),    /* Job class held       @R04LSDS*/ 19000000
*       3       STSCJCLM  BIT(1),    /* Jobclass lmt reached @R04LSDS*/ 19010000
*       3       STSCJSCH  BIT(1),    /* Scheduling environ   @R04LSDS*/ 19020000
*       3       STSCJAFF  BIT(1),    /* System affinity      @R04LWLM*/ 19030000
*       3       STSCJSPL  BIT(1),    /* SPOOLs not available @R04LWLM*/ 19040000
*       3       STSCJBSY  BIT(1),    /* Job busy on device   @R04LWLM*/ 19050000
*       3       *         BIT(1),    /* Reserved             @R04LWLM*/ 19060000
*       3       STSCNOSY  BIT(1),    /* No system with the              19070000
*                                        right combination              19080000
*                                        of resources        @R04LWLM*/ 19090000
*     2       STSCFLG1    BIT(8),    /* Flag byte            @R04LSDS*/ 19100000
*       3       STSC1JCM  BIT(1),    /* Jobclass mode of JQE @R04LSDS*/ 19110000
*                                    /* Off = JES, On = WLM  @R04LSDS*/ 19120000
*       3       *         BIT(7),    /* Reserved             @R04LSDS*/ 19130000
*     2       *           CHAR(2),   /* Reserved             @R04LSDS*/ 19140000
*     2       STSCSRVC    CHAR(8),   /* WLM service class    @R04LSDS*/ 19150000
*/*--------------------------------------------------------- @R04LSDS*/ 19160000
*/*      STSCESTT is the estimated time to execution.  This  @R04LSDS*/ 19170000
*/*      value is only available if the following are true:  @R04LSDS*/ 19180000
*/*       - Job is awaiting execution                        @R04LSDS*/ 19190000
*/*       - Job is scheduled to a WLM managed job class      @R04LSDS*/ 19200000
*/*       - Job is not held (duplicate job name, operator    @R04LSDS*/ 19210000
*/*         hold, etc)                                       @R04LSDS*/ 19220000
*/*       - Member it has affinity to is available           @R04LSDS*/ 19230000
*/*       - The scheduling environment is available          @R04LSDS*/ 19240000
*/*--------------------------------------------------------- @R04LSDS*/ 19250000
*     2       STSCESTT    FIXED(31), /* Estimated time to               19260000
*                                       execution in seconds @R04P589*/ 19270000
*     2       STSCSENV    CHAR(16),  /* WLM Scheduling env   @R04LSDS*/ 19280000
*/*--------------------------------------------------------- @R04LSDS*/ 19290000
*/*      STSCQPOS is the position of the job on the WLM      @R04LSDS*/ 19300000
*/*      service class queue.  STSCQNUM is the total number  @R04LSDS*/ 19310000
*/*      of jobs on the service class queue.  Jobs which     @R04LSDS*/ 19320000
*/*      are not currently eligible to execute are not       @R04LSDS*/ 19330000
*/*      included in these counts.  The count values are     @R04LSDS*/ 19340000
*/*      only returned if the flag STATSPOS is set in        @R04LSDS*/ 19350000
*/*      STATSEL3 on input.                                  @R04LSDS*/ 19360000
*/*      These values are only set to a non-zero value       @R04LSDS*/ 19370000
*/*      when the following are true:                        @R04LSDS*/ 19380000
*/*       - Job is awaiting execution                        @R04LSDS*/ 19390000
*/*       - Job is scheduled to a WLM managed job class      @R04LSDS*/ 19400000
*/*       - Job is not held (job hold or class queue hold)   @R04LSDS*/ 19410000
*/*       - Member it has affinity to is available           @R04LSDS*/ 19420000
*/*       - The scheduling environment is available          @R04LSDS*/ 19430000
*/*--------------------------------------------------------- @R04LSDS*/ 19440000
*     2       STSCQPOS    FIXED(31), /* Queue position       @R04LSDS*/ 19450000
*     2       STSCQNUM    FIXED(31), /* Queue length         @R04LSDS*/ 19460000
*     2       STSCQACT    FIXED(31), /* Active on queue      @R04P651*/ 19470000
*/*----------------------------------------------------------@R04P651*/ 19480000
*/*      STSCAVGQ and STSCQDLY are the component parts used  @R04P651*/ 19490000
*/*      in calculating the estimated time to execution,     @R04P651*/ 19500000
*/*      and are set only when STSCESTT is also set.         @R04P651*/ 19510000
*/*----------------------------------------------------------@R04P651*/ 19520000
*     2       STSCAVGQ    FIXED(31), /* Averege queue time   @R04P651*/ 19530000
*     2       STSCQTIM    FIXED(31); /* Queue time for job   @R04P651*/ 19540000
*/*--------------------------------------------------------- @R04LSDS*/ 19550000
*/*      This section lists the system names on which the    @R04LSDS*/ 19560000
*/*      scheduling environment required by the job is       @R04LSDS*/ 19570000
*/*      available.  This section is only returned if the    @R04LSDS*/ 19580000
*/*      job requires a scheduling environment and that      @R04LSDS*/ 19590000
*/*      environment is available on at least one system.    @R04LSDS*/ 19600000
*/*--------------------------------------------------------- @R04LSDS*/ 19610000
* DCL STSSTMOD FIXED(8) CONSTANT(1); /* Sched sys modifier   @R04LSDS*/ 19620000
*  DECLARE                                                              19630000
*   1       STATSCHS      BASED,     /* Sched systems sect   @R04LSDS*/ 19640000
*     2       STSSLEN     FIXED(16), /* Length of sched sys  @R04LSDS*/ 19650000
*     2       STSSTYPE    FIXED(8),  /* Type of this header  @R04LSDS*/ 19660000
*     2       STSSMOD     FIXED(8),  /* Modifier             @R04LSDS*/ 19670000
*     2       STSSNUM     FIXED(16), /* Numb of system names @R04LSDS*/ 19680000
*     2       *           FIXED(16), /* Reserved             @R04LSDS*/ 19690000
*     2       STSSSYS(*)  CHAR(8);   /* First system name    @R04LSDS*/ 19700000
*/********************************************************************/ 19710000
*/*                                                          @R05LOPI*/ 19720000
*/*      SYSOUT element prologue                             @R05LOPI*/ 19730000
*/*                                                          @R05LOPI*/ 19740000
*/*      SYSOUT data returned via this interface is chained  @R05LOPI*/ 19750000
*/*      from a job queue element as follows:                @R05LOPI*/ 19760000
*/*                                                          @R05LOPI*/ 19770000
*/* +--->+----------------+   +-->+----------------+         @R05LOPI*/ 19780000
*/* |    |Job data prolog |   |   |Job data prolog |         @R05LOPI*/ 19790000
*/* |    |STJQNEXT       -----+   |STJQNEXT       ---->0     @R05LOPI*/ 19800000
*/* | +---STJQSE          |       |STJQSE         ---->....  @R05LOPI*/ 19810000
*/* | |  |  :             |       |  :             |         @R05LOPI*/ 19820000
*/* | |  |  :             |       |  :             |         @R05LOPI*/ 19830000
*/* | |  +----------------+       +----------------+         @R05LOPI*/ 19840000
*/* | |                                                      @R05LOPI*/ 19850000
*/* | +->+----------------+   +-->+----------------+         @R05LOPI*/ 19860000
*/* |    |SYSOUT prologue |   |   |SYSOUT prologue |         @R05LOPI*/ 19870000
*/* |    |STSEJNXT       -----+   |STSEJNXT       ---->0     @R05LOPI*/ 19880000
*/* +-----STSEJOB-------------<----STSEJOB         |         @R05LOPI*/ 19890000
*/*      |+--------------+|       |+--------------+|         @R05LOPI*/ 19900000
*/*      ||SYSOUT header ||       ||SYSOUT header ||         @R05LOPI*/ 19910000
*/*      ||+------------+||       ||+------------+||         @R05LOPI*/ 19920000
*/*      |||Terse data  |||       |||Terse data  |||         @R05LOPI*/ 19930000
*/*      ||+------------+||       ||+------------+||         @R05LOPI*/ 19940000
*/*      ||+------------+||       ||+------------+||         @R05LOPI*/ 19950000
*/*      |||Other data  |||       |||Other data  |||         @R05LOPI*/ 19960000
*/*      ||+------------+||       ||+------------+||         @R05LOPI*/ 19970000
*/*      |+--------------+|       |+--------------+|         @R05LOPI*/ 19980000
*/*      +----------------+       +----------------+         @R05LOPI*/ 19990000
*/*                                                          @R05LOPI*/ 20000000
*/*      STJQSE points to the first SYSOUT prologue.         @R05LOPI*/ 20010000
*/*      STSEJNXT is a pointer linking SYSOUT information    @R05LOPI*/ 20020000
*/*      areas for a job together.  To get from the SYSOUT   @R05LOPI*/ 20030000
*/*      prologue to the SYSOUT data header, use the         @R05LOPI*/ 20040000
*/*      STSEOHDR field.  To get from the SYSOUT header data @R05LOPI*/ 20050000
*/*      to the terse data section, use the STSHSIZE equate. @R05LOPI*/ 20060000
*/*      To move from section to section add the section     @R05LOPI*/ 20070000
*/*      length (eg STSTLEN) to the start of a section.      @R05LOPI*/ 20080000
*/*                                                          @R05LOPI*/ 20090000
*/********************************************************************/ 20100000
*  DECLARE                                                              20110000
*   1       STATSE        BASED,     /* SYSOUT data section prolog      20120000
*                                                            @R05LOPI*/ 20130000
*     2       STSEEYE     CHAR(4),   /* Eye catcher          @R05LOPI*/ 20140000
*     2       STSEOHDR    FIXED(15), /* Offset to first section         20150000
*                                                            @R05LOPI*/ 20160000
*     2       *           FIXED(15), /* Reserved for future use         20170000
*                                                            @R05LOPI*/ 20180000
*     2       STSEJNXT    PTR(31),   /* Address of next SYSOUT data     20190000
*                                       element              @R05LOPI*/ 20200000
*     2       STSEJOB     PTR(31),   /* Address of associated job       20210000
*                                       queue data element   @R05LOPI*/ 20220000
*     2       *           FIXED(31); /* Reserved for future use         20230000
*                                                            @R05LOPI*/ 20240000
*/********************************************************************/ 20250000
*/*                                                          @R05LOPI*/ 20260000
*/*      SYSOUT Element First Header Section                 @R05LOPI*/ 20270000
*/*                                                          @R05LOPI*/ 20280000
*/********************************************************************/ 20290000
* DCL STSH1MOD FIXED(8) CONSTANT(0); /* First Header Section            20300000
*                                       modifier             @R05LOPI*/ 20310000
*  DECLARE                                                              20320000
*   1       STATSEHD      BASED,     /* SYSOUT header section           20330000
*                                                            @R05LOPI*/ 20340000
*     2       STSHLEN     FIXED(16), /* Length of entire SYSOUT         20350000
*                                       header (max value is 65535)     20360000
*                                                            @R05LOPI*/ 20370000
*     2       STSHTYPE    FIXED(8),  /* Type of this header  @R05LOPI*/ 20380000
*     2       STSHMOD     FIXED(8);  /* Modifier             @R05LOPI*/ 20390000
* DCL STSHSIZE FIXED(15) CONSTANT(LENGTH(STATSEHD));  /* Size of 1st    20400000
*                                       Header Section       @R05LOPI*/ 20410000
*/********************************************************************/ 20420000
*/*                                                          @R05LOPI*/ 20430000
*/*      SYSOUT Element Quick/Terse Section                  @R05LOPI*/ 20440000
*/*                                                          @R05LOPI*/ 20450000
*/*      Data in this section is "easy" for the JES to       @R05LOPI*/ 20460000
*/*      fetch.  Minimal overhead is necessary to get this   @R05LOPI*/ 20470000
*/*      information.  At least one terse section is always  @R05LOPI*/ 20480000
*/*      returned if SYSOUT data was requested.              @R05LOPI*/ 20490000
*/*                                                          @R05LOPI*/ 20500000
*/********************************************************************/ 20510000
* DCL STSTTMOD FIXED(8) CONSTANT(0); /* Terse section modifier          20520000
*                                                            @R05LOPI*/ 20530000
*  DECLARE                                                              20540000
*   1       STATSETR      BASED,     /* SYSOUT terse section @R05LOPI*/ 20550000
*     2       STSTLEN     FIXED(16), /* Length of terse section         20560000
*                                                            @R05LOPI*/ 20570000
*     2       STSTTYPE    FIXED(8),  /* Type of this header  @R05LOPI*/ 20580000
*     2       STSTMOD     FIXED(8),  /* Modifier             @R05LOPI*/ 20590000
*     2       STSTOUID    CHAR(8),   /* SYSOUT owner (creator)          20600000
*                                                            @R05LOPI*/ 20610000
*     2       STSTSECL    CHAR(8),   /* SECLABEL for SYSOUT  @R05P404*/ 20620000
*     2       STSTDEST    CHAR(18),  /* SYSOUT destination   @R05LOPI*/ 20630000
*     2       STSTCLAS    CHAR(8),   /* SYSOUT class         @R05LOPI*/ 20640000
*     2       STSTNREC    FIXED(32) BDY(BYTE),                          20650000
*                                    /* Record count         @R05LOPI*/ 20660000
*     2       STSTPAGE    FIXED(32) BDY(BYTE),                          20670000
*                                    /* Page count           @R05LOPI*/ 20680000
*     2       STSTLNCT    FIXED(32) BDY(BYTE),                          20690000
*                                    /* Line count           @R05P404*/ 20700000
*     2       STSTBYCT(2) FIXED(32) BDY(BYTE),                          20710000
*                                    /* Byte count after blank          20720000
*                                       truncation, 63 bit right        20730000
*                                       justified            @R05P404*/ 20740000
*     2       STSTFORM    CHAR(8),   /* Forms                @R05LOPI*/ 20750000
*     2       STSTFCB     CHAR(8),   /* FCB                  @R05LOPI*/ 20760000
*     2       STSTUCS     CHAR(8),   /* UCS                  @R05LOPI*/ 20770000
*     2       STSTXWTR    CHAR(8),   /* External writer name @R05LOPI*/ 20780000
*     2       STSTPMDE    CHAR(8),   /* Processing mode      @R05LOPI*/ 20790000
*     2       STSTFLSH    CHAR(8),   /* Flash                @R05LOPI*/ 20800000
*     2       STSTCHAR(4) CHAR(4),   /* Printer translate table         20810000
*                                                            @R05P404*/ 20820000
*     2       STSTMODF    CHAR(4),   /* MODIFY=(modname)     @R05P404*/ 20830000
*     2       STSTMODC    FIXED(8),  /* MODIFY=(,trc)        @R05P404*/ 20840000
*     2       *           CHAR(3),   /* Reserved for future use         20850000
*                                                            @R05P404*/ 20860000
*     2       STSTSYS     CHAR(8),   /* MVS system on which the SYSOUT  20870000
*                                       is active (blanks if not        20880000
*                                       active)              @R05LOPI*/ 20890000
*     2       STSTMEM     CHAR(8),   /* JES member on which the SYSOUT  20900000
*                                       is active (blanks if not        20910000
*                                       active               @R05LOPI*/ 20920000
*     2       STSTDEVN    CHAR(18),  /* Name of device on which the     20930000
*                                       SYSOUT is active (blanks if     20940000
*                                       not active)          @R05LOPI*/ 20950000
*     2       STSTHSTA    BIT(8),    /* SYSOUT hold state    @R05LOPI*/ 20960000
*       3       STSTHOPR  BIT(1),    /* SYSOUT is held due to operator  20970000
*                                       command              @R05LOPI*/ 20980000
*       3       STSTHUSR  BIT(1),    /* SYSOUT is currently held (eg    20990000
*                                       HOLD=YES on the DD or OUTDISP=  21000000
*                                       HOLD or LEAVE)       @R05LOPI*/ 21010000
*       3       STSTHSYS  BIT(1),    /* SYSOUT is in a system hold      21020000
*                                       (see STSTHRSN for reason        21030000
*                                                            @R05LOPI*/ 21040000
*       3       STSTHTSO  BIT(1),    /* SYSOUT is held for TSO.         21050000
*                                       JES3 only            @R05P404*/ 21060000
*       3       STSTHXWT  BIT(1),    /* SYSOUT is held for external     21070000
*                                       writer.  JES3 only   @R05P404*/ 21080000
*       3       *         BIT(3),    /* Reserved             @R05P404*/ 21090000
*     2       STSTHRSN    FIXED(8),  /* Reason for system hold (see     21100000
*                                        fields OHLDJxxx in IAZOHLD     21110000
*                                        for meaning         @R05LOPI*/ 21120000
*     2       STSTDISP    BIT(8),    /* Output disposition   @R05P404*/ 21130000
*       3       STSTDHLD  BIT(1),    /* OUTDISP=HOLD         @R05P404*/ 21140000
*       3       STSTDLVE  BIT(1),    /* OUTDISP=LEAVE        @R05P404*/ 21150000
*       3       STSTDWRT  BIT(1),    /* OUTDISP=WRITE        @R05P404*/ 21160000
*       3       STSTDKEP  BIT(1),    /* OUTDISP=KEEP         @R05P404*/ 21170000
*       3       *         BIT(4),    /* Reserved             @R05P404*/ 21180000
*     2       STSTFLG1    BIT(8),    /* General flag bypte   @R05LOPI*/ 21190000
*       3       STST1BRT  BIT(1),    /* BURST=YES            @R05LOPI*/ 21200000
*       3       STST1DSI  BIT(1),    /* 3540 held data set   @R05LOPI*/ 21210000
*       3       STST1IPA  BIT(1),    /* Destination has an IPADDR       21220000
*                                                            @R05LOPI*/ 21230000
*       3       STST1CPD  BIT(1),    /* Schedulable element has page    21240000
*                                       mode date            @R05LOPI*/ 21250000
*       3       STST1SPN  BIT(1),    /* SPIN data set        @R05P404*/ 21260000
*       3       *         BIT(3),    /* Reserved             @R05P404*/ 21270000
*     2       STSTPRIO    FIXED(8),  /* SYSOUT priority      @R05LOPI*/ 21280000
*/********************************************************************/ 21290000
*/*                                                          @R05LOPI*/ 21300000
*/*      The SYSOUT identifier (STSTSOID) is a EBCDIC value  @R05LOPI*/ 21310000
*/*      associated with this SYSOUT that can be used in     @R05LOPI*/ 21320000
*/*      operator commands.  The exact contents vary based   @R05LOPI*/ 21330000
*/*      on whether JES2 or JES3 owns the SYSOUT and the     @R05LOPI*/ 21340000
*/*      release of JES processing the SSI request.          @R05LOPI*/ 21350000
*/*                                                          @R05LOPI*/ 21360000
*/********************************************************************/ 21370000
*     2       STSTSOID    CHAR(44),  /* EBCDIC SYSOUT identifier        21380000
*                                                            @R05LOPI*/ 21390000
*/********************************************************************/ 21400000
*/*                                                          @R05LOPI*/ 21410000
*/*      The SYSOUT client token (STSTCTKN) is a token that  @R05LOPI*/ 21420000
*/*      can be used on various APIs to access a specific    @R05LOPI*/ 21430000
*/*      piece of SYSOUT.  The token returned may NOT be the @R05LOPI*/ 21440000
*/*      same as the one returned on a SYSOUT allocation     @R05LOPI*/ 21450000
*/*      or used in ENF processing.  It may also be          @R05LOPI*/ 21460000
*/*      different from the TOKEN passed for selection in    @R05LOPI*/ 21470000
*/*      STATCTKN.  If you are tracking SYSOUT with a token  @R05LOPI*/ 21480000
*/*      received from allocation, do NOT replace it with    @R05LOPI*/ 21490000
*/*      this token.                                         @R05LOPI*/ 21500000
*/*                                                          @R05LOPI*/ 21510000
*/********************************************************************/ 21520000
*     2       STSTCTKN    CHAR(80);  /* SYSOUT client token  @R05LOPI*/ 21530000
*/********************************************************************/ 21540000
*/*                                                          @R05LOPI*/ 21550000
*/*      SYSOUT Element JES2 Terse Section                   @R05LOPI*/ 21560000
*/*                                                          @R05LOPI*/ 21570000
*/*      This section contains general information that is   @R05LOPI*/ 21580000
*/*      only meaningful if the job is owned by a JES2       @R05LOPI*/ 21590000
*/*      subsystem.                                          @R05LOPI*/ 21600000
*/*                                                          @R05LOPI*/ 21610000
*/********************************************************************/ 21620000
* DCL STS2TMOD FIXED(8) CONSTANT(0); /* JES2 terse section modifier  */ 21630000
*  DECLARE                                                              21640000
*   1       STATSJ2T      BASED,     /* JES2 terse data area @R05LOPI*/ 21650000
*     2       STS2LEN     FIXED(16), /* Length of JES2 terse section    21660000
*                                                            @R05LOPI*/ 21670000
*     2       STS2TYPE    FIXED(8),  /* Type of this header             21680000
*                                                            @R05LOPI*/ 21690000
*     2       STS2MOD     FIXED(8),  /* Modifier                        21700000
*                                                            @R05LOPI*/ 21710000
*     2       STS2FLG1    BIT(8),    /* General flags        @R05LOPI*/ 21720000
*       3       STS21DSH  BIT(1),    /* JOE has been cloned (all data   21730000
*                                       sets must be processed          21740000
*                                       identically by SAPI) @R05LOPI*/ 21750000
*       3       STS21TSO  BIT(1),    /* JOE is available for TSO        21760000
*                                        OUTPUT processing   @R05LOPI*/ 21770000
*       3       *         BIT(6),    /* Reserved             @R05P404*/ 21780000
*     2       STS2OGNM    CHAR(26),  /* SYSOUT group name    @R05LOPI*/ 21790000
*     2       STS2CRTM    FIXED(32) BDY(BYTE);                          21800000
*                                    /* JOE creation time (STCK         21810000
*                                        format)             @R05P404*/ 21820000
*/********************************************************************/ 21830000
*/*                                                          @R05LOPI*/ 21840000
*/*      SYSOUT Element JES3 Terse Section                   @R05LOPI*/ 21850000
*/*                                                          @R05LOPI*/ 21860000
*/*      This section contains general information that is   @R05LOPI*/ 21870000
*/*      only meaningful if the job is owned by a JES3       @R05LOPI*/ 21880000
*/*      subsystem.                                          @R05LOPI*/ 21890000
*/*                                                          @R05LOPI*/ 21900000
*/********************************************************************/ 21910000
* DCL STS3TMOD FIXED(8) CONSTANT(0); /* JES3 terse section modifier     21920000
*                                                            @R05LOPI*/ 21930000
*  DECLARE                                                              21940000
*   1       STATSJ3T      BASED,     /* JES3 terse data area @R05LOPI*/ 21950000
*     2       STS3LEN     FIXED(16), /* Length of JES3 terse section    21960000
*                                                            @R05LOPI*/ 21970000
*     2       STS3TYPE    FIXED(8),  /* Type of this header  @R05LOPI*/ 21980000
*     2       STS3MOD     FIXED(8),  /* Modifier             @R05LOPI*/ 21990000
*     2       STS3FLG1    BIT(8),    /* General flags        @R05P404*/ 99990000
*       3       STS31XSY  BIT(1),    /* Extended keywords used          99991000
*                                                            @R05P404*/ 99992000
*       3       *         BIT(7);    /* Reserved             @R05P404*/ 99999997
*/*                                     End of Macro         @R04LSDS*/ 99999999
