*/* START OF SPECIFICATIONS ******************************************/ 00050000
*/*                                                                  */ 00100000
*/*   $MAC(ICHPISP) COMP(SC1BN) PROD(RACF):                          */ 00150000
*/*                                                                  */ 00200000
*/*                                                                  */ 00300000
*/*01* DESCRIPTIVE NAME =                                            */ 00350000
*/*      IN-STORAGE PROFILE STRUCTURES                               */ 00400000
*/*                                                                  */ 00500000
*/*                                                                  */ 00600000
*/*01* PROPRIETARY STATEMENT=                                        */ 00650000
*/***PROPRIETARY_STATEMENT********************************************/ 00700000
*/*                                                                  */ 00750000
*/*                                                                  */ 00900000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00907000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00914000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1981, 2000                      */ 00921000
*/*                                                                  */ 00928000
*/* STATUS= HBB7703                                                  */ 00935000
*/*                                                                  */ 00942000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00949000
*/*                                                                  */ 00956200
*/*                                                                  */ 00962400
*/*01* EXTERNAL CLASSIFICATION:                                  @M7A*/ 00968600
*/*02* GUPI: RACRPE RPEINST RPEAPPL RPEACCLE RPEDPTD RPESESSN    @M7A*/ 00974800
*/*02* GUPI: RPEACL2 RPEMEM RPESESS2                             @M7A*/ 00981000
*/*02* DMTI: RACRTE RACRSE RACRNE                                @M7A*/ 00987200
*/*01* END OF EXTERNAL CLASSIFICATION:                           @M7A*/ 00993400
*/*                                                                  */ 01000000
*/*                                                                  */ 01400000
*/*01* FUNCTION =                                                    */ 01401400
*/*      MAPS THE DATA STRUCTURES USED TO MAINTAIN THE IN-STORAGE    */ 01402800
*/*      PROFILES USED BY THE RACLIST SERVICE                        */ 01404200
*/*                                                                  */ 01405600
*/*                                                                  */ 01407000
*/*01* METHOD OF ACCESS =                                            */ 01408400
*/*      PL/S3 - %INCLUDE SYSLIB(ICHPISP)                            */ 01409800
*/*      PL/AS - PLAS = 'YES'                                    @M2A*/ 01411200
*/*              %INCLUDE SYSLIB(ICHPISP)                        @M2A*/ 01412600
*/*      BAL   - COPY ICHPISP                                        */ 01414000
*/*                                                                  */ 01415400
*/*                                                                  */ 01416800
*/*01* CHANGE ACTIVITY =                                             */ 01418200
*/*      $L5=HRF1502,RACF/150,811015,CNTDSD:                     @L5A*/ 01419600
*/*      $L6=HRF1602,RACF/160,830207,CNTDSD:                     @L6A*/ 01421000
*/*      $L7=HRF1702,RACF/170,850319,CNTDSD:                     @L7A*/ 01422400
*/*      $L8=HRF1802,RACF/180,871026,CNTDSD:                     @L8A*/ 01423800
*/*      $M1= SP313   RACF/190 880222 PDPWB1: MVS/SP 3.1.3       @M1A*/ 01425200
*/*      $M2= SP313   RACF/190 880615 PDLCL1: MVS/SP 3.1.3       @M2A*/ 01426600
*/*      $M3= SP313   RACF/190 880914 PDDAM1: MVS/SP 3.1.3       @M3A*/ 01428000
*/*      $M4= SP313   RACF/190 890201 PDTGB1: MVS/SP 3.1.3       @M4A*/ 01429400
*/*      $P1= PGP0338 RACF/190 890517 PDTGB1: PTM PGP0338        @P1A*/ 01430100
*/*      OY23599                                             @YA23599*/ 01430400
*/*      OY28820                                             @YA28820*/ 01430600
*/*     $M5= APPCSPE RACF/190 900625 PDALF1: SUPPORT FOR MVS 4.2 @M5A*/ 01430700
*/*      $01= OY40405 HRF1902 9102004 PDCCM1: APAR OY40405       @01A*/ 01431000
*/*      $02= OY47989 HRF1902 9110124 PDDLR1: PE of OY43556      @02A*/ 01431300
*/*    $M6= HPCS   RACF/210 930515 PDRTS1 Sysplex data sharing.  @M6A*/ 01431400
*/*    $P2= PIG3177 RACF/210 930930 PDKAF1 PIG3177               @P2A*/ 01431500
*/*      $03= OW10338 SC1BN520 950108 PDCHB1: APAR OW10338       @03A*/ 01431600
*/*      $M7= GPE     HBB6603 960523 PDAHW1: PLX Conversion      @M7A*/ 01431800
*/*      $04= OW33240 HBB7703 991101 PDAJB1: more PLX Conv       @04A*/ 01431900
*/********************************************************************/ 01432000
*/*  NOTE: DO NOT add a line in this macro which contains        @03A*/ 01432200
*/*        only a line flag. An error during the COPY will       @03A*/ 01432400
*/*        result.  For more information see APAR OW08036.       @03A*/ 01432600
*/********************************************************************/ 01432800
*/*                                                                  */ 01433000
*/*01* CHANGE DESCRIPTIONS:                                          */ 01433600
*/*      A000000-999999 ORIGINAL CODE                        @ZA33304*/ 01435000
*/*      UZA43304                                            @ZA43304*/ 01436400
*/*      UZ90283                                             @ZA90283*/ 01437800
*/*      UZ90284                                             @ZA90284*/ 01439200
*/*      UZ90285                                             @ZA90285*/ 01440600
*/*      A - SUPPORT FOR VTAM SESSION LEVEL SECURITY             @M1A*/ 01441300
*/*      A - DATA SPACE SUPPORT FOR RACLIST                      @M2A*/ 01442000
*/*      A - CONDITIONAL ACCESS LIST SUPPORT                     @M3A*/ 01442700
*/*      A - SUPPORT FOR RACFVARS                                @M4A*/ 01443400
*/*      C - RACFVARS MEMBER MAPPING TO INCLUDE MEMBER LENGTH    @P1A*/ 01444100
*/*          AND INCLUDE RACFVARS IN ASSEMBLER SECTION           @P1A*/ 01444800
*/*      OY23599 - CORRECT MACRO OF ICHPISP                  @YA23599*/ 01445500
*/*      OY28820 - CORRECT FIXED(15) FIELDS                  @YA28820*/ 01446200
*/*      A - BRANCH ENTERED EXTRACT OF CONVSEC                   @M5A*/ 01446900
*/*      A - ADD A FIELD TO HOLD THE TOTAL NUMBER OF GROUPING    @01A*/ 01447000
*/*          PROFILES IN THIS CLASS THAT CONTAIN MEMBERS         @01A*/ 01447100
*/*      C - Reship due to cover letter error                    @02A*/ 01447200
*/*      A - Add STOKEN and ALET fields to the RTE for           @M6A*/ 01447300
*/*          RACLIST GLOBAL=YES support.                         @M6A*/ 01447400
*/*      C - Update prologue information                         @P2A*/ 01447500
*/*      C - Move comment word DATASPACE down one line so it is  @03A*/ 01448100
*/*          in front of line flag symbol @.                     @03A*/ 01448700
*/*      C - Changed hierarchy of RPEINST and RPEAPPL in order   @M7A*/ 01448900
*/*          to convert ICHGLS00 to PLX.                         @M7A*/ 01449100
*/*      C - Changed hierarchy of RACRNE in order                @04A*/ 01449300
*/*          to convert ICHRLS00 to PLX.                         @04A*/ 01449500
*/*                                                                  */ 01449700
*/********************************************************************/ 01450000
*%GOTO PLSPISP;                 /*  RACLIST STRUCTURES   */             01500000
RACRTE   DSECT ,                    RACLIST CLASS TREE ANCHOR ELEMENT   01550000
         DS    0CL44                                               @M6C 01600000
RTENEXT  DS    AL4                  ADDRESS OF NEXT ANCHOR OR 0         01650000
RTECLASS DS    AL4                  ADDRESS OF CLASS DESCRIPTOR ENTRY   01700000
*                                   FOR THIS CLASS                      01750000
RTETREE  DS    AL4                  ADDRESS OF TOP NODE IN TREE OR 0    01800000
RTESTORE DS    AL4                  ADDRESS OF STORAGE BLOCK LIST OR 0  01850000
RTESPNS  DS    0CL2                 PROFILE AND NODE SUBPOOL NUMBERS    01900000
RTEPSPN  DS    AL1                  SUBPOOL NUMBER FOR PROFILES         01950000
RTENSPN  DS    AL1                  SUBPOOL NUMBER FOR TREE NODES       02000000
RTEASPN  DS    AL1                  SUBPOOL NUMBER OF THIS BLOCK        02050000
         DS    CL1                  RESERVED                            02100000
RTEGENL  DS    AL4                  ADDRESS OF GENERIC PROFILE          02150000
*                                   LIST OR 0                      @L5A 02200000
RTESIZE  DS    AL4                  TOTAL STORAGE USED FOR RACLISTED    02216600
*                                   PROFILES AND NODES             @M2A 02233200
RTEGNUM  DS    AL4                  TOTAL NUMBER OF GROUPING       @01A 02238800
*                                   PROFILES THAT CONTAIN MEMBERS  @01A 02244400
RTESTOKN DS    CL8                  STOKEN OF GLOBAL=YES DATASPACE @M6A 02246200
RTEALET  DS    AL4                  PASN-AL ALET OF DATASPACE      @M6A 02248000
RACRSE   DSECT ,                    RACLIST CLASS TREE STORAGE BLOCK    02250000
         DS    0CL8                                                     02300000
RSENEXT  DS    AL4                  ADDRESS OF NEXT STORAGE BLOCK OR 0  02350000
RSESIZE  DS    FL2                  LENGTH OF STORAGE BLOCK             02400000
RSEPOOL  DS    FL1                  SUBPOOL NUMBER OF STORAGE BLOCK     02450000
         DS    FL1                                                      02500000
RSESTORE DS    0C                   USEABLE STORAGE (RSESIZE-4 BYTES)   02550000
RACRNE   DSECT ,                    RACLIST CLASS TREE NODE ELEMENT     02600000
         DS    0CL16                                                    02650000
RNELEFT  DS    AL4                  ADDRESS OF LEFT DAUGHTER NODE OR 0  02700000
RNEPROF  DS    AL4                  ADDRESS OF PROFILE FOR THIS NODE    02750000
RNERIGHT DS    AL4                  ADDRESS OF RIGHT DAUGHTER NODE OR 0 02800000
         ORG   RNELEFT                                                  02850000
RNELINK  DS    3AL4                 ARRAY OF ABOVE 3 POINTERS           02900000
RNEBAL   DS    F                    TREE BALANCING FACTOR DURING TREE   02950000
*                                   CREATION                            03000000
         ORG   RNEBAL                                          @ZA43304 03050000
RNEUP    DS    AL4                  POINTER TO MOTHER NODE DURING TREE  03100000
*                                   DELETION                            03150000
RNEKEY   DS    0C                   KEY (LENGTH DETERMINED BY MAXIMUM   03200000
*                                   NAME LENGTH FOR CLASS IN THE        03250000
*                                   CLASS DESCRIPTOR ELEMENT)           03300000
RACRPE   DSECT ,                    RESOURCE PROFILE ELEMENT            03350000
         DS    0CL78                                              @M6C  03400000
RPEPLEN  DS    BL2                  PHYS. BLOCK STORE. LENGTH @YA28820  03450000
RPELLEN  DS    BL2                  LOGICAL LENGTH OF BLOCK   @YA28820  03500000
RPEUCNT  DS    BL2                  # RESOURCES SHARING PROF. @YA28820  03550000
RPEATTR  DS    0CL4                 ATTRIBUTE FLAGS                     03600000
RPEUACC  DS    BL1                  UNIVERSAL ACCESS                    03650000
RPEAUDIT DS    BL1                  AUDIT FLAGS                         03700000
RPEGAUD  DS    BL1                  GLOBAL AUDIT FLAGS                  03750000
RPELEVEL DS    BL1                  RESOURCE LEVEL                      03800000
RPEACCNO DS    BL2                  # ENTRIES IN ACCESS LIST  @YA28820  03850000
RPEACCOF DS    BL2                  OFFSET TO ACCESS LIST     @YA28820  03900000
RPEINSOF DS    BL2                  OFFSET TO INSTALL. DATA   @YA28820  03950000
RPEAPPOF DS    BL2                  OFFSET TO APPL. DATA      @YA28820  04000000
RPEOWNER DS    CL8                  OWNER OF THE RESOURCE PROFILE @L6A  04050000
RPENUMDP DS    FL2                  NUMBER OF CATEGORIES IN LIST  @L7A  04100000
RPEDPTOF DS    BL2                  OFFS. TO CAT. LIST        @YA28820  04150000
RPELDAYS DS    BL1                  DAYS TERMINAL MAY NOT BE USED       04200000
*                                   (BIT 0 - SUNDAY, BIT 1 -            04250000
*                                   MONDAY, ...)                  @L7A  04300000
RPESCLVL DS    FL1                  RESOURCE SECURITY LEVEL       @L7A  04350000
RPELOGNT DS    PL3                  EARLIEST TIME TERMINAL MAY BE       04400000
*                                   USED (HHMM)                   @L7A  04450000
RPELOGFT DS    PL3                  LATEST TIME TERMINAL MAY BE         04500000
*                                   USED (HHMM)                   @L7A  04550000
RPENTFY  DS    CL8                  USERID TO NOTIFY WHEN THIS PROFILE  04600000
*                                   DENIES ACCESS                 @L7A  04650000
RPETZONE DS    PL3                  TIME OFFSET OF TERMINAL FROM THE    04700000
*                                   CPU + = EAST  - = WEST        @L7A  04750000
RPEFLAGS DS    BL1                  FLAGS FOR IN STORE PROFILE    @L8A  04760000
RPEFWARN EQU   X'80'                WARN OPTION SPECIFIED?        @L8A  04770000
RPESCLBL DS    CL8                  SECLABEL                      @M1A  04780000
RPESESOF DS    BL2                  SESSION SEGMENT DATA OFF  @YA28820  04790000
RPESESLN DS    BL2                  SESSION SEGMENT DATA LEN  @YA28820  04800000
RPEAC2NO DS    BL2                  NUMBER OF OCCURRENCES     @YA28820  04805500
RPEAC2LN DS    BL2                  SECOND ACCESS LIST LENGTH @YA28820  04811000
RPEAC2OF DS    BL2                  SECOND ACCESS LIST OFFSET @YA28820  04816500
RPEMEMCT DS    BL2                  NUMBER OF MEMBERS         @YA28820  04822000
RPEMEMLN DS    BL2                  LENGTH OF MEMBER LIST     @YA28820  04827500
RPEMEMOF DS    BL2                  OFFSET TO MEMBER LIST     @YA28820  04833000
RPESE2LN DS    FL2                  MORE SESSION DATA LENGTH      @M5A  04838500
RPESE2OF DS    FL2                  MORE SESSION DATA OFFSET      @M5A  04844000
RPEEND   DS    0C                   END OF FIXED PART OF ELEMENT        04850000
RPEINST  DSECT ,                    INSTALLATION DATA VARIABLE LENGTH   04900000
*                                   PORTION                             04950000
         DS    0CL1                                                     05000000
RPEINSTL DS    FL1                  INSTALLATION DATA LENGTH            05050000
RPEINSTD DS    0C                   INSTALLATION DATA STRING            05100000
RPEAPPL  DSECT ,                    APPLICATION DATA VARIABLE LENGTH    05150000
*                                   PORTION                             05200000
         DS    0CL1                                                     05250000
RPEAPPLL DS    FL1                  APPLICATION DATA LENGTH             05300000
RPEAPPLD DS    0C                   APPLICATION DATA STRING             05350000
RPEACCLE DSECT ,                    ACCESS LIST                         05400000
         DS    0CL9                                                     05450000
RPEAUSR  DS    CL8                  USER/GROUP ID                       05500000
RPEACS   DS    BL1                  ACCESS AUTHORITY                    05550000
RPEDPTD  DSECT ,                    CATEGORY LIST                 @L7A  05600000
         DS    0CL2                                               @L7A  05650000
RPEDEPT  DS    FL2                  CATEGORY                      @L7A  05700000
RPESESSN DSECT ,                    SESSION DATA                  @M1A  05702000
         DS    0CL12                                              @M1A  05704000
RPEKYDAT DS    CL4                  DATE KEY WAS LAST CHANGED     @M1A  05706000
RPEKYINT DS    FL2                  # DAYS UNTIL KEY EXPIRES      @M1A  05708000
RPEMFAIL DS    FL2                  MAX # OF FAILED ATTEMPTS      @M1A  05710000
RPESLSFG DS    BL1                  SESSION FLAGS                 @M1A  05712000
RPESKYLN DS    BL1                  LENGTH OF SESSION KEY         @M1A  05714000
RPESNKEY DS    0CL256               SESSION KEY 0-256 BYTES       @M1A  05716000
*        THE SECOND ACCESS LIST (VARIABLE LENGTH)                 @M3A  05718000
RPEACL2  DSECT ,                    SECOND ACCESS LIST            @M3A  05720000
RPEA2FIX DS    0CL20                FIXED LENGTH AREA             @M3A  05722000
RPEA2PGM DS    0CL8                 PROGRAM NAME OR FLAGS         @M3A  05724000
RPEPGFLG DS    CL1                  FLAG BYTE                     @M3A  05726000
RPEA2RST DS    CL7                  THE REST OF NAME OR FLAGS     @M3A  05728000
RPEA2USR DS    CL8                  USERID                        @M3A  05730000
RPEA2ACA DS    BL1                  ACCESS AUTHORITY              @M3A  05732000
RPEA2CNT DS    FL2                  ACCESS COUNT FIELD            @M3A  05734000
RPEA2VRL DS    BL1                  VARIABLE AREA LENGTH          @M3A  05736000
RPEA2VAR DS    0CL255               VARIABLE AREA                 @M3A  05738000
RPEA2CLI DS    CL8                  CLASS ID.                     @M3A  05740000
RPEA2RSV DS    CL2                  RESERVED.                     @M3A  05742000
RPEA2ELN DS    BL1                  ENTITY LENGTH                 @M3A  05744000
RPEA2ENT DS    0CL244               ENTITY                        @M3A  05746000
*        MEMBER LIST                                              @P1A  05746300
RPEMEM   DSECT ,                    MEMBER LIST                   @P1A  05746600
         DS    0CL1                                               @P1A  05746900
RPEMEML  DS    BL1                  MEMBER LENGTH             @YA28820  05747200
RPEMEMBR DS    0C                   MEMBER                        @P1A  05747500
RPEA2DAT EQU   X'00'                FLAG DATA EQUATE              @M3A  05747800
*        ADDITIONAL FIXED SESSION SEGMENT DATA                    @M5A  05748100
RPESESS2 DSECT ,                    MORE SESSION DATA             @M5A  05748400
         DS    0CL1                                               @M5A  05748700
RPESCONV DS    BL1                  CONVERSATION SECURITY         @M5A  05749000
         AGO   .ENDPISP                                                 05750000
*%PLSPISP:;                                                             05800000
 DECLARE                           /* RACLIST STRUCTURES             */ 05850000
  1 RACRTE BASED(ACEECLCP),        /* RACLIST CLASS TREE                05900000
                                      ANCHOR ELEMENT                 */ 05950000
    3 RTENEXT PTR,                 /* ADDRESS OF NEXT ANCHOR OR 0    */ 06000000
    3 RTECLASS PTR,                /* ADDRESS OF CLASS DESCRIPTOR       06050000
                                      ENTRY FOR THIS CLASS           */ 06100000
    3 RTETREE PTR,                 /* ADDRESS OF TOP NODE IN            06150000
                                      TREE OR 0                      */ 06200000
    3 RTESTORE PTR,                /* ADDRESS OF STORAGE BLOCK          06250000
                                      LIST OR 0                      */ 06300000
    3 RTESPNS,                     /* PROFILE & NODE SUBPOOL NUMBERS */ 06350000
      5 RTEPSPN BIN(8),            /* SUBPOOL NUMBER FOR PROFILES    */ 06400000
      5 RTENSPN BIN(8),            /* SUBPOOL NUMBER FOR TREE NODES  */ 06450000
    3 RTEASPN BIN(8),              /* SUBPOOL NUMBER OF THIS BLOCK   */ 06500000
    3 * CHAR(1),                   /* RESERVED                       */ 06550000
    3 RTEGENL PTR(31),             /* ADDRESS OF GENERIC PROFILE        06600000
                                      LIST OR 0                  @L5A*/ 06650000
    3 RTESIZE FIXED(31),           /* TOTAL STORAGE USED FOR RACLISTED  06660000
                                    PROFILES AND NODES           @M2A*/ 06670000
    3 RTEGNUM FIXED(31),           /*TOTAL NUMBER OF GROUPING PROFILES  06673300
                                     THAT CONTAIN MEMBERS        @01A*/ 06676600
    3 RTESTOKN CHAR(8),            /* STOKEN FOR GLOBAL=YES             06677200
                                      DATASPACE                  @03C*/ 06677800
    3 RTEALET BIN(32),             /* PASN-AL ALET FOR                  06678400
                                      DATASPACE                  @03C*/ 06679000
*%IF PLAS = 'YES' %THEN            /*                            @M2A*/ 06680000
*%GOTO SK01;                       /*                            @M2A*/ 06690000
  1 RACRSE BASED(RTESTORE) BDY(WORD),/* RACLIST CLASS TREE              06700000
                                      STORAGE BLOCK                  */ 06750000
*%GOTO SK02;                       /*                            @M2A*/ 06758300
*%SK01:;                           /*                            @M2A*/ 06766600
  1 RACRSE BASED(RACRTE.RTESTORE) BDY(WORD),/* RACLIST CLASS TREE       06774900
                                      STORAGE BLOCK              @M2A*/ 06783200
*%SK02:;                           /*                            @M2A*/ 06791500
    3 RSENEXT PTR,                 /* ADDRESS OF NEXT STORAGE           06800000
                                      BLOCK OR 0                     */ 06850000
    3 RSESIZE BIN(15),             /* LENGTH OF STORAGE BLOCK        */ 06900000
    3 RSEPOOL BIN(8),              /* SUBPOOL NUMBER OF STORAGE         06950000
                                      BLOCK                          */ 07000000
    3 * BIN(8),                    /* RESERVED                       */ 07050000
    3 RSESTORE CHAR(*),            /* USEABLE STORAGE (RSESIZE-4        07100000
                                      BYTES)                         */ 07150000
*%IF PLAS = 'YES' %THEN            /*                            @M2A*/ 07166600
*%GOTO SK03;                       /*                            @M2A*/ 07183200
  1 RACRNE BASED(RTETREE) BDY(WORD),/* RACLIST CLASS TREE NODE          07200000
                                      ELEMENT                        */ 07250000
*%GOTO SK04;                       /*                            @M2A*/ 07258300
*%SK03:;                           /*                            @M2A*/ 07266600
  1 RACRNE BASED(RACRTE.RTETREE) BDY(WORD),/* RACLIST CLASS TREE NODE   07274900
                                      ELEMENT                    @M2A*/ 07283200
*%SK04:;                           /*                            @M2A*/ 07291500
   2 RNEHDR,                                                  /* @04A*/ 07295700
    3 RNELEFT PTR,                 /* ADDRESS OF LEFT DAUGHTER          07300000
                                      NODE OR 0                      */ 07350000
    3 RNEPROF PTR,                 /* ADDRESS OF PROFILE FOR THIS       07400000
                                      NODE                           */ 07450000
    3 RNERIGHT PTR,                /* ADDRESS OF RIGHT DAUGHTER         07500000
                                      NODE OR 0                      */ 07550000
    3 RNEBAL BIN(31),              /* TREE BALANCING FACTOR DURING TREE 07600000
                                      CREATION                       */ 07650000
      7 RNEUP PTR(31),             /* POINTER TO MOTHER NODE DURING     07700000
                                      TREE DELETION                  */ 07750000
 2 RNEKEY CHAR(*),                 /* KEY (LENGTH DETERMINED BY MAXIMUM 07800000
                                      NAME LENGTH FOR CLASS IN THE      07850000
                                      CLASS DESCRIPTOR ELEMENT)  @04C*/ 07883300
*%IF PLAS = 'YES' %THEN            /*                            @M2A*/ 07916600
*%GOTO SK05;                       /*                            @M2A*/ 07933200
  RNELINK(3) PTR(31) DEF(RNELEFT), /* ARRAY OF LEFT LINK, PROFILE AND   07950000
                                      RIGHT LINK POINTERS            */ 08000000
*%GOTO SK06;                       /*                            @M2A*/ 08006200
*%SK05:;                           /*                            @M2A*/ 08012400
  RNELINK(3) PTR(31) DEF(RACRNE.RNELEFT), /* ARRAY OF LEFT LINK, PROFILE08018600
                                     AND RIGHT LINK POINTERS     @M2A*/ 08024800
*%SK06:;                           /*                            @M2A*/ 08031000
*%IF PLAS = 'YES' %THEN            /*                            @M2A*/ 08037200
*%GOTO SK07;                       /*                            @M2A*/ 08043400
  1 RACRPE BASED(RNEPROF) BDY(HWORD),/* RESOURCE PROFILE ELEMENT     */ 08050000
*%GOTO SK08;                       /*                            @M2A*/ 08058300
*%SK07:;                           /*                            @M2A*/ 08066600
  1 RACRPE BASED(RACRNE.RNEPROF) BDY(HWORD),/* RESOURCE PROFILE         08074900
                                                        ELEMENT  @M2A*/ 08083200
*%SK08:;                           /*                            @M2A*/ 08091500
    3 RPEPLEN BIN(16),   /* PHYSICAL STORAGE LENGTH OF                  08100000
                                      BLOCK                  @YA28820*/ 08150000
    3 RPELLEN BIN(16),   /* LOGICAL LENGTH OF BLOCK          @YA28820*/ 08200000
    3 RPEUCNT BIN(16),   /* NUMBER OF RESOURCES SHARING                 08250000
                                       THIS PROFILE          @YA28820*/ 08300000
    3 RPEATTR,                     /* ATTRIBUTE FLAGS                */ 08350000
      5 RPEUACC BIT(8),            /* UNIVERSAL ACCESS               */ 08400000
      5 RPEAUDIT BIT(8),           /* AUDIT FLAGS                    */ 08450000
      5 RPEGAUD BIT(8),            /* GLOBAL AUDIT FLAGS             */ 08500000
      5 RPELEVEL BIT(8),           /* RESOURCE LEVEL                 */ 08550000
    3 RPEACCNO BIN(16),  /* NUMBER OF ENTRIES IN ACCESS                 08600000
                                      LIST                   @YA28820*/ 08650000
    3 RPEACCOF BIN(16),  /* OFFSET TO ACCESS LIST            @YA28820*/ 08700000
    3 RPEINSOF BIN(16),  /* OFFSET TO INSTALLATION DATA      @YA28820*/ 08750000
    3 RPEAPPOF BIN(16),  /* OFFSET TO APPLICATION DATA       @YA28820*/ 08800000
    3 RPEOWNER CHAR(8),            /* OWNER OF RESOURCE PROFILE  @L6A*/ 08850000
    3 RPENUMDP BIN(15),            /* NUMBER OF CATEGORIES IN           08900000
                                      LIST                       @L7A*/ 08950000
    3 RPEDPTOF BIN(16),  /* OFFSET TO CATEGORY LIST          @YA28820*/ 09000000
    3 RPELDAYS BIT(8),             /* DAYS TERMINAL MAY NOT BE USED     09050000
                                      (BIT 0 - SUNDAY, BIT 1 -          09100000
                                      MONDAY, ...)               @L7A*/ 09150000
    3 RPESCLVL BIN(8),             /* RESOURCE SECURITY LEVEL    @L7A*/ 09200000
    3 RPELOGNT CHAR(3),            /* EARLIEST TIME TERMINAL MAY BE     09250000
                                      USED (HHMM)                @L7A*/ 09300000
    3 RPELOGFT CHAR(3),            /* LATEST TIME TERMINAL MAY BE       09350000
                                      USED (HHMM)                @L7A*/ 09400000
    3 RPENTFY CHAR(8),             /* USERID TO NOTIFY WHEN THIS        09450000
                                      PROFILE DENIES ACCESS      @L7A*/ 09500000
    3 RPETZONE CHAR(3),            /* TIME OFFSET OF TERMINAL FROM      09550000
                                      CPU. + = EAST  - = WEST.   @L7A*/ 09600000
    3 RPEFLAGS BIT(8),             /* FLAGS FOR IN STORE                09606600
                                      PROFILE                @YA23599*/ 09613200
      5 RPEFWARN BIT(1),           /* WARN OPTION SPECIFIED?     @L8A*/ 09619800
      5 * BIT(7),                  /* RESERVED                   @L8A*/ 09626400
    3 RPESCLBL CHAR(8),            /* SECLABEL                   @M1A*/ 09633000
    3 RPESESOF BIN(16),            /* SESSION SEG DATA OFF   @YA28820*/ 09639600
    3 RPESESLN BIN(16),            /* SESSION SEG DATA LEN   @YA28820*/ 09646200
    3 RPEAC2NO FIXED(16),          /* NUMBER OF OCCURRENCES  @YA28820*/ 09651500
    3 RPEAC2LN FIXED(16),          /* CONDITIONAL ACCESS LIST           09656800
                                      LENGTH                     @M3A*/ 09662100
    3 RPEAC2OF FIXED(16),          /* SECOND ACCESS LIST OFFSET  @M3A*/ 09667400
    3 RPEMEMCT BIN(16),            /* NUMBER OF MEMBERS      @YA28820*/ 09672700
    3 RPEMEMLN BIN(16),            /* LENGTH OF MEMBER LIST  @YA28820*/ 09678000
    3 RPEMEMOF BIN(16),            /* OFFSET TO MEMBER LIST  @YA28820*/ 09683300
    3 RPESE2LN BIN(15),            /* MORE SESSION DATA LENGTH   @M5A*/ 09688600
    3 RPESE2OF BIN(15),            /* MORE SESSION DATA OFFSET   @M5A*/ 09693900
    3 RPEEND CHAR(0),              /* END OF FIXED PART OF ELEMENT   */ 09700000
*%IF PLAS = 'YES' %THEN            /*                            @M2A*/ 09716600
*%GOTO SK09;                       /*                            @M2A*/ 09733200
  1 RPEINST BASED(ADDR(RACRPE(RPEINSOF+1))),/* INSTALLATION DATA        09750000
                                      VARIABLE LENGTH PORTION        */ 09800000
*%GOTO SK10;                       /*                            @M2A*/ 09807100
*%SK09:;                           /*                            @M2A*/ 09814200
  1 RPEINST BASED(ADDR(RACRPE(RACRPE.RPEINSOF+1))),/* INSTALLATION      09821300
                                      DATA VARIABLE LENGTH              09828400
                                      PORTION                @YA23599*/ 09835500
*%SK10:;                           /*                            @M2A*/ 09842600
    3 RPEINSTL BIN(8),             /* INSTALLATION DATA LENGTH       */ 09850000
    3 RPEINSTE CHAR(0),            /* END OF RPEINST             @M7A*/ 09866600
  RPEINSTD CHAR(*) BASED(ADDR(RPEINSTE)), /* INSTALLATION DATA          09883200
                                             STRING              @M7C*/ 09899800
*%IF PLAS = 'YES' %THEN            /*                            @M2A*/ 09916600
*%GOTO SK11;                       /*                            @M2A*/ 09933200
  1 RPEAPPL BASED(ADDR(RACRPE(RPEAPPOF+1))),/* APPLICATION DATA         09950000
                                      VARIABLE LENGTH PORTION        */ 10000000
*%GOTO SK12;                       /*                            @M2A*/ 10008300
*%SK11:;                           /*                            @M2A*/ 10016600
  1 RPEAPPL BASED(ADDR(RACRPE(RACRPE.RPEAPPOF+1))),/* APPLICATION DATA  10024900
                                      VARIABLE LENGTH PORTION    @M2A*/ 10033200
*%SK12:;                           /*                            @M2A*/ 10041500
    3 RPEAPPLL BIN(8),             /* APPLICATION DATA LENGTH        */ 10050000
    3 RPEAPPLE CHAR(0),            /* END OF RPEAPPL             @M7A*/ 10066600
  RPEAPPLD CHAR(*) BASED(ADDR(RPEAPPLE)), /* APPLICATION DATA           10083200
                                             STRING              @M7C*/ 10099800
*%IF PLAS = 'YES' %THEN            /*                            @M2A*/ 10116600
*%GOTO SK13;                       /*                            @M2A*/ 10133200
  1 RPEACCLE(*) BASED(ADDR(RACRPE(RPEACCOF+1))),/*ACCESS LIST        */ 10150000
*%GOTO SK14;                       /*                            @M2A*/ 10158300
*%SK13:;                           /*                            @M2A*/ 10166600
  1 RPEACCLE(*) BASED(ADDR(RACRPE(RACRPE.RPEACCOF+1))),/*ACCESS         10174900
                                                       LIST  @YA23599*/ 10183200
*%SK14:;                           /*                            @M2A*/ 10191500
    3 RPEAUSR CHAR(8),             /* USER/GROUP ID                  */ 10200000
    3 RPEACS BIT(8),               /* ACCESS AUTHORITY           @L7A*/ 10250000
*%IF PLAS = 'YES' %THEN            /*                            @M2A*/ 10266600
*%GOTO SK15;                       /*                            @M2A*/ 10283200
  1 RPEDPTD(*) BASED(ADDR(RACRPE(RPEDPTOF+1))),/* CATEGORY LIST  @L7A*/ 10300000
*%GOTO SK16;                       /*                            @M2A*/ 10301700
*%SK15:;                           /*                            @M2A*/ 10303400
  1 RPEDPTD(*) BASED(ADDR(RACRPE(RACRPE.RPEDPTOF+1))),/* CATEGORY       10305100
                                                        LIST @YA23599*/ 10306800
*%SK16:;                           /*                            @M2A*/ 10308500
    3 RPEDEPT FIXED(15),           /* CATEGORY                   @L7A*/ 10310200
*%IF PLAS = 'YES' %THEN            /*                            @M2A*/ 10311900
*%GOTO SK17;                       /*                            @M2A*/ 10313600
  1 RPESESSN  BASED(ADDR(RACRPE(RPESESOF+1))),  /* SESSION DATA  @M1A*/ 10315300
*%GOTO SK18;                       /*                            @M2A*/ 10317000
*%SK17:;                           /*                            @M2A*/ 10318700
  1 RPESESSN  BASED(ADDR(RACRPE(RACRPE.RPESESOF+1))),  /* SESSION       10320400
                                                       DATA  @YA23599*/ 10322100
*%SK18:;                           /*                            @M2A*/ 10323800
    3 RPESEFIX,                    /* FIXED LEN SESSION FIELDS   @M1A*/ 10325500
      5 RPEKYDAT CHAR(4),          /* DATE KEY WAS LAST CHANGED  @M1A*/ 10327200
      5 RPEKYINT FIXED(15),        /* # DAYS UNTIL KEY EXPIRES   @M1A*/ 10328900
      5 RPEMFAIL FIXED(15),        /* MAX # OF FAILED ATTEMPTS   @M1A*/ 10330600
      5 RPESLSFG BIT(8),           /* SESSION FLAGS              @M1A*/ 10332300
      5 RPESKYLN FIXED(8),         /* LENGTH OF SESSION KEY      @M1A*/ 10334000
    3 RPESEVAR,                    /* VARIABLE LEN FIELDS        @M1A*/ 10335700
      5 RPESNKEY CHAR(*),          /* SESSION KEY                @M3C*/ 10337400
*%IF PLAS = 'YES' %THEN            /*                            @M3A*/ 10339100
*%GOTO SK19;                       /*                            @M3A*/ 10340800
  1 RPEACL2   BASED(ADDR(RACRPE(RPEAC2OF+1))) BDY(BYTE), /*             10342500
                                   SECOND ACCESS LIST            @M3A*/ 10344200
*%GOTO SK20;                       /*                            @M3A*/ 10345900
*%SK19:;                           /*                            @M3A*/ 10347600
  1 RPEACL2   BASED(ADDR(RACRPE(RACRPE.RPEAC2OF+1))) BDY(BYTE),  /*     10349300
                                            SECOND ACCESS LIST   @M3A*/ 10351000
*%SK20:;                           /*                            @M3A*/ 10352700
    3 RPEA2FIX BDY(BYTE),          /* FIXED LENGTH PORTION OF SECOND    10354400
                                      ACCESS LIST                @M3A*/ 10356100
      5 RPEA2PGM CHAR(8),          /* PROGRAM NAME OR FLAGS      @M3A*/ 10357800
         7 RPEPGFLG  CHAR(1),       /* FLAG BYTE                 @M3A*/ 10359500
         7 RPEA2RST  CHAR(7),       /* THE REST OF NAME OR FLAGS @M3A*/ 10361200
      5 RPEA2USR CHAR(8),          /* USERID                     @M3A*/ 10362900
      5 RPEA2ACA BIT(8),           /* ACCESS AUTHORITY           @M3A*/ 10364600
      5 RPEA2CNT FIXED(16)         /* ACCESS COUNT FIELD         @M3A*/ 10366300
          BDY(BYTE),                                                    10368000
      5 RPEA2VRL BIN(8),           /* VARIABLE AREA LENGTH       @M3A*/ 10369700
    3 RPEA2VAR BDY(BYTE),          /* VARIABLE AREA              @M3A*/ 10371400
      5 RPEA2CLI  CHAR(8),         /* CLASS ID.                  @M3A*/ 10373100
      5 RPEA2RSV  CHAR(2),         /* RESERVED.                  @M3A*/ 10374800
      5 RPEA2ELN  BIN(8),          /* ENTITY LENGTH              @M3A*/ 10376500
      5 RPEA2ENT  CHAR(*),         /* ENTITY                     @M4C*/ 10378200
*%IF PLAS = 'YES' %THEN            /*                            @M4A*/ 10379900
*%GOTO SK21;                       /*                            @M4A*/ 10381600
  1 RPEMEM BASED(ADDR(RACRPE(RPEMEMOF+1))) BDY(BYTE), /* MEMBER         10383300
                                                     LIST    @YA23599*/ 10385000
*%GOTO SK22;                       /*                            @M4A*/ 10386700
*%SK21:;                           /*                            @M4A*/ 10388400
  1 RPEMEM BASED(ADDR(RACRPE(RACRPE.RPEMEMOF+1))) BDY(BYTE), /* MEMBER  10390100
                                LIST                             @P1C*/ 10391800
*%SK22:;                           /*                            @M4A*/ 10393500
    3 RPEMEML  BIN(8),       /* MEMBER LENGTH                    @P1A*/ 10393900
    3 RPEMEMBR CHAR(*),      /* MEMBER                           @M5C*/ 10394300
*%IF PLAS = 'YES' %THEN            /*                            @M5A*/ 10394700
*%GOTO SK23;                       /*                            @M5A*/ 10395100
  1 RPESESS2  BASED(ADDR(RACRPE(RPESE2OF+1))),  /* MORE SESSION  @M5A*/ 10395500
*%GOTO SK24;                       /*                            @M5A*/ 10395900
*%SK23:;                           /*                            @M5A*/ 10396300
  1 RPESESS2  BASED(ADDR(RACRPE(RACRPE.RPESE2OF+1))),  /* MORE SESSION  10396700
                                                       DATA      @M5A*/ 10397100
*%SK24:;                           /*                            @M5A*/ 10397500
    3 RPESE2FX,                    /* MORE SESSION FIXED FIELDS  @M5A*/ 10397900
      5 RPESCONV BIT(8);           /* CONVERSATION SECURITY      @M5A*/ 10398300
  DCL RPEA2DAT FIXED(8) CONSTANT(0);    /* FLAG DATA EQUATE      @M3A*/ 10398700
*%GOTO ENDPISP;                                                         10400000
.ENDPISP ANOP                                                  @ZA43304 10450000
*%ENDPISP:;                                                             10500000
