*        %GOTO ICH_SAFP1;                              /*               00050000
         MACRO                                                          00100000
         ICHSAFP &DSECT=YES                                             00150000
         AGO   .SAFPL2A                                */               00200000
*%ICH_SAFP1: ;                                                          00250000
*% ;                                                  /*                00300000
.SAFPL2A ANOP                                         */                00350000
*/* START OF SPECIFICATIONS ******************************************/ 00400000
*/*                                                                  */ 00450000
*/* $MAC(ICHSAFP) COMP(SC1BN) PROD(RACF):                       @M9C */ 00500000
*/*                                                                  */ 00550000
*/*                                                                  */ 00650000
*/*01* MODULE NAME:                                                  */ 00683300
*/*      ICHSAFP                                                     */ 00716600
*/*                                                                  */ 00750000
*/*                                                                  */ 01000000
*/*01* DESCRIPTIVE NAME:                                             */ 01033300
*/*      System Authorization Facility (SAF) Router Parameter List   */ 01066600
*/*                                                                  */ 01100000
*/*01* PROPRIETARY STATEMENT=                                        */ 01150000
*/***PROPRIETARY_STATEMENT********************************************/ 01200000
*/*                                                                  */ 01500000
*/*                                                                  */ 01550000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01600000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01650000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1980, 2000                      */ 01700000
*/*                                                                  */ 01800000
*/* STATUS= HBB7703                                                  */ 01850000
*/*                                                                  */ 01900000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01950000
*/*                                                                  */ 02000000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 02025000
*/*02* PSPI: BASE                                                    */ 02041600
*/*02* GUPI: FIELDS SAFPRRET SAFPRREA SAFPMSAD                       */ 02058200
*/*01* END OF EXTERNAL CLASSIFICATION                                */ 02075000
*/*                                                                  */ 02100000
*/*01* FUNCTION:                                                     */ 02112500
*/*      This macro is the descriptor for data passed to the SAF     */ 02125000
*/*      router by the RACROUTE macro.                               */ 02137500
*/*                                                                  */ 02150000
*/*                                                                  */ 02500000
*/*01* INVOCATION:                                                   */ 02502000
*/*      PL/S - %INCLUDE SYSLIB(ICHSAFP)                             */ 02504000
*/*             DECLARE SAFPPTR PTR(31)                              */ 02506000
*/*                                                                  */ 02508000
*/*      BAL -  Invoke the macro ICHSAFP. Normally, the macro        */ 02510000
*/*             generates a dsect, to be based on a register as      */ 02512000
*/*             shown below.  If this is not desirable, specify the  */ 02514000
*/*             value NO for the DSECT keyword.                      */ 02516000
*/*                                                                  */ 02518000
*/*             L       REG,SAFPPTR                                  */ 02520000
*/*             USING   SAFP,REG                                     */ 02522000
*/*                                                                  */ 02524000
*/*             where REG is any register except zero, used for      */ 02526000
*/*             addressing all fields.                               */ 02528000
*/*                                                                  */ 02530000
*/*                                                                  */ 02532000
*/*01* CHANGE ACTIVITY =                                             */ 02534000
*/*      $T0=UZ90211,SAF/RF15,810702,CNTDSD:                         */ 02536000
*/*      $L6=HRF1602,RACF/160,830503,CNTDSD:                     @L6A*/ 02538000
*/*      UZ90283                                             @ZA90283*/ 02540000
*/*      UZ90284                                             @ZA90284*/ 02542000
*/*      UZ90285                                             @ZA90285*/ 02544000
*/*      $L8=HRF1802,RACF/180,860925,CNTDSD:                     @L8A*/ 02546000
*/*      $P1=HRF1802,RACF/180,871203,CNTDSD: PEQ0289             @P1A*/ 02548000
*/*      $M1=SP313   RACF/190 880328 PDTGB1: MVS/SP 3.1.3        @M1A*/ 02550000
*/*      $M2=SP313   RACF/190 880615 PDI_H1: MVS/SP 3.1.3        @M2A*/ 02552000
*/*      $M3=SP313   RACF/190 880615 PDRTS1: MVS/SP 3.1.3        @M3A*/ 02554000
*/*      $P2=PGW0023 RACF/190 880803 PDPWB1: PGW0023             @P2A*/ 02556000
*/*      $M4=SP313   RACF/190 880803 PDPWB1: MVS/SP 3.1.3        @M4A*/ 02558000
*/*      $P3=PGW0040 RACF/190 881104 PDRTS1: PGW0040             @P3A*/ 02560000
*/*      $P4=PGW0041 RACF/190 881222 PDRTS1: PGW0041             @P4A*/ 02562000
*/*      $D1=DGU0045 RACF/190 890131 PDPWB1: DGU0045             @D1A*/ 02564000
*/*      $M5=VM      RACF/190 880821 PDJCD1: VM   SECURITY       @M5A*/ 02565000
*/*      $P5=PGP0558 RACF/190 890922 PDRTS1: PGP0558             @P5A*/ 02565500
*/*      $P6=PGP0579 RACF/190 890922 PDB_S1: PGP0579             @P6A*/ 02565700
*/*      $P7=PI90017 RACF/190 891215 PDB_S1: PI90017             @P7A*/ 02565800
*/*      $M6=APPCSPE RACF/190 900625 PDA7  : SUPPORT FOR MVS 4.2 @M6A*/ 02566300
*/*      $M7=APPCSPE RACF/190 900625 PDJ_K3: SUPPORT FOR MVS 4.2 @M7A*/ 02566800
*/*      $M8=APPC    RACF/192 900904 PDTGL:  SUPPORT FOR APPC    @M8A*/ 02567000
*/*      $P8=PI90038 RACF/190 901002 PDI_H1: PI90038 (OY36441)   @P8A*/ 02567100
*/*      $Q1=PKN0004 RACF/190 901004 PDFJH1: PKN0004             @Q1A*/ 02567300
*/*      $P9=PJA0029 RACF/192 910524 PDPSB1: PJA0029             @P9A*/ 02567500
*/*      $01=OY47989 RACF/190 911012 PDDLR1: PE of OY43556       @01A*/ 02567600
*/*      $M9=OW04015 RACF/210 930426 PDKAF1: RELEASE-ID UPDATE   @M9A*/ 02567700
*/*      $MA=OW10709 RACF/220 940509 PDJMV1: Release-Id Update   @MAA*/ 02567800
*/*      $MB=RELID   RACF/230 960422 PDJMV1: Release-Id Update   @MBA*/ 02568300
*/*      $PA=PQC1216 RACF/230 960801 PDBCC1: CDPI update         @PAA*/ 02568500
*/*      $MC=RELID   RACF/240 960904 PDJMV1: Release ID Support  @MCA*/ 02568600
*/*      $MD=RELID   HBB6605  970417 PDR_B1: Release ID Support  @MDA*/ 02568700
*/*      $ME=RELID   HRF2608  980624 PDRDS2: Release ID 2608     @MEA*/ 02568900
*/*      $MF=RELID   HRF7703  990415 PDRDS2: Release ID 7703     @MFA*/ 02569100
*/*      $MG=RELID   HRF7703  990415 PDRDS2: Release ID 7703     @MFA*/ 02569200
*/*                                                                  */ 02569300
*/*01* CHANGE DESCRIPTIONS:                                          */ 02570000
*/*      A000000-999999                                          @T0A*/ 02572000
*/*      A - Support for DIRAUTH and TOKENMAP requests           @M1A*/ 02572800
*/*      A - Support for VERIFYX  request                        @M2A*/ 02573600
*/*      A - Support for VERIFY and TOKEN BUILD requests         @M3A*/ 02574400
*/*      A - Support for Branch EXTRACT request                  @P2A*/ 02575200
*/*      A - Support for RACAUDIT request                        @M4A*/ 02576000
*/*      A - Support for invalid token length codes for VERIFY,  @P3A*/ 02576800
*/*          VERIFYX, and TOKENBLD requests.                     @P3A*/ 02577600
*/*      A - Support for invalid token version (0) for VERIFY,   @P4A*/ 02578400
*/*          VERIFYX, and TOKENBLD requests.                     @P4A*/ 02579200
*/*      A - TOKNIN/TOKNOUT support                              @D1A*/ 02580000
*/*      A - Support for RACROUTE/VM Asynchronous requests       @M5A*/ 02580800
*/*      C - Token parameter ERRORS have become 9C7 abends via   @P5A*/ 02581600
*/*          DCR 29. These are noted but remain in case of any   @P5A*/ 02582400
*/*          references. There is no change to the actual list   @P5A*/ 02583200
*/*          of parameters.                                      @P5A*/ 02584000
*/*      A - Declaration for the constant SAFPSTAT in the PLAS   @P6A*/ 02584800
*/*          version.                                            @P6A*/ 02585600
*/*      A - More additions in the VM support                    @P7A*/ 02586400
*/*      A - Support TOKENXTR/TOKENMAP in XM mode.               @M6A*/ 02587200
*/*      A - Support for the parmlist versioning designed to     @M7A*/ 02588000
*/*          ensure a DECOUPL value appropriate to the caller.       */ 02588800
*/*      A - Support for APPC                                    @M8A*/ 02589600
*/*      C - ASSEMBLER F compatability                           @P8A*/ 02590400
*/*      C - SAFPVRRL variable assembler version continuation    @Q1A*/ 02591200
*/*      C - Status to correctly correspond to MVS level         @P9A*/ 02592000
*/*      C - Ship code for cover letter error                    @01A*/ 02593600
*/*      C - Update current RACF level and change PROD to RACF   @M9A*/ 02594400
*/*      C - Update current RACF level to 2.2                    @MAA*/ 02594800
*/*      C - Update current RACF level to 2.3                    @MBA*/ 02595000
*/*      C - Update CDPI information PSPI w/GUPI fields          @PAA*/ 02595100
*/*      C - Release ID Line Item Support                        @MCA*/ 02595200
*/*      C - Release ID Line Item Support                        @MDA*/ 02595400
*/*      A - Release ID Line Item Support HRF2608                @MEA*/ 02595500
*/*      A - Release ID Line Item Support HRF7703                @MFA*/ 02595600
*/*      A - Change SAFPCURR value to current release            @MGC*/ 02595700
*/*                                                                  */ 02595800
*/* END OF SPECIFICATIONS*********************************************/ 02596000
*%;                                                                  /* 02600000
         AGO   .SAFPL4               */                                 02650000
*%GOTO ICH_SAFP3;                    /*                                 02700000
.SAFPL4  ANOP                                                           02750000
         AIF   ('&DSECT' EQ 'NO').SAFPL5                                02800000
SAFP     DSECT                                                          02850000
         AGO   .SAFPL5A                                                 02900000
.SAFPL5  ANOP                                                           02950000
SAFP     DS    0F                                                       03000000
.SAFPL5A ANOP                                                           03050000
SAFPRRET DS    F                   RACF or installation exit           +03081600
                                   Return Code                          03113200
SAFPRREA DS    F                   RACF or installation exit           +03144800
                                   Reason Code                          03176400
SAFPPLN  DS    H                   Length of SAFP parameter list       +03208000
                                   (in bytes)                           03239600
SAFPVRRL DS    X                   RACF Version/Release list indicator +03271200
                                   (values defined below)          @Q1C 03302800
         DS    X                   Reserved                        @M7C 03334400
SAFPREQT DS    H                   Request number (values defined      +03366000
                                   below)                               03397600
SAFPFLGS DS    X                   Flags                           @L8A 03429200
SAFPMSGR EQU   X'80'               1 - message return requested    @L8A 03460800
SAFPR18  EQU   X'40'               1 - Release 1.8 or higher function  +03492400
                                       was requested               @L8A 03524000
SAFPSUPP EQU   X'20'               1 - message suppression on      @P1A 03555600
SAFPDCPL EQU   X'10'               1 - DECOUPL=yes                 @M2A 03587200
SAFPSYST EQU   X'08'               1 - SYSTEM=yes                  @M8A 03618800
SAFPMSPL DS    AL1                 Subpool to be used for messages     +03650400
                                   to be returned, if SAFPMSGR on  @L8A 03682000
SAFPREQR DS    A                   Requestor name address (points      +03713600
                                   to an 8-byte character field)        03745200
SAFPSUBS DS    A                   Subsystem name address (points      +03776800
                                   to an 8-byte character field)        03808400
SAFPWA   DS    A                   SAF work area address                03840000
SAFPMSAD DS    A                   Upon return, will contain the       +03871600
                                   address of the message(s) returned  +03903200
                                   from the invoked function       @P8C 03934800
         DS    F                   RESERVED                        @L8A 03967000
SAFPRACP DS    F                   Offset to RACF related parameter    +03994000
                                   list from base address of SAFP       04021000
SAFPSFRC DS    F                   SAF Return Code                 @M5A 04022500
SAFPSFRS DS    F                   SAF Reason Code                 @M5A 04024000
SAFPPLNX DS    AL2                 Length of SAFP extension parameter  +04025500
                                   list (in bytes)                 @M5A 04027000
SAFPOLEN DS    AL2                 Length of Original Plist        @M5A 04028500
SAFPRETD DS    A                   Address of returned data        @M5A 04030000
SAFPFLAT DS    A                   Address of flat parameter list  @M5A 04031500
SAFPECB1 DS    A                   Address of ECB1                 @M5A 04033000
SAFPECB2 DS    A                   Address of ECB2                 @M5A 04034500
SAFPPREV DS    A                   Address of previous flat list   @M5A 04036000
SAFPNEXT DS    A                   Address of next flat list       @M5A 04037500
SAFPORIG DS    A                   Address of origional list       @M5A 04039000
SAFPFLEN DS    F                   Flat parameter list length      @M5A 04040500
SAFPUSRW DS    F                   User Word - identifier          @M5A 04042000
SAFPPREE DS    F                   Address of Pre-Processing Exit  @M5A 04043500
SAFPPOST DS    F                   Address of Post-Processing Exit @M5A 04045000
SAFPSYNC DS    A                   Address of Synchronous ECB      @M5A 04046500
SAFPSKEY DS    AL1                 Requestors Storage Key          @P7A 04047000
SAFPMODE DS    AL1                 Requestors Addressing mode      @P7A 04047500
SAFPSBYT DS    AL1                 Status byte                     @P7A 04048000
SAFPGCS  EQU   X'80'               1 - Request came from GCS       @P7A 04048500
SAFPSFSU EQU   X'40'               1 - SFS user accessing own file     +04048600
                                       or directory (used for          +04048700
                                       SFSAUTOACCESS processing)   @MBA 04048800
         DS    AL1                 Reserved                        @P7C 04049000
         DS    0F                                                       04050000
*                                                                       04100000
*             CONSTANTS USED FOR REQUEST NUMBER VALUES                  04150000
*                                                                       04200000
SAFPAU   EQU   1                   RACHECK  - Authorization function    04203900
SAFPFAU  EQU   2                   FRACHECK - Fast authorization       +04207800
                                              function                  04211700
SAFPLIS  EQU   3                   RACLIST  - In-storage list building +04215600
                                              function                  04219500
SAFPDEF  EQU   4                   RACDEF   - Definition function       04223400
SAFPVER  EQU   5                   RACINIT  - Verification function     04227300
SAFPEXT  EQU   6                   RACXTRT  - Extract function     @L6A 04231200
SAFPDIR  EQU   7                   RACDAUTH - Directed Authorization   +04235100
                                              function             @M1A 04239000
SAFPTKMP EQU   8                   RACTKSRV - Security Token Services  +04242900
                                                                   @M1A 04246800
SAFPVERX EQU   9                   RACINIT  - Envir=verifyx        @M2A 04248700
SAFPTKXT EQU   10                  RACTKSRV - Extract token        @M2A 04250600
SAFPTBLD EQU   11                  RACINIT  - Token build          @M2A 04252500
SAFPEXTB EQU   12                  RACXTRT  - Branch Entry         @P2A 04254400
SAFPAUD  EQU   13                  RACAUDIT - Auditing Service     @M4A 04256300
SAFPSTAT EQU   14                  RACSTAT  - Status Service       @M5A 04258200
SAFPSIGN EQU   15                  SIGNON   - PV function          @M8A 04260100
SAFPTXMP EQU   16                  RACTKSRV - Security Token Services  +04262000
                                              in XM mode           @M6A 04263900
SAFPTXXT EQU   17                  RACTKSRV - Extract token in XM      +04265800
                                              mode                 @M6A 04267700
*                                                                       04270200
*      CONSTANTS FOR SAFPRRET and SAFPRREA                              04274100
*        for the requests handled in SAF                                04278000
*                                                                       04281900
*     /************************************/                            04285800
*     /*  Constants for TOKENBLD request  */                            04289700
*     /************************************/                            04293600
SAFPTBRC EQU   08                       SAFPTBLD request SAF r.c  @M3A  04297500
*                                                                       04301400
*        The following reason codes are used :                          04305300
*                                                                       04309200
SAFPTBUT EQU   00                       TOKNOUT missing...        @M3A  04311800
*                                     - 9C7 SAF abend             @P5C  04314400
SAFPTBUL EQU   04                       TOKNOUT length too small: @M3A  04317000
*                                       on return the length field      04320900
*                                       in the token has the correct    04324800
*                                       length...                 @P3C  04327100
*                                     - 9C7 SAF abend             @P5C  04329400
SAFPTBTK EQU   08                       Invalid token data...     @M3A  04331700
*                                     - 9C7 SAF abend             @P5C  04334000
SAFPTBSL EQU   12                       STOKEN length too small:  @P3A  04336500
*                                       on return the length field      04340400
*                                       in the token has the correct    04344300
*                                       length...                 @P3A  04346900
*                                     - 9C7 SAF abend             @P5C  04349500
SAFPTBUB EQU   16                       TOKNOUT length too large: @P3A  04352100
*                                       on return the length field      04356000
*                                       in the token has the correct    04359900
*                                       length                    @P3A  04363800
SAFPTBSB EQU   20                       STOKEN length too large:  @P3A  04367700
*                                       on return the length field      04371600
*                                       in the token has the correct    04375500
*                                       length                    @P3A  04379400
SAFPTBV0 EQU   24                       A token passed in did not have  04383300
*                                       its version set...        @P4A  04385900
*                                     - 9C7 SAF abend             @P5C  04388500
SAFPTBIL EQU    28            TOKNIN length too small:                  04391100
*                              on return the length field               04395000
*                              in the token has the right length...@D1A 04397600
*                            - 9C7 SAF abend                       @P5C 04400200
SAFPTBIB EQU    32            TOKNIN length too large:                  04402800
*                              on return the length field               04406700
*                              in the token has the right length   @D1A 04410600
*                                                                       04414500
*     /************************************/                            04418400
*     /*  Constants for VERIFYX  request  */                            04422300
*     /************************************/                            04426200
SAFPVXRC EQU   60                  SAFPVERX request SAF r.c        @M2A 04430100
*                                                                       04434000
*   The following reason codes are used :                               04437900
*                                                                       04441800
SAFPVXNR EQU    00            RACF not available                   @M2A 04445700
SAFPVXOP EQU    04            Old Password required                @M2A 04449600
SAFPVXUS EQU    08            Userid required                      @M2A 04453500
SAFPVXEF EQU    12            ESTAE failed                         @M2A 04457400
SAFPVXUT EQU    16            TOKNOUT keyword missing...           @M2A 04460000
*                           - 9C7 SAF abend                        @P5C 04462600
SAFPVXUL EQU    20            TOKNOUT length too small:                 04465200
*                              on return the length field               04469100
*                              in the token has the right length...@M2A 04471400
*                           - 9C7 SAF abend                        @P5C 04473700
SAFPVXTK EQU    24            Invalid token data...                @M3A 04476000
*                           - 9C7 SAF abend                        @P5C 04478300
SAFPVXSL EQU    28            STOKEN length too small:                  04480800
*                              on return the length field               04484700
*                              in the token has the right length...@P3A 04487300
*                           - 9C7 SAF abend                        @P5C 04489900
SAFPVXUB EQU    32            TOKNOUT length too large:                 04492500
*                              on return the length field               04496400
*                              in the token has the right length   @P3A 04500300
SAFPVXSB EQU    36            STOKEN length too large:                  04504200
*                              on return the length field               04508100
*                              in the token has the right length   @P3A 04512000
SAFPVXV0 EQU    40            A token passed in did not have its        04515900
*                              version set...                      @P4A 04518500
*                           - 9C7 SAF abend                        @P5C 04521100
SAFPVXIL EQU    44            TOKNIN length too small:                  04523700
*                              on return the length field               04527600
*                              in the token has the right length...@D1A 04530200
*                           - 9C7 SAF abend                        @P5C 04532800
SAFPVXIB EQU    48            TOKNIN length too large:                  04535400
*                              on return the length field               04539300
*                              in the token has the right length   @D1A 04543200
*                                                                       04547100
*     /************************************/                            04551000
*     /*  Constants for VERIFY  request   */                            04554900
*     /************************************/                            04558800
SAFPVYRC EQU   64                       SAFPVER request SAF r.c   @M3A  04562700
*                                                                       04566600
*        The following reason codes are used :                          04570500
*                                                                       04574400
SAFPVYTK EQU   00             Invalid token data...                @M3A 04576800
*                           - 9C7 SAF abend                        @P5C 04579200
SAFPVYUL EQU   04             TOKNIN length too small:                  04581600
*                              on return the length field               04584000
*                              in the token has the right length...@P3A 04586400
*                           - 9C7 SAF abend                        @P5C 04588800
SAFPVYSL EQU   08             STOKEN length too small:                  04591200
*                              on return the length field               04593600
*                              in the token has the right length...@P3A 04596000
*                           - 9C7 SAF abend                        @P5C 04598400
SAFPVYUB EQU   12             TOKNIN length too large:                  04600800
*                              on return the length field               04603200
*                              in the token has the right length   @P3A 04605600
SAFPVYSB EQU   16             STOKEN length too large:                  04608000
*                              on return the length field               04610400
*                              in the token has the right length   @P3A 04612800
SAFPVYV0 EQU   20             A token passed in did not have its        04615200
*                              version set...                      @P4A 04617600
*                           - 9C7 SAF abend                        @P5C 04620000
*                                                                       04622400
*     /************************************/                            04624800
*     /*  Constants for SIGNON  request   */                            04627200
*     /************************************/                            04629600
SAFPSGRC EQU   12                       SAFPSIGN request SAF r.c   @M8A 04629900
*                                                                       04630200
*        The following reason codes are used :                          04630500
*                                                                       04630800
SAFPSGNE EQU   00             Environment error:                        04631100
*                             No ESA support for SIGNON request    @M8A 04631400
SAFPSGOL EQU   12             TOKNOUT length too small:                 04631700
*                              on return the length field               04632000
*                              in the token has the right length   @M8A 04632300
*                             - 9C7 SAF abend                      @M8A 04632600
SAFPSGOT EQU   04             TOKNOUT length too large:                 04632900
*                              on return the length field               04633200
*                              in the token has the right length   @M8A 04633500
*                                                                       04633800
*     /************************************/                            04634100
*     /*  Constants for Version/Release   */                            04634400
*     /************************************/                            04634700
SAFPCURR EQU   X'09'        - Current level of RACF                @MGC 04635000
SAFPRL19 EQU   X'00'        - Indicates RACF 1.9.0                 @M7A 04635300
SAFPR192 EQU   X'02'        - Indicates RACF 1.9.2                 @M8A 04635600
SAFPRL21 EQU   X'03'        - Indicates RACF 2.1.0                 @M9A 04636200
SAFPRL22 EQU   X'04'        - Indicates RACF 2.2.0                 @MAA 04636500
SAFPRL23 EQU   X'05'        - Indicates RACF 2.3.0                 @MBA 04636600
SAFPRL24 EQU   X'06'        - Indicates RACF 2.4.0                 @MCA 04636700
SAFPRL26 EQU   X'07'        - Indicates RACF 2.6.0                 @MDA 04641100
SAFPRL28 EQU   X'08'        - Indicates RACF 2608                  @MEA 04643300
SAFPRL73 EQU   X'09'        - Indicates RACF 7703                  @MFA 04644400
*                                                                       04645500
         MEND                                                           04650000
*        */                                                             04700000
*%ICH_SAFP3: ;                                                          04750000
*   DCL                                                                 04800000
*     1 SAFP BASED(SAFPPTR) BDY(WORD),                                  04850000
*      2 SAFPRRET FIXED(31),    /* RACF or installation exit            04877500
*                                  Return Code                       */ 04905000
*      2 SAFPRREA FIXED(31),    /* RACF or installation exit            04932500
*                                  Reason Code                       */ 04960000
*      2 SAFPPLN FIXED(15),     /* Length of SAFP parameter list        04987500
*                                  (in bytes)                        */ 05015000
*      2 SAFPVRRL FIXED(8),     /* RACF Version/Release list indicator  05042500
*                                  (values defined below)        @M7A*/ 05070000
*      2 * CHAR(1),             /* Reserved                      @M7C*/ 05097500
*      2 SAFPREQT FIXED(15),    /* Request number (values defined       05125000
*                                  below)                            */ 05152500
*      2 SAFPFLGS BIT(8),       /* Flags                         @L8A*/ 05180000
*       3 SAFPMSGR BIT(1),      /* 1 - Message return requested  @L8A*/ 05207500
*       3 SAFPR18 BIT(1),       /* 1 - Release 1.8 or higher function   05235000
*                                      was requested             @L8A*/ 05262500
*       3 SAFPSUPP BIT(1),      /* 1 - Message suppression on    @P1A*/ 05290000
*       3 SAFPDCPL BIT(1),      /* 1 - DECOUPL=yes               @M2A*/ 05317500
*       3 SAFPSYST BIT(1),      /* 1 - SYSTEM=yes                @M8A*/ 05345000
*       3 * BIT(3),             /* RESERVED                      @M8C*/ 05372500
*      2 SAFPMSPL FIXED(8),     /* Subpool to be used for messages      05400000
*                                  to be returned, if SAFPMSGR is       05427500
*                                  on                            @L8A*/ 05455000
*      2 SAFPREQR PTR(31),      /* Requestor name address (points       05482500
*                                  to an 8-byte character field)     */ 05510000
*      2 SAFPSUBS PTR(31),      /* Subsystem name address (points       05537500
*                                  to an 8-byte character field)     */ 05565000
*      2 SAFPWA   PTR(31),      /* SAF work area address             */ 05592500
*      2 SAFPMSAD PTR(31),      /* Upon return, will contain the        05620000
*                                  address of the message(s) returned   05647500
*                                  from the invoked function (if        05675000
*                                  SAFPMSGR is on), or zero if no       05702500
*                                  message is returned           @L8A*/ 05730000
*      2 * PTR (31),            /* RESERVED                      @L8A*/ 05759000
*      2 SAFPRACP FIXED(31),    /* Offset to RACF related parameter     05789300
*                                  list from base address of SAFP    */ 05819600
*      2 SAFPSFRC FIXED(31),    /* SAF Return Code               @M5A*/ 05821200
*      2 SAFPSFRS FIXED(31),    /* SAF Reason Code               @M5A*/ 05822800
*      2 SAFPPLNX FIXED(15),    /* Length of SAFP extension parameter   05824400
*                                  list (in bytes)               @M5A*/ 05826000
*      2 SAFPOLEN FIXED(15),    /* Length of Original Plist      @M5A*/ 05827600
*      2 SAFPRETD PTR(31),      /* Adress of returned data       @M5A*/ 05829200
*      2 SAFPFLAT PTR(31),      /* Adress of flat parameter      @M5A*/ 05830800
*      2 SAFPECB1 PTR(31),      /* Adress of ECB1                @M5A*/ 05832400
*      2 SAFPECB2 PTR(31),      /* Adress of ECB1                @M5A*/ 05834000
*      2 SAFPPREV PTR(31),      /* Adress of previous flat list  @M5A*/ 05835600
*      2 SAFPNEXT PTR(31),      /* Adress of next flat list      @M5A*/ 05837200
*      2 SAFPORIG PTR(31),      /* Adress of origional list      @M5A*/ 05838800
*      2 SAFPFLEN FIXED(31),    /* Flat parameter list length    @M5A*/ 05840400
*      2 SAFPUSRW FIXED(31),    /* User Word - Identifier        @M5A*/ 05842000
*      2 SAFPPREE PTR(31),    /* Address of Pre-Processing exit  @M5A*/ 05843600
*      2 SAFPPOST PTR(31),    /* Address of Post-Processing exit @M5A*/ 05845200
*      2 SAFPSYNC PTR(31),      /* Address of Synchronous ECB    @M5A*/ 05846800
*      2 SAFPSKEY FIXED(8),     /* Requestors Storage Key        @P7A*/ 05847300
*      2 SAFPMODE FIXED(8),     /* Requestors Addressing mode    @P7A*/ 05847800
*      2 SAFPSBYT FIXED(8),     /* Status Byte                   @P7A*/ 05848300
*       3 SAFPGCS  BIT(1),      /* 1 - Request came from GCS     @P7A*/ 05848800
*       3 SAFPSFSU BIT(1),      /* 1 - SFS user accessing own file      05848900
*                                      or directory (used for           05849000
*                                      SFSAUTOACCESS processing  @MBA*/ 05849100
*      2 *        FIXED(8),     /* Reserved                      @P7C*/ 05849300
*      2 * CHAR(0) BDY(WORD);                                           05850000
*                                                                       05900000
*   DCL                                                                 05950000
*     SAFPLEN FIXED(31) CONSTANT(LENGTH(SAFP));                         06000000
*                                                                       06050000
*          /*  CONSTANTS FOR REQUEST NUMBER VALUES  */                  06100000
*                                                                       06150000
*   DCL                                                                 06200000
*     SAFPAU  FIXED(8) CONSTANT(1), /* RACHECK  - Authorization         06245800
*                                                 function           */ 06291600
*     SAFPFAU FIXED(8) CONSTANT(2), /* FRACHECK - Fast authorization    06337400
*                                                 function           */ 06383200
*     SAFPLIS FIXED(8) CONSTANT(3), /* RACLIST  - In-storage list       06429000
*                                                 building function  */ 06474800
*     SAFPDEF FIXED(8) CONSTANT(4), /* RACDEF   - Definition            06520600
*                                                 function           */ 06566400
*     SAFPVER FIXED(8) CONSTANT(5), /* RACINIT  - Verification          06612200
*                                                 function       @L6A*/ 06658000
*     SAFPEXT FIXED(8) CONSTANT(6), /* RACXTRT  - Extract function      06703800
*                                                                @L6A*/ 06750000
*     SAFPDIR FIXED(8) CONSTANT(7), /* RACDAUTH - Directed Authorization06800000
*                                                 function       @M1A*/ 06850000
*     SAFPTKMP FIXED(8) CONSTANT(8), /* RACTKSRV - Security Token       06900000
*                                                 services       @M1A*/ 06950000
*     SAFPVERX FIXED(8) CONSTANT(9), /* RACINIT  - envir=verifyx        07000000
*                                                                @M2A*/ 07050000
*     SAFPTKXT FIXED(8) CONSTANT(10),/* RACTKSRV - extract  Token       07076900
*                                                 services       @M2A*/ 07103800
*     SAFPTBLD FIXED(8) CONSTANT(11),/* RACINIT  - Token build          07130700
*                                                 services       @M2A*/ 07157600
*     SAFPEXTB FIXED(8) CONSTANT(12),/* RACXTRT  - Branch Entry  @P2A*/ 07184500
*     SAFPAUD  FIXED(8) CONSTANT(13),/* RACAUDIT - Audit Service @P6C*/ 07211400
*     SAFPSTAT FIXED(8) CONSTANT(14),/* RACSTAT - Status Service @P6A*/ 07238300
*     SAFPSIGN FIXED(8) CONSTANT(15),/* SIGNON request           @M8A*/ 07265200
*     SAFPTXMP FIXED(8) CONSTANT(16), /* Token map request for          07292100
*                                        XMREQ=YES is specified  @M6A*/ 07319000
*     SAFPTXXT FIXED(8) CONSTANT(17); /* Token extract request for      07345900
*                                        XMREQ=YES is specified  @M6A*/ 07372800
*                                                                       07400000
*     /****************************************/                        07450000
*     /*  Constants for SAFPRRET and SAFPRREA */                        07500000
*     /*  for the requests handled in SAF     */                        07550000
*     /****************************************/                        07600000
*   @SPACE(2);                                                          07650000
*     /************************************/                            07700000
*     /*  Constants for TOKENBLD request  */                            07750000
*     /************************************/                            07800000
*   DCL                                                                 07850000
*     SAFPTBRC FIXED(8) CONSTANT(08),/* SAFPTBLD request SAF r.c  @M3A*/07900000
*                                                                       07950000
*     /* The following reason codes are used : */                       08000000
*     SAFPTBUT FIXED(8) CONSTANT(00),/* TOKNOUT missing                 08033300
*                                     - 9C7 SAF abend             @P5C*/08066600
*     SAFPTBUL FIXED(8) CONSTANT(04),/* TOKNOUT length too small:       08100000
*                                       on return the length field      08150000
*                                       in the token has the correct    08200000
*                                       length                          08230000
*                                     - 9C7 SAF abend             @P5C*/08260000
*     SAFPTBTK FIXED(8) CONSTANT(08),/* Invalid token data              08290000
*                                     - 9C7 SAF abend             @P5C*/08320000
*     SAFPTBSL FIXED(8) CONSTANT(12),/* STOKEN length too small:        08350000
*                                       on return the length field      08400000
*                                       in the token has the correct    08450000
*                                       length                          08483300
*                                     - 9C7 SAF abend             @P5C*/08516600
*     SAFPTBUB FIXED(8) CONSTANT(16),/* TOKNOUT length too large:       08550000
*                                       on return the length field      08600000
*                                       in the token has the correct    08650000
*                                       length                    @P3A*/08700000
*     SAFPTBSB FIXED(8) CONSTANT(20),/* STOKEN length too large:        08750000
*                                       on return the length field      08800000
*                                       in the token has the correct    08850000
*                                       length                    @P3A*/08900000
*     SAFPTBV0 FIXED(8) CONSTANT(24),/* A token passed in did not have  08950000
*                                       its version set                 08983300
*                                     - 9C7 SAF abend             @P5C*/09016600
*     SAFPTBIL FIXED(8) CONSTANT(28),/* TOKNIN length too small:        09050000
*                                       on return the length field      09100000
*                                       in the token has the correct    09150000
*                                       length                          09183300
*                                     - 9C7 SAF abend             @P5C*/09216600
*     SAFPTBIB FIXED(8) CONSTANT(28);/* TOKNIN length too large:        09250000
*                                       on return the length field      09300000
*                                       in the token has the correct    09350000
*                                       length                    @D1A*/09400000
*                                                                       09450000
*     /************************************/                            09500000
*     /*  Constants for VERIFYX  request  */                            09550000
*     /************************************/                            09600000
*   DCL                                                                 09650000
*     SAFPVXRC FIXED(8) CONSTANT(60),/* SAFPVERX request SAF r.c  @M2A*/09700000
*                                                                       09750000
*     /* The following reason codes are used : */                       09800000
*     SAFPVXNR FIXED(8) CONSTANT(00),/* RACF not available        @M2A*/09850000
*     SAFPVXOP FIXED(8) CONSTANT(04),/* Old Password required     @M2A*/09900000
*     SAFPVXUS FIXED(8) CONSTANT(08),/* Userid required           @M2A*/09950000
*     SAFPVXEF FIXED(8) CONSTANT(12),/* ESTAE failed              @M2A*/10000000
*     SAFPVXUT FIXED(8) CONSTANT(16),/* TOKNOUT keyword missing         10033300
*                                     - 9C7 SAF abend             @P5C*/10066600
*     SAFPVXUL FIXED(8) CONSTANT(20),/* TOKNOUT length too small:       10100000
*                                       on return the length field      10150000
*                                       in the token has the right      10200000
*                                       length                          10230000
*                                     - 9C7 SAF abend             @P5C*/10260000
*     SAFPVXTK FIXED(8) CONSTANT(24),/* Invalid token data              10290000
*                                     - 9C7 SAF abend             @P5C*/10320000
*     SAFPVXSL FIXED(8) CONSTANT(28),/* STOKEN length too small:        10350000
*                                       on return the length field      10400000
*                                       in the token has the right      10450000
*                                       length                          10483300
*                                     - 9C7 SAF abend             @P5C*/10516600
*     SAFPVXUB FIXED(8) CONSTANT(32),/* TOKNOUT length too large:       10550000
*                                       on return the length field      10600000
*                                       in the token has the right      10650000
*                                       length                    @P3A*/10700000
*     SAFPVXSB FIXED(8) CONSTANT(36),/* STOKEN length too large:        10750000
*                                       on return the length field      10800000
*                                       in the token has the right      10850000
*                                       length                    @P3A*/10900000
*     SAFPVXV0 FIXED(8) CONSTANT(40),/* A token passed in did not have  10950000
*                                       its version set                 10983300
*                                     - 9C7 SAF abend             @P5C*/11016600
*     SAFPVXIL FIXED(8) CONSTANT(44),/* TOKNIN length too small:        11050000
*                                       on return the length field      11100000
*                                       in the token has the correct    11150000
*                                       length                          11183300
*                                     - 9C7 SAF abend             @P5C*/11216600
*     SAFPVXIB FIXED(8) CONSTANT(48);/* TOKNIN length too large:        11250000
*                                       on return the length field      11300000
*                                       in the token has the correct    11350000
*                                       length                    @D1A*/11400000
*                                                                       11450000
*     /************************************/                            11500000
*     /*  Constants for VERIFY  request   */                            11550000
*     /************************************/                            11600000
*   DCL                                                                 11650000
*     SAFPVYRC FIXED(8) CONSTANT(64),/* SAFPVER request SAF r.c   @M3A*/11700000
*                                                                       11750000
*     /* The following reason codes are used : */                       11800000
*     SAFPVYTK FIXED(8) CONSTANT(00),/* Invalid token data              11833300
*                                     - 9C7 SAF abend             @P5C*/11866600
*     SAFPVYUL FIXED(8) CONSTANT(04),/* TOKNIN length too small:        11900000
*                                       on return the length field      11950000
*                                       in the token has the right      12000000
*                                       length                          12033300
*                                     - 9C7 SAF abend             @P5C*/12066600
*     SAFPVYSL FIXED(8) CONSTANT(08),/* STOKEN length too small:        12100000
*                                       on return the length field      12150000
*                                       in the token has the right      12200000
*                                       length                          12233300
*                                     - 9C7 SAF abend             @P5C*/12266600
*     SAFPVYUB FIXED(8) CONSTANT(12),/* TOKNIN length too large:        12300000
*                                       on return the length field      12350000
*                                       in the token has the right      12400000
*                                       length                    @P3A*/12450000
*     SAFPVYSB FIXED(8) CONSTANT(16),/* STOKEN length too large:        12500000
*                                       on return the length field      12550000
*                                       in the token has the right      12600000
*                                       length                    @P3A*/12650000
*     SAFPVYV0 FIXED(8) CONSTANT(20);/* A token passed in did not have  12700000
*                                       its version set                 12733300
*                                     - 9C7 SAF abend             @P5C*/12766600
*                                                                       12800000
*     /************************************/                            12850000
*     /*  Constants for SIGNON request    */                            12900000
*     /************************************/                            12950000
*   DCL                                                                 13000000
*     SAFPSGRC FIXED(8) CONSTANT(12),/* SAFPSIGN request SAF r.c  @M8A*/13050000
*                                                                       13150000
*       /*  The following reason codes are used */                      13200000
*                                                                       13250000
*     SAFPSGNE FIXED(8) CONSTANT(0), /* Environment error:              13300000
*                                       No ESA support for SIGNON @M8A*/13350000
*     SAFPSGOL FIXED(8) CONSTANT(12),/* TOKNOUT length too small:       13400000
*                                       on return the length field      13450000
*                                       in the token has the right      13500000
*                                       length - 9C7 SAF abend    @M8A*/13550000
*     SAFPSGOT FIXED(8) CONSTANT(4); /* TOKNOUT length too large:       13600000
*                                       on return the length field      13650000
*                                       in the token has the right      13700000
*                                       length                    @M8A*/13750000
*                                                                       13800000
*     /************************************/                            13850000
*     /*  Constants for Version/Release   */                            13900000
*     /************************************/                            13950000
*   DCL                                                                 14000000
*     SAFPCURR FIXED(8) CONSTANT(9),  /*    Current level of RACF @MFC*/14050000
*     SAFPRL19 FIXED(8) CONSTANT(0),  /*    Indicates RACF 1.9.0  @M7A*/14100000
*     SAFPR192 FIXED(8) CONSTANT(2),  /*    Indicates RACF 1.9.2  @M8A*/14150000
*     SAFPRL21 FIXED(8) CONSTANT(3),  /*    Indicates RACF 2.1.0  @MAC*/14200000
*     SAFPRL22 FIXED(8) CONSTANT(4),  /*    Indicates RACF 2.2.0  @MAA*/14250000
*     SAFPRL23 FIXED(8) CONSTANT(5),  /*    Indicates RACF 2.3.0  @MCC*/14300000
*     SAFPRL24 FIXED(8) CONSTANT(6);  /*    Indicates RACF 2.4.0  @MCA*/14350000
* DCL SAFPRL26 FIXED(8) CONSTANT(7);  /*    Indicates RACF 2.6.0  @MDA*/14400000
* DCL SAFPRL28 FIXED(8) CONSTANT(8);  /*    Indicates RACF 2608   @MEA*/14450000
* DCL SAFPRL73 FIXED(8) CONSTANT(9);  /*    Indicates RACF 7703   @MFA*/14500000
