         MACRO                                                          00050000
         IDAVSOPT &OPTCD=,&AM=,&MF=,&CALLER=                   @ZA34940 00100000
.*                                                                      00110000
.* $MAC(IDAVSOPT) COMP(SC1DE):                                          00130000
.*                                                                      00150000
.*PROPRIETARY V3 STATEMENT                                           *  00153300
.*LICENSED MATERIALS - PROPERTY OF IBM                               *  00156600
.*"RESTRICTED MATERIALS OF IBM"                                      *  00159900
.*5695-DF1                                                           *  00162400
.*(C) COPYRIGHT 1987,1995  IBM CORP.                                 *  00164900
.*END PROPRIETARY V3 STATEMENT                                       *  00167400
.*                                                                      00170000
.* STATUS = DFSMS/MVS VERSION 1 RELEASE 3.0                             00213300
.*                                                                      00256600
.* FUNCTION -  THIS MACRO PROCESSES THE RPL KEYWORD OPTCD.  IT IS       00303500
.*             CALLED BY IDAVSRPL. IT VALIDITY CHECKS THE OPTIONS       00350400
.*             SPECIFIED BY THE USER ON GENCB, MODCB, OR TESTCB FOR     00397300
.*             OPTCD.  IT CHECKS FOR MUTUALLY EXCLUSIVE OPTIONS         00444200
.*             SPECIFIED AND ISSUES ERROR MESSAGES VIA IDAERMAC.        00491100
.*             IF THE OPTIONS ARE VALID, IDAVSOPT SETS VALUES IN        00538000
.*             VARIOUS GLOBAL ARRAYS TO BE USED BY IDACB2 TO BUILD      00584900
.*             A PARAMETER LIST OF ARGUMENT CONTROL ENTRIES FOR THE     00631800
.*             CONTROL BLOCK MANIPULATION MODULE TO BE USED AT EXECUTE  00678700
.*             TIME.  IT CALLS IDAVSCB3 TO SET THE ELEMENT TYPE CODE    00725600
.*             AND THE KEYWORD TYPE CODE FOR OPTCD.                     00772500
.*                                                                      00820000
.*             IT IS ALSO CALLED BY THE RPL DECLARATIVE MACRO VIA       00860000
.*             IDAVSRPL. WHEN CALLED BY THE DECLARATIVE MACRO,          00910000
.*             DIFFERENT GLOBALS ARE SET THAN THASE USED BY THE CBMM.   01150000
.*             THEREFORE, THE BITS SET IN THESE GLOBALS MUST BE         01200000
.*             IDENTICAL TO THE WAY THEY WILL APPEAR WHEN THE           01250000
.*             CONTROL BLOCK IS GENERATED.                              01300000
.*                                                                      01350000
.*                                                                      01400000
.*                                                                      01450000
.*  CHANGE ACTIVITY                                                     01500000
.*   SESSPARM MUTUALLY EXCLUSIVE WITH LOGONMSG DEFAULT         @ZA07555 01550000
.*   CBMM SPLIT SUPPORT                                        @ZA34940 01570000
.* $L9=DFP,HDP2230,,STLJRB: MVS/XA DFP RELEASE 2.3 VSAM 31-BIT     @L9A 01585000
.* UPD AND NSP NO LONGER MUTUALLY EXCLUSIVE                    @YA06306 01592500
.* BACK OUT CHANGES MADE BY PE06306, UPD & NSP MUTUALLY EXCL   @YA07985 01596200
.* $LA=DFSMS,HDZ11C0,043093,SJPLRG: VSAM RLS                       @LAA 01614100
.* $EA=DFSMS,HDZ11C0,091594,SJPLDKT: EXTENDED ADDRESSABILITY       @EAA 01623000
.* $EA=VSAMEA,HDZ11C0,090895,SJPLTLD: EXTENDED ADDRESSABILITY  @WA15531 01627500
.******************************************************************@LAC 01632000
.* GLOBALS                                                              01650000
         GBLB  &IDACB01                ERROR INDICATOR                  01700000
         GBLA  &IDAENO                 NUMBER OF ELEMENTS               01750000
         GBLC  &IDAVALC(60)            ELEMENT CHAR VAL ARRAY  @WA15531 01800000
         GBLA  &IDAELEN(60)            ELEMENT FIELD LEN ARRAY @WA15531 01850000
         GBLC  &IDAOPT2,&IDAOPT3       BIT STRING EXTENSIONS            01900000
.*             THE FOLLOWING GLOBALS ARE USED TO PASS THE VALUES OF     01950000
.*             THE OPTCD BYTES BACK TO THE DECLARATIVE MACRO RPL.       02000000
         GBLC  &IDAOP1,&IDAOP2,&IDAOP5,&IDAOP6,&IDAOP7,&IDAOP8  X04SVHS 02050000
         GBLC  &IDAOP9,&IDAOPA,&IDAOPB,&IDAOPC,&IDAOP3,&IDAOP4     @EAC 02100000
.* LOCALS                                                               02150000
         LCLA  &I,&A,&B,&C,&D,&ERR               WORK VARIABLES X04SVHS 02200000
         LCLB  &KEY,&ADR,&CNV,&SEQ,&DIR,&SKP     OPTCD CODES            02250000
         LCLB  &SYN,&ASY,&NUP,&UPD,&NSP,&KEQ      OPTCD CODES           02300000
         LCLB  &KGE,&FKS,&GEN,&MVE,&LOC          OPTCD CODES            02350000
         LCLB  &CA,&CS,&RELEASE,&PASS            OPTCD CODES   @Z40BHUC 02400000
         LCLB  &WAITX,&NWAITX                    OPTCD CODES   @ZA07549 02450000
         LCLB  &RBA,&XRBA                        OPTCD CODES       @EAA 02475000
         LCLB  &NERASE,&EAU,&ERASE,&SPEC,&ANY    OPTCD CODES     X03004 02500000
         LCLB  &NCONV,&CONV,&LBT,&BLK,&COND      OPTCD CODES     X03004 02550000
         LCLB  &UNCOND,&LOCK,&LGONMSG,&DEVCHAR   OPTCD CODES     X03004 02600000
         LCLB  &TERMS,&APPSTAT,&COUNTS,&RNNAME   OPTCD CODES     X03004 02650000
         LCLB  &CIDXLAT,&TOPLGON,&BSCID,&LBM     OPTCD CODES     X03004 02700000
         LCLB  &DISPLAY,&RELRQ,&NRELRQ,&Q,&NQ    OPTCD CODES     X03004 02750000
         LCLB  &PEND,&SESSION,&ACTIVE,&UNCONDL   OPTCD CODES     X03004 02800000
         LCLB  &QUIESCE,&START,&STOP,&ACCEPT     OPTCD CODES     X03004 02850000
         LCLB  &ACQUIRE,&CONALL,&CONANY          OPTCD CODES   @Z40BHUC 02900000
         LCLB  &KEEP,&TRUNC                      OPTCD CODES   @Z40BHUC 02950000
         LCLB  &NIBTK                            OPTCD CODES   @Z40BHUC 03000000
         LCLB  &FMHDR,&NFMHDR                    OPTCD CODE    X03004HS 03050000
         LCLB  &FWD,&BWD,&ARD,&LRD               OPTCD CODES    X04SVHS 03100000
         LCLB  &SESSPRM                          OPTCD CODE    @Z40BHUC 03150000
         LCLB  &SESSKEY                          OPTCD CODE    @G40AKSL 03200000
         LCLB  &NRI,&CR,&CRE,&NOKL,&KL           RLS OPTCD CODES   @LAA 03225000
.*                                                                      03250000
         AIF   ('&OPTCD' EQ '').T010100 CHECK FOR NULL PARAM    X04SVHS 03300000
         AIF   ('&CALLER' EQ 'RPL').T000100                     X04SVHS 03350000
.*             IF CALLED BY RPL DECLARATIVE, BYPASS            @ZA34940 03400000
.*             CALL OF IDAVSCB3                                @ZA34940 03440000
         IDAVSCB3 ARG=&OPTCD,ARGNAME=OPTCD,KWTC=X'34',MF=&MF,  @ZA34940*03480000
               BIT=YES,INDRECT=YES                             @ZA34940 03520000
&IDAELEN(&IDAENO) SETA 12                                       X04SVHS 03600000
         AIF   ('&OPTCD(1)' EQ '*').T011600                     X04SVHS 03650000
.T000100 ANOP                                                           03700000
&I       SETA  &I+1                     BUMP INDEX VARIABLE             03750000
         AIF   (&I GT N'&OPTCD).T000300 HAVE ALL OPTIONS BEEN CHECKED   03800000
&KEY     SETB  ('&OPTCD(&I)' EQ 'KEY' OR &KEY)                          03850000
&ADR     SETB  ('&OPTCD(&I)' EQ 'ADR' OR &ADR)                          03900000
&CNV     SETB  ('&OPTCD(&I)' EQ 'CNV' OR &CNV)                          03950000
&SEQ     SETB  ('&OPTCD(&I)' EQ 'SEQ' OR &SEQ)                          04000000
&DIR     SETB  ('&OPTCD(&I)' EQ 'DIR' OR &DIR)                          04050000
&SKP     SETB  ('&OPTCD(&I)' EQ 'SKP' OR &SKP)                          04100000
&SYN     SETB  ('&OPTCD(&I)' EQ 'SYN' OR &SYN)                          04150000
&ASY     SETB  ('&OPTCD(&I)' EQ 'ASY' OR &ASY)                          04200000
&NUP     SETB  ('&OPTCD(&I)' EQ 'NUP' OR &NUP)                          04250000
&UPD     SETB  ('&OPTCD(&I)' EQ 'UPD' OR &UPD)                          04300000
&NSP     SETB  ('&OPTCD(&I)' EQ 'NSP' OR &NSP)                          04350000
&KEQ     SETB  ('&OPTCD(&I)' EQ 'KEQ' OR &KEQ)                          04400000
&KGE     SETB  ('&OPTCD(&I)' EQ 'KGE' OR &KGE)                          04450000
&FKS     SETB  ('&OPTCD(&I)' EQ 'FKS' OR &FKS)                          04500000
&GEN     SETB  ('&OPTCD(&I)' EQ 'GEN' OR &GEN)                          04550000
&MVE     SETB  ('&OPTCD(&I)' EQ 'MVE' OR &MVE)                          04600000
&LOC     SETB  ('&OPTCD(&I)' EQ 'LOC' OR &LOC)                          04650000
&FWD     SETB  ('&OPTCD(&I)' EQ 'FWD' OR &FWD)                  X04SVHS 04700000
&BWD     SETB  ('&OPTCD(&I)' EQ 'BWD' OR &BWD)                  X04SVHS 04750000
&ARD     SETB  ('&OPTCD(&I)' EQ 'ARD' OR &ARD)                  X04SVHS 04800000
&LRD     SETB  ('&OPTCD(&I)' EQ 'LRD' OR &LRD)                  X04SVHS 04850000
&WAITX   SETB  ('&OPTCD(&I)' EQ 'WAITX' OR &WAITX)             @ZA07549 04900000
&NWAITX  SETB  ('&OPTCD(&I)' EQ 'NWAITX' OR &NWAITX)           @ZA07549 04950000
&RBA     SETB  ('&OPTCD(&I)' EQ 'RBA' OR &RBA)                     @EAA 04952700
&XRBA    SETB  ('&OPTCD(&I)' EQ 'XRBA' OR &XRBA)                   @EAA 04955400
&NRI     SETB  ('&OPTCD(&I)' EQ 'NRI' OR &NRI)                     @LAA 04958300
&CR      SETB  ('&OPTCD(&I)' EQ 'CR' OR &CR)                       @LAA 04966600
&CRE     SETB  ('&OPTCD(&I)' EQ 'CRE' OR &CRE)                     @LAA 04974900
&KL      SETB  ('&OPTCD(&I)' EQ 'KL' OR &KL)                       @LAA 04983200
&NOKL    SETB  ('&OPTCD(&I)' EQ 'NOKL' OR &NOKL)                   @LAA 04991500
&A       SETA  &KEY+&ADR+&CNV+&SEQ+&DIR+&SKP+&SYN+&ASY+&NUP+&UPD+&NSP+&*05000000
               KEQ+&KGE+&FKS+&GEN+&MVE+&LOC+&FWD+&BWD+&ARD+&LRD+&WAITX+*05050000
               &NWAITX+&NRI+&CR+&CRE+&KL+&NOKL+&RBA+&XRBA      @WA15531 05100000
.*             &A CONTAINS THE NUMBER OF VSAM OPTIONS SPECIFIED         05150000
.*             &B, &C, AND &D CONTAIN THE NUMBER OF VTAM OPTIONS SPEC   05200000
.*             &ERR CONTAINS THE NUMBER OF ERRORS                       05250000
         AIF   (&A+&B+&C+&D+&ERR EQ &I).T000100                         05300000
.*             IF &A+&B+&C+&D+&ERR EQUAL &I, THE LAST OPTION CHECKED    05350000
.*             WAS A VALID VSAM OPTION.  ELSE CHECK FOR A VALID VTAM    05400000
.*             OPTION                                                   05450000
&CA      SETB  ('&OPTCD(&I)' EQ 'CA' OR &CA)                     X03004 05500000
&CS      SETB  ('&OPTCD(&I)' EQ 'CS' OR &CS)                     X03004 05550000
&RELEASE SETB  ('&OPTCD(&I)' EQ 'RELEASE' OR &RELEASE)           X03004 05600000
&PASS    SETB  ('&OPTCD(&I)' EQ 'PASS' OR &PASS)                 X03004 05650000
&NERASE  SETB  ('&OPTCD(&I)' EQ 'NERASE' OR &NERASE)             X03004 05700000
&EAU     SETB  ('&OPTCD(&I)' EQ 'EAU' OR &EAU)                   X03004 05750000
&ERASE   SETB  ('&OPTCD(&I)' EQ 'ERASE' OR &ERASE)               X03004 05800000
&SPEC    SETB  ('&OPTCD(&I)' EQ 'SPEC' OR &SPEC)                 X03004 05850000
&ANY     SETB  ('&OPTCD(&I)' EQ 'ANY' OR &ANY)                   X03004 05900000
&NCONV   SETB  ('&OPTCD(&I)' EQ 'NCONV' OR &NCONV)               X03004 05950000
&CONV    SETB  ('&OPTCD(&I)' EQ 'CONV' OR &CONV)                 X03004 06000000
&LBT     SETB  ('&OPTCD(&I)' EQ 'LBT' OR &LBT)                   X03004 06050000
&LBM     SETB  ('&OPTCD(&I)' EQ 'LBM' OR &LBM)                   X03004 06100000
&BLK     SETB  ('&OPTCD(&I)' EQ 'BLK' OR &BLK)                   X03004 06150000
&COND    SETB  ('&OPTCD(&I)' EQ 'COND' OR &COND)                 X03004 06200000
&UNCOND  SETB  ('&OPTCD(&I)' EQ 'UNCOND' OR &UNCOND)             X03004 06250000
&LOCK    SETB  ('&OPTCD(&I)' EQ 'LOCK' OR &LOCK)                 X03004 06300000
&LGONMSG SETB  ('&OPTCD(&I)' EQ 'LOGONMSG' OR &LGONMSG)          X03004 06350000
&DEVCHAR SETB  ('&OPTCD(&I)' EQ 'DEVCHAR' OR &DEVCHAR)           X03004 06400000
&TERMS   SETB  ('&OPTCD(&I)' EQ 'TERMS' OR &TERMS)               X03004 06450000
&APPSTAT SETB  ('&OPTCD(&I)' EQ 'APPSTAT' OR &APPSTAT)           X03004 06500000
&COUNTS  SETB  ('&OPTCD(&I)' EQ 'COUNTS' OR &COUNTS)             X03004 06550000
&RNNAME  SETB  ('&OPTCD(&I)' EQ 'RNNAME' OR &RNNAME)             X03004 06600000
&CIDXLAT SETB  ('&OPTCD(&I)' EQ 'CIDXLATE' OR &CIDXLAT)          X03004 06650000
&TOPLGON SETB  ('&OPTCD(&I)' EQ 'TOPLOGON' OR &TOPLGON)          X03004 06700000
&BSCID   SETB  ('&OPTCD(&I)' EQ 'BSCID' OR &BSCID)               X03004 06750000
&DISPLAY SETB  ('&OPTCD(&I)' EQ 'DISPLAY' OR &DISPLAY)           X03004 06800000
&RELRQ   SETB  ('&OPTCD(&I)' EQ 'RELRQ' OR &RELRQ)               X03004 06850000
&NRELRQ  SETB  ('&OPTCD(&I)' EQ 'NRELRQ' OR &NRELRQ)             X03004 06900000
&Q       SETB  ('&OPTCD(&I)' EQ 'Q' OR &Q)                       X03004 06950000
&NQ      SETB  ('&OPTCD(&I)' EQ 'NQ' OR &NQ)                     X03004 07000000
&PEND    SETB  ('&OPTCD(&I)' EQ 'PEND' OR &PEND)                 X03004 07050000
&SESSION SETB  ('&OPTCD(&I)' EQ 'SESSION' OR &SESSION)           X03004 07100000
&ACTIVE  SETB  ('&OPTCD(&I)' EQ 'ACTIVE' OR &ACTIVE)             X03004 07150000
&UNCONDL SETB  ('&OPTCD(&I)' EQ 'UNCONDL' OR &UNCONDL)           X03004 07200000
&QUIESCE SETB  ('&OPTCD(&I)' EQ 'QUIESCE' OR &QUIESCE)           X03004 07250000
&START   SETB  ('&OPTCD(&I)' EQ 'START' OR &START)               X03004 07300000
&STOP    SETB  ('&OPTCD(&I)' EQ 'STOP' OR &STOP)                 X03004 07350000
&ACCEPT  SETB  ('&OPTCD(&I)' EQ 'ACCEPT' OR &ACCEPT)             X03004 07400000
&ACQUIRE SETB  ('&OPTCD(&I)' EQ 'ACQUIRE' OR &ACQUIRE)           X03004 07450000
&CONALL  SETB  ('&OPTCD(&I)' EQ 'CONALL' OR &CONALL)             X03004 07500000
&CONANY  SETB  ('&OPTCD(&I)' EQ 'CONANY' OR &CONANY)             X03004 07550000
&KEEP    SETB  ('&OPTCD(&I)' EQ 'KEEP' OR &KEEP)                X3004BS 07600000
&TRUNC   SETB  ('&OPTCD(&I)' EQ 'TRUNC' OR &TRUNC)              X3004BS 07650000
&NIBTK   SETB  ('&OPTCD(&I)' EQ 'NIBTK' OR &NIBTK)              X3004BS 07700000
&FMHDR   SETB  ('&OPTCD(&I)' EQ 'FMHDR' OR &FMHDR)             X03004HS 07750000
&NFMHDR  SETB  ('&OPTCD(&I)' EQ 'NFMHDR' OR &NFMHDR)           X03004HS 07800000
&SESSPRM SETB  ('&OPTCD(&I)' EQ 'SESSPARM' OR &SESSPRM)        @Z40BHUC 07850000
&SESSKEY SETB  ('&OPTCD(&I)' EQ 'SESSKEY' OR &SESSKEY)         @G40AKSL 07900000
&B       SETA  &CA+&CS+&RELEASE+&PASS+&NERASE+&EAU+&ERASE+&SPEC+&ANY+&N*07950000
               CONV+&CONV+&LBT+&LBM+&BLK+&COND+&UNCOND+&LOCK+&LGONMSG+&*08000000
               DEVCHAR+&TERMS+&APPSTAT+&COUNTS+&RNNAME+&CIDXLAT         08050000
&C       SETA  &TOPLGON+&BSCID+&DISPLAY+&RELRQ+&NRELRQ+&Q+&NQ+&PEND+&SE*08100000
               SSION+&ACTIVE+&UNCONDL+&QUIESCE+&START+&STOP+&ACCEPT+&AC*08150000
               QUIRE+&CONALL+&CONANY+&KEEP                              08200000
&D       SETA  &TRUNC+&NIBTK+&FMHDR+&NFMHDR+&SESSPRM+&SESSKEY           08250000
.*                                                             @G40AKSL 08300000
.*             &A CONTAINS THE NUMBER OF VSAM OPTIONS SPECIFIED         08350000
.*             &B, &C, AND &D CONTAIN THE NUMBER OF VTAM OPTIONS SPEC   08400000
.*             &ERR CONTAINS THE NUMBER OF ERRORS                       08450000
         AIF   (&A+&B+&C+&D+&ERR EQ &I).T000200                         08500000
.*             IF &A+&B+&C+&D+&ERR EQUAL &I, THE LAST OPTION CHECKED    08550000
.*             WAS A VALID VTAM OPTION. ELSE IT WAS INVALID OR          08600000
.*             DUPLICATED A PREVIOUSLY SPECIFIED OPTION.                08650000
         IDAERMAC 5,OPTCD,&OPTCD(&I)                               @L9C 08700000
&IDACB01 SETB  1                                                        08750000
&ERR     SETA  &ERR+1                   BUMP ERROR COUNT        X04SVHS 08800000
         AGO   .T000100                                                 08850000
.T000200 AIF   ('&AM' EQ 'VTAM').T000100                                08900000
         IDAERMAC 20,&OPTCD(&I),OPTCD                              @L9C 08950000
&IDACB01 SETB  1                                                 X03004 09000000
         AGO   .T000100                                                 09050000
.********************************************************************** 09100000
.*                                                                      09150000
.*             THE FOLLOWING CODE CHECKS FOR MUTUALLY EXCLUSIVE OPTIONS 09200000
.*             IF THEY EXIST, AN ERROR MSG IS ISSUED                    09250000
.*                                                                      09300000
.T000300 AIF   (NOT(&KEY AND &ADR)).T000400                             09350000
         IDAERMAC 8,OPTCD,KEY,ADR                                  @L9C 09400000
&IDACB01 SETB  1                                                        09440000
.T000400 AIF   (NOT(&KEY AND &CNV)).T000500                             09480000
         IDAERMAC 8,OPTCD,KEY,CNV                                  @L9C 09520000
&IDACB01 SETB  1                                                        09560000
.T000500 AIF   (NOT(&ADR AND &CNV)).T000600                             09600000
         IDAERMAC 8,OPTCD,ADR,CNV                                  @L9C 09640000
&IDACB01 SETB  1                                                        09680000
.T000600 AIF   (NOT(&SEQ AND &DIR)).T000700                             09720000
         IDAERMAC 8,OPTCD,SEQ,DIR                                  @L9C 09760000
&IDACB01 SETB  1                                                        09800000
.T000700 AIF   (NOT(&SEQ AND &SKP)).T000800                             09840000
         IDAERMAC 8,OPTCD,SEQ,SKP                                  @L9C 09880000
&IDACB01 SETB  1                                                        09920000
.T000800 AIF   (NOT(&DIR AND &SKP)).T000900                             09960000
         IDAERMAC 8,OPTCD,DIR,SKP                                  @L9C 10000000
&IDACB01 SETB  1                                                        10040000
.T000900 AIF   (NOT(&SYN AND &ASY)).T001000                             10080000
         IDAERMAC 8,OPTCD,SYN,ASY                                  @L9C 10120000
&IDACB01 SETB  1                                                        10160000
.T001000 AIF   (NOT(&NUP AND &UPD)).T001100                             10200000
         IDAERMAC 8,OPTCD,NUP,UPD                                  @L9C 10240000
&IDACB01 SETB  1                                                        10280000
.T001100 AIF   (NOT(&NUP AND &NSP)).T001150                    @YA07985 10320000
         IDAERMAC 8,OPTCD,NUP,NSP                                  @L9C 10360000
&IDACB01 SETB  1                                               @YA07985 10370000
.T001150 AIF   (NOT(&UPD AND &NSP)).T001200                    @YA07985 10380000
         IDAERMAC 8,OPTCD,UPD,NSP                              @YA07985 10390000
&IDACB01 SETB  1                                                        10400000
.T001200 AIF   (NOT(&KEQ AND &KGE)).T001350                    @ZA07549 10560000
         IDAERMAC 8,OPTCD,KEQ,KGE                                  @L9C 10600000
&IDACB01 SETB  1                                                        10640000
.T001350 AIF   (NOT(&WAITX AND &NWAITX)).T001400               @ZA07549 10680000
         IDAERMAC 8,OPTCD,WAITX,NWAITX                             @L9C 10720000
&IDACB01 SETB  1                                               @ZA07549 10760000
.T001400 AIF   (NOT(&FKS AND &GEN)).T001500                             10800000
         IDAERMAC 8,OPTCD,FKS,GEN                                  @L9C 10840000
&IDACB01 SETB  1                                                        10880000
.T001500 AIF   (NOT(&MVE AND &LOC)).T001600                      X03004 10920000
         IDAERMAC 8,OPTCD,MVE,LOC                                  @L9C 10960000
&IDACB01 SETB  1                                                        11000000
.T001600 AIF   (NOT(&CA AND &CS)).T001700                          @EAC 11040000
         IDAERMAC 8,OPTCD,CA,CS                                    @L9C 11080000
&IDACB01 SETB  1                                                 X03004 11120000
.T001700 AIF   (NOT(&RBA AND &XRBA)).T001800                       @EAA 11130000
         IDAERMAC 8,OPTCD,RBA,XRBA                                 @EAA 11140000
&IDACB01 SETB  1                                                   @EAA 11150000
.T001800 AIF   (NOT(&RELEASE AND &PASS)).T001900                 X03004 11160000
         IDAERMAC 8,OPTCD,RELEASE,PASS                             @L9C 11200000
&IDACB01 SETB  1                                                 X03004 11240000
.T001900 AIF   (NOT(&NERASE AND &EAU)).T002000                   X03004 11280000
         IDAERMAC 8,OPTCD,NERASE,EAU                               @L9C 11320000
&IDACB01 SETB  1                                                 X03004 11360000
.T002000 AIF   (NOT(&NERASE AND &ERASE)).T002100                 X03004 11400000
         IDAERMAC 8,OPTCD,NERASE,ERASE                             @L9C 11440000
&IDACB01 SETB  1                                                 X03004 11480000
.T002100 AIF   (NOT(&EAU AND &ERASE)).T002200                    X03004 11520000
         IDAERMAC 8,OPTCD,EAU,ERASE                                @L9C 11560000
&IDACB01 SETB  1                                                 X03004 11600000
.T002200 AIF   (NOT(&SPEC AND &ANY)).T002300                     X03004 11640000
         IDAERMAC 8,OPTCD,SPEC,ANY                                 @L9C 11680000
&IDACB01 SETB  1                                                 X03004 11720000
.T002300 AIF   (NOT(&NCONV AND &CONV)).T002400                   X03004 11760000
         IDAERMAC 8,OPTCD,NCONV,CONV                               @L9C 11800000
&IDACB01 SETB  1                                                 X03004 11840000
.T002400 AIF   (NOT(&LBT AND &LBM)).T002500                      X03004 11880000
         IDAERMAC 8,OPTCD,LBT,LBM                                  @L9C 11920000
&IDACB01 SETB  1                                                 X03004 11960000
.T002500 AIF   (NOT(&LBT AND &BLK)).T002600                      X03004 12000000
         IDAERMAC 8,OPTCD,LBT,BLK                                  @L9C 12040000
&IDACB01 SETB  1                                                 X03004 12080000
.T002600 AIF   (NOT(&LBM AND &BLK)).T002700                      X03004 12120000
         IDAERMAC 8,OPTCD,LBM,BLK                                  @L9C 12160000
&IDACB01 SETB  1                                                 X03004 12200000
.T002700 AIF   (NOT(&COND AND &UNCOND)).T002800                  X03004 12240000
         IDAERMAC 8,OPTCD,COND,UNCOND                              @L9C 12280000
&IDACB01 SETB  1                                                 X03004 12320000
.T002800 AIF   (NOT(&COND AND &LOCK)).T002900                    X03004 12360000
         IDAERMAC 8,OPTCD,COND,LOCK                                @L9C 12400000
&IDACB01 SETB  1                                                 X03004 12440000
.T002900 AIF   (NOT(&UNCOND AND &LOCK)).T003000                  X03004 12480000
         IDAERMAC 8,OPTCD,UNCOND,LOCK                              @L9C 12520000
&IDACB01 SETB  1                                                 X03004 12560000
.T003000 AIF   (NOT(&LGONMSG AND &DEVCHAR)).T003100              X03004 12600000
         IDAERMAC 8,OPTCD,LOGONMSG,DEVCHAR                         @L9C 12640000
&IDACB01 SETB  1                                                 X03004 12680000
.T003100 AIF   (NOT(&LGONMSG AND &TERMS)).T003200                X03004 12720000
         IDAERMAC 8,OPTCD,LOGONMSG,TERMS                           @L9C 12760000
&IDACB01 SETB  1                                                 X03004 12800000
.T003200 AIF   (NOT(&LGONMSG AND &APPSTAT)).T003300              X03004 12840000
         IDAERMAC 8,OPTCD,LOGONMSG,APPSTAT                         @L9C 12880000
&IDACB01 SETB  1                                                 X03004 12920000
.T003300 AIF   (NOT(&LGONMSG AND &COUNTS)).T003400               X03004 12960000
         IDAERMAC 8,OPTCD,LOGONMSG,COUNTS                          @L9C 13000000
&IDACB01 SETB  1                                                 X03004 13040000
.T003400 AIF   (NOT(&LGONMSG AND &RNNAME)).T003500               X03004 13080000
         IDAERMAC 8,OPTCD,LOGONMSG,RNNAME                          @L9C 13120000
&IDACB01 SETB  1                                                 X03004 13160000
.T003500 AIF   (NOT(&LGONMSG AND &CIDXLAT)).T003600              X03004 13200000
         IDAERMAC 8,OPTCD,LOGONMSG,CIDXLATE                        @L9C 13240000
&IDACB01 SETB  1                                                 X03004 13280000
.T003600 AIF   (NOT(&LGONMSG AND &TOPLGON)).T003700              X03004 13320000
         IDAERMAC 8,OPTCD,LOGONMSG,TOPLOGON                        @L9C 13360000
&IDACB01 SETB  1                                                 X03004 13400000
.T003700 AIF   (NOT(&LGONMSG AND &BSCID)).T003800                X03004 13440000
         IDAERMAC 8,OPTCD,LOGONMSG,BSCID                           @L9C 13480000
&IDACB01 SETB  1                                                 X03004 13520000
.T003800 AIF   (NOT(&LGONMSG AND &DISPLAY)).T003900              X03004 13560000
         IDAERMAC 8,OPTCD,LOGONMSG,DISPLAY                         @L9C 13600000
&IDACB01 SETB  1                                                 X03004 13640000
.T003900 AIF   (NOT(&LGONMSG AND &SESSPRM)).T003930            @G40AKSL 13680000
         IDAERMAC 8,OPTCD,LOGONMSG,SESSPARM                        @L9C 13720000
&IDACB01 SETB  1                                               @ZA07555 13760000
.T003930 AIF   (NOT(&LGONMSG AND &SESSKEY)).T003950            @G40AKSL 13800000
         IDAERMAC 8,OPTCD,LOGONMSG,SESSKEY                         @L9C 13840000
&IDACB01 SETB  1                                               @G40AKSL 13880000
.T003950 AIF   (NOT(&DEVCHAR AND &TERMS)).T004000              @ZA07555 13920000
         IDAERMAC 8,OPTCD,DEVCHAR,TERMS                            @L9C 13960000
&IDACB01 SETB  1                                                 X03004 14000000
.T004000 AIF   (NOT(&DEVCHAR AND &APPSTAT)).T004100              X03004 14040000
         IDAERMAC 8,OPTCD,DEVCHAR,APPSTAT                          @L9C 14080000
&IDACB01 SETB  1                                                 X03004 14120000
.T004100 AIF   (NOT(&DEVCHAR AND &COUNTS)).T004200               X03004 14160000
         IDAERMAC 8,OPTCD,DEVCHAR,COUNTS                           @L9C 14200000
&IDACB01 SETB  1                                                 X03004 14240000
.T004200 AIF   (NOT(&DEVCHAR AND &RNNAME)).T004300               X03004 14280000
         IDAERMAC 8,OPTCD,DEVCHAR,RNNAME                           @L9C 14320000
&IDACB01 SETB  1                                                 X03004 14360000
.T004300 AIF   (NOT(&DEVCHAR AND &CIDXLAT)).T004400              X03004 14400000
         IDAERMAC 8,OPTCD,DEVCHAR,CIDXLATE                         @L9C 14440000
&IDACB01 SETB  1                                                 X03004 14480000
.T004400 AIF   (NOT(&DEVCHAR AND &TOPLGON)).T004500              X03004 14520000
         IDAERMAC 8,OPTCD,DEVCHAR,TOPLOGON                         @L9C 14560000
&IDACB01 SETB  1                                                 X03004 14600000
.T004500 AIF   (NOT(&DEVCHAR AND &BSCID)).T004600                X03004 14640000
         IDAERMAC 8,OPTCD,DEVCHAR,BSCID                            @L9C 14680000
&IDACB01 SETB  1                                                 X03004 14720000
.T004600 AIF   (NOT(&DEVCHAR AND &DISPLAY)).T004650            @ZA07555 14760000
         IDAERMAC 8,OPTCD,DEVCHAR,DISPLAY                          @L9C 14800000
&IDACB01 SETB  1                                                 X03004 14840000
.T004650 AIF   (NOT(&DEVCHAR AND &SESSPRM)).T004670            @G40AKSL 14880000
         IDAERMAC 8,OPTCD,DEVCHAR,SESSPARM                         @L9C 14920000
&IDACB01 SETB  1                                               @ZA07555 14960000
.T004670 AIF   (NOT(&DEVCHAR AND &SESSKEY)).T004700            @G40AKSL 15000000
         IDAERMAC 8,OPTCD,DEVCHAR,SESSKEY                          @L9C 15040000
&IDACB01 SETB  1                                               @G40AKSL 15080000
.T004700 AIF   (NOT(&TERMS AND &APPSTAT)).T004800                X03004 15120000
         IDAERMAC 8,OPTCD,TERMS,APPSTAT                            @L9C 15160000
&IDACB01 SETB  1                                                 X03004 15200000
.T004800 AIF   (NOT(&TERMS AND &COUNTS)).T004900                 X03004 15240000
         IDAERMAC 8,OPTCD,TERMS,COUNTS                             @L9C 15280000
&IDACB01 SETB  1                                                 X03004 15320000
.T004900 AIF   (NOT(&TERMS AND &RNNAME)).T005000                 X03004 15360000
         IDAERMAC 8,OPTCD,TERMS,RNNAME                             @L9C 15400000
&IDACB01 SETB  1                                                 X03004 15440000
.T005000 AIF   (NOT(&TERMS AND &CIDXLAT)).T005100                X03004 15480000
         IDAERMAC 8,OPTCD,TERMS,CIDXLATE                           @L9C 15520000
&IDACB01 SETB  1                                                 X03004 15560000
.T005100 AIF   (NOT(&TERMS AND &TOPLGON)).T005200                X03004 15600000
         IDAERMAC 8,OPTCD,TERMS,TOPLOGON                           @L9C 15640000
&IDACB01 SETB  1                                                 X03004 15680000
.T005200 AIF   (NOT(&TERMS AND &BSCID)).T005300                  X03004 15720000
         IDAERMAC 8,OPTCD,TERMS,BSCID                              @L9C 15760000
&IDACB01 SETB  1                                                 X03004 15800000
.T005300 AIF   (NOT(&TERMS AND &DISPLAY)).T005350              @ZA07555 15840000
         IDAERMAC 8,OPTCD,TERMS,APPSTAT                            @L9C 15880000
&IDACB01 SETB  1                                                 X03004 15920000
.T005350 AIF   (NOT(&TERMS AND &SESSPRM)).T005370              @G40AKSL 15960000
         IDAERMAC 8,OPTCD,TERMS,SESSPARM                           @L9C 16000000
&IDACB01 SETB  1                                               @ZA07555 16040000
.T005370 AIF   (NOT(&TERMS AND &SESSKEY)).T005400              @G40AKSL 16080000
         IDAERMAC 8,OPTCD,TERMS,SESSKEY                            @L9C 16120000
&IDACB01 SETB  1                                               @G40AKSL 16160000
.T005400 AIF   (NOT(&APPSTAT AND &COUNTS)).T005500               X03004 16200000
         IDAERMAC 8,OPTCD,APPSTAT,COUNTS                           @L9C 16240000
&IDACB01 SETB  1                                                 X03004 16280000
.T005500 AIF   (NOT(&APPSTAT AND &RNNAME)).T005600               X03004 16320000
         IDAERMAC 8,OPTCD,APPSTAT,RNNAME                           @L9C 16360000
&IDACB01 SETB  1                                                 X03004 16400000
.T005600 AIF   (NOT(&APPSTAT AND &CIDXLAT)).T005700              X03004 16440000
         IDAERMAC 8,OPTCD,APPSTAT,CIDXLATE                         @L9C 16480000
&IDACB01 SETB  1                                                 X03004 16520000
.T005700 AIF   (NOT(&APPSTAT AND &TOPLGON)).T005800              X03004 16560000
         IDAERMAC 8,OPTCD,APPSTAT,TOPLOGON                         @L9C 16600000
&IDACB01 SETB  1                                                 X03004 16640000
.T005800 AIF   (NOT(&APPSTAT AND &BSCID)).T005900                X03004 16680000
         IDAERMAC 8,OPTCD,APPSTAT,BSCID                            @L9C 16720000
&IDACB01 SETB  1                                                 X03004 16760000
.T005900 AIF   (NOT(&APPSTAT AND &DISPLAY)).T005950            @ZA07555 16800000
         IDAERMAC 8,OPTCD,APPSTAT,DISPLAY                          @L9C 16840000
&IDACB01 SETB  1                                                 X03004 16880000
.T005950 AIF   (NOT(&APPSTAT AND &SESSPRM)).T005960            @G40AKSL 16920000
         IDAERMAC 8,OPTCD,APPSTAT,SESSPARM                         @L9C 16960000
&IDACB01 SETB  1                                               @ZA07555 17000000
.T005960 AIF   (NOT(&APPSTAT AND &SESSKEY)).T006000            @G40AKSL 17040000
         IDAERMAC 8,OPTCD,APPSTAT,SESSKEY                          @L9C 17080000
&IDACB01 SETB  1                                               @G40AKSL 17120000
.T006000 AIF   (NOT(&COUNTS AND &RNNAME)).T006100                X03004 17160000
         IDAERMAC 8,OPTCD,COUNTS,RNNAME                            @L9C 17200000
&IDACB01 SETB  1                                                 X03004 17240000
.T006100 AIF   (NOT(&COUNTS AND &CIDXLAT)).T006200               X03004 17280000
         IDAERMAC 8,OPTCD,COUNTS,CIDXLATE                          @L9C 17320000
&IDACB01 SETB  1                                                 X03004 17360000
.T006200 AIF   (NOT(&COUNTS AND &TOPLGON)).T006300               X03004 17400000
         IDAERMAC 8,OPTCD,COUNTS,TOPLOGON                          @L9C 17440000
&IDACB01 SETB  1                                                 X03004 17480000
.T006300 AIF   (NOT(&COUNTS AND &BSCID)).T006400                 X03004 17520000
         IDAERMAC 8,OPTCD,COUNTS,BSCID                             @L9C 17560000
&IDACB01 SETB  1                                                 X03004 17600000
.T006400 AIF   (NOT(&COUNTS AND &DISPLAY)).T006450             @ZA07555 17640000
         IDAERMAC 8,OPTCD,COUNTS,DISPLAY                           @L9C 17680000
&IDACB01 SETB  1                                                 X03004 17720000
.T006450 AIF   (NOT(&COUNTS AND &SESSPRM)).T006470             @G40AKSL 17760000
         IDAERMAC 8,OPTCD,COUNTS,SESSPARM                          @L9C 17800000
&IDACB01 SETB  1                                               @ZA07555 17840000
.T006470 AIF   (NOT(&COUNTS AND &SESSKEY)).T006500             @G40AKSL 17880000
         IDAERMAC 8,OPTCD,COUNTS,SESSKEY                           @L9C 17920000
&IDACB01 SETB  1                                               @G40AKSL 17960000
.T006500 AIF   (NOT(&RNNAME AND &CIDXLAT)).T006600               X03004 18000000
         IDAERMAC 8,OPTCD,RNNAME,CIDXLATE                          @L9C 18040000
&IDACB01 SETB  1                                                 X03004 18080000
.T006600 AIF   (NOT(&RNNAME AND &TOPLGON)).T006700               X03004 18120000
         IDAERMAC 8,OPTCD,RNNAME,TOPLOGON                          @L9C 18160000
&IDACB01 SETB  1                                                 X03004 18200000
.T006700 AIF   (NOT(&RNNAME AND &BSCID)).T006800                 X03004 18240000
         IDAERMAC 8,OPTCD,RNNAME,BSCID                             @L9C 18280000
&IDACB01 SETB  1                                                 X03004 18320000
.T006800 AIF   (NOT(&RNNAME AND &DISPLAY)).T006850             @ZA07555 18360000
         IDAERMAC 8,OPTCD,RNNAME,DISPLAY                           @L9C 18400000
&IDACB01 SETB  1                                                 X03004 18440000
.T006850 AIF   (NOT(&RNNAME AND &SESSPRM)).T006870             @G40AKSL 18480000
         IDAERMAC 8,OPTCD,RNNAME,SESSPARM                          @L9C 18520000
&IDACB01 SETB  1                                               @ZA07555 18560000
.T006870 AIF   (NOT(&RNNAME AND &SESSKEY)).T006900             @G40AKSL 18600000
         IDAERMAC 8,OPTCD,RNNAME,SESSKEY                           @L9C 18640000
&IDACB01 SETB  1                                               @G40AKSL 18680000
.T006900 AIF   (NOT(&CIDXLAT AND &TOPLGON)).T007000              X03004 18720000
         IDAERMAC 8,OPTCD,CIDXLATE,TOPLOGON                        @L9C 18760000
&IDACB01 SETB  1                                                 X03004 18800000
.T007000 AIF   (NOT(&CIDXLAT AND &BSCID)).T007100                X03004 18840000
         IDAERMAC 8,OPTCD,CIDXLATE,BSCID                           @L9C 18880000
&IDACB01 SETB  1                                                 X03004 18920000
.T007100 AIF   (NOT(&CIDXLAT AND &DISPLAY)).T007150            @ZA07555 18960000
         IDAERMAC 8,OPTCD,CIDXLATE,DISPLAY                         @L9C 19000000
&IDACB01 SETB  1                                                 X03004 19040000
.T007150 AIF   (NOT(&CIDXLAT AND &SESSPRM)).T007170            @G40AKSL 19080000
         IDAERMAC 8,OPTCD,CIDXLATE,SESSPARM                        @L9C 19120000
&IDACB01 SETB  1                                               @ZA07555 19160000
.T007170 AIF   (NOT(&CIDXLAT AND &SESSKEY)).T007200            @G40AKSL 19200000
         IDAERMAC 8,OPTCD,CIDXLATE,SESSKEY                         @L9C 19240000
&IDACB01 SETB  1                                               @G40AKSL 19280000
.T007200 AIF   (NOT(&TOPLGON AND &BSCID)).T007300                X03004 19320000
         IDAERMAC 8,OPTCD,TOPLOGON,BSCID                           @L9C 19360000
&IDACB01 SETB  1                                                 X03004 19400000
.T007300 AIF   (NOT(&TOPLGON AND &DISPLAY)).T007350            @ZA07555 19440000
         IDAERMAC 8,OPTCD,TOPLOGON,DISPLAY                         @L9C 19480000
&IDACB01 SETB  1                                                 X03004 19520000
.T007350 AIF   (NOT(&TOPLGON AND &SESSPRM)).T007370            @G40AKSL 19560000
         IDAERMAC 8,OPTCD,TOPLOGON,SESSPARM                        @L9C 19600000
&IDACB01 SETB  1                                               @ZA07555 19640000
.T007370 AIF   (NOT(&TOPLGON AND &SESSKEY)).T007400            @G40AKSL 19680000
         IDAERMAC 8,OPTCD,TOPLOGON,SESSKEY                         @L9C 19720000
&IDACB01 SETB  1                                               @G40AKSL 19760000
.T007400 AIF   (NOT(&BSCID AND &DISPLAY)).T007410              @ZA07555 19800000
         IDAERMAC 8,OPTCD,BSCID,DISPLAY                            @L9C 19840000
&IDACB01 SETB  1                                                 X03004 19880000
.T007410 AIF   (NOT(&BSCID AND &SESSPRM)).T007415              @G40AKSL 19920000
         IDAERMAC 8,OPTCD,BSCID,SESSPARM                           @L9C 19960000
&IDACB01 SETB  1                                               @ZA07555 20000000
.T007415 AIF   (NOT(&BSCID AND &SESSKEY)).T007420              @G40AKSL 20040000
         IDAERMAC 8,OPTCD,BSCID,SESSKEY                            @L9C 20080000
&IDACB01 SETB  1                                               @G40AKSL 20120000
.T007420 AIF   (NOT(&DISPLAY AND &SESSPRM)).T007450            @G40AKSL 20160000
         IDAERMAC 8,OPTCD,DISPLAY,SESSPARM                         @L9C 20200000
&IDACB01 SETB  1                                               @ZA07555 20240000
.T007450 AIF   (NOT(&DISPLAY AND &SESSKEY)).T007470            @G40AKSL 20280000
         IDAERMAC 8,OPTCD,DISPLAY,SESSKEY                          @L9C 20320000
&IDACB01 SETB  1                                               @G40AKSL 20360000
.T007470 AIF   (NOT(&SESSPRM AND &SESSKEY)).T007500            @G40AKSL 20400000
         IDAERMAC 8,OPTCD,SESSPARM,SESSKEY                         @L9C 20440000
&IDACB01 SETB  1                                               @G40AKSL 20480000
.T007500 AIF   (NOT(&RELRQ AND &NRELRQ)).T007600                 X03004 20520000
         IDAERMAC 8,OPTCD,RELRQ,NRELRQ                             @L9C 20560000
&IDACB01 SETB  1                                                 X03004 20600000
.T007600 AIF   (NOT(&Q AND &NQ)).T007700                         X03004 20640000
         IDAERMAC 8,OPTCD,Q,NQ                                     @L9C 20680000
&IDACB01 SETB  1                                                 X03004 20720000
.T007700 AIF   (NOT(&PEND AND &SESSION)).T007800                 X03004 20760000
         IDAERMAC 8,OPTCD,PEND,SESSION                             @L9C 20800000
&IDACB01 SETB  1                                                 X03004 20840000
.T007800 AIF   (NOT(&PEND AND &ACTIVE)).T007900                  X03004 20880000
         IDAERMAC 8,OPTCD,PEND,ACTIVE                              @L9C 20920000
&IDACB01 SETB  1                                                 X03004 20960000
.T007900 AIF   (NOT(&PEND AND &UNCONDL)).T008000                 X03004 21000000
         IDAERMAC 8,OPTCD,PEND,UNCONDL                             @L9C 21040000
&IDACB01 SETB  1                                                 X03004 21080000
.T008000 AIF   (NOT(&SESSION AND &ACTIVE)).T008100               X03004 21120000
         IDAERMAC 8,OPTCD,SESSION,ACTIVE                           @L9C 21160000
&IDACB01 SETB  1                                                 X03004 21200000
.T008100 AIF   (NOT(&SESSION AND &UNCONDL)).T008200              X03004 21240000
         IDAERMAC 8,OPTCD,SESSION,UNCONDL                          @L9C 21280000
&IDACB01 SETB  1                                                 X03004 21320000
.T008200 AIF   (NOT(&ACTIVE AND &UNCONDL)).T008300               X03004 21360000
         IDAERMAC 8,OPTCD,ACTIVE,UNCONDL                           @L9C 21400000
&IDACB01 SETB  1                                                 X03004 21440000
.T008300 AIF   (NOT(&QUIESCE AND &START)).T008400                X03004 21480000
         IDAERMAC 8,OPTCD,QUIESCE,START                            @L9C 21520000
&IDACB01 SETB  1                                                 X03004 21560000
.T008400 AIF   (NOT(&QUIESCE AND &STOP)).T008500                 X03004 21600000
         IDAERMAC 8,OPTCD,QUIESCE,STOP                             @L9C 21640000
&IDACB01 SETB  1                                                 X03004 21680000
.T008500 AIF   (NOT(&START AND &STOP)).T008600                   X03004 21720000
         IDAERMAC 8,OPTCD,START,STOP                               @L9C 21760000
&IDACB01 SETB  1                                                 X03004 21800000
.T008600 AIF   (NOT(&ACCEPT AND &ACQUIRE)).T008900             @Z40BHUC 21840000
         IDAERMAC 8,OPTCD,ACCEPT,ACQUIRE                           @L9C 21880000
&IDACB01 SETB  1                                                 X03004 21920000
.T008900 AIF   (NOT(&CONALL AND &CONANY)).T009100              @Z40BHUC 21960000
         IDAERMAC 8,OPTCD,CONALL,CONANY                            @L9C 22000000
&IDACB01 SETB  1                                                 X03004 22040000
.T009100 AIF   (NOT(&KEEP AND &TRUNC)).T009200                  X3004BS 22080000
         IDAERMAC 8,OPTCD,KEEP,TRUNC                               @L9C 22120000
&IDACB01 SETB  1                                                X3004BS 22160000
.T009200 AIF   (NOT(&KEEP AND &NIBTK)).T009300                  X3004BS 22200000
         IDAERMAC 8,OPTCD,KEEP,NIBTK                               @L9C 22240000
&IDACB01 SETB  1                                                X3004BS 22280000
.T009300 AIF   (NOT(&NIBTK AND &TRUNC)).T009700                @Z40BHUC 22320000
         IDAERMAC 8,OPTCD,NIBTK,TRUNC                              @L9C 22360000
&IDACB01 SETB  1                                                X3004BS 22400000
.T009700 AIF   (NOT(&FMHDR AND &NFMHDR)).T009800                X04SVHS 22440000
.*                                      CHK FOR MUTUALLY OPTS  X03004HS 22480000
         IDAERMAC 8,OPTCD,FMHDR,NFMHDR                             @L9C 22520000
&IDACB01 SETB  1                                               X03004HS 25850000
.T009800 ANOP                                                   X04SVHS 25900000
         AIF   (NOT(&BWD AND &FWD)).T009900 CHK FOR MUTUALLY    X04SVHS 25950000
.*                                      EXCLUSIVE OPTIONS       X04SVHS 26000000
         IDAERMAC 8,OPTCD,FWD,BWD                                  @L9C 26050000
&IDACB01 SETB  1                        SET ERROR SWITCH        X04SVHS 26100000
.T009900 ANOP                                                   X04SVHS 26150000
         AIF   (NOT(&ARD AND &LRD)).T010000 CHK FOR MUTUALLY    X04SVHS 26200000
.*                                      EXCLUSIVE OPTIONS       X04SVHS 26250000
         IDAERMAC 8,OPTCD,ARD,LRD                                  @L9C 26300000
&IDACB01 SETB  1                        SET ERROR SWITCH        X04SVHS 26350000
.T010000 ANOP                                                   X04SVHS 26400000
         AIF   (NOT(&KL AND &NOKL)).T010010                        @LAA 26403500
         IDAERMAC 8,OPTCD,KL,NOKL                                  @LAA 26407000
&IDACB01 SETB  1                        SET ERROR SWITCH           @LAA 26410500
.T010010 AIF   (NOT(&NRI AND &CR)).T010020                         @LAA 26414000
         IDAERMAC 8,OPTCD,NRI,CR                                   @LAA 26417500
&IDACB01 SETB  1                        SET ERROR SWITCH           @LAA 26421000
.T010020 AIF   (NOT(&NRI AND &CRE)).T010030                        @LAA 26424500
         IDAERMAC 8,OPTCD,NRI,CRE                                  @LAA 26428000
&IDACB01 SETB  1                        SET ERROR SWITCH           @LAA 26431500
.T010030 AIF   (NOT(&CR AND &CRE)).T010050                         @LAA 26435000
         IDAERMAC 8,OPTCD,CR,CRE                                   @LAA 26438500
&IDACB01 SETB  1                        SET ERROR SWITCH           @LAA 26442000
.T010050 ANOP                                                      @LAA 26445500
         AIF   ('&CALLER' EQ 'RPL').T010100                     X04SVHS 26450000
.*             IF CALLED BY RPL, THEN GLOBALS MUST BE SET FOR           26500000
.*             RPL TO GENERATE CODE FROM IN THE FORM OF DC'S            26550000
&IDAVALC(&IDAENO) SETC '&KEY&ADR&CNV&SEQ&DIR&SKP&SYN&ASY&NUP&UPD&NSP&KE*26600000
               Q&KGE&FKS&GEN&MVE&LOC&FWD&BWD&ARD&LRD.0&WAITX&NWAITX&RBA*26650000
               &XRBA.0&NRI&CR&CRE&KL&NOKL'                         @EAC 26700000
&IDAOPT2 SETC  '&CA&CS.00&RELEASE&PASS&NERASE&EAU&ERASE&SPEC&ANY&NCONV&*26750000
               CONV&LBT&LBM&BLK&COND&UNCOND&LOCK.00&LGONMSG&DEVCHAR&TER*26800000
               MS&APPSTAT&COUNTS&RNNAME&CIDXLAT&TOPLGON'       @Z40BHUC 26850000
&IDAOPT2 SETC  '&IDAOPT2&BSCID&DISPLAY&RELRQ'                    X03004 26900000
&IDAOPT3 SETC  '&NRELRQ&Q&NQ&PEND&SESSION&ACTIVE&UNCONDL&QUIESCE&START&*26950000
               STOP&ACCEPT&ACQUIRE.0&CONALL&CONANY.00&KEEP&TRUNC&NIBTK.*27000000
               00&SESSKEY&FMHDR&NFMHDR&SESSPRM.000000'         @G40AKSL 27050000
         MEXIT                                                          27100000
.T010100 ANOP                                                   X04SVHS 27150000
         AIF   ('&CALLER' NE 'RPL').T011600                     X04SVHS 27200000
.*             AT THIS POINT EITHER IDAVSOPT WAS CALLED BY RPL,    @L9C 27250000
.*             OPTCD IS UNSPECIFIED, OR BOTH. IF CALLED BY RPL          27300000
.*             SET ANY UNSPECIFIED DEFAULTS.                            27350000
.*             DEFAULTS FOR CBM WILL BE SET AT EXECUTE TIME             27400000
.*                                                                      27450000
&KEY     SETB  (NOT(&ADR OR &CNV) OR &KEY)                      X04SVHS 27500000
.*             IF NOT ADR, OR CNV, SET KEY AS DEFAULT                   27550000
&SEQ     SETB  (NOT(&DIR OR &SKP) OR &SEQ)                      X04SVHS 27600000
.*             IF NOT DIR, OR SKP, SET SEQ AS DEFAULT                   27650000
         AIF   ('&AM' NE 'VTAM').T011500  WAS VTAM SPECIFIED    X04SVHS 27700000
.*             SET VTAM DEFAULTS                                        27750000
&ACCEPT  SETB  (NOT(&ACQUIRE) OR &ACCEPT)                      @Z40BHUC 27800000
.*             IF NOT ACQUIRE, SET ACCEPT DEFAULT                       27850000
&Q       SETB  (NOT(&NQ) OR &Q)                                 X04SVHS 27900000
.*             IF NOT NQ SET Q AS DEFAULT                               27950000
&RELRQ   SETB  (NOT(&NRELRQ) OR &RELRQ)                         X04SVHS 28000000
.*             IF NOT NRELRQ SET RELRQ DEFAULT                          28050000
&NERASE  SETB  (NOT(&EAU OR &ERASE) OR &NERASE)                 X04SVHS 28100000
.*             IF NOT EAU OR ERASE, SET NERASE DEFAULT                  28150000
&LBT     SETB  (NOT(&BLK OR &LBM) OR &LBT)                      X04SVHS 28200000
.*             IF NOT BLK OR LBM, SET LBT DEFAULT                       28250000
&COND    SETB  (NOT(&UNCOND OR &LOCK) OR &COND)                 X04SVHS 28300000
.*             IF NOT UNCOND OR LOCK, SET COND DEFAULT                  28350000
&CONALL  SETB  (NOT(&CONANY) OR &CONALL)                        X04SVHS 28400000
.*             IF NOT CONANY SET CONALL DEFAULT                         28450000
&QUIESCE SETB  (NOT(&START OR &STOP) OR &QUIESCE)               X04SVHS 28500000
.*             IF NOT START OR STOP, SET QUIESCE DEFAULT                28550000
&LGONMSG SETB  (NOT(&DEVCHAR OR &TERMS OR &APPSTAT OR &COUNTS OR &RNNAM*28600000
               E OR &CIDXLAT OR &TOPLGON OR &BSCID OR &DISPLAY OR &SESS*28650000
               PRM OR &SESSKEY) OR &LGONMSG)                   @G40AKCM 28700000
.*             IF NONE OF ABOVE, LOGONMSG IS DEFAULT                    28750000
&PEND    SETB  (NOT(&SESSION OR &ACTIVE OR &UNCONDL) OR &PEND)  X04SVHS 28800000
.*             IF NONE OF ABOVE, SET PEND DEFAULT                       28850000
&NIBTK   SETB  (NOT(&TRUNC OR &KEEP) OR &NIBTK)                 X04SVHS 28900000
.*             IF NOT KEEP OR TRUNC SET NIBTK DEFAULT                   28950000
.T011500 ANOP                                                   X3004BH 29000000
.*             SET GLOBALS TO BE ASSEMBLED BY DECLARATIVE AS CONSTANTS  29050000
&IDAOP1  SETC  '&LOC&DIR&SEQ&SKP&ASY&KGE&GEN'   OPTCD BYTE 1    X04SVHS 29100000
&IDAOP2  SETC  '&KEY&ADR&CNV&BWD&LRD&WAITX&UPD&NSP'   BYTE 2       @EAC 29150000
&IDAOP3  SETC  '&KL&NRI&CR&CRE.0000'            OPTCD BYTE 3       @LAA 29225000
&IDAOP4  SETC  '&XRBA.0000000'                  OPTCD BYTE 4       @EAA 29237500
         AIF   ('&AM' NE 'VTAM').T011600                        X04SVHS 29250000
.*             IF NOT VTAM, BYPASS SETTING VTAM OPTION BYTES            29300000
&IDAOP5  SETC  '&CS.0&PASS&NERASE&EAU&ERASE&ANY&CONV'          @Z40BHUC 29350000
.*                                      OPTCD BYTE 5            X04SVHS 29400000
&IDAOP6  SETC  '&BLK&LBM&LBT&COND&UNCOND&LOCK.00' OPTCD BYTE 6  X04SVHS 29450000
&IDAOP7  SETC  '&CONALL&CONANY.0&Q.0&RELRQ.00' OPTCD BYTE 7     X04SVHS 29500000
&IDAOP8  SETC  '&ACQUIRE&ACCEPT.0&PEND&SESSION&ACTIVE&UNCONDL.0'        29550000
.*                                      OPTCD BYTE 8           @Z40BHUC 29600000
&IDAOP9  SETC  '&LGONMSG&DEVCHAR&TERMS&COUNTS&APPSTAT&RNNAME&CIDXLAT&TO*29650000
               PLGON'                   OPTCD BYTE 9            X04SVHS 29700000
&IDAOPA  SETC  '&BSCID&DISPLAY&SESSPRM&SESSKEY.0000'                    29750000
.*                                      OPTCD BYTE 10          @G40AKSL 29800000
&IDAOPB  SETC  '&QUIESCE&START&STOP.00000' OPTCD BYTE 11        X04SVHS 29850000
&IDAOPC  SETC  '0&KEEP&TRUNC&NIBTK.000&FMHDR'                  @Z40BHUC 29900000
.*                                      OPTCD BYTE 12           X04SVHS 29950000
.T011600 ANOP                                                   X04SVHS 30000000
         MEND                                                           30050000
