*                                                                       00002200
* %DCL IDCDOUT_INCLUDED CHAR EXT;                                       00004400
* %DEACTIVATE IDCDOUT_INCLUDED;                                         00006600
* %IF IDCDOUT_INCLUDED = '' %THEN                                       00008800
* %DO;                                                                  00011000
*%/* Start of PL/X PreProlog Code */;                                   00013200
* %                                                                     00015400
* IF DCU_HDR = 'YES'             /* INCLUDE HEADER DECLARE ONLY?     */ 00017600
*  | IDCDOUT_CBGEN = 'YES' %THEN /* INCLUDE EVERYTHING?              */ 00019800
*    %DO;                                                               00022000
*%/* End of PL/X PreProlog Code */;                                     00024200
*/* Macro made bi-lingual on 96309. CBGEN compile date 95348         */ 00026400
*% /*                                                                   00028600
         MACRO                                                          00030800
         IDCDOUT &DSECT=YES,&LIST=YES,&DCUOUTH=YES                      00033000
         GBLC  &IDCDOUT_INCLUDED                                        00035200
         GBLC  &ZCBPRINT                                                00037400
&IDCDOUT_INCLUDED SETC 'YES'                                            00039600
 TITLE   'IDCDOUT  - AMS DCOLLECT FUNCTION OUTPUT RECORD FORMATS    '   00041800
**/ IDCDOUT_1:;                                                         00044000
*/*START OF SPECIFICATIONS********************************************/ 00046200
*/*                                                                  */ 00050000
*/* $MAC(IDCDOUT):                                                   */ 00060000
*/*                                                                  */ 00070000
*/* MACRO-NAME: IDCDOUT                                              */ 00080000
*/*                                                                  */ 00090000
*/* DESCRIPTIVE-NAME: AMS DCOLLECT FUNCTION OUTPUT RECORD FORMATS    */ 00100000
*/*                                                                  */ 00110000
*/*PROPRIETARY V3 STATEMENT                                          */ 00120000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00130000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00140000
*/*5695-DF1                                                          */ 00150000
*/*(C) COPYRIGHT 1993,1994  IBM CORP.                                */ 00160000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00170000
*/*                                                                  */ 00180000
*/* STATUS = SEE CHANGE ACTIVITY                                     */ 00190000
*/*                                                                  */ 00200000
*/* FUNCTION -                                                       */ 00210000
*/* THIS MACRO IS INCLUDED (%INCLUDE SYSLIB(IDCDOUT)) BY ANY         */ 00220000
*/* MODULES THAT NEED TO MAP THE OUTPUT DATA RECORDS FROM THE        */ 00230000
*/* DCOLLECT FUNCTION. A MAPPING EXISTS FOR:                         */ 00240000
*/*     HEADER OF ALL RECORDS              DCUOUTH                   */ 00250000
*/*     ACTIVE DATA RECORD                 DCDADSI                   */ 00260000
*/*     VSAM BASE CLUSTER ASSOCIATION      DCASSOC                   */ 00270000
*/*     VOLUME INFORMATION                 DCVVOLI                   */ 00280000
*/*     DATA CLASS DEFINITION              DDCDATA           @OY59794*/ 00281000
*/*     STORAGE CLASS DEFINITION           DSCDATA           @OY59794*/ 00282000
*/*     MANAGEMENT CLASS DEFINITION        DMCDATA           @OY59794*/ 00283000
*/*     BASE CONFIGURATION DEFINITION      DBCDATA           @OY59794*/ 00284000
*/*     STORAGE GROUP DEFINITION           DSGDATA           @OY59794*/ 00285000
*/*     SMS VOLUME DEFINITION              DVLDATA           @OY59794*/ 00286000
*/*     AGGREGATE GROUP DEFINITION         DAGDATA           @OY59794*/ 00287000
*/*     OPTICAL DRIVE DEFINITION           DDRDATA           @OY59794*/ 00288000
*/*     OPTICAL LIBRARY DEFINITION         DLBDATA           @OY59794*/ 00289000
*/*     Cache Names Definition             DCCNAME               @LHA*/ 00289500
*/*                                                                  */ 00290000
*/* TO INCLUDE THE HEADER ONLY, THE MACRO VARIABLE DCU_HDR MUST BE   */ 00300000
*/* INITIALIZED TO 'YES'. THE ENTIRE MACRO IS INCLUDED AS THE        */ 00302000
*/* DEFAULT.                                                         */ 00304000
*/*                                                                  */ 00306000
*/* TO INCLUDE THE SMS CONSTRUCT INFORMATION ONLY, DCU_SMS MUST BE   */ 00308000
*/* INITIALIZED TO 'YES'. THE ENTIRE MACRO IS INCLUDED AS THE        */ 00310000
*/* DEFAULT.                                                         */ 00320000
*/*                                                                  */ 00330000
*/* TO BASE THE HEADER ON A SPECIFIC POINTER, THE BASING MACRO       */ 00340000
*/* VARIABLE, DCU_BASE, MUST BE INITIALIZED TO 'BASED(PTR_NAME)'. IF */ 00350000
*/* DCU_BASE IS NOT USED, THE VALUE DEFAULTS TO 'BASED BDY(WORD)'.   */ 00360000
*/* IT CAN ALSO BE INITIALIZED TO 'BDY(WORD)' IF THE RECORD IS TO BE */ 00370000
*/* DECLARED IN AUTOMATIC STORAGE.                                   */ 00380000
*/*                                                                  */ 00390000
*/*           **************************************                 */ 00400000
*/*           * FOR EXAMPLE, TO INCLUDE THE HEADER *                 */ 00410000
*/*           * ONLY, AND BASE THE DECLARATION ON  *                 */ 00420000
*/*           * A POINTER VARIABLE CALLED DCURPTR: *                 */ 00430000
*/*           *     %DCL DCU_HDR CHAR              *                 */ 00440000
*/*           *     %DCU_HDR = 'YES'               *                 */ 00450000
*/*           *     %DCL DCU_BASE CHAR             *                 */ 00460000
*/*           *     %DCU_BASE = 'BASED(DCURPTR)'   *                 */ 00470000
*/*           *     %INCLUDE SYSLIB(IDCDOUT)       *                 */ 00480000
*/*           **************************************                 */ 00490000
*/*                                                                  */ 00500000
*/* NOTES =                                                          */ 00510000
*/*                                                                  */ 00520000
*/*  PROCESSOR = PL/AS                                               */ 00530000
*/*  MODULE-SIZE = N/A                                               */ 00540000
*/*  ATTRIBUTES = N/A - COMPILE TIME MACRO.                          */ 00550000
*/*                                                                  */ 00560000
*/*                                                                  */ 00570000
*/* CHANGE-ACTIVITY =                                                */ 00580000
*/* $LA=COLL,HDP3320,OY26061,STLDPD: DCOLLECT FSR - IMPLICIT FLG @LAA*/ 00590000
*/* DASDCALC RETURNED VALUES NOT BEING COPIED TO OUTPUT      @OY32626*/ 00595000
*/* NEW SUPPORT FOR VRRDS DATA SETS                          @KC11064*/ 00597500
*/* SHIP MACRO FOR HDP3330                                   @OY48365*/ 00598700
*/* $LB=COLL,JDZ1110,,SJPLDPD: DFSMS 1.1.0 ENHANCEMENTS          @LBA*/ 00599300
*/* $LC=COLL,JDZ1110,,SJPLDPD: ENHANCEMENT FOR VSAM STATS        @LCA*/ 00599600
*/* $LX=SMS,HDP3330,,SJPLDPD: SMS CONTROL INFO IN DCOLLECT   @OY59794*/ 00603000
*/* $O1=SMS,JDZ1110,,SJPLDPD: SMS CONTROL INFO FOR JDZ1110   @OY60048*/ 00606400
*/* MEND STATEMENT MISSING                                   @OY64089*/ 00608200
*/* $LD=COLL,HDZ11B0,,SJPLAKC: DFSMS 1.2.0 ENHANCEMENTS          @LDA*/ 00609100
*/* $DC=COLL,HDZ11B0,,SJPLAKC: EXTENDED FLAGS               @XS_AM101*/ 00609500
*/* $L2=COLL,HDZ11B0,,SJPLAKC: DFSMS 1.2.0 PARTIAL RELEASE  @OW01826A*/ 00609700
*/* $L3=COLL,HDZ11B0,,SJPLAKC: DFSMS 1.2.0 SYSTEM GROUP     @OW02196A*/ 00609800
*/* $LM=SMS32,HDZ11C0,,SJPLMWM: SMS 32-Name support              @LMA*/ 00609900
*/* $LI=COLL,HDZ11C0,,SJPLAKC: Extended Addressability Support   @LEA*/ 00612400
*/* $LI=COLL,HDZ11C0,,SJPLAKC: Migrated Info Cell Support        @LGA*/ 00614900
*/* $LH=CSAT,HDZ11C0,,SJPLPVG: Cust Sat Misc Changes line item   @LHA*/ 00615000
*/* code dropped from daidata replaced. use LHA fiche        @K131635*/ 00615100
*/* Add DBCSNMTY in Base Configuration.                      @K131753*/ 00615200
*/* change typo  DCDCAMT to DDCCAMT                          @K131799*/ 00615300
*/* change typo  DBCDATAE to DDCDATAE                        @K131951*/ 00615400
*/* ADD DCAHARBC AND DCAHARBC                                @OW14204*/ 00615500
*/* Add DSGFPSM to DSGFLGS, move ...32NAM flds,DBCSYSFT cnst @OW20434*/ 00615600
*/* $LJ=VSAM,HDZ11D0,SJPLPVG: VSAM(DCOLLECT) line item           @LJA*/ 00615700
*/* change typo in comment DCDRABS to DDCRABS                @K140275*/ 00615800
*/* Add COMMENTS TO VARIOUS CONSTANTS TO REFLECT 32NAME      @OW24697*/ 00615900
*/* $01=OW48529,HDZ11E0,010308,SJPLMET: Add DSCAVLPR for         @01A*/ 00615950
*/*             PREFERRED storage class specification            @01A*/ 00615960
*/*                                                                  */ 00615970
*/*END OF SPECIFICATIONS**********************************************/ 00616000
*% /*                                                                   00616100
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00616200
         AIF   ('&LIST' EQ 'YES').P2                                    00616300
.P1      ANOP                                                           00616400
         PUSH  PRINT                                                    00616500
         PRINT OFF                                                      00616600
.P2      ANOP                                                           00616700
*                                                                       00616800
* ********************************************************************  00616900
* * HEADER PORTION OF DATA COLLECTION UTILITY OUTPUT RECORD. EACH    *  00617000
* * DATA SECTION IS PRECEDED BY THIS HEADER.                         *  00617100
* ********************************************************************  00617200
*                                                                       00617300
*                                                                       00617400
         AIF   ('&DCUOUTH' EQ 'NO').L0002                               00617500
         AIF   ('&DSECT' EQ 'YES').L0003                                00617600
         AIF   ('&DCUOUTH' NE 'YES').L0002                              00617700
DCUOUTH  DS    0F        DATA COLLECTION OUTPUT RECORD                  00617800
         AGO   .L0004                                                   00617900
.L0003   ANOP                                                           00618000
DCUOUTH  DSECT           DATA COLLECTION OUTPUT RECORD                  00618100
.L0004   ANOP                                                           00618200
DCURDW   DS    1FL4      RECORD DESCRIPTOR WORD                         00618300
         ORG   DCURDW                                                   00618400
DCULENG  DS    1FL2      LENGTH OF THIS RECORD                          00618500
         DS    1CL0002   RESERVED                                       00618600
DCURCTYP DS    1CL0002   RECORD TYPE FOR THIS RECORD                    00618700
DCUVERS  DS    1FL2      VERSION                                        00618800
DCUSYSID DS    1CL0004   SYSTEM ID FOR THIS OPERATION                   00618900
DCUTMSTP DS    1CL0008   TIMESTAMP FIELD                                00619000
         ORG   DCUTMSTP                                                 00619100
DCUTIME  DS    1FL4      TIME IN SMF HEADER FORMAT                      00619200
DCUDATE  DS    1CL0004   DATE IN SMF FORMAT (CCYYDDDF)                  00619300
         DS    1CL0004   RESERVED                                       00619400
DCUDATA  DS    0C        END OF HEADER SECTION                          00619500
DCUOUTH_LEN EQU *-DCUOUTH                                               00619600
*                                                                       00619700
* ********************************************************************  00619800
* * ACTIVE DATA SET INFORMATION (RECORD TYPE 'D')                    *  00619900
* ********************************************************************  00620000
*                                                                       00620100
*                                                                       00620200
         ORG   DCUDATA                                                  00620300
DCDADSI  DS    0X                                                       00620400
DCDDSNAM DS    1CL0044   DATA SET NAME                                  00620500
DCDERROR DS    1BL1      ERROR INFORMATION FLAGS                        00620600
         ORG   DCDERROR                                                 00620700
DCDEMNGD EQU   X'80'     SMS MANAGED INCONSISTENCY                      00620800
DCDEDVVR EQU   X'40'     DUPLICATE VVR FOUND                            00620900
DCDNOSPC EQU   X'20'     NO SPACE INFORMATION PROVIDED                  00621000
DCDVSAMI EQU   X'10'     VSAM INDICATORS INCONSISTENT                   00621100
DCDNOFM1 EQU   X'08'     NO FMT 1 DSCB FOR THIS DATA SET                00621200
         ORG   DCDERROR+X'00000001'                                     00621300
DCDFLAG1 DS    1BL1      INFORMATION FLAG #1                            00621400
         ORG   DCDFLAG1                                                 00621500
DCDRACFD EQU   X'80'     DATA SET IS RACF DEFINED                       00621600
DCDSMSM  EQU   X'40'     SMS MANAGED DATA SET                           00621700
DCDTEMP  EQU   X'20'     TEMPORARY DATA SET                             00621800
DCDPDSE  EQU   X'10'     PARTITIONED DATA SET (EXTENDED)                00621900
DCDGDS   EQU   X'08'     GENERATION DATA GROUP DATA SET                 00622000
DCDREBLK EQU   X'04'     DATA SET MAY BE REBLOCKED                      00622100
DCDCHIND EQU   X'02'     CHANGE INDICATOR                               00622200
DCDCKDSI EQU   X'01'     CHECKPOINT DATA SET INDICATOR                  00622240
         ORG   DCDFLAG1+X'00000001'                                     00622300
DCDFLAG2 DS    1BL1      INFORMATION FLAG #2                            00622400
         ORG   DCDFLAG2                                                 00622500
DCDNOVVR EQU   X'80'     NO VVR FOR THIS DATA SET                       00622600
DCDINTCG EQU   X'40'     DATA SET IS AN ICF CATALOG                     00622700
DCDINICF EQU   X'20'     DATA SET IS CATALOGED IN ICF CAT               00622800
DCDALLFG EQU   X'08'     ALLOCATED SPACE RET'D                          00622900
DCDUSEFG EQU   X'04'     USED SPACE INFO RET'D                          00623000
DCDSECFG EQU   X'02'     SEC. SPACE INFO RET'D                          00623100
DCDNMBFG EQU   X'01'     UNUSEABLE SPACE RET'D                          00623200
         ORG   DCDFLAG2+X'00000001'                                     00623300
DCDFLAG3 DS    1BL1      INFORMATION FLAG #3                            00623400
         ORG   DCDFLAG3                                                 00623500
DCDPDSEX EQU   X'80'     POSIX FILE SYSTEM FILE                         00623600
DCDSTRP  EQU   X'40'     EXTENDED FORMAT                                00623700
DCDDDMEX EQU   X'20'     DDM INFO EXIST FOR THIS DS                     00623800
         ORG   DCDFLAG3+X'00000001'                                     00623900
         DS    1CL0002   reserved                                       00624000
DCDDSORG DS    1BL2      DATA SET ORGANIZATION                          00624100
         ORG   DCDDSORG                                                 00624200
DCDDSOR0 DS    1BL1      DATA SET ORGANIZATION BYTE 0                   00624300
         ORG   DCDDSOR0                                                 00624400
DCDDSGIS EQU   X'80'     IS - INDEXED SEQUENTIAL ORG                    00624500
DCDDSGPS EQU   X'40'     PS - PHYSICAL SEQUENTIAL ORG                   00624600
DCDDSGDA EQU   X'20'     DA - DIRECT ORGANIZATION                       00624700
DCDDSGPO EQU   X'02'     PO - PARTITIONED ORGANIZATION                  00624800
DCDDSGU  EQU   X'01'     U - UNMOVEABLE DATA SET                        00624900
         ORG   DCDDSOR0+X'00000001'                                     00625000
DCDDSOR1 DS    1BL1      DATA SET ORGANIZATION BYTE 1                   00625100
         ORG   DCDDSOR1                                                 00625200
DCDDSGGS EQU   X'80'     GS - GRAPHICS ORGANIZATION                     00625300
DCDDSGVS EQU   X'08'     VS - VSAM DATA SET                             00625400
         ORG   DCDDSORG+X'00000002'                                     00625500
DCDRECRD DS    1BL1      RECORD FORMAT BYTE                             00625600
         ORG   DCDRECRD                                                 00625700
DCDRECFM EQU   X'C0'     RECORD FORMAT BITS                             00625800
DCDRECFT EQU   X'20'     TRACK OVERFLOW                                 00625900
DCDRECFB EQU   X'10'     BLOCKED RECORDS                                00626000
DCDRECFS EQU   X'08'     STANDARD BLOCKS(F) OR SPANNED(V)               00626100
DCDRECFA EQU   X'04'     ANSI CONTROL CHARACTER                         00626200
DCDRECFC EQU   X'02'     MACHINE CONTROL CHARACTER                      00626300
         ORG   DCDRECRD+X'00000001'                                     00626400
DCDNMEXT DS    1FL1      NUMBER OF EXTENTS USED                         00626500
DCDVOLSR DS    1CL0006   VOLUME SERIAL NUMBER                           00626600
DCDBKLNG DS    1FL2      BLOCK LENGTH                                   00626700
DCDLRECL DS    1FL2      RECORD LENGTH                                  00626800
DCDALLSP DS    1FL4      SPACE ALLOCATED TO DATA SET                    00626900
DCDUSESP DS    1FL4      SPACE USED BY DATA SET                         00627000
DCDSCALL DS    1FL4      SECONDARY ALLOCATION                           00627100
DCDNMBLK DS    1FL4      # OF BYTES UNUSEABLE IN BLOCKS                 00627200
DCDCREDT DS    1CL0004   CREATION DATE (YYYYDDDF)                       00627300
DCDEXPDT DS    1CL0004   EXPIRATION DATE (YYYYDDDF)                     00627400
DCDLSTRF DS    1CL0004   DATE LAST REFERENCED (YYYYDDDF)                00627500
DCDDSSER DS    1CL0006   DATA SET SERIAL NUMBER                         00627600
DCDVOLSQ DS    1CL0002   VOLUME SEQUENCE NUMBER                         00627700
DCDLBKDT DS    1CL0008   LAST BACKUP TIME & DATE                        00627800
DCDDCLAS DS    1CL0032                                                  00627900
         ORG   DCDDCLAS                                                 00628000
DCDDCLNG DS    1FL2      DATA CLASS NAME LENGTH                         00628100
DCDDATCL DS    1CL0030   DATA CLASS NAME                                00628200
DCDSCLAS DS    1CL0032                                                  00628300
         ORG   DCDSCLAS                                                 00628400
DCDSCLNG DS    1FL2      STORAGE CLASS NAME LENGTH                      00628500
DCDSTGCL DS    1CL0030   STORAGE CLASS NAME                             00628600
DCDMCLAS DS    1CL0032                                                  00628700
         ORG   DCDMCLAS                                                 00628800
DCDMCLNG DS    1FL2      MANAGEMENT CLASS NAME LENGTH                   00628900
DCDMGTCL DS    1CL0030   MANAGEMENT CLASS NAME                          00629000
DCDSTOGP DS    1CL0032                                                  00629100
         ORG   DCDSTOGP                                                 00629200
DCDSGLNG DS    1FL2      STORAGE GROUP NAME LENGTH                      00629300
DCDSTGRP DS    1CL0030   STORAGE GROUP NAME                             00629400
DCDCCSID DS    1CL0002   CODED CHAR SET IDENTIFIER                      00629500
         DS    1CL0002   reserved                                       00629600
DCDUDSIZ DS    1CL0008   USER DATA SIZE                                 00629700
DCDCUDSZ DS    1CL0008   COMPRESSED USER DATA SIZE                      00629800
DCDEXFLG DS    1BL2      COMPRESSION FLAGS                              00629900
         ORG   DCDEXFLG                                                 00630000
DCDBDSZ  EQU   X'80'     INVALID DATA SIZES                             00630100
         ORG   DCDEXFLG+X'00000002'                                     00630200
DCDSCNT  DS    1FL2      Stripe Count                                   00630300
DCDOVERA DS    1FL4      OVER-ALLOCATED SPACE                           00630400
DCDACCT  DS    1CL0032   Account Information                            00630500
         DS    1CL0016   RESERVED                                       00630600
DCDADSIE DS    0C        END OF DCUDSET                                 00630700
DCDADSI_LEN EQU *-DCDADSI                                               00630800
         ORG   ,                                                        00630900
*                                                                       00631000
* ********************************************************************  00631100
* * VSAM BASE CLUSTER ASSOCIATION NAME (RECORD TYPE 'A')             *  00631200
* ********************************************************************  00631300
*                                                                       00631400
*                                                                       00631500
         ORG   DCUDATA                                                  00631600
DCASSOC  DS    0X                                                       00631700
DCADSNAM DS    1CL0044   DATA SET NAME                                  00631800
DCAASSOC DS    1CL0044   BASE CLUSTER NAME                              00631900
DCAFLAG1 DS    1BL1      VSAM INFORMATION FLAG #1                       00632000
         ORG   DCAFLAG1                                                 00632100
DCAKSDS  EQU   X'80'     KEY SEQUENCED DATA SET                         00632200
DCAESDS  EQU   X'40'     ENTRY SEQUENCED DATA SET                       00632300
DCARRDS  EQU   X'20'     RELATIVE RECORD DATA SET                       00632400
DCALDS   EQU   X'10'     LINEAR DATA SET                                00632500
DCAKRDS  EQU   X'08'     KEY RANGE DATA SET                             00632600
DCAAIX   EQU   X'04'     ALTERNATE INDEX DATA SET                       00632700
DCADATA  EQU   X'02'     VSAM DATA COMPONENT                            00632800
DCAINDEX EQU   X'01'     VSAM INDEX COMPONENT                           00632900
         ORG   DCAFLAG1+X'00000001'                                     00633000
DCAFLAG2 DS    1BL1      VSAM INFORMATION FLAG #2                       00633100
         ORG   DCAFLAG2                                                 00633200
DCAKR1ST EQU   X'80'     1ST SEGMENT OF KR DATA SET                     00633300
DCAIXUPG EQU   X'40'     ALTERNATE INDEX W/ UPGRADE                     00633400
DCAVRRDS EQU   X'20'     VARIABLE RRDS                                  00633500
DCANSTAT EQU   X'10'     NO VSAM STATS IN RECORD                        00633600
DCASRCI  EQU   X'08'     RBA is CI number                               00633700
DCAG4G   EQU   X'04'     Extended Addressability                        00633800
         ORG   DCAFLAG2+X'00000001'                                     00633900
         DS    1CL0002   RESERVED                                       00634000
DCAHURBA DS    1FL4      HIGH USED RBA / CI                             00634100
DCAHARBA DS    1FL4      HIGH ALLOCATED RBA / CI                        00634200
DCANLR   DS    1FL4      NUMBER OF LOGICAL RECORDS                      00634300
DCADLR   DS    1FL4      NUMBER OF DELETED RECORDS                      00634400
DCAINR   DS    1FL4      NUMBER OF INSERTED RECORDS                     00634500
DCAUPR   DS    1FL4      NUMBER OF UPDATED RECORDS                      00634600
DCARTR   DS    1FL4      NUMBER OF RETRIEVED RECORDS                    00634700
DCAASP   DS    1FL4      BYTES OF FREESPACE IN DS                       00634800
DCACIS   DS    1FL4      NUMBER OF CI SPLITS                            00634900
DCACAS   DS    1FL4      NUMBER OF CA SPLITS                            00635000
DCAEXC   DS    1FL4      NUMBER OF EXCPS                                00635100
DCARKP   DS    1FL2      RELATIVE KEY POSITION                          00635200
DCAKLN   DS    1FL2      KEY LENGTH                                     00635300
DCAHURBC DS    1CL0008   HIGH USED RBA CALC FRM CI                      00635400
DCAHARBC DS    1CL0008   HI ALLOC RBA CALC FRM CI                       00635500
DCACISZ  DS    1FL4      NUMBER BYTES IN A CI                           00635600
DCACACI  DS    1FL4      NUMBER CI'S IN A CA                            00635700
         DS    1CL0016   RESERVED                                       00635800
DCASSOCE DS    0C        END OF DCASSOC                                 00635900
DCASSOC_LEN EQU *-DCASSOC                                               00636000
         ORG   ,                                                        00636100
*                                                                       00636200
* ********************************************************************  00636300
* * VOLUME INFORMATION (RECORD TYPE 'V')                             *  00636400
* ********************************************************************  00636500
*                                                                       00636600
*                                                                       00636700
         ORG   DCUDATA                                                  00636800
DCVVOLI  DS    0X                                                       00636900
DCVVOLSR DS    1CL0006   VOLUME SERIAL NUMBER                           00637000
DCVFLAG1 DS    1BL1      INFORMATION FLAG #1                            00637100
         ORG   DCVFLAG1                                                 00637200
DCVINXST EQU   X'C0'     INDEX STATUS                                   00637300
DCVINXEX EQU   X'80'     INDEXED VTOC EXISTS                            00637400
DCVINXEN EQU   X'40'     INDEXED VTOC IS ENABLED                        00637500
DCVUSATR EQU   X'38'     USE ATTRIBUTE                                  00637600
DCVUSPVT EQU   X'20'     PRIVATE                                        00637700
DCVUSPUB EQU   X'10'     PUBLIC                                         00637800
DCVUSSTO EQU   X'08'     STORAGE                                        00637900
DCVSHRDS EQU   X'04'     DEVICE IS SHAREABLE                            00638000
DCVPHYST EQU   X'03'     PHYSICAL STATUS                                00638100
         ORG   DCVFLAG1+X'00000001'                                     00638200
DCVERROR DS    1BL1      ERROR INFORMATION FLAG                         00638300
         ORG   DCVERROR                                                 00638400
DCVEVLCP EQU   X'80'     ERROR CALCULATING VOL CAPACITY                 00638500
DCVEBYTK EQU   X'40'     ERROR CALCULATING BYTES/TRK                    00638600
DCVELSPC EQU   X'20'     ERROR DURING LSPACE PROCESSING                 00638700
         ORG   DCVERROR+X'00000001'                                     00638800
         DS    1CL0003   RESERVED                                       00638900
DCVPERCT DS    1FL1      PERCENT FREESPACE ON VOLUME                    00639000
DCVFRESP DS    1FL4      FREESPACE ON VOLUME (IN KB)                    00639100
DCVALLOC DS    1FL4      ALLOCATED SPACE ON VOL (IN KB)                 00639200
DCVVLCAP DS    1FL4      TOTAL CAPACITY OF VOL (IN KB)                  00639300
DCVFRAGI DS    1FL4      FRAGMENTATION INDEX                            00639400
DCVLGEXT DS    1FL4      LARGEST FREE EXTENT ON VOLUME                  00639500
DCVFREXT DS    1FL4      NUMBER OF FREE EXTENTS                         00639600
DCVFDSCB DS    1FL4      FREE DSCBS IN VTOC                             00639700
DCVFVIRS DS    1FL4      FREE VIRS                                      00639800
DCVDVTYP DS    1CL0008   DEVICE TYPE                                    00639900
DCVDVNUM DS    1FL2      DEVICE NUMBER                                  00640000
         DS    1CL0002   RESERVED                                       00640100
DCVSTGGP DS    1CL0032                                                  00640200
         ORG   DCVSTGGP                                                 00640300
DCVSGLNG DS    1FL2      STORAGE GROUP NAME LENGTH                      00640400
DCVSGTCL DS    1CL0030   STORAGE GROUP NAME                             00640500
DCVDPTYP DS    1CL0008   PHYSICAL DEVICE TYPE                           00640600
         DS    1CL0016   RESERVED                                       00640700
DCVVOLIE DS    0C        END IF DCVVOLI                                 00640800
DCVVOLI_LEN EQU *-DCVVOLI                                               00640900
         ORG   ,                                                        00641000
*                                                                       00641100
* ********************************************************************  00641200
* * DATA CLASS CONSTRUCT INFORMATION (RECORD TYPE 'DC')              *  00641300
* ********************************************************************  00641400
*                                                                       00641500
*                                                                       00641600
         ORG   DCUDATA                                                  00641700
DDCDATA  DS    0X                                                       00641800
DDCNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                      00641900
         ORG   DDCNMFLD                                                 00642000
DDCNMLEN DS    1FL2      LENGTH OF NAME                                 00642100
DDCNAME  DS    1CL0030   NAME OF DATA CLASS                             00642200
DDCUSER  DS    1CL0008   USERID OF LAST UPDATER                         00642300
DDCDATE  DS    1CL0010   DATE OF LAST UPDATE                            00642400
         DS    1CL0002   RESERVED                                       00642500
DDCTIME  DS    1CL0008   TIME OF LAST UPDATE                            00642600
DDCDESC  DS    1CL0120   DESCRIPTION                                    00642700
*                                                                       00642800
*      ***************************************************************  00642900
*      *                                                             *  00643000
*      * DATA CLASS PARAMETERS SPECIFICATION BITS                       00643100
*      *                                                             *  00643200
*      ***************************************************************  00643300
*                                                                       00643400
*                                                                       00643500
DDCSPEC  DS    1CL0004                                                  00643600
         ORG   DDCSPEC                                                  00643700
DDCSPEC1 DS    1BL1                                                     00643800
         ORG   DDCSPEC1                                                 00643900
DDCFRORG EQU   X'80'     RECORG SPECIFIED FLAG                          00644000
DDCFLREC EQU   X'40'     LRECL SPECIFIED FLAG                           00644100
DDCFRFM  EQU   X'20'     RECFM SPECIFIED FLAG                           00644200
DDCFKLEN EQU   X'10'     KEYLEN SPECIFIED FLAG                          00644300
DDCFKOFF EQU   X'08'     KEYOFF SPECIFIED FLAG                          00644400
DDCFEXP  EQU   X'04'     EXPIRATION ATTRIB SPEC'D FLAG                  00644500
DDCFRET  EQU   X'02'     RETENTION ATTRIB SPEC'D FLAG                   00644600
DDCFPSP  EQU   X'01'     PRIMARY SPACE SPECIFIED FLAG                   00644700
         ORG   DDCSPEC1+X'00000001'                                     00644800
DDCSPEC2 DS    1BL1                                                     00644900
         ORG   DDCSPEC2                                                 00645000
DDCFSSP  EQU   X'80'     SECONDARY SPACE SPEC'D FLAG                    00645100
DDCFDIR  EQU   X'40'     DIRECTORY BLOCKS SPEC'D FLAG                   00645200
DDCFAUN  EQU   X'20'     ALLOCATION UNIT SPEC'D FLAG                    00645300
DDCFAVR  EQU   X'10'     AVGREC SPECIFIED FLAG                          00645400
DDCFVOL  EQU   X'08'     VOLUME CNT SPECIFIED FLAG                      00645500
DDCFCIS  EQU   X'04'     DATA CI SIZE SPECIFIED FLAG                    00645600
DDCFCIF  EQU   X'02'     FREE CI % SPECIFIED FLAG                       00645700
DDCFCAF  EQU   X'01'     FREE CA % SPECIFIED FLAG                       00645800
         ORG   DDCSPEC2+X'00000001'                                     00645900
DDCSPEC3 DS    1BL1                                                     00646000
         ORG   DDCSPEC3                                                 00646100
DDCFXREG EQU   X'80'     SHAREOPT XREGION SPEC'D FLAG                   00646200
DDCFXSYS EQU   X'40'     SHAREOPT XSYSTEM SPEC'D FLAG                   00646300
DDCFIMBD EQU   X'20'     VSAM IMBED SPECIFIED FLAG                      00646400
DDCFRPLC EQU   X'10'     VSAM REPLICATE SPECIFIED FLAG                  00646500
DDCFCOMP EQU   X'08'     COMPACTION SPECIFIED FLAG                      00646600
DDCFMEDI EQU   X'04'     MEDIA TYPE SPECIFIED FLAG                      00646700
DDCFRECT EQU   X'02'     RECORDING TECHNOLOGY FLAG                      00646800
DDCFVEA  EQU   X'01'     VSAM extended addressing                       00646900
*                                                                       00647000
*      ***************************************************************  00647100
*      *                                                             *  00647200
*      * on = ext addr allowed                                          00647300
*      *                                                             *  00647400
*      ***************************************************************  00647500
*                                                                       00647600
*                                                                       00647700
         ORG   DDCSPEC3+X'00000001'                                     00647800
DDCSPEC4 DS    1BL1                                                     00647900
         ORG   DDCSPEC4                                                 00648000
DDCSPRLF EQU   X'80'     Space Constraint Relief                        00648100
DDCREDUS EQU   X'40'     Reduce Space by% specified                     00648200
DDCRABS  EQU   X'20'     Rec Access Bias specified                      00648300
*                                                                       00648400
*      ***************************************************************  00648500
*      *                                                             *  00648600
*      * DATA SET ATTRIBUTES                                            00648700
*      *                                                             *  00648800
*      ***************************************************************  00648900
*                                                                       00649000
*                                                                       00649100
         ORG   DDCSPEC+X'00000004'                                      00649200
DDCRCORG DS    1FL1      DATA SET RECORG -- SEE CONST                   00649300
DDCRECFM DS    1FL1      DATA SET RECFM -- SEE CONST                    00649400
DDCDSFLG DS    1BL1                                                     00649500
         ORG   DDCDSFLG                                                 00649600
DDCBLK   EQU   X'80'     1 = BLOCKED, 0 = UNBLKED/NULL                  00649700
DDCSTSP  EQU   X'40'     1 = STANDARD OR SPANNED                        00649800
         ORG   DDCDSFLG+X'00000001'                                     00649900
DDCCNTL  DS    1FL1      CARRIAGE CONTROL - SEE CONST                   00650000
DDCRETPD DS    1FL4      RETENTION PERIOD                               00650100
         ORG   DDCRETPD                                                 00650200
DDCEXPYR DS    1FL2      EXPDT - YEAR                                   00650300
DDCEXPDY DS    1FL2      EXPDT - ABSOLUTE DAY OF YEAR                   00650400
DDCVOLCT DS    1FL2      MAXIMUM VOL COUNT FOR EXTEND                   00650500
DDCDSNTY DS    1FL2      DSN TYPE -- SEE CONSTANTS                      00650600
*                                                                       00650700
*      ***************************************************************  00650800
*      *                                                             *  00650900
*      * DATA SET SPACE ATTRIBUTES                                      00651000
*      *                                                             *  00651100
*      ***************************************************************  00651200
*                                                                       00651300
*                                                                       00651400
DDCSPPRI DS    1FL4      PRIMARY SPACE AMOUNT                           00651500
DDCSPSEC DS    1FL4      SECONDARY SPACE AMOUNT                         00651600
DDCDIBLK DS    1FL4      DIRECTORY BLOCKS                               00651700
DDCAVREC DS    1FL1      AVGREC - M, K, U: SEE CONST                    00651800
DDCREDUC DS    1FL1      Reduce primary or secondary                    00651900
*                                                                       00652000
*      ***************************************************************  00652100
*      *                                                             *  00652200
*      * space by 0-99%. DDCSPRLF                                       00652300
*      * and DDCREDUS must be on                                        00652400
*      *                                                             *  00652500
*      ***************************************************************  00652600
*                                                                       00652700
*                                                                       00652800
DDCRBIAS DS    1FL1      VSAM Record Access Bias                        00652900
*                                                                       00653000
*      ***************************************************************  00653100
*      *                                                             *  00653200
*      * REQUIRES DDCRABS                                               00653300
*      * SEE CONSTANTS                                                  00653400
*      *                                                             *  00653500
*      ***************************************************************  00653600
*                                                                       00653700
*                                                                       00653800
         DS    1CL0001   RESERVED                                       00653900
DDCAUNIT DS    1FL4      ALLOCATION UNIT AMOUNT                         00654000
DDCBSZLM DS    1FL4      BlockSize Limit value <= 32760                 00654100
DDCLRECL DS    1FL4      RECORD LENGTH                                  00654200
*                                                                       00654300
*      ***************************************************************  00654400
*      *                                                             *  00654500
*      * VSAM ATTRIBUTES                                                00654600
*      *                                                             *  00654700
*      ***************************************************************  00654800
*                                                                       00654900
*                                                                       00655000
DDCCISZ  DS    1FL4      CISIZE FOR KS, ES OR RR                        00655100
DDCFRSP  DS    1CL0004   FREESPACE                                      00655200
         ORG   DDCFRSP                                                  00655300
DDCCIPCT DS    1FL2      CI FREESPACE %                                 00655400
DDCCAPCT DS    1FL2      CA FREESPACE %                                 00655500
DDCSHROP DS    1FL2      VSAM SHARE OPTIONS                             00655600
         ORG   DDCSHROP                                                 00655700
DDCXREG  DS    1FL1      VSAM XREGION SHARE OPTIONS                     00655800
DDCXSYS  DS    1FL1      VSAM XSYSTEM SHARE OPTIONS                     00655900
DDCVINDX DS    1BL1      VSAM SHARE OPTIONS                             00656000
         ORG   DDCVINDX                                                 00656100
DDCIMBED EQU   X'80'     1 = IMBED, 0 = NO                              00656200
DDCREPLC EQU   X'40'     1 = REPLICATE, 0 = NO                          00656300
         ORG   DDCVINDX+X'00000001'                                     00656400
DDCKLEN  DS    1FL1      VSAM KEY LENGTH                                00656500
DDCKOFF  DS    1FL2      VSAM KEY OFFSET                                00656600
DDCCAMT  DS    1FL1      VSAM candidate amount                          00656700
         DS    1CL0001   RESERVED                                       00656800
*                                                                       00656900
*      ***************************************************************  00657000
*      *                                                             *  00657100
*      * MOUNTABLE DEVICE ATTRIBUTES                                    00657200
*      *                                                             *  00657300
*      ***************************************************************  00657400
*                                                                       00657500
*                                                                       00657600
DDCCOMP  DS    1FL1      COMPACTION TYPE - SEE CONSTANTS                00657700
DDCMEDIA DS    1FL1      MEDIA TYPE -- SEE CONSTANTS                    00657800
DDCRECTE DS    1FL1      RECORDING TECHNOLOGY --SEE CONSTANTS BELOW     00657900
         DS    1CL0001   RESERVED                                       00658000
*                                                                       00658100
*      ***************************************************************  00658200
*      *                                                             *  00658300
*      * RLS SUPPORT                                                    00658400
*      *                                                             *  00658500
*      ***************************************************************  00658600
*                                                                       00658700
*                                                                       00658800
DDCRLS1  DS    1CL0004   RLS SUPPORT                                    00658900
         ORG   DDCRLS1                                                  00659000
DDCBWOTP DS    1FL1      BWO TYPE REQUIRES DDCBWOS                      00659100
*                                                                       00659200
*      ***************************************************************  00659300
*      *                                                             *  00659400
*      * SEE CONSTANTS                                                  00659500
*      *                                                             *  00659600
*      ***************************************************************  00659700
*                                                                       00659800
*                                                                       00659900
DDCLOGRC DS    1FL1      SPHERE RECOVERABILITY                          00660000
*                                                                       00660100
*      ***************************************************************  00660200
*      *                                                             *  00660300
*      * REQUIRES DDCLOGRS                                              00660400
*      * SEE CONSTANTS                                                  00660500
*      *                                                             *  00660600
*      ***************************************************************  00660700
*                                                                       00660800
*                                                                       00660900
DDCSPAND DS    1FL1      RECORD SPANS CI ABILITY                        00661000
*                                                                       00661100
*      ***************************************************************  00661200
*      *                                                             *  00661300
*      * REQUIRES DDCSPANS                                              00661400
*      * SEE CONSTANTS                                                  00661500
*      *                                                             *  00661600
*      ***************************************************************  00661700
*                                                                       00661800
*                                                                       00661900
         DS    1FL1      RESERVED                                       00662000
DDCLOGNM DS    1CL0028   LOG STREAM ID                                  00662100
         ORG   DDCLOGNM                                                 00662200
*                                                                       00662300
*      ***************************************************************  00662400
*      *                                                             *  00662500
*      * REQUIRES DDCLSIDS                                              00662600
*      *                                                             *  00662700
*      ***************************************************************  00662800
*                                                                       00662900
*                                                                       00663000
DDCLOGLN DS    1FL2      ID LENGTH                                      00663100
DDCLOGID DS    1CL0026   ID                                             00663200
*                                                                       00663300
*      ***************************************************************  00663400
*      *                                                             *  00663500
*      * DATA CLASS PARAMETERS SPECIFICATION BITS ADDITIONAL            00663600
*      *                                                             *  00663700
*      ***************************************************************  00663800
*                                                                       00663900
*                                                                       00664000
DDCSPECX DS    1CL0001                                                  00664100
         ORG   DDCSPECX                                                 00664200
DDCSPECA DS    1BL1      ADDITONAL SPECIFICATION FLAGS                  00664300
         ORG   DDCSPECA                                                 00664400
DDCBWOS  EQU   X'80'     BWO SPECIFIED                                  00664500
DDCLOGRS EQU   X'40'     SPHERE RECOVERABILITY SPEC'D                   00664600
DDCSPANS EQU   X'20'     CI SPAN SPECIFIED                              00664700
DDCLSIDS EQU   X'10'     LOGSTREAMID SPECIFIED                          00664800
         ORG   DDCSPECX+X'00000001'                                     00664900
         DS    1CL0003   RESERVED                                       00665000
         DS    1CL0016   RESERVED                                       00665100
DDCDATAE DS    0C        END OF DDCDATA                                 00665200
DDCDATA_LEN EQU *-DDCDATA                                               00665300
         ORG   ,                                                        00665400
*                                                                       00665500
* ********************************************************************  00665600
* * STORAGE CLASS CONSTRUCT INFORMATION (RECORD TYPE 'SC')              00665700
* ********************************************************************  00665800
*                                                                       00665900
*                                                                       00666000
         ORG   DCUDATA                                                  00666100
DSCDATA  DS    0X                                                       00666200
DSCNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                      00666300
         ORG   DSCNMFLD                                                 00666400
DSCNMLEN DS    1FL2      LENGTH OF NAME                                 00666500
DSCNAME  DS    1CL0030   NAME OF STORAGE CLASS                          00666600
DSCUSER  DS    1CL0008   USERID OF LAST UPDATER                         00666700
DSCDATE  DS    1CL0010   DATE OF LAST UPDATE                            00666800
         DS    1CL0002   RESERVED                                       00666900
DSCTIME  DS    1CL0008   TIME OF LAST UPDATE                            00667000
DSCDESC  DS    1CL0120   DESCRIPTION                                    00667100
*                                                                       00667200
*      ***************************************************************  00667300
*      *                                                             *  00667400
*      * STORAGE CLASS FLAGS                                            00667500
*      *                                                             *  00667600
*      ***************************************************************  00667700
*                                                                       00667800
*                                                                       00667900
DSCFLAGS DS    1BL1                                                     00668000
         ORG   DSCFLAGS                                                 00668100
DSCDFGSP EQU   X'80'     GUARANTEED SPACE 1=YES,0=NO                    00668200
DSCDFAVL EQU   X'40'     AVAILABILITY, 1=SEE DSCAVAIL 0=STANDARD       *00668300
                         (DEFAULT)                                      00668400
DSCFDIRR EQU   X'20'     DIRECT RESPONSE TIME OBJECT, 0=DON'T CARE,    *00668500
                         1=SEE DSCDIRR                                  00668600
DSCFDIRB EQU   X'10'     DIRECT BIAS, 0= DON'T CARE 1= SEE DSCDIRB      00668700
DSCFSEQR EQU   X'08'     SEQ. RESPONSE TIME OBJECTIVE, 0=DON'T CARE,   *00668800
                         1=SEE DSCSEQR                                  00668900
DSCFSEQB EQU   X'04'     SEQ. BIAS, 0= DON'T CARE 1= SEE DSCSEQB        00669000
DSCSYNCD EQU   X'02'     SYNCDEV, 1 = YES, 0 = NO                       00669100
DSCFIAD  EQU   X'01'     1 = INITIAL ACCESS RESPONSE                    00669200
         ORG   DSCFLAGS+X'00000001'                                     00669300
DSCFLAG2 DS    1BL1                                                     00669400
         ORG   DSCFLAG2                                                 00669500
DSCDFACC EQU   X'80'     ACCESSIBILITY,1=SEE DSCACCES                  *00669600
                         0=DEFAULT=CONTINUOUS PREFERRED                 00669700
DSCDFSDR EQU   X'40'     STRIPING SUSTAINED DATA RATE 0=NOT            *00669800
                         SPECD,1=SEE DSCSTSDR                           00669900
DSCFDCFW EQU   X'20'     Direct CF weight specified: 1 = YES 0 = NO     00670000
DSCFSCFW EQU   X'10'     Sequential weight specified: 1 = YES 0 = NO    00670100
         ORG   DSCFLAG2+X'00000001'                                     00670200
         DS    1CL0002   RESERVED                                       00670300
*                                                                       00670400
*      ***************************************************************  00670500
*      *                                                             *  00670600
*      * STORAGE CLASS ATTRIBUTES                                       00670700
*      *                                                             *  00670800
*      ***************************************************************  00670900
*                                                                       00671000
*                                                                       00671100
DSCAVAIL DS    1FL1      AVAILABILITY OPTIONS                           00671200
DSCDIRB  DS    1FL1      DIRECT BIAS - SEE CONSTANTS                    00671300
DSCSEQB  DS    1FL1      SEQ. BIAS - SEE CONSTANTS                      00671400
DSCACCES DS    1FL1      ACCESSIBILITY - SEE CONSTS.                    00671500
DSCIACDL DS    1FL4      INITIAL ACCESS RESPONSE SEC                    00671600
DSCDIRR  DS    1FL4      MICROSECOND RESPONSE TIME OBJECTIVE -- DIRECT  00671700
DSCSEQR  DS    1FL4      MICROSECOND RESPONSE TIME OBJECTIVE --        *00671800
                         SEQUENTIAL                                     00671900
DSCSTSDR DS    1FL4      STRIPING SUSTAIND DATA RATE                    00672000
DSCCCHST DS    1CL0032   Cache Set Name                                 00672100
         ORG   DSCCCHST                                                 00672200
DSCCSLEN DS    1FL2      Cache Set Name Length                          00672300
DSCCSNAM DS    1CL0030   Cache Set Name value                           00672400
DSCDIRCW DS    1FL2      Direct CF weight                               00672500
DSCSEQCW DS    1FL2      Sequential CF weight                           00672600
         DS    1CL0016   RESERVED                                       00672700
DSCDATAE DS    0C        END OF DSCDATA                                 00672800
DSCDATA_LEN EQU *-DSCDATA                                               00672900
         ORG   ,                                                        00673000
*                                                                       00673100
* ********************************************************************  00673200
* * MANAGEMENT CLASS CONSTRUCT INFORMATION (RECORD TYPE 'MC')           00673300
* ********************************************************************  00673400
*                                                                       00673500
*                                                                       00673600
         ORG   DCUDATA                                                  00673700
DMCDATA  DS    0X                                                       00673800
DMCNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                      00673900
         ORG   DMCNMFLD                                                 00674000
DMCNMLEN DS    1FL2      LENGTH OF NAME                                 00674100
DMCNAME  DS    1CL0030   NAME OF MANAGEMENT CLASS                       00674200
DMCUSER  DS    1CL0008   USERID OF LAST UPDATER                         00674300
DMCDATE  DS    1CL0010   DATE OF LAST UPDATE                            00674400
         DS    1CL0002   RESERVED                                       00674500
DMCTIME  DS    1CL0008   TIME OF LAST UPDATE                            00674600
DMCDESC  DS    1CL0120   DESCRIPTION                                    00674700
*                                                                       00674800
*      ***************************************************************  00674900
*      *                                                             *  00675000
*      * GENERAL SPECIFICATION FLAGS                                    00675100
*      *                                                             *  00675200
*      ***************************************************************  00675300
*                                                                       00675400
*                                                                       00675500
DMCSPEC1 DS    1BL1      ATTRIBUTE SPECIFIED FLAGS: 1= SPECIFIED        00675600
         ORG   DMCSPEC1                                                 00675700
DMCFBVER EQU   X'80'     DMCBKVS SPECIFIED FLAG                         00675800
DMCFBVRD EQU   X'40'     DMCBVRD SPECIFIED FLAG                         00675900
DMCFRBK  EQU   X'20'     DMCBKDY SPECIFIED FLAG                         00676000
DMCFRNP  EQU   X'10'     DMCBKNP SPECIFIED FLAG                         00676100
DMCFEXDT EQU   X'08'     DMCEXDAT SPECIFIED FLAG                        00676200
DMCFEXDY EQU   X'04'     DMCEXPDY SPECIFIED FLAG                        00676300
DMCFPRDY EQU   X'02'     DMCPRDY SPECIFIED FLAG                         00676400
         ORG   DMCSPEC1+X'00000001'                                     00676500
DMCSPEC2 DS    1BL1      ATTRIBUTE SPECIFIED FLAGS: 1= SPECIFIED        00676600
         ORG   DMCSPEC2                                                 00676700
DMCFL1DY EQU   X'80'     DMCL1DY SPECIFIED FLAG                         00676800
DMCFRLMG EQU   X'40'     DMCRLOMG SPECIFIED FLAG                        00676900
DMCFPELE EQU   X'20'     DMCPELEM SPECIFIED FLAG                        00677000
DMCFBKFQ EQU   X'10'     DMCBKFQ SPECIFIED FLAG                         00677100
*                                                                       00677200
*      ***************************************************************  00677300
*      *                                                             *  00677400
*      * PARTIAL RELEASE CRITERIA                                       00677500
*      *                                                             *  00677600
*      ***************************************************************  00677700
*                                                                       00677800
*                                                                       00677900
         ORG   DMCSPEC2+X'00000001'                                     00678000
DMCRLF   DS    1BL1                                                     00678100
         ORG   DMCRLF                                                   00678200
DMCPREL  EQU   X'80'     RELEASE 1 = YES, 0 = NO                        00678300
DMCPRCN  EQU   X'40'     CONDITIONAL PARTREL                            00678400
DMCPRIM  EQU   X'20'     IMMEDIATE VALUE FOR REL                        00678500
         ORG   DMCRLF+X'00000001'                                       00678600
         DS    1CL0001   RESERVED                                       00678700
*                                                                       00678800
*      ***************************************************************  00678900
*      *                                                             *  00679000
*      * GENERATION DATA GROUP CRITERIA                                 00679100
*      *                                                             *  00679200
*      ***************************************************************  00679300
*                                                                       00679400
*                                                                       00679500
DMCGDGFL DS    1BL1      GDG ATTRIBUTE FLAGS                            00679600
         ORG   DMCGDGFL                                                 00679700
DMCRLOMG EQU   X'80'     MIGRATE OR EXPIRE ROLLED OFF GDS, 1=MIGRATE,  *00679800
                         0=EXPIRE                                       00679900
         ORG   DMCGDGFL+X'00000001'                                     00680000
         DS    1CL0001   RESERVED                                       00680100
DMCPELEM DS    1FL2      NUM GDG ELEMENTS ON PRIMARY                    00680200
*                                                                       00680300
*      ***************************************************************  00680400
*      *                                                             *  00680500
*      * DATA SET EXPIRATION CRITERIA                                   00680600
*      *                                                             *  00680700
*      ***************************************************************  00680800
*                                                                       00680900
*                                                                       00681000
DMCEXPF  DS    1BL1      FLAGS                                          00681100
         ORG   DMCEXPF                                                  00681200
DMCARNOL EQU   X'80'     DMCRDARC IS NOLIMIT = 1                        00681300
         ORG   DMCEXPF+X'00000001'                                      00681400
DMCEXPAC DS    1FL1      EXPIRE ACTION: SEE CONST                       00681500
DMCRDARC DS    1FL2      RETAIN DAYS ARCHIVE COPY                       00681600
*                                                                       00681700
*      ***************************************************************  00681800
*      *                                                             *  00681900
*      * DATA SET RETENTION CRITERIA                                    00682000
*      *                                                             *  00682100
*      ***************************************************************  00682200
*                                                                       00682300
*                                                                       00682400
DMCRETF  DS    1BL1      DATA SET RETENTION FLAGS                       00682500
         ORG   DMCRETF                                                  00682600
DMCDYNOL EQU   X'80'     1=EXPIRE AFTER DAYS= NOLIMIT ELSE 0 AND SEE   *00682700
                         DMCEXPDY                                       00682800
DMCDTNOL EQU   X'40'     1=EXPIRE AFTER DATE= NOLIMIT ELSE 0 AND SEE   *00682900
                         DMCEXDAT                                       00683000
         ORG   DMCRETF+X'00000001'                                      00683100
DMCRFMT  DS    1FL1      Format used for DMCEXDAT -- DATE OR DAYS: SEE *00683200
                         CONSTANTS                                      00683300
         DS    1CL0002   RESERVED                                       00683400
DMCEXPDY DS    1FL4      EXPIRE AFTER DAYS NO USE                       00683500
DMCEXDAT DS    1FL4      EXPIRE DAYS SINCE CREATE                       00683600
         ORG   DMCEXDAT                                                 00683700
DMCEYEAR DS    1FL2      EXPIRE DATE SINCE CREATE                       00683800
DMCEDAY  DS    1FL2      SEE DMCRFMT FOR FORMAT                         00683900
*                                                                       00684000
*      ***************************************************************  00684100
*      *                                                             *  00684200
*      * DATA SET MIGRATION CRITERIA                                    00684300
*      *                                                             *  00684400
*      ***************************************************************  00684500
*                                                                       00684600
*                                                                       00684700
DMCMIGF  DS    1BL1      DATA SET MIGRATION FLAGS                       00684800
         ORG   DMCMIGF                                                  00684900
DMCL1NOL EQU   X'20'     MIN DAYS ON LEVEL 1/LAST USE, 1=NOLIMIT ELSE  *00685000
                         SEE DMCL1DY                                    00685100
         ORG   DMCMIGF+X'00000001'                                      00685200
         DS    1CL0001   RESERVED                                       00685300
DMCPRDY  DS    1FL2      MIN DAYS ON PRIM/LAST USE                      00685400
DMCL1DY  DS    1FL2      MIN DAYS ON LVL 1/LAST USE                     00685500
DMCCMAU  DS    1FL1      COMMAND OR AUTO MIGRATE -- SEE CONSTANTS      *00685600
                         BELOW                                          00685700
         DS    1CL0001   RESERVED                                       00685800
*                                                                       00685900
*      ***************************************************************  00686000
*      *                                                             *  00686100
*      * DATA SET BACKUP CRITERIA                                       00686200
*      *                                                             *  00686300
*      ***************************************************************  00686400
*                                                                       00686500
*                                                                       00686600
DMCBKFLG DS    1BL1      BACKUP FLAGS                                   00686700
         ORG   DMCBKFLG                                                 00686800
DMCRBNOL EQU   X'80'     1=>RETAIN DAYS ONLY BACKUP VERS= NOLIMIT.     *00686900
                         0=>SEE DMCBKNP FOR DAYS TO KEEP ONLY BACKUP    00687000
DMCNPNOL EQU   X'40'     1=>RETAIN DAYS EXTRA BACKUP VERS = NOLIMIT.   *00687100
                         0=>SEE DMCBKDY FOR DAYS TO KEEP EXTRA BACKUP   00687200
DMCAUTBK EQU   X'10'     1=AUTO BACKUP ALLOWED                          00687300
DMCCPYTF EQU   X'08'     COPY TECHNIQUE, 1=SEE DMCCPYTC                *00687400
                         0=DEFAULT=STANDARD                             00687500
         ORG   DMCBKFLG+X'00000001'                                     00687600
         DS    1CL0003   RESERVED                                       00687700
DMCBKFQ  DS    1FL2      BACKUP FREQUENCY                               00687800
DMCBKVS  DS    1FL2      NUMBER OF BACKUP VERSIONS                      00687900
DMCBVRD  DS    1FL2      NUM OF VERSIONS: DS DELETED                    00688000
DMCBKDY  DS    1FL2      DAYS TO KEEP BACKUP VERSION                    00688100
DMCBKNP  DS    1FL2      DAYS TO KEEP ONLY BACKUP                       00688200
DMCBADU  DS    1FL1      ALLOW ADMIN OR USER BACKUP -- SEE CONSTANTS   *00688300
                         BELOW                                          00688400
DMCCPYTC DS    1FL1      COPY TECHNIQUE - SEE CONSTANTS                 00688500
DMCBKUDC DS    1CL0008   BACKUP DESTINATION CLASS                       00688600
*                                                                       00688700
*      ***************************************************************  00688800
*      *                                                             *  00688900
*      * MAXIMUM RETENTION CRITERIA                                     00689000
*      *                                                             *  00689100
*      ***************************************************************  00689200
*                                                                       00689300
*                                                                       00689400
DMCMRETF DS    1BL1      MAXIMUM RETENTION FLAGS                        00689500
         ORG   DMCMRETF                                                 00689600
DMCRPNOL EQU   X'80'     RETPD (RETAIN PD) 1=NOLIMIT ELSE SEE DMCMRTDY  00689700
         ORG   DMCMRETF+X'00000001'                                     00689800
         DS    1CL0001   RESERVED                                       00689900
DMCMRTDY DS    1FL2      MAXIMUM DAYS TO RETAIN                         00690000
*                                                                       00690100
*      ***************************************************************  00690200
*      *                                                             *  00690300
*      * CLASS TRANSITION CRITERIA                                      00690400
*      *                                                             *  00690500
*      ***************************************************************  00690600
*                                                                       00690700
*                                                                       00690800
DMCTSCR  DS    1BL1      TIME SINCE CREATION FLAGS.                     00690900
         ORG   DMCTSCR                                                  00691000
DMCTCYR  EQU   X'80'     YEARS SPECIFIED.                               00691100
DMCTCMN  EQU   X'40'     MONTHS SPECIFIED.                              00691200
DMCTCDY  EQU   X'20'     DAYS SPECIFIED.                                00691300
         ORG   DMCTSCR+X'00000001'                                      00691400
DMCTSLU  DS    1BL1      TIME SINCE LAST USED FLAGS.                    00691500
         ORG   DMCTSLU                                                  00691600
DMCTSYR  EQU   X'80'     YEARS SPECIFIED.                               00691700
DMCTSMN  EQU   X'40'     MONTHS SPECIFIED.                              00691800
DMCTSDY  EQU   X'20'     DAYS SPECIFIED.                                00691900
         ORG   DMCTSLU+X'00000001'                                      00692000
DMCPERD  DS    1BL1      PERIODIC FLAGS.                                00692100
         ORG   DMCPERD                                                  00692200
DMCPEMN  EQU   X'80'     MONTHLY SPECIFIED.                             00692300
DMCPEQD  EQU   X'40'     QUARTERLY ON DAY SPEC.                         00692400
DMCPEQM  EQU   X'20'     QUARTERLY ON MONTH SPEC.                       00692500
DMCPEYD  EQU   X'10'     YEARLY ON DAY SPEC.                            00692600
DMCPEYM  EQU   X'08'     YEARLY IN MONTH SPEC.                          00692700
DMCFIRST EQU   X'04'     FIRST DAY OF PERIOD SPEC.                      00692800
DMCLAST  EQU   X'02'     LAST DAY OF PERIOD SPEC.                       00692900
         ORG   DMCPERD+X'00000001'                                      00693000
         DS    1CL0001   RESERVED.                                      00693100
DMCVSCR  DS    1CL0006   TIME SINCE CREATION VALUES                     00693200
         ORG   DMCVSCR                                                  00693300
DMCVSCY  DS    1FL2      TIME SINCE CREATION YEARS                      00693400
DMCVSCM  DS    1FL2      TIME SINCE CREATION MONTHS                     00693500
DMCVSCD  DS    1FL2      TIME SINCE CREATION DAYS                       00693600
DMCVSLU  DS    1CL0006   TIME SINCE LAST USED                           00693700
         ORG   DMCVSLU                                                  00693800
DMCVSUY  DS    1FL2      TIME SINCE LAST USED YEARS                     00693900
DMCVSUM  DS    1FL2      TIME SINCE LAST USED MONTHS                    00694000
DMCVSUD  DS    1FL2      TIME SINCE LAST USED DAYS                      00694100
DMCVPRD  DS    1FL2      PERIODIC VALUES                                00694200
DMCVPMD  DS    1FL2      PERIODIC MONTHLY ON DAY                        00694300
DMCVPQT  DS    1CL0004   PERIODIC QUARTERLY VALUES.                     00694400
         ORG   DMCVPQT                                                  00694500
DMCVPQD  DS    1FL2      PERIODIC QUARTERLY ON DAY                      00694600
DMCVPQM  DS    1FL2      PERIODIC QUARTERLY IN MONTH                    00694700
DMCVPYR  DS    1CL0004   PERIODIC YEARLY VALUES.                        00694800
         ORG   DMCVPYR                                                  00694900
DMCVPYD  DS    1FL2      PERIODIC YEARLY ON DAY                         00695000
DMCVPYM  DS    1FL2      PERIODIC YEARLY IN MONTH                       00695100
         DS    1CL0016   RESERVED                                       00695200
DMCDATAE DS    0C        END OF DMCDATA                                 00695300
DMCDATA_LEN EQU *-DMCDATA                                               00695400
         ORG   ,                                                        00695500
*                                                                       00695600
* ********************************************************************  00695700
* * BASE CONFIGURATION INFORMATION (RECORD TYPE 'BC')                   00695800
* ********************************************************************  00695900
*                                                                       00696000
*                                                                       00696100
         ORG   DCUDATA                                                  00696200
DBCDATA  DS    0X                                                       00696300
         DS    1CL0032   RESERVED                                       00696400
DBCUSER  DS    1CL0008   USERID OF LAST UPDATER                         00696500
DBCDATE  DS    1CL0010   DATE OF LAST UPDATE                            00696600
         DS    1CL0002   RESERVED                                       00696700
DBCTIME  DS    1CL0008   TIME OF LAST UPDATE                            00696800
DBCDESC  DS    1CL0120   DESCRIPTION                                    00696900
*                                                                       00697000
*      ***************************************************************  00697100
*      *                                                             *  00697200
*      * BASE CONFIGURATION FLAGS                                       00697300
*      *                                                             *  00697400
*      ***************************************************************  00697500
*                                                                       00697600
*                                                                       00697700
DBCFLAGS DS    1BL1      Reserved                                       00697800
DBCFLGDC DS    1BL1      DCOLLECT flags                                 00697900
         ORG   DBCFLGDC                                                 00698000
DBC32NAM EQU   X'80'     0 = use DBCFSYSN                               00698100
*                                                                       00698200
*      ***************************************************************  00698300
*      *                                                             *  00698400
*      * 1 = use DBCSYSDT                                               00698500
*      *                                                             *  00698600
*      ***************************************************************  00698700
*                                                                       00698800
*                                                                       00698900
         ORG   DBCFLGDC+X'00000001'                                     00699000
         DS    1CL0002   RESERVED                                       00699100
*                                                                       00699200
*      ***************************************************************  00699300
*      *                                                             *  00699400
*      * BASE CONFIGURATION DEFAULTS                                    00699500
*      *                                                             *  00699600
*      ***************************************************************  00699700
*                                                                       00699800
*                                                                       00699900
DBCDEFMC DS    1CL0032   DEFAULT MANAGEMENT CLASS                       00700000
         ORG   DBCDEFMC                                                 00700100
DBCMCLEN DS    1FL2      DEFAULT MC LENGTH OF NAME                      00700200
DBCMCNAM DS    1CL0030   DEFAULT MANAGEMENT CLASS NAME                  00700300
DBCDGEOM DS    1CL0008   DEFAULT DEVICE GEOMETRY                        00700400
         ORG   DBCDGEOM                                                 00700500
DBCTRKSZ DS    1FL4      TRACK SIZE IN BYTES                            00700600
DBCCYLCP DS    1FL4      CYL CAPACITY (TRK/CYL)                         00700700
DBCDUNIT DS    1CL0008   DEFAULT UNIT                                   00700800
*                                                                       00700900
*      ***************************************************************  00701000
*      *                                                             *  00701100
*      * BASE CONFIGURATION INFORMATION                                 00701200
*      *                                                             *  00701300
*      ***************************************************************  00701400
*                                                                       00701500
*                                                                       00701600
DBCSRST  DS    1CL0008   SMS RESOURCE STATUS TOKEN                      00701700
DBCSTAT  DS    1FL1      DATA SET STATUS -- SEE CONST                   00701800
         DS    1CL0003   RESERVED                                       00701900
DBCFSYSN DS    1CL0008   SYSTEM NAMES                                   00702000
         ORG   DBCFSYSN+X'00000040'                                     00702100
DBCSCDSN DS    1CL0044   FOR ACDS ONLY: NAME OF SCDS FROM WHICH IT WAS *00702200
                         ACTIVATED                                      00702300
*                                                                       00702400
*      ***************************************************************  00702500
*      *                                                             *  00702600
*      * SYSTEM FEATURES                                                00702700
*      *                                                             *  00702800
*      ***************************************************************  00702900
*                                                                       00703000
*                                                                       00703100
DBCSFEAT DS    1CL0002   SUPPORTED SYSTEM FEATURES                      00703200
         ORG   DBCSFEAT+X'00000010'                                     00703300
DBCSYSNT DS    1FL1      TYPE OF SYSTEM NAMES - SEE CONSTANTS           00703400
         ORG   DBCSYSNT+X'00000008'                                     00703500
DBCSYSDT DS    1CL0016   System related data                            00703600
         ORG   DBCSYSDT                                                 00703700
DBCSYSNM DS    1CL0008   System/group name                              00703800
DBCSYSFT DS    1CL0002   Supported system features                      00703900
         DS    1CL0002   Reserved                                       00704000
DBCSNMTY DS    1FL1      System name type for this entry see constants  00704100
         DS    1CL0003   Reserved                                       00704200
         ORG   DBCSYSDT+X'00000200'                                     00704300
         DS    1CL0016   RESERVED                                       00704400
DBCDATAE DS    0C        END OF DBCDATA                                 00704500
DBCDATA_LEN EQU *-DBCDATA                                               00704600
         ORG   ,                                                        00704700
*                                                                       00704800
* ********************************************************************  00704900
* * STORAGE GROUP CONSTRUCT INFORMATION (RECORD TYPE 'SG')              00705000
* ********************************************************************  00705100
*                                                                       00705200
*                                                                       00705300
         ORG   DCUDATA                                                  00705400
DSGDATA  DS    0X                                                       00705500
DSGNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                      00705600
         ORG   DSGNMFLD                                                 00705700
DSGNMLEN DS    1FL2      LENGTH OF NAME                                 00705800
DSGNAME  DS    1CL0030   NAME OF DATA CLASS                             00705900
DSGUSER  DS    1CL0008   USERID OF LAST UPDATER                         00706000
DSGDATE  DS    1CL0010   DATE OF LAST UPDATE                            00706100
         DS    1CL0002   RESERVED                                       00706200
DSGTIME  DS    1CL0008   TIME OF LAST UPDATE                            00706300
DSGDESC  DS    1CL0120   DESCRIPTION                                    00706400
*                                                                       00706500
*      ***************************************************************  00706600
*      *                                                             *  00706700
*      * STORAGE GROUP FLAG INFORMATION                                 00706800
*      *                                                             *  00706900
*      ***************************************************************  00707000
*                                                                       00707100
*                                                                       00707200
DSGFLAGS DS    1CL0001   FLAGS AND RESERVED                             00707300
         ORG   DSGFLAGS                                                 00707400
DSGFABUP EQU   X'80'     HSM AUTO BACKUP, 1=YES,0=NO                    00707500
DSGFAMIG EQU   X'40'     AUTO MIGRATION, 1=YES, 0=NO                    00707600
DSGFADMP EQU   X'20'     AUTO DUMP, 1 = YES, 0 = NO                     00707700
DSGFTHRS EQU   X'10'     THRESHOLDS SPECIFIED: 1 = YES, 0 = NO          00707800
DSGFGBKU EQU   X'08'     GUARANTEED BACKUP FREQ. SPECIFIED, 1=YES,     *00707900
                         0=NO                                           00708000
DSGGBNOL EQU   X'04'     GUARANTEED BACKUP FREQ. 1=NOLIMIT, 0=SEE      *00708100
                         DSGGBKUF                                       00708200
DSGFIMIG EQU   X'02'     INTERVAL MIGRATION 1 = YES 0 = NO              00708300
DSGFPSM  EQU   X'01'     PRIMARY SPACE MGMT                             00708400
*                                                                       00708500
*      ***************************************************************  00708600
*      *                                                             *  00708700
*      * 1 = YES 0 = NO                                                 00708800
*      *                                                             *  00708900
*      ***************************************************************  00709000
*                                                                       00709100
*                                                                       00709200
         ORG   DSGFLAGS+X'00000001'                                     00709300
DSGFLGDC DS    1BL1      RESERVED                                       00709400
         ORG   DSGFLGDC                                                 00709500
DSG32NAM EQU   X'80'     0 = Use DSGFPRST, DSGCNFRM                     00709600
*                                                                       00709700
*      ***************************************************************  00709800
*      *                                                             *  00709900
*      * 1 = Use DSGSSTAT                                               00710000
*      *                                                             *  00710100
*      ***************************************************************  00710200
*                                                                       00710300
*                                                                       00710400
         ORG   DSGFLGDC+X'00000001'                                     00710500
         DS    1CL0002   RESERVED                                       00710600
*                                                                       00710700
*      ***************************************************************  00710800
*      *                                                             *  00710900
*      * STORAGE GROUP ATTRIBUTES                                       00711000
*      *                                                             *  00711100
*      ***************************************************************  00711200
*                                                                       00711300
*                                                                       00711400
DSGFTYPE DS    1FL1      STORAGE GROUP TYPE -- SEE CONSTANTS BELOW      00711500
DSGFHTHR DS    1FL1      HIGH THRESHOLD - 0 TO 99 %                     00711600
DSGFLTHR DS    1FL1      LOW THRESHOLD - 0 TO 99 %                      00711700
         DS    1CL0001   RESERVED                                       00711800
DSGFVMAX DS    1FL4      VIO MAX DATA SET SIZE                          00711900
DSGFVUNT DS    1CL0004   VIO UNIT TYPE                                  00712000
DSGDMPCL DS    1CL0008   DUMP CLASSES FOR AUTODUMP                      00712100
         ORG   DSGDMPCL+X'00000028'                                     00712200
DSGFPRST DS    1CL0001   STATUS BY PROCESSOR                            00712300
         ORG   DSGFPRST                                                 00712400
DSGSTAT  DS    1FL1      STATUS                                         00712500
         ORG   DSGFPRST+X'00000008'                                     00712600
DSGABSYS DS    1CL0008   AUTO BACKUP SYSTEM                             00712700
DSGADSYS DS    1CL0008   AUTO DUMP SYSTEM                               00712800
DSGAMSYS DS    1CL0008   AUTO MIGRATE SYSTEM                            00712900
DSGCNFRM DS    1CL0001   CONFIRMED SMS STATUS FOR THIS STORAGE GROUP   *00713000
                         -- SEE CONSTANT                                00713100
         ORG   DSGCNFRM                                                 00713200
DSGCSMSS DS    1FL1      CONFIRMED SMS STATUS                           00713300
         ORG   DSGCNFRM+X'00000008'                                     00713400
DSGGBKUF DS    1FL4      GUARANTEED BACKUP FREQ.                        00713500
*                                                                       00713600
*      ***************************************************************  00713700
*      *                                                             *  00713800
*      * STORAGE GROUP OAM ATTRIBUTES                                   00713900
*      *                                                             *  00714000
*      ***************************************************************  00714100
*                                                                       00714200
*                                                                       00714300
DSGTBLGR DS    1CL0007   OAM TABLE SPACE ID GROUPNN                     00714400
         DS    1CL0001   RESERVED                                       00714500
DSGOAMFL DS    1BL1      OAM FLAGS                                      00714600
         ORG   DSGOAMFL                                                 00714700
DSGFCYS  EQU   X'80'     OAM CYCLE START/END GIVEN                      00714800
DSGFVLFT EQU   X'40'     VOLUME FULL THRESHOLD BIT                      00714900
DSGFDRST EQU   X'20'     DRIVE START THRESHOLD BIT                      00715000
DSGVFFER EQU   X'10'     VOLUME FULL@WRITE ERR GIVEN                    00715100
DSGVFERR EQU   X'08'     VOLUME FULL@WRITE ERROR BIT                    00715200
         ORG   DSGOAMFL+X'00000001'                                     00715300
         DS    1CL0001   RESERVED                                       00715400
DSGCYLST DS    1FL1      OAM CYCLE START TIME (HRS)                     00715500
DSGCYLED DS    1FL1      OAM CYCLE END TIME (HRS)                       00715600
DSGVOLFT DS    1FL2      VOLUME FULL THRESHOLD BIT                      00715700
DSGDRVST DS    1FL2      DRIVE START THRESHOLD BIT                      00715800
DSGOLIBS DS    1CL0032   OPTICAL LIBRARIES.                             00715900
         ORG   DSGOLIBS                                                 00716000
DSGOLBNL DS    1FL2      OPTICAL LIBRARY NAME LENGTH                    00716100
DSGOLBNM DS    1CL0008   OPTICAL LIBRARY NAME                           00716200
         DS    1CL0022   RESERVED                                       00716300
         ORG   DSGOLIBS+X'00000100'                                     00716400
DSGSSTAT DS    1CL0008   Status by processor                            00716500
         ORG   DSGSSTAT                                                 00716600
DSGSYSST DS    1FL1      Requested system status                        00716700
DSGCNSMS DS    1FL1      Confirmed SMS status                           00716800
         DS    1CL0006   Reserved                                       00716900
         ORG   DSGSSTAT+X'00000100'                                     00717000
         DS    1CL0016   RESERVED                                       00717100
DSGDATAE DS    0C        END OF DDSGATA                                 00717200
DSGDATA_LEN EQU *-DSGDATA                                               00717300
         ORG   ,                                                        00717400
*                                                                       00717500
* ********************************************************************  00717600
* * SMS VOLUME DEFINITION (RECORD TYPE 'VL')                            00717700
* ********************************************************************  00717800
*                                                                       00717900
*                                                                       00718000
         ORG   DCUDATA                                                  00718100
DVLDATA  DS    0X                                                       00718200
DVLNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                      00718300
         ORG   DVLNMFLD                                                 00718400
DVLNMLEN DS    1FL2      LENGTH OF NAME -- SHOULD BE                    00718500
DVLVSER  DS    1CL0006   VOLUME SERIAL NUMBER                           00718600
         DS    1CL0024   RESERVED FOR CONSISTENCY                       00718700
DVLUSER  DS    1CL0008   USERID OF LAST UPDATER                         00718800
DVLDATE  DS    1CL0010   DATE OF LAST UPDATE                            00718900
         DS    1CL0002   RESERVED                                       00719000
DVLTIME  DS    1CL0008   TIME OF LAST UPDATE                            00719100
*                                                                       00719200
*      ***************************************************************  00719300
*      *                                                             *  00719400
*      * NO DESC FOR VOLUME RECORD                                      00719500
*      * VOLUME RECORD FLAG INFORMATION                                 00719600
*      *                                                             *  00719700
*      ***************************************************************  00719800
*                                                                       00719900
*                                                                       00720000
DVLFLAGS DS    1CL0001   FLAGS AND RESERVED                             00720100
         ORG   DVLFLAGS                                                 00720200
DVLCONV  EQU   X'80'     1 = VOL IS IN CONVERSION                       00720300
         ORG   DVLFLAGS+X'00000001'                                     00720400
DVLFLGDC DS    1BL1      DCOLLECT FLGS                                  00720500
         ORG   DVLFLGDC                                                 00720600
DVL32NAM EQU   X'80'     0 = Use DVLNSTAT, DVLCSMSS                     00720700
*                                                                       00720800
*      ***************************************************************  00720900
*      *                                                             *  00721000
*      * 1 = Use DVLSSTAT                                               00721100
*      *                                                             *  00721200
*      ***************************************************************  00721300
*                                                                       00721400
*                                                                       00721500
         ORG   DVLFLGDC+X'00000001'                                     00721600
         DS    1CL0002   RESERVED                                       00721700
*                                                                       00721800
*      ***************************************************************  00721900
*      *                                                             *  00722000
*      * STORAGE GROUP ASSOCIATION AND STATUS INFORMATION               00722100
*      *                                                             *  00722200
*      ***************************************************************  00722300
*                                                                       00722400
*                                                                       00722500
DVLSG    DS    1CL0032   LENGTH AND NAME OF STORGRP                     00722600
         ORG   DVLSG                                                    00722700
DVLSGLEN DS    1FL2      LENGTH OF STORGRP NAME                         00722800
DVLSTGRP DS    1CL0030   STORAGE GROUP OF THIS VOLUME                   00722900
DVLNSTAT DS    1CL0002   STATUS BY SYSTEM                               00723000
         ORG   DVLNSTAT                                                 00723100
DVLSMSS  DS    1FL1      SMS STATUS                                     00723200
DVLMVSS  DS    1FL1      MVS STATUS                                     00723300
         ORG   DVLNSTAT+X'00000010'                                     00723400
DVLCSMSS DS    1FL1      CONFIRMED SMS STATUS FOR VOL                   00723500
*                                                                       00723600
*      ***************************************************************  00723700
*      *                                                             *  00723800
*      * VOLUME ATTRIBUTES                                              00723900
*      *                                                             *  00724000
*      ***************************************************************  00724100
*                                                                       00724200
*                                                                       00724300
         ORG   DVLCSMSS+X'00000008'                                     00724400
DVLNUCBA DS    1AL4      ADDRESS OF UCB IF KNOWN                        00724500
DVLNTCPY DS    1FL4      TOTAL CAPACITY IN MB                           00724600
DVLNFREE DS    1FL4      AMOUNT FREE SPACE IN MB                        00724700
DVLNLEXT DS    1FL4      LARGEST FREE EXTENT IN MB                      00724800
DVLN0CNT DS    1FL2      VOLUME LEVEL RESET COUNT                       00724900
DVLTRKSZ DS    1FL2      VOLUME R1 TRACK CAPACITY                       00725000
DVLNLEVL DS    1FL4      UPDATE LEVEL FOR VOLUME                        00725100
DVLSSTAT DS    1CL0008   System status array                            00725200
         ORG   DVLSSTAT                                                 00725300
DVLSTSMS DS    1FL1      SMS system status                              00725400
DVLSTMVS DS    1FL1      MVS system status                              00725500
DVLCNSMS DS    1FL1      Confirmed SMS status                           00725600
         DS    1CL0005   Reserved                                       00725700
         ORG   DVLSSTAT+X'00000100'                                     00725800
         DS    1CL0016   RESERVED                                       00725900
DVLDATAE DS    0C        ROUND TO DWORD BOUNDARY                        00726000
DVLDATA_LEN EQU *-DVLDATA                                               00726100
         ORG   ,                                                        00726200
*                                                                       00726300
* ********************************************************************  00726400
* * AGGREGATE GROUP DEFINITION (RECORD TYPE 'AG')                       00726500
* ********************************************************************  00726600
*                                                                       00726700
*                                                                       00726800
         ORG   DCUDATA                                                  00726900
DAGDATA  DS    0X                                                       00727000
DAGNMFLD DS    1CL0032   SPACE FOR NAME AND LENGTH                      00727100
         ORG   DAGNMFLD                                                 00727200
DAGNMLEN DS    1FL2      LENGTH OF NAME                                 00727300
DAGNAME  DS    1CL0030   NAME OF DATA CLASS                             00727400
DAGUSER  DS    1CL0008   USERID OF LAST UPDATER                         00727500
DAGDATE  DS    1CL0010   DATE OF LAST UPDATE                            00727600
         DS    1CL0002   RESERVED                                       00727700
DAGTIME  DS    1CL0008   TIME OF LAST UPDATE                            00727800
DAGDESC  DS    1CL0120   DESCRIPTION                                    00727900
*                                                                       00728000
*      ***************************************************************  00728100
*      *                                                             *  00728200
*      * AGGREGATE GROUP FLAG INFORMATION                               00728300
*      *                                                             *  00728400
*      ***************************************************************  00728500
*                                                                       00728600
*                                                                       00728700
DAGFLAGS DS    1BL1                                                     00728800
         ORG   DAGFLAGS                                                 00728900
DAGTENQ  EQU   X'80'     TOLERATE ENQ FAILURE, 1 = YES, 0 = NO          00729000
DAGFRET  EQU   X'40'     RETENTION PERIOD SPECIFIED, 1 = YES, 0 = NO    00729100
DAGFNCPY EQU   X'20'     NUMBER OF COPIES SPECIFIED, 1 = YES, 0 = NO    00729200
         ORG   DAGFLAGS+X'00000001'                                     00729300
         DS    1CL0003   RESERVED                                       00729400
*                                                                       00729500
*      ***************************************************************  00729600
*      *                                                             *  00729700
*      * AGGREGATE GROUP ATTRIBUTES                                     00729800
*      *                                                             *  00729900
*      ***************************************************************  00730000
*                                                                       00730100
*                                                                       00730200
DAGRETPD DS    1FL4      RETENTION PERIOD                               00730300
         ORG   DAGRETPD                                                 00730400
DAGEXPYR DS    1FL2      EXPIRATION YEAR                                00730500
DAGEXPDY DS    1FL2      ABSOLUTE DAY OF YEAR                           00730600
DAGDEST  DS    1CL0030   DESTINATION                                    00730700
DAGPREFX DS    1CL0033   OUTPUT DATA SET PREFIX                         00730800
         DS    1CL0001   RESERVED                                       00730900
DAGIDSNM DS    1CL0052   INSTRUCTION DATA SET NAME                      00731000
         ORG   DAGIDSNM                                                 00731100
DAGINDSN DS    1CL0044   DATA SET NAME                                  00731200
DAGINMEM DS    1CL0008   MEMBER NAME, IF ANY, OR BLANK                  00731300
DAGDSNMS DS    1CL0052   ARRAY OF DATA SET NAMES                        00731400
         ORG   DAGDSNMS                                                 00731500
DAGDSN   DS    1CL0044   DATA SET NAME                                  00731600
DAGMEM   DS    1CL0008   MEMBER NAME, IF ANY, OR BLANK                  00731700
         ORG   DAGDSNMS+X'00000104'                                     00731800
DAGMGMTC DS    1CL0032   MANAGEMENT CLASS                               00731900
         ORG   DAGMGMTC                                                 00732000
DAGMCLEN DS    1FL2      MANAGEMENT CLASS LENGTH                        00732100
DAGMCNAM DS    1CL0030   MANAGEMENT CLASS NAME                          00732200
DAGNCOPY DS    1FL4      NUMBER OF COPIES                               00732300
         DS    1CL0016   RESERVED                                       00732400
DAGDATAE DS    0C        END OF DAGDATA                                 00732500
DAGDATA_LEN EQU *-DAGDATA                                               00732600
         ORG   ,                                                        00732700
*                                                                       00732800
* ********************************************************************  00732900
* * SMS OPTICAL DRIVE DEFINITION (RECORD TYPE 'DR')                     00733000
* ********************************************************************  00733100
*                                                                       00733200
*                                                                       00733300
         ORG   DCUDATA                                                  00733400
DDRDATA  DS    0X                                                       00733500
DDRNMFLD DS    1CL0032   EXTENDED FOR CONSISTENCY                       00733600
         ORG   DDRNMFLD                                                 00733700
DDRDVLEN DS    1FL2      LENGTH OF NAME -- SHOULD BE                    00733800
DDRNAME  DS    1CL0030                                                  00733900
         ORG   DDRNAME                                                  00734000
DDRDNAME DS    1CL0008   DRIVE NAME                                     00734100
         DS    1CL0022   RESERVED FOR CONSISTENCY                       00734200
DDRDUSER DS    1CL0008   USERID OF LAST UPDATER                         00734300
DDRDDATE DS    1CL0010   DATE OF LAST UPDATE                            00734400
DDRFLAGS DS    1CL0001   Flags and reserved                             00734500
         ORG   DDRFLAGS                                                 00734600
DDR32NAM EQU   X'80'     0 = Use DDRNSTAT                               00734700
*                                                                       00734800
*      ***************************************************************  00734900
*      *                                                             *  00735000
*      * 1 = Use DDRSTAT                                                00735100
*      *                                                             *  00735200
*      ***************************************************************  00735300
*                                                                       00735400
*                                                                       00735500
         ORG   DDRFLAGS+X'00000001'                                     00735600
         DS    1CL0001   RESERVED                                       00735700
DDRDTIME DS    1CL0008   TIME OF LAST UPDATE                            00735800
*                                                                       00735900
*      ***************************************************************  00736000
*      *                                                             *  00736100
*      * LIBRARY NAME FIELDS                                            00736200
*      *                                                             *  00736300
*      ***************************************************************  00736400
*                                                                       00736500
*                                                                       00736600
DDRLB    DS    1CL0032   LENGTH AND NAME OF LIBRARY                     00736700
         ORG   DDRLB                                                    00736800
DDRLBLEN DS    1FL2      LENGTH OF LIBRARY NAME                         00736900
DDRLIBRY DS    1CL0030   LIBRARY FOR THIS DRIVE                         00737000
         ORG   DDRLIBRY                                                 00737100
DDRLBNM  DS    1CL0008   LIBRARY NAME                                   00737200
         DS    1CL0022   RESERVED                                       00737300
*                                                                       00737400
*      ***************************************************************  00737500
*      *                                                             *  00737600
*      * DRIVE STATUS BY SYSTEM                                         00737700
*      *                                                             *  00737800
*      ***************************************************************  00737900
*                                                                       00738000
*                                                                       00738100
DDRNSTAT DS    1CL0004   STATUS BY SYSTEM                               00738200
         ORG   DDRNSTAT                                                 00738300
DDROMST  DS    1CL0004   STATUS OF EACH DRIVE                           00738400
         ORG   DDROMST                                                  00738500
DDRSOUT  DS    1FL1      REQUESTED OAM STATUS                           00738600
DDRCFCS  DS    1FL1      CURRENT OAM STATUS                             00738700
         DS    1CL0002   RESERVED                                       00738800
         ORG   DDRNSTAT+X'00000020'                                     00738900
DDRDCONS DS    1FL4      CONSOLE ID                                     00739000
DDRSTAT  DS    1CL0008   System related data                            00739100
         ORG   DDRSTAT                                                  00739200
DDRSYSST DS    1CL0004   Status for this system                         00739300
         ORG   DDRSYSST                                                 00739400
DDRREQST DS    1FL1      Requested system status                        00739500
DDRCURST DS    1FL1      Current system status                          00739600
         DS    1CL0002   Reserved                                       00739700
         DS    1CL0004   Reserved                                       00739800
         ORG   DDRSTAT+X'00000100'                                      00739900
         DS    1CL0016   RESERVED                                       00740000
DDRDATAE DS    0C        END OF DDDRATA                                 00740100
DDRDATA_LEN EQU *-DDRDATA                                               00740200
         ORG   ,                                                        00740300
*                                                                       00740400
* ********************************************************************  00740500
* * SMS OPTICAL LIBRARY DEFINITION (RECORD TYPE 'LB')                   00740600
* ********************************************************************  00740700
*                                                                       00740800
*                                                                       00740900
         ORG   DCUDATA                                                  00741000
DLBDATA  DS    0X                                                       00741100
DLBNMFLD DS    1CL0032   EXTENDED FOR CONSISTENCY                       00741200
         ORG   DLBNMFLD                                                 00741300
DLBNMLEN DS    1FL2      LENGTH OF LIBRARY NAME                         00741400
DLBLNAME DS    1CL0030   LIBRARY NAME - LONG VERSION                    00741500
         ORG   DLBLNAME                                                 00741600
DLBNAME  DS    1CL0008   NAME OF OPTICAL LIBRARY                        00741700
         DS    1CL0022   RESERVED FOR CONSISTENCY                       00741800
DLBDUSER DS    1CL0008   USERID OF LAST UPDATER                         00741900
DLBDDATE DS    1CL0010   DATE OF LAST UPDATE                            00742000
DLBFLAGS DS    1CL0001   Reserved                                       00742100
         ORG   DLBFLAGS                                                 00742200
DLB32NAM EQU   X'80'     0 = Use DLBNSTAT                               00742300
*                                                                       00742400
*      ***************************************************************  00742500
*      *                                                             *  00742600
*      * 1 = Use DLBSTAT                                                00742700
*      *                                                             *  00742800
*      ***************************************************************  00742900
*                                                                       00743000
*                                                                       00743100
         ORG   DLBFLAGS+X'00000001'                                     00743200
         DS    1CL0005   Reserved                                       00743300
DLBDTIME DS    1CL0008   TIME OF LAST UPDATE                            00743400
*                                                                       00743500
*      ***************************************************************  00743600
*      *                                                             *  00743700
*      * OPTICAL LIBRARY STATUS BY SYSTEM                               00743800
*      *                                                             *  00743900
*      ***************************************************************  00744000
*                                                                       00744100
*                                                                       00744200
DLBNSTAT DS    1CL0004   STATUS BY SYSTEM                               00744300
         ORG   DLBNSTAT                                                 00744400
DLBOMST  DS    1CL0004   STATUS FOR EACH LIBRARY                        00744500
         ORG   DLBOMST                                                  00744600
DLBSOUT  DS    1FL1      REQUESTED OAM STATUS                           00744700
DLBCFCS  DS    1FL1      CURRENT OAM STATUS                             00744800
         DS    1CL0002   RESERVED                                       00744900
*                                                                       00745000
*      ***************************************************************  00745100
*      *                                                             *  00745200
*      * OPTICAL LIBRARY ATTRIBUTES                                     00745300
*      *                                                             *  00745400
*      ***************************************************************  00745500
*                                                                       00745600
*                                                                       00745700
         ORG   DLBNSTAT+X'00000020'                                     00745800
DLBTYPE  DS    1FL1      REAL OR PSEUDO LIBRARY                         00745900
         DS    1CL0002   RESERVED                                       00746000
DLBDTYPE DS    1FL1      LIBRARY DEVICE TYPE                            00746100
DLBDCONS DS    1FL4      CONSOLE ID                                     00746200
DLBEDVT  DS    1FL1      ENTRY DEFAULT USE ATTRIBUTE (TAPE ONLY)        00746300
DLBEJD   DS    1FL1      EJECT DEFAULT (TAPE ONLY)                      00746400
DLBLCBID DS    1CL0005   LIBRARY ID IN LIB.CONF.DB (TAPE ONLY)          00746500
         DS    1CL0001   RESERVED                                       00746600
DLBEDUNM DS    1CL0008   ENTRY DEFAULT UNIT NAME (TAPE ONLY)            00746700
DLBDEFDC DS    1CL0032   ENTRY DEFAULT DATA CLASS (TAPE ONLY)           00746800
         ORG   DLBDEFDC                                                 00746900
DLBDCLEN DS    1FL2      LENGTH OF ENTRY DEFAULT DC                     00747000
DLBDCLNM DS    1CL0030   DEFAULT DC LONG VERSION                        00747100
         ORG   DLBDCLNM                                                 00747200
DLBDCNAM DS    1CL0008   NAME OF ENTRY DEFAULT DC                       00747300
         DS    1CL0022   RESERVED FOR CONSISTENCY                       00747400
DLBSTAT  DS    1CL0008   System related data                            00747500
         ORG   DLBSTAT                                                  00747600
DLBSYSST DS    1CL0004   Status for this system                         00747700
         ORG   DLBSYSST                                                 00747800
DLBREQST DS    1FL1      Requested system status                        00747900
DLBCURST DS    1FL1      Current system status                          00748000
         DS    1CL0002   Reserved                                       00748100
         DS    1CL0004   Reserved                                       00748200
         ORG   DLBSTAT+X'00000100'                                      00748300
         DS    1CL0016   RESERVED                                       00748400
DLBDATAE DS    0C        END OF DLBDATA                                 00748500
DLBDATA_LEN EQU *-DLBDATA                                               00748600
         ORG   ,                                                        00748700
*                                                                       00748800
* ********************************************************************  00748900
* * SMS Cache Names Definition (Record Type 'CN')                       00749000
* ********************************************************************  00749100
*                                                                       00749200
*                                                                       00749300
         ORG   DCUDATA                                                  00749400
DCNDATA  DS    0X                                                       00749500
DCNCSNAM DS    1CL0008   Cache Set Name                                 00749600
DCNSESNM DS    1CL0016   SES Cache name                                 00749700
         ORG   DCNSESNM+X'00000080'                                     00749800
         DS    1CL0016   RESERVED                                       00749900
DCNDATAE DS    0C        END OF DCNDATA                                 00750000
DCNDATA_LEN EQU *-DCNDATA                                               00750100
         ORG   ,                                                        00750200
*                                                                       00750300
* ********************************************************************  00750400
* * SMS Accounting Information Definition  (Record Type 'AI')           00750500
* ********************************************************************  00750600
*                                                                       00750700
*                                                                       00750800
         ORG   DCUDATA                                                  00750900
DAIDATA  DS    0X                                                       00751000
DAIDRTN  DS    1CL0078   Data Class Routine                             00751100
         ORG   DAIDRTN                                                  00751200
DAIDDATE DS    1CL0010   Date last updated                              00751300
DAIDDSNM DS    1CL0044   Data set name where stored                     00751400
DAIDDSMR DS    1CL0008   Member name in data set                        00751500
DAIDSRID DS    1CL0008   Userid of last updater                         00751600
DAIDTIME DS    1CL0008   Time last updated                              00751700
DAIMRTN  DS    1CL0078   Manamgement Class Routine                      00751800
         ORG   DAIMRTN                                                  00751900
DAIMDATE DS    1CL0010   Date last updated                              00752000
DAIMDSNM DS    1CL0044   Data set name where stored                     00752100
DAIMDSMR DS    1CL0008   Member name in data set                        00752200
DAIMSRID DS    1CL0008   Userid of last updater                         00752300
DAIMTIME DS    1CL0008   Time last updated                              00752400
DAISRTN  DS    1CL0078   Storage Class Routine                          00752500
         ORG   DAISRTN                                                  00752600
DAISDATE DS    1CL0010   Date last updated                              00752700
DAISDSNM DS    1CL0044   Data set name where stored                     00752800
DAISDSMR DS    1CL0008   Member name in data set                        00752900
DAISSRID DS    1CL0008   Userid of last updater                         00753000
DAISTIME DS    1CL0008   Time last updated                              00753100
DAIGRTN  DS    1CL0078   Storage Group Routine                          00753200
         ORG   DAIGRTN                                                  00753300
DAIGDATE DS    1CL0010   Date last updated                              00753400
DAIGDSNM DS    1CL0044   Data set name where stored                     00753500
DAIGDSMR DS    1CL0008   Member name in data set                        00753600
DAIGSRID DS    1CL0008   Userid of last updater                         00753700
DAIGTIME DS    1CL0008   Time last updated                              00753800
         DS    1CL0016   Reserved                                       00753900
DAIDATAE DS    0C        end of DAIDATA                                 00754000
*                                                                       00754100
* ********************************************************************  00754200
* * VALUES FOR DCVPHYST - PHYSICAL STATUS OF VOLUME                  *  00754300
* ********************************************************************  00754400
*                                                                       00754500
*                                                                       00754600
DCVMANGD EQU   B'00000011' Volume is SMS managed                        00754700
DCVINITL EQU   B'00000001' In conversion to SMS                         00754800
DCVNMNGD EQU   B'00000000' Non SMS managed volume                       00754900
*                                                                       00755000
* ********************************************************************  00755100
* * VALUES FOR DCDRECFM - RECORD FORMAT                              *  00755200
* ********************************************************************  00755300
*                                                                       00755400
*                                                                       00755500
DCDRECFF EQU   B'10000000' Fixed length records                         00755600
DCDRECFV EQU   B'01000000' Variable length records                      00755700
DCDRECFU EQU   B'11000000' Undefined length records                     00755800
*                                                                       00755900
* ********************************************************************  00756000
* * CONSTANTS FOR DDCRBIAS RECORD ACCESS BIAS                           00756100
* ********************************************************************  00756200
*                                                                       00756300
*                                                                       00756400
DDCRABUS EQU   0         USER                                           00756500
DDCRABSY EQU   1         SYSTEM                                         00756600
*                                                                       00756700
* ********************************************************************  00756800
* * CONSTANTS FOR DDCRCORG                                              00756900
* ********************************************************************  00757000
*                                                                       00757100
*                                                                       00757200
DDCORGNL EQU   0         RECORG IS NULL - SAM                           00757300
DDCORGKS EQU   1         RECORG IS VSAM KSDS                            00757400
DDCORGES EQU   2         RECORG IS VSAM ESDS                            00757500
DDCORGRR EQU   3         RECORG IS VSAM RRDS                            00757600
DDCORGLS EQU   4         RECORG IS VSAM LDS                             00757700
*                                                                       00757800
* ********************************************************************  00757900
* * CONSTANTS FOR DDCRECFM                                              00758000
* ********************************************************************  00758100
*                                                                       00758200
*                                                                       00758300
DDCFMNUL EQU   0         RECFM IS NULL                                  00758400
DDCFMU   EQU   1         RECFM IS UNDEFINED                             00758500
DDCFMV   EQU   2         RECFM IS VARIABLE                              00758600
DDCFMVS  EQU   3         RECFM IS VARIABLE SPANNED                      00758700
DDCFMVB  EQU   4         RECFM IS VARIABLE BLOCKED                      00758800
DDCFMVBS EQU   5         RECFM IS VAR BLK SPANNED                       00758900
DDCFMF   EQU   6         RECFM IS FIXED                                 00759000
DDCFMFS  EQU   7         RECFM IS FIXED STANDARD                        00759100
DDCFMFB  EQU   8         RECFM IS FIXED BLOCKED                         00759200
DDCFMFBS EQU   9         RECFM IS FIXED BLK SPANND                      00759300
*                                                                       00759400
* ********************************************************************  00759500
* * CONSTANTS FOR DDCCNTL                                               00759600
* ********************************************************************  00759700
*                                                                       00759800
*                                                                       00759900
DDCCNTLA EQU   1         CARRIAGE CONTROL IS ANSI                       00760000
DDCCNTLM EQU   2         CARRIAGE CONTROL IS MACH                       00760100
DDCCNTLN EQU   3         CARRIAGE CONTROL IS NULL                       00760200
*                                                                       00760300
* ********************************************************************  00760400
* * CONSTANTS FOR DDCAVREC                                              00760500
* ********************************************************************  00760600
*                                                                       00760700
*                                                                       00760800
DDCBYTES EQU   1         AVGREC IS BYTES                                00760900
DDCKB    EQU   2         AVGREC IS KB                                   00761000
DDCMB    EQU   3         AVGREC IS MB                                   00761100
*                                                                       00761200
* ********************************************************************  00761300
* * CONSTANTS FOR DDCDSNTY                                              00761400
* ********************************************************************  00761500
*                                                                       00761600
*                                                                       00761700
DDCDSNUL EQU   0         DSN TYPE IS NULL                               00761800
DDCDSPDS EQU   1         DSN TYPE IS PDS                                00761900
DDCDSLIB EQU   2         DSN TYPE IS LIBRARY                            00762000
DDCDSHFS EQU   3         DSN TYPE IS HFS                                00762100
DDCDSEXR EQU   4         DSN TYP - EXTENDED(R)                          00762200
DDCDSEXC EQU   5         DSN TYP - EXTENDED(C)                          00762300
*                                                                       00762400
* ********************************************************************  00762500
* * CONSTANTS FOR DDCCOMP                                               00762600
* ********************************************************************  00762700
*                                                                       00762800
*                                                                       00762900
DDCCNUL  EQU   0         NULL COMPACTION TYPE                           00763000
DDCNOCMP EQU   1         NO COMPACTION                                  00763100
DDCIDRC  EQU   2         IMPROVED DATA RECORDING CAPABILITY,           *00763200
                         COMPACTION.                                    00763300
*                                                                       00763400
* ********************************************************************  00763500
* * CONSTANTS FOR DDCMEDIA                                              00763600
* ********************************************************************  00763700
*                                                                       00763800
*                                                                       00763900
DDCMENUL EQU   0         MEDIA TYPE IS NULL                             00764000
DDCMEDA1 EQU   1         MEDIA1 - CART. SYSTEM                          00764100
DDCMEDA2 EQU   2         MEDIA2 - ENHANCED CAPACITY CARTRIDGE SYSTEM   *00764200
                         TAPE                                           00764300
*                                                                       00764400
* ********************************************************************  00764500
* * CONSTANTS FOR DDCRECTE                                              00764600
* ********************************************************************  00764700
*                                                                       00764800
*                                                                       00764900
DDCRTNUL EQU   0         DDCRECTE IS NULL                               00765000
DDC18TRK EQU   1         DDCRECTE IS 18 TRACK                           00765100
DDC36TRK EQU   2         DDCRECTE IS 36 TRACK                           00765200
*                                                                       00765300
* ********************************************************************  00765400
* *                                                                  *  00765500
* * Constants for DDCBWOTP                                              00765600
* *                                                                  *  00765700
* ********************************************************************  00765800
*                                                                       00765900
*                                                                       00766000
DDCBWOCI EQU   1         BWO type CICS                                  00766100
DDCBWONO EQU   2         BWO type none                                  00766200
DDCBWOIM EQU   3         BWO type IMS                                   00766300
*                                                                       00766400
* ********************************************************************  00766500
* *                                                                  *  00766600
* * Constants for DDCLOGRC                                              00766700
* *                                                                  *  00766800
* ********************************************************************  00766900
*                                                                       00767000
*                                                                       00767100
DDCLOGNO EQU   1         non Recoverable sphere                         00767200
DDCLOGUN EQU   2         UNDO - use external log                        00767300
DDCLOGAL EQU   3         ALL - (UNDO) & forward                         00767400
*                                                                       00767500
* ********************************************************************  00767600
* *                                                                  *  00767700
* * Constants for DDCSPAND                                              00767800
* *                                                                  *  00767900
* ********************************************************************  00768000
*                                                                       00768100
*                                                                       00768200
DDCSPANN EQU   0         Record can not span CI                         00768300
DDCSPANY EQU   1         Record may span CI                             00768400
*                                                                       00768500
* ********************************************************************  00768600
* * CONSTANTS FOR DSCDIRB and DSCSEQB                                   00768700
* ********************************************************************  00768800
*                                                                       00768900
*                                                                       00769000
DSCBIADC EQU   0         BIAS = DON'T CARE                              00769100
DSCBIARD EQU   1         BIAS = READ                                    00769200
DSCBIAWR EQU   2         BIAS = WRITE                                   00769300
*                                                                       00769400
* ********************************************************************  00769500
* * CONSTANTS FOR DSCAVAIL                                              00769600
* ********************************************************************  00769700
*                                                                       00769800
*                                                                       00769900
DSCAVLDC EQU   0         AVAILABILITY = DON'T CARE (NO PREF)      @01C  00770000
DSCAVLST EQU   1         AVAILABILITY = STANDARD                        00770100
DSCAVLCN EQU   2         AVAILABILITY = CONTINUOUS                      00770200
DSCAVLPR EQU   3         AVAILABILITY = PREFERRED                 @01A  00770240
*                                                                       00770300
* ********************************************************************  00770400
* * CONSTANTS FOR DSCACCES                                              00770500
* ********************************************************************  00770600
*                                                                       00770700
*                                                                       00770800
DSCACCPR EQU   0         ACCESSIBILITY = CONTINUOUS PREFERRED           00770900
DSCACCRQ EQU   1         ACCESSIBILITY = CONTINUOUS                     00771000
DSCACCST EQU   2         ACCESSIBILITY = STANDARD                       00771100
DSCACCNP EQU   3         ACCESSIBILITY = NOPREF                         00771200
*                                                                       00771300
* ********************************************************************  00771400
* *  CONSTANTS FOR DMCRFMT                                              00771500
* ********************************************************************  00771600
*                                                                       00771700
*                                                                       00771800
DMCNULL  EQU   0         FIELD WAS NOT USED                             00771900
DMCFDATE EQU   1         EXPIRE FORM: DATE/CREATE                       00772000
DMCFDAYS EQU   2         EXPIRE FORM: DAYS/CREATE                       00772100
*                                                                       00772200
* ********************************************************************  00772300
* *  CONSTANTS FOR DMCCMAU                                              00772400
* ********************************************************************  00772500
*                                                                       00772600
*                                                                       00772700
DMCMNONE EQU   0         NO MIGRATION ALLOWED                           00772800
DMCMCMD  EQU   1         MIGR ON COMMAND ONLY                           00772900
DMCMBOTH EQU   2         AUTO MIGRAT OR ON CMD                          00773000
*                                                                       00773100
* ********************************************************************  00773200
* *  CONSTANTS FOR DMCBADU                                              00773300
* ********************************************************************  00773400
*                                                                       00773500
*                                                                       00773600
DMCBNONE EQU   0         NO USR OR ADMN BACKUP                          00773700
DMCBADM  EQU   1         ALLOW ADMIN CMD BACKUP                         00773800
DMCBBOTH EQU   2         ALLOW ADMN OR USR CMD                          00773900
*                                                                       00774000
* ********************************************************************  00774100
* *  CONSTANTS FOR DMCEXPAC                                             00774200
* ********************************************************************  00774300
*                                                                       00774400
*                                                                       00774500
DMCEANUL EQU   0         EXPIRE ACTION IS NULL                          00774600
DMCEADEL EQU   1         EXPIRE ACTION IS DEL                           00774700
DMCEAARC EQU   2         EXPIRE ACTION IS ARC                           00774800
*                                                                       00774900
* ********************************************************************  00775000
* *  CONSTANTS FOR DMCRLF                                               00775100
* ********************************************************************  00775200
*                                                                       00775300
*                                                                       00775400
DMCRLFYE EQU   B'10000000' PARTIAL RELEASE = YES, IMMEDIATE REL = NO    00775500
DMCRLFCN EQU   B'01000000' CONDITION PARTREL = YES, IMMEDIATE REL = NO  00775600
DMCRLFNO EQU   B'00000000' PARTIAL RELEASE = NO, IMMEDIATE REL = NO     00775700
DMCRLFYI EQU   B'10100000' PARTIAL RELEASE = YES, IMMEDIATE REL = YES   00775800
DMCRLFCI EQU   B'01100000' CONDITION PARTREL = YES, IMMED CON REL =    *00775900
                         YES                                            00776000
*                                                                       00776100
* ********************************************************************  00776200
* *  CONSTANTS FOR DMCCPYTC                                             00776300
* ********************************************************************  00776400
*                                                                       00776500
*                                                                       00776600
DMCCPYST EQU   0         STANDARD                                       00776700
DMCCPYPR EQU   1         CONCURRENT PREFERRED                           00776800
DMCCPYRQ EQU   2         CONCURRENT REQUIRED                            00776900
*                                                                       00777000
* ********************************************************************  00777100
* * CONSTANTS FOR DBCSTAT                                               00777200
* ********************************************************************  00777300
*                                                                       00777400
*                                                                       00777500
DBCVALID EQU   1         DATA SET IS VALID                              00777600
DBCINVAL EQU   2         DATA SET IS INVALID                            00777700
DBCUNKWN EQU   3         DATA SET STAT IS UNK.                          00777800
*                                                                       00777900
* ********************************************************************  00778000
* * CONSTANTS FOR DBCSYSNT AND DBCSNMTY                                 00778100
* ********************************************************************  00778200
*                                                                       00778300
*                                                                       00778400
DBCSYSNS EQU   0         NAME TYPE NOT SPECIFIED                        00778500
DBCSYSTM EQU   1         NAME TYPE IS SYSTEM NAME                       00778600
DBCSYSPL EQU   2         NAME TYPE IS SYSTEM GROUP NAME                 00778700
*                                                                       00778800
* ********************************************************************  00778900
* * CONSTANTS FOR DBCSYSFT                                              00779000
* ********************************************************************  00779100
*                                                                       00779200
*                                                                       00779300
DBCASMS  EQU   X'8000'   ACTIVE SMS                                     00779400
DBCPDSE  EQU   X'4000'   PDSE FEATURE                                   00779500
DBCCDMP  EQU   X'2000'   SAM COMPRESSION                                00779600
DBCSESC  EQU   X'1000'   SES CACHE FEATURE                              00779700
*                                                                       00779800
* ********************************************************************  00779900
* * CONSTANTS FOR DSGFTYPE                                              00780000
* ********************************************************************  00780100
*                                                                       00780200
*                                                                       00780300
DSGPOOL  EQU   0         STG GRP TYPE IS POOL                           00780400
DSGVIO   EQU   1         STG GRP TYPE IS VIO                            00780500
DSGDUMMY EQU   2         STG GRP TYPE IS DUMMY                          00780600
DSGOBJ   EQU   3         SG TYPE IS OBJECT                              00780700
DSGOBJBK EQU   4         SG TYPE IS OBJ BACKUP                          00780800
DSGTAPE  EQU   5         SG TYPE IS TAPE                                00780900
*                                                                       00781000
* ********************************************************************  00781100
* * CONSTANTS FOR DSGSTAT AND DSGSYSST                               *  00781200
* ********************************************************************  00781300
*                                                                       00781400
*                                                                       00781500
DSG0     EQU   0         NO STATUS SPECIFIED                            00781600
DSGENBL  EQU   1         STOR GRP IS ENABLED                            00781700
DSGQUI   EQU   2         STOR GRP QUIESCED/ALL                          00781800
DSGQUIN  EQU   3         STOR GRP QUIESCED/NEW                          00781900
DSGDIS   EQU   4         STOR GRP DISABLED/ALL                          00782000
DSGDISN  EQU   5         STOR GRP DISABLED/NEW                          00782100
*                                                                       00782200
* ********************************************************************  00782300
* * SMS STATUS - DVLSMSS AND DVLSTSMS                                   00782400
* ********************************************************************  00782500
*                                                                       00782600
*                                                                       00782700
DVL0     EQU   0         NO STATUS GIVEN                                00782800
DVLENBL  EQU   1         SMS STATUS IS ENABLED                          00782900
DVLQUI   EQU   2         SMS STAT QUIESCED/ALL                          00783000
DVLQUIN  EQU   3         SMS STAT QUIESCED/NEW                          00783100
DVLDIS   EQU   4         SMS STAT DISABLED/ALL                          00783200
DVLDISN  EQU   5         SMS STAT DISABLED/NEW                          00783300
*                                                                       00783400
* ********************************************************************  00783500
* * MVS STATUS - DVLMVSS AND DVLSTMVS                                   00783600
* ********************************************************************  00783700
*                                                                       00783800
*                                                                       00783900
DVLONLN  EQU   1         MVS STATUS IS ONLINE                           00784000
DVLOFFLN EQU   2         MVS STATUS IS OFFLINE                          00784100
DVLPOFF  EQU   3         MVS STATUS IS PENDING OFFLINE                  00784200
DVLBOXED EQU   4         MVS STATUS IS BOXED                            00784300
DVLNRDY  EQU   5         MVS STATUS IS NOT READY                        00784400
*                                                                       00784500
* ********************************************************************  00784600
* * MVS STATUS - DDRSOUT, DDRCFCS, DDRREQST AND DDRCURST                00784700
* ********************************************************************  00784800
*                                                                       00784900
*                                                                       00785000
DDRNOCON EQU   0         OAM STATUS IS NO CONNECTIVITY                  00785100
DDRONLN  EQU   1         OAM STATUS IS ONLINE                           00785200
DDROFFLN EQU   2         OAM STATUS IS OFFLINE                          00785300
DDRNORST EQU   3         NO OUTSTANDING REQUEST                         00785400
*                                                                       00785500
* ********************************************************************  00785600
* * MVS STATUS - DLBSOUT, DLBCFCS, DLBREQST, AND DLBCURST               00785700
* ********************************************************************  00785800
*                                                                       00785900
*                                                                       00786000
DLBNOCON EQU   0         OAM STATUS IS NO CONNECT                       00786100
DLBONLN  EQU   1         OAM STATUS IS ONLINE                           00786200
DLBOFFLN EQU   2         OAM STATUS IS OFFLINE                          00786300
DLBNORST EQU   3         NO OUTSTANDING REQUEST                         00786400
DLBLPENO EQU   4         LIBRARY PENDING OFLIN                          00786500
*                                                                       00786600
* ********************************************************************  00786700
* * TYPE OF LIBRARY - DLBTYPE                                           00786800
* ********************************************************************  00786900
*                                                                       00787000
*                                                                       00787100
DLBNOOPT EQU   0         NOT OPTICAL LIBRARY                            00787200
DLBREAL  EQU   1         REAL LIBRARY                                   00787300
DLBPSEUD EQU   2         PSEUDO LIBRARY                                 00787400
*                                                                       00787500
* ********************************************************************  00787600
* * TYPE OF LIBRARY DEVICE - DLBDTYPE                                   00787700
* ********************************************************************  00787800
*                                                                       00787900
*                                                                       00788000
DLBD9246 EQU   0         IBM 9246 LIBRARY                               00788100
DLBD3995 EQU   1         IBM 3995 LIBRARY                               00788200
DLBDTAPE EQU   2         TAPE LIBRARY                                   00788300
*                                                                       00788400
* ********************************************************************  00788500
* * ENTRY DEFAULT USE ATTRIBUTE- DLBEDVT(TAPE LIBRARY ONLY)             00788600
* ********************************************************************  00788700
*                                                                       00788800
*                                                                       00788900
DLBPRVT  EQU   1         PRIVATE VOLUME                                 00789000
DLBSCRT  EQU   2         SCRATCH VOLUME                                 00789100
*                                                                       00789200
* ********************************************************************  00789300
* * EJECT DEFAULT - DLBEJD                                              00789400
* ********************************************************************  00789500
*                                                                       00789600
*                                                                       00789700
DLBPURGE EQU   1         PURGE TCDB VOL RECORD                          00789800
DLBKEEP  EQU   2         KEEP TCDB VOL RECORD                           00789900
*                                                                       00790000
* ********************************************************************  00790100
* * VALUES FOR DCURCTYP - RECORD TYPE                                *  00790200
* ********************************************************************  00790300
*                                                                       00790400
*                                                                       00790500
DCUDATAT EQU   C'D '     DATA TYPE RECORD                               00790600
DCUASSOC EQU   C'A '     VSAM ASSOCIATION RECORD                        00790700
DCUVULUT EQU   C'V '     VOLUME TYPE RECORD                             00790800
DCUDCDEF EQU   C'DC'     DATA CLASS                                     00790900
DCUSCDEF EQU   C'SC'     STORAGE CLASS                                  00791000
DCUMCDEF EQU   C'MC'     MANAGMENT CLASS                                00791100
DCUBCDEF EQU   C'BC'     BASE CONFIG.                                   00791200
DCUSGDEF EQU   C'SG'     STORAGE GROUP                                  00791300
DCUVLDEF EQU   C'VL'     SMS VOLUME DEF                                 00791400
DCUAGDEF EQU   C'AG'     AGGREGATE GROUP                                00791500
DCUDRDEF EQU   C'DR'     OPTICAL DRIVE                                  00791600
DCULBDEF EQU   C'LB'     OPTICAL LIBRARY                                00791700
DCUCNDEF EQU   C'CN'     CACHE NAMES                                    00791800
DCUAIDEF EQU   C'AI'     ACS INFORMARTION                               00791900
DAIDATA_LEN EQU *-DAIDATA                                               00792000
         ORG   ,                                                        00792100
.L0002   ANOP                                                           00792200
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00792300
         AIF   ('&LIST' EQ 'YES').P4                                    00792400
.P3      ANOP                                                           00792500
         POP   PRINT                                                    00792600
.P4      ANOP                                                           00792700
.P_EXIT  ANOP                                                           00792800
         MEND                                                           00792900
**/ IDCDOUT_2:;                                                         00793000
* %IDCDOUT_INCLUDED = 'YES';                                            00793100
* %DCL ZCBPRINT CHAR EXT;                                               00793200
* %DEACTIVATE ZCBPRINT;                                                 00793300
* %DCL IDCDOUT_LIST CHAR EXT;                                           00793400
* %DEACTIVATE IDCDOUT_LIST;                                             00793500
* %IF IDCDOUT_LIST ^= 'NO' &                                            00793600
*    ZCBPRINT ^= 'NO' %THEN                                             00793700
*   %GOTO IDCDOUT_3;                                                    00793800
*   @LIST PUSH NOECHO;                                                  00793900
*   @LIST NOASSEMBLE NOECHO;                                            00794000
*   @LIST OFF C NOECHO;                                                 00794100
* %IDCDOUT_3:;                                                          00794200
*/* Start of PL/X Source                                             */ 00794300
*                                                                       00794400
* %END;                                                                 00794500
* %GOTO DCU_HDR1;          /*                                           00794600
*                          */                                           00794700
* %DCU_HDR1:                                                            00794800
* IF DCU_BASE = '' %THEN               /* CHECK & SET BASING ARGUMENT*/ 00794900
*    %DCU_BASE = 'BASED BDY(WORD)';    /*                            */ 00795000
*                                                                       00795100
*/********************************************************************/ 00795200
*/* HEADER PORTION OF DATA COLLECTION UTILITY OUTPUT RECORD. EACH    */ 00795300
*/* DATA SECTION IS PRECEDED BY THIS HEADER.                         */ 00795400
*/********************************************************************/ 00795500
*DECLARE                                                                00795600
* 1 DCUOUTH DCU_BASE,            /* DATA COLLECTION OUTPUT RECORD    */ 00795700
*   2 DCURDW     FIXED(31),      /* RECORD DESCRIPTOR WORD           */ 00795800
*     3 DCULENG    FIXED(15),    /* LENGTH OF THIS RECORD            */ 00800000
*     3 *          CHAR(2),      /* RESERVED                         */ 00810000
*   2 DCURCTYP   CHAR(2),        /* RECORD TYPE FOR THIS RECORD      */ 00820000
*   2 DCUVERS    FIXED(15),      /* VERSION                          */ 00830000
*   2 DCUSYSID   CHAR(4),        /* SYSTEM ID FOR THIS OPERATION     */ 00840000
*   2 DCUTMSTP,                  /* TIMESTAMP FIELD                  */ 00850000
*     3 DCUTIME  FIXED(32),      /* TIME IN SMF HEADER FORMAT        */ 00860000
*     3 DCUDATE  CHAR(4),        /* DATE IN SMF FORMAT (CCYYDDDF)    */ 00870000
*   2 *          CHAR(4),        /* RESERVED                         */ 00880000
*   2 DCUDATA    CHAR(0);        /* END OF HEADER SECTION            */ 00890000
*                                                                       00900000
* %DCL DCU_HEAD CHAR;            /* DCU_HEAD IS USED BY ARCUTILP TO  */ 00910000
* %DCU_HEAD = 'OMIT';            /* EXCLUDE HEADER IN THEIR MACRO    */ 00920000
* %                                                                     00930000
* IF DCU_HDR = 'YES'             /* INCLUDE HEADER DECLARE ONLY?     */ 00936600
*  & IDCDOUT_CBGEN ^= 'YES' %THEN  /* INCLUDE EVERYTHING?            */ 00943200
*    %GOTO DCU_OMIT;                                                    00950000
* %                                                                     00952500
* IF DCU_SMS = 'YES' %THEN       /* INCLUDE SMS RECORDS ONLY?@OY59794*/ 00955000
*    %GOTO DCU_SMSA;                                                    00957500
*/********************************************************************/ 00960000
*/* ACTIVE DATA SET INFORMATION (RECORD TYPE 'D')                    */ 00970000
*/********************************************************************/ 00980000
*DECLARE                                                                00990000
* 1 DCDADSI DEFINED(DCUDATA),    /* ACTIVE DATA SET INFORMATION         01000000
*                                   (DEFINED ON DCUDATA)             */ 01010000
*   2 DCDDSNAM CHAR(44),         /* DATA SET NAME                    */ 01020000
*   2 DCDERROR BIT(8),           /* ERROR INFORMATION FLAGS          */ 01030000
*     3 DCDEMNGD BIT(1),         /* SMS MANAGED INCONSISTENCY        */ 01040000
*     3 DCDEDVVR BIT(1),         /* DUPLICATE VVR FOUND              */ 01050000
*     3 DCDNOSPC BIT(1),         /* NO SPACE INFORMATION PROVIDED    */ 01060000
*     3 DCDVSAMI BIT(1),         /* VSAM INDICATORS INCONSISTENT     */ 01070000
*     3 DCDNOFM1 BIT(1),         /* NO FMT 1 DSCB FOR THIS DATA SET  */ 01080000
*     3 *        BIT(3),         /* RESERVED                         */ 01090000
*   2 DCDFLAG1 BIT(8),           /* INFORMATION FLAG #1              */ 01100000
*     3 DCDRACFD BIT(1),         /* DATA SET IS RACF DEFINED         */ 01110000
*     3 DCDSMSM  BIT(1),         /* SMS MANAGED DATA SET             */ 01120000
*     3 DCDTEMP  BIT(1),         /* TEMPORARY DATA SET               */ 01130000
*     3 DCDPDSE  BIT(1),         /* PARTITIONED DATA SET (EXTENDED)  */ 01140000
*     3 DCDGDS   BIT(1),         /* GENERATION DATA GROUP DATA SET   */ 01150000
*     3 DCDREBLK BIT(1),         /* DATA SET MAY BE REBLOCKED        */ 01160000
*     3 DCDCHIND BIT(1),         /* CHANGE INDICATOR                 */ 01170000
*     3 DCDCKDSI BIT(1),         /* CHECKPOINT DATA SET INDICATOR    */ 01180000
*   2 DCDFLAG2 BIT(8),           /* INFORMATION FLAG #2              */ 01190000
*     3 DCDNOVVR BIT(1),         /* NO VVR FOR THIS DATA SET         */ 01200000
*     3 DCDINTCG BIT(1),         /* DATA SET IS AN ICF CATALOG       */ 01210000
*     3 DCDINICF BIT(1),         /* DATA SET IS CATALOGED IN ICF CAT */ 01220000
*     3 *        BIT(1),         /* RESERVED                 @OY32626*/ 01223300
*     3 DCDALLFG BIT(1),         /* ALLOCATED SPACE RET'D    @OY32626*/ 01226600
*     3 DCDUSEFG BIT(1),         /* USED SPACE INFO RET'D    @OY32626*/ 01229900
*     3 DCDSECFG BIT(1),         /* SEC. SPACE INFO RET'D    @OY32626*/ 01233200
*     3 DCDNMBFG BIT(1),         /* UNUSEABLE SPACE RET'D    @OY32626*/ 01236500
*   2 DCDFLAG3 BIT(8),           /* INFORMATION FLAG #3          @LBA*/ 01238700
*     3 DCDPDSEX BIT(1),         /* POSIX FILE SYSTEM FILE       @LBA*/ 01243100
*     3 DCDSTRP  BIT(1),         /* EXTENDED FORMAT              @LBA*/ 01244300
*     3 DCDDDMEX BIT(1),         /* DDM INFO EXIST FOR THIS DS   @LDA*/ 01245600
*     3 *        BIT(5),         /* RESERVED                     @LDC*/ 01247000
*   2 *        CHAR(2),          /* reserved                     @LBC*/ 01248400
*   2 DCDDSORG BIT(16),          /* DATA SET ORGANIZATION            */ 01250000
*    3 DCDDSOR0 BIT(8),          /* DATA SET ORGANIZATION BYTE 0     */ 01258400
*     4 DCDDSGIS BIT(1),         /* IS - INDEXED SEQUENTIAL ORG      */ 01266800
*     4 DCDDSGPS BIT(1),         /* PS - PHYSICAL SEQUENTIAL ORG     */ 01275200
*     4 DCDDSGDA BIT(1),         /* DA - DIRECT ORGANIZATION         */ 01283600
*     4 *        BIT(3),         /* RESERVED                         */ 01292000
*     4 DCDDSGPO BIT(1),         /* PO - PARTITIONED ORGANIZATION    */ 01300400
*     4 DCDDSGU  BIT(1),         /* U  - UNMOVEABLE DATA SET         */ 01308800
*    3 DCDDSOR1 BIT(8),          /* DATA SET ORGANIZATION BYTE 1     */ 01317200
*     4 DCDDSGGS BIT(1),         /* GS - GRAPHICS ORGANIZATION       */ 01325600
*     4 *        BIT(3),         /* RESERVED                         */ 01334000
*     4 DCDDSGVS BIT(1),         /* VS - VSAM DATA SET               */ 01342400
*     4 *        BIT(3),         /* RESERVED                         */ 01350800
*   2 DCDRECRD BIT(8),           /* RECORD FORMAT BYTE               */ 01360000
*     3 DCDRECFM BIT(2),         /* RECORD FORMAT BITS               */ 01370000
*     3 DCDRECFT BIT(1),         /* TRACK OVERFLOW                   */ 01380000
*     3 DCDRECFB BIT(1),         /* BLOCKED RECORDS                  */ 01390000
*     3 DCDRECFS BIT(1),         /* STANDARD BLOCKS(F) OR SPANNED(V) */ 01400000
*     3 DCDRECFA BIT(1),         /* ANSI CONTROL CHARACTER           */ 01410000
*     3 DCDRECFC BIT(1),         /* MACHINE CONTROL CHARACTER        */ 01420000
*     3 *        BIT(1),         /* RESERVED                         */ 01430000
*   2 DCDNMEXT FIXED(8),         /* NUMBER OF EXTENTS USED           */ 01440000
*   2 DCDVOLSR CHAR(6),          /* VOLUME SERIAL NUMBER             */ 01450000
*   2 DCDBKLNG FIXED(15),        /* BLOCK LENGTH                     */ 01460000
*   2 DCDLRECL FIXED(15),        /* RECORD LENGTH                    */ 01470000
*   2 DCDALLSP FIXED(31),        /* SPACE ALLOCATED TO DATA SET      */ 01480000
*   2 DCDUSESP FIXED(31),        /* SPACE USED BY DATA SET           */ 01490000
*   2 DCDSCALL FIXED(31),        /* SECONDARY ALLOCATION             */ 01500000
*   2 DCDNMBLK FIXED(31),        /* # OF BYTES UNUSEABLE IN BLOCKS   */ 01510000
*   2 DCDCREDT CHAR(4),          /* CREATION DATE (YYYYDDDF)         */ 01520000
*   2 DCDEXPDT CHAR(4),          /* EXPIRATION DATE (YYYYDDDF)       */ 01530000
*   2 DCDLSTRF CHAR(4),          /* DATE LAST REFERENCED (YYYYDDDF)  */ 01540000
*   2 DCDDSSER CHAR(6),          /* DATA SET SERIAL NUMBER           */ 01550000
*   2 DCDVOLSQ CHAR(2),          /* VOLUME SEQUENCE NUMBER           */ 01560000
*   2 DCDLBKDT CHAR(8),          /* LAST BACKUP TIME & DATE          */ 01570000
*   2 DCDDCLAS,                                                         01580000
*     3 DCDDCLNG FIXED(15),      /* DATA CLASS NAME LENGTH           */ 01590000
*     3 DCDDATCL CHAR(30),       /* DATA CLASS NAME                  */ 01600000
*   2 DCDSCLAS,                                                         01610000
*     3 DCDSCLNG FIXED(15),      /* STORAGE CLASS NAME LENGTH        */ 01620000
*     3 DCDSTGCL CHAR(30),       /* STORAGE CLASS NAME               */ 01630000
*   2 DCDMCLAS,                                                         01640000
*     3 DCDMCLNG FIXED(15),      /* MANAGEMENT CLASS NAME LENGTH     */ 01650000
*     3 DCDMGTCL CHAR(30),       /* MANAGEMENT CLASS NAME            */ 01660000
*   2 DCDSTOGP,                                                         01670000
*     3 DCDSGLNG FIXED(15),      /* STORAGE GROUP NAME LENGTH        */ 01680000
*     3 DCDSTGRP CHAR(30),       /* STORAGE GROUP NAME               */ 01690000
*   2 DCDCCSID CHAR(2),          /* CODED CHAR SET IDENTIFIER    @LDA*/ 01692000
*   2 *        CHAR(2),          /* reserved                     @LDA*/ 01694000
*   2 DCDUDSIZ CHAR(8),          /* USER DATA SIZE               @LDA*/ 01696000
*   2 DCDCUDSZ CHAR(8),          /* COMPRESSED USER DATA SIZE    @LDA*/ 01698000
*   2 DCDEXFLG BIT(16),          /* COMPRESSION FLAGS       @XS_AM101*/ 01698600
*     3 DCDBDSZ  BIT(1),         /* INVALID DATA SIZES      @XS_AM101*/ 01699200
*   2 DCDSCNT  FIXED(16),        /* Stripe Count                 @LHC*/ 01699400
*   2 DCDOVERA FIXED(31),        /* OVER-ALLOCATED SPACE    @OW01826A*/ 01699600
*   2 DCDACCT  CHAR(32),         /* Account Information          @LGA*/ 01699700
*   2 *        CHAR(16),         /* RESERVED                     @LGA*/ 01699800
*   2 DCDADSIE CHAR(0);          /* END OF DCUDSET                   */ 01700000
*                                                                       01710000
*/********************************************************************/ 01720000
*/* VSAM BASE CLUSTER ASSOCIATION NAME (RECORD TYPE 'A')             */ 01730000
*/********************************************************************/ 01740000
*DECLARE                                                                01750000
* 1 DCASSOC DEFINED(DCUDATA),    /* VSAM BASE CLUSTER ASSOCIATIONS      01760000
*                                   (DEFINED ON DCUDATA)             */ 01770000
*   2 DCADSNAM CHAR(44),         /* DATA SET NAME                    */ 01780000
*   2 DCAASSOC CHAR(44),         /* BASE CLUSTER NAME                */ 01790000
*   2 DCAFLAG1 BIT(8),           /* VSAM INFORMATION FLAG #1         */ 01800000
*     3 DCAKSDS  BIT(1),         /* KEY SEQUENCED DATA SET           */ 01810000
*     3 DCAESDS  BIT(1),         /* ENTRY SEQUENCED DATA SET         */ 01820000
*     3 DCARRDS  BIT(1),         /* RELATIVE RECORD DATA SET         */ 01830000
*     3 DCALDS   BIT(1),         /* LINEAR DATA SET                  */ 01840000
*     3 DCAKRDS  BIT(1),         /* KEY RANGE DATA SET               */ 01850000
*     3 DCAAIX   BIT(1),         /* ALTERNATE INDEX DATA SET         */ 01860000
*     3 DCADATA  BIT(1),         /* VSAM DATA COMPONENT              */ 01870000
*     3 DCAINDEX BIT(1),         /* VSAM INDEX COMPONENT             */ 01880000
*   2 DCAFLAG2 BIT(8),           /* VSAM INFORMATION FLAG #2         */ 01890000
*     3 DCAKR1ST BIT(1),         /* 1ST SEGMENT OF KR DATA SET       */ 01900000
*     3 DCAIXUPG BIT(1),         /* ALTERNATE INDEX W/ UPGRADE       */ 01910000
*     3 DCAVRRDS BIT(1),         /* VARIABLE RRDS            @KC11064*/ 01916600
*     3 DCANSTAT BIT(1),         /* NO VSAM STATS IN RECORD      @LCA*/ 01921000
*     3 DCASRCI  BIT(1),         /* RBA is CI number             @LEA*/ 01923200
*     3 DCAG4G   BIT(1),         /* Extended Addressability      @LEA*/ 01925400
*     3 *        BIT(2),         /* RESERVED                     @LEC*/ 01927600
*   2 *        CHAR(2),          /* RESERVED                         */ 01930000
*   2 DCAHURBA FIXED(32),        /* HIGH USED RBA / CI           @LEC*/ 01930700
*   2 DCAHARBA FIXED(32),        /* HIGH ALLOCATED RBA / CI      @LEC*/ 01931400
*   2 DCANLR   FIXED(31),        /* NUMBER OF LOGICAL RECORDS    @LCA*/ 01932100
*   2 DCADLR   FIXED(31),        /* NUMBER OF DELETED RECORDS    @LCA*/ 01932800
*   2 DCAINR   FIXED(31),        /* NUMBER OF INSERTED RECORDS   @LCA*/ 01933500
*   2 DCAUPR   FIXED(31),        /* NUMBER OF UPDATED RECORDS    @LCA*/ 01934200
*   2 DCARTR   FIXED(31),        /* NUMBER OF RETRIEVED RECORDS  @LCA*/ 01934900
*   2 DCAASP   FIXED(31),        /* BYTES OF FREESPACE IN DS     @LCA*/ 01935600
*   2 DCACIS   FIXED(31),        /* NUMBER OF CI SPLITS          @LCA*/ 01936300
*   2 DCACAS   FIXED(31),        /* NUMBER OF CA SPLITS          @LCA*/ 01937000
*   2 DCAEXC   FIXED(31),        /* NUMBER OF EXCPS              @LCA*/ 01937700
*   2 DCARKP   FIXED(15),        /* RELATIVE KEY POSITION        @LCA*/ 01938400
*   2 DCAKLN   FIXED(15),        /* KEY LENGTH                   @LCA*/ 01939100
*   2 DCAHURBC CHAR(8),          /* HIGH USED RBA CALC FRM CI@OWXXXXX*/ 01939200
*   2 DCAHARBC CHAR(8),          /* HI ALLOC RBA CALC FRM CI @OWXXXXX*/ 01939300
*   2 DCACISZ  FIXED(31),        /* NUMBER BYTES IN A CI         @LJA*/ 01939400
*   2 DCACACI  FIXED(31),        /* NUMBER CI'S IN A CA          @LJA*/ 01939500
*   2 *        CHAR(16),         /* RESERVED                     @LGA*/ 01939600
*   2 DCASSOCE CHAR(0);          /* END OF DCASSOC                   */ 01940000
*                                                                       01950000
*/********************************************************************/ 01960000
*/* VOLUME INFORMATION (RECORD TYPE 'V')                             */ 01970000
*/********************************************************************/ 01980000
*DECLARE                                                                01990000
* 1 DCVVOLI DEFINED(DCUDATA),    /* VOLUME INFORMATION (DEFINED         02000000
*                                             ON DCUDATA)            */ 02010000
*   2 DCVVOLSR CHAR(6),          /* VOLUME SERIAL NUMBER             */ 02020000
*   2 DCVFLAG1 BIT(8),           /* INFORMATION FLAG #1              */ 02030000
*     3 DCVINXST BIT(2),         /* INDEX STATUS                     */ 02040000
*       4 DCVINXEX BIT(1),       /* INDEXED VTOC EXISTS              */ 02050000
*       4 DCVINXEN BIT(1),       /* INDEXED VTOC IS ENABLED          */ 02060000
*     3 DCVUSATR BIT(3),         /* USE ATTRIBUTE                    */ 02070000
*       4 DCVUSPVT BIT(1),       /*   PRIVATE                        */ 02080000
*       4 DCVUSPUB BIT(1),       /*   PUBLIC                         */ 02090000
*       4 DCVUSSTO BIT(1),       /*   STORAGE                        */ 02100000
*     3 DCVSHRDS BIT(1),         /* DEVICE IS SHAREABLE              */ 02110000
*     3 DCVPHYST BIT(2),         /* PHYSICAL STATUS                  */ 02120000
*   2 DCVERROR BIT(8),           /* ERROR INFORMATION FLAG           */ 02130000
*     3 DCVEVLCP BIT(1),         /* ERROR CALCULATING VOL CAPACITY   */ 02140000
*     3 DCVEBYTK BIT(1),         /* ERROR CALCULATING BYTES/TRK      */ 02150000
*     3 DCVELSPC BIT(1),         /* ERROR DURING LSPACE PROCESSING   */ 02160000
*     3 *        BIT(5),         /* RESERVED                         */ 02170000
*   2 *        CHAR(3),          /* RESERVED                         */ 02180000
*   2 DCVPERCT FIXED(8),         /* PERCENT FREESPACE ON VOLUME      */ 02190000
*   2 DCVFRESP FIXED(32),        /* FREESPACE ON VOLUME (IN KB)      */ 02200000
*   2 DCVALLOC FIXED(32),        /* ALLOCATED SPACE ON VOL (IN KB)   */ 02210000
*   2 DCVVLCAP FIXED(32),        /* TOTAL CAPACITY OF VOL (IN KB)    */ 02220000
*   2 DCVFRAGI FIXED(31),        /* FRAGMENTATION INDEX              */ 02230000
*   2 DCVLGEXT FIXED(32),        /* LARGEST FREE EXTENT ON VOLUME    */ 02240000
*   2 DCVFREXT FIXED(31),        /* NUMBER OF FREE EXTENTS           */ 02250000
*   2 DCVFDSCB FIXED(31),        /* FREE DSCBS IN VTOC               */ 02260000
*   2 DCVFVIRS FIXED(31),        /* FREE VIRS                        */ 02270000
*   2 DCVDVTYP CHAR(8),          /* DEVICE TYPE                      */ 02280000
*   2 DCVDVNUM FIXED(16),        /* DEVICE NUMBER                    */ 02290000
*   2 *        CHAR(2),          /* RESERVED                     @LJC*/ 02300000
*   2 DCVSTGGP,                                                         02310000
*     3 DCVSGLNG FIXED(15),      /* STORAGE GROUP NAME LENGTH        */ 02320000
*     3 DCVSGTCL CHAR(30),       /* STORAGE GROUP NAME               */ 02330000
*   2 DCVDPTYP CHAR(8),          /* PHYSICAL DEVICE TYPE         @LJA*/ 02332500
*   2 *        CHAR(16),         /* RESERVED                     @LGA*/ 02335000
*   2 DCVVOLIE CHAR(0);          /* END IF DCVVOLI                   */ 02340000
*                                                                       02350000
*%DCU_SMSA: ;                                                           02355000
*/********************************************************************/ 02360000
*/* DATA CLASS CONSTRUCT INFORMATION (RECORD TYPE 'DC')              */ 02360100
*/********************************************************************/ 02360200
*DECLARE                                                   /*@OY59794*/ 02360300
* 1 DDCDATA DEFINED(DCUDATA),/* DATA CLASS DEFINITION (DEFINED ON       02360400
*                                DCUDATA)                    @OY59794*/ 02360500
*   2 DDCNMFLD,              /* SPACE FOR NAME AND LENGTH    @OY59794*/ 02360600
*     3 DDCNMLEN FIXED(15),  /* LENGTH OF NAME               @OY59794*/ 02360700
*     3 DDCNAME  CHAR(30),   /* NAME OF DATA CLASS           @OY59794*/ 02360800
*   2 DDCUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/ 02360900
*   2 DDCDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/ 02361000
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/ 02361100
*   2 DDCTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/ 02361200
*   2 DDCDESC  CHAR(120),    /* DESCRIPTION                  @OY59794*/ 02361300
*                                                                       02361400
*   /*****************************************************************/ 02361500
*   /* DATA CLASS PARAMETERS SPECIFICATION BITS              @OY59794*/ 02361600
*   /*****************************************************************/ 02361700
*   2 DDCSPEC,                                             /*@OY59794*/ 02361800
*     3 DDCSPEC1 BIT(8),                                   /*@OY59794*/ 02361900
*       4 DDCFRORG BIT(1),   /* RECORG SPECIFIED FLAG        @OY59794*/ 02362000
*       4 DDCFLREC BIT(1),   /* LRECL SPECIFIED FLAG         @OY59794*/ 02362100
*       4 DDCFRFM  BIT(1),   /* RECFM SPECIFIED FLAG         @OY59794*/ 02362200
*       4 DDCFKLEN BIT(1),   /* KEYLEN SPECIFIED FLAG        @OY59794*/ 02362300
*       4 DDCFKOFF BIT(1),   /* KEYOFF SPECIFIED FLAG        @OY59794*/ 02362400
*       4 DDCFEXP  BIT(1),   /* EXPIRATION ATTRIB SPEC'D FLAG@OY59794*/ 02362500
*       4 DDCFRET  BIT(1),   /* RETENTION  ATTRIB SPEC'D FLAG@OY59794*/ 02362600
*       4 DDCFPSP  BIT(1),   /* PRIMARY SPACE SPECIFIED FLAG @OY59794*/ 02362700
*     3 DDCSPEC2 BIT(8),                                   /*@OY59794*/ 02362800
*       4 DDCFSSP  BIT(1),   /* SECONDARY SPACE SPEC'D FLAG  @OY59794*/ 02362900
*       4 DDCFDIR  BIT(1),   /* DIRECTORY BLOCKS SPEC'D FLAG @OY59794*/ 02363000
*       4 DDCFAUN  BIT(1),   /* ALLOCATION UNIT SPEC'D FLAG  @OY59794*/ 02363100
*       4 DDCFAVR  BIT(1),   /* AVGREC SPECIFIED FLAG        @OY59794*/ 02363200
*       4 DDCFVOL  BIT(1),   /* VOLUME CNT SPECIFIED FLAG    @OY59794*/ 02363300
*       4 DDCFCIS  BIT(1),   /* DATA CI SIZE SPECIFIED FLAG  @OY59794*/ 02363400
*       4 DDCFCIF  BIT(1),   /* FREE CI % SPECIFIED FLAG     @OY59794*/ 02363500
*       4 DDCFCAF  BIT(1),   /* FREE CA % SPECIFIED FLAG     @OY59794*/ 02363600
*     3 DDCSPEC3 BIT(8),                                   /*@OY59794*/ 02363700
*       4 DDCFXREG BIT(1),   /* SHAREOPT XREGION SPEC'D FLAG @OY59794*/ 02363800
*       4 DDCFXSYS BIT(1),   /* SHAREOPT XSYSTEM SPEC'D FLAG @OY59794*/ 02363900
*       4 DDCFIMBD BIT(1),   /* VSAM IMBED SPECIFIED FLAG    @OY59794*/ 02364000
*       4 DDCFRPLC BIT(1),   /* VSAM REPLICATE SPECIFIED FLAG@OY59794*/ 02364100
*       4 DDCFCOMP BIT(1),   /* COMPACTION SPECIFIED FLAG    @OY60048*/ 02364200
*       4 DDCFMEDI BIT(1),   /* MEDIA TYPE SPECIFIED FLAG    @OY60048*/ 02364300
*       4 DDCFRECT BIT(1),   /* RECORDING TECHNOLOGY FLAG    @OY60048*/ 02364400
*       4 DDCFVEA  BIT(1),   /* VSAM extended addressing         @LJC*/ 02364500
*                            /*   on = ext addr allowed          @LJA*/ 02364600
*     3 DDCSPEC4 BIT(8),        /*                               @LJC*/ 02364700
*       4 DDCSPRLF BIT(1),      /* Space Constraint Relief       @LJA*/ 02364800
*       4 DDCREDUS BIT(1),      /* Reduce Space by% specified    @LJA*/ 02364900
*       4 DDCRABS  BIT(1),      /* Rec Access Bias specified     @LJA*/ 02365000
*       4 *        BIT(5),      /* Reserved                      @LJA*/ 02365100
*                                                                       02365200
*   /*****************************************************************/ 02365300
*   /* DATA SET ATTRIBUTES                                   @OY59794*/ 02365400
*   /*****************************************************************/ 02365500
*   2 DDCRCORG FIXED(8),     /* DATA SET RECORG -- SEE CONST @OY59794*/ 02365600
*   2 DDCRECFM FIXED(8),     /* DATA SET RECFM -- SEE CONST  @OY59794*/ 02365700
*   2 DDCDSFLG BIT(8),                                     /*@OY59794*/ 02365800
*     3 DDCBLK   BIT(1),     /* 1 = BLOCKED, 0 = UNBLKED/NULL@OY59794*/ 02365900
*     3 DDCSTSP  BIT(1),     /* 1 = STANDARD OR SPANNED      @OY59794*/ 02366000
*     3 *        BIT(6),     /* RESERVED                     @OY59794*/ 02366100
*   2 DDCCNTL  FIXED(8),     /* CARRIAGE CONTROL - SEE CONST @OY59794*/ 02366200
*   2 DDCRETPD FIXED(31),    /* RETENTION PERIOD             @OY59794*/ 02366300
*     3 DDCEXPYR FIXED(15),  /* EXPDT - YEAR                 @OY59794*/ 02366400
*     3 DDCEXPDY FIXED(15),  /* EXPDT - ABSOLUTE DAY OF YEAR @OY59794*/ 02366500
*   2 DDCVOLCT FIXED(15),    /* MAXIMUM VOL COUNT FOR EXTEND @OY59794*/ 02366600
*   2 DDCDSNTY FIXED(16),    /* DSN TYPE -- SEE CONSTANTS    @OY59794*/ 02366700
*                                                                       02366800
*   /*****************************************************************/ 02366900
*   /* DATA SET SPACE ATTRIBUTES                             @OY59794*/ 02367000
*   /*****************************************************************/ 02367100
*   2 DDCSPPRI FIXED(31),    /* PRIMARY SPACE AMOUNT         @OY59794*/ 02367200
*   2 DDCSPSEC FIXED(31),    /* SECONDARY SPACE AMOUNT       @OY59794*/ 02367300
*   2 DDCDIBLK FIXED(31),    /* DIRECTORY BLOCKS             @OY59794*/ 02367400
*   2 DDCAVREC FIXED(8),     /* AVGREC - M, K, U: SEE CONST  @OY59794*/ 02367500
*   2 DDCREDUC FIXED(8),     /* Reduce primary or secondary      @LJA*/ 02367600
*                            /* space by 0-99%. DDCSPRLF         @LJA*/ 02367700
*                            /* and DDCREDUS must be on          @LJA*/ 02367800
*   2 DDCRBIAS FIXED(8),     /* VSAM Record Access Bias          @LJA*/ 02367900
*                            /* REQUIRES DDCRABS             @K140275*/ 02368000
*                            /* SEE CONSTANTS                    @LJA*/ 02368100
*   2 *        CHAR(1),      /* RESERVED                         @LJC*/ 02368200
*   2 DDCAUNIT FIXED(31),    /* ALLOCATION UNIT AMOUNT       @OY59794*/ 02368300
*   2 DDCBSZLM CHAR(4),      /* BlockSize Limit              @OW44468*/ 02368400
*   2 DDCLRECL FIXED(31),    /* RECORD LENGTH                @OY59794*/ 02368500
*                                                                       02368600
*   /*****************************************************************/ 02368700
*   /* VSAM ATTRIBUTES                                       @OY59794*/ 02368800
*   /*****************************************************************/ 02368900
*   2 DDCCISZ  FIXED(31),    /* CISIZE FOR KS, ES OR RR      @OY59794*/ 02369000
*   2 DDCFRSP,               /* FREESPACE                    @OY59794*/ 02369100
*     3 DDCCIPCT FIXED(15),  /* CI FREESPACE %               @OY59794*/ 02369200
*     3 DDCCAPCT FIXED(15),  /* CA FREESPACE %               @OY59794*/ 02369300
*   2 DDCSHROP FIXED(15),    /* VSAM SHARE OPTIONS           @OY59794*/ 02369400
*     3 DDCXREG  FIXED(8),   /* VSAM XREGION SHARE OPTIONS   @OY59794*/ 02369500
*     3 DDCXSYS  FIXED(8),   /* VSAM XSYSTEM SHARE OPTIONS   @OY59794*/ 02369600
*   2 DDCVINDX BIT(8),       /* VSAM SHARE OPTIONS           @OY59794*/ 02369700
*     3 DDCIMBED BIT(1),     /* 1 = IMBED, 0 = NO            @OY59794*/ 02369800
*     3 DDCREPLC BIT(1),     /* 1 = REPLICATE, 0 = NO        @OY59794*/ 02369900
*     3 *        BIT(6),     /* RESERVED                     @OY59794*/ 02370000
*   2 DDCKLEN  FIXED(8),     /* VSAM KEY LENGTH              @OY59794*/ 02370100
*   2 DDCKOFF  FIXED(15),    /* VSAM KEY OFFSET              @OY59794*/ 02370200
*   2 DDCCAMT  FIXED(8),     /* VSAM candidate amount        @K131799*/ 02370300
*   2 *        CHAR(1),      /* RESERVED                         @LHC*/ 02370400
*                                                                       02370500
*   /*****************************************************************/ 02370600
*   /* MOUNTABLE DEVICE ATTRIBUTES                           @OY60048*/ 02370700
*   /*****************************************************************/ 02370800
*   2 DDCCOMP  FIXED(8),     /* COMPACTION TYPE - SEE                   02370900
*                                CONSTANTS                   @OY60048*/ 02371000
*   2 DDCMEDIA FIXED(8),     /* MEDIA TYPE -- SEE CONSTANTS  @OY60048*/ 02371100
*   2 DDCRECTE FIXED(8),     /* RECORDING TECHNOLOGY --SEE              02371200
*                                CONSTANTS BELOW             @OY60048*/ 02371300
*   2 *        CHAR(1),      /* RESERVED                     @OY60048*/ 02371400
*                                                                       02371500
*   /*****************************************************************/ 02371600
*   /* RLS SUPPORT                                               @LJA*/ 02371700
*   /*****************************************************************/ 02371800
*   2 DDCRLS1,             /* RLS SUPPORT                        @LJA*/ 02371900
*    3 DDCBWOTP FIXED(8),  /* BWO TYPE REQUIRES DDCBWOS          @LJA*/ 02372000
*                          /* SEE CONSTANTS                      @LJA*/ 02372100
*    3 DDCLOGRC FIXED(8),  /* SPHERE RECOVERABILITY              @LJA*/ 02372200
*                          /* REQUIRES DDCLOGRS                  @LJA*/ 02372300
*                          /* SEE CONSTANTS                      @LJA*/ 02372400
*    3 DDCSPAND FIXED(8),  /* RECORD SPANS CI ABILITY            @LJA*/ 02372500
*                          /* REQUIRES DDCSPANS                  @LJA*/ 02372600
*                          /* SEE CONSTANTS                      @LJA*/ 02372700
*    3 *        FIXED(8),  /* RESERVED                           @LJA*/ 02372800
*   2 DDCLOGNM,            /* LOG STREAM ID                      @LJA*/ 02372900
*                          /* REQUIRES DDCLSIDS              @K140275*/ 02373000
*    3  DDCLOGLN FIXED(15), /* ID LENGTH                         @LJA*/ 02373100
*    3  DDCLOGID CHAR(26),  /* ID                                @LJA*/ 02373200
*   /*****************************************************************/ 02373300
*   /* DATA CLASS PARAMETERS SPECIFICATION BITS ADDITIONAL   @K140275*/ 02373400
*   /*****************************************************************/ 02373500
*   2 DDCSPECX,            /*                                @K140275*/ 02373600
*    3 DDCSPECA BIT(8),    /* ADDITONAL SPECIFICATION FLAGS  @K140275*/ 02373700
*     4 DDCBWOS  BIT(1),    /* BWO SPECIFIED                 @K140275*/ 02373800
*     4 DDCLOGRS BIT(1),    /* SPHERE RECOVERABILITY SPEC'D  @K140275*/ 02373900
*     4 DDCSPANS BIT(1),    /* CI SPAN SPECIFIED             @K140275*/ 02374000
*     4 DDCLSIDS BIT(1),    /* LOGSTREAMID SPECIFIED         @K140275*/ 02374100
*     4 *        BIT(4),    /* RESERVED                      @K140275*/ 02374200
*   2 *        CHAR(3),      /* RESERVED                     @K140275*/ 02374300
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/ 02374400
*   2 DDCDATAE CHAR(0);      /* END OF DDCDATA               @K131951*/ 02374500
*                                                                       02374600
*/********************************************************************/ 02374700
*/* STORAGE CLASS CONSTRUCT INFORMATION (RECORD TYPE 'SC')   @OY59794*/ 02374800
*/********************************************************************/ 02374900
*DECLARE                                                   /*@OY59794*/ 02375000
* 1 DSCDATA DEFINED(DCUDATA), /* STORAGE CLASS DEFINITION               02375100
*                                (DEFINED ON DCUDATA)        @OY59794*/ 02375200
*   2 DSCNMFLD,               /* SPACE FOR NAME AND LENGTH   @OY59794*/ 02375300
*     3 DSCNMLEN FIXED(15),   /* LENGTH OF NAME              @OY59794*/ 02375400
*     3 DSCNAME CHAR(30),     /* NAME OF STORAGE CLASS       @OY59794*/ 02375500
*   2 DSCUSER CHAR(8),        /* USERID OF LAST UPDATER      @OY59794*/ 02375600
*   2 DSCDATE CHAR(10),       /* DATE OF LAST UPDATE         @OY59794*/ 02375700
*   2 *       CHAR(2),        /* RESERVED                    @OY59794*/ 02375800
*   2 DSCTIME CHAR(8),        /* TIME OF LAST UPDATE         @OY59794*/ 02375900
*   2 DSCDESC CHAR(120),      /* DESCRIPTION                 @OY59794*/ 02376000
*                                                                       02376100
*   /*****************************************************************/ 02376200
*   /* STORAGE CLASS FLAGS                                   @OY59794*/ 02376300
*   /*****************************************************************/ 02376400
*   2 DSCFLAGS BIT(8),                                     /*@OY59794*/ 02376500
*     3 DSCDFGSP BIT(1),      /* GUARANTEED SPACE 1=YES,0=NO @OY59794*/ 02376600
*     3 DSCDFAVL BIT(1),      /* AVAILABILITY, 1=SEE DSCAVAIL           02376700
*                                0=STANDARD (DEFAULT)        @OY59794*/ 02376800
*     3 DSCFDIRR BIT(1),      /* DIRECT RESPONSE TIME OBJECT,           02376900
*                                0=DON'T CARE, 1=SEE DSCDIRR @OY59794*/ 02377000
*     3 DSCFDIRB BIT(1),      /* DIRECT BIAS, 0= DON'T CARE             02377100
*                                1= SEE DSCDIRB              @OY59794*/ 02377200
*     3 DSCFSEQR BIT(1),      /* SEQ. RESPONSE TIME OBJECTIVE,          02377300
*                                0=DON'T CARE, 1=SEE DSCSEQR @OY59794*/ 02377400
*     3 DSCFSEQB BIT(1),      /* SEQ. BIAS, 0= DON'T CARE               02377500
*                                1= SEE DSCSEQB              @OY59794*/ 02377600
*     3 DSCSYNCD BIT(1),      /* SYNCDEV, 1 = YES, 0 = NO    @OY59794*/ 02377700
*     3 DSCFIAD  BIT(1),      /* 1 = INITIAL ACCESS RESPONSE @OY59794*/ 02377800
*   2 DSCFLAG2 BIT(8),                                     /*@OY60048*/ 02377900
*     3 DSCDFACC BIT(1),      /* ACCESSIBILITY,1=SEE DSCACCES           02378000
*                             0=DEFAULT=CONTINUOUS PREFERRED @OY60048*/ 02378100
*     3 DSCDFSDR BIT(1),      /* STRIPING SUSTAINED DATA RATE           02378200
*                                 0=NOT SPECD,1=SEE DSCSTSDR @OY60048*/ 02378300
*     3 DSCFDCFW BIT(1),      /* Direct CF weight specified:            02378400
*                                1 = YES 0 = NO                  @LHA*/ 02378500
*     3 DSCFSCFW BIT(1),      /* Sequential weight specified:           02378600
*                                1 = YES 0 = NO                  @LHA*/ 02378700
*     3 *        BIT(4),      /* RESERVED                        @LGC*/ 02378800
*   2 *        CHAR(2),       /* RESERVED                    @OY60048*/ 02378900
*                                                                       02379000
*   /*****************************************************************/ 02379100
*   /* STORAGE CLASS ATTRIBUTES                              @OY59794*/ 02379200
*   /*****************************************************************/ 02379300
*   2 DSCAVAIL FIXED(8),      /* AVAILABILITY OPTIONS        @OY59794*/ 02379400
*   2 DSCDIRB  FIXED(8),      /* DIRECT BIAS - SEE CONSTANTS @OY59794*/ 02379500
*   2 DSCSEQB  FIXED(8),      /* SEQ. BIAS - SEE CONSTANTS   @OY59794*/ 02379600
*   2 DSCACCES FIXED(8),      /* ACCESSIBILITY - SEE CONSTS. @OY60048*/ 02379700
*   2 DSCIACDL FIXED(31),     /* INITIAL ACCESS RESPONSE SEC @OY59794*/ 02379800
*   2 DSCDIRR  FIXED(31),     /* MICROSECOND RESPONSE TIME              02379900
*                                OBJECTIVE -- DIRECT         @OY59794*/ 02380000
*   2 DSCSEQR  FIXED(31),     /* MICROSECOND RESPONSE TIME              02380100
*                                OBJECTIVE -- SEQUENTIAL     @OY59794*/ 02380200
*   2 DSCSTSDR FIXED(31),     /* STRIPING SUSTAIND DATA RATE @OY60048*/ 02380300
*                                                                       02380400
*   2 DSCCCHST CHAR(32) BDY(HWORD),  /* Cache Set Name           @LHA*/ 02380500
*    3 DSCCSLEN FIXED(15),    /* Cache Set Name Length           @LHA*/ 02380600
*    3 DSCCSNAM CHAR(30),     /* Cache Set Name value            @LHA*/ 02380700
*   2 DSCDIRCW FIXED(15),     /* Direct CF weight                @LHA*/ 02380800
*   2 DSCSEQCW FIXED(15),     /* Sequential CF weight            @LHA*/ 02380900
*   2 *        CHAR(16),      /* RESERVED                    @OY60048*/ 02381000
*   2 DSCDATAE CHAR(0);       /* END OF DSCDATA              @OY59794*/ 02381100
*                                                                       02381200
*/********************************************************************/ 02381300
*/* MANAGEMENT CLASS CONSTRUCT INFORMATION (RECORD TYPE 'MC')@OY59794*/ 02381400
*/********************************************************************/ 02381500
*DECLARE                                                   /*@OY59794*/ 02381600
* 1 DMCDATA  DEFINED(DCUDATA), /* MANAGEMENT CLASS DEFINITION           02381700
*                                 (DEFINED ON DCUDATA)       @OY59794*/ 02381800
*   2 DMCNMFLD,                /* SPACE FOR NAME AND LENGTH  @OY59794*/ 02381900
*     3 DMCNMLEN FIXED(15),    /* LENGTH OF NAME             @OY59794*/ 02382000
*     3 DMCNAME  CHAR(30),     /* NAME OF MANAGEMENT CLASS   @OY59794*/ 02382100
*   2 DMCUSER  CHAR(8),        /* USERID OF LAST UPDATER     @OY59794*/ 02382200
*   2 DMCDATE  CHAR(10),       /* DATE OF LAST UPDATE        @OY59794*/ 02382300
*   2 *        CHAR(2),        /* RESERVED                   @OY59794*/ 02382400
*   2 DMCTIME  CHAR(8),        /* TIME OF LAST UPDATE        @OY59794*/ 02382500
*   2 DMCDESC  CHAR(120),      /* DESCRIPTION                @OY59794*/ 02382600
*   /*****************************************************************/ 02382700
*   /* GENERAL SPECIFICATION FLAGS                           @OY59794*/ 02382800
*   /*****************************************************************/ 02382900
*   2 DMCSPEC1 BIT(8),         /* ATTRIBUTE SPECIFIED FLAGS:            02383000
*                                  1= SPECIFIED              @OY59794*/ 02383100
*     3 DMCFBVER BIT(1),       /* DMCBKVS SPECIFIED FLAG     @OY59794*/ 02383200
*     3 DMCFBVRD BIT(1),       /* DMCBVRD SPECIFIED FLAG     @OY59794*/ 02383300
*     3 DMCFRBK  BIT(1),       /* DMCBKDY SPECIFIED FLAG     @OY59794*/ 02383400
*     3 DMCFRNP  BIT(1),       /* DMCBKNP SPECIFIED FLAG     @OY59794*/ 02383500
*     3 DMCFEXDT BIT(1),       /* DMCEXDAT SPECIFIED FLAG    @OY59794*/ 02383600
*     3 DMCFEXDY BIT(1),       /* DMCEXPDY SPECIFIED FLAG    @OY59794*/ 02383700
*     3 DMCFPRDY BIT(1),       /* DMCPRDY SPECIFIED FLAG     @OY59794*/ 02383800
*     3 *        BIT(1),       /* RESERVED                   @OY59794*/ 02383900
*   2 DMCSPEC2 BIT(8),         /* ATTRIBUTE SPECIFIED FLAGS:            02384000
*                                  1= SPECIFIED              @OY59794*/ 02384100
*     3 DMCFL1DY BIT(1),       /* DMCL1DY SPECIFIED FLAG     @OY59794*/ 02384200
*     3 DMCFRLMG BIT(1),       /* DMCRLOMG SPECIFIED FLAG    @OY59794*/ 02384300
*     3 DMCFPELE BIT(1),       /* DMCPELEM SPECIFIED FLAG    @OY59794*/ 02384400
*     3 DMCFBKFQ BIT(1),       /* DMCBKFQ SPECIFIED FLAG     @OY59794*/ 02384500
*     3 *        BIT(4),       /* RESERVED                   @OY59794*/ 02384600
*                                                                       02384700
*   /*****************************************************************/ 02384800
*   /* PARTIAL RELEASE CRITERIA                              @OY59794*/ 02384900
*   /*****************************************************************/ 02385000
*   2 DMCRLF   BIT(8),                                     /*@OY59794*/ 02385100
*     3 DMCPREL  BIT(1),       /* RELEASE 1 = YES, 0 = NO    @OY59794*/ 02385200
*     3 DMCPRCN  BIT(1),       /* CONDITIONAL PARTREL        @OY59794*/ 02385300
*     3 DMCPRIM  BIT(1),       /* IMMEDIATE VALUE FOR REL    @OY59794*/ 02385400
*     3 *        BIT(5),       /* RESERVED                   @OY59794*/ 02385500
*   2 *        CHAR(1),        /* RESERVED                   @OY59794*/ 02385600
*                                                                       02385700
*   /*****************************************************************/ 02385800
*   /* GENERATION DATA GROUP CRITERIA                        @OY59794*/ 02385900
*   /*****************************************************************/ 02386000
*   2 DMCGDGFL BIT(8),         /* GDG ATTRIBUTE FLAGS        @OY59794*/ 02386100
*     3 DMCRLOMG BIT(1),       /* MIGRATE OR EXPIRE ROLLED OFF          02386200
*                                 GDS, 1=MIGRATE, 0=EXPIRE   @OY59794*/ 02386300
*     3 *        BIT(7),       /* RESERVED                   @OY59794*/ 02386400
*   2 *        CHAR(1),        /* RESERVED                   @OY59794*/ 02386500
*   2 DMCPELEM FIXED(15),      /* NUM GDG ELEMENTS ON PRIMARY@OY59794*/ 02386600
*                                                                       02386700
*   /*****************************************************************/ 02386800
*   /* DATA SET EXPIRATION CRITERIA                          @OY59794*/ 02386900
*   /*****************************************************************/ 02387000
*   2 DMCEXPF  BIT(8),         /* FLAGS                      @OY59794*/ 02387100
*     3 DMCARNOL BIT(1),       /* DMCRDARC IS NOLIMIT = 1    @OY59794*/ 02387200
*     3 *        BIT(7),       /* RESERVED                   @OY59794*/ 02387300
*   2 DMCEXPAC FIXED(8),       /* EXPIRE ACTION: SEE CONST   @OY59794*/ 02387400
*   2 DMCRDARC FIXED(15),      /* RETAIN DAYS ARCHIVE COPY   @OY59794*/ 02387500
*                                                                       02387600
*   /*****************************************************************/ 02387700
*   /* DATA SET RETENTION CRITERIA                           @OY59794*/ 02387800
*   /*****************************************************************/ 02387900
*   2 DMCRETF  BIT(8),         /* DATA SET RETENTION FLAGS   @OY59794*/ 02388000
*     3 DMCDYNOL BIT(1),       /* 1=EXPIRE AFTER DAYS= NOLIMIT          02388100
*                                  ELSE 0 AND SEE DMCEXPDY   @OY59794*/ 02388200
*     3 DMCDTNOL BIT(1),       /* 1=EXPIRE AFTER DATE= NOLIMIT          02388300
*                                  ELSE 0 AND SEE DMCEXDAT   @OY59794*/ 02388400
*     3 *        BIT(6),       /* RESERVED                   @OY59794*/ 02388500
*   2 DMCRFMT  FIXED(8),       /* Format used for DMCEXDAT --           02388600
*                                 DATE OR DAYS: SEE CONSTANTS@OY59794*/ 02388700
*   2 *        CHAR(2),        /* RESERVED                   @OY59794*/ 02388800
*   2 DMCEXPDY FIXED(31),      /* EXPIRE AFTER DAYS NO USE   @OY59794*/ 02388900
*   2 DMCEXDAT FIXED(31),      /* EXPIRE DAYS SINCE CREATE   @OY59794*/ 02389000
*     3 DMCEYEAR FIXED(16),    /* EXPIRE DATE SINCE CREATE   @OY59794*/ 02389100
*     3 DMCEDAY  FIXED(16),    /* SEE DMCRFMT FOR FORMAT     @OY59794*/ 02389200
*                                                                       02389300
*   /*****************************************************************/ 02389400
*   /* DATA SET MIGRATION CRITERIA                           @OY59794*/ 02389500
*   /*****************************************************************/ 02389600
*   2 DMCMIGF  BIT(8),         /* DATA SET MIGRATION FLAGS   @OY59794*/ 02389700
*     3 *        BIT(1),       /* RESERVED                   @OY59794*/ 02389800
*     3 *        BIT(1),       /* RESERVED                   @OY59794*/ 02389900
*     3 DMCL1NOL BIT(1),       /* MIN DAYS ON LEVEL 1/LAST USE,         02390000
*                                 1=NOLIMIT ELSE SEE DMCL1DY @OY59794*/ 02390100
*     3 *        BIT(5),       /* RESERVED                   @OY59794*/ 02390200
*   2 *        CHAR(1),        /* RESERVED                   @OY59794*/ 02390300
*   2 DMCPRDY  FIXED(15),      /* MIN DAYS ON PRIM/LAST USE  @OY59794*/ 02390400
*   2 DMCL1DY  FIXED(15),      /* MIN DAYS ON LVL 1/LAST USE @OY59794*/ 02390500
*   2 DMCCMAU  FIXED(8),       /* COMMAND OR AUTO MIGRATE --            02390600
*                                  SEE CONSTANTS BELOW       @OY59794*/ 02390700
*   2 *        CHAR(1),        /* RESERVED                   @OY59794*/ 02390800
*                                                                       02390900
*   /*****************************************************************/ 02391000
*   /* DATA SET BACKUP CRITERIA                              @OY59794*/ 02391100
*   /*****************************************************************/ 02391200
*   2 DMCBKFLG BIT(8),         /* BACKUP FLAGS               @OY59794*/ 02391300
*     3 DMCRBNOL BIT(1),       /*1=>RETAIN DAYS ONLY BACKUP VERS=       02391400
*                                   NOLIMIT. 0=>SEE DMCBKNP FOR         02391500
*                                   DAYS TO KEEP ONLY BACKUP @OY59794*/ 02391600
*     3 DMCNPNOL BIT(1),       /*1=>RETAIN DAYS EXTRA BACKUP VERS       02391700
*                                  = NOLIMIT. 0=>SEE DMCBKDY FOR        02391800
*                                  DAYS TO KEEP EXTRA BACKUP @OY59794*/ 02391900
*     3 *        BIT(1),       /* RESERVED                   @OY59794*/ 02392000
*     3 DMCAUTBK BIT(1),       /* 1=AUTO BACKUP ALLOWED      @OY59794*/ 02392100
*     3 DMCCPYTF BIT(1),       /* COPY TECHNIQUE, 1=SEE DMCCPYTC        02392200
*                                  0=DEFAULT=STANDARD        @OY60048*/ 02392300
*     3 *        BIT(3),       /* RESERVED                   @OY60048*/ 02392400
*   2 *        CHAR(3),        /* RESERVED                   @OY59794*/ 02392500
*   2 DMCBKFQ  FIXED(15),      /* BACKUP FREQUENCY           @OY59794*/ 02392600
*   2 DMCBKVS  FIXED(15),      /* NUMBER OF BACKUP VERSIONS  @OY59794*/ 02392700
*   2 DMCBVRD  FIXED(15),      /* NUM OF VERSIONS: DS DELETED@OY59794*/ 02392800
*   2 DMCBKDY  FIXED(15),      /* DAYS TO KEEP BACKUP VERSION@OY59794*/ 02392900
*   2 DMCBKNP  FIXED(15),      /* DAYS TO KEEP ONLY BACKUP   @OY59794*/ 02393000
*   2 DMCBADU  FIXED(8),       /* ALLOW ADMIN OR USER BACKUP --         02393100
*                                 SEE CONSTANTS BELOW        @OY59794*/ 02393200
*   2 DMCCPYTC FIXED(8),       /* COPY TECHNIQUE - SEE CONSTANTS        02393300
*                                                            @OY60048*/ 02393400
*   2 DMCBKUDC CHAR(8),        /* BACKUP DESTINATION CLASS   @OY59794*/ 02393500
*                                                                       02393600
*   /*****************************************************************/ 02393700
*   /* MAXIMUM RETENTION CRITERIA                            @OY59794*/ 02393800
*   /*****************************************************************/ 02393900
*   2 DMCMRETF BIT(8),         /* MAXIMUM RETENTION FLAGS    @OY59794*/ 02394000
*     3 DMCRPNOL BIT(1),       /* RETPD (RETAIN PD) 1=NOLIMIT           02394100
*                                 ELSE SEE DMCMRTDY          @OY59794*/ 02394200
*     3 *        BIT(7),       /* RESERVED                   @OY59794*/ 02394300
*   2 *        CHAR(1),        /* RESERVED                   @OY59794*/ 02394400
*   2 DMCMRTDY FIXED(15),      /* MAXIMUM DAYS TO RETAIN     @OY59794*/ 02394500
*                                                                       02394600
*   /*****************************************************************/ 02394700
*   /* CLASS TRANSITION CRITERIA                             @OY59794*/ 02394800
*   /*****************************************************************/ 02394900
*   2 DMCTSCR  BIT(8),         /*TIME SINCE CREATION FLAGS.  @OY59794*/ 02395000
*     3 DMCTCYR  BIT(1),       /* YEARS SPECIFIED.           @OY59794*/ 02395100
*     3 DMCTCMN  BIT(1),       /* MONTHS SPECIFIED.          @OY59794*/ 02395200
*     3 DMCTCDY  BIT(1),       /* DAYS SPECIFIED.            @OY59794*/ 02395300
*     3 *        BIT(5),       /* RESERVED.                  @OY59794*/ 02395400
*   2 DMCTSLU  BIT(8),         /*TIME SINCE LAST USED FLAGS. @OY59794*/ 02395500
*     3 DMCTSYR  BIT(1),       /* YEARS SPECIFIED.           @OY59794*/ 02395600
*     3 DMCTSMN  BIT(1),       /* MONTHS SPECIFIED.          @OY59794*/ 02395700
*     3 DMCTSDY  BIT(1),       /* DAYS SPECIFIED.            @OY59794*/ 02395800
*     3 *        BIT(5),       /* RESERVED.                  @OY59794*/ 02395900
*   2 DMCPERD  BIT(8),         /* PERIODIC FLAGS.            @OY59794*/ 02396000
*     3 DMCPEMN  BIT(1),       /* MONTHLY SPECIFIED.         @OY59794*/ 02396100
*     3 DMCPEQD  BIT(1),       /* QUARTERLY ON DAY SPEC.     @OY59794*/ 02396200
*     3 DMCPEQM  BIT(1),       /* QUARTERLY ON MONTH SPEC.   @OY59794*/ 02396300
*     3 DMCPEYD  BIT(1),       /* YEARLY ON DAY SPEC.        @OY59794*/ 02396400
*     3 DMCPEYM  BIT(1),       /* YEARLY IN MONTH SPEC.      @OY59794*/ 02396500
*     3 DMCFIRST BIT(1),       /* FIRST DAY OF PERIOD SPEC.  @OY59794*/ 02396600
*     3 DMCLAST  BIT(1),       /* LAST DAY OF PERIOD SPEC.   @OY59794*/ 02396700
*     3 *        BIT(1),       /* RESERVED.                  @OY59794*/ 02396800
*   2 *          CHAR(1),      /* RESERVED.                  @OY59794*/ 02396900
*   2 DMCVSCR,                 /* TIME SINCE CREATION VALUES @OY59794*/ 02397000
*     3 DMCVSCY  FIXED(15),    /* TIME SINCE CREATION YEARS  @OY59794*/ 02397100
*     3 DMCVSCM  FIXED(15),    /* TIME SINCE CREATION MONTHS @OY59794*/ 02397200
*     3 DMCVSCD  FIXED(15),    /* TIME SINCE CREATION DAYS   @OY59794*/ 02397300
*   2 DMCVSLU,                 /* TIME SINCE LAST USED       @OY59794*/ 02397400
*     3 DMCVSUY  FIXED(15),    /* TIME SINCE LAST USED YEARS @OY59794*/ 02397500
*     3 DMCVSUM  FIXED(15),    /* TIME SINCE LAST USED MONTHS@OY59794*/ 02397600
*     3 DMCVSUD  FIXED(15),    /* TIME SINCE LAST USED DAYS  @OY59794*/ 02397700
*   2 DMCVPRD  FIXED(15),      /* PERIODIC VALUES            @OY59794*/ 02397800
*   2 DMCVPMD  FIXED(15),      /* PERIODIC MONTHLY ON DAY    @OY59794*/ 02397900
*   2 DMCVPQT,                 /* PERIODIC QUARTERLY VALUES. @OY59794*/ 02398000
*     3 DMCVPQD  FIXED(15),    /* PERIODIC QUARTERLY ON DAY  @OY59794*/ 02398100
*     3 DMCVPQM  FIXED(15),    /* PERIODIC QUARTERLY IN MONTH@OY59794*/ 02398200
*   2 DMCVPYR,                 /* PERIODIC YEARLY VALUES.    @OY59794*/ 02398300
*     3 DMCVPYD  FIXED(15),    /* PERIODIC YEARLY ON DAY     @OY59794*/ 02398400
*     3 DMCVPYM  FIXED(15),    /* PERIODIC YEARLY IN MONTH   @OY59794*/ 02398500
*                                                                       02398600
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/ 02398700
*   2 DMCDATAE CHAR(0);        /* END OF DMCDATA             @OY59794*/ 02398800
*                                                                       02398900
*/********************************************************************/ 02399000
*/* BASE CONFIGURATION INFORMATION (RECORD TYPE 'BC')        @OY59794*/ 02399100
*/********************************************************************/ 02399200
*DECLARE                                                   /*@OY59794*/ 02399300
* 1 DBCDATA DEFINED(DCUDATA),/* BASE CONFIGURATION INFORMATION          02399400
*                                (DEFINED ON DCUDATA)        @OY59794*/ 02399500
*   2 *        CHAR(32),     /* RESERVED                     @OY59794*/ 02399600
*   2 DBCUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/ 02399700
*   2 DBCDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/ 02399800
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/ 02399900
*   2 DBCTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/ 02400000
*   2 DBCDESC  CHAR(120),    /* DESCRIPTION                  @OY59794*/ 02400100
*                                                                       02400200
*   /*****************************************************************/ 02400300
*   /* BASE CONFIGURATION FLAGS                              @OY59794*/ 02400400
*   /*****************************************************************/ 02400500
*   2 DBCFLAGS BIT(8),       /* Reserved                     @OW20434*/ 02400600
*   2 DBCFLGDC   BIT(8),     /* DCOLLECT flags               @OW20434*/ 02400700
*     3 DBC32NAM BIT(1),     /* 0 = use DBCFSYSN             @OW20434*/ 02400800
*                            /* 1 = use DBCSYSDT             @OW20434*/ 02400900
*     3 *        BIT(7),     /* Reserved                     @OW20434*/ 02401000
*   2 *        CHAR(2),      /* RESERVED                     @OW20434*/ 02401100
*                                                                       02401200
*   /*****************************************************************/ 02401300
*   /* BASE CONFIGURATION DEFAULTS                           @OY59794*/ 02401400
*   /*****************************************************************/ 02401500
*   2 DBCDEFMC,              /* DEFAULT MANAGEMENT CLASS     @OY59794*/ 02401600
*     3 DBCMCLEN FIXED(15),  /* DEFAULT MC LENGTH OF NAME    @OY59794*/ 02401700
*     3 DBCMCNAM CHAR(30),   /* DEFAULT MANAGEMENT CLASS NAME@OY59794*/ 02401800
*   2 DBCDGEOM BDY(WORD),    /* DEFAULT DEVICE GEOMETRY      @OY59794*/ 02401900
*     3 DBCTRKSZ FIXED(31),  /* TRACK SIZE IN BYTES          @OY59794*/ 02402000
*     3 DBCCYLCP FIXED(31),  /* CYL CAPACITY (TRK/CYL)       @OY59794*/ 02402100
*   2 DBCDUNIT CHAR(8),      /* DEFAULT UNIT                 @OY59794*/ 02402200
*                                                                       02402300
*   /*****************************************************************/ 02402400
*   /* BASE CONFIGURATION INFORMATION                        @OY59794*/ 02402500
*   /*****************************************************************/ 02402600
*   2 DBCSRST CHAR(8),       /* SMS RESOURCE STATUS TOKEN    @OY59794*/ 02402700
*   2 DBCSTAT FIXED(8),      /* DATA SET STATUS -- SEE CONST @OY59794*/ 02402800
*   2 *      CHAR(3),        /* RESERVED                     @OY59794*/ 02402900
*   2 DBCFSYSN(8) CHAR(8),   /* SYSTEM NAMES                 @OY59794*/ 02403000
*   2 DBCSCDSN  CHAR(44),    /* FOR ACDS ONLY: NAME OF SCDS             02403100
*                               FROM WHICH IT WAS ACTIVATED  @OY59794*/ 02403200
*                                                                       02403300
*   /*****************************************************************/ 02403400
*   /* SYSTEM FEATURES                                       @OY59794*/ 02403500
*   /*****************************************************************/ 02403600
*   2 DBCSFEAT(8) CHAR(2),   /* SUPPORTED SYSTEM FEATURES    @OY59794*/ 02403700
*   2 DBCSYSNT(8) FIXED(8),  /* TYPE OF SYSTEM NAMES -                  02403800
*                                 SEE CONSTANTS              @OW02196*/ 02403900
*   2 DBCSYSDT(32),          /* System related data              @LMA*/ 02404000
*     3 DBCSYSNM CHAR(8),    /* System/group name                @LMA*/ 02404100
*     3 DBCSYSFT CHAR(2),    /* Supported system features        @LMA*/ 02404200
*     3 *        CHAR(2),    /* Reserved                     @K131753*/ 02404300
*     3 DBCSNMTY FIXED(8),   /* System name type for this entry         02404400
*                               see constants                @K131753*/ 02404500
*     3 *        CHAR(3),    /* Reserved                     @K131753*/ 02404600
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/ 02404700
*   2 DBCDATAE CHAR(0);      /* END OF DBCDATA               @OY59794*/ 02404800
*                                                                       02404900
*/********************************************************************/ 02405000
*/* STORAGE GROUP CONSTRUCT INFORMATION (RECORD TYPE 'SG')   @OY59794*/ 02405100
*/********************************************************************/ 02405200
*DECLARE                                                   /*@OY59794*/ 02405300
* 1 DSGDATA DEFINED(DCUDATA),/* STORAGE GROUP DEFINITION                02405400
*                                (DEFINED ON DCUDATA)        @OY59794*/ 02405500
*   2 DSGNMFLD,              /* SPACE FOR NAME AND LENGTH    @OY59794*/ 02405600
*     3 DSGNMLEN FIXED(15),  /* LENGTH OF NAME               @OY59794*/ 02405700
*     3 DSGNAME  CHAR(30),   /* NAME OF DATA CLASS           @OY59794*/ 02405800
*   2 DSGUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/ 02405900
*   2 DSGDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/ 02406000
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/ 02406100
*   2 DSGTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/ 02406200
*   2 DSGDESC  CHAR(120),    /* DESCRIPTION                  @OY59794*/ 02406300
*                                                                       02406400
*   /*****************************************************************/ 02406500
*   /* STORAGE GROUP FLAG INFORMATION                        @OY59794*/ 02406600
*   /*****************************************************************/ 02406700
*   2 DSGFLAGS CHAR(1),      /* FLAGS AND RESERVED           @OY59794*/ 02406800
*     3 DSGFABUP BIT(1),     /* HSM AUTO BACKUP, 1=YES,0=NO  @OY59794*/ 02406900
*     3 DSGFAMIG BIT(1),     /* AUTO MIGRATION, 1=YES, 0=NO  @OY59794*/ 02407000
*     3 DSGFADMP BIT(1),     /* AUTO DUMP, 1 = YES, 0 = NO   @OY59794*/ 02407100
*     3 DSGFTHRS BIT(1),     /* THRESHOLDS SPECIFIED:                   02407200
*                               1 = YES, 0 = NO              @OY59794*/ 02407300
*     3 DSGFGBKU BIT(1),     /* GUARANTEED BACKUP FREQ.                 02407400
*                               SPECIFIED, 1=YES, 0=NO       @OY59794*/ 02407500
*     3 DSGGBNOL BIT(1),     /* GUARANTEED BACKUP FREQ.                 02407600
*                               1=NOLIMIT, 0=SEE DSGGBKUF    @OY59794*/ 02407700
*     3 DSGFIMIG BIT(1),     /* INTERVAL MIGRATION                      02407800
*                                 1 = YES 0 = NO             @OY59794*/ 02407900
*     3 DSGFPSM  BIT(1),     /* PRIMARY SPACE MGMT           @OW20434*/ 02408000
*                            /* 1 = YES 0 = NO               @OW20434*/ 02408100
*   2 DSGFLGDC BIT(8),       /* RESERVED                     @OW20434*/ 02408200
*     3 DSG32NAM BIT(1),     /* 0 = Use DSGFPRST, DSGCNFRM   @OW20434*/ 02408300
*                            /* 1 = Use DSGSSTAT             @OW20434*/ 02408400
*   2 *        CHAR(2),      /* RESERVED                     @OW20434*/ 02408500
*                                                                       02408600
*   /*****************************************************************/ 02408700
*   /* STORAGE GROUP ATTRIBUTES                              @OY59794*/ 02408800
*   /*****************************************************************/ 02408900
*   2 DSGFTYPE FIXED(8),     /* STORAGE GROUP TYPE -- SEE               02409000
*                               CONSTANTS BELOW              @OY59794*/ 02409100
*   2 DSGFHTHR FIXED(8),     /* HIGH THRESHOLD - 0 TO 99 %   @OY59794*/ 02409200
*   2 DSGFLTHR FIXED(8),     /* LOW THRESHOLD - 0 TO 99 %    @OY59794*/ 02409300
*   2 *        CHAR(1),      /* RESERVED                     @OY59794*/ 02409400
*   2 DSGFVMAX FIXED(31),    /* VIO MAX DATA SET SIZE        @OY59794*/ 02409500
*   2 DSGFVUNT CHAR(4),      /* VIO UNIT TYPE                @OY59794*/ 02409600
*   2 DSGDMPCL(5) CHAR(8),   /* DUMP CLASSES FOR AUTODUMP    @OY59794*/ 02409700
*   2 DSGFPRST(8),           /* STATUS BY PROCESSOR          @OY59794*/ 02409800
*     3 DSGSTAT FIXED(8),    /* STATUS                       @OY59794*/ 02409900
*   2 DSGABSYS CHAR(8),      /* AUTO BACKUP SYSTEM           @OY59794*/ 02410000
*   2 DSGADSYS CHAR(8),      /* AUTO DUMP SYSTEM             @OY59794*/ 02410100
*   2 DSGAMSYS CHAR(8),      /* AUTO MIGRATE SYSTEM          @OY59794*/ 02410200
*   2 DSGCNFRM(8),           /* CONFIRMED SMS STATUS FOR THIS           02410300
*                               STORAGE GROUP -- SEE CONSTANT@OY59794*/ 02410400
*     3 DSGCSMSS FIXED(8),   /* CONFIRMED SMS STATUS         @OY59794*/ 02410500
*   2 DSGGBKUF FIXED(31),    /* GUARANTEED BACKUP FREQ.      @OY59794*/ 02410600
*                                                                       02410700
*   /*****************************************************************/ 02410800
*   /* STORAGE GROUP OAM ATTRIBUTES                          @OY59794*/ 02410900
*   /*****************************************************************/ 02411000
*   2 DSGTBLGR CHAR(7),      /*OAM TABLE SPACE ID GROUPNN    @OY59794*/ 02411100
*   2 *        CHAR(1),      /* RESERVED                     @OY59794*/ 02411200
*   2 DSGOAMFL BIT(8),       /* OAM FLAGS                    @OY59794*/ 02411300
*     3 DSGFCYS  BIT(1),     /* OAM CYCLE START/END  GIVEN   @OY59794*/ 02411400
*     3 DSGFVLFT BIT(1),     /* VOLUME FULL THRESHOLD BIT    @OY59794*/ 02411500
*     3 DSGFDRST BIT(1),     /* DRIVE START THRESHOLD BIT    @OY59794*/ 02411600
*     3 DSGVFFER BIT(1),     /* VOLUME FULL@WRITE ERR GIVEN  @OY59794*/ 02411700
*     3 DSGVFERR BIT(1),     /* VOLUME FULL@WRITE ERROR BIT  @OY59794*/ 02411800
*     3 *        BIT(3),     /* RESERVED                     @OY59794*/ 02411900
*   2 *        CHAR(1),      /* RESERVED                     @OY59794*/ 02412000
*   2 DSGCYLST FIXED(8),     /* OAM CYCLE START TIME (HRS)   @OY59794*/ 02412100
*   2 DSGCYLED FIXED(8),     /* OAM CYCLE END TIME (HRS)     @OY59794*/ 02412200
*   2 DSGVOLFT FIXED(15),    /* VOLUME FULL THRESHOLD BIT    @OY59794*/ 02412300
*   2 DSGDRVST FIXED(15),    /* DRIVE START THRESHOLD BIT    @OY59794*/ 02412400
*   2 DSGOLIBS (8),          /* OPTICAL LIBRARIES.           @OY59794*/ 02412500
*     3 DSGOLBNL FIXED(15),  /* OPTICAL LIBRARY NAME LENGTH  @OY59794*/ 02412600
*     3 DSGOLBNM CHAR(8),    /* OPTICAL LIBRARY NAME         @OY59794*/ 02412700
*     3 *        CHAR(22),   /* RESERVED                     @OY59794*/ 02412800
*   2 DSGSSTAT(32),          /* Status by processor              @LMA*/ 02412900
*     3 DSGSYSST FIXED(8),   /* Requested system status          @LMA*/ 02413000
*     3 DSGCNSMS FIXED(8),   /* Confirmed SMS status             @LMA*/ 02413100
*     3 *        CHAR(6),    /* Reserved                         @LMA*/ 02413200
*                                                                       02413300
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/ 02413400
*   2 DSGDATAE CHAR(0);      /* END OF DDSGATA               @OY59794*/ 02413500
*                                                                       02413600
*/********************************************************************/ 02413700
*/* SMS VOLUME DEFINITION (RECORD TYPE 'VL')                 @OY59794*/ 02413800
*/********************************************************************/ 02413900
*DECLARE                                                   /*@OY59794*/ 02414000
* 1 DVLDATA DEFINED(DCUDATA),/* SMS VOLUME DEFINITION (DEFINED          02414100
*                                ON DCUDATA)                 @OY59794*/ 02414200
*   2 DVLNMFLD,              /* SPACE FOR NAME AND LENGTH    @OY59794*/ 02414300
*     3 DVLNMLEN FIXED(15),  /* LENGTH OF NAME -- SHOULD BE 6@OY59794*/ 02414400
*     3 DVLVSER  CHAR(6),    /* VOLUME SERIAL NUMBER         @OY59794*/ 02414500
*     3 *        CHAR(24),   /* RESERVED FOR CONSISTENCY     @OY59794*/ 02414600
*   2 DVLUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/ 02414700
*   2 DVLDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/ 02414800
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/ 02414900
*   2 DVLTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/ 02415000
*                            /* NO DESC FOR VOLUME RECORD    @OY59794*/ 02415100
*                                                                       02415200
*   /*****************************************************************/ 02415300
*   /* VOLUME RECORD FLAG INFORMATION                        @OY59794*/ 02415400
*   /*****************************************************************/ 02415500
*   2 DVLFLAGS CHAR(1),      /* FLAGS AND RESERVED           @OY59794*/ 02415600
*     3 DVLCONV BIT(1),      /* 1 = VOL IS IN CONVERSION     @OY59794*/ 02415700
*     3 *       BIT(7),      /* RESERVED                     @OW20434*/ 02415800
*   2 DVLFLGDC BIT(8),       /*          DCOLLECT FLGS       @OW20434*/ 02415900
*     3 DVL32NAM BIT(1),     /* 0 = Use DVLNSTAT, DVLCSMSS   @OW20434*/ 02416000
*                            /* 1 = Use DVLSSTAT             @OW20434*/ 02416100
*     3 *       BIT(7),      /* RESERVED                     @OW20434*/ 02416200
*   2 * CHAR(2),             /* RESERVED                     @OW20434*/ 02416300
*                                                                       02416400
*   /*****************************************************************/ 02416500
*   /* STORAGE GROUP ASSOCIATION AND STATUS INFORMATION      @OY59794*/ 02416600
*   /*****************************************************************/ 02416700
*   2 DVLSG,                 /* LENGTH AND NAME OF STORGRP   @OY59794*/ 02416800
*     3 DVLSGLEN FIXED(15),  /* LENGTH OF STORGRP NAME       @OY59794*/ 02416900
*     3 DVLSTGRP CHAR(30),   /* STORAGE GROUP OF THIS VOLUME @OY59794*/ 02417000
*   2 DVLNSTAT(8),           /* STATUS BY SYSTEM             @OY59794*/ 02417100
*     3 DVLSMSS FIXED(8),    /* SMS STATUS                   @OY59794*/ 02417200
*     3 DVLMVSS FIXED(8),    /* MVS STATUS                   @OY59794*/ 02417300
*   2 DVLCSMSS(8) FIXED(8),  /* CONFIRMED SMS STATUS FOR VOL @OY59794*/ 02417400
*                                                                       02417500
*   /*****************************************************************/ 02417600
*   /* VOLUME ATTRIBUTES                                     @OY59794*/ 02417700
*   /*****************************************************************/ 02417800
*   2 DVLNUCBA PTR(31),      /* ADDRESS OF UCB IF KNOWN      @OY59794*/ 02417900
*   2 DVLNTCPY FIXED(32),    /* TOTAL CAPACITY IN MB         @OY59794*/ 02418000
*   2 DVLNFREE FIXED(32),    /* AMOUNT FREE SPACE IN MB      @OY59794*/ 02418100
*   2 DVLNLEXT FIXED(32),    /* LARGEST FREE EXTENT IN MB    @OY59794*/ 02418200
*   2 DVLN0CNT FIXED(15),    /* VOLUME LEVEL RESET COUNT     @OY59794*/ 02418300
*   2 DVLTRKSZ FIXED(16),    /* VOLUME R1 TRACK CAPACITY     @OY59794*/ 02418400
*   2 DVLNLEVL FIXED(31),    /* UPDATE LEVEL FOR VOLUME      @OY59794*/ 02418500
*   2 DVLSSTAT(32),          /* System status array              @LMA*/ 02418600
*     3 DVLSTSMS FIXED(8),   /* SMS system status                @LMA*/ 02418700
*     3 DVLSTMVS FIXED(8),   /* MVS system status                @LMA*/ 02418800
*     3 DVLCNSMS FIXED(8),   /* Confirmed SMS status             @LMA*/ 02418900
*     3 *        CHAR(5),    /* Reserved                         @LMA*/ 02419000
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/ 02419100
*   2 DVLDATAE CHAR(0);      /* ROUND TO DWORD BOUNDARY      @OY59794*/ 02419200
*                                                                       02419300
*/********************************************************************/ 02419400
*/* AGGREGATE GROUP DEFINITION (RECORD TYPE 'AG')            @OY59794*/ 02419500
*/********************************************************************/ 02419600
*DECLARE                                                   /*@OY59794*/ 02419700
* 1 DAGDATA DEFINED(DCUDATA),/* AGGREGATE GROUP DEFINITION              02419800
*                                (DEFINED ON DCUDATA)        @OY59794*/ 02419900
*   2 DAGNMFLD,              /* SPACE FOR NAME AND LENGTH    @OY59794*/ 02420000
*     3 DAGNMLEN FIXED(15),  /* LENGTH OF NAME               @OY59794*/ 02420100
*     3 DAGNAME  CHAR(30),   /* NAME OF DATA CLASS           @OY59794*/ 02420200
*   2 DAGUSER  CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/ 02420300
*   2 DAGDATE  CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/ 02420400
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/ 02420500
*   2 DAGTIME  CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/ 02420600
*   2 DAGDESC  CHAR(120),    /* DESCRIPTION                  @OY59794*/ 02420700
*                                                                       02420800
*   /*****************************************************************/ 02420900
*   /* AGGREGATE GROUP FLAG INFORMATION                      @OY59794*/ 02421000
*   /*****************************************************************/ 02421100
*   2 DAGFLAGS   BIT(8),                                   /*@OY59794*/ 02421200
*     3 DAGTENQ  BIT(1),     /* TOLERATE ENQ FAILURE, 1 = YES,          02421300
*                               0 = NO                       @OY59794*/ 02421400
*     3 DAGFRET  BIT(1),     /* RETENTION PERIOD SPECIFIED,             02421500
*                               1 = YES, 0 = NO              @OY59794*/ 02421600
*     3 DAGFNCPY BIT(1),     /* NUMBER OF COPIES SPECIFIED,             02421700
*                               1 = YES, 0 = NO              @OY60048*/ 02421800
*     3 *        BIT(5),     /* RESERVED                     @OY59794*/ 02421900
*   2 *          CHAR(3),    /* RESERVED                     @OY59794*/ 02422000
*                                                                       02422100
*   /*****************************************************************/ 02422200
*   /* AGGREGATE GROUP ATTRIBUTES                            @OY59794*/ 02422300
*   /*****************************************************************/ 02422400
*   2 DAGRETPD   FIXED(31),  /* RETENTION PERIOD             @OY59794*/ 02422500
*     3 DAGEXPYR FIXED(15),  /* EXPIRATION YEAR              @OY59794*/ 02422600
*     3 DAGEXPDY FIXED(15),  /* ABSOLUTE DAY OF YEAR         @OY59794*/ 02422700
*   2 DAGDEST    CHAR(30),   /* DESTINATION                  @OY59794*/ 02422800
*   2 DAGPREFX   CHAR(33),   /* OUTPUT DATA SET PREFIX       @OY59794*/ 02422900
*   2 *          CHAR(1),    /* RESERVED                     @OY59794*/ 02423000
*   2 DAGIDSNM,              /* INSTRUCTION DATA SET NAME    @OY59794*/ 02423100
*     3 DAGINDSN CHAR(44),   /* DATA SET NAME                @OY59794*/ 02423200
*     3 DAGINMEM CHAR(8),    /* MEMBER NAME, IF ANY, OR BLANK@OY59794*/ 02423300
*   2 DAGDSNMS(5),           /* ARRAY OF DATA SET NAMES      @OY59794*/ 02423400
*     3 DAGDSN CHAR(44),     /* DATA SET NAME                @OY59794*/ 02423500
*     3 DAGMEM CHAR(8),      /* MEMBER NAME, IF ANY, OR BLANK@OY59794*/ 02423600
*   2 DAGMGMTC,              /* MANAGEMENT CLASS             @OY60048*/ 02423700
*     3 DAGMCLEN FIXED(15),  /* MANAGEMENT CLASS LENGTH      @OY60048*/ 02423800
*     3 DAGMCNAM CHAR(30),   /* MANAGEMENT CLASS NAME        @OY60048*/ 02423900
*   2 DAGNCOPY   FIXED(31),  /* NUMBER OF COPIES             @OY60048*/ 02424000
*                                                                       02424100
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/ 02424200
*   2 DAGDATAE CHAR(0);      /* END OF DAGDATA               @OY59794*/ 02424300
*                                                                       02424400
*/********************************************************************/ 02424500
*/* SMS OPTICAL DRIVE DEFINITION (RECORD TYPE 'DR')          @OY59794*/ 02424600
*/********************************************************************/ 02424700
*DECLARE                                                   /*@OY59794*/ 02424800
* 1 DDRDATA DEFINED(DCUDATA),/* SMS OPTICAL DRIVE DEFINITION            02424900
*                                (DEFINED ON DCUDATA)        @OY59794*/ 02425000
*   2 DDRNMFLD,              /* EXTENDED FOR CONSISTENCY     @OY59794*/ 02425100
*     3 DDRDVLEN FIXED(15),  /* LENGTH OF NAME -- SHOULD BE 8@OY59794*/ 02425200
*     3 DDRNAME,                                           /*@OY59794*/ 02425300
*       4 DDRDNAME CHAR(8),  /* DRIVE NAME                   @OY59794*/ 02425400
*       4 *        CHAR(22), /* RESERVED FOR CONSISTENCY     @OY59794*/ 02425500
*   2 DDRDUSER CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/ 02425600
*   2 DDRDDATE CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/ 02425700
*   2 DDRFLAGS CHAR(1),      /* Flags and reserved               @LMC*/ 02425800
*     3 DDR32NAM BIT(1),     /* 0 = Use DDRNSTAT                 @LMA*/ 02425900
*                            /* 1 = Use DDRSTAT                  @LMA*/ 02426000
*     3 *        BIT(7),     /* Reserved                         @LMA*/ 02426100
*   2 *        CHAR(1),      /* RESERVED                         @LMC*/ 02426200
*   2 DDRDTIME CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/ 02426300
*                                                                       02426400
*   /*****************************************************************/ 02426500
*   /* LIBRARY NAME FIELDS                                   @OY59794*/ 02426600
*   /*****************************************************************/ 02426700
*   2 DDRLB,                 /* LENGTH AND NAME OF LIBRARY   @OY59794*/ 02426800
*     3 DDRLBLEN FIXED(15),  /* LENGTH OF LIBRARY NAME       @OY59794*/ 02426900
*     3 DDRLIBRY CHAR(30),   /* LIBRARY FOR THIS DRIVE       @OY59794*/ 02427000
*       4 DDRLBNM  CHAR(8),  /* LIBRARY NAME                 @OY59794*/ 02427100
*       4 *        CHAR(22), /* RESERVED                     @OY59794*/ 02427200
*                                                                       02427300
*   /*****************************************************************/ 02427400
*   /* DRIVE STATUS BY SYSTEM                                @OY59794*/ 02427500
*   /*****************************************************************/ 02427600
*   2 DDRNSTAT(8),           /* STATUS BY SYSTEM             @OY59794*/ 02427700
*     3 DDROMST,             /* STATUS OF EACH DRIVE         @OY59794*/ 02427800
*       4 DDRSOUT  FIXED(8), /* REQUESTED OAM STATUS         @OY59794*/ 02427900
*       4 DDRCFCS  FIXED(8), /* CURRENT OAM STATUS           @OY59794*/ 02428000
*       4 *        CHAR(2),  /* RESERVED                     @OY59794*/ 02428100
*                                                                       02428200
*   2 DDRDCONS FIXED(32),    /* CONSOLE ID                   @OY60048*/ 02428300
*   2 DDRSTAT(32),           /* System related data              @LMA*/ 02428400
*     3 DDRSYSST,            /* Status for this system           @LMA*/ 02428500
*       4 DDRREQST FIXED(8), /* Requested system status          @LMA*/ 02428600
*       4 DDRCURST FIXED(8), /* Current system status            @LMA*/ 02428700
*       4 *        CHAR(2),  /* Reserved                         @LMA*/ 02428800
*     3 *        CHAR(4),    /* Reserved                         @LMA*/ 02428900
*                                                                       02429000
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/ 02429100
*   2 DDRDATAE CHAR(0);      /* END OF DDDRATA               @OY59794*/ 02429200
*                                                                       02429300
*/********************************************************************/ 02429400
*/* SMS OPTICAL LIBRARY DEFINITION (RECORD TYPE 'LB')        @OY59794*/ 02429500
*/********************************************************************/ 02429600
*DECLARE                                                   /*@OY59794*/ 02429700
* 1 DLBDATA DEFINED(DCUDATA),/* SMS OPTICAL LIBRARY DEFINITION          02429800
*                                (DEFINED ON DCUDATA)        @OY59794*/ 02429900
*   2 DLBNMFLD,              /* EXTENDED FOR CONSISTENCY     @OY59794*/ 02430000
*     3 DLBNMLEN FIXED(15),  /* LENGTH OF LIBRARY NAME       @OY59794*/ 02430100
*     3 DLBLNAME CHAR(30),   /* LIBRARY NAME - LONG VERSION  @OY59794*/ 02430200
*       4 DLBNAME  CHAR(8),  /* NAME OF OPTICAL LIBRARY      @OY59794*/ 02430300
*       4 *        CHAR(22), /* RESERVED FOR CONSISTENCY     @OY59794*/ 02430400
*   2 DLBDUSER CHAR(8),      /* USERID OF LAST UPDATER       @OY59794*/ 02430500
*   2 DLBDDATE CHAR(10),     /* DATE OF LAST UPDATE          @OY59794*/ 02430600
*   2 DLBFLAGS CHAR(1),      /* Reserved                         @LMC*/ 02430700
*     3 DLB32NAM BIT(1),     /* 0 = Use DLBNSTAT                 @LMA*/ 02430800
*                            /* 1 = Use DLBSTAT                  @LMA*/ 02430900
*     3 *        BIT(7),     /* Reserved                         @LMA*/ 02431000
*   2 *        CHAR(5),      /* Reserved                         @LMC*/ 02431100
*   2 DLBDTIME CHAR(8),      /* TIME OF LAST UPDATE          @OY59794*/ 02431200
*                                                                       02431300
*   /*****************************************************************/ 02431400
*   /* OPTICAL LIBRARY STATUS BY SYSTEM                      @OY59794*/ 02431500
*   /*****************************************************************/ 02431600
*   2 DLBNSTAT(8),           /* STATUS BY SYSTEM             @OY59794*/ 02431700
*     3 DLBOMST,             /* STATUS FOR EACH LIBRARY      @OY59794*/ 02431800
*       4 DLBSOUT  FIXED(8), /* REQUESTED OAM STATUS         @OY59794*/ 02431900
*       4 DLBCFCS  FIXED(8), /* CURRENT OAM STATUS           @OY59794*/ 02432000
*       4 *        CHAR(2),  /* RESERVED                     @OY59794*/ 02432100
*                                                                       02432200
*   /*****************************************************************/ 02432300
*   /* OPTICAL LIBRARY ATTRIBUTES                            @OY59794*/ 02432400
*   /*****************************************************************/ 02432500
*   2 DLBTYPE  FIXED(8),     /* REAL OR PSEUDO LIBRARY       @OY59794*/ 02432600
*   2 *        CHAR(2),      /* RESERVED                     @OY59794*/ 02432700
*   2 DLBDTYPE FIXED(8),     /* LIBRARY DEVICE TYPE          @OY59794*/ 02432800
*   2 DLBDCONS FIXED(32),    /* CONSOLE ID                   @OY60048*/ 02432900
*   2 DLBEDVT  FIXED(8),     /* ENTRY DEFAULT USE ATTRIBUTE             02433000
*                                                (TAPE ONLY) @OY60048*/ 02433100
*   2 DLBEJD   FIXED(8),     /* EJECT DEFAULT (TAPE ONLY)    @OY60048*/ 02433200
*   2 DLBLCBID CHAR(5),      /* LIBRARY ID IN LIB.CONF.DB               02433300
*                                                (TAPE ONLY) @OY60048*/ 02433400
*   2 *        CHAR(1),      /* RESERVED                     @OY60048*/ 02433500
*   2 DLBEDUNM CHAR(8),      /* ENTRY DEFAULT UNIT NAME                 02433600
*                                                (TAPE ONLY) @OY60048*/ 02433700
*   2 DLBDEFDC,              /* ENTRY DEFAULT DATA CLASS                02433800
*                                                (TAPE ONLY) @OY60048*/ 02433900
*     3 DLBDCLEN FIXED(15),  /* LENGTH OF ENTRY DEFAULT DC   @OY60048*/ 02434000
*     3 DLBDCLNM  CHAR(30),  /* DEFAULT DC LONG VERSION      @OY60048*/ 02434100
*       4 DLBDCNAM CHAR(8),  /* NAME OF ENTRY DEFAULT DC     @OY60048*/ 02434200
*       4 * CHAR(22),        /* RESERVED FOR CONSISTENCY     @OY60048*/ 02434300
*   2 DLBSTAT(32),           /* System related data              @LMA*/ 02434400
*     3 DLBSYSST,            /* Status for this system           @LMA*/ 02434500
*       4 DLBREQST FIXED(8), /* Requested system status          @LMA*/ 02434600
*       4 DLBCURST FIXED(8), /* Current system status            @LMA*/ 02434700
*       4 *        CHAR(2),  /* Reserved                         @LMA*/ 02434800
*     3 *        CHAR(4),    /* Reserved                         @LMA*/ 02434900
*                                                                       02435000
*   2 *        CHAR(16),     /* RESERVED                     @OY60048*/ 02435100
*   2 DLBDATAE CHAR(0);      /* END OF DLBDATA               @OY59794*/ 02435200
*                                                                       02435300
*/********************************************************************/ 02435400
*/* SMS Cache Names Definition (Record Type 'CN')                @LHA*/ 02435500
*/********************************************************************/ 02435600
*DECLARE                                                       /*@LHA*/ 02435700
* 1 DCNDATA DEFINED(DCUDATA),/* SMS Cache Set and SES cache names       02435800
*                                (DEFINED ON DCUDATA)            @LHA*/ 02435900
*   2 DCNCSNAM CHAR(8),      /* Cache Set Name                   @LHA*/ 02436000
*   2 DCNSESNM(8) CHAR(16),  /* SES Cache name                   @LHA*/ 02436100
*   2 *        CHAR(16),     /* RESERVED                         @LHA*/ 02436200
*   2 DCNDATAE CHAR(0);      /* END OF DCNDATA                   @LHA*/ 02436300
*/********************************************************************/ 02436400
*/* SMS Accounting Information Definition  (Record Type 'AI')    @LHA*/ 02436500
*/********************************************************************/ 02436600
*DECLARE                                                       /*@LHA*/ 02436700
* 1 DAIDATA DEFINED(DCUDATA),/* Accounting Information                  02436800
*                                 (DEFINED on DCUDATA)           @LHA*/ 02436900
*   2 DAIDRTN,               /* Data Class Routine               @LHA*/ 02437000
*    3 DAIDDATE CHAR(10),    /* Date last updated                @LHA*/ 02437100
*    3 DAIDDSNM CHAR(44),    /* Data set name where stored       @LHA*/ 02437200
*    3 DAIDDSMR CHAR(8),     /* Member name in data set          @LHA*/ 02437300
*    3 DAIDSRID CHAR(8),     /* Userid of last updater           @LHA*/ 02437400
*    3 DAIDTIME CHAR(8),     /* Time last updated                @LHA*/ 02437500
*   2 DAIMRTN,               /* Manamgement Class Routine        @LHA*/ 02437600
*    3 DAIMDATE CHAR(10),    /* Date last updated                @LHA*/ 02437700
*    3 DAIMDSNM CHAR(44),    /* Data set name where stored       @LHA*/ 02437800
*    3 DAIMDSMR CHAR(8),     /* Member name in data set          @LHA*/ 02437900
*    3 DAIMSRID CHAR(8),     /* Userid of last updater           @LHA*/ 02438000
*    3 DAIMTIME CHAR(8),     /* Time last updated                @LHA*/ 02438100
*   2 DAISRTN,               /* Storage Class Routine            @LHA*/ 02438200
*    3 DAISDATE CHAR(10),    /* Date last updated                @LHA*/ 02438300
*    3 DAISDSNM CHAR(44),    /* Data set name where stored       @LHA*/ 02438400
*    3 DAISDSMR CHAR(8),     /* Member name in data set          @LHA*/ 02438500
*    3 DAISSRID CHAR(8),     /* Userid of last updater           @LHA*/ 02438600
*    3 DAISTIME CHAR(8),     /* Time last updated                @LHA*/ 02438700
*   2 DAIGRTN,               /* Storage Group Routine            @LHA*/ 02438800
*    3 DAIGDATE CHAR(10),    /* Date last updated                @LHA*/ 02438900
*    3 DAIGDSNM CHAR(44),    /* Data set name where stored       @LHA*/ 02439000
*    3 DAIGDSMR CHAR(8),     /* Member name in data set          @LHA*/ 02439100
*    3 DAIGSRID CHAR(8),     /* Userid of last updater           @LHA*/ 02439200
*    3 DAIGTIME CHAR(8),     /* Time last updated                @LHA*/ 02439300
*   2 *        CHAR(16),     /* Reserved                         @LHA*/ 02439400
*   2 DAIDATAE CHAR(0);      /* end of DAIDATA                   @LHA*/ 02439500
* %                                                                     02439600
* IF DCU_SMS = 'YES' %THEN       /* INCLUDE SMS RECORDS ONLY?@OY59794*/ 02439700
*    %GOTO DCU_SMSB;                                                    02439800
*/********************************************************************/ 02439900
*/* VALUES FOR DCVPHYST - PHYSICAL STATUS OF VOLUME                  */ 02440000
*/********************************************************************/ 02440100
*DECLARE DCVMANGD BIT(8) CONSTANT('00000011'B);  /* Volume is           02440200
*                                                   SMS managed  @LHC*/ 02440300
*DECLARE DCVINITL BIT(8) CONSTANT('00000001'B);  /* In conversion       02440400
*                                                   to SMS       @LHC*/ 02440500
*DECLARE DCVNMNGD BIT(8) CONSTANT('00000000'B);  /* Non SMS managed     02440600
*                                                   volume       @LHC*/ 02440700
*                                                                       02440800
*/********************************************************************/ 02440900
*/* VALUES FOR DCDRECFM - RECORD FORMAT                              */ 02441000
*/********************************************************************/ 02450000
*DECLARE DCDRECFF BIT(8) CONSTANT('10000000'B); /* Fixed length         02455700
*                                                  records       @LHC*/ 02461400
*DECLARE DCDRECFV BIT(8) CONSTANT('01000000'B); /* Variable length      02467100
*                                                  records       @LHC*/ 02472800
*DECLARE DCDRECFU BIT(8) CONSTANT('11000000'B); /* Undefined length     02478500
*                                                  records       @LHC*/ 02484200
*                                                                       02490000
*%DCU_SMSB: ;                                                           02490100
*/********************************************************************/ 02490200
*/* CONSTANTS FOR DDCRBIAS RECORD ACCESS BIAS                    @LJA*/ 02490300
*/********************************************************************/ 02490400
* DECLARE                                                               02490500
*  DDCRABUS  CONSTANT(0),          /* USER                       @LJA*/ 02490600
*  DDCRABSY  CONSTANT(1);          /* SYSTEM                     @LJA*/ 02490700
*/********************************************************************/ 02490800
*/* CONSTANTS FOR DDCRCORG                                   @OY59794*/ 02490900
*/********************************************************************/ 02491000
* DECLARE                                                  /*@OY59794*/ 02491100
*   DDCORGNL  CONSTANT(0),      /* RECORG IS NULL - SAM      @OY59794*/ 02491200
*   DDCORGKS  CONSTANT(1),      /* RECORG IS VSAM KSDS       @OY59794*/ 02491300
*   DDCORGES  CONSTANT(2),      /* RECORG IS VSAM ESDS       @OY59794*/ 02491400
*   DDCORGRR  CONSTANT(3),      /* RECORG IS VSAM RRDS       @OY59794*/ 02491500
*   DDCORGLS  CONSTANT(4);      /* RECORG IS VSAM LDS        @OY59794*/ 02491600
*                                                                       02491700
*/********************************************************************/ 02491800
*/* CONSTANTS FOR DDCRECFM                                   @OY59794*/ 02491900
*/********************************************************************/ 02492000
* DECLARE                                                  /*@OY59794*/ 02492100
*   DDCFMNUL  CONSTANT(0),      /* RECFM IS NULL             @OY59794*/ 02492200
*   DDCFMU    CONSTANT(1),      /* RECFM IS UNDEFINED        @OY59794*/ 02492300
*   DDCFMV    CONSTANT(2),      /* RECFM IS VARIABLE         @OY59794*/ 02492400
*   DDCFMVS   CONSTANT(3),      /* RECFM IS VARIABLE SPANNED @OY59794*/ 02492500
*   DDCFMVB   CONSTANT(4),      /* RECFM IS VARIABLE BLOCKED @OY59794*/ 02492600
*   DDCFMVBS  CONSTANT(5),      /* RECFM IS VAR BLK SPANNED  @OY59794*/ 02492700
*   DDCFMF    CONSTANT(6),      /* RECFM IS FIXED            @OY59794*/ 02492800
*   DDCFMFS   CONSTANT(7),      /* RECFM IS FIXED STANDARD   @OY59794*/ 02492900
*   DDCFMFB   CONSTANT(8),      /* RECFM IS FIXED BLOCKED    @OY59794*/ 02493000
*   DDCFMFBS  CONSTANT(9);      /* RECFM IS FIXED BLK SPANND @OY59794*/ 02493100
*                                                                       02493200
*/********************************************************************/ 02493300
*/* CONSTANTS FOR DDCCNTL                                    @OY59794*/ 02493400
*/********************************************************************/ 02493500
* DECLARE                                                  /*@OY59794*/ 02493600
*   DDCCNTLA  CONSTANT(1),      /* CARRIAGE CONTROL IS ANSI  @OY59794*/ 02493700
*   DDCCNTLM  CONSTANT(2),      /* CARRIAGE CONTROL IS MACH  @OY59794*/ 02493800
*   DDCCNTLN  CONSTANT(3);      /* CARRIAGE CONTROL IS NULL  @OY59794*/ 02493900
*                                                                       02494000
*/********************************************************************/ 02494100
*/* CONSTANTS FOR DDCAVREC                                   @OY59794*/ 02494200
*/********************************************************************/ 02494300
* DECLARE                                                  /*@OY59794*/ 02494400
*   DDCBYTES FIXED(8) CONSTANT(1),  /* AVGREC IS BYTES       @OY59794*/ 02494500
*   DDCKB    FIXED(8) CONSTANT(2),  /* AVGREC IS KB          @OY59794*/ 02494600
*   DDCMB    FIXED(8) CONSTANT(3);  /* AVGREC IS MB          @OY59794*/ 02494700
*                                                                       02494800
*/********************************************************************/ 02494900
*/* CONSTANTS FOR DDCDSNTY                                   @OY59794*/ 02495000
*/********************************************************************/ 02495100
* DECLARE                                                  /*@OY59794*/ 02495200
*   DDCDSNUL FIXED(8) CONSTANT(0),  /* DSN TYPE IS NULL      @OY59794*/ 02495300
*   DDCDSPDS FIXED(8) CONSTANT(1),  /* DSN TYPE IS PDS       @OY59794*/ 02495400
*   DDCDSLIB FIXED(8) CONSTANT(2),  /* DSN TYPE IS LIBRARY   @OY59794*/ 02495500
*   DDCDSHFS FIXED(8) CONSTANT(3),  /* DSN TYPE IS HFS       @OY60048*/ 02495600
*   DDCDSEXR FIXED(8) CONSTANT(4),  /* DSN TYP - EXTENDED(R) @OY60048*/ 02495700
*   DDCDSEXC FIXED(8) CONSTANT(5);  /* DSN TYP - EXTENDED(C) @OY60048*/ 02495800
*                                                                       02495900
*/********************************************************************/ 02496000
*/* CONSTANTS FOR DDCCOMP                                    @OY60048*/ 02496100
*/********************************************************************/ 02496200
* DECLARE                                                  /*@OY60048*/ 02496300
*   DDCCNUL   CONSTANT(0),          /* NULL COMPACTION TYPE  @OY60048*/ 02496400
*   DDCNOCMP  CONSTANT(1),          /* NO COMPACTION         @OY60048*/ 02496500
*   DDCIDRC   CONSTANT(2);          /* IMPROVED DATA RECORDING          02496600
*                                    CAPABILITY, COMPACTION. @OY60048*/ 02496700
*                                                                       02496800
*/********************************************************************/ 02496900
*/* CONSTANTS FOR DDCMEDIA                                   @OY60048*/ 02497000
*/********************************************************************/ 02497100
* DECLARE                                                  /*@OY60048*/ 02497200
*   DDCMENUL  CONSTANT(0),          /* MEDIA TYPE IS NULL    @OY60048*/ 02497300
*   DDCMEDA1  CONSTANT(1),          /* MEDIA1 - CART. SYSTEM @OY60048*/ 02497400
*   DDCMEDA2  CONSTANT(2);          /* MEDIA2 - ENHANCED CAPACITY       02497500
*                                      CARTRIDGE SYSTEM TAPE @OY60048*/ 02497600
*                                                                       02497700
*/********************************************************************/ 02497800
*/* CONSTANTS FOR DDCRECTE                                   @OY60048*/ 02497900
*/********************************************************************/ 02498000
* DECLARE                                                  /*@OY60048*/ 02498100
*   DDCRTNUL  CONSTANT(0),          /* DDCRECTE IS NULL      @OY60048*/ 02498200
*   DDC18TRK  CONSTANT(1),          /* DDCRECTE IS 18 TRACK  @OY60048*/ 02498300
*   DDC36TRK  CONSTANT(2);          /* DDCRECTE IS 36 TRACK  @OY60048*/ 02498400
*                                                                       02498500
*/********************************************************************/ 02498600
*/*                                                                  */ 02498700
*/* Constants for DDCBWOTP                                       @LAA*/ 02498800
*/*                                                                  */ 02498900
*/********************************************************************/ 02499000
* DECLARE                                                               02499100
*   DDCBWOCI CONSTANT(1),       /* BWO type CICS                 @LJA*/ 02499200
*   DDCBWONO CONSTANT(2),       /* BWO type none                 @LJA*/ 02499300
*   DDCBWOIM CONSTANT(3);       /* BWO type IMS                  @LJA*/ 02499400
*/********************************************************************/ 02499500
*/*                                                                  */ 02499600
*/* Constants for DDCLOGRC                                       @LJA*/ 02499700
*/*                                                                  */ 02499800
*/********************************************************************/ 02499900
* DECLARE                                                               02500000
*   DDCLOGNO CONSTANT(1),         /* non Recoverable sphere      @LJA*/ 02500100
*   DDCLOGUN CONSTANT(2),         /* UNDO - use external log     @LJA*/ 02500200
*   DDCLOGAL CONSTANT(3);         /* ALL - (UNDO) & forward      @LJA*/ 02500300
*                                                                       02500400
*/********************************************************************/ 02500500
*/*                                                                  */ 02500600
*/* Constants for DDCSPAND                                       @LJA*/ 02500700
*/*                                                                  */ 02500800
*/********************************************************************/ 02500900
* DECLARE                                                               02501000
*   DDCSPANN CONSTANT(0),         /* Record can not span CI      @LJA*/ 02501100
*   DDCSPANY CONSTANT(1);         /* Record may span CI          @LJA*/ 02501200
*                                                                       02501300
*/********************************************************************/ 02501400
*/* CONSTANTS FOR DSCDIRB and DSCSEQB                        @OY59794*/ 02501500
*/********************************************************************/ 02501600
* DECLARE                                                  /*@OY59794*/ 02501700
*   DSCBIADC CONSTANT(0),           /* BIAS = DON'T CARE     @OY59794*/ 02501800
*   DSCBIARD CONSTANT(1),           /* BIAS = READ           @OY59794*/ 02501900
*   DSCBIAWR CONSTANT(2);           /* BIAS = WRITE          @OY59794*/ 02502000
*                                                                       02502100
*/********************************************************************/ 02502200
*/* CONSTANTS FOR DSCAVAIL                                   @OY59794*/ 02502300
*/********************************************************************/ 02502400
* DECLARE                                                  /*@OY59794*/ 02502500
*   DSCAVLDC CONSTANT(0),   /* AVAILABILITY = DON'T CARE (no            02502620
*                              preference)                       @01C*/ 02502640
*   DSCAVLST CONSTANT(1),   /* AVAILABILITY = STANDARD       @OY59794*/ 02502700
*   DSCAVLCN CONSTANT(2),   /* AVAILABILITY = CONTINUOUS     @OY59794*/ 02502820
*   DSCAVLPR CONSTANT(3);   /* AVAILABILITY = PREFERRED          @01A*/ 02502840
*                                                                       02502900
*/********************************************************************/ 02503000
*/* CONSTANTS FOR DSCACCES                                   @OY60048*/ 02503100
*/********************************************************************/ 02503200
* DECLARE                                                  /*@OY60048*/ 02503300
*   DSCACCPR CONSTANT(0),   /* ACCESSIBILITY = CONTINUOUS PREFERRED     02503400
*                                                            @OY60048*/ 02503500
*   DSCACCRQ CONSTANT(1),   /* ACCESSIBILITY = CONTINUOUS    @OY60048*/ 02503600
*   DSCACCST CONSTANT(2),   /* ACCESSIBILITY = STANDARD      @OY60048*/ 02503700
*   DSCACCNP CONSTANT(3);   /* ACCESSIBILITY = NOPREF        @OW01826*/ 02503800
*                                                                       02503900
*/********************************************************************/ 02504000
*/*  CONSTANTS FOR DMCRFMT                                   @OY59794*/ 02504100
*/********************************************************************/ 02504200
* DECLARE                                                  /*@OY59794*/ 02504300
*   DMCNULL   CONSTANT(0),          /* FIELD WAS NOT USED    @OY59794*/ 02504400
*   DMCFDATE  CONSTANT(1),          /* EXPIRE FORM:                     02504500
*                                            DATE/CREATE     @OY59794*/ 02504600
*   DMCFDAYS  CONSTANT(2);          /* EXPIRE FORM:                     02504700
*                                            DAYS/CREATE     @OY59794*/ 02504800
*                                                                       02504900
*/********************************************************************/ 02505000
*/*  CONSTANTS FOR DMCCMAU                                   @OY59794*/ 02505100
*/********************************************************************/ 02505200
* DECLARE                                                  /*@OY59794*/ 02505300
*   DMCMNONE  CONSTANT(0),          /* NO MIGRATION ALLOWED  @OY59794*/ 02505400
*   DMCMCMD   CONSTANT(1),          /* MIGR ON COMMAND ONLY  @OY59794*/ 02505500
*   DMCMBOTH  CONSTANT(2);          /* AUTO MIGRAT OR ON CMD @OY59794*/ 02505600
*                                                                       02505700
*/********************************************************************/ 02505800
*/*  CONSTANTS FOR DMCBADU                                   @OY59794*/ 02505900
*/********************************************************************/ 02506000
* DECLARE                                                  /*@OY59794*/ 02506100
*   DMCBNONE  CONSTANT(0),          /* NO USR OR ADMN BACKUP @OY59794*/ 02506200
*   DMCBADM   CONSTANT(1),          /* ALLOW ADMIN CMD BACKUP@OY59794*/ 02506300
*   DMCBBOTH  CONSTANT(2);          /* ALLOW ADMN OR USR CMD @OY59794*/ 02506400
*                                                                       02506500
*/********************************************************************/ 02506600
*/*  CONSTANTS FOR DMCEXPAC                                  @OY59794*/ 02506700
*/********************************************************************/ 02506800
* DECLARE                                                  /*@OY59794*/ 02506900
*   DMCEANUL FIXED(8) CONSTANT(0),  /* EXPIRE ACTION IS NULL @OY59794*/ 02507000
*   DMCEADEL FIXED(8) CONSTANT(1),  /* EXPIRE ACTION IS DEL  @OY59794*/ 02507100
*   DMCEAARC FIXED(8) CONSTANT(2);  /* EXPIRE ACTION IS ARC  @OY59794*/ 02507200
*                                                                       02507300
*/********************************************************************/ 02507400
*/*  CONSTANTS FOR DMCRLF                                    @OY59794*/ 02507500
*/********************************************************************/ 02507600
* DECLARE                                                  /*@OY59794*/ 02507700
*   DMCRLFYE BIT(8) CONSTANT('10000000'B), /* PARTIAL RELEASE = YES,    02507800
*                                        IMMEDIATE REL = NO      @LHC*/ 02507900
*   DMCRLFCN BIT(8) CONSTANT('01000000'B), /* CONDITION PARTREL = YES,  02508000
*                                        IMMEDIATE REL = NO      @LHC*/ 02508100
*   DMCRLFNO BIT(8) CONSTANT('00000000'B), /* PARTIAL RELEASE = NO,     02508200
*                                        IMMEDIATE REL = NO      @LHC*/ 02508300
*   DMCRLFYI BIT(8) CONSTANT('10100000'B), /* PARTIAL RELEASE = YES,    02508400
*                                        IMMEDIATE REL = YES     @LHC*/ 02508500
*   DMCRLFCI BIT(8) CONSTANT('01100000'B); /* CONDITION PARTREL = YES,  02508600
*                                        IMMED CON REL = YES     @LHC*/ 02508700
*                                                                       02508800
*/********************************************************************/ 02508900
*/*  CONSTANTS FOR DMCCPYTC                                  @OY60048*/ 02509000
*/********************************************************************/ 02509100
* DECLARE                                                  /*@OY60048*/ 02509200
*   DMCCPYST FIXED(8) CONSTANT(0),   /* STANDARD             @OY60048*/ 02509300
*   DMCCPYPR FIXED(8) CONSTANT(1),   /* CONCURRENT PREFERRED @OY60048*/ 02509400
*   DMCCPYRQ FIXED(8) CONSTANT(2);   /* CONCURRENT REQUIRED  @OY60048*/ 02509500
*                                                                       02509600
*/********************************************************************/ 02509700
*/* CONSTANTS FOR DBCSTAT                                    @OY59794*/ 02509800
*/********************************************************************/ 02509900
* DECLARE                                                  /*@OY59794*/ 02510000
*   DBCVALID CONSTANT(1),           /* DATA SET IS VALID     @OY59794*/ 02510100
*   DBCINVAL CONSTANT(2),           /* DATA SET IS INVALID   @OY59794*/ 02510200
*   DBCUNKWN CONSTANT(3);           /* DATA SET STAT IS UNK. @OY59794*/ 02510300
*                                                                       02510400
*/********************************************************************/ 02510500
*/* CONSTANTS FOR DBCSYSNT AND DBCSNMTY                     @K131753*/  02510600
*/********************************************************************/ 02510700
* DECLARE                                                  /*@OW02196*/ 02510800
*   DBCSYSNS CONSTANT(0),  /* NAME TYPE NOT SPECIFIED        @OW02196*/ 02510900
*   DBCSYSTM CONSTANT(1),  /* NAME TYPE IS SYSTEM NAME       @OW02196*/ 02511000
*   DBCSYSPL CONSTANT(2);  /* NAME TYPE IS SYSTEM GROUP NAME @OW02196*/ 02511100
*                                                                       02511200
*/********************************************************************/ 02511300
*/* CONSTANTS FOR DBCSYSFT                                   @OW20434*/ 02511400
*/********************************************************************/ 02511500
* DECLARE                                                  /*@OW20434*/ 02511600
*   DBCASMS  BIT(16) CONSTANT('8000'X), /* ACTIVE SMS        @OW20434*/ 02511700
*   DBCPDSE  BIT(16) CONSTANT('4000'X), /* PDSE FEATURE      @OW20434*/ 02511800
*   DBCCDMP  BIT(16) CONSTANT('2000'X), /* SAM COMPRESSION   @OW20434*/ 02511900
*   DBCSESC  BIT(16) CONSTANT('1000'X); /* SES CACHE FEATURE @OW20434*/ 02512000
*/********************************************************************/ 02512100
*/* CONSTANTS FOR DSGFTYPE                                   @OY59794*/ 02512200
*/********************************************************************/ 02512300
* DECLARE                                                  /*@OY59794*/ 02512400
*   DSGPOOL   CONSTANT(0),          /* STG GRP TYPE IS POOL  @OY59794*/ 02512500
*   DSGVIO    CONSTANT(1),          /* STG GRP TYPE IS VIO   @OY59794*/ 02512600
*   DSGDUMMY  CONSTANT(2),          /* STG GRP TYPE IS DUMMY @OY59794*/ 02512700
*   DSGOBJ    CONSTANT(3),          /* SG TYPE IS OBJECT     @OY59794*/ 02512800
*   DSGOBJBK  CONSTANT(4),          /* SG TYPE IS OBJ BACKUP @OY59794*/ 02512900
*   DSGTAPE   CONSTANT(5);          /* SG TYPE IS TAPE       @OY60048*/ 02513000
*                                                                       02513100
*/********************************************************************/ 02513200
*/* CONSTANTS FOR DSGSTAT and DSGSYSST                       @OW24697*/ 02513300
*/********************************************************************/ 02513400
* DECLARE                                                  /*@OY59794*/ 02513500
*   DSG0    FIXED(8) CONSTANT(0),   /* NO STATUS SPECIFIED   @OY59794*/ 02513600
*   DSGENBL FIXED(8) CONSTANT(1),   /* STOR GRP IS ENABLED   @OY59794*/ 02513700
*   DSGQUI  FIXED(8) CONSTANT(2),   /* STOR GRP QUIESCED/ALL @OY59794*/ 02513800
*   DSGQUIN FIXED(8) CONSTANT(3),   /* STOR GRP QUIESCED/NEW @OY59794*/ 02513900
*   DSGDIS  FIXED(8) CONSTANT(4),   /* STOR GRP DISABLED/ALL @OY59794*/ 02514000
*   DSGDISN FIXED(8) CONSTANT(5);   /* STOR GRP DISABLED/NEW @OY59794*/ 02514100
*                                                                       02514200
*/********************************************************************/ 02514300
*/* SMS STATUS - DVLSMSS and DVLSTSMS                        @OW24697*/ 02514400
*/********************************************************************/ 02514500
* DECLARE                                                  /*@OY59794*/ 02514600
*   DVL0      FIXED(8) CONSTANT(0), /* NO STATUS GIVEN       @OY59794*/ 02514700
*   DVLENBL   FIXED(8) CONSTANT(1), /* SMS STATUS IS ENABLED @OY59794*/ 02514800
*   DVLQUI    FIXED(8) CONSTANT(2), /* SMS STAT QUIESCED/ALL @OY59794*/ 02514900
*   DVLQUIN   FIXED(8) CONSTANT(3), /* SMS STAT QUIESCED/NEW @OY59794*/ 02515000
*   DVLDIS    FIXED(8) CONSTANT(4), /* SMS STAT DISABLED/ALL @OY59794*/ 02515100
*   DVLDISN   FIXED(8) CONSTANT(5); /* SMS STAT DISABLED/NEW @OY59794*/ 02515200
*                                                                       02515300
*/********************************************************************/ 02515400
*/* MVS STATUS - DVLMVSS and DVLSTMVS                        @OW24697*/ 02515500
*/********************************************************************/ 02515600
* DECLARE                                                  /*@OY59794*/ 02515700
*   DVLONLN   FIXED(8) CONSTANT(1), /* MVS STATUS IS ONLINE  @OY59794*/ 02515800
*   DVLOFFLN  FIXED(8) CONSTANT(2), /* MVS STATUS IS OFFLINE @OY59794*/ 02515900
*   DVLPOFF   FIXED(8) CONSTANT(3), /* MVS STATUS IS PENDING            02516000
*                                                OFFLINE     @OY59794*/ 02516100
*   DVLBOXED  FIXED(8) CONSTANT(4), /* MVS STATUS IS BOXED   @OY59794*/ 02516200
*   DVLNRDY   FIXED(8) CONSTANT(5); /* MVS STATUS IS NOT                02516300
*                                                READY       @OY59794*/ 02516400
*                                                                       02516500
*/********************************************************************/ 02516600
*/* MVS STATUS - DDRSOUT, DDRCFCS, DDRREQST AND DDRCURST     @OW24697*/ 02516700
*/********************************************************************/ 02516800
* DECLARE                                                  /*@OY59794*/ 02516900
*   DDRNOCON  FIXED(8) CONSTANT(0), /* OAM STATUS IS NO                 02517000
*                                       CONNECTIVITY         @OY59794*/ 02517100
*   DDRONLN   FIXED(8) CONSTANT(1), /* OAM STATUS IS ONLINE  @OY59794*/ 02517200
*   DDROFFLN  FIXED(8) CONSTANT(2), /* OAM STATUS IS OFFLINE @OY59794*/ 02517300
*   DDRNORST  FIXED(8) CONSTANT(3); /* NO OUTSTANDING REQUEST@OY59794*/ 02517400
*                                                                       02517500
*/********************************************************************/ 02517600
*/* MVS STATUS - DLBSOUT, DLBCFCS, DLBREQST, AND DLBCURST    @OW24697*/ 02517700
*/********************************************************************/ 02517800
* DECLARE                                                  /*@OY59794*/ 02517900
*   DLBNOCON  FIXED(8) CONSTANT(0), /* OAM STATUS IS NO                 02518000
*                                                CONNECT     @OY59794*/ 02518100
*   DLBONLN   FIXED(8) CONSTANT(1), /* OAM STATUS IS ONLINE  @OY59794*/ 02518200
*   DLBOFFLN  FIXED(8) CONSTANT(2), /* OAM STATUS IS OFFLINE @OY59794*/ 02518300
*   DLBNORST  FIXED(8) CONSTANT(3), /* NO OUTSTANDING REQUEST@OY59794*/ 02518400
*   DLBLPENO  FIXED(8) CONSTANT(4); /* LIBRARY PENDING OFLIN @OY60048*/ 02518500
*                                                                       02518600
*/********************************************************************/ 02518700
*/* TYPE OF LIBRARY - DLBTYPE                                @OY59794*/ 02518800
*/********************************************************************/ 02518900
* DECLARE                                                  /*@OY59794*/ 02519000
*   DLBNOOPT  FIXED(8) CONSTANT(0), /* NOT OPTICAL LIBRARY   @OY60048*/ 02519100
*   DLBREAL   FIXED(8) CONSTANT(1), /* REAL LIBRARY          @OY59794*/ 02519200
*   DLBPSEUD  FIXED(8) CONSTANT(2); /* PSEUDO LIBRARY        @OY59794*/ 02519300
*                                                                       02519400
*/********************************************************************/ 02519500
*/* TYPE OF LIBRARY DEVICE - DLBDTYPE                        @OY59794*/ 02519600
*/********************************************************************/ 02519700
* DECLARE                                                  /*@OY59794*/ 02519800
*   DLBD9246  FIXED(8) CONSTANT(0), /* IBM 9246 LIBRARY      @OY59794*/ 02519900
*   DLBD3995  FIXED(8) CONSTANT(1), /* IBM 3995 LIBRARY      @OY59794*/ 02520000
*   DLBDTAPE  FIXED(8) CONSTANT(2); /* TAPE LIBRARY          @OY60048*/ 02520100
*                                                                       02520200
*/********************************************************************/ 02520300
*/* ENTRY DEFAULT USE ATTRIBUTE- DLBEDVT(TAPE LIBRARY ONLY)  @OY60048*/ 02520400
*/********************************************************************/ 02520500
* DECLARE                                                  /*@OY60048*/ 02520600
*   DLBPRVT   FIXED(8) CONSTANT(1), /* PRIVATE VOLUME        @OY60048*/ 02520700
*   DLBSCRT   FIXED(8) CONSTANT(2); /* SCRATCH VOLUME        @OY60048*/ 02520800
*                                                                       02520900
*/********************************************************************/ 02521000
*/* EJECT DEFAULT - DLBEJD                                   @OY60048*/ 02521100
*/********************************************************************/ 02521200
* DECLARE                                                  /*@OY60048*/ 02521300
*   DLBPURGE  FIXED(8) CONSTANT(1), /* PURGE TCDB VOL RECORD @OY60048*/ 02521400
*   DLBKEEP   FIXED(8) CONSTANT(2); /* KEEP TCDB VOL RECORD  @OY60048*/ 02521500
*                                                                       02521600
*%DCU_OMIT: ;                                                           02521700
*/********************************************************************/ 02521800
*/* VALUES FOR DCURCTYP - RECORD TYPE                                */ 02521900
*/********************************************************************/ 02530000
*DECLARE DCUDATAT CHAR(2) CONSTANT('D '); /* DATA TYPE RECORD        */ 02540000
*DECLARE DCUASSOC CHAR(2) CONSTANT('A '); /* VSAM ASSOCIATION RECORD */ 02550000
*DECLARE DCUVULUT CHAR(2) CONSTANT('V '); /* VOLUME TYPE RECORD      */ 02560000
*DECLARE DCUDCDEF CHAR(2) CONSTANT('DC'); /* DATA CLASS      @OY59794*/ 02561000
*DECLARE DCUSCDEF CHAR(2) CONSTANT('SC'); /* STORAGE CLASS   @OY59794*/ 02562000
*DECLARE DCUMCDEF CHAR(2) CONSTANT('MC'); /* MANAGMENT CLASS @OY59794*/ 02563000
*DECLARE DCUBCDEF CHAR(2) CONSTANT('BC'); /* BASE CONFIG.    @OY59794*/ 02564000
*DECLARE DCUSGDEF CHAR(2) CONSTANT('SG'); /* STORAGE GROUP   @OY59794*/ 02565000
*DECLARE DCUVLDEF CHAR(2) CONSTANT('VL'); /* SMS VOLUME DEF  @OY59794*/ 02566000
*DECLARE DCUAGDEF CHAR(2) CONSTANT('AG'); /* AGGREGATE GROUP @OY59794*/ 02567000
*DECLARE DCUDRDEF CHAR(2) CONSTANT('DR'); /* OPTICAL DRIVE   @OY59794*/ 02568000
*DECLARE DCULBDEF CHAR(2) CONSTANT('LB'); /* OPTICAL LIBRARY @OY59794*/ 02569000
*DECLARE DCUCNDEF CHAR(2) CONSTANT('CN'); /* CACHE NAMES         @LHA*/ 02619000
*DECLARE DCUAIDEF CHAR(2) CONSTANT('AI'); /* ACS INFORMARTION    @LHA*/ 02669000
* %IF DCU_HDR = 'YES'            /* INCLUDE HEADER DECLARE ONLY?     */ 02719000
*  & IDCDOUT_CBGEN ^= 'YES' %THEN /* INCLUDE EVERYTHING?             */ 02769000
*  %GOTO IDCDOUT_4;              /* Bypass @LIST stuff               */ 02819000
*@LOGIC;                                                                02869000
*#PRAGMA TOOL=CBGEN.                                                    02919000
*#LINE.%IDCDOUT_CBGEN = 'YES';                                          02969000
*#LINE.%INCLUDE SYSLIB(IDCDOUT);                                        03019000
*#EPRAGMA.                                                              03069000
*@ENDLOGIC;                                                             03119000
*/* End of PL/X Source                                               */ 03169000
* %IF IDCDOUT_LIST ^= 'NO' &                                            03219000
*    ZCBPRINT ^= 'NO' %THEN                                             03269000
*   %GOTO IDCDOUT_4;                                                    03319000
*   @LIST POP NOECHO;                                                   03369000
* %IDCDOUT_4:;                                                          03419000
* %END;                                                                 03469000
