*        %GOTO MDB1;    /* BILINGUAL MAPPING                            00035700
         MACRO                                                          00071400
         IEAVM105                                                       00107100
*                                                                    */ 00142800
*%MDB1 : ;                                                              00178500
*                                                                       00214200
*/**** START OF SPECIFICATIONS ***************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* MACRO NAME:  IEAVM105                                     @L7C*/ 00350000
*/*                                                                  */ 00400000
*/*01* DESCRIPTIVE NAME:  Message Data Block  (MDB)              @L7C*/ 00450000
*/*                                                                  */ 00500000
*/*01* ACRONYM:     MDB                                          @L7C*/ 00512500
*/*01* EXTERNAL CLASSIFICATION: GUPI                             @L7A*/ 00525000
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @L7A*/ 00537500
*/*                                                                  */ 00550000
*/*01* PROPRIETARY STATEMENT=                                        */ 00600000
*/***PROPRIETARY_STATEMENT********************************************/ 00650000
*/*                                                                  */ 00750000
*/*                                                                  */ 00850000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00851900
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00853800
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1990, 1994                      */ 00855700
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00857600
*/*                                                                  */ 00859500
*/* STATUS= HBB5520                                                  */ 00861400
*/*                                                                  */ 00863300
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00865200
*/*                                                                  */ 00867100
*/*01* DSECT NAME:  MDB, MDBG, MDBSCP, or MDBT                   @L7C*/ 00869000
*/*                                                              @P8A*/ 00870900
*/*01* COMPONENT: Communications Task (SC1CK)                    @L7C*/ 00872800
*/*                                                              @P8A*/ 00874700
*/*01* EYE-CATCHER: MDB                                          @L7C*/ 00876600
*/*02*   OFFSET: 4                                               @L7C*/ 00878500
*/*02*   LENGTH: 4                                               @L7C*/ 00880400
*/*                                                              @P8A*/ 00882300
*/*01* STORAGE ATTRIBUTES:                                       @L7C*/ 00883300
*/*02*   MAIN STORAGE:                                           @L7A*/ 00884300
*/*02*   VIRTUAL STORAGE:                                        @L7A*/ 00885300
*/*02*   AUXILIARY STORAGE:                                      @L7A*/ 00886300
*/*02*   DATA SPACE:                                             @L7A*/ 00887300
*/*02*   SUBPOOL:  N/A                                           @L7C*/ 00888300
*/*02*   KEY:  N/A                                               @L7C*/ 00889300
*/*02*   RESIDENCY:  Message data space for the address space    @L7C*/ 00890300
*/*               which owns the Extended MCS Console.           @P7A*/ 00891800
*/*                                                              @P8A*/ 00893700
*/*01* SIZE: 72 bytes                                            @L7C*/ 00895600
*/*                                                              @P8A*/ 00897500
*/*01* FUNCTION:    This is an architected structure consisting  @L7C*/ 00900000
*/*              of a header and a combination of substructures  @L7C*/ 00930000
*/*              known as objects (i.e. general, control program @P7A*/ 00960000
*/*              and text objects).  It is used for message      @P7A*/ 00990000
*/*              text (WTO/R) and DOMs.                          @P7A*/ 01020000
*/*                                                              @L7A*/ 01030000
*/*01* METHOD OF ACCESS:                                         @L7A*/ 01040000
*/*                                                                  */ 01050000
*/*              BAL - SPECIFY IEAVM105                              */ 01150000
*/*                                                                  */ 01200000
*/*              PL/AS - Declare MDBPTR                              */ 01250000
*/*                      %INCLUDE SYSLIB(IEAVM105)                   */ 01300000
*/*                                                                  */ 01550000
*/*              VIA ATTRIBUTE - Specify %MDBVIA = 'YES'             */ 01600000
*/*                           prior to %INCLUDE statement.           */ 01650000
*/*                           Declare MDBALET.                       */ 01700000
*/*                           For VIA(0) specify %GLOBALARMODE='YES' */ 01750000
*/*                                                                  */ 01850000
*/*              PL/AS LISTING - Specify %IHALIST = 'YES'        @PAC*/ 01900000
*/*                              before %INCLUDE                 @PAC*/ 01950000
*/*                                                                  */ 02150000
*/*01* CREATED BY:       Various users                           @L7C*/ 02200000
*/*                                                                  */ 02250000
*/*01* POINTED TO BY:    N/A                                     @L7C*/ 02300000
*/*                                                                  */ 02350000
*/*01* SERIALIZATION:  N/A                                       @L7C*/ 02500000
*/*                                                                  */ 02550000
*/*01* DISTRIBUTION:    AMACLIB                                  @PAC*/ 02550400
*/*                                                              @P7A*/ 02550900
*/*01* OPERATION:   The MDB is constructed of the following:     @P7A*/ 02551800
*/*         The entire block is headed by a headers section      @P7A*/ 02552700
*/*         that identifies the block as an MDB and includes     @P7A*/ 02553600
*/*         the version (MDBVER) and the length of the entire    @P7A*/ 02554500
*/*         MDB block including all the objects (MDBLEN).        @P7A*/ 02555400
*/*           After the header comes one or more objects         @P7A*/ 02556300
*/*         (sub-blocks).  The blocks currently used are:        @P7A*/ 02557200
*/*                OBJECT                           TYPE         @P7A*/ 02558100
*/*          -   General Object (MDBG)             '0001'X       @P7A*/ 02559000
*/*          -   Control Program Object (MDBSCP)   '0002'X       @P7A*/ 02559900
*/*          -   Message Text Object (MDBT)        '0004'X       @P7A*/ 02560800
*/*           The General Object is required.  All others are    @P7A*/ 02561700
*/*         optional.  The objects can be in any order within    @P7A*/ 02562600
*/*         the MDB.                                             @P7A*/ 02563500
*/*           Each object block is architected such that the     @P7A*/ 02564400
*/*         first two bytes contains the length of that          @P7A*/ 02565300
*/*         particular object and the second two bytes contains  @P7A*/ 02566200
*/*         the object type.                                     @P7A*/ 02567100
*/*                                                              @P7A*/ 02568000
*/*  ___     ____________________________________________        @P7A*/ 02568900
*/*   A     | MDB Header section                         |       @P7A*/ 02569800
*/*   |     |                                            |       @P7A*/ 02570700
*/*   |     |  MDBLEN -------                            |       @P7A*/ 02571600
*/*   |     |____________________________________________|       @P7A*/ 02572500
*/*   |     | __________________________________________ |       @P7A*/ 02573400
*/*   |     || General Object (MDBG) - Required         ||       @P7A*/ 02574300
*/*   |     ||                                          ||       @P7A*/ 02575200
*/*   |     ||   One only                               ||       @P7A*/ 02576100
*/*   |     ||__________________________________________||       @P7A*/ 02577000
*/*   |     | __________________________________________ |       @P7A*/ 02577900
*/*   |     || Control Program Object (MDBC) - Optional ||       @P7A*/ 02578800
*/*   M     ||                                          ||       @P7A*/ 02579700
*/*   D     ||   One only                               ||       @P7A*/ 02580600
*/*   B     ||__________________________________________||       @P7A*/ 02581500
*/*   L     |  __________________________________________|       @P7A*/ 02582400
*/*   E     || Text Object  (MDBT) - Optional           ||       @P7A*/ 02583300
*/*   N     ||                                          ||       @P7A*/ 02584200
*/*   |     ||   One for each line of message text      ||       @P7A*/ 02585100
*/*   |     ||__________________________________________||       @P7A*/ 02586000
*/*   |     |                     .                      |       @P7A*/ 02586900
*/*   |     |                     .                      |       @P7A*/ 02587800
*/*   |     |                     .                      |       @P7A*/ 02588700
*/*   |     | __________________________________________ |       @P7A*/ 02589600
*/*   |     || Text Object  (MDBT) - Optional           ||       @P7A*/ 02590500
*/*   |     ||                                          ||       @P7A*/ 02591400
*/*   |     ||   One for each line of message text      ||       @P7A*/ 02592300
*/*   |     ||__________________________________________||       @P7A*/ 02593200
*/*   V__   |____________________________________________|       @P7A*/ 02594100
*/*                                                              @P7A*/ 02595000
*/* CHANGE ACTIVITY -                                                */ 02600000
*/*  $MAC(IEAVM105) COMP(SC1CK): Message data block                  */ 02637500
*/*  $L0=CNITGDHE, HBB4410, 890313,  PDHE: CONSOLE INTEGRATION       */ 02675000
*/*  $L1=CNSL1EHE, HBB4410, 890403,  PDHE: Console Enhancements 1    */ 02712500
*/*  $L2=CNITGECR, HBB4410, 890510,  PDCR: Console Integration       */ 02721800
*/*  $L3=CNITGEHD, HBB4410, 890510,  PDHD: Console Integration       */ 02731100
*/*  $L4=CNITGFHD, HBB4410, 890619,  PDHE: Console Integration       */ 02740400
*/*  $D1=DEO0253,  HBB4410, 891204,  PDBD: Sysplex Reply             */ 02745200
*/*  $P1=PEO3147,  HBB4410, 900105,  PDEF: Fix MDBCRPYB's Boundary   */ 02747600
*/*  $D2=DEO0310,  HBB4410, 900105,  PDCY: Netview required fields   */ 02748800
*/*  $P2=PEO3289,  HBB4410, 900105,  PDBU: Fix MDBCDESC assembler    */ 02749200
*/*                                         mapping                  */ 02749600
*/*  $P3=PEO3675,  HBB4410, 900226,  PDHE: Fix assembler boundaries  */ 02749800
*/*  $P4=PEO3728,  HBB4410, 900330,  PDHE: Fix assembler equates     */ 02749900
*/*  $P5=PEO3938,  HBB4410, 900330,  PDHD: Change version field      */ 02766600
*/*  $P6=PEO3954,  HBB4410, 900330,  PDCY: Change comment on MDBCTCB */ 02774900
*/*  $P7=PEO4207,  HBB4410, 900604,  PDED: Clarify fields            */ 02777700
*/*  $D3=DEO0357,  HBB4410, 900604,  PDED: Increase usability        */ 02780500
*/*  $L5=NETSY6HK, JBB4422, 901112,  PDHK: Netview Sysplex Automation*/ 02781900
*/*  $P8=PKB0806,  HBB4430, 920725,  PDCM: Prolog updates            */ 02782600
*/*  $L6=OSR4HZ,   HBB5510, 921207,  PDHZ: OSR Restructure           */ 02782900
*/*  $L7=SYSOP16,  HBB5510, 930520,  PD3J: SHOWHDR updates           */ 02783100
*/*  $D4=DIG0131,  HBB5510, 930731,  PDHD: Add sysplex name.         */ 02783200
*/*  $P9=PIG2688,  HBB5510, 930831,  PDCI: Add bit to indicate that  */ 02788800
*/*                                        message was suppressed    */ 02794400
*/*  $L8=OPLOG33J, HBB5520, 930923,  PD3J: Add MDBCXMOD, MDBCOCMD,   */ 02795500
*/*                                        MDBCICMD, and MDBCWTL     */ 02796600
*/*  $PA=PN70169,  HBB5520, 940210,  PD3J: SHOWHDR COMPLIANCE        */ 02797700
*/*  $D5=DN70048,  HBB5520, 940603,  PDQ8: Add console name          */ 02798200
*/*  $PB=DN71185,  HBB5520, 941020,  PDHL: Change MDBLEN to fixed 16 */ 02798500
*/*                                                                  */ 02798800
*/*  $01=OW07896,  HBB5510, 941031,  PDHD: Add SPVD bit              */ 02799400
*/*  $02=OW18874,  HBB5510, 960315,  PDHD: Add QNLY bit              */ 02799700
*/*  $03=OW20064,  HBB4430, 960615,  PDED: Add MCSFLAG bits          */ 02799800
*/* **** END OF SPECIFICATIONS ***************************************/ 02800000
*                                                                       21750000
*   %GOTO MDBPLS;/*                                                     21800000
********************************************************************    21850000
*                                                                       22050000
* Main Header object for the message block                              22100000
*                                                                       23750000
********************************************************************    23800000
MDB            DSECT                 START OF MDB HEADER                23850000
MDBLEN         DS    H               MDB length                         23950000
MDBTYPE        DS    CL2             MDB type                           24000000
MDBTYP1        EQU   X'0001'         Type for MDB Type 1                24050000
MDBMID         DS    CL4             Acronym 'MDB '                     24100000
MDBVER         DS    XL4             Revision code                      24150000
MDBVER1        EQU   X'00000001'     Revision code 1              @L4C  24200000
MDBVID         EQU   MDBVER1         Current revision code              24250000
MDBHLEN        EQU   *-MDB           Length of MDB Header section @P7C  24275000
********************************************************************    24300000
*                                                                       24350000
* General object for the message data block                             24400000
*                                                                       24450000
********************************************************************    24500000
MDBG           DSECT                 General Object Section             24550000
MDBGLEN        DS    H               General object length              24650000
MDBGTYPE       DS    CL2             General object type                24700000
MDBGOBJ        EQU   X'0001'         Type for general object            24750000
MDBGMID        DS    0XL4            Message ID                    @P2C 24800000
MDBGSYID       DS    CL1             System ID                     @L1A 24850000
MDBGSEQ        DS    XL3             Sequence Number               @L1A 24900000
MDBGTIMH       DS    CL8             Time stamp HH.MM.SS format         24950000
MDBGTIMT       DS    CL3             Time stamp .TH format              25000000
MDBGRSV1       DS    CL1             Reserved                           25050000
MDBGDSTP       DS    CL7             Date stamp                         25100000
MDBGRSV2       DS    CL1             Reserved                           25150000
MDBGMFLG       DS    XL2             Message flags                      25200000
MDBGDOM        EQU   X'8000'         DOM bit.  If this bit is on it    +25222800
                                     indicates that this MDB is for a  *25245600
                                     DOM.  The DOM information can be  *25268400
                                     found in the DOM flags in the     *25291200
                                     control program object (MDBDOMFL) *25314000
                                                                   @P7C 25336800
MDBGALRM       EQU   X'4000'         Sound warning alarm (processor    *25360000
                                     controller only)              @P7C 25380000
MDBGHOLD       EQU   X'2000'         Hold bit, Hold message until DOMed+25400000
                                     or deleted via other external     +25450000
                                     means                              25500000
MDBGRSV3       DS    CL2             Reserved                           25550000
********************************************************************    25557100
*                                                                       25564200
* The constants for the following fields can be found in section   @P7A 25571300
* PRESENTATION ATTRIBUTES EQUATES                                  @P7A 25578400
*                                                                       25585500
********************************************************************    25592600
MDBGFGPA       DS    0XL4            Foreground presentation           +25600000
                                     attributes                    @P3C 25650000
MDBGFCON       DS    XL1             Foreground control field      @P3C 25700000
MDBGFCOL       DS    XL1             Foreground color field        @P3C 25750000
MDBGFHIL       DS    XL1             Foreground highlighting       @P3C 25800000
MDBGFINT       DS    XL1             Foreground intensity          @P3C 25850000
MDBGBGPA       DS    0XL4            Background presentation           +25900000
                                     attributes                    @P3C 25950000
MDBGBCON       DS    XL1             Background control field      @P3C 26000000
MDBGBCOL       DS    XL1             Background color field        @P3C 26050000
MDBGBHIL       DS    XL1             Background highlighting       @P3C 26100000
MDBGBINT       DS    XL1             Background intensity          @P3C 26150000
MDBGOSNM       DS    CL8             Originating system name            26200000
MDBGJBNM       DS    CL8             Job name                           26250000
********************************************************************    26300000
*                                                                       26350000
* Control program object for the message data block                     26400000
*                                                                       26450000
********************************************************************    26500000
MDBSCP         DSECT                 Control Program Section            26550000
MDBCLEN        DS    H               Control program object length @P7C 26600000
MDBCTYPE       DS    CL2             Object type                        26700000
MDBCOBJ        EQU   X'0002'         Type for control prog object  @P7C 26750000
MDBCPROD       DS    0CL16           Originating system identifier @P5C 26762500
MDBCVER        DS    XL4             MVS CP object version level   @P5A 26775000
MDBCPNAM       DS    CL4             Control Program name ("MVS")  @P5A 26787500
MDBCFMID       DS    CL8             FMID of originating system    @P5A 26800000
MDBCVER1       EQU   X'00000001'     MVS CP object version 1       @P5A 26812500
MDBCVER2       EQU   X'00000002'     JBB4422 object version 2      @L5A 26820800
MDBCVER3       EQU   X'00000003'     OY65627 object version 3      @P9C 26824900
MDBCVER4       EQU   X'00000004'     HBB5510 object version 4      @P9A 26829000
MDBCVER5       EQU   X'00000005'     HBB5520 object version 5      @L8A 26831800
MDBCV10        EQU   X'00000010'     Structurally equivalent ot HBB5520x26832600
                                     with OW20064 (430)            @03A 26833400
MDBCV20        EQU   X'00000020'     Structurally equivalent ot HBB5520x26834200
                                     with OW20064 (510)            @03A 26835000
MDBCV30        EQU   X'00000030'     HBB5520 object with OW20064   @03A 26835800
MDBCVID        EQU   MDBCV30         Current MVS CP object version @03C 26836600
MDBCMVS        EQU   C'MVS '         Control Program name          @P5A 26837500
MDBCERC        DS    CL16            Routing codes                 @P7Cx26840200
                                       1st bit = Route Code 1      @P7Ax26842900
                                       2nd bit = Route Code 2      @P7Ax26845600
                                              .  .  .              @P7Ax26848300
                                       128th bit = Route Code 128  @P7A 26851000
MDBCDESC       DS    0CL2            Descriptor codes              @P2C 26853800
MDBDESC1       DS    CL1             Descriptor codes byte 1       @L1A 26857600
MDBDESCA       EQU   X'80'           System failure                @L1A 26861400
MDBDESCB       EQU   X'40'           Immediate action required     @L1A 26865200
MDBDESCC       EQU   X'20'           Eventual action required      @L1A 26869000
MDBDESCD       EQU   X'10'           System status                 @L1A 26872800
MDBDESCE       EQU   X'08'           Immediate command response    @L1A 26876600
MDBDESCF       EQU   X'04'           Job status                    @L1A 26880400
MDBDESCG       EQU   X'02'           Application program/processor @L1A 26884200
MDBDESCH       EQU   X'01'           Out-of-line                   @L1A 26888000
MDBDESC2       DS    CL1             Descriptor codes byte 2       @L1A 26891800
MDBDESCI       EQU   X'80'           Operator's request            @L1A 26895600
MDBDESCJ       EQU   X'40'           Track command response        @L1A 26899400
MDBDESCK       EQU   X'20'           Critical eventual action      @L1A 26903200
MDBDESCL       EQU   X'10'           Important Information         @P7C 26907000
MDBDESCM       EQU   X'08'           Previously automated          @L5C 26910800
MDBDESCN       EQU   X'04'           Reserved                      @L1A 26914600
MDBDESCO       EQU   X'02'           Reserved                      @L1A 26918400
MDBDESCP       EQU   X'01'           Reserved                      @L1A 26922200
MDBCMLVL       DS    0CL2            Message level                      26926000
MDBMLVL1       DS    CL1             Message level byte 1          @L1A 26929800
MDBMLR         EQU   X'80'           WTOR                          @L1A 26933600
MDBMLIA        EQU   X'40'           Immediate action              @L1A 26937400
MDBMLCE        EQU   X'20'           Critical eventual action      @L1A 26941200
MDBMLE         EQU   X'10'           Eventual action               @L1A 26945000
MDBMLI         EQU   X'08'           Informational                 @L1A 26948800
MDBMLBC        EQU   X'04'           Broadcast                     @L1A 26952600
MDBMLRSG       EQU   X'02'           Reserved                      @L1A 26956400
MDBMLRSH       EQU   X'01'           Reserved                      @L1A 26960200
MDBMLVL2       DS    CL1             Message level byte 2          @L1A 26964000
MDBMLRSI       EQU   X'80'           Reserved                      @L1A 26967800
MDBMLRSJ       EQU   X'40'           Reserved                      @L1A 26971600
MDBMLRSK       EQU   X'20'           Reserved                      @L1A 26975400
MDBMLRSL       EQU   X'10'           Reserved                      @L1A 26979200
MDBMLRSM       EQU   X'08'           Reserved                      @L1A 26983000
MDBMLRSN       EQU   X'04'           Reserved                      @L1A 26986800
MDBMLRSO       EQU   X'02'           Reserved                      @P4C 26990600
MDBMLRSP       EQU   X'01'           Reserved                      @P4C 26994400
MDBCATTR       DS    0CL2            Message Attribute flags            27000000
MDBCATT1       DS    CL1             First byte of attributes           27050000
MDBCSUPP       EQU   X'80'           Message is suppressed         @P9A 27100000
MDBCMCSC       EQU   X'40'           Message is command response        27150000
MDBCAUTH       EQU   X'20'           Message issued by authorized      +27200000
                                     program                       @P4C 27250000
MDBCRETN       EQU   X'10'           Message is retained by AMRF   @P7C 27300000
MDBCSPVD       EQU   X'08'           WQE Backlog Message           @01A 27350000
MDBCQNLY       EQU   X'04'           Console only                  @02A 27375000
MDBCATT2       DS    CL1             Second byte of attributes          27400000
MDBCPRTY       DS    H               Message priority                   27450000
MDBCRSV5       DS    H               Reserved                      @D3C 27500000
MDBCASID       DS    H               ASID of issuer                     27550000
MDBCTCB        DS    AL4             Job Step TCB for issuer       @P6C 27600000
MDBCTOKN       DS    XL4             Token (for DOM)               @P3C 27650000
MDBCSYID       DS    XL1             System ID (for DOM)                27700000
MDBDOMFL       DS    XL1             DOM flags                          27750000
MDBDMSGI       EQU   X'80'           DOM by message id (can be found   +27783300
                                     in MDBGMID)                   @P7C 27816600
MDBDSYSI       EQU   X'40'           DOM by system ID                   27850000
MDBDASID       EQU   X'20'           DOM by ASID                        27900000
MDBDJTCB       EQU   X'10'           DOM by job step TCB                27950000
MDBDTOKN       EQU   X'08'           DOM by token                       28000000
MDBCMISC       DS    B               Miscellaneous Routing Info    @P4C 28025000
MDBCUD         EQU   X'80'           Display UD messages           @L2A 28050000
MDBCFUDO       EQU   X'40'           Display only UD messages      @L2A 28062500
MDBCFIDO       EQU   X'20'           Queue by ID only              @D3A 28068700
MDBCAUT        EQU   X'10'           Queue by automation           @L5A 28071800
MDBCHC         EQU   X'08'           Queue by hardcopy             @L6A 28073400
MDBCMSC2       DS    B               Miscellaneous OPERLOG info    @L8C 28078700
MDBCOCMD       EQU   X'80'           Echo operator command         @L8A 28084000
MDBCICMD       EQU   X'40'           Echo internal command         @L8A 28089300
MDBCWTL        EQU   X'20'           Result of WTL macro           @L8A 28094600
MDBCOJID       DS    CL8             Originating Job ID                 28100000
MDBCKEY        DS    CL8             Retrieval key (Source: WTO)   @P7C 28150000
MDBCAUTO       DS    CL8             Automation token                   28200000
MDBCCART       DS    CL8             Command and Response Token        *28233300
                                     (Source: WTO)                 @P7C 28266600
MDBCCNID       DS    CL4             Console ID                         28300000
MDBCMSGT       DS    0CL2            Message type                  @D2C 28306600
MDBCMGT1       DS    B               First byte of message type        +28313200
                                     flags                         @D2A 28319800
MDBMSGTA       EQU   X'80'           Display jobnames              @D2A 28326400
MDBMSGTB       EQU   X'40'           Display status                @D2A 28333000
MDBMSGTC       EQU   X'20'           Monitor active                @D2A 28339600
MDBMSGTD       EQU   X'10'           Indicates existence of QID field  +28346200
                                     in WPL  (AOS/1)               @D2A 28352800
MDBRSV13       EQU   X'08'           Reserved                      @D2A 28359400
MDBMSGTF       EQU   X'04'           Monitor SESS                  @D2A 28366000
MDBRSV14       EQU   X'02'           Reserved                      @D2A 28372600
MDBRSV15       EQU   X'01'           Reserved                      @D2A 28379200
MDBCMGT2       DS    B               Second byte of message type       +28385800
                                     flags                         @D2A 28392400
MDBCRPYL       DS    H               Reply ID Length                    28400000
MDBCRPYI       DS    CL8             Reply ID (EBCDIC representation)  +28425000
                                                                   @D1C 28450000
MDBCRSV6       DS    H               Reserved                      @D3C 28500000
MDBCTOFF       DS    CL2             Offset in the message text field  *28550000
                                     of the beginning of the msg   @P7C 28570000
MDBCRPYB       DS    BL4             Reply ID (Binary representation)  +28590000
                                                                   @P1C 28610000
MDBCAREA       DS    C               Area ID                       @P4C 28623300
MDBCRSV4       DS    CL1             Reserved                      @D2C 28636600
MDBCLCNT       DS    BL4             Number of lines in message    @D3C 28641000
MDBCOJBN       DS    CL8             Originating job name          @D3A 28645400
MDBCSPLX       DS    CL8             Sysplex name                  @D4A 28647700
MDBCXMOD       DS    0CL4            Copy of request flags (CTXTRFLG)  X28648600
                                     from the WTO user exit interface  X28649500
                                                                   @L8A 28650400
MDBCRFLG       DS    0CL3            Comm Task user exit requests  @L8A 28651300
MDBCRFB1       DS    B               Request flags byte one        @L8A 28652200
MDBCRCMT       EQU   X'80'           Message text was changed      @L8A 28653100
MDBCRCRC       EQU   X'40'           Routing code(s) were changed  @L8A 28654000
MDBCRCDC       EQU   X'20'           Descriptor code(s) were changed   X28654900
                                                                   @L8A 28655800
MDBCRQPC       EQU   X'10'           Queued to a particular active     X28656700
                                     console                       @L8A 28657600
MDBCRQUN       EQU   X'08'           Queued to a particular console    X28658500
                                     unconditionally               @L8A 28659400
MDBCRQRC       EQU   X'04'           Queued by routing codes only  @L8A 28660300
MDBCRCCN       EQU   X'02'           Console ID was changed        @L8A 28661200
MDBCRPML       EQU   X'01'           Minor lines were processed    @L8A 28662100
MDBCRFB2       DS    B               Request flags byte two        @L8A 28663000
MDBCRDTM       EQU   X'80'           Message was deleted           @L8A 28663900
MDBCROMS       EQU   X'40'           MPF suppression Overrided     @L8A 28664800
MDBCRFHC       EQU   X'20'           Hardcopy forced               @L8A 28665700
MDBCRNHC       EQU   X'10'           No hardcopy forced            @L8A 28666600
MDBCRHCO       EQU   X'08'           Only hardcopy forced          @L8A 28667500
MDBCRBCA       EQU   X'04'           Broadcasted message to active     X28668400
                                     consoles                      @L8A 28669300
MDBCRBCN       EQU   X'02'           Did not broadcast message         X28670200
                                     to active consoles            @L8A 28671100
MDBCRNRT       EQU   X'01'           AMRF did not retain this msg      X28672000
                                                                   @L8A 28672900
MDBCRFB3       DS    B               Request flags byte three      @L8A 28673800
MDBCRRET       EQU   X'80'           AMRF retained this msg        @L8A 28674700
MDBCRCKY       EQU   X'40'           Changed the retrieval key     @L8A 28675600
MDBCRCFC       EQU   X'20'           Changed the 4-byte console id @L8A 28676500
MDBCRCMF       EQU   X'10'           Changed the message type flags    X28677400
                                                                   @L8A 28678300
MDBCRANO       EQU   X'08'           Automation was not required   @L8A 28679200
MDBCRAYS       EQU   X'04'           Automation was required and/or    X28680100
                                     automation token updated      @L8A 28681000
MDBCQHCO       EQU   X'02'           Message issued hardcopy only  @L8A 28681900
MDBCHUD        EQU   X'01'           UD to hardcopy flag           @L8A 28682800
MDBCSUPB       DS    B               Suppression byte              @L8A 28683700
MDBCSNSV       EQU   X'80'           Not serviced by any WTO user exit X28684600
                                     routine                       @L8A 28685500
MDBCSEER       EQU   X'40'           Estae error in ieavx600       @L8A 28686400
MDBCSNSI       EQU   X'20'           Not serviced because of an        X28687300
                                     incompatible request          @L8A 28688200
MDBCSAUT       EQU   X'10'           Indicate automation specified @L8A 28689100
MDBCSQED       EQU   X'08'           Not queued to any console     @L8A 28690000
MDBCSSSI       EQU   X'04'           Suppressed by a subsystem     @L8A 28690900
MDBCSWTO       EQU   X'02'           Suppressed by a WTO user exit     X28691800
                                     routine                       @L8A 28692700
MDBCSMPF       EQU   X'01'           Suppressed by MPF             @L8A 28693600
MDBCCNNM       DS    CL8             Console name                  @D5A 28693900
MDBCMCSF       DS    0CL2            MCS flags from WPL            @D5A 28694500
MDBMCSF1       DS    B               First byte of MCS flags       @D5A 28695100
MDBMCSA        EQU   X'80'           Route/Descriptor code fields      X28695300
                                     present                       @03A 28695500
MDBMCSB        EQU   X'40'           MCSFLAG=REG0 was specified    @D5A 28695700
MDBMCSC        EQU   X'20'           MCSFLAG=RESP was specified    @03A 28695800
MDBMCSD        EQU   X'10'           Message type field exists     @03A 28695900
MDBMCSE        EQU   X'08'           MCSFLAG=REPLY was specified   @03A 28696000
MDBMCSF        EQU   X'04'           MCSFLAG=BRDCST was specified  @03A 28696100
MDBMCSG        EQU   X'02'           MCSFLAG=HRDCPY was specified  @03A 28696200
MDBMCSH        EQU   X'01'           MCSFLAG=QREG0 was specified   @D5A 28696300
MDBMCSF2       DS    B               Second byte of MCS flags      @D5A 28696900
MDBMCSI        EQU   X'80'           MCSFLAG=NOTIME was specified  @D5A 28697500
MDBMCSJ        EQU   X'40'           MLWTO indicator               @03A 28697700
MDBMCSK        EQU   X'20'           Primary subsystem use         @03A 28697900
MDBMCSL        EQU   X'10'           Extended WPL used             @03A 28698100
MDBMCSM        EQU   X'08'           MCSFLAG= CMD was specified    @03A 28698300
MDBMCSN        EQU   X'04'           MCSFLAG=NOCPY was specified   @03A 28698500
MDBMCSO        EQU   X'02'           WQEBLK used                   @03A 28698700
MDBCRSV1       DS    CL2             Reserved                      @D5C 28698900
********************************************************************    28699300
*                                                                       28700000
* Message text object for the message block                             28750000
*                                                                       28800000
********************************************************************    28850000
MDBT           DSECT                 Start of text object               28900000
MDBTLEN        DS    H               Text object length                 29000000
MDBTTYPE       DS    CL2             Text object type                   29050000
MDBTOBJ        EQU   X'0004'         Type for message text object       29100000
MDBTLNTY       DS    0CL2            Line type flags - 2 bytes          29150000
MDBTLNT1       DS    CL1             Line type flags byte 1             29200000
MDBTCONT       EQU   X'80'           Control text                       29250000
MDBTLABT       EQU   X'40'           Label text                         29300000
MDBTDATT       EQU   X'20'           Data text                          29350000
MDBTENDT       EQU   X'10'           End text                           29400000
MDBTPROT       EQU   X'08'           Prompt text                        29450000
MDBTRSV1       EQU   X'04'           Reserved                      @D3C 29500000
MDBTRSV2       EQU   X'02'           Reserved                      @D3C 29550000
MDBTLNT2       DS    CL1             Line type flags byte 2             29600000
MDBTFPAF       EQU   X'01'           Text object presentation attribute+29637500
                                     field overrides general object    +29675000
                                     presentation attribute field  @L4C 29712500
MDBTMTPA       DS    0XL4            Presentation attribute        @P3C 29750000
MDBTPCON       DS    XL1             Presentation control field    @P3C 29850000
MDBTPCOL       DS    XL1             Presentation color field      @P3C 29900000
MDBTPHIL       DS    XL1             Presentation highlighting     @P3C 29950000
MDBTPINT       DS    XL1             Presentation intensity        @P3C 30000000
MDBTMSGT       EQU   *               Message text field            @P7C 30016600
MDBTMBOB       EQU   MDBTMSGT-MDBT   Length of the message text object +30033200
                                     minus the text field.  This can be+30049800
                                     used to compute the text field    +30066400
                                     length (i.e.MDBTLEN-MDBTMBOB) @P7A 30083000
********************************************************************    30100000
*                                                                       30150000
* Presentation Attributes Equates                                       30200000
*                                                                       30250000
********************************************************************    30300000
* CONTROL ATTRIBUTES                                                    30350000
MDBSNALM       EQU   X'80'           Sound note alarm (presentation    *30383300
                                     device's 'beep' alarm)        @P7C 30416600
* COLOR ATTRIBUTES                                                      30450000
MDBBLACK       EQU   X'F0'           Presentation  background-black on +30500000
                                     display, white on printer          30550000
MDBBLUE        EQU   X'F1'           Color is blue                      30600000
MDBRED         EQU   X'F2'           Color is red                       30650000
MDBPINK        EQU   X'F3'           Color is pink (magenta)            30700000
MDBGREEN       EQU   X'F4'           Color is  green                    30750000
MDBTURQ        EQU   X'F5'           Color is turquoise (cyan)          30800000
MDBYELOW       EQU   X'F6'           Color is  yellow                   30850000
MDBWHITE       EQU   X'F7'           Presentation  neutral-white on    +30900000
                                     display, black on a printer   @P4C 30950000
* HIGHLIGHTING ATTRIBUTES                                               31000000
MDBHNONE       EQU   X'00'           No highlighting is in effect       31050000
MDBBLINK       EQU   X'F1'           Blinking highlight                 31100000
MDBRVIDO       EQU   X'F2'           Reverse video highlight            31150000
MDBUNDER       EQU   X'F4'           Underscore highlight               31200000
* INTENSITY ATTRIBUTES                                                  31250000
MDBINORM       EQU   X'E4'           Normal intensity                   31300000
MDBIHIGH       EQU   X'E8'           High (bright) intensity            31350000
          MEND  ,  */                                                   31400000
*                                                                       31450000
* %MDBPLS:;                                                             31500000
* %MDBLPUSH = '@LISTPUSH';          /* Equate for listing control    */ 31550000
* %MDBLPOP = '@LISTPOP';            /* Equate for listing control    */ 31600000
* %MDBLOFF = '@LISTOFF';            /* Equate for listing control    */ 31650000
* MDBLPUSH;                         /* @LISTPUSH                     */ 31700000
* %IF MDBVIA = 'YES' %THEN          /* Check if MDB ALET is specified*/ 31750000
*   %MDBVIA = 'VIA(MDBALET)';       /* Set VIA to specified value    */ 31800000
* %ELSE                                                                 31850000
*   %IF GLOBALARMODE = 'YES' %THEN  /* MDB ALET not specified-check if  31900000
*                                      global default specified  @P4C*/ 31950000
*     %MDBVIA = 'VIA(0)';           /* If yes then set global        */ 32000000
*   %ELSE                                                               32050000
*     %MDBVIA = '';                 /* If no then set to nulls       */ 32100000
*                                                                       32150000
* %IF IHALIST = 'YES' %THEN                                             32200000
*   %GOTO MDBZ1;                                                        32250000
* MDBLOFF;                                                              32300000
* %MDBZ1 : ;                                                            32350000
*/********************************************************************/ 32400000
*/*                                                                  */ 32450000
*/* MDB object (Main header for the block)                           */ 32500000
*/*                                                                  */ 32550000
*/********************************************************************/ 32600000
*  DECLARE                                                              32650000
*    1 MDB     BDY(HWORD) MDBVIA BASED(MDBPTR),                         32700000
*                                   /* Start of MDB header           */ 32750000
*      3 MDBLEN     FIXED(16),      /*  MDB length               @PBC*/ 32800000
*      3 MDBTYPE    CHAR(2),        /*  MDB type                     */ 32850000
*      3 MDBMID     CHAR(4),        /*  Acronym 'MDB'                */ 32900000
*      3 MDBVER     BIT(32);        /*  Revision code                */ 32950000
*/********************************************************************/ 33000000
*/*                                                                  */ 33050000
*/* General object for the message data block                        */ 33100000
*/*                                                                  */ 33150000
*/********************************************************************/ 33200000
*  DECLARE                                                              33250000
*    1  MDBG   BDY(HWORD) MDBVIA BASED,                                 33300000
*                                   /*  General object section       */ 33350000
*      3 MDBGLEN     FIXED(15),     /*  General object length        */ 33400000
*      3 MDBGTYPE    CHAR(2),       /*  General object type          */ 33450000
*      3 MDBGMID     BIT(32),       /*  Message ID               @P4C*/ 33500000
*        5 MDBGSYID  CHAR(1),       /*  System ID                @L1A*/ 33550000
*        5 MDBGSEQ   BIT(24),       /*  Sequence number          @L1A*/ 33600000
*      3 MDBGTIMH    CHAR(8),       /*  Time stamp HH.MM.SS format   */ 33650000
*      3 MDBGTIMT    CHAR(3),       /*  Time stamp .TH format        */ 33700000
*      3 MDBGRSV1    CHAR(1),       /*  Reserved                 @P4C*/ 33750000
*      3 MDBGDSTP    CHAR(7),       /*  Date stamp                   */ 33800000
*      3 MDBGRSV2    CHAR(1),       /*  Reserved                 @P4C*/ 33850000
*      3 MDBGMFLG    BIT(16),       /*  Message flags                */ 33900000
*        5 MDBGDOM    BIT(1),       /*  DOM bit.  If this bit is on it  33929100
*                                       indicates that this MDB is for  33958200
*                                       a DOM.  The DOM information     33987300
*                                       can be found in the DOM flags   34016400
*                                       in the control program object   34045500
*                                       (MDBDOMFL)               @P7C*/ 34074600
*        5 MDBGALRM   BIT(1),       /*  Sound warning alarm (processor  34104300
*                                       controller only)         @P7C*/ 34127000
*        5 MDBGHOLD   BIT(1),       /*  Hold bit, Hold message until    34150000
*                                       DOMed or deleted via other      34200000
*                                       external means               */ 34250000
*        5 *          BIT(13),      /*  Reserved                 @L4A*/ 34275000
*      3 MDBGRSV3    CHAR(2),       /*  Reserved                 @P4C*/ 34300000
*/********************************************************************/ 34307100
*/*                                                                  */ 34314200
*/* The constants for the following fields can be found in       @P7A*/ 34321300
*/* section PRESENTATION ATTRIBUTES EQUATES                      @P7A*/ 34328400
*/*                                                                  */ 34335500
*/********************************************************************/ 34342600
*      3 MDBGFGPA    CHAR(4),       /*  Foreground presentation         34350000
*                                       attributes                   */ 34400000
*        5 MDBGFCON    BIT(8),      /*  Foreground control       @L4C*/ 34450000
*        5 MDBGFCOL    BIT(8),      /*  Foreground color         @L4C*/ 34500000
*        5 MDBGFHIL    BIT(8),      /*  Foreground highlighting  @L4C*/ 34550000
*        5 MDBGFINT    BIT(8),      /*  Foreground intensity     @L4C*/ 34600000
*      3 MDBGBGPA    CHAR(4),       /*  Background presentation         34650000
*                                       attributes                   */ 34700000
*        5 MDBGBCON    BIT(8),      /*  Background control       @L4C*/ 34750000
*        5 MDBGBCOL    BIT(8),      /*  Background color         @L4C*/ 34800000
*        5 MDBGBHIL    BIT(8),      /*  Background highlighting  @L4C*/ 34850000
*        5 MDBGBINT    BIT(8),      /*  Background intensity     @L4C*/ 34900000
*      3 MDBGOSNM    CHAR(8),       /*  Originating system name      */ 34950000
*      3 MDBGJBNM    CHAR(8);       /*  Job name                     */ 35000000
*/********************************************************************/ 35050000
*/*                                                                  */ 35100000
*/* Control program object for the message data block                */ 35150000
*/*                                                                  */ 35200000
*/********************************************************************/ 35250000
*  DECLARE                                                              35300000
*    1  MDBSCP BDY(HWORD) MDBVIA BASED,                                 35350000
*                                   /*  Control program section      */ 35400000
*      3 MDBCLEN       FIXED(15),   /*  Control prog object len  @P7C*/ 35450000
*      3 MDBCTYPE      CHAR(2),     /*  Object type                  */ 35500000
*      3 MDBCPROD      CHAR(16),    /*  Originating system identifier   35512500
*                                                                @P5C*/ 35525000
*          7 MDBCVER   BIT(32),     /*  MVS CP object version level     35537500
*                                                                @P5A*/ 35550000
*          7 MDBCPNAM  CHAR(4),     /*  Control Program name     @P5A*/ 35562500
*          7 MDBCFMID  CHAR(8),     /*  FMID of originating system      35575000
*                                                                @P5A*/ 35587500
*      3 MDBCERC       CHAR(16),    /*  Routing codes                   35597900
*                                      1st bit =Route Code 1            35608300
*                                      2nd bit =Route Code 2            35618700
*                                            .  .  .                    35629100
*                                      128th bit =Route Code 128 @P7C*/ 35639500
*      3 MDBCDESC      CHAR(2),     /*  Descriptor codes             */ 35650000
*        5 MDBDESC1    BIT(8),      /*  Descriptor byte 1        @L1A*/ 35652200
*          7 MDBDESCA  BIT(1),      /*  System failure           @L1A*/ 35654400
*          7 MDBDESCB  BIT(1),      /*  Immediate action required       35656600
*                                                                @L1A*/ 35658800
*          7 MDBDESCC  BIT(1),      /*  Eventual action required @L1A*/ 35661000
*          7 MDBDESCD  BIT(1),      /*  System status            @L1A*/ 35663200
*          7 MDBDESCE  BIT(1),      /*  Immediate command response      35665400
*                                                                @L1A*/ 35667600
*          7 MDBDESCF  BIT(1),      /*  Job status               @L1A*/ 35669800
*          7 MDBDESCG  BIT(1),      /*  Application program/processor   35672000
*                                                                @L1A*/ 35674200
*          7 MDBDESCH  BIT(1),      /*  Out-of-line              @L1A*/ 35676400
*        5 MDBDESC2    BIT(8),      /*  Descriptor byte 2        @L1A*/ 35678600
*          7 MDBDESCI  BIT(1),      /*  Operator's request       @L1A*/ 35680800
*          7 MDBDESCJ  BIT(1),      /*  Track command response   @L1A*/ 35683000
*          7 MDBDESCK  BIT(1),      /*  Critical eventual action @L1A*/ 35685200
*          7 MDBDESCL  BIT(1),      /*  Important information    @P7C*/ 35687400
*          7 MDBDESCM  BIT(1),      /*  Previously automated     @L5C*/ 35689600
*          7 MDBDESCN  BIT(1),      /*  Reserved                 @L1A*/ 35691800
*          7 MDBDESCO  BIT(1),      /*  Reserved                 @L1A*/ 35694000
*          7 MDBDESCP  BIT(1),      /*  Reserved                 @L1A*/ 35696200
*      3 MDBCMLVL      CHAR(2),     /*  Message level                */ 35700000
*        5 MDBMLVL1    BIT(8),      /*  Message level byte 1     @L1A*/ 35702600
*          7 MDBMLR    BIT(1),      /*  WTOR                     @L1A*/ 35705200
*          7 MDBMLIA   BIT(1),      /*  Immediate action         @L1A*/ 35707800
*          7 MDBMLCE   BIT(1),      /*  Critical eventual action @L1A*/ 35710400
*          7 MDBMLE    BIT(1),      /*  Eventual action          @L1A*/ 35713000
*          7 MDBMLI    BIT(1),      /*  Informational            @L1A*/ 35715600
*          7 MDBMLBC   BIT(1),      /*  Broadcast                @L1A*/ 35718200
*          7 MDBMLRSG  BIT(1),      /*  Reserved                 @L1A*/ 35720800
*          7 MDBMLRSH  BIT(1),      /*  Reserved                 @L1A*/ 35723400
*        5 MDBMLVL2    BIT(8),      /*  Message level byte 2     @L1A*/ 35726000
*          7 MDBMLRSI  BIT(1),      /*  Reserved                 @L1A*/ 35728600
*          7 MDBMLRSJ  BIT(1),      /*  Reserved                 @L1A*/ 35731200
*          7 MDBMLRSK  BIT(1),      /*  Reserved                 @L1A*/ 35733800
*          7 MDBMLRSL  BIT(1),      /*  Reserved                 @L1A*/ 35736400
*          7 MDBMLRSM  BIT(1),      /*  Reserved                 @L1A*/ 35739000
*          7 MDBMLRSN  BIT(1),      /*  Reserved                 @L1A*/ 35741600
*          7 MDBMLRSO  BIT(1),      /*  Reserved                 @L1A*/ 35744200
*          7 MDBMLRSP  BIT(1),      /*  Reserved                 @L1A*/ 35746800
*      3 MDBCATTR      CHAR(2),     /*  Message Attribute flags      */ 35750000
*        5 MDBCATT1    CHAR(1),     /*  First byte of attributes     */ 35800000
*          7 MDBCSUPP  BIT(1),      /*  Message is suppressed    @P9A*/ 35850000
*          7 MDBCMCSC  BIT(1),      /*  Message is command response  */ 35900000
*          7 MDBCAUTH  BIT(1),      /*  Message issued by authorized    35950000
*                                       program                      */ 36000000
*          7 MDBCRETN  BIT(1),      /*  Message is retained by          36050000
*                                       AMRF                     @P7C*/ 36100000
*          7 MDBCSPVD  BIT(1),      /*  WQE Backlog Message      @01A*/ 36133300
*          7 MDBCQNLY  BIT(1),      /*  Console only             @02A*/ 36155500
*          7 *         BIT(2),      /*  Reserved                 @02C*/ 36177700
*        5 MDBCATT2    CHAR(1),     /*  Second byte of attributes    */ 36200000
*      3 MDBCPRTY      FIXED(15),   /*  Message priority             */ 36250000
*      3 MDBCRSV5      FIXED(15),   /*  Reserved                 @D3C*/ 36300000
*      3 MDBCASID      FIXED(15),   /*  ASID of issuer               */ 36350000
*      3 MDBCTCB       BIT(32),     /*  Job Step TCB for issuer  @P6C*/ 36400000
*      3 MDBCTOKN      BIT(32),     /*  Token                        */ 36450000
*      3 MDBCSYID      BIT(8),      /*  System ID                @P4C*/ 36500000
*      3 MDBDOMFL      BIT(8),      /*  DOM flags                    */ 36550000
*        5 MDBDMSGI    BIT(1),      /*  DOM by message ID (can be       36583300
*                                       found in MDBGMID)        @P7C*/ 36616600
*        5 MDBDSYSI    BIT(1),      /*  DOM by system ID             */ 36650000
*        5 MDBDASID    BIT(1),      /*  DOM by ASID                  */ 36700000
*        5 MDBDJTCB    BIT(1),      /*  DOM by job step TCB          */ 36750000
*        5 MDBDTOKN    BIT(1),      /*  DOM by token                 */ 36800000
*        5 *           BIT(3),      /*  Reserved                     */ 36850000
*      3 MDBCMISC      BIT(8),      /*  Miscellaneous Routing Info      36866600
*                                                                @L2A*/ 36883200
*        5 MDBCUD      BIT(1),      /*  Display UD messages      @L2A*/ 36899800
*        5 MDBCFUDO    BIT(1),      /*  Display only UD messages @L2A*/ 36910800
*        5 MDBCFIDO    BIT(1),      /*  Queue by ID only         @D3A*/ 36916300
*        5 MDBCAUT     BIT(1),      /*  QUEUE via Automation     @L5A*/ 36921800
*        5 MDBCHC      BIT(1),      /*  QUEUE via Hardcopy       @L6A*/ 36925500
*        5 *           BIT(3),      /*  Reserved                 @L6C*/ 36929200
*      3 MDBCMSC2      BIT(8),      /*  Miscellaneous OPERLOG info      36932100
*                                                                @L8C*/ 36935000
*        5 MDBCOCMD    BIT(1),      /*  Echo operator command    @L8A*/ 36937900
*        5 MDBCICMD    BIT(1),      /*  Echo internal command    @L8A*/ 36940800
*        5 MDBCWTL     BIT(1),      /*  Result of WTL macro      @L8A*/ 36943700
*        5 *           BIT(5),      /*  Reserved                 @L8A*/ 36946600
*      3 MDBCOJID      CHAR(8),     /*  Originating Job ID           */ 36950000
*      3 MDBCKEY       CHAR(8),     /*  Retrieval key (Source: WTO)     36983300
*                                                                @P7C*/ 37016600
*      3 MDBCAUTO      CHAR(8),     /*  Automation token             */ 37050000
*      3 MDBCCART      CHAR(8),     /*  Command and Response token      37083300
*                                       (Source: WTO)            @P7C*/ 37116600
*      3 MDBCCNID      CHAR(4),     /*  Console ID                   */ 37150000
*      3 MDBCMSGT      CHAR(2),     /*  Message type                 */ 37200000
*        5 MDBCMGT1  BIT(8),        /*  First byte of message type      37203500
*                                       flags                    @D2A*/ 37207000
*          7 MDBMSGTA BIT(1),       /*  Display jobnames         @D2A*/ 37210500
*          7 MDBMSGTB BIT(1),       /*  Display status           @D2A*/ 37214000
*          7 MDBMSGTC BIT(1),       /*  Monitor active           @D2A*/ 37217500
*          7 MDBMSGTD BIT(1),       /*  Indicates existence of QID      37221000
*                                       field in WPL (AOS/1)     @D2A*/ 37224500
*          7 MDBRSV13 BIT(1),       /*  Reserved                 @D2A*/ 37228000
*          7 MDBMSGTF BIT(1),       /*  Monitor SESS             @D2A*/ 37231500
*          7 MDBRSV14 BIT(1),       /*  Reserved                 @D2A*/ 37235000
*          7 MDBRSV15 BIT(1),       /*  Reserved                 @D2A*/ 37238500
*        5 MDBCMGT2   BIT(8),       /*  Second byte of message type     37242000
*                                       flags                    @D2A*/ 37245500
*      3 MDBCRPYL      FIXED(16),   /*  Reply ID Length              */ 37250000
*      3 MDBCRPYI      CHAR(8) VARYING(MDBCRPYL),                       37300000
*                                   /*  Reply ID (EBCDIC                37333300
*                                       representation)          @D1C*/ 37366600
*      3 MDBCRSV6      FIXED(15),   /*  Reserved                 @D3C*/ 37391200
*      3 MDBCTOFF      FIXED(15),   /*  Offset in the message text      37415800
*                                       field of the beginning of the   37440400
*                                       message                  @P7C*/ 37465000
*      3 MDBCRPYB      FIXED(31) BDY(HWORD), /* Reply ID (Binary        37490000
*                                       representation)          @P4C*/ 37510000
*      3 MDBCAREA      CHAR(1),     /*  Area ID                  @D2A*/ 37523300
*      3 MDBCRSV4      CHAR(1),     /*  Reserved                 @D3C*/ 37529900
*      3 MDBCLCNT      FIXED(31) BDY(HWORD), /* Number of lines in      37534300
*                                       the message              @D3C*/ 37538700
*      3 MDBCOJBN      CHAR(8),     /*  Originating job name     @D3A*/ 37542400
*      3 MDBCSPLX      CHAR(8),     /*  Sysplex name             @L8C*/ 37543100
*      3 MDBCXMOD CHAR(4),          /*  Copy of request flags           37543800
*                                       (CTXTRFLG) from the WTO         37544500
*                                       user exit interface             37545200
*                                       routine                  @L8A*/ 37545900
*       4 MDBCRFLG,                 /*  Comm Task user exit             37546600
*                                       requests                 @L8A*/ 37547300
*        5 MDBCRFB1 BIT(8),         /*  Request flags byte              37548000
*                                       one                      @L8A*/ 37548700
*         6 MDBCRCMT BIT(1),        /*  Message text was changed        37549400
*                                                                @L8A*/ 37550100
*         6 MDBCRCRC BIT(1),        /*  Routing code(s) were changed    37550800
*                                                                @L8A*/ 37551500
*         6 MDBCRCDC BIT(1),        /*  Descriptor code(s) were         37552200
*                                       changed                  @L8A*/ 37552900
*         6 MDBCRQPC BIT(1),        /*  Queued to a particular          37553600
*                                       active console           @L8A*/ 37554300
*         6 MDBCRQUN BIT(1),        /*  Queued to a particular          37555000
*                                       console unconditionally         37555700
*                                                                @L8A*/ 37556400
*         6 MDBCRQRC BIT(1),        /*  Queued by routing codes         37557100
*                                       only                     @L8A*/ 37557800
*         6 MDBCRCCN BIT(1),        /*  Console ID was changed          37558500
*                                                                @L8A*/ 37559200
*         6 MDBCRPML BIT(1),        /*  Minor lines were processed      37559900
*                                                                @L8A*/ 37560600
*        5 MDBCRFB2 BIT(8),         /*  Request flags byte              37561300
*                                       two                      @L8A*/ 37562000
*         6 MDBCRDTM BIT(1),        /*  Message was deleted      @L8A*/ 37562700
*         6 MDBCROMS BIT(1),        /*  MPF supression overrided        37563400
*                                                                @L8A*/ 37564100
*         6 MDBCRFHC BIT(1),        /*  Hardcopy forced          @L8A*/ 37564800
*         6 MDBCRNHC BIT(1),        /*  No hardcopy forced       @L8A*/ 37565500
*         6 MDBCRHCO BIT(1),        /*  Only hardcopy forced     @L8A*/ 37566200
*         6 MDBCRBCA BIT(1),        /*  Broadcasted message to          37566900
*                                       active consoles          @L8A*/ 37567600
*         6 MDBCRBCN BIT(1),        /*  Did not broadcast message       37568300
*                                       to active consoles       @L8A*/ 37569000
*         6 MDBCRNRT BIT(1),        /*  AMRF did not retain this        37569700
*                                       msg                      @L8A*/ 37570400
*        5 MDBCRFB3 BIT(8),         /*  Request flags byte three        37571100
*                                                                @L8A*/ 37571800
*         6 MDBCRRET BIT(1),        /*  AMRF retained this              37572500
*                                       msg                      @L8A*/ 37573200
*         6 MDBCRCKY BIT(1),        /*  Changed the retrieval key       37573900
*                                                                @L8A*/ 37574600
*         6 MDBCRCFC BIT(1),        /*  Changed the 4-byte console      37575300
*                                       ID                       @L8A*/ 37576000
*         6 MDBCRCMF BIT(1),        /*  Changed the message type        37576700
*                                       flags                    @L8A*/ 37577400
*         6 MDBCRANO BIT(1),        /*  Automation was not required     37578100
*                                                                @L8A*/ 37578800
*         6 MDBCRAYS BIT(1),        /*  Automation was required         37579500
*                                       and/or automation token         37580200
*                                       updated                  @L8A*/ 37580900
*         6 MDBCQHCO BIT(1),        /*  Message issued as hardcopy      37581600
*                                       only                     @L8A*/ 37582300
*         6 MDBCHUD  BIT(1),        /*  UD to hardcopy flag      @L8A*/ 37583000
*       4 MDBCSUPB BIT(8),          /*  Suppression byte         @L8A*/ 37583700
*        5 MDBCSNSV BIT(1),         /*  Not serviced by any WTO         37584400
*                                       user exit routine        @L8A*/ 37585100
*        5 MDBCSEER BIT(1),         /*  Estae error in ieavx600         37585800
*                                                                @L8A*/ 37586500
*        5 MDBCSNSI BIT(1),         /*  Not serviced because of         37587200
*                                       an incompatible request         37587900
*                                                                @L8A*/ 37588600
*        5 MDBCSAUT BIT(1),         /*  Indicates automation            37589300
*                                       specified                @L8A*/ 37590000
*        5 MDBCSQED BIT(1),         /*  Not queued to any console       37590700
*                                                                @L8A*/ 37591400
*        5 MDBCSSSI BIT(1),         /*  Suppressed by a subsystem       37592100
*                                                                @L8A*/ 37592800
*        5 MDBCSWTO BIT(1),         /*  Suppressed by a WTO user        37593500
*                                       exit routine             @L8A*/ 37594200
*        5 MDBCSMPF BIT(1),         /*  Suppressed by MPF        @L8A*/ 37594900
*      3 MDBCCNNM      CHAR(8),     /*  Console name             @D5A*/ 37595100
*      3 MDBCMCSF CHAR(2),          /*  MCS flags from WPL       @D5A*/ 37595700
*        5 MDBMCSF1 BIT(8),         /*  First byte of MCS flags  @D5A*/ 37596300
*          7 MDBMCSA  BIT(1),       /*  Route/Descriptor code fields    37596700
*                                       present                  @03A*/ 37597100
*          7 MDBMCSB  BIT(1),       /*  MCSFLAG=REG0 was specified      37597500
*                                                                @D5A*/ 37598300
*          7 MDBMCSC  BIT(1),       /*  MCSFLAG=RESP was specified      37600100
*                                                                @03A*/ 37601900
*          7 MDBMCSD  BIT(1),       /*  Message type field exists       37603700
*                                                                @03A*/ 37605500
*          7 MDBMCSE  BIT(1),       /*  MCSFLAG=REPLY was specified     37607300
*                                                                @03A*/ 37609100
*          7 MDBMCSF  BIT(1),       /*  MCSFLAG=BRDCST was specified    37610900
*                                                                @03A*/ 37612700
*          7 MDBMCSG  BIT(1),       /*  MCSFLAG=HRDCPY was specified    37614500
*                                                                @03A*/ 37616300
*          7 MDBMCSH  BIT(1),       /*  MCSFLAG=QREG0 was specified     37618100
*                                                                @D5A*/ 37619900
*        5 MDBMCSF2 BIT(8),         /*  Second byte of MCS flags @D5A*/ 37621700
*          7 MDBMCSI  BIT(1),       /*  MCSFLAG=NOTIME was specified    37623500
*                                                                @D5A*/ 37625300
*          7 MDBMCSJ  BIT(1),       /*  MLWTO indicator          @03A*/ 37627100
*          7 MDBMCSK  BIT(1),       /*  Primary subsytem use     @03A*/ 37628900
*          7 MDBMCSL  BIT(1),       /*  Extended WPL used        @03A*/ 37630700
*          7 MDBMCSM  BIT(1),       /*  MCSFLAG=CMD was specified       37632500
*                                                                @03A*/ 37634300
*          7 MDBMCSN  BIT(1),       /*  MCSFLAG=NOCPY was specified     37636100
*                                                                @03A*/ 37637900
*          7 MDBMCSO  BIT(1),       /*  WQEBLK used              @03A*/ 37639700
*          7 *        BIT(1),       /*                           @03A*/ 37641500
*      3 MDBCRSV1 CHAR(2);          /*  Reserved                 @D5C*/ 37643300
*/********************************************************************/ 37645100
*/*                                                                  */ 37646900
*/* Message text object for the message block                        */ 37650000
*/*                                                                  */ 37700000
*/********************************************************************/ 37750000
*  DECLARE                                                              37800000
*    1  MDBT   BDY(HWORD) MDBVIA BASED,                                 37850000
*                                   /*  Start of text object         */ 37900000
*     3 MDBTF,                      /*  Start of fixed object        */ 37950000
*      5 MDBTLEN     FIXED(15),     /*  Text object length           */ 38000000
*      5 MDBTTYPE    CHAR(2),       /*  Text object type             */ 38050000
*      5 MDBTLNTY    BIT(16),       /*  Line type flags - 2 bytes    */ 38100000
*         7 MDBTLNT1 BIT(8),        /*  Line type flags, byte 1      */ 38150000
*            9 MDBTCONT BIT(1),     /*  Control text                 */ 38200000
*            9 MDBTLABT BIT(1),     /*  Label text                   */ 38250000
*            9 MDBTDATT BIT(1),     /*  Data text                    */ 38300000
*            9 MDBTENDT BIT(1),     /*  End text                     */ 38350000
*            9 MDBTPROT BIT(1),     /*  Prompt text                  */ 38400000
*            9 MDBTRSV1 BIT(1),     /*  Reserved                 @D3C*/ 38450000
*            9 MDBTRSV2 BIT(1),     /*  Reserved                 @D3C*/ 38500000
*            9 *        BIT(1),     /*  Reserved                     */ 38550000
*         7 MDBTLNT2 BIT(8),        /*  Line type flags, byte 2      */ 38600000
*            9 *        BIT(7),     /*  Reserved                     */ 38650000
*            9 MDBTFPAF BIT(1),     /*  Text object presentation        38680000
*                                       attribute field overrides       38710000
*                                       general object presentation     38740000
*                                       attribute field          @L4C*/ 38770000
*      5 MDBTMTPA    CHAR(4),       /*  Presentation attribute   @L1C*/ 38800000
*        7 MDBTPCON    BIT(8),      /*  Presentation control     @L4C*/ 38850000
*        7 MDBTPCOL    BIT(8),      /*  Presentation color       @L4C*/ 38900000
*        7 MDBTPHIL    BIT(8),      /*  Presentation highlighting       38950000
*                                                                @L4C*/ 39000000
*        7 MDBTPINT    BIT(8),      /*  Presentation intensity   @L4C*/ 39050000
*     3 MDBTV,                      /*  Variable portion             */ 39100000
*      5 MDBTMSGT    CHAR(*);       /* Message text field               39150000
*                                   -the length of this field will vary 39200000
*                                   depending on the length of the line 39250000
*                                   of text being passed             */ 39300000
*/********************************************************************/ 39350000
*/*                                                                  */ 39400000
*/*             ACRONYM CONSTANT                                     */ 39450000
*/*                                                                  */ 39500000
*/********************************************************************/ 39550000
* DECLARE                                                               39600000
*  MDBACR   CHAR(4)  CONSTANT('MDB '); /* Eye catcher main header    */ 39650000
*/********************************************************************/ 39700000
*/*                                                                  */ 39750000
*/*             VERSION LEVEL CONSTANTS                              */ 39800000
*/*                                                                  */ 39850000
*/********************************************************************/ 39900000
* DECLARE                                                               39950000
*  MDBVER1   BIT(32)   CONSTANT('00000001'X),  /* Revision code 1    */ 40000000
*  MDBVID    BIT(32)   CONSTANT(MDBVER1); /* Current revision code   */ 40050000
*/********************************************************************/ 40100000
*/*                                                                  */ 40150000
*/*             OBJECT/TYPE CONSTANTS                                */ 40250000
*/*                                                                  */ 40300000
*/********************************************************************/ 40350000
* DECLARE                                                               40400000
*  MDBTYP1   FIXED(16) CONSTANT(1),    /*Type for MDB Type 1         */ 40500000
*  MDBGOBJ   FIXED(16) CONSTANT(1),    /*Type for general object     */ 40550000
*  MDBCOBJ   FIXED(16) CONSTANT(2),    /*Type for control program       40583300
*                                        object                  @P7C*/ 40616600
*  MDBTOBJ   FIXED(16) CONSTANT(4);    /*Type for message text object*/ 40650000
*/********************************************************************/ 40700000
*/*                                                                  */ 40750000
*/*             HEADER LENGTH CONSTANT                               */ 40755500
*/*                                                                  */ 40761000
*/********************************************************************/ 40766500
* DECLARE                                                               40772000
*  MDBHLEN   FIXED(16) CONSTANT(12);  /* Length of MDB Header section   40777500
*                                                                @P4A*/ 40783000
*/********************************************************************/ 40788500
*/*                                                                  */ 40794000
*/*             PRESENTATION ATTRIBUTE CONSTANTS                     */ 40800000
*/*                                                                  */ 40850000
*/********************************************************************/ 40900000
* DECLARE                                                               40950000
*               /* CONTROL ATTRIBUTES         */                        41000000
*  MDBSNALM BIT(8) CONSTANT('80'X),   /*Sound note alarm (presentation  41033300
*                                     device's 'beep' alarm)     @P7C*/ 41066600
*               /* COLOR ATTRIBUTES           */                        41100000
*  MDBBLACK BIT(8) CONSTANT('F0'X),   /*Presentation background-black   41150000
*                                     on display, white on printer   */ 41200000
*  MDBBLUE  BIT(8) CONSTANT('F1'X),   /*Color is blue                */ 41250000
*  MDBRED   BIT(8) CONSTANT('F2'X),   /*Color is red                 */ 41300000
*  MDBPINK  BIT(8) CONSTANT('F3'X),   /*Color is pink (magenta)      */ 41350000
*  MDBGREEN BIT(8) CONSTANT('F4'X),   /*Color is green               */ 41400000
*  MDBTURQ  BIT(8) CONSTANT('F5'X),   /*Color is turquoise (cyan)    */ 41450000
*  MDBYELOW BIT(8) CONSTANT('F6'X),   /*Color is yellow              */ 41500000
*  MDBWHITE BIT(8) CONSTANT('F7'X),   /*Presentation neutral-white on   41550000
*                                     display, black on a printer    */ 41600000
*               /* HIGHLIGHTING ATTRIBUTES    */                        41650000
*  MDBHNONE BIT(8) CONSTANT('00'X),   /*No highlighting is in effect */ 41700000
*  MDBBLINK BIT(8) CONSTANT('F1'X),   /*Blinking highlight           */ 41750000
*  MDBRVIDO BIT(8) CONSTANT('F2'X),   /*Reverse video highlight      */ 41800000
*  MDBUNDER BIT(8) CONSTANT('F4'X),   /*Underscore highlight         */ 41850000
*               /* INTENSITY ATTRIBUTES       */                        41900000
*  MDBINORM BIT(8) CONSTANT('E4'X),   /*Normal intensity        @L3C */ 41950000
*  MDBIHIGH BIT(8) CONSTANT('E8'X);   /*High (bright) intensity @L3C */ 42000000
*/********************************************************************/ 42004100
*/*                                                                  */ 42008200
*/*             CONTROL PROGRAM OBJECT CONSTANTS                 @P5A*/ 42012300
*/*                                                                  */ 42016400
*/********************************************************************/ 42020500
* DECLARE                                                               42024600
*  MDBCVER1  BIT(32)   CONSTANT('00000001'X),  /* MVS CP object         42028700
*                                               version level 1  @P5A*/ 42032800
*  MDBCVER2  BIT(32)   CONSTANT('00000002'X),  /* MVS CP JBB4422        42035200
*                                               version level 2  @L5A*/ 42036800
*  MDBCVER3  BIT(32)   CONSTANT('00000003'X),  /* MVS CP OY65627        42037900
*                                               version level 3  @P9C*/ 42039000
*  MDBCVER4  BIT(32)   CONSTANT('00000004'X),  /* MVS CP HBB5510        42040100
*                                               version level 4  @P9A*/ 42041200
*  MDBCVER5  BIT(32)   CONSTANT('00000005'X),  /* MVS CP HBB5520        42041900
*                                               version level 5  @L8A*/ 42042600
*  MDBCV10   BIT(32)   CONSTANT('00000010'X),  /* Structurally          42042700
*                                               equivalent to HBB5520   42042800
*                                               with OW20064-430 @03A*/ 42042900
*  MDBCV20   BIT(32)   CONSTANT('00000020'X),  /* Structurally          42043000
*                                               equivalent to HBB5520   42043100
*                                               with OW20064-510 @03A*/ 42043200
*  MDBCV30   BIT(32)   CONSTANT('00000030'X),  /* MVS CP HBB5520        42043300
*                                               with OW20064     @03A*/ 42043400
*  MDBCVID   BIT(32)   CONSTANT(MDBCV30), /* Current MVS CP object      42043500
*                                               version level    @L8C*/ 42044000
*  MDBCMVS   CHAR(4)   CONSTANT('MVS ');  /* CP name for MVS     @P5A*/ 42045100
*MDBLPOP;                             /*@LISTPOP                     */ 42050000
