*         %GOTO MCSCPLOG; /* BILINGUAL MAPPING                          00050000
          MACRO                                                         00100000
          IEAVG131   ,   */                                             00150000
*%MCSCPLOG: ;                                                           00200000
*/**** START OF SPECIFICATIONS ***************************************/ 00250000
*/*                                                                  */ 00300000
*/*    MACRO NAME = IEAVG131                                     @P2C*/ 00350000
*/*                                                                  */ 00400000
*/*    DESCRIPTIVE NAME  =                                       @P2C*/ 00437500
*/*        MCS Extended Console Status Area                      @P3C*/ 00475000
*/*      ACRONYM = MCSCSA                                        @P3C*/ 00512500
*/*                                                                  */ 00550000
*/*    DSECT NAME = MCSCSA                                       @P3A*/ 00566600
*/*                                                              @P3A*/ 00583200
*/*    PROPRIETARY STATEMENT=                                        */ 00599800
*/***PROPRIETARY_STATEMENT********************************************/ 00616600
*/*                                                                  */ 00649900
*/*                                                                  */ 00683200
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00716500
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00749800
*/* 5695-047 (C) COPYRIGHT IBM CORP. 1990                            */ 00783100
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00816400
*/*                                                                  */ 00850000
*/* STATUS= HBB4430                                              @P2C*/ 00875000
*/*                                                                  */ 00900000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00925000
*/*                                                                  */ 00950000
*/*                                                              @P3A*/ 00958300
*/*    COMPONENT = Communications Task (SC1CK)                   @P3A*/ 00966600
*/*                                                              @P3A*/ 00974900
*/*    EYE-CATCHER = MCSC                                        @P3A*/ 00983200
*/*      OFFSET = 0                                              @P3A*/ 00991500
*/*      LENGTH = 4                                              @P3A*/ 00999800
*/*                                                              @P3A*/ 01008100
*/*    STORAGE ATTRIBUTES =                                      @P3A*/ 01016400
*/*      SUBPOOL = N/A                                           @P3A*/ 01024700
*/*      KEY = N/A                                               @P3A*/ 01033000
*/*      RESIDENCY = Message data space for the address space    @P3A*/ 01041300
*/*                  which owns the Extended MCS Console.        @P3A*/ 01049600
*/*                                                              @P3A*/ 01057900
*/*    SIZE = 52 bytes                                           @P3A*/ 01066200
*/*                                                              @P3A*/ 01074500
*/*    METHOD OF ACCESS =                                        @P2C*/ 01082800
*/*                  BAL   - Specify IEAVG131                    @P2C*/ 01091100
*/*                          To Get:                                 */ 01100000
*/*                            'MCSCSA  DSECT'                       */ 01150000
*/*                           A using on 'MCSCSA' will give          */ 01200000
*/*                           addressability to all symbols          */ 01250000
*/*                                                                  */ 01300000
*/*                  PL/AS - Specify %INCLUDE SYSLIB(IEAVG131)   @P2C*/ 01350000
*/*                          To Get:                                 */ 01400000
*/*                            'DCL 1 MCSCSA BASED(MCSCPTR)          */ 01450000
*/*                                   BDY(WORD) VIA(MCSCALET)'       */ 01500000
*/*                             With 'DCL MCSCPTR PTR(31)'           */ 01550000
*/*                                  'DCL MCSCALET FIXED(32)'        */ 01600000
*/*                          Specify %CSAVIA = 'NONE' to suppress    */ 01608300
*/*                             the VIA attribute to get:            */ 01616600
*/*                            'DCL 1 MCSCSA BASED(MCSCPTR)          */ 01624900
*/*                                   BDY(WORD)'                     */ 01633200
*/*                             With 'DCL MCSCPTR PTR(31)'           */ 01641500
*/*                                                                  */ 01650000
*/*    FUNCTION =                                                @P2C*/ 01700000
*/*             The MCS Extended Console Status Area Contains        */ 01750000
*/*             the Status of the Messages in a Extended Consoles    */ 01800000
*/*             Message Data Space.                                  */ 01850000
*/*                                                                  */ 01900000
*/*    CREATED BY =                                              @P2C*/ 01950000
*/*             IEAVH605                                             */ 02000000
*/*                                                                  */ 02050000
*/*    LOCATION =                                                @P2C*/ 02100000
*/*             Message Data Space for the Address Space which       */ 02150000
*/*             Owns the Extended Console.                           */ 02200000
*/*                                                                  */ 02250000
*/*    POINTED-TO-BY =                                           @P2C*/ 02300000
*/*             MCSCPTR  - Pointer maintained in users dynamic   @P2C*/ 02350000
*/*             MCSCALET - ALET maintained in users dynamic      @P2C*/ 02400000
*/*                                                                  */ 02450000
*/*    SERIALIZATION = NONE                                      @P3C*/ 02500000
*/*                                                                  */ 02550000
*/*    DISTRIBUTION =  AMACLIB                                   @P2C*/ 02566600
*/*                                                                  */ 02583200
*/*    CHANGE ACTIVITY =                                         @P2C*/ 02600000
*/* $MAC(IEAVG131),COMP(SC1CK): MCS Extended Console Status Area     */ 02650000
*/* $L0=CNSL1DBU,  HBB4410,  890403,  PDBU: Console Enhancements 1   */ 02700000
*/* $D1=DCR230,    HBB4410,  890801,  PDBU: DCR 230                  */ 02716600
*/* $P1=PEO4207,   HBB4410,  900604,  PDED: Clarify fields           */ 02724900
*/* $L1=CNSL2CBU,  HBB4420,  900406,  PDBU: Console Enhancements 2   */ 02733200
*/* $P2=PKB0594,   HBB4430,  920318,  PDHE: Pointed to by field      */ 02741600
*/* $P3=PKB0806,   HBB4430,  920725,  PDCM: Prolog updates           */ 02745800
*/*                                                                  */ 02750000
*/*** END OF SPECIFICATIONS ******************************************/ 02800000
*%GOTO MCSCPLS;  /*                                                     02850000
.**** CHANGE ACTIVITY ************************************************* 02900000
.*       KEYS:  A - Add, D - Delete, C - Change, M - Move             * 02950000
.* A New Macro                                                     @L0A 03000000
.* A Added field MCSCSUSP                                          @D1A 03025000
.* C Increase usability                                            @P1A 03033300
.* A Documented MCSCSUSP field                                     @L1A 03041600
.* C Prolog POINTED-TO-BY field incorrect - add SHOWHDR            @P2A 03045800
.* A Prolog updates                                                @P3A 03047900
.********************************************************************** 03050000
           SPACE                                                        03100000
MCSCSA     DSECT -                MCS Extended Console Status Area      03150000
MCSCID     DS    CL4              MCSCSA Acronym 'MCSC'                 03200000
MCSCVER    DS    XL1              Version Level                         03250000
MCSC410    EQU   1                Version Level - HBB4410               03300000
MCSCVERS   EQU   MCSC410          Version Level - Current               03350000
           DS    XL1              Reserved                              03400000
MCSCSTOR   DS    H                MegaBytes Allocated for Messages      03750000
MCSCCNID   DS    F                Console ID of message owner           03800000
MCSCNUSE   DS    A                Address of field which indicates     +03850000
                                   total space in use                   03900000
MCSCTDEP   DS    F                Total Message Queue Depth             03950000
MCSCUDEP   DS    F                Message Queue Depth for Unsolicited  +04000000
                                   Messages                             04050000
MCSCDDEP   DS    F                Message Queue Depth for Delivered    +04100000
                                   (In Use) Messages                    04150000
MCSCPDEP   DS    F                Maximum message queue depth permitted+04175000
                                                                   @P1C 04200000
MCSCMFRM   DS    XL1              Message format (Note: The bit offsets+04225000
                                    correspond to the UCMDISP2 field   +04250000
                                    in the UCM                          04275000
MCSCDTIM   EQU   X'80'            Display timestamp                     04300000
MCSCDJOB   EQU   X'40'            Display jobname                       04350000
MCSCDSYS   EQU   X'04'            Display system name                   04400000
MCSCDX     EQU   X'02'            Don't display system name and jobname 04450000
*   The next four fields indicate the status of queuing at the time     04452700
*   when the ALERT ecb was posted.  The value one will be stored        04455400
*   into each field for which the following queuing condition           04458100
*   exists:                                                             04460800
*      1. Memory Limit - no more cells in the data space.               04463500
*           Queueing will be halted.                               @P1A 04464800
*      2. Queue Depth Limit - the console's message queue has           04466200
*           reached the maximum depth.  Queueing will be halted.   @P1C 04468900
*      3. Internal Error - an error occurred while manipulating the     04471600
*           message queues.  Queueing will be halted.              @P1C 04474300
*      4. Alert Percentage - the number of messages on the queue has    04477000
*           reached a certain percentage of the maximum queue depth,    04479700
*           as defined by the ALERT percentage.  Queueing will     @P1C 04480700
*           continue.                                              @P1A 04481700
*   The next field after these four will be used to request that   @L1A 04482700
*   the extended console be deactivated.  The value one will be    @L1A 04483000
*   stored in the MCSCSUSP field.                                  @L1A 04483300
*      5. Suspend Operator - the console is considered switched    @L1A 04483600
*           by the system.  The extended console should be         @L1A 04483900
*           deactivated.                                           @L1A 04484200
MCSCQSTA   DS    0CL4             Queuing Status                        04485100
MCSCMLIM   DS    XL1              Queuing Stopped by Memory Limit       04487800
MCSCDLIM   DS    XL1              Queuing Stopped by Queue Depth Limit  04490500
MCSCINTR   DS    XL1              Queuing Stopped by Internal Error     04493200
MCSCALRT   DS    XL1              Queuing Reached Alert Percentage      04495900
MCSCSUSP   DS    XL1              Request to suspend the operator  @L1A 04513900
           DS    CL10             Reserved                         @D1C 04531900
MCSCOEXT   DS    A                Pointer to O.C.O extension            04550000
           DS    0F                                                     04600000
MCSCEND    EQU   *                End of MCSCSA non-O.C.O portion       04650000
           MEND  ,                */                                    04700000
*%MCSCPLS:  ;                                                           04750000
*DECLARE                                                                04800000
*  %IF CSAVIA = 'NONE'  %THEN  %GOTO  CSAPLS1;                          04825000
*  1 MCSCSA BDY(WORD) BASED(MCSCPTR) VIA(MCSCALET), /*               */ 04850000
*  %GOTO CSAPLS2;                                                       04860000
*  %CSAPLS1:  ;                                                         04870000
*  1 MCSCSA BDY(WORD) BASED(MCSCPTR), /*                             */ 04880000
*  %CSAPLS2:  ;                                                         04890000
*   3 MCSCID         CHAR(4),    /* Acronym 'MCSC'                   */ 04900000
*   3 MCSCVER        FIXED(8),   /* Version level                    */ 04950000
*   3 *              CHAR(1),    /* Reserved                         */ 05000000
*   3 MCSCSTOR       FIXED(16),  /* MegaBytes Allocated for Messages */ 05500000
*   3 MCSCCNID       FIXED(32),  /* Console ID of message owner      */ 05550000
*   3 MCSCNUSE       PTR(31),    /* Address of field which indicates    05600000
*                                    total space in use              */ 05650000
*   3 MCSCTDEP       FIXED(32),  /* Total Message Queue Depth        */ 05700000
*   3 MCSCUDEP       FIXED(32),  /* Message Queue Depth for             05750000
*                                    Unsolicited messages            */ 05800000
*   3 MCSCDDEP       FIXED(32),  /* Message Queue Depth for Delivered   05850000
*                                    (In Use) messages               */ 05900000
*   3 MCSCPDEP       FIXED(32),  /* Maximum message queue depth         05925000
*                                   permitted                    @P1C*/ 05950000
*   3 MCSCMFRM       BIT(8),     /* Message format - (Note: the bit     05975000
*                                    offsets correspond to the UCMDISP2 06000000
*                                    field in the UCM)               */ 06025000
*      5 MCSCDTIM    BIT(1),     /* Display timestamp                */ 06050000
*      5 MCSCDJOB    BIT(1),     /* Display jobname                  */ 06100000
*      5 *           BIT(3),     /* Reserved                         */ 06150000
*      5 MCSCDSYS    BIT(1),     /* Display system name              */ 06200000
*      5 MCSCDX      BIT(1),     /* Don't display system name and       06250000
*                                   jobname                          */ 06300000
*      5 *           BIT(1),     /* Reserved                         */ 06350000
*/* The next four fields indicate the status of queuing at the time  */ 06352500
*/* when the ALERT ecb was posted.  The value one will be stored     */ 06355000
*/* into each field for which the following queuing condition        */ 06357500
*/* exists:                                                          */ 06360000
*/*    1. Memory Limit - no more cells in the data space.            */ 06362500
*/*         Queueing will be halted.                             @P1A*/ 06363700
*/*    2. Queue Depth Limit - the console's message queue has        */ 06365000
*/*         reached the maximum depth.  Queueing will be halted. @P1C*/ 06367500
*/*    3. Internal Error - an error occurred while manipulating the  */ 06370000
*/*         message queues.  Queueing will be halted.            @P1C*/ 06372500
*/*    4. Alert Percentage - the number of messages on the queue has */ 06375000
*/*         reached a certain percentage of the maximum queue depth, */ 06377500
*/*         as defined by the ALERT percentage.  Queueing will   @P1C*/ 06378400
*/*         continue.                                            @P1A*/ 06379300
*/* The next field after these four will be used to request that @L1A*/ 06380300
*/* the extended console be deactivated.  The value one will be  @L1A*/ 06380600
*/* stored in the MCSCSUSP field.                                @L1A*/ 06380900
*/*    5. Suspend Operator - the console is considered switched  @L1A*/ 06381200
*/*         by the system.  The extended console should be       @L1A*/ 06381500
*/*         deactivated.                                         @L1A*/ 06381800
*   3 MCSCQSTA       CHAR(4),    /* Queuing Status                   */ 06382500
*     5 MCSCMLIM     FIXED(8),   /* Queuing Stopped by Memory Limit  */ 06385000
*     5 MCSCDLIM     FIXED(8),   /* Queuing Stopped by Queue Depth      06387500
*                                    Limit                           */ 06390000
*     5 MCSCINTR     FIXED(8),   /* Queuing Stopped by Internal         06392500
*                                    Error                           */ 06395000
*     5 MCSCALRT     FIXED(8),   /* Queuing Reached Alert percentage */ 06397500
*   3 MCSCSUSP       FIXED(8),   /* Request to suspend the operator     06409100
*                                                                @L1A*/ 06420700
*   3 *              CHAR(10),   /* Reserved                     @D1C*/ 06432500
*   3 MCSCOEXT       PTR(31),    /* Pointer to O.C.O extension       */ 06450000
*   3 MCSCEND  CHAR(0) BDY(WORD); /* End of MCSCSA non-O.C.O portion */ 06500000
*@SPACE(2);                             /*                           */ 06550000
*DECLARE                                /* Additional Declares       */ 06600000
*  MCSCPTR  PTR(31),                    /* Pointer to the MCSCSA     */ 06650000
*  %IF CSAVIA = 'NONE'  %THEN  %GOTO  CSAPLS3;                          06675000
*  MCSCALET FIXED(32),                  /* ALET for the MCSCSA       */ 06700000
*  %CSAPLS3:  ;                                                         06725000
*  MCSCACRN CHAR(4) CONSTANT('MCSC'),   /* Acronym 'MCSC'            */ 06750000
*  MCSCVERS FIXED(8) CONSTANT(MCSC410), /* Current version           */ 06800000
*  MCSC410  FIXED(8) CONSTANT(1);       /* Version level for SP4.1.0 */ 06850000
