         MACRO                                                          00050000
         IECPDINI &COMP                                                 00100000
.*                                                                      00120000
.* $MAC(IECPDINI): OPEN/CLOSE/EOV ABEND INTERPRETATION TABLE            00140000
.*                                                                      00160000
.*                                                                 @LDD 00180000
         LCLC  &A,&B,&C                 DEFINE LOCAL CHAR VARIABLES     00200000
.*                                                                      00250000
         AIF   ('&COMP' EQ 'OPEN').OPSCT                                00300000
.*                                      IS OPEN EXPANSION REQUIRED      00310000
         AIF   ('&COMP' EQ 'OPENEX').OPEXSCT                            00350000
.*                                      IS OPEN EXECUTOR EXPANSION      00360000
.*                                      REQUIRED                        00370000
         AIF   ('&COMP' EQ 'CLOSE').CLSCT                               00400000
.*                                      IS CLOSE EXPANSION REQUIRED     00410000
         AIF   ('&COMP' EQ 'TCLOSE').TCSCT                              00450000
.*                                      IS TCLOSE EXPANSION REQUIRED    00460000
         AIF   ('&COMP' EQ 'EOV').EOVSCT                                00500000
.*                                      IS EOV EXPANSION REQUIRED       00510000
         MEXIT                          INVALID CODE PASSED, DO NOT     00520000
.*                                      EXPAND                          00530000
.OPSCT   ANOP                                                           00550000
&A       SETC  'IFG0190P'               SET MODULE ID                   00600000
&B       SETC  'X''F13'''               OPEN ABEND CODE                 00650000
&C       SETC  '1'                      OPEN MSG ID                     00700000
IFG0190P CSECT                                                          00750000
         TITLE 'IFG0190P - OPEN ABEND INTERPRETATION AND RECOVERY INITIX00800000
               AL ROUTINE'                                              00810000
         AGO   .GENMAIN                                                 00850000
.CLSCT   ANOP                                                           00900000
&A       SETC  'IFG0200P'               SET MODULE ID                   01000000
&B       SETC  'X''F14'''               CLOSE ABEND CODE                01050000
&C       SETC  '2'                      CLOSE MSG ID                    01100000
IFG0200P CSECT                                                          01110000
         ENTRY IGG0206M                 ALIAS ENTRY POINT        Y02080 01120000
         ENTRY IFG0231P                 ALIAS ENTRY POINT          @35A 01123300
         ENTRY IFG0552P                 ALIAS ENTRY POINT          @37C 01126600
IGG0206M EQU   IFG0200P                 CLOSE EXECUTOR ENTRY     Y02080 01130000
IFG0231P EQU   IFG0200P                 CLOSE TYPE=T   ENTRY       @35A 01136600
IFG0552P EQU   IFG0200P                 EOV ENTRY                  @37C 01143300
         TITLE 'IFG0200P - CLOSE ABEND INTERPRETATION AND RECOVERY INITX01150000
               IAL ROUTINE'                                             01160000
         AGO   .GENMAIN                                                 01250000
.EOVSCT  ANOP                                                           01300000
&A       SETC  'IFG0550P'               SET MODULE ID                   01350000
&B       SETC  'X''F37'''               EOV ABEND CODE                  01400000
&C       SETC  '0'                      EOV MSG ID                      01450000
IFG0550P CSECT                                                          01500000
         ENTRY IGG0190P                 ALIAS ENTRY POINT          @PKA 01510000
         ENTRY IGG0200P                 ALIAS ENTRY POINT          @LGA 01520000
IGG0190P EQU   IFG0550P                 EOV ENTRY FROM OPEN EXEC   @PKA 01530000
IGG0200P EQU   IFG0550P                 EOV ENTRY FROM CLOSE EXEC  @LGA 01540000
         TITLE 'IFG0550P - EOV ABEND INTERPRETATION AND RECOVERY INITIAX01550000
               L ROUTINE'                                               01560000
         AGO   .GENMAIN                                                 01600000
.TCSCT   ANOP                                                           01650000
&A       SETC  'IFG0230P'               SET MODULE ID                   01700000
&B       SETC  'X''F17'''               TCLOSE ABEND CODE               01750000
&C       SETC  '2'                      CLOSE MSG ID                    01800000
IFG0230P CSECT                                                          01850000
         TITLE 'IFG0230P - TCLOSE ABEND INTERPRETATION AND RECOVERY INIX01900000
               TIAL ROUTINE'                                            01910000
         AGO   .GENMAIN                                                 02000000
.OPEXSCT ANOP                                                           02050000
&A       SETC  'IGG0196M'               SET MODULE ID                   02100000
&B       SETC  'X''F13'''               OPEN ABEND CODE                 02150000
&C       SETC  '1'                      OPEN MSG ID                     02200000
IGG0196M CSECT                                                   YM1447 02250000
         TITLE 'IGG0196M - OPEN EXECUTOR ABEND INTERPRETATION AND RECOVX02300000
               ERY INITIAL ROUTINE'                                     02310000
.GENMAIN ANOP                                                           02400000
*********************************************************************** 02450000
*                                                                     * 02500000
         AIF   ('&COMP' EQ 'OPEN').OPSCT1                               02550000
.*                                      IS OPEN EXPANSION REQUIRED      02600000
         AIF   ('&COMP' EQ 'OPENEX').OPEX1                              02650000
.*                                      IS OPEN EXECUTOR EXPANSION      02660000
.*                                      REQUIRED                        02670000
         AIF   ('&COMP' EQ 'CLOSE').CLSCT1                              02680000
.*                                      IS CLOSE EXPANSION REQUIRED     02690000
         AIF   ('&COMP' EQ 'TCLOSE').TCSCT1                             02692000
.*                                      IS TCLOSE EXPANSION REQUIRED    02694000
         AIF   ('&COMP' EQ 'EOV').EOVSCT1                               02696000
.*                                      IS EOV EXPANSION REQUIRED       02698000
         MEXIT                          INVALID CODE PASSED, DO NOT     02698400
.*                                      EXPAND                          02698800
.OPSCT1  ANOP                                                           02699200
*$MOD(IFG0190P) OPEN ABEND INTERPRETATION AND RECOVERY INITIAL RTN @L3C 02699300
*                                                                       02699400
         AGO   .CONMAIN                                                 02699500
*                                                                       02699600
.CLSCT1  ANOP                                                           02699700
*$MOD(IFG0200P):    CLOSE ABEND INTERPRETATION AND RECOVERY INITIAL   * 02699800
*                    ROUTINE                                          * 02699900
         AGO   .CONMAIN                                                 02716600
*                                                                     * 02730600
.EOVSCT1 ANOP                                                           02733200
*$MOD(IFG0550P):  EOV ABEND INTERPRETATION AND RECOVERY INITIAL RTN   * 02737000
*                                                                     * 02740800
         AGO   .CONMAIN                                                 02743600
*                                                                     * 02744200
.TCSCT1  ANOP                                                           02750200
*$MOD(IFG0230P) TCLOSE ABEND INTERPRETATION AND RECOVERY INITIAL   @L3C 02756200
*               ROUTINE                                            @L3A 02762200
         AGO   .CONMAIN                                                 02768200
*                                                                     * 02768400
.OPEX1   ANOP                                                           02768600
*$MOD(IGG0196M) OPEN EXECUTOR ABEND INTERPRETATION AND RECOVERY    @L3C 02769600
*               INITIAL ROUTINE                                    @L3C 02770600
         AGO   .CONMAIN                                                 02771800
.CONMAIN ANOP                                                           02773800
.*                                                                      02776300
*********************************************************************** 02778800
*                                                                     * 02781500
*PROPRIETARY V3 STATEMENT                                               02784100
*LICENSED MATERIALS - PROPERTY OF IBM                                   02786700
*"RESTRICTED MATERIALS OF IBM"                                          02789300
*5694-A01                                                               02791900
*(C) COPYRIGHT 1982,2000  IBM CORP.                                     02794500
*END PROPRIETARY V3 STATEMENT                                           02797100
*                                                                     * 02800000
*********************************************************************** 02825000
.*                                                                      02850000
* STATUS = OS/390 DFSMS 3.10                                          * 02875000
*                                                                     * 02900000
* FUNCTION = GETS WORK AREA TO BE USED BY REST OF PROBLEM DETERMINA-  * 02950000
*            TION. SEE PDBFRLEN EQUATE FOR SIZE OF WORK AREA.         * 03000000
*            DETERMINES REAL ABEND CODE AND RETURN CODE FROM THE      * 03050000
*            INTERNAL CODE PASSED TO IT AND TABLE IN THIS MODULE.     * 03100000
*            THESE CODES ARE MOVED INTO THE WORK AREA.                * 03150000
*            CONSTRUCTS WRITE-TO-PROGRAMMER MSG IN WORK AREA.         * 03200000
*            MOVES ID OF LAST LOAD OF THE STRING IN CONTROL WHEN      * 03250000
*            ABEND OCCURRED INTO THE CURRENT WTG TABLE ENTRY.         * 03300000
*            PASSES CONTROL TO WRITE-TO-PROGRAMMER ROUTINE.           * 03350000
*                                                                     * 03400000
* NOTES = SEE BELOW                                                   * 03450000
*                                                                     * 03500000
*    DEPENDENCIES =                                                   * 03550000
*            CLASS ONE CHARACTER CODE. THE EBCDIC CHARACTER CODE WAS  * 03600000
*            USED FOR ASSEMBLY.  THE MODULE MUST BE REASSEMBLED IF A  * 03650000
*            DIFFERENT CHARACTER SET IS USED FOR EXECUTION.           * 03700000
*                                                                     * 03750000
*    RESTRICTIONS = NONE                                              * 03800000
*                                                                     * 03802000
*    REGISTER CONVENTIONS =                                           * 03804000
*            R0 = INTERNAL ABEND CODE                                 * 03804400
*            R1 = PT TO PROBLEM DETERMINATION WORK AREA ON OUTPUT     * 03804800
*            R2-R14 = SAME AS CALLING ROUTINE                         * 03805200
*                                                                     * 03805400
*    PATCH LABEL = SEE NEXT TO LAST LABEL IN LTORG TABLE. DC STATEMENT* 03805500
*                                                                     * 03814400
* MODULE TYPE = CONTROL                                               * 03816400
*                                                                     * 03818400
*    PROCESSOR = ASSEMBLER H                                          * 03820400
*                                                                     * 03822400
*    MODULE SIZE = SEE EXTERNAL SYMBOL DICTIONARY OR LOC FIELD ON ORG * 03822800
*                  STATEMENT AT END OF LTORG TABLE. HEX BYSTES        * 03823200
*                                                                     * 03836000
*    ATTRIBUTES = REENTRANT, REFRESHABLE, READ-ONLY, ENABLED,         * 03846000
*                 PRIVILEGED.                                         * 03848000
*                                                                     * 03848400
* ENTRY POINT =                                                       * 03848500
*            IFG0190P - XCTL FROM MAINLINE OPEN                       * 03848600
*            IGG0196M - XCTL FROM OPEN EXECUTORS AND RDJFCB           * 03848700
*            IFG0200P - XCTL FROM MAINLINE CLOSE                      * 03848800
*            IGG0206M - XCTL FROM CLOSE EXECUTORS                     * 03848900
*            IFG0230P - XCTL FROM MAINLINE TCLOSE                     * 03849000
*            IFG0550P - XCTL FROM MAINLINE EOV                        * 03849100
*            IGG0190P - XCTL FROM OPEN EXECUTORS FOR EOV ABENDS   @PKA* 03850000
*                       (ALIAS FOR IFG0550P)                      @PKA* 03850900
*            IGG0200P - XCTL FROM CLOSE EXECUTORS FOR EOV ABENDS  @LGA* 03851800
*                       (ALIAS FOR IFG0550P)                      @LGA* 03852700
*                                                                     * 03853800
* INPUT = ENTERED IN DATA MANAGEMENT KEY                              * 04102000
*         REG 0 CONTAINS AN INTERNAL ABEND CODE.                      * 04110000
*         REGS 2-14 ARE AS THEY WERE IN CALLING ROUTINE.              * 04150000
*         TWO BYTE ID OF CALLING MODULE IS IN DXCALLID.               * 04200000
*         TWO BYTE ID OF MODULE TO WHOM CONTROL IS RETURNED           * 04250000
*         (WHERE APPLICABLE) IN DXRETID.                              * 04300000
*         EIGHT BYTE ID OF MODULE TO BE USED IN THE MESSAGE TEXT  @LNA* 04310000
*         (WHERE APPLICABLE) IS IN WAXMODID- IN CASE THE MODULE   @LNA* 04320000
*         DETECTING THE ERROR IS DIFFERENT THAN THE MODULE        @LNA* 04330000
*         CALLING PROBLEM DETERMINATION.                          @LNA* 04340000
*                                                                     * 04350000
* OUTPUT = EXIT IN DATA MANAGEMENT KEY                                * 04410000
*          REG 1 CONTAINS PTR TO PROBLEM DETERMINATION WORK AREA.     * 04450000
*          ABEND CODE, RETURN CODE, AND TRACE CODE ARE IN             * 04460000
*          PROB DET WORKAREA. 7 BYTE MSG ID OF THE WRITE-TO-          * 04500000
*          PROGRAMMER MSG IS PUT IN THE BUFFER.                       * 04550000
*                                                                     * 04600000
* EXIT- NORMAL =                                                      * 04750000
*          XCTL TO IFG0199B FOR OPEN AND RDJFCB.                      * 04800000
*          XCTL TO IFG0209B FOR CLOSE.                                * 04850000
*          XCTL TO IFG0559B FOR EOV.                                  * 04900000
*          XCTL TO IFG0239B FOR TCLOSE.                               * 04950000
*                                                                     * 05000000
* EXIT- ERROR =                                                       * 05050000
*          ABEND WITH FXX ABEND IF UNABLE TO FIND CODE IN TABLE       * 05150000
*          WHERE XX=13 FOR OPEN AND RDJFCB,                           * 05200000
*                   14 FOR CLOSE,                                     * 05250000
*                   17 FOR TCLOSE,                                    * 05300000
*                   37 FOR EOV.                                       * 05350000
*                                                                     * 05400000
* CHANGE ACTIVITY - SEE BELOW:                                        * 05400200
*                                                                     * 05400400
*$L1=IXVTOC,JDM1134,,STLRJM:   INDEX VTOC SUPPORT.                 @L1A 05400600
*$01=OZ66417,HDP1102,,STLTML:  NO ABEND FOR MAX EXTENTS.           @01A 05400800
*$02=OZ67627,HDP1102,,FEGJG:   ABEND0C4 IF AMP DD PARM FOR A       @02A 05401000
*                              NONVSAM DATA SET.                   @02A 05401200
*$03=OZ75375,HDP1102,,FEGJG:   ABEND013-AC DASD MIGRATION AID      @03A 05401400
*$04=OZ81133,JDP1111,,FEGHA:   INCORRECT MESSAGE ISSUED.           @04A 05401600
*$L2=USEREXIT,JDP1111,,STLLRU: VOLUME SECURITY DCB EXIT.           @L2A 05401800
*$L3=ANSI,JDP1111,,STLLRU:     ANSI-78 TAPE LABEL SUPPORT.         @L3A 05402000
*$H1=3800-3,JDP1111,83102,STLPD: 3800-3 PRINTER SUBSYSTEM SUPPORT. @H1A 05402200
*$L4=OZ86363,JDP1111,,STLRJM:  D/T3480 BLOCK ID SUPPORT            @L4A 05402400
*$06=OZ86008,HDP2210,,STLSJS:  ABEND117-04 BSAM CLOSE TYPE=T       @06A 05402600
*$07=OZ86782,HDP2210,,ISGJBM:  ABENDF37 - EOV DENSITY CONFLICT     @07A 05402800
*                              MSGIEC028I 837-04 ADDED TO EOV      @07A 05403000
*$08=OZ87942,HDP2210,,ISGJBM:  ABEND237-04 CONCAT WITH 'RDBACK'    @08A 05403200
*                              MSGIEC026I 637-20 ADDED TO EOV      @08A 05403400
*$09=OZ94520,HDP2210,,ISGGEC:  MSGIEC141I 013-AC ADDED TO OPEN     @09A 05403600
*$10=OZ90239,RACFSPE,85210,STLPD: RACF 1.7 SUPPORT                 @10A 05403800
*$11=OY01362,HDP2210,,ISGRJV:  MSGIEC036I 002-30 AND 002-38 ADDED. @11A 05404000
*$12=OY01923,HDP2210,,ISGGHA:  002-28 CHANGED FROM IEC129I TO 036I @12A 05404200
*$13=OY02388,HDP2230,,ISGJBM:  MSGIEC150I ABEND913-6C ADDED        @13A 05404400
*$15=OY10145,HDP2230,,NSDGHA: MSGIEC152I ABENDB13-38 ADDED         @15A 05404600
*$14=OY07766,HDP2230,871116,STLCMS: PDS INTEGRITY                  @14A 05404800
*                                                                  @L5A 05405000
*      MVS/XA 3.1.0 SUPPORT                                        @L5A 05405200
*                                                                  @L5A 05405400
*$L5=SMS,HDP3310,860507,STLCMS: UNSUPPORTED DATA TYPES XA 3.1      @L5A 05405600
*$L6=SMS,HDP3310,860623,STLDJP: SYSTEM DETERMINED BLOCKSIZE        @L6A 05405800
*$L7=RACF18,HDP3310,,STLMV:     PROGRAM LIBRARY EXEC ONLY PROTECT  @L7A 05406000
*$L8=SMS,HDP3310,,STLPD:        ADD EOV VERSION OF PASSWORD ERROR  @L8A 05406200
*$P9=KJB4207,HDP3310,,STLSS:    CACHING ATTRIBUTE SELECTION        @P9A 05406400
*$PA=KJB3376,HDP3310,,STLMV:    OPEN A VSAM DATA SET WITH A DCB    @PAA 05406600
*$PB=KJB4767,HDP3310,,STLMV:    ABEND913-6C CONFLICT OY02388/RACF18@PBA 05406800
*$PC=KJB4911,HDP3310,,STLMV:    INTEGRITY PROBLEM WITH EXECUTE ONLY@PCA 05407000
*                                                                  @H2A 05407200
*      MVS/XA 3.1.1 SUPPORT                                        @H2A 05407400
*                                                                  @H2A 05407600
*$H2=3480X,JDP3311,88281,STLFAO: 3480 COMPACTION SUPPORT           @H2A 05407800
*                                                                  @LBA 05408000
*      DFP/XA 3.2.0 SUPPORT                                        @LBA 05408200
*                                                                  @LBA 05408400
*$LB=PDSE,HDP3320,,STLJRM:     PDSE SUPPORT                        @LBA 05408600
*$16=OY26697,HDP3320,,GPDGEC: MSGIEC141I 013-BC ADDED TO OPEN      @16A 05408800
*$PD=KET3596,HDP3320,,STLMV:   MSGIEC036I 002-B8 SETLOCK ERROR     @PDA 05409000
*$17=OY29518,HDP3320,900216,GPDPJS: IEC212I 414-08 ADDED TO CLOSE  @17A 05409200
*$18=OY31819,HDP3320,900430,SJPLCC: IEC036I 002-D4 ADDED, AND      @18A 05409400
*                              IEC141I 213-78 ADDED                @18A 05409600
*$19=OY32594,HDP3320,900524,SJPLCC: IEC141I 213-7C AND 213-80 ADDED@19A 05409800
*$20=OY32580,HDP3320,900608,GPDGEC: ABEND113-38 ADDED TO OPEN IF   @20A 05410000
*                              JFCB SAYS VSAM BUT DSCB DOES NOT    @20A 05410200
*$21=OY34617,HDP3320,900907,GPDCHU: ABEND913-72 ADDED TO OPEN IF   @20A 05410400
*                       RECEIVING UNEXPECTED RETURN CODE FROM RACF @21A 05410600
*                                                                       05416000
*      DFP/XA 3.3.0 SUPPORT                                        @LCA 05417500
*                                                                  @LCA 05419000
*$LC=PDSE,HDP3330,900328,SJPLCC: PDSE SUPPORT                      @LCA 05420500
*                                                                       05422000
*      DFP/XA 4.1.0 SUPPORT                                        @LDA 05445400
*                                                                  @LDA 05468800
*$PE=KC11124,HDP3330,901112,SJPLREB: ABEND002-CC AND B14-1C ADDED  @PEA 05492200
*                       AND REMOVE CHECKPOINT/RESTART SUPPORT      @PEA 05515600
*$22=OY38372,HDP3330,910107,SSPDGEC: ALLOW 213-30 TO BE IGNORED    @22A 05539000
*$23=OY35916,HDP3330,910612,SJPLRCW: ALLOW OPEN 713-10 ABEND       @23A 05562400
*$24=OY46797,HDP3330,911031,SJPLJAL: IEC145I 413-48 ADDED TO OPENJ @24A 05585800
*$25=OY47334,HDP3330,911031,SJPLJAL: AL LBLS MUST CONFORM TO STD   @25A 05609200
*$LE=TAPELIB,HDP3330,,SJPLMV: FLAGSTAFF SUPPORT                    @LEA 05632600
*$26=OY51941,HDP3330,920210,SJPLGEC: IEC142I 113-20,24,28,2C ADDED @26A 05656000
*                                    TO EOV CONCATENATION          @26A 05679400
*                                                                  @LFA 05702800
*      DFSMS/MVS 1.1.0 SUPPORT                                     @LFA 05726200
*$LF=POSIX,JDZ1110,920123,SJPLREB: POSIX SUPPORT                   @LFA 05749600
*$27=OY52641,HDP3330,920304,SJPLRLC: ALLOW IGNORE OF 414-08        @27A 05773000
*$28=OY53760,HDP3330,920505,SJPLRCW: ALLOW EOV 137-3C ABEND        @28A 05796400
*$PF=KMM2105,JDP1110,920330,SJPLMV: DUPLICATE INTERNAL CODE        @PFA 05819800
*$PG=KMM2224,JDP1110,920424,SJPLMV: ABENDS 637-78 & 613-40         @PGA 05843200
*$PH=KMM2494,JDZ1110,920531,SJPLJAL: ABENDF37                      @PHA 05866600
*$LG=STRIPES,JDZ1110,920601,SJPLREB: STRIPING SUPPORT              @LGA 05890000
*$PI=KMM2500,JDZ1110,920603,SJPLMV: CHANGE 637-80 TO 637-74        @PIA 05913400
*$PJ=KMM2683,JDZ1110,920618,SJPLSS: ADD 637-80 AND 613-48 AS CATCH @PJA 05936800
*                                   ALLS FOR UNKNOWN LCS ERRORS    @PJA 05960200
*$30=OY54155,HDP3330,920531,920531,SJPLJAL: SMS BDAM DS WITH       @30A 05983600
*                           OPTCD=A INVALIDLY CREATED. 213-BC      @30A 06007000
*$31=OY55057,HDP3330,920601,SJPLGEC: IEC142I 113-38 ADDED TO EOV   @31A 06030400
*$PK=KMM3111,JDZ1110,920825,SJPLCC: ADD ALIAS IGG0190P FOR IFG0550P@PKA 06053800
*$32=OY58424,JDZ1110,921111,SJPLMV: ADD 637-84 & 88 + 613-4C & 50  @32A 06077200
*$33=OY59942,JDZ1110,921214,SJPLREB: INHIBIT ACCESS TO STRIPE DATA @33A 06100600
*                           ON DFP VERSION 3 SYSTEMS               @33A 06124000
*$34=OY57730,JDZ1110,920929,SJPLGEC: "ATTRIBUTE EXTENSION" SUPPORT @34A 06137000
*$35=OY60493,JDZ1110,921225,SJPLREB: ENTRY POINT IFG0231P IN CLOSE @35A 06137800
*$36=OY60209,JDZ1110,930121,SJPLMV:  ATL PVT TAPE NO INTERNAL LBL  @36A 06139100
*                                    ABENDS 637-8C & 613-54        @36A 06140400
*$37=OY65235,JDZ1110,930625,SJPLREB: PE OY60493                    @37A 06147900
*$38=OY65137,JDZ1110,930630,SJPLJAL: REMOVE 213-BC (OY54155)       @38A 06148900
*                                                                  @LIA 06149000
*      DFSMS/MVS 1.2.0 SUPPORT                                     @LHA 06149100
*$LH=BYPSEXPD,HDZ11B0,,SJPLGC: ADD 413-4C                          @LHA 06149200
*$LI=SAMCOMP,HDZ11B0,930318,SJPLGEC: ADD 213-C8, 213-CC ABENDS     @LIA 06149300
*$LJ=COMPRESS,HDZ11B0,930614,SJPLCC: COMPRESSION SUPPORT           @LJA 06149400
*$PL=K120209,HDZ11B0,930831,SJPLGEC: ADD 013-DC ABEND              @PLA 06149700
*$PM=K120645,HDZ11B0,931007,SJPLGEC: REMOVE K120209                @PMA 06149800
*$39=OW00483,HDZ11B0,931122,SJPLGEC: KZC0215 CHANGE ALL EOV ABENDS @39A 06158100
*                                    TO NOT HAVE DELAY AS AN OPTION@39A 06166400
*                                    ALSO ALLOW ATL ABENDS TO BE   @39A 06174700
*                                    IGNORED.                      @39A 06183000
*$40=OW00735,HDZ11B0,930810,SJPLGEC: ABEND213-BC IF ERROR UPDATING @40A 06185000
*                           FMT1 CHECKPOINTED DATASET FLAG FOR     @40A 06187000
*                           FIRST VOLUME OF MULTI-VOLUME DATASET.  @40A 06189000
*$41=OW01530,HDZ11B0,940113,SJPLMV:  ATL & MTL BLP/NL SUPPORT      @41A 06189300
*$42=OW03748,HDZ11B0,940221,SJPLGEC: NEW ABEND CODES FOR STRIPED   @42A 06189700
*                                    DATA SETS.                    @42A 06190400
*                                                                       06190500
*$43=OW05484,HDZ11B0,940527,SJPLGEC: ABEND002 COMPRESSION ABENDS   @43A 06190800
*                                    ISSUE MSGIEC043I WHEN IT      @43A 06190900
*                                    SHOULD BE MSGIEC036I          @43A 06191000
*$44=OW05412,HDZ11B0,940527,SJPLGEC: ABEND213-F0 IF CVAF ERROR OR  @44A 06192100
*                                    NOT FMT1 DSCB DURING DCBESIZE @44A 06193200
*                                    PROCESSING FOR STRIPED.       @44A 06194300
*                                    ABEND213-F4 IF CVAF ERROR     @44A 06195400
*                                    DURING DCBESIZE PROCESSING FOR@44A 06196500
*                                    COMPRESSED.                   @44A 06197600
*$45=OW06305,HDZ11B0,940613,SJPLMV:  ATL BLP/NL O/P SUPPORT        @45A 06198100
*$46=OW06898,HDZ11B0,940725,SJPLGEC: INCORRECT MSG FOR 237-1C      @46A 06198400
*      DFSMS/MVS 1.3.0 SUPPORT                                          06198500
*$LK=SDSH,HDZ11C0,940329,SJPLGEC: VSAM CONTROL ACB AND SDSH SUPPORT@LKA 06198600
*$47=OW10577,HDZ11B0,950106,SJPLGEC: IEC223I REASON CODE SUPPORT   @47A 06199000
*$48=OW10478,HDZ11B0,950414,SJPLCC:  ADD 002-F8 AND OO2-FC ABENDS  @48A 06199200
*$49=OW17120,HDZ11C0,951127,SJPLCC:  ADD 002-BC                    @49A 06199300
*$LL=XSAM,HDZ11C0,951013,SJPLGEC: ADD 213-F8, 213-FC, 213-44 AND   @LLA 06199400
*                                 002-2C ABENDS FOR XSAM ACCESS    @LLA 06199500
*                                 METHOD SUPPORT                   @LLA 06199600
*$LM=VSAMXSAM,HDZ11C0,960425,SJPLGEC: VSAM HFS/REMOTE FILE SUPPORT @LMA 06199700
*                                                                  @LIA 06206800
*      DFSMS/MVS 1.4.0 SUPPORT                                          06213900
*$LN=SERVICE,HDZ11D0,960919,SJPLGEC: SERVICEABILTY SUPPORT         @LNA 06221000
*$LO=TCOM,HDZ11D0,961023,SJPLCC: Tailored Compression Support      @LOA 06222100
*$PN=K140232,HDZ11D0,961023,SJPLGEC: ENSURE CLEAN HIORDER BYTE IN  @PNA 06223300
*                                     REG4(RCORE)                  @PNA 06225600
*$PO=K140597,HDZ11D0,970203,SJPLMLM: TCOM catalog call support     @POA 06226800
*                                                                       06228100
*$50=RESERVED AS A PLACE HOLDER TO SYNC WITH 1.2.0                 @50A 06230400
*$51=OW21115,HDZ11C0.960626,SJPLMV:  OAKCREEK SUPPORT              @51A 06232700
*$52=OW23434,HDZ11C0,960904,SJPLCC:  ADD 213-34 FOR TCOM TOLERATION@52A 06233500
*                                    SUPPORT                       @52A 06234300
*$PP=K140923,HDZ11D0,970402,SJPLMLM: TCOM ABEND RC SUPPORT         @PPA 06234700
*$53=OW32081,HDZ11D0,980330,SJPLJAL: CORRECT MSGID 713-14/137-22   @53A 06234900
*$LP=ANSIV4,HDZ11E0,980526,SJPLGEC: ADD 513-10 AND 513-14 FOR ANSI @LPA 06235000
*                                   V4 CCSID SUPPORT (PLUS OTHERS  @LPA 06236800
*                                   USED FOR SAM ANSI V4 SUPPORT)  @LPA 06238600
*$PQ=K150003,HDZ11E0,980824,SJPLCC: ADD 213-E9 FOR FIN OW25434     @PQA 06239500
*$LQ=GT32K,HDZ11F0,990818,SJPLRK:  >32K Blocksize support          @LQA 06239600
*$LR=31BIT,HDZ11F0,990305,SJPLGEC: RUN IN 31 BIT MODE              @LRA 06239800
*$PR=K160139,HDZ11F0,990512,SJPLGEC: ABEND0C4 DIRTY REGISTER 4     @PRA 06240000
*                                  ON ENTRY TO IGG0196M            @PRA 06240100
*$54=OW36308,HDZ11E0,981103,SJPLGEC: NON-SMS PDSE SUPPORT          @54A 06240200
*$LS=K161031,HDZ11F0,002001,SJPLJAL: MORE RMM CHANGES              @LSA 06240300
*$56=OW48477,HDZ11E0,010306,SJPLREB: 002-45 BAD CONCAT NUMBER      @56A 06240320
*                                   FOUND WHILE PROCESSING NOTE.   @56A 06240340
*********************************************************************** 06240400
         EJECT                                                          06242300
R0       EQU   0                        WORK/PARAMETER REG              06250000
R1       EQU   1                        WORK/PARAMETER REG              06300000
RDCB     EQU   2                        PTR TO DCB                      06350000
RBASE    EQU   3                        BASE REG                        06400000
RCORE    EQU   4                        PTR TO O/C/EOV WKAREA           06450000
RES      EQU   5                        PTR TO RESIDENT RTN             06500000
RWTGC    EQU   8                        PTR TO WTG TABLE CURRENT ENTRY  06550000
RPARC    EQU   7                        PTR TO PARALIST CURRENT ENTRY   06600000
RWTG     EQU   6                        PTR TO WTG TABLE                06650000
RTIOT    EQU   9                        PTR TO TIOT ENTRY               06700000
RUCB     EQU   10                       PTR TO UCB                      06750000
RB       EQU   11                       WORK/PARAMETER REG              06800000
RC       EQU   12                       WORK/PARAMETER REG              06850000
RD       EQU   13                       WORK/PARAMETER REG              06900000
RET      EQU   14                       WORK/PARAMETER REG              06950000
RF       EQU   15                       WORK/PARAMETER REG              07000000
SVRBEXSA EQU   96                       OFFSET OF SVRB EXT S/A IN SVRB  07050000
FIVE     EQU   5                        WORK VALUE                      07250000
SIX      EQU   6                        WORK VALUE                      07300000
THREE    EQU   3                        WORK VALUE                      07350000
FOURTEEN EQU   14                       WORK VALUE                      07400000
SEVEN    EQU   7                        WORK VALUE                      07450000
ORG      EQU   0                        WORK VALUE                      07500000
TWO      EQU   2                        WORK VALUE                      07550000
FOUR     EQU   4                        WORK VALUE                      07600000
ONE      EQU   1                        WORK VALUE                      07650000
EIGHT    EQU   8                        WORK VALUE                      07700000
NINE     EQU   9                        WORK VALUE               YM1447 07710000
TWELVE   EQU   12                       WORK VALUE                      07750000
ZERO     EQU   0                        WORK VALUE                      07800000
ABENDCOD EQU   &B                       INVALID CODE ABEND              07850000
OPENCODE EQU   X'13'                    OPEN SVC NUMBER          YM3111 07852000
CHARF    EQU   C'F'                     WORK VALUE                      07900000
CHAR1    EQU   C'1'                     OPEN MESSAGE ID          YM3111 07902000
         EJECT                                                          07910000
         BASR  RBASE,0                  ESTABLISH ADDRESSABILITY   @H2C 07955000
         USING *,RBASE                                                  08000000
         USING PDDSECT,R1                                               08050000
         USING TABLE,RD                                                 08100000
         USING FORCORE,RCORE                                            08150000
         USING WTG,RWTG                                          Y02080 08160000
         B     CPYRGHTA           BRANCH AROUND EYE-CATCHER AND CPYRT   08164400
         DC    AL1(CPYRGHTB-1-*)                                        08168800
         DC    CL8'IECPDINI'       MODULE DISTRIBUTION NAME             08173200
         DC    CL8'&SYSDATE'      DATE COMPILED                         08177600
         DC    CL8'HDZ11F0'        LEVEL OF THIS PRODUCT                08182000
         DC    CL8'&SYSPARM'      MAINTENANCE - NONE OR PTF NUMBER      08186400
CPYRGHTB DS    0C                                                       08190800
CPYRGHTA DS 0H                                                          08195200
         LA    RF,PDF00000                                         @LRA 08196100
         O     RF,HIODRBIT                                         @LRA 08197000
         BSM   0,RF                     GET INTO 31 BIT MODE       @LRA 08197900
PDF00000 EQU   *                                                   @LRA 08198800
         L     R1,CVTPTR                CVT ADDR                        08200000
         L     R1,0(R1)                 TCB WDS                         08250000
         L     R1,4(R1)                 TCB PTR                  XM0880 08300000
         L     R1,0(R1)                 SVRB PTR                        08350000
         MODESET EXTKEY=SUPR            SVRB KEY                 Y02082 08360000
         ST    RDCB,SVRBEXSA(R1)        SAVE REG 2 IN SVRB EXT S/A      08400000
         STM   RCORE,RWTGC,SVRBEXSA+FOUR(R1)                            08450000
*                                       SAVE REGS 4-8 IN SVRB EXT S/A   08500000
         MODESET EXTKEY=DATAMGT         DATA MANAGEMENT KEY      Y02082 08510000
         ICM   RCORE,B'1000',ZEROS      ENSURE CLEAN HI ORDER BYTE @PRA 08530000
         LR    RC,R0                    SAVE CODE                       08550000
         N     RC,CODEMASK              ZERO HI 3 BYTES                 08600000
         LA    RD,CODTABLE              POINT TO TABLE                  08650000
         SR    RET,RET                  ZERO WORK REG                   08700000
PDF01020 IC    RET,CODE                 GET CODE IN TABLE ENTRY         08750000
         CR    RC,RET                   RIGHT TABLE ENTRY        M0035  08800000
         BE    PDF01040                 YES                             08850000
         LTR   RET,RET                  END OF TABLE             M0035  08900000
         BE    PDF01040                 YES, GET CORE FOR WTP           08950000
         LA    RD,TABLLEN(RD)           POINT TO NEXT ENTRY             09000000
         B     PDF01020                 CHECK NEXT ENTRY IN TABLE       09050000
PDF01040 EQU   *                        CONTINUE BUILDING MSG           09100000
         LA    R0,PDBFRLEN              LENGTH OF MSG BUFFER     YM3945 09150000
         LM    RTIOT,RB,DXCCW8          SAVE WORKAREA                   09200000
*        IECRES GET,LV=(0),PREFIX=YES,STM=(2,14,WTGPREFX),       Y02080 09410000
*              ID=PDWA                  GET CORE FOR WTP         Y02144 09412000
         IECRES GET,LV=(0),PREFIX=YES,STM=(2,14,WTGPREFX),       Y02080*09420000
               ID=PDWA                                           Y02144 09470000
         STM   RTIOT,RB,DXCCW8          RESTORE WKAREA                  09650000
         L     RF,WTGPREFX              GET BASE PREFIX PTR      YM7883 09650800
         L     RF,IECRRPRM-IECPREFX(,RF) GET RRPLIST PTR         YM7883 09651200
         TM    RRFLAGS2-RRPLIST(RF),RRFFIN1 1ST MODULE COMPLETED YM7883 09651600
         LA    RF,WTGMODNM              PT T0 'IFG' ERROR MODNM  YM7883 09652000
         BO    PDF01044                 YES, GO SET 'IFG' NAME   YM7883 09652400
         LA    RF,IGCNAME               PT T0 'IGC' ERROR MODNM  YM7883 09652800
PDF01044 EQU   *                        SET ERROR MODULE NAME    YM7883 09653200
*                                                                       09653400
*        IF ONE MODULE DETECTED THE ERROR BUT ANOTHER IS CALLING   @LNA 09653600
*        PROBLEM DETERMINATION, THEN WAXMODID WILL BE SET WITH     @LNA 09653800
*        THE MODULE ID THAT ACTUALLY DETECTED THE ERROR. THAT      @LNA 09654000
*        MODULE ID WILL BE USED IN THE DETERMINATE ABEND MESSAGE   @LNA 09654200
*        TEXT, INSTEAD OF THE MISLEADING MODULE ID OF THE MODULE   @LNA 09654400
*        THAT IS CALLING PROBLEM DETERMINATION.                    @LNA 09654600
*                                                                       09654800
         ICM   RCORE,B'1000',CODEMASK   ENSURE CLEAN HIORDER BYTE  @PNA 09654900
*        IECRES MODE31,RET              GET INTO 31 BIT MODE       @LRD 09655000
         ICM   RET,15,DXOCEWAX          GET WORK AREA EXTENSION    @LNA 09655100
         BZ    PDF01045                 BR IF ZERO                 @LNA 09655200
         USING WAXTN,RET                                           @LNA 09655400
         NC    WAXMODID,WAXMODID        MOD ID SPECIFIED?          @LNA 09655600
         BZ    PDF01045                 NO, USE NORMAL MOD ID      @LNA 09655800
         MVC   PDERRMOD,WAXMODID        YES, USE THAT MOD ID IN MSG@LNA 09656000
         DROP  RET                                                 @LNA 09656200
*        IECRES MODE24,RET              BACK TO 24 BIT MODE        @LRD 09656400
         B     PDF01046                 BR TO CONTINUE             @LNA 09656600
PDF01045 EQU   *                                                   @LNA 09656800
*        IECRES MODE24,RET              BACK TO 24 BIT MODE        @LRD 09656900
         MVC   DXWORK(L'WTGMODNM),0(RF) 1ST PART OF ERROR MODNM  YM7883 09657000
         MVC   DXWORK+L'WTGMODNM-L'DXCALLID(L'DXCALLID),DXCALLID YM3111 09658000
         MVC   PDERRMOD,DXWORK          ERROR NAME TO WORK AREA  YM3111 09658400
PDF01046 EQU   *                                                   @LNA 09704200
         CLI   CODE,ZERO                WAS CODE PASSED VALID    M0035  09750000
         BZ    PDF01060                 NO, ISSUE WTP AND ABEND         09800000
*                                       MOVE ID/VCON TO WTG      YM1447 10000000
         MVC   WTGIDTTR-WTGENTRY(TWO,RWTGC),LASTLOAD+SIX MODID   YM1447 10050000
         MVC   WTGIDTTR+TWO-WTGENTRY(THREE,RWTGC),LASTLOAD+NINE  YM1447 10070000
         MVC   PDRETCOD,RETCODE         MOVE RETURN CODE TO WKAREA      10150000
         MVC   PDABCODE,ABCODE          MOVE ABEND CODE TO WKAREA       10200000
         MVC   PDCODE,TRCCODE           MOVE TRACE CODE TO WKAREA       10250000
         MVC   PDMSG(EIGHT),ID          MOVE OPEN/CLOSE/EOV      M0069  10300000
*                                       MSG ID TO PD WKAREA             10350000
         AIF   ('&COMP' NE 'EOV').SKIPEOV EOV ONLY FOLLOWS       YM3111 10352000
         ICM   RF,B'1100',PDABCODE      X37N0000                 YM3111 10354000
         SLL   RF,FOUR                  37N00000                 YM3111 10356000
         SRL   RF,24                    00000037                 YM3111 10358000
         LA    RET,OPENCODE             GET OPEN CODE            YM3111 10360000
         CR    RF,RET                   COMPARE IF FROM COMMON   YM3111 10362000
         BNE   PDF01050                 BRANCH IF NOT COMMON     YM3111 10364000
         MVI   PDMSG+THREE,CHAR1        SET OPEN ID              YM3111 10366000
.SKIPEOV ANOP                                                    YM3111 10368000
PDF01050 MVC   PDMSG+FOUR(TWO),MSGID    MOVE LAST TWO CHARS      YM3111 10400000
*                                       OF ID TO WKAREA                 10450000
         L     RDCB,DXPDCBAD            INSURE COPIED DCB PTR    YM3105 10500000
*                                                                YM1447 10510000
*        IECRES LOAD,PREFIX=WTGPREFX,BRANCH=DIRECT,              Y02080 10710000
*              MODNM=NEXTMOD                                     YM1447 10710200
*                                       XCTL TO IFG0199B         Y02080 10710400
         IECRES LOAD,PREFIX=WTGPREFX,BRANCH=DIRECT,              Y02080X10762000
               MODNM=NEXTMOD                                     YM1447 10812000
PDF01060 EQU   *                        ISSUE WTP AND ABEND             11000000
         MVC   PDMSGLNG(ENDMSG+FOUR),NOCODMSG                           11050000
*                                       MOVE MESSAGE TO BUFFER          11100000
         MVC   PDMSGLNG+ENDMSG-L'WTGMODNM(L'WTGMODNM),PDERRMOD   YM3111 11102000
*                                       MOVE ERROR MOD TO BUFFER YM3111 11104000
         LR    RD,R1                    SAVE PTR TO WKAREA              11150000
*        WTO   MF=(E,(1))               ISSUE WRITE-TO-PROGRAMMER       11200000
         WTO   MF=(E,(1))               ISSUE WRITE-TO-PROGRAMMER       11210000
         LA    R1,ABENDCOD              GET FXX ABEND CODE              11400000
PDF01100 EQU   *                        ABEND                           11850000
         L     RDCB,DXUDCBAD            GET USER DCB ADDRESS     YM5924 11860000
*        ABEND (1),DUMP,,SYSTEM         SYSTEM ABEND WITH A DUMP Y02080 11900000
         ABEND (1),DUMP,,SYSTEM         SYSTEM ABEND WITH A DUMP Y02080 11910000
*                                                                       11915000
*********************************************************************** 11920000
*                                                                       11925000
*        CONSTANTS                                                      11930000
*                                                                       11940000
*********************************************************************** 11943300
*                                                                       11946600
         DS    0F                                                       11950000
ZEROS    DC    F'0'                                                @PRA 11975000
CODEMASK DC    X'000000FF'              MASK TO ZERO HI-3 BYTES OF      12000000
*                                       INTERNAL CODE                   12010000
NOCODMSG DC    AL2(ENDMSG)              LNG OF MSG                      12050000
         DC    X'8000'                  MCSFLAGS                        12100000
         DC    CL8'IEC900I'             MSG ID                          12150000
         DC    C'INVALID ABEND CODE PASSED TO '                         12200000
         DC    C'&A'                    MODULE ID                       12250000
         DC    C' FROM '                MORE MESSAGE             YM3111 12252000
ERRORMOD DC    CL8' '                   MODULE IN ERROR          YM3111 12254000
ENDMSG   EQU   *-NOCODMSG               LNG OF MSG                      12300000
         DC    X'04000020'              ROUT AND DESCRIPTOR CODES       12350000
ID       DC    C'IEC'                   DATA MAN ID                     12500000
         DC    C'&C'                    OPEN/CLOSE/EOV ID               12550000
         DC    C'  I '                                                  12600000
IGCNAME  DC    C'IGC000  '              FIRST MODULE 'IGC' NAME  YM7883 12610000
HIODRBIT DC    A(X'80000000')                                      @LRA 12630000
         EJECT                                                          12650000
*        THE FOLOWING TABLE IS USED TO DETERMINE THE EXTERNAL ABEND     12660000
*        CODE, RETURN CODE, DATA TO BE TRACED, AND ID OF A WRITE-       12670000
*        TO-PROGRAMMER MSG TO BE ISSUED.  THE TABLE CONSISTS OF         12680000
*        SEVEN-BYTE ENTRIES IN THE FOLLOWING FORMAT.                    12690000
*              BYTE 0 - INTERNAL CODE                                   12692000
*              BYTE 1-2 - BITS 0-11 EXTERNAL ABEND CODE                 12694000
*                       BITS 12-15 FLAGS INDICATING VALID OPTIONS THE   12696000
*                                       USER MAY EXERCISE IN HIS ABEND  12698000
*                                       EXIT ROUTINE FOR THE PARTICULAR 12698400
*                                       ABEND.                          12698800
*                                       THE POSSIBLE BIT SETTINGS IN    12698900
*                                       THIS FIELD ARE AS FOLLOWS.      12699100
*                                        X'08' - RECOVERY PERMITTED     12699200
*                                        X'04' - IGNORE PERMITTED       12699300
*                                        X'02' - DELAY ABEND PERMITTED  12699400
*                                        X'01' - DISSALLOW DCB  ZA01291 12699500
*                                         ABEND EXIT - POSSIBLE ZA01291 12701500
*                                         BAD DCB               ZA01291 12703500
*              BYTE 3 - RETURN CODE TO BE PASSED IN REGISTER 15 WHEN    12706000
*                       ABEND IS ISSUED                                 12708000
*              BYTE 4 - CODE INDICATING THE DATA TO BE TRACED FOR       12710000
*                       PARTICULAR ABEND                                12712000
*                                       THE POSSIBLE CODES IN THIS      12714000
*                                       FIELD ARE AS FOLLOWS. (HEX)     12716000
*                                       00 - NO TRACE                   12717000
*                                       04 - IOB AND CCWS               12718000
*                                       08 - TIOT ENTRY AND UCBS        12720000
*                                       0C - JFCBVOLS                   12722000
*                                       10 - TAPE LABEL                 12724000
*                                       14 - JFCBDSNM                   12726000
*                                       18 - VOLUME LABEL               12728000
*                                       1C - DSCB (ALL ASSOCIATED WITH  12730000
*                                            ABEND THAT ARE IN CORE.    12732000
*                                       28 - DCB                        12734000
*                                       34 - DCB, DSCB                  12736000
*                                       38 - JFCBELNM                   12738000
*                                       3C - DCB EXIT LIST ENTRIES      12740000
*                                       40 - DCB, TAPE LABEL            12742000
*                                       44 - DCB, JFCBDSNM              12744000
*                                       48 - JFCBDSNM                   12746000
*                                       4C - JFCBVOLS, DSCB      YM1238 12748000
*                                       80 - TRACING WILL BE DONE  @LBA 12748600
*                                           BY SAM MODULE IFGXXX9C @LBA 12749200
*              BYTE 5-6 - TWO BYTE ID TO BE PUT IN WRITE-TO-PROGRAMMER  12750000
*                       MESSAGE.                                        12752000
CODTABLE EQU   *                                                        12753000
         AIF   ('&COMP' EQ 'OPEN').GENOP                                12754000
.*                                      IS OPEN EXPANSION REQUIRED      12756000
         AIF   ('&COMP' EQ 'OPENEX').GENOPEX                            12758000
.*                                      IS OPEN EXECUTOR EXPANSION      12760000
.*                                      REQUIRED                        12770000
         AIF   ('&COMP' EQ 'CLOSE').GENCL                               12800000
.*                                      IS CLOSE EXPANSION REQUIRED     12810000
         AIF   ('&COMP' EQ 'TCLOSE').GENTC                              12850000
.*                                      IS TCLOSE EXPANSION REQUIRED    12860000
         AIF   ('&COMP' EQ 'EOV').GENEOV                                12900000
.*                                      IS EOV EXPANSION REQUIRED       12910000
         MEXIT                                                          12950000
.GENOP   ANOP                                                           13000000
         DC    X'0141360408'            1                               13001000
         DC    C'45'                                                    13001500
         DC    X'0241360804'            2                               13002000
         DC    C'45'                                                    13002500
         DC    X'0341360C04'            3                               13003000
         DC    C'45'                                                    13003500
         DC    X'0441361004'            4                               13004000
         DC    C'45'                                                    13004500
         DC    X'0591363410'            5                          @L2A 13005000
         DC    C'50'                                               @L2A 13005500
         DC    X'0651360420'            6                               13006000
         DC    C'46'                                                    13006500
         DC    X'0791326C0C'            7    RACF NOT AUTHORIZED   @13A 13007000
         DC    C'50'                                               @13A 13007500
         DC    X'08413E180C'            8                               13008000
         DC    C'45'                                                    13008500
         DC    X'096136040C'            9                               13009000
         DC    C'47'                                                    13009500
         DC    X'0AA136040C'            10                              13010000
         DC    C'51'                                                    13010500
         DC    X'0B613E0804'            11                              13011000
         DC    C'47'                                                    13011500
         DC    X'0C613E0C10'            12                              13012000
         DC    C'47'                                                    13012500
         DC    X'0D713E0400'            13                       XM3491 13013000
         DC    C'48'                                                    13013500
         DC    X'0E813E0414'            14                              13014000
         DC    C'49'                                                    13014500
         DC    X'0F613E1004'            15                              13015000
         DC    C'47'                                                    13015500
         DC    X'10613E1404'            16                              13016000
         DC    C'47'                                                    13016500
         DC    X'1101360400'            17                              13017000
         DC    C'41'                                                    13017500
         DC    X'1201360800'            18                              13018000
         DC    C'41'                                                    13018500
         DC    X'1391360410'            19  NO VOLUME ACCESS WHEN  @L3C 13019000
         DC    C'50'                        USED FOR ANSI TAPES    @L3C 13019500
         DC    X'1491360810'            20  NO FILE ACCESS WHEN    @L3C 13020000
         DC    C'50'                        USED FOR ANSI TAPES    @L3C 13020500
         DC    X'1521360804'            21                              13021000
         DC    C'43'                                                    13021500
         DC    X'1691300C00'            22                              13022000
         DC    C'50'                                                    13022500
         DC    X'1741362408'            23                              13023000
         DC    C'45'                                                    13023500
         DC    X'189136100C'            24                       Y01048 13024000
         DC    C'50'                                             Y01048 13024500
         DC    X'1951360810'            25  ANSI LABEL STANDARDS   @L3A 13025000
         DC    C'46'                        VIOLATION              @L3A 13025500
         DC    X'1A41360408'            26                              13026000
         DC    C'45'                                                    13026500
         DC    X'1B41362004'            27                              13027000
         DC    C'45'                                                    13027500
         DC    X'1C71360800'            28                       XM3491 13028000
         DC    C'48'                                            SA55580 13028500
         DC    X'1D71360C10'            29  OPERATOR REJECT LABEL  @L3A 13029000
         DC    C'48'                        REWRITE                @L3A 13029500
         DC    X'1E213E0448'            30                              13030000
         DC    C'43'                                                    13030500
         DC    X'1F21361804'            31                              13031000
         DC    C'43'                                                    13031500
         DC    X'2011360804'            32                              13032000
         DC    C'42'                                                    13032500
         DC    X'2151360C10'            33  ANSI INCOMPATIBLE      @L3A 13033000
         DC    C'46'                        VERSION CONFLICT       @L3A 13033500
         DC    X'2211360C3C'            34                              13034000
         DC    C'42'                                                    13034500
         DC    X'2391326000'            35   RACDEF REJECT DSN     @10A 13035000
         DC    C'50'                                               @10A 13035500
         DC    X'2431360404'            36                              13036000
         DC    C'44'                                                    13036500
         DC    X'2541361C00'            37                              13037000
         DC    C'45'                                                    13037500
         DC    X'2641363804'            38 /* ERROR READING BLKID  @L4A 13038000
         DC    C'45'                                                    13038500
         DC    X'2721363014'            39  DSCB 'ENQ' HELD BY     @22C 13039000
         DC    C'43'                        ANOTHER USER           @14C 13039500
         DC    X'2800000000'            40                              13040000
         DC    C'  '                                                    13040500
         DC    X'2991301408'            41                       Y02083 13041000
         DC    C'50'                                             Y02083 13041500
         DC    X'2AC1361008'            42                              13042000
         DC    C'53'                                                    13042500
         DC    X'2B01366444'            43                              13043000
         DC    C'41'                                                    13043500
         DC    X'2C01366828'            44                              13044000
         DC    C'41'                                                    13044500
         DC    X'2D31300834'            45   DASD CALCULATION      @L6C 13045000
         DC    C'44'                         SERVICES FAILED       @L6C 13045500
         DC    X'2E01366C08'            46                              13046000
         DC    C'41'                                                    13046500
         DC    X'2F01367010'            47                              13047000
         DC    C'41'                                                    13047500
         DC    X'3011323834'            48                         @20C 13048000
         DC    C'42'                                               @20C 13048500
         DC    X'3191326400'            49   RACF REJECT BLP       @10A 13049000
         DC    C'50'                                               @10A 13049500
         DC    X'3211361804'            50                              13050000
         DC    C'42'                                                    13050500
         DC    X'332136C434'            51 INHIBIT OPEN OF STRIPED @33A 13051000
         DC    C'43'                       DATA SETS - DFP V3 ONLY @33A 13051500
         DC    X'346136180C'            52   AUTOMATED TAPE LIBR.  @39C 13052000
         DC    C'47'                                               @LEC 13052500
         DC    X'3501361430'            53                       Y02134 13053000
         DC    C'41'                                             Y02134 13053500
         DC    X'3611322030'            54                         @PAA 13053600
         DC    C'42'                                               @PAA 13053700
         DC    X'371132244C'            55                         @PAA 13053800
         DC    C'42'                                               @PAA 13053900
         DC    X'3811322808'            56                         @PAA 13054000
         DC    C'42'                                               @PAA 13054100
         DC    X'3911322C28'            57                         @PAA 13054200
         DC    C'42'                                               @PAA 13054300
         DC    X'3A11323000'            58                         @PAA 13054400
         DC    C'42'                                               @PAA 13054500
         DC    X'3B11323444'            59                         @PAA 13054600
         DC    C'42'                                               @PAA 13054700
         DC    X'3C61361C0C'            60   AUTOMATED TAPE LIBR.  @39A 13054800
         DC    C'47'                                               @LEA 13054900
         DC    X'3D6136200C'            61   AUTOMATED TAPE LIBR.  @39A 13055000
         DC    C'47'                                               @LEA 13055100
         DC    X'3E6136240C'            62   AUTOMATED TAPE LIBR.  @39A 13055200
         DC    C'47'                                               @LEA 13055300
         DC    X'3F6136280C'            63   AUTOMATED TAPE LIBR.  @39A 13055400
         DC    C'47'                                               @LEA 13055500
         DC    X'4061362C0C'            64   AUTOMATED TAPE LIBR.  @39A 13055600
         DC    C'47'                                               @LEA 13055700
         DC    X'416136300C'            65   AUTOMATED TAPE LIBR.  @39A 13055800
         DC    C'47'                                               @LEA 13055900
         DC    X'426136340C'            66   AUTOMATED TAPE LIBR.  @39A 13056000
         DC    C'47'                                               @LEA 13056100
         DC    X'436136380C'            67   AUTOMATED TAPE LIBR.  @39C 13056200
         DC    C'47'                                               @LEA 13056300
         DC    X'446136400C'            68   AUTOMATED TAPE LIBR.  @39C 13056400
         DC    C'47'                                               @PGA 13056500
         DC    X'456136440C'            69   AUTOMATED TAPE LIBR.  @39C 13056600
         DC    C'47'                                               @PGA 13056700
         DC    X'4621315834'            70   UNSUPP DS TYPE        @L5A 13056800
         DC    C'43'                                               @L5A 13056900
         DC    X'4741363C44'            71   CASF FAILURE          @P9A 13057000
         DC    C'45'                                               @P9A 13057100
         DC    X'4861363C0C'            72   AUTOMATED TAPE LIBR.  @39A 13057200
         DC    C'47'                                               @PGA 13057300
         DC    X'496136480C'            73   AUTOMATED TAPE LIBR.  @39A 13057400
         DC    C'47'                                               @PJA 13057500
         DC    X'4A2136C034'            74   STRIPED DATA SET NOT  @LGA 13057600
         DC    C'43'                         ON ESCON CHANNEL OR   @LGA 13057700
         DC    X'4B61364C0C'            75   AUTOMATED TAPE LIBR.  @39A 13057800
         DC    C'47'                                               @PJA 13057900
         DC    X'4C6136500C'            76   AUTOMATED TAPE LIBR.  @39A 13058000
         DC    C'47'                                               @PJA 13058100
         DC    X'4D91366800'            77   RACDEF REJECT VOL USE @10A 13058200
         DC    C'50'                                               @10A 13058300
         DC    X'4E21324014'            78   PDSE OPENED FOR EXCP  @LBA 13058400
         DC    C'43'                         BY UNAUTHORIZED CALLER@LBA 13058500
         DC    X'4F0136F034'            79   CATALOG ERROR FOR     @34A 13059000
         DC    C'41'                         ATTR XTNSION D/S      @34A 13059500
         DC    X'506136540C'            80   AUTOMATED TAPE LIB    @39A 13059600
         DC    C'47'                                               @36A 13059700
         DC    X'516136580C'            81   SMCT SUPPORT          @41A 13059800
         DC    C'47'                                               @41A 13059900
         DC    X'5261365C0C'            82   SMCT SUPPORT          @41A 13060000
         DC    C'47'                                               @41A 13060100
         DC    X'536136600C'            83   SMCT SUPPORT          @45A 13060200
         DC    C'47'                                               @45A 13060300
         DC    X'5411323C28'            84   FAIL OPEN FOR VSAM    @LKA 13060400
         DC    C'42'                         CONTROL ACB           @LKA 13060500
         DC    X'5511324034'            85   VSAM RLS ERROR        @LKA 13060600
         DC    C'42'                         CONTROL ACB           @LKA 13060700
         DC    X'566136640C'            86   BLYTHE LIB SUPPORT    @51A 13060800
         DC    C'47'                                               @51A 13060900
         DC    X'576136680C'            87   BLYTHE LIB SUPPORT    @51A 13061000
         DC    C'47'                                               @51A 13061100
         DC    X'5851361010'            88   DISP=MOD SPECIFIED FOR@LPA 13061200
         DC    C'46'                         NON-IBM V4 TAPE       @LPA 13061300
         DC    X'5951361410'            89   ANSI V4 CCSID CONFLICT@LPA 13061400
         DC    C'46'                                               @LPA 13061500
         DC    X'5A0136E044'            90   DEVTYPE ERROR         @LQA 13061600
         DC    C'41'                                               @LQA 13061700
         DC    X'5B0136E140'            91   LBI REQUIRED BUT NOT  @LQA 13061800
         DC    C'41'                         SPECIFIED             @LQA 13061900
         DC    X'5C41325044'            92   TAPE INSTALL EXIT     @LSA 13062000
         DC    C'45'                         INVALID RETURN CODE   @LSA 13062100
.*                                                                    * 13062200
.*****              93 THROUGH 108 ARE AVAILABLE - SEE GENOPEX     @LSC 13062300
.*                                                                    * 13062400
         DC    X'6D71361000'            109   IEC510D LOOP         @23A 13062500
         DC    C'48'                                               @23A 13062600
         DC    X'6E413E340C'            110                    @ZA00615 13062700
         DC    C'45'                                           @ZA00615 13063500
         DC    X'6F41302C00'            111                    @Y30LSFY 13103500
         DC    C'45'                                           @Y30LSFY 13113500
         DC    X'7041303000'            112                    @Y30LSFY 13123500
         DC    C'45'                                           @Y30LSFY 13133500
         DC    X'7141364C00'            113   EXP DATE BYPASS NOT  @LHA 13133700
         DC    C'45'                          AUTHORIZED           @LHA 13133900
         DC    X'72713A140C'            114                        @PHA 13134300
         DC    C'48'                                               @53C 13134400
         DC    X'732136C834'            115   COMPRESSED DATASET   @LIA 13134600
         DC    C'43'                          CAN'T OPEN FOR UPDAT @LIA 13134700
         DC    X'742136CC1C'            116   DSCB INDICATES       @LIA 13134800
         DC    C'43'                          COMPRESSED DATA SET  @LIA 13134900
.*                                            BUT DSCB DOESN'T     @LIA 13135000
.*                                            INDICATE STRIPED D/S @LIA 13135100
         DC    X'7541364008'            117 INCOMPATIBLE DEVICE    @H2A 13135300
         DC    C'45'                                       TYPE    @H2A 13135500
         DC    X'7641364408'            118 INCONSISTENT VOLUME    @H2A 13135900
         DC    C'45'                             RECORDING MODE    @H2A 13136100
.*                                                                    * 13136300
.*****           119 THROUGH 120 ARE AVAILABLE                    *@H2C 13136500
.*                                                                    * 13136700
         DC    X'790136D828'            121 INVALID XLRI/LRECL=X   @L3A 13136900
         DC    C'41'                                               @L3A 13137100
.*                                                                    * 13137300
.*****           122 THROUGH 123 ARE AVAILABLE - SEE GENOPEX      ***** 13137500
.*                                                                    * 13137700
.*                                                                    * 13137900
.*****           125 THROUGH 138 ARE AVAILABLE - SEE GENOPEX      ***** 13138100
.*                                                                    * 13138300
         DC    X'8B91361814'            139                      Y02082 13139000
         DC    C'50'                                             Y02082 13139500
         DC    X'8C91361C14'            140                      Y02082 13140000
         DC    C'50'                                             Y02082 13140500
         DC    X'8D91363800'            141  RACF REJECT       @ZA43856 13141500
         DC    C'50'                                           @Z40RSDS 13142500
         DC    X'8E91363C18'            142                    @ZA43856 13143500
         DC    C'50'                                           @Z40RSDS 13144500
         DC    X'8F91364018'            143                    @ZA43856 13145500
         DC    C'50'                                           @Z40RSDS 13146500
         DC    X'9091367000'            144                        @PBC 13146600
         DC    C'50'                                               @L7A 13146700
.*                                                                      13146800
         DC    X'9121369834'            145  STRIPE - VOLUMES NOT  @LGA 13146900
         DC    C'43'                         IN ASCENDING SEQUENCE @LGA 13147000
.*                                                                      13147100
         DC    X'922136AC34'            146  STRIPE - LAST VOLUME  @LGA 13147200
         DC    C'43'                         INDICATOR SET ON TOO  @LGA 13147300
.*                                           EARLY                 @LGA 13147400
.*                                                                      13147500
         DC    X'932136B034'            147  STRIPE - LAST VOLUME  @LGA 13147600
         DC    C'43'                         INDICATOR NOT SET     @LGA 13147700
.*                                                                      13147800
.*                                                                      13147900
         DC    X'942136B434'            148  STRIPE - INVALID      @LGA 13148000
         DC    C'43'                        VOLUME SEQUENCE NUMBER @LGA 13148100
.*                                                                      13148200
         DC    X'952136B834'            149  STRIPE - EXCP NOT     @LGA 13148300
         DC    C'43'                         SUPPORTED - EVEN FOR  @LGA 13148400
.*                                           AUTHORIZED CALLER     @LGA 13148500
.*                                                                      13148600
         DC    X'9621369434'            150  STRIPE - DSORG NOT    @LGA 13148700
         DC    C'43'                         PS                    @LGA 13148800
.*                                                                    * 13148900
         DC    X'9721369C34'            151  DCBE - DCB POINTER IN @LGA 13149000
         DC    C'43'                         DCBE NOT ZERO         @LGA 13149100
.*                                                                      13149200
         DC    X'98A1360808'            152                    @ZA04601 13152000
         DC    C'51'                                           @ZA04601 13152500
         DC    X'99A1360C08'            153                    @ZA04602 13153000
         DC    C'51'                                           @ZA04602 13153500
         DC    X'9AA1361010'            154                    @ZA04603 13154000
         DC    C'51'                                           @ZA04603 13154500
         DC    X'9BA1361410'            155                    @ZA04604 13155000
         DC    C'51'                                           @ZA04604 13155500
         DC    X'9CA1361810'            156                    @ZA04605 13156000
         DC    C'51'                                           @ZA04605 13156500
         DC    X'9D0136F434'            157 STRIPE - ERROR FINDING @42A 13160100
         DC    C'41'                        EXT FORMAT CELL        @42A 13163700
         DC    X'9E2136BC4C'            158                        @40A 13167300
         DC    C'43'                                               @40A 13170000
         DC    X'9F2136F048'            159 STRIPE - CVAF ERROR    @44A 13170900
         DC    C'43'                        DCBESIZE PROCESSING    @44A 13171800
.*                                                                      13172700
.*****           160 THROUGH 187 ARE AVAILABLE - SEE GENOPEX       @44C 13175400
.*                                                                 @LFA 13178100
         DC    X'BC21368834'            188  POSIX - ANY OPEN TO A @LFA 13180800
         DC    C'43'                         POSIX FILE (I.E.      @LFA 13183500
.*                                           PATH= WAS SPECIFIED). @LFA 13186200
.*                                                                    * 13188900
.*****           189 THROUGH 192 ARE AVAILABLE - SEE GENOPEX      ***** 13191600
.*                                                                    * 13194300
.*                                                                 @LFA 13197000
         DC    X'C121368C34'            193  POSIX - ANY OPEN TO A @LFA 13199700
         DC    C'43'                         PDSE/X                @LFA 13202400
.*                                                                    * 13205100
.*****           194 THROUGH 213 ARE AVAILABLE - SEE GENOPEX      ***** 13207800
.*                                                                    * 13210500
         DC    X'D603D6044C'            214                             13214000
         DC    C'56'                                                    13214500
         DC    X'D703D6084C'            215                             13215000
         DC    C'56'                                                    13215500
         DC    X'D821360C04'            216                             13216000
         DC    C'43'                                                    13216500
         DC    X'D941364844'            217                        @24A 13217000
         DC    C'45'                                               @24A 13217500
.*                                                                    * 13218000
.*****           218 THROUGH 219 ARE AVAILABLE - SEE GENOPEX      ***** 13218500
.*                                                                    * 13219000
         DC    X'DCC1361808'            220                     OY02814 13220000
         DC    C'53'                                            OY02814 13220500
.*                                                                    * 13221400
.*****           221 THROUGH 225 ARE AVAILABLE - SEE GENOPEX      ***** 13222300
.*                                                                    * 13223200
         DC    X'E20136BC28'            226                        @16A 13224100
         DC    C'41'                                               @16A 13225000
.*       DC    X'E300000000'            227  AVAILABLE- SEE GENOPEX@16A 13225900
.*       DC    C'  '                                               @16A 13226800
         DC    X'E491322028'            228                      Y02082 13228000
         DC    C'50'                                             Y02082 13228500
.*       DC    X'E500000000'            229  AVAILABLE - SEE GENOPEX  * 13229000
.*       DC    C'  '                                                  * 13229500
         DC    X'E62136201C'            230                      Y02072 13230000
         DC    C'43'                                             Y02072 13230500
         DC    X'E72136241C'            231                      Y02072 13231000
         DC    C'43'                                             Y02072 13231500
         DC    X'E803D60C34'            232                    @ZA02225 13233500
         DC    C'56'                                           @ZA02225 13235500
.*                                                                    * 13236100
.*****           233 THROUGH 237 ARE AVAILABLE - SEE GENOPEX      ***** 13236700
.*                                                                    * 13237300
         DC    X'EE91302408'            238                      Y02083 13238000
         DC    C'50'                                             Y02083 13238500
         DC    X'EF91302808'            239                      Y02083 13239000
         DC    C'50'                                             Y02083 13239500
.*                                                                    * 13239700
.*****           240 THROUGH 241 ARE AVAILABLE - SEE GENOPEX      ***** 13239900
.*                                                                    * 13240100
         DC    X'F221362C14'            242                    @G60ASRB 13240500
         DC    C'43'                                           @G60ASRB 13241500
         DC    X'F391362C14'            243                      Y02082 13243000
         DC    C'50'                                             Y02082 13243500
         DC    X'F491363010'            244                      Y02082 13244000
         DC    C'50'                                             Y02082 13244500
         DC    X'F591367200'            245   RACF UNEXPECTED RC   @21C 13251600
         DC    C'50'                                               @21C 13258700
         DC    X'F621362808'            246                      YM1238 13266000
         DC    C'43'                                             YM1238 13276000
         DC    X'F791324800'            247                    @G32DSMI 13286000
         DC    C'50'                                           @G32DSMI 13296000
         DC    X'F891324C00'            248                    @G32DSMI 13306000
         DC    C'50'                                           @G32DSMI 13316000
         DC    X'F991325000'            249                    @G32DSMI 13326000
         DC    C'50'                                           @G32DSMI 13336000
         DC    X'FA91325400'            250                    @G32DSMI 13346000
         DC    C'50'                                           @G32DSMI 13356000
         DC    X'FB91325800'            251                    @G32DSMI 13366000
         DC    C'50'                                           @G32DSMI 13376000
         DC    X'FC91325C00'            252                    @G32DSMI 13386000
         DC    C'50'                                           @G32DSMI 13396000
         DC    X'FD4138344C'            253                    @VS44627 13406000
         DC    C'45'                                           @G18MSBS 13416000
         DC    X'FE'                    254 - INTERNAL ABEND CODE  @H1A 13424300
         DC    X'0136'                        SYSTEM ABEND 013     @H1A&13432600
                                              ... IGNORE/DELAY OK  @H1A 13440900
         DC    X'E8'                          RET CODE IN REG. 15  @H3A 13449200
         DC    X'3C'                          TRACE CODE-DCB EXLST @H1A 13457500
         DC    C'41'                          MESSAGE IEC141       @H1A 13465800
         DC    X'FF00000000'            255  AVAILABLE - SEE GENOPEX  * 13474100
         DC    C'  '                                                  * 13482400
         DC    X'00'                    END OF TABLE MARKER        @07A 13490700
         AGO   .GNOPEND                                                 13499900
.GENOPEX ANOP                                                           13500000
         DC    X'2E01306C28'            46                     XL02942* 13505100
         DC    C'41'                                           XL02942* 13510200
         DC    X'2F01307028'            47                     XL02942* 13515300
         DC    C'41'                                           XL02942* 13520400
         DC    X'300136AC28'            48                        @09A* 13525500
         DC    C'41'                                              @09A* 13530600
         DC    X'310136F828'            49                        @LQA* 13533600
         DC    C'41'                                              @LQA* 13536600
         DC    X'320136FC28'            50                        @LQA* 13539600
         DC    C'41'                                              @LQA* 13542600
.*                                                                    * 13545900
         DC    X'3301360C28'            51                       Y02144 13551000
         DC    C'41'                                                    13551500
         DC    X'340136102C'            52                       Y02144 13552000
         DC    C'41'                                                    13552500
         DC    X'3501361430'            53                       Y02144 13553000
         DC    C'41'                                                    13553500
         DC    X'3601361834'            54                       Y02144 13554000
         DC    C'41'                                                    13554500
         DC    X'3701361C34'            55                       Y02144 13555000
         DC    C'41'                                                    13555500
         DC    X'3801362028'            56                       Y02144 13556000
         DC    C'41'                                                    13556500
         DC    X'3901362428'            57                       Y02144 13557000
         DC    C'41'                                                    13557500
         DC    X'3A01362828'            58                       Y02144 13558000
         DC    C'41'                                                    13558500
         DC    X'3B01362C28'            59                       Y02144 13559000
         DC    C'41'                                                    13559500
         DC    X'3C01363C28'            60                       Y02144 13560000
         DC    C'41'                                                    13560500
         DC    X'3D01363428'            61                       Y02144 13561000
         DC    C'41'                                                    13561500
         DC    X'3E01363828'            62                       Y02144 13562000
         DC    C'41'                                                    13562500
         DC    X'3F01363028'            63                       Y02144 13563000
         DC    C'41'                                                    13563500
         DC    X'4001364028'            64                       Y02144 13564000
         DC    C'41'                                                    13564500
         DC    X'4101364428'            65                       Y02144 13565000
         DC    C'41'                                                    13565500
         DC    X'4201364828'            66                       Y02144 13566000
         DC    C'41'                                                    13566500
         DC    X'43B1361004'            67                       Y02144 13567000
         DC    C'52'                                                    13567500
         DC    X'44B1361400'            68                       Y02144 13568000
         DC    C'52'                                                    13568500
         DC    X'45B1360C04'            69                       Y02144 13569000
         DC    C'52'                                                    13569500
         DC    X'46B1300800'            70                       YM3213 13570000
         DC    C'52'                                             YM3213 13570500
         DC    X'47B1360400'            71                       Y02144 13571000
         DC    C'52'                                                    13571500
         DC    X'4801364C28'            72                       Y02144 13572000
         DC    C'41'                                                    13572500
         DC    X'4901365024'            73                       Y02144 13573000
         DC    C'41'                                                    13573500
         DC    X'4A01365424'            74                       Y02144 13574000
         DC    C'41'                                                    13574500
         DC    X'4B01365808'            75                       Y02144 13575000
         DC    C'41'                                                    13575500
         DC    X'4C01365C28'            76                       Y02144 13576000
         DC    C'41'                                                    13576500
         DC    X'4D01366828'            77                        @LQA* 13576700
         DC    C'41'                                              @LQA* 13576900
.*                                                                    * 13577100
.*****                           78 IS  AVAILABLE - SEE GENOP     ***** 13577700
.*                                                                    * 13578300
         DC    X'4F24000428'            79                              13579000
         DC    C'55'                                                    13579500
         DC    X'5024000828'            80                              13580000
         DC    C'55'                                                    13580500
         DC    X'5124000C38'            81                              13581000
         DC    C'55'                                                    13581500
         DC    X'5224001028'            82                              13582000
         DC    C'55'                                                    13582500
         DC    X'5301366028'            83                       Y02144 13583000
         DC    C'41'                                                    13583500
         DC    X'5401368428'            84                       Y02144 13584000
         DC    C'41'                                                    13584500
         DC    X'5501307400'            85                              13585000
         DC    C'41'                                                    13585500
         DC    X'5601307820'            86                              13586000
         DC    C'41'                                                    13586500
         DC    X'5701307C20'            87                              13587000
         DC    C'41'                                                    13587500
         DC    X'5801308020'            88                              13588000
         DC    C'41'                                                    13588500
         DC    X'59B1361804'            89                       Y02144 13589000
         DC    C'52'                                                    13589500
         DC    X'5AB1301C00'            90                              13590000
         DC    C'52'                                                    13590500
         DC    X'5BC1300400'            91                              13591000
         DC    C'57'                                                    13591500
         DC    X'5CD1300400'            92                              13592000
         DC    C'58'                                                    13592500
         DC    X'5DE1300400'            93                              13593000
         DC    C'59'                                                    13593500
         DC    X'5E01368800'            94                     @ZM00695 13594000
         DC    C'41'                                                    13594500
         DC    X'5FB1362000'            95                       YM3213 13595000
         DC    C'52'                                                    13595500
         DC    X'60B1362400'            96                       YM3213 13596000
         DC    C'52'                                                    13596500
         DC    X'61B1362800'            97                       YM3213 13597000
         DC    C'52'                                                    13597500
         DC    X'62B1300804'            98                      YL03127 13598000
         DC    C'52'                                            YL03127 13598500
         DC    X'63B1301000'            99                      YL03127 13599000
         DC    C'52'                                            YL03127 13599500
         DC    X'6400040400'            100                      Y02144 13600000
         DC    C'03'                                             Y02144 13600500
         DC    X'65B1302C04'            101                      YM3213 13601000
         DC    C'52'                                             YM3213 13601500
         DC    X'66B1303004'            102                      YM3213 13602000
         DC    C'52'                                             YM3213 13602500
         DC    X'67B1303404'            103                      YM3213 13603000
         DC    C'52'                                             YM3213 13603500
         DC    X'6800040800'            104                      Y02144 13604000
         DC    C'03'                                             Y02144 13604500
         DC    X'6901368C28'            105  BDAM NO RECFM         @02C 13605000
         DC    C'41'                                           @ZA09124 13605500
         DC    X'6A0130A428'            106                     XL02942 13606000
         DC    C'41'                                            XL02942 13606500
         DC    X'6B0130A828'            107                     XL02942 13607000
         DC    C'41'                                            XL02942 13607500
         DC    X'6CB1303828'            108  B13-38  SETPRT MACRO  @15A 13607800
         DC    C'52'                         FAILURE               @15A 13608100
         DC    X'6D0136FD28'            109  Both LBI and Bypass   @LQA 13608300
         DC    C'41'                         DOS checkpoint specd  @LQA 13608500
         DC    X'6E0136FE28'            110  Both LBI and Update   @LQA 13608700
         DC    C'41'                         specified             @LQA 13608900
         DC    X'6F41302C00'            111                    @Y30LSFY 13609500
         DC    C'45'                                           @Y30LSFY 13611500
         DC    X'700136FF28'            112  Both LBI and Exchange @LQA 13612000
         DC    C'41'                         Buffering specified   @LQA 13612500
         DC    X'7101349000'            113                     YL03123 13613000
         DC    C'41'                                            YL03123 13613500
         DC    X'7201349428'            114                     YL03123 13614000
         DC    C'41'                                            YL03123 13614500
         DC    X'7301349828'            115                     YL03123 13615000
         DC    C'41'                                            YL03123 13615500
         DC    X'7401349C28'            116                     YL03123 13616000
         DC    C'41'                                            YL03123 13616500
         DC    X'750134A028'            117                     YL03123 13617000
         DC    C'41'                                            YL03123 13617500
         DC    X'760130CC00'            118  013-CC,3800 PRNTR @Z40MSRZ 13647500
         DC    C'41'                         SETPRT FAILURE    @Z40MSRZ 13667500
         DC    X'770130D028'            119                    @ZA37591 13687500
         DC    C'41'                                           @ZA37591 13693500
         DC    X'780136D428'            120  NO LRI/XLRI           @L3A 13693700
         DC    C'41'                                               @L3A 13693900
         DC    X'7900000000'            121  AVAILABLE - SEE GENOP @LBA 13694100
         DC    C'  '                                               @LBA 13694300
         DC    X'7A0136EC34'            122  PDSE - LRECL WRONG    @LBA 13694500
         DC    C'41'                                               @LBA 13694700
         DC    X'7B21365434'            123  PDSE - MAXIMUM NUMBER @LBA 13694900
         DC    C'43'                    OF MEMS CREATED (AT OPEN)  @LBA 13695100
         DC    X'7C0136E434'            124  013-E4,MAXIMUM        @01A 13695300
         DC    C'41'                         EXTENTS EXCEEDED      @01A 13695500
         DC    X'7D00000000'            125  AVAILABLE             @LBA 13695700
         DC    C'  '                                               @LBA 13695900
         DC    X'7E21363834'            126  PDSE OR STRIPED - OUTPUT   13696100
         DC    C'43'                     AND DCB KEYLEN ^ = 0      @LGC 13696300
         DC    X'7F21363C34'            127  PDSE - RECFM WRONG    @LBA 13696500
         DC    C'43'                                               @LBA 13696700
         DC    X'8021368428'            128  PDSE - SETLOCK FAILED @23A 13696900
         DC    C'43'                                IN IGG0194S    @23A 13697100
         DC    X'8121364828'            129  PDSE - ERROR RETURNED @LBA 13697300
         DC    C'43'                                FROM CASFE     @LBA 13697500
         DC    X'8221364C28'            130  PDSE - PS AND OUTPUT  @LBA 13697700
         DC    C'43'                         TO DIRECTORY)         @LBA 13697900
         DC    X'8321365028'            131  PDSE - JCDM ERROR     @LBA 13698100
         DC    C'43'                                               @LBA 13698300
         DC    X'8421365C28'            132  PDSE - CREATE MEMBER  @LBA 13698500
         DC    C'43'                         ERROR                 @LBA 13698700
         DC    X'8521366028'            133  PDSE - CONVERT ROUTINE@LBA 13698900
         DC    C'43'                         ERROR                 @LBA 13699100
         DC    X'8621366428'            134  PDSE - INVALID OPEN   @LBA 13699300
         DC    C'43'                         OPTION SPECIFIED      @LBA 13699500
         DC    X'8721366828'            135  PDSE - FB SPECIFIED   @LBA 13699700
         DC    C'43'                         AND LRECL=0 WHEN OPEN @LBA 13699900
.*                                           FOR OUTPUT OR 'U' SP- @LBA 13700100
.*                                           ECIFIED & BLKSIZE=0   @LBA 13700300
         DC    X'8821366C28'            136  PDSE - QSAM UPDATE    @LBA 13700500
         DC    C'43'                         AND NOT LOCATE        @LBA 13700700
.*                                                                 @LBA 13700900
         DC    X'8921367028'            137  PDSE - CROSS SYSTEM   @LBA 13701100
         DC    C'43'                         SHARING CONFLICT      @LBA 13701300
.*                                                                 @LBA 13701500
         DC    X'8A21367428'            138  PDSE - INVALID MEMBER @LBA 13701700
         DC    C'43'                         SHARE OPTIONS         @LBA 13701900
.*                                                                 @12D 13702100
         DC    X'8B21367834'            139  PDSE - ZERO PRIMARY   @18A 13702300
         DC    C'43'                         SPACE                 @18A 13702500
.*                                                                 @12D 13702700
         DC    X'8C21367C34'            140  PDSE - OUTPUT WHILE   @19A 13702900
         DC    C'43'                         DUMP IN PROGRESS      @19A 13703100
.*                                                                 @19A 13703300
         DC    X'8D21369034'            141  PDSE - ANY OPEN WHILE @LGC 13703500
         DC    C'43'                         RESTORE IN PROGRESS   @LGC 13703700
.*                                                                 @LGA 13703900
         DC    X'8E2136A034'            142  STRIPE - TRKCALC ERROR@LGA 13704100
         DC    C'43'                         (TRKSIZE EXCEEDED)    @LGA 13704300
.*                                                                 @LGA 13704500
         DC    X'8F2136A434'            143  STRIPE - BAD RC FROM  @LGA 13704700
         DC    C'43'                         RBNCNVT               @LGA 13704900
.*                                                                 @LGA 13705100
         DC    X'902136A834'            144  STRIPE - INCONSISTENT @LGA 13705300
         DC    C'43'                         STRIPES               @LGA 13705500
.*                                                                 @LJA 13705700
         DC    X'912136D034'            145  CMP - BAD RC FROM     @LJA 13705900
         DC    C'43'                         IGG019VY              @LJA 13706100
.*                                                                 @LJA 13706300
         DC    X'922136D434'            146  CMP - CANNOT CALCULATE@LJA 13706500
         DC    C'43'                         BLOCKSIZE             @LJA 13706700
.*                                                                 @LJA 13706900
         DC    X'932136D834'            147  CMP - NO BLKSIZE IN   @LJA 13707100
         DC    C'43'                         EFC IN CATALOG        @LJA 13707300
.*                                                                 @LJA 13707500
         DC    X'942136DC34'            148  CMP - BAD RC FROM     @LJA 13707700
         DC    C'43'                         COMPRESSION OPEN      @LJA 13707900
.*                                                                 @LJA 13708100
         DC    X'952136E034'            149  CMP - NULL TOKEN IN   @LJA 13708300
         DC    C'43'                         EFC IN CATALOG        @LJA 13708500
         DC    X'962136E434'            150  CMP - I/O ERROR       @42A 13708600
         DC    C'43'                         READING LAST BLK      @42A 13708700
         DC    X'972136E834'            151  STR - OPEN MULTIVOL   @42A 13708800
         DC    C'43'                         WITH QSAM, VBS, UPDATE@42A 13708900
.*                                           BFTEK=A               @42A 13709000
         DC    X'982136EC34'            152  CMP - INVALID REPRO CI@42A 13709100
         DC    C'43'                         REQUEST. INOUT/OUTIN  @42A 13709200
.*                                           DISP=MOD OR PHYSICAL  @42A 13709300
.*                                           SIZE > BUFFER SIZE    @42A 13709400
         DC    X'992136F448'            153  CMP - CVAF ERROR      @44A 13709500
         DC    C'43'                         DURING DCBESIZE       @44A 13709600
.*                                           PROCESSING            @44A 13709700
         DC    X'9A2136F844'            154  HFS - ATTEMPT MADE TO @LLA 13709800
         DC    C'43'                         OPEN EXTERNAL LINK    @LLA 13709900
         DC    X'9B2136FC44'            155  HFS - HFS/REMOTE FILE @LLA 13710000
         DC    C'43'                         NO LONGER EXISTS      @LLA 13710100
         DC    X'9C21364428'            156  HFS - OPEN MOD/EXTEND @LLA 13710200
         DC    C'43'                         HFS/REMOTE FILE WITH  @LLA 13710300
.*                                           RECFM=FB BUT LAST     @LLA 13710400
.*                                           RECORD IN FILE NOT    @LLA 13710500
.*                                           MULTIPLE OF LRECL     @LLA 13710600
.*                                                                 @12D 13710700
         DC    X'9D51361840'            157  ANSI V4 - USER KEY    @LPA 13710800
         DC    C'46'                         DOES NOT MATCH TCB KEY@LPA 13710900
.*                                                                 @LPA 13711000
         DC    X'9E51361C40'            158  ANSI V4 - AUTHORIZED  @LPA 13711100
         DC    C'46'                         USER ENCOUNTERED      @LPA 13711200
.*                                                                 @LPA 13711300
         DC    X'9F51362040'            159  ANSI V4 - DATACONV    @LPA 13711400
         DC    C'46'                         OPEN ERROR (INPUT)    @LPA 13711500
.*                                                                 @LPA 13711600
         DC    X'A051362440'            160  ANSI V4 - DATACONV    @LPA 13711700
         DC    C'46'                         OPEN ERROR (OUTPUT)   @LPA 13711800
.*                                                                 @LPA 13711900
         DC    X'A151362840'            161  ANSI V4 - CONVERSION  @LPA 13712000
         DC    C'46'                         NOT SUPPORTED ON LEVEL@LPA 13712100
.*                                           OF SYSTEM. REQUIRES   @LPA 13712200
.*                                           OS390 R5 OR HIGHER.   @LPA 13712300
.*                                                                    * 13712400
.*****               162 THROUGH 202 ARE AVAILABLE - SEE GENOP     @PQC 13712500
.*                                                                    * 13712600
         DC    X'CB2136E934'            203  FAIL IF PS DATA SET   @PQA 13712700
         DC    C'43'                         FOUND IN PO CONCAT    @PQA 13712800
.*                                                                    * 13712900
         DC    X'CC2136E234'            204  CMP - ERROR READING   @PPA 13713000
         DC    C'43'                         TAILORED DICTIONARY   @PPA 13713100
.*                                           IN IGG019VT (002-E2)  @PPA 13713200
.*                                                                    * 13713300
         DC    X'CD2136E334'            205  CMP - INVALID TAILORED@PPA 13713400
         DC    C'43'                         TOKEN DETECTED        @PPA 13713500
.*                                           BY IGG019VT (002-E3)  @PPA 13713600
.*                                                                    * 13713700
         DC    X'CE2136E534'            206  CMP - INVALID TAILORED@PPA 13713800
         DC    C'43'                         DICTIONARY DETECTED   @PPA 13713900
.*                                           BY IGG019VT (002-E5)  @PPA 13714000
.*                                                                    * 13714100
         DC    X'CF2136E634'            207  CMP - ERROR VALIDATING@PPA 13714200
         DC    C'43'                         TAILORED DICTIONARY   @PPA 13714300
.*                                           IN IGG019VT (002-E6)  @PPA 13714400
.*                                                                    * 13714500
         DC    X'D02136E734'            208  CMP - UNEXPECTED ERROR@PPA 13714600
         DC    C'43'                         FROM IGG019VT         @PPA 13714700
.*                                                                    * 13714800
         DC    X'D121363434'            209  CMP - FAIL OPEN OF DS @52A 13714900
         DC    C'43'                         WITH TAILORED DICT    @52A 13715000
.*                                           OR SKIPPED CIs        @52A 13715100
.*                                           ON DOWN LEVEL SYSTEM  @52A 13715200
.*                                                                    * 13715300
.* DO NOT USE INTERNAL CODE 210 AND 213-80...THEY WILL BE USED     @LFM 13715400
.* FOR PDSE TOLERATION IN EARLIER RELEASES                         @LFM 13715500
.*                                                                    * 13715600
         DC    X'D302060428'            211                      Y02144 13715700
         DC    C'38'                                             Y02144 13715800
         DC    X'D402060834'            212                      Y02144 13715900
         DC    C'38'                                             Y02144 13716000
.*                                                                    * 13716100
.*****               213 THROUGH 220 ARE AVAILABLE - SEE GENOP    ***** 13716700
.*                                                                    * 13718800
         DC    X'DD0136B028'            221                     SA49404 13721000
         DC    C'41'                                            SA49404 13721500
         DC    X'DE0136B428'            222                     SA51107 13722000
         DC    C'41'                                            SA51107 13722500
         DC    X'DF0134B828'            223                     YL03123 13723000
         DC    C'41'                                            YL03123 13723500
.*                                                                    * 13724100
.*****               224 THROUGH 225 ARE AVAILABLE - SEE GENOP    ***** 13724700
.*                                                                    * 13725300
         DC    X'E20136BC00'            226                      Y02144 13726000
         DC    C'41'                                             Y02144 13726500
         DC    X'E30134C000'            227                      Y02144 13727000
         DC    C'41'                                             Y02144 13727500
.*       DC    X'E400000000'            228  AVAILABLE - SEE GENOP    * 13728000
.*       DC    C'  '                                                  * 13728500
         DC    X'E50136C428'            229                      Y02072 13729000
         DC    C'41'                                             Y02072 13729500
.*                                                                    * 13735100
.*****               230 THROUGH 251 ARE AVAILABLE - SEE GENOP    ***** 13740700
.*                                                                    * 13746300
         DC    X'FC0134C844'            252                      YM1195 13752000
         DC    C'41'                                             YM1195 13752500
         DC    X'FD00000000'            253  AVAILABLE - SEE GENOP    * 13787400
         DC    C'  '                                                  * 13822300
         DC    X'FE00000000'            254  AVAILABLE - SEE GENOP    * 13857200
         DC    C'  '                                                  * 13892100
         DC    X'FF00000000'            255  AVAILABLE - SEE GENOP    * 13927000
         DC    C'  '                                                  * 13961900
         DC    X'00'                    END OF TABLE MARKER             13997000
.GNOPEND ANOP                                                           13997300
*                                                                     * 13997600
*        XCTLTABL ID=(NEXTMOD,IFG0199B,LASTLOAD,IFG0198N),       YM1447 13998000
*              BRT=YES,LENGTH=                                   Y02080 13998500
         XCTLTABL ID=(NEXTMOD,IFG0199B,LASTLOAD,IFG0198N),       YM1447X13998900
               BRT=YES,LENGTH=                                   Y02080 13999500
         AGO   .GENDSCT                                                 13999900
.GENCL   ANOP                                                           14000000
         DC    X'0101410400'            01                     @ZA30860 14020000
         DC    C'08'                                           @ZA30860 14030000
         DC    X'0221460C04'            02 ERROR READING BLKID     @L4A 14033100
         DC    C'10'                                                    14036200
         DC    X'03214E1028'            03 BLOCKID/DCB MISMATCH    @L4A 14039300
         DC    C'10'                                                    14042400
         DC    X'04214E1428'            04 AL DS EXCEEDS 1 MILLION @25A 14045500
         DC    C'10'                                                    14048600
.*                                                                    * 14051700
.*****                05 THROUGH 60 ARE AVAILABLE                  @LBC 14054800
.*                                                                    * 14057900
         DC    X'3D71460404'            61                              14061000
         DC    C'15'                                                    14061500
         DC    X'3E71460C04'            62                              14062000
         DC    C'15'                                                    14062500
         DC    X'3F71460804'            63                              14063000
         DC    C'15'                                                    14063500
         DC    X'4021460404'            64                              14064000
         DC    C'10'                                                    14064500
         DC    X'4121460804'            65                              14065000
         DC    C'10'                                                    14065500
.*                                                                    * 14070600
.*****                66 THROUGH 85 ARE AVAILABLE                 ***** 14075700
.*                                                                    * 14080800
         DC    X'5631460404'            86                              14086000
         DC    C'11'                                                    14086500
         DC    X'57A1460404'            87                              14087000
         DC    C'16'                                                    14087500
         DC    X'5841460404'            88                              14088000
         DC    C'12'                                                    14088500
         DC    X'5931460804'            89                              14089000
         DC    C'11'                                                    14089500
         DC    X'5A61460404'            90                              14090000
         DC    C'14'                                                    14090500
         DC    X'5B41460804'            91 QSAM BUFFER FLUSH ERROR @27C 14092000
         DC    C'12'                                               @17A 14093500
.*                                                                    * 14095000
         DC    X'5C61402034'            92    STRIPE - ERROR FROM  @LGA 14096500
         DC    C'14'                          RBNCNVT DETECTED BY  @LGA 14098000
.*                                            IGG0201V             @LGA 14099500
.*                                                                    * 14103200
         DC    X'5D61402434'            93    STRIPE - ERROR       @LGA 14103600
         DC    C'14'                          WRITING EOF DETECTED @LGA 14104000
.*                                            BY IGG0201V          @LGA 14105500
         DC    X'5E31460C04'            94 FAILURE READING DSCB    @34A 14105800
         DC    C'11'                       FOR ATTR XTNSION D/S    @34A 14106100
         DC    X'5F61402834'            95 CATALOG FAILURE FOR     @34A 14106400
         DC    C'14'                       ATTR XTNSION D/S        @34A 14106700
.*                                                                    * 14106900
.*****                96 IS AVAILABLE                              @42C 14107100
.*                                                                    * 14107300
         DC    X'6161403034'            97 CMP - INVALID STATS IN  @LJA 14107700
         DC    C'14'                       EFC IN CATALOG          @LJA 14107900
.*                                                                 @LJA 14108100
         DC    X'6261403434'            98 CMP - UNABLE TO UPDATE  @LJA 14108300
         DC    C'14'                       EFC IN CATALOG          @LJA 14108500
.*                                                                 @LJA 14108600
         DC    X'6361403834'            99 CMP - ERROR PROCESSING  @LOA 14108700
         DC    C'14'                       TAILORED TOKEN/DICT WHEN@LOA 14108800
.*                                         19VT CALLED FROM 201V   @LOA 14108900
         DC    X'6461403C34'           100 CMP - ERROR COMPRESSING @LOA 14109000
         DC    C'14'                       SAMPLING DATA WHEN 19VT @LOA 14109100
.*                                         CALLED FROM 201V        @LOA 14109200
         DC    X'6561404034'           101 CMP - UNEXPECTED ERROR  @LOA 14109300
         DC    C'14'                       FROM 19VT WHEN CALLED   @LOA 14109400
.*                                         FROM 201V               @LOA 14109500
.*                                                                    * 14109600
         DC    X'6661404434'           102 CMP - EXISTING TOKEN    @POA 14109700
         DC    C'14'                       FOUND IN THE EFC CALLED @POA 14109800
.*                                         FROM 201V               @POA 14109900
.*                                                                 @LPA 14110000
         DC    X'6761444840'           103 ANSI V4 - DATACONV      @LPA 14110100
         DC    C'14'                       CLOSE ERROR (INPUT)     @LPA 14110200
.*                                                                 @LPA 14110300
         DC    X'6861444C40'           104 ANSI V4 - DATACONV      @LPA 14110400
         DC    C'14'                       CLOSE ERROR (OUTPUT)    @LPA 14110500
.*                                                                 @LPA 14110600
         DC    X'6921421844'           105   TAPE INSTALL EXIT     @LSA 14110700
         DC    C'10'                         INVALID RETURN CODE   @LSA 14110800
.*                                                                 @LSA 14110900
.*****               106 THROUGH 111 ARE AVAILABLE                 @LSC 14111000
.*                                                                    * 14111100
         DC    X'7000000000'            112 ACB DEB NOT SAME AS DCB@47C 14111200
         DC    C'23'                        DEB FOR SPOOLED D/S    @47C 14111300
         DC    X'7100000400'            113 CLOSE INITIALIZATION   @47A 14111500
         DC    C'23'                        FAILURE                @47A 14112000
         DC    X'7200000800'            114 DEBCHK FAILURE FOR     @47A 14112500
         DC    C'23'                        SPOOLED DCB DEB        @47A 14113000
         DC    X'7300000C00'            115 DEBCHK FAILURE FOR     @47A 14113500
         DC    C'23'                        CHECKPOINT D/S DEB     @47A 14114000
         DC    X'7400001000'            116 CLOSE INITIALIZATION   @47A 14114500
         DC    C'23'                        FAILURE FOR CHKPT D/S  @47A 14115000
         DC    X'7500001400'            117 DCBLOCK, BUSY AND      @47A 14115500
         DC    C'23'                        OPEN FLGS NOT ON       @47A 14116000
         DC    X'7600001800'            118 INVALID ACB            @47A 14116500
         DC    C'23'                                               @47A 14117000
         DC    X'7700001C00'            119 INVALID VTAM ACB       @47A 14117500
         DC    C'23'                                               @47A 14118000
         DC    X'7800002000'            120 DCB/ACB DEB NOT ON     @47A 14118500
         DC    C'23'                        TCB DEB CHAIN          @47A 14119000
         DC    X'79B1400400'            121                             14121000
         DC    C'17'                                                    14121500
         DC    X'7AB1400800'            122                             14122000
         DC    C'17'                                                    14122500
         DC    X'7BB1400C00'            123                             14123000
         DC    C'17'                                                    14123500
         DC    X'7CB1401000'            124                             14124000
         DC    C'17'                                                    14124500
         DC    X'7DB1401400'            125                      YM7854 14125000
         DC    C'17'                                             YM7854 14125500
         DC    X'7EB1401800'            126                      YM7854 14126000
         DC    C'17'                                             YM7854 14126500
         DC    X'7FB1401C00'            127   STOW FAILED WHEN     @PEA 14131800
         DC    C'17'                          CREATING EMPTY DATA  @PEA 14137100
.*                                            MEMBER SINCE PDSE    @PEA 14142400
.*                                            WAS ALREADY DEFINED  @PEA 14147700
.*                                            AS LOAD MODULE LIB   @PEA 14153000
.*                                                                    * 14158300
.*****             128 RESERVED FOR STOW RC=20                     @PEC 14163600
.*                                                                    * 14168900
         DC    X'81B1402400'            129   TRR SUPPLIED--MEMBER @LBA 14174200
         DC    C'17'                          IS NOT A VALID MLT   @LBA 14179500
         DC    X'8200000000'            130   RESERVED FOR STOW    @PEC 14184800
         DC    C'  '                          RC=28                @PEC 14190100
         DC    X'83B1402C00'            131   ERROR OCCURED AS     @LBA 14195400
         DC    C'17'                          RESULT OF JCDM CALL  @LBA 14200700
         DC    X'84B1403000'            132   INCONSISTENT INPUT   @LBA 14206000
         DC    C'17'                          PARM PASSED TO STOW  @LBA 14211300
.*                                                                    * 14216600
.*****               133 THROUGH 233 ARE AVAILABLE                 @LBA 14221900
         DC    X'8500002400'            133   SPOOLED DCB DEB      @47A 14222700
         DC    C'23'                          DOESN'T PT TO USER   @47A 14223500
.*                                            DCB                  @47A 14224300
         DC    X'8600002800'            134   DEBCHK FAILURE FOR   @47A 14225100
         DC    C'23'                          USERS DCB DEB        @47A 14225900
.*                                                                    * 14227200
.*****               135 THROUGH 233 ARE AVAILABLE                 @47C 14230600
         DC    X'EA61460828'            234                      Y02082 14234000
         DC    C'14'                                             Y02082 14234500
.*                                                                    * 14238300
.*****               235 THROUGH 249 ARE AVAILABLE                ***** 14242100
.*                                                                    * 14245900
         DC    X'FA03120400'            250                      YM5395 14250000
         DC    C'03'                                             YM5395 14250500
.*                                                                    * 14250700
         DC    X'FB61401834'            251   ERROR RETURN FROM    @LCA 14250900
         DC    C'14'                          PGM MGT CLOSE EXIT   @LCA 14251100
.*                                            DETECTED BY IGG0201S @LCA 14251300
.*                                                                    * 14251500
         DC    X'FC61401C34'            252   ERROR RETURN FROM    @LCA 14251700
         DC    C'14'                          DESERV CLOSE EXIT    @LCA 14251900
.*                                            DETECTED BY IGG0201S @LCA 14252100
.*                                                                    * 14252300
         DC    X'FD'                    253 - INTERNAL ABEND CODE  @H1A 14252500
         DC    X'6144'                        SYSTEM ABEND 614     @H1A&14252700
                                              IGNORE OK            @H1A 14252900
         DC    X'10'                          RET CODE IN REG. 15  @H1A 14253100
         DC    X'44'                          TRACE CODE-DCB       @H1A&14253300
                                              ... JFCBDSNM         @H1A 14253500
         DC    C'14'                          MESSAGE IEC214I      @H1A 14253700
         DC    X'FE61440C44'            254                      YM1195 14254000
         DC    C'14'                                           @ZA08863 14254500
         DC    X'FF61401434'            255  CALL TO JCDM FAILED   @LBC 14304500
         DC    C'14'                                               @LBC 14354500
         DC    X'00'                    END OF TABLE MARKER             14997000
*                                                                     * 14997500
*        XCTLTABL ID=(NEXTMOD,IFG0209B,LASTLOAD,IFG0202L),       YM1447 14998000
*              BRT=YES,LENGTH=                                   Y02080 14998500
         XCTLTABL ID=(NEXTMOD,IFG0209B,LASTLOAD,IFG0202L),       YM1447X14998900
               BRT=YES,LENGTH=                                   Y02080 14999500
         AGO   .GENDSCT                                                 14999900
.GENTC   ANOP                                                           17000000
         DC    X'7A71760404'            122                             17122000
         DC    C'22'                                                    17122500
         DC    X'7B71760804'            123                             17123000
         DC    C'22'                                                    17123500
         DC    X'7C71760804'            124                             17124000
         DC    C'22'                                                    17124500
         DC    X'7D71760C04'            125                             17125000
         DC    C'22'                                                    17125500
         DC    X'7E71760C04'            126                             17126000
         DC    C'22'                                                    17126500
         DC    X'7F11761004'            127                             17127000
         DC    C'18'                                                    17127500
         DC    X'8011761004'            128                             17128000
         DC    C'18'                                                    17128500
         DC    X'8111761804'            129                             17129000
         DC    C'18'                                                    17129500
         DC    X'8211761C04'            130                             17130000
         DC    C'18'                                                    17130500
         DC    X'8311760404'            131                             17131000
         DC    C'18'                                                    17131500
         DC    X'8431760404'            132                             17132000
         DC    C'20'                                                    17132500
         DC    X'8541760404'            133                             17133000
         DC    C'21'                                                    17133500
         DC    X'8611762004'            134                             17134000
         DC    C'18'                                                    17134500
         DC    X'8711762404'            135                             17135000
         DC    C'18'                                                    17135500
         DC    X'8811762804'            136                             17136000
         DC    C'18'                                                    17136500
         DC    X'8911761404'            137                             17137000
         DC    C'18'                                                    17137500
         DC    X'8A717E1004'            138                             17138000
         DC    C'22'                                                    17138500
         DC    X'8B11760804'            139                             17139000
         DC    C'18'                                                    17139500
         DC    X'8C11762C04'            140                             17140000
         DC    C'18'                                                    17140500
         DC    X'8D1176300C'            141                             17141000
         DC    C'18'                                                    17141500
         DC    X'8E00000034'            142                     SA48558 17142000
         DC    C'25'                                            SA48558 17142500
         DC    X'8F00000434'            143                     SA48558 17143000
         DC    C'25'                                            SA48558 17143500
         DC    X'9000000834'            144                     SA48558 17144000
         DC    C'25'                                            SA48558 17144500
         DC    X'9100000C34'            145                     SA48558 17145000
         DC    C'25'                                            SA48558 17145500
         DC    X'9211724844'            146  TAPE INSTALL EXIT     @LSA 17145900
         DC    C'18'                         INVALID RETURN CODE   @LSA 17146300
.*                                                                    * 17146800
.*****               146 THROUGH 150 ARE AVAILABLE                ***** 17148100
.*                                                                    * 17149400
         DC    X'9700001034'            151                     SA58019 17151000
         DC    C'25'                                            SA58019 17151500
.*                                                                    * 17196000
.*****               152 THROUGH 232 ARE AVAILABLE                ***** 17240500
.*                                                                    * 17285000
         DC    X'E911763428'            233 DCBFDAD 'M' INVALID  Y02082 17329500
         DC    C'18'                        ABEND117-34          Y02082 17374000
         DC    X'EA11763804'            234 ERROR READING BLKID    @L4A 17418500
         DC    C'18'                                                    17463000
         DC    X'EB117E3C28'            235 BLOCKID/DCB MISMATCH   @L4A 17507500
         DC    C'18'                                                    17552000
         DC    X'EC11764004'            236 DCBFDAD 'R' INVALID    @06A 17596500
         DC    C'18'                        ABEND117-40            @06A 17641000
         DC    X'ED117E4428'            237 AL DS EXCEEDS 1 MILLION@25A 17685500
         DC    C'18'                                                    17730000
         DC    X'EE117E4828'            238 XSAM-SUBSYSTEM NOT     @LMA 17738900
         DC    C'18'                         OPERATING             @LMA 17747800
         DC    X'EF117E4C28'            239 XSAM-ERROR DURING      @LMA 17756700
         DC    C'18'                         BUFFER FLUSHING       @LMA 17765600
.*                                                                    * 17774500
.*****               240 THROUGH 254 ARE AVAILABLE                *@LMC 17819000
.*                                                                    * 17863500
         DC    X'FF00000000'            255 AVAILABLE                 * 17908000
         DC    C'  '                                                  * 17952500
         DC    X'00'                    END OF TABLE MARKER             17997000
*                                                                     * 17997500
*        XCTLTABL ID=(NEXTMOD,IFG0239B,LASTLOAD,IFG0232Z),       YM1447 17998000
*              BRT=YES,LENGTH=                                   Y02080 17998500
         XCTLTABL ID=(NEXTMOD,IFG0239B,LASTLOAD,IFG0232Z),       YM1447X17998900
               BRT=YES,LENGTH=                                   Y02080 17999500
         AGO   .GENDSCT                                                 17999900
.GENEOV  ANOP                                                           37000000
         DC    X'0193702800'            1  RACF REJECT         @Z40RSDS 37001000
         DC    C'29'                                           @Z40RSDS 37002000
         DC    X'0293702C00'            2                      @Z40RSDS 37003000
         DC    C'29'                                           @Z40RSDS 37004000
         DC    X'0393703018'            3                      @Z40RSDS 37005000
         DC    C'29'                                           @Z40RSDS 37006000
         DC    X'0493703418'            4                      @Z40RSDS 37007000
         DC    C'29'                                           @Z40RSDS 37008000
         DC    X'0593703800'            5                      @Z40RSDS 37009000
         DC    C'29'                                           @Z40RSDS 37010000
         DC    X'0693703C00'            6                      @Z40RSDS 37011000
         DC    C'29'                                           @Z40RSDS 37012000
         DC    X'0793704000'            7                      @G32DSMI 37013000
         DC    C'29'                                           @G32DSMI 37014000
         DC    X'0893744410'            8                          @10C 37015700
         DC    C'29'                                               @L2A 37017400
         DC    X'0963729044'            9    TAPE INSTALL EXIT     @LSA 37017900
         DC    C'26'                         INVALID RETURN CODE   @LSA 37018400
.*                                                                    * 37019100
.*****                 9 THROUGH 21 ARE AVAILABLE                  @L8C 37020800
.*                                                                    * 37022500
         DC    X'1693704800'            22  PASSWORD ERROR         @L8A 37024200
         DC    C'29'                                               @L8A 37025900
         DC    X'1713743804'            23  ERROR READING BLKID    @39C 37027600
         DC    C'22'                                                    37029300
         DC    X'18237C0C28'            24  BLOCKID/DCB MISMATCH   @39C 37031000
         DC    C'23'                                                    37032700
         DC    X'1913743010'            25  ANSI LABEL STANDARDS   @39C 37034400
         DC    C'22'                        VIOLATION              @L3C 37036100
         DC    X'1A237C1028'            26  AL DS EXCEEDS 1 MILLION@39C 37037800
         DC    C'23'                                                    37039500
         DC    X'1B137C3C0C'            27  ATL ABEND              @39C 37041200
         DC    C'22'                                               @53C 37042900
         DC    X'1C237C2040'            28  LBI REQUIRED BUT NOT   @LQA 37044600
         DC    C'23'                        SPECIFIED              @LQA 37046300
.*                                                                3@LQD 37048000
         DC    X'1D13742810'            29  OPERATOR REJECT LABEL  @39C 37049700
         DC    C'22'                        REWRITE                @L3A 37051400
.*                                                                    * 37053100
.*****                30 THROUGH 32 ARE AVAILABLE                 ***** 37054800
.*                                                                    * 37056500
         DC    X'2113742C10'            33  ANSI INCOMPATIBLE      @39C 37058200
         DC    C'22'                        VERSION CONFLICT       @L3A 37059900
.*                                                                    * 37061600
.*****                34 THROUGH 47 ARE AVAILABLE                 *@31C 37063300
.*                                                                    * 37065000
         DC    X'3011303834'            48                         @39C 37066700
         DC    C'42'                                               @31A 37068400
.*                                                                    * 37070100
.*****                49 THROUGH 53 ARE AVAILABLE                 *@31A 37071800
.*                                                                    * 37073500
         DC    X'3611302030'            54                         @39C 37075200
         DC    C'42'                                               @26A 37076900
         DC    X'371130244C'            55                         @39C 37078600
         DC    C'42'                                               @26A 37080300
         DC    X'3811302808'            56                         @39C 37082000
         DC    C'42'                                               @26A 37083700
         DC    X'3911302C28'            57                         @39C 37085400
         DC    C'42'                                               @26A 37087100
.*                                                                    * 37088800
         DC    X'3A00204028'            58   ANSI V4 - INVALID     @LPA 37088900
         DC    C'36'                         SDC PASSED TO 19TQ    @LPA 37089000
.*                                                                 @LPA 37089100
         DC    X'3B00204128'            59   ANSI V4 - USER KEY    @LPA 37089200
         DC    C'36'                         DOES NOT MATCH TCB KEY@LPA 37089300
.*                                                                 @LPA 37089400
         DC    X'3C00204228'            60   ANSI V4 - USER RECORD @LPA 37089500
         DC    C'36'                         TOO LARGE             @LPA 37089600
.*                                                                 @LPA 37089700
         DC    X'3D00204328'            61   ANSI V4 - DATACONV    @LPA 37089800
         DC    C'36'                         CONVERSION ERROR      @LPA 37089900
.*                                                                 @LPA 37090000
         DC    X'3E00204428'            62   ANSI V4 - DATACONV    @LPA 37090100
         DC    C'36'                         TOKEN IS ZERO         @LPA 37090200
.*                                                                    * 37090300
         DC    X'3F00204528'            63   INVALID CONCAT NUMBER @56A 37090410
         DC    C'36'                         FOUND WHILE PROCESSING@56A 37090420
*                                            NOTE.                 @56A 37090430
.*                                                                    * 37090440
.*****                64 THROUGH 72  ARE AVAILABLE                *@56C 37090450
.*                                                                    * 37090500
         DC    X'480020F144'            72   LBI - Format U WRITE  @LQA 37090600
         DC    C'36'                         not 'S'               @LQA 37090700
         DC    X'490024BC34'            73   CMP - DS not usable   @49A 37090800
         DC    C'36'                         with POINT due to     @49A 37090900
.*                                           invalid control info  @49A 37091000
.*                                           (MMRURBN). User must  @49A 37091200
.*                                           copy ds without POINT.@49A 37091600
.*                                                                    * 37092200
         DC    X'4A23741C34'            74   STRIPED DATA SET NOT  @39C 37093900
         DC    C'23'                         ON ESCON CHANNEL OR   @46C 37095200
.*                                           T0 CONTROL UNIT       @LGA 37096300
.*                                                                    * 37097400
         DC    X'4B0024E434'            75   CMP - BAD RC FROM     @39C 37097500
         DC    C'36'                         IGG019VY              @43C 37097600
.*                                                                    * 37097700
         DC    X'4C0024E834'            76   CMP - BAD RC FROM     @39C 37097800
         DC    C'36'                         COMPRESSION COMPRESS/ @43C 37097900
.*                                           DECOMPRESS            @LJA 37098000
.*                                                                    * 37098100
         DC    X'4D0024EC34'            77   CMP - INVALID CI      @42C 37098200
         DC    C'36'                         DETECTED ON OUTPUT    @43C 37098300
.*                                                                    * 37098400
         DC    X'4E0024F034'            78   CMP - CMP RCD FOUND   @39C 37098500
         DC    C'36'                         BUT INVALID DICT TKN  @43C 37099800
         DC    X'4F0024F434'            79   STR - BAD RETURN CODE @42A 37101100
         DC    C'36'                         FROM RBNCNVT IN       @43C 37101500
.*                                           IGG055V1              @42A 37101900
.*                                                                    * 37102400
         DC    X'500024F834'            80   CMP - AUTODATA AREA   @48A 37102700
         DC    C'36'                         SSCB_AUTO19VX_ADR     @48A 37103000
.*                                           ALREADY IN USE        @48A 37103300
.*                                                                    * 37103600
         DC    X'510024FC34'            81   CMP - AUTODATA AREA   @48A 37103900
         DC    C'36'                         SSCB_AUTO19VX_WQ_ADR  @48A 37104200
.*                                           ALREADY IN USE        @48A 37104500
         DC    X'5200202C28'            82   HFS - POINT TO OTHER  @LLA 37104800
         DC    C'36'                         THAN FIRST BLOCK IN   @LLA 37105100
.*                                           BINARY HFS RECFM=V OR @LLA 37105400
.*                                           U FILE NOT ALLOWED    @LLA 37105700
         DC    X'530024E134'            83   CMP - ERROR WRITING   @LOA 37105800
         DC    C'36'                         TAILORED DICTIONARY   @LOA 37105900
.*                                           IN IGG019VT           @LOA 37106000
         DC    X'540024E234'            84   CMP - ERROR READING   @LOA 37106100
         DC    C'36'                         TAILORED DICTIONARY   @LOA 37106200
.*                                           IN IGG019VT           @LOA 37106300
         DC    X'550024E334'            85   CMP - INVALID TAILORED@LOA 37106400
         DC    C'36'                         TOKEN DETECTED        @LOA 37106500
.*                                           BY IGG019VT           @LOA 37106600
         DC    X'560024E534'            86   CMP - INVALID TAILORED@LOA 37106700
         DC    C'36'                         DICTIONARY DETECTED   @LOA 37106800
.*                                           BY IGG019VT           @LOA 37106900
         DC    X'570024E634'            87   CMP - ERROR VALIDATING@LOA 37107000
         DC    C'36'                         TAILORED DICTIONARY   @LOA 37107100
.*                                           IN IGG019VT           @LOA 37107200
         DC    X'580024E734'            88   CMP - AUTO19VX_WQ IN  @LOA 37107300
         DC    C'36'                         USE WHILE IN IGG019VT @LOA 37107400
         DC    X'590024E934'            89   CMP - IGG019VX RETURND@LOA 37107500
         DC    C'36'                         ERROR IOB TO IGG019VT @LOA 37107600
         DC    X'5A0024EA34'            90   CMP - IGG019VX RETURND@LOA 37107700
         DC    C'36'                         BAD RC TO IGG019VT    @LOA 37107800
         DC    X'5B0024EB34'            91   CMP - EXISTING TOKEN  @POA 37107900
         DC    C'36'                         FOUND IN EFC FOR TLRD @POA 37108000
.*                                                                    * 37108100
.*****                92 THROUGH 107 ARE AVAILABLE                *@LOC 37108200
.*                                                                    * 37108300
         DC    X'6C137C2410'            108                      YM5718 37108400
         DC    C'22'                                             YM5718 37108500
         DC    X'6D937C2414'            109                      YM5718 37109000
         DC    C'29'                                             YM5718 37109500
         DC    X'6E13743C00'            110  IEC510D LOOP FOR EOV  @39C 37110100
         DC    C'22'                                               @28A 37110700
         DC    X'6F73703400'            111                    @Y30LSFY 37111500
         DC    C'27'                                           @Y30LSFY 37113500
         DC    X'7073703800'            112                    @Y30LSFY 37115500
         DC    C'27'                                           @Y30LSFY 37117500
         DC    X'7173743C14'            113                    @G60ASRB 37118000
         DC    C'27'                                           @G60ASRB 37118500
         DC    X'7273744004'            114                        @54A 37118600
         DC    C'27'                                               @54A 37118700
.*                                                                    * 37118800
.*****               115 THROUGH 116 ARE AVAILABLE                *@54C 37119100
.*                                                                    * 37119400
         DC    X'7583741008'            117 INCOMPATIBLE DEVICE    @H2A 37119700
         DC    C'28'                                       TYPE    @H2A 37120000
.*                                                                    * 37120300
         DC    X'7683741408'            118 INCONSISTENT VOLUME    @H2A 37120600
         DC    C'28'                             RECORDING MODE    @H2A 37120900
.*                                                                    * 37121200
         DC    X'7703100800'            119                      YM5395 37121500
         DC    C'11'                                             YM5395 37121800
.*                                                                    * 37122100
         DC    X'780020C080'            120  INVALID ATTEMPT TO    @LCA 37122400
         DC    C'36'                         READ PDSE LOAD MODULE @LCA 37122700
.*                                           MEMBER                @LCA 37123000
.*                                                                    * 37123300
         DC    X'7900000000'            121  AVAILABLE             @PEC 37123600
         DC    C'00'                                               @PEC 37123900
.*                                                                 @PEC 37124200
.*                                                                    * 37124500
         DC    X'7A0020C880'            122  ERROR RETURN CODE FROM@LCA 37124800
         DC    C'36'                         IEWLCNVT WHILE READING@LCA 37125100
.*                                           PDSE DIRECTORY        @LCA 37125400
.*                                                                    * 37125700
         DC    X'7B0020D080'            123  SAM DOES NOT SUPPORT  @LCA 37126000
         DC    C'36'                         ACCESS TO LINEAR LOAD @LCA 37126300
.*                                           MODULES.              @LCA 37126600
.*                                                                    * 37126900
         DC    X'7C0020CC80'            124  USER TRIED TO CREATE  @PEA 37127200
         DC    C'36'                         DATA MEMBER IN PDSE   @PEA 37127500
.*                                           WITH LOAD MODUELS     @PEA 37127800
         DC    X'7D63747C0C'            125  AUTOMATED TAPE LIBR.  @39C 37128100
         DC    C'26'                                               @PGA 37128400
         DC    X'7E6374740C'            126  AUTOMATED TAPE LIBR.  @39C 37128700
         DC    C'26'                                               @PGA 37129000
         DC    X'7F6374800C'            127  AUTOMATED TAPE LIBR.  @39C 37129300
         DC    C'26'                                               @PJA 37129600
.*                                                                    * 37129900
         DC    X'800020D880'            128  STRIPE - BAD RC FROM  @LGA 37130200
         DC    C'36'                         MMINIT                @LGA 37130500
.*                                                                    * 37130800
         DC    X'810020DC80'            129  STRIPE - BAD RC FROM  @LGA 37131100
         DC    C'36'                         MMCALL                @LGA 37131400
.*                                                                    * 37131700
         DC    X'820020E080'            130  STRIPE - POINT ISSUED @LGA 37132000
         DC    C'36'                         W/ OUTSTANDING CHECKS @LGA 37132300
.*                                                                    * 37132600
         DC    X'836374840C'            131  AUTOMATED TAPE LIBR.  @39C 37132900
         DC    C'26'                                               @32A 37133200
.*                                                                    * 37133500
         DC    X'846374880C'            132  AUTOMATED TAPE LIBR.  @39C 37133800
         DC    C'26'                                               @32A 37134100
.*                                                                    * 37134400
         DC    X'8563748C0C'            133  AUTOMATED TAPE LIBR.  @39C 37134500
         DC    C'26'                                               @36A 37134600
         DC    X'866374900C'            134  SMCT SUPPORT          @41A 37134700
         DC    C'26'                                               @41A 37134800
         DC    X'876374940C'            135  SMCT SUPPORT          @41A 37134900
         DC    C'26'                                               @41A 37135000
         DC    X'886374980C'            136  SMCT SUPPORT          @45A 37135100
         DC    C'26'                                               @45A 37135200
         DC    X'8963749C0C'            137  SMCT SUPPORT          @51A 37135300
         DC    C'26'                                               @51A 37135400
         DC    X'8A6374A00C'            138  SMCT SUPPORT          @51A 37135500
         DC    C'26'                                               @51A 37135600
         DC    X'8B0020D428'            139  DCBBLKSI OR DCBLRECL  @18A 37135700
         DC    C'36'                         IS ZERO FOR PDSE WITH @18A 37135800
.*                                           RECFM = FB, VB, OR U  @18A 37135900
.*                                           WHEN INPUT OR UPDATE  @18A 37136200
         DC    X'8C0020AC80'            140  BAD BUFFER FORMAT     @LBA 37136500
         DC    C'36'                         FOR PDSE MEMBER       @LBA 37136800
         DC    X'8D13740404'            141                             37141000
         DC    C'22'                                                    37141500
         DC    X'8EB3740408'            142                             37142000
         DC    C'30'                                                    37142500
         DC    X'8F0020B000'            143  FB SPECIFIED FOR AN   @LBC 37142700
         DC    C'36'                         PDSE BUT BLKSIZE NOT  @LBC 37142900
.*                                           A MULTIPLE OF LRECL   @LBA 37143100
.*                                           OR 'F' AND LRECL NOT  @LBA 37143300
.*                                           EQUAL TO BLKSIZE      @LBA 37143500
         DC    X'9063740404'            144                             37144000
         DC    C'26'                                                    37144500
         DC    X'910020B400'            145  ERROR RETURN FROM JCDM@LBC 37145000
         DC    C'36'                         CREATE CONTEXT        @LBC 37145500
         DC    X'9213740804'            146                             37146000
         DC    C'22'                                                    37146500
         DC    X'9313740C04'            147                             37147000
         DC    C'22'                                                    37147500
         DC    X'94237C043C'            148                             37148000
         DC    C'23'                                                    37148500
         DC    X'9563740804'            149                             37149000
         DC    C'26'                                                    37149500
         DC    X'9613741004'            150                             37150000
         DC    C'22'                                                    37150500
         DC    X'9763741404'            151                             37151000
         DC    C'26'                                                    37151500
         DC    X'9863741804'            152                             37152000
         DC    C'26'                                                    37152500
         DC    X'9963741C04'            153                             37153000
         DC    C'26'                                                    37153500
         DC    X'9A63742004'            154  CONCAT W 'RDBACK' NOT @08A 37154000
         DC    C'26'                         VALID IEC026I 637-20  @08A 37154500
         DC    X'9B63742404'            155                             37155000
         DC    C'26'                                                    37155500
         DC    X'9CB3740408'            156                             37156000
         DC    C'30'                                                    37156500
         DC    X'9D0020B800'            157  SETLOCK ERROR         @PDC 37157000
         DC    C'36'                                               @PDC 37157500
         DC    X'9E63742C08'            158                             37158000
         DC    C'26'                                                    37158500
         DC    X'9F6374500C'            159  AUTOMATED TAPE LIBR.  @39C 37159000
         DC    C'26'                                               @LEC 37159500
         DC    X'A063743404'            160                             37160000
         DC    C'26'                                                    37160500
         DC    X'A163743804'            161                             37161000
         DC    C'26'                                                    37161500
         DC    X'A263743C04'            162                             37162000
         DC    C'26'                                                    37162500
         DC    X'A363744004'            163                             37163000
         DC    C'26'                                                    37163500
         DC    X'A413741404'            164                             37164000
         DC    C'22'                                                    37164500
         DC    X'A523740814'            165                             37165000
         DC    C'23'                                                    37165500
         DC    X'A66374540C'            166 AUTOMATED TAPE LIBR.   @39C 37166000
         DC    C'26'                                               @LEC 37166500
         DC    X'A76374580C'            167 AUTOMATED TAPE LIBR.   @39C 37167000
         DC    C'26'                                               @LEC 37167500
         DC    X'A8B3700408'            168                             37168000
         DC    C'30'                                                    37168500
         DC    X'A963745C0C'            169 AUTOMATED TAPE LIBR.   @39C 37169000
         DC    C'26'                                               @LEC 37169500
         DC    X'AA6374600C'            170 AUTOMATED TAPE LIBR.   @39C 37170000
         DC    C'26'                                               @LEC 37170500
         DC    X'AB73700C04'            171                             37171000
         DC    C'27'                                                    37171500
         DC    X'AC6374640C'            172 AUTOMATED TAPE LIBR.   @39C 37172000
         DC    C'26'                                               @LEC 37172500
         DC    X'AD6374680C'            173 AUTOMATED TAPE LIBR.   @39C 37173000
         DC    C'26'                                               @LEC 37173500
         DC    X'AE33700428'            174                             37174000
         DC    C'24'                                                    37174500
         DC    X'AF73701404'            175                             37175000
         DC    C'27'                                                    37175500
         DC    X'B063740C28'            176                             37176000
         DC    C'26'                                                    37176500
         DC    X'B1B3740800'            177                      M0179  37177000
         DC    C'30'                                             M0179  37177500
         DC    X'B273741C04'            178                             37178000
         DC    C'27'                                                    37178500
         DC    X'B363746C0C'            179 AUTOMATED TAPE LIBR.   @39C 37179000
         DC    C'26'                                               @LEC 37179500
         DC    X'B413741C10'            180                             37180000
         DC    C'22'                                                    37180500
         DC    X'B56374700C'            181  AUTOMATED TAPE LIBR.  @39C 37181000
         DC    C'26'                                               @LEC 37181500
         DC    X'B643710828'            182                     ZA01291 37182000
         DC    C'25'                                             A48604 37182500
         DC    X'B7E3740800'            183                      A47372 37183000
         DC    C'32'                                             A47372 37183500
         DC    X'B8E3740400'            184                             37184000
         DC    C'32'                                                    37184500
         DC    X'B9B3740408'            185                             37185000
         DC    C'30'                                                    37185500
         DC    X'BAD374041C'            186                             37186000
         DC    C'31'                                                    37186500
         DC    X'BB73741004'            187                             37187000
         DC    C'27'                                                    37187500
         DC    X'BC23741434'            188  POSIX - ANY EOV  TO A @39C 37187800
         DC    C'23'                         POSIX FILE (I.E.      @LFA 37188100
.*                                           PATH= WAS SPECIFIED). @LFA 37188400
         DC    X'BD73740804'            189                             37189000
         DC    C'27'                                                    37189500
         DC    X'BE73740404'            190                             37190000
         DC    C'27'                                                    37190500
         DC    X'BF13741804'            191                             37191000
         DC    C'22'                                                    37191500
         DC    X'C063744404'            192                             37192000
         DC    C'26'                                                    37192500
         DC    X'C123741834'            193  POSIX - ANY EOV  TO A @39C 37193000
         DC    C'23'                         PDSE/X                @LFA 37193500
         DC    X'C263741010'            194                             37194000
         DC    C'26'                                                    37194500
         DC    X'C313742010'            195                             37195000
         DC    C'22'                                                    37195500
         DC    X'C463744C04'            196                             37196000
         DC    C'26'                                                    37196500
         DC    X'C583740800'            197                             37197000
         DC    C'28'                                                    37197500
         DC    X'C6A3710444'            198                     ZA01291 37198000
         DC    C'15'                                            SA52379 37198500
         DC    X'C743700C28'            199                      YM2133 37199000
         DC    C'25'                                             YM2133 37199500
         DC    X'C800500400'            200                     YL03127 37200000
         DC    C'41'                                            YL03127 37200500
         DC    X'C900500800'            201                     YL03127 37201000
         DC    C'41'                                            YL03127 37201500
         DC    X'CA00200C80'            202                      Y02144 37202000
         DC    C'36'                                             Y02144 37202500
         DC    X'CB00201080'            203                      Y02144 37203000
         DC    C'36'                                             Y02144 37203500
         DC    X'CC00201480'            204                      Y02144 37204000
         DC    C'36'                                             Y02144 37204500
         DC    X'CD00201C80'            205                      Y02144 37205000
         DC    C'36'                                             Y02144 37205500
         DC    X'CE00202080'            206                      Y02144 37206000
         DC    C'36'                                             Y02144 37206500
         DC    X'CF00202480'            207                      Y02144 37207000
         DC    C'36'                                             Y02144 37207500
         DC    X'D0E3740C4C'            208                        @L1A 37208000
         DC    C'32'                                               @L1A 37208500
         DC    X'D100800480'            209                      Y02144 37209000
         DC    C'37'                                             Y02144 37209500
         DC    X'D200800880'            210                      Y02144 37210000
         DC    C'37'                                             Y02144 37210500
         DC    X'D300202834'            211                        @12A 37211000
         DC    C'36'                                               @12A 37211500
         DC    X'D40020A880'            212 PDSE MEMBER IS FULL    @LBA 37212000
         DC    C'36'                                               @LBA 37212500
         DC    X'D500201880'            213                      Y02144 37213000
         DC    C'36'                                             Y02144 37213500
         DC    X'D66370780C'            214  AUTOMATED TAPE LIBR.  @39C 37213800
         DC    C'26'                                               @PGC 37214100
         DC    X'D70020A080'            215                        @LBA 37214400
         DC    C'36'                                               @LBA 37214700
.*  002-A0 WAS ISSUED FOR ONE OF 3 REASONS:                        @LBA 37215000
.*    - WRITE OR PUT WAS ISSUED WHILE POSITIONED TO AN PDSE DIR.   @LBA 37215300
.*    - DCBBLKSI IS INCORRECT FOR READING AN PDSE DIRECTORY        @LBA 37215600
.*    - DCBRECFM IS INCORRECT FOR READING AN PDSE DIRECTORY        @LBA 37215900
         DC    X'D80020A480'            216  UNEXPECTED RETURN CODE@LBA 37216200
         DC    C'36'                         FROM JCDM WHILE       @LBA 37216500
.*                                           READING DIRECTORY     @LBA 37216800
.*                                           ENTRY RECORDS         @LBA 37217100
         DC    X'D900209C80'            217  INVALID ATTEMPT TO    @LBA 37217400
         DC    C'36'                         UPDATE - READS QUEUED @LBA 37217700
         DC    X'DA73702438'            218                     SA58102 37218000
         DC    C'27'                                            SA58102 37218500
         DC    X'DBA3710828'            219                     ZA01291 37219000
         DC    C'15'                                            SA59307 37219500
         DC    X'DC00205080'            220  SACB IS CURRENTLY IN  @LBA 37220000
         DC    C'36'                         USE                   @LBA 37220500
         DC    X'DD00205480'            221  BAD RETURN CODE FROM  @LBA 37221000
         DC    C'36'                         DEBCHK                @LBA 37221500
         DC    X'DE00205880'            222  INVALID SACB DETECTED @LBA 37222000
         DC    C'36'                                               @LBA 37222500
         DC    X'DF00205C80'            223  INVALID FRQ DETECTED  @LBA 37223000
         DC    C'36'                                               @LBA 37223500
         DC    X'E000206080'            224  NON-ZERO KEYLEN SPEC  @LBA 37224000
         DC    C'36'                         FOR PDSE MEMBER       @LBA 37224500
         DC    X'E100206480'            225  NCP HAS BEEN EXCEEDED @LBA 37225000
         DC    C'36'                                               @LBA 37225500
         DC    X'E200206880'            226  INVALID BLKSIZE SPEC  @LBA 37226000
         DC    C'36'                                               @LBA 37226500
         DC    X'E300206C80'            227  BAD RETURN CODE FROM  @LBA 37227000
         DC    C'36'                         MEMBER CREATE         @LBA 37227500
         DC    X'E400207080'            228  PACB LOCATE ERROR     @LBA 37228000
         DC    C'36'                                               @LBA 37228500
         DC    X'E500207480'            229  INVALID PACB DETECTED @LBA 37229000
         DC    C'36'                                               @LBA 37229500
         DC    X'E6C374041C'            230                      YM5718 37230000
         DC    C'33'                                             Y02072 37230500
         DC    X'E7C374081C'            231                      YM5718 37231000
         DC    C'33'                                             Y02072 37231500
         DC    X'E873742C28'            232                      YM5718 37232000
         DC    C'27'                                             Y02082 37232500
         DC    X'E900207C80'            233  SACB_MEM_CT NOT FOUND @LBA 37233000
         DC    C'36'                         IN PACB               @LBA 37233500
         DC    X'EA00208080'            234  JCDM SAVE ERROR IN    @LBA 37234000
         DC    C'36'                         POINT                 @LBA 37234500
         DC    X'EB00208480'            235  JCDM RECONNECT FOR    @LBA 37235000
         DC    C'36'                         HOLD ERROR IN POINT   @LBA 37235500
         DC    X'EC00208880'            236  JCDM RECONNECT FOR    @LBA 37236000
         DC    C'36'                         I/O  ERROR IN POINT   @LBA 37236500
         DC    X'ED00208C80'            237  JCDM DISCONNECT ERROR @LBA 37237000
         DC    C'36'                         IN POINT              @LBA 37237500
         DC    X'EE00209080'            238  JCDM CONNECT ERROR    @LBA 37238000
         DC    C'36'                         IN POINT              @LBA 37238500
         DC    X'EF00207880'            239  PRIVILEGED CALL ERROR @LBA 37239000
         DC    C'36'                                               @LBA 37239500
         DC    X'F093701008'            240                      Y02083 37240000
         DC    C'29'                                             Y02083 37240500
         DC    X'F193701408'            241                      Y02083 37241000
         DC    C'29'                                             Y02083 37241500
         DC    X'F293701808'            242                      Y02083 37242000
         DC    C'29'                                             Y02083 37242500
         DC    X'F300209480'            243  MAX NO OF MEMBERS     @LBA 37243000
         DC    C'36'                         CREATED ( AT WRITE)   @LBA 37243500
         DC    X'F400209880'            244  TRUNCATE FILE ERROR   @LBA 37244000
         DC    C'36'                                               @LBA 37244500
         DC    X'F593741C1C'            245                      YM5718 37245000
         DC    C'29'                                             Y02082 37245500
         DC    X'F600203028'            246                        @11C 37246000
         DC    C'36'                                               @11C 37246500
         DC    X'F7B3740C08'            247                      YM5718 37247000
         DC    C'30'                                             YM1238 37247500
         DC    X'F883740C08'            248                      YM5718 37248000
         DC    C'28'                                             YM1238 37248500
         DC    X'F993742010'            249  NO VOL/FILE ACC WHEN  @L3C 37249100
         DC    C'29'                         USED FOR ANSI TAPES   @L3C 37249700
         DC    X'FA7378284C'            250                    @G18MSBS 37250300
         DC    C'27'                                           @G18MSBS 37251100
         DC    X'FB00203844'            251                        @11C 37251400
         DC    C'36'                                               @11C 37251700
         DC    X'FC33700828'            252                      YM3108 37252000
         DC    C'24'                                             YM3108 37252500
         DC    X'FD00200480'            253                      YM1433 37253000
         DC    C'36'                                             YM1433 37253500
         DC    X'FE00200880'            254                      YM1433 37254000
         DC    C'36'                                             YM1433 37254500
         DC    X'FF83740408'            255  DENSITY CONFLICT ON   @07A 37304500
         DC    C'28'                         CONCATENATED TAPE DEV @07A 37354500
         DC    X'00'                    END OF TABLE MARKER             37997000
*                                                                     * 37997400
*****    XCTLTABL ID=(NEXTMOD,IFG0559B,LASTLOAD,IFG0552X),       YM1447 37997800
*****          BRT=YES,LENGTH=                                   Y02080 37998200
         XCTLTABL ID=(NEXTMOD,IFG0559B,LASTLOAD,IFG0552X),       YM1447X37998900
               BRT=YES,LENGTH=                                   Y02080 37999500
.GENDSCT ANOP                                                           40000000
         EJECT                                                          40050000
TABLE    DSECT                                                          40100000
CODE     DS    CL1                                                      40150000
ABCODE   DS    CL2                                                      40200000
RETCODE  DS    CL1                                                      40250000
TRCCODE  DS    CL1                                                      40300000
MSGID    DS    CL2                                                      40350000
TABLLEN  EQU   *-TABLE                  LNG OF CODE TABLE ENTRY  YM3111 40350400
*****    IECPDSCT                                                       40400200
         IECPDSCT                                                       40450000
*****    IECDSECS CVT,MAIN,WTG,PREFX,RRPL,EXPAND=YES             Y02080 40500000
         IECDSECS CVT,MAIN,WTG,PREFX,RRPL,EXPAND=YES             Y02080 40550000
         MEND                                                           40600000
