*                                                                       00016600
*        %GOTO SMCAL1;            /* Bilingual Mapping Macro            00033200
         MACRO                                                          00049800
         IEESMCA                                                        00096900
*                                                                       00144000
.*/      %SMCAL1: ;                                               /* */ 00146600
*/**** START OF SPECIFICATIONS ***************************************/ 00149200
*/*                                                                  */ 00152000
*/*    MACRO NAME = IEESMCA                                      @P6C*/ 00162000
*/*                                                                  */ 00172000
*/*     ACRONYM = SMCA                                               */ 00180000
*/*                                                                  */ 00188000
*/*    DESCRIPTIVE NAME = SMF CONTROL TABLE                          */ 00196900
*/*                                                                  */ 00205800
*/*    PROPRIETARY STATEMENT =                                       */ 00206100
*/*     LICENSED MATERIALS - PROPERTY OF IBM                         */ 00206400
*/*     THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                 */ 00206700
*/*     5645-001 (C) COPYRIGHT IBM CORP. 1979, 1997                  */ 00207100
*/*                                                                  */ 00207600
*/*    STATUS = HBB6603                                          @P6C*/ 00207900
*/*                                                                  */ 00208200
*/*    FUNCTION = Communications area used to hold data needed       */ 00208500
*/*               by SMF or other MVS components                     */ 00208800
*/*                                                                  */ 00208900
*/*    EXTERNAL CLASSIFICATION:                                  @P3A*/ 00209000
*/*    DMTI: BASE                                                @P3A*/ 00209100
*/*    GUPI: FIELDS                                              @P6C*/ 00209200
*/*          SMCASID                                             @P6A*/ 00209500
*/*          SMCAITME                                            @P6A*/ 00209700
*/*          SMCAIDTE                                            @P6A*/ 00209800
*/*    END OF EXTERNAL CLASSIFICATION:                           @P3A*/ 00209900
*/*                                                                  */ 00210000
*/*    NOTES =                                                       */ 00210100
*/*                                                                  */ 00210200
*/*        Bilingual Mapping Macro (PL/AS and BAL)                   */ 00210300
*/*                                                                  */ 00210400
*/*      DEPENDENCIES =                                              */ 00210600
*/*                                                                  */ 00210900
*/*        PL/AS Version =                                           */ 00211200
*/*         %INCLUDE SYSLIB(CVT) TO DEFINE CVTSMCA                   */ 00211500
*/*                                                                  */ 00211800
*/*        BAL Version =                                             */ 00212100
*/*         A DSECT IS PRODUCED AND A USING ON SMCABASE GIVES        */ 00212400
*/*         ADDRESSABILITY FOR ALL SYMBOLS.                          */ 00212700
*/*                                                                  */ 00213000
*/*      RESTRICTIONS =                                              */ 00213300
*/*                                                                  */ 00213600
*/*        PL/AS Version = None                                      */ 00213900
*/*                                                                  */ 00214200
*/*        BAL Version = None                                        */ 00214500
*/*                                                                  */ 00214800
*/**** INVOCATION ****************************************************/ 00215100
*/*                                                                  */ 00215400
*/*    METHOD OF ACCESS =                                            */ 00215700
*/*                                                                  */ 00216000
*/*      PL/AS Invocation =                                          */ 00216300
*/*                                                                  */ 00216600
*/*  %INCLUDE SYSLIB(IEESMCA)                                        */ 00216900
*/*                                                                  */ 00217200
*/*    PARAMETER DESCRIPTION =  None                                 */ 00217500
*/*                                                                  */ 00217800
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 00218100
*/*                                                                  */ 00218400
*/*------------------------------------------------------------------*/ 00218700
*/*                                                                  */ 00219000
*/*      BAL Invocation =                                            */ 00219300
*/*                                                                  */ 00219600
*/*      name            name: symbol. Begin name in column 1.       */ 00219900
*/*  b                   one or more blanks (up to nine)             */ 00220200
*/*  IEESMCA             should start in column 10                   */ 00220500
*/*  b                   one or more blanks                          */ 00220800
*/*                                                                  */ 00221100
*/*    PARAMETER DESCRIPTION =  None                                 */ 00221400
*/*                                                                  */ 00221700
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 00222000
*/*                                                                  */ 00222300
*/********************************************************************/ 00222600
*/*                                                                  */ 00222900
*/*    DSECT NAME = SMCABASE                                         */ 00223200
*/*                                                                  */ 00223500
*/*    COMPONENT = System Management Facilities (SC100)          @P4C*/ 00223800
*/*                                                                  */ 00224100
*/*    EYE-CATCHER = "SMCA"                                          */ 00224400
*/*     OFFSET = 4 ('4' in hex)                                      */ 00224700
*/*     LENGTH = 4 bytes                                             */ 00225000
*/*                                                                  */ 00225300
*/*    CREATED BY = IFASTART                                         */ 00225600
*/*                                                                  */ 00225900
*/*    POINTED TO BY = CVTSMCA                                       */ 00226200
*/*                                                                  */ 00226500
*/*    DELETED BY = N/A                                              */ 00226800
*/*                                                                  */ 00227100
*/*    SERIALIZATION = None                                          */ 00227400
*/*                                                                  */ 00227700
*/*    STORAGE ATTRIBUTES =                                          */ 00228000
*/*                                                                  */ 00228300
*/*      ALLOCATION METHOD = GETMAIN                                 */ 00228600
*/*      SUBPOOL           = 245                                     */ 00228900
*/*      KEY               = 0                                       */ 00229200
*/*      RESIDENCY         = Below                                   */ 00229500
*/*      SIZE              = 404 bytes ('194' in hex)                */ 00229800
*/*      FREQUENCY         = 1 per MVS system                        */ 00230100
*/*                                                                  */ 00230400
*/*    DISTRIBUTION LIBRARY = AMACLIB                                */ 00230700
*/*                                                                  */ 00231000
*/**** END OF SPECIFICATIONS *****************************************/ 00231300
*/*                                                                  */ 00231600
*/*  CHANGE ACTIVITY = ZA53006, ZA58293, @L1A, ZA84325, @Q4A,        */ 00231900
*/*                    @DH,     @DI,     @DJ,  @P1,     @DN          */ 00232200
*/*                    @02,     @0S,     @LP,  @LR                   */ 00232500
*/*                                                                  */ 00232800
*/*    $MAC(IEESMCA),COMP(SC100)                                     */ 00233100
*/*                                                                  */ 00233400
*/*  138000,210000,798000,936000                                20011*/ 00233700
*/*  144000-150000,552000-606000,630000-654000,696000-714000,   M0435*/ 00234000
*/*  732000,858000-876000                                       M0435*/ 00234300
*/*  (C) SMCAJWT - RE-DEFINE FIELD CONTENTS                  @ZA18120*/ 00234600
*/*                                                          @ZM50077*/ 00234900
*/*  (C) SMCASUBP- ADD LEADING ASTERISK                      @ZA52499*/ 00235200
*/*  A - BITS FOR SRB SCHEDULED AND SRB RUNNING              @ZA53006*/ 00235500
*/*  A - PTR TO FIRST SSB ON SMF LOCK QUEUE                  @ZA58293*/ 00235800
*/*  A - CREATED A NEW FIELD (SMCADSPO) IN THE COMMUNICATIONS@ZA84325*/ 00236100
*/*      SECTION TO INDICATE THAT A DISPLAY OPTIONS (D SMF,O)@ZA84325*/ 00236400
*/*      IS IN EFFECT.                                       @ZA84325*/ 00236700
*/*  C - DEV APAR OY19862 INCLUDED IN JBB3313                @YA19862*/ 00237000
*/*  A - PROLOG ENHANCEMENT                                      @LPA*/ 00237300
*/*  A - ADD NEW FIELD (SMCASMCX), POINTER TO NEW SMCX CONTROL   @LPA*/ 00237600
*/*      BLOCK, FOR SMF INTERVAL SYNC SUPPORT                    @LPA*/ 00237900
*/*  A - ADD NEW FIELD (SMCAJAC1), TO POINT TO NEW IFAJAC01 RTN  @LRA*/ 00240700
*/*  A - ADD POINTER TO DEFERRED SCHEDULING ROUTINE IN IEEMB839  @LTA*/ 00243500
*/*  C - Changed SMCAMNBF and SMCAMXBF to RESERVED fields        @P2A*/ 00244900
*/*  D - Remove ECBs related to failures in U83/84/85 exits      @LVA*/ 00245200
*/*  D - Remove AMODE bits related to U83/84/85 exits            @LVA*/ 00245500
*/*  A - Add SID 'Source' Bits                                   @LWA*/ 00245800
*/*  A - Add Data Set Name Migration Indicator bit               @LXA*/ 00246100
*/*  A - Add CDPI information to prolog                          @P3A*/ 00246200
*/*  D - Remove unused field names                               @P3A*/ 00246300
*/*  A - Define new fields for Usage Data Collection Service     @01A*/ 00248500
*/*  A - Define new fields for Usage Data Reporting              @03A*/ 00250700
*/*  C - Component name before id                                @P4A*/ 00251800
*/*  C - Change SMCAIDTE comment to format 0CYYDDDF              @P5A*/ 00252100
*/*  C - Define SMCA fields as GUPI                              @P6A*/ 00252400
*/*  A - Add SMCAT892                                            @MXA*/ 00252600
*/*  C - Define SMCAFLGS as abnormal to ensure serialization.    @04A*/ 00252700
*/*  C - Define new fields for SMF initialization serialization. @05A*/ 00252800
*/*                                                                  */ 00252900
*/*  $L1=RAPRAS  ,JBB2110,820604,PD27: RESTARTABLE SMF           @L1A*/ 00255100
*/*  $Q4=PAE0249 ,JBB2133,840320,PDFS: ADD DSET INIT COMPLETE BIT@Q4A*/ 00263800
*/*  $DH=DCR22   ,JBB3313,881104,PDBR: BUFFER AND I/O CHANGES    @DHA*/ 00272500
*/*  $DI=DCR26   ,JBB3313,881216,PDBR: DATA LOST CHANGES         @DIA*/ 00281200
*/*  $DJ=DCR30   ,JBB3313,881216,PDJB: SMFEWTM CROSS MEMORY      @DJA*/ 00289900
*/*  $P1=PGP0464 ,JBB3313,890616,PDBR: SMCABQXX BDY ERRORS       @P1A*/ 00298600
*/*  $02=OY25606 ,JBB3313,890915,PDLO: DD CONSOLIDATION          @02A*/ 00307300
*/*  $DN=DCR0085 ,HBB4420,900224,PDBR: APPC TRANS ACCTING SUPPORT@DNA*/ 00316000
*/*  $0S=OY40499 ,HBB4420,910305,PDDH: NEW DUMP OPTION TO SUPPRESS   */ 00324700
*/*                                    RETRY AFTER ABEND         @0SA*/ 00333400
*/*  $LP=SYNCS   ,HBB4430,910814,PDDH: SMF INTERVAL SYNC SUPPORT @LPA*/ 00342100
*/*  $LR=APPCS   ,HBB4430,911209,PDMF: APPC CONVERSATION ACCOUNTING  */ 00344300
*/*                                                              @LRA*/ 00346500
*/*  $LT=SYNCS   ,HBB4430,911209,PDBR: DEFER INTERVAL SCHED      @LTA*/ 00348700
*/*  $P2=PKB3617 ,HBB4430,920805,PDDH: 10X: Obsolete Option          */ 00349400
*/*                                    Processing                @P2A*/ 00350100
*/*  $LV=PE2STSMF,HBB5510,921217,PDXB: Dynamic exits support     @LVA*/ 00350300
*/*  $LV=SMFSID  ,HBB5510,930304,PDBR: SID Option Enhancements   @LWA*/ 00350500
*/*  $LX=SMFDSN  ,HBB5510,930415,PDSL: DSNAME Option Enhancement @LXA*/ 00350700
*/*  $P3=PIG2206 ,HBB5510,930720,PDDH: CDPI: SHOWHDR Cleanup     @P3A*/ 00350800
*/*  $01=OW02855 ,JBB3313,931115,PDBR: Usage Data Collection     @01A*/ 00350900
*/*  $03=OW02855 ,JBB3313,940110,PDBR: Usage Data Collection - 2 @03A*/ 00351000
*/*  $P4=PN71767 ,HBB5520,941020,PDDH: CDPI: SHOWHDR Cleanup     @P4A*/ 00351100
*/*  $P5=PQC0051 ,HBB6603,950601,PDDH: SMCAIDTE comment wrong    @P5A*/ 00351200
*/*  $P6=PQC0186 ,HBB6603,950601,PDDH: CDPI: GUPI fields         @P6A*/ 00351300
*/*  $MX=PRDEDSMF,HBB6601,950601,PDXB: Product enable/disable    @MXA*/ 00351700
*/*  $04=OW25609 ,HBB4430,970430,PDHB: Serialize SMCAFLGS bits.  @04A*/ 00351900
*/*  $05=OW33380 ,HBB6603,980724,PDDH: ABEND052 on SMF Restart   @05A*/ 00352000
*/*                                                                  */ 00352100
*/********************************************************************/ 00352500
*/*                                                                  */ 00352900
*        %GOTO SMCAL2;                                            /* *  00353300
*                                                                       00353700
*   BAL mapping definitions...                                          00354200
*                                                                       00356600
         SPACE 1                                                        00359000
SMCABASE DSECT                                                          00359900
         SPACE 1                                                        00360800
         IEZBITS , -          SYMBOLIC BIT DEFINITIONS                  00361700
         SPACE 1                                                        00362600
SMCAOPT  DS    B -            SMFDEFLT OPTIONS SELECTED AT              00363500
*                             INITIALIZATION TIME.  THE OPTIONS APPLY   00364400
*                             TO BACKGROUND PROCESSING.  SMCAFOPT       00365300
*                             (OFFSET 82) CONTAINS THE FOREGROUND       00366200
*                             OPTIONS.                                  00367100
SMCAOPT1 EQU   BIT0 -         RESERVED                                  00368000
SMCAOPT2 EQU   BIT1 -         RESERVED                                  00368900
SMCAEXT  EQU   BIT2 -         RESERVED                                  00369800
SMCADSA  EQU   BIT3 -         DATA SET ACCOUNTING                       00370700
SMCAVOL  EQU   BIT4 -         VOLUME ACCOUNTING                         00371600
SMCAUDCS EQU   BIT5           Usage Data Collection Services       @01A 00372000
SMCARS01 EQU   BIT5,,C'X' -   RESERVED                                  00372500
SMCATDS  EQU   BIT6 -         TYPE 17 RECORDS MAINTAINED FOR TEMPORARY  00373400
*                             DATA SETS (REC(PERM) OR REC(CALL))        00374300
SMCAFGND EQU   BIT7 -         SMF FOREGROUND OPTIONS BIT.  IF 0, ABOVE  00375200
*                             BITS DESCRIBE BACKGROUND OPTIONS.  IF 1,  00376100
*                             ABOVE BITS DESCRIBE FOREGROUND OPTIONS.   00377000
*                                                                 20011 00377900
SMCAMISC DS    B -            MISCELLANEOUS INDICATORS                  00378800
SMCAUSER EQU   BIT0 -         SMF RECORDING REQUESTED                   00379700
SMCAMAN  EQU   BIT1 -         SYS1.MAN DATA SET IS/IS NOT PRESENT.      00380600
*                             BITS 0 AND 1 MEAN:                        00381500
*                             00 = NO SMF RECORDING REQUESTED           00382400
*                                  (MAN=NONE),                          00383300
*                             01 = ONLY USER RECORDS TO BE RECORDED     00384200
*                                  (MAN=USER),                          00385100
*                             10 = INVALID COMBINATION,                 00386000
*                             11 = SMF AND USER RECORDING REQUESTED     00386900
*                                  (MAN=ALL)                            00387800
SMCADSIC EQU   BIT2           DATA SET INIT COMPLETE BY IEEMB829   @Q4C 00388700
*                                  (1 = INIT COMPLETE)             @Q4C 00389600
SMCAFIRT EQU   BIT3 -         SMF DATA SET TO BE OPENED                 00390500
SMCAPSDP EQU   BIT4 -         PSEUDO-DUMP SWITCH                        00391400
*                             (DEVICE SWITCHING ONLY)                   00392300
SMCADBSY EQU   BIT5 -         DUMP IS BUSY (SMF WRITER)                 00393200
SMCABSW  EQU   BIT6 -         BUFFER SWITCH.  IF 0, LEFT HALF OF BUFFER 00394100
*                             IN USE.  IF 1, RIGHT HALF OF BUFFER IN    00395000
*                             USE.                                      00395900
SMCADUMP EQU   BIT7 -         DUMP BUSY                                 00396800
SMCATOFF DS    H -            OFFSET OF THE FIRST SMF TIOT ENTRY FROM   00397700
*                             THE BEGINNING OF THE MASTER SCHEDULER     00398600
*                             TIOT                                      00399500
SMCASMCA DS    CL4            CONTROL BLOCK ID                          00400400
*                                                                       00401300
* THE FOLLOWING FIELDS ARE SET UP BY IPL INITIALIZATION                 00402200
*                                                                       00403100
SMCAJWT  DS    F -            JOB WAIT TIME LIMIT - BIT 31     @ZA18120 00404000
*                             REPRESENTS 1.048576 SECONDS      @ZA18120 00404900
SMCAS842 DS    A -            ADDRESS OF IEEMB842              @G743PJK 00405800
SMCASID  DS    CL4 -          SYSTEM IDENTIFICATION (SID)        MDC002 00406700
*                             - INTENDED FOR REFERENCE ONLY        @P6A 00407100
SMCABUFP DS    A -            ADDRESS OF THE SMF BUFFER                 00407600
SMCAMTD  DS    CL8            MAXDORM TIME AND DATE            @G743PJW 00408500
SMCAOPTB DS    A -            ADDRESS OF SMFOPTAB              @G743PJK 00409400
SMCADFLT DS    A -            ADDRESS OF SMFDELFT              @G743PJK 00410300
SMCAARCT DS    F -            # OF RECORDS AT LAST ABEND       @G743PBB 00411200
SMCAABCT DS    F -            # OF BUFFERS AT LAST ABEND       @G743PBB 00412100
SMCASRCT DS    F -            # OF RECORDS AT LAST STATUS      @G743PJW 00413000
SMCASBCT DS    F -            # OF BUFFERS AT LAST STATUS      @G743PJW 00413900
SMCAPFBA DS    A -            PAGE FIX BEGINNING ADDRESS       @G743PBB 00414800
SMCAPFEA DS    A -            PAGE FIX END ADDRESS             @G743PBB 00415700
SMCAECBA DS    A -            PAGE FIX ECB ADDRESS             @G743PBB 00416600
SMCABR14 DS    H -            SMF RMTR (BR 14)                 @G743PBB 00417500
SMCAASID DS    H -            ASID OF SMF ADDRESS SPACE            @L1C 00418400
*                                                                       00419300
* MISCELLANEOUS POINTERS AND COMMUNICATION AREAS                        00420200
*                                                                       00421100
SMCAWAIT DS    2F -           THE ACCUMULATED WAIT TIME, EXPRESSED IN   00422000
*                             26 USEC TIMER UNITS.  FIRST WORD IS       00422900
*                             OVERFLOW FROM SECOND WORD.                00423800
SMCAENTY DS    0CL2 -         THESE SWITCHES GOVERN ENTRY CONDITIONS    00424700
*                             FOR DEVICE SWITCHING/ALLOCATION/          00425600
*                             OPENING ROUTINES                          00426500
SMCAENDI DS    B -            A COMMUNICATION FIELD                     00427400
SMCARS14 EQU   BIT0,,C'X' -   RESERVED                                  00428300
SMCARS15 EQU   BIT1,,C'X' -   RESERVED                                  00429200
SMCARS16 EQU   BIT2,,C'X' -   RESERVED                                  00430100
SMCARS17 EQU   BIT3,,C'X' -   RESERVED                                  00431000
SMCARS18 EQU   BIT4,,C'X' -   RESERVED                                  00431900
SMCARS19 EQU   BIT5,,C'X' -   RESERVED                                  00432800
SMCADSPO EQU   BIT6 -         DISPLAY OPTIONS (D SMF,O) IS IN EFFECT    00433700
*                                                              @ZA84325 00434600
SMCADSNF EQU   BIT7 -         IF ZERO, DATA SET (X OR Y) WAS FOUND.     00435500
*                             IF ONE, DATA SET (X OR Y) WAS NOT FOUND.  00436400
SMCAENOP DS    C -            ENTRY CODE THAT INDICATES WHICH LOAD OF   00437300
*                             SVC 83 HAS PASSED CONTROL TO CURRENT LOAD 00438200
SMCAFOPT DS    B -            SMF FOREGROUND OPTIONS.                   00439100
*                             BIT SETTINGS ARE SAME AS SMCAOPT.   20011 00440000
SMCABITS DS    X -            BIT INDICATORS                       @0SC 00450000
SMCADAR  EQU   X'80' -        DUMPABND OPTION INDICATOR            @0SA 00550000
SMCADSNM EQU   X'40' -        Data Set Name Migration Indicator    @LXA 00550100
SMCAWRTP DS    F -            AN OPTIMUM BUFFER LOAD DISPLACEMENT       00550200
*                             FIGURE.  WHEN THE BUFFER IS LOADED TO OR  00550400
*                             BEYOND THIS POINT, IT WILL BE WRITTEN TO  00550600
*                             THE SMF DATA SET.                         00550800
SMCAOARY DS    F -            POINTER TO OLD RDS ARRAY         @G743PBB 00551000
SMCANARY DS    F -            POINTER TO NEW RDS ARRAY         @G743PBB 00551200
SMCASUBP DS    F -            POINTER TO SUBPARM CHAIN         @G383P26 00551400
SMCABFMF DS    F -            MAXIMUM NUMBER OF FULL BUFFERS   @G743PBB 00551600
*                                                                 1@P3D 00551800
SMCAPCNO DS    F -            PC NUMBER FOR SMFWTM                 @L1C 00552000
SMCADSTM DS    CL8 -          START TIME AND DATE AT WHICH NO DATA SET  00552200
*                             WAS AVAILABLE TO RECORD ON.  APPEARS IN   00552400
*                             PACKED DECIMAL IN THE FORM 00YYDDDF       00552600
*                             WHERE 00 = ZEROS, YY = LAST 2 DIGITS OF   00552800
*                             THE YEAR, DDD = DAY OF THE YEAR AND F IS  00553000
*                             A SIGN.                                   00553200
SMCADSCT DS    F -            THE NUMBER OF SMF RECORDS THAT HAVE BEEN  00553400
*                             OMITTED FROM THE SMF DATA SET DUE TO THE  00553600
*                             UNAVAILABILITY OF A DATA SET TO RECORD ON 00553800
SMCAASCB DS    A -            ASCB OF SMF ADDRESS SPACE            @L1C 00554000
SMCAMACR DS    F -            ENTRY POINT TO MACRO RTN         @G742PJK 00554200
SMCASAVE DS    A -            USER EXIT ADDRESS SAVE FIELD (OS/VS2)     00554400
*                             (MDC300)                         @ZA02385 00554600
SMCATEXP DS    F -            TIME OF MOST RECENT EXPIRATION OF A       00554800
*                             TEN-MINUTE TIMER QUEUE ELEMENT (TQE)      00555000
*                                                                ICB310 00555200
SMCASTKN DS    CL8 -          SMF Address Space Token              @05C 00555800
*                                                                 1@05D 00556400
SMCASJWT DS    CL4 -          SAVE JWT AS ENTERED (HHMM)       @G742PJK 00557000
SMCASMDM DS    CL4 -          SAVE MAXDORM AS ENTERED (MMSS)   @G742PJK 00557200
SMCASSTS DS    CL6 -          SAVE STATUS AS ENTERED (HHMMSS)  @G742PJK 00557400
SMCAPARM DS    CL2 -          PARMLIB SUFFIX FOR RESTART                00557600
*                                                                 1@P3D 00557800
SMCASLCA DS    A -            ADDRESS OF SLCA                      @L1A 00558000
SMCAPGM  DS    F -            NUMBER OF PAGES MIGRATED           ICB310 00558200
SMCAU83  DS    A -            ADDRESS OF SMF OUTPUT EXIT (IEFU83)       00558400
*                             TAKEN WHEN RECORDS ARE TO BE WRITTEN TO   00558600
*                             AN SMF DATA SET                    ICB407 00558800
SMCAWTCB DS    A -            ADDRESS OF SMF WRITER'S TCB - USED BY     00559000
*                             XMPOST ERROR PROCESSOR (IEEMB827)         00559200
*                             (OS/VS2)                           MDC006 00559400
*                                                                 1@P3D 00559700
SMCATSK2 DS    A -            ADDRESS OF IFASMF TASK                    00560000
SMCAACTP DS    A -            ADDRESS OF THE ACT (USED BY PARSE AND     00560400
*                             INPUT MERGE AND LIST OPTIONS)    @G741PLS 00560600
*                                                                       00560800
* THE NEXT TWO FIELDS ARE THE SUBJECT OF COMPARE DOUBLE AND             00561000
* SWAP LOGIC THAT CONTROLS THE SCHEDULING OF THE SRB. THEY              00561200
* MUST BE ON A DOUBLE WORD BOUNDARY.  DO NOT MOVE.             @G742PJK 00561400
*                                                                       00561600
SMCACDS  DS    0D -           TARGET OF CDS TO CONTROL SRB SCHEDULE     00561800
SMCANMFL DS    F -            NUMBER OF FULL BUFFERS           @G742PJK 00562000
SMCASSB  DS    A -            POINTER TO SMF SUSPEND BLOCK     @ZM50077 00562200
SMCAMNBF DS    H -            RESERVED (PREVIOUSLY THE MINIMUM          00562300
*                             NUMBER OF BUFFERS)                   @P2C 00562400
SMCAMXBF DS    H -            RESERVED (PREVIOUSLY THE MAXIMUM          00562500
*                             NUMBER OF BUFFERS)                   @P2C 00562600
SMCASTTT DS    A -            ADDRESS OF STATUS TIMER ELEMENT  @G742PJK 00562800
SMCAMAXT DS    A -            ADDRESS OF MAXDORM TIMER ELEMENT @G742PJK 00563000
SMCADTB  DS    A -            ADDRESS OF DUMP TIMER ELEMENT    @G742PJK 00563200
SMCABITF DS    0F -           FULL WORD OF BIT FLAGS           @G743PJK 00563400
SMCAPRMT DS    XL1 -          REPLACES OPI BIT                 @G741PLS 00563600
SMCAIPLR EQU   X'80' -        PROMPT(IPLR) OR PROMPT(ALL)      @G741PLS 00563800
SMCALIST EQU   X'40' -        PROMPT(LIST) OR PROMPT(ALL)      @G741PLS 00564000
SMCALDSN EQU   X'20' -        DISPLAY DATASET STATUS           @G741PLS 00564200
SMCAMXDM EQU   X'10' -        MAXDORM SPECIFIED?               @G742PJK 00564400
SMCASTUS EQU   X'08' -        STATUS SPECIFIED?                @G742PJK 00564600
SMCARUN  EQU   X'04' -        WRITER SRB RUNNING               @ZA53006 00564800
SMCASKD  EQU   X'02' -        WRITER SRB HAS BEEN SCHEDULED    @ZA53006 00565000
SMCACONS EQU   X'01' -        DD CONSOLIDATION                     @02A 00565200
SMCAFLGS DS    XL1 -          WRITER STATUS FLAGS              @G741PLS 00565400
SMCAINIT EQU   X'80' -        WRITER TASK INITIALIZED          @G741PLS 00565600
SMCARSTR EQU   X'40' -        RESTART IN PROGRESS                  @L1C 00565800
SMCADTLS EQU   X'20' -        DATA LOST - NO SPACE ON DATA SETS    @L1C 00566000
SMCASETP EQU   X'10' -        SET SMF IN PROCESS               @G741PLS 00566200
SMCADISP EQU   X'08' -        DISPLAY SMF FOR OPTIONS OR DATASETS       00566400
*                             IS IN PROCESS.                   @ZA84325 00566600
SMCALL   EQU   X'04' -        LOCK HELD WHEN DISP LOCK OBTAIN  @G741PLS 00566800
SMCALATE EQU   X'02' -        NEXT ELEMENT LONGER THAN 1 SEC   @G741PLS 00567000
SMCASETS EQU   X'01' -        SETSMF IN PROCESS                @G383P26 00567200
SMCAFLGR DS    XL1 -          RECOVERY FOOTPRINTS              @G743PBB 00567400
SMCATERM EQU   X'80' -        SMF TERMINATED                   @G743PBB 00567600
SMCAPGFX EQU   X'40' -        PAGEFIX ISSUED                   @G743PBB 00567800
SMCASRBF EQU   X'20' -        WRITER SRB ABENDED AND ISSUED SDUMP       00568000
*                                                              @G743PBB 00568200
SMCAPSUS EQU   X'10' -        PREVENT SUSPEND PROCESSING WHILE HANDLING 00568400
*                             I/O ERROR                        @G743PBB 00568600
SMCAPCDT EQU   X'10' -        IFAPCWTR HAS TAKEN DUMP              @L1A 00568800
SMCAU29  EQU   X'08' -        IEFU29 EXIT CALLED               @G743PBB 00569000
SMCANOST EQU   X'04' -        NO MORE SETS ALLOWED             @G743PBB 00569200
SMCAPREV EQU   X'02' -        PREVIOUS ABEND IN EASI INTERVAL  @G384P27 00569400
SMCANMRE EQU   X'01' -        NO MORE EASI INTERVAL PROC       @G384P27 00569600
SMCARCUR DS    XL1 -          RECOVERY RECURSION BITS          @G743PBB 00569800
SMCAMXDR EQU   X'80' -        PREVENT MAXDORM RECURSION        @G743PBB 00570000
SMCASTTR EQU   X'40' -        PREVENT STATUS RECURSION         @G743PBB 00570200
SMCASUSR EQU   X'20' -        PREVENT SUSPEND RECURSION        @G743PBB 00570400
SMCATIMR EQU   X'10' -        PREVENT TIMER RECURSON           @G743PBB 00570600
SMCASETR EQU   X'08' -        PREVENT SET RECURSION            @G743PBB 00570800
SMCASETC EQU   X'04'          FOOTPRINTS FOR SET RECOVERY      @G743PJK 00571000
*        EQU   X'02'          Reserved                             @LVC 00571200
*        EQU   X'01'          Reserved                             @LVC 00571400
SMCAECB0 DS    F -            DISPLAY SMF ECB                      @L1C 00571600
SMCASRB  DS    A -            ADDRESS OF SMF SRB                   @L1C 00571800
SMCAECB1 DS    F -            SET SMF ECB                          @L1A 00572000
SMCAECB2 DS    F -            DUMP CHECK ECB                       @L1A 00572200
SMCAECB3 DS    F -            SETSMF ECB                           @L1A 00572400
         DS    F -            Reserved                             @LVC 00572600
SMCAXMCA DS    F -            ADDR OF CROSS MEM COMMUNICATION AREA @L1C 00572800
*                                                                       00573000
*       CONTROL AREA FOR RDS CHAIN - RECORDING DATASET BLOCKS  @G741PLS 00573200
*                                                                       00573400
SMCARDSH DS    CL4 -          RDSH - CHAIN HEADER ID           @G741PLS 00573600
SMCAFRDS DS    A -            FIRST RDS                        @G741PLS 00573800
SMCALRDS DS    A -            LAST RDS                         @G741PLS 00574000
SMCASVCR DS    A -            CURRENT RDS FOR SVC 83 (IEEMB830)    @L1C 00574200
SMCASRBR DS    A -            CURRENT RDS FOR SRB (IEEMB834)       @L1C 00574400
*                                                                       00574600
*       MISCELLANEOUS DATA AREAS                                   @L1C 00574800
*                                                                       00575000
         DS    CL4 -          Reserved                             @LVC 00575200
*                                                                 1@LVD 00575400
         DS    A -            Reserved                             @LVC 00575600
*                                                                 1@LVD 00575800
         DS    A -            Reserved                             @LVC 00576000
*                                                                 2@LVD 00576200
SMCAECBI DS    F  -           ADDRESS OF ECB FOR SMF INIT          @L1A 00576600
*                                                                 1@P3D 00576800
SMCADMID DS    F  -           DOM ID OF SMF TERMINATED MSG         @L1C 00577000
         DS    F  -           Reserved                             @P3C 00577200
*                                                                 1@P3D 00577400
SMCAD978 DS    0F -           DOM ID OF IEE978E MSG                @DIC 00577600
SMCAD986 DS    F  -           DOM ID OF IEE986E MSG                @DIA 00577800
SMCABFLS DS    F  -           NUMBER OF RCDS LOST DUE TO BUFFER         00578000
*                             SHORTAGE                         @G742PJK 00578200
*                                                                 1@P3D 00578400
SMCAD979 DS    F  -           DOM ID OF IEE979W MSG                @L1A 00578600
SMCABFWT DS    F  -           BUFFERS WRITTEN                  @G742PJK 00578800
SMCARCWT DS    F  -           RECORDS WRITTEN                  @G742PJK 00579000
*                                                                       00579200
*       VARIABLES FOR SMF TIMER MODULE - IEEMB839              @G742PJK 00579400
*                                                                       00579600
SMCATQE  DS    A -            ADDRESS OF TQE                   @G742PJK 00579800
SMCAENQE DS    A -            ADDRESS OF ENQUE ENTRY POINT     @G742PJK 00580000
SMCADEQE DS    A -            ADDRESS OF DEQUE ENTRY POINT     @G742PJK 00580200
SMCANSRB DS    A -            ADDRESS OF NEXT ELEMENT ON CHAIN @G742PJK 00580400
SMCAENDT DS    CL8 -          TIME WHEN DIE INVOKED PLUS 1 SEC @G742PJK 00580600
*                                                                       00580800
*       SELECTIVITY CONTROL AREA                               @G741PLS 00581000
*                                                                       00581200
SMCASSTP DS    A -            ADDRESS OF SMF SELECTIVITY       @G741PJK 00581400
*                             TABLES                           @G741PJK 00581600
SMCASYSP DS    A -            ADDR OF THE SYSTEM (DEFAULT) SST @G741PJK 00581800
SMCAITME DS    CL4 -          IPL TIME (BINARY) IN HUNDREDTHS OF A @P6A 00581900
*                             SECOND - INTENDED FOR REFERENCE ONLY @P6A 00582000
SMCAIDTE DS    CL4 -          IPL DATE (0CYYDDDF)                  @P5C 00582200
*                             - INTENDED FOR REFERENCE ONLY        @P6A 00582300
SMCASACT DS    A -            ADDRESS OF THE NEW ACT FOR SET   @G743PJK 00582400
SMCANSST DS    H -            NUMBER OF SST ENTRIES            @G743PJK 00582600
SMCALSST DS    H -            LENGTH OF ONE SST ENTRY          @G741PJK 00582800
*                                                              @G860P27 00583000
*                                                              @G860P27 00583200
*       I/O MEASUREMENTS CONTROL AREA                          @G860P27 00583400
*                                                              @G860P27 00583600
*                                                              @G860P27 00583800
SMCAIOMC DS    F              NUMBER OF TIMES I/O MEASUREMENTS @G860P27 00584000
*                             HAVE BEEN TURNED OFF             @G860P27 00584200
SMCAIOMS EQU   X'80'          MEASUREMENTS ARE CURRENTLY ON    @G860P27 00584400
*                                                              @G860P27 00584600
*                                                              @G860P27 00584800
*       SMF  ADDRESS TABLE                                     @G860P27 00585000
*                                                              @G860P27 00585200
SMCA836  DS    A              ADDRESS OF IEEMB836              @G860P27 00585400
SMCA727  DS    A              ADDRESS OF IEFTB727              @G860P27 00585600
SMCA728  DS    A              ADDRESS OF IEFTB728              @G860P27 00585800
*                                                                       00586000
*       DATASET CONTROL INTERVAL SIZE                                   00586200
*          AND DATA LOST CONTROL FLAGS                                  00586400
*                                                                       00586600
SMCACISZ DS    F              SESSION DATASET CONTROL INT SIZE     @DHA 00586800
*                                                                       00587000
SMCA721  DS    0A             ADDRESS OF IEFTB721                  @DNC 00587200
SMCAJAC  DS    A              ADDRESS OF IFAJAC00                  @DNA 00587400
SMCASMCX DS    A              POINTER TO SMCX (SMCA EXTENSION      @LPC 00587500
*                             IN 31-BIT STORAGE)                   @LPA 00587600
SMCASCHD DS    A              ADDR OF DEFERRED SCHED SUB-ROUTINE   @LTC 00587700
*                             IN IEEMB839                          @LTC 00587800
*                                                                       00588000
SMCAEXFL DS    XL1            USER EXIT FLAGS                      @LWC 00588200
*        EQU   BIT0 -         RESERVED                             @LVC 00588400
*        EQU   BIT1 -         RESERVED                             @LVC 00588600
*        EQU   BIT2 -         Reserved                             @LVC 00588800
*        EQU   BIT3 -         RESERVED                             @LVC 00589000
SMCAEXR1 EQU   BIT4 -         RESERVED                             @DHA 00589200
SMCAEXR3 EQU   BIT5 -         RESERVED                             @DHA 00589400
SMCAEXR4 EQU   BIT6 -         RESERVED                             @DHA 00589600
SMCAEXR5 EQU   BIT7 -         RESERVED                             @DHA 00589800
*                                                                       00589900
SMCASIDB DS    XL1            SMF SID Syntax Used                  @LWA 00590000
SMCASDFT EQU   X'80'          'Default'                            @LWA 00590100
SMCASONL EQU   X'40'          SID(xxxx)                            @LWA 00590200
SMCASSER EQU   X'20'          SID(xxxx,ser#)                       @LWA 00590300
SMCASSYS EQU   X'10'          SID(xxxxSYSNAME(sysname))            @LWA 00590400
SMCASSYM EQU   X'08'          SID(&SYSNAME(m:n))                   @LWA 00590500
SMCASCOM EQU   X'04'          SID(xxxx,COMBIN(ser#,ser#))          @LWA 00590600
SMCASRSV EQU   X'03'          Reserved                             @LWA 00590700
*                                                                       00590800
SMCAUFLG DS    XL1            Usage Data Collection Services Flags @01C 00590900
SMCAUT89 EQU   BIT0 -         Type 89 Subtype 1 Recording Active   @01A 00591000
SMCAT892 EQU   BIT1 -         Type 89 Subtype 2 Recording Active   @MXA 00591100
*                                                                       00591200
         DS    XL1            Reserved                             @LWA 00591300
*                                                                       00591400
SMCADLFL DS    XL1            DATA LOST CONTROL FLAGS              @01C 00591500
SMCADLWT EQU   BIT0 -         MAXBUFFS OPTION SPECIFIED            @DHA 00591600
SMCADLHL EQU   BIT1 -         NOBUFFS(HALT) SPECIFIED              @DHA 00591700
SMCADLLD EQU   BIT2 -         LASTDS(HALT) SPECIFIED               @DHA 00591800
SMCADLR1 EQU   BIT3 -         RESERVED                             @DHA 00591900
SMCADLR2 EQU   BIT4 -         RESERVED                             @DHA 00592000
SMCADLR3 EQU   BIT5 -         RESERVED                             @DHA 00592100
SMCADLR4 EQU   BIT6 -         RESERVED                             @DHA 00592200
SMCADLR5 EQU   BIT7 -         RESERVED                             @DHA 00592300
*                                                                       00592400
         DS    XL1            Reserved                             @01A 00592500
*                                                                       00592600
SMCAASIS DS    H              SMF ASID used for serialization      @05C 00592700
*                                                                 1@05D 00592800
         DS    F -            Reserved                             @LVC 00593100
         DS    F -            Reserved                             @LVC 00593200
SMCAJAC1 DS    A              ADDRESS OF IFAJAC01                  @LRA 00593300
SMCAUDCA DS    A              Address of Usage Data Collection     @01A 00593400
SMCAUPCL DS    F              Usage PCA Lockword                   @01A 00593500
SMCAUPCA DS    F              Address of first PCA on chain        @01A 00593600
SMCAUACL DS    F              Usage ACA Lockword                   @01A 00593700
SMCAUACA DS    F              Address of first ACA on chain        @01A 00593800
SMCAUDCT DS    A              Address of Usage Data Collection     @03A 00593900
*                             Timer Element                        @03A 00594000
         DS    CL4            Reserved for Alignment               @03A 00594100
SMCAUST  DS    XL8            Usage Data Start Time (TOD)          @03A 00594200
SMCAUSTL DS    XL8            Usage Data Start Time (Local)        @03A 00594300
SMCAUET  DS    XL8            Usage Data End Time (TOD)            @03A 00594400
SMCAUETL DS    XL8            Usage Data End Time (Local)          @03A 00594500
SMCAUIT  DS    XL8            Usage Record Start Time (TOD)        @03A 00594600
SMCAUITL DS    XL8            Usage Record Start Time (Local)      @03A 00594700
*                                                                       00594800
SMCAEND  EQU   *                                                        00594900
SMCASIZE EQU   SMCAEND-SMCABASE - SIZE OF SMCA TABLE                    00595000
         MEND  , */                                                     00595100
*    %SMCAL2: ;                                                         00595200
*/*                               */                                    00595300
*/* PL/AS mapping definitions...  */                                    00595400
*/*                               */                                    00595500
*   DECLARE                                                             00595600
*     1 SMCABASE BASED(CVTSMCA) BDY(DWORD),                             00595700
*      2 SMCAOPT     CHAR(1),            /* SMFDEFLT OPTIONS SELECTED   00595800
*                                           AT INITIALIZATION TIME.     00595900
*                                           THE OPTIONS APPLY TO        00596000
*                                           BACKGROUND PROCESSING.      00596100
*                                           SMCAFOPT (OFFSET 82)        00596200
*                                           CONTAINS THE FOREGROUND     00596300
*                                           OPTIONS.                 */ 00596400
*       3 SMCAOPT1 BIT(1),               /* RESERVED                 */ 00596500
*       3 SMCAOPT2 BIT(1),               /* RESERVED                 */ 00596600
*       3 SMCAEXT  BIT(1),               /* RESERVED                 */ 00596700
*       3 SMCADSA  BIT(1),               /* DATA SET ACCOUNTING      */ 00596800
*       3 SMCAVOL  BIT(1),               /* VOLUME ACCOUNTING        */ 00596900
*       3 SMCAUDCS  BIT(1),         /* Usage Data Collection Services   00597000
*                                                                @01A*/ 00597100
*         5 SMCARS01 BIT(1),             /* RESERVED             @01C*/ 00597200
*       3 SMCATDS  BIT(1),               /* TYPE 17 RECORDS             00597300
*                                           MAINTAINED FOR TEMPORARY    00597400
*                                           DATA SETS (REC(PERM) OR     00597500
*                                           REC(CALL))               */ 00597600
*       3 SMCAFGND BIT(1),               /* SMF FOREGROUND OPTIONS      00597700
*                                           BIT.  IF 0, ABOVE BITS      00597800
*                                           DESCRIBE BACKGROUND         00597900
*                                           OPTIONS.  IF 1, ABOVE       00598000
*                                           BITS DESCRIBE FOREGROUND    00598200
*                                           OPTIONS             20011*/ 00598400
*      2 SMCAMISC    CHAR(1),            /* MISCELLANEOUS INDICATORS */ 00598600
*       3 SMCAUSER BIT(1),               /* SMF RECORDING REQUESTED  */ 00598800
*       3 SMCAMAN  BIT(1),               /* SYS1.MAN DATA SET           00599000
*                                           IS/IS NOT PRESENT.          00599200
*                                           BITS 0 AND 1 MEAN:          00599400
*                                           00 = NO SMF RECORDING       00599600
*                                                REQUESTED (MAN=NONE)   00599800
*                                           01 = ONLY USER RECORDS TO   00600000
*                                                BE RECORDED (MAN=USER) 00600200
*                                           10 = INVALID COMBINATION    00600400
*                                           11 = SMF AND USER           00600600
*                                                RECORDING REQUESTED    00600800
*                                                (MAN=ALL)           */ 00601000
*       3 SMCADSIC BIT(1),               /* DATA SET INITIALIZATION     00601200
*                                           COMPLETE BY IEEMB829        00601400
*                                           (1 = COMPLETE)       @Q4C*/ 00601600
*       3 SMCAFIRT BIT(1),               /* SMF DATA SET TO BE          00601800
*                                           OPENED                   */ 00602000
*       3 SMCAPSDP BIT(1),               /* PSEUDO-DUMP SWITCH          00602200
*                                           (DEVICE SWITCHING ONLY)  */ 00602400
*       3 SMCADBSY BIT(1),               /* DUMP IS BUSY (SMF WRITER)*/ 00602600
*       3 SMCABSW  BIT(1),               /* BUFFER SWITCH.  IF 0,       00602800
*                                           LEFT HALF OF BUFFER IN      00603000
*                                           USE.  IF 1, RIGHT HALF OF   00603200
*                                           BUFFER IN USE.           */ 00603400
*       3 SMCADUMP BIT(1),               /* DUMP BUSY                */ 00603600
*      2 SMCATOFF    FIXED(15),          /* OFFSET OF THE FIRST SMF     00603800
*                                           TIOT ENTRY FROM THE         00604000
*                                           BEGINNING OF THE MASTER     00604200
*                                           SCHEDULER TIOT           */ 00604400
*      2 SMCASMCA    CHAR(4),            /* CONTROL BLOCK ID         */ 00604600
*   /*                                                               */ 00604800
*   /* THE FOLLOWING FIELDS ARE SET UP BY IPL INITIALIZATION         */ 00605000
*   /*                                                               */ 00605200
*      2 SMCAJWT     FIXED(31),          /* JOB WAIT TIME LIMIT - BIT   00605400
*                                           31 REPRESENTS 1.048576      00605600
*                                           SECONDS          @ZA18120*/ 00605800
*      2 SMCAS842    PTR(31),            /* ADDR OF IEEMB842 @G743PJK*/ 00606000
*      2 SMCASID     CHAR(4),            /* SYSTEM IDENTIFICATION       00606200
*                                           (SID) - INTENDED FOR        00606300
*                                           REFERENCE ONLY       @P6A*/ 00606400
*      2 SMCABUFP    PTR(31),            /* ADDRESS OF THE SMF BUFFER*/ 00606600
*      2 SMCAMTD BDY(WORD) CHAR(8),      /* MAXDORM TIME STAMP OF FIRST 00606800
*                                           RECORD IN CURRENT BUFFER AT 00607000
*                                           EXPIRATION OF PREVIOUS      00607200
*                                           MAXDORM          @G743PJW*/ 00607400
*      2 SMCAOPTB    PTR(31),            /* ADDR OF SMFOPTAB @G743PJK*/ 00607600
*      2 SMCADFLT    PTR(31),            /* ADDR OF SMFDEFLT @G743PJK*/ 00607800
*      2 SMCAARCT FIXED(31),             /* # OF RECORDS AT LAST ABEND  00608000
*                                                            @G743PBB*/ 00608200
*      2 SMCAABCT FIXED(31),             /* # OF BUFFERS AT LAST ABEND  00608400
*                                                            @G743PBB*/ 00608600
*      2 SMCASRCT FIXED(31),             /* # OF RECORDS AT LAST STATUS 00608800
*                                                            @G743PJW*/ 00609000
*      2 SMCASBCT FIXED(31),             /* # OF BUFFERS AT LAST STATUS 00609200
*                                                            @G743PJW*/ 00609400
*      2 SMCAPFBA PTR(31),               /* PAGE FIX BEGINNING ADDRESS  00609600
*                                                            @G743PBB*/ 00609800
*      2 SMCAPFEA PTR(31),               /* PAGE FIX END ADDRESS        00610000
*                                                            @G743PBB*/ 00610200
*      2 SMCAECBA PTR(31),               /* PAGE FIX ECB ADDRESS        00610400
*                                                            @G743PBB*/ 00610600
*      2 SMCABR14 CHAR(2),               /* SMF RMTR (BR 14) @G743PBB*/ 00610800
*      2 SMCAASID FIXED(15),           /* ASID OF SMF ADDR SPACE @L1C*/ 00611000
*   /*                                                               */ 00611200
*   /* MISCELLANEOUS POINTERS AND COMMUNICATION AREAS                */ 00611400
*   /*                                                               */ 00611600
*      2 SMCAWAIT (2) FIXED(31),         /* THE ACCUMULATED WAIT        00611800
*                                           TIME, EXPRESSED IN 26       00612000
*                                           USEC TIMER UNITS.  FIRST    00612200
*                                           WORD IS OVERFLOW FROM       00612400
*                                           SECOND WORD.             */ 00612600
*      2 SMCAENTY    CHAR(2),            /* THESE SWITCHES GOVERN       00612800
*                                           ENTRY CONDITIONS FOR        00613000
*                                           DEVICE SWITCHING/           00613200
*                                           ALLOCATION/OPENING          00613400
*                                           ROUTINES                 */ 00613600
*       3 SMCAENDI    CHAR(1),           /* A COMMUNICATION FIELD    */ 00613800
*        4 SMCARS14 BIT(1),              /* RESERVED                 */ 00614000
*        4 SMCARS15 BIT(1),              /* RESERVED                 */ 00614200
*        4 SMCARS16 BIT(1),              /* RESERVED                 */ 00614400
*        4 SMCARS17 BIT(1),              /* RESERVED                 */ 00614600
*        4 SMCARS18 BIT(1),              /* RESERVED                 */ 00614800
*        4 SMCARS19 BIT(1),              /* RESERVED                 */ 00615000
*        4 SMCADSPO BIT(1),              /* DISPLAY OPTIONS (D SMF,O)   00615200
*                                           IS IN EFFECT.    @ZA84325*/ 00615400
*        4 SMCADSNF BIT(1),              /* IF ZERO, DATA SET (X OR     00615600
*                                           Y) WAS FOUND.  IF ONE,      00615800
*                                           DATA SET (X OR Y) WAS       00616000
*                                           NOT FOUND.               */ 00616200
*       3 SMCAENOP    CHAR(1),           /* ENTRY CODE THAT INDICATES   00616400
*                                           WHICH LOAD OF SVC 83 HAS    00616600
*                                           PASSED CONTROL TO CURRENT   00616800
*                                           LOAD                     */ 00617000
*      2 SMCAFOPT    CHAR(1),            /* SMF FOREGROUND OPTIONS   */ 00617200
*       3 SMCAFOP1 BIT(1),               /* RESERVED                 */ 00617400
*       3 SMCAFOP2 BIT(1),               /* RESERVED                 */ 00617600
*       3 SMCAFEXT BIT(1),               /* RESERVED                 */ 00617800
*       3 SMCAFDSA BIT(1),               /* DATA SET ACCOUNTING         00618000
*                                           (DSV=2 OR 3)        19028*/ 00618200
*       3 SMCAFVOL BIT(1),               /* VOLUME ACCOUNTING           00618400
*                                           (DSV=1 OR 3)        19028*/ 00618600
*       3 SMCAFR01 BIT(1),               /* RESERVED           ICB441*/ 00618800
*       3 SMCAFTDS BIT(1),               /* TYPE 17 RECORDS             00619000
*                                           MAINTAINED FOR TEMPORARY    00619200
*                                           DATA SETS (REC(PERM) OR     00619400
*                                           REC(CALL))               */ 00619600
*       3 SMCAFGN  BIT(1),               /* SMF FOREGROUND OPTIONS      00619800
*                                           BIT.  IF 0, ABOVE BITS      00620000
*                                           DESCRIBE BACKGROUND         00620200
*                                           OPTIONS.  IF 1, ABOVE       00620400
*                                           BITS DESCRIBE               00620600
*                                           FOREGROUND OPTIONS  20011*/ 00620800
*      2 SMCABITS    CHAR(1),            /* BIT INDICATORS       @0SC*/ 00650000
*        4 SMCADAR   BIT(1),             /* DUMPABND OPTION IND  @0SA*/ 00750000
*        4 SMCADSNM  BIT(1),             /* Data Set Name Migration     00775000
*                                           Indicator            @LXA*/ 00800000
*        4 *         BIT(6),             /* RESERVED             @LXC*/ 00825000
*      2 SMCAWRTP    FIXED(31),          /* AN OPTIMUM BUFFER LOAD      00850000
*                                           DISPLACEMENT FIGURE.        00900000
*                                           WHEN THE BUFFER IS LOADED   00950000
*                                           TO OR BEYOND THIS POINT,    01000000
*                                           IT WILL BE WRITTEN TO THE   01050000
*                                           SMF DATA SET             */ 01100000
*      2 SMCAOARY PTR(31),               /* POINTER TO OLD RDS ARRAY    01150000
*                                           FOR SET COMMAND  @G743PJK*/ 01200000
*      2 SMCANARY PTR(31),               /* POINTER TO NEW RDS ARRAY    01250000
*                                           FOR SET COMMAND  @G743PJK*/ 01300000
*      2 SMCASUBP PTR(31),               /* POINTER TO SUBPARM CHAIN    01350000
*                                                            @ZA52499*/ 01400000
*      2 SMCABFMF FIXED(31),             /* MAXIMUM NUMBER OF FULL      01450000
*                                           BUFFERS          @G743PBB*/ 01500000
*                                        /*                     1@P3D*/ 01550000
*      2 SMCAPCNO FIXED(31),             /* PC NUMBER FOR SMFWTM @P3C*/ 01600000
*      2 SMCADSTM    CHAR(8) BDY(WORD),  /* START TIME AND DATE AT      01650000
*                                           WHICH NO DATA SET WAS       01700000
*                                           AVAILABLE TO RECORD ON.     01750000
*                                           APPEARS IN PACKED DECIMAL   01800000
*                                           IN THE FORM 00YYDDDF        01850000
*                                           WHERE 00 = ZEROS, YY =      01900000
*                                           LAST 2 DIGITS OF THE YEAR,  01950000
*                                           DDD = DAY OF THE YEAR AND   02000000
*                                           F IS A SIGN.             */ 02050000
*      2 SMCADSCT    FIXED(31),          /* THE NUMBER OF SMF RECORDS   02100000
*                                           THAT HAVE BEEN OMITTED      02150000
*                                           FROM THE SMF DATA SET DUE   02200000
*                                           TO THE UNAVAILABILITY OF    02250000
*                                           A DATA SET TO RECORD ON  */ 02300000
*      2 SMCAASCB    PTR(31),            /* ASCB OF SMF ADDRESS SPACE   02350000
*                                                              MDC005*/ 02400000
*      2 SMCAMACR    FIXED(31),          /* ENTRY POINT TO MACRO        02450000
*                                           ROUTINE         @G742PJK*/  02500000
*      2 SMCASAVE    PTR(31),            /* USER EXIT ADDRESS SAVE      02550000
*                                           FIELD (OS/VS2)              02600000
*                                           (MDC300)        @ZA02385*/  02650000
*      2 SMCATEXP    FIXED(31),          /* TIME OF MOST RECENT         02700000
*                                           EXPIRATION OF A TEN-        02750000
*                                           MINUTE TIMER QUEUE          02800000
*                                           ELEMENT (TQE)      ICB310*/ 02850000
*        3 SMCAECB7 FIXED(31),          /* ECB FOR SET SMF TO POST      02900000
*                                           WHEN COMPLETE        @L1A*/ 02950000
*      2 SMCASTKN    CHAR(8),            /* Address Space Token  @05C*/ 03000000
*                                        /*                     1@05D*/ 03050000
*      2 SMCASJWT    CHAR(4),            /* SAVE JWT AS ENTERED         03500000
*                                           (HHMM)           @G742PJK*/ 03550000
*      2 SMCASMDM    CHAR(4),            /* SAVE MAXDORM AS ENTERED     03600000
*                                           (MMSS)           @G742PJK*/ 03650000
*      2 SMCASSTS    CHAR(6),            /* SAVE STATUS AS ENTERED      03700000
*                                           (HHMMSS)         @G742PJK*/ 03750000
*      2 SMCAPARM    CHAR(2),            /* PARMLIB SUFFIX FOR RESTART  03800000
*                                                                    */ 03850000
*                                        /*                     1@P3D*/ 03900000
*      2 SMCASLCA    PTR(31),            /* ADDRESS OF SLCA      @P3C*/ 03950000
*      2 SMCAPGM     FIXED(31),          /* NUMBER OF PAGES MIGRATED    04050000
*                                                              ICB310*/ 04100000
*      2 SMCAU83     PTR(31),            /* ADDRESS OF SMF OUTPUT EXIT  04150000
*                                           (IEFU83) TAKEN WHEN         04200000
*                                           RECORDS ARE TO BE WRITTEN   04250000
*                                           TO AN SMF DATA SET ICB407*/ 04300000
*        3 SMCALOCK PTR(31),             /* POINTER TO FIRST SSB ON     04350000
*                                           SMF LOCK QUEUE   @ZA58293*/ 04400000
*      2 SMCAWTCB    PTR(31),            /* ADDRESS OF SMF WRITER'S     04450000
*                                           TCB - USED BY XMPOST        04500000
*                                           ERROR PROCESSOR (IEEMB827)  04550000
*                                           (OS/VS2)           MDC006*/ 04600000
*                                        /*                     1@P3D*/ 04650000
*      2 SMCATSK2 PTR(31),             /* ADDRESS OF IFASMF TASK @P3C*/ 04700000
*      2 SMCAACTP PTR(31),               /* ADDRESS OF THE ACT (USED    04950000
*                                           BY INPUT MERGE, PARSE AND   05000000
*                                           LIST OPTIONS)   @G741PLS*/  05050000
*       /*************************************************************/ 05100000
*       /*                                                           */ 05150000
*       /* THE NEXT TWO FIELDS ARE THE SUBJECT OF COMPARE DOUBLE AND */ 05200000
*       /* SWAP LOGIC THAT CONTROLS THE SCHEDULING OF THE SRB.  THEY */ 05250000
*       /* MUST BE ON A DOUBLE WORD BOUNDARY.  DO NOT MOVE.  @G741PLS*/ 05300000
*       /*                                                           */ 05350000
*       /*************************************************************/ 05400000
*      2 SMCACDS CHAR(8) BDY(DWORD),     /* TARGET OF CDS TO CONTROL    05450000
*                                           SRB SCHEDULE     @G742PJK*/ 05500000
*        3 SMCANMFL FIXED(31),           /* NUMBER OF FULL BUFFERS      05550000
*                                                            @G742PJK*/ 05600000
*        3 SMCASSB  PTR(31),          /* POINTER TO SMF SUSPEND BLOCK   05650000
*                                                            @ZM50077*/ 05700000
*      2 SMCAMNBF FIXED(15),     /* RESERVED (PREVIOUSLY THE MINIMUM    05730000
*                                   NUMBER OF BUFFERS)           @P2C*/ 05760000
*      2 SMCAMXBF FIXED(15),     /* RESERVED (PREVIOUSLY THE MAXIMUM    05790000
*                                   NUMBER OF BUFFERS)           @P2C*/ 05820000
*      2 SMCASTTT PTR(31),            /* ADDR OF STATUS TIMER ELEMENT   05850000
*                                                            @G742PJK*/ 05900000
*      2 SMCAMAXT PTR(31),            /* ADDR OF MAXDORM TIMER ELEMENT  05950000
*                                                            @G742PJK*/ 06000000
*      2 SMCADTB  PTR(31),               /* ADDR OF DUMP TIMER ELEMENT  06050000
*                                                            @G742PJK*/ 06100000
*      2 SMCABITF FIXED(31),            /* WORD OF BIT FLAGS @G743PJK*/ 06150000
*        3 SMCAPRMT BIT(8),              /* REPLACES OPI BIT @G741PLS*/ 06200000
*          5 SMCAIPLR BIT(1),            /* PROMPT(IPLR) OR PROMPT(ALL) 06250000
*                                           SPECIFIED        @G741PLS*/ 06300000
*          5 SMCALIST BIT(1),            /* PROMPT(LIST) OR PROMPT(ALL) 06350000
*                                           SPECIFIED        @G741PLS*/ 06400000
*          5 SMCALDSN BIT(1),            /* DISPLAY DSNAME STATUS       06450000
*                                                            @G741PLS*/ 06500000
*          5 SMCAMXDM BIT(1),            /* MAXDORM SPECIFIED?          06550000
*                                                            @G742PJK*/ 06600000
*          5 SMCASTUS BIT(1),            /* STATUS SPECIFIED?           06650000
*                                                            @G741PLS*/ 06700000
*          5 SMCARUN BIT(1) ABNORMAL,   /* WRITER SRB RUNNING           06750000
*                                                            @ZA53006*/ 06800000
*          5 SMCASKD BIT(1) ABNORMAL,   /* WRITER SRB HAS BEEN          06850000
*                                      SCHEDULED             @ZA53006*/ 06900000
*          5 SMCACONS BIT(1),          /* DD CONSOLIDATION       @02A*/ 06950000
*        3 SMCAFLGS BIT(8) ABNORMAL,     /*                      @04C*/ 07000000
*          5 SMCAINIT BIT(1),            /* WRITER TASK INITIALIZED     07050000
*                                                            @G741PLS*/ 07100000
*          5 SMCARSTR BIT(1),            /* RESTART IN PROGRESS         07150000
*                                                                @L1C*/ 07200000
*          5 SMCADTLS BIT(1),            /* DATA LOST - NO SPACE ON     07250000
*                                           RECORDING DATASETS          07300000
*                                                            @G743PBB*/ 07350000
*          5 SMCASETP BIT(1),            /* SET SMF IN PROCESS          07400000
*                                                            @G741PLS*/ 07450000
*          5 SMCADISP BIT(1),            /* DISPLAY SMF FOR OPTIONS     07500000
*                                           OR DATASETS IN PROCESS      07550000
*                                                            @ZA84325*/ 07600000
*          5 SMCALL   BIT(1),            /* LOCK HELD WHEN DISP LOCK    07650000
*                                           OBTAINED         @G742PJK*/ 07700000
*          5 SMCALATE BIT(1),            /* NEXT ELEMENT LONGER THAN    07750000
*                                           1 SECOND AWAY    @G742PJK*/ 07800000
*          5 SMCASETS BIT(1),           /* SETSMF IN PROCESS @G383P26*/ 07850000
*        3 SMCAFLGR BIT(8),              /* RECOVERY FOOTPRINTS         07900000
*                                                            @G743PBB*/ 07950000
*          5 SMCATERM BIT(1),            /* SMF TERMINATED   @G743PBB*/ 08000000
*          5 SMCAPGFX BIT(1),            /* PAGEFIX ISSUED   @G743PBB*/ 08050000
*          5 SMCASRBF BIT(1),            /* WRITER SRB ABENDED AND      08100000
*                                           ISSUED SDUMP     @G743PBB*/ 08150000
*          5 SMCAPSUS BIT(1),            /* RESERVED             @L1C*/ 08200000
*            7 SMCAPCDT BIT(1),          /* IFAPCWTR HAS TAKEN SDUMP -  08250000
*                                         IEEMB830 RECOVERY DOES NOT    08300000
*                                           NEED TO TAKE DUMP    @L1A*/ 08350000
*          5 SMCAU29 BIT(1),             /* IEFU29 EXIT CALLED          08400000
*                                                            @G743PBB*/ 08450000
*          5 SMCANOST BIT(1),            /* NO MORE SET COMMANDS        08500000
*                                           ALLOWED          @G743PBB*/ 08550000
*          5 SMCAPREV BIT(1) ABNL,       /* ABEND OCCURRED IN PREVIOUS  08600000
*                                           EASI INTERVAL PROCESSING.   08650000
*                                           MUST USE CS TO UPDATE       08700000
*                                                            @G384P27*/ 08750000
*          5 SMCANMRE BIT(1) ABNL,       /* NO MORE EASI INTERVAL       08800000
*                                           PROCESSING DUE TO ABENDS.   08850000
*                                           MUST USE CS TO UPDATE       08900000
*                                                            @G384P27*/ 08950000
*        3 SMCARCUR BIT(8),              /* RECOVERY RECURSION BITS     09000000
*                                                            @G743PBB*/ 09050000
*          5 SMCAMXDR BIT(1),            /* PREVENT MAXDORM RECURSION   09100000
*                                                            @G743PBB*/ 09150000
*          5 SMCASTTR BIT(1),            /* PREVENT STATUS RECURSION    09200000
*                                                            @G743PBB*/ 09250000
*          5 SMCASUSR BIT(1),            /* PREVENT SUSPEND RECURSION   09300000
*                                                            @G743PBB*/ 09350000
*          5 SMCATIMR BIT(1),            /* PREVENT TIMER RECURSON      09400000
*                                                            @G743PBB*/ 09450000
*          5 SMCASETR BIT(1),            /* PREVENT SET RECURSION       09500000
*                                                            @G743PBB*/ 09550000
*          5 SMCASETC BIT(1),            /* FOOTPRINTS FOR SET RECOV-   09600000
*                                           ERY                  @L1C*/ 09650000
*          5 * BIT(1),                   /* Reserved             @LVC*/ 09700000
*          5 * BIT(1),                   /* Reserved             @LVC*/ 09750000
*      2 SMCAECB0 FIXED(31),             /* DISPLAY SMF ECB      @L1A*/ 09800000
*      2 SMCASRB  PTR(31),               /* ADDRESS OF SMF WTR SRB      09850000
*                                                            @G741PLS*/ 09900000
*      2 SMCAECB1 FIXED(31),             /* SET SMF ECB          @L1A*/ 09950000
*      2 SMCAECB2 FIXED(31),             /* DUMP CHECK ECB       @L1A*/ 10000000
*      2 SMCAECB3 FIXED(31),             /* SETSMF ECB           @L1A*/ 10050000
*      2 * FIXED(31),                    /* Reserved             @LVC*/ 10100000
*      2 SMCAXMCA PTR(31),               /* ADDRESS OF CROSS MEMORY     10150000
*                                           COMMUNICATION AREA  @L1C*/  10200000
*   /*****************************************************************/ 10250000
*   /*                                                               */ 10300000
*   /* HEADER AREA FOR RDS CHAIN - RECORDING DATASET CONTROL         */ 10350000
*   /*                                                       @G741PLS*/ 10400000
*   /*****************************************************************/ 10450000
*   2 SMCARDSH CHAR(4),           /* RDSH - CHAIN HEADER ID  @G741PLS*/ 10500000
*   2 SMCAFRDS PTR(31),           /* FIRST RDS               @G741PLS*/ 10550000
*   2 SMCALRDS PTR(31),           /* LAST RDS                @G741PLS*/ 10600000
*   2 SMCASVCR PTR(31),           /* CURRENT RDS FOR SVC 83 (IEEMB830)  10650000
*                                                            @G741PLS*/ 10700000
*   2 SMCASRBR PTR(31),           /* CURRENT RDS FOR SRB (IEEMB834)     10750000
*                                                            @G741PLS*/ 10800000
*   /*****************************************************************/ 10850000
*   /*                                                               */ 10900000
*   /* Miscellaneous Buffering Fields                                */ 10950000
*   /*                                                           @P3C*/ 11000000
*   /*****************************************************************/ 11050000
*   2 *        CHAR(4) BDY(WORD), /* Reserved                    @P3C*/ 11100000
*                                 /*                            1@LVD*/ 11150000
*   2 *        PTR(31),           /* Reserved                    @P3C*/ 11200000
*                                 /*                            1@LVD*/ 11250000
*   2 *        PTR(31),           /* Reserved                    @P3C*/ 11300000
*                                 /*                            2@LVD*/ 11350000
*   2 SMCAECBI PTR(31),           /* INITIALIZATION END ECB ADR  @P3C*/ 11400000
*   2 SMCADMID FIXED(31),        /* ID TO DOM IEE962E MESSAGE    @P1C*/ 11600000
*                                 /*                            3@P3D*/ 11650000
*   2 *        FIXED(31),         /* Reserved                    @P3C*/ 11800000
*                                 /*                            1@P3D*/ 11850000
*   2 SMCAD978 FIXED(31),         /* MESSAGE IEE978E REMOVED     @DIC*/ 11900000
*     3 SMCAD986 FIXED(31),       /* DOM ID FOR LAST IEE986E MSG @DIA*/ 11950000
*   2 SMCABFLS FIXED(31),         /* NUMBER OF RCDS LOST DUE TO         12000000
*                                    BUFFER SHORTAGE         @G742PJK*/ 12050000
*                                 /*                            1@P3D*/ 12100000
*   2 SMCAD979 FIXED(31),         /* DOM ID FOR IEE979W MESSAGE  @P3C*/ 12150000
*   2 SMCABFWT FIXED(31),         /* BUFFERS WRITTEN         @G742PJK*/ 12200000
*   2 SMCARCWT FIXED(31),         /* RECORDS WRITTEN         @G742PJK*/ 12250000
*   /*****************************************************************/ 12300000
*   /*                                                               */ 12350000
*   /* VARIABLES USED BY TIMER MODULE                                */ 12400000
*   /*                                                       @G742PJK*/ 12450000
*   /*****************************************************************/ 12500000
*   2 SMCATQE  PTR(31),           /* ADDRESS OF TQE          @G742PJK*/ 12550000
*   2 SMCAENQE PTR(31),           /* ADDR OF ENTRY TO ENQUE             12600000
*                                    SUBROUTINE OF IEEMB839  @G742PJK*/ 12650000
*   2 SMCADEQE PTR(31),           /* ADDRESS OF ENTRY TO DEQUE          12700000
*                                    SUBROUTINE OF IEEMB839  @G742PJK*/ 12750000
*   2 SMCANSRB PTR(31),           /* ADDRESS OF FIRST ELEMENT ON        12800000
*                                    CHAIN OF TIMER EVENTS   @G742PJK*/ 12850000
*   2 SMCAENDT CHAR(8),           /* TIME WHEN DIE INVOKED PLUS ONE     12900000
*                                    SECOND                  @G742PJK*/ 12950000
*   /*****************************************************************/ 13000000
*   /*                                                               */ 13050000
*   /*   SELECTIVITY CONTROL AREA                            @G741PLS*/ 13100000
*   /*                                                               */ 13150000
*   /*****************************************************************/ 13200000
*      2 SMCASSTP PTR(31),               /* ADDRESS OF SMF SELECTIVITY  13250000
*                                           TABLE            @G741PJK*/ 13300000
*      2 SMCASYSP PTR(31),               /* ADDRESS OF THE SYSTEM       13350000
*                                           (DEFAULT) SST    @G741PJK*/ 13400000
*      2 SMCAITME CHAR(4),               /* IPL TIME (BINARY) IN        13431200
*                                           HUNDREDTHS OF A SECOND -    13462400
*                                           INTENDED FOR REFERENCE      13493600
*                                           ONLY                 @P6A*/ 13524800
*      2 SMCAIDTE CHAR(4),               /* IPL DATE (0CYYDDDF) -       13556000
*                                           INTENDED FOR REFERENCE      13587200
*                                           ONLY                 @P6A*/ 13618400
*      2 SMCASACT PTR(31),               /* ADDRESS OF THE NEW ACT FOR  13650000
*                                           SET COMMAND      @G743PJK*/ 13700000
*      2 SMCANSST FIXED(15),             /* NUMBER OF SST ENTRIES       13750000
*                                                            @G741PJK*/ 13800000
*      2 SMCALSST FIXED(15),             /* LENGTH OF EACH SST ENTRY    13850000
*                                                            @G741PJK*/ 13900000
*/********************************************************************/ 13950000
*/*                                                                  */ 14000000
*/*    I/O MEASUREMENT CONTROL AREA                          @G860P27*/ 14050000
*/*                                                                  */ 14100000
*/********************************************************************/ 14150000
*      2 SMCAIOMC FIXED(31),             /* COUNT OF NUMBER OF TIMES    14200000
*                    I/O MEASUREMENTS HAVE BEEN TURNED OFF  @G860P27*/  14250000
*         3 SMCAIOMS BIT(1),             /* I/O MEASUREMENTS CURRENTLY  14300000
*                                           IN EFFECT        @G860P27*/ 14350000
*/*******************************************************************/  14400000
*/*                                                                 */  14450000
*/*    SMF ADDRESS TABLE                                    @G860P27*/  14500000
*/*                                                                 */  14550000
*/*******************************************************************/  14600000
*      2 SMCA836  PTR(31),            /* ADDRESS OF IEEMB836 @G860P27*/ 14650000
*      2 SMCA727  PTR(31),            /* ADDRESS OF IEFTB727 @G860P27*/ 14700000
*      2 SMCA728  PTR(31),            /* ADDRESS OF IEFTB728 @G860P27   14750000
*                                                            @DHC    */ 14800000
*/********************************************************************/ 14850000
*/*                                                                  */ 14900000
*/*     DATASET CONTROL INTERVAL SIZE                                */ 14950000
*/*        AND DATA LOST CONTROL FLAGS                               */ 15000000
*/*                                                                  */ 15050000
*/********************************************************************/ 15100000
*                                                                       15150000
*      2 SMCACISZ FIXED(31),          /* SESSION DATASET CONTROL        15200000
*                                        INT SIZE                @DHA*/ 15250000
*                                                                       15300000
*      2 SMCAJAC  PTR(31),            /* ADDRESS OF IFAJAC00     @DNA*/ 15350000
*        3 SMCA721 PTR(31),           /* ADDRESS OF IEFTB721     @DNC*/ 15400000
*      2 SMCASMCX PTR(31),          /* POINTER TO SMCX (SMCA EXTENSION  15433300
*                                      IN 31-BIT STORAGE)        @LPC*/ 15466600
*      2 SMCASCHD PTR (31),         /* ADDRESS OF DEFERRED SCHED        15494400
*                                      SUB-ROUTINE IN IEEMB839   @LTC*/ 15522200
*                                                                       15550000
*      2 SMCAEXFL FIXED(8),           /* USER EXIT FLAGS         @LWC*/ 15600000
*        3 * BIT(1),                  /* Reserved                @LVC*/ 15650000
*        3 * BIT(1),                  /* Reserved                @LVC*/ 15700000
*        3 * BIT(1),                  /* Reserved                @LVC*/ 15750000
*        3 * BIT(1),                  /* Reserved                @LVC*/ 15800000
*        3 SMCAEXR2 BIT(1),           /* RESERVED                @DHA*/ 15850000
*        3 SMCAEXR3 BIT(1),           /* RESERVED                @DHA*/ 15900000
*        3 SMCAEXR4 BIT(1),           /* RESERVED                @DHA*/ 15950000
*        3 SMCAEXR5 BIT(1),           /* RESERVED                @DHA*/ 16000000
*                                                                       16050000
*      2 SMCASIDB FIXED(8),         /* SMF SID Syntax Used       @LWA*/ 16056600
*        3 SMCASDFT BIT(1),         /* 'Default'                 @LWA*/ 16063200
*        3 SMCASONL BIT(1),         /* SID(xxxx)                 @LWA*/ 16069800
*        3 SMCASSER BIT(1),         /* SID(xxxx,ser#)            @LWA*/ 16076400
*        3 SMCASSYS BIT(1),         /* SID(xxxxSYSNAME(sysname)) @LWA*/ 16083000
*        3 SMCASSYM BIT(1),         /* SID(&SYSNAME(m:n))        @LWA*/ 16089600
*        3 SMCASCOM BIT(1),         /* SID(xxxx,COMBIN(ser#,)    @LWA*/ 16096200
*        3 SMCASRSV BIT(2),         /* Reserved                  @LWA*/ 16102800
*                                                                       16109400
*      2 SMCAUFLG FIXED(8),         /* Usage Flags               @01C*/ 16113800
*        3 SMCAUT89 BIT(1),         /* Type 89 Subtype 1                16115500
*                                      Recording active          @01A*/ 16117200
*        3 SMCAT892 BIT(1),         /* Type 89 Subtype 2                16118900
*                                      Recording active          @MXA*/ 16120600
*                                                                       16122600
*      2 *        FIXED(8),         /* Reserved                  @LWA*/ 16129200
*                                                                       16135800
*      2 SMCADLFL FIXED(8),         /* DATA LOST CONTROL FLAGS   @LWC*/ 16142400
*        3 SMCADLR0 BIT(1),         /* RESERVED                  @DIC*/ 16150000
*        3 SMCADLHL BIT(1),         /* NOBUFFS(HALT) SPECIFIED   @DIA*/ 16200000
*        3 SMCADLLD BIT(1),         /* LASTDS(HALT) SPECIFIED    @DIA*/ 16250000
*        3 SMCADLR1 BIT(1),         /* RESERVED                  @DIA*/ 16300000
*        3 SMCADLR2 BIT(1),         /* RESERVED                  @DIA*/ 16350000
*        3 SMCADLR3 BIT(1),         /* RESERVED                  @DIA*/ 16400000
*        3 SMCADLR4 BIT(1),           /* RESERVED                @DIA*/ 16450000
*        3 SMCADLR5 BIT(1),           /* RESERVED                @DIA*/ 16500000
*                                                                       16550000
*      2 *        FIXED(8),         /* Reserved                  @LWA*/ 16568000
*                                                                       16586000
*      2 SMCAASIS FIXED(15),        /* ASID for serialization    @05C*/ 16616000
*                                   /*                          1@05D*/ 16646000
*      2 *        FIXED(31),        /* Reserved                  @LVC*/ 16676000
*      2 *        FIXED(31),        /* Reserved                  @LVC*/ 16694000
*      2 SMCAJAC1 PTR(31),            /* ADDRESS OF IFAJAC01     @LRA*/ 16712500
*                                                                       16712900
*/********************************************************************/ 16713300
*/*                                                                  */ 16713700
*/*     Usage Data Collection Services Fields                    @01A*/ 16714100
*/*                                                                  */ 16714500
*/********************************************************************/ 16714900
*                                                                       16715300
*      2 SMCAUDCA  PTR(31),         /* Address of Service Rtn    @01A*/ 16715700
*      2 SMCAUPCL  FIXED(31),       /* Usage PCA Lockword        @01A*/ 16716100
*      2 SMCAUPCA  PTR(31),         /* Address of first PCA      @01A*/ 16716500
*      2 SMCAUACL  FIXED(31),       /* Usage ACA Lockword        @01A*/ 16716900
*      2 SMCAUACA  PTR(31),         /* Address of first ACA      @01A*/ 16717300
*      2 SMCAUDCT  PTR(31),         /* Address of Timer Element  @03A*/ 16717700
*      2 *        CHAR(4),          /* Reserved - Alignment      @03A*/ 16718100
*      2 SMCAUST   CHAR(8),         /* Usage Data Start Time (TOD)      16718500
*                                                                @03A*/ 16718900
*      2 SMCAUSTL  CHAR(8),         /* Usage Data Start Time (Local)    16719300
*                                                                @03A*/ 16719700
*      2 SMCAUET   CHAR(8),         /* Usage Data End Time (TOD)        16720100
*                                                                @03A*/ 16720500
*      2 SMCAUETL  CHAR(8),         /* Usage Data End Time (Local)      16720900
*                                                                @03A*/ 16721300
*      2 SMCAUIT   CHAR(8),         /* Usage Record Start Time (TOD)    16721700
*                                                                @03A*/ 16722100
*      2 SMCAUITL  CHAR(8),         /* Usage Record Start Time (Local)  16722500
*                                                                @03A*/ 16722900
*                                                                       16723300
*      2 SMCAEND   CHAR(0);           /* END OF SMCA MAPPING     @LPC*/ 16725000
*                                                                       16750000
