*                                                                       00015000
* %DCL IEEZB887_INCLUDED CHAR EXT;                                      00030000
* %DEACTIVATE IEEZB887_INCLUDED;                                        00045000
* %IF IEEZB887_INCLUDED = '' %THEN                                      00060000
* %DO;                                                                  00075000
*/* Macro made bi-lingual on 98120. CBGEN compile date 98009         */ 00090000
*% /*                                                                   00105000
         MACRO                                                          00120000
         IEEZB887 &DSECT=YES,&LIST=YES,&TITLE=YES,&ECDM_HDR=YES,       *00135000
               &ECDM_SUMM=COND,&ECDM_INFO=COND,&ECDM_DSP=COND,         *00150000
               &ECDM_MSCP=COND,&ECDM_CNSW=COND                          00165000
         GBLC  &IEEZB887_INCLUDED                                       00180000
         GBLC  &ZCBPRINT                                                00195000
&IEEZB887_INCLUDED SETC 'YES'                                           00210000
         AIF   ('&LIST' EQ 'NONE').P0                                   00225000
         AIF   ('&TITLE' EQ 'NO').P5                                    00240000
 TITLE   'IEEZB887  - EMCS Console Display Mapping               '      00255000
.P5      ANOP                                                           00270000
**/ IEEZB887_1:;                                                        00285000
*/***START OF SPECIFICATIONS******************************************/ 00300000
*/*                                                                  */ 00350000
*/*01* MACRO NAME:  IEEZB887                                         */ 00400000
*/*                                                                  */ 00450000
*/*01* DESCRIPTIVE NAME:  EMCS Console Display Mapping               */ 00500000
*/*                                                                  */ 00550000
*/*01* ACRONYM: EMCD                                                 */ 00600000
*/*01* EXTERNAL CLASSIFICATION: PI                               @P2A*/ 00650000
*/*01*  END OF EXTERNAL CLASSIFICATION:                              */ 00700000
*/*                                                                  */ 00703800
*/*01* PROPRIETARY STATEMENT=                                        */ 00707600
*/***PROPRIETARY_STATEMENT********************************************/ 00711400
*/*                                                                  */ 00715200
*/*                                                                  */ 00719000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00722800
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00726600
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1999                            */ 00730400
*/*                                                                  */ 00734200
*/* STATUS= JBB6607                                                  */ 00738000
*/*                                                                  */ 00741800
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00745600
*/*                                                                  */ 00750000
*/*01* DSECT NAME:  ECDM                                             */ 00800000
*/*                                                                  */ 00850000
*/*01* COMPONENT:  Master Scheduler (SC1B8)                          */ 00900000
*/*                                                                  */ 00950000
*/*01* EYE-CATCHER: ECDM                                             */ 01000000
*/*02*   OFFSET: 4                                                   */ 01050000
*/*02*   LENGTH: 4                                                   */ 01100000
*/*                                                                  */ 01150000
*/*01* STORAGE ATTRIBUTES:                                           */ 01200000
*/*02*   MAIN STORAGE: Yes                                           */ 01250000
*/*02*   VIRTUAL STORAGE: No                                         */ 01300000
*/*02*   AUXILIARY STORAGE: No                                       */ 01350000
*/*02*   DATA SPACE: No                                              */ 01400000
*/*02*   SUBPOOL: Caller's                                           */ 01450000
*/*02*   KEY: Caller's                                               */ 01500000
*/*02*   Residency: Any                                              */ 01550000
*/*                                                                  */ 01600000
*/*01* SIZE: Variable                                                */ 01650000
*/*            ECDM_HDR  -- X'0014' bytes                            */ 01657100
*/*            ECDM_SUMM -- X'0018' bytes                            */ 01664200
*/*            ECDM_INFO -- X'0068' bytes                        @P1C*/ 01671300
*/*            ECDM_DSP  -- X'0014' bytes                            */ 01678400
*/*            ECDM_MSCP -- Variable                                 */ 01685500
*/*            ECDM_CNSW -- Variable                                 */ 01692600
*/*                                                                  */ 01700000
*/*01* FUNCTION: Mapping of EMCS Console Data returned by Query      */ 01733300
*/*              EMCS Console Service (IEEQEMCS)                     */ 01766600
*/*                                                                  */ 01800000
*/*01* METHOD OF ACCESS:                                             */ 01850000
*/*                   BAL  - Specify:                                */ 01900000
*/*                                   IEEZB887                       */ 01950000
*/*                                                                  */ 02000000
*/*                   PL/X - %INCLUDE SYSLIB(IEEZB887)               */ 02050000
*/*                                                                  */ 02100000
*/*01* CREATED BY: IEEQEMCS                                          */ 02150000
*/*                                                                  */ 02200000
*/*01* POINTED TO BY: Set up by caller, pointed to by Register 1     */ 02211000
*/*                   during IEEQEMCS processing                 @P2A*/ 02222000
*/*                                                                  */ 02233200
*/* DELETED BY= Caller of IEEQEMCS                                   */ 02250000
*/*                                                                  */ 02300000
*/* DISTRIBUTION=     AMODGEN                                        */ 02350000
*/*                                                                  */ 02500000
*/*01* SERIALIZATION: None                                           */ 02550000
*/*                                                                  */ 02600000
*/*01* OPERATION: The EMCS Console Data block is constructed as      */ 02650000
*/*      follows:                                                    */ 02679700
*/*      - The entire block is headed by a header section            */ 02709400
*/*        that contains the size of the entire data block,          */ 02739100
*/*        the number of EMCS Consoles in the block, an              */ 02768800
*/*        eyecatcher that identifies the block and the              */ 02798500
*/*        version number of the block.                              */ 02828200
*/*      - After the header comes one or more EMCS console           */ 02857900
*/*        entries. Each EMCS console entry is constructed           */ 02887600
*/*        as follows:                                               */ 02917300
*/*        - The entry starts with a summary sub-block, which        */ 02947000
*/*          contains the size of the entire EMCS console entry,     */ 02976700
*/*          an identifier that marks it as an EMCS console          */ 03006400
*/*          header, and the name of the EMCS console.  It also      */ 03036100
*/*          contains flags to indicate what other sub-blocks        */ 03065800
*/*          are present in this EMCS console entry.  The summary    */ 03095500
*/*          sub-block is always present.                            */ 03125200
*/*        - The summary sub-block may optionally be followed        */ 03154900
*/*          by an information sub-block, which contains the         */ 03184600
*/*          size of the sub-block, an identifier that marks         */ 03214300
*/*          it as an information sub-block, and information         */ 03244000
*/*          about the EMCS console.                                 */ 03273700
*/*        - If the information sub-block is present, it may         */ 03303400
*/*          be followed by any or all of the following              */ 03333100
*/*          sub-blocks: the MSCOPE sub-block, the CNSWITCH          */ 03362800
*/*          sub-block, and the dataspace sub-block.  If any of      */ 03392500
*/*          these sub-blocks are present, they will always be in    */ 03422200
*/*          this order.                                             */ 03451900
*/*          - The MSCOPE sub-block contains an identifier, the      */ 03481600
*/*            size of the sub-block, and a list of systems that     */ 03511300
*/*            this console is MSCOPEd to.                           */ 03541000
*/*          - The CNSWITCH sub-block also contains an identifier,   */ 03570700
*/*            the size of the sub-block, and a list of consoles     */ 03600400
*/*            that have been switched to this console.              */ 03630100
*/*          - The dataspace sub-block has an identifier, the        */ 03659800
*/*            size of the sub-block, and various console            */ 03689500
*/*            dataspace statistics.                                 */ 03719200
*/*                                                                  */ 03750000
*/*        The Console Data block looks like this:                   */ 03800000
*/*    ___  ____________________________________________             */ 03850000
*/*     A  | ECDM_HDR (Header section) - Required       |            */ 03900000
*/*     |  |                                            |            */ 03950000
*/*     |  |  ECDM_HDR_SIZE  ECDM_NENT                  |            */ 04000000
*/*     |  |____________________________________________|            */ 04050000
*/*     |  |___  ______________________________________ |            */ 04100000
*/*     |  | A  | ECDM_SUMM #1 - Required              ||            */ 04150000
*/*     |  | |  |                                      ||            */ 04200000
*/*     |  | |  |  ECDM_SUMM_SIZE                      ||            */ 04250000
*/*     |  | E  |______________________________________||            */ 04300000
*/*     |  | C   ______________________________________ |            */ 04350000
*/*     E  | D  | ECDM_INFO #1 - Optional              ||            */ 04400000
*/*     C  | M  |                                      ||            */ 04450000
*/*     D  | _  |  ECDM_INFO_SIZE                      ||            */ 04500000
*/*     M  | S  |______________________________________||            */ 04550000
*/*     _  | U   ______________________________________ |            */ 04600000
*/*     S  | M  | ECDM_MSCP #1 - Optional              ||            */ 04650000
*/*     I  | M  | ECDM_MSCP_LIST(1)                    ||            */ 04700000
*/*     Z  | _  |   ....                               ||            */ 04750000
*/*     E  | C  | ECDM_MSCP_LIST(ECDM_DTMNUM)          ||            */ 04800000
*/*     |  | O  |______________________________________||            */ 04850000
*/*     |  | N   ______________________________________ |            */ 04900000
*/*     |  | S  | ECDM_CNSW #1 - Optional              ||            */ 04950000
*/*     |  | _  | ECDM_CNSW_LIST(1)                    ||            */ 05000000
*/*     |  | S  |   ....                               ||            */ 05050000
*/*     |  | I  | ECDM_CNSW_LIST(ECDM_DTMNUM)          ||            */ 05100000
*/*     |  | Z  |______________________________________||            */ 05150000
*/*     |  | E   ______________________________________ |            */ 05200000
*/*     |  | |  | ECDM_DSP #1 - Optional               ||            */ 05250000
*/*     |  | |  |                                      ||            */ 05300000
*/*     |  | V  |   ECDM_DSP_SIZE                      ||            */ 05350000
*/*     |  |___ |_____________________________________ ||            */ 05400000
*/*     |  |                                           ||            */ 05450000
*/*     |  |          ...                              ||            */ 05500000
*/*     |  |___  ______________________________________ |            */ 05550000
*/*     |  | A  | ECDM_SUMM #ECDM_NENT - Required      ||            */ 05600000
*/*     |  | |  |                                      ||            */ 05650000
*/*     |  | |  |  ECDM_SUMM_SIZE                      ||            */ 05700000
*/*     |  | E  |______________________________________||            */ 05750000
*/*     |  | C   ______________________________________ |            */ 05800000
*/*     |  | D  | ECDM_INFO #ECDM_NENT - Optional      ||            */ 05850000
*/*     |  | M  |                                      ||            */ 05900000
*/*     |  | _  |  ECDM_INFO_SIZE                      ||            */ 05950000
*/*     |  | S  |______________________________________||            */ 06000000
*/*     |  | U   ______________________________________ |            */ 06050000
*/*     |  | M  | ECDM_MSCP #ECDM_NENT - Optional      ||            */ 06100000
*/*     |  | M  | ECDM_MSCP_LIST(1)                    ||            */ 06150000
*/*     |  | _  |   ....                               ||            */ 06200000
*/*     |  | C  | ECDM_MSCP_LIST(ECDM_DTMNUM)          ||            */ 06250000
*/*     |  | O  |______________________________________||            */ 06300000
*/*     |  | N   ______________________________________ |            */ 06350000
*/*     |  | S  | ECDM_CNSW #ECDM_NENT - Optional      ||            */ 06400000
*/*     |  | _  | ECDM_CNSW_LIST(1)                    ||            */ 06450000
*/*     |  | S  |   ....                               ||            */ 06500000
*/*     |  | I  | ECDM_CNSW_LIST(ECDM_DTMNUM)          ||            */ 06550000
*/*     |  | Z  |______________________________________||            */ 06600000
*/*     |  | E   ______________________________________ |            */ 06650000
*/*     |  | |  | ECDM_DSP #ECDM_NENT - Optional       ||            */ 06700000
*/*     |  | |  |                                      ||            */ 06750000
*/*     |  | V  |   ECDM_DSP_SIZE                      ||            */ 06800000
*/*     V  |___ |_____________________________________ ||            */ 06850000
*/*    ___ |____________________________________________|            */ 06900000
*/*                                                                  */ 06950000
*/*        Each EMCS console entry within the block is independent   */ 07000000
*/*        of each other.  Not all of the console entries have to    */ 07050000
*/*        be of the same type (they do not all have to have the     */ 07100000
*/*        same subblocks and may not all be of the same size).      */ 07150000
*/*                                                                  */ 07200000
*/*                                                                  */ 07250000
*/* CHANGE ACTIVITY =                                                */ 07300000
*/* $MAC(IEEZB887) COMP(SC1B8): EMCS Console Display Mapping         */ 07350000
*/* $L0=DEMCS,    JBB6607, 980428 , PDTA: Display EMCS / IEEQEMCS    */ 07400000
*/* $P1=PWA0180,  JBB6607, 980715 , PDHD: Add terminal name          */ 07425000
*/* $P2=PWK0502,  HBB6608, 981209 , PDZH: Add EXTERNAL CLASSIFICATION*/ 07433300
*/*                                       and SHOWHDR updates        */ 07441600
*/*                                                                  */ 07450000
*/***END OF SPECIFICATIONS********************************************/ 07500000
*/** START OF CHANGE ACTIVITY  ***************************************/ 07550000
*/* A 000000-999999                                                  */ 07600000
*/* A Added field ECDM_INFO_TERM to supply terminal name         @P1A*/ 07625000
*/*** END OF CHANGE ACTIVITY  ****************************************/ 07650000
*% /*                                                                   07700000
.P0      ANOP                                                           07750000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 07800000
         AIF   ('&LIST' EQ 'YES').P2                                    07850000
.P1      ANOP                                                           07900000
         PUSH  PRINT                                                    07950000
         PRINT OFF                                                      08000000
.P2      ANOP                                                           08050000
         AIF   ('&ECDM_HDR' EQ 'NO').L0002                              08100000
         AIF   ('&DSECT' EQ 'YES').L0003                                08150000
         AIF   ('&ECDM_HDR' NE 'YES').L0002                             08200000
ECDM_HDR DS    0F        EMCS Console Data Header Mapping               08250000
         AGO   .L0004                                                   08300000
.L0003   ANOP                                                           08350000
ECDM_HDR DSECT           EMCS Console Data Header Mapping               08400000
.L0004   ANOP                                                           08450000
ECDM_ACRN DS   1CL0004   Eyecatcher                                     08500000
ECDM_VERS DS   1BL4      Version                                        08550000
ECDM_HDR_SIZE DS 1FL4    Size of ECDM block                             08600000
ECDM_SIZE DS   1FL4      Size of entire data buffer                     08650000
ECDM_NENT DS   1FL2      Number of console entries in the output       *08700000
                         buffer                                         08750000
         DS    1CL0002   Reserved                                       08800000
ECDM_HDR_LEN EQU *-ECDM_HDR                                             08850000
.L0002   ANOP                                                           08900000
         AIF   ('&ECDM_SUMM' EQ 'NO').L0005                             08950000
         AIF   ('&DSECT' EQ 'YES').L0006                                09000000
         AIF   ('&ECDM_SUMM' NE 'YES').L0005                            09050000
ECDM_SUMM DS   0F        EMCS console SUMM block                        09100000
         AGO   .L0007                                                   09150000
.L0006   ANOP                                                           09200000
ECDM_SUMM DSECT          EMCS console SUMM block                        09250000
.L0007   ANOP                                                           09300000
ECDM_SUMM_TYPE DS 1FL2   Type of block. Should be ECDM_TYPE_SUMM        09350000
         DS    1CL0002   Reserved                                       09400000
ECDM_SUMM_SIZE DS 1FL4   Size of the ECDM_SUMM block                    09450000
ECDM_SUMM_CONS_SIZE DS 1FL4 Size of the entire EMCS console entry       09500000
ECDM_SUMM_FLGS DS 0BL2   Flag bytes                                     09550000
ECDM_SUMM_FLG1 DS 0BL1   Flag byte 1                                    09600000
ECDM_SUMM_INFO EQU X'80' Data block was returned for this entry         09650000
ECDM_SUMM_MSCP EQU X'40' MSCOPE list was returned for this entry        09700000
ECDM_SUMM_CNSW EQU X'20' CN_SWITCH list was returned for this entry     09750000
ECDM_SUMM_DSP EQU X'10'  Dataspace block was returned for this entry    09800000
         ORG   ECDM_SUMM_FLG1+X'00000001'                               09850000
ECDM_SUMM_FLG2 DS 0BL1   Flag byte 2                                    09900000
         DS    1BL1      Reserved                                       09950000
         DS    1CL0002   Reserved                                       10000000
ECDM_SUMM_NAME DS 1CL0008 Console name                                  10050000
ECDM_SUMM_LEN EQU *-ECDM_SUMM                                           10100000
.L0005   ANOP                                                           10150000
         AIF   ('&ECDM_INFO' EQ 'NO').L0008                             10200000
         AIF   ('&DSECT' EQ 'YES').L0009                                10250000
         AIF   ('&ECDM_INFO' NE 'YES').L0008                            10300000
ECDM_INFO DS   0F        EMCS console INFO block                        10350000
         AGO   .L000A                                                   10400000
.L0009   ANOP                                                           10450000
ECDM_INFO DSECT          EMCS console INFO block                        10500000
.L000A   ANOP                                                           10550000
ECDM_INFO_TYPE DS 1FL2   Type of block. Should be ECDM_TYPE_INFO        10600000
         DS    1CL0002   Reserved                                       10650000
ECDM_INFO_SIZE DS 1FL4   Size of this console INFO block                10700000
ECDM_INFO_CNID DS 1FL4   4-byte console ID                              10750000
ECDM_INFO_MIGID DS 1FL1  1-byte migration ID                            10800000
ECDM_INFO_FLG1 DS 0BL1   Miscellaneous flag byte                        10850000
ECDM_INFO_SWTO_VALID EQU X'80' This console has been switched          *10900000
                         (SWITCHTO is valid)                            10950000
ECDM_INFO_ALTGRP_VALID EQU X'40' There is an alternate group for this  *11000000
                         console                                        11050000
ECDM_INFO_MIGID_VALID EQU X'20' There is an migration ID for this      *11100000
                         console                                        11150000
ECDM_INFO_JOBINFO_VALID EQU X'10' There is a JOBNAME and JOBID         *11200000
                         available for this console                     11250000
         ORG   ECDM_INFO_FLG1+X'00000001'                               11300000
ECDM_INFO_ASID DS 1FL2   ASID (only valid if this is an active console *11350000
                         on this system, otherwise it is zero)          11400000
ECDM_INFO_STFLG DS 0BL1  Console status flag byte                       11450000
ECDM_INFO_ACTIVE EQU X'80' Console is active                            11500000
ECDM_INFO_PD EQU X'40'   Console is in PD mode                          11550000
         ORG   ECDM_INFO_STFLG+X'00000001'                              11600000
ECDM_INFO_RTFLG DS 0BL1  Routing Flags                                  11650000
ECDM_INFO_UD EQU X'80'   UD bit                                         11700000
ECDM_INFO_HC EQU X'40'   HC bit                                         11750000
ECDM_INFO_AUTO EQU X'20' AUTO bit                                       11800000
ECDM_INFO_MNJB EQU X'10' Monitor jobnames                               11850000
ECDM_INFO_MNST EQU X'08' Monitor status                                 11900000
ECDM_INFO_MNSS EQU X'04' Monitor sessions                               11950000
ECDM_INFO_MSCP_ALL EQU X'02' MSCOPE=*ALL                                12000000
ECDM_INFO_NO_MSCP EQU X'01' No MSCOPE data available - this is not a   *12050000
                         sysplex                                        12100000
         ORG   ECDM_INFO_RTFLG+X'00000001'                              12150000
ECDM_INFO_DOM DS 0BL1    DOM attribute bits                             12200000
ECDM_INFO_DOMALL EQU X'80' DOM=ALL                                      12250000
ECDM_INFO_DOMNORM EQU X'40' DOM=NORMAL                                  12300000
ECDM_INFO_DOMNONE EQU X'20' DOM=NONE                                    12350000
         ORG   ECDM_INFO_DOM+X'00000001'                                12400000
ECDM_INFO_MLVL DS 0BL1   Level Byte                                     12450000
ECDM_INFO_LVW EQU X'80'  Display WTOR's                                 12500000
ECDM_INFO_LVIA EQU X'40' Display Immediate Action messages              12550000
ECDM_INFO_LVCE EQU X'20' Display Critical Eventual Action messages      12600000
ECDM_INFO_LVE EQU X'10'  Display Eventual Action messages               12650000
ECDM_INFO_LVI EQU X'08'  Display Informational messages                 12700000
ECDM_INFO_LVBC EQU X'04' Display Broadcast messages                     12750000
         ORG   ECDM_INFO_MLVL+X'00000001'                               12800000
ECDM_INFO_AUTH DS 0BL1   Console authority byte                         12850000
ECDM_INFO_SYS EQU X'80'  Console has SYS authority                      12900000
ECDM_INFO_IO EQU X'40'   Console has IO authority                       12950000
ECDM_INFO_CONS EQU X'20' Console has CONS authority                     13000000
ECDM_INFO_MASTER EQU X'10' Console has MASTER authority                 13050000
         ORG   ECDM_INFO_AUTH+X'00000001'                               13100000
         DS    1CL0003   Reserved                                       13150000
ECDM_INFO_KEY DS 1CL0008 User assigned key                              13200000
ECDM_INFO_SYSNM DS 1CL0008 System name                                  13250000
ECDM_INFO_TERM  DS 1CL0008 Terminal name                         @P1A   13275000
ECDM_INFO_JOBNM DS 1CL0008 JOBNAME                                      13300000
ECDM_INFO_JOBID DS 1CL0008 JOBID                                        13350000
ECDM_INFO_CSYS DS 1CL0008 CMDSYS                                        13400000
ECDM_INFO_ALTGRP DS 1CL0008 ALTGRP                                      13450000
ECDM_INFO_SWTO DS 1CL0008 SWITCHTO                                      13500000
ECDM_INFO_ROUT DS 1CL0016 Routing codes                                 13550000
ECDM_INFO_LEN EQU *-ECDM_INFO                                           13600000
.L0008   ANOP                                                           13650000
         AIF   ('&ECDM_DSP' EQ 'NO').L000B                              13700000
         AIF   ('&DSECT' EQ 'YES').L000C                                13750000
         AIF   ('&ECDM_DSP' NE 'YES').L000B                             13800000
ECDM_DSP DS    0F        Dataspace status mapping                       13850000
         AGO   .L000D                                                   13900000
.L000C   ANOP                                                           13950000
ECDM_DSP DSECT           Dataspace status mapping                       14000000
.L000D   ANOP                                                           14050000
ECDM_DSP_TYPE DS 1FL2    Type of block. Should be ECDM_TYPE_DSP         14100000
         DS    1CL0002   Reserved                                       14150000
ECDM_DSP_SIZE DS 1FL4    Size of the dataspace status mapping           14200000
ECDM_DSP_QD DS 1FL4      Queue depth in use                             14250000
ECDM_DSP_QLIM DS 1FL4    Queue depth limit                              14300000
ECDM_DSP_ALERTPCT DS 1FL1 Alert percentage                              14350000
ECDM_DSP_ERR DS 0BL1     Error condition byte                           14400000
ECDM_DSP_CLIM EQU X'80'  Queueing stopped by Memory Limit               14450000
ECDM_DSP_DLIM EQU X'40'  Queueing stopped by Queue Depth Limit          14500000
ECDM_DSP_INTR EQU X'20'  Queueing stopped by Internal Error             14550000
ECDM_DSP_ALRT EQU X'10'  Queueing reached Alert Percentage              14600000
         ORG   ECDM_DSP_ERR+X'00000001'                                 14650000
         DS    1CL0002   Reserved                                       14700000
ECDM_DSP_LEN EQU *-ECDM_DSP                                             14750000
.L000B   ANOP                                                           14800000
         AIF   ('&ECDM_MSCP' EQ 'NO').L000E                             14850000
         AIF   ('&DSECT' EQ 'YES').L000F                                14900000
         AIF   ('&ECDM_MSCP' NE 'YES').L000E                            14950000
ECDM_MSCP DS   0F        EMCS console MSCOPE block                      15000000
         AGO   .L0010                                                   15050000
.L000F   ANOP                                                           15100000
ECDM_MSCP DSECT          EMCS console MSCOPE block                      15150000
.L0010   ANOP                                                           15200000
ECDM_MSCP_HDR DS 0CL0012 MSCOPE fixed-size header. Should be           *15250000
                         ECDM_TYPE_MSCP                                 15300000
ECDM_MSCP_TYPE DS 1FL2   Type of block                                  15350000
         DS    1CL0002   Reserved                                       15400000
ECDM_MSCP_SIZE DS 1FL4   Size of this console MSCOPE block              15450000
ECDM_MSCP_MNUM DS 1FL4   Number of entries in MSCOPE block              15500000
ECDM_MSCP_LIST DS 1CL0008 MSCOPE list                                   15550000
ECDM_MSCP_LEN EQU *-ECDM_MSCP                                           15600000
.L000E   ANOP                                                           15650000
         AIF   ('&ECDM_CNSW' EQ 'NO').L0011                             15700000
         AIF   ('&DSECT' EQ 'YES').L0012                                15750000
         AIF   ('&ECDM_CNSW' NE 'YES').L0011                            15800000
ECDM_CNSW DS   0F        EMCS console CNSWITCH block                    15850000
         AGO   .L0013                                                   15900000
.L0012   ANOP                                                           15950000
ECDM_CNSW DSECT          EMCS console CNSWITCH block                    16000000
.L0013   ANOP                                                           16050000
ECDM_CNSW_HDR DS 0CL0012 CNSWITCH fixed-size header. Should be         *16100000
                         ECDM_TYPE_CNSW                                 16150000
ECDM_CNSW_TYPE DS 1FL2   Type of block                                  16200000
         DS    1CL0002   Reserved                                       16250000
ECDM_CNSW_SIZE DS 1FL4   Size of this console CNSWITCH block            16300000
ECDM_CNSW_MNUM DS 1FL4   Number of entries in CNSWITCH block            16350000
ECDM_CNSW_LIST DS 1CL0008 CNSWITCH list                                 16400000
ECDM_ACR EQU   C'ECDM'   Eyecatcher                                     16450000
*                                                                       16500000
*   Version numbers                                                     16550000
*                                                                       16600000
*                                                                       16650000
ECDM_VERS1 EQU X'00000001' Version number                               16700000
ECDM_VERID EQU X'00000001' Current version number                       16750000
*                                                                       16800000
*   Sub-block identifiers                                               16850000
*                                                                       16900000
*                                                                       16950000
ECDM_TYPE_SUMM EQU 8     Console SUMM block type                        17000000
ECDM_TYPE_INFO EQU 16    Console INFO block type                        17050000
ECDM_TYPE_MSCP EQU 32    Console MSCOPE block type                      17100000
ECDM_TYPE_CNSW EQU 64    Console CNSWITCH block type                    17150000
ECDM_TYPE_DSP EQU 128    Console dataspace block type                   17200000
ECDM_CNSW_LEN EQU *-ECDM_CNSW                                           17250000
.L0011   ANOP                                                           17300000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 17350000
         AIF   ('&LIST' EQ 'YES').P4                                    17400000
.P3      ANOP                                                           17450000
         POP   PRINT                                                    17500000
.P4      ANOP                                                           17550000
.P_EXIT  ANOP                                                           17600000
         MEND                                                           17650000
**/ IEEZB887_2:;                                                        17700000
* %IEEZB887_INCLUDED = 'YES';                                           17750000
* %DCL ZCBPRINT CHAR EXT;                                               17800000
* %DEACTIVATE ZCBPRINT;                                                 17850000
* %DCL IEEZB887_LIST CHAR EXT;                                          17900000
* %DEACTIVATE IEEZB887_LIST;                                            17950000
* %IF IEEZB887_LIST ^= 'NO' &                                           18000000
*    ZCBPRINT ^= 'NO' %THEN                                             18050000
*   %GOTO IEEZB887_3;                                                   18100000
*   @LIST PUSH NOECHO;                                                  18150000
*   @LIST NOASSEMBLE NOECHO;                                            18200000
*   @LIST OFF C NOECHO;                                                 18250000
* %IEEZB887_3:;                                                         18300000
*/* Start of PL/X Source                                             */ 18350000
*DCL                                                                    18400000
*  1 ECDM_HDR        BASED BDY(WORD), /* EMCS Console Data Header       18450000
*                                      Mapping                       */ 18500000
*    3 ECDM_ACRN     CHAR(4),       /* Eyecatcher                    */ 18550000
*    3 ECDM_VERS     BIT(32),       /* Version                       */ 18600000
*    3 ECDM_HDR_SIZE FIXED(31),     /* Size of ECDM block            */ 18650000
*    3 ECDM_SIZE     FIXED(31),     /* Size of entire data buffer    */ 18700000
*    3 ECDM_NENT     FIXED(16),     /* Number of console entries in     18750000
*                                      the output buffer             */ 18800000
*    3 *             CHAR(2);       /* Reserved                      */ 18850000
*@SPACE;                                                                18900000
*DCL                                                                    18950000
*  1 ECDM_SUMM       BASED,         /* EMCS console SUMM block       */ 19000000
*    3 ECDM_SUMM_TYPE FIXED(16),    /* Type of block.                   19050000
*                                      Should be ECDM_TYPE_SUMM      */ 19100000
*    3 * CHAR(2),                   /* Reserved                      */ 19150000
*    3 ECDM_SUMM_SIZE FIXED(31),    /* Size of the ECDM_SUMM block   */ 19200000
*    3 ECDM_SUMM_CONS_SIZE FIXED(31), /* Size of the entire EMCS        19250000
*                                      console entry                 */ 19300000
*    3 ECDM_SUMM_FLGS BIT(16),      /* Flag bytes                    */ 19350000
*      5 ECDM_SUMM_FLG1 BIT(8),     /*  Flag byte 1                  */ 19400000
*        7 ECDM_SUMM_INFO BIT(1),   /*   Data block was returned for    19450000
*                                        this entry                  */ 19500000
*        7 ECDM_SUMM_MSCP BIT(1),   /*   MSCOPE list was returned for   19550000
*                                        this entry                  */ 19600000
*        7 ECDM_SUMM_CNSW BIT(1),   /*   CN_SWITCH list was returned    19650000
*                                        for this entry              */ 19700000
*        7 ECDM_SUMM_DSP BIT(1),    /*   Dataspace block was returned   19750000
*                                        for this entry              */ 19800000
*        7 *         BIT(4),        /*   Reserved                    */ 19850000
*      5 ECDM_SUMM_FLG2 BIT(8),     /*  Flag byte 2                  */ 19900000
*        7 *         BIT(8),        /*   Reserved                    */ 19950000
*    3 * CHAR(2),                   /* Reserved                      */ 20000000
*    3 ECDM_SUMM_NAME CHAR(8);      /* Console name                  */ 20050000
*@SPACE;                                                                20100000
*DCL                                                                    20150000
*  1 ECDM_INFO       BASED,         /* EMCS console INFO block       */ 20200000
*    3 ECDM_INFO_TYPE  FIXED(16),   /* Type of block.                   20250000
*                                      Should be ECDM_TYPE_INFO      */ 20300000
*    3 * CHAR(2),                   /* Reserved                      */ 20350000
*    3 ECDM_INFO_SIZE  FIXED(31),   /* Size of this console INFO        20400000
*                                      block                         */ 20450000
*    3 ECDM_INFO_CNID  FIXED(31),   /* 4-byte console ID             */ 20500000
*    3 ECDM_INFO_MIGID FIXED(8),    /* 1-byte migration ID           */ 20550000
*    3 ECDM_INFO_FLG1  BIT(8),      /* Miscellaneous flag byte       */ 20600000
*      5 ECDM_INFO_SWTO_VALID BIT(1), /* This console has been          20650000
*                                        switched (SWITCHTO is valid)   20700000
*                                                                    */ 20750000
*      5 ECDM_INFO_ALTGRP_VALID BIT(1), /* There is an alternate        20800000
*                                       group for this console       */ 20850000
*      5 ECDM_INFO_MIGID_VALID BIT(1), /* There is an migration ID      20900000
*                                       for this console             */ 20950000
*      5 ECDM_INFO_JOBINFO_VALID BIT(1), /* There is a JOBNAME and      21000000
*                                       JOBID available for this        21050000
*                                       console                      */ 21100000
*      5 *             BIT(4),      /*  Reserved                     */ 21150000
*    3 ECDM_INFO_ASID  FIXED(16),   /* ASID (only valid if this is      21200000
*                                       an active console on this       21250000
*                                       system, otherwise it is         21300000
*                                       zero)                        */ 21350000
*    3 ECDM_INFO_STFLG BIT(8),      /* Console status flag byte      */ 21400000
*      5 ECDM_INFO_ACTIVE BIT(1),   /*  Console is active            */ 21450000
*      5 ECDM_INFO_PD  BIT(1),      /*  Console is in PD mode        */ 21500000
*      5 *             BIT(6),      /*  Reserved                     */ 21550000
*    3 ECDM_INFO_RTFLG BIT(8),      /* Routing Flags                 */ 21600000
*      5 ECDM_INFO_UD  BIT(1),      /*  UD bit                       */ 21650000
*      5 ECDM_INFO_HC  BIT(1),      /*  HC bit                       */ 21700000
*      5 ECDM_INFO_AUTO BIT(1),     /*  AUTO bit                     */ 21750000
*      5 ECDM_INFO_MNJB BIT(1),     /*  Monitor jobnames             */ 21800000
*      5 ECDM_INFO_MNST BIT(1),     /*  Monitor status               */ 21850000
*      5 ECDM_INFO_MNSS BIT(1),     /*  Monitor sessions             */ 21900000
*      5 ECDM_INFO_MSCP_ALL BIT(1), /*  MSCOPE=*ALL                  */ 21950000
*      5 ECDM_INFO_NO_MSCP BIT(1),  /*  No MSCOPE data available -      22000000
*                                         this is not a sysplex      */ 22050000
*    3 ECDM_INFO_DOM   BIT(8),      /* DOM attribute bits            */ 22100000
*      5 ECDM_INFO_DOMALL BIT(1),   /*  DOM=ALL                      */ 22150000
*      5 ECDM_INFO_DOMNORM BIT(1),  /*  DOM=NORMAL                   */ 22200000
*      5 ECDM_INFO_DOMNONE BIT(1),  /*  DOM=NONE                     */ 22250000
*      5 *             BIT(5),      /*  Reserved                     */ 22300000
*    3 ECDM_INFO_MLVL  BIT(8),      /* Level Byte                    */ 22350000
*      5 ECDM_INFO_LVW BIT(1),      /*  Display WTOR's               */ 22400000
*      5 ECDM_INFO_LVIA BIT(1),     /*  Display Immediate Action        22450000
*                                       messages                     */ 22500000
*      5 ECDM_INFO_LVCE BIT(1),     /*  Display Critical Eventual       22550000
*                                       Action messages              */ 22600000
*      5 ECDM_INFO_LVE BIT(1),      /*  Display Eventual Action         22650000
*                                       messages                     */ 22700000
*      5 ECDM_INFO_LVI BIT(1),      /*  Display Informational           22750000
*                                       messages                     */ 22800000
*      5 ECDM_INFO_LVBC BIT(1),     /*  Display Broadcast               22850000
*                                       messages                     */ 22900000
*      5 *             BIT(2),      /*  Reserved                     */ 22950000
*    3 ECDM_INFO_AUTH  BIT(8),      /* Console authority byte        */ 23000000
*      5 ECDM_INFO_SYS BIT(1),      /*  Console has SYS authority    */ 23050000
*      5 ECDM_INFO_IO  BIT(1),      /*  Console has IO authority     */ 23100000
*      5 ECDM_INFO_CONS BIT(1),     /*  Console has CONS authority   */ 23150000
*      5 ECDM_INFO_MASTER BIT(1),   /*  Console has MASTER authority */ 23200000
*      5 *             BIT(4),      /*  Reserved                     */ 23250000
*    3 *               CHAR(3),     /* Reserved                      */ 23300000
*    3 ECDM_INFO_KEY   CHAR(8),     /* User assigned key             */ 23350000
*    3 ECDM_INFO_SYSNM CHAR(8),     /* System name                   */ 23400000
*    3 ECDM_INFO_TERM  CHAR(8),     /* Terminal name             @P1A*/ 23425000
*    3 ECDM_INFO_JOBNM CHAR(8),     /* JOBNAME                       */ 23450000
*    3 ECDM_INFO_JOBID CHAR(8),     /* JOBID                         */ 23500000
*    3 ECDM_INFO_CSYS  CHAR(8),     /* CMDSYS                        */ 23550000
*    3 ECDM_INFO_ALTGRP CHAR(8),    /* ALTGRP                        */ 23600000
*    3 ECDM_INFO_SWTO  CHAR(8),     /* SWITCHTO                      */ 23650000
*    3 ECDM_INFO_ROUT  CHAR(16);    /* Routing codes                 */ 23700000
*@SPACE;                                                                23750000
*DCL                                                                    23800000
*  1 ECDM_DSP        BASED,         /* Dataspace status mapping      */ 23850000
*    3 ECDM_DSP_TYPE FIXED(16),     /* Type of block.                   23900000
*                                      Should be ECDM_TYPE_DSP       */ 23950000
*    3 * CHAR(2),                   /* Reserved                      */ 24000000
*    3 ECDM_DSP_SIZE  FIXED(31),    /* Size of the dataspace status     24050000
*                                      mapping                       */ 24100000
*    3 ECDM_DSP_QD   FIXED(31),     /* Queue depth in use            */ 24150000
*    3 ECDM_DSP_QLIM FIXED(31),     /* Queue depth limit             */ 24200000
*    3 ECDM_DSP_ALERTPCT FIXED(8),  /* Alert percentage              */ 24250000
*    3 ECDM_DSP_ERR  BIT(8),        /* Error condition byte          */ 24300000
*      5 ECDM_DSP_CLIM BIT(1),      /*  Queueing stopped by Memory      24350000
*                                       Limit                        */ 24400000
*      5 ECDM_DSP_DLIM BIT(1),      /*  Queueing stopped by Queue       24450000
*                                       Depth Limit                  */ 24500000
*      5 ECDM_DSP_INTR BIT(1),      /*  Queueing stopped by Internal    24550000
*                                       Error                        */ 24600000
*      5 ECDM_DSP_ALRT BIT(1),      /*  Queueing reached Alert          24650000
*                                       Percentage                   */ 24700000
*      5 *             BIT(4),      /*  Reserved                     */ 24750000
*   3 *              CHAR(2);       /* Reserved                      */ 24800000
*@SPACE;                                                                24850000
*DCL                                                                    24900000
*  1 ECDM_MSCP       BASED,         /* EMCS console MSCOPE block     */ 24950000
*    3 ECDM_MSCP_HDR,               /* MSCOPE fixed-size header.        25000000
*                                      Should be ECDM_TYPE_MSCP      */ 25050000
*      5 ECDM_MSCP_TYPE  FIXED(16), /* Type of block                 */ 25100000
*      5 * CHAR(2),                 /* Reserved                      */ 25150000
*      5 ECDM_MSCP_SIZE  FIXED(31), /* Size of this console MSCOPE      25200000
*                                      block                         */ 25250000
*      5 ECDM_MSCP_MNUM  FIXED(31), /* Number of entries in MSCOPE      25300000
*                                      block                         */ 25350000
*    3 ECDM_MSCP_LIST(*) CHAR(8);   /* MSCOPE list                   */ 25400000
*@SPACE;                                                                25450000
*DCL                                                                    25500000
*  1 ECDM_CNSW       BASED,         /* EMCS console CNSWITCH block   */ 25550000
*    3 ECDM_CNSW_HDR,               /* CNSWITCH fixed-size header.      25600000
*                                      Should be ECDM_TYPE_CNSW      */ 25650000
*      5 ECDM_CNSW_TYPE  FIXED(16), /* Type of block                 */ 25700000
*      5 * CHAR(2),                 /* Reserved                      */ 25750000
*      5 ECDM_CNSW_SIZE  FIXED(31), /* Size of this console CNSWITCH    25800000
*                                      block                         */ 25850000
*      5 ECDM_CNSW_MNUM  FIXED(31), /* Number of entries in CNSWITCH    25900000
*                                      block                         */ 25950000
*    3 ECDM_CNSW_LIST(*) CHAR(8);   /* CNSWITCH list                 */ 26000000
*@SPACE;                                                                26050000
*DCL                                                                    26100000
*  ECDM_ACR         CHAR(4)  CONSTANT('ECDM');                          26150000
*                                   /* Eyecatcher                    */ 26200000
*@SPACE;                                                                26250000
*/* Version numbers                                                  */ 26300000
*DCL                                                                    26350000
*  ECDM_VERS1       BIT(32)  CONSTANT('00000001'X),                     26400000
*                                   /* Version number                */ 26450000
*  ECDM_VERID       BIT(32)  CONSTANT(ECDM_VERS1);                      26500000
*                                   /* Current version number        */ 26550000
*@SPACE;                                                                26600000
*/* Sub-block identifiers                                            */ 26650000
*DCL                                                                    26700000
*  ECDM_TYPE_SUMM   FIXED(16) CONSTANT(8),                              26750000
*                                   /* Console SUMM block type       */ 26800000
*  ECDM_TYPE_INFO   FIXED(16) CONSTANT(16),                             26850000
*                                   /* Console INFO block type       */ 26900000
*  ECDM_TYPE_MSCP   FIXED(16) CONSTANT(32),                             26950000
*                                   /* Console MSCOPE block type     */ 27000000
*  ECDM_TYPE_CNSW   FIXED(16) CONSTANT(64),                             27050000
*                                   /* Console CNSWITCH block type   */ 27100000
*  ECDM_TYPE_DSP    FIXED(16) CONSTANT(128);                            27150000
*                                   /* Console dataspace block type  */ 27200000
*@EJECT;                                                                27250000
*/* End of PL/X Source                                               */ 27300000
* %IF IEEZB887_LIST ^= 'NO' &                                           27350000
*    ZCBPRINT ^= 'NO' %THEN                                             27400000
*   %GOTO IEEZB887_4;                                                   27450000
*   @LIST POP NOECHO;                                                   27500000
* %IEEZB887_4:;                                                         27550000
* %END;                                                                 27600000
