*  %GOTO DOTU1;                         /*                              00050000
       MACRO                                                            00100000
       IEFDOTUM                                                         00150000
.*/ %DOTU1: ;                                                           00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/* MODULE NAME = IEFDOTUM                                           */ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME = Dynamic Output Text Unit Mappings             */ 00450000
*/*                                                                  */ 00500000
*/* COPYRIGHT =                                                      */ 00550000
*/*          LICENSED MATERIALS - PROPERTY OF IBM                    */ 00600000
*/*          THIS MODULE IS "RESTRICTED MATERIALS OF IBM"            */ 00650000
*/*          5695-048 (C) COPYRIGHT IBM CORP. 1988, 1990             */ 00700000
*/*          SEE COPYRIGHT INSTRUCTIONS                              */ 00750000
*/*                                                              @L1C*/ 00800000
*/* STATUS = HBB4420                                             @L1C*/ 00900000
*/*                                                                  */ 00950000
*/* FUNCTION = Maps the text units and text unit pointer structures  */ 01000000
*/*            for Dynamic OUTPUT.                                   */ 01050000
*/*                                                                  */ 01100000
*/* MODULE TYPE = Macro                                              */ 01150000
*/*                                                                  */ 01200000
*/* INVOCATION =                                                     */ 01250000
*/*                                                                  */ 01300000
*/*   BAL - IEFDOTUM                                                 */ 01350000
*/*                                                                  */ 01400000
*/*   PLS -  %INCLUDE SYSLIB(IEFDOTUM)                               */ 01450000
*/*                                                                  */ 01500000
*/*                                                                  */ 01550000
*/* NOTES: The text unit keys for Dynamic OUTPUT are defined in      */ 01570000
*/*        the mapping macro IEFDOKEY.                               */ 01590000
*/*                                                                  */ 01610000
*/*        The text unit pointer list and text unit structure is     */ 01630000
*/*        diagramed below. The names of the fields, as declared     */ 01650000
*/*        in the mapping, are in parenthesis.                       */ 01700000
*/*                                                                  */ 01750000
*/*                                                                  */ 01800000
*/*   text unit    ----> +--------------------+                      */ 01850000
*/*   pointer list       |0|Text unit pointer | -> first text unit   */ 01900000
*/*                      | |(DOCNTPTR)        |    (DOCNUNIT)        */ 01950000
*/*                      +--------------------+                      */ 02000000
*/*                      |0|Text unit pointer | -> second text unit  */ 02050000
*/*                      | |(DOCNTPTR)        |    (DOCNUNIT)        */ 02100000
*/*                               ...                                */ 02150000
*/*   1 in high order -> |1|Text unit pointer |-+  last text unit    */ 02200000
*/*   bit indicates      | |(DOCNTPTR)        | |  (DOCNUNIT)        */ 02250000
*/*   last text unit     +--------------------+ |                    */ 02300000
*/*   (DOCNTLT)                                 |                    */ 02350000
*/*                                             |                    */ 02400000
*/* +-------------------------------------------+                    */ 02450000
*/* |                                                                */ 02500000
*/* +----+---------+---------+------+----------+------->             */ 02550000
*/* |key |number of|length   |first |length of |second <             */ 02600000
*/* |    |param-   |of first |param-|second    |param- >...repeated  */ 02650000
*/* |    |eters    |parameter|eter  |parameter |eter   <   length    */ 02700000
*/* +----+---------+---------+------+----------+------->  (DOCNTLEN) */ 02750000
*/* :    :         :         :      :          :           and       */ 02800000
*/* :    :         :         :      (DOCNTLEN) (DOCNTPRM)  parameter */ 02850000
*/* :    :         :         :                            (DOCNTPRM) */ 02900000
*/* :    :         :         (DOCNTPAR)                    fields    */ 02950000
*/* :    :         :                                                 */ 03000000
*/* :    :         (DOCNTLTH)                                        */ 03050000
*/* :    :                                                           */ 03100000
*/* :    (DOCNTNUM)                                                  */ 03150000
*/* :                                                                */ 03200000
*/* (DOCNTKEY)                                                       */ 03250000
*/*                                                                  */ 03300000
*/*                                                                  */ 03350000
*/* CHANGE ACTIVITY = P0,D1,D2                                   @D2C*/ 03400000
*/*                                                                  */ 03450000
*/* $P0=PC20283 JBB2223 870629 PDJY: Dynamic OUTPUT Support          */ 03500000
*/* $D1=DCR0063 JBB2223 880101 PDJY: Dynamic OUTPUT Support      @D1A*/ 03516600
*/* $D2=DCR0318 HBB3310 880118 PDJY: Dynamic OUTPUT Support      @D2A*/ 03533200
*/* $L1=APPC1   HBB4420 890310 PDB3: JOB TAILORING SUPPORT       @L1A*/ 03541600
*/*                                                                  */ 03550000
*/********************************************************************/ 03600000
*/* A 000000-999999                                              @P0A*/ 03650000
*/* D Removed dynamic output from JBB2223                        @D1A*/ 03666600
*/* A Added dynamic output to HBB3310                            @D2A*/ 03683200
*/* A Added level 2 for header section                           @L1A*/ 03691600
*/*                                                                  */ 03700000
*  %GOTO DOTU2;                   /*                                    03750000
*                                                                       03800000
*********************************************************************** 03850000
*  Text unit pointer list mapping                                     * 03900000
*********************************************************************** 03950000
DOCNTLST  DSECT                      Text unit pointer list mapping     04000000
DOCNTPTR  DS  F                      Text unit pointer                  04050000
DOCNTLT   EQU X'80'                  On for the last text unit pointer  04100000
          SPACE                                                         04150000
*********************************************************************** 04200000
*  Text unit mapping                                                  * 04250000
*********************************************************************** 04300000
DOCNUNIT  DSECT                      Text unit mapping                  04350000
DOCNTKEY  DS  XL2                    Key                                04400000
DOCNTNUM  DS  XL2                    Number of length/parameter pairs   04450000
*                                                                       04500000
DOCNTENT  DS  0C                                                        04550000
DOCNTLTH  DS  XL2                    Length of first or only parameter  04600000
DOCNTPAR  DS  C                      First or only parameter            04650000
*********************************************************************** 04700000
*  Mapping of the text unit length/parameter pairs.   The             * 04750000
*  following DSECT is provided for use with text units which have     * 04800000
*  multiple length/parameter pairs.                                   * 04850000
*********************************************************************** 04900000
DOCNTFLD  DSECT                      Mapping for length/parameter pair  04950000
DOCNTLEN  DS  XL2                    Length of parameter                05050000
DOCNTPRM  DS  C                      Parameter                          05100000
          MEND                                                          05150000
.*/ %DOTU2: ;                                                           05200000
*/********************************************************************/ 05250000
*/* Based array mapping of text unit pointer list                    */ 05300000
*/********************************************************************/ 05350000
* DCL                                                                   05400000
*  1 DOCNTLST (*) BASED,           /* Text unit pointer list         */ 05450000
*      2 DOCNTPTR   PTR(31),       /* Text unit pointer              */ 05500000
*        3 DOCNTLT  BIT(1);        /* On for the last text unit ptr  */ 05550000
*/********************************************************************/ 05600000
*/* Mapping of text unit pointer list element                        */ 05650000
*/********************************************************************/ 05700000
* DCL                                                                   05750000
*  1 DOCNTPTE PTR(31) BASED,       /* Text unit pointer element      */ 05800000
*    2 DOCNTEND BIT(1);            /* On when this is the last text     05850000
*                                     unit pointer                   */ 05900000
*/********************************************************************/ 05950000
*/* Text unit mapping                                                */ 06000000
*/********************************************************************/ 06050000
* DCL                                                                   06100000
*  1 DOCNUNIT BASED(DOCNTPTE),        /* Text unit                   */ 06130900
*    2 DOCNTHDR,                      /* Fixed portion of text unit     06161800
*                                                                @L1A*/ 06192700
*      3 DOCNTKEY CHAR(2),            /* Key                     @L1C*/ 06223600
*      3 DOCNTNUM FIXED(15) BDY(BYTE),/* Number of length/parameter     06254500
*                                        pairs                   @L1C*/ 06285400
*    2 DOCNTENT,                      /* Text entry of length/parameter 06316300
*                                        pair                        */ 06347200
*      3 DOCNTLTH FIXED(15) BDY(BYTE),/* Length of 1st or only          06378500
*                                        parameter                   */ 06414200
*      3 DOCNTPAR CHAR(*);            /* First or only parameter     */ 06450000
*/********************************************************************/ 06500000
*/*  Mapping provided for use with multiple length/parameter pairs   */ 06550000
*/********************************************************************/ 06600000
* DCL                                                                   06650000
*  1 DOCNTFLD BASED,               /* Text entry of length/parameter    06687500
*                                     pair                           */ 06725000
*    2 DOCNTLEN FIXED(15) BDY(BYTE),/* Length of following parameter */ 06762500
*    2 DOCNTPRM CHAR(*);           /* Parameter                      */ 06800000
