*  %GOTO ENFPMPRO;               /*                                     00050000
         MACRO                                                          00100000
         IEFENFPM &DSECT=YES                                            00150000
.*/  %ENFPMPRO: ;                                                       00200000
*/**** START OF SPECIFICATIONS ***************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* MACRO NAME = IEFENFPM                                         */ 00350000
*/*                                                                  */ 00400000
*/*01* DESCRIPTIVE NAME = Event Notification Facility Parameter List */ 00450000
*/*                                                                  */ 00500000
*/*02*  ACRONYM = ENFPM                                          @LMM*/ 00531800
*/*                                                                  */ 00563600
*/*01* PROPRIETARY STATEMENT=                                        */ 00595400
*/***PROPRIETARY_STATEMENT********************************************/ 00627200
*/*                                                                  */ 00659000
*/*                                                                  */ 00690800
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00722600
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00754400
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1980, 2000                  @P4C*/ 00802200
*/*                                                                  */ 00850000
*/* STATUS= HBB7703                                              @P4C*/ 00900000
*/*                                                                  */ 00950000
*/***END_OF_PROPRIETARY_STATEMENT********************************@LDC*/ 01000000
*/*                                                                  */ 01050000
*/*01* EXTERNAL CLASSIFICATION:                                  @P3A*/ 01080000
*/*02* DMTI: BASE                                                @P3A*/ 01110000
*/*02* GUPI: INCLUDE                                             @P3A*/ 01140000
*/*01* END OF EXTERNAL CLASSIFICATION                            @P3A*/ 01170000
*/*                                                                  */ 01200000
*/*01* FUNCTION = Maps the ENFREQ parameter list                     */ 01250000
*/*                                                                  */ 01300000
*/*01* NOTES =                                                       */ 01310400
*/*                                                                  */ 01320800
*/*        Bilingual Mapping Macro (PL/S and BAL)                    */ 01331200
*/*                                                                  */ 01341600
*/*          This macro must be included by users of ENFREQ.         */ 01352000
*/*          The fields in the macro are not intended                */ 01362400
*/*          for external use.  The macro is an INCLUDE ONLY macro.  */ 01372800
*/*                                                                  */ 01383200
*/*02*   DEPENDENCIES = When this macro is changed AHAENF must       */ 01393600
*/*                    also be updated.                              */ 01404000
*/*                     This macro must be updated when a new    @LEC*/ 01405100
*/*                    event code is defined.  Also, IEAVNP47    @LEC*/ 01406200
*/*                    must be updated.  If the new event code   @LEC*/ 01407300
*/*                    exceeds the maximum event code, then      @LEA*/ 01408400
*/*                    IEFENFCT must be updated and the          @LEA*/ 01409500
*/*                    following modules must be recompiled:     @LEA*/ 01410600
*/*                           IEFENFDM                           @LEA*/ 01411700
*/*                           IEFENFRM                           @LEA*/ 01412800
*/*                                                                  */ 01414400
*/*02*   RESTRICTIONS = None                                         */ 01424800
*/*                                                                  */ 01435200
*/**** INVOCATION ****************************************************/ 01445600
*/*                                                                  */ 01456000
*/*01* METHOD OF ACCESS =                                            */ 01466400
*/*                                                                  */ 01476800
*/*      PL/S Invocation =                                           */ 01487200
*/*                                                                  */ 01497600
*/*  %DCL ENFPDEF CHAR                                               */ 01508000
*/*  %ENFPDEF = 'value'                                              */ 01518400
*/*                                                                  */ 01528800
*/*  %INCLUDE SYSLIB(IEFENFPM)                                       */ 01539200
*/*                                                                  */ 01550000
*/*    PARAMETER DESCRIPTION =                                       */ 01550400
*/*                                                                  */ 01550800
*/*      PARAMETER = %ENFPDEF                                        */ 01551200
*/*                                                                  */ 01551600
*/*        DESCRIPTION = Allows users to specify if they want        */ 01552000
*/*                     storage allocated or just the mapping        */ 01552400
*/*                     generated.                                   */ 01552800
*/*                                                                  */ 01553200
*/*        TYPE = Keyword                                            */ 01553600
*/*                                                                  */ 01554000
*/*        FORM = Constant                                           */ 01554400
*/*                                                                  */ 01554800
*/*        DEFAULT = BDY(WORD)                                       */ 01555200
*/*                                                                  */ 01555600
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 01556000
*/*                                                                  */ 01556400
*/*------------------------------------------------------------------*/ 01556800
*/*                                                                  */ 01557200
*/*      BAL Invocation =                                            */ 01557600
*/*                                                                  */ 01558000
*/*      name            name: symbol. Begin name in column 1        */ 01558400
*/*  b                   one or more blanks (up to nine)             */ 01558800
*/*  IEFENFPM            should start in column 10                   */ 01559200
*/*  b                   one or more blanks                          */ 01559600
*/*                                                                  */ 01560000
*/*  DSECT=                                                          */ 01560400
*/*                                                                  */ 01560800
*/*    PARAMETER DESCRIPTION =                                       */ 01561200
*/*                                                                  */ 01561600
*/*      PARAMETER = NO                                              */ 01562000
*/*                                                                  */ 01562400
*/*        DESCRIPTION = When DSECT=NO is specified a DSECT card     */ 01562800
*/*                      is not generated.                           */ 01563200
*/*                                                                  */ 01563600
*/*        TYPE = Keyword                                            */ 01564000
*/*                                                                  */ 01564400
*/*        FORM = Constant                                           */ 01564800
*/*                                                                  */ 01565200
*/*        DEFAULT = If not coded or not NO a DSECT card is          */ 01565600
*/*                  not generated                                   */ 01566000
*/*                                                                  */ 01566400
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 01566800
*/*                                                                  */ 01567200
*/********************************************************************/ 01567600
*/*                                                                  */ 01568000
*/*01* DSECT NAME = ENFPM                                            */ 01568400
*/*                                                                  */ 01568800
*/*01* COMPONENT = Event Notification Facility (BB131)               */ 01569200
*/*                                                                  */ 01569600
*/*01* EYE-CATCHER = None                                            */ 01570000
*/*02*  OFFSET = N/A                                                 */ 01570400
*/*02*  LENGTH = N/A                                                 */ 01570800
*/*                                                                  */ 01571200
*/*01* CREATED BY = ENF users                                        */ 01571600
*/*                                                                  */ 01572000
*/*01* POINTED TO BY = N/A                                           */ 01572400
*/*                                                                  */ 01572800
*/*01* DELETED BY = ENF users                                        */ 01573200
*/*                                                                  */ 01573600
*/*01* SERIALIZATION = None                                          */ 01574000
*/*                                                                  */ 01574400
*/*01* STORAGE ATTRIBUTES =                                          */ 01574800
*/*                                                                  */ 01575200
*/*02*   ALLOCATION METHOD = Determined by user                      */ 01575600
*/*02*   SUBPOOL           = Any                                     */ 01576000
*/*02*   KEY               = Any                                     */ 01576400
*/*02*   RESIDENCY         = Any                                     */ 01576800
*/*02*   SIZE              = 104 bytes (decimal)                 @LMC*/ 01577200
*/*02*   FREQUENCY         = 1 per ENF request                       */ 01577600
*/*                                                                  */ 01578500
*/*01* DISTRIBUTION LIBRARY = AMACLIB                                */ 01578600
*/*                                                                  */ 01578800
*/*01* CHANGE ACTIVITY =                                             */ 01603200
*/*                                                                  */ 01627700
*/*  $D2 = DCR#121 JBB1326  800604  PD42 : ADDED EVENT CODE 12 FOR   */ 01650000
*/*                                        DEVICE PENDING OFFLINE    */ 01700000
*/*  $D1 = DCR#1   JBB1326  800604  PD42 : ENFREQ MACRO AND FREE     */ 01750000
*/*                                        SIGNAL PARAMETER LIST     */ 01800000
*/*  $L1 = COEXWTO2 JBB2220 840813  PDD7:  SUPPORT FOR JES3/MCS  @L1A*/ 01850000
*/*                                        COEXISTENCE           @L1A*/ 01900000
*/*  $L2 = SMSSTG2  JBB2223 860324  PDY1:  STOR MGMT SUBSYS STG2 @L2A*/ 01950000
*/*                                        SUPT                  @L2A*/ 02000000
*/*  $D3 = DCR1019  HBB3310 870918  PDT3:  SERVICEABILITY        @D3A*/ 02025000
*/*  $L3 = TSOOP    HBB4410 871102  PDT3:  TSO OPER W/ KANJI     @L3A*/ 02031200
*/*  $L5 = DCR0080  HBB4410 881220  PDKK:  CROSS SYSTEM COUPLING @L5A*/ 02037400
*/*  $L6 = CNITG    HBB4410 881229  PDT4:  LISTENER COUNT        @L6A*/ 02043600
*/*  $L7 = DIOPL    HBB4410 890815  PDH1:  DYNAMIC I/O SUPPORT   @L7A*/ 02046800
*/*  $D4 = DCR0227  HBB4410 891016  PDIB:  QUERY FOR INFORMATION @D4A*/ 02048400
*/*  $T1 = OY27078  HBB4410 900416  PDH1:  OVERLOOK SPE          @T1A*/ 02049200
*/*  $T2 = OY34640          890627  PDDW:  Crypto                @T2A*/ 02049400
*/*  $D5 = DH30042  HBB4420 891109  PDIB:  EVENT CODE 34         @D5A*/ 02049600
*/*  $L8 = SYNCS    HBB4430 910910  PDIB:  Event codes 35-37     @L8A*/ 02049800
*/*  $L9 = ENFEXT   HBB4430 911204  PDIB:  DISABLE keyword       @L9A*/ 02049900
*/*  $P1 = PKB0786  HBB4430 920201  PDIB:  SHOWHDR               @P1A*/ 02054900
*/*  $P2 = PKB2552  HBB4430 920617  PDIB:  Change DISTLIB        @P2A*/ 02057400
*/*  $D6 = DKB0142  HBB4430 920729  PDIB: 10X Defect Elimination @D6A*/ 02058600
*/*  $LA = SYSLK    HBB5510 900112  PDIB:  EVENT CODE 35         @LAA*/ 02058700
*/*  $LB = ENFEN    HBB5510 921203  PDIB:  ENF Enhancements      @LBA*/ 02058800
*/*  $LC = WLMI     HBB5510 921204  PDH1:  EVENT CODEs 41-42     @LCA*/ 02058900
*/*  $D7 = DIG0116  HBB5510 930503  PDIB:  Event code 43         @D7A*/ 02059000
*/*  $P3 = PIG1424  HBB5510 930520  PDIB:  Showhdr               @P3A*/ 02059100
*/*  $D8 = DIG0148  HBB5510 930715  PDIB:  Event code 44         @D8A*/ 02059200
*/*  $D9 = DIG0167  HBB5510 930909  PDCL:  Event code 46         @D9A*/ 02059500
*/*  $LD = SDSHS    HBB5520 931030  PDCL:  Event code 45         @LDA*/ 02059600
*/*  $LE = ARM      HBB5520 931030  PDCL:  Event code 38         @LEA*/ 02059700
*/*  $LF = LOGR     HBB5520 931203  PDCL:  Event code 48         @LFA*/ 02059800
*/*  $LG = LOGRC    HBB5520 940210  PDCL:  Event code 49         @LGA*/ 02061000
*/*  $LH = SERV2E06 HBB5520 940210  PDCL:  Event code 47         @LHA*/ 02062200
*/*  $DA = DN70087  HBB5520 940728  PDBN:  Seastar support-PAVS  @DAA*/ 02062600
*/*  $LI = GRSCS    HBB5520 940728  PDBN:  GRS central server    @LIA*/ 02063000
*/*  $LJ = DYNLLENF JBB6602 941231  PDXB:  LNKLST activation     @LJA*/ 02063200
*/*  $LK = TDUMP    JBB6604 950406  PDBN:  Transaction dumping   @LKA*/ 02063400
*/*  $LL = WLMPENH  HBB6603 950406  PDBN:  SRM frame monitoring  @LLA*/ 02063600
*/*  $LM = GRS32    JBB6602 950921  PDBN:  Sysplex-wide ENF      @LMA*/ 02063800
*/*  $01 = OW21776  HBB5510 960601  PDBN:  ETR status change     @01A*/ 02064100
*/*  $LN = WLMPBAT  JBB6604 961031  PDOH:  Event codes 56-57     @LNA*/ 02064200
*/*  $LO = OPI      HBB6605 970422  PDOH:  Event code 58         @LOA*/ 02064300
*/*  $LP = BOSSR1   HBB6605 970819  PDOH:  Event code 59         @LPA*/ 02064400
*/*  $LQ = TTRACE   JBB6609 981005  PDOH:  Event code 60         @LQA*/ 02064500
*/*  $P4 = PXD0510  HBB7703 991018  PDOH:  FIN APAR OW39364      @P4A*/ 02064600
*/*                                                                  */ 02064700
*/**** END OF SPECIFICATIONS *****************************************/ 02064900
*/*                                                                  */ 02069900
*/* A - 000000-999999                                        @G81FP2M*/ 02075000
*/* A - ADDED EVENT CODES 6 AND 8-11                         @G860P2J*/ 02100000
*/* C - ADD AMODE TO EXITRTN                                 @G860P42*/ 02150000
*/* A - ENFPFKEY,ENFPFSPL,ENFPFLEN ADDED                         @D1A*/ 02200000
*/* A - ADDED EVENT CODE 5, COMM TASK AND TOD INIT COMPLETE  @G38XP2Q*/ 02250000
*/* A - ADDED EVENT CODES 13 AND 14 JES3 AND WTO BUFFER          @L1A*/ 02300000
*/*     UTILIZATION.                                             @L1A*/ 02350000
*/* C - CHANGED THE LOCATION OF THIS MACRO TO SYS1.MACLIB FROM   @L1A*/ 02400000
*/*     SYS1.PVTMACS.                                            @L1A*/ 02450000
*/* A - ADDED EVENT CODES 15 AND 16: STORAGE MANAGEMENT SUBSYS-  @L2A*/ 02500000
*/*     TEM RESOURCE AVAILABILITY CHANGE, AND VOLUME BECOMING    @L2A*/ 02550000
*/*     AVAILABLE.                                               @L2A*/ 02600000
*/* A - ADDED VERSION, RETURN ADDRESS, LIST EXIT ESTABLISHER     @D3A*/ 02633300
*/*     NAME AND LISTEN EXIT NAME FIELDS                         @D3A*/ 02666600
*/* A - ADDED EVENT CODE 17: CONSOLE OR TSO OPERATOR IS          @L3A*/ 02670300
*/*     CHANGING FROM ACTIVE TO INACTIVE STATE.                  @L3A*/ 02674000
*/* A - ADDED EVENT CODE 20: CONSOLE INTERGRATION - AN           @L5A*/ 02677700
*/*     UNSOLICITED INTERRUPT HAS OCCURED                        @L5A*/ 02681400
*/* A - ADDED EVENT CODE 21: X - SYSTEM-IOS SIGNAL TO XCF OF A   @L5A*/ 02685100
*/*     CHANGE TO A DASD MIH INTERVAL.                           @L5A*/ 02688800
*/* A - ADDED THE LISTENER COUNT TO THE END OF THE MAPPING AND   @L6A*/ 02692500
*/*     CHANGED THE VERSION NUMBER TO 2.                         @L6A*/ 02696200
*/* A - ADDED EVENT CODES 23-32.                                 @L7A*/ 02697100
*/* A - ADDED THE CODE RETURNED FROM SPECIAL PROCESSING EXIT     @L7A*/ 02698000
*/*     ALSO DEFINE A CONSTANT FOR THE MAXIMUM NUMBER OF EVENTS  @L7A*/ 02698900
*/* A - ADDED QUERY FOR INFORMATION                              @D4A*/ 02699400
*/* A - ADDED EVENT CODES 33-34.                                 @T1A*/ 02699700
*/* A - Added Event Codes 18, 19 and 22 for Crypto support       @T2A*/ 02699800
*/* A - ADDED EVENT CODE 34 MACHINE CHECK DUE TO SCLP DAMAGE     @D5A*/ 02699900
*/* A - Added event codes 35-37                                  @L8A*/ 02716600
*/* A - Added the new keyword DISABLE to the parameter list.     @L9A*/ 02722100
*/* C - Assigned event code 36 to RTM for FAST support.          @L9A*/ 02727600
*/* C - The prologue to SHOWHDR format.                          @P1A*/ 02730400
*/* C - The DISTLIB to AMACLIB.                                  @P2A*/ 02731800
*/* A - Added event codes 38-40.                                 @D6A*/ 02732500
*/* A - ADDED EVENT CODE 35 CROSS SYSTEM LOCKING SERVICES        @LAA*/ 02732600
*/* A - Added the following support: EOT, EOM, PARM for listeners    */ 02732700
*/*     and SRBEXIT.                                             @LBA*/ 02732800
*/* A - Added Event Codes 41-42 - WLM and SRM Support.           @LCA*/ 02732900
*/* A - Added Event Code 43.                                     @D7A*/ 02733000
*/* C - Showhdr format.                                          @P3A*/ 02733100
*/* A - Added Event Code 44.                                     @D8A*/ 02733200
*/* A - Added Event Code 46.                                     @D9A*/ 02738800
*/* A - Added Event Code 45.                                     @LDA*/ 02741600
*/* A - Added Event Code 38.                                     @LEA*/ 02743000
*/* A - Added Event Code 48.                                     @LFA*/ 02743700
*/* A - Added Event Code 49.                                     @LGA*/ 02743900
*/* A - Added Event Code 47.                                     @LHA*/ 02744100
*/* A - Added Event Code 50.                                     @DAA*/ 02744200
*/* A - Added Event Code 51.                                     @LIA*/ 02744300
*/* A - Added Event Code 52.                                     @LJA*/ 02746200
*/* A - Added Event Code 54.                                     @LKA*/ 02746800
*/* A - Added Event Code 55.                                     @LLA*/ 02747400
*/* A - Added the ENFPXSYS, ENFPBMQ, and ENFPBCMP fields.        @LMA*/ 02747700
*/* A - Added Event Code 53.                                     @01A*/ 02747900
*/* A - Added Event Codes 56-57.                                 @LNA*/ 02748000
*/* A - Added Event Code 58.                                     @LOA*/ 02748600
*/* A - Added Event Code 59.                                     @LPA*/ 02748900
*/* A - Added Event Code 60.                                     @LQA*/ 02749000
*/* A - Added the MASEXIT field.  Used to allow multiple address     */ 02749200
*/*     spaces to use the same LISTEN exit.                      @P4A*/ 02749400
*/********************************************************************/ 02749600
*  %GOTO ENFPMDCL;                                                   /* 02750000
         AIF   ('&DSECT' EQ 'NO').NODSECT                               02800000
         DSECT                                                          02850000
.NODSECT ANOP                                                           02900000
ENFPM    DS    0F                                                       02950000
ENFPLEN  DS    H                   LENGTH OF ENF PARAMETER LIST         03000000
ENFPACT  DS    0H                  REQUESTED ENF ACTION                 03050000
ENFPACT1 DS    CL1                 RESERVED                             03100000
ENFPACT2 DS    CL1                 DEFINITION BYTE                      03150000
ENFPSIG  EQU   X'01'               SIGNAL AN EVENT                      03200000
ENFPLIS  EQU   X'02'               LISTEN FOR AN EVENT                  03250000
ENFPDEL  EQU   X'03'               DELETE A LISTENER                    03300000
ENFPQRY  EQU   X'04'               QUERY FOR INFORMATION           @D4A 03325000
ENFPCODE DS    XL4                 EVENT CODE (RIGHT JUSTIFIED)         03350000
ENFPC001 EQU   1                   VARY DEVICE ONLINE                   03400000
ENFPC002 EQU   2                   VARY DEVICE OFFLINE                  03450000
ENFPC003 EQU   3                   VOLUME UNLOAD                        03500000
ENFPC004 EQU   4                   FREE SQA                             03550000
ENFPC005 EQU   5                   COMM TASK AND TOD INIT      @G38XP2Q 03600000
*                                  COMPLETE                    @G38XP2Q 03650000
ENFPC006 EQU   6                   SRM - STATUS CHANGE IN      @G860P2J 03700000
*                                  CHANNEL MEASURMENT BLOCK    @G860P2J 03750000
*                                  DATA COLLECTOR              @G860P2J 03800000
ENFPC007 EQU   7                   RESERVED                    @G860P2J 03850000
ENFPC008 EQU   8                   PATH STATE CHANGE           @G860P2J 03900000
ENFPC009 EQU   9                   CHANNEL PATH STATE CHANGE   @G860P2J 03950000
ENFPC010 EQU   10                  DDR SWAP                    @G860P2J 04000000
ENFPC011 EQU   11                  FAILURE OF CHANNEL          @G860P2J 04050000
*                                  MONITORING FACILITY         @G860P2J 04100000
ENFPC012 EQU   12                  DEVICE PENDING OFFLINE          @D2A 04150000
ENFPC013 EQU   13                  WTO BUFFER UTILIZATION          @L1A 04200000
ENFPC014 EQU   14                  JES3 BUFFER UTILIZATION         @L1A 04250000
ENFPC015 EQU   15                  STORAGE MANAGEMENT SUBSYSTEM    @L2A 04300000
*                                  RESOURCE AVAILABILITY CHANGE    @L2A 04350000
ENFPC016 EQU   16                  VOLUME BECOMING AVAILABLE       @L2A 04400000
ENFPC017 EQU   17                  CONSOLE OR TSO OPERATOR HAS     @L3A 04408300
*                                  CHANGED FROM THE ACTIVE TO      @L3A 04416600
*                                  INACTIVE STATE                  @L3A 04424900
ENFPC018 EQU   18                  RECONFIGURATION ISSUED TO       @T2A 04426200
*                                  NOTIFY Crypto WHEN A CPU        @T2A 04427500
*                                  COMES ONLINE OR GOES OFFLINE.   @T2A 04428800
ENFPC019 EQU   19                  SIGNALS CRYPTOGRAPHY FEATURE    @T2A 04430100
*                                  AVAILABLE                       @T2A 04431400
ENFPC020 EQU   20                  UNSOLICITED SIGNAL INTERRUPT    @L5A 04433200
ENFPC021 EQU   21                  CHANGE TO DASD MIH INTERVAL     @L5A 04441500
ENFPC022 EQU   22                  SIGNALS CRYPTOGRAPHY FEATURE    @T2A 04441600
*                                  OFFLINE                         @T2A 04441700
ENFPC023 EQU   23                  VARY DEVICE ONLINE              @L7A 04441800
*                                  (DYNAMIC I/O)                   @L7A 04442100
ENFPC024 EQU   24                  VARY DEVICE OFFLINE             @L7A 04442400
*                                  (DYNAMIC I/O)                   @L7A 04442700
ENFPC025 EQU   25                  VOLUME UNLOAD (DYANMIC I/O)     @L7A 04443000
ENFPC026 EQU   26                  CHANGE IN DEVICE STATE          @L7A 04443300
*                                  (DYNAMIC I/O)                   @L7A 04443600
ENFPC027 EQU   27                  PATH STATE CHANGE (DYNAMIC I/O) @L7A 04443900
ENFPC028 EQU   28                  DDR SWAP (DYNAMIC I/O)          @L7A 04444200
ENFPC029 EQU   29                  DEVICE PENDING OFFLINE          @L7A 04444500
*                                  (DYNAMIC I/O)                   @L7A 04444800
ENFPC030 EQU   30                  VOLUME BECOMING AVAILABLE       @L7A 04445100
*                                  (DYNAMIC I/O)                   @L7A 04445400
ENFPC031 EQU   31                  SYNCHRONOUS SIGNAL TO PROCESS   @L7A 04445700
*                                  CONFIGURATION CHANGE BLOCK      @L7A 04446000
*                                  (DYNAMIC I/O)                   @L7A 04446300
ENFPC032 EQU   32                  SYNCHRONOUS SIGNAL TO INDICATE  @L7A 04446600
*                                  CONFIGURATION CHANGE IS         @L7A 04446900
*                                  COMPLETE (DYNAMIC I/O)          @L7A 04447200
ENFPC033 EQU   33                  DEVICE STATE CHANGE             @T1A 04447300
ENFPC034 EQU   34                  MACHINE CHECK DUE TO SCLP DAMAGE@D5A 04447400
ENFPC035 EQU   35                  Cross system locking services   @LAA 04447500
ENFPC036 EQU   36                  Symptom string written          @L9C 04447800
*                                  to a LOGREC data set or         @LGC 04448000
*                                  LOGREC log stream               @LGA 04448200
ENFPC037 EQU   37                  SMF INTERVAL SYNC SUPPORT       @L8A 04448400
ENFPC038 EQU   38                  An ARM Event Occurred           @LEA 04448500
ENFPC039 EQU   39                  Reserved                        @D6A 04448600
ENFPC040 EQU   40                  JES initiation or termination   @D6A 04448700
ENFPC041 EQU   41                  A WLM Event Occurred            @LCA 04448800
ENFPC042 EQU   42                  A SRM Event Occurred            @LCA 04448900
ENFPC043 EQU   43                  New sampling data is available  @D7A 04449000
ENFPC044 EQU   44                  Subchannel CRW is received      @D8A 04449100
ENFPC045 EQU   45                  SMSVSAM server is operational   @LDA 04449200
ENFPC046 EQU   46                  A significant OMVS event has         04449300
*                                  occurred                        @D9A 04449400
ENFPC047 EQU   47                  DAE dumping threshold met for a      04450900
*                                  given incident in the last detection 04452400
*                                  interval                        @LHA 04453900
ENFPC048 EQU   48                  A system logger event has occurred   04455700
*                                                                  @LFA 04462000
ENFPC049 EQU   49                  Logrec output recording medium was   04464100
*                                  changed via SETLOGRC command    @LGA 04466200
ENFPC050 EQU   50                  Parallel access volume capacity     +04466700
                                     state change                  @DAA 04467200
ENFPC051 EQU   51                  A GRS event has occurred        @LIA 04469300
ENFPC052 EQU   52                  LNKLST activation               @LJA 04471400
ENFPC053 EQU   53                  External time reference state       +04472000
                                     change                        @01A 04472600
ENFPC054 EQU   54                  An SDUMP event has occurred     @LKA 04473300
ENFPC055 EQU   55                  An SRM event has occurred       @LLA 04475200
ENFPC056 EQU   56                  Issued during RESET job and QUIESCE  04475400
*                                  job commands to tell JES about       04475600
*                                  service class changes for batch      04475800
*                                  jobs in execution               @LNA 04476000
ENFPC057 EQU   57                  Issued by WLM when a WLM known       04476200
*                                  abstract resource changes state @LNA 04476400
ENFPC058 EQU   58                  Issued by JES when a sysout          04476600
*                                  data set changes state          @LOA 04476800
ENFPC059 EQU   59                  Issued by BOSS for synchronizing     04477400
*                                  the sysplex wide view of the         04478000
*                                  Active Server Respository       @LPA 04478600
ENFPC060 EQU   60                  Issued by Transaction Trace     @LQA 04478900
*                                  ******************************* @L7A 04479200
ENFPCMAX EQU   60                  High Water Mark,                @LQC 04480000
*                                  Maximum Number of Events        @T1A 04480900
*                                  ******************************* @L7A 04487200
ENFPFLG  DS    XL1                 FLAG FIELD                           04493500
ENFPASN  EQU   X'80'               ASYNCHRONOUS REQUEST                 04500000
ENFPDISA EQU   X'40'               Disable keyword                 @L9A 04516600
ENFPDISO EQU   X'20'               Disable keyword operational     @L9A 04533200
ENFPXSYS EQU   X'10'               Signal request - set if signal      +04536000
                                     is to be sent to other systems.   +04538800
                                     Listen request - set if           +04541600
                                     listener will accept signals      +04544400
                                     from foreign systems.         @LMC 04547200
ENFPFREE EQU   X'08'               FREE SIGNAL PARAMETER LIST      @D1C 04550000
ENFPEOT  EQU   X'04'               EOT support requested           @LBA 04562500
ENFPEOM  EQU   X'02'               EOM support requested           @LBA 04575000
ENFPSRBE EQU   X'01'               SRBEXIT specified               @LBA 04587500
ENFPQMSK DS    XL1                 MASK FOR COMPARING QUALIFIERS        04600000
ENFPQMS1 EQU   X'08'               COMPARE CHARACTER 1                  04650000
ENFPQMS2 EQU   X'04'               COMPARE CHARACTER 2                  04700000
ENFPQMS3 EQU   X'02'               COMPARE CHARACTER 3                  04750000
ENFPQMS4 EQU   X'01'               COMPARE CHARACTER 4                  04800000
ENFPFATT DS    0H                  FREEMAIN ATTRIBUTES             @D1C 04850000
ENFPFKEY DS    XL1                 KEY FOR FREEMAIN AREA           @D1A 04900000
ENFPFSPL DS    XL1                 SUBPOOL FOR FREEMAIN AREA       @D1A 04950000
ENFPQUAL DS    XL4                 QUALIFIER                            05000000
ENFPEADR DS    F                   LISTEN: LISTENER'S EXIT ROUTINE ADDR 05050000
*                                  If ENFPSRBE is on then the listen    05062500
*                                  exit will run in the listener's      05075000
*                                  address space as SRB.           @LBC 05087500
*                                  SIGNAL: SIGNALER'S EXIT ROUTINE ADDR 05100000
ENFPSPRM DS    F                   ADDRESS OF SIGNALER'S or listener's  05133300
*                                  parameters                      @LBC 05166600
ENFPTOK  DS    F                   LISTEN: TOKEN OF LISTENER'S ELEMENT  05200000
*                                  SIGNAL: ADDRESS OF ORIGINAL EPL      05250000
ENFPFLEN DS    F                   LENGTH OF AREA TO BE FREED      @D1A 05300000
ENFPVERS DS    H                   PARAMETER LIST VERSION          @D3A 05307100
ENFPRESV DS    H                   RESERVED                        @D3A 05314200
ENFPR14C DS    A                   ADDRESS OF CALLER OF ENF        @D3A 05321300
ENFPLNME DS    CL8                 NAME OF ESTABLISHER OF LISTEN   @D3A 05328400
*                                  EXIT                            @D3A 05335500
ENFPXNME DS    CL8                 NAME OF LISTEN EXIT ROUTINE     @D3A 05342600
ENFPLSNM DS    F                   LISTENER COUNT (RETURNED)       @L6A 05345000
*                                  ONLY FOR SYNCHRONOUS REQUESTS   @L6A 05347400
ENFPCRET DS    CL4                 SPECIAL PROCESSING CODE         @L7A 05348200
*                                  RETURNED FROM EXIT              @L7A 05349000
ENFPBMQ  DS    XL32                Bit-mapped qualifier            @LMA 05351800
ENFPFLG2 DS    XL1                 Additional flags                @LMA 05354600
ENFPBQMK EQU   B'00011111'         Value to AND into ENFPFLG2          +05357400
                                   to clear the high-order 3 bits      +05360200
                                   that represent the comparison       +05363000
                                   to be performed on the bit-         +05365800
                                   mapped qualifier                @LMA 05368600
ENFPBQSB EQU   B'00000000'         Value to OR into ENFPFLG2           +05371400
                                   to indicate BITCOMPARE=SUBSET   @LMA 05374200
ENFPBQIN EQU   B'00100000'         Value to OR into ENFPFLG2           +05377000
                                   to indicate                         +05379800
                                   BITCOMPARE=INTERSECT            @LMA 05382600
ENFPBQEQ EQU   B'01000000'         Value to OR into ENFPFLG2           +05385400
                                   to indicate BITCOMPARE=EQUAL    @LMA 05388200
ENFPMASE EQU   B'00010000'         MASEXIT support requested       @P4A 05389600
         DS    CL7                 Reserved                        @LMA 05391000
ENFPLLEN EQU   *-ENFPM             ASSEMBLER LENGTH OF PARAMETER LIST   05393800
ENFPVRSN EQU   3                   Current version number          @LMA 05396600
         MEND   ,                                                    */ 05400000
*  %ENFPMDCL:  ;                                                        05450000
*@SPACE (3);                                                            05500000
*/* ENF ACTION TYPES (ENFPACT)                                       */ 05550000
*  DECLARE ENFPSIG FIXED(8) CONSTANT(1),    /* SIGNAL AN EVENT       */ 05600000
*          ENFPLIS FIXED(8) CONSTANT(2),    /* LISTEN FOR AN EVENT   */ 05650000
*          ENFPDEL FIXED(8) CONSTANT(3),    /* DELETE A LISTENER     */ 05700000
*          ENFPQRY FIXED(8) CONSTANT(4);    /* QUERY FOR INFORMATION    05750000
*                                                                @D4A*/ 05800000
*@SPACE (3);                                                            05850000
*/* ENF EVENT CODES  (ENFPCODE)                                      */ 05900000
*  DECLARE ENFPC001 FIXED(31) CONSTANT(1),  /* VARY DEVICE ONLINE    */ 05950000
*          ENFPC002 FIXED(31) CONSTANT(2),  /* VARY DEVICE OFFLINE   */ 06000000
*          ENFPC003 FIXED(31) CONSTANT(3),  /* VOLUME UNLOAD         */ 06050000
*          ENFPC004 FIXED(31) CONSTANT(4),  /* FREE SQA              */ 06100000
*          ENFPC005 FIXED(31) CONSTANT(5),  /* COMM TASK AND TOD INIT   06150000
*                                              COMPLETE      @G38XP2Q*/ 06200000
*          ENFPC006 FIXED(31) CONSTANT(6),  /* SRM - STATUS CHANGE IN   06250000
*                                              CHANNEL MEASURMENT BLOCK 06300000
*                                              DATA COLLECTOR           06350000
*                                                            @G860P2J*/ 06400000
*          ENFPC007 FIXED(31) CONSTANT(7),  /* RESERVED      @G860P2J*/ 06450000
*          ENFPC008 FIXED(31) CONSTANT(8),  /* PATH STATE CHANGE        06500000
*                                                            @G860P2J*/ 06550000
*          ENFPC009 FIXED(31) CONSTANT(9),  /* CHANNEL PATH STATE       06600000
*                                              CHANGE        @G860P2J*/ 06650000
*          ENFPC010 FIXED(31) CONSTANT(10), /* DDR SWAP      @G860P2J*/ 06700000
*          ENFPC011 FIXED(31) CONSTANT(11), /* FAILURE OF CHANNEL       06750000
*                                              MONITORING FACILITY      06800000
*                                                            @G860P2J*/ 06850000
*          ENFPC012 FIXED(31) CONSTANT(12), /* DEVICE PENDING OFFLINE   06900000
*                                                                @D2A*/ 06950000
*          ENFPC013 FIXED(31) CONSTANT(13), /* WTO BUFFER UTILIZATION   07000000
*                                                                @L1A*/ 07050000
*          ENFPC014 FIXED(31) CONSTANT(14), /* JES3 BUFFER UTILIZATION  07100000
*                                                                @L1A*/ 07150000
*          ENFPC015 FIXED(31) CONSTANT(15), /* STORAGE MANAGEMENT SUB-  07200000
*                                              SYSTEM RESOURCE AVAIL-   07250000
*                                              ABILITY CHANGE    @L2A*/ 07300000
*          ENFPC016 FIXED(31) CONSTANT(16), /* VOLUME BECOMING          07350000
*                                              AVAILABLE         @L2A*/ 07400000
*          ENFPC017 FIXED(31) CONSTANT(17), /* CONSOLE OR TSO OPERATOR  07450000
*                                              HAS CHANGED FROM THE     07500000
*                                              ACTIVE TO INACTIVE       07550000
*                                              STATE             @L3A*/ 07600000
*          ENFPC018 FIXED(31) CONSTANT(18), /* RECONFIGURATION ISSUED   07650000
*                                              TO NOTIFY PENQUIN WHEN   07700000
*                                              A CPU COMES ONLINE OR    07750000
*                                              GOES OFFLINE.     @T2A*/ 07800000
*          ENFPC019 FIXED(31) CONSTANT(19), /* SIGNALS CRYPTOGRAPHY     07850000
*                                              FEATURE AVAILABLE.@T2A*/ 07900000
*          ENFPC020 FIXED(31) CONSTANT(20), /* UNSOLICITED SIGNAL       07950000
*                                              INTERRUPT         @L5A*/ 08000000
*          ENFPC021 FIXED(31) CONSTANT(21), /* CHANGE TO DASD MIH       08050000
*                                              INTERVAL          @L5A*/ 08100000
*          ENFPC022 FIXED(31) CONSTANT(22), /* SIGNALS CRYPTOGRAPHY     08150000
*                                              OFFLINE.          @T2A*/ 08200000
*          ENFPC023 FIXED(31) CONSTANT(23), /* VARY DEVICE ONLINE       08250000
*                                              (DYNAMIC I/O)     @L7A*/ 08300000
*          ENFPC024 FIXED(31) CONSTANT(24), /* VARY DEVICE OFFLINE      08350000
*                                              (DYNAMIC I/O)     @L7A*/ 08400000
*          ENFPC025 FIXED(31) CONSTANT(25), /* VOLUME UNLOAD            08450000
*                                              (DYNAMIC I/O)     @L7A*/ 08500000
*          ENFPC026 FIXED(31) CONSTANT(26), /* CHANGE IN DEVICE STATE   08550000
*                                              (DYNAMIC I/O)     @L7A*/ 08600000
*          ENFPC027 FIXED(31) CONSTANT(27), /* PATH STATE CHANGE        08650000
*                                              (DYNAMIC I/O)     @L7A*/ 08700000
*          ENFPC028 FIXED(31) CONSTANT(28), /* DDR SWAP                 08750000
*                                              (DYNAMIC I/O)     @L7A*/ 08800000
*          ENFPC029 FIXED(31) CONSTANT(29), /* DEVICE PENDING OFFLINE   08850000
*                                              (DYNAMIC I/O)     @L7A*/ 08900000
*          ENFPC030 FIXED(31) CONSTANT(30), /* VOLUME BECOMING          08950000
*                                              AVAILABLE (DYNAMIC I/O)  09000000
*                                                                @L7A*/ 09050000
*          ENFPC031 FIXED(31) CONSTANT(31), /* SYNCHRONOUS SIGNAL TO    09100000
*                                              PROCESS CONFIGURATION    09150000
*                                              CHANGE BLOCK             09200000
*                                              (DYNAMIC I/O)     @L7A*/ 09250000
*          ENFPC032 FIXED(31) CONSTANT(32), /* SYNCHRONOUS SIGNAL TO    09300000
*                                              INDICATE CONFIGURATION   09350000
*                                              CHANGE IS COMPLETE       09400000
*                                              (DYNAMIC I/O)     @L7A*/ 09450000
*          ENFPC033 FIXED(31) CONSTANT(33), /* DEVICE STATE CHANGE      09500000
*                                                                @T1A*/ 09550000
*          ENFPC034 FIXED(31) CONSTANT(34), /* MACHINE CHECK DUE TO     09600000
*                                              SCLP DAMAGE       @D5A*/ 09650000
*          ENFPC035 FIXED(31) CONSTANT(35), /* Cross system locking     09700000
*                                              services          @LAA*/ 09750000
*          ENFPC036 FIXED(31) CONSTANT(36), /* Symptom string written   09800000
*                                              to a LOGREC data set or  09850000
*                                              LOGREC log stream @LGC*/ 09900000
*          ENFPC037 FIXED(31) CONSTANT(37), /* SMF INTERVAL SYNC        09950000
*                                              SUPPORT           @L8A*/ 10000000
*          ENFPC038 FIXED(31) CONSTANT(38), /* An ARM Event             10050000
*                                              occurred          @LEC*/ 10100000
*          ENFPC039 FIXED(31) CONSTANT(39), /* Reserved          @D6A*/ 10150000
*          ENFPC040 FIXED(31) CONSTANT(40), /* JES initiation or        10200000
*                                              termination       @D6A*/ 10250000
*          ENFPC041 FIXED(31) CONSTANT(41), /* A WLM Event Occurred     10300000
*                                                                @LCA*/ 10350000
*          ENFPC042 FIXED(31) CONSTANT(42), /* A SRM Event Occurred     10400000
*                                                                @LCA*/ 10450000
*          ENFPC043 FIXED(31) CONSTANT(43), /* New sampling data is     10500000
*                                              available         @D7A*/ 10550000
*          ENFPC044 FIXED(31) CONSTANT(44), /* Subchannel CRW is        10600000
*                                              received          @D8A*/ 10650000
*          ENFPC045 FIXED(31) CONSTANT(45), /* SMSVSAM server is        10700000
*                                              operational       @LDA*/ 10750000
*          ENFPC046 FIXED(31) CONSTANT(46), /* A significant OMVS       10800000
*                                             event has occurred @LFC*/ 10850000
*          ENFPC047 FIXED(31) CONSTANT(47), /* DAE dumping threshold    10900000
*                                             met for incident in last  10950000
*                                             detection interval @LHA*/ 11000000
*          ENFPC048 FIXED(31) CONSTANT(48), /* A system logger event    11050000
*                                             has occurred       @LGC*/ 11100000
*          ENFPC049 FIXED(31) CONSTANT(49), /* Logrec output recording  11150000
*                                             medium was changed via    11200000
*                                             SETLOGRC command   @DAC*/ 11250000
*          ENFPC050 FIXED(31) CONSTANT(50), /* Parallel access volume   11300000
*                                             capacity state            11350000
*                                             change             @LIC*/ 11400000
*          ENFPC051 FIXED(31) CONSTANT(51), /* A GRS event has          11450000
*                                             occurred           @LIA*/ 11500000
*          ENFPC052 FIXED(31) CONSTANT(52), /* LNKLST activation @LJA*/ 11550000
*          ENFPC053 FIXED(31) CONSTANT(53), /* External time reference  11566600
*                                             state change       @01A*/ 11583200
*          ENFPC054 FIXED(31) CONSTANT(54), /* An SDUMP event has       11600000
*                                             occurred           @LKA*/ 11650000
*          ENFPC055 FIXED(31) CONSTANT(55), /* An SRM event has         11700000
*                                             occurred           @LLA*/ 11750000
*          ENFPC056 FIXED(31) CONSTANT(56), /* Issued during RESET      11755000
*                                             job and QUIESCE job       11760000
*                                             commands to tell JES      11765000
*                                             about service class       11770000
*                                             changes for batch jobs    11775000
*                                             in execution       @LNA*/ 11780000
*          ENFPC057 FIXED(31) CONSTANT(57), /* Issued by WLM when a WLM 11785000
*                                             known abstract resource   11790000
*                                             changes state      @LNA*/ 11795000
*          ENFPC058 FIXED(31) CONSTANT(58), /* Issued by JES when a     11796200
*                                             sysout data set           11797400
*                                             changes state      @LOA*/ 11798600
*          ENFPC059 FIXED(31) CONSTANT(59), /* Issued by BOSS for       11798800
*                                             synchronizing the syplex  11799000
*                                             wide view of the Active   11799200
*                                             Server Respository @LPA*/ 11799400
*          ENFPC060 FIXED(31) CONSTANT(60); /* Issued by Transaction    11799600
*                                             Trace              @LQA*/ 11799800
*                                           /******************* @L7A*/ 11800000
*  DECLARE ENFPCMAX FIXED(31) CONSTANT(60); /* HIGH WATER MARK, MAX. #  11850000
*                                              OF EVENTS         @LQC*/ 11900000
*                                           /******************* @L7A*/ 11950000
*@SPACE (3);                                                            12000000
*%IF ENFPDEF = '' %THEN                                                 12050000
*  %ENFPDEF = 'BDY(WORD)';       /* DEFAULT THE PARM LIST TO WORD    */ 12100000
*  DECLARE                                                              12150000
*  1 ENFPM  ENFPDEF,                                                    12200000
*    2 ENFPLEN  FIXED(15),       /* LENGTH OF ENF PARAMETER LIST     */ 12250000
*    2 ENFPACT  FIXED(15),       /* REQUESTED ENF ACTION             */ 12300000
*      3 ENFPACT1 FIXED(8),      /* RESERVED                         */ 12350000
*      3 ENFPACT2 FIXED(8),      /* DEFINITION BYTE                  */ 12400000
*    2 ENFPCODE CHAR(4),         /* HEXADECIMAL EVENT CODE              12450000
*                                   (RIGHT JUSTIFIED)                */ 12500000
*    2 ENFPFLG  BIT(8),          /* FLAG FIELD                       */ 12550000
*      3 ENFPASN  BIT(1),        /* ASYNCHRONOUS REQUEST             */ 12600000
*      3 ENFPDISA BIT(1),        /* Disable keyword              @L9A*/ 12650000
*      3 ENFPDISO BIT(1),        /* Disable keyword operational  @L9A*/ 12700000
*      3 ENFPXSYS BIT(1),        /* Signal request - set if signal      12750000
*                                   is to be sent to other systems.     12800000
*                                   Listen request - set if             12850000
*                                   listener will accept signals        12900000
*                                   from foreign systems.        @LMC*/ 12950000
*      3 ENFPFREE BIT(1),        /* FREE SIGNALLER PARM LIST     @D1A*/ 13000000
*      3 ENFPEOT  BIT(1),        /* EOT support requested        @LBA*/ 13050000
*      3 ENFPEOM  BIT(1),        /* EOM support requested        @LBA*/ 13100000
*      3 ENFPSRBE BIT(1),        /* SRBEXIT specified            @LBA*/ 13150000
*    2 ENFPQMSK BIT(8),          /* MASK FOR COMPARING QUALIFIERS    */ 13200000
*      3 *        BIT(4),        /* RESERVED                         */ 13250000
*      3 ENFPQMS1 BIT(1),        /* COMPARE CHARACTER 1              */ 13300000
*      3 ENFPQMS2 BIT(1),        /* COMPARE CHARACTER 2              */ 13350000
*      3 ENFPQMS3 BIT(1),        /* COMPARE CHARACTER 3              */ 13400000
*      3 ENFPQMS4 BIT(1),        /* COMPARE CHARACTER 4              */ 13450000
*    2 ENFPFATT FIXED(16),       /* FREEMAIN ATRRIBUTES          @D1C*/ 13500000
*      3 ENFPFKEY FIXED(8),      /* KEY OF AREA TO BE FREED      @D1A*/ 13550000
*      3 ENFPFSPL FIXED(8),      /* SUBPOOL OF AREA              @D1A*/ 13600000
*    2 ENFPQUAL CHAR(4),         /* QUALIFIER                        */ 13650000
*    2 ENFPEADR PTR(31),         /* LISTEN : Listener's exit routine.   13700000
*                                   If ENFPSRBE is on then the listen   13750000
*                                   exit will run in the listener's     13800000
*                                   address space as SRB.               13850000
*                                   SIGNAL : SIGNALER'S EXIT ROUTINE    13900000
*                                                                @LBC*/ 13950000
*      3 * BIT(1),               /* AMODE OF EXIT ROUTINE    @G860P42*/ 14000000
*      3 * BIT(31),              /* ADDRESS OF EXIT ROUTINE  @G860P42*/ 14050000
*    2 ENFPSPRM PTR(31),         /* Address of signaller's or           14100000
*                                   listener's parameters        @LBC*/ 14150000
*    2 ENFPTOK  CHAR(4),         /* LISTEN: TOKEN OF LISTENER'S         14200000
*                                        ELEMENT.                       14250000
*                                   SIGNAL: ADDRESS OF ORIGINAL         14300000
*                                        EPL.                        */ 14350000
*    2 ENFPFLEN FIXED(31),       /* LENGTH OF FREEPRM AREA       @D3C*/ 14400000
*    2 ENFPVERS FIXED(15),       /* PARAMETER LIST VERSION       @D3A*/ 14450000
*    2 ENFPRESV FIXED(15),       /* RESERVED                     @D3A*/ 14500000
*    2 ENFPR14C PTR(31),         /* ADDRESS OF CALLER OF ENF     @D3A*/ 14550000
*    2 ENFPLNME CHAR(8),         /* NAME OF ESTABLISHER OF LISTEN       14600000
*                                   EXIT                         @D3A*/ 14650000
*    2 ENFPXNME CHAR(8),         /* NAME OF LISTEN EXIT ROUTINE  @L6C*/ 14700000
*    2 ENFPLSNM FIXED(31),       /* LISTENER COUNT (RETURNED)           14750000
*                                   ONLY FOR SYNCHRONOUS REQUESTS       14800000
*                                                                @L7C*/ 14850000
*    2 ENFPCRET CHAR(4),            /* SPECIAL PROCESSING CODE RETURNED 14900000
*                                      FROM EXIT                 @L7A*/ 14950000
*    2 ENFPBMQ  CHAR(32),        /* Bit-mapped qualifier         @LMA*/ 15000000
*    2 ENFPFLG2 BIT(8),          /* Additional flags             @LMA*/ 15050000
*      3 ENFPBCMP BIT(3),        /* Bit-string used to indicate         15100000
*                                   type of comparison to be            15150000
*                                   performed on bit-mapped             15200000
*                                   qualifier                    @LMA*/ 15250000
*      3 ENFPMASE BIT(1),        /* MASEXIT support requested    @P4A*/ 15283300
*      3 *        BIT(4),        /* Reserved                     @P4C*/ 15316600
*    2 *        CHAR(7);         /* Reserved                     @LMA*/ 15350000
*                                                                       15400000
*DCL ENFPVRSN FIXED(15) CONSTANT(3); /* VERSION FIELD            @LMC*/ 15450000
*DCL EXITRTN ENTRY BASED(ENFPEADR) VALUERANGE(*) OPTIONS(AMODE(*)); /*  15500000
*                                       FOR USER                 @L1C*/ 15550000
*DCL ENFPBQSB BIT(3) CONSTANT('000'B);  /* Value of ENFPBCMP            15600000
*                                   indicating BITCOMPARE=SUBSET @LMA*/ 15650000
*DCL ENFPBQIN BIT(3) CONSTANT('001'B);  /* Value of ENFPBCMP            15700000
*                                   indicating                          15750000
*                                   BITCOMPARE=INTERSECT         @LMA*/ 15800000
*DCL ENFPBQEQ BIT(3) CONSTANT('010'B);  /* Value of ENFPBCMP            15850000
*                                   indicating BITCOMPARE=EQUAL  @LMA*/ 15900000
