*        % GOTO FPTPRO;   /*                                            00010000
         MACRO                                                          00020000
         IEFINFPT                                                       00030000
.*/      %FPTPRO: ;                                                     00040000
*/* START OF SPECIFICATIONS ******************************************/ 00041000
*/*                                                                  */ 00160000
*/* MODULE NAME = IEFINFPT                                           */ 00170000
*/*                                                                  */ 00180000
*/* DESCRIPTIVE NAME = Initiator Footprint Area                      */ 00190000
*/*                                                                  */ 00200000
*/*01* PROPRIETARY STATEMENT=                                        */ 00200100
*/***PROPRIETARY_STATEMENT********************************************/ 00200200
*/*                                                                  */ 00200300
*/*                                                                  */ 00200400
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00200500
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00200600
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1990, 1993                      */ 00200700
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00200800
*/*                                                                  */ 00200900
*/* STATUS= HBB5510                                                  */ 00201000
*/*                                                                  */ 00201100
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00201200
*/*                                                                  */ 00201300
*/* MODULE TYPE = Bilingual macro                                    */ 00221000
*/*                                                                  */ 00222000
*/* FUNCTION = Maps the structure of the initiator footprint area    */ 00223000
*/*                                                                  */ 00224000
*/* ACRONYM:  INITFPNT                                               */ 00225000
*/*                                                                  */ 00226000
*/* MACRO NAME:  IEFINFPT                                            */ 00227000
*/*                                                                  */ 00228000
*/* DSECT NAME:  FPFPNT                                              */ 00229000
*/*                                                                  */ 00229100
*/* EYE-CATCHER:  INITFPNT                                           */ 00229200
*/*  OFFSET:   0                                                     */ 00229300
*/*  LENGTH:   8                                                     */ 00229400
*/*                                                                  */ 00229500
*/* SIZE = 64 bytes                                                  */ 00229600
*/*                                                                  */ 00229700
*/* NOTES =                                                          */ 00230000
*/*         The initiator footprint is divided into three areas.     */ 00240000
*/*         1) The footprint header contians the constant            */ 00250000
*/*            'INITFPNT' to aid in identifying and locating the     */ 00260000
*/*            initiator footprint area in dumps.                    */ 00270000
*/*         2) The main module flow bits trace the initiator's       */ 00280000
*/*            internal calls.  As each step is started the bits     */ 00290000
*/*            covering the step loop are reset to X'00's.  As each  */ 00300000
*/*            new job is started the bits covering the job and      */ 00310000
*/*            step loops are reset.  When a module is executed it   */ 00320000
*/*            sets the appropriate entry and exit bits in this      */ 00330000
*/*            area.                                                 */ 00340000
*/*         3) Each initiator module has an area in the footprint    */ 00350000
*/*            to trace the resources affected by that module and    */ 00360000
*/*            any external calls.  Upon entry, a module will clear  */ 00370000
*/*            it's module bits before tracing the current call.     */ 00380000
*/*            Since most initiator modules can be called many times */ 00390000
*/*            during the life of an initiator, the bits recorded    */ 00400000
*/*            for a particular module may be from execution of a    */ 00410000
*/*            previous job or step.  The main module flow bits      */ 00420000
*/*            should first be used to determine the current module  */ 00430000
*/*            execution path.  Only the modules in that path will   */ 00440000
*/*            have module bit areas that are current.               */ 00450000
*/*                                                                  */ 00460000
*/*   DEPENDENCIES = none                                            */ 00470000
*/*                                                                  */ 00480000
*/*   RESTRICTIONS = This data area is accessed in 24 bit mode and   */ 00490000
*/*                  must be loaded below the line.  The total       */ 00500000
*/*                  length of the structure can not exceed 256      */ 00510000
*/*                  bytes due to the method used to clear the       */ 00520000
*/*                  structure at initialization.                    */ 00530000
*/*                                                                  */ 00540000
*/********************************************************************/ 00550000
*/*                                                                  */ 00560000
*/* METHOD OF ACCESS =                                               */ 00570000
*/*                                                                  */ 00580000
*/*   PL/S - %INCLUDE SYSLIB(IEFINFPT)                               */ 00590000
*/*   PLAS - %INCLUDE SYSLIB(IEFINFPT)                               */ 00600000
*/*   ASM  - IEFINFPT (dsect version)                                */ 00610000
*/*                                                                  */ 00620000
*/* PARAMETER DESCRIPTION = none                                     */ 00630000
*/*                                                                  */ 00640000
*/********************************************************************/ 00650000
*/*                                                                  */ 00660000
*/* CREATED BY = IEFSD160                                            */ 00670000
*/*                                                                  */ 00680000
*/* POINTED TO BY = LCTFPNT in the LCT                               */ 00690000
*/*                                                                  */ 00700000
*/* DELETED BY = IEFSD161                                            */ 00710000
*/*                                                                  */ 00720000
*/* FREQUENCY = Once per initiator                                   */ 00721000
*/*                                                                  */ 00722000
*/* STORAGE ATTRIBUTES =                                             */ 00730000
*/*                                                                  */ 00740000
*/*   ALLOCATION METHOD = GETMAIN in module IEFSD160                 */ 00750000
*/*   SUBPOOL           = SWA subpool (JSCBSWSP from TCBJSCB)        */ 00760000
*/*   KEY               = 1                                          */ 00770000
*/*   RESIDENCY         = Below 16 MB in virtual storage             */ 00780000
*/*                                                                  */ 00810000
*/* SERIALIZATION = none                                             */ 00820000
*/*                                                                  */ 00830000
*/* COMPONENT = Initiator (SC1B6)                                    */ 00840000
*/*                                                                  */ 00850000
*/* DISTRIBUTION LIBRARY = APVTMACS                                  */ 00860000
*/*                                                                  */ 00870000
*/*                                                                  */ 00880000
*/* CHANGE ACTIVITY =                                                */ 00890000
*/*                                                                  */ 00901000
*/* $L0= SERVC    HBB4410 880111 PDB2: INITIATOR FOOTPRINTING    @L0A*/ 00910000
*/* $L1= SERVC    HBB4410 880411 PDB2: INITIATOR RAS             @L1A*/ 00920000
*/* $01= OY37085  HBB4410 901207 PDCC: Conditional JCL           @01A*/ 00930000
*/* $P1= PH30213  HBB4420 890909 PDCC: Transaction Initiator     @P1A*/ 00940000
*/* $D1= DH30070  HBB4420 900122 PDB3: INITID SYSEVENT           @D1A*/ 00950000
*/* $02= OY41490  HBB4410 910315 PDM1: IEFSD101 calls IEFSD102   @02A*/ 00960000
*/* $L2= APPC1    JBB4422 910510 PDH1: APPC Asynch call          @L2A*/ 00970000
*/* $03= OY44863  HBB4420 910723 PDBG: Second INITID SYSEVENT    @03A*/ 00980000
*/* $04= OY44344  HBB4410 910722 PDM1: Define bits for IEFINSWD  @04A*/ 00981000
*/* $05= OY47692  HBB4410 910930 PDBG: Remove OY41490 footprints @05A*/ 00981100
*/* $L3= POSIX    HBB4430 910731 PDCC: OPEN/MVS Support          @L3A*/ 00981200
*/* $L3= POSIX    HBB4430 910731 PDCC: SHOWHDR format complete   @L3A*/ 00981300
*/* $L4= POSIX    HBB4430 911028 PDCC: OPEN/MVS Support          @L4A*/ 00981400
*/* $L5= TCSAU    HBB4430 911104 PDBG: VSM support & SWA cleanup @L5A*/ 00981500
*/* $L6= POSIX    HBB4430 920108 PDBG: OPEN/MVS Support          @L6A*/ 00981600
*/* $D2= DKB0042  HBB4430 920318 PDBG: OPEN/MVS Support          @D2A*/ 00981601
*/* $P2= PKB0545  HBB4430 920429 PDBG: 10X Defect Elimination    @P2A*/ 00981700
*/* $D3= DCR0083  HBB5510 930517 PDBG: WLM support               @D3A*/ 00981800
*/*                                                                  */ 00990000
*/********************************************************************/ 01000000
*/* END OF SPECIFICATIONS ********************************************/ 01001000
*/*                                                                  */ 01010000
*/* A - 000000-999999                                            @L0A*/ 01020000
*/* C - Changed macro to match changes introduced by the             */ 01030000
*/*     Initiator RAS line item in SP410                         @L1A*/ 01040000
*/* C - Changed macro to match changes introduced by the             */ 01050000
*/*     Conditional JCL line item in SP410                       @01A*/ 01060000
*/* C - Changed macro to match changes introduced by APPC1       @P1A*/ 01070000
*/* A - Added footprints for SYSEVENT INITID in IEFSD160         @D1A*/ 01080000
*/* C - Defined footprints for entry & exit to IEFSD102 within       */ 01090000
*/*     IEFSD101.                                                @02A*/ 01100000
*/* A - Added footprints for call to ATBAMR1 in IEFSD164         @L2A*/ 01110000
*/* C - Changed names of footprints for first SYSEVENT               */ 01120000
*/*     INITID in IEFSD160.                                      @03A*/ 01130000
*/* A - Added footprints for second SYSEVENT INITID in IEFSD160  @03A*/ 01140000
*/* C - Defined footprints for entry & exit to IEFINSWD, and bits    */ 01141000
*/*     for internal processing within IEFINSWD.                 @04A*/ 01142000
*/* C - The footprints introduced for OY41490 were removed because   */ 01142100
*/*     IEFSD102 already contains footprints for entry and exit. @05A*/ 01142200
*/* D - Deleted footprints from IEFSD263 that moved to IEFINWTE  @L3A*/ 01142300
*/* A - Added footprints for IEFINWTE                            @L3A*/ 01142400
*/* C - Redefined footprint as FPWEOPEN, since OPEN/MVS can      @L4A*/ 01142500
*/*     request more than one function.                          @L4A*/ 01142600
*/* C - Removed footprints within IEFSD162 defined by OY37085    @L4A*/ 01142700
*/* A - Added footprints for invocations of IEFINSWD in modules      */ 01142800
*/*     IEFSD161, IEFSD166, IEFIB600 and IEFIB645.               @L5A*/ 01150000
*/* A - Added footprints for VSM invocation/return in modules        */ 01150100
*/*     IEFINSWD and IEFIB600.                                   @L5A*/ 01150200
*/* D - Removed footprints that were made superfluous as a result    */ 01151000
*/*     of the invocation of IEFINSWD in modules IEFSD161,           */ 01152000
*/*     IEFSD166, IEFIB600 and IEFIB645.                         @L5A*/ 01153000
*/* D - Removed SWA Manager invocation footprints from IEFSD161. @L5A*/ 01153100
*/* A - Added extra storage for footprints.                      @L5A*/ 01154000
*/* A - Added footprints for new module IEFINSTR.                @L6A*/ 01154100
*/* D - Removed ATBAMR1 invocation footprints from IEFSD164.     @L6A*/ 01154200
*/* A - Added footprints for IEFINSTR invocation/return in       @D2A*/ 01154300
*/*     modules IEFSD162 and IEFSD164.                           @D2A*/ 01154400
*/* A - Added footprints in the following modules:               @P2A*/ 01154500
*/*      IEFSD101 for IEFPPSCN invocation/return                 @P2A*/ 01154600
*/*      IEFSD161 for IEFPPSCN invocation/return,                @P2A*/ 01154800
*/*               and for ENQ & DEQ                              @P2A*/ 01154900
*/*      IEFSD166 for RACROUTE invocation/return                 @P2A*/ 01155100
*/*      IEFSD263 for GVRGN routine invocation/return            @P2A*/ 01155200
*/*      IEFIB600 for IEFSSREQ                                   @P2A*/ 01156000
*/*      IEFIB605 for IEFXBTDS invocation/return                 @P2A*/ 01156100
*/*      IEFIB621 for 2nd INITDET SYSEVENT                       @P2A*/ 01156500
*/* D - Deleted footprints from the following modules:           @P2A*/ 01157000
*/*      IEFIB605 for SWAREQ call                                @P2A*/ 01158000
*/*      IEFICATL for SWAREQ call and one of the IEFAB4F5 fp's.  @P2A*/ 01158500
*/* D - Deleted FP03PTY footprint for IEFSD103 because it no     @D3A*/ 01159000
*/*     longer sets the priority.                                @D3A*/ 01159100
*/*                                                                  */ 01159500
*/********************************************************************/ 01160000
*        % GOTO FPTBSL;   /*                                            01170000
FPFPNT   DSECT                                                          01180000
         DS    0F                                                       01190000
FPNAME   DS    CL8                     FOOTPRINT HEADER                 01200000
*                                       'INITFPNT'                      01210000
FPINIT   DS    0XL1                    INITIATOR BITS                   01220000
FPINITB1 DS    XL1                                                      01230000
FP160E   EQU    X'80'                   IEFSD160 ENTERED                01240000
FP160X   EQU    X'40'                   IEFSD160 EXITED                 01250000
*        EQU    *                       6 UNUSED                        01260000
*                                                                       01270000
FPJOB    DS    0XL4                    JOB BITS                    @L5C 01280000
FPJOBB1  DS    XL1                                                      01290000
FP161E   EQU    X'80'                   IEFSD161 ENTERED                01300000
FP161X   EQU    X'40'                   IEFSD161 EXITED                 01310000
FPTBLE   EQU    X'20'                   IEFDSTBL ENTERED                01320000
FPTBLX   EQU    X'10'                   IEFDSTBL EXITED                 01330000
FPLSTE   EQU    X'08'                   IEFDSLST ENTERED                01340000
FPLSTX   EQU    X'04'                   IEFDSLST EXITED                 01350000
FP166E   EQU    X'02'                   IEFSD166 ENTERED                01360000
FP166X   EQU    X'01'                   IEFSD166 EXITED                 01370000
FPJOBB2  DS    XL1                                                      01380000
FP620E   EQU    X'80'                   IEFIB620 ENTERED                01390000
FP620X   EQU    X'40'                   IEFIB620 EXITED                 01400000
FP621E   EQU    X'20'                   IEFIB621 ENTERED                01410000
FP621X   EQU    X'10'                   IEFIB621 EXITED                 01420000
FP922E   EQU    X'08'                   IEFI922B ENTERED                01430000
FP922X   EQU    X'04'                   IEFI922B EXITED                 01440000
*        EQU    *                       2 UNUSED                        01450000
FPJOBB3  DS    XL1                                                      01460000
FP600E   EQU    X'80'                   IEFIB600 ENTERED                01470000
FP600X   EQU    X'40'                   IEFIB600 EXITED                 01480000
FP605E   EQU    X'20'                   IEFIB605 ENTERED                01490000
FP605X   EQU    X'10'                   IEFIB605 EXITED                 01500000
FP645E   EQU    X'08'                   IEFIB645 ENTERED                01510000
FP645X   EQU    X'04'                   IEFIB645 EXITED                 01520000
*        EQU    *                       2 UNUSED                        01530000
FPJOBB4  DS    XL1                                                 @L5A 01531000
*        EQU    *                       8 unused                   @L5A 01532000
*                                                                       01540000
FPSTEP   DS    0XL3                    JOB STEP BITS               @L3C 01550000
FPSTEPB1 DS    XL1                                                      01560000
FP101E   EQU    X'80'                   IEFSD101 ENTERED                01570000
FP101X   EQU    X'40'                   IEFSD101 EXITED                 01580000
FP102E   EQU    X'20'                   IEFSD102 ENTERED                01590000
FP102X   EQU    X'10'                   IEFSD102 EXITED                 01600000
FP162E   EQU    X'08'                   IEFSD162 ENTERED                01610000
FP162X   EQU    X'04'                   IEFSD162 EXITED                 01620000
FPCATE   EQU    X'02'                   IEFICATL ENTERED                01630000
FPCATX   EQU    X'01'                   IEFICATL EXITED                 01640000
FPSTEPB2 DS    XL1                                                      01650000
FP103E   EQU    X'80'                   IEFSD103 ENTERED                01660000
FP103X   EQU    X'40'                   IEFSD103 EXITED                 01670000
FP263E   EQU    X'20'                   IEFSD263 ENTERED                01680000
FP263X   EQU    X'10'                   IEFSD263 EXITED                 01690000
FP164E   EQU    X'08'                   IEFSD164 ENTERED                01700000
FP164X   EQU    X'04'                   IEFSD164 EXITED                 01710000
FPCNDE   EQU    X'02'                   IEFINCND Entered           @01A 01720000
FPCNDX   EQU    X'01'                   IEFINCND Exited            @01A 01730000
FPSTEPB3 DS    XL1                                                 @L3A 01731000
FPWTEE   EQU    X'80'                   IEFINWTE Entered           @L3A 01731100
FPWTEX   EQU    X'40'                   IEFINWTE Exited            @L3A 01731200
FPSTRE   EQU    X'20'                   IEFINSTR Entered           @L6A 01731210
FPSTRX   EQU    X'10'                   IEFINSTR Exited            @L6A 01731220
*        EQU    *                       4 unused                   @L6C 01740000
*                                                                       01750000
*                                                                       01750100
FP160    DS    0XL2                    IEFSD160 FOOTPRINT BITS     @L5C 01770000
FP160B1  DS    XL1                                                      01780000
FP60LCT  EQU    X'80'                   LCT INITIALIZED                 01790000
FP60STA  EQU    X'40'                   ESTAE ESTABLISHED               01800000
FP60EVT  EQU    X'20'                   MEMORY FOR SYSEVENTS PARM LIST  01810000
FP60ID1E EQU    X'10'                   SRM called (INITID),       @03C 01820000
*                                       Initiator starting         @03A 01830000
FP60ID1X EQU    X'08'                   SRM returned,              @03C 01840000
*                                       Initiator starting         @03A 01850000
FP60ID2E EQU    X'04'                   SRM called (INITID),       @03A 01860000
*                                       Initiator terminating      @03A 01870000
FP60ID2X EQU    X'02'                   SRM returned,              @03A 01880000
*                                       Initiator terminating      @03A 01890000
*        EQU    *                       1 unused                   @L5C 01900000
FP160B2  DS    XL1                                                 @L5A 01901000
*        EQU    *                       8 unused                   @L5A 01902000
*                                                                       01910000
*                                                                       01920000
FP161    DS    0XL5                    IEFSD161 FOOTPRINT BITS     @L5C 01930000
FP161B1  DS    XL1                                                      01940000
*                                       STOP REQUESTED                  01950000
FP61SSO  EQU    X'80'                   -STOP SSOB FREED                01960000
FP61STA  EQU    X'40'                   -ESTAE CANCELED                 01970000
FP61TS1E EQU    X'20'                   TP SELECT SSREQ CALLED     @P1A 01980000
FP61TS1X EQU    X'10'                   TP SELECT SSREQ RETURNED   @P1A 01990000
FP61RQ1E EQU    X'08'                   SSREQ CALLED (SELECT)           02000000
FP61RQ1X EQU    X'04'                   SSREQ RETURNED                  02010000
FP61SEL  EQU    X'02'                   JOB SELECTED                    02020000
FP61ERR  EQU    X'01'                   ERROR FROM JOB SELECT           02030000
FP161B2  DS    XL1                                                      02040000
FP61TIM  EQU    X'80'                   JOB SELECT TIME SAVED           02080000
FP61SRME EQU    X'40'                   SRM CALLED (JOB SELECT)         02120000
FP61SRMX EQU    X'20'                   SRM RETURNED                    02130000
FP61WRM  EQU    X'10'                   WARM START REQUESTED            02140000
FP61PSCE EQU    X'08'                   IEFPPSCN invoked           @P2A 02141000
FP61PSCX EQU    X'04'                   IEFPPSCN returned          @P2A 02142000
*                                       2 unused                   @P2C 02144000
FP161B3  DS    XL1                                                      02150000
FP61KEY  EQU    X'80'                   PROTECT KEY ASSIGNED            02160000
FP61NKY  EQU    X'40'                   PROTECT KEY UNAVAILABLE         02170000
FP61CPUE EQU    X'20'                   IEFICPUA CALLED                 02180000
FP61CPUX EQU    X'10'                   IEFICPUA RETUNED                02190000
FP61AFF  EQU    X'08'                   CPU AFFINITY 1ST STEP           02200000
FP61NAF  EQU    X'04'                   CPU AFFINITY UNAVAILABLE        02210000
FP61MS1E EQU    X'02'                   IEFIMASK CALLED                 02220000
FP61MS1X EQU    X'01'                   IEFIMASK RETURNED               02230000
FP161B4  DS    XL1                                                      02240000
FP61MS2E EQU    X'80'                   IEFIMASK CALLED                 02250000
FP61MS2X EQU    X'40'                   IEFIMASK RETURNED               02260000
*                                       JOB RENEQ RTN CALLED            02270000
FP61RQ2E EQU    X'20'                   -SSREQ CALLED                   02280000
FP61RQ2X EQU    X'10'                   -SSREQ RETURNED                 02300000
FP61SWDE EQU    X'08'                   IEFINSWD called            @L5C 02310000
FP61SWDX EQU    X'04'                   IEFINSWD returned          @L5C 02330000
FP61ENQ  EQU    X'02'                   Protect key resource ENQd  @P2A 02340000
FP61DEQ  EQU    X'01'                   Protect key resource DEQd  @P2C 02370000
FP161B5  DS    XL1                                                 @L5A 02371000
*        EQU    *                       8 unused                   @L5A 02372000
*                                                                       02380000
*                                                                       02390000
FPTBL    DS    0XL4                    IEFDSTBL FOOTPRINT BITS          02400000
FPTBLB1  DS    XL1                                                      02410000
FPTBTRE  EQU    X'80'                   GOT FIRST TREE SEGMENT          02420000
*        EQU    *                       7 UNUSED                        02430000
FPTBSWAB DS    XL1                      INDICATORS PER SWA BLOCK        02440000
FPTBSRE  EQU    X'80'                     SWAREQ READ ENTERED           02450000
FPTBSRX  EQU    X'40'                     SWAREQ READ RETURNED          02460000
*        EQU    *                       6 UNUSED                        02470000
FPTBDSN  DS    XL1                      INDICATORS/DSNQ ENTRY           02480000
FPTBSRLE EQU    X'80'                    SWAREQ READ TO UPDATE          02490000
*                                        (SWA BLOCK ENTERED)            02500000
FPTBSRLX EQU    X'40'                   SWAREQ READ TO UPDATE           02510000
*                                        (SWA BLOCK RETURNED)           02520000
FPTBSWLE EQU    X'20'                   SWAREQ WRITE FOR UPDATED        02530000
*                                        (SWA BLOCK ENTERED)            02540000
FPTBSWLX EQU    X'10'                   SWAREQ WRITE FOR UPDATED        02550000
*                                        (SWA BLOCK RETURNED)           02560000
FPTBTRES EQU    X'08'                   GOT ANOTHER TREE SEGMEMT        02570000
*        EQU    *                       3 UNUSED                        02580000
FPTBSWAR DS    XL1                      SWAREQ READ/WRITE FLAGS         02590000
*                                        AT END OF MODULE               02600000
FPTBSRRE EQU    X'80'                     SWAREQ READ ENTERED           02610000
FPTBSRRX EQU    X'40'                     SWAREQ READ RETURNED          02620000
FPTBSRWE EQU    X'20'                     SWAREQ WRITE ENTERED          02630000
FPTBSRWX EQU    X'10'                     SWAREQ WRITE RETURNED         02640000
*        EQU    *                       4 UNUSED                        02650000
*                                                                       02660000
*                                                                       02670000
FPLST    DS    0XL1                    IEFDSLST FOOTPRINT BIT           02680000
FPLSTB1  DS    XL1                                                      02690000
FPLSEQB  EQU    X'80'                   DSENQ PARM LIST BUILT           02700000
FPLSTRF  EQU    X'40'                   DSNAME TREE FREED               02710000
*        EQU    *                       6 UNUSED                        02720000
*                                                                       02730000
*                                                                       02740000
FP166    DS    0XL3                    IEFSD166 FOOTPRINT BITS          02750000
FP166B1  DS    XL1                                                      02760000
FP66KEY  EQU    X'80'                   PROTECT KEY RELEASED            02770000
FP66RAC  EQU    X'40'                   RAC ENVIRONMENT DELETED         02780000
FP66TRM  EQU    X'20'                   GOT TERMINATION SSOB            02790000
FP66REN  EQU    X'10'                   GOT RE-ENQUE SSOB               02800000
FP66SSRE EQU    X'08'                   SSREQ CALLED                    02810000
*                                         ( TERM OR RE-ENQUEUE)         02820000
FP66SSRX EQU    X'04'                   SSREQ RETURNED                  02830000
FP66SSO  EQU    X'02'                   FUNCT SSOB HEADER FREED         02840000
*        EQU    *                       1 unused                   @L5C 02850000
FP166B2  DS    XL1                                                      02860000
FP66TSTE EQU    X'80'                   TRANSACTION TERMINATE      @L5M 02870000
*                                       SSREQ CALLED               @L5M 02880000
FP66TSTX EQU    X'40'                   TRANSACTION TERMINATE      @L5M 02890000
*                                       SSREQ RETURNED             @L5M 02891000
FP66TERE EQU    X'20'                   ILRJTERM CALLED                 02900000
FP66TERX EQU    X'10'                   ILRJTERM RETURNED               02910000
FP66EVTE EQU    X'08'                   SYSEVENT CALLED                 02920000
FP66EVTX EQU    X'04'                   SYSEVENT RETURNED               02930000
FP66SWDE EQU    X'02'                   IEFINSWD called            @L5C 02931000
FP66SWDX EQU    X'01'                   IEFINSWD returned          @L5C 02932000
FP166B3  DS    XL1                                                      02960000
FP66RCRE EQU    X'80'                   RACROUTE invoked           @P2A 02970000
FP66RCRX EQU    X'40'                   RACROUTE returned          @P2A 02980000
*        EQU    *                       6 unused                   @P2C 03010000
*                                                                       03020000
*                                                                       03030000
FP620    DS    0XL2                    IEFIB620 FOOTPRINT BITS     @L5C 03040000
FP620B1  DS    XL1                                                      03050000
FP20DET  EQU    X'80'                   DAUGHTER TASK DETACH            03060000
FP20DEQ  EQU    X'40'                   DEQ RESOURCES                   03070000
FP20RTC  EQU    X'20'                   RETURN CODE SET                 03080000
FP20RET  EQU    X'10'                   RETRY                           03090000
FP20NOR  EQU    X'08'                   NO RETRY                        03100000
*        EQU    *                       3 UNUSED                        03110000
FP620B2  DS    XL1                                                 @L5A 03111000
*        EQU    *                       8 unused                   @L5A 03112000
*                                                                       03120000
*                                                                       03130000
FP621    DS    0XL3                    IEFIB621 FOOTPRINT BITS          03140000
FP621B1  DS    XL1                                                      03150000
FP21ALN  EQU    X'80'                   ALLOCATION NOT COMPLETE         03160000
FP21SW1E EQU    X'40'                   SWA MANAGER CALLED              03170000
*                                         (LOCATE SCT)                  03180000
FP21SW1X EQU    X'20'                   SWA MANAGER RETURNED            03190000
FP21ALC  EQU    X'10'                   ALLOCATION COMPLETED            03200000
FP21GWTF EQU    X'08'                   -GWT FREED                      03210000
FP21EV1E EQU    X'04'                   -SYSEVENT CALLED                03220000
*                                         (INITATT)                     03230000
FP21EV1X EQU    X'02'                   -SYSEVENT RETURNED              03240000
FP21EV2E EQU    X'01'                   -SYSEVENT CALLED                03250000
*                                         (INITDET)                     03260000
FP621B2  DS    XL1                                                      03270000
FP21EV2X EQU    X'80'                   -SYSEVENT RETURNED              03280000
*                                         (INITDET)                     03290000
FP21SDW  EQU    X'40'                   SDWA FREED                      03300000
FP21EV3E EQU    X'20'                   SYSEVENT CALLED                 03310000
*                                         (INITATT)                     03320000
FP21EV3X EQU    X'10'                   SYSEVENT RETURNED               03330000
FP21RG1E EQU    X'08'                   GET REGION CALLED               03340000
*                                         (INITDET)                     03350000
FP21RG1X EQU    X'04'                   GET REGION RETURNED             03360000
FP21EV4E EQU    X'02'                   SYSEVENT CALLED                 03370000
FP21EV4X EQU    X'01'                   SYSEVENT RETURNED               03380000
FP621B3  DS    XL1                                                      03390000
FP21RG2E EQU    X'80'                   GET REGION CALLED               03400000
FP21RG2X EQU    X'40'                   GET REGION RETURNED             03410000
FP21TIM  EQU    X'20'                   TIMING FIELDS CLEARED           03420000
FP21EV5E EQU    X'10'                   SYSEVENT called            @P2A 03421000
*                                        (2nd INITDET)             @P2A 03422000
FP21EV5X EQU    X'08'                   SYSEVENT returned          @P2A 03423000
*        EQU    *                       3 UNUSED                   @P2C 03430000
*                                                                       03440000
*                                                                       03450000
FP600    DS    0XL5                    IEFIB600 FOOTPRINT BITS     @L5C 03460000
FP600B1  DS    XL1                                                      03470000
*                                     MAINLINE:                         03480000
FP00STA  EQU    X'80'                   ESTAE ESTABLISHED               03490000
FP00JSC  EQU    X'40'                   JSCB CHAINED                    03500000
FP00NEL  EQU    X'20'                   NEL INITAILIZED                 03510000
FP00AINE EQU    X'10'                   ALT INTERPRETER CALLED          03520000
FP00AINX EQU    X'08'                   ALT INTERPRETER RETURNED        03530000
FP00INTE EQU    X'04'                   INTERPRETER CALLED              03540000
FP00INTX EQU    X'02'                   INTERPRETER RETURNED            03550000
FP00NEF  EQU    X'01'                   NEL FREED                       03560000
FP600B2  DS    XL1                                                      03570000
FP00RF1E EQU    X'80'                   RACF CALLED                     03620000
*                                         (DELETE ACCESSOR ENV)         03630000
FP00RF1X EQU    X'40'                   RACF RETURNED                   03640000
FP00RF2E EQU    X'20'                   RACF CALLED                     03650000
*                                         (CREATE ACCESSOR ENV)         03660000
FP00RF2X EQU    X'10'                   RACF RETURNED                   03670000
FP00CSC  EQU    X'08'                   CSCB BUILT                      03680000
FP00EST  EQU    X'04'                   ESTAE CLEARED                   03690000
*        EQU    *                       2 unused                   @L5A 03692000
FP600B3  DS    XL1                                                      03700200
FP00SD1E EQU    X'80'                   IEFINSWD linked, error     @L5A 03701000
*                                         freeing NEL or in        @L5A 03701100
*                                         GETWORK routine          @L5A 03701200
FP00SD1X EQU    X'40'                   IEFINSWD returned, error   @L5A 03702000
*                                         freeing NEL or in        @L5A 03702100
*                                         GETWORK routine          @L5A 03702200
FP00SD2E EQU    X'20'                   IEFINSWD linked,           @L5A 03703000
*                                         RACF error               @L5A 03703100
FP00SD2X EQU    X'10'                   IEFINSWD returned,         @L5A 03704000
*                                         RACF error               @L5A 03704100
FP00SD3E EQU    X'08'                   IEFINSWD linked,           @L5A 03705000
*                                         error in reconstruction  @L5A 03705100
FP00SD3X EQU    X'04'                   IEFINSWD returned,         @L5A 03706000
*                                         error in reconstruction  @L5A 03707000
FP00VSME EQU    X'02'                   VSM invoked                @L5A 03710200
FP00VSMX EQU    X'01'                   VSM returned               @L5A 03710300
FP600B4  DS    XL1                                                 @L5A 03710400
FP00SMSE EQU    X'80'                   IEFSSREQ invoked           @P2A 03710500
*                                        (DFSMS IDAX)              @P2A 03710600
FP00SMSX EQU    X'40'                   IEFSSREQ returned          @P2A 03710700
*        EQU    *                       6 unused                   @P2C 03710900
*                                                                       03711000
FP600B5  DS    XL1                                                 @L5C 03720000
*                                                                11@L5D 03810000
*        EQU    *                       8 UNUSED                   @L5C 03840000
*                                                                       03850000
*                                                                       03860000
FP605    DS    0XL1                    IEFIB605 FOOTPRINT BITS          03870000
FP605B1  DS    XL1                                                      03880000
FP05601E EQU    X'80'                   IEFXB601 CALLED                 03890000
FP05601X EQU    X'40'                   IEFXB601 RETURNED               03900000
FP05609E EQU    X'20'                   IEFXB609 CALLED                 03910000
FP05609X EQU    X'10'                   IEFXB609 RETURNED               03920000
FP05TDSE EQU    X'08'                   IEFXBTDS called            @P2C 03940000
FP05TDSX EQU    X'04'                   IEFXBTDS returned          @P2C 03940100
*        EQU    *                       2 unused                   @P2C 03960000
*                                                                       03970000
*                                                                       03980000
FP645    DS    0XL1                    IEFIB645 FOOTPRINT BITS          03990000
FP645B1  DS    XL1                                                      04000000
FP45NEL  EQU    X'80'                   NEL FREED                       04010000
FP45SWDE EQU    X'40'                   IEFINSWD linked            @L5C 04020000
FP45SWDX EQU    X'20'                   IEFINSWD returned          @L5C 04040000
FP45LST  EQU    X'10'                   ESTAE LIST FREED                04041000
*        EQU    *                       4 unused                   @L5C 04070000
*                                                                       04080000
*                                                                       04090000
FP101    DS    0XL2                    IEFSD101 FOOTPRINT BITS          04100000
FP101B1  DS    XL1                                                      04110000
FP01SMFE EQU    X'80'                   SMF CALLED                      04120000
FP01SMFX EQU    X'40'                   SMF RETURNED                    04130000
FP01PPC  EQU    X'20'                   PPT FLAGS CLEARED               04140000
FP01CPUE EQU    X'10'                   IEFICPUA CALLED                 04150000
FP01CPUX EQU    X'08'                   IEFICPUA RETURNED               04160000
FP01MSKE EQU    X'04'                   IEFIMASK CALLED                 04170000
FP01MSKX EQU    X'02'                   IEFIMASK RETURNED               04180000
FP01RST  EQU    X'01'                   CKPT/RESTART DETECTED           04190000
FP101B2  DS    XL1                                                      04200000
FP01PPT  EQU    X'80'                   PPT FLAGS SET                   04210000
FP01PSCE EQU    X'40'                   IEFPPSCN invoked           @P2C 04210100
FP01PSCX EQU    X'20'                   IEFPPSCN returned          @P2A 04210200
*        EQU    *                       5 UNUSED                   @P2C 04240000
*                                                                       04250000
*                                                                       04260000
FP102    DS    0XL2                    IEFSD102 FOOTPRINT BITS     @L5C 04270000
FP102B1  DS    XL1                                                      04280000
FP02ELJ  EQU    X'80'                   DSENQ LIST FREED                04290000
*                                         (JOB FAILED)                  04300000
FP02ENQE EQU    X'40'                   ENQUEUE CALLED                  04310000
FP02ENQX EQU    X'20'                   ENQUEUE RETURNED                04320000
FP02ENF  EQU    X'10'                   ENQ FAILED                      04330000
FP02ELF  EQU    X'08'                   DSENQ LIST FREED                04340000
FP02WDS  EQU    X'04'                   WAITING ON DATA SETS            04350000
FP02CNL  EQU    X'02'                   CANCELED WHILE WAITING          04360000
*        EQU    *                       1 UNUSED                        04370000
FP102B2  DS    XL1                                                 @L5A 04371000
*        EQU    *                       8 unused                   @L5A 04372000
*                                                                       04380000
*                                                                       04390000
FP162    DS    0XL5                    IEFSD162 FOOTPRINT BITS     @L5C 04400000
FP162B1  DS    XL1                                                      04410000
FP62TIM  EQU    X'80'                   STEP TIME CALCULATED            04420000
FP62SW1E EQU    X'40'                   SWA MANAGER CALLED              04430000
*                                         (READ SIOT)                   04440000
FP62SW1X EQU    X'20'                   SWA MANAGER EXITED              04450000
FP62SSIE EQU    X'10'                   SSI CALLED (STEP INIT)          04460000
FP62SSIX EQU    X'08'                   SSI RETURNED                    04470000
FP62604E EQU    X'04'                   IEFXB604 CALLED                 04480000
FP62604X EQU    X'02'                   IEFXB604 RETURNED               04490000
FP62W21E EQU    X'01'                   IEFW21SD CALLED (ALLOC)         04500000
FP162B2  DS    XL1                                                      04510000
FP62W21X EQU    X'80'                   IEFW21SD RETURNED               04520000
FP62501E EQU    X'40'                   IEFXB501 CALLED (JRNL)          04530000
FP62501X EQU    X'20'                   IEFXB501 RETURNED               04540000
FP62ALF  EQU    X'10'                   ALLOC FAIL OR BYPASS            04550000
FP62RST  EQU    X'08'                   RESTART PARMS SET               04560000
FP62SW2E EQU    X'04'                   SWA MANAGER CALLED              04570000
*                                         (READ SCTX)              @L1C 04580000
FP62SW2X EQU    X'02'                   SWA MANAGER RETURNED            04590000
FP62SW3E EQU    X'01'                   SWA MANAGER CALLED              04600000
FP162B3  DS    XL1                        (WRITE JCTX)             @L1C 04610000
FP62SW3X EQU    X'80'                   SWA MANAGER RETURNED            04620000
FP62STRE EQU    X'40'                   IEFINSTR called            @D2C 04630000
FP62STRX EQU    X'20'                   IEFINSTR returned          @D2A 04631000
FP62ATP  EQU    X'10'                   GOT ATTACH PARM LIST            04640000
FP62660E EQU    X'08'                   IEFIB660 CALLED                 04650000
FP62660X EQU    X'04'                   IEFIB660 RETURNED               04660000
FP62JSL  EQU    X'02'                   JOBLIB, STEPLIB OPEN            04670000
FP62SFL  EQU    X'01'                   STEPLIB, FETCHLIB OPEN          04680000
FP162B4  DS    XL1                                                      04690000
FP62PPT  EQU    X'80'                   PROGRAM PROPERTIES SET          04700000
FP62OPE  EQU    X'40'                   OPEN ERROR                      04710000
*        EQU    X'20'                   Unused                     @L4C 04711000
*        EQU    X'10'                   Unused                     @L4C 04712000
*        EQU    *                       4 Unused                   @01C 04740000
FP162B5  DS    XL1                                                 @L5A 04741000
*        EQU    *                       8 unused                   @L5A 04742000
*                                                                       04750000
*                                                                       04760000
FPCAT    DS    0XL1                    IEFICATL FOOTPRINT BITS          04770000
FPCATB1  DS    XL1                                                      04780000
*                                                                 3@P2D 04810000
FPCT4F5  EQU    X'80'                   IEFAB4F5 toggle            @P2C 04830000
*        EQU    *                       7 unused                   @P2C 04850000
*                                                                       04860000
*                                                                       04870000
FP103    DS    0XL1                    IEFSD103 FOOTPRINT BITS          04880000
FP103B1  DS    XL1                                                      04890000
FP03ATL  EQU    X'80'                   ATTACH LIST COMPLETED           04900000
*        EQU    X'40'                   Unused                     @D3C 04910000
FP03GRP  EQU    X'20'                   PERFORMANCE GROUP SET           04920000
*        EQU    *                       5 UNUSED                        04930000
*                                                                       04940000
*                                                                       04950000
FP263    DS    0XL7                    IEFSD263 FOOTPRINT BITS     @L5C 04960000
FP263B1  DS    XL1                                                      04970000
FP63EX1  EQU    X'80'                   FREEPART EXIT TAKEN             04980000
FP63RGWT EQU    X'40'                   REAL GWT INITIALIZED            04990000
FP63VGWT EQU    X'20'                   VIRTUAL GWT INITIALIZED         05000000
FP63VSME EQU    X'10'                   GET REGION CALLED               05010000
FP63VSMX EQU    X'08'                   GET REGION RETURNED             05020000
FP63EV1E EQU    X'04'                   SYSEVENT CALLED                 05030000
*                                         (TRANSWAP)                    05040000
FP63EV1X EQU    X'02'                   SYSEVENT RETURNED               05050000
FP63EV2E EQU    X'01'                   SYSEVENT CALLED                 05060000
FP263B2  DS    XL1                        (REQSWAP)                     05070000
FP63EV2X EQU    X'80'                   SYSEVENT RETURNED               05080000
FP63GRG  EQU    X'40'                   GOT REQUESTED REGION            05090000
FP63EX2  EQU    X'20'                   PRE-INVOCATION EXIT TAKEN       05100000
FP63SMFE EQU    X'10'                   IEFSMFAT CALLED                 05110000
FP63SMFX EQU    X'08'                   IEFSMFAT RETURNED               05120000
FP63ATC  EQU    X'04'                   JOB STEP ATTACHED               05130000
FP63TIM  EQU    X'02'                   TIME CALCULATION DONE           05140000
FP63SW1E EQU    X'01'                   SWA MANAGER CALLED              05150000
*                                         (READ ACT)                    05160000
FP263B3  DS    XL1                                                      05170000
FP63SW1X EQU    X'80'                   SWA MANAGER RETURNED            05180000
FP63EV3E EQU    X'40'                   SYSEVENT CALLED                 05190000
*                                         (INITATT)                     05200000
FP63EV3X EQU    X'20'                   SYSEVENT RETURNED               05210000
FP63VR0E EQU    X'10'                   Get Virtual Region called  @P2A 05211000
*                                         (Default request)        @P2A 05212000
FP63VR0X EQU    X'08'                   Get Virtual Region return  @P2A 05213000
*        EQU    *                       1 UNUSED                   @P2C 05220000
FP63STM  EQU    X'02'                   STEP TIME SAVED                 05250000
FP63EX3  EQU    X'01'                   POST-INVOCATN EXIT TAKEN        05260000
*                                                                       05270000
FP263B4  DS    XL1                                                      05280000
FP63VR1E EQU    X'80'                   GET VIRTUAL RGN CALLED          05290000
*                                         (V=R PROCESSING)              05300000
FP63VR1X EQU    X'40'                   GET VIRT RGN RETURNED           05310000
*        EQU    *                       6 UNUSED                        05320000
FP263B5  DS    XL1                                                      05330000
FP63EV4E EQU    X'80'                   SYSEVENT CALLED                 05340000
FP63EV4X EQU    X'40'                   SYSEVENT RETURNED               05350000
FP63EV5E EQU    X'20'                   SYSEVENT CALLED                 05360000
*                                         (INITDET)                     05370000
FP63EV5X EQU    X'10'                   SYSEVENT RETURNED               05380000
FP63VR2E EQU    X'08'                   GET VIRTUAL RGN CALLED          05390000
*                                         (V=V PROCESSING)              05400000
FP63VR2X EQU    X'04'                   GET VIRT RGN RETURNED           05410000
FP63DET  EQU    X'02'                   JOB STEP DETACHED               05420000
*        EQU    *                       1 UNUSED                        05430000
FP263B6  DS    XL1                                                      05440000
FP63BALE EQU    X'80'                   CALLED EXIT VIA BALR            05450000
FP63BALX EQU    X'40'                   RETURNED FROM EXIT              05460000
FP63LNKE EQU    X'20'                   CALLED EXIT VIA LINK            05470000
FP63LNKX EQU    X'10'                   RETURNED FROM EXIT              05480000
FP63XCTE EQU    X'08'                   CALLED EXIT VIA XCTL       @L1A 05490000
*        EQU    *                       3 UNUSED                   @L1C 05500000
FP263B7  DS    XL1                                                 @L5A 05501000
*        EQU    *                       8 unused                   @L5A 05502000
*                                                                       05510000
*                                                                       05520000
FP164    DS    0XL4                    IEFSD164 FOOTPRINT BITS          05530000
FP164B1  DS    XL1                                                      05540000
FP64WRM  EQU    X'80'                   PROCESSING WARMSTART            05550000
FP64ALO  EQU    X'40'                   ABEND FOR ALLOCATE ERROR        05560000
FP64FCL  EQU    X'20'                   FETCHLIB CLOSE & FREE           05570000
FP64GTP  EQU    X'10'                   GOT TERMINATE PARM LIST         05580000
FP64STC  EQU    X'08'                   JOB/STEPLIB CLOSE & FREE        05590000
FP64SW1E EQU    X'04'                   SWA MANAGER CALLED              05600000
*                                         (READ ACT)                    05610000
FP64SW1X EQU    X'02'                   SWA MANAGER RETURNED            05620000
FP64SW2E EQU    X'01'                   SWA MANAGER CALLED              05630000
*                                         (WRITE ACT)                   05640000
FP164B2  DS    XL1                                                      05650000
FP64SW2X EQU    X'80'                   SWA MANAGER RETURNED            05660000
FP64TIM  EQU    X'40'                   JOB/STEP TIMES COMPUTED         05670000
FP64DTC  EQU    X'20'                   GOT DUMMY TCB                   05680000
FP64SW3E EQU    X'10'                   SWA MANAGER CALLED              05690000
*                                         (JOURNAL CNTL BLOCKS)         05700000
FP64SW3X EQU    X'08'                   SWA MANAGER RETURNED            05710000
FP64UALE EQU    X'04'                   UNALLOCATION CALLED             05720000
FP64UALX EQU    X'02'                   UNALLOCATION RETURNED           05730000
FP64SW4E EQU    X'01'                   SWA MANAGER CALLED              05740000
*                                         (JOURNAL CNTL BLOCKS)         05750000
FP164B3  DS    XL1                                                      05760000
FP64SW4X EQU    X'80'                   SWA MANAGER RETURNED            05770000
FP64FTC  EQU    X'40'                   FREED DUMMY TCB                 05780000
FP64FTP  EQU    X'20'                   FREED TERM PARM LIST            05790000
FP64CLRE EQU    X'10'                   CLEAR JES MSGS CALLED           05800000
FP64CLRX EQU    X'08'                   CLEAR JES MSGS RETURNED         05810000
FP64SW5E EQU    X'04'                   SWA MANAGER CALLED              05820000
*                                         (READ NEXT STC)               05830000
FP64SW5X EQU    X'02'                   SWA MANAGER RETURNED            05840000
FP64STRE EQU    X'01'                   IEFINSTR called            @D2C 05850000
*                                                                       05851000
FP164B4  DS    XL1                                                      05860000
FP64STRX EQU    X'80'                   IEFINSTR returned          @D2C 05870000
*        EQU    *                       7 unused                   @D2C 05880000
*                                                                       05890000
*                                                                       05900000
FPCPU    DS    0XL1                    IEFICPUA FOOTPRINT BITS          05910000
FPCPUB1  DS    XL1                                                      05920000
FPCPENQ  EQU    X'80'                   ENQ ON SYSZCSD                  05930000
FPCPDEQ  EQU    X'40'                   DEQ ON SYSZCSD                  05940000
*        EQU    *                       6 UNUSED                        05950000
*                                                                       05960000
*                                                                       05970000
FPMSK    DS    0XL1                    IEFIMASK FOOTPRINT BITS          05980000
FPMSKB1  DS    XL1                                                      05990000
FPMSSCN  EQU    X'80'                   BIT STRING SCANNED              06000000
*        EQU    *                       7 UNUSED                        06010000
*                                                                       06020000
FPCND    DS    0XL1                    IEFINCND Footprint bits     @01A 06030000
FPCNDB1  DS    XL1                                                 @01A 06040000
FPCNWIFB EQU    X'80'                   Indicate call for Write         06050000
*                                       modified IFB               @01A 06060000
FPCNPMSE EQU    X'40'                   Indicate call to IEFTB723       06070000
*                                       to issue message           @01A 06080000
FPCNPMSX EQU    X'20'                   Indicate return from IEFTB723   06090000
*                                       to issue message           @01A 06100000
*        EQU    *                       5 UNUSED                   @01A 06110000
*                                                                       06120000
FPSWD    DS    0XL2                    IEFINSWD Footprint bits     @L5C 06142000
FPSWDB1  DS    XL1                                                 @04C 06143000
FPSWDE   EQU    X'80'                   IEFINSWD entered           @04A 06144000
FPSDLCT  EQU    X'40'                   SWA pointers reset in LCT  @04A 06145000
FPSDSWME EQU    X'20'                   Called SWA Manager Subpool      06146000
*                                       Delete                     @04A 06147000
FPSDSWMX EQU    X'10'                   SWA Manager Subpool Delete      06148000
*                                       returned                   @04A 06149000
FPSDJSCB EQU    X'08'                   Completed JSCB processing  @04A 06149100
FPSDCIB  EQU    X'04'                   Completed CIB processing   @04A 06149200
FPSDCSCB EQU    X'02'                   Completed CSCB processing  @04A 06149300
FPSWDX   EQU    X'01'                   IEFINSWD exited            @04A 06149400
FPSWDB2  DS    XL1                                                 @L5A 06149500
FPSDVSME EQU    X'80'                   VSM invoked                @L5A 06149600
FPSDVSMX EQU    X'40'                   VSM returned               @L5A 06149700
FPSDVAT  EQU    X'20'                   VAT freed                  @L5A 06149800
*        EQU    *                       5 unused                   @L5A 06149900
*                                                                       06150000
FPWTE    DS    0XL2                    IEFINWTE Footprint bits     @L5C 06150100
FPWTEB1  DS    XL1                                                 @L3A 06150200
FPWEDSP  EQU    X'80'                   TASK Dispatchable          @L3A 06150300
FPWECNL  EQU    X'40'                   TASK Canceled              @L3A 06150400
FPWEEND  EQU    X'20'                   TASK Ended                 @L3A 06150500
FPWEOPEN EQU    X'10'                   OPEN/MVS function request  @L4A 06150600
FPWESWAC EQU    X'08'                   Call SWA Manager Assign    @L3A 06150700
FPWESWAE EQU    X'04'                   SWA Manager Assign exited  @L3A 06150800
FPWESWWC EQU    X'02'                   Call SWA Manager Write     @L3A 06150900
FPWESWWE EQU    X'01'                   SWA Manager Write exited   @L3A 06151000
FPWTEB2  DS    XL1                                                 @L5A 06151100
*        EQU    *                       8 unused                   @L5A 06151200
*                                                                       06151300
FPSTR    DS    0XL1                    IEFINSTR Footprint bits     @L6C 06151400
FPSTRB1  DS    XL1                                                 @L6A 06151420
FPSTRUNE EQU    X'80'                   ATBUNID called             @L6A 06151430
FPSTRUNX EQU    X'40'                   ATBUNID returned           @L6A 06151440
FPSTRAME EQU    X'20'                   ATBAMR1 called             @L6A 06151450
FPSTRAMX EQU    X'10'                   ATBAMR1 returned           @L6A 06151460
FPSTRMPE EQU    X'08'                   BPX1MPC called             @L6A 06151470
FPSTRMPX EQU    X'04'                   BPX1MPC returned           @L6A 06151480
*        EQU    *                       2 unused                   @L6A 06151490
*                                                                  @L6A 06151491
         DS    XL1                     Reserved                    @L3A 06151500
         DS    XL1                     Reserved                    @L3A 06151600
         DS    XL1                     Reserved                    @L5A 06151700
         DS    XL1                     Reserved                    @L5A 06151800
         DS    XL1                     Reserved                    @L5A 06151900
         DS    XL1                     Reserved                    @L5A 06152000
         DS    XL1                     Reserved                    @L5A 06152100
         DS    0F                      FORCE FULL WORD LENGTH           06153000
*                                                                       06160000
         MEND                                                           06170000
**/      %FPTBSL:;                                                      06180000
* %IF FPFPATTR = '' %THEN                                               06190000
*   %FPFPATTR = 'LCTFPNT';         /* ASSIGN DEFAULT BASE VARIABLE   */ 06200000
* DCL                                   /*                           */ 06210000
* 1 FPFPNT BASED(FPFPATTR)              /* INITIATOR FOOTPRINT AREA  */ 06220000
*          BOUNDARY(WORD),              /*                           */ 06230000
*                                       /*                           */ 06240000
*   3 FPNAME      CHAR(8),              /* FOOTPRINT HEADER          */ 06250000
*                                       /*   'INITFPNT'              */ 06260000
*                                       /*                           */ 06270000
*   3 FPINIT      BIT(8),               /* INITIATOR BITS            */ 06280000
*     5 FP160E     BIT(1),              /*   IEFSD160 ENTERED        */ 06290000
*     5 FP160X     BIT(1),              /*   IEFSD160 EXITED         */ 06300000
*     5 *            BIT(6),            /*                           */ 06310000
*                                       /*                           */ 06320000
*   3 FPJOB       BIT(32),              /* JOB BITS              @L5C*/ 06330000
*     5 FP161E       BIT(1),            /*   IEFSD161 ENTERED        */ 06340000
*     5 FP161X       BIT(1),            /*   IEFSD161 EXITED         */ 06350000
*     5 FPTBLE       BIT(1),            /*   IEFDSTBL ENTERED        */ 06360000
*     5 FPTBLX       BIT(1),            /*   IEFDSTBL EXITED         */ 06370000
*     5 FPLSTE       BIT(1),            /*   IEFDSLST ENTERED        */ 06380000
*     5 FPLSTX       BIT(1),            /*   IEFDSLST EXITED         */ 06390000
*     5 FP166E       BIT(1),            /*   IEFSD166 ENTERED        */ 06400000
*     5 FP166X       BIT(1),            /*   IEFSD166 EXITED         */ 06410000
*                                       /*                           */ 06420000
*     5 FP620E       BIT(1),            /*   IEFIB620 ENTERED        */ 06430000
*     5 FP620X       BIT(1),            /*   IEFIB620 EXITED         */ 06440000
*     5 FP621E       BIT(1),            /*   IEFIB621 ENTERED        */ 06450000
*     5 FP621X       BIT(1),            /*   IEFIB621 EXITED         */ 06460000
*     5 FP922E       BIT(1),            /*   IEFI922B ENTERED        */ 06470000
*     5 FP922X       BIT(1),            /*   IEFI922B EXITED         */ 06480000
*     5 *            BIT(2),            /*                           */ 06490000
*     5 FP600E       BIT(1),            /*   IEFIB600 ENTERED        */ 06500000
*     5 FP600X       BIT(1),            /*   IEFIB600 ENTERED        */ 06510000
*     5 FP605E       BIT(1),            /*   IEFIB605 ENTERED        */ 06520000
*     5 FP605X       BIT(1),            /*   IEFIB605 ENTERED        */ 06530000
*     5 FP645E       BIT(1),            /*   IEFIB645 ENTERED        */ 06540000
*     5 FP645X       BIT(1),            /*   IEFIB645 ENTERED        */ 06550000
*     5 *            BIT(10),           /*                       @L5C*/ 06560000
*                                       /*                           */ 06570000
*   3 FPSTEP      BIT(24),              /* JOB STEP BITS         @L3C*/ 06580000
*     5 FP101E       BIT(1),            /*   IEFSD101 ENTERED        */ 06590000
*     5 FP101X       BIT(1),            /*   IEFSD101 EXITED         */ 06600000
*     5 FP102E       BIT(1),            /*   IEFSD102 ENTERED        */ 06610000
*     5 FP102X       BIT(1),            /*   IEFSD102 EXITED         */ 06620000
*     5 FP162E       BIT(1),            /*   IEFSD162 ENTERED        */ 06630000
*     5 FP162X       BIT(1),            /*   IEFSD162 EXITED         */ 06640000
*     5 FPCATE       BIT(1),            /*   IEFICATL ENTERED        */ 06650000
*     5 FPCATX       BIT(1),            /*   IEFICATL EXITED         */ 06660000
*     5 FP103E       BIT(1),            /*   IEFSD103 ENTERED        */ 06670000
*     5 FP103X       BIT(1),            /*   IEFSD103 EXITED         */ 06680000
*     5 FP263E       BIT(1),            /*   IEFSD263 ENTERED        */ 06690000
*     5 FP263X       BIT(1),            /*   IEFSD263 EXITED         */ 06700000
*     5 FP164E       BIT(1),            /*   IEFSD164 ENTERED        */ 06710000
*     5 FP164X       BIT(1),            /*   IEFSD164 EXITED         */ 06720000
*     5 FPCNDE       BIT(1),            /*   IEFINCND Entered    @01C*/ 06730000
*     5 FPCNDX       BIT(1),            /*   IEFINCND Exited     @01A*/ 06740000
*     5 FPWTEE       BIT(1),            /*   IEFINWTE Entered    @L3A*/ 06740100
*     5 FPWTEX       BIT(1),            /*   IEFINWTE Exited     @L3A*/ 06740200
*     5 FPSTRE       BIT(1),            /*   IEFINSTR Entered    @L6A*/ 06740300
*     5 FPSTRX       BIT(1),            /*   IEFINSTR Exited     @L6A*/ 06740400
*     5 *            BIT(4),            /*                       @L6C*/ 06750000
*                                       /*                           */ 06760000
*                                       /*                           */ 06770000
*   3 FP160       BIT(16),              /* IEFSD160 Footprints   @L5C*/ 06780000
*     5 FP60LCT      BIT(1),            /*   LCT INITIALIZED         */ 06790000
*     5 FP60STA      BIT(1),            /*   ESTAE ESTABLISHED       */ 06800000
*     5 FP60EVT      BIT(1),            /*   MEMORY FOR SYSEVENTS    */ 06810000
*                                       /*     PARM LIST             */ 06820000
*     5 FP60ID1E     BIT(1),            /* SRM called (INITID),  @03C*/ 06830000
*                                       /* Initiator starting    @03A*/ 06840000
*     5 FP60ID1X     BIT(1),            /* SRM returned,         @03C*/ 06850000
*                                       /* Initiator starting    @03A*/ 06860000
*     5 FP60ID2E     BIT(1),            /* SRM called (INITID)   @03A*/ 06870000
*                                       /* Initiator terminating @03A*/ 06880000
*     5 FP60ID2X     BIT(1),            /* SRM returned,         @03A*/ 06890000
*                                       /* Initiator terminating @03A*/ 06900000
*     5 *            BIT(9),            /*                       @L5C*/ 06910000
*                                       /*                           */ 06920000
*                                       /*                           */ 06930000
*   3 FP161       BIT(40),              /* IEFSD161 Footprints   @L5C*/ 06940000
*                                       /*   STOP REQUESTED          */ 06950000
*     5 FP61SSO      BIT(1),            /*   -SSOB FREED             */ 06960000
*     5 FP61STA      BIT(1),            /*   -ESTAE CANCELED         */ 06970000
*     5 FP61TS1E     BIT(1),            /* TP SEL SSREQ CALLED   @P1A*/ 06980000
*     5 FP61TS1X     BIT(1),            /* TP SEL SSREQ RETURNED @P1A*/ 06990000
*     5 FP61RQ1E     BIT(1),            /*   SSREQ CALLED (SELECT)   */ 07000000
*     5 FP61RQ1X     BIT(1),            /*   SSREQ RETURNED          */ 07010000
*     5 FP61SEL      BIT(1),            /*   JOB SELECTED            */ 07020000
*     5 FP61ERR      BIT(1),            /*   ERROR FROM JOB SELECT   */ 07030000
*     5 FP61TIM      BIT(1),            /*   JOB SELECT TIME SAVED   */ 07070000
*     5 FP61SRME     BIT(1),            /*   SRM CALLED (JOB SELECT) */ 07110000
*     5 FP61SRMX     BIT(1),            /*   SRM RETURNED            */ 07120000
*     5 FP61WRM      BIT(1),            /*   WARM START REQUESTED    */ 07130000
*     5 FP61PSCE     BIT(1),            /*   IEFPPSCN invoked    @P2A*/ 07131000
*     5 FP61PSCX     BIT(1),            /*   IEFPPSCN returned   @P2A*/ 07132000
*     5 *            BIT(2),            /*                       @P2C*/ 07139000
*     5 FP61KEY      BIT(1),            /*   PROTECT KEY ASSIGNED    */ 07140000
*     5 FP61NKY      BIT(1),            /*   PROTECT KEY UNAVAILABLE */ 07150000
*     5 FP61CPUE     BIT(1),            /*   IEFICPUA CALLED         */ 07160000
*     5 FP61CPUX     BIT(1),            /*   IEFICPUA RETURNED       */ 07170000
*     5 FP61AFF      BIT(1),            /*   CPU AFFINITY 1ST STEP   */ 07180000
*     5 FP61NAF      BIT(1),            /*   CPU AFFINITY UNAVAIL    */ 07190000
*     5 FP61MS1E     BIT(1),            /*   IEFIMASK CALLED         */ 07200000
*     5 FP61MS1X     BIT(1),            /*   IEFIMASK RETURNED       */ 07210000
*     5 FP61MS2E     BIT(1),            /*   IEFIMASK CALLED         */ 07220000
*     5 FP61MS2X     BIT(1),            /*   IEFIMASK RETURNED       */ 07230000
*                                       /*   JOB RENEQ RTN CALLED    */ 07240000
*     5 FP61RQ2E     BIT(1),            /*   -SSREQ CALLED           */ 07250000
*     5 FP61RQ2X     BIT(1),            /*   -SSREQ RETUNED          */ 07270000
*     5 FP61SWDE     BIT(1),            /*   IEFINSWD called     @L5C*/ 07280000
*     5 FP61SWDX     BIT(1),            /*   IEFINSWD returned   @L5C*/ 07300000
*     5 FP61ENQ      BIT(1),            /*   Protect key         @P2A*/ 07310000
*                                       /*   resource ENQd       @P2A*/ 07312000
*     5 FP61DEQ      BIT(1),            /*   Protect key         @P2A*/ 07313000
*                                       /*   resource DEQd       @P2A*/ 07314000
*     5 *            BIT(8),            /*                       @P2C*/ 07331000
*                                       /*                           */ 07340000
*                                       /*                           */ 07350000
*   3 FPTBL   BIT(32) BDY(BYTE),        /* IEFDSTBL FOOTPRINT BITS   */ 07360000
*     5 FPTBTRE   BIT(1),               /*   GOT FIRST TREE SEGMENT  */ 07370000
*     5 *         BIT(7),               /*   UNUSED INDICATORS       */ 07380000
*     5 FPTBSWAB  BIT(16) BDY(BYTE),    /*  INDICATORS PER SWA BLOCK */ 07390000
*       7 FPTBSRE    BIT(1),            /*     SWAREQ READ ENTERED   */ 07400000
*       7 FPTBSRX    BIT(1),            /*     SWAREQ READ RETURNED  */ 07410000
*       7 *          BIT(6),            /*     UNUSED INDICATORS     */ 07420000
*       7 FPTBDSN    BIT(8) BDY(BYTE),  /* INDICATORS/DSNQ ENTRY     */ 07430000
*         9 FPTBSRLE    BIT(1),         /*  SWAREQ READ TO UPDATE    */ 07440000
*                                       /*   (SWA BLOCK ENTERED)     */ 07450000
*         9 FPTBSRLX    BIT(1),         /*  SWAREQ READ TO UPDATE    */ 07460000
*                                       /*   (SWA BLOCK RETURNED)    */ 07470000
*         9 FPTBTRES    BIT(1),         /*  GOT ANOTHER TREE SEGMEMT */ 07480000
*         9 *           BIT(5),         /*  UNUSED INDICATORS        */ 07490000
*     5 FPTBSWAR  BIT(8)  BDY(BYTE),    /*  SWAREQ READ/WRITE FLAGS  */ 07500000
*                                       /*    AT END OF MODULE       */ 07510000
*       7 FPTBSRRE   BIT(1),            /*     SWAREQ READ ENTERED   */ 07520000
*       7 FPTBSRRX   BIT(1),            /*     SWAREQ READ RETURNED  */ 07530000
*       7 FPTBSRWE   BIT(1),            /*     SWAREQ WRITE ENTERED  */ 07540000
*       7 FPTBSRWX   BIT(1),            /*     SWAREQ WRITE RETURNED */ 07550000
*       7 *          BIT(4),            /*     UNUSED INDICATORS     */ 07560000
*                                       /*                           */ 07570000
*                                       /*                           */ 07580000
*   3 FPLST       BIT(8),               /* IEFDSLST FOOTPRINT BITS   */ 07590000
*     5 FPLSEQB      BIT(1),            /*   DSENQ PARM LIST BUILT   */ 07600000
*     5 FPLSTRF      BIT(1),            /*   DSNAME TREE FREED       */ 07610000
*     5 *            BIT(6),            /*                           */ 07620000
*                                       /*                           */ 07630000
*                                       /*                           */ 07640000
*   3 FP166       BIT(24),              /* IEFSD166 FOOTPRINT BITS   */ 07650000
*     5 FP66KEY      BIT(1),            /*   PROTECT KEY RELEASED    */ 07660000
*     5 FP66RAC      BIT(1),            /*   RAC ENVIRONMENT DELETED */ 07670000
*     5 FP66TRM      BIT(1),            /*   GOT TERMINATION SSOB    */ 07680000
*     5 FP66REN      BIT(1),            /*   GOT RE-ENQUE SSOB       */ 07690000
*     5 FP66SSRE     BIT(1),            /*   SSREQ CALLED            */ 07700000
*                                       /*     ( TERM OR RE-ENQUEUE) */ 07710000
*     5 FP66SSRX     BIT(1),            /*   SSREQ RETURNED          */ 07720000
*     5 FP66SSO      BIT(1),            /*   FUNCT SSOB HEADER FREED */ 07730000
*     5 *            BIT(1),            /*                       @L5C*/ 07740000
*     5 FP66TSTE     BIT(1),            /* TRANSACTION TERMINATE @L5M*/ 07750000
*                                       /* SSREQ CALLED          @L5M*/ 07760000
*     5 FP66TSTX     BIT(1),            /* TRANSACTION TERMINATE @L5M*/ 07770000
*                                       /* SSREQ RETURNED        @L5M*/ 07771000
*     5 FP66TERE     BIT(1),            /*   ILRJTERM CALLED         */ 07780000
*     5 FP66TERX     BIT(1),            /*   ILRJTERM RETURNED       */ 07790000
*     5 FP66EVTE     BIT(1),            /*   SYSEVENT CALLED         */ 07800000
*     5 FP66EVTX     BIT(1),            /*   SYSEVENT RETURNED       */ 07810000
*     5 FP66SWDE     BIT(1),            /*   IEFINSWD called     @L5C*/ 07821000
*     5 FP66SWDX     BIT(1),            /*   IEFINSWD returned   @L5C*/ 07822000
*     5 FP66RCRE     BIT(1),            /*   RACROUTE invoked    @P2A*/ 07823000
*     5 FP66RCRX     BIT(1),            /*   RACROUTE returned   @P2A*/ 07824000
*     5 *            BIT(6),            /*                       @P2C*/ 07880000
*                                       /*                           */ 07890000
*                                       /*                           */ 07900000
*   3 FP620       BIT(16),              /* IEFIB620 Footprints   @L5C*/ 07910000
*     5 FP20DET      BIT(1),            /*   DAUGHTER TASK DETACH    */ 07920000
*     5 FP20DEQ      BIT(1),            /*   DEQ RESOURCES           */ 07930000
*     5 FP20RTC      BIT(1),            /*   RETURN CODE SET         */ 07940000
*     5 FP20RET      BIT(1),            /*   RETRY                   */ 07950000
*     5 FP20NOR      BIT(1),            /*   NO RETRY                */ 07960000
*     5 *            BIT(11),           /*                       @L5C*/ 07970000
*                                       /*                           */ 07980000
*                                       /*                           */ 07990000
*   3 FP621       BIT(24),              /* IEFIB621 FOOTPRINT BITS   */ 08000000
*     5 FP21ALN      BIT(1),            /*   ALLOCATION NOT COMPLETE */ 08010000
*     5 FP21SW1E     BIT(1),            /*   SWA MANAGER CALLED      */ 08020000
*                                       /*     (LOCATE SCT)          */ 08030000
*     5 FP21SW1X     BIT(1),            /*   SWA MANAGER RETURNED    */ 08040000
*     5 FP21ALC      BIT(1),            /*   ALLOCATION COMPLETED    */ 08050000
*     5 FP21GWTF     BIT(1),            /*   -GWT FREED              */ 08060000
*     5 FP21EV1E     BIT(1),            /*   -SYSEVENT CALLED        */ 08070000
*                                       /*     (INITATT)             */ 08080000
*     5 FP21EV1X     BIT(1),            /*   -SYSEVENT RETURNED      */ 08090000
*     5 FP21EV2E     BIT(1),            /*   -SYSEVENT CALLED        */ 08100000
*                                       /*     (INITDET)             */ 08110000
*     5 FP21EV2X     BIT(1),            /*   -SYSEVENT RETURNED      */ 08120000
*     5 FP21SDW      BIT(1),            /*   SDWA FREED              */ 08130000
*     5 FP21EV3E     BIT(1),            /*   SYSEVENT CALLED         */ 08140000
*                                       /*     (INITATT)             */ 08150000
*     5 FP21EV3X     BIT(1),            /*   SYSEVENT RETURNED       */ 08160000
*     5 FP21RG1E     BIT(1),            /*   GET REGION CALLED       */ 08170000
*     5 FP21RG1X     BIT(1),            /*   GET REGION RETURNED     */ 08180000
*     5 FP21EV4E     BIT(1),            /*   SYSEVENT CALLED         */ 08190000
*                                       /*     (INITDET)             */ 08200000
*     5 FP21EV4X     BIT(1),            /*   SYSEVENT RETURNED       */ 08210000
*     5 FP21RG2E     BIT(1),            /*   GET REGION CALLED       */ 08220000
*     5 FP21RG2X     BIT(1),            /*   GET REGION RETURNED     */ 08230000
*     5 FP21TIM      BIT(1),            /*   TIMING FIELDS CLEARED   */ 08240000
*     5 FP21EV5E     BIT(1),            /*   SYSEVENT called     @P2A*/ 08241000
*                                       /*    (2nd INITDET)      @P2A*/ 08242000
*     5 FP21EV5X     BIT(1),            /*   SYSEVENT returned   @P2A*/ 08243000
*     5 *            BIT(3),            /*                       @P2C*/ 08250000
*                                       /*                           */ 08260000
*                                       /*                           */ 08270000
*   3 FP600       BIT(40),              /* IEFIB600 Footprints   @L5C*/ 08280000
*                                       /*                           */ 08290000
*                                       /* MAINLINE:                 */ 08300000
*     5 FP00STA      BIT(1),            /*   ESTAE ESTABLISHED       */ 08310000
*     5 FP00JSC      BIT(1),            /*   JSCB CHAINED            */ 08320000
*     5 FP00NEL      BIT(1),            /*   NEL INITAILIZED         */ 08330000
*     5 FP00AINE     BIT(1),            /*   ALT INTERPRETER CALLED  */ 08340000
*     5 FP00AINX     BIT(1),            /*   ALT INTERPRETER RETURNED*/ 08350000
*     5 FP00INTE     BIT(1),            /*   INTERPRETER CALLED      */ 08360000
*     5 FP00INTX     BIT(1),            /*   INTERPRETER RETURNED    */ 08370000
*     5 FP00NEF      BIT(1),            /*   NEL FREED               */ 08380000
*     /*                                                        4@L5D*/ 08390000
*     5 FP00RF1E     BIT(1),            /*   RACF CALLED             */ 08430000
*                                       /*     (DELETE ACCESSOR ENV) */ 08440000
*     5 FP00RF1X     BIT(1),            /*   RACF RETURNED           */ 08450000
*     5 FP00RF2E     BIT(1),            /*   RACF CALLED             */ 08460000
*                                       /*     (CREATE ACCESSOR ENV) */ 08470000
*     5 FP00RF2X     BIT(1),            /*   RACF RETURNED           */ 08480000
*     5 FP00CSC      BIT(1),            /*   CSCB BUILT              */ 08490000
*     5 FP00EST      BIT(1),            /*   ESTAE CLEARED           */ 08500000
*     5 *            BIT(1),            /*   Unused              @L5A*/ 08500100
*     5 *            BIT(1),            /*   Unused              @L5A*/ 08500300
*     5 FP00SD1E     BIT(1),            /*   IEFINSWD linked,    @L5A*/ 08501000
*                                       /*     error freeing NEL @L5A*/ 08501100
*                                       /*     or in GETWORK rtn @L5A*/ 08501200
*     5 FP00SD1X     BIT(1),            /*   IEFINSWD returned,  @L5A*/ 08502000
*                                       /*     error freeing NEL @L5A*/ 08502100
*                                       /*     or in GETWORK rtn @L5A*/ 08502200
*     5 FP00SD2E     BIT(1),            /*   IEFINSWD linked,    @L5A*/ 08503000
*                                       /*     RACF error        @L5A*/ 08503100
*     5 FP00SD2X     BIT(1),            /*   IEFINSWD returned,  @L5A*/ 08504000
*                                       /*     RACF error        @L5A*/ 08504100
*     5 FP00SD3E     BIT(1),            /*   IEFINSWD linked,    @L5A*/ 08505000
*                                       /*     error in          @L5A*/ 08505100
*                                       /*     reconstruction    @L5A*/ 08505200
*     5 FP00SD3X     BIT(1),            /*   IEFINSWD returned,  @L5A*/ 08506000
*                                       /*     error in          @L5A*/ 08506100
*                                       /*     reconstruction    @L5A*/ 08506200
*     5 FP00VSME     BIT(1),            /*   VSM invoked         @L5A*/ 08507000
*     5 FP00VSMX     BIT(1),            /*   VSM returned        @L5A*/ 08508000
*     5 FP00SMSE     BIT(1),            /*   IEFSSREQ invoked    @P2A*/ 08510000
*                                       /*    (DFSMS IDAX)       @P2A*/ 08520000
*     5 FP00SMSX     BIT(1),            /*   IEFSSREQ returned   @P2A*/ 08530000
*     5 *            BIT(6),            /*                       @P2C*/ 08590000
*                                       /*                     11@L5D*/ 08600000
*     5 *            BIT(8),            /*                       @L5C*/ 08640000
*                                       /*                           */ 08650000
*                                       /*                           */ 08660000
*   3 FP605       BIT(8),               /* IEFIB605 FOOTPRINT BITS   */ 08670000
*     5 FP05601E     BIT(1),            /*   IEFXB601 CALLED         */ 08680000
*     5 FP05601X     BIT(1),            /*   IEFXB601 RETURNED       */ 08690000
*     5 FP05609E     BIT(1),            /*   IEFXB609 CALLED         */ 08700000
*     5 FP05609X     BIT(1),            /*   IEFXB609 RETURNED       */ 08710000
*     5 FP05TDSE     BIT(1),            /*   IEFXBTDS called     @P2C*/ 08730000
*     5 FP05TDSX     BIT(1),            /*   IEFXBTDS returned   @P2C*/ 08730100
*     5 *            BIT(2),            /*                       @P2C*/ 08750000
*                                       /*                           */ 08760000
*                                       /*                           */ 08770000
*   3 FP645       BIT(8),               /* IEFIB645 FOOTPRINT BITS   */ 08780000
*     5 FP45NEL      BIT(1),            /*   NEL FREED               */ 08790000
*     5 FP45SWDE     BIT(1),            /*   IEFINSWD linked     @L5C*/ 08800000
*     5 FP45SWDX     BIT(1),            /*   IEFINSWD returned   @L5C*/ 08820000
*     5 FP45LST      BIT(1),            /*   ESTAE LIST FREED        */ 08840000
*     5 *            BIT(4),            /*                       @L5C*/ 08850000
*                                       /*                           */ 08860000
*                                       /*                           */ 08870000
*   3 FP101       BIT(16),              /* IEFSD101 FOOTPRINT BITS   */ 08880000
*     5 FP01SMFE     BIT(1),            /*   SMF CALLED              */ 08890000
*     5 FP01SMFX     BIT(1),            /*   SMF RETURNED            */ 08900000
*     5 FP01PPC      BIT(1),            /*   PPT FLAGS CLEARED       */ 08910000
*     5 FP01CPUE     BIT(1),            /*   IEFICPUA CALLED         */ 08920000
*     5 FP01CPUX     BIT(1),            /*   IEFICPUA RETURNED       */ 08930000
*     5 FP01MSKE     BIT(1),            /*   IEFIMASK CALLED         */ 08940000
*     5 FP01MSKX     BIT(1),            /*   IEFIMASK RETURNED       */ 08950000
*     5 FP01RST      BIT(1),            /*   CKPT/RESTART DETECTED   */ 08960000
*     5 FP01PPT      BIT(1),            /*   PPT FLAGS SET           */ 08970000
*     5 FP01PSCE     BIT(1),            /*   IEFPPSCN invoked    @P2C*/ 08970100
*     5 FP01PSCX     BIT(1),            /*   IEFPPSCN returned   @P2A*/ 08980000
*     5 *            BIT(5),            /*                       @P2C*/ 09000000
*                                       /*                           */ 09010000
*                                       /*                           */ 09020000
*   3 FP102       BIT(16),              /* IEFSD102 Footprints   @L5C*/ 09030000
*     5 FP02ELJ      BIT(1),            /*   DSENQ LIST FREED        */ 09040000
*                                       /*     (JOB FAILED)          */ 09050000
*     5 FP02ENQE     BIT(1),            /*   ENQUEUE CALLED          */ 09060000
*     5 FP02ENQX     BIT(1),            /*   ENQUEUE RETURNED        */ 09070000
*     5 FP02ENF      BIT(1),            /*   ENQ FAILED              */ 09080000
*     5 FP02ELF      BIT(1),            /*   DSENQ LIST FREED        */ 09090000
*     5 FP02WDS      BIT(1),            /*   WAITING ON DATA SETS    */ 09100000
*     5 FP02CNL      BIT(1),            /*   CANCELED WHILE WAITING  */ 09110000
*     5 *            BIT(9),            /*                       @L5C*/ 09115000
*                                       /*                           */ 09130000
*                                       /*                           */ 09140000
*   3 FP162       BIT(40),              /* IEFSD162 Footprints   @L5C*/ 09150000
*     5 FP62TIM      BIT(1),            /*   STEP TIME CALCULATED    */ 09160000
*     5 FP62SW1E     BIT(1),            /*   SWA MANAGER CALLED      */ 09170000
*                                       /*     (READ SIOT)           */ 09180000
*     5 FP62SW1X     BIT(1),            /*   SWA MANAGER EXITED      */ 09190000
*     5 FP62SSIE     BIT(1),            /*   SSI CALLED (STEP INIT)  */ 09200000
*     5 FP62SSIX     BIT(1),            /*   SSI RETURNED            */ 09210000
*     5 FP62604E     BIT(1),            /*   IEFXB604 CALLED         */ 09220000
*     5 FP62604X     BIT(1),            /*   IEFXB604 RETURNED       */ 09230000
*     5 FP62W21E     BIT(1),            /*   IEFW21SD CALLED (ALLOC) */ 09240000
*     5 FP62W21X     BIT(1),            /*   IEFW21SD RETURNED       */ 09250000
*     5 FP62501E     BIT(1),            /*   IEFXB501 CALLED (JRNL)  */ 09260000
*     5 FP62501X     BIT(1),            /*   IEFXB501 RETURNED       */ 09270000
*     5 FP62ALF      BIT(1),            /*   ALLOC FAIL OR BYPASS    */ 09280000
*     5 FP62RST      BIT(1),            /*   RESTART PARMS SET       */ 09290000
*     5 FP62SW2E     BIT(1),            /*   SWA MANAGER CALLED      */ 09300000
*                                       /*     (READ SCTX)       @L1C*/ 09310000
*     5 FP62SW2X     BIT(1),            /*   SWA MANAGER RETURNED    */ 09320000
*     5 FP62SW3E     BIT(1),            /*   SWA MANAGER CALLED      */ 09330000
*                                       /*     (WRITE JCTX)      @L1C*/ 09340000
*     5 FP62SW3X     BIT(1),            /*   SWA MANAGER RETURNED    */ 09350000
*     5 FP62STRE     BIT(1),            /*   IEFINSTR called     @D2C*/ 09360000
*     5 FP62STRX     BIT(1),            /*   IEFINSTR returned   @D2A*/ 09361000
*     5 FP62ATP      BIT(1),            /*   GOT ATTACH PARM LIST    */ 09370000
*     5 FP62660E     BIT(1),            /*   IEFIB660 CALLED         */ 09380000
*     5 FP62660X     BIT(1),            /*   IEFIB660 RETURNED       */ 09390000
*     5 FP62JSL      BIT(1),            /*   JOBLIB, STEPLIB OPEN    */ 09400000
*     5 FP62SFL      BIT(1),            /*   STEPLIB, FETCHLIB OPEN  */ 09410000
*     5 FP62PPT      BIT(1),            /*   PROGRAM PROPERTIES SET  */ 09420000
*     5 FP62OPE      BIT(1),            /*   OPEN ERROR              */ 09430000
*     5 *            BIT(14),           /*                       @L5C*/ 09460000
*                                       /*                           */ 09470000
*                                       /*                           */ 09480000
*   3 FPCAT       BIT(8),               /* IEFICATL FOOTPRINT BITS   */ 09490000
*                                       /*                      3@P2D*/ 09520000
*     5 FPCT4F5      BIT(1),            /*   IEFAB4F5 toggle     @P2C*/ 09550000
*     5 *            BIT(7),            /*                       @P2C*/ 09560000
*                                       /*                           */ 09570000
*                                       /*                           */ 09580000
*   3 FP103       BIT(8),               /* IEFSD103 FOOTPRINT BITS   */ 09590000
*     5 FP03ATL      BIT(1),            /*   ATTACH LIST COMPLETED   */ 09600000
*     5 *            BIT(1),            /*   Unused              @D3C*/ 09610000
*     5 FP03GRP      BIT(1),            /*   PERFORMANCE GROUP SET   */ 09620000
*     5 *            BIT(5),            /*                           */ 09630000
*                                       /*                           */ 09640000
*                                       /*                           */ 09650000
*   3 FP263       BIT(56),              /* IEFSD263 Footprints   @L5C*/ 09660000
*     5 FP63EX1      BIT(1),            /*   FREEPART EXIT TAKEN     */ 09670000
*     5 FP63RGWT     BIT(1),            /*   REAL GWT INITIALIZED    */ 09680000
*     5 FP63VGWT     BIT(1),            /*   VIRTUAL GWT INITIALIZED */ 09690000
*     5 FP63VSME     BIT(1),            /*   GET REGION CALLED       */ 09700000
*     5 FP63VSMX     BIT(1),            /*   GET REGION RETURNED     */ 09710000
*     5 FP63EV1E     BIT(1),            /*   SYSEVENT CALLED         */ 09720000
*                                       /*     (TRANSWAP)            */ 09730000
*     5 FP63EV1X     BIT(1),            /*   SYSEVENT RETURNED       */ 09740000
*     5 FP63EV2E     BIT(1),            /*   SYSEVENT CALLED         */ 09750000
*                                       /*     (REQSWAP)             */ 09760000
*     5 FP63EV2X     BIT(1),            /*   SYSEVENT RETURNED       */ 09770000
*     5 FP63GRG      BIT(1),            /*   GOT REQUESTED REGION    */ 09780000
*     5 FP63EX2      BIT(1),            /*   PRE-INVOCATN EXIT TAKEN */ 09790000
*     5 FP63SMFE     BIT(1),            /*   IEFSMFAT CALLED         */ 09800000
*     5 FP63SMFX     BIT(1),            /*   IEFSMFAT RETURNED       */ 09810000
*     5 FP63ATC      BIT(1),            /*   JOB STEP ATTACHED       */ 09820000
*     5 FP63TIM      BIT(1),            /*   TIME CALCULATION DONE   */ 09830000
*     5 FP63SW1E     BIT(1),            /*   SWA MANAGER CALLED      */ 09840000
*                                       /*     (READ ACT)            */ 09850000
*     5 FP63SW1X     BIT(1),            /*   SWA MANAGER RETURNED    */ 09860000
*     5 FP63EV3E     BIT(1),            /*   SYSEVENT CALLED         */ 09870000
*                                       /*     (INITATT)             */ 09880000
*     5 FP63EV3X     BIT(1),            /*   SYSEVENT RETURNED       */ 09890000
*     5 FP63VR0E     BIT(1),            /*   Get Virt Rgn called @P2A*/ 09891000
*                                       /*     (default request) @P2A*/ 09895000
*     5 FP63VR0X     BIT(1),            /*   Get Virtual Region  @P2A*/ 09896000
*                                       /*     returned          @P2A*/ 09897000
*     5 *            BIT(1),            /*   1 unused            @P2C*/ 09899000
*     5 FP63STM      BIT(1),            /*   STEP TIME SAVED         */ 09930000
*     5 FP63EX3      BIT(1),            /*   POST-INVOCATN EXIT TAKEN*/ 09940000
*     5 FP63VR1E     BIT(1),            /*   GET VIRTUAL RGN CALLED  */ 09950000
*                                       /*     (V=R PROCESSING)      */ 09960000
*     5 FP63VR1X     BIT(1),            /*   GET VIRT RGN RETURNED   */ 09970000
*     5 *            BIT(6),            /*                           */ 09980000
*     5 FP63EV4E     BIT(1),            /*   SYSEVENT CALLED         */ 09990000
*                                       /*     (INITDET)             */ 10000000
*     5 FP63EV4X     BIT(1),            /*   SYSEVENT RETURNED       */ 10010000
*     5 FP63EV5E     BIT(1),            /*   SYSEVENT CALLED         */ 10020000
*                                       /*     (INITDET)             */ 10030000
*     5 FP63EV5X     BIT(1),            /*   SYSEVENT RETURNED       */ 10040000
*     5 FP63VR2E     BIT(1),            /*   GET VIRTUAL RGN CALLED  */ 10050000
*                                       /*     (V=V PROCESSING)      */ 10060000
*     5 FP63VR2X     BIT(1),            /*   GET VIRT RGN RETURNED   */ 10070000
*     5 FP63DET      BIT(1),            /*   JOB STEP DETACHED       */ 10080000
*     5 *            BIT(1),            /*                           */ 10090000
*     5 FP63BALE     BIT(1),            /*   CALLED EXIT VIA BALR    */ 10100000
*     5 FP63BALX     BIT(1),            /*   RETURNED FROM EXIT      */ 10110000
*     5 FP63LNKE     BIT(1),            /*   CALLED EXIT VIA LINK    */ 10120000
*     5 FP63LNKX     BIT(1),            /*   RETURNED FROM EXIT      */ 10130000
*     5 FP63XCTE     BIT(1),            /*   CALL EXIT VIA XCTL  @L1A*/ 10140000
*     5 *            BIT(11),           /*                       @L5C*/ 10150000
*                                       /*                           */ 10160000
*                                       /*                           */ 10170000
*   3 FP164       BIT(32),              /* IEFSD164 FOOTPRINT BITS   */ 10180000
*     5 FP64WRM      BIT(1),            /*   PROCESSING WARMSTART    */ 10190000
*     5 FP64ALO      BIT(1),            /*   ABEND FOR ALLOCATE ERROR*/ 10200000
*     5 FP64FCL      BIT(1),            /*   FETCHLIB CLOSE & FREE   */ 10210000
*     5 FP64GTP      BIT(1),            /*   GOT TERMINATE PARM LIST */ 10220000
*     5 FP64STC      BIT(1),            /*   JOB/STEPLIB CLOSE & FREE*/ 10230000
*     5 FP64SW1E     BIT(1),            /*   SWA MANAGER CALLED      */ 10240000
*                                       /*     (READ ACT)            */ 10250000
*     5 FP64SW1X     BIT(1),            /*   SWA MANAGER RETURNED    */ 10260000
*     5 FP64SW2E     BIT(1),            /*   SWA MANAGER CALLED      */ 10270000
*                                       /*     (WRITE ACT)           */ 10280000
*     5 FP64SW2X     BIT(1),            /*   SWA MANAGER RETURNED    */ 10290000
*     5 FP64TIM      BIT(1),            /*   JOB/STEP TIMES COMPUTED */ 10300000
*     5 FP64DTC      BIT(1),            /*   GOT DUMMY TCB           */ 10310000
*     5 FP64SW3E     BIT(1),            /*   SWA MANAGER CALLED      */ 10320000
*                                       /*     (JOURNAL CNTL BLOCKS) */ 10330000
*     5 FP64SW3X     BIT(1),            /*   SWA MANAGER RETURNED    */ 10340000
*     5 FP64UALE     BIT(1),            /*   UNALLOCATION CALLED     */ 10350000
*     5 FP64UALX     BIT(1),            /*   UNALLOCATION RETURNED   */ 10360000
*     5 FP64SW4E     BIT(1),            /*   SWA MANAGER CALLED      */ 10370000
*                                       /*     (JOURNAL CNTL BLOCKS) */ 10380000
*     5 FP64SW4X     BIT(1),            /*   SWA MANAGER RETURNED    */ 10390000
*     5 FP64FTC      BIT(1),            /*   FREED DUMMY TCB         */ 10400000
*     5 FP64FTP      BIT(1),            /*   FREED TERM PARM LIST    */ 10410000
*     5 FP64CLRE     BIT(1),            /*   CLEAR JES MSGS CALLED   */ 10420000
*     5 FP64CLRX     BIT(1),            /*   CLEAR JES MSGS RETURNED */ 10430000
*     5 FP64SW5E     BIT(1),            /*   SWA MANAGER CALLED      */ 10440000
*                                       /*     (READ NEXT STC)       */ 10450000
*     5 FP64SW5X     BIT(1),            /*   SWA MANAGER RETURNED    */ 10460000
*     5 FP64STRE     BIT(1),            /*   IEFINSTR called     @D2C*/ 10470000
*     5 FP64STRX     BIT(1),            /*   IEFINSTR returned   @D2A*/ 10480000
*     5 *            BIT(7),            /*                       @D2C*/ 10490000
*                                       /*                           */ 10500000
*   3 FPCPU       BIT(8),               /* IEFICPUA FOOTPRINT BITS   */ 10510000
*     5 FPCPENQ      BIT(1),            /*   ENQ ON SYSZCSD          */ 10520000
*     5 FPCPDEQ      BIT(1),            /*   DEQ ON SYSZCSD          */ 10530000
*     5 *            BIT(6),            /*                           */ 10540000
*                                       /*                           */ 10550000
*   3 FPMSK       BIT(8),               /* IEFIMASK FOOTPRINT BITS   */ 10560000
*     5 FPMSSCN      BIT(1),            /*   BIT STRING SCANNED      */ 10570000
*     5 *            BIT(7),            /*                           */ 10580000
*                                       /*                           */ 10590000
*   3 FPCND       BIT(8),               /* IEFINCND Footprints   @01A*/ 10600000
*     5 FPCNWIFB     BIT(1),            /* Indicate call for Write      10610000
*                                          modified IFB          @01A*/ 10620000
*     5 FPCNPMSE     BIT(1),            /* Indicate call to IEFTB723    10630000
*                                          to issue message      @01A*/ 10640000
*     5 FPCNPMSX     BIT(1),            /* Indicate return from         10650000
*                                          IEFTB723 to issue message    10660000
*                                                                @01A*/ 10670000
*     5 *            BIT(5),            /*                       @01A*/ 10680000
*                                       /*                           */ 10690000
*   3 FPSWD       BIT(16),              /* IEFINSWD Footprints   @L5C*/ 10711000
*     5 FPSWDE       BIT(1),            /* IEFINSWD entered      @04A*/ 10712000
*     5 FPSDLCT      BIT(1),            /* SWA pointers reset in LCT    10713000
*                                                                @04A*/ 10714000
*     5 FPSDSWME     BIT(1),            /* Called SWA Manager Subpool   10715000
*                                          Delete                @04A*/ 10716000
*     5 FPSDSWMX     BIT(1),            /* SWA Manager Subpool Delete   10717000
*                                          returned              @04A*/ 10718000
*     5 FPSDJSCB     BIT(1),            /* JSCB processing done  @04A*/ 10719000
*     5 FPSDCIB      BIT(1),            /* CIB processing done   @04A*/ 10719100
*     5 FPSDCSCB     BIT(1),            /* CSCB processing done  @04A*/ 10719200
*     5 FPSWDX       BIT(1),            /* IEFINSWD exited       @04A*/ 10719300
*     5 FPSDVSME     BIT(1),            /* VSM invoked           @L5A*/ 10719400
*     5 FPSDVSMX     BIT(1),            /* VSM returned          @L5A*/ 10719500
*     5 FPSDVAT      BIT(1),            /* VAT freed             @L5A*/ 10719600
*     5 *            BIT(5),            /*                       @L5A*/ 10719700
*                                       /*                           */ 10719800
*   3 FPWTE       BIT(16),              /* IEFINWTE Footprints   @L5C*/ 10719900
*     5 FPWEDSP      BIT(1),            /* Task dispatchable     @L3A*/ 10720000
*     5 FPWECNL      BIT(1),            /* Task canceled         @L3A*/ 10720100
*     5 FPWEEND      BIT(1),            /* Task ended            @L3A*/ 10720200
*     5 FPWEOPEN     BIT(1),            /* OPEN/MVS function request    10720300
*                                                                @L4C*/ 10720400
*     5 FPWESWAC     BIT(1),            /* Call SWA Manager Assign      10720500
*                                                                @L3A*/ 10720600
*     5 FPWESWAE     BIT(1),            /* SWA Manager Assign exited    10720700
*                                                                @L3A*/ 10720800
*     5 FPWESWWC     BIT(1),            /* Call SWA Manager Write       10720900
*                                                                @L3A*/ 10721000
*     5 FPWESWWE     BIT(1),            /* SWA Manager Write exited     10721100
*                                                                @L3A*/ 10721200
*     5 *            BIT(8),            /*                       @L5A*/ 10721300
*                                       /*                           */ 10721400
*   3 FPSTR       BIT(8),               /* IEFINSTR Footprints   @L6C*/ 10721500
*     5 FPSTRUNE     BIT(1),            /* ATBUNID called        @L6A*/ 10721520
*     5 FPSTRUNX     BIT(1),            /* ATBUNID returned      @L6A*/ 10721530
*     5 FPSTRAME     BIT(1),            /* ATBAMR1 called        @L6A*/ 10721540
*     5 FPSTRAMX     BIT(1),            /* ATBAMR1 returned      @L6A*/ 10721550
*     5 FPSTRMPE     BIT(1),            /* BPX1MPC called        @L6A*/ 10721560
*     5 FPSTRMPX     BIT(1),            /* BPX1MPC returned      @L6A*/ 10721570
*     5 *            BIT(2),            /*                       @L6A*/ 10721580
*                                       /*                           */ 10721590
*   3 *           BIT(8),               /* Reserved              @L3A*/ 10721600
*   3 *           BIT(8),               /* Reserved              @L3A*/ 10721700
*   3 *           BIT(8),               /* Reserved              @L5A*/ 10721800
*   3 *           BIT(8),               /* Reserved              @L5A*/ 10721900
*   3 *           BIT(8),               /* Reserved              @L5A*/ 10722000
*   3 *           BIT(8),               /* Reserved              @L5A*/ 10722100
*   3 *           BIT(8),               /* Reserved              @L5A*/ 10722200
*   3 *           CHAR(0)  BDY(WORD);   /* FORCE FULL WORD LENGTH    */ 10723000
*                                       /*                           */ 10730000
* DCL                                   /*                           */ 10740000
*   FPHDR CHAR(8) CONSTANT('INITFPNT'); /* FOOTPRINT HEADER          */ 10750000
