*/********************************************************************/ 00050000
*/*                                                                  */ 00100000
*/*       SUBSYSTEM OPTIONS BLOCK (SSOB)                             */ 00150000
*/*                                                                  */ 00200000
*/********************************************************************/ 00250000
* /*                                                                 */ 00300000
* /*  STATUS - FUNCTIONAL EXTENSIONS SPLIT OFF INTO SEPARATE @ZA34144*/ 00350000
* /*           MACROS                                        @ZA34144*/ 00400000
* /*                                                                 */ 00450000
* /*  THE SSOB IS USED TO REQUEST A PARTICULAR FUNCTION FROM         */ 00500000
* /*  A VS/2 SUBSYSTEM.  THE FORMAT OF THIS CONTROL BLOCK IS A FIXED */ 00550000
* /*  LENGTH HEADER SECTION WHICH POINTS TO A FUNCTION DEPENDENT     */ 00600000
* /*  SECTION.                                                       */ 00650000
* /*                                                                 */ 00700000
* /*  THE PARTICULAR FUNCTION REQUESTED IS INDICATED BY A FUNCTION   */ 00750000
* /*  ID IN THE HEADER.  PLS/2 CONSTANTS DEFINE THE VARIOUS ID'S.    */ 00800000
* /*                                                                 */ 00850000
* /*  MACRO VARIABLES ARE DEFINED TO CONTROL THE INNER MACRO @ZA34144*/ 00900000
* /*  CALLING OF THE SSOB HEADER AND FUNCTIONAL EXTENSIONS.  @ZA34144*/ 00950000
* /*  TO OBTAIN THE HEADER, SET THE VARIABLE 'SSOBSSOB' TO ANY NON-  */ 01000000
* /*  NULL/BLANK CHARACTER, E.G., %SSOBSSOB = 'BASED'.               */ 01050000
* /*  THIS VALUE WILL BE USED TO ASSIGN ATTRIBUTES TO THE SSOB.      */ 01100000
* /*  %SSOBSSOB = 'BDY(WORD)' WILL CAUSE PL/S TO GET                 */ 01150000
* /*  STORAGE FOR THE SSOB. THE ATTRIBUTES OF THE FUNCTION           */ 01200000
* /*  DEPENDENT SECTIONS ARE SIMILARLY SET.                          */ 01250000
* /*                                                                 */ 01300000
* /*  CONSTANTS DEFINING THE POSSIBLE VALUES OF SSOBRETN ARE         */ 01350000
* /*  GENERATED WITH EACH FUNCTION DEPENDENT SECTION THE             */ 01400000
* /*  VARIABLES WHICH CAN BE SET TO OBTAIN THE FUNCTION DEPENDENT    */ 01450000
* /*  SECTIONS ARE -                                                 */ 01500000
* /*                                                                 */ 01550000
* /*      SSOBSO - ACCESS SYSOUT DATA SETS                           */ 01600000
* /*      SSOBCS - FIND THE STATUS OF A JOB, OR CANCEL A JOB         */ 01650000
* /*               %CSARAYSZ DEFINES THE SIZE OF THE C/S ARRAY       */ 01700000
* /*               -SET %CSARAYSZ='*' IF THE C/S EXTENSION IS        */ 01750000
* /*                MAPPING STORAGE.                                 */ 01800000
* /*               -SET %CSARAYSZ TO THE ACTUAL ARRAY SIZE IF        */ 01850000
* /*                PLS IS GETTING STORAGE.                          */ 01900000
* /*      SSOBJS - SUBSYSTEM JOB SELECTION                           */ 01950000
* /*      SSOBAL - ALLOCATION/UNALLOCATION OF SYSOUT DATA SETS       */ 02000000
* /*      SSOBEN - NOTIFY SUBSYSTEM OF END OF MEMORY                 */ 02050000
* /*      SSOBET - NOTIFY SUBSYSTEM OF END OF TASK                   */ 02100000
* /*      SSOBWT - NOTIFY SUBSYSTEM OF A WRITE TO OPERATOR           */ 02150000
* /*      SSOBCM - NOTIFY SUBSYSTEM OF AN OPERATOR COMMAND           */ 02200000
* /*      SSOBUS - REQUEST SUBSYSTEM TO VERIFY A REMOTE DESTINATION  */ 02250000
* /*      SSOBJT - NOTIFY SUBSYSTEM OF JOB TERMINATION               */ 02300000
* /*      SSOBRQ - REQUEST SUBSYSTEM TO RE-ENQUEUE A JOB             */ 02350000
* /*      SSOBDM - REQUEST SUBSYSTEM TO DELETE OPERATOR MESSAGE      */ 02400000
* /*      SSOBVS - REQUEST (MSTR) SUBSYSTEM TO VERIFY SUBSYSTEM NAME */ 02450000
* /*      SSOBDA - OPEN/CLOSE/CHECKPOINT RESTART                     */ 02500000
* /*      SSOBRR - REQUEST/RETURN JOBID                              */ 02550000
* /*      SSOBCF - FAILING SVC34 COMMAND                     @Z30BPSV*/ 02600000
* /*      SSOBSI - NOTIFY SUBSYSTEM OF STEP INITIATION       @Y02BPSD*/ 02650000
* /*      SSOBDY - DYNAMIC ALLOCATION/JES3 EXIT              @Y02BPSD*/ 02700000
* /*      SSOBCA - COMMON ALLOCATION/JES3 EXIT               @Y02BPSD*/ 02750000
* /*      SSOBCU - COMMON UNALLOCATION/JES3 EXIT             @Y02BPSD*/ 02800000
* /*      SSOBDD - CHANGE DDNAME/JES3 EXIT                   @Y02BPSD*/ 02850000
* /*      SSOBNQ - CHANGE ENQ USE ATTRIBUTE/JES3 EXIT        @Y02BPSD*/ 02900000
* /*      SSOBDR - DYNAMIC DEVICE RECONFIGURATION/JES3 EXIT  @Y02BPSD*/ 02950000
* /*      SSOBMO - MASS STORAGE VOLUME CONTROL JES3 EXIT     @G18MP21*/ 03000000
* /*      SSOBMS - MSSC MESSAGE TASK JES3 EXIT               @G18MP21*/ 03050000
* /*      SSOBCI - CONVERTER SUBSYS KEYWORD EXIT             @G29AN2F*/ 03100000
* /*      SSOBAG - ALLOCATION GROUP SUBSYSTEM REQUESTS       @G29AN2F*/ 03150000
* /*                                                                 */ 03200000
* /*                                                                 */ 03250000
* /*******************************************************************/ 03300000
*  %GOTO PLSSSOB;                 /*                                    03350000
         MACRO                                                          03400000
         IEFJSSOB &EXT,&CONTIG=                                         03450000
.********************************************************************** 03500000
.*                                                                      03550000
.*  MACRO NAME = IEFJSSOB                                               03600000
.*                                                                      03650000
.*  DESCRIPTIVE NAME = SUBSYSTEM OPTIONS BLOCK (SSOB) MAPPING           03700000
.*                     GENERATOR                                        03750000
.*                                                                      03800000
.*  FUNCTION = GENERATE MAPPING FOR THE SSOB                            03850000
.*                                                                      03900000
.*  OPERATION = THE SSOB CONSISTS OF TWO PARTS - A FIXED HEADER         03950000
.*              AND A VARIABLE EXTENSION THAT IDENTIFIES INFORMATION    04000000
.*              PERTINANT TO THE FUNCTION BEING REQUESTED.              04050000
.*                                                                      04100000
.*              THE ISSUER OF IEFJSSOB MAY REQUEST THE FIXED HEADER     04150000
.*              ONLY OR THE HEADER PLUS ANY OF THE SSOB EXTENSIONS.     04200000
.*              ADDITIONALLY, THE ISSUER MAY SPECIFY WHETHER THE        04250000
.*              EXTENSION IS TO BE CONTIGUOUS WITH THE FIXED HEADER.    04300000
.*              IF IT IS TO BE CONTIGUOUS, NO DSECT CARD IS GENERATED   04350000
.*              BETWEEN THE HEADER AND EXTENSIONS.  OTHERWISE, A        04400000
.*              DSECT CARD IS GENERATED.                                04450000
.*                                                                      04500000
.*              EACH EXTENSION AFTER THE FIRST IS ORG'ED BACK TO THE    04550000
.*              BEGINNING OF THE FIRST EXTENSION.                       04600000
.*                                                                      04650000
.*  INPUT = &EXT - A SUBLIST OF 2-CHARACTER SSOB EXTENSION              04700000
.*                 IDENTIFIERS.  AN EXTENSION MAPPING IS GENERATED      04750000
.*                 FOR EACH ID SPECIFIED.  IF &EXT IS NOT SPECIFIED,    04800000
.*                 ONLY THE SSOB HEADER IS GENERATED.                   04850000
.*                                                                      04900000
.*          &CONTIG - A KEYWORD PARAMETER WITH VALID VALUES OF          04950000
.*                 YES OR NO.  IF NOT SPECIFIED, THE DEFAULT IS         05000000
.*                 YES.  'YES' CAUSES THE EXTENSION TO BE CONTIGUOUS    05050000
.*                 WITH THE HEADER (NO DSECT CARD IS GENERATED).        05100000
.*                 'NO' GENERATES A DSECT CARD.                         05150000
.*                                                                      05200000
.*  EXIT-NORMAL                                                         05250000
.*    CONDITIONS = SSOB MAPPING IS GENERATED                            05300000
.*    OUTPUT = SSOB HEADER AND OPTIONAL EXTENSIONS                      05350000
.*                                                                      05400000
.*  EXIT-ERROR                                                          05450000
.*    CONDITIONS = -INVALID &CONTIG PARAMETER                           05500000
.*                 -INVALID &EXT PARAMETER                              05550000
.*                 -DUPLICATE &EXT PARAMETERS SPECIFIED                 05600000
.*    OUTPUT = NO MAPPING IS GENERATED                                  05650000
.*                                                                      05700000
.*  CHANGE ACTIVITY = Y02668,YM02677,YM02726,Y02886,YM04976,YM06023,    05750000
.*                    YM06036,@Y30OPSD,@Y02BPSD,Z30CPPH,Z309PSV,ZM30478 05800000
.*                    OZ03626,OZ08725,OZ04791,OZ06466,OZ06623           05850000
.*                    @G18MP21,G29AN2F,ZM44655,OZ28624         @ZA28624 05900000
.*                    OZ34144                                  @ZA34144 05950000
.* WE ARE NO LONGER UPDATING THE ABOVE CHANGE ACTIVITY FIELD       @P1A 05962500
.*                                                                      05975000
.*  $P1= PKB3427  HBB4430  920617 PDPS: ADDED COMMENT DELIMITER    @P1A 05987500
.*                                                                      06000000
.*  MNOTES = 'CONTIG=&CONTIG - INVALID PARAMETER'                       06050000
.*           '&EXT(&K) - INVALID PARAMETER'                             06100000
.*           '&EXT(&K) - DUPLICATE PARAMETERS'                          06150000
.*                                                                      06200000
.*  SEVERITY CODES = 12 FOR ALL MNOTES                                  06250000
.*                                                                      06300000
.********************************************************************** 06350000
*********************************************************************** 06400000
*                                                                     * 06450000
*               SUBSYSTEM OPTIONS BLOCK (SSOB)                        * 06500000
*                                                                     * 06550000
*********************************************************************** 06600000
*                                                                       06650000
*  STATUS - FUNCTIONAL EXTENSIONS SPLIT OFF INTO SEPERATE      @ZA34144 06700000
*             MACROS                                           @ZA34144 06750000
*                                                                       06800000
*  THE SUBSYSTEM OPTIONS BLOCK (SSOB) IS USED TO REQUEST A              06850000
*  PARTICULAR FUNCTION FROM A VS/2 SUBSYSTEM.  THE FORMAT IS            06900000
*  A FIXED LENGTH HEADER SECTION FOLLOWED BY A FUNCTION-DEPENDENT       06950000
*  EXTENSION.                                                           07000000
*                                                                       07050000
*  THE MACRO CALL IS OF THE FOLLOWING FORM -                            07100000
*                                                                       07150000
*        IEFJSSOB (EXTID1,EXTID2,...),CONTIG=YES/NO                     07200000
*                                                                       07250000
*        EXTID1,...                                                     07300000
*        THE EXTENSION IDS SPECIFY WHICH FUNCTION-DEPENDENT             07350000
*        EXTENSIONS ARE TO BE GENERATED.                                07400000
*        IF NO EXTENSION IDS ARE SPECIFIED, ONLY THE SSOB FIXED         07450000
*        HEADER IS GENERATED.                                           07500000
*                                                                       07550000
*        CONTIG=NO - RESULTS IN A DSECT CARD BEING GENERATED            07600000
*        BETWEEN THE FIXED HEADER AND THE EXTENSION.                    07650000
*                                                                       07700000
*        CONTIG=YES - RESULTS IN THE EXTENSION BEING CONTIGUOUS         07750000
*        WITH THE FIXED HEADER. (ALSO THE DEFAULT)                      07800000
*                                                                       07850000
*  THE FOLLOWING EXTENSION IDS GENERATE THE INDICATED FUNCTION-         07900000
*  DEPENDENT EXTENSIONS -                                               07950000
*                                                                       08000000
*        SO - ACCESS SYSOUT DATA SETS                                   08050000
*        CS - FIND THE STATUS OF A JOB, CANCEL A JOB                    08100000
*        JS - SUBSYSTEM JOB SELECTION                                   08150000
*        AL - ALLOCATION/UNALLOCATION OF SYSOUT DATA SETS               08200000
*        EN - NOTIFY SUBSYSTEM OF END OF MEMORY                         08250000
*        ET - NOTIFY SUBSYSTEM OF END OF TASK                           08300000
*        WT - NOTIFY SUBSYSTEM OF A WRITE TO OPERATOR                   08350000
*        CM - NOTIFY SUBSYSTEM OF AN OPERATOR COMMAND                   08400000
*        US - REQUEST SUBSYSTEM TO VERIFY A REMOTE DESTINATION          08450000
*        JT - NOTIFY SUBSYSTEM OF JOB TERMINATION                       08500000
*        RQ - REQUEST SUBSYSTEM TO RE-ENQUEUE A JOB                     08550000
*        DM - REQUEST SUBSYSTEM TO DELETE OPERATOR MESSAGE              08600000
*        VS - REQUEST SUBSYSTEM (MASTER) TO VERIFY SUBSYSTEM NAME       08650000
*        DA - OPEN/CLOSE/CHECKPOINT RESTART                             08700000
*        RR - REQUEST/RETURN JOBID                                      08750000
*        CF - FAILING SVC34 COMMAND                            @Z30BPSV 08800000
*        SI - NOTIFY SUBSYSTEM OF STEP INITIATION              @Y02BPSD 08850000
*        DY - DYNAMIC ALLOCATION/JES3 EXIT                     @Y02BPSD 08900000
*        CA - COMMON ALLOCATION/JES3 EXIT                      @Y02BPSD 08950000
*        CU - COMMON UNALLOCATION/JES3 EXIT                    @Y02BPSD 09000000
*        DD - CHANGE DDNAME/JES3 EXIT                          @Y02BPSD 09050000
*        NQ - CHANGE ENQ USE ATTRIBUTE/JES3 EXIT               @Y02BPSD 09100000
*        DR - DYNAMIC DEVICE RECONFIGURATION/JES3 EXIT         @Y02BPSD 09150000
*        MO - MASS STORAGE VOLUME CONTROL JES3 EXIT            @G18MP21 09200000
*        MS - MSSC MESSAGE TASK JES3 EXIT                      @G18MP21 09250000
*        CI - CONVERTER SUBSYS KEYWORD EXIT                    @G29AN2F 09300000
*        AG - ALLOCATION GROUP SUBSYSTEM REQUESTS              @G29AN2F 09350000
*                                                                       09400000
*********************************************************************** 09450000
.*                                                                      09500000
.*  &N - NUMBER OF SSOB EXTENSIONS REQUESTED                            09550000
.*  &I - GENERATE NO DSECT CARD INDICATOR                               09600000
.*  &J - FIRST PASS, SECOND PASS INDICATOR                              09650000
.*  &K - CURRENT EXTENSION ID SUBSCRIPT                                 09700000
.*  &M - EXTENSION ID HAS BEEN PREVIOUSLY SPECIFIED INDICATORS.         09750000
.*       SUBSCRIPT OF 100 IS USED.  WHEN SSOB EXTENSIONS REACH 101,     09800000
.*       THIS NUMBER SHOULD BE UPDATED.                                 09850000
.*  &L - 'EXTENSION ID HAS PREVIOUSLY SPECIFIED' SUBSCRIPT              09900000
.*                                                                      09950000
         LCLA  &N,&J,&K,&L                                              10000000
         LCLB  &I                                                       10050000
         LCLB  &M(100)                                                  10100000
.*  CHECK IF CONTIG PARAMETER WAS SPECIFIED-IF NOT, DEFAULT IS YES      10150000
         AIF   ('&CONTIG' EQ '').NODSECT                                10200000
.*                                                                      10250000
.*  CHECK IF CONTIG=YES WAS SPECIFIED (DONT GENERATE DSECT CARD         10300000
.*  FOR THE SSOB EXTENSION)                                             10350000
.*                                                                      10400000
         AIF   ('&CONTIG' EQ 'YES').NODSECT                             10450000
.*                                                                      10500000
.*  CHECK IF CONTIG=NO WAS SPECIFIED (GENERATE DSECT CARD FOR           10550000
.*  THE SSOB EXTENSION)                                                 10600000
.*                                                                      10650000
         AIF   ('&CONTIG' NE 'NO').ERR1                                 10700000
.*  SET INDICATOR TO GENERATE DSECT CARD                                10750000
&I       SETB  0                                                        10800000
         AGO   .CKEXT                                                   10850000
.*  SET INDICATOR TO NOT GENERATE DSECT CARD                            10900000
.NODSECT ANOP                                                           10950000
&I       SETB  1                                                        11000000
.*                                                                      11050000
.*  CHECK IF EXTENSION ID PARAMETER WAS SPECIFIED                       11100000
.*                                                                      11150000
.CKEXT   ANOP                                                           11200000
&N       SETA  N'&EXT                                                   11250000
         AIF   (&N EQ 0).GENHDR                                         11300000
.*  SET FIRST PASS SYNTAX CHECK INDICATOR                               11350000
&J       SETA  1                                                        11400000
.*  INITIALIZE EXTENSION ID SUBSCRIPT                                   11450000
&K       SETA  1                                                        11500000
.*  CHECK FOR VALID EXTENSION ID PARAMETERS                             11550000
.EXTIDCK ANOP                                                           11600000
         AIF   ('&EXT(&K)' EQ 'SO').SOCHK                               11650000
         AIF   ('&EXT(&K)' EQ 'CS').CSCHK                               11700000
         AIF   ('&EXT(&K)' EQ 'JS').JSCHK                               11750000
         AIF   ('&EXT(&K)' EQ 'AL').ALCHK                               11800000
         AIF   ('&EXT(&K)' EQ 'EN').ENCHK                               11850000
         AIF   ('&EXT(&K)' EQ 'WT').WTCHK                               11900000
         AIF   ('&EXT(&K)' EQ 'CM').CMCHK                               11950000
         AIF   ('&EXT(&K)' EQ 'US').USCHK                               12000000
         AIF   ('&EXT(&K)' EQ 'JT').JTCHK                               12050000
         AIF   ('&EXT(&K)' EQ 'RQ').RQCHK                               12100000
         AIF   ('&EXT(&K)' EQ 'DM').DMCHK                               12150000
         AIF   ('&EXT(&K)' EQ 'VS').VSCHK                               12200000
         AIF   ('&EXT(&K)' EQ 'DA').DACHK                               12250000
         AIF   ('&EXT(&K)' EQ 'ET').ETCHK                               12300000
         AIF   ('&EXT(&K)' EQ 'RR').RRCHK                               12350000
         AIF   ('&EXT(&K)' EQ 'SI').SICHK                      @Y02BPSD 12400000
         AIF   ('&EXT(&K)' EQ 'DY').DYCHK                      @Y02BPSD 12450000
         AIF   ('&EXT(&K)' EQ 'CA').CACHK                      @Y02BPSD 12500000
         AIF   ('&EXT(&K)' EQ 'CU').CUCHK                      @Y02BPSD 12550000
         AIF   ('&EXT(&K)' EQ 'DD').DDCHK                      @Y02BPSD 12600000
         AIF   ('&EXT(&K)' EQ 'NQ').NQCHK                      @Y02BPSD 12650000
         AIF   ('&EXT(&K)' EQ 'DR').DRCHK                      @Z30BPSV 12700000
         AIF   ('&EXT(&K)' EQ 'CF').CFCHK                      @Z30BPSV 12750000
         AIF   ('&EXT(&K)' EQ 'MO').MOCHK                      @G18MP21 12800000
         AIF   ('&EXT(&K)' EQ 'MS').MSCHK                      @G18MP21 12850000
         AIF   ('&EXT(&K)' EQ 'CI').CICHK                      @G29AN2F 12900000
         AIF   ('&EXT(&K)' EQ 'AG').AGCHK                      @G29AN2F 12950000
.*                                                                      13000000
.*  IF ADDITIONAL SSOB EXTENSIONS ARE DEFINED, THE CORRESPONDING        13050000
.*  EXTENSION ID CHECK SHOULD BE ADDED HERE.                            13100000
.*                                                                      13150000
.*  INVALID EXTENSION ID SPECIFIED - GO ISSUE MNOTE (THIS BRANCH        13200000
.*  SHOULD NEVER OCCUR ON PASS 2)                                       13250000
.*                                                                      13300000
         AGO   .ERR2                                                    13350000
.*                                                                      13400000
.*  FOLLOWING ARE EXTENSION ID PARAMETER ROUTINES -                     13450000
.*    IF PASS 1 - SET SUBSCRIPT FOR DUPLICATE PARAMETER CHECK           13500000
.*              - GO TO COMMON ROUTINE TO CHECK IF THIS PARAMETER       13550000
.*                HAS ALREADY BEEN SPECIFIED.                           13600000
.*                                                                      13650000
.*    IF PASS 2 - GO GENERATE EXTENSION SPECIFIED.                      13700000
.*                                                                      13750000
.SOCHK   ANOP                                                           13800000
         AIF   (&J EQ 2).GENSO                                          13850000
&L       SETA  1                                                        13900000
         AGO   .DUPARM                                                  13950000
.CSCHK   ANOP                                                           14000000
         AIF   (&J EQ 2).GENCS                                          14050000
&L       SETA  2                                                        14100000
         AGO   .DUPARM                                                  14150000
.JSCHK   ANOP                                                           14200000
         AIF   (&J EQ 2).GENJS                                          14250000
&L       SETA  3                                                        14300000
         AGO   .DUPARM                                                  14350000
.ALCHK   ANOP                                                           14400000
         AIF   (&J EQ 2).GENAL                                          14450000
&L       SETA  4                                                        14500000
         AGO   .DUPARM                                                  14550000
.ENCHK   ANOP                                                           14600000
         AIF   (&J EQ 2).GENEN                                          14650000
&L       SETA  5                                                        14700000
         AGO   .DUPARM                                                  14750000
.WTCHK   ANOP                                                           14800000
         AIF   (&J EQ 2).GENWT                                          14850000
&L       SETA  6                                                        14900000
         AGO   .DUPARM                                                  14950000
.CMCHK   ANOP                                                           15000000
         AIF   (&J EQ 2).GENCM                                          15050000
&L       SETA  7                                                        15100000
         AGO   .DUPARM                                                  15150000
.USCHK   ANOP                                                           15200000
         AIF   (&J EQ 2).GENUS                                          15250000
&L       SETA  8                                                        15300000
         AGO   .DUPARM                                                  15350000
.JTCHK   ANOP                                                           15400000
         AIF   (&J EQ 2).GENJT                                          15450000
&L       SETA  9                                                        15500000
         AGO   .DUPARM                                                  15550000
.RQCHK   ANOP                                                           15600000
         AIF   (&J EQ 2).GENRQ                                          15650000
&L       SETA  10                                                       15700000
         AGO   .DUPARM                                                  15750000
.DMCHK   ANOP                                                           15800000
         AIF   (&J EQ 2).GENDM                                          15850000
&L       SETA  11                                                       15900000
         AGO   .DUPARM                                                  15950000
.VSCHK   ANOP                                                           16000000
         AIF   (&J EQ 2).GENVS                                          16050000
&L       SETA  12                                                       16100000
         AGO   .DUPARM                                                  16150000
.DACHK   ANOP                                                           16200000
         AIF   (&J EQ 2).GENDA                                          16250000
&L       SETA  13                                                       16300000
         AGO   .DUPARM                                                  16350000
.ETCHK   ANOP                                                           16400000
         AIF   (&J EQ 2).GENET                                          16450000
&L       SETA  14                                                       16500000
         AGO   .DUPARM                                                  16550000
.RRCHK   ANOP                                                           16600000
         AIF   (&J EQ 2).GENRR                                          16650000
&L       SETA  15                                                       16700000
         AGO   .DUPARM                                                  16750000
.SICHK   ANOP                                                           16800000
         AIF   (&J EQ 2).GENSI                                          16850000
&L       SETA  16                                                       16900000
         AGO   .DUPARM                                                  16950000
.DYCHK   ANOP                                                           17000000
         AIF   (&J EQ 2).GENDY                                          17050000
&L       SETA  17                                                       17100000
         AGO   .DUPARM                                                  17150000
.CACHK   ANOP                                                           17200000
         AIF   (&J EQ 2).GENCA                                          17250000
&L       SETA  18                                                       17300000
         AGO   .DUPARM                                                  17350000
.CUCHK   ANOP                                                           17400000
         AIF   (&J EQ 2).GENCU                                          17450000
&L       SETA  19                                                       17500000
         AGO   .DUPARM                                                  17550000
.DDCHK   ANOP                                                           17600000
         AIF   (&J EQ 2).GENDD                                          17650000
&L       SETA  20                                                       17700000
         AGO   .DUPARM                                                  17750000
.NQCHK   ANOP                                                           17800000
         AIF   (&J EQ 2).GENNQ                                          17850000
&L       SETA  21                                                       17900000
         AGO   .DUPARM                                                  17950000
.DRCHK   ANOP                                                           18000000
         AIF   (&J EQ 2).GENDR                                          18050000
&L       SETA  22                                                       18100000
         AGO   .DUPARM                                                  18150000
.CFCHK   ANOP                                                  @Z30BPSV 18200000
         AIF   (&J EQ 2).GENCF                                 @Z30BPSV 18250000
&L       SETA  23                                              @Z30BPSV 18300000
         AGO   .DUPARM                                         @Z30BPSV 18350000
.MOCHK   ANOP                                                  @G18MP21 18400000
         AIF   (&J EQ 2).GENMO                                 @G18MP21 18450000
&L       SETA  24                                              @G18MP21 18500000
         AGO   .DUPARM                                         @G18MP21 18550000
.MSCHK   ANOP                                                  @G18MP21 18600000
         AIF   (&J EQ 2).GENMS                                 @G18MP21 18650000
&L       SETA  25                                              @G18MP21 18700000
         AGO   .DUPARM                                         @G18MP21 18750000
.CICHK   ANOP                                                  @G29AN2F 18800000
         AIF   (&J EQ 2).GENCI                                 @G29AN2F 18850000
&L       SETA  26                                              @G29AN2F 18900000
         AGO   .DUPARM                                         @G29AN2F 18950000
.AGCHK   ANOP                                                  @G29AN2F 19000000
         AIF   (&J EQ 2).GENAG                                 @G29AN2F 19050000
&L       SETA  27                                              @G29AN2F 19100000
         AGO   .DUPARM                                         @G29AN2F 19150000
.*                                                                      19200000
.*  CODE FOR NEWLY DEFINED SSOB EXTENSIONS SHOULD BE ADDED HERE         19250000
.*                                                                      19300000
.*  CHECK IF PARAMETER HAS ALREADY BEEN SPECIFIED                       19350000
.DUPARM  ANOP                                                           19400000
         AIF   (&M(&L) EQ 1).ERR3                                       19450000
.*  INDICATE PARAMETER HAS BEEN SPECIFIED                               19500000
&M(&L)   SETB  1                                                        19550000
.*  HAVE ALL EXTENSION ID PARAMETERS BEEN CHECKED -                     19600000
         AIF   (&K EQ &N).PASS2                                         19650000
&K       SETA  &K+1                                                     19700000
.*  GO CHECK NEXT PARAMETER                                             19750000
         AGO   .EXTIDCK                                                 19800000
.*                                                                      19850000
.*  SET UP FOR PASS 2 - SSOB MAPPING GENERATION                         19900000
.*                                                                      19950000
.PASS2   ANOP                                                           20000000
.*  RESET INDEX                                                         20050000
&K       SETA  1                                                        20100000
.*  SET PASS 2 INDICATOR                                                20150000
&J       SETA  2                                                        20200000
.*  GO GENERATE SSOB HEADER                                             20250000
         AGO   .GENHDR                                                  20300000
.*                                                                      20350000
.*  GENERATE DSECT CARD IF SPECIFIED                                    20400000
.*                                                                      20450000
.GENDSCT ANOP                                                           20500000
         AIF   (&I EQ 1).SKPDSCT                                        20550000
SSOBEXT  DSECT                                                          20600000
.SKPDSCT ANOP                                                           20650000
SSOBGN   EQU   *                                                        20700000
         SPACE                                                          20750000
.*  GO GENERATE SSOB EXTENSIONS                                         20800000
         AGO   .EXTIDCK                                                 20850000
.*  CHECK IF MORE EXTENSIONS SHOULD BE GENERATED                        20900000
.GENMORE ANOP                                                           20950000
         AIF   (&K EQ &N).FINI                                          21000000
&K       SETA  &K+1                                                     21050000
         AGO   .EXTIDCK                                                 21100000
.FINI    ANOP                                                           21150000
         MEXIT                                                          21200000
.GENHDR  ANOP                                                           21250000
         EJECT                                                          21300000
         IEFSSOBH                                              @ZA34144 21350000
         AIF   (&N NE 0).GENDSCT                                        21400000
         MEXIT                                                          21450000
.GENSO   ANOP                                                           21500000
         EJECT                                                          21550000
         IEFSSSO                                               @ZA34144 21600000
         AGO   .GENMORE                                                 21650000
.GENCS   ANOP                                                           21700000
         EJECT                                                          21750000
         IEFSSCS                                               @ZA34144 21800000
         AGO   .GENMORE                                                 21850000
.GENJS   ANOP                                                           21900000
         EJECT                                                          21950000
         IEFSSJS                                               @ZA34144 22000000
         AGO   .GENMORE                                                 22050000
.GENAL   ANOP                                                           22100000
         EJECT                                                          22150000
         IEFSSAL                                               @ZA34144 22200000
         AGO   .GENMORE                                                 22250000
.GENEN   ANOP                                                           22300000
         EJECT                                                          22350000
         IEFSSEN                                               @ZA34144 22400000
         AGO   .GENMORE                                                 22450000
.GENWT   ANOP                                                           22500000
         EJECT                                                          22550000
         IEFSSWT                                               @ZA34144 22600000
         AGO   .GENMORE                                                 22650000
.GENCM   ANOP                                                           22700000
         EJECT                                                          22750000
         IEFSSCM                                               @ZA34144 22800000
         AGO   .GENMORE                                                 22850000
.GENUS   ANOP                                                           22900000
         EJECT                                                          22950000
         IEFSSUS                                               @ZA34144 23000000
         AGO   .GENMORE                                                 23050000
.GENJT   ANOP                                                           23100000
         EJECT                                                          23150000
         IEFSSJT                                               @ZA34144 23200000
         AGO   .GENMORE                                                 23250000
.GENRQ   ANOP                                                           23300000
         EJECT                                                          23350000
         IEFSSRQ                                               @ZA34144 23400000
         AGO   .GENMORE                                                 23450000
.GENDM   ANOP                                                           23500000
         EJECT                                                          23550000
         IEFSSDM                                               @ZA34144 23600000
         AGO   .GENMORE                                                 23650000
.GENVS   ANOP                                                           23700000
         EJECT                                                          23750000
         IEFSSVS                                               @ZA34144 23800000
         AGO   .GENMORE                                                 23850000
.GENDA   ANOP                                                           23900000
         EJECT                                                          23950000
         IEFSSDA                                               @ZA34144 24000000
         AGO   .GENMORE                                                 24050000
.GENET   ANOP                                                           24100000
         EJECT                                                          24150000
         IEFSSET                                               @ZA34144 24200000
         AGO   .GENMORE                                                 24250000
.GENRR   ANOP                                                           24300000
         EJECT                                                          24350000
         IEFSSRR                                               @ZA34144 24400000
         AGO   .GENMORE                                                 24450000
.GENCF   ANOP                                                           24500000
         EJECT                                                          24550000
         IEFSSCF                                               @ZA34144 24600000
         AGO   .GENMORE                                                 24650000
.GENSI   ANOP                                                           24700000
         EJECT                                                          24750000
         IEFSSSI                                               @ZA34144 24800000
         AGO   .GENMORE                                                 24850000
.GENDY   ANOP                                                           24900000
         EJECT                                                          24950000
         IEFSSDY                                               @ZA34144 25000000
         AGO   .GENMORE                                                 25050000
.GENCA   ANOP                                                           25100000
         EJECT                                                          25150000
         IEFSSCA                                               @ZA34144 25200000
         AGO   .GENMORE                                                 25250000
.GENCU   ANOP                                                           25300000
         EJECT                                                          25350000
         IEFSSCU                                               @ZA34144 25400000
         AGO   .GENMORE                                                 25450000
.GENDD   ANOP                                                           25500000
         EJECT                                                          25550000
         IEFSSDD                                               @ZA34144 25600000
         AGO   .GENMORE                                                 25650000
.GENNQ   ANOP                                                           25700000
         EJECT                                                          25750000
         IEFSSNQ                                               @ZA34144 25800000
         AGO   .GENMORE                                                 25850000
.GENDR   ANOP                                                           25900000
         EJECT                                                          25950000
         IEFSSDR                                               @ZA34144 26000000
         AGO   .GENMORE                                                 26050000
.GENMO   ANOP                                                           26100000
         EJECT                                                          26150000
         IEFSSMO                                               @ZA34144 26200000
         AGO   .GENMORE                                        @G18MP21 26250000
.GENMS   ANOP                                                  @G18MP21 26300000
         EJECT                                                 @G18MP21 26350000
         IEFSSMS                                               @ZA34144 26400000
         AGO   .GENMORE                                        @G18MP21 26450000
.GENCI   ANOP                                                  @G29AN2F 26500000
         EJECT                                                          26550000
         IEFSSCI                                               @ZA34144 26600000
         AGO   .GENMORE                                        @G29AN2F 26650000
.GENAG   ANOP                                                  @G29AN2F 26700000
         EJECT                                                 @G29AN2F 26750000
         IEFSSAG                                               @ZA34144 26800000
         AGO   .GENMORE                                        @G29AN2F 26850000
*********************************************************************** 26900000
.ERR1    ANOP                                                           26950000
         MNOTE 12,'CONTIG=&CONTIG - INVALID PARAMETER'                  27000000
         MEXIT                                                          27050000
.ERR2    ANOP                                                           27100000
         MNOTE 12,'&EXT(&K) - INVALID PARAMETER'                        27150000
         MEXIT                                                          27200000
.ERR3    ANOP                                                           27250000
         MNOTE 12,'&EXT(&K) - DUPLICATE PARAMETERS'                     27300000
         MEXIT                                                          27350000
         MEND                      */                                   27400000
*%PLSSSOB:;                                                             27450000
*%MACEJECT='@EJECT';                                                    27500000
*   %IF SSOBSSOB='' %THEN %GOTO SSOBHEND;                               27550000
*MACEJECT;                                                              27600000
* %INCLUDE SYSLIB(IEFSSOBH);                               /*@ZA34144*/ 27650000
*%SSOBHEND:;                                                            27700000
*   %IF SSOBSO='' %THEN %GOTO SSOBSOEN;                                 27750000
*MACEJECT;                                                              27800000
* %INCLUDE SYSLIB(IEFSSSO);                                /*@ZA34144*/ 27850000
*%SSOBSOEN:;                                                            27900000
*   %IF SSOBCS='' %THEN %GOTO SSOBCSEN;                                 27950000
*MACEJECT;                                                              28000000
* %INCLUDE SYSLIB(IEFSSCS);                                /*@ZA34144*/ 28050000
*%SSOBCSEN:;                                                            28100000
*   %IF SSOBJS='' %THEN %GOTO SSOBJSEN;                                 28150000
*MACEJECT;                                                              28200000
* %INCLUDE SYSLIB(IEFSSJS);                                /*@ZA34144*/ 28250000
*%SSOBJSEN:;                                                            28300000
*   %IF SSOBAL='' %THEN %GOTO SSOBALEN;                                 28350000
*MACEJECT;                                                              28400000
* %INCLUDE SYSLIB(IEFSSAL);                                /*@ZA34144*/ 28450000
*%SSOBALEN:;                                                            28500000
*   %IF SSOBEN='' %THEN %GOTO SSOBENEN;                                 28550000
*MACEJECT;                                                              28600000
* %INCLUDE SYSLIB(IEFSSEN);                                /*@ZA34144*/ 28650000
*%SSOBENEN:;                                                            28700000
*   %IF SSOBWT='' %THEN %GOTO SSOBWTEN;                                 28750000
*MACEJECT;                                                              28800000
* %INCLUDE SYSLIB(IEFSSWT);                                /*@ZA34144*/ 28850000
*%SSOBWTEN:;                                                            28900000
*   %IF SSOBCM='' %THEN %GOTO SSOBCMEN;                                 28950000
*MACEJECT;                                                              29000000
* %INCLUDE SYSLIB(IEFSSCM);                                /*@ZA34144*/ 29050000
*%SSOBCMEN:;                                                            29100000
*   %IF SSOBUS='' %THEN %GOTO SSOBUSEN;                                 29150000
*MACEJECT;                                                              29200000
* %INCLUDE SYSLIB(IEFSSUS);                                /*@ZA34144*/ 29250000
*%SSOBUSEN:;                                                            29300000
*   %IF SSOBJT='' %THEN %GOTO SSOBJTEN;                                 29350000
*MACEJECT;                                                              29400000
* %INCLUDE SYSLIB(IEFSSJT);                                /*@ZA34144*/ 29450000
*%SSOBJTEN:;                                                            29500000
*   %IF SSOBRQ='' %THEN %GOTO SSOBRQEN;                                 29550000
*MACEJECT;                                                              29600000
* %INCLUDE SYSLIB(IEFSSRQ);                                /*@ZA34144*/ 29650000
*%SSOBRQEN:;                                                            29700000
*   %IF SSOBDM='' %THEN %GOTO SSOBDMEN;                                 29750000
*MACEJECT;                                                              29800000
* %INCLUDE SYSLIB(IEFSSDM);                                /*@ZA34144*/ 29850000
*%SSOBDMEN:;                                                            29900000
*   %IF SSOBVS='' %THEN %GOTO SSOBVSEN;                                 29950000
*MACEJECT;                                                              30000000
* %INCLUDE SYSLIB(IEFSSVS);                                /*@ZA34144*/ 30050000
*%SSOBVSEN:;                                                            30100000
*   %IF SSOBDA='' %THEN %GOTO SSOBDAEN;                                 30150000
*MACEJECT;                                                              30200000
* %INCLUDE SYSLIB(IEFSSDA);                                /*@ZA34144*/ 30250000
*%SSOBDAEN:;                                                            30300000
*   %IF SSOBET='' %THEN                                                 30350000
*   %GO TO SSOBETEN;                                                    30400000
*MACEJECT;                                                              30450000
* %INCLUDE SYSLIB(IEFSSET);                                /*@ZA34144*/ 30500000
*%SSOBETEN:;                                                            30550000
*  %IF SSOBRR='' %THEN %GO TO SSOBRREN;                                 30600000
*MACEJECT;                                                              30650000
* %INCLUDE SYSLIB(IEFSSRR);                                /*@ZA34144*/ 30700000
*%SSOBRREN:;                                                            30750000
*  %IF SSOBCF='' % THEN                                                 30800000
*  %GO TO SSOBCFEN;                                                     30850000
*MACEJECT;                                                              30900000
* %INCLUDE SYSLIB(IEFSSCF);                                /*@ZA34144*/ 30950000
*%SSOBCFEN:;                                                            31000000
*   %IF SSOBSI='' %THEN                                                 31050000
*   %GO TO SSOBSIEN;                                                    31100000
*MACEJECT;                                                              31150000
* %INCLUDE SYSLIB(IEFSSSI);                                /*@ZA34144*/ 31200000
*%SSOBSIEN:;                                                            31250000
*   %IF SSOBDY='' %THEN                                                 31300000
*   %GO TO SSOBDYEN;                                                    31350000
*MACEJECT;                                                              31400000
* %INCLUDE SYSLIB(IEFSSDY);                                /*@ZA34144*/ 31450000
*%SSOBDYEN:;                                                            31500000
*   %IF SSOBCA='' %THEN                                                 31550000
*   %GO TO SSOBCAEN;                                                    31600000
*MACEJECT;                                                              31650000
* %INCLUDE SYSLIB(IEFSSCA);                                /*@ZA34144*/ 31700000
*%SSOBCAEN:;                                                            31750000
*   %IF SSOBCU='' %THEN                                                 31800000
*   %GO TO SSOBCUEN;                                                    31850000
*MACEJECT;                                                              31900000
* %INCLUDE SYSLIB(IEFSSCU);                                /*@ZA34144*/ 31950000
*%SSOBCUEN:;                                                            32000000
*   %IF SSOBDD='' %THEN                                                 32050000
*   %GO TO SSOBDDEN;                                                    32100000
*MACEJECT;                                                              32150000
* %INCLUDE SYSLIB(IEFSSDD);                                /*@ZA34144*/ 32200000
*%SSOBDDEN:;                                                            32250000
*   %IF SSOBNQ='' %THEN %GOTO SSOBNQEN;                                 32300000
*MACEJECT;                                                              32350000
* %INCLUDE SYSLIB(IEFSSNQ);                                /*@ZA34144*/ 32400000
*%SSOBNQEN:;                                                            32450000
*    %IF SSOBDR='' %THEN                                                32500000
*    %GO TO SSOBDREN;                                                   32550000
*MACEJECT;                                                              32600000
* %INCLUDE SYSLIB(IEFSSDR);                                /*@ZA34144*/ 32650000
*%SSOBDREN:;                                                            32700000
*    %IF SSOBMO='' %THEN                                   /*@G18MP21*/ 32750000
*    %GO TO SSOBMOEN;                                      /*@G18MP21*/ 32800000
*MACEJECT;                                                 /*@G18MP21*/ 32850000
* %INCLUDE SYSLIB(IEFSSMO);                                /*@ZA34144*/ 32900000
*%SSOBMOEN:;                                              /* @G18MP21*/ 32950000
*    %IF SSOBMS='' %THEN                                  /* @G18MP21*/ 33000000
*    %GO TO SSOBMSEN;                                     /* @G18MP21*/ 33050000
*MACEJECT;                                                /* @G18MP21*/ 33100000
* %INCLUDE SYSLIB(IEFSSMS);                                /*@ZA34144*/ 33150000
*%SSOBMSEN:;                   /*                            @G18MP21*/ 33200000
*    %IF SSOBCI ='' %THEN      /*                            @G29AN2F*/ 33250000
*    %GOTO SSOBCIEN;           /*                            @G29AN2F*/ 33300000
*MACEJECT;                                                              33350000
* %INCLUDE SYSLIB(IEFSSCI);                                /*@ZA34144*/ 33400000
*%SSOBCIEN:;                                                            33450000
*     %IF SSOBAG = '' %THEN   /*                             @G29AN2F*/ 33500000
*     %GOTO SSOBAGEN;         /*                             @G29AN2F*/ 33550000
*MACEJECT;                                                 /*    @P1C*/ 33600000
* %INCLUDE SYSLIB(IEFSSAG);                                /*@ZA34144*/ 33650000
*%SSOBAGEN:;                 /*                              @G29AN2F*/ 33700000
