*        %GOTO JESCTPRO;     /*                              @G385P2N   00050000
         MACRO                                                          00100002
         IEFJESCT  &TYPE=DSECT,&MNTBL=NO                     @ZMC1528   00150000
         LCLC  &NAM                                                     00200000
*                                                                       00450002
.*/      %JESCTPRO: ;        /*                              @G385P2N*/ 00500000
*/* Start of Specifications ******************************************/ 00550000
*/*                                                                  */ 13750002
*/*01* MACRO NAME = IEFJESCT                                     @H1C*/ 13800000
*/*                                                                  */ 13825000
*/*    ACRONYM: JESCT                                            @P3A*/ 13850000
*/*                                                                  */ 13900002
*/*01* DESCRIPTIVE NAME = Job Entry Subsystem Communication Table    */ 13916600
*/*                                                                  */ 14050002
*/*01* PROPRIETARY STATEMENT=                                        */ 14061100
*/***PROPRIETARY_STATEMENT********************************************/ 14072200
*/*                                                                  */ 14083300
*/*                                                                  */ 14094400
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 14105500
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 14116600
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1988, 1994                      */ 14127700
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 14138800
*/*                                                                  */ 14150000
*/* STATUS= HBB5520                                                  */ 14166600
*/*                                                                  */ 14183200
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 14199800
*/*                                                                  */ 14216600
*/*01* FUNCTION =                                                @H1A*/ 14249900
*/*                                                                  */ 14283200
*/*      This macro provides the mapping for the JESCT and its   @H1A*/ 14316500
*/*      pageable extension.  Its purpose is to provide a        @H1A*/ 14349800
*/*      combination of information and a vector table for the       */ 14383100
*/*      subsystem interface or scheduler service related            */ 14416400
*/*      functions.                                                  */ 14449700
*/*                                                                  */ 14454400
*/*01* EXTERNAL CLASSIFICATION:                                      */ 14459100
*/*02* DMTI: BASE                                                    */ 14463800
*/*02* GUPI: FIELDS                                                  */ 14468500
*/*                    JES3OUTD   JESFRQEX                       @01C*/ 14473200
*/*01* END OF EXTERNAL CLASSIFICATION                                */ 14477900
*/*                                                                  */ 14483000
*/*01* NOTES =                                                   @L8A*/ 14485700
*/*        Bilingual mapping macro (PL/AS and BAL)               @L8A*/ 14488400
*/*        External variable IEFJESCT defined, set and           @D7A*/ 14489300
*/*        deactivated.                                          @D7A*/ 14490200
*/*        JES module HASPFMT0 references some of the fields in  @P5A*/ 14490300
*/*        the JESCT by name. Fields should not be removed from  @P5A*/ 14490400
*/*        the JESCT until that part is no longer available to   @P5A*/ 14490500
*/*        our customers.                                        @P5A*/ 14490600
*/*                                                              @L8A*/ 14491100
*/*      DEPENDENCIES =                                          @L8A*/ 14493800
*/*        Any changes to this base section of this macro should @L8A*/ 14496500
*/*        be reflected in the IPCS model IEFMJSCT.              @L8A*/ 14499200
*/*        Any changes to this pageable extension of this macro  @L8A*/ 14501900
*/*        should be reflected in the IPCS model IEFMJSXT.       @L8A*/ 14504600
*/*                                                              @L8A*/ 14507300
*/*      RESTRICTIONS = None                                     @L8A*/ 14510000
*/*                                                              @L8A*/ 14512700
*/*01* METHOD OF ACCESS                                      @G385P2N*/ 14516300
*/*              BAL - IEFJESCT TYPE=DSECT,MNTBL=YES         @ZMC1528*/ 14550000
*/*                                  DC          NO          @ZMC1528*/ 14600000
*/*                                                          @G385P2N*/ 14650000
*/*                    TYPE = DSECT IS THE DEFAULT           @G385P2N*/ 14700000
*/*                                                                  */ 14750000
*/*                    MNTBL = YES - PRODUCE JESMNTBL DSECT  @ZMC1528*/ 14800000
*/*                    MNTBL = NO (DEFAULT) - DO NOT PRODUCE @ZMC1528*/ 14850000
*/*                                           JESMNTBL DSECT @ZMC1528*/ 14900000
*/*                                                                  */ 14950000
*/*                                                                  */ 15000000
*/*              PL/S - %DCL JESCTEP CHAR                        @L7A*/ 15022200
*/*                     %JESCTEP = YES or NO                     @L7A*/ 15044400
*/*                     %INCLUDE SYSLIB(IEFJESCT)            @G385P2N*/ 15066600
*/*                                                          @G385P2N*/ 15100000
*/*                     JESCT is based on CVTJESCT           @G385P2N*/ 15150000
*/*                                                                  */ 15200000
*/*                     Setting the macro variable JESCTEP to        */ 15201300
*/*                     'NO' will bypass the entry linkage           */ 15202600
*/*                     declares.  The default is YES.  If the       */ 15203900
*/*                     entry linkage declares are bypassed,         */ 15205200
*/*                     it becomes the programmers responsibility    */ 15206500
*/*                     to declare them.  See the note below.        */ 15207800
*/*                                                                  */ 15209100
*/*01* DSECT NAME = JESCT, JESPEXT                               @P3A*/ 15210400
*/*                                                                  */ 15211700
*/*01* EYE-CATCHER:                                                  */ 15211800
*/*         - JESCT:  JEST                                       @P4C*/ 15211900
*/*         - JESPEXT:  JESPEXT                                  @P4A*/ 15212000
*/*02* OFFSET:                                                       */ 15212100
*/*         - JESCT:  0                                          @P4C*/ 15212200
*/*         - JESPEXT:  0                                        @P4A*/ 15212300
*/*02* LENGTH:                                                       */ 15212400
*/*         - JESCT:  4                                          @P4C*/ 15212500
*/*         - JESPEXT:  7                                        @P4A*/ 15212600
*/*                                                                  */ 15212700
*/*01* POINTED TO BY:                                            @P4C*/ 15212800
*/*                                                              @P4A*/ 15212900
*/*       - JESCT:  CVTJESCT field in the CVT                    @P4C*/ 15213000
*/*                                                                  */ 15213100
*/*       - JESPEXT:  JESCTEXT field in the JESCT                @P4A*/ 15213200
*/*                                                                  */ 15214300
*/*01* CREATED BY:                                                   */ 15215600
*/*                                                                  */ 15216900
*/*       - JESCT:                                               @P4A*/ 15218300
*/*         IEFJESDM, the data only module just for the base         */ 15219300
*/*                   portion of the JESCT which resides in the      */ 15220300
*/*                   nucleus.                                       */ 15221300
*/*                                                                  */ 15222500
*/*       - JESPEXT:                                             @P4A*/ 15223900
*/*         IEFJSINT, a Subsystem Interface initialization           */ 15225300
*/*                   module which acquires the storage for the      */ 15226700
*/*                   pageable extension.                            */ 15228100
*/*                                                                  */ 15229900
*/*01* DELETED BY:                                                   */ 15231200
*/*                                                                  */ 15232500
*/*        N/A                                                       */ 15233800
*/*                                                                  */ 15235100
*/*01* STORAGE ATTRIBUTES                                            */ 15236400
*/*                                                                  */ 15237700
*/*       - JESCT is the nucleus portion                         @P4A*/ 15239000
*/*                                                                  */ 15240300
*/*       - JESPEXT is a pageable extension                      @P4A*/ 15240600
*/*                                                                  */ 15240900
*/*02*   ALLOCATION METHOD:                                          */ 15241200
*/*       - JESCT:                                               @P4A*/ 15241500
*/*         contained in the data only nucleus module IEFJESDM   @P4C*/ 15241800
*/*                                                                  */ 15242100
*/*       - JESPEXT:                                             @P4A*/ 15242400
*/*         the pageable extension is obtained via GETMAIN       @P4C*/ 15242700
*/*                                                                  */ 15243000
*/*02*   SUBPOOL:                                                    */ 15243300
*/*       - JESCT:  nucleus                                      @P4C*/ 15243600
*/*       - JESPEXT:  241 (common)                               @P4A*/ 15243900
*/*02*   KEY:                                                        */ 15244200
*/*       - JESCT:  0                                            @P4C*/ 15244500
*/*       - JESPEXT:  0                                          @P4A*/ 15244800
*/*02*   RESIDENCY:                                                  */ 15245500
*/*       - JESCT:  below                                        @P4C*/ 15245900
*/*       - JESPEXT:  below                                      @P4A*/ 15246300
*/*02*   SIZE:                                                       */ 15246700
*/*       - JESCT:  128 bytes                                    @P4C*/ 15247100
*/*       - JESPEXT:  152 bytes                                  @LDC*/ 15247500
*/*02*   FREQUENCY:                                                  */ 15247900
*/*       - JESCT:  1 per MVS image                              @P4C*/ 15248300
*/*       - JESPEXT:  1 per MVS image                            @P4A*/ 15248700
*/*                                                                  */ 15249400
*/*                                                                  */ 15252000
*/*01* SERIALIZATION:                                                */ 15252300
*/*                                                                  */ 15252600
*/*      None for the data areas in this macro.  However         @P4C*/ 15252900
*/*      individual fields are serialized as mentioned for the       */ 15253200
*/*      field or in some cases by services referenced.              */ 15253500
*/*                                                                  */ 15253800
*/*01* COMPONENT: Initiator/SubSystem Interface (SC1B6)              */ 15254100
*/*                                                                  */ 15254400
*/*01* DSECT NAME = JESMNTBL                                         */ 15254700
*/*                                                                  */ 15255000
*/*01* POINTED TO BY:                                                */ 15255300
*/*                                                                  */ 15255600
*/*        JESMNTP  - Field in the JEST                              */ 15255900
*/*                                                                  */ 15256200
*/*01* CREATED BY:                                                   */ 15256500
*/*                                                                  */ 15256800
*/*        IEFAB4I0 - Allocation initialization routine acquires     */ 15257100
*/*                   storage for the Mountable device class         */ 15257400
*/*                   table.                                         */ 15257700
*/*                                                                  */ 15258000
*/*01* DELETED BY:                                                   */ 15258300
*/*                                                                  */ 15258600
*/*        N/A                                                       */ 15258900
*/*                                                                  */ 15259200
*/*01* STORAGE ATTRIBUTES                                            */ 15259500
*/*                                                                  */ 15261100
*/*      Mountable device class table                                */ 15262400
*/*                                                                  */ 15263700
*/*02*   ALLOCATION METHOD: Getmain                                  */ 15265000
*/*02*   SUBPOOL:           241 (common)                             */ 15266300
*/*02*   KEY:               1                                        */ 15267600
*/*02*   RESIDENCY:         Any                                      */ 15268900
*/*02*     VIRTUAL:         Above                                    */ 15270200
*/*02*   SIZE               4 bytes                                  */ 15270800
*/*02*   FREQUENCY:         1 PER MVS Image                          */ 15271500
*/*                                                                  */ 15272800
*/*01* SERIALIZATION:                                                */ 15274100
*/*                                                                  */ 15275400
*/*      None for the control blocks in this macro.  However         */ 15276700
*/*      individual fields are serialized as mentioned for the       */ 15278000
*/*      field or in some cases by services referenced.              */ 15279300
*/*                                                                  */ 15280600
*/*01* COMPONENT: Device Allocation (SC1B4)                          */ 15281900
*/*                                                                  */ 15283200
*/*01* EYE-CATCHER:  None                                            */ 15284500
*/*                                                                  */ 15285800
*/*01* DISTRIBUTION LIBRARY:                                         */ 15287100
*/*                                                                  */ 15288400
*/*      AMACLIB                                                     */ 15289700
*/*                                                                  */ 15291000
*/*01* CHANGE ACTIVITY = Y02668,OZ15019,Z40FPPJ,G29AN2F,             */ 15292300
*/*                   G29ANSF,G64QPSJ,G38AP2N,G385P2N,               */ 15300000
*/*                   G383P2J,PBB0162,G382P2P,G860P2P,               */ 15350000
*/*                   G860PPK,G860P2M,H1,L1,L2,D1,P1,T1,L3           */ 15400000
*/*                   D2,L4,R2,D3,L5,D4,D5,T2,L6,D6,L7,L8,L9,LA,     */ 15450000
*/*                   P2,D7,T3,LB,D8                             @D8C*/ 15500000
*/*The above section of the Change Activity is no longer updated @LCC*/ 15550000
*/*                                                                  */ 16300000
*/*$H1= EXTJCL  JBB2110 820605 PDC6: SUPPORT OF EXTENDED JCL     @H1A*/ 16302500
*/*$L1= OCCF    JBB2110 820605 PD2K: PRIMARY SUBSYSTEM FLAGS     @L1A*/ 16305000
*/*$L2= ALLVSCR JBB2110 820605 PDE6: ALLOCATION TO EPLPA         @L2A*/ 16307500
*/*$D1= DCR43   JBB2110 820827 PDD7: SUPPORT FOR SJF VSCR        @D1A*/ 16310000
*/*$P1= PAB0207 JBB2110 830107 PDFC: ALLOCATION VSCR SUPPORT     @P1A*/ 16312500
*/*$T1= OZ81042 JBB2133 840719 PDH2: EARLY AUTHORIZATION         @T1A*/ 16315000
*/*$L3= IOGEN   JBB2220 841119 PDN4: SUPPORT FOR IOGEN           @L3A*/ 16317500
*/*                                  RESTRUCTURE                 @L3A*/ 16320000
*/*$D2= DCR53   JBB2220 841121 PDD7: DCR 53                      @D2A*/ 16322500
*/*$L4= GT1635  JBB2220 850211 PDD7: SUPPORT FOR 1635 DD         @L4A*/ 16325000
*/*                                  LIMIT                       @L4A*/ 16327500
*/*$R2= PA20127 JBB2220 850211 PDN3: SUPPORT FOR PTM PA20127     @R2A*/ 16329700
*/*$D3= DCR88   JBB2220 850408 PDD7: SUPPORT FOR DCR 88          @D3A*/ 16331900
*/*$L5= SWABOVE JBB2220 850408 PDT4: SWA ABOVE THE LINE          @L5A*/ 16334100
*/*$D4= DCR93   JBB2220 850408 PDT4: SMF DISABLED INTERFACE      @D4A*/ 16336300
*/*$D5= DCR158  JBB2220 860226 PDR6: SWA ABOVE THE LINE          @D5A*/ 16338500
*/*$T2= OY10291 JBB2220 871120 PDR6: UNAUTH SWA MANAGER SUPT     @T2A*/ 16339600
*/*$L6= SMSSTG2 JBB2223 860127 PDN4: STOR MGMT SUBSYS STG2 SUPT  @L6A*/ 16340700
*/*$D6= DCR16   JBB2223 860811 PDFF: STOR MGMT SUBSYS STG2 SUPT  @D6A*/ 16342900
*/*$L7= SERVC   HBB4410 870908 PDT4: Serviceability              @L7A*/ 16345100
*/*$L8= EMVS2   HBB4410 880725 PDZ1: Enterprise II - ESI         @L8A*/ 16345900
*/*$L9= EMVS2   HBB4410 881220 PDZ1: Enterprise II - SWBTUREQ    @L9A*/ 16346400
*/*$LA= EMVS2   HBB4410 881220 PDKK: JCL Enhancements            @LAA*/ 16346900
*/*$P2= EMVS2   HBB4410 890126 PDKK: JCL Enhancements            @P2A*/ 16347200
*/*$D7= DEO0265 HBB4410 890918 PDCC: Compile error checking      @D7A*/ 16347300
*/*$T3= OY20769 HBB3310 891023 PDDW: FSI Trace SPE               @T3A*/ 16347400
*/*$T4= OY30874 HBB3310 890213 PDB2: SMS/JES3 ACTIVATION         @T4A*/ 16348200
*/*$LB= APPC1   HBB4420 890710 PDB3: DYNAMIC PPT                 @LBA*/ 16348600
*/*$D8= DH30153 HBB4420 901026 PDE1: JES3/TSO OUTDES indicator   @D8A*/ 16348800
*/*$P3= PKB1795 HBB4430 920617 PDCC: 10X Defect Elimination      @P3A*/ 16348900
*/*                                  SHOWHDR format complete     @P3A*/ 16349200
*/*$LC= PE2STALL HBB5510 921218 PDXB: Remove JESDB401            @LCA*/ 16349300
*/*$P4= PIG1423  HBB5510 930715 PDDZ: SHOWHDR Compliance         @P4A*/ 16349400
*/*$P5= PIG2452  HBB5510 930815 PDH1: Replace JESDB401           @P5A*/ 16349600
*/*$P6= PIG2436  HBB5510 931104 PDCC: Add JESDSNID               @P6A*/ 16349700
*/*$LD= SSIDP    HBB5520 941020 PDBN: Dynamic SSI                @LDA*/ 16359700
*/*$LE= UCBVP    HBB5520 941020 PDEM: Comment updates            @LEA*/ 16369700
*/*$01= OW11157  HBB5520 950301 PDBN: SSI function request exit  @01A*/ 16374700
*/*                                                                  */ 16379700
*/* End of Specifications ********************************************/ 16389700
*/* A - 000000 - 999999                                       @Y02668*/ 16400000
*/* A - APAR OZ15019 IS SUPPORTED BY @Z40FPPJ                @ZA15019*/ 16450000
*/* A - EOT RESOURCE MANAGER ADDR                            @G38AP2N*/ 16500000
*/* A - SUBSYSTEM DEFINITION FACILITY SUPPORT                @G385P2N*/ 16550000
*/* A - SUPPORT FOR ALLOCATION ADDRESS SPACE                 @G383P2J*/ 16600000
*/* D - JESDAECB NOT REQUIRED                                @PBB0162*/ 16650000
*/* A - POINTER TO CSA AREA FOR PCDPARMS                     @G382P2P*/ 16700000
*/* A - ADD A PAGEABLE EXTENSION TO THE JESCT AND PROVIDE        @H1A*/ 16750000
*/*     SUPPORT FOR JCL DEFINITION VECTOR TABLES AND THE         @H1A*/ 16800000
*/*     SCHEDULER JCL CONTROL ROUTINE                            @H1A*/ 16850000
*/* A - ADDRESS OF JOURNAL WRITE ROUTINE (JESSJRNL)              @H1A*/ 16900000
*/* A - ADD DSECT STATEMENT TO END OF ASSEMBLER VERSION          @H1A*/ 16950000
*/* A - ADDED PRIMARY SUBSYSTEM FLAG FIELD (JESJESFG)            @L1A*/ 17000000
*/* A - UCB POINTER LIST ADDRESS                             @G860P2P*/ 17050000
*/* A - JESMNTBL(ARRAY OF MOUNTABLE DEVICE TYPES)            @G860PPK*/ 17100000
*/* A - JESUPLER(UPL ERROR INDICATOR)                        @G860P2M*/ 17150000
*/* C - PRODUCE JESMNTBL DSECT ONLY IF REQUESTED             @ZMC1528*/ 17200000
*/* A - SUPPORT FOR ALLOCATION AND SWA MANAGER TO                @L2A*/ 17250000
*/*     EXTENDED STORAGE                                         @L2A*/ 17300000
*/* C - JESSJCNL NOW CONTAINS THE ADDRESS OF THE SJF ROUTER      @D1A*/ 17350000
*/*     ROUTINE                                                  @D1A*/ 17400000
*/* A - NEW FIELD (JESSJF) WHICH CONTAINS THE ADDRESS OF THE SJF @D1A*/ 17450000
*/*     CONTROL ROUTINE                                          @D1A*/ 17500000
*/* C - CHANGE JESRSV02 TO CONTAIN THE ADDRESS OF IEFAB445 AND   @P1A*/ 17550000
*/*     RENAME IT JESAB445 (ALLOCATION DEFAULTS MODULE)          @P1A*/ 17600000
*/* C - CHANGE JESRSV01 TO CONTAIN THE ADDRESS OF IEFIB650       @T1A*/ 17650000
*/*     (INITIATOR MESSAGE MODULE) AND RENAME IT JESIB650.       @T1A*/ 17700000
*/* A - ADDED ALLOCATION READY BIT (JESALRDY), ADDRESS OF THE    @L3A*/ 17750000
*/*     PPT TABLE (JESPPT) AND RESTART CODES TABLE (JESRSTRT)    @L3A*/ 17800000
*/*     TO THE JESCT                                             @L3A*/ 17850000
*/* A - ADDED JESPARSE AND TWO RESERVED FIELDS TO THE JESCT      @D2A*/ 17900000
*/* A - ADDED JESTIOTS AND JESMAXDD TO THE JESCT EXTENSION       @L4A*/ 17950000
*/* A - ADDED (JESXB603) ADDRESS OF THE RESTART COMPONENT        @R2A*/ 18000000
*/*     MESSAGE MODULE IEFXB603 TO THE JESCT                     @R2A*/ 18050000
*/* A - CHANGED RESERVED FIELD, JESRSV04, TO JESV2EDT.  THIS     @D3A*/ 18100000
*/*     BIT WILL BE SET BY ALLOCATION TO INDICATE VERSION 2 OR   @D3A*/ 18150000
*/*     LATER EDT.                                               @D3A*/ 18200000
*/* A - ADDED JESPQMST, JESPQDIR, AND TWO RESERVED FIELDS TO THE @L5A*/ 18250000
*/*     JESCT EXTENSION. ADDED ENTRY DECLARES FOR MOVE MODE SWA  @L5A*/ 18300000
*/*     MANAGER (MSWAMGR), AND SWA MANAGER DIAGNOSTICS ROUTINE   @L5A*/ 18350000
*/*     (SWADIR).                                                @L5A*/ 18400000
*/* A - ADDED JESGDTOK IN THE JESCT EXTENSION, AND ENTRY DECLARE @D4A*/ 18450000
*/*     GETDDTOK                                                 @D4A*/ 18500000
*/* A - ADDED JESQBSVA IN THE JESCT EXTENSION                    @D5A*/ 18550000
*/* A - ADDED ENTRY DECLARE OF USWAMGR FOR INVOKING THE              */ 18554100
*/*     UNAUTHORIZED SWA MANAGER, IEFQBSVA.                      @T2A*/ 18558200
*/* A - ADDED JESDACA TO THE JESCT, AND JESSMSIB AND JESMECHK    @L6A*/ 18562500
*/*     TO THE JESCT EXTENSION                                   @L6A*/ 18575000
*/* D - DELETED ENTRY STATEMENT FOR IEFMECHK                     @D6A*/ 18587500
*/* A - Added declare for JESXBCHK the scheduler checkpoint      @L7A*/ 18591600
*/*     SWA blocks routine, enhanced comments in PLS             @L7A*/ 18595700
*/* A - Added field definitions for JESSJTCL and three reserved  @L8A*/ 18597100
*/*     fullwords at end of the JESCT extension.  Version is 6.  @L8A*/ 18598500
*/* A - Changed SWBTU definition to include OPTIONS(AMODE(31,*)) @L9A*/ 18599200
*/* A - Added declare for SJFCNL which will allow branching      @LAA*/ 18599400
*/*     directly to the SJF control routine in SJFREQ            @LAA*/ 18599600
*/* C - Changed SJFCNL entry point from AMODE(31) to AMODE(31,*) @P2A*/ 18599700
*/*     to allow for AMODE changes.                              @P2A*/ 18599800
*/* A - Added macro variable IEFJESCT to identify to other PLAS  @D7A*/ 18612300
*/*     macros that IEFJESCT has been included.                  @D7A*/ 18624800
*/* A - Added JESFSIT BIT to JESFLG                              @T3A*/ 18628900
*/* A - Added JESFSICB pointer.                                  @T3A*/ 18633000
*/* A - Added JESPPTUS, JESPPTSC fields and PPTSCAN entry for    @LBA*/ 18634000
*/*     dynamic PPT scan                                         @LBA*/ 18636200
*/* A - Added JES3ACTV bit to indicate when JES3 is active       @T4A*/ 18636300
*/* A - JES3OUTD bit indicating to TSO that JES3 supports        @D8A*/ 18636500
*/*     OUTADD/OUTDEL service                                    @D8A*/ 18636800
*/* A - JESDSNNO field to hold final qualifier for Temporary     @P3A*/ 18636900
*/*     data set names.                                          @P3A*/ 18637000
*/* D - Remove JESDB401 field since dynamic exits support        @LCA*/ 18637100
*/*     maintains that address                                   @LCA*/ 18637200
*/* A - Put back JESDB401 field since older JES releases format  @P5A*/ 18639700
*/*     the JESCT and thus reference (for formatting purposes    @P5A*/ 18642200
*/*     only) the JESDB401 field.                                @P5A*/ 18644700
*/* A - Add JESDSNID to hold a system unique identifier for      @P6A*/ 18645500
*/*     temporary data set names on this system.                 @P6A*/ 18646300
*/* A - Added JESSSIVT field containing the SSIVT token.             */ 18646400
*/*     Added JESSSIPC and JESVTPC fields containing the PC          */ 18646500
*/*     numbers for IEFSSI and IEFSSVT, respectively.                */ 18646600
*/*     Added JESMSGT@ containing the SSI message table              */ 18646700
*/*     address.                                                 @LDA*/ 18646800
*/* C - Updated comments for the JESAB445 field                  @LEA*/ 18647000
*/* C - Defined JESFRQEX flag to indicate that the support for       */ 18647700
*/*     the SSI function request exit is available.              @01A*/ 18648400
*/********************************************************************/ 18649100
*        %GOTO JESCTBSL;     /*                              @G385P2N   18650000
&NAM     SETC  'JESCT'           DEFAULT                                18700000
         AIF   ('&TYPE' EQ 'DSECT').DSECT                               18750000
         AIF   ('&TYPE' EQ 'DC').DC                                     18800000
         AGO   .DSECT                  DEFAULT                          18850000
.DC      ANOP                                                           18900000
&NAM     DS    0F                                                       18950000
         AGO   .J0                                                      19000000
.DSECT   ANOP                                                           19050000
&NAM     DSECT                                                          19100000
.J0      ANOP                                                           19150000
JESCTID  DC    C'JEST'             ACRONYM: JEST               @G383P2J 19200000
JESUNITS DC    A(0)                POINTER TO SYSRES UCB       @G389P2N 19250000
JESWAA   DC    A(0)                ADDRESS OF THE SWA            Y02668 19300000
*                                  MANAGER - LOCATE MODE         Y02668 19350000
JESQMGR  DC    A(0)                ADDRESS OF SWA MANAGER        Y02668 19400000
*                                  MOVE MODE                     Y02668 19450000
*                                                                       19500000
JESRESQM DC    A(0)                ENTRY POINT USED TO INTERFACE        19550000
*                                  BETWEEN THE QMNGRIO MACRO AND        19600000
*                                  THE RESIDENT SWA MNGR         Y02668 19650000
JESSSREQ DC    A(0)                ADDRESS OF THE IEFSSREQ       Y02668 19700000
*                                  ROUTINE                       Y02668 19750000
JESSSCT  DC    A(0)                ADDRESS OF THE FIRST          Y02668 19800000
*                                  SUBSYSTEM COMMUNICATIONS      Y02668 19850000
*                                  TABLE                         Y02668 19900000
JESPJESN DC    XL4'00'             NAME OF PRIMARY JOB ENTRY     Y02668 19950000
*                                  SUBSYSTEM SET AT SYSGEN       Y02668 20000000
JESALLOC DC    A(0)                DEVICE ALLOCATION ENTRY     @Z40FPPJ 20050000
*                                  POINT USED BY INITIATOR     @Z40FPPJ 20100000
*                                                              @Z40FPPJ 20150000
JESUNALC DC    A(0)                DEVICE UNALLOCATION ENTRY   @Z40FPPJ 20200000
*                                  POINT USED BY INITIATOR     @Z40FPPJ 20250000
*                                                              @Z40FPPJ 20300000
JESCATL  DC    A(0)                DEVICE ALLOCATION PRIVATE   @Z40FPPJ 20350000
*                                  CATALOG ENTRY POINT         @Z40FPPJ 20400000
*                                  USED BY INITIATOR           @Z40FPPJ 20450000
JESNUCBS DC    F'0'                NUMBER OF TAPE AND DA UCB'S @G383P2J 20500000
*                                  IN SYSTEM.                  @G383P2J 20550000
*                                  USED BY DEVICE ALLOCATION   @Z40FPPJ 20600000
*                                                              @G29ANSF 20650000
JESSASTA DC    A(0)                ADDRESS OF SUBSYSTEM        @G29AN2F 20700000
*                                  ALLOCATION SEQUENCE TABLE   @G29AN2F 20750000
JESEDT   DC    A(0)                Address of Allocation Eligible  @P3C 20787500
*                                  Device Table, valid only during @P3C 20825000
*                                  NIP.                            @P3C 20862500
JESRECM  DC    A(0)                ADDRESS OF IEFJRECM         @G38AP2N 20900000
*                                  RESOURCE MANAGER            @G38AP2N 20950000
JESRECF  DC    A(0)                ADDRESS OF IEFJRECF         @G38AP2N 21000000
*                                  RESOURCE MANAGER            @G38AP2N 21050000
JESHASH  DC    A(0)                ADDRESS OF SUBSYSTEM        @G385P2N 21100000
*                                  HASH TABLE                  @G385P2N 21150000
JESNRSS  DC    H'0'                TOTAL NUMBER OF SUBSYSTEMS  @G385P2N 21200000
JESFLG   DC    X'00'               FLAG BYTE                   @G385P2N 21250000
JESJSSNT EQU   X'80'               IEFJSSNT EXISTS             @G385P2N 21300000
JESFSIT  EQU   X'40'               FSI Trace installed.            @T3C 21350000
JESFRQEX EQU   X'20'               SSI function request exit           +21383300
                                     installed                     @01A 21416600
JESRSV15 EQU   X'10'               RESERVED                    @G385P2N 21450000
JESRSV16 EQU   X'08'               RESERVED                    @G385P2N 21500000
JESRSV17 EQU   X'04'               RESERVED                    @G385P2N 21550000
JESRSV18 EQU   X'02'               RESERVED                    @G385P2N 21600000
JESRSV19 EQU   X'01'               RESERVED                    @G385P2N 21650000
JESJESFG DC    X'00'               PRIMARY SUBSYSTEM FLAGS        @L1C  21700000
JESPSUBA EQU   X'80'               PRIMARY SUBSYSTEM ACTIVE INDICATOR   21750000
*                                                                  @L1A 21800000
JESPSUBI EQU   X'40'               IF JESPSUBA=1 AND THIS BIT =0 THEN   21850000
*                                  MVS CONSOLE ALTERING COMMANDS MAY BE 21900000
*                                  USED BUT JES3 CONSOLE ALTERING       21950000
*                                  COMMANDS MAY NOT BE USED.   IF       22000000
*                                  JESPSUBA=1 AND THIS BIT =1 THEN      22050000
*                                  JES3 CONSOLE ALTERING COMMANDS MAY   22100000
*                                  BE USED IN ADDITION TO MVS CONSOLE   22150000
*                                  ALTERING COMMANDS.  IF JESPSUBA=0    22200000
*                                  THEN ONLY MVS CONSOLE ALTERING       22250000
*                                  COMMANDS MAY BE USED.           @L1A 22300000
JES3ACTV EQU   X'20'               JES3 SUBSYSTEM ACTIVE           @T4C 22350000
JES3OUTD EQU   X'10'               JES3 support of OUTADD/OUTDEL        22383300
*                                  MVS services available          @D8C 22416600
JESRSV24 EQU   X'08'               RESERVED                        @L1A 22450000
JESRSV25 EQU   X'04'               RESERVED                        @L1A 22500000
JESRSV26 EQU   X'02'               RESERVED                        @L1A 22550000
JESRSV27 EQU   X'01'               RESERVED                        @L1A 22600000
JESALLOP DC    A(0)                POINTER TO ALLOCATION DESCRIPTOR     22650000
*                                  BLOCK                       @G383P2J 22700000
JESALLOA DC    H'0'                ASID OF ALLOCATION ADDRESS SPACE     22750000
*                                                              @G383P2J 22800000
JESALLOF DC    X'00'               ALLOCATION FUNCTION FLAGS   @G860P2M 22850000
JESUASR  EQU   X'80'               UNIT ALLOCATION STATUS RECORDING IS  22900000
*                                  ACTIVE                      @G383P2J 22950000
JESUASF  EQU   X'40'               UNIT ALLOCATION STATUS RECORDING     23000000
*                                  HAS FAILED                  @G383P2J 23050000
JESUPLER EQU   X'20'               UPL DOES NOT MATCH THE UCBS @G860P2M 23100000
JESALRDY EQU   X'10'               ALLOCATION READY                @L3C 23150000
JESV2EDT EQU   X'08'               EDT VERSION 2 OR LATER INDICATOR     23200000
*                                                                  @D3A 23250000
JESRSV05 EQU   X'04'               RESERVED                    @G383P2J 23300000
JESRSV06 EQU   X'02'               RESERVED                    @G383P2J 23350000
JESRSV07 EQU   X'01'               RESERVED                    @G383P2J 23400000
JESRSV08 DC    X'00'               RESERVED                    @G383P2J 23450000
JESPCDP  DC    A(0)                POINTER IN CSA FOR PCDPARMS @G382P2P 23500000
JESAUCBS DC    F'0'                NUMBER OF ALL UCBS IN THE   @G383P2J 23550000
*                                  SYSTEM                      @G383P2J 23600000
JESDUECB DC    F'0'                DISPLAY ALLOCATION SDUMP    @G383P2J 23650000
*                                  ECB                         @G383P2J 23700000
JESUPLP  DC    A(0)                UCB POINTER LIST ADDRESS    @G860P2P 23750000
JESMNTP  DC    A(0)                POINTER TO ARRAY OF MOUNT-  @G860PPK 23800000
*                                  ABLE DEVICE TYPES           @G860PPK 23850000
JESCTEXT DC    A(0)                POINTER TO THE PAGEABLE JESCT        23900000
*                                  EXTENSION                       @H1C 23950000
JESPPT   DC    A(0)                POINTER TO THE PROGRAM PROPERTIES    24000000
*                                  TABLE                           @L3C 24050000
JESRSTRT DC    A(0)                POINTER TO RESTART CODE TABLE   @L3C 24100000
JESPARSE DC    A(0)                POINTER TO THE PARSER ROUTINE   @D2A 24150000
JESXB603 DC    A(0)                POINTER TO RESTART COMPONENT    @R2C 24200000
*                                  MESSAGE MODULE (IEFXB603)       @R2A 24250000
JESDACA  DC    A(0)                POINTER TO THE DEVICE ALLOCATION     24275000
*                                  COMMUNICATION AREA              @L6C 24300000
JESRSV28 DC    A(0)                RESERVED FIELD                  @L6A 24325000
         AIF   ('&MNTBL' NE 'YES').NOMNTBL                     @ZMC1528 24350000
JESMNTBL DSECT                     ARRAY OF MOUNTABLE DEVICE   @G860PPK 24400000
*                                  CLASSES - THIS ARRAY IS     @G860PPK 24450000
*                                  INITIALIZED IN CSA BY       @G860PPK 24500000
*                                  IEFAB4I0                    @G860PPK 24550000
JES#MNT  DS     H                  NUMBER OF DEVICE CLASSES    @G860PPK 24600000
*                                  IN ARRAY                    @G860PPK 24650000
JESMNTDT DS     B                  INDIVIDUAL DEVICE CLASS     @G860PPK 24700000
.NOMNTBL ANOP                                                  @ZMC1528 24750000
*                                                                  @H1A 24800000
*********************************************************************** 24850000
*                                                                     * 24900000
*  JESPEXT IS A PAGEABLE EXTENSION OF THE JESCT POINTED TO BY     @H1A* 24950000
*  JESCTEXT                                                       @H1A* 25000000
*                                                                     * 25050000
*********************************************************************** 25100000
JESPEXT  DSECT                                                     @H1A 25150000
         DS    0F                  JESCT EXTENSION                 @H1A 25200000
JESSID   DS    CL7                 IDENTIFIER 'JESPEXT'            @H1A 25250000
JESSVERS DS    XL1                 CONTROL BLOCK VERSION NUMBER    @H1A 25300000
JESSJCNL DS    A(0)                ADDRESS OF SCHEDULER JCL        @H1A 25350000
*                                  FACILITY ROUTER ROUTINE         @D1C 25400000
JESSJDVT DS    A(0)                ADDRESS OF JCL DEFINITION       @H1A 25450000
*                                  VECTOR TABLE CHAIN              @H1A 25500000
JESSJRNL DS    A(0)                ADDRESS OF JOURNAL WRITE RTNE   @H1A 25550000
JESDB401 DS    A(0)                Unused except for formatter use @P5C 25600000
JESXVNSL DS    A(0)                IEFXVNSL ENTRY POINT            @L2A 25650000
JESGB4DC DS    A(0)                IEFGB4DC ENTRY POINT            @L2A 25700000
JESGB4UV DS    A(0)                IEFGB4UV ENTRY POINT            @L2A 25750000
JESAB445 DS    A(0)                Address of the Devcie           @LEC 25775000
*                                  Allocation Defaults Table -     @LEC 25800000
*                                  Initialized by IEFAB4I0         @LEC 25825000
JESGB400 DS    A(0)                ALLOCATION PUT INTERFACE RTNE.  @L2A 25850000
JESQB551 DS    A(0)                IEFQB551 ENTRY POINT            @L2A 25900000
JESQB556 DS    A(0)                IEFQB556 ENTRY POINT            @L2A 25950000
JESXBPUT DS    A(0)                JOURNAL PUT/GET INTERFACE RTN   @L2A 26000000
JESIB650 DS    A(0)                IEFIB650 ENTRY POINT (MSG MOD)  @T1C 26050000
JESSJF   DS    A(0)                ADDRESS OF SCHEDULER JCL        @D1A 26100000
*                                  FACILITY ROUTINE                @D1A 26150000
JESTIOTS DS    F                   SIZE OF THE TASK I/O TABLE TIOT @L4A 26200000
JESMAXDD DS    F                   MAXIMUM NUMBER OF SINGLE UNIT   @L4A 26250000
*                                  DD'S ALLOWED FOR A JOB STEP     @L4A 26300000
JESPQMST DS    A(0)                ADDRESS OF THE SWA MANAGER      @L5A 26350000
*                                  STORAGE TABLE (QMST)            @L5A 26400000
JESPQDIR DS    A(0)                ADDRESS OF THE SWA MANAGER      @L5A 26450000
*                                  DIAGNOSTICS ROUTINE             @L5A 26500000
JESGDTOK DS    A(0)                ADDRESS OF THE ALLOCATION GET   @D4A 26550000
*                                  DD TOKEN SERVICE                @D4A 26600000
JESSMSIB DS    A(0)                POINTER TO THE STORAGE MANAGEMENT    26633300
*                                  SUBSYSTEM SSIB                  @L6C 26666600
JESQBSVA DS    A(0)                ADDRESS OF SWA MANAGER ROUTINE  @D5C 26700000
*                                  SUPPORTING UNAUTHORIZED, TASK   @D5C 26750000
*                                  AND CROSS MEMORY MODE CALLERS   @D5C 26800000
JESMECHK DS    A(0)                ADDRESS OF THE MUTUAL EXCLUSIVITY    26816600
*                                  CHECKER ROUTINE                 @L6C 26833200
JESXBCHK DS    A(0)                Address of the scheduler checkpoint X26840600
                                   SWA blocks routine, used by DFP     X26848000
                                   during checkpoint processing        X26855400
                                   - Initialized by IEFQBINT at master X26862800
                                   scheduler base initialization   @L7C 26870200
JESFSICB DS    A(0)                Address of FSI trace Control         26873200
*                                  Block                           @T3C 26876200
JESSJTCL DS    A(0)                Address of the SWBTU processor  @L8A 26879400
*                                  control routine IEFSJTCL:       @L8A 26881200
*                                  -initialized by IEFSJLOD during @L8A 26883000
*                                   master scheduler base initial. @L8A 26884800
*                                  -Normally referenced through    @L8A 26886600
*                                   the SWBTUREQ macro             @L8A 26888400
JESPPTUS DS    F                   PPT table concurrent use count  @LBC 26889000
*                                  -Normally referenced through    @LBA 26889600
*                                   the IEFPPSCN macro             @LBA 26890200
JESPPTSC DS    A(0)                PPT scan routine IEFPPTSC:      @LBC 26890800
*                                  -initialized by IEFSJINT during @LBA 26891400
*                                   master scheduler base initial. @LBA 26892000
*                                  -Normally referenced through    @LBA 26892600
*                                   the IEFPPSCN macro             @LBA 26893200
JESDSNNO DS    F                   Counter for final qualifier of  @P3C 26893500
*                                  temporary data set name         @P3A 26893800
JESDSNID DS    CL2                 ID for temporary data sets on   @P6A 26893900
*                                  this system.                    @P6A 26894000
JESRSVEA DS    H                   Reserved for future use         @P6C 26894100
JESSSIVT DS    F                   Token for SSI vector table      @LDA 26894200
JESSSIPC DS    CL4                 PC number for IEFSSI macro      @LDA 26894300
JESVTPC  DS    CL4                 PC number for IEFSSVT macro     @LDA 26894400
JESMSGT@ DS    A(0)                SSI message table address       @LDA 26894500
JESRSVEB DS    F                   Reserved for future use         @P3A 26894600
JESRSVEC DS    F                   Reserved for future use         @P3A 26894700
JESRSVED DS    F                   Reserved for future use         @P3A 26895000
*                                                                  @L8A 26895600
JESSCVER EQU   8                   CURRENT VERSION LEVEL           @LDC 26897800
         AIF   ('&TYPE' NE 'DSECT').ENDM                           @H1A 26900000
&NAM     DSECT                     RESETS PROGRAM COUNTER          @H1A 26950000
.ENDM    ANOP                                                      @H1A 27000000
         MEND   ,  */                                                   27050000
*    %JESCTBSL:  ;                                                      27100000
*                                                             /* @D7A*/ 27104500
* /*******************************************************************/ 27109000
* /* Create the MACRO variable IEFJESCT and assign it the value  @D7A*/ 27113500
* /* of 'IEFJESCT' to let other PLAS macros know that IEFJESCT   @D7A*/ 27118000
* /* has been included.                                          @D7A*/ 27122500
* /*******************************************************************/ 27127000
* %DECLARE IEFJESCT CHARACTER EXTERNAL;                       /* @D7A*/ 27131500
* %IEFJESCT = 'IEFJESCT';                                     /* @D7A*/ 27136000
* %DEACTIVATE IEFJESCT;                                       /* @D7A*/ 27140500
*                                                             /* @D7A*/ 27145000
*DECLARE                                                                27150000
*  1 JESCT   BASED(CVTJESCT),                                           27200000
*   2 JESCTID  CHAR(4),      /* Acronym: JEST                @G383P2J*/ 27250000
*   2 JESUNITS PTR(31),      /* POINTER TO SYSRES UCB        @G389P2N*/ 27300000
*   2 JESWAA   PTR(31),      /* Address of locate mode SWA manager      27350000
*                               interface IEFQB555                      27400000
*                               - This field is intended to be used     27416600
*                                 through the IEFQMREQ macro            27433200
*                               - assigned by IEFQBINT at master        27450000
*                                scheduler base initialization Y02668*/ 27500000
*   2 JESQMGR  PTR(31),      /* Address of move mode SWA manager        27550000
*                               interface IEFQB550                      27600000
*                               - assigned by IEFQBINT at master        27650000
*                                scheduler base initialization Y02668*/ 27700000
*   2 JESRESQM PTR(31),      /* Address of the QMNGRIO Macro interface  27750000
*                               handler IEFQB580                        27800000
*                               - assigned by IEFQBINT at master        27850000
*                                scheduler base initialization Y02668*/ 27900000
*   2 JESSSREQ PTR(31),      /* Address of the IEFJSREQ routine         27925000
*                               - This field is intended to be used     27950000
*                                 through the IEFSSREQ macro            27975000
*                               - Initialized by IEFJSINT        @LDC*/ 28012500
*   2 JESSSCT  PTR(31),      /* Address of the first subsystem          28050000
*                               communications table           Y02668*/ 28100000
*   2 JESPJESN CHAR(4),      /* Name of the primary Job entry subsystem 28150000
*                               specified in IEFSSNxx parmlib  Y02668*/ 28200000
*   2 JESALLOC PTR(31),      /* Address of Device allocation used by    28250000
*                               the initiator                           28300000
*                               -initialized by allocation              28350000
*                               initialization module IEFAB4I0          28400000
*                                                            @Z40FPPJ*/ 28450000
*   2 JESUNALC PTR(31),      /* Address of device unallocation used by  28500000
*                               the initiator                           28550000
*                               -initialized by allocation              28600000
*                               initialization module IEFAB4I0          28650000
*                                                            @Z40FPPJ*/ 28700000
*   2 JESCATL  PTR(31),      /* Address of private catalog routine      28750000
*                               used by the initiator                   28800000
*                               -initialized by allocation              28850000
*                               initialization module IEFAB4I0          28900000
*                                                            @Z40FPPJ*/ 28950000
*   2 JESNUCBS FIXED(31),    /* Number of Tape and DA UCBS in the       29000000
*                               system.  Used by device allocation      29050000
*                               - Initialized by IEFAB4I0               29100000
*                                                            @G383P2J*/ 30300000
*   2 JESSASTA PTR(31),      /* ADDRESS OF SUBSYSTEM ALLOCATION         30301600
*                               SEQUENCE TABLE               @G64QPSJ*/ 30303200
*   2 JESEDT   PTR(31),      /* Address of Allocation Eligible Device   30306400
*                               Table, valid only during NIP.    @P3C*/ 30309600
*   2 JESRECM  PTR(31),      /* Address of the subsystem interface end- 30312800
*                               of-task/end-of-memory routine           30314400
*                               IEFJRECM                                30316000
*                               - assigned by IEFJSINT at master        30317600
*                                scheduler base initialization          30319200
*                                                            @G38AP2N*/ 30320800
*   2 JESRECF  PTR(31),      /* Address of the subsystem interface      30322400
*                               end-of-task manager IEFJRECF            30324000
*                               - assigned by IEFJSINT at master        30325600
*                                scheduler base initialization          30327200
*                                                            @G38AP2N*/ 30328800
*   2 JESHASH  PTR(31),      /* Address of the subsystem interface      30330400
*                               hash table.                             30332000
*                               - initialized to zero by IEFJSINT       30333600
*                               during master scheduler initialization  30335200
*                               - normally updated by IEFJSBLD when     30336800
*                               adding a subsystem           @G38AP2N*/ 30338400
*   2 JESNRSS  FIXED(15),    /* Total number of subsystems              30340000
*                               - initialized to zero by IEFJSINT       30341600
*                               - normally updated by IEFJSBLD when     30343200
*                                 adding a subsystem         @G385P2N*/ 30344800
*   2 JESFLG   BIT(8),       /* FLAG BYTE                    @G385P2N*/ 30346400
*    3 JESJSSNT BIT(1),      /* IEFJSSNT exists              @G385P2N*/ 30348000
*    3 JESFSIT  BIT(1),      /* FSI Trace installed.             @T3C*/ 30349600
*    3 JESFRQEX BIT(1),      /* SSI function request exit               30350600
*                               installed                        @01A*/ 30351600
*    3 JESRSV15 BIT(1),      /* RESERVED                     @G385P2N*/ 30352800
*    3 JESRSV16 BIT(1),      /* RESERVED                     @G385P2N*/ 30354400
*    3 JESRSV17 BIT(1),      /* RESERVED                     @G385P2N*/ 30356000
*    3 JESRSV18 BIT(1),      /* RESERVED                     @G385P2N*/ 30357600
*    3 JESRSV19 BIT(1),      /* RESERVED                     @G385P2N*/ 30359200
*   2 JESJESFG BIT(8),       /* Primary Subsystem Flags          @L1C*/ 30360800
*    3 JESPSUBA BIT(1),      /* Primary subsystem active indicator      30362400
*                                                                @L1A*/ 30364000
*    3 JESPSUBI BIT(1),      /*-If JESPSUBA=1 and this bit =1 then      30365600
*                               JES3 console altering commands may      30367200
*                               be used in addition to MVS console      30368800
*                               commands.                               30370400
*                              -If JESPSUBA=1 and this bit =0 then      30372000
*                               MVS console altering commands may be    30373600
*                               used but JES3 console altering          30375200
*                               commands may not be used.               30376800
*                              -If JESPSUBA=0 then only MVS console     30378400
*                               altering commands may be used.          30380000
*                                                                @L1A*/ 30381600
*    3 JES3ACTV BIT(1),      /* JES3 SUBSYSTEM ACTIVE            @T4C*/ 30382800
*    3 JES3OUTD BIT(1),      /* JES3 support of OUTADD/OUTDEL           30384000
*                               MVS services is available        @D8C*/ 30385200
*    3 JESRSV24 BIT(1),      /* RESERVED                         @L1A*/ 30386400
*    3 JESRSV25 BIT(1),      /* RESERVED                         @L1A*/ 30388000
*    3 JESRSV26 BIT(1),      /* RESERVED                         @L1A*/ 30389600
*    3 JESRSV27 BIT(1),      /* RESERVED                         @L1A*/ 30391200
*   2 JESALLOP PTR(31),      /* Anchor for ALLOCAS control blocks       30392800
*                               - Initialized by IEFHB4I1    @G383P2J*/ 30394400
*   2 JESALLOA FIXED(15),    /* ASID of the ALLOCAS address space       30396000
*                               - Initialized by IEFAB4I0               30397600
*                                                            @G383P2J*/ 30400000
*   2 JESALLOF BIT(8),       /* MVS Allocation function flags@G860P2M*/ 30427300
*    3 JESUASR  BIT(1),      /* Unit allocation status recording is     30454600
*                               active                       @G383P2J*/ 30481900
*    3 JESUASF  BIT(1),      /* Unit allocation status recording has    30509200
*                               failed                       @G383P2J*/ 30536500
*    3 JESUPLER BIT(1),      /* UPL does not match the UCBs  @G860P2M*/ 30563800
*    3 JESALRDY BIT(1),      /* Allocation ready indicator       @L3C*/ 30591100
*    3 JESV2EDT BIT(1),      /* EDT version 2 or later indicator @D3C*/ 30618400
*    3 JESRSV05 BIT(1),      /* RESERVED                     @G383P2J*/ 30645700
*    3 JESRSV06 BIT(1),      /* RESERVED                     @G383P2J*/ 30673000
*    3 JESRSV07 BIT(1),      /* RESERVED                     @G383P2J*/ 30700300
*   2 JESRSV08 BIT(8),       /* RESERVED                     @G383P2J*/ 30727600
*   2 JESPCDP  PTR(31),      /* Pointer in CSA for PCDPARMS             30754900
*                               - Initialized by IEFHB4I1    @G382P2P*/ 30782200
*   2 JESAUCBS FIXED(31),    /* Number of all UCBs in the system        30809500
*                               - Initialized by IEFAB4I0    @G383P2J*/ 30836800
*   2 JESDUECB FIXED(31),    /* Display allocation SDUMP ECB @G383P2J*/ 30864100
*   2 JESUPLP  PTR(31),      /* UPL (UCB Pointer List) address          30891400
*                               - Initialized by IEFAB4I0    @G680P2P*/ 30918700
*   2 JESMNTP  PTR(31),      /* Address of an array of mountable        30946000
*                               device types.  The array mapping is     30973300
*                               included in this macro.                 31000600
*                               - initialized by allocation             31027900
*                                 initialization module IEFAB4I0        31055200
*                                                            @G860PPK*/ 31082500
*   2 JESCTEXT PTR(31),      /* Pointer to the pageable extension of    31109800
*                               the JESCT.  The mapping is included in  31137100
*                               this macro.                             31164400
*                               - initialized by IEFJSINT during        31191700
*                                 master scheduler base initialization  31219000
*                                                                @H1C*/ 31246300
*   2 JESPPT   PTR(31),      /* Pointer to the program properties       31273600
*                               table located in fetch protected        31300900
*                               scheduler key.                          31328200
*                               - initialized by IEFPPT during NIP      31355500
*                               processing.                      @L3C*/ 31405500
*   2 JESRSTRT PTR(31),      /* Pointer to the Restart codes table      31464700
*                               which defines the system abend codes    31492000
*                               that are eligible for automatic         31519300
*                               restart                                 31532900
*                               - initialized by IEFRCSTP during NIP    31546500
*                               processing.                      @D2C*/ 31560100
*   2 JESPARSE PTR(31),      /* Pointer to the PARSER routine           31573900
*                               (IEEMB887)                              31601200
*                               "Invalid after IPL"              @D2A*/ 31628500
*   2 JESXB603 PTR(31),      /* Pointer to the Scheduler/Restart        31655800
*                               Message Module (IEFXB603)               31683100
*                               "Invalid after IPL"              @R2A*/ 31710400
*   2 JESDACA  PTR(31),      /* Pointer to the Device Allocation        31737700
*                               Communication Area (DACA)               31765000
*                               - Initialized by IEFAB4IC        @L6C*/ 31792300
*   2 JESRSV28 PTR(31);      /* RESERVED                         @L6A*/ 31819600
*                                                                       31850000
*DECLARE                                                                31900000
* 1 JESMNTBL BASED(JESMNTP), /* Array of mountable device classes -     31942800
*                               This array is set up and initialized    31985600
*                               by IEFAB4I0                  @G860PPK*/ 32028400
*   2 JES#MNT  FIXED(15),    /* Number of device classes in this array  32071200
*                                                            @G860PPK*/ 32114000
*   2 JESMNTDT (*) BIT(8);   /* An individual device class   @G860PPK*/ 32156800
*                                                                       32200000
*                                                                       32250000
*/********************************************************************/ 32300000
*/*                                                                  */ 32350000
*/*  JESPEXT is a pageable extension of the JESCT pointed to     @H1A*/ 32400000
*/*  by JESCTEXT in the nucleus portion.                         @H1A*/ 32450000
*/*                                                                  */ 32500000
*/********************************************************************/ 32550000
*DECLARE                                                                32565000
* 1 JESPEXT BASED(JESCTEXT) BDY(WORD), /* Pageable section of the       32580000
*                                         JESCT                  @H1A*/ 32595000
*   2 JESSID   CHAR(7),      /* Identifier 'JESPEXT'             @H1A*/ 32610000
*   2 JESSVERS FIXED(8),     /* Control block version number            32625000
*                               filled in from JESSCVER          @H1A*/ 32640000
*   2 JESSJCNL PTR(31),      /* Address of Scheduler JCL facility       32655000
*                               glue routine IEFSJRTE                   32670000
*                               - Initialized by IEFSJLOD during        32685000
*                                 master scheduler base initialization  32700000
*                                                                @D1A*/ 32715000
*   2 JESSJDVT PTR(31),      /* Address of the JCL definition vector    32730000
*                               table chain                             32745000
*                               - Initialized by SJF during master      32760000
*                                 scheduler base initialization         32775000
*                               - This field is intended to be          32790000
*                                 managed by SJF via the SJFREQ macro   32805000
*                                 and services                   @D1A*/ 32820000
*   2 JESSJRNL PTR(31),      /* Address of the Job Journal write        32835000
*                               routine IEFXB501                        32850000
*                               - Assigned by IEFQBINT at master        32865000
*                                scheduler base initialization   @H1A*/ 32880000
*   2 JESDB401 PTR(31),      /* Unused except for formatter use  @P5C*/ 32917500
*   2 JESXVNSL PTR(31),      /* Address of the allocation non-standard  32955000
*                               label read routine IEFXVNSL             32970000
*                               - initialized by allocation             32985000
*                               initialization module IEFAB4I0   @L2A*/ 33000000
*   2 JESGB4DC PTR(31),      /* Address of the allocation dataset       33015000
*                               reservation/release module IEFGB4DC     33030000
*                               - initialized by allocation             33045000
*                               initialization module IEFAB4I0   @L2A*/ 33060000
*   2 JESGB4UV PTR(31),      /* Address of the allocation unit          33075000
*                               verification routine - IEFGB4UV         33090000
*                               - initialized by allocation             33105000
*                               initialization module IEFAB4I0   @L2A*/ 33120000
*   2 JESAB445 PTR(31),      /* Address of the device allocation        33135000
*                               defaults table                          33150000
*                               - initialized by allocation             33165000
*                               initialization module IEFAB4I0   @LEC*/ 33180000
*   2 JESGB400 PTR(31),      /* Address of the allocation Put routine   33195000
*                               IEFGB400                                33210000
*                               - initialized by allocation             33225000
*                               initialization module IEFAB4I0   @L2A*/ 33240000
*   2 JESQB551 PTR(31),      /* Address of SWA Manager Move Mode        33255000
*                               routine IEFQB551                        33270000
*                               - assigned by IEFQBINT at master        33285000
*                                scheduler base initialization   @L2A*/ 33300000
*   2 JESQB556 PTR(31),      /* Address of SWA Manager Locate Mode      33315000
*                               routine IEFQB556                        33330000
*                               - Normally referenced through the       33337500
*                                SWAREQ macro                           33345000
*                               - Assigned by IEFQBINT at master        33352500
*                                scheduler base initialization   @L2A*/ 33360000
*   2 JESXBPUT PTR(31),      /* Address of the Job Journal put          33375000
*                               routine IEFXBPUT                        33390000
*                               - Assigned by IEFQBINT at master        33405000
*                                scheduler base initialization   @L2A*/ 33420000
*   2 JESIB650 PTR(31),      /* Address of the initiator message        33435000
*                               module IEFIB650                         33450000
*                               - Assigned by IEFJSINT at master        33465000
*                                scheduler base initialization   @T1C*/ 33480000
*   2 JESSJF   PTR(31),      /* Address of the Scheduler JCL Facility   33495000
*                               control routine IEFSJCNL                33510000
*                               - initialized by IEFSJLOD during        33525000
*                                 master scheduler base initialization  33540000
*                               - Normally referenced through the       33555000
*                                 SJFREQ macro                   @L4C*/ 33570000
*   2 JESTIOTS FIXED(31),    /* Size of the TASK I/O Table (TIOT) in    33585000
*                               bytes                                   33600000
*                               - Initialized by allocation             33615000
*                                 initialization module IEFAB4I0 @L4A*/ 33630000
*   2 JESMAXDD FIXED(31),    /* Maximum number of single unit DD's      33645000
*                               allowed for one job step                33660000
*                               - Initialized by allocation             33675000
*                                 initialization module IEFAB4I0 @L5C*/ 33690000
*   2 JESPQMST PTR(31),      /* Address of the default SWA Manager      33705000
*                               storage table (usually IEFQBMST) which  33720000
*                               contains the indicators for which SWA   33735000
*                               blocks may reside above the line.       33750000
*                               - Assigned by IEFQBINT at master        33765000
*                                scheduler base initialization   @L5A*/ 33780000
*   2 JESPQDIR PTR(31),      /* Address of the SWA Manager diagnostics  33795000
*                               routine                                 33810000
*                               - Assigned by IEFQBINT at master        33825000
*                                scheduler base initialization   @L5A*/ 33840000
*   2 JESGDTOK PTR(31),      /* Address of the allocation Get DD token  33855000
*                               service IEFAB4C5                        33870000
*                               - Initialized by allocation             33885000
*                               initialization module IEFAB4I0   @D4A*/ 33900000
*   2 JESSMSIB PTR(31),      /* Pointer to the Storage Management       33915000
*                               Subsystem SSIB                          33930000
*                               - Initialized by the storage management 33945000
*                                 subsystem.                            33960000
*                               - Its presence indicates that the       33975000
*                                 storage management subsystem is       33990000
*                                 started                        @L6C*/ 34005000
*   2 JESQBSVA PTR(31),      /* Address of SWA Manager supporting       34020000
*                               unauthorized, task and cross memory     34035000
*                               mode callers                            34050000
*                               - assigned by IEFQBINT at master        34065000
*                                scheduler base initialization   @D5A*/ 34080000
*   2 JESMECHK PTR(31),      /* Address of the Mutual exclusivity       34095000
*                               checker routine for JCL or dynamic      34110000
*                               allocation keys                         34125000
*                               - Initialized by IEFSJLOD during        34140000
*                               master scheduler base initialization    34155000
*                                                                @L6A*/ 34170000
*   2 JESXBCHK PTR(31),      /* Address of the scheduler checkpoint     34185000
*                               SWA blocks routine, used by DFP during  34200000
*                               checkpoint processing                   34215000
*                               - Assigned by IEFQBINT at master        34230000
*                               scheduler base initialization    @L7C*/ 34245000
*   2 JESFSICB PTR(31),      /* Address of FSI trace Control Block      34251000
*                                                                @T3A*/ 34257000
*   2 JESSJTCL PTR(31),      /* Address of the SWBTU processor          34263000
*                               control routine IEFSJTCL:               34266000
*                               - initialized by IEFSJLOD during        34269000
*                                 master scheduler base initialization  34272000
*                               - Normally referenced through the       34275000
*                                 SWBTUREQ macro                 @L8C*/ 34278000
*   2 JESPPTUS FIXED(31),    /* PPT concurrent table use count          34279000
*                               - Normally referenced through the       34280000
*                                 IEFPPSCN macro                 @LBC*/ 34281000
*   2 JESPPTSC PTR(31),      /* PPT scan routine IEFPPTSC:              34282000
*                               - initialized by IEFSJINT during        34283000
*                                 master scheduler base initialization  34284000
*                               - Normally referenced through the       34285000
*                                 IEFPPSCN macro                 @LBC*/ 34286000
*   2 JESDSNNO FIXED(31),    /* Counter for final qualifier of          34286500
*                               temporary dataset name           @P3C*/ 34287000
*   2 JESDSNID CHAR(2),      /* ID for temporary data sets on this      34287200
*                               system.                          @P6A*/ 34287400
*   2 JESRSVEA FIXED(15),    /* Reserved for future use          @P6C*/ 34287600
*   2 JESSSIVT FIXED(31),    /* Token for SSI vector table              34287700
*                               - Initialized before MSTR subsystem     34287800
*                                 initialization                 @LDA*/ 34287900
*   2 JESSSIPC FIXED(32),    /* PC number for Dynamic SSI subsystem     34288000
*                               services                                34288100
*                               - Initialized during master scheduler   34288200
*                                 initialization                        34288300
*                               - Accessed through IEFSSI macro  @LDA*/ 34288400
*   2 JESVTPC  FIXED(32),    /* PC number for IEFSSVT macro             34288500
*                               - Initialized during master scheduler   34288600
*                                 initialization                        34288700
*                               - Accessed through IEFSSVT macro @LDA*/ 34288800
*   2 JESMSGT@ PTR(31),      /* SSI message table address               34288900
*                               - Initialized before MSTR subsystem     34289000
*                                 initialization                 @LDA*/ 34289100
*   2 JESRSVEB FIXED(31),    /* Reserved for future use          @P3A*/ 34289200
*   2 JESRSVEC FIXED(31),    /* Reserved for future use          @P3A*/ 34289300
*   2 JESRSVED FIXED(31);    /* Reserved for future use          @P3A*/ 34289400
*/********************************************************************/ 34290000
*/*                                                                  */ 34305000
*/*  The JESSCVER field has had the following values in the past.    */ 34320000
*/*  - The version of the JESCT is only updated when the JESCT is    */ 34335000
*/*    physically changed (e.g. increase in length)                  */ 34350000
*/*                                                                  */ 34365000
*/*  This field is not intended to be used to indicate the level     */ 34380000
*/*  of MVS that is installed although it can be used to obtain      */ 34390000
*/*  that information in some cases.                                 */ 34400000
*/*                                                                  */ 34410000
*/*  JESSCVER = 1 - SP132,133,135                                    */ 34425000
*/*  JESSCVER = 2 - SP211,212,213,214,216,217                        */ 34440000
*/*  JESSCVER = 3 - SP220                                            */ 34455000
*/*  JESSCVER = 4 - SP223,310                                        */ 34470000
*/*  JESSCVER = 5 - Not used                                         */ 34485000
*/*  JESSCVER = 6 - SP410                                        @L8A*/ 34492500
*/*  JESSCVER = 7 - SP430                                        @P3A*/ 34496200
*/*  JESSCVER = 8 - SP520                                        @LDA*/ 34498100
*/*                                                                  */ 34500000
*/********************************************************************/ 34515000
*DCL JESSCVER FIXED(8) CONSTANT(8);    /* Current version level  @LDC*/ 34530000
*DCL JESSCID  CHAR(7)  CONSTANT('JESPEXT'); /* Identifier        @H1A*/ 34545000
*%IF JESCTEP = 'NO' %THEN %GOTO JESCTEND; /*                     @L7A*/ 34560000
*/********************************************************************/ 34575000
*/*                                                                  */ 34590000
*/* Start of declares for PLS entry points.                          */ 34605000
*/*                                                                  */ 34620000
*/* This may be bypassed by coding the following:                    */ 34635000
*/*        %JESCTEP = 'NO' before 'Including' this macro             */ 34650000
*/*                                                                  */ 34665000
*/* This option allows the exclusion of these entry point declares   */ 34680000
*/* because they can cause problems for PLS-PLAS and 370-XA          */ 34695000
*/* conversions.                                                     */ 34710000
*/*                                                                  */ 34725000
*/* Note:                                                            */ 34740000
*/*      By bypassing these entry points many executable macros      */ 34755000
*/*      which require the IEFJESCT mapping macro will now require   */ 34770000
*/*      an additional declare for the Entry Point.  By coding       */ 34785000
*/*      the entry declares separately the programmer accepts        */ 34800000
*/*      the responsibility for changes to the interface.            */ 34815000
*/*                                                                  */ 34830000
*/********************************************************************/ 34845000
*DECLARE SWAMGR   ENTRY BASED(JESQB556) VALRG(*) OPTIONS(AMODE(*)); /*  34860000
*                            To call the LOCATE mode SWA Manager use    34875000
*                            the SWAREQ macro.  It will issue a         34890000
*                            'CALL SWAMGR'                       @L5C*/ 34905000
*DECLARE SSREQ    ENTRY BASED(JESSSREQ) VALRG(*) OPTIONS(VLIST); /*     34920000
*                             To call the subsystem use the IEFSSREQ    34935000
*                             macro. It will issue a 'CALL SSREQ'    */ 34950000
*DECLARE IEFW21SD ENTRY BASED(JESALLOC) OPTIONS(AMODE(*)) VALRG(*); /*  34965000
*                             To enter allocation issue 'CALL IEFW21SD' 34980000
*                                                                @L3C*/ 35000000
*DECLARE IEFBB410 ENTRY BASED(JESUNALC) OPTIONS(AMODE(*)) VALRG(*); /*  35050000
*                             To enter unallocation issue               35100000
*                             'CALL IEFBB410'                    @L3C*/ 35150000
*DECLARE IEFAB4F5 ENTRY BASED(JESCATL)  OPTIONS(AMODE(*)) VALRG(*); /*  35200000
*                             To Enter private catalog allocation       35250000
*                             issue 'CALL IEFAB4F5'              @L3C*/ 35300000
*DECLARE SJF      ENTRY BASED(JESSJCNL) VALRG(*);                   /*  35350000
*                             To call the Scheduler JCL Facility        35400000
*                             use the SJFREQ macro.              @H1A*/ 35450000
*DECLARE SWBTU    ENTRY BASED(JESSJTCL) OPTIONS(AMODE(31,*))            35458300
*                                       VALRG(*); /* To call the        35466600
*                             Scheduler JCL Facility SWB text unit      35474900
*                             service (IEFSJTCL) use the SWBTUREQ       35483200
*                             macro.                             @L9C*/ 35491500
*DECLARE MSWAMGR  ENTRY BASED(JESQMGR)  VALRG(*); /* TO CALL THE MOVE   35500000
*                             To call the MOVE mode SWA Manager use     35550000
*                             the IEFQMREQ macro.  It will issue a      35600000
*                             'CALL MSWAMGR'                     @L5A*/ 35650000
*DECLARE GETDDTOK ENTRY BASED(JESGDTOK) OPTIONS(AMODE(31)) VALRG(*); /* 35700000
*                             To call the allocation get DD token       35750000
*                             service issue 'CALL GETDDTOK'      @D4A*/ 35800000
*DECLARE SWADIR   ENTRY BASED(JESPQDIR) OPTIONS(AMODE(31)) VALRG(*); /* 35850000
*                             To call the SWA Manager diagnostics       35900000
*                             routine issue 'CALL SWADIR'        @L5A*/ 35950000
*DECLARE USWAMGR  ENTRY BASED(JESQBSVA) OPTIONS(AMODE(31)) VALRG(*); /* 35970000
*                             To call the unauthorized SWA Manager      35990000
*                             use the SWAREQ macro. It will issue a     36010000
*                             'CALL USWAMGR'                     @T2A*/ 36030000
*DECLARE SJFCNL   ENTRY BASED(JESSJF) OPTIONS(AMODE(31,*)) VALRG(*); /* 36034000
*                             To call the Scheduler JCL Facility        36038000
*                             control routine directly from             36042000
*                             SJFREQ                             @P2C*/ 36046000
*DECLARE PPTSCAN  ENTRY BASED(JESPPTSC)                                 36046800
*                 OPTIONS(AMODE(31,*)) VALRG(*); /* To call the         36047600
*                             PPT scan routine IEFPPTSC via the         36048400
*                             IEFPPSCN macro                     @LBA*/ 36049200
*%JESCTEND: ;                                                           36050000
