*  %GOTO FRQPPRO;                   /*                                  00050000
         MACRO                                                          00100000
         IEFJFRQP                                                       00150000
.*/  %FRQPPRO: ;                    /*                               */ 00200000
*/**** START OF SPECIFICATIONS ***************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* MACRO NAME:  IEFJFRQP                                         */ 00350000
*/*                                                                  */ 00400000
*/*01* DESCRIPTIVE NAME:  IEFJFRQ Exit Routine Parameter List        */ 00450000
*/*                                                                  */ 00500000
*/*02*   ACRONYM:  FRQP                                              */ 00550000
*/*                                                                  */ 00600000
*/*01* PROPRIETARY STATEMENT=                                        */ 00650000
*/***PROPRIETARY_STATEMENT********************************************/ 00700000
*/*                                                                  */ 00750000
*/*                                                                  */ 00800000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00850000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00900000
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1994                            */ 00950000
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 01000000
*/*                                                                  */ 01050000
*/* STATUS= HBB5520                                                  */ 01100000
*/*                                                                  */ 01150000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01200000
*/*                                                                  */ 01250000
*/*01* FUNCTION:  Maps the parameter list passed to exit             */ 01300000
*/*      routines associated with the IEFJFRQ exit point.            */ 01350000
*/*                                                                  */ 01400000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 01450000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01500000
*/*                                                                  */ 01550000
*/*01* DSECT NAME:                                                   */ 01600000
*/*      FRQP            - IEFJFRQP parameter list                   */ 01650000
*/*      FRQP_PLIST_AREA - Pointer list on entry to IEFJFRQ          */ 01700000
*/*                                                                  */ 01750000
*/*01* COMPONENT:  Subsystem Interface (SC1B6)                       */ 01800000
*/*                                                                  */ 01850000
*/*01* EYE-CATCHER:  FRQP                                            */ 01900000
*/*02*   OFFSET:  0                                                  */ 01950000
*/*02*   LENGTH:  4 bytes                                            */ 02000000
*/*                                                                  */ 02050000
*/*01* STORAGE ATTRIBUTES:                                           */ 02100000
*/*02*   SUBPOOL:  230 when IEFJFRQ is called in supervisor state,   */ 02150000
*/*                132 when IEFJFRQ is called in problem state       */ 02200000
*/*02*   KEY:  Key of the caller of the SSI, or key 1                */ 02250000
*/*02*   RESIDENCY:  Below                                           */ 02300000
*/*02*   MAIN STORAGE:  No                                           */ 02350000
*/*02*   AUXILIARY STORAGE:  Yes                                     */ 02400000
*/*02*   VIRTUAL STORAGE:  Yes                                       */ 02450000
*/*02*   DATA SPACE:  No                                             */ 02500000
*/*                                                                  */ 02550000
*/*01* SIZE:  40 bytes (decimal)                                     */ 02600000
*/*                                                                  */ 02650000
*/*01* CREATED BY:  Subsystem Interface                              */ 02700000
*/*                                                                  */ 02750000
*/*01* POINTED TO BY:                                                */ 02800000
*/*      First word of a 2-word parameter list pointed to by         */ 02850000
*/*      register 1 on entry to an IEFJFRQ exit routine              */ 02900000
*/*                                                                  */ 02950000
*/*01* SERIALIZATION:  None                                          */ 03000000
*/*                                                                  */ 03050000
*/****INVOCATION******************************************************/ 03100000
*/*                                                                  */ 03150000
*/*01* METHOD OF ACCESS:                                             */ 03200000
*/*                                                                  */ 03250000
*/*02*   BAL:                                                        */ 03300000
*/*        IEFJFRQP                                                  */ 03350000
*/*                                                                  */ 03400000
*/*02*   PL/X                                                        */ 03450000
*/*        %DCL FRQPATTR CHAR EXT                                    */ 03500000
*/*        %FRQPATTR = 'BASED BDY(WORD)' or 'BDY(WORD)'              */ 03550000
*/*           Defaults to 'BASED(*) BDY(WORD)'                       */ 03600000
*/*        %INCLUDE SYSLIB(IEFJFRQP)                                 */ 03650000
*/*                                                                  */ 03700000
*/********************************************************************/ 03750000
*/*                                                                  */ 03800000
*/*01* DELETED BY:  Subsystem Interface                              */ 03850000
*/*                                                                  */ 03900000
*/*01* NOTES:  None                                                  */ 03950000
*/*                                                                  */ 04000000
*/*02*   DEPENDENCIES:  None                                         */ 04050000
*/*                                                                  */ 04100000
*/*02*   RESTRICTIONS:  None                                         */ 04150000
*/*                                                                  */ 04200000
*/*01* DISTRIBUTION LIBRARY:  AMACLIB                                */ 04250000
*/*                                                                  */ 04300000
*/*01* CHANGE ACTIVITY = 00                                          */ 04350000
*/*                                                                  */ 04400000
*/* $00= OW11157 HBB5520 950301 PDBN: Function request exit          */ 04450000
*/*                                                                  */ 04500000
*/**** END OF SPECIFICATIONS *****************************************/ 04550000
*/* A - Created for the IEFJFRQ function request exit.           @00A*/ 04600000
*/********************************************************************/ 04650000
*        % GO TO FRQPPLX;           /*                                  04700000
FRQP     DSECT                      IEFJFRQ parameter list              04750000
FRQP_HEADER      DS    0F           Parameter list header               04800000
FRQPID           DS    CL4          Control block identifier           +04850000
                                      (FRQPCID)                         04900000
FRQPVERS         DS    H            Version number. Current            +04950000
                                      version number is FRQPCVER.       05000000
FRQPLEN          DS    H            Length of parameter list            05050000
                 DS    CL4          Reserved                            05100000
FRQP_INPUT       DS    0F           Input passed to exit routine        05150000
FRQP_SSOB@       DS    A            Address of SSOB representing       +05200000
                                      the current SSI function         +05250000
                                      request                           05300000
FRQP_INPUT_FLAGS DS    0CL2         Flags describing the current       +05350000
                                      SSI request                       05400000
FRQP_INPUT_FLAG1 DS    CL1          First flag byte                     05450000
FRQP_BCST_RQST   EQU   X'80'        On when the current function       +05500000
                                      request is broadcast, off        +05550000
                                      when directed                     05600000
FRQP_PRE_RQST    EQU   X'40'        On when the exit routine is        +05650000
                                      being called before the          +05700000
                                      function request is processed    +05750000
                                      by the target subsystem, off     +05800000
                                      when the request has been        +05850000
                                      processed by all subsystems       05900000
FRQP_LOJ_SSIB    EQU   X'20'        On when the SSI provided a         +05950000
                                      copy of the life-of-job SSIB     +06000000
                                      (original SSOBSSIB=0)             06050000
FRQP_INPUT_FLAG2 DS    CL1          Second flag byte                    06100000
                 DS    H            Reserved                            06150000
FRQP_CURRENT_SSI_RETCODE  DS  F     Current cumulative return code     +06200000
                                      that would be returned to        +06250000
                                      the SSI's caller if the exit     +06300000
                                      does not intervene                06350000
FRQP_CORRELATION_TOKEN  DS  0CL12   Token identifying                  +06400000
                                      current function request, for    +06450000
                                      use in correlating the           +06500000
                                      multiple exit calls resulting    +06550000
                                      from the same directed or        +06600000
                                      broadcast function request        06650000
FRQP_SYSTEM_TOKEN       DS  CL8     This piece of the token is         +06700000
                                      unique across an IPL on a        +06750000
                                      single system                     06800000
FRQP_SYSPLEX_ID         DS  F       This piece of the token appended   +06850000
                                      to FRQP_SYSTEM_TOKEN makes       +06900000
                                      the correlation token unique     +06950000
                                      across the sysplex                07000000
                 DS    CL4          Reserved                            07050000
FRQP_END         EQU   *            End of FRQP parameter list          07100000
*                                                                       07150000
*********************************************************************** 07200000
*   Pointer list mapping                                              * 07250000
*********************************************************************** 07300000
FRQP_PLIST_AREA DSECT ,             Parameter list pointed to by       +07350000
                                      register 1 on entry to an        +07400000
                                      IEFJFRQ exit routine              07450000
FRQP_PLIST@   DS    F               Address of IEFJFRQP parameter      +07500000
                                      list                              07550000
FRQP_DYNAREA@ DS    F               Address of working storage         +07600000
                                      provided to exit routine          07650000
FRQP_DYNAREA_LAST EQU  X'80'        High-order bit indicates that      +07700000
                                      this is the last pointer in      +07750000
                                      the parameter list                07800000
*                                                                       07850000
*********************************************************************** 07900000
*   Constant values                                                   * 07950000
*********************************************************************** 08000000
FRQPCID          EQU   C'FRQP'        Control block ID value            08050000
FRQPVER1         EQU   1            First version of FRQP               08100000
FRQPCVER         EQU   FRQPVER1     Current version of FRQP             08150000
FRQP_DYNSIZE     EQU   512          Size of working storage            +08200000
                                      provided to exit routines         08250000
FRQP_LEN         EQU   FRQP_END-FRQP  Length of FRQP parameter list     08300000
*                                                                       08350000
*********************************************************************** 08400000
*   Return code values set by IEFJFRQ exit routines                   * 08450000
*                                                                     * 08500000
*   The SSI checks return codes only on return from the pre-request   * 08550000
*   instance of the IEFJFRQ exit.  The return code is ignored on      * 08600000
*   return from the post-request instance of the exit.                * 08650000
*********************************************************************** 08700000
FRQP_PROCEED     EQU   0            Route the request to the           +08750000
                                      target subsystem                  08800000
FRQP_SUPPRESS    EQU   4            Do not route the request to        +08850000
                                      the target subsystem              08900000
FRQP_INTERRUPT   EQU   8            Do not route the request to        +08950000
                                      the target subsystem or to       +09000000
                                      any subsystems not yet           +09050000
                                      processed (broadcast             +09100000
                                      requests only                     09150000
FRQP_STOP_EXIT_ROUTINE_CALLS EQU  24  Do not route the request to      +09200000
                                      the target subsystem or to any   +09250000
                                      subsystems not yet processed     +09300000
                                      (broadcast requests only)        +09350000
                                      and do not call any other        +09400000
                                      exit routines associated with    +09450000
                                      this exit                         09500000
         MEND                                                        */ 09550000
* %FRQPPLX:;                                                            09600000
*                                                                       09650000
* %IF FRQPATTR = '' %THEN                                               09700000
*    %FRQPATTR = 'BASED(*) BDY(WORD)';                                  09750000
*                                                                       09800000
*DCL 1 FRQP FRQPATTR,               /* IEFJFRQ parameter list        */ 09850000
*      3 FRQP_HEADER,               /* Parameter list header         */ 09900000
*        5 FRQPID CHAR(4),          /* Control block identifier         09950000
*                                      (FRQPCID)                     */ 10000000
*        5 FRQPVERS FIXED(16),      /* Version number. Current          10050000
*                                      version number is FRQPCVER.   */ 10100000
*        5 FRQPLEN FIXED(16),       /* Length of parameter list      */ 10150000
*        5 * CHAR(4),               /* Reserved                      */ 10200000
*      3 FRQP_INPUT BDY(WORD),      /* Input passed to exit routine  */ 10250000
*        5 FRQP_SSOB@ PTR(31),      /* Address of SSOB representing     10300000
*                                      the current SSI function         10350000
*                                      request                       */ 10400000
*        5 FRQP_INPUT_FLAGS BIT(16), /* Flags describing the current    10450000
*                                      SSI request                   */ 10500000
*          7 FRQP_INPUT_FLAG1 BIT(8),  /* First flag byte            */ 10550000
*            9 FRQP_BCST_RQST BIT(1), /* On when the current function   10600000
*                                      request is broadcast, off        10650000
*                                      when directed                 */ 10700000
*            9 FRQP_PRE_RQST BIT(1),  /* On when the exit routine is    10750000
*                                      being called before the          10800000
*                                      function request is processed    10850000
*                                      by the target subsystem, off     10900000
*                                      when the request has been        10950000
*                                      processed by all subsystems   */ 11000000
*            9 FRQP_LOJ_SSIB BIT(1),  /* On when the SSI provided a     11050000
*                                      copy of the life-of-job SSIB     11100000
*                                      (original SSOBSSIB=0)         */ 11150000
*            9 * BIT(5),            /* Reserved                      */ 11200000
*          7 FRQP_INPUT_FLAG2 BIT(8),  /* Second flag byte           */ 11250000
*        5 * CHAR(2),               /* Reserved                      */ 11300000
*        5 FRQP_CURRENT_SSI_RETCODE FIXED(32), /* Current cumulative    11350000
*                                      return code that would be        11400000
*                                      returned to the SSI's caller     11450000
*                                      if the exit does not             11500000
*                                      intervene                     */ 11550000
*        5 FRQP_CORRELATION_TOKEN CHAR(12) BDY(WORD),                   11600000
*                                   /* Token identifying                11650000
*                                      current function request         11700000
*                                      for use in correlating the       11750000
*                                      multiple exit calls resulting    11800000
*                                      from the same directed or        11850000
*                                      broadcast function request    */ 11900000
*          7 FRQP_SYSTEM_TOKEN CHAR(8),  /* This piece of the token     11950000
*                                      is unique across an IPL on       12000000
*                                      a single system               */ 12050000
*          7 FRQP_SYSPLEX_ID FIXED(32), /* This piece of the token      12100000
*                                      appended to FRQP_SYSTEM_TOKEN    12150000
*                                      makes the correlation token      12200000
*                                      unique across the sysplex     */ 12250000
*        5 * CHAR(4),               /* Reserved                      */ 12300000
*      3 FRQP_END CHAR(0);                                              12350000
*                                                                       12400000
*/********************************************************************/ 12450000
*/* Pointer list mapping                                             */ 12500000
*/********************************************************************/ 12550000
*DCL 1 FRQP_PLIST_AREA BASED(*),    /* Parameter list pointed to by     12600000
*                                      register 1 on entry to an        12650000
*                                      IEFJFRQ exit routine          */ 12700000
*      3 FRQP_PLIST@ PTR(31),       /* Address of IEFJFRQP parameter    12750000
*                                      list                          */ 12800000
*      3 FRQP_DYNAREA@ PTR(31),     /* Address of working storage       12850000
*                                      provided to exit routine      */ 12900000
*        5 FRQP_DYNAREA_LAST BIT(1); /* High-order bit indicates that   12950000
*                                      this is the last pointer in      13000000
*                                      the parameter list            */ 13050000
*                                                                       13100000
*/********************************************************************/ 13150000
*/* Constant values                                                  */ 13200000
*/********************************************************************/ 13250000
*DCL FRQPCID CHAR(4) CONSTANT('FRQP');  /* Control block ID value    */ 13300000
*                                                                       13350000
*DCL FRQPVER1 FIXED(15) CONSTANT(1);  /* First version of FRQP       */ 13400000
*DCL FRQPCVER FIXED(15) CONSTANT(FRQPVER1);  /* Current version         13450000
*                                      of FRQP                       */ 13500000
*DCL FRQP_DYNSIZE CONSTANT(512);    /* Size of working storage          13550000
*                                      provided to exit routines     */ 13600000
*/********************************************************************/ 13650000
*/* Return code values set by IEFJFRQ exit routines                  */ 13700000
*/*                                                                  */ 13750000
*/* The SSI checks return codes only on return from the pre-request  */ 13800000
*/* instance of the IEFJFRQ exit.  The return code is ignored on     */ 13850000
*/* return from the post-request instance of the exit.               */ 13900000
*/********************************************************************/ 13950000
*DCL FRQP_PROCEED FIXED(32) CONSTANT(0);  /* Route the request to       14000000
*                                      the target subsystem          */ 14050000
*DCL FRQP_SUPPRESS FIXED(32) CONSTANT(4); /* Do not route the request   14100000
*                                      to the target subsystem       */ 14150000
*DCL FRQP_INTERRUPT FIXED(32) CONSTANT(8);  /* Do not route the         14200000
*                                      request to the target            14250000
*                                      subsystem or to any              14300000
*                                      subsystems not yet processed     14350000
*                                      (broadcast requests only)     */ 14400000
*DCL FRQP_STOP_EXIT_ROUTINE_CALLS FIXED(32) CONSTANT(24);  /* Do not    14450000
*                                      route the request to the         14500000
*                                      target subsystem or to any       14550000
*                                      subsystems not yet processed     14600000
*                                      (broadcast requests only)        14650000
*                                      and do not call any other        14700000
*                                      exit routines associated with    14750000
*                                      this exit                     */ 14800000
