*  %GOTO SJREPRO;                         /*                            00050000
       MACRO                                                            00100000
       IEFSJREP &DSECT=YES                                              00150000
.*/ %SJREPRO: ;                                                         00200000
*/***START OF SPECIFICATIONS*************************************@P1C*/ 00250000
*/*                                                                  */ 00300000
*/* MACRO NAME = IEFSJREP                                        @P1C*/ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME = SJF Retrieve Parameter List               @P1C*/ 00450000
*/*                                                                  */ 00500000
*/*01* PROPRIETARY STATEMENT=                                        */ 00550000
*/***PROPRIETARY_STATEMENT********************************************/ 00600000
*/*                                                                  */ 00850000
*/*                                                                  */ 00950000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00962500
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00975000
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1982, 1993                      */ 00987500
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 01000000
*/*                                                                  */ 01012500
*/* STATUS= HBB5510                                                  */ 01025000
*/*                                                                  */ 01037500
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01050000
*/*                                                                  */ 01062500
*/* FUNCTION = Maps the input and output to the SJF Retrieve     @P1C*/ 01075000
*/*            Routine                                               */ 01087500
*/*                                                                  */ 01100000
*/* MODULE TYPE = MACRO                                              */ 01150000
*/*                                                                  */ 01151700
*/* DSECT NAME = SJREP                                           @P1A*/ 01153400
*/*                                                                  */ 01155100
*/* ACRONYM = SJREP                                              @P1A*/ 01156800
*/*                                                                  */ 01158500
*/* COMPONENT = Scheduler JCL Facility (BB131)                   @P1A*/ 01160200
*/*                                                                  */ 01161900
*/*01* EXTERNAL CLASSIFICATION:                                  @P1A*/ 01163600
*/*02* GUPI: BASE                                                @P1A*/ 01165300
*/*02* DMTI: FIELDS SJRENREC                                     @P1A*/ 01167000
*/*                 SJREANBK                                     @P1A*/ 01168700
*/*                 SJREANCA                                     @P1A*/ 01170400
*/*01* END OF EXTERNAL CLASSIFICATION                            @P1A*/ 01172100
*/*                                                                  */ 01173800
*/* EYE CATCHER = SJRE                                           @P1A*/ 01175500
*/*    OFFSET = 0                                                @P1A*/ 01177200
*/*    LENGTH = 4                                                @P1A*/ 01178900
*/*                                                                  */ 01180600
*/* STORAGE ATTRIBUTES =                                         @P1A*/ 01182300
*/*                KEY = Key of caller                           @P1A*/ 01184000
*/*                SIZE = 48 bytes                               @P1A*/ 01185700
*/*                                                                  */ 01187400
*/* CREATED BY = Caller of SJFREQ REQUEST=RETRIEVE               @P1A*/ 01189100
*/*                                                                  */ 01190800
*/* POINTED TO BY = On entry to SJF, register 1 points to a word @P1A*/ 01192500
*/*                 that points to SJREP.                        @P1A*/ 01194200
*/*                                                                  */ 01195900
*/* SERIALIZATION = None                                         @P1A*/ 01197600
*/*                                                                  */ 01200000
*/* INVOCATION =                                                     */ 01250000
*/*                                                                  */ 01300000
*/*   BAL - IEFSJREP DSECT=YES OR NO                                 */ 01350000
*/*         DSECT=YES IS THE DEFAULT                                 */ 01400000
*/*         DECLARE A CONSTANT EQUAL TO 'SJRE' TO STORE IN SJREID    */ 01450000
*/*                                                                  */ 01500000
*/*   PL/S - %DCL SJREATRB CHAR                                      */ 01550000
*/*          %SJREATRB = 'BASED' OR 'BDY(WORD)' OR ''                */ 01600000
*/*          %INCLUDE SYSLIB(IEFSJREP)                               */ 01650000
*/*                                                                  */ 01700000
*/* CHANGE ACTIVITY = H0,L1, P1                                  @P1C*/ 01750000
*/*  $H0= EXTJCL JBB2110 820702 PD43: SUPPORT FOR EXTENDED JCL       */ 01800000
*/*  $L1= SWABOVE JBB2220 850805 PDT3: SWA ABOVE THE LINE        @L1A*/ 01850000
*/*  $P1= PIG1424 HBB5510 930715 PDDZ: SHOWHDR Compliance        @P1A*/ 01875000
*/*                                                                  */ 01900000
*/***END OF SPECIFICATIONS***************************************@P1C*/ 01950000
*/* A 000000-999999                                              @H0A*/ 02000000
*/* A UPDATE DESCRIPTION OF TOKEN FIELDS                         @L1A*/ 02050000
*/* C Changed prolog to be SHOWHDR compliant                     @P1A*/ 02075000
*  %GOTO SJREPLS;                 /*                                    02100000
          AIF   ('&DSECT' EQ 'NO').SJRE01                               02150000
SJREP     DSECT                                                         02200000
          AGO  .SJRE02                                                  02250000
.SJRE01   ANOP                                                          02300000
SJREP     DS  0F                     SJF RETRIEVE PARAMETER LIST        02350000
.SJRE02   ANOP                                                          02400000
SJREID    DS  CL4                    IDENTIFIER 'SJRE'                  02450000
SJREVERS  DS  XL1                    VERSION NUMBER                     02500000
SJREFLAG  DS  XL1                    CONTROL FLAGS                      02550000
SJRENREC  EQU X'80'                  NO RECOVERY                        02600000
SJRENOCU  EQU X'40'                  NO CLEANUP                         02650000
SJRELEN   DS  H                      LENGTH OF PARAMETER LIST           02700000
SJRESTOR  DS  F                      LOCAL STORAGE POINTER OR ZERO      02750000
SJREREAS  DS  F                      REASON CODE                        02800000
SJREJDVT  DS  CL8                    NAME OF JDVT OR ZEROES             02850000
SJRETOKN  DS  0D                     SWB CHAIN TOKEN                    02900000
SJREANBK  DS  F                      ADDRESS OF CONTROL BLOCK FOR A     02950000
*                                    JCL STATEMENT (JCT, SCT, SIOT      03000000
*                                    OR SWB) OR THE ADDRESS OF A        03050000
*                                    SWB CHAIN                          03100000
SJREANCA  DS  F                      ADDRESS OF A WORD POINTING TO      03150000
*                                    A SWB CHAIN OR ZERO                03200000
SJREAREA  DS  F                      STORAGE AREA ADDRESS               03250000
SJRESIZE  DS  H                      SIZE OF STORAGE AREA               03300000
SJRENKWD  DS  H                      NUMBER OF KEYWORDS PASSED          03350000
SJREKWDL  DS  F                      KEYWORD LIST ADDRESS               03400000
SJREKERR  DS  F                      ADDRESS OF KEYWORD CAUSING ERROR   03450000
SJRELGTH  EQU *-SJREP                LENGTH OF THE SJF RETRIEVE         03500000
*                                    PARAMETER LIST                     03550000
SJRECVER  EQU 01                     CURRENT VERSION NUMBER             03600000
*                                                                       03650000
SJRELIST  DSECT                      KEYWORD LIST                       03700000
SJREKEYW  DS  CL8                    KEYWORD FOR RETRIEVE               03750000
SJRETPAD  DS  F                      ADDRESS OF A LIST OF TEXT UNIT     03800000
*                                     POINTERS                          03850000
SJREKLEN  EQU *-SJRELIST             LENGTH OF ONE KEYWORD LIST         03900000
*                                    ENTRY                              03950000
          MEND                                                          04000000
.*/ %SJREPLS: ;                                                         04050000
* DCL 1 SJREP SJREATRB,            /* SJF RETRIEVE PARAMETER LIST    */ 04100000
*      2 SJREID     CHAR(4),       /* IDENTIFIER 'SJRE'              */ 04150000
*      2 SJREVERS   FIXED(8),      /* VERSION NUMBER                 */ 04200000
*      2 SJREFLAG   BIT(8),        /* CONTROL FLAGS                  */ 04250000
*       3 SJRENREC BIT(1),         /* NO RECOVERY                    */ 04300000
*       3 SJRENOCU BIT(1),         /* NO CLEANUP                     */ 04350000
*       3 *        BIT(6),         /* RESERVED                       */ 04400000
*      2 SJRELEN  FIXED(15),       /* LENGTH OF PARAMETER LIST       */ 04450000
*      2 SJRESTOR PTR(31),         /* LOCAL STORAGE POINTER OR ZERO  */ 04500000
*      2 SJREREAS FIXED(31),       /* REASON CODE                    */ 04550000
*      2 SJREJDVT   CHAR(8),       /* NAME OF JDVT OR ZEROES         */ 04600000
*      2 SJRETOKN,                 /* SWB CHAIN TOKEN                */ 04650000
*       3 SJREANBK   PTR(31),      /* ADDRESS OF CONTROL BLOCK FOR A    04700000
*                                     JCL STATEMENT (JCT, SCT, SIOT     04750000
*                                     OR SWB) OR THE ADDRESS OF A       04800000
*                                     SWB CHAIN                      */ 04850000
*       3 SJREANCA   PTR(31),      /* ADDRESS OF A WORD POINTING TO     04900000
*                                     A SWB CHAIN OR ZERO            */ 04950000
*      2 SJREAREA   PTR(31),       /* STORAGE AREA ADDRESS           */ 05000000
*      2 SJRESIZE  FIXED(15),      /* SIZE OF STORAGE AREA           */ 05050000
*      2 SJRENKWD  FIXED(15),      /* NUMBER OF KEYWORDS PASSED      */ 05100000
*      2 SJREKWDL   PTR(31),       /* KEYWORD LIST ADDRESS           */ 05150000
*      2 SJREKERR   PTR(31);       /* ADDRESS OF KEYWORD CAUSING        05200000
*                                      ERROR                         */ 05250000
* DCL SJRECID CHAR(4) CONSTANT('SJRE'); /* IDENTIFIER                */ 05300000
* DCL SJRECVER FIXED(8) CONSTANT(1); /* CURRENT VERSION NUMBER       */ 05350000
* DCL 1 SJRELIST (*) BASED(SJREKWDL), /* KEYWORD LIST                */ 05400000
*      2 SJREKEYW   CHAR(8),       /* KEYWORD FOR RETRIEVE           */ 05450000
*      2 SJRETPAD   PTR(31);       /* ADDRESS OF A LIST OF TEXT UNIT    05500000
*                                      POINTERS                      */ 05550000
