*        %GOTO SJPXPRO;            /*                                   00050000
         MACRO                                                          00100000
         IEFSJPFX  &DSECT=YES                                           00150000
.*/ %SJPXPRO: ;                                                         00200000
*/**** START OF SPECIFICATIONS ***************************************/ 00250000
*/*                                                                  */ 00300000
*/*    MACRO NAME = IEFSJPFX                                         */ 00350000
*/*                                                                  */ 00400000
*/*     ACRONYM = SJPFX                                              */ 00425000
*/*                                                                  */ 00450000
*/*    DESCRIPTIVE NAME = NJE Prefix Mapping                         */ 00475000
*/*                                                                  */ 00500000
*/*    PROPRIETARY STATEMENT =                                       */ 00533300
*/*     LICENSED MATERIALS - PROPERTY OF IBM                         */ 00566600
*/*     THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                  */ 00599900
*/*     5695-047 (C) COPYRIGHT IBM CORP. 1982, 1990                  */ 00633200
*/*     SEE COPYRIGHT INSTRUCTIONS                                   */ 00666500
*/*                                                                  */ 00700000
*/*    STATUS = HBB4420                                              */ 00750000
*/*                                                                  */ 00800000
*/*    FUNCTION = This mapping is used as the prefix section of a    */ 00809300
*/*               SWBTU (SWB in text unit format).  A SWBTU is the   */ 00818600
*/*               transportable format of SWB (JCL) data owned by    */ 00827900
*/*               SJF.  The mapping is also defined as the NJE       */ 00837200
*/*               Data Set Header OPTB prefix.                       */ 00846500
*/*                                                                  */ 00856200
*/*    NOTES =                                                       */ 00874800
*/*                                                                  */ 00893400
*/*        Bilingual Mapping Macro (PL/S  and BAL)                   */ 00896700
*/*                                                                  */ 00900000
*/*        CDPI notes:                                               */ 00937500
*/*        This mapping is a Product-Sensitive Programming Interface.*/ 00975000
*/*        The following fields are not part of the programming      */ 01012500
*/*        interface:                                                */ 01050000
*/*          - SJPRFLG1 and bit indicators                           */ 01087500
*/*          - SJPRPARM                                              */ 01125000
*/*          - SJPRRSV1                                              */ 01162500
*/*                                                                  */ 01200000
*/*      DEPENDENCIES =                                              */ 01211700
*/*                                                                  */ 01223400
*/*        PL/S Version = None                                       */ 01235100
*/*                                                                  */ 01246800
*/*        BAL Version = Define a constant equal to 'SJPF' to        */ 01258500
*/*                      store in field SJPRID.                      */ 01270200
*/*                                                                  */ 01281900
*/*      RESTRICTIONS = None                                         */ 01293600
*/*                                                                  */ 01305300
*/********************************************************************/ 01317000
*/*                                                                  */ 01328700
*/*    METHOD OF ACCESS =                                            */ 01340400
*/*                                                                  */ 01352100
*/*      PL/S Invocation =                                           */ 01363800
*/*                                                                  */ 01375500
*/*  %INCLUDE SYSLIB(IEFSJPFX)                                       */ 01387200
*/*                                                                  */ 01400000
*/*    PARAMETER DESCRIPTION =                                       */ 01401300
*/*                                                                  */ 01402600
*/*      PARAMETER = %SJPFATRB                                       */ 01403900
*/*                                                                  */ 01405200
*/*        DESCRIPTION = %SJPFATRB is a global PL/S parameter that   */ 01406500
*/*                      indicates the type of definition requested  */ 01407800
*/*                      for label SJPRFX.                           */ 01409100
*/*                                                                  */ 01410400
*/*        TYPE = Global label                                       */ 01411700
*/*                                                                  */ 01413000
*/*        FORM = defined prior to IEFSJPFX invocation               */ 01414300
*/*           %DCL SJPFATRB CHAR                                     */ 01415600
*/*           %SJPFATRB = 'BASED' OR 'BDY(WORD)' OR ''               */ 01416900
*/*                                                                  */ 01418200
*/*        DEFAULT = '' or null                                      */ 01419500
*/*                                                                  */ 01420800
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 01422100
*/*                                                                  */ 01423400
*/*------------------------------------------------------------------*/ 01424700
*/*                                                                  */ 01426000
*/*      BAL Invocation =                                            */ 01427300
*/*                                                                  */ 01428600
*/*      name            name: symbol. Begin name in column 1.       */ 01429900
*/*  b                   one or more blanks (up to nine)             */ 01431200
*/*  IEFSJPFX            should start in column 10                   */ 01432500
*/*  b                   one or more blanks                          */ 01433800
*/*                                                                  */ 01435100
*/*   DSECT=YES or NO                                                */ 01436400
*/*                                                                  */ 01437700
*/*    PARAMETER DESCRIPTION =                                       */ 01439000
*/*                                                                  */ 01440300
*/*      PARAMETER = DSECT                                           */ 01441600
*/*                                                                  */ 01442900
*/*        DESCRIPTION = Indicates whether the mapping should be     */ 01444200
*/*                      a DSECT (YES) or defined storage (NO).      */ 01445500
*/*                                                                  */ 01446800
*/*        TYPE = Keyword                                            */ 01448100
*/*                                                                  */ 01449400
*/*        FORM = YES or NO                                          */ 01450700
*/*                                                                  */ 01452000
*/*        DEFAULT = YES                                             */ 01453300
*/*                                                                  */ 01454600
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 01455900
*/*                                                                  */ 01457200
*/********************************************************************/ 01458500
*/*                                                                  */ 01459800
*/*    DSECT NAME = SJPRFX                                           */ 01461100
*/*                                                                  */ 01462400
*/*    COMPONENT = (BB131) SJF                                       */ 01463700
*/*                                                                  */ 01465000
*/*    EYE-CATCHER = SJPF                                            */ 01466300
*/*     OFFSET = +0                                                  */ 01467600
*/*     LENGTH = 4 characters (bytes)                                */ 01468900
*/*                                                                  */ 01470200
*/*    CREATED BY = N/A                                              */ 01471500
*/*                                                                  */ 01472800
*/*    POINTED TO BY = N/A                                           */ 01474100
*/*                                                                  */ 01475400
*/*    DELETED BY = N/A                                              */ 01476700
*/*                                                                  */ 01478000
*/*    SERIALIZATION = None                                          */ 01479300
*/*                                                                  */ 01480600
*/*    STORAGE ATTRIBUTES =                                          */ 01481900
*/*                                                                  */ 01483200
*/*      ALLOCATION METHOD = N/A                                     */ 01484500
*/*      SUBPOOL           = N/A                                     */ 01485800
*/*      KEY               = N/A                                     */ 01487100
*/*      RESIDENCY         = Any                                     */ 01488400
*/*      SIZE              = 28 ('1C'x)                              */ 01489700
*/*      FREQUENCY         = N/A                                     */ 01491000
*/*                                                                  */ 01492300
*/*    DISTRIBUTION LIBRARY = AMACLIB                                */ 01493600
*/*                                                                  */ 01500000
*/* CHANGE ACTIVITY = H0,L1,P1                                   @P1C*/ 01550000
*/*                                                                  */ 01600000
*/*    $MAC(IEFSJPFX),COMP(BB131)                                    */ 01608300
*/*                                                                  */ 01616600
*/* $H0= EXTJCL   JBB2110 821015 PDC6: SUPPORT OF EXTENDED JCL       */ 01625000
*/* $L1= SRVC2    HBB4410 891016 PDN4: SERVICEABILITY            @L1A*/ 01650000
*/* $P1= PH31267  HBB4420 900817 PDDZ: BASE CODE CLEANUP         @P1A*/ 01675000
*/*                                                                  */ 01700000
*/**** END OF SPECIFICATIONS *****************************************/ 01750000
*/* A 000000-999999                                              @H0A*/ 01800000
*/* A SJPRDYNM WITHIN SJPRFLG1 TO INDICATE DYNAMICALLY CREATED   @L1A*/ 01816600
*/*   SWB CHAIN                                                  @L1A*/ 01833200
*/* C Corrected SJPRCVER to be at level 2 and improved prolog.   @P1A*/ 01841600
*        %GOTO SJPXPLS;  /*                                             01850000
         AIF ('&DSECT' EQ 'NO').NODSECT                                 01900000
SJPRFX   DSECT                                                          01950000
         AGO  .SJPDSCT                                                  02000000
.NODSECT ANOP                                                           02050000
SJPRFX   DS    0F                    NJE PREFIX                         02100000
.SJPDSCT ANOP                                                           02150000
SJPRID   DS    CL4                   IDENTIFIER 'SJPF'                  02200000
SJPRVERS DS    XL1                   VERSION NUMBER                     02250000
SJPRPLEN DS    XL1                   LENGTH OF PREFIX                   02300000
SJPRDLEN DS    XL2                   LENGTH OF DATA                     02350000
SJPRVERB DS    CL8                   VERB OF SWB CHAIN                  02400000
SJPRVRBL DS    CL8                   LABEL OF SWB CHAIN                 02450000
SJPRFLG1 DS    XL1                   FLAGS                              02500000
SJPRCONT EQU   X'80'                 CONTINUATION TEXT UNIT FLAG        02550000
SJPRDYNM EQU   X'40'                 DYNAMICALLY CREATED SWB CHAIN @L1A 02575000
SJPRPARM DS    XL1                   NUMBER OF PARAMETERS ALREADY       02600000
*                                    PROCESSED IN THE FIRST             02650000
*                                    TEXT UNIT                          02700000
SJPRRSV1 DS    XL2                   RESERVED                           02750000
SJPRLGTH EQU   *-SJPRFX              LENGTH OF NJE MAPPING              02800000
*/********************************************************************/ 02850000
*/                                                                   */ 02900000
*/ ADDITIONAL DATA NEEDED FOR THE NJE PREFIX MAPPING                 */ 02950000
*/                                                                   */ 03000000
*/********************************************************************/ 03050000
SJPRCVER EQU   2                                                        03100000
         MEND                                                           03150000
.*/ %SJPXPLS: ;                                                         03200000
*DECLARE 1 SJPRFX SJPFATRB,        /* NJE PREFIX                     */ 03250000
*          2 SJPRID   CHAR(4),     /* IDENTIFIER 'SJPF'              */ 03300000
*          2 SJPRVERS FIXED(8),    /* VERSION NUMBER                 */ 03350000
*          2 SJPRPLEN FIXED(8),    /* LENGTH OF PREFIX               */ 03400000
*          2 SJPRDLEN FIXED(15),   /* LENGTH OF DATA                 */ 03450000
*          2 SJPRVERB CHAR(8),     /* VERB FOR SWB CHAIN             */ 03500000
*          2 SJPRVRBL CHAR(8),     /* LABEL FOR SWB CHAIN            */ 03550000
*          2 SJPRFLG1 BIT(8),      /* FLAGS                          */ 03600000
*            3 SJPRCONT BIT(1),    /* CONTINUATION TEXT UNIT            03650000
*                                     FLAG                           */ 03700000
*            3 SJPRDYNM BIT(1),    /* DYNAMICALLY CREATED SWB           03716600
*                                     CHAIN                      @L1A*/ 03733200
*          2 SJPRPARM FIXED(8),    /* NUMBER OF PARAMETERS ALREADY      03750000
*                                     PROCESSED IN THE FIRST            03800000
*                                     TEXT UNIT                      */ 03850000
*          2 SJPRRSV1 FIXED(16);   /* RESERVED                       */ 03900000
*/********************************************************************/ 03950000
*/*                                                                  */ 04000000
*/*  ADDITIONAL DATA NEEDED FOR NJE PREFIX MAPPING                   */ 04050000
*/*                                                                  */ 04100000
*/********************************************************************/ 04150000
*DECLARE SJPRCID  CHAR(4) CONSTANT('SJPF'), /* IDENTIFIER            */ 04200000
*        SJPRCVER FIXED(8) CONSTANT(2);     /* CURRENT VERSION          04250000
*                                              NUMBER            @P1C*/ 04300000
*/***********************END OF IEFSJPFX******************************/ 04350000
