*        %GOTO SJTSPRO;           /*                                    00050000
         MACRO                                                          00100000
         IEFSJTSP &DSECT=YES                                            00150000
.*/      %SJTSPRO: ;                                                    00200000
*/**** START OF SPECIFICATIONS ***************************************/ 00250000
*/*                                                                  */ 00300000
*/*    MACRO NAME = IEFSJTSP                                         */ 00350000
*/*                                                                  */ 00400000
*/*    DESCRIPTIVE NAME = Scheduler JCL Facility SWBTUREQ SPLICE and */ 00450000
*/*                       SPLIT Parameter List                       */ 00500000
*/*                                                                  */ 00550000
*/*    COPYRIGHT =                                                   */ 00600000
*/*             5695-047                                             */ 00650000
*/*             THIS MACRO IS "RESTRICTED MATERIALS OF IBM"          */ 00700000
*/*             (C) COPYRIGHT IBM CORPORATION 1990                   */ 00750000
*/*             LICENSED MATERIALS - PROPERTY OF IBM                 */ 00800000
*/*                                                                  */ 00850000
*/*    STATUS = HBB4410                                              */ 00900000
*/*                                                                  */ 00950000
*/*    FUNCTION = Maps the input/output parameter list to the        */ 01000000
*/*               SJF Text Unit Splice and Split services            */ 01050000
*/*               (SWBTUREQ REQUEST=SPLICE)                          */ 01100000
*/*               (SWBTUREQ REQUEST=SPLIT)                           */ 01150000
*/*                                                                  */ 01200000
*/*    NOTES =                                                       */ 01250000
*/*                                                                  */ 01300000
*/*      Bilingual mapping macro (PL/AS and BAL)                     */ 01350000
*/*                                                                  */ 01400000
*/*      All fields may be considered input fields unless they are   */ 01450000
*/*      specified as output fields.                                 */ 01500000
*/*                                                                  */ 01550000
*/*      A caller of the SWBTUREQ REQUEST=SPLICE or SPLIT services   */ 01550900
*/*      may wish to determine the working storage size or the size  */ 01551800
*/*      of the output area required for a particular request.  Use  */ 01552700
*/*      the following guide to obtain the desired results.          */ 01553600
*/*                                                                  */ 01554500
*/*      To obtain the working (local) storage size (SJTSWKSZ):      */ 01555400
*/*      - Build the SJTSP parameter list with at least the following*/ 01556300
*/*        fields filled in:                                         */ 01557200
*/*         SJTSID, SJTSVERS, SJTSLEN.                               */ 01558100
*/*      - Issue the SWBTUREQ REQUEST=SPLICE|SPLIT macro invocation. */ 01559000
*/*      - If SJTSSTSZ is less than the required working storage for */ 01559900
*/*        the service, then the caller will receive:                */ 01560800
*/*        Register 15 = 4 (SJTRCSIZ)                                */ 01561700
*/*        SJTSREAS    = 4 (SJTRWSZR)                                */ 01562600
*/*        SJTSWKSZ    = amount of working storage required for the  */ 01563500
*/*                      SWBTUREQ REQUEST=SPLICE|SPLIT service,      */ 01564400
*/*                      respectively.                               */ 01565300
*/*                                                                  */ 01566200
*/*      To obtain output area size for SPLICE (SJTSTULN):           */ 01567100
*/*      - Build the SJTSP parameter list with at least the following*/ 01568000
*/*        fields filled in:                                         */ 01568900
*/*         SJTSID, SJTSVERS, SJTSLEN,                               */ 01569800
*/*         SJTSSTOR, SJTSSTSZ (at least as large as what would be   */ 01570700
*/*          returned in SJTSWKSZ above),                            */ 01571600
*/*         SJTSSWBN, SJTSSWBA, SJTSSBTL fields                      */ 01572500
*/*      - Issue the SWBTUREQ REQUEST=SPLICE macro invocation        */ 01573400
*/*      - If SJTSSIZE is less than the required output storage for  */ 01574300
*/*        the specified SWBTUs, then the caller will receive:       */ 01575200
*/*        Register 15 = 4 (SJTRCSIZ)                                */ 01576100
*/*        SJTSREAS    = 8 (SJTRDSZR)                                */ 01577000
*/*        SJTSTULN    = amount of output area storage required to   */ 01577900
*/*                      obtain all of the requested text units.     */ 01578800
*/*                                                                  */ 01579700
*/*      To obtain the output area size (SJTSTULN) required to obtain*/ 01580300
*/*      the remaining portion of the input SWBTU for SPLIT:         */ 01580900
*/*      - Build the SJTSP parameter list with at least the following*/ 01581500
*/*        fields filled in:                                         */ 01582400
*/*         SJTSID, SJTSVERS, SJTSLEN,                               */ 01583300
*/*         SJTSSTOR, SJTSSTSZ (at least as large as what would be   */ 01584200
*/*          returned in SJTSWKSZ above),                            */ 01585100
*/*         SJTSAREA                                                 */ 01586000
*/*      - Issue the SWBTUREQ REQUEST=SPLIT macro invocation         */ 01587000
*/*      - If the combined total lengths as specified in the areas   */ 01588000
*/*        for the output SWBTUs is not large enough to accommodate  */ 01589000
*/*        the entire single SWBTU, then the caller will receive:    */ 01590000
*/*        Register 15 = 4 (SJTRCSIZ)                                */ 01591400
*/*        SJTSREAS    = 8 (SJTRDSZR)                                */ 01592300
*/*        SJTSTULN    = amount of output area storage required to   */ 01593200
*/*                      obtain the remainder of the single SWBTU.   */ 01594100
*/*                      This value is determined by adding the      */ 01594200
*/*                      size of the remaining text units to be      */ 01594300
*/*                      split and the size of the SJPRFX (prefix)   */ 01594400
*/*                      area.                                       */ 01594500
*/*                                                                  */ 01595000
*/*      The reason codes in field SJTSREAS are defined in IEFSJTRC. */ 01600000
*/*                                                                  */ 01650000
*/*      For the BAL version, since the extension is defined as a    */ 01660000
*/*      DSECT regardless of the SJTSP form, use caution when        */ 01670000
*/*      DESCT=NO is specified.                                      */ 01680000
*/*                                                                  */ 01690000
*/*      The following diagram illustrates the relationship of the   */ 01693100
*/*      separately mapped areas (no scale is intended for the size  */ 01696200
*/*      of the fields):                                             */ 01699300
*/*                                                                  */ 01702400
*/*       SJTSP:                                                     */ 01705500
*/*      |----------------------|                                    */ 01708600
*/*      | ...                  |                                    */ 01711700
*/*      |----------------------|                                    */ 01714800
*/*      | SJTSSTOR             |----> local storage area            */ 01717900
*/*      |----------------------|     |---------------------|        */ 01721000
*/*      | SJTSSTSZ             |     | area provided for   |        */ 01724100
*/*      |----------------------|     | use by the SWBTUREQ |        */ 01727200
*/*      | ...                  |     | services as working |        */ 01730300
*/*      |----------------------|     | storage.  SJTSSTSZ  |        */ 01733400
*/*      | SJTSSWBN             |     | specifies the size  |        */ 01736500
*/*      |----------------------|     | of this area        |        */ 01739600
*/*   |--| SJTSSWBA             |     |---------------------|        */ 01742700
*/*   |  |----------------------|                                    */ 01745800
*/*   |  | ...                  |                                    */ 01748900
*/*   |  |----------------------|                                    */ 01752000
*/*   |  | SJTSAREA             |----> Split:  input SWBTU           */ 01755100
*/*   |  |----------------------|      Splice:  output SWBTU         */ 01758200
*/*   |  | SJTSSIZE, Splice only|     |---------------------|        */ 01761300
*/*   |  |----------------------|     | SJPRFX area, mapped |        */ 01764400
*/*   |  | ...                  |     | by IEFSJPFX         |        */ 01767500
*/*   |  |                      |     |---------------------|        */ 01770600
*/*   |  |----------------------|     | area for text units,|        */ 01773700
*/*   |                               | refer to IEFDOTUM   |        */ 01776800
*/*   |                               | for a mapping of    |        */ 01779900
*/*   |                               | each text unit      |        */ 01783000
*/*   |                               |---------------------|        */ 01786100
*/*   |                                                              */ 01789200
*/*   |-> SJTSSBTL:                                                  */ 01792300
*/*  +0  |----------------------|                                    */ 01795400
*/*      | SJTSSTUP (1)         |----> Split:  output SWBTUs         */ 01798500
*/*  +4  |----------------------|      Splice:  input SWBTUs         */ 01801600
*/*      |                      |     |---------------------|        */ 01804700
*/*  +8  |----------------------|     | SJPRFX area, mapped |        */ 01807800
*/*      | SJTSSTUP (2)         |     | by IEFSJPFX         |        */ 01810900
*/*  +12 |----------------------|     |---------------------|        */ 01814000
*/*      |                      |     | area for text units,|        */ 01817100
*/*  +16 |----------------------|     | refer to IEFDOTUM   |        */ 01820200
*/*      | .                    |     | for mapping of each |        */ 01823300
*/*      | . etc.               |     | text unit           |        */ 01826400
*/*      | .                    |     |---------------------|        */ 01829500
*/* +8*  |----------------------|                                    */ 01832600
*/* (n-1)| SJTSSTUP (n), where  |                                    */ 01835700
*/*      | n = SJTSSWBN         |                                    */ 01838800
*/* +8*  |----------------------|                                    */ 01839800
*/* (n-1)|                      |                                    */ 01840800
*/*  +4  |----------------------|                                    */ 01841900
*/*                                                                  */ 01845000
*/*      DEPENDENCIES =                                              */ 01850000
*/*                                                                  */ 01900000
*/*        The first 36 bytes are also mapped by IEFSJTCP.           */ 01950000
*/*                                                                  */ 02000000
*/*        See invocation of PL/AS version for the required macro    */ 02050000
*/*        global variable.                                          */ 02100000
*/*                                                                  */ 02150000
*/*        Area mapped by SJTSSBTL must be on a fullword boundary.   */ 02200000
*/*        This area must also be defined in the same manner as      */ 02216600
*/*        SJTRSBTL in IEFSJTRP for use in IEFSJTCL.                 */ 02233200
*/*                                                                  */ 02250000
*/*        In both the SPLICE and the SPLIT services, the complete   */ 02300000
*/*        set of SWBTUs to be spliced or split may be provided as   */ 02350000
*/*        input or additional SWBTUs may be requested to be         */ 02400000
*/*        spliced or split on subsequent calls to the respective    */ 02450000
*/*        services.  For subsequent calls, the same working storage */ 02500000
*/*        or an exact copy from the previous request is required.   */ 02550000
*/*        Also, the services require the single SWBTU area, input   */ 02600000
*/*        for split and output for splice, to be at the same        */ 02650000
*/*        storage location or an exact copy from the previous       */ 02700000
*/*        request.                                                  */ 02750000
*/*                                                                  */ 02800000
*/*         RESTRICTIONS = None                                      */ 02850000
*/*                                                                  */ 02900000
*/********************************************************************/ 02950000
*/*                                                                  */ 03000000
*/*    METHOD OF INVOCATION =                                        */ 03050000
*/*                                                                  */ 03100000
*/*      PL/AS VERSION =                                             */ 03150000
*/*                                                                  */ 03200000
*/*  %DCL SJTSATRB CHAR                                              */ 03250000
*/*  %SJTSATRB = 'BASED' OR 'BDY(WORD)' OR ''                        */ 03300000
*/*  %INCLUDE SYSLIB(IEFSJTSP)                                       */ 03350000
*/*                                                                  */ 03400000
*/*    PARAMETER DESCRIPTION =                                       */ 03450000
*/*                                                                  */ 03500000
*/*      PARAMETER = SJTSATRB                                        */ 03550000
*/*                                                                  */ 03600000
*/*        DESCRIPTION = Global variable that determines SJTSP's     */ 03650000
*/*                      attributes                                  */ 03700000
*/*                                                                  */ 03750000
*/*        TYPE = Specified as global parameter                      */ 03800000
*/*                                                                  */ 03850000
*/*        FORM = Character value                                    */ 03900000
*/*                                                                  */ 03950000
*/*        DEFAULT = Null or ''                                      */ 04000000
*/*                                                                  */ 04050000
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 04100000
*/*                                                                  */ 04150000
*/*------------------------------------------------------------------*/ 04200000
*/*                                                                  */ 04250000
*/*      BAL VERSION =                                               */ 04300000
*/*                                                                  */ 04350000
*/*  B                   One or more blanks (up to nine)             */ 04400000
*/*  IEFSJTSP            Should start in column 10                   */ 04450000
*/*  B                   One or more blanks                          */ 04500000
*/*                                                                  */ 04550000
*/*   DSECT=YES|NO                                                   */ 04600000
*/*                                                                  */ 04650000
*/*    PARAMETER DESCRIPTION =                                       */ 04700000
*/*                                                                  */ 04750000
*/*      PARAMETER = DSECT                                           */ 04800000
*/*                                                                  */ 04850000
*/*        DESCRIPTION =                                             */ 04900000
*/*            DSECT=YES  - Provides DSECT (mapping) for SJTSP       */ 04950000
*/*            DSECT=NO   - Provides CSECT (Define storage on a      */ 05000000
*/*                         full word boundary) for SJTSP            */ 05050000
*/*                                                                  */ 05100000
*/*        TYPE = Keyword                                            */ 05150000
*/*                                                                  */ 05200000
*/*        FORM = Constant                                           */ 05250000
*/*                                                                  */ 05300000
*/*        DEFAULT = YES                                             */ 05350000
*/*                                                                  */ 05400000
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 05450000
*/*                                                                  */ 05500000
*/********************************************************************/ 05550000
*/*                                                                  */ 05600000
*/*    CREATED BY = Invoker of SWBTUREQ REQUEST=SPLICE/SPLIT service */ 05650000
*/*                                                                  */ 05700000
*/*    POINTED TO BY = A pointer field which is pointed to by        */ 05750000
*/*                    register 1 for entry into SWBTUREQ service.   */ 05800000
*/*                                                                  */ 05850000
*/*    DELETED BY = N/A                                              */ 05900000
*/*                                                                  */ 05950000
*/*    SERIALIZATION = None                                          */ 06000000
*/*                                                                  */ 06050000
*/*    STORAGE ATTRIBUTES = Determined by issuer of SWBTUREQ         */ 06100000
*/*                         REQUEST=SPLICE/SPLIT service             */ 06150000
*/*                                                                  */ 06200000
*/*    COMPONENT =  BB131 (SJF)                                      */ 06250000
*/*                                                                  */ 06300000
*/*    DISTRIBUTION LIBRARY = AMACLIB                                */ 06350000
*/*                                                                  */ 06400000
*/*    CHANGE ACTIVITY = L0                                          */ 06450000
*/*                                                                  */ 06500000
*/*    $L0= EMVS2     HBB4410  890206  PDZ1:  SWBTUREQ SPLICE/SPLIT  */ 06550000
*/*                                                                  */ 06600000
*/**** END OF SPECIFICATIONS *****************************************/ 06650000
*/*                                                                  */ 06700000
*/* A - Newly created for Enterprise II support.                     */ 06750000
*/*                                                                  */ 06800000
*/********************************************************************/ 06850000
*/*                                                                  */ 06900000
*        %GOTO SJTSPLS;           /*                                 *  06950000
         AIF   ('&DSECT' EQ 'NO').SJTS01                                07000000
SJTSP    DSECT                                                          07050000
         AGO   .SJTS02                                                  07100000
.SJTS01  ANOP                                                           07150000
SJTSP    DS    0F                  SWBTUREQ SPLICE/SPLIT Parameter List 07200000
.SJTS02  ANOP                                                           07250000
SJTSID   DS    CL4                 Identifier 'SJTS'                    07300000
SJTSVERS DS    XL1                 Version number                       07350000
SJTSFLAG DS    XL1                 Reserved                             07400000
SJTSLEN  DS    H                   Length of SJTSP parameter list       07450000
SJTSSTOR DS    A                   Local storage pointer                07500000
SJTSSTSZ DS    H                   Local storage size                   07550000
SJTSSWBN DS    H                   Number of SWBTU pointers in SWBTU    07575000
*                                  address list - area mapped by        07600000
*                                  SJTSSBTL                             07625000
SJTSSWBA DS    A                   Address of SWBTU address list -      07650000
*                                  area mapped by SJTSSBTL              07675000
*                                                                    *  07700000
*        The following fields are returned as output                 *  07750000
*                                                                    *  07800000
SJTSREAS DS    F                   Reason code                          07850000
SJTSWKSZ DS    H                   Working storage size required        07900000
SJTSTULN DS    H                   Splice request - area size required  07950000
*                                   to splice multiple SWBTUs provided  08000000
*                                   or actual size when complete.       08050000
*                                  Split request - area size required   08100000
*                                   to split remainder of single        08150000
*                                   SWBTU.                              08200000
SJTSERRP DS    A                   Address of SWBTU list address entry  08233300
*                                   where an error was encountered      08266600
SJTSRSVO DS    F                   Reserved                             08300000
*        End of commonly mapped area.                                *  08350000
         SPACE 1                                                        08400000
*                                                                    *  08450000
*        The following fields are provided on input                  *  08500000
*                                                                    *  08550000
SJTSAREA DS    A                   Address of single SWBTU area.        08600000
*                                  Splice request - resulting SWBTU     08650000
*                                   will be placed in this area.        08700000
*                                  Split request - single SWBTU to      08750000
*                                   be split up.                        08800000
SJTSSIZE DS    H                   Size of single SWBTU area, required  08850000
*                                   only on SPLICE request              08900000
SJTSFLG1 DS    XL1                 Service request flag                 08950000
SJTSUBSQ EQU   X'80'               Subsequent request                   09000000
SJTSRSVI DS    CL5                 Reserved                             09150000
         SPACE 1                                                        09200000
SJTSLGTH EQU   *-SJTSP             Length of the SWBTUREQ SPLICE        09250000
*                                  or SPLIT Parameter list              09300000
         SPACE 1                                                        09350000
SJTSCID  EQU   C'SJTS'             Parameter list identifier            09400000
SJTSCVER EQU   1                   Current version number               09450000
         SPACE 2                                                        09500000
**********************************************************************  09550000
*                                                                    *  09600000
*        This section maps each entry in the SWBTU  Address/Length   *  09650000
*        list.                                                       *  09700000
*                                                                    *  09750000
*        For SPLICE:  the list is used to specify the input SWBTUs   *  09757100
*        that are to be spliced into a single SWBTU.                 *  09764200
*                                                                    *  09771300
*        For SPLIT:  the list is used to specify the output areas    *  09778400
*        that the single input SWBTU will be split into.             *  09785500
*                                                                    *  09792600
*        SJTSSWBA points to the start of this list.                  *  09800000
*        SJTSSWBN specifies the number of entries in this list.      *  09850000
*                                                                    *  09900000
**********************************************************************  09950000
         SPACE 1                                                        10000000
SJTSSBTL DSECT                     SWBTU Address / Length list          10050000
         DS    0F                                                       10100000
SJTSSTUP DS    A                   SWBTU address                        10150000
*        The following two fields are only used by the SPLIT service *  10200000
SJTSSBLN DS    H                   Length of this output SWBTU area     10250000
SJTSSBRL DS    H                   Length of SWBTU area returned by     10300000
*                                   the service                         10350000
SJTSSLEN EQU   *-SJTSSBTL          Length of one SWBTU address entry    10400000
.*                                                                      10450000
         MEND  ,                                                        10500000
.*/      %SJTSPLS: ;                                                    10550000
* DECLARE                                                               10583300
*    1 SJTSP SJTSATRB,             /* SWBTUREQ SPLICE/SPLIT parameter   10616600
*                                     list                           */ 10650000
*      3 SJTSID     CHAR(4),       /* Identifier 'SJTS'              */ 10700000
*      3 SJTSVERS   FIXED(8),      /* Version number                 */ 10750000
*      3 SJTSFLAG   BIT(8),        /* Reserved                       */ 10800000
*      3 SJTSLEN    FIXED(15),     /* Length of SJTSP parameter list */ 10850000
*      3 SJTSSTOR   PTR(31),       /* Local storage pointer          */ 10900000
*      3 SJTSSTSZ   FIXED(15),     /* Local storage size             */ 10950000
*      3 SJTSSWBN   FIXED(15),     /* Number of SWBTU pointers in SWBTU 10975000
*                                     address list - area mapped by     11000000
*                                     SJTSSBTL                       */ 11025000
*      3 SJTSSWBA   PTR(31),       /* Address of SWBTU address list -   11050000
*                                     area mapped by SJTSSBTL        */ 11075000
*                                                                       11100000
*/*      The following fields are returned as output                 */ 11150000
*      3 SJTSREAS   FIXED(31),     /* Reason code                    */ 11200000
*      3 SJTSWKSZ   FIXED(15),     /* Working storage size required  */ 11250000
*      3 SJTSTULN   FIXED(15),     /* SPLICE request - area size        11277200
*                                     required to splice all SWBTUs     11304400
*                                     provided or actual size when      11331600
*                                     splicing is completed.            11358800
*                                     For SPLIT:  specifies a single    11386000
*                                     block size that would be required 11413200
*                                     to split the remainder of the     11440400
*                                     single input SWBTU.            */ 11467600
*      3 SJTSERRP   PTR(31),       /* Address of SWBTU address list     11488200
*                                     entry where an error was          11508800
*                                     encountered                    */ 11529400
*      3 SJTSRSVO   FIXED(31),     /* Reserved                       */ 11550000
*/*      End of commonly mapped area.                                */ 11600000
*/*                                                                  */ 11650000
*/*      The following fields are provided on input                  */ 11700000
*      3 SJTSAREA   PTR(31),       /* Address of single SWBTU area.     11750000
*                                     Splice request - resulting SWBTU  11800000
*                                      will be placed in this area.     11850000
*                                     Split request - single SWBTU to   11900000
*                                      be split up.                  */ 11950000
*      3 SJTSSIZE   FIXED(15),     /* Size of single SWBTU area,        12000000
*                                     required only on SPLICE request*/ 12050000
*      3 SJTSFLG1   BIT(8),        /* Service request flag           */ 12100000
*        5 SJTSUBSQ   BIT(1),      /* Subsequent request             */ 12300000
*        5 *          BIT(7),      /* Reserved                       */ 12325000
*      3 SJTSRSVI   CHAR(5);       /* Reserved                       */ 12350000
*     @SPACE(1);                                                        12400000
* DCL SJTSCID  CHAR(4) CONSTANT('SJTS'); /* Parameter list identifier*/ 12450000
* DCL SJTSCVER FIXED(8) CONSTANT(1);     /* Current version number   */ 12500000
*     @SPACE(2);                                                        12550000
*/********************************************************************/ 12600000
*/*                                                                  */ 12650000
*/*      This section maps each entry in the SWBTU  Address/Length   */ 12700000
*/*      list.                                                       */ 12750000
*/*                                                                  */ 12800000
*/*      For SPLICE:  the list is used to specify the input SWBTUs   */ 12806200
*/*      that are to be spliced into a single SWBTU.                 */ 12812400
*/*                                                                  */ 12818600
*/*      For SPLIT:  the list is used to specify the output areas    */ 12824800
*/*      that the single input SWBTU will be split into.             */ 12831000
*/*                                                                  */ 12837200
*/*                                                                  */ 12843400
*/*      SJTSSWBA points to the start of this list.                  */ 12850000
*/*      SJTSSWBN specifies the number of entries in this list.      */ 12900000
*/*                                                                  */ 12950000
*/********************************************************************/ 13000000
* DCL 1 SJTSSBTL (*) BASED,             /* SWBTU Address / Length list  13050000
*                                                                    */ 13100000
*      3 SJTSSTUP   PTR(31) BDY(WORD),  /* SWBTU address             */ 13150000
*/*      The following two fields are only used by the SPLIT service */ 13200000
*      3 SJTSSBLN   FIXED(15),          /* Length of this output        13233300
*                                          SWBTU area                */ 13266600
*      3 SJTSSBRL   FIXED(15);          /* Length of SWBTU area         13300000
*                                          returned by the service.  */ 13350000
