*      %GOTO SJKYPRO;        /*                                         00050000
       MACRO                                                            00100000
       IEFSJKEY                                                         00150000
.*/ %SJKYPRO: ;                                                         00200000
*/***START OF SPECIFICATIONS*************************************@P6C*/ 00250000
*/*                                                                  */ 00300000
*/*    MACRO NAME = IEFSJKEY                                         */ 00350000
*/*                                                                  */ 00400000
*/*    DESCRIPTIVE NAME = Scheduler JCL Facility (SJF) Key           */ 00450000
*/*                       Constants                                  */ 00500000
*/*                                                                  */ 00550000
*/*01* PROPRIETARY STATEMENT=                                        */ 00600000
*/***PROPRIETARY_STATEMENT********************************************/ 00650000
*/*                                                                  */ 00900000
*/*                                                                  */ 01000000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01022700
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01045400
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1987, 2000                  @P8C*/ 01079400
*/*                                                                  */ 01113500
*/* STATUS= HBB7703                                                  */ 01136200
*/*                                                                  */ 01158900
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01181600
*/*                                                              @L6C*/ 01204300
*/*    FUNCTION = Provides keys for SJF defined JCL keywords     @P6C*/ 01227000
*/*                                                                  */ 01250000
*/*    MODULE TYPE = MACRO                                           */ 01300000
*/*                                                                  */ 01301400
*/*    DSECT NAME = n/a                                          @P6A*/ 01302800
*/*                                                                  */ 01304200
*/*    ACRONYM = n/a                                             @P6A*/ 01305600
*/*      OFFSET = n/a                                            @P6A*/ 01307000
*/*      LENGTH = n/a                                            @P6A*/ 01308400
*/*                                                                  */ 01309800
*/*    COMPONENT = Scheduler JCL Facility (BB131)                @P6A*/ 01311200
*/*                                                                  */ 01312600
*/*01* EXTERNAL CLASSIFICATION:                                  @P6A*/ 01314000
*/*02* DMTI: BASE                                                @P6A*/ 01315400
*/*02* PSPI: FIELDS                                              @P6A*/ 01316800
*/*          SJKYJBYT   SJKYJCRD   SJKYJPAG    SJKYJLIN          @P6A*/ 01318200
*/*          SJKYACDE   SJKYOUTP   SJKYCNTL    SJKYSTCL          @P6A*/ 01319600
*/*          SJKYMGCL   SJKYDACL   SJKYRECO    SJKYKEYO          @P6A*/ 01321000
*/*          SJKYREFD   SJKYSECM   SJKYLIKE    SJKYAVGR          @P6A*/ 01322400
*/*          SJKYDSNT   SJKYSPIN   SJKYSEGM    SJKYPATH          @P6A*/ 01323800
*/*          SJKYPOPT   SJKYPMDE   SJKYPNDS    SJKYRLS           @L6A*/ 01325200
*/*          SJKYFDAT   SJKYJENV                                 @LBC*/ 01325900
*/*                                                                  */ 01326600
*/*01* END OF EXTERNAL CLASSIFICATION                            @P6A*/ 01328000
*/*                                                                  */ 01329400
*/* EYE CATCHER = n/a                                            @P6A*/ 01330800
*/*                                                                  */ 01332200
*/* Storage Attributes =                                         @P6A*/ 01333600
*/*      Virtual Storage   = included in module's dynamic area   @P6A*/ 01335000
*/*                                                                  */ 01336400
*/* Size = n/a                                                   @P6A*/ 01337800
*/*                                                                  */ 01339200
*/* CREATED BY = n/a                                             @P6A*/ 01340600
*/*                                                                  */ 01342000
*/* POINTED TO BY = n/a                                          @P6A*/ 01343400
*/*                                                                  */ 01344800
*/* SERIALIZATION = None                                         @P6A*/ 01346200
*/*                                                                  */ 01350000
*/*    INVOCATION =                                                  */ 01400000
*/*                                                                  */ 01450000
*/*        PL/S - %INCLUDE SYSLIB(IEFSJKEY)                          */ 01500000
*/*                                                                  */ 01550000
*/*        BAL  - IEFSJKEY                                           */ 01600000
*/*               The literals can be used as shown below:           */ 01650000
*/*                                                                  */ 01700000
*/*               MVC SJACKEY,=AL2(SJKYACDE)                         */ 01750000
*/*                                                                  */ 01800000
*/*    NOTES =                                                       */ 01850000
*/*               This macro provides the constants for the SJF      */ 01850900
*/*               keys used as input to the SJF Access               */ 01851800
*/*               function.  It also defines bytes for               */ 01852700
*/*               retrieving/updating individual bits. It        @D4C*/ 01853600
*/*               invokes IEFSJDKY, which defines the new        @P2C*/ 01854500
*/*               SJF keys corresponding to JCL keywords on the  @D4C*/ 01855400
*/*               DD statement.                                  @D4C*/ 01856300
*/*                                                                  */ 01857200
*/*        Any new JCL keywords defined to the DD statement      @D4A*/ 01858300
*/*        should be defined in IEFSJDKY, in order to allow the  @D4A*/ 01866600
*/*        caller of Dynamic Allocation to include these keys.   @D4A*/ 01874900
*/*        This macro will invoke IEFSJDKY.                      @P2A*/ 01883200
*/*                                                                  */ 01891500
*/*        The key constants generate PLS constants or               */ 01900000
*/*        BAL equates for literals.                                 */ 01950000
*/*                                                                  */ 02000000
*/*        Care should be taken when updating bit items,             */ 02050000
*/*        the bits passed into Access are treated as a MASK,        */ 02100000
*/*        ie. the bits which are ON will be used to                 */ 02150000
*/*        determine which bits to change.  When used in             */ 02200000
*/*        conjuction with the parameter number it will              */ 02250000
*/*        allow either turning on or turning off the bit values.    */ 02300000
*/*        Therefore it is not always sufficient to take             */ 02350000
*/*        the retrieved field and pass it back to Access            */ 02400000
*/*        to update that field.                                     */ 02450000
*/*                                                                  */ 02500000
*/*        Unused keys should be reused when adding new keys.        */ 02550000
*/*                                                                  */ 02600000
*/*        NAMING CONVENTIONS:                                   @D1A*/ 02650000
*/*                                                                  */ 02700000
*/*        CHOICE DATA VALUES are qualified as follows:          @D1A*/ 02750000
*/*               SJVLxxxx                                       @D1A*/ 02800000
*/*        The value retrieved from the SJF Access function      @D1A*/ 02850000
*/*        should be compared with the value in these fields.    @D1A*/ 02900000
*/*                                                                  */ 02950000
*/*        BYTMASK VALUES are qualified as follows:              @D1A*/ 03000000
*/*               SJBYxxxx                                       @D1A*/ 03050000
*/*        This can be used as a place to retrieve the byte      @D1A*/ 03100000
*/*        from the SJF Access function.                         @D1A*/ 03150000
*/*               SJBIxxxx                                       @D1A*/ 03200000
*/*        This can be used for comparison with the byte         @D1A*/ 03250000
*/*        retrieved by the SJF Access function. In the PLAS     @D1A*/ 03300000
*/*        mapping, if the field qualified by 'SJBY' is used to  @D1A*/ 03350000
*/*        retrieve the byte, then the fields qualified by       @D1A*/ 03400000
*/*        'SJBI' automatically map the bits within that byte.   @D1A*/ 03450000
*/*                                                              @P6A*/ 03456200
*/*      Classification notes:                                   @P6A*/ 03462400
*/*        The keys that are externalized are those SJF JDT      @P6A*/ 03468600
*/*        defined keys from IEFJDT05(JOB) and IEFJDT02(DD)      @P6A*/ 03474800
*/*        that can be specified on JCL and appear in CI Text.   @P6A*/ 03481000
*/*        Any keys added to IEFSJDKY need to be considered      @P6A*/ 03487200
*/*        for the PSPI list in this macro.                      @P6A*/ 03493400
*/*                                                                  */ 03500000
*/*    CHANGE ACTIVITY = (SEE BELOW)                             @04C*/ 03550000
*/*                                                                  */ 03600000
*/* $L0= SMSSTG2 JBB2223 860127 PDT4: STOR MGMT SUBSYS STG2 SUPT @L0A*/ 03650000
*/* $L1= SMSSTG2 JBB2223 860324 PDT4: STOR MGMT SUBSYS STG2 SUPT @L1A*/ 03700000
*/* $D1= DCR008  JBB2223 860929 PDN4: STOR MGMT SUBSYS STG2 SUPT @D1A*/ 03750000
*/* $P1= PC20127 JBB2223 870114 PDN4: PC20127                    @P1A*/ 03775000
*/* $D2= DCR0033 JBB2223 870225 PDN4: DCR 33                     @D2A*/ 03787500
*/* $D3= DCR0043 JBB2223 870522 PDN4: DCR 43                     @D3A*/ 03791600
*/* $D4= DCR0044 JBB2223 870522 PDN4: DCR 44                     @D4A*/ 03795700
*/* $P2= PC20307 JBB2223 870629 PDN4: PC20307                    @P2A*/ 03797800
*/* $D5= DCR0018 JBB3313 880809 PDY1: CNTL support               @D5A*/ 03798900
*/* $L2= EMVS2   HBB4410 880905 PDKK: Enterprise II - ESI        @L2A*/ 03799400
*/* $L3= APPC1   HBB4420 890421 PDKK: APPC                       @L3A*/ 03799500
*/* $D6= DP30013 HBB4420 890905 PDB3: DCR13, Account subfields   @D6A*/ 03799600
*/* $P3= APPC1   HBB4420 890818 PDY1: PH30206                    @P3A*/ 03799700
*/* $L4= ATLIB   HBB4430 911007 PDEV: Tape Library Support       @L4A*/ 03799800
*/* $P2= PKB0249 HBB4430 911220 PDNN: SJKYSMS7 doubly defined    @P2A*/ 03812300
*/* $P4= PKB0895 HBB4430 920506 PDCL: TENX Defect Elimination    @P4A*/ 03824800
*/* $P5= PKB2990 HBB4430 920624 PDCL: Tape Library Support       @P5A*/ 03831000
*/* $L5= ATLIB   HBB4430 920617 PDCL: Tape Library Support       @L5A*/ 03834100
*/* $01= OY54619 JBB2223 920815 PDCL: Expiration Date            @01A*/ 03834900
*/* $P6= PIG1424 HBB5510 930715 PDDZ: SHOWHDR compliance         @P6A*/ 03835700
*/* $02= OY63723 HBB4430 930513 PDCL: Quoted Data Set Names      @02A*/ 03836500
*/* $L6= SDSHS   HBB5520 930929 PDCL: VSAM RLS Support           @L6A*/ 03836900
*/* $P7= PN70031 HBB5520 931203 PDCL: Miscellaneous              @P7A*/ 03837100
*/* $L7= TMM     JBB5522 940818 PDEV: TMM Fixup                  @L7A*/ 03837200
*/* $L8= TMM     JBB5522 950105 PDEV: TMM Fixup                  @L8A*/ 03841400
*/* $L9= TMM     JBB5522 950105 PDEV: TMM Fixup                  @L9A*/ 03843500
*/* $LA= UU      JBB5522 950622 PDBN: xSAM access to HFS         @LAA*/ 03844500
*/* $LB= WLMPRES JBB6604 970116 PDCG: Stephen McGrath                */ 03844700
*/*                                   SCHENV= Scheduling Environment */ 03844900
*/*                                   keyword support            @LBA*/ 03845100
*/* $03= OW23626 HBB4430 961015 PDLS: Stor Mgmt Subsys R140 Supt @03A*/ 03845300
*/* $04= OW32524 JBB6607 980501 PDDH: Planform 1728/1780 Support @04A*/ 03845400
*/* $LC= GT32K   HBB7703 990831 PDNN: >32K Blocksize Support     @LCA*/ 03846500
*/* $LD= UNAFF   HBB7703 990831 PDNN: Unit Affinity for SMS Tape @LDA*/ 03847600
*/* $P8= PXD1020 HBB7703 000201 PDFD: Fix copyright              @P8A*/ 03848100
*/* $05= OW44785 HBB7703 990731 PDOO: Duplicate Volume Support       */ 03848300
*/*                                   for JES3                   @05A*/ 03848500
*/*                                                                  */ 03848700
*/***END OF SPECIFICATIONS***************************************@P6C*/ 03850000
*/* A 000000-999999                                              @L0A*/ 03900000
*/* A Declares for byte to retrieve EXPDT, and values for AVGREC @L1A*/ 03950000
*/*   and RECORG                                                 @L1A*/ 04000000
*/* D Key 8516 is unused now                                     @L1A*/ 04050000
*/* A Key declares for STEPNAME, DATACLAS definition, UNIT       @D1A*/ 04100000
*/*   Affinity indicator, Volume Count, DSCB TTR, SGDS indicator @D1A*/ 04150000
*/*   and Volume serial number count.                            @D1A*/ 04200000
*/* A Choice value for the GENERIC option of the SECMODEL key    @D1A*/ 04250000
*/* A Byte mapping for the NORMAL and ABNORMAL termination       @D1A*/ 04300000
*/*   parameters of the DISP keyword                             @D1A*/ 04350000
*/* D Key declares for FCB ID, UCS ID, BURST, COPIES, CHARS, FLASH,  */ 04400000
*/*   and MODIFY                                                 @D1A*/ 04450000
*/* A Key declare for UNIT Count field                           @P1A*/ 04475000
*/* A Key declare for PROTECT field - reuse '850E' key value     @D2A*/ 04487500
*/* A Key declares for GDG indicator and relative generation     @D3A*/ 04489200
*/*   number - reuse '8515' and '8516' key values                @D3A*/ 04490900
*/* D Remove declares for DD keywords needed by the caller of    @D4A*/ 04492600
*/*   SVC 99 (Dynamic Allocation). These are now defined in      @D4A*/ 04494300
*/*   IEFSJDKY. This macro will instead do an include for        @D4A*/ 04496000
*/*   IEFSJDKY to obtain these key values                        @D4A*/ 04497700
*/* C Change IEFSJDKY invocation. IEFSJDKY is now an executable  @P2A*/ 04498400
*/*   macro                                                      @P2A*/ 04499100
*/* D Removed CNTL and put it in IEFSJDKY                        @D5A*/ 04499500
*/* A Key declare for default unit indicator                 @YA19219*/ 04499700
*/* A Added support for ZSEGID Keyword                           @L2A*/ 04499800
*/* A Add SJVLISU,SJVLPSU,SJVLDAU & SJVLPOU to DSORG('8507') @YA29240*/ 04499900
*/* A Added equates for JOB keywords: BYTES, CARDS, PAGES, LINES @L3A*/ 04504000
*/* A Added support for access to sub fields of Job/Step ACCNT   @D6A*/ 04508100
*/* C Fixed equates for JOB keywords: BYTES, CARDS, PAGES, LINES @P3A*/ 04512200
*/* A Added parameter for dynamic allocation default unit    @YA31387*/ 04516600
*/* A Added support for the Label Type, File Sequence number, SMS    */ 04518600
*/*   managed mountable, Compation, Density and ZDEVPOOL             */ 04520600
*/*                                                              @L4A*/ 04522600
*/* C Changed SJKYSMS7 to SJBYSMS7 for the byte definition.      @P2A*/ 04523700
*/* A Added JOB key SJKYMSGC for msgclass.                       @P4A*/ 04524300
*/* C Corrected constant for SJBILTM parameter on LABEL keyword  @P5A*/ 04524500
*/* C Changed PLAS declares SJBICOMP and SJBINCMP to constants   @P5A*/ 04524700
*/* A Added support for TDSI information                         @L5A*/ 04526800
*/* A Added support for IN/OUT indicator on LABEL keyword        @L5A*/ 04528900
*/* A Added retention period key for SMS to use for updating     @01A*/ 04529400
*/*   an expiration date (JFCBXPDT) that was derived from a      @01A*/ 04529900
*/*   retention period                                           @01A*/ 04530400
*/* C Changed prolog to be SHOWHDR compliant                     @P6A*/ 04531100
*/* A Added second paramter SJKYDSNM for SMS to use to retrieve  @02A*/ 04531500
*/*   quoted data set name indicator (SIOTDSQU) from SIOT.  In   @02A*/ 04531900
*/*   support of DF/SMS apar OY63717.  Corresponding Interpreter @02A*/ 04532300
*/*   and Dynamic Allocation apars are OY63724 and OY63722.      @02A*/ 04532700
*/* A Added CDPI classification RLS key (defined in IEFSJDKY)    @L6A*/ 04533000
*/* C Changed declare for SJBISYSO to an equate.  Corrected      @P7A*/ 04533100
*/*   declare for SJVL36TK.                                      @P7A*/ 04533200
*/* A Added support for SIOTRESL field.                          @L7A*/ 04538800
*/* A Added support for SIOTCLRV flag.  If this flag is ON, it   @L8A*/ 04539900
*/*   indicates that Allocation is to clear the volsers from the @L8A*/ 04541000
*/*   JFCB/JFCBXs associated with this SIOT.  This indicator is  @L8A*/ 04542100
*/*   set by SMS via SJF.                                        @L8A*/ 04543200
*/* D Remove support for SIOTCLRV flag.                          @L9A*/ 04543800
*/* C Added CDPI classification for FILEDATA key (defined in         */ 04543900
*/*   IEFSJDKY).                                                 @LAA*/ 04544000
*/* A Added support for SCHENV keyword.                          @LBA*/ 04544100
*/* A Added new SMS DATACLAS definition field                    @03A*/ 04544200
*/* A Added support for CCSID and RLSTMOUT keyword.              @04A*/ 04545600
*/* A Added support for >=32K Blocksize keyword.  Added a new        */ 04545760
*/*   key (SJKYBLKS (x'852E') to allow SMS to retrieve blocksize    */  04545820
*/*   information.                                               @LCA*/ 04545880
*/* A Added support for Unit Affinity for SMS Tape.  Added           */ 04546000
*/*   new key SJKYSMS2 (x'8021') to be used by SMS to retrieve       */ 04546100
*/*   LIBRARY information about a DD.  Also, added new key           */ 04546200
*/*   SJKYUNAF (X'852F') to allow SMS to retrieve the DD token   @05C*/ 04546340
*/*   for the affed DD.                                          @LDA*/ 04546400
*/* C Fixed the copyright/program number statements.             @P8A*/ 04546700
*/* A Added support for SMS to manage a bit in the SIOT to           */ 04546750
*/*   indicate to  JES3 that the volume is duplicate of a volume     */ 04546800
*/*   in a managed library, but this one is not managed, and not     */ 04546850
*/*   in the library.  New key SJKYSMSV (x'8530') to be used by      */ 04546900
*/*   SMS to update the new SIOTDUPV bit accordingly.            @05A*/ 04546950
*/*                                                                  */ 04547000
*      %GOTO SJKYPLS;        /*                                         04548400
**********************************************************************  04550000
*                                                                    *  04600000
*     KEY CONSTANTS FOR SJF ACCESS                                   *  04650000
*                                                                    *  04700000
**********************************************************************  04750000
*                                                                    *  04800000
*            KEY CONSTANTS FOR 'DD'                                  *  04850000
*                                                                    *  04900000
**********************************************************************  04950000
SJKY      DS    0F                                                      05000000
SJVBDD    DC    CL8'DD'                                                 05050000
SJKYACDE  EQU   X'8001'         ACCODE                                  05100000
SJKYOUTP  EQU   X'8002'         OUTPUT                                  05150000
*                                                                1@D5D  05200000
*                                                               20@D4D  05225000
**********************************************************************  05250000
*                                                                    *  05275000
* Include new DD keys needed by SVC 99 callers                    @D4A  05300000
*                                                                    *  05325000
**********************************************************************  05350000
           IEFSJDKY                                               @D4A  05375000
SJKYRACF  EQU   X'8007'         SMS RACF FIELD                          05400000
SJKYSMSD  EQU   X'8008'         SMS DATA FIELD                          05450000
SJKYSTRG  EQU   X'8009'         STORAGE GROUP                           05500000
SJKYDADM  EQU   X'800A'         DAADM                                   05550000
SJKYDCLD  EQU   X'8011'         DATACLAS Definition                @D1A 06250000
SJKYZSEG  EQU   X'8015'         ZSEGID                             @L2A 06300000
SJKYPOOL  EQU   X'8016'         ZDEVPOOL KEYWORD                   @L4A 06350000
SJKYDCL2  EQU   X'801E'         DATACLAS Definition II             @03A 06400000
SJKYSMS2  EQU   X'8021'         SMS DATA FIELD II                  @LDA 06450000
SJKYSMSB  EQU   X'8500'         SMS FLAG BYTE                           06500000
SJBYSMSB  DS    X               Byte to retrieve SMS flags into         06550000
* Bit masks for SMS flags field                                         06600000
SJBISMSM  EQU   X'80'           SMS MANAGED BIT ON INDICATOR            06650000
SJKYVRDD  EQU   X'8501'         VOL=REF=DDNAME                          06700000
SJKYVRDS  EQU   X'8502'         VOL=REF=DSNAME                          06750000
SJKYDDNM  EQU   X'8503'         DDNAME                                  06800000
SJKYVSRN  EQU   X'8504'         VOL=SER=                                06850000
SJKYSPAC  EQU   X'8505'         SPACE                                   06900000
* Values for first parameter of SPACE field                             06950000
SJVLCYL   EQU   X'C0'           Request for Cylinders                   07000000
SJVLTRK   EQU   X'80'           Request for Tracks                      07050000
SJVLAVR   EQU   X'40'           Request for Average Block length        07100000
SJVLMSGP  EQU   X'20'           Request for MSVGP                       07150000
SJVLCONT  EQU   X'08'           Request for Contiguous                  07200000
SJVLMXIG  EQU   X'04'           Request for MXIG                        07250000
SJVLALX   EQU   X'02'           Request for ALX                         07300000
SJVLRND   EQU   X'01'           Request for Round                       07350000
SJVLABS   EQU   X'00'           Request for ABSTR                       07400000
SJBYSPC5  DS    X               Byte to retrieve RLSE value into        07450000
* Bit masks for fifth parameter of SPACE (RLSE) field                   07500000
SJBIRLSE  EQU   X'C0'           Release specified                       07550000
SJKYMSVG  EQU   X'8506'         MSVGP                                   07600000
SJKYDSRG  EQU   X'8507'         DSORG                                   07650000
* Values for first parameter of DSORG field                             07700000
SJVLIS    EQU   X'80'           Indexed Sequential                      07750000
SJVLPS    EQU   X'40'           Physical Sequential                     07800000
SJVLDA    EQU   X'20'           Direct Access                           07850000
SJVLBQ    EQU   X'10'           BTAM or QTAM line group                 07900000
SJVLQD    EQU   X'08'           QTAM Direct Access Queue                07950000
SJVLQP    EQU   X'04'           QTAM problem prog. Queue                08000000
SJVLPO    EQU   X'02'           Partitioned                             08050000
SJVLPU    EQU   X'01'           Unmovable                               08100000
SJVLISU   EQU   X'81'           Index Sequential Unmovable     @YA29240 08110000
SJVLPSU   EQU   X'41'           Physical Sequential Unmovable  @YA29240 08120000
SJVLDAU   EQU   X'21'           Direct Access Unmovable        @YA29240 08130000
SJVLPOU   EQU   X'03'           Partitioned Unmovable          @YA29240 08140000
* Values for the second parameter of DSORG field                        08150000
SJVLGS    EQU   X'80'           Graphics                                08200000
SJVLTL    EQU   X'40'           TCAM line group                         08250000
SJVLTM    EQU   X'20'           TCAM message queue                      08300000
SJVLVS    EQU   X'08'           VSAM                                    08350000
SJVLTR    EQU   X'04'           TCAM 3705                               08400000
SJKYDISP  EQU   X'8508'         DISP                                    08450000
SJBYDISP  DS    X               Byte to retrieve the Status value  @D1C 08500000
*                               into                                    08550000
* Bit masks for DISP-Status field                                  @D1C 08600000
SJBINEW   EQU   X'04'           NEW                                     08650000
SJBIMOD   EQU   X'02'           MOD                                     08700000
SJBIOLD   EQU   X'01'           OLD                                     08750000
SJBYDSP2  DS    X               Byte to retrieve the normal        @D1A 08800000
*                               termination parameter into              08850000
* Bit masks for DISP-Normal termination field                      @D1A 08900000
SJBIPASS  EQU   X'10'           PASS                               @D1A 08950000
SJBIKEEP  EQU   X'08'           KEEP                               @D1A 09000000
SJBIDELT  EQU   X'04'           DELETE                             @D1A 09050000
SJBICATL  EQU   X'02'           CATLG                              @D1A 09100000
SJBIUCTL  EQU   X'01'           UNCATLG                            @D1A 09150000
SJBYDSP3  DS    X               Byte to retrieve the abnormal      @D1A 09200000
*                               termination parameter into              09250000
* Bit masks for DISP-Abnormal termination field                    @D1A 09300000
SJBIKEPA  EQU   X'08'           KEEP                               @D1A 09350000
SJBIDELA  EQU   X'04'           DELETE                             @D1A 09400000
SJBICATA  EQU   X'02'           CATLG                              @D1A 09450000
SJBIUCTA  EQU   X'01'           UNCATLG                            @D1A 09500000
SJKYDSNM  EQU   X'8509'         DSNAME                                  09550000
* Bit masks for quoted data set name indicator (second parameter) @02A  09560000
SJBYDSQU  DS    X        Byte to retrieve quoted DSNAME indicator @02A  09570000
SJBIDSQU  EQU   X'04'    If this bit is on, then DSNAME was       @02A  09580000
*                        specified in quotes                      @02A  09590000
SJKYDUMY  EQU   X'850A'         DUMMY                                   09600000
SJBYDUMY  DS    X               Byte to retrieve the DUMMY indicator    09650000
* Bit masks for DUMMY field                                             09700000
SJBIDUMY  EQU   X'80'           Dummy                                   09750000
SJKYDSID  EQU   X'850B'         DSID                                    09800000
SJBYDSID  DS    X               Byte to retrieve the DSID into          09850000
* Bit masks for DSID field                                              09900000
SJBIDSID  EQU   X'08'           DSID                                    09950000
SJKYUNIT  EQU   X'850C'         UNIT                                    10000000
SJKYSYSI  EQU   X'850D'         SYSIN INDICATOR                         10050000
SJBYSYSI  DS    X               Byte to retrieve the SYSIN indicator    10100000
* Bit masks for SYSIN field                                             10150000
SJBISYSI  EQU   X'40'           SYSIN indicator                         10200000
SJKYPROT  EQU   X'850E'         PROTECT field                      @D2A 10220000
SJBYPROT  DS    X               Byte to retrieve PROTECT field     @D2A 10240000
* Bit masks for PROTECT field                                      @D2A 10260000
SJBIPROT  EQU   X'80'           PROTECT=YES indicator              @D2A 10280000
SJKYDFUB  EQU   X'850F'         Default unit indicator         @YA19219 10291600
SJBYDFUB  DS    X               Byte to retrieve default unit indicator 10303200
*                                                              @YA19219 10314800
* Bit mask for default unit indicator                          @YA19219 10326400
SJBIDFUM  EQU   X'10'                                          @YA19219 10338000
SJBIDDFU  EQU   X'08'           Dynamic allocation default     @YA31387 10342000
*                               unit indicator                 @YA31387 10346000
SJKYSYSO  EQU   X'8510'         SYSOUT INDICATOR                        10350000
SJBYSYSO  DS    X               Byte to retrieve the SYSOUT indicator   10400000
* Bit masks for SYSOUT field                                            10450000
SJBISYSO  EQU   X'08'           SYSOUT indicator                   @P7C 10485000
SJKYSMS7  EQU   X'8511'         SMS managed mountable indicator    @L4A 10520000
SJBYSMS7  DS    X               Byte for SMS mountable flag        @P2C 10540000
* Bit masks for the SMS managed mountable flag                     @L4A 10560000
SJBISMS7  EQU   X'01'           SMS managed mountable indicator    @L4A 10580000
SJKYTERM  EQU   X'8512'         TERM INDICATOR                          10600000
SJBYTERM  DS    X               Byte to retrieve the TERM indicator     10650000
* Bit masks for TERM field                                              10700000
SJBITERM  EQU   X'40'           TERM indicator                          10750000
SJKYSUBS  EQU   X'8513'         SUBSYS                                  10800000
SJBYSUBS  DS    X               Byte to retrieve the SUBSYS indicator   10850000
* Bit masks for SUBSYS field                                            10900000
SJBISUBS  EQU   X'80'           SUBSYS indicator                        10950000
SJKYQNME  EQU   X'8514'         QNAME                                   11000000
SJBYQNME  DS    X               Byte to retrieve the QNAME indicator    11050000
* Bit masks for QNAME field                                             11100000
SJBIQNME  EQU   X'01'           QNAME indicator                         11150000
SJKYGDG   EQU   X'8515'         GDG                                @D3C 11180000
* Bit masks for GDG field                                          @D3A 11210000
SJBIGDG   EQU   X'02'           GDG indicator                      @D3A 11240000
SJKYELNM  EQU   X'8516'         ELEMENT NAME/RELATIVE GDG NUMBER   @D3C 11270000
SJKYRKP   EQU   X'8517'         RKP                                     11300000
SJKYDSEQ  EQU   X'8518'         Dataset Sequence Number            @L4A 11311500
SJKYLTYP  EQU   X'8519'         LABEL Parameter                    @L4A 11323000
SJBYLTYP  DS    X               Byte to retrieve LABEL indicator   @L4A 11334500
* Bit masks for LABEL indicator                                    @L4A 11346000
SJBIAL    EQU   X'40'           AL                                 @L4A 11357500
SJBIAUL   EQU   X'48'           AUL                                @L4A 11369000
SJBILTM   EQU   X'21'           LTM                                @P5C 11380500
SJBIBLP   EQU   X'10'           BLP                                @L4A 11392000
SJBISUL   EQU   X'0A'           SUL                                @L4A 11403500
SJBINSL   EQU   X'04'           NSL                                @L4A 11415000
SJBISL    EQU   X'02'           SL                                 @L4A 11426500
SJBINL    EQU   X'01'           NL                                 @L4A 11438000
*                                                                 4@D1D 11450000
SJKYOUTL  EQU   X'851A'         OUTLIM                                  11500000
SJKYDEN   EQU   X'851B'         DENSITY                            @L4A 11512500
* Choice values for the first DENSITY parameter.                   @L4A 11525000
SJVL200   EQU   X'03'           7 track 200 BPI                    @L4A 11537500
SJVL556   EQU   X'43'           7 track 556 BPI                    @L4A 11550000
SJVL800   EQU   X'83'           7 and 9 track 800 BPI              @L4A 11562500
SJVL1600  EQU   X'C3'           9 track 1600 BPI                   @L4A 11575000
SJVL6250  EQU   X'D3'           9 track 6250 BPI                   @L4A 11587500
SJKYRECF  EQU   X'851C'         RECFM                                   11600000
SJBYRECF  DS    X               Byte to retrieve the RECFM field        11650000
* Bit masks for RECFM field                                             11700000
SJBIUNDF  EQU   X'C0'           Undefined format                        11750000
SJBIFIXD  EQU   X'80'           Fixed                                   11800000
SJBIVARI  EQU   X'40'           Variable                                11850000
SJBIASCI  EQU   X'20'           Variable/track overflow                 11900000
SJBIBLOK  EQU   X'10'           Blocked                                 11950000
SJBISPAN  EQU   X'08'           Standard/spanned                        12000000
SJBIASA   EQU   X'04'           ASA Control Characters                  12050000
SJBIMACH  EQU   X'02'           Machine Control Characters              12100000
SJKYLREL  EQU   X'851D'         LRECL                                   12150000
SJKYKEYL  EQU   X'851E'         KEYLEN                                  12200000
SJKYEXPD  EQU   X'851F'         EXPDT                                   12250000
          DS    0F              Full word alignment                @L1A 12300000
          DS    CL1             Align the fields correctly         @L1A 12350000
SJBYEXPD  DS    0CL3            3 Bytes to retrieve the EXPDT into @L1A 12400000
SJBYEXYY  DS    CL1             Year offset from 1900              @L1A 12450000
SJBYEXDD  DS    CL2             Julian days (0-366)                @L1A 12500000
SJKYTEMP  EQU   X'8520'         TEMP                                    12550000
SJBYTEMP  DS    X               Byte to retrieve the TEMP indicator     12600000
* Bit masks for TEMP keyword                                            12650000
SJBITEMP  EQU   X'01'           TEMP indicator                          12700000
SJKYDCBR  EQU   X'8521'         DCB=DSNAME                        @D1C  12750000
SJKYVSCT  EQU   X'8522'         VOLUME SERIAL COUNT               @D1A  12800000
SJKYVLC1  EQU   X'8523'         VOLUME COUNT - SIOT               @D1A  12850000
SJKYVLC2  EQU   X'8524'         VOLUME COUNT - JFCB               @D1A  12900000
SJKYUAFF  EQU   X'8525'         UNIT=AFF                          @D1A  12950000
SJBYDSAT  DS    X               Dataset attributes byte           @D1A  13000000
* Bit mask for UNIT=AFF keyword                                   @D1A  13050000
SJBIUAFF  EQU   X'02'           UNIT=AFF indicator                @D1A  13100000
SJKYDSCB  EQU   X'8526'         DSCB TTR                          @D1A  13150000
SJKYSGDS  EQU   X'8527'         SGDS (system generated data set name)   13200000
*                               indicator                         @D1A  13250000
SJBYSGDS  DS    X               Byte to retrieve SDGS indicator   @D1A  13300000
* Bit masks for SGDS keyword                                            13350000
SJBISGDS  EQU   X'10'           SGDS indicator                    @D1A  13400000
SJKYUNCT  EQU   X'8528'         UNIT Count field                  @P1A  13425000
SJKYCOMP  EQU   X'8529'         COMPACTION indicator              @L4A  13429100
SJBYCOMP  DS    X               Byte for COMPACTION indicator     @L4A  13433200
*    Constants for TRTCH data.                                    @P5C  13434800
*    Only the values for compaction and non-compaction are        @P5C  13436400
*    supplied because these are the only values that SMS needs    @P5C  13438000
*    to check for and make updates for.                           @P5C  13439600
SJBICOMP  EQU   X'08'           COMPACTION                        @L4A  13441400
SJBINCMP  EQU   X'04'           No COMPACTION                     @L4A  13445500
*                                                                       13445600
SJKYTDSI  EQU   X'852A'         TDSI Information                  @L5A  13445700
*                                                                 @L5A  13445800
*  Constants for Track recording technique (first nibble of TDSI) @L5A  13445900
*                                                                 @L5A  13446000
SJVLTRKR EQU   X'F0' -   Track recording technique                @L5A  13446100
SJVLOREC EQU   X'00' -   Recording technology unknown or not      @L5A  13446200
*                        specified                                @L5A  13446300
SJVL18TK EQU   X'10' -   18 track recording mode - (hex value)    @L5A  13446400
SJVL36TK EQU   X'20' -   36 track recording mode - (hex value)    @L5A  13446500
*                                                                 @L5A  13446600
*  Constants for Media type (second nibble of TDSI)               @L5A  13446700
*                                                                 @L5A  13446800
SJVLMEDI EQU   X'0F' -   Media type                               @L5A  13446900
SJVLOMED EQU   X'00' -   Media type unknown or not specified      @L5A  13447000
SJVLMED1 EQU   X'01' -   Cartridge System Tape - (hex value)      @L5A  13447100
SJVLMED2 EQU   X'02' -   Enhanced Capacity Cartridge System Tape  @L5A  13447200
*                        - (hex value)                            @L5A  13447300
*                                                                 @L5A  13447400
*  Constants for Compaction Type (third nibble of TDSI)           @L5A  13447500
*                                                                 @L5A  13447600
SJVLCMPT EQU   X'F0' -   Compaction type                          @L5A  13447700
SJVLMPNS EQU   X'00' -   Compaction type unknown or not specified @L5A  13447800
SJVLNOCP EQU   X'10' -   Compaction not used - (hex value)        @L5A  13447900
SJVLIDRC EQU   X'20' -   Compaction type=IDRC - (hex value)       @L5A  13448000
*                                                                 @L5A  13448100
*  Constants for Special Attributes (fourth nibble of TDSI)       @L5A  13448200
*                                                                 @L5A  13448300
SJVLSPEC EQU   X'0F' -   Special attributes                       @L5A  13448400
SJVLOSPC EQU   X'00' -   Volume has no special attributes         @L5A  13448500
SJVLDCOM EQU   X'01' -   Read compatibility attribute. When set,  @L5A  13448600
*                        it indicates that the volumes will be    @L5A  13448700
*                        used for input only and read compatible  @L5A  13448800
*                        devices can be added to the device       @L5A  13448900
*                        eligibility - (hex value)                @L5A  13449000
*                                                                       13449100
SJKYAIND  EQU   X'852B'  IN/OUT Indicator on LABEL keyword        @L5A  13449200
*                                                                 @L5A  13449300
SJBYAIND  DS    X        Byte to retrieve IN/OUT data into        @L5A  13449400
* Bit masks for IN/OUT indicator                                  @L5A  13449500
SJBIINSP  EQU   X'80'    If this bit is on, then IN was           @L5A  13449600
*                        specified                                @L5A  13449700
SJBIOUTS  EQU   X'40'    If this bit is on, then OUT was          @L5A  13449800
*                        specified                                @L5A  13449900
SJKYRETP  EQU   X'852C'         Expiration date derived from      @01A  13462400
*                               retention period                  @01A  13474900
SJKYRESL  EQU   X'852D'         SMS VOLREF "to be resolved" flag  @L7A  13477400
SJBYRESL  DS    X               Byte for SMS to be resolved flag  @L7A  13479900
* Bit masks for the SMS to be resolved flag                       @L7A  13482400
SJBIRESL  EQU   X'04'           SMS VOLREF to be resolved         @L7A  13484900
*                                                                 @LCA  13485100
SJKYBLKS  EQU   X'852E'         Blocksize (from SIOTX)            @LCA  13485300
*Doubleword to retrieve Blocksize from SIOTX into                 @LCA  13485500
SJBYBLKS  DS    XL8             Blocksize field from SIOTX        @LCA  13485700
*                                                                 @LCA  13485900
SJKYUNAF  EQU   X'852F'         Affed-to DD token (UNIT=AFF=DDx)  @LDA  13486100
*                                                                 @05A  13486200
SJKYSMSV  EQU   X'8530'         Duplicate volume bit in SIOT      @05A  13486300
* Bit mask  for Duplicate Volume indicator for JES3               @05A  13486400
SJBYDUPV  DS    X               Byte for Duplicate Volume bit     @05A  13486500
SJBIDUPV  EQU   X'02'           Duplicate volume indicator        @05A  13486600
*                                                                 @05A  13486700
**********************************************************************  13487400
*                                                                    *  13500000
*            KEY CONSTANTS FOR 'EXEC'                                *  13550000
*                                                                    *  13600000
**********************************************************************  13650000
SJVBEXEC  DC    CL8'EXEC'                                               13700000
SJKYPGMN  EQU   X'8900'         PROGRAM NAME                            13750000
SJKYSACT  EQU   X'8901'         STEP ACCOUNTING                         13800000
SJKYSTPN  EQU   X'8902'         STEPNAME                          @D1A  13850000
SJKYSACS  EQU   X'8903'         STEP ACCOUNTING SUB PARAMETERS    @D6A  13875000
SJKYSCCS  EQU   X'0001'         STEP CCSID                        @04A  13883300
SJKYSRTO  EQU   X'0002'         STEP RLSTMOUT                     @04A  13891600
**********************************************************************  13900000
*                                                                    *  13950000
*            KEY CONSTANTS FOR 'JOB'                                 *  14000000
*                                                                    *  14050000
**********************************************************************  14100000
SJVBJOB   DC    CL8'JOB'                                                14150000
SJKYJNME  EQU   X'8700'         JOBNAME                                 14200000
SJKYJACT  EQU   X'8701'         JOB ACCOUNTING                          14250000
SJKYJACS  EQU   X'8702'         JOB ACCOUNTING SUB PARAMETERS      @D6A 14253500
SJKYJBYT  EQU   X'0002'         BYTES (Max Count)                  @P3C 14257000
SJKYJBY2  EQU   X'0003'         BYTES (Disposition)                @P3C 14260500
SJKYJCRD  EQU   X'0004'         CARDS (Max Count)                  @P3C 14264000
SJKYJCR2  EQU   X'0005'         CARDS (Disposition)                @P3C 14267500
SJKYJPAG  EQU   X'0006'         PAGES (Max Count)                  @P3C 14271000
SJKYJPA2  EQU   X'0007'         PAGES (Disposition)                @P3C 14274500
SJKYJLIN  EQU   X'0008'         LINES (Max Count)                  @P3C 14278000
SJKYJLI2  EQU   X'0009'         LINES (Disposition)                @P3C 14281500
SJKYJENV  EQU   X'000A'         SCHENV                             @LBA 14283200
SJKYJCCS  EQU   X'000B'         JOB CCSID                          @04A 14284100
* Values for BYTES, CARDS, PAGES and LINES disposition             @L3A 14285000
SJVLCANC  EQU   X'10'           CANCEL                             @L3A 14288500
SJVLDUMP  EQU   X'20'           DUMP                               @L3A 14292000
SJVLWARN  EQU   X'40'           WARNING                            @L3A 14295500
SJKYMSGC  EQU   X'8703'         Job Msgclass Information           @P4A 14297700
          MEND                                                          14300000
.*/ %SJKYPLS: ;                                                         14350000
*@EJECT;                                                                14400000
*/********************************************************************/ 14450000
*/*                                                                  */ 14500000
*/*   KEY CONSTANTS FOR SJF ACCESS                                   */ 14550000
*/*                                                                  */ 14600000
*/*                                                                  */ 14650000
*/*          KEY CONSTANTS FOR 'DD'                                  */ 14700000
*/*                                                                  */ 14750000
*/********************************************************************/ 14800000
*DCL SJVBDD CHAR(8) CONSTANT('DD      ');                               14850000
*DCL SJKYACDE BIT(16) CONSTANT('8001'X); /* ACCODE                   */ 14900000
*DCL SJKYOUTP BIT(16) CONSTANT('8002'X); /* OUTPUT                   */ 14950000
*                                        /*                     1@D5D*/ 15000000
*                                        /*                    20@D4D*/ 15025000
*/********************************************************************/ 15050000
*/*                                                                  */ 15075000
*/*     Include keys needed by callers of SVC 99                 @D4A*/ 15100000
*/*                                                                  */ 15125000
*/********************************************************************/ 15150000
*?IEFSJDKY;                              /*                      @P2C*/ 15175000
*DCL SJKYRACF BIT(16) CONSTANT('8007'X); /* SMS RACF FIELD           */ 15200000
*DCL SJKYSMSD BIT(16) CONSTANT('8008'X); /* SMS DATA FIELD           */ 15250000
*DCL SJKYSTRG BIT(16) CONSTANT('8009'X); /* STORAGE GROUP            */ 15300000
*DCL SJKYDADM BIT(16) CONSTANT('800A'X); /* DAADM                    */ 15350000
*DCL SJKYDCLD BIT(16) CONSTANT('8011'X); /* DATACLAS Definition  @D1A*/ 16000000
*DCL SJKYZSEG BIT(16) CONSTANT('8015'X); /* ZSEGID               @L2A*/ 16050000
*DCL SJKYPOOL BIT(16) CONSTANT('8016'X); /* ZDEVPOOL             @L4A*/ 16100000
*DCL SJKYDCL2 BIT(16) CONSTANT('801E'X); /* DATACLAS Define II   @03A*/ 16150000
*DCL SJKYSMS2 BIT(16) CONSTANT('8021'X); /* SMS DATA FIELD II    @LDA*/ 16200000
*DCL SJKYSMSB BIT(16) CONSTANT('8500'X); /* SMS FLAG BYTE            */ 16300000
*DCL 1 SJBYSMSB,                    /* Byte to retrieve the bits into*/ 16350000
*      3 SJBISMSM BIT(1),           /* Dataset is SMS Managed        */ 16400000
*      3 * BIT(7);                                                      16450000
*DCL SJKYVRDD BIT(16) CONSTANT('8501'X); /* VOL=REF=DDNAME           */ 16500000
*DCL SJKYVRDS BIT(16) CONSTANT('8502'X); /* VOL=REF=DSNAME           */ 16550000
*DCL SJKYDDNM BIT(16) CONSTANT('8503'X); /* DDNAME                   */ 16600000
*DCL SJKYVSRN BIT(16) CONSTANT('8504'X); /* VOL=SER=                 */ 16650000
*DCL SJKYSPAC BIT(16) CONSTANT('8505'X); /* SPACE                    */ 16700000
*/* Values for first parameter of SPACE field                        */ 16750000
*DCL SJVLCYL  BIT(8) CONSTANT('C0'X); /* Request for Cylinders       */ 16800000
*DCL SJVLTRK  BIT(8) CONSTANT('80'X); /* Request for Tracks          */ 16850000
*DCL SJVLAVR  BIT(8) CONSTANT('40'X); /* Request for Average Block      16900000
*                                       length                       */ 16950000
*DCL SJVLMSGP BIT(8) CONSTANT('20'X); /* Request for MSVGP           */ 17000000
*DCL SJVLCONT BIT(8) CONSTANT('08'X); /* Request for Contiguous      */ 17050000
*DCL SJVLMXIG BIT(8) CONSTANT('04'X); /* Request for MXIG            */ 17100000
*DCL SJVLALX  BIT(8) CONSTANT('02'X); /* Request for ALX             */ 17150000
*DCL SJVLRND  BIT(8) CONSTANT('01'X); /* Request for Round           */ 17200000
*DCL SJVLABS  BIT(8) CONSTANT('00'X); /* Request for ABSTR           */ 17250000
*/* Bit masks for fifth parameter of SPACE (RLSE) field              */ 17300000
*DCL 1 SJBYSPC5,                    /* Byte to retrieve the bit into    17350000
*                                      for RLSE (parameter 5)        */ 17400000
*      3 SJBIRLSE BIT(2),           /* Release External storage      */ 17450000
*      3 *        BIT(6);                                               17500000
*DCL SJKYMSVG BIT(16) CONSTANT('8506'X); /* MSVGP                    */ 17550000
*DCL SJKYDSRG BIT(16) CONSTANT('8507'X); /* DSORG                    */ 17600000
*/* Values for the first parameter of DSORG field                    */ 17650000
*DCL SJVLIS BIT(8) CONSTANT('80'X); /* Indexed Sequential            */ 17700000
*DCL SJVLPS BIT(8) CONSTANT('40'X); /* Physical Sequential           */ 17750000
*DCL SJVLDA BIT(8) CONSTANT('20'X); /* Direct Access                 */ 17800000
*DCL SJVLBQ BIT(8) CONSTANT('10'X); /* BTAM or QTAM line group       */ 17850000
*DCL SJVLQD BIT(8) CONSTANT('08'X); /* QTAM Direct Access Queue      */ 17900000
*DCL SJVLQP BIT(8) CONSTANT('04'X); /* QTAM problem prog. Queue      */ 17950000
*DCL SJVLPO BIT(8) CONSTANT('02'X); /* Partitioned                   */ 18000000
*DCL SJVLPU BIT(8) CONSTANT('01'X); /* Unmovable                     */ 18050000
*DCL SJVLISU BIT(8) CONSTANT('81'X); /* Indx Seq Unmov (ISU) @YA29240*/ 18060000
*DCL SJVLPSU BIT(8) CONSTANT('41'X); /* Phys Seq Unmov (PSU) @YA29240*/ 18070000
*DCL SJVLDAU BIT(8) CONSTANT('21'X); /* Dir Acc Unmov  (DAU) @YA29240*/ 18080000
*DCL SJVLPOU BIT(8) CONSTANT('03'X); /* Part Only Unmv (POU) @YA29240*/ 18090000
*/* Values for the second parameter of DSORG field                   */ 18100000
*DCL SJVLGS BIT(8) CONSTANT('80'X); /* Graphics                      */ 18150000
*DCL SJVLTL BIT(8) CONSTANT('40'X); /* TCAM line group               */ 18200000
*DCL SJVLTM BIT(8) CONSTANT('20'X); /* TCAM message queue            */ 18250000
*DCL SJVLVS BIT(8) CONSTANT('08'X); /* VSAM                          */ 18300000
*DCL SJVLTR BIT(8) CONSTANT('04'X); /* TCAM 3705                     */ 18350000
*DCL SJKYDISP BIT(16) CONSTANT('8508'X); /* DISP                     */ 18400000
*/* Bit masks for DISP field                                         */ 18450000
*DCL 1 SJBYDISP,                    /* Byte to retrieve Status          18500000
*                                      parameter into            @D1C*/ 18550000
*     3 * BIT(5),                                                       18600000
*     3 SJBINEW BIT(1),             /* NEW                           */ 18650000
*     3 SJBIMOD BIT(1),             /* MOD                           */ 18700000
*     3 SJBIOLD BIT(1);             /* OLD                           */ 18750000
*DCL 1 SJBYDSP2,                    /* Byte to retrieve Normal   @D1A*/ 18800000
*                                   /* termination parameter into    */ 18850000
*     3 * BIT(3),                                                       18900000
*     3 SJBIPASS BIT(1),            /* PASS                      @D1A*/ 18950000
*     3 SJBIKEEP BIT(1),            /* KEEP                      @D1A*/ 19000000
*     3 SJBIDELT BIT(1),            /* DELETE                    @D1A*/ 19050000
*     3 SJBICATL BIT(1),            /* CATLG                     @D1A*/ 19100000
*     3 SJBIUCTL BIT(1);            /* UNCATLG                   @D1A*/ 19150000
*DCL 1 SJBYDSP3,                    /* Byte to retrieve abnormal @D1A*/ 19200000
*                                   /* termination parameter into    */ 19250000
*     3 * BIT(4),                                                       19300000
*     3 SJBIKEPA BIT(1),            /* KEEP                      @D1A*/ 19350000
*     3 SJBIDELA BIT(1),            /* DELETE                    @D1A*/ 19400000
*     3 SJBICATA BIT(1),            /* CATLG                     @D1A*/ 19450000
*     3 SJBIUCTA BIT(1);            /* UNCATLG                   @D1A*/ 19500000
*DCL SJKYDSNM BIT(16) CONSTANT('8509'X); /* DSNAME                   */ 19550000
*/* Bit masks for quoted data set name indicator (second parameter)     19554500
*                                                                @02A*/ 19559000
*DCL 1 SJBYDSQU,                     /* Byte to retrieve quoted         19563500
*                                       DSNAME indicator         @02A*/ 19568000
*       3 *        BIT(5),           /* Data not pertinent to this      19572500
*                                       key                      @02A*/ 19577000
*       3 SJBIDSQU BIT(1),           /* If this bit is on, DSNAME was   19581500
*                                       specified in quotes      @02A*/ 19586000
*       3 *        BIT(2);           /* Data not pertinent to this      19590500
*                                       key                      @02A*/ 19595000
*DCL SJKYDUMY BIT(16) CONSTANT('850A'X); /* DUMMY                    */ 19600000
*/* Bit masks for DUMMY field                                        */ 19650000
*DCL 1 SJBYDUMY,                    /* Byte to retrieve bit into     */ 19700000
*     3 SJBIDUMY BIT(1),            /* Dummy                         */ 19750000
*     3 *        BIT(7);                                                19800000
*DCL SJKYDSID BIT(16) CONSTANT('850B'X); /* DSID                     */ 19850000
*/* Bit masks for DSID field                                         */ 19900000
*DCL 1 SJBYDSID,                    /* Byte to retrieve bit into     */ 19950000
*     3 *        BIT(4),                                                20000000
*     3 SJBIDSID BIT(1),            /* DSID                          */ 20050000
*     3 *        BIT(3);                                                20100000
*DCL SJKYUNIT BIT(16) CONSTANT('850C'X); /* UNIT                     */ 20150000
*DCL SJKYSYSI BIT(16) CONSTANT('850D'X); /* SYSIN INDICATOR          */ 20200000
*/* Bit masks for SYSIN field                                        */ 20250000
*DCL 1 SJBYSYSI,                    /* Byte to retrieve bit into     */ 20300000
*     3 *        BIT(1),                                                20350000
*     3 SJBISYSI BIT(1),            /* SYSIN indicator               */ 20400000
*     3 *        BIT(6);                                                20450000
*DCL SJKYPROT BIT(16) CONSTANT('850E'X); /* PROTECT field        @D2A*/ 20464200
*/* Bit masks for PROTECT field                                  @D2A*/ 20478400
*DCL 1 SJBYPROT,                         /* Byte to retrieve bit into   20492600
*                                                                @D2A*/ 20506800
*      3 SJBIPROT BIT(1),                /* PROTECT indicator    @D2A*/ 20521000
*      3 *        BIT(7);                /*                      @D2A*/ 20535200
*DCL SJKYDFUB BIT(16) CONSTANT('850F'X); /* Default unit indicator      20543300
*                                                            @YA19219*/ 20551400
*/* Bit masks for default unit field                         @YA19219*/ 20555400
*DCL 1 SJBYDFUB,                   /* Byte to retrieve the bit into     20559500
*                                                            @YA19219*/ 20567600
*      3 * BIT (3),                /*                        @YA19219*/ 20575700
*      3 SJBIDFUM BIT(1),          /* Default unit bit       @YA19219*/ 20583800
*      3 SJBIDDFU BIT(1),           /* Dynamic allocation default       20587800
*                                      unit indicator        @YA31387*/ 20591800
*      3 * BIT(3);                  /*                       @YC31387*/ 20595800
*DCL SJKYSYSO BIT(16) CONSTANT('8510'X); /* SYSOUT INDICATOR         */ 20600000
*/* Bit masks for SYSOUT field                                       */ 20650000
*DCL 1 SJBYSYSO,                    /* Byte to retrieve bit into     */ 20700000
*     3 *        BIT(4),                                                20750000
*     3 SJBISYSO BIT(1),            /* SYSOUT indicator              */ 20800000
*     3 *        BIT(3);                                                20850000
*DCL SJKYSMS7 BIT(16) CONSTANT('8511'X); /* SMS Mountable flag   @L4C*/ 20866600
*/* Bit masks for the SMS Mountable flag.                        @L4A*/ 20883200
*DCL 1 SJBYSMS7,                    /* Byte to retrieve bit info @L4A*/ 20899800
*      3 *        BIT(7),           /*                           @L4A*/ 20916400
*      3 SJBISMS7 BIT(1);           /* SMS Mountable flag        @L4A*/ 20933000
*DCL SJKYTERM BIT(16) CONSTANT('8512'X); /* TERM                     */ 20950000
*/* Bit masks for TERM field                                         */ 21000000
*DCL 1 SJBYTERM,                    /* Byte to retrieve bit into     */ 21050000
*     3 *        BIT(1),                                                21100000
*     3 SJBITERM BIT(1),            /* TERM indicator                */ 21150000
*     3 *        BIT(6);                                                21200000
*DCL SJKYSUBS BIT(16) CONSTANT('8513'X); /* SUBSYS                   */ 21250000
*/* Bit masks for SUBSYS field                                       */ 21300000
*DCL 1 SJBYSUBS,                    /* Byte to retrieve bit into     */ 21350000
*     3 SJBISUBS BIT(1),            /* SUBSYS indicator              */ 21400000
*     3 *        BIT(7);                                                21450000
*DCL SJKYQNME BIT(16) CONSTANT('8514'X); /* QNAME                    */ 21500000
*/* Bit masks for QNAME field                                        */ 21550000
*DCL 1 SJBYQNME,                    /* Byte to retrieve bit into     */ 21600000
*     3 *        BIT(7),                                                21650000
*     3 SJBIQNME BIT(1);            /* QNAME indicator               */ 21700000
*DCL SJKYGDG BIT(16) CONSTANT('8515'X);  /* GDG                  @D3C*/ 21716600
*DCL 1 SJBYGDG,                    /* Byte to retrieve bit into  @D3A*/ 21733200
*/* Bit masks for GDG field                                      @D3A*/ 21749800
*     3 *        BIT(6),           /*                            @D3A*/ 21766400
*     3 SJBIGDG  BIT(1),           /* GDG indicator              @D3A*/ 21783000
*     3 *        BIT(1);           /*                            @D3A*/ 21799600
*DCL SJKYELNM BIT(16) CONSTANT('8516'X); /* ELEMENT NAME/RELATIVE GDG   21816200
*                                           NUMBER               @D3C*/ 21832800
*DCL SJKYRKP  BIT(16) CONSTANT('8517'X); /* RKP                      */ 21850000
*DCL SJKYDSEQ BIT(16) CONSTANT('8518'X); /* Dataset Seq. Number  @L4A*/ 21859300
*DCL SJKYLTYP BIT(16) CONSTANT('8519'X); /* Label Type           @L4A*/ 21899600
*/* Bit masks for the LABEL Type Field                           @L4A*/ 21939900
*DCL  SJBIAUL  BIT(8) CONSTANT('48'X); /* AUL                    @L4A*/ 21980200
*DCL  SJBIAL   BIT(8) CONSTANT('40'X); /* AL                     @L4A*/ 21982500
*DCL  SJBILTM  BIT(8) CONSTANT('21'X); /* LTM                    @P5C*/ 21984800
*DCL  SJBIBLP  BIT(8) CONSTANT('10'X); /* BLP                    @L4A*/ 21987100
*DCL  SJBISUL  BIT(8) CONSTANT('0A'X); /* SUL                    @L4A*/ 21989500
*DCL  SJBINSL  BIT(8) CONSTANT('04'X); /* NSL                    @L4A*/ 21992100
*DCL  SJBISL   BIT(8) CONSTANT('02'X); /* SL                     @L4A*/ 21994700
*DCL  SJBINL   BIT(8) CONSTANT('01'X); /* NL                     @L4A*/ 21997300
*DCL SJKYOUTL BIT(16) CONSTANT('851A'X); /* OUTLIM                   */ 22000000
*/*           851B unused                                        @D1C*/ 22050000
*DCL SJKYDEN  BIT(16) CONSTANT('851B'X);/* Density keyword       @L4A*/ 22056200
*/* Choice values for the first parameter.                       @L4A*/ 22062400
*DCL SJVL200  BIT(8) CONSTANT('03'X); /* 7 track 200 BPI         @L4A*/ 22068600
*DCL SJVL556  BIT(8) CONSTANT('43'X); /* 7 track 556 BPI         @L4A*/ 22074800
*DCL SJVL800  BIT(8) CONSTANT('83'X); /* 7 and 9 track 800 BPI   @L4A*/ 22081000
*DCL SJVL1600 BIT(8) CONSTANT('C3'X); /* 9 track 1600 BPI        @L4A*/ 22087200
*DCL SJVL6250 BIT(8) CONSTANT('D3'X); /* 9 track 6250 BPI        @L4A*/ 22093400
*DCL SJKYRECF BIT(16) CONSTANT('851C'X); /* RECFM                    */ 22100000
*/* Bit masks for RECFM field                                        */ 22150000
*DCL 1 SJBYRECF,                      /* Byte to retrieve bits into  */ 22200000
*      3 SJBIFIXD BIT(1),             /* Fixed                       */ 22250000
*      3 SJBIVARI BIT(1),             /* Variable                    */ 22300000
*      3 SJBIASCI BIT(1),             /* Variable/track overflow     */ 22350000
*      3 SJBIBLOK BIT(1),             /* Blocked                     */ 22400000
*      3 SJBISPAN BIT(1),             /* Standard/Spanned            */ 22450000
*      3 SJBIASA  BIT(1),             /* ASA Control Characters      */ 22500000
*      3 SJBIMACH BIT(1),             /* Machine Control Characters  */ 22550000
*      3 *        BIT(1);                                               22600000
*DCL SJBIUNDF BIT(8) CONSTANT('C0'X); /* Undefined format            */ 22650000
*DCL SJKYLREL BIT(16) CONSTANT('851D'X); /* LRECL                    */ 22700000
*DCL SJKYKEYL BIT(16) CONSTANT('851E'X); /* KEYLEN                   */ 22750000
*DCL SJKYEXPD BIT(16) CONSTANT('851F'X); /* EXPDT                    */ 22800000
*DCL 1 SJBYEXPD BOUNDARY(WORD,2),   /* 3 Bytes to retrieve EXPDT into   22850000
*                                                                @L1A*/ 22900000
*      3 SJBYEXYY FIXED(8),         /* Year offset from 1900     @L1A*/ 22950000
*      3 SJBYEXDD FIXED(16);        /* Julian days (0-366)       @L1A*/ 23000000
*DCL SJKYTEMP BIT(16) CONSTANT('8520'X); /* TEMP                     */ 23050000
*/* Bit masks for TEMP field                                         */ 23100000
*DCL 1 SJBYTEMP,                    /* Byte to retrieve bit into     */ 23150000
*      3 *        BIT(7),                                               23200000
*      3 SJBITEMP BIT(1);           /* Temporary indicator           */ 23250000
*DCL SJKYDCBR BIT(16) CONSTANT('8521'X); /* DCBR                     */ 23300000
*DCL SJKYVSCT BIT(16) CONSTANT('8522'X); /* VOLUME SERIAL COUNT  @D1A*/ 23350000
*DCL SJKYVLC1 BIT(16) CONSTANT('8523'X); /* VOLUME COUNT - SIOT  @D1A*/ 23400000
*DCL SJKYVLC2 BIT(16) CONSTANT('8524'X); /* VOLUME COUNT - JFCB  @D1A*/ 23450000
*DCL SJKYUAFF BIT(16) CONSTANT('8525'X); /* UNIT=AFF             @D1A*/ 23500000
*/* Bit masks for UNIT=AFF keyword                               @D1A*/ 23550000
*DCL 1 SJBYDSAT,                    /* Byte to retrieve dataset  @D1A*/ 23600000
*                                   /* attributes into           @D1A*/ 23650000
*      3 * BIT(6),                  /*                           @D1A*/ 23700000
*      3 SJBIUAFF BIT(1),           /* UNIT=AFF indicator        @D1A*/ 23750000
*      3 * BIT(1);                  /*                           @D1A*/ 23800000
*DCL SJKYDSCB BIT(16) CONSTANT('8526'X); /* DSCB TTR             @D1A*/ 23850000
*DCL SJKYSGDS BIT(16) CONSTANT('8527'X); /* SGDS (system generated data 23900000
*                                           set name) indicator  @D1A*/ 23950000
*/* Bit masks for SGDS field                                     @D1A*/ 24000000
*DCL 1 SJBYSGDS,                         /* Byte to retrieve bit into   24050000
*                                                                @D1A*/ 24100000
*      3 *        BIT(3),                                               24150000
*      3 SJBISGDS BIT(1),                /* SGDS indicator       @D1A*/ 24200000
*      3 *        BIT(4);                                               24250000
*DCL SJKYUNCT BIT(16) CONSTANT('8528'X); /* UNIT Count field     @P1A*/ 24275000
*DCL SJKYCOMP BIT(16) CONSTANT('8529'X); /* TRTCH                @P5C*/ 24278100
*/*  Constants for TRTCH data.                                   @P5C*/ 24281200
*/*  Only the values for compaction and non-compaction are       @P5C*/ 24284300
*/*  supplied because these are the only values that SMS needs   @P5C*/ 24287400
*/*  to check for and make updates for.                          @P5C*/ 24290500
*DCL SJBICOMP BIT(8) CONSTANT('08'X); /* Compaction              @P5C*/ 24293600
*DCL SJBINCMP BIT(8) CONSTANT('04'X); /* No compaction           @P5C*/ 24296700
*DCL SJKYTDSI BIT(16) CONSTANT('852A'X); /* TDSI                 @L5A*/ 24298100
*/*Constants for Track recording technique (first nibble of TDSI)@L5A*/ 24299500
*DCL SJVLOREC BIT(4) CONSTANT('0'X); /* Recording technology            24300900
*                                       unknown or unspecified   @L5A*/ 24302300
*DCL SJVL18TK BIT(4) CONSTANT('1'X); /* 18 track recording mode  @L5A*/ 24303700
*DCL SJVL36TK BIT(4) CONSTANT('2'X); /* 36 track recording mode  @P7C*/ 24305100
*/* Constants defined for Media Type  (second nibble of TDSI)    @L5A*/ 24306500
*DCL SJVLOMED BIT(4) CONSTANT('0'X); /* Media type unknown or           24307900
*                                       unspecified              @L5A*/ 24309300
*DCL SJVLMED1 BIT(4) CONSTANT('1'X); /* Cartridge System Tape    @L5A*/ 24310700
*DCL SJVLMED2 BIT(4) CONSTANT('2'X); /* Enhanced Capacity Cartridge     24312100
*                                       System Tape              @L5A*/ 24313500
*/* Constants defined for Compaction Type (third nibble of TDSI) @L5A*/ 24314900
*DCL SJVLMPNS BIT(4) CONSTANT('0'X); /* Compaction type unknown or      24316300
*                                       not specified            @L5A*/ 24317700
*DCL SJVLNOCP BIT(4) CONSTANT('1'X); /* Compaction not used      @L5A*/ 24319100
*DCL SJVLIDRC BIT(4) CONSTANT('2'X); /* Compaction type=IDRC     @L5A*/ 24320500
*/* Constants for Special Attributes (fourth nibble of TDSI)     @L5A*/ 24321900
*DCL SJVLOSPC BIT(4) CONSTANT('0'X); /* Volume has no special           24323300
*                                        attributes              @L5A*/ 24324700
*DCL SJVLDCOM BIT(4) CONSTANT('1'X); /* Read compatibility attribute.   24326100
*                                       When set, it indicates that     24327500
*                                       the volumes will be used for    24328900
*                                       input only and read compatible  24330300
*                                       devices can be added to the     24331700
*                                       device eligibility.      @L5A*/ 24333100
*DCL SJKYAIND BIT(16) CONSTANT('852B'X); /* IN/OUT Indicator on         24334500
*                                       label keyword            @L5A*/ 24335900
*DCL 1 SJBYAIND,                     /* Byte to retrieve IN/OUT data    24337300
*                                       into                     @L5A*/ 24338700
*       3 SJBIINSP BIT(1),           /* If this bit is on, then IN      24340100
*                                       was specified            @L5A*/ 24341500
*       3 SJBIOUTS BIT(1),           /* If this bit is on, then OUT     24342900
*                                       was specified            @L5A*/ 24344300
*       3 *        BIT(6);           /* Reserved - data not pertinent   24345700
*                                       to this key              @L5A*/ 24347100
*DCL SJKYRETP BIT(16) CONSTANT('852C'X); /* Expiration date derived     24347500
*                                          from retention period @01A*/ 24347900
*DCL SJKYRESL BIT(16) CONSTANT('852D'X); /*                      @L7A*/ 24348100
*/* Bit masks for the SMS VOLREF to be resolved flag             @L7A*/ 24348300
*DCL 1 SJBYRESL,                    /*                           @L7A*/ 24348500
*      3 *        BIT(5),           /*                           @L7A*/ 24348700
*      3 SJBIRESL BIT(1),           /*                           @L7A*/ 24348900
*      3 *        BIT(2);           /*                           @L7A*/ 24349100
*                                                                       24353300
*DCL SJKYBLKS BIT(16) CONSTANT('852E'X); /*                      @LCA*/ 24357500
*/* Doubleword to retrieve Blocksize into                        @LCA*/ 24361700
*DCL SJBYBLKS CHAR(8);              /* Blocksize field           @LCA*/ 24365900
*                                                                       24370100
*DCL SJKYUNAF BIT(16) CONSTANT('852F'X); /* Affed-to DD Token           24374300
*                                      (UNIT=AFF=DDx)            @LDA*/ 24378500
*DCL SJKYSMSV BIT(16) CONSTANT('8530'X); /* Duplicate volume bit        24379500
*                                           in SIOT              @05A*/ 24380500
*/* Bit mask  for the Duplicate Volume indicator for JES3        @05A*/ 24381500
*DCL 1 SJBYDUPV,                    /*                           @05A*/ 24382500
*      3 *        BIT(6),           /*                           @05A*/ 24383500
*      3 SJBIDUPV BIT(1),           /* Duplicate Volume indicator@05A*/ 24384500
*      3 *        BIT(1);           /*                           @05A*/ 24385500
*                                                                       24388500
*                                                                       24389500
*/********************************************************************/ 24391100
*/*                                                                  */ 24395300
*/*          KEY CONSTANTS FOR 'EXEC'                                */ 24400000
*/*                                                                  */ 24450000
*/********************************************************************/ 24500000
*DCL SJVBEXEC CHAR(8) CONSTANT('EXEC    ');                             24550000
*DCL SJKYPGMN BIT(16) CONSTANT('8900'X); /* Program Name             */ 24600000
*DCL SJKYSACT BIT(16) CONSTANT('8901'X); /* Step Accounting info     */ 24650000
*DCL SJKYSTPN BIT(16) CONSTANT('8902'X); /* Stepname             @D1A*/ 24700000
*DCL SJKYSACS BIT(16) CONSTANT('8903'X); /* Step Accounting sub         24716600
*                                           parameters           @D6A*/ 24733200
*DCL SJKYSCCS BIT(16) CONSTANT('0001'X); /* STEP CCSID           @04A*/ 24738800
*DCL SJKYSRTO BIT(16) CONSTANT('0002'X); /* STEP RLSTMOUT        @04A*/ 24744400
*/********************************************************************/ 24750000
*/*                                                                  */ 24800000
*/*          KEY CONSTANTS FOR 'JOB'                                 */ 24850000
*/*                                                                  */ 24900000
*/********************************************************************/ 24950000
*DCL SJVBJOB CHAR(8) CONSTANT('JOB     ');                              25000000
*DCL SJKYJNME BIT(16) CONSTANT('8700'X); /* JOBNAME                  */ 25050000
*DCL SJKYJACT BIT(16) CONSTANT('8701'X); /* Job Accounting info      */ 25100000
*DCL SJKYJACS BIT(16) CONSTANT('8702'X); /* Job Accounting Sub          25150000
*                                           parameters           @D6A*/ 25200000
*DCL SJKYJBYT BIT(16) CONSTANT('0002'X); /* BYTES (Max count)    @P3C*/ 25250000
*DCL SJKYJBY2 BIT(16) CONSTANT('0003'X); /* BYTES (Disposition)  @P3C*/ 25300000
*DCL SJKYJCRD BIT(16) CONSTANT('0004'X); /* CARDS (Max count)    @P3C*/ 25350000
*DCL SJKYJCR2 BIT(16) CONSTANT('0005'X); /* CARDS (Disposition)  @P3C*/ 25400000
*DCL SJKYJPAG BIT(16) CONSTANT('0006'X); /* PAGES (Max count)    @P3C*/ 25450000
*DCL SJKYJPA2 BIT(16) CONSTANT('0007'X); /* PAGES (Disposition)  @P3C*/ 25500000
*DCL SJKYJLIN BIT(16) CONSTANT('0008'X); /* LINES (Max count)    @P3C*/ 25550000
*DCL SJKYJLI2 BIT(16) CONSTANT('0009'X); /* LINES (Disposition)  @P3C*/ 25600000
*DCL SJKYJENV BIT(16) CONSTANT('000A'X); /* SCHENV               @LBA*/ 25625000
*DCL SJKYJCCS BIT(16) CONSTANT('000B'X); /* JOB CCSID            @04A*/ 25637500
*/*   Values for BYTES, CARDS, PAGES and LINES disposition       @L3A*/ 25650000
*DCL SKVLCANC BIT(8)  CONSTANT('10'X);   /* CANCEL               @L3A*/ 25700000
*DCL SKVLDUMP BIT(8)  CONSTANT('20'X);   /* DUMP                 @L3A*/ 25750000
*DCL SKVLWARN BIT(8)  CONSTANT('40'X);   /* WARNING              @L3A*/ 25800000
*DCL SJKYMSGC BIT(16) CONSTANT('8703'X); /* Job Msgclass Information    25850000
*                                                                @P4A*/ 25900000
