* %GOTO SSENCMT;                    /*                         @ZA34144 00050000
         MACRO                                                 @ZA34144 00100000
         IEFSSEN                                                        00150000
.*/ %SSENCMT:;                      /*                       @ZA34144*/ 00200000
*/********************************************************************/ 00250000
*/*  MACRO NAME =       IEFSSEN                              @ZA34144*/ 00300000
*/*  DESCRIPTIVE NAME = END OF MEMORY (EOM) FUNCTION         @ZA34144*/ 00350000
*/*  STATUS =           SPLITOUT FROM IEFJSSOB               @ZA34144*/ 00400000
*/*  ACCESS METHOD =    INVOKED VIA IEFJSSOB MACRO           @ZA34144*/ 00450000
*/*  COPYRIGHT =                                             @ZA34144*/ 00500000
*/********************************************************************/ 00550000
*   %GOTO SSENPLS;                   /*                        @ZA34144 00600000
*                                                                       00650000
SSOBEOM  EQU   8                  EOM FUNCTION ID (SSOBFUNC)            00700000
*                                                                       00750000
*  EOM RETURN CODES (SSOBRETN)                                          00800000
*                                                                       00850000
*    NO EOM RETURN CODES CURRENTLY DEFINED                              00900000
*                                                                       00950000
         ORG   SSOBGN                                                   01000000
SSENBGN  EQU   *                                                        01050000
SSENLEN  DC    AL2(SSENSIZE)      EOM EXTENSION LENGTH                  01100000
SSENRESV DS    H                  RESERVED                              01150000
SSENASID DS    H                  ASID OF TERMINATING MEMORY            01200000
SSENFLAG DS    B                  END OF MEMORY FLAGS                   01250000
SSENTYPE EQU   X'80'              ON - ABNORMAL MEMORY TERMINATION      01300000
*                                 OFF- NORMAL MEMORY TERMINATION        01350000
SSENRSV1 DS    X                  RESERVED                              01400000
SSENJBNM DS    A                  JOBNAME LIST POINTER - EACH JOBNAME   01450000
*                                 ENTRY IS 12 BYTES -                   01500000
*                                 1ST 4 BYTES - PTR TO NEXT JOBNAME     01550000
*                                     ENTRY (LAST ENTRY CONTAINS ZEROS  01600000
*                                     IN 1ST 4 BYTES)                   01650000
*                                 LAST 8 BYTES - JOBNAME ASSOCIATED     01700000
*                                     WITH TERMINATING MEMORY           01750000
SSENASCB DS    A                  ASCB ADDRESS OF TERMINATING MEMORY    01800000
*                                                                       01850000
SSENSIZE EQU   *-SSENBGN          EOM EXTENSION LENGTH                  01900000
SSOBLEN5 EQU   SSOBHSIZ+SSENSIZE  TOTAL SSOB LENGTH                     01950000
         MEND                                                @ZA34144*/ 02000000
* %SSENPLS:;                            /*                   @ZA34144*/ 02050000
*  DCL SSOBEOM  FIXED(15) CONSTANT(08); /* EOM FUNCTION ID (SSOBFUNC)*/ 02100000
*   /*                                                               */ 02150000
*   /*  EOM RETURN CODES (SSOBRETN)                                  */ 02200000
* /*                                                                 */ 02250000
* /*    NO EOM RETURN CODES CURRENTLY DEFINED                        */ 02300000
* /*                                                                 */ 02350000
*   /*       S S E N                                                 */ 02400000
*  DECLARE                                                              02450000
*   1       SSEN          SSOBEN,                                       02500000
*     2       SSENLEN     FIXED(15),/* LENGTH OF SSEN                */ 02550000
*     2       *           FIXED(15),/* RESERVED                      */ 02600000
*     2       SSENASID    FIXED(15),/* ASID OF TERMINATING MEMORY    */ 02650000
*     2       SSENFLAG    BIT(8),   /* END OF MEMORY FLAGS           */ 02700000
*       3       SSENTYPE  BIT(1),   /* ON - ABNORMAL MEMORY TERMINATION 02750000
*                                      OFF- NORMAL MEMORY TERMINATION*/ 02800000
*       3       *         BIT(7),   /* RESERVED FLAGS                */ 02850000
*     2       *           PTR(8),   /* RESERVED                      */ 02900000
*     2       SSENJBNM    PTR(31),  /* JOBNAME LIST POINTER - EACH      02950000
*                                      JOBNAME ENTRY IS 12 BYTES -      03000000
*                                      1ST 4 BYTES -PTR TO NEXT         03050000
*                                         JOBNAME ENTRY (LAST ENTRY     03100000
*                                         CONTAINS ZEROS IN 1ST 4       03150000
*                                         BYTES)                        03200000
*                                      LAST 8 BYTES -JOBNAME ASSOCIATED 03250000
*                                         WITH TERMINATING MEMORY    */ 03300000
*     2       SSENASCB    PTR(31);  /* ASCB ADDRESS OF TERMINATING      03350000
*                                       MEMORY                       */ 03400000
