*  %GOTO VTSPRO;                         /*                             00050000
       MACRO                                                            00100000
       IEFVTSPL &DSECT=YES                                              00150000
.*/ %VTSPRO: ;                                                          00200000
*/********START OF SPECIFICATIONS********************************@L1C*/ 00250000
*/*                                                                  */ 00300000
*/* MACRO NAME = IEFVTSPL                                        @L1C*/ 00325000
*/*                                                                  */ 00350000
*/*   ACRONYM = VTSPL                                            @L1A*/ 00375000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME =                                               */ 00433300
*/*        Subsystem Vector Table Service Parameter List             */ 00466600
*/*                                                                  */ 00500000
*/*01* PROPRIETARY STATEMENT=                                        */ 00522200
*/***PROPRIETARY_STATEMENT********************************************/ 00544400
*/*                                                                  */ 00566600
*/*                                                                  */ 00588800
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00611000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00633200
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1982, 1994                      */ 00655400
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00677600
*/*                                                                  */ 00700000
*/* STATUS= HBB5520                                                  */ 00750000
*/*                                                                  */ 00800000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00816600
*/*                                                                  */ 00833200
*/* FUNCTION = Maps the input to subsystem vector table service      */ 00862400
*/*            routine IEFJSVEC.  IEFJSVEC has been superseded   @L2C*/ 00891600
*/*            for external use by the IEFSSVT macro.            @L2A*/ 00920800
*/*                                                                  */ 00950000
*/*01* EXTERNAL CLASSIFICATION: DMTI                             @L2C*/ 00970800
*/*01* END OF EXTERNAL CLASSIFICATION:                           @P2A*/ 00991600
*/*                                                                  */ 01012500
*/* NOTES = IEFJSVEC is no longer the intended interface for     @L2C*/ 01020000
*/*         managing subsystem vector tables.  Vector tables     @L2A*/ 01027500
*/*         should be created and managed through the IEFSSVT    @L2A*/ 01035000
*/*         macro.                                               @L2A*/ 01042500
*/*                                                                  */ 01050000
*/* INVOCATION =                                                     */ 01100000
*/*                                                                  */ 01150000
*/*   BAL - IEFVTSPL DSECT=YES OR NO                                 */ 01200000
*/*         DSECT=YES IS THE DEFAULT                                 */ 01250000
*/*                                                                  */ 01300000
*/*   PL/S - %DCL VTSATRB CHAR                                       */ 01350000
*/*          %VTSATRB = 'BASED' OR 'BDY(WORD)' OR ''                 */ 01400000
*/*          %INCLUDE SYSLIB(IEFVTSPL)                               */ 01450000
*/*                                                                  */ 01452200
*/*    DSECT NAME = VTSPL                                        @L1A*/ 01454400
*/*                                                                  */ 01456600
*/*    COMPONENT = Subsystem Interface (SC1B6)                   @L1A*/ 01458800
*/*                                                                  */ 01461000
*/*    EYE-CATCHER = VTSP                                        @P2C*/ 01463200
*/*     OFFSET = 0                                                   */ 01465400
*/*     LENGTH = 4                                                   */ 01467600
*/*                                                                  */ 01469800
*/*    CREATED BY = Caller of IEFJSVEC                           @L1A*/ 01472000
*/*                                                                  */ 01474200
*/*    POINTED TO BY = Caller sets up register 1 pointing to     @L1A*/ 01476400
*/*                 a word which points to IEFVTSPL.             @L1A*/ 01478600
*/*                                                                  */ 01480800
*/*    SERIALIZATION = None                                      @L1A*/ 01483000
*/*                                                                  */ 01485200
*/*    STORAGE ATTRIBUTES =                                          */ 01487400
*/*                                                                  */ 01489600
*/*      SUBPOOL           = ANY                                 @L1A*/ 01491800
*/*      KEY               = Caller's Key                        @L1A*/ 01494000
*/*      SIZE              = 52 bytes                            @L1A*/ 01496200
*/*                                                                  */ 01500000
*/* CHANGE ACTIVITY = L0,L1                                      @L1C*/ 01550000
*/* We are no longer updating the above 'Change Activity' field  @P1A*/ 01566600
*/*                                                                  */ 01583200
*/* $L0= SSVT    JBB2110 820702 PD2Q: SUBSYSTEM VECTOR TABLE SUPPORT */ 01600000
*/* $L1= CID4B   HBB4430 911104 PDPS: 4 Byte Console ID and CART @L1A*/ 01625000
*/* $P1= PKB0577 HBB4430 920430 PDPS: Changed prolog comments    @P1A*/ 01637500
*/* $P2= PIG1423 HBB5510 930715 PDBN: SHOWHDR format complete    @P2A*/ 01643700
*/* $L2= SSIDP   HBB5520 940414 PDBN: Dynamic SSI                @L2A*/ 01646800
*/* $01= OW17381 HBB5520 941211 PDLS: Dynamic SSI - new RCODE    @01A*/ 01648400
*/*                                                                  */ 01650000
*/********END OF SPECIFICATIONS**********************************@L1C*/ 01700000
*/* A 000000-999999                                              @L0A*/ 01750000
*/* A - Added 4 byte Console ID and CART fields                  @L1A*/ 01775000
*/* C - Changed function description in prolog and added notes       */ 01783300
*/*     section with CDPI classification.                        @P1A*/ 01791600
*/* C - Updated CDPI classification information to comply with       */ 01793700
*/*     new SHOWHDR requirements.                                @P2A*/ 01795800
*/* A - Defined new return code VTSSIVT                          @L2A*/ 01796300
*/* C - Documented that IEFSSVT is the intended interface for        */ 01796800
*/*     managing subsystem vector tables                         @L2A*/ 01797300
*/* A - Defined new return code VTSNOSUB                         @01A*/ 01797600
*/********************************************************************/ 01797900
*  %GOTO VTSPLS;                 /*                                     01800000
*                                                                       01850000
* SUBSYSTEM VECTOR TABLE SERVICE ROUTINE RETURN CODES                   01900000
*                                                                       01950000
VTSSUCES  EQU 0                      SUCCESSFUL                         02000000
VTSINVID  EQU 4                      INVALID IDENTIFIER IN VTSPL OR     02050000
*                                    JSBVT                              02100000
VTSINVIN  EQU 8                      INVALID INPUT (SUBSYTEM NAME       02150000
*                                    SPECIFIED INCORRECTLY)             02200000
VTSGETFL  EQU 12                     GETMAIN FOR VECTOR TABLE FAILED    02250000
VTSLOGER  EQU 16                     LOGIC ERROR                        02300000
VTSLOADF  EQU 20                     LOAD FOR A FUNCTION ROUTINE        02350000
*                                    ABENDED                            02400000
VTSINVBI  EQU 24                     INVALID BIT SETTING IN             02450000
*                                    REQUEST FLAGS                      02500000
VTSINVCR  EQU 28                     UNABLE TO PROCESS CREATE           02550000
*                                    REQUEST, SSVT ALREADY EXISTS       02600000
VTSINVED  EQU 32                     UNABLE TO PROCESS DISABLE OR       02650000
*                                    ENABLE FUNCTION, NO SSVT           02700000
VTSNOSPA  EQU 36                     INSUFFICIENT SSVT SPACE FOR        02750000
*                                    ADDITIONAL FUNCTION ROUTINE        02800000
*                                    ADDRESSES                          02850000
VTSSIVT   EQU 40                     Target vector table is            +02860000
                                       SSI-managed and can only be     +02870000
                                       updated through the IEFSSVT     +02880000
                                       macro                       @L2A 02890000
VTSNOSUB  EQU 44                     Target Subsystem does not         +02893300
                                       exist.                      @01A 02896600
*                                                                       02900000
* SUBSYSTEM VECTOR TABLE SERVICE ROUTINE PARAMETER LIST                 02950000
*                                                                       03000000
          AIF   ('&DSECT' EQ 'NO').VTS01                                03050000
VTSPL     DSECT                                                         03100000
          AGO   .VTS02                                                  03150000
.VTS01    ANOP                                                          03200000
VTSPL     DS  0F                     VECTOR TABLE SERVICE PARM LIST     03250000
.VTS02    ANOP                                                          03300000
VTSID     DS  CL4                    IDENTIFIER 'VTSP'                  03350000
VTSLEN    DS  H                      LENGTH OF PARAMETER LIST           03400000
VTSVER    DS  X                      VERSION OF PARAMETER LIST          03450000
VTSCONID  DS  X                      CONSOLE ID                         03500000
VTSFLGS   DS  X                      FLAGS                              03550000
VTSGLOAD  EQU X'80'                  LOAD TO GLOBAL INDICATOR           03600000
VTSREQ    DS  X                      REQUEST FLAGS                      03650000
VTSCREAT  EQU X'80'                  CREATE NEW SSVT                    03700000
VTSFCDIS  EQU X'40'                  DISABLE SELECTED FUNCTION          03750000
*                                    CODES OF EXISTING SSVT             03800000
VTSFCEN   EQU X'20'                  ENABLE SELECTED FUNCTION           03850000
*                                    CODES OF EXISTING SSVT             03900000
VTSRSV1   DS  CL2                    RESERVED                           03950000
VTSNME    DS  CL4                    SUBSYSTEM NAME                     04000000
VTSSVTD   DS  F                      ADDRESS OF SSVT TABLE DATA         04050000
VTSSVTAD  DS  F                      ADDRESS OF SSVT (RETURNED)         04100000
VTSSSCVT  DS  F                      ADDRESS OF SSCVT (RETURNED)        04150000
VTSFUNCT  DS  CL8                    FUNCTION ROUTINE NAME BEING        04200000
*                                    PROCESSED WHEN AN ERROR            04250000
*                                    OCCURRED                           04300000
VTSCNSID  DS  F                      4 Byte Console ID           @L1A   04316600
VTSCART   DS  CL8                    Command And Response Token  @L1A   04324900
VTSRSV2   DS  CL4                    Reserved                    @L1A   04333200
VTSSIZE   EQU *-VTSPL                LENGTH OF PARAMETER LIST           04350000
VTSCID    EQU C'VTSP'                Identifier                  @L1A   04366600
VTSCVER   EQU 2                      Current version number      @L1C   04383300
          MEND                                                          04450000
.*/ %VTSPLS: ;                                                          04500000
*/********************************************************************/ 04550000
*/*                                                                  */ 04600000
*/* SUBSYSTEM VECTOR TABLE SERVICE ROUTINE RETURN CODES              */ 04650000
*/*                                                                  */ 04700000
*/********************************************************************/ 04750000
* DCL VTSSUCES FIXED(8) CONSTANT(0),/* SUCCESSFUL                    */ 04800000
*     VTSINVID FIXED(8) CONSTANT(4),/* INVALID IDENTIFIER IN VTSPL OR   04850000
*                                      JSBVT                         */ 04900000
*     VTSINVIN FIXED(8) CONSTANT(8),/* INVALID INPUT (SUBSYSTEM NAME    04950000
*                                      SPECIFIED INCORRECTLY)        */ 05000000
*     VTSGETFL FIXED(8) CONSTANT(12),/*GETMAIN FOR VECTOR TABLE         05050000
*                                      FAILED                        */ 05100000
*     VTSLOGER FIXED(8) CONSTANT(16),/* LOGIC ERROR                  */ 05150000
*     VTSLOADF FIXED(8) CONSTANT(20),/* LOAD FOR A FUNCTION ROUTINE     05200000
*                                       ABENDED                      */ 05250000
*     VTSINVBI FIXED(8) CONSTANT(24),/* INVALID BIT SETTING IN          05300000
*                                       REQUEST FLAGS                */ 05350000
*     VTSINVCR FIXED(8) CONSTANT(28),/* UNABLE TO PROCESS CREATE        05400000
*                                   REQUEST, SSVT ALREADY EXISTS     */ 05450000
*     VTSINVED FIXED(8) CONSTANT(32),/* UNABLE TO PROCESS DISABLE OR    05500000
*                                       ENABLE FUNCTION, NO SSVT     */ 05550000
*     VTSNOSPA FIXED(8) CONSTANT(36),/* INSUFFICIENT SSVT SPACE FOR     05600000
*                                       ADDITIONAL FUNCTION ROUTINE     05650000
*                                       ADDRESSES                @L2C*/ 05666600
*     VTSSIVT  FIXED(8) CONSTANT(40),/* Target vector table is          05683200
*                                       SSI-managed and can only be     05699800
*                                       updated through the             05716400
*                                       IEFSSVT macro            @L2A*/ 05733000
*     VTSNOSUB FIXED(8) CONSTANT(44);/* Target Subsystem does not       05738600
*                                       exist.                   @01A*/ 05744200
*/********************************************************************/ 05750000
*/*                                                                  */ 05800000
*/* SUBSYSTEM VECTOR TABLE SERVICE ROUTINE PARAMETER LIST            */ 05850000
*/*                                                                  */ 05900000
*/********************************************************************/ 05950000
* DCL 1 VTSPL VTSATRB,             /* VECTOR TABLE SERVICE PARM LIST */ 06000000
*       2 VTSID CHAR(4),           /* IDENTIFIER 'VTSP'              */ 06050000
*       2 VTSLEN FIXED(15),        /* LENGTH OF PARAMETER LIST       */ 06100000
*       2 VTSVER FIXED(8),         /* VERSION OF PARAMETER LIST      */ 06150000
*       2 VTSCONID FIXED(8),       /* CONSOLE ID                     */ 06200000
*       2 VTSFLGS BIT(8),          /* FLAGS                          */ 06250000
*         3 VTSGLOAD BIT(1),       /* LOAD TO GLOBAL INDICATOR       */ 06300000
*         3 * BIT(7),              /* RESERVED                       */ 06350000
*       2 VTSREQ  BIT(8),          /* REQUEST FLAGS                  */ 06400000
*         3 VTSCREAT BIT(1),       /* CREATE NEW SSVT                */ 06450000
*         3 VTSFCDIS BIT(1),       /* DISABLE SELECTED FUNCTION CODES   06500000
*                                     IN EXISTING SSVT               */ 06550000
*         3 VTSFCEN  BIT(1),       /* ENABLE SELECTED FUNCTION CODES    06600000
*                                     IN EXISTING SSVT               */ 06650000
*         3 * BIT(5),              /* RESERVED                       */ 06700000
*       2 VTSRSV1 CHAR(2),         /* RESERVED                       */ 06750000
*       2 VTSNME CHAR(4),          /* SUBSYSTEM NAME                 */ 06800000
*       2 VTSSVTD PTR(31),         /* ADDRESS OF SSVT TABLE DATA     */ 06850000
*       2 VTSSVTAD PTR(31),        /* ADDRESS OF SSVT (RETURNED)     */ 06900000
*       2 VTSSSCVT PTR(31),        /* ADDRESS OF SSCVT (RETURNED)    */ 06950000
*       2 VTSFUNCT CHAR(8),        /* FUNCTION ROUTINE NAME BEING       07000000
*                                     PROCESSED WHEN AN ERROR OCCURRED  07050000
*                                                                    */ 07100000
*       2 VTSCNSID FIXED(32),      /* 4 Byte Console ID          @L1A*/ 07110000
*       2 VTSCART  CHAR(8),        /* Command And Response Token @L1A*/ 07120000
*       2 VTSRSV2  CHAR(4);        /* Reserved                   @L1A*/ 07130000
*                                                                       07140000
*                                                                       07150000
* DCL VTSSIZE FIXED(15) CONSTANT(LENGTH(VTSPL)); /* Length of           07250000
*                                             parameter list     @L1A*/ 07300000
* DCL VTSCID CHAR(4) CONSTANT('VTSP');/* IDENTIFIER                  */ 07325000
* DCL VTSCVER FIXED(8) CONSTANT(2);/* Current version number     @L1C*/ 07350000
