*        %GOTO S99PLS1;               /*                                00050000
         MACRO                                                          00100000
         IEFZB4D0                                                       00150000
**/                                                                     00200000
*%S99PLS1: ;                                                            00250000
*/**START OF SPECIFICATIONS************************************* @L3C*/ 00276400
*/*                                                              @L3A*/ 00382000
*/*01* MACRO NAME: IEFZB4D0                                      @L3C*/ 00388600
*/*                                                              @L3A*/ 00395200
*/*01* ACRONYM:  S99PARMS                                        @L3A*/ 00401800
*/*                                                              @L3A*/ 00408400
*/*01* DESCRIPTIVE NAME:  Dynamic Allocation (SVC 99) Parameter  @L3C*/ 00415000
*/*                       List                                   @L3C*/ 00421600
*/*                                                              @L3A*/ 00428200
*/*01* PROPRIETARY STATEMENT=                                        */ 00434800
*/***PROPRIETARY_STATEMENT********************************************/ 00441400
*/*                                                                  */ 00448000
*/*                                                                  */ 00454600
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00461200
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00467800
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1974, 2000                      */ 00477700
*/*                                                                  */ 00487600
*/* STATUS= HBB7703                                                  */ 00494200
*/*                                                                  */ 00500800
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00507400
*/*                                                              @L3A*/ 00514000
*/*01* EXTERNAL CLASSIFICATION:                                  @L3A*/ 00540400
*/*02* GUPI:  BASE                                               @L3A*/ 00566800
*/*02* DMTI:  FIELDS S99EMSGP                                    @L3A*/ 00593200
*/*01* END OF EXTERNAL CLASSIFICATION:                           @L3A*/ 00619600
*/*                                                              @L3A*/ 00804400
*/*01* DSECT NAME: S99RB, S99RBP, S99TUPL, S99TUNIT, S99TUFLD,   @L3A*/ 00830800
*/*                S99RBX                                        @L3A*/ 00857200
*/*                                                              @L3A*/ 00883600
*/*01* COMPONENT:  Allocation (SC1B4)                            @L3A*/ 00910000
*/*                                                              @L3A*/ 00936400
*/*01* EYE-CATCHER:  None                                        @L3A*/ 00962800
*/*02*  OFFSET:  n/a                                             @L3A*/ 00989200
*/*02*  LENGTH:  n/a                                             @L3A*/ 01015600
*/*                                                              @L3A*/ 01042000
*/*01* STORAGE ATTRIBUTES:                                       @L3A*/ 01068400
*/*02*  SUBPOOL:  User defined                                   @L3A*/ 01094800
*/*02*  KEY:  User's key                                         @L3A*/ 01121200
*/*02*  RESIDENCY:  Any                                          @L3A*/ 01147600
*/*02*  MAIN STORAGE:  No                                        @L3A*/ 01174000
*/*                                                              @L3A*/ 01200400
*/*01* SIZE:  S99RB:  24 bytes                                   @L3A*/ 01218000
*/*           S99RBX: 36 bytes                                   @L3A*/ 01235600
*/*                                                              @L3A*/ 01253200
*/*01* CREATED BY: Callers of dynamic allocation                 @L3A*/ 01279600
*/*                                                              @L3A*/ 01306000
*/*01* POINTED TO BY: Register 1 points to a pointer to this     @L3A*/ 01332400
*/*                   parameter list upon entry to SVC 99.       @L3A*/ 01358800
*/*                                                              @L3A*/ 01385200
*/*01* SERIALIZATION: None                                       @L3A*/ 01411600
*/*                                                              @L3A*/ 01438000
*/*01* FUNCTION: Input required by dynamic allocation,           @L3C*/ 01464400
*/*              specifically the dynamic allocation control     @L3C*/ 01490800
*/*              routine, IEFDB400.                              @L3C*/ 01517200
*/*                                                              @L3A*/ 01543600
*/*01* METHOD OF ACCESS =                                        @L3A*/ 01570000
*/*                                                              @L3A*/ 01596400
*/*  02* PL/AS INVOCATION =                                      @L3A*/ 01622800
*/*        %INCLUDE SYSLIB(IEFZB4D0)                             @L3A*/ 01649200
*/*                                                              @L3A*/ 01675600
*/*  02* BAL INVOCATION =                                        @L3A*/ 01702000
*/*                 IEFZB4D0                                     @L3A*/ 01728400
*/*                                                              @L3A*/ 01754800
*/*                                                              @L3A*/ 01781200
*/*01* DELETED BY: Callers of dynamic allocation                 @L3A*/ 01807600
*/*                                                              @L3A*/ 01834000
*/*01* DEPENDENCIES: None                                        @L3A*/ 01860400
*/*                                                              @L3A*/ 01886800
*/*01* DISTRIBUTION LIBRARY: SYS1.AMACLIB                        @L3A*/ 01913200
*/*                                                              @L3A*/ 01939600
*/*                                                                  */ 01966000
*/*                                                                  */ 01992400
*/* THE PARAMETER LIST CONSISTS OF:                                  */ 02018800
*/*                                                                  */ 02045200
*/* 1) A REQUEST BLOCK POINTER. THIS IS A FULLWORD CONTAINING THE    */ 02071600
*/*    ADDRESS OF THE DYNAMIC ALLOCATION REQUEST BLOCK. THE HIGH-    */ 02098000
*/*    ORDER BIT MUST BE ON. THIS WORD MUST BE LOCATED BY REG. ONE.  */ 02124400
*/*                                                                  */ 02150800
*/* 2) A REQUEST BLOCK. THIS BLOCK IS LOCATED BY THE REQUEST BLOCK   */ 02177200
*/*    POINTER AND CONTAINS:                                         */ 02203600
*/*    . A ONE BYTE FIELD CONTAINING THE LENGTH OF THIS REQUEST      */ 02230000
*/*      BLOCK. THE LENGTH IS IN BINARY AND HAS A VALUE OF 20.       */ 02256400
*/*    . A ONE BYTE FIELD CONTAINING A VERB CODE CORRESPONDING TO A  */ 02282800
*/*      DYNAMIC ALLOCATION FUNCTION. MNEMONIC NAMES FOR THE VERB    */ 02309200
*/*      CODES ARE CONTAINED IN THIS MACRO.                          */ 02335600
*/*    . TWO BYTES OF FLAGS WHICH MUST MAP DIRECTLY TO ALCFNCMAP     */ 02362000
*/*      (COMMON ALLOCATION FUNCTION MAP) IN IEFZB4D7.               */ 02388400
*/*    . TWO BYTES IN WHICH DYNAMIC ALLOCATION WILL RETURN AN ERROR  */ 02414800
*/*      REASON CODE.                                                */ 02441200
*/*    . TWO BYTES IN WHICH DYNAMIC ALLOCATION WILL RETURN AN        */ 02467600
*/*      INFORMATIONAL REASON CODE.                                  */ 02494000
*/*    . A FULLWORD CONTAINING THE ADDRESS OF A LIST OF POINTERS TO  */ 02520400
*/*      TEXT UNITS.                                                 */ 02546800
*/*    . A FULLWORD CONTAINING THE ADDRESS OF A REQUEST BLOCK    @L1C*/ 02573200
*/*      EXTENSION FOR MESSAGE PROCESSING OR ZERO.               @L1C*/ 02599600
*/*    . FOUR BYTES OF FLAGS FOR AUTHORIZED FUNCTIONS.               */ 02626000
*/*                                                                  */ 02652400
*/* 3) A LIST OF FULLWORDS CONTAINING THE ADDRESSES OF TEXT UNITS.   */ 02678800
*/*    A WORD WITH A VALUE OF ZERO IS IGNORED. THE LAST WORD IN THE  */ 02705200
*/*    LIST MUST HAVE THE HIGH ORDER BIT ON.                         */ 02731600
*/*                                                                  */ 02758000
*/* 4) TEXT UNITS. A TEXT UNIT CONSISTS OF:                          */ 02784400
*/*    . A TWO BYTE FIELD CONTAINING A KEY WHICH IDENTIFIES THE      */ 02810800
*/*      INFORMATION IN THIS TEXT UNIT. A TEXT UNIT HAVING A KEY     */ 02837200
*/*      WITH A VALUE OF ZERO IS IGNORED. THE MACRO IEFZB4D2 LISTS   */ 02863600
*/*      MNEMONIC NAMES FOR THE VALUES OF THE KEYS.                  */ 02890000
*/*    . A TWO BYTE FIELD WHICH CONTAINS THE NUMBER OF LENGTH/PARA-  */ 02916400
*/*      METER ENTRIES WHICH FOLLOW. A VALUE OF ZERO INDICATES NO    */ 02942800
*/*      ENTRIES FOLLOW.                                             */ 02969200
*/*    . A TWO BYTE FIELD WHICH CONTAINS THE LENGTH OF THE IMMED-    */ 02995600
*/*      IATELY FOLLOWING PARAMETER.                                 */ 03022000
*/*    . A PARAMETER.                                                */ 03048400
*/*                                                                  */ 03074800
*/* 5) A REQUEST BLOCK EXTENSION. THIS BLOCK IS LOCATED BY THE   @L1A*/ 03101200
*/*    POINTER (S99S99X) FOUND IN THE REQUEST BLOCK. IT IS       @L1A*/ 03127600
*/*    OPTIONAL AND CONTAINS:                                    @L1A*/ 03154000
*/*    . A SIX BYTE FIELD CONTAINING THE CONTROL BLOCK           @L1A*/ 03180400
*/*      IDENTIFIER 'S99RBX'.                                    @L1A*/ 03206800
*/*    . A ONE BYTE FIELD CONTAINING THE VERSION NUMBER.         @L1A*/ 03233200
*/*    . ONE BYTE OF FLAGS FOR MESSAGE PROCESSING OPTIONS        @L1A*/ 03259600
*/*    . A ONE BYTE FIELD CONTAINING THE SUBPOOL FOR MESSAGE     @L1A*/ 03286000
*/*      BLOCKS.                                                 @L1A*/ 03312400
*/*    . A ONE BYTE FIELD CONTAINING THE STORAGE KEY FOR         @L1A*/ 03338800
*/*      MESSAGE BLOCKS.                                         @L1A*/ 03365200
*/*    . A ONE BYTE FIELD CONTAINING THE SEVERITY LEVEL FOR      @L1A*/ 03391600
*/*      MESSAGE PROCESSING.                                     @L1A*/ 03418000
*/*    . A ONE BYTE FIELD CONTAINING THE NUMBER OF MESSAGE       @D1C*/ 03444400
*/*      BLOCKS RETURNED                                         @D1A*/ 03470800
*/*    . A FULLWORD CONTAINING THE ADDRESS OF CPPL.              @L1A*/ 03497200
*/*    . FOUR BYTES FOR MESSAGE SERVICE RETURN CODE.             @L1A*/ 03523600
*/*    . FOUR BYTES FOR PUTLINE/WTO RETURN CODE.                 @L1A*/ 03550000
*/*    . FOUR BYTES FOR MESSAGE BLOCK POINTER.                   @L1A*/ 03576400
*/*    . FOUR BYTES FOR INFORMATION RETRIEVAL RETURN CODE        @L1A*/ 03602800
*/*      (VERB 01 ONLY)                                          @L1A*/ 03629200
*/*    . FOUR BYTES FOR SMS ERROR REASON CODE.                   @02C*/ 03655600
*/*                                                                  */ 03682000
*/* CHANGE ACTIVITY:  OZ32641, OZ63125, L1, L2, D1               @D1C*/ 03708400
*/*                   OY27926, OY29243, T1, 01, 02               @02C*/ 03734800
*/*                                                                  */ 03761200
*/*The above section of the Change Activity is no longer updated @03A*/ 03787600
*/*                                                                  */ 03814000
*/* $L1= SMSSTG2 JBB2223 860523 PDM9: STOR MGMT SUBSYS STG2 SUP  @L1A*/ 03840400
*/* $L2= SMSSTG2 JBB2223 860820 PDV6: STOR MGMT SUBSYS STG2 SUP  @L2A*/ 03866800
*/* $D1= DC20061 JBB2223 871216 PDV6: ADD S99ENMSG FIELD         @D1A*/ 03893200
*/* $T1= OY26839 HBB3310 890831 PDE1: DD LIMIT SPE               @T1A*/ 03919600
*/* $01= OY42979 HBB4410 910419 PDCC: Allow message suppression  @01A*/ 03946000
*/* $02= OY32848 JBB2223 910101 PDHK: ADD SMS REASON CODE        @02A*/ 03972400
*/* $03= OY52645 HBB4410 911105 PDDU: Provide "do not recall         */ 03998800
*/*                                   migrated data set" option  @03A*/ 04025200
*/* $L3= UCBVP   HBB5520 940210 PDN1: Add S99ACUCB to enable         */ 04045000
*/*                                   requesting use of actual       */ 04064800
*/*                                   UCBs.                      @L3A*/ 04084600
*/* $L4= CLONE   HBB5520 940728 PDBN: System symbolics           @L4A*/ 04094500
*/* $P1= PN71391 HBB5520 940908 PDEM: Change S99ACUCB to         @P1A*/ 04097800
*/*                                   non-authorized             @P1A*/ 04101100
*/* $P2= PXD0099 HBB7703 991231 PDG5: Handle device allocated to @P2A*/ 04101900
*/*                                   ASID *UNKNOWN* during      @P2A*/ 04102700
*/*                                   VARY Offline. This change  @P2A*/ 04102900
*/*                                   is the result of multiple  @P2A*/ 04103100
*/*                                   customer system outage     @P2A*/ 04103300
*/*                                   PMRs.                      @P2A*/ 04103500
*/*                                                                  */ 04103700
*/*                                                                  */ 04104400
*/**END OF SPECIFICATIONS**************************************  @L3C*/ 04130800
*/* IEFZB4D0 - Added S99ASERR to S99FLG22 (Under S99FLAGS2 for       */ 04130900
*/*            authorized functions). When = 1, Unit Unallocation    */ 04131000
*/*            service IEFDB440 should ignore coupling facility      */ 04131100
*/*            READ and WRITE errors for the RELEASE function on an  */ 04131200
*/*            Autoswitchable device.                            @P2A*/ 04131300
*/*          - Changed S99FLG22 masks to recognize S99ASERR as a     */ 04131400
*/*            valid authorized flag (bit position X'08').       @P2A*/ 04131500
*/*          - Changed S99NOT22 to no longer flag bit position       */ 04131600
*/*            X'08' (now used for S99ASERR) as invalid.         @P2A*/ 04131700
*/* IEFZB4D0 - Changed SVC99 S99ACUCB bit from authorized to         */ 04131800
*/*            non-authorized.                                       */ 04132000
*/*          - Change S99FLG22 masks to remove the S99ACUCB          */ 04132600
*/*            flag.                                                 */ 04133200
*/*          - Change S99FLG12 masks so that the new non-authorized  */ 04133800
*/*            S99ACUCB flag can be recognized as a valid flag.  @P1A*/ 04134400
*/* IEFZB4D0 - Add a new SVC 99 input request bit S99NOSYM to        */ 04135200
*/*            indicate that Allocation should not resolve           */ 04139600
*/*            system symbolics.                                     */ 04144000
*/*          - Change S99FLG12 masks so that the new flag            */ 04148400
*/*            can be recognized as a valid flag.                @L4A*/ 04152800
*/* IEFZB4D0 - Add a new SVC 99 input request bit to indicate        */ 04157200
*/*            that actual UCBs should be utilized.                  */ 04183600
*/*          - Change S99FLG22 masks so that the new flag            */ 04210000
*/*            can be recognized as a valid flag.                @L3A*/ 04236400
*/* IEFZB4D0 - Add a new SVC 99 input request bit to indicate        */ 04262800
*/*            that no recall will be performed on migrated          */ 04289200
*/*            data sets.                                        @03A*/ 04315600
*/*          - Change S99FLG11 masks so that the new flag            */ 04342000
*/*            can be recognized as a valid flag.                @03A*/ 04368400
*/* IEFZB4D0 - ADD S99ERSN TO REQUEST BLOCK EXTENSION WHICH          */ 04394800
*/*            CONTAINS THE SMS REASON CODE.                     @02A*/ 04421200
*/* IEFZB4D0 - A - S99MSGL0 indicates that Allocation should act as if  04447600
*                  Allocation's MSGLEVEL was 0 for this Allocation      04474000
*                  only.  S99ERSVM is defined to allow checking         04500400
*                  of the Request Block Extension.               @01A*/ 04526800
*/* IEFZB4D0 - ADDED S99TIOEX IN S99FLG22                        @T1A*/ 04553200
*/* IEFZB4D0 - ADDED DECLARES FOR S99FLAGS BIT MASKS             @T1A*/ 04579600
*/* IEFZB4D0 - DELETED EQUATE FOR S99RBID                    @YD29243*/ 04606000
*/* IEFZB4D0 - ADDED EQUATE FOR S99RBID WHICH WAS MISSING    @YA27926*/ 04632400
*/* IEFZB4D0 - ADDED NUMBER OF MESSAGE BLOCKS FIELD (S99EMSG)    @D1A*/ 04658800
*/* IEFZB4D0 - ADDED A FLAG (S99EWTP) TO THE EXTENSION THAT             04685200
*              INDICATES A WTO IS TO BE USED FOR MESSAGE OUTPUT  @L2A*/ 04711600
*/* IEFZB4D0 - CHANGE SEVERITY LEVEL, SUBPOOL, STORAGE KEY, AND         04738000
*              MESSAGE PROCESSING RETURN CODES FROM CHAR(1) TO          04764400
*              FIXED(8).                                         @L2A*/ 04790800
*/* IEFZB4D0 - ADDED CONSTANTS FOR THE MESSAGE SEVERITIES        @L2A*/ 04817200
*/* IEFZB4D0 - CHANGED FOUR RESERVED BYTES IN SVC 99 REQUEST BLOCK   */ 04843600
*/*            TO POINTER TO SVC 99 REQUEST BLOCK EXTENSION      @L1A*/ 04870000
*/* IEFZB4D0 - DEFINE SVC 99 REQUEST BLOCK EXTENSION WHICH CONTAINS  */ 04896400
*/*            INFORMATION FOR MESSAGE PROCESSING                @L1A*/ 04922800
*        %GOTO S99PLS2;                /*                               04950000
*********************************************************************** 05000000
*                SVC 99 INPUT REQUEST BLOCK                             05050000
*********************************************************************** 05100000
S99RBP   DSECT                                                          05150000
S99RBPTR DS     F                      REQUEST BLOCK POINTER            05200000
S99RBPND EQU    X'80'                  LAST POINTER INDICATOR           05250000
S99RB    DSECT                         REQUEST BLOCK                    05300000
         DS     0F                                                      05350000
S99RBLN  DS     CL1                    LENGTH OF REQUEST BLOCK          05400000
S99VERB  DS     CL1                    VERB CODE                        05450000
S99VRBAL EQU    X'01'                  ALLOCATION                       05500000
S99VRBUN EQU    X'02'                  UNALLOCATION                     05550000
S99VRBCC EQU    X'03'                  CONCATENATION                    05600000
S99VRBDC EQU    X'04'                  DECONCATENATION                  05650000
S99VRBRI EQU    X'05'                  REMOVE IN-USE                    05700000
S99VRBDN EQU    X'06'                  DDNAME ALLOCATION                05750000
S99VRBIN EQU    X'07'                  INFORMATION RETRIEVAL            05800000
S99FLAG1 DS     0CL2                   FLAGS                            05850000
S99FLG11 DS     CL1                    FIRST FLAGS BYTE                 05900000
S99ONCNV EQU    X'80'                  ALLOC FUNCTION-DO NOT USE AN     05950000
*                                      EXISTING ALLOCATION THAT DOES    06000000
*                                      NOT HAVE THE CONVERTIBLE         06050000
*                                      ATTRIBUTE TO SATISFY A REQUEST   06100000
S99NOCNV EQU    X'40'                  ALLOC FUNCTION-DO NOT USE AN     06150000
*                                      EXISTING ALLOCATION TO SATISFY   06200000
*                                      THE REQUEST                      06250000
S99NOMNT EQU    X'20'                  ALLOC FUNCTION-DO NOT MOUNT      06300000
*                                      VOLUMES OR CONSIDER OFFLINE      06350000
*                                      UNITS (THIS FLAG OVERRIDES       06400000
*                                      S99MOUNT AND S99OFFLN BELOW)     06450000
S99JBSYS EQU    X'10'                  ALLOC FUNC-JOB RELATED SYSOUT    06500000
S99CNENQ EQU    X'08'                  ALL FUNCTIONS-ISSUE A   @ZA32641 06550000
*                                      CONDITIONAL ENQ ON TIOT @ZA32641 06600000
*                                      RESOURCE. IF NOT        @ZA32641 06650000
*                                      AVAILABLE, RETURN AN    @ZA32641 06700000
*                                      ERROR CODE TO USER.     @ZA32641 06750000
S99GDGNT EQU    X'04'                  ALLOC FUNCTION - IGNORE @YA10531 06760000
*                                      THE GDG NAME TABLE AND  @YA10531 06770000
*                                      PERFORM A LOCATE FOR    @YA10531 06780000
*                                      THE GDG BASE LEVEL.     @YA10531 06790000
S99MSGL0 EQU    X'02'                  All functions - ignore the  @01A 06792500
*                                      MSGLEVEL parameter in the   @01A 06795000
*                                      JCT and use MSGLEVEL=(,0)   @01A 06797500
S99NOMIG EQU    X'01'                  ALLOC function - do not     @03A 06798300
*                                      recall migrated data sets   @03A 06799100
S99FLG12 DS     CL1                    SECOND BYTE OF FLAGS             06800000
S99NOSYM EQU    X'80'                  Allocate, unallocate, info       06812500
*                                      retrieval - do not perform       06825000
*                                      symbolic substitution       @L4A 06837500
S99ACUCB EQU    X'40'                  Alloc function-use Actual        06841600
*                                      UCB addresses               @P1C 06845800
S99RSC   DS     0CL4                   REASON CODE FIELDS               06850000
S99ERROR DS     XL2                    ERROR REASON CODE                06900000
S99INFO  DS     XL2                    INFORMATION REASON CODE          06950000
S99TXTPP DS     F                      ADDR OF LIST OF TEXT UNIT PTRS   07000000
S99S99X  DS     F                      ADDR OF REQ BLK EXTENSION  @L1C  07050000
S99FLAG2 DS     0CL4                   FLAGS FOR AUTHORIZED FUNCTIONS   07100000
S99FLG21 DS     CL1                    FIRST BYTE OF FLAGS              07150000
S99WTVOL EQU    X'80'                  ALLOC FUNCTION-WAIT FOR          07200000
*                                      VOLUMES                          07250000
S99WTDSN EQU    X'40'                  ALLOC FUNCTION-WAIT FOR DSNAME   07300000
S99NORES EQU    X'20'                  ALLOC FUNCTION-DO NOT DO         07350000
*                                      DATA SET RESERVATION             07400000
S99WTUNT EQU    X'10'                  ALLOC FUNCTION-WAIT FOR UNITS    07450000
S99OFFLN EQU    X'08'                  ALLOC FUNCTION-CONSIDER OFFLINE  07500000
*                                      UNITS                            07550000
S99TIONQ EQU    X'04'                  ALL FUNCTIONS-TIOT ENQ ALREADY   07600000
*                                      DONE                             07650000
S99CATLG EQU    X'02'                  ALLOC FUNCTION-SET SPECIAL       07700000
*                                      CATALOG DATA SET INDICATORS      07750000
S99MOUNT EQU    X'01'                  ALLOC FUNCTION-MAY MOUNT VOLUME  07800000
S99FLG22 DS     CL1                    SECOND BYTE OF FLAGS             07850000
S99UDEVT EQU    X'80'                  ALLOCATION FUNCTION-UNIT NAME    07900000
*                                      PARM IS A DEVICE TYPE            07950000
S99PCINT EQU    X'40'                  ALLOC FUNCTION-ALLOC    @Y30QPPB 08000000
*                                      PRIVATE CATALOG TO      @Y30QPPB 08050000
*                                      INITIATOR               @Y30QPPB 08100000
S99DYNDI EQU    X'20'                  ALLOC FUNCTION-NO JES3  @ZA63125 08150000
*                                      DSN INTEGRITY PROCESS   @ZA63125 08200000
S99TIOEX EQU    X'10'                  ALLOC FUNCTION - XTIOT           08212500
*                                      ENTRY REQUESTED (FOR             08225000
*                                      SYSTEM PROGRAM USE ONLY)    @T1A 08237500
S99ASERR EQU    X'08'                  Unit Allocation / Unallocation   08238800
*                                      Service (IEFAB4C1/IEFDB440) -    08240100
*                                      Ignore Coupling Facility         08241400
*                                      READ/WRITE failure when          08242700
*                                      processing RELEASE function      08244000
*                                      for Autoswitchable device        08245300
*                                      (FOR SYSTEM PROGRAM USE          08246600
*                                      ONLY)                       @P2A 08247900
S99FLG23 DS     CL1                    THIRD BYTE OF FLAGS              08250000
S99FLG24 DS     CL1                    FOURTH BYTE OF FLAGS             08300000
S99RBEND EQU    *                      END MARKER                       08350000
*********************************************************************** 08352100
* SVC 99 FLAG BIT MASKS                                            @T1A 08354200
*   - A '1' DENOTES DEFINED BITS                                   @T1A 08356300
*   - USED TO TEST FOR BIT SETTINGS                                @T1A 08358400
*********************************************************************** 08360500
S99MSK11 EQU    B'11111111'            BIT MASK FOR S99FLG11       @03C 08362600
S99MSK12 EQU    B'11000000'            BIT MASK FOR S99FLG12       @P1C 08364700
S99MSK21 EQU    B'11111111'            BIT MASK FOR S99FLG21       @T1A 08366800
S99MSK22 EQU    B'11111000'            BIT MASK FOR S99FLG22       @P2C 08368900
S99MSK23 EQU    B'00000000'            BIT MASK FOR S99FLG23       @T1A 08371000
S99MSK24 EQU    B'00000000'            BIT MASK FOR S99FLG24       @T1A 08373100
*********************************************************************** 08375200
* SVC 99 FLAG RESERVED BIT MASKS                                   @T1A 08377300
*   - A '1' DENOTES RESERVED BITS                                  @T1A 08379400
*   - USED TO TEST FOR INVALID USE OF RESERVED FIELDS              @T1A 08381500
*********************************************************************** 08383600
S99NOT11 EQU    B'00000000'           INVERSE BITMASK FOR S99FLG11 @03C 08385700
S99NOT12 EQU    B'00111111'           INVERSE BITMASK FOR S99FLG12 @P1C 08387800
S99NOT21 EQU    B'00000000'           INVERSE BITMASK FOR S99FLG21 @T1A 08389900
S99NOT22 EQU    B'00000111'           INVERSE BITMASK FOR S99FLG22 @P2C 08392000
S99NOT23 EQU    B'11111111'           INVERSE BITMASK FOR S99FLG23 @T1A 08394100
S99NOT24 EQU    B'11111111'           INVERSE BITMASK FOR S99FLG24 @T1A 08396200
*********************************************************************** 08400000
* SVC 99 TEXT UNIT POINTER LIST                                         08450000
*********************************************************************** 08500000
S99TUPL  DSECT                         TEXT UNIT POINTER LIST           08550000
S99TUPTR DS     F                      TEXT UNIT POINTER                08600000
S99TUPLN EQU    X'80'                  LAST TEXT UNIT POINTER IN LIST   08650000
*********************************************************************** 08700000
* SVC 99 TEXT UNIT                                                      08750000
*********************************************************************** 08800000
S99TUNIT DSECT                         TEXT UNIT                        08850000
S99TUKEY DS     XL2                    KEY                              08900000
S99TUNUM DS     XL2                    N0. OF LENGTH+PARAMETER ENTRIES  08950000
S99TUENT DS     0C                     ENTRY OF LENGTH+PARAMETER        09000000
S99TULNG DS     XL2                    LENGH OF 1ST (OR ONLY) PARAMETER 09050000
S99TUPAR DS     C                      1ST (OR ONLY) PARAMETER          09100000
* THE FOLLOWING DSECT IS PROVIDED FOR USE WITH MULTIPLE                 09150000
* LENGTH/PARAMETER ENTRIES TO ALLOW ZERO DISPLACEMENT TO THE            09200000
* LENGTH FIELD                                                          09250000
S99TUFLD DSECT                                                          09300000
S99TULEN DS     XL2                    LENGTH OF PARAMETER              09350000
S99TUPRM DS     C                      PARAMETER                        09400000
****************************************************************** @L1A 09450000
* SVC 99 REQUEST BLOCK EXTENSION                                   @L1A 09500000
****************************************************************** @L1A 09550000
S99RBX   DSECT                         REQUEST BLOCK EXTENSION     @L1A 09600000
S99EID   DS     CL6                    CONTROL BLOCK ID ='S99RBX'  @L1A 09650000
S99EVER  DS     CL1                    VERSION NUMBER              @L1A 09700000
S99RBXVR EQU    X'01'                  CURRENT VERSION NUMBER      @L2A 09750000
S99EOPTS DS     CL1                    PROCESSING OPTIONS          @L1A 09800000
S99EIMSG EQU    X'80'                  ISSUE MSG BEFORE RETURNING  @L1A 09850000
*                                      TO CALLER                   @L1A 09900000
S99ERMSG EQU    X'40'                  RETURN MSG TO CALLER        @L1A 09950000
S99ELSTO EQU    X'20'                  USER STORAGE SHOULD BE      @L1A 10000000
*                                      BELOW 16M BOUNDRY           @L1A 10050000
S99EMKEY EQU    X'10'                  USER SPECIFIED STORAGE KEY  @L1A 10100000
*                                      FOR MESSAGE BLOCKS          @L1A 10150000
S99EMSUB EQU    X'08'                  USER SPECIFIED SUBPOOL FOR  @L1A 10200000
*                                      MESSAGE BLOCKS              @L1A 10250000
S99EWTP  EQU    X'04'                  USE WTO FOR MESSAGE OUTPUT  @L2A 10300000
S99ESUBP DS     CL1                    SUBPOOL FOR MESSAGE BLOCKS  @L1A 10350000
S99EKEY  DS     CL1                    STORAGE KEY FOR MESSAGE     @L1A 10400000
*                                      BLOCKS                      @L1A 10450000
S99EMGSV DS     CL1                    SEVERITY LEVEL FOR MESSAGES @L1A 10500000
*                                      PROCESSING                  @L1A 10550000
S99XINFO EQU    X'00'                  INFORMATIONAL MSG SEVERITY  @L2A 10600000
S99XWARN EQU    X'04'                  WARNING MESSAGE SEVERITY    @L2A 10650000
S99XSEVE EQU    X'08'                  SEVERE MESSAGE SEVERITY     @L2A 10700000
S99ENMSG DS     CL1                    NUMBER OF MESSAGE BLOCKS         10733300
*                                       RETURNED                   @D1C 10766600
S99ECPPL DS     F                      ADDRESS OF CPPL             @L1A 10800000
S99EMRC  DS     0CL4                   MESSAGE SERVICE RETURN CODE @L1A 10850000
S99ERCR  DS     CL1                    RESERVED                    @L1A 10900000
S99ERCM  DS     CL1                    RESERVED                    @D1C 10950000
S99ERCO  DS     CL1                    RETURN CODE DEALING WITH    @L1A 11050000
*                                      MESSAGE OUTPUT              @L1A 11100000
S99ERCF  DS     CL1                    RETURN CODE DEALING WITH    @L1A 11150000
*                                      STORAGE FOR MESSAGE BLOCKS  @L1A 11200000
S99EWRC  DS     F                      PUTLINE/WTO RETURN CODE     @L1A 11250000
S99EMSGP DS     F                      MESSAGE BLOCK POINTER       @L1A 11300000
S99ESIRC DS     0F                     INFORMATION RETRIEVAL       @L1A 11350000
*                                      RETURN CODE FOR SJF KEYS    @L1A 11400000
S99EERR  DS     XL2                    ERROR REASON CODE                11450000
S99EINFO DS     XL2                    INFORMATION REASON CODE          11500000
S99ERSN  DS     XL4                    SMS REASON CODE             @02C 11550000
         MEND   , */                                                    11600000
*%S99PLS2:  ;                                                           11650000
* /*******************************************************************/ 11700000
* /*                     N O T E                                     */ 11750000
* /*                                                                 */ 11800000
* /* THE REQUEST BLOCK, S99RB, AND THE REQUEST BLOCK POINTER,        */ 11850000
* /* S99RBPTR, DEFAULT TO NON-BASED STRUCTURES.                      */ 11900000
* /* TO GIVE S99RBPTR A BASED ATTRIBUTE, CODE:                       */ 11950000
* /*            %S99BASE1 = 'BASED'                                  */ 12000000
* /* TO GIVE S99RB A BASED ATTRIBUTE, CODE:                          */ 12050000
* /*            %S99BASE2 = 'BASED'  OR                              */ 12100000
* /*            %S99BASE2 = 'BASED(S99RBPTR)'                        */ 12150000
* /*                                                                 */ 12200000
* /* THE REQUEST BLOCK EXTENSION (S99RBX) IS DEFAULTED TO BE     @L1A*/ 12250000
* /* BASED ON S99S99X.                                           @L1A*/ 12300000
* /* TO GIVE S99RBX A NON-BASED ATTRIBUTE, CODE:                 @L1A*/ 12350000
* /*            %S99EBASE = 'BDY(WORD)'                          @L1A*/ 12400000
* /*                                                                 */ 12450000
* /* SVC 99 INPUT REQUEST BLOCK                                      */ 12500000
* /*******************************************************************/ 12550000
*  %IF S99BASE1 = '' %THEN %S99BASE1 = ' '; /* DEFAULT IF NOT SET    */ 12600000
*  %IF S99BASE2 = '' %THEN %S99BASE2 = ' ';                             12650000
*  %IF S99EBASE = '' %THEN %S99EBASE = 'BASED(S99S99X)'; /*      @L1A*/ 12700000
* DCL                                                                   12750000
*   1 S99RBPTR PTR(31) S99BASE1,       /* POINTER TO REQUEST BLOCK   */ 12800000
*     2 S99RBPND BIT(1);               /* LAST POINTER INDICATOR     */ 12850000
* DCL                                                                   12900000
*   1 S99RB S99BASE2,                  /* REQUEST BLOCK              */ 12950000
*     2 S99RBLN CHAR(1),               /* LENGTH OF REQUEST BLOCK    */ 13000000
*     2 S99VERB CHAR(1),               /* VERB CODE                  */ 13050000
*     2 S99FLAG1 CHAR(2),              /* FLAGS - IF ANY ARE CHANGED,   13075000
*                                         THE ASSOCIATED BITMASK MUST   13100000
*                                         BE CHANGED             @T1A*/ 13125000
*       3 S99FLG11 CHAR(1),            /* FIRST BYTE OF FLAGS        */ 13150000
*         4 S99ONCNV BIT(1),           /* ALLOC FUNCTION-DON'T USE      13200000
*                                         AN EXISTING ALLOCATION THAT   13250000
*                                         DOES NOT HAVE THE CON-        13300000
*                                         VERTIBLE ATTRIBUTE TO         13350000
*                                         SATISFY THE REQUEST        */ 13400000
*         4 S99NOCNV BIT(1),           /* ALLOC FUNCTION-DON'T USE AN   13450000
*                                         EXISTING ALLOCATION TO        13500000
*                                         SATISFY THE REQUEST        */ 13550000
*         4 S99NOMNT BIT(1),           /* ALLOC FUNCTION-DO NOT MOUNT   13600000
*                                         VOLUMES OR CONSIDER OFFLINE   13650000
*                                         UNITS - THIS FLAG OVERRIDES   13700000
*                                         S99MOUNT AND S99OFFLN BELOW*/ 13750000
*         4 S99JBSYS BIT(1),           /* ALLOC FUNC-JOB RELATED        13800000
*                                         SYSOUT             @ZA63446*/ 13850000
*         4 S99CNENQ BIT(1),           /* ALL FUNCTIONS-ISSUE A         13900000
*                                         CONDITIONAL ENQ ON THE TIOT   13950000
*                                         RESOURCE. IF NOT AVAILABLE,   14000000
*                                         RETURN AN ERROR CODE TO       14050000
*                                         THE USER.          @ZA32641*/ 14100000
*         4 S99GDGNT BIT(1),           /* ALLOC FUNCTION - IGNORE THE   14110000
*                                         GDG NAME TABLE AND PERFORM    14120000
*                                         A LOCATE FOR THE GDG BASE     14130000
*                                         LEVEL.             @YA10531*/ 14140000
*         4 S99MSGL0 BIT(1),           /* All functions - ignore the    14142500
*                                         MSGLEVEL parameter in the JCT 14145000
*                                         and use MSGLEVEL=(,0)  @01A*/ 14147500
*         4 S99NOMIG BIT(1),           /* ALLOC function - do not       14148100
*                                         recall migrated data          14148700
*                                         sets                   @03A*/ 14149300
*       3 S99FLG12 CHAR(1),            /* SECOND BYTE OF FLAGS       */ 14150000
*         4 S99NOSYM BIT(1),           /* Allocate, unallocate, info    14160000
*                                         retrieval - do not perform    14170000
*                                         symbolic substitution  @L4A*/ 14180000
*         4 S99ACUCB BIT(1),           /* Alloc function - use Actual   14185000
*                                         UCB addresses          @P1M*/ 14190000
*         4 * BIT(6),                  /* Reserved - must be 0   @P1C*/ 14195000
*     2 S99RSC CHAR(4),                /* REASON CODE FIELDS         */ 14200000
*       3 S99ERROR CHAR(2),            /* ERROR REASON CODE          */ 14250000
*       3 S99INFO CHAR(2),             /* INFORMATION REASON CODE    */ 14300000
*     2 S99TXTPP PTR(31),              /* ADDR OF LIST OF TEXT UNIT     14350000
*                                         POINTERS                   */ 14400000
*     2 S99S99X PTR(31),               /* ADDR OF SVC 99 REQUEST BLOCK  14450000
*                                         EXTENSION              @L1C*/ 14500000
*     2 S99FLAG2 CHAR(4),              /* FLAGS FOR AUTH. FUNCTIONS  */ 14550000
*       3 S99FLG21 CHAR(1),            /* FIRST BYTE OF FLAGS        */ 14600000
*         4 S99WTVOL BIT(1),           /* ALLOC FUNCTION-WAIT FOR       14650000
*                                         VOLUMES                    */ 14700000
*         4 S99WTDSN BIT(1),           /* ALLOC FUNCTION-WAIT FOR       14750000
*                                         DSNAME                     */ 14800000
*         4 S99NORES BIT(1),           /* ALLOC FUNCTION- DON'T DO      14850000
*                                         DATA SET RESERVATION       */ 14900000
*         4 S99WTUNT BIT(1),           /* ALLOC FUNCTION-WAIT FOR       14950000
*                                         UNITS                      */ 15000000
*         4 S99OFFLN BIT(1),           /* ALLOC FUNCTION-CONSIDER       15050000
*                                         OFFLINE UNITS              */ 15100000
*         4 S99TIONQ BIT(1),           /* ALL FUNCTIONS-TIOT ENQ        15150000
*                                         ALREADY DONE               */ 15200000
*         4 S99CATLG BIT(1),           /* ALLOC FUNCTION-SET SPECIAL    15250000
*                                         CATALOG DATA SET INDICATORS*/ 15300000
*         4 S99MOUNT BIT(1),           /* ALLOC FUNCTION - MAY          15350000
*                                         MOUNT VOLUMES              */ 15400000
*       3 S99FLG22 CHAR(1),            /* SECOND BYTE OF FLAGS       */ 15450000
*         4 S99UDEVT BIT(1),           /* ALLOC FUNCTION-UNIT NAME      15500000
*                                         PARM IS A DEVICE TYPE      */ 15550000
*         4 S99PCINT BIT(1),           /* ALLOC FUNCTION-ALLOC          15600000
*                                         PRIVATE CATALOG TO            15650000
*                                         INITIATOR          @Y30QPPB*/ 15700000
*         4 S99DYNDI BIT(1),           /* ALLOC FUNCTION-NO JES3        15750000
*                                         DSN INTEGRITY PROCESSING      15800000
*                                                            @ZA63125*/ 15850000
*         4 S99TIOEX BIT(1),           /* ALLOC FUNCTION - XTIOT        15860000
*                                         ENTRY REQUESTED (FOR          15870000
*                                         SYSTEM PROGRAM USE            15880000
*                                         ONLY)                  @T1A*/ 15890000
*         4 S99ASERR BIT(1),           /* Unit Allocation /             15891000
*                                         Unallocation Service          15892000
*                                         (IEFAB4C1/IEFDB440) -         15893000
*                                         Ignore Coupling Facility      15894000
*                                         READ/WRITE error when         15895000
*                                         processing RELEASE function   15896000
*                                         for Autoswitchable device     15897000
*                                         (FOR SYSTEM PROGRAM USE       15898000
*                                         ONLY). Set by IEFAB4C1,       15898600
*                                         used by IEFDB440.      @P2A*/ 15899200
*       3 S99FLG23 CHAR(1),            /* THIRD BYTE OF FLAGS        */ 15900000
*       3 S99FLG24 CHAR(1);            /* FOURTH BYTE OF FLAGS       */ 15950000
* DCL                                  /* VERB FUNCTION CODES        */ 16000000
*   S99VRBAL BIT(8) CONSTANT('01'X),   /* ALLOCATION                 */ 16050000
*   S99VRBUN BIT(8) CONSTANT('02'X),   /* UNALLOCATION               */ 16100000
*   S99VRBCC BIT(8) CONSTANT('03'X),   /* CONCATENATION              */ 16150000
*   S99VRBDC BIT(8) CONSTANT('04'X),   /* DECONCATENATION            */ 16200000
*   S99VRBRI BIT(8) CONSTANT('05'X),   /* REMOVE IN-USE              */ 16250000
*   S99VRBDN BIT(8) CONSTANT('06'X),   /* DDNAME ALLOCATION          */ 16300000
*   S99VRBIN BIT(8) CONSTANT('07'X);   /* INFORMATION RETRIEVAL      */ 16350000
* DCL                                  /* FLAG BIT MASKS - A '1'        16352100
*                                         DENOTES DEFINED BIT, A '0'    16354200
*                                         DENOTES AN UNDEFINED BIT.     16356300
*                                         USED TO TEST IF ANY BITS      16358400
*                                         ARE SET                @T1A*/ 16360500
*   S99MSK11 BIT(8) CONSTANT('11111111'B), /* S99FLG11 MASK      @03C*/ 16362600
*   S99MSK12 BIT(8) CONSTANT('11000000'B), /* S99FLG12 MASK      @P1C*/ 16364700
*   S99MSK21 BIT(8) CONSTANT('11111111'B), /* S99FLG21 MASK      @T1A*/ 16366800
*   S99MSK22 BIT(8) CONSTANT('11111000'B), /* S99FLG22 MASK      @P2C*/ 16368900
*   S99MSK23 BIT(8) CONSTANT('00000000'B), /* S99FLG23 MASK      @T1A*/ 16371000
*   S99MSK24 BIT(8) CONSTANT('00000000'B); /* S99FLG24 MASK      @T1A*/ 16373100
* DCL                                  /* NOT FLAG BIT MASK - A '1'     16375200
*                                         DENOTES RESERVED BITS, A '0'  16377300
*                                         DENOTES DEFINED BITS.  USED   16379400
*                                         TO TEST IF RESERVED BITS      16381500
*                                         ARE BEING USED         @T1A*/ 16383600
*   S99NOT11 BIT(8) CONSTANT('00000000'B), /* S99FLG11 NOT MASK  @03C*/ 16385700
*   S99NOT12 BIT(8) CONSTANT('00111111'B), /* S99FLG12 NOT MASK  @P1C*/ 16387800
*   S99NOT21 BIT(8) CONSTANT('00000000'B), /* S99FLG21 NOT MASK  @T1A*/ 16389900
*   S99NOT22 BIT(8) CONSTANT('00000111'B), /* S99FLG22 NOT MASK  @P2C*/ 16392000
*   S99NOT23 BIT(8) CONSTANT('11111111'B), /* S99FLG23 NOT MASK  @T1A*/ 16394100
*   S99NOT24 BIT(8) CONSTANT('11111111'B); /* S99FLG24 NOT MASK  @T1A*/ 16396200
* /*******************************************************************/ 16400000
* /* SVC 99 TEXT UNIT POINTER LIST                                   */ 16450000
* /*******************************************************************/ 16500000
* DCL                                                                   16550000
*   1 S99TUPL  (*) BASED(S99TXTPP),    /* TEXT UNIT POINTER LIST     */ 16600000
*     2 S99TUPTR PTR(31),              /* TEXT UNIT POINTER          */ 16650000
*       3 S99TUPLN BIT(1);             /* ON FOR LAST TEXT UNIT PTR  */ 16700000
* DCL                                                                   16750000
*   1 S99TUP PTR(31) BASED,            /* ONE ELEMENT IN TEXT UNIT      16800000
*                                         POINTER LIST               */ 16850000
*     2 S99TUPND BIT(1);               /* ON WHEN THIS IS LAST TEXT     16900000
*                                         UNIT POINTER               */ 16950000
* /*******************************************************************/ 17000000
* /* SVC 99 TEXT UNIT                                                */ 17050000
* /*******************************************************************/ 17100000
* DCL                                                                   17150000
*   1 S99TUNIT BASED(S99TUP),          /* TEXT UNIT                  */ 17200000
*     2 S99TUKEY CHAR(2),              /* KEY                        */ 17250000
*     2 S99TUNUM FIXED(15) BDY(BYTE),  /* NO. OF LENGTH+PARM ENTRIES */ 17300000
*     2 S99TUENT,                      /* TEXT ENTRY OF LENGTH+PARM  */ 17350000
*       3 S99TULNG FIXED(15) BDY(BYTE), /* LENGTH OF 1ST (ONLY) PARM */ 17400000
*       3 S99TUPAR CHAR(*);            /* 1ST (OR ONLY) PARAMETER    */ 17450000
* /* THE FOLLOWING DECLARE IS PROVIDED FOR USE WITH MULTIPLE         */ 17500000
* /* LENGTH/PARAMETER ENTRIES TO ALLOW ZERO DISPLACEMENT TO THE      */ 17550000
* /* LENGTH FIELD                                                    */ 17600000
* DCL                                                                   17650000
*   1 S99TUFLD BASED(S99TUFP),         /* TEXT ENTRY OF LENGTH+PARM  */ 17700000
*     2 S99TULEN FIXED(15) BDY(BYTE),  /* LENGTH OF FOLLOWING PARM   */ 17750000
*     2 S99TUPRM CHAR(*);              /* PARAMETER                  */ 17800000
* /************************************************************* @L1A*/ 17850000
* /* SVC 99 REQUEST BLOCK EXTENSION                              @L1A*/ 17900000
* /************************************************************* @L1A*/ 17950000
* DCL                                  /*                        @L1A*/ 18000000
*    1 S99RBX S99EBASE,                /* SVC 99 REQUEST BLOCK          18050000
*                                         EXTENSION              @L1A*/ 18100000
*      3 S99EID   CHAR(6),             /* CONTROL BLOCK ID       @L1A*/ 18150000
*      3 S99EVER  CHAR(1),             /* VERSION NUMBER         @L1A*/ 18200000
*      3 S99EOPTS CHAR(1),             /* PROCESSING OPTIONS     @L1A*/ 18250000
*        5 S99EIMSG BIT(1),            /* ISSUE MSG BEFORE RETURNING    18300000
*                                         TO CALLER              @L1A*/ 18350000
*        5 S99ERMSG BIT(1),            /* RETURN MSG TO CALLER   @L1A*/ 18400000
*        5 S99ELSTO BIT(1),            /* USER STORAGE SHOULD BE BELOW  18450000
*                                         16M BOUNDRY            @L1A*/ 18500000
*        5 S99EMKEY BIT(1),            /* USER SPECIFIED STORAGE KEY    18550000
*                                         FOR MESSAGE BLOCKS     @L1A*/ 18600000
*        5 S99EMSUB BIT(1),            /* USER SPECIFIED SUBPOOL FOR    18650000
*                                         MESSAGE BLOCKS         @L1A*/ 18700000
*        5 S99EWTP  BIT(1),            /* USE A WTO FOR MESSAGE         18750000
*                                         OUTPUT                 @L2A*/ 18775000
*        5 * BIT(2),                   /* Reserved - change constant    18806200
*                                         S99ERSVM when defining these  18837400
*                                         fields                 @L2C*/ 18868600
*      3 S99ESUBP FIXED(8),            /* SUBPOOL FOR MESSAGE BLOCKS    18900000
*                                                                @L2C*/ 18950000
*      3 S99EKEY  FIXED(8),            /* STORAGE KEY FOR MESSAGE       19000000
*                                         BLOCKS                 @L2C*/ 19050000
*      3 S99EMGSV FIXED(8),            /* SEVERITY LEVEL FOR MESSAGES   19100000
*                                         PROCESSING             @L2C*/ 19150000
*      3 S99ENMSG FIXED(8),            /* NUMBER MESSAGE BLOCKS         19183300
*                                         RETURNED               @D1C*/ 19216600
*      3 S99ECPPL PTR(31),             /* ADDRESS OF CPPL        @L1A*/ 19250000
*      3 S99EMRC  CHAR(4),             /* MESSAGE SERVICE RETURN CODE   19300000
*                                                                @L1A*/ 19350000
*        5 S99ERCR  FIXED(8),          /* RESERVED               @L2C*/ 19400000
*        5 S99ERCM  FIXED(8),          /* RESERVED               @D1C*/ 19450000
*        5 S99ERCO  FIXED(8),          /* RETURN CODE DEALING WITH      19550000
*                                         MESSAGE OUTPUT         @L2C*/ 19600000
*        5 S99ERCF  FIXED(8),          /* RETURN CODE DEALING WITH      19650000
*                                         STORAGE FOR MSG BLOCKS @L2C*/ 19700000
*      3 S99EWRC  FIXED(31),           /* PUTLINE/WTO RETURN CODE       19750000
*                                                                @L1A*/ 19800000
*      3 S99EMSGP PTR(31),             /* MESSAGE BLOCK POINTER  @L1A*/ 19850000
*      3 S99ESIRC CHAR(4),             /* INFORMATION RETRIEVAL RETURN  19900000
*                                         CODE FOR SJF KEYS (VERB 01    19950000
*                                         ONLY)                  @L1A*/ 20000000
*        5 S99EERR  CHAR(2),           /* ERROR REASON CODE      @L1A*/ 20050000
*        5 S99EINFO CHAR(2),           /* INFORMATION REASON CODE       20100000
*                                                                @L1A*/ 20150000
*      3 S99ERSN  FIXED(32);           /* SMS REASON CODE        @02C*/ 20200000
* DCL S99RBXID CHAR(6) CONSTANT('S99RBX'); /*REQUEST BLOCK EXTENSION    20250000
*                                         IDENTIFIER             @L1A*/ 20300000
* DCL S99RBXVR BIT(8) CONSTANT('01'X); /*REQUEST BLOCK EXTENSION        20350000
*                                         VERSION NUMBER         @L1A*/ 20400000
* DCL                                  /* MESSAGE SEVERITIES     @L2A*/ 20450000
*    S99XINFO  FIXED(8) CONSTANT(0),   /* INFORMATIONAL          @L2A*/ 20500000
*    S99XWARN  FIXED(8) CONSTANT(4),   /* WARNING                @L2A*/ 20550000
*    S99XSEVE  FIXED(8) CONSTANT(8);   /* SEVERE                 @L2A*/ 20600000
* DCL S99ERSVM BIT(8) CONSTANT('00000011'B); /* Request block extension 20650000
*                                              reserved bit mask @01A*/ 20700000
