*                                                                       00050000
* %DCL IEFZPMAP_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IEFZPMAP_INCLUDED;                                        00150000
* %IF IEFZPMAP_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 95257. CBGEN compile date 95227         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IEFZPMAP &DSECT=YES,&LIST=YES,&PRM_LIST_BUFFER=YES,           *00450000
               &PRM_READ_BUFFER=COND,&PRM_MESSAGE_BUFFER=COND           00500000
         GBLC  &IEFZPMAP_INCLUDED                                       00550000
         GBLC  &ZCBPRINT                                                00600000
&IEFZPMAP_INCLUDED SETC 'YES'                                           00650000
 TITLE   'IEFZPMAP  - Mapping Macros for use with the "Logical   '      00700000
**/ IEFZPMAP_1:;                                                        00750000
*/* START OF SPECIFICATIONS ******************************************/ 00800000
*/*01* PROPRIETARY STATEMENT=                                        */ 00850000
*/***PROPRIETARY_STATEMENT********************************************/ 00900000
*/*                                                                  */ 00950000
*/*                                                                  */ 01000000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01050000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01100000
*/* 5645-001 (C) COPYRIGHT IBM CORP. 1996                            */ 01150000
*/*                                                                  */ 01200000
*/* STATUS= JBB6602                                                  */ 01250000
*/*                                                                  */ 01300000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01350000
*/*                                                                  */ 01400000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 01450000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01500000
*/*                                                                  */ 01550000
*/*01* DESCRIPTIVE NAME:  Mapping Macros for use with the "Logical   */ 01600000
*/*                       Parmlib" Service (IEFPRMLB)                */ 01650000
*/*                                                                  */ 01700000
*/*02*  ACRONYM:  IEFZPMAP                                           */ 01750000
*/*                                                                  */ 01800000
*/*01* MACRO NAME: IEFZPMAP                                          */ 01850000
*/*                                                                  */ 01900000
*/*01* DSECT NAME:                                                   */ 01950000
*/*          PRM_List_Buffer - Provides a mapping for the            */ 02000000
*/*                     REQUEST=LIST output                          */ 02050000
*/*          PRM_Read_Buffer - Provides a mapping for the            */ 02100000
*/*                     REQUEST=ALLOCATE with READ function and      */ 02150000
*/*                     the REQUEST=READMEMBER function output       */ 02200000
*/*          PRM_Message_Buffer - Provides a mapping for the message */ 02250000
*/*                     buffer for the REQUEST=ALLOCATE and          */ 02300000
*/*                     REQUEST=READMEMBER functions                 */ 02350000
*/*                                                                  */ 02400000
*/*01* COMPONENT:  Allocation (SC1B4)                                */ 02450000
*/*                                                                  */ 02500000
*/*01* EYE-CATCHER: None                                             */ 02550000
*/*02*  OFFSET:  N/A                                                 */ 02600000
*/*02*  LENGTH:  N/A                                                 */ 02650000
*/*                                                                  */ 02700000
*/*01* STORAGE ATTRIBUTES:                                           */ 02750000
*/*02*  SUBPOOL:  Determined by users of IEFPRMLB                    */ 02800000
*/*02*  KEY:  Determined by users of IEFPRMLB                        */ 02850000
*/*02*  RESIDENCY:  Any                                              */ 02900000
*/*02*  MAIN STORAGE:  NO                                            */ 02950000
*/*02*  AUXILIARY STORAGE:  YES                                      */ 03000000
*/*02*  VIRTUAL STORAGE:  YES                                        */ 03050000
*/*02*  DATA SPACE: NO                                               */ 03100000
*/*                                                                  */ 03150000
*/*01* SIZE:                                                         */ 03200000
*/*           PRM_LIST_BUFFER    -- X'0048' bytes                    */ 03214200
*/*                   if room for one 56-byte entries is             */ 03228400
*/*                   provided.  Otherwise, X'38' larger             */ 03242600
*/*                   for each entry for which room is               */ 03256800
*/*                   provided. Room should be provided for          */ 03271000
*/*                   at least 11 entries.                           */ 03285200
*/*           PRM_READ_BUFFER    -- X'0068' bytes                    */ 03300000
*/*                   if room for one 80-byte record is              */ 03350000
*/*                   provided.  Otherwise, X'50' larger             */ 03400000
*/*                   for each record for which room is              */ 03450000
*/*                   provided.                                      */ 03500000
*/*           PRM_MESSAGE_BUFFER -- X'0110' bytes                    */ 03550000
*/*                   if room for one message is provided.           */ 03600000
*/*                   Otherwise, X'100' larger for each              */ 03650000
*/*                   message for which room is provided.            */ 03700000
*/*                                                                  */ 03750000
*/*01* CREATED BY: Callers of IEFPRMLB                               */ 03800000
*/*                                                                  */ 03850000
*/*01* POINTED TO BY:  Addresses are stored into the caller's        */ 03900000
*/*                    parameter list                                */ 03950000
*/*                                                                  */ 04000000
*/*01* SERIALIZATION: None.                                          */ 04050000
*/*                                                                  */ 04100000
*/*01* FUNCTION:                                                     */ 04150000
*/*02*    PRM_List_Buffer - Provides a mapping for the REQUEST=LIST  */ 04200000
*/*                  output                                          */ 04250000
*/*02*    PRM_Read_Buffer - Provides a mapping for the REQUEST=      */ 04300000
*/*                  ALLOCATE with READ function and the REQUEST=    */ 04350000
*/*                  READMEMBER FUNCTION output                      */ 04400000
*/*02*    PRM_Message_Buffer - Provides a mapping for the message    */ 04450000
*/*                  buffer for the REQUEST=ALLOCATE and             */ 04500000
*/*                  REQUEST= READMEMBER functions                   */ 04550000
*/*                                                                  */ 04600000
*/*01* METHOD OF ACCESS:                                             */ 04650000
*/*02*  ASM:                                                         */ 04700000
*/*      IEFZPMAP                                                    */ 04750000
*/*           DSECT=YES|NO  -- Request DSECT definition              */ 04800000
*/*           PRM_LIST_BUFFER=YES|NO|COND --                         */ 04850000
*/*                            Request mapping for REQUEST=LIST      */ 04900000
*/*                            USING on PRM_LIST_BUFFER              */ 04950000
*/*           PRM_READ_BUFFER=YES|NO|COND --                         */ 05000000
*/*                            Request mapping for read buffer       */ 05050000
*/*                            USING on PRM_READ_BUFFER              */ 05100000
*/*           PRM_MESSAGE_BUFFER=YES|NO|COND --                      */ 05150000
*/*                            Request mapping for message buffer    */ 05200000
*/*                            USING on PRM_MESSAGE_BUFFER           */ 05250000
*/*     Default: DSECT=YES,PRM_LIST_BUFFER=YES,                      */ 05300000
*/*                        PRM_READ_BUFFER=COND,                     */ 05350000
*/*                        PRM_MESSAGE_BUFFER=COND                   */ 05400000
*/*     Notes: name=YES  => expand                                   */ 05450000
*/*            name=NO   => do not expand                            */ 05500000
*/*            name=COND => expand only if DSECT=YES                 */ 05550000
*/*                                                                  */ 05600000
*/*02*   PL/X:                                                       */ 05650000
*/*        %INCLUDE SYSLIB(IEFZPMAP)                                 */ 05700000
*/*                                                                  */ 05750000
*/*01* DELETED BY: Creator (callers of IEFPRMLB)                     */ 05800000
*/*                                                                  */ 05850000
*/*01* DEPENDENCIES: None.                                           */ 05900000
*/*                                                                  */ 05950000
*/*01* DISTRIBUTION LIBRARY: AMACLIB                                 */ 06000000
*/*                                                                  */ 06050000
*/*01* CHANGE ACTIVITY:                                              */ 06100000
*/*  $L0= PARMCCBG JBB6602  950505  PDNN:  Concatenated Parmlib  @L0A*/ 06140000
*/*  $L1= PARMC    JBB6602  950505  PDNN:  Concatenated Parmlib  @L1A*/ 06180000
*/*  $L2= PARMC    JBB6602  950707  PDNN:  Concatenated Parmlib  @L2A*/ 06220000
*/*  $L3= DYNPLALL JBB6602  950901  PDXB:  Dynamic Parmlib       @L3A*/ 06260000
*/*                                                                  */ 06300000
*/* END OF SPECIFICATIONS ********************************************/ 06350000
*% /*                                                                   06400000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 06450000
         AIF   ('&LIST' EQ 'YES').P2                                    06500000
.P1      ANOP                                                           06550000
         PUSH  PRINT                                                    06600000
         PRINT OFF                                                      06650000
.P2      ANOP                                                           06700000
*                                                                       06750000
*   IEFZPMAP - A - 000000-999999                                        06800000
* ********************************************************************  06850000
* ********************************************************************  06900000
* * Mapping of the input LIST buffer which contains information      *  06950000
* * returned by the REQUEST(LIST) function.                          *  07000000
* ********************************************************************  07050000
*                                                                       07100000
*                                                                       07150000
         AIF   ('&PRM_LIST_BUFFER' EQ 'NO').L0002                       07200000
         AIF   ('&DSECT' EQ 'YES').L0003                                07250000
         AIF   ('&PRM_LIST_BUFFER' NE 'YES').L0002                      07300000
PRM_LIST_BUFFER DS 0F    Information returned by the LIST function of  *07350000
                         the IEFPRMLB macro                             07400000
         AGO   .L0004                                                   07450000
.L0003   ANOP                                                           07500000
PRM_LIST_BUFFER DSECT    Information returned by the LIST function of  *07550000
                         the IEFPRMLB macro                             07600000
.L0004   ANOP                                                           07650000
PRM_LIST_HEADER DS 1CL0016 Header                                       07670000
         ORG   PRM_LIST_HEADER                                          07690000
PRM_LIST_VERSION DS 1FL1 Version number. Must be set to PRM_List_Ver1  *07710000
                         or PRM_List_Current_Version                    07730000
         DS    1CL0003   Reserved                                       07750000
PRM_NUM_PARMLIB_DS DS 1FL4 Number of PARMLIB datasets in use by the    *07800000
                         system                                         07850000
PRM_LIST_BUFF_SIZE DS 1FL4 Input - Size of buffer including the header  07866600
         DS    1CL0004   Reserved                                       07883200
PRM_LIST_ENTRIES DS 0C   Array of entries each mapped by               *07899800
                         PRM_Parmlib_Ds_Info                            07916400
PRM_PARMLIB_DS_INFO DS 1CL0056 PARMLIB data set record                  07933000
         ORG   PRM_PARMLIB_DS_INFO                                      07950000
PRM_PLIB_DSN DS 1CL0044  PARMLIB dataset name                           08000000
PRM_PLIB_VOLSER DS 1CL0006 PARMLIB VOLSER                               08050000
         DS    1CL0006   Reserved                                       08070000
*                                                                       08090000
* ********************************************************************  08110000
* * Version information used with the LIST buffer (PRMLBUFF)         *  08130000
* ********************************************************************  08150000
*                                                                       08170000
*                                                                       08190000
PRM_LIST_VER1 EQU X'01'  Version 1 indicator                            08210000
PRM_LIST_CURRENT_VERSION EQU X'01' Current Version                      08230000
PRM_LIST_BUFFER_LEN EQU *-PRM_LIST_BUFFER                               08250000
.L0002   ANOP                                                           08300000
*                                                                       08350000
* ********************************************************************  08400000
* * Mapping of the input READ buffer which contains information      *  08450000
* * returned by the REQUEST(ALLOCATE) READ function and the          *  08500000
* * REQUEST(READMEMBER) function.                                    *  08550000
* ********************************************************************  08600000
*                                                                       08650000
*                                                                       08700000
         AIF   ('&PRM_READ_BUFFER' EQ 'NO').L0005                       08750000
         AIF   ('&DSECT' EQ 'YES').L0006                                08800000
         AIF   ('&PRM_READ_BUFFER' NE 'YES').L0005                      08850000
PRM_READ_BUFFER DS 0F    Buffer where contents of PARMLIB member are   *08900000
                         to be placed - used with ALLOCATE READ or     *08950000
                         READMEMBER functions of IEFPRMLB               09000000
         AGO   .L0007                                                   09050000
.L0006   ANOP                                                           09100000
PRM_READ_BUFFER DSECT    Buffer where contents of PARMLIB member are   *09150000
                         to be placed - used with ALLOCATE READ or     *09200000
                         READMEMBER functions of IEFPRMLB               09250000
.L0007   ANOP                                                           09300000
PRM_READ_HEADER DS 1CL0024 Read Buffer Header                           09350000
         ORG   PRM_READ_HEADER                                          09400000
PRM_READ_BUFF_SIZE DS 1FL4 Input - Size of buffer including the header  09450000
PRM_RECORDS_READ_COUNT DS 1FL4 Output - number of PARMLIB member       *09500000
                         records read into this buffer                  09550000
PRM_BUFF_SIZE_NEEDED DS 1FL4 Output - size of buffer needed to contain *09600000
                         entire member contents - valid for buffer     *09650000
                         full condition                                 09700000
PRM_TOTAL_RECORDS DS 1FL4 Output - Total number of records in the      *09750000
                         specified member                               09800000
         DS    1CL0008   Reserved                                       09850000
PRM_RECORDS DS 0C        Output: PARMLIB records area                   09875000
PRM_RECORD DS  1CL0080   Output: array of PARMLIB records, each mapped *09900000
                         by PRM_Record_Element                          09925000
         ORG   PRM_RECORD                                               09950000
PRM_RECORD_ELEMENT DS 1CL0080 One record                                09966600
         ORG   PRM_RECORD_ELEMENT                                       09983200
PRM_RECORD_TEXT DS 1CL0072 First 72 characters of record (If           *09999800
                         Blank72=YES is specified, character 72 will   *10016400
                         be EBCDIC blank.)                              10033000
PRM_EXTRANEOUS DS 1CL0008 Sequence number                               10050000
PRM_READ_BUFFER_LEN EQU *-PRM_READ_BUFFER                               10100000
.L0005   ANOP                                                           10150000
*                                                                       10200000
* ********************************************************************  10250000
* * Mapping of the input message buffer which may be used with       *  10300000
* * REQUEST=ALLOCATE function or the REQUEST=READMEMBER function.    *  10350000
* ********************************************************************  10400000
*                                                                       10450000
*                                                                       10500000
         AIF   ('&PRM_MESSAGE_BUFFER' EQ 'NO').L0008                    10550000
         AIF   ('&DSECT' EQ 'YES').L0009                                10600000
         AIF   ('&PRM_MESSAGE_BUFFER' NE 'YES').L0008                   10650000
PRM_MESSAGE_BUFFER DS 0F Buffer where messages will be returned         10700000
         AGO   .L000A                                                   10750000
.L0009   ANOP                                                           10800000
PRM_MESSAGE_BUFFER DSECT   Buffer where messages will be returned       10850000
.L000A   ANOP                                                           10900000
PRM_MESSAGE_HEADER DS 1CL0016 Message Buffer Header                     10950000
         ORG   PRM_MESSAGE_HEADER                                       11000000
PRM_MSG_BUFFER_SIZE DS 1FL4 Input - Size of buffer including the       *11050000
                         header                                         11100000
PRM_MESSAGE_COUNT DS 1FL4 Output - number of messages in the buffer     11150000
PRM_MSG_BUFFER_FLAGS DS 1BL1                                            11200000
         ORG   PRM_MSG_BUFFER_FLAGS                                     11250000
PRM_MSG_BUFFER_FULL EQU X'80' Output - Message buffer full              11300000
         ORG   PRM_MSG_BUFFER_FLAGS+X'00000001'                         11350000
         DS    1CL0007   Reserved                                       11400000
PRM_MESSAGES DS 0C       Messages                                       11450000
PRM_MESSAGE_ARRAY DS 1CL0256 Output - an array of messages             *11480000
                         descriptors, each mapped by                   *11510000
                         PRM_MESSAGE_ELEMENT                            11540000
         ORG   PRM_MESSAGE_ARRAY                                        11570000
PRM_MESSAGE_ELEMENT DS 1CL0256 Output - information for one message     11600000
         ORG   PRM_MESSAGE_ELEMENT                                      11650000
PRM_MSG_FLAGS DS 1BL1    Output - indicator flags                       11700000
         DS    1CL0001   Reserved                                       11750000
PRM_MSG_TEXT_LENGTH DS 1FL2 Output - length of this message text        11800000
PRM_MSG_TEXT DS 1CL0251  Output - This message line's text              11850000
         DS    1CL0001   Reserved                                       11900000
PRM_MESSAGE_BUFFER_LEN EQU *-PRM_MESSAGE_BUFFER                         12350000
.L0008   ANOP                                                           12400000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 12450000
         AIF   ('&LIST' EQ 'YES').P4                                    12500000
.P3      ANOP                                                           12550000
         POP   PRINT                                                    12600000
.P4      ANOP                                                           12650000
.P_EXIT  ANOP                                                           12700000
         MEND                                                           12750000
**/ IEFZPMAP_2:;                                                        12800000
* %IEFZPMAP_INCLUDED = 'YES';                                           12850000
* %DCL ZCBPRINT CHAR EXT;                                               12900000
* %DEACTIVATE ZCBPRINT;                                                 12950000
* %DCL IEFZPMAP_LIST CHAR EXT;                                          13000000
* %DEACTIVATE IEFZPMAP_LIST;                                            13050000
* %IF IEFZPMAP_LIST ^= 'NO' &                                           13100000
*    ZCBPRINT ^= 'NO' %THEN                                             13150000
*   %GOTO IEFZPMAP_3;                                                   13200000
*   @LIST PUSH NOECHO;                                                  13250000
*   @LIST NOASSEMBLE NOECHO;                                            13300000
*   @LIST OFF C NOECHO;                                                 13350000
* %IEFZPMAP_3:;                                                         13400000
*/* Start of PL/X Source                                             */ 13450000
*/* IEFZPMAP - A - 000000-999999                                     */ 13500000
*/********************************************************************/ 13550000
*                                                                       13600000
*%IF IEFZPMAP_ALET = '' %THEN /*                                 @L1A*/ 13650000
*  %IEFZPMAP_ALET = '0';   /*                                    @L1A*/ 13700000
*%IEFZPMAP_VIA='';        /*                                     @L1A*/ 13750000
*%IF IEFZPMAP_ALET^='0' %THEN /*                                 @L1A*/ 13800000
*  %IEFZPMAP_VIA='VIA(DLAA_ALET)'; /*                            @L1A*/ 13850000
*                                                                       13900000
*/********************************************************************/ 13950000
*/* Mapping of the input LIST buffer which contains information      */ 14000000
*/* returned by the REQUEST(LIST) function.                          */ 14050000
*/********************************************************************/ 14100000
*                                                                       14150000
* %SELECT(PRM_LIST_BUFFER_BASED);    /*                          @L1A*/ 14200000
*   %WHEN('')                      /* Not specified?             @L1A*/ 14250000
*     %PRM_LIST_BUFFER_BASED = 'BASED(*)'; /* Default to simply based   14300000
*                                                                @L1A*/ 14350000
*   %WHEN('NO')                    /* Don't want it based?       @L1A*/ 14400000
*       %PRM_LIST_BUFFER_BASED = ''; /* Nullify the basing expression   14450000
*                                                                @L1A*/ 14500000
*   %OTHERWISE %;                  /* Else leave what user supplied     14550000
*                                                                @L1A*/ 14600000
* %END SELECT;                     /*                            @L1A*/ 14650000
*                                                                       14700000
*DCL 1 PRM_List_Buffer PRM_LIST_BUFFER_BASED IEFZPMAP_VIA               14750000
*                    ,               /* Information returned by         14800000
*                                       the LIST function of the        14850000
*                                       IEFPRMLB macro           @L1A*/ 14900000
*      3 PRM_List_Header,            /* Header                   @L3A*/ 14928500
*        5 PRM_List_Version FIXED(8), /* Version number. Must be set to 14957000
*                                       PRM_List_Ver1 or                14985500
*                                       PRM_List_Current_Version @L1A*/ 15014000
*        5 * CHAR(3),                 /* Reserved                @L1A*/ 15042500
*        5 PRM_Num_Parmlib_DS FIXED(31), /* Number of PARMLIB datasets  15071000
*                                         in use by the system   @L1A*/ 15100000
*        5 PRM_List_Buff_Size FIXED(31), /* Input - Size of buffer      15114200
*                                       including the header     @L1A*/ 15128400
*        5 * CHAR(4),                /* Reserved                 @L1A*/ 15142600
*      3 PRM_List_Entries,           /* Array of entries each mapped    15156800
*                                      by PRM_Parmlib_Ds_Info    @L3A*/ 15171000
*        5 PRM_Parmlib_DS_Info(*) CHAR(56),  /* PARMLIB data set record 15185200
*                                                                @L1A*/ 15200000
*          7 PRM_Plib_DSN CHAR(44),  /* PARMLIB dataset name     @L1A*/ 15250000
*          7 PRM_Plib_Volser CHAR(6), /* PARMLIB VOLSER          @L1A*/ 15300000
*          7 * CHAR(6);              /* Reserved                 @L1A*/ 15350000
*                                                                       15450000
*/********************************************************************/ 15455500
*/* Version information used with the LIST buffer (PRMLBUFF)         */ 15461000
*/********************************************************************/ 15466500
*                                                                       15472000
*DCL PRM_List_Ver1 BIT(8) CONSTANT('01'X); /* Version 1 indicator       15477500
*                                                                @L1A*/ 15483000
*DCL PRM_List_Current_Version BIT(8) CONSTANT('01'X); /*Current         15488500
*                                                Version         @L1A*/ 15494000
*/********************************************************************/ 15500000
*/* Mapping of the input READ buffer which contains information      */ 15550000
*/* returned by the REQUEST(ALLOCATE) READ function and the          */ 15600000
*/* REQUEST(READMEMBER) function.                                    */ 15650000
*/********************************************************************/ 15700000
*                                                                       15750000
* %SELECT(PRM_READ_BUFFER_BASED);  /*                            @L1A*/ 15800000
*   %WHEN('')                      /* Not specified?             @L1A*/ 15850000
*     %PRM_READ_BUFFER_BASED = 'BASED(*)'; /* Default to simply based   15900000
*                                                                @L1A*/ 15950000
*   %WHEN('NO')                    /* Don't want it based?       @L1A*/ 16000000
*       %PRM_READ_BUFFER_BASED = ''; /* Nullify the basing expression   16050000
*                                                                @L1A*/ 16100000
*   %OTHERWISE %;                  /* Else leave what user supplied     16150000
*                                                                @L1A*/ 16200000
* %END SELECT;                     /*                            @L1A*/ 16250000
*                                                                       16300000
*DCL 1 PRM_Read_Buffer PRM_READ_BUFFER_BASED IEFZPMAP_VIA               16350000
*                            BDY(WORD), /* Buffer where contents of     16400000
*                                       PARMLIB member are to be        16450000
*                                       placed - used with ALLOCATE     16500000
*                                       READ or READMEMBER functions    16550000
*                                       of IEFPRMLB              @L1A*/ 16600000
*      3 PRM_Read_Header,            /* Read Buffer Header              16650000
*                                                                @L2C*/ 16700000
*        5 PRM_Read_Buff_Size FIXED(31), /* Input - Size of buffer      16750000
*                                       including the header     @L1A*/ 16800000
*        5 PRM_Records_Read_Count FIXED(31), /*Output - number of       16850000
*                                       PARMLIB member records read     16900000
*                                       into this buffer         @L1A*/ 16950000
*        5 PRM_Buff_Size_Needed FIXED(31), /* Output - size of buffer   17000000
*                                       needed to contain entire        17050000
*                                       member contents - valid for     17100000
*                                       buffer full condition    @L1A*/ 17150000
*        5 PRM_Total_Records FIXED(31), /* Output - Total number of     17200000
*                                       records in the specified        17250000
*                                       member                   @L2A*/ 17300000
*        5 * CHAR(8),                /* Reserved                 @L2C*/ 17350000
*      3 PRM_Records,                /* Output: PARMLIB records         17372700
*                                       area                     @L1A*/ 17395400
*       4 PRM_Record (*) CHAR(80),   /* Output: array of PARMLIB        17418100
*                                       records, each mapped by         17440800
*                                       PRM_Record_Element       @L1A*/ 17463500
*        5 PRM_Record_Element CHAR(80),  /* One record           @L1A*/ 17486200
*         6 PRM_Record_Text CHAR(72), /* First 72 characters of         17508900
*                            record (If Blank72=YES is specified,       17531600
*                            character 72 will be EBCDIC blank.) @L3A*/ 17554300
*         6 PRM_Extraneous CHAR(8);  /* Sequence number          @L1A*/ 17577000
*                                                                       17600000
*/********************************************************************/ 17650000
*/* Mapping of the input message buffer which may be used with       */ 17700000
*/* REQUEST=ALLOCATE function or the REQUEST=READMEMBER function.    */ 17750000
*/********************************************************************/ 17800000
*                                                                       17850000
* %SELECT(PRM_MESSAGE_BUFFER_BASED); /*                          @L1A*/ 17900000
*   %WHEN('')                      /* Not specified?             @L1A*/ 17950000
*     %PRM_MESSAGE_BUFFER_BASED = 'BASED(*)'; /* Default to simply      18000000
*                                     based                      @L1A*/ 18050000
*   %WHEN('NO')                    /* Don't want it based?       @L1A*/ 18100000
*       %PRM_MESSAGE_BUFFER_BASED = ''; /* Nullify the basing           18150000
*                                     expression                 @L1A*/ 18200000
*   %OTHERWISE %;                  /* Else leave what user supplied     18250000
*                                                                @L1A*/ 18300000
* %END SELECT;                     /*                            @L1A*/ 18350000
*                                                                       18400000
*DCL 1 PRM_Message_Buffer PRM_MESSAGE_BUFFER_BASED IEFZPMAP_VIA         18450000
*                               BDY(WORD),  /* Buffer where messages    18500000
*                                       will be returned         @L1A*/ 18550000
*      3 PRM_Message_Header,         /* Message Buffer                  18600000
*                                       Header                   @L1A*/ 18650000
*        5 PRM_Msg_Buffer_Size FIXED(31), /* Input - Size of buffer     18700000
*                                       including the header     @L1A*/ 18750000
*        5 PRM_Message_Count FIXED(31), /* Output - number of messages  18800000
*                                       in the buffer            @L1A*/ 18850000
*        5 PRM_Msg_Buffer_Flags BIT(8), /*                       @L1A*/ 18900000
*          7 PRM_Msg_Buffer_Full BIT(1), /* Output - Message buffer     18950000
*                                           full                 @L1A*/ 19000000
*          7 * BIT(7),               /* Reserved                 @L1A*/ 19050000
*        5 * CHAR(7),                /* Reserved                 @L1A*/ 19100000
*      3 PRM_Messages,                   /* Messages             @L1A*/ 19150000
*       4 PRM_Message_Array(*) BDY(WORD),  /* Output - an array         19200000
*                                       of messages descriptors, each   19250000
*                                       mapped by                       19300000
*                                       PRM_MESSAGE_ELEMENT      @L1A*/ 19350000
*        5 PRM_Message_Element CHAR(256) BDY(WORD), /*Output -          19400000
*                                       information for one message     19450000
*                                                                @L1A*/ 19500000
*          7 PRM_Msg_Flags BIT(8),   /* Output - indicator flags @L1A*/ 19550000
*          7 * CHAR(1),              /* Reserved                 @L1A*/ 19600000
*          7 PRM_Msg_Text_Length FIXED(16), /*Output - length of this   19650000
*                                       message text             @L1A*/ 19700000
*          7 PRM_Msg_Text CHAR(251), /* Output - This message line's    19750000
*                                       text                     @L1A*/ 19800000
*          7 * CHAR(1);              /* Reserved                 @L1A*/ 19850000
*                                                                       19900000
* @LOGIC;                                                               20350000
* #PRAGMA TOOL=CBGEN.                                                   20400000
* #USEORG.                                                              20450000
* #EPRAGMA.                                                             20500000
* @ENDLOGIC;                                                            20550000
*/* End of PL/X Source                                               */ 20600000
* %IF IEFZPMAP_LIST ^= 'NO' &                                           20650000
*    ZCBPRINT ^= 'NO' %THEN                                             20700000
*   %GOTO IEFZPMAP_4;                                                   20750000
*   @LIST POP NOECHO;                                                   20800000
* %IEFZPMAP_4:;                                                         20850000
* %END;                                                                 20900000
