*        %GOTO ZB4UVPRO;                  /*                     @L1A   00050000
         MACRO                                                   @L1A   00100000
         IEFZB4UV ,                                              @L1A*/ 00150000
*        %ZB4UVPRO:  ;                    /*                     @L1A*/ 00200000
*/********************************************************************/ 00250000
*/*                                                                  */ 00300000
*/* MODULE NAME -             IEFZB4UV                               */ 00350000
*/*                                                                  */ 00400000
*/* DESCRIPTIVE NAME - PARAMETER MAPPINGS FOR IEFAB4UV, IEFEB4UV,    */ 00450000
*/*                    AND IEFGB4UV                              @L1A*/ 00500000
*/*                                                                  */ 00550000
*/* COPYRIGHT -                                                      */ 00600000
*/*      5740-XC6                                                    */ 00650000
*/*      CONTAINS RESTRICTED MATERIALS OF IBM                        */ 00700000
*/*      (C) COPYRIGHT IBM CORP. 1981, 1986                          */ 00750000
*/*      LICENSED MATERIAL- PROPERTY OF IBM,                         */ 00800000
*/*      REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083       */ 00850000
*/*                                                                  */ 00900000
*/* STATUS - OS/VS2 JBB2220                                      @L1C*/ 00950000
*/*                                                                  */ 01000000
*/* PTF for APAR OY44131                                         @01C*/ 01016600
*/*                                                                  */ 01033200
*/* FUNCTION - THIS MACRO PROVIDES SYMBOLIC MAPPINGS FOR THE INPUT   */ 01050000
*/*            AND OUTPUT OF EACH OF THE AVAILABLE SERVICES IN THE   */ 01100000
*/*            UNIT VERIFICATION ROUTINES (IEFAB4UV AND IEFEB4UV).   */ 01150000
*/*                                                                  */ 01200000
*/* INVOCATION - PL/S - SPECIFY:                                 @L1C*/ 01250000
*/*                   - %DECLARE FUNCDEF CHAR                    @L1A*/ 01300000
*/*                   - %DECLARE UTDEF   CHAR                    @L1A*/ 01350000
*/*                   - %FUNCDEF = 'VALUE'                       @L1A*/ 01400000
*/*                   - %UTDEF   = 'VALUE'                       @L1A*/ 01450000
*/*                              WHERE VALUE MAY BE:             @L1A*/ 01500000
*/*                                    'BASED'                   @L1A*/ 01550000
*/*                                    'BASED(XXXXXXXX)'         @L1A*/ 01600000
*/*                     NOTE: IF NOT SPECIFIED FUNCDEF DEFAULTS  @L1A*/ 01650000
*/*                           TO BIT AND UTDEF DEFAULTS TO       @L1A*/ 01700000
*/*                           CHARACTER.  THESE ARE USED TO      @L1A*/ 01750000
*/*                           DEFINE CHARACTERISTICS FOR THE     @L1A*/ 01800000
*/*                           FUNCFLGS AND UNITTAB TABLES.       @L1A*/ 01850000
*/*                   - %INCLUDE SYSLIB(IEFZB4UV)                @L1A*/ 01900000
*/*                                                              @L1A*/ 01950000
*/*            - BAL  - IEFZB4UV                                 @L1A*/ 02000000
*/*                                                              @L1A*/ 02050000
*/*   Note: Functions 1, 2, ect. documented below and in         @02A*/ 02055000
*/*   the IEFEB4UV prolog are documented as functions 0, 1, ect. @02A*/ 02060000
*/*   in the publications. Thus, Function 1 - Check Groups       @02A*/ 02065000
*/*   (for group splitting) is documented as Function 0 in the   @02A*/ 02070000
*/*   publications. Function 2 here is function 1 in the         @02A*/ 02075000
*/*   pubs, and so on. Function code 0, 1, etc. actually refers  @02A*/ 02080000
*/*   to which bit is set on in the FLAGS parameter field to     @02A*/ 02085000
*/*   request said function, bit 0, 1, ect. from left to right.  @02A*/ 02090000
*/*                                                                  */ 02095000
*/*   THE FUNCTIONS THAT ARE PERFORMED BY IEFAB4UV, IEFEB4UV     @L1A*/ 02100000
*/*       AND IEFGB4UV ARE:                                      @L1A*/ 02150000
*/*    1) CHECK TO SEE THAT THE INPUT DEVICE ADDRESSES DO NOT    @L1A*/ 02200000
*/*       CAUSE 'GROUP SPLITTING'. THAT IS, FOR EACH GROUP,      @L1A*/ 02250000
*/*       EITHER ALL THE UCB ADDRESSES ASSOCIATED WITH THE GROUP @L1A*/ 02300000
*/*       ARE CONTAINED IN THE INPUT DEVICE LIST, OR NONE OF     @L1A*/ 02350000
*/*       THEM.                                                  @L1A*/ 02400000
*/*    2) CHECK TO SEE THAT THE INPUT DEVICE ADDRESSES ARE ALL   @L1A*/ 02450000
*/*       ASSOCIATED WITH THE INPUT UNIT NAME, OR                @L1A*/ 02500000
*/*       LOOKUP VALUE/DEVICE TYPE, AS INDICATED BY              @L1A*/ 02550000
*/*       FUNCTION 6.                                            @L1A*/ 02600000
*/*    3) RETURN THE UNIT NAME THAT IS ASSOCIATED WITH THE INPUT @L1A*/ 02650000
*/*       LOOK-UP VALUE.                                         @L1A*/ 02700000
*/*    4) RETURN A LIST OF UCB ADDRESSES ASSOCIATED WITH THE     @L1A*/ 02750000
*/*       INPUT UNITNAME OR  LOOKUP VALUE/DEVICE TYPE AS         @D1A*/ 02800000
*/*       INDICATED BY FUNCTION 6.                               @L1A*/ 02850000
*/*    5) RETURN A GROUP ID CORRESPONDING TO EACH UCB            @L1A*/ 02900000
*/*       ADDRESS IN THE INPUT UCB LIST.                         @L1A*/ 02950000
*/*    6) INDICATE WHETHER UNIT NAME, OR LOOKUP VALUE OR         @L1A*/ 03000000
*/*       DEVICE TYPE, IS INPUT FOR FUNCTION 2) OR 4).           @L1A*/ 03050000
*/*    7) RETURN THE LOOK-UP VALUE THAT IS ASSOCIATED WITH       @L1A*/ 03100000
*/*       THE INPUT UNIT NAME.                                   @L1A*/ 03150000
*/*    8) CONVERT THE INPUT UCB DEVICE TYPE TO ITS               @L1A*/ 03200000
*/*       ASSOCIATED LOOK-UP VALUE.                              @L1A*/ 03250000
*/*    9) RETURN THE ATTRIBUTES THAT ARE ASSOCIATED WITH         @L1A*/ 03300000
*/*       THE INPUT UNIT NAME.                                   @L1A*/ 03350000
*/*   10) INDICATES THAT THE CALLER'S PARAMETER LISTS SHOULD     @L1A*/ 03400000
*/*       NOT BE ALTERED.  (VALID WITH FUNCTION 2 REQUEST        @L1A*/ 03450000
*/*       ONLY.)                                                 @L1A*/ 03500000
*/*   11) INDICATES THAT THE CALLER HAS PASSED A SUBPOOL TO      @L1A*/ 03550000
*/*       RETURN THE UCB LIST FROM FUNCTION 4 OR 12 IN.          @D1C*/ 03600000
*/*   12) BUILD A LIST OF GENERIC AND ESOTERIC UNIT NAMES        @D1A*/ 03650000
*/*       ASSOCIATED WITH THE INPUT DEVICE CLASS.                @D1A*/ 03700000
*/*   13) This function, OVERRIDE, requests that the returned    @T1A*/ 03710000
*/*       attribute flag, OVERESO, be set if the specified unit  @T1A*/ 03720000
*/*       name, UNITNM, in the input Unit Name Table is an       @T1A*/ 03730000
*/*       overriding esoteric. The rest of the attributes        @02C*/ 03735000
*/*       associated with function 9 (function code 8 - return   @02A*/ 03740000
*/*       attributes) are also returned.                         @02A*/ 03745000
*/*                                                              @L1A*/ 03750000
*/*   RESTRICTIONS -                                             @L1A*/ 03800000
*/*     FUNCTIONS 1 AND 2 (SEE FUNCTION) MAY BE REQUESTED IN THE @L1A*/ 03850000
*/*       SAME INVOCATION OF THE UNIT VERIFICATION ROUTINES.     @L1A*/ 03900000
*/*     FUNCTIONS 3, 8, AND 9 (SEE FUNCTION) MAY BE              @L1A*/ 03950000
*/*       REQUESTED IN THE SAME INVOCATION OF THE UNIT           @L1A*/ 04000000
*/*       VERIFICATION ROUTINES.                                 @L1A*/ 04050000
*/*       (OUTPUT FROM FUNCTION 8 WILL BECOME THE INPUT TO       @L1A*/ 04100000
*/*       FUNCTION 3, AND OUTPUT FROM FUNCTION 3 WILL            @L1A*/ 04150000
*/*       BECOME THE INPUT TO FUNCTION 9.)                       @L1A*/ 04200000
*/*     FUNCTION 4 (SEE FUNCTION) MAY BE REQUESTED WITH          @L1A*/ 04250000
*/*       FUNCTION 9 ONLY WHEN INPUT IS UNIT NAME(AS IN-         @L1A*/ 04300000
*/*       DICATED BY FUNCTION 6).  IT MAY ALSO BE REQUESTED      @D1C*/ 04350000
*/*       WITH FUNCTION 8 ONLY WHEN INPUT IS A DEVICE TYPE       @D1A*/ 04400000
*/*       (AS INDICATED BY FUNCTION 6).  THE OUTPUT FROM         @D1A*/ 04450000
*/*       FUNCTION 8 BECOMES THE INPUT TO FUNCTION 4 AND IS      @D1A*/ 04500000
*/*       NOT AVAILABLE TO THE INVOKER.                          @D1A*/ 04550000
*/*     FUNCTION 5 (SEE FUNCTION) MUST BE REQUESTED              @L1A*/ 04600000
*/*       SEPARATELY FROM THE OTHER FUNCTIONS.                   @L1A*/ 04650000
*/*     FUNCTION 6 (SEE FUNCTION) MAY BE REQUESTED WITH          @L1A*/ 04700000
*/*       FUNCTION 2 OR FUNCTION 4.                              @L1A*/ 04750000
*/*     FUNCTION 7 (SEE FUNCTION) MAY BE REQUESTED WITH          @L1A*/ 04800000
*/*       FUNCTION 9.                                            @L1A*/ 04850000
*/*     FUNCTION 10 (SEE FUNCTION) MAY ONLY BE REQUESTED         @L1A*/ 04900000
*/*       WITH FUNCTION 2.                                       @L1A*/ 04950000
*/*     FUNCTION 11 (SEE FUNCTION) MAY ONLY BE REQUESTED         @L1A*/ 05000000
*/*       WITH FUNCTION 4 OR 12.                                 @D1C*/ 05050000
*/*                                                              @L1A*/ 05100000
*/*   INPUT -                                                    @L1A*/ 05150000
*/*     UNIT TABLE -                                             @L1A*/ 05200000
*/*       FOR FUNCTION 1 (SEE FUNCTION) THIS TABLE CONTAINS:     @L1A*/ 05250000
*/*         NUMBER OF EBCDIC DEVICE ADDRESSES SUPPLIED           @L1A*/ 05300000
*/*         PTR TO LIST OF EBCDIC DEVICE ADDRESSES               @L1A*/ 05350000
*/*       FOR FUNCTION 2 (SEE FUNCTION) THIS TABLE CONTAINS:     @L1A*/ 05400000
*/*         AN EBCDIC UNIT NAME IF BIT 6 IS OFF, OR              @L1A*/ 05450000
*/*           A FOUR BYTE LOOKUP VALUE OR DEVICE TYPE IF         @L1A*/ 05500000
*/*           BIT 6 IS ON.                                       @L1A*/ 05550000
*/*         NUMBER OF EBCDIC DEVICE ADDRESSES SUPPLIED           @L1A*/ 05600000
*/*         PTR TO LIST OF EBCDIC DEVICE ADDRESSES               @L1A*/ 05650000
*/*       FOR FUNCTION 3 (SEE FUNCTION) THIS TABLE CONTAINS:     @L1A*/ 05700000
*/*         A RETURN AREA FOR THE UNIT NAME                      @L1A*/ 05750000
*/*         A LOOK-UP VALUE                                      @L1A*/ 05800000
*/*       FOR FUNCTION 4 (SEE FUNCTION) THIS TABLE CONTAINS:     @L1A*/ 05850000
*/*         AN EBCDIC UNIT NAME OR                               @L1A*/ 05900000
*/*           A FOUR BYTE LOOKUP VALUE OR DEVICE TYPE            @L1A*/ 05950000
*/*         A RETURN AREA FOR THE ADDRESS OF THE                 @L1A*/ 06000000
*/*           UCB LIST                                           @L1A*/ 06050000
*/*       FOR FUNCTION 5 (SEE FUNCTION) THIS TABLE CONTAINS:     @L1A*/ 06100000
*/*         A POINTER TO ZEROED SPACE FOR THE GROUP              @L1A*/ 06150000
*/*           ID TABLE                                           @L1A*/ 06200000
*/*         A POINTER TO THE INPUT UCB LIST                      @L1A*/ 06250000
*/*       FOR FUNCTION 7 (SEE FUNCTION) THIS TABLE CONTAINS:     @L1A*/ 06300000
*/*         AN EBCDIC UNIT NAME                                  @L1A*/ 06350000
*/*         A RETURN AREA FOR THE LOOK-UP VALUE                  @L1A*/ 06400000
*/*       FOR FUNCTION 8 (SEE FUNCTION) THIS TABLE CONTAINS:     @L1A*/ 06450000
*/*         A 4-BYTE UCB DEVICE TYPE TO BE OVERLAID BY THE       @L1A*/ 06500000
*/*           LOOK-UP VALUE                                      @L1A*/ 06550000
*/*       FOR FUNCTION 9 (SEE FUNCTION) THIS TABLE CONTAINS:     @L1A*/ 06600000
*/*         AN EBCDIC UNIT NAME                                  @L1A*/ 06650000
*/*         A POINTER TO A 10-BYTE AREA (INITIALIZED WITH        @L1A*/ 06700000
*/*           X'0A' IN THE FIRST BYTE) FOR UNIT ATTRIBUTES       @L1A*/ 06750000
*/*       FOR FUNCTION 11 (SEE FUNCTION) THIS TABLE CONTAINS:    @L1A*/ 06800000
*/*         A SUBPOOL NUMBER TO RETURN THE UCB LIST FROM         @L1A*/ 06850000
*/*           FUNCTION 4 OR 12 IN.                               @D1C*/ 06900000
*/*       FOR FUNCTION 12 (SEE FUNCTION) THIS TABLE CONTAINS:    @D1A*/ 06950000
*/*         A ONE BYTE DEVICE CLASS                              @D1A*/ 07000000
*/*         A RETURN AREA FOR THE ADDRESS OF THE                 @D1A*/ 07050000
*/*           NAME LIST                                          @D1A*/ 07100000
*/*       For function 13 (see FUNCTION) this table contains:    @T1A*/ 07116600
*/*         an EBCDIC unit name                                  @T1A*/ 07133200
*/*         a pointer to a 10 byte area which is initialized     @02A*/ 07138800
*/*         with the length of the Unit Attributes area.         @02A*/ 07144400
*/*                                                              @L1A*/ 07150000
*/*     FUNCTION FLAGS - DEFINES INPUT FOR THE                   @L1A*/ 07200000
*/*                      FUNCTION(S) REQUESTED                   @L1A*/ 07250000
*/*                                                              @L1A*/ 07300000
*/*   OUTPUT -                                                   @L1A*/ 07350000
*/*    FOR FUNCTION 2, AN INVALID BIT IS SET IN THE FLAG     @YA12932*/ 07360000
*/*       FIELD OF THE INPUT UNIT ADDRESS IF IT IS NOT       @YA12932*/ 07370000
*/*       ASSOCIATED WITH THE INPUT UNIT NAME, LOOKUP VALUE  @YA12932*/ 07380000
*/*       OR DEVICE TYPE.                                    @YA12932*/ 07390000
*/*     FOR FUNCTION 3, A UNIT NAME IS RETURNED IN THE INPUT     @L1A*/ 07400000
*/*       UNIT TABLE.                                            @L1A*/ 07450000
*/*     FOR FUNCTION 4, A LIST OF UCBS ASSOCIATED WITH THE       @L1A*/ 07500000
*/*       INPUT UNIT NAME OR LOOKUP VALUE OR DEVICE TYPE         @L1A*/ 07550000
*/*       IS RETURNED.                                           @L1A*/ 07600000
*/*     FOR FUNCTION 5, A LIST OF GROUP IDS ASSOCIATED WITH      @L1A*/ 07650000
*/*       THE INPUT LIST OF UCBS IS RETURNED.                    @L1A*/ 07700000
*/*     FOR FUNCTION 7, A LOOK-UP VALUE IS RETURNED IN THE       @L1A*/ 07750000
*/*       INPUT UNIT TABLE.                                      @L1A*/ 07800000
*/*     FOR FUNCTION 8, A LOOK-UP VALUE IS RETURNED IN THE       @L1A*/ 07850000
*/*       INPUT UNIT TABLE.                                      @L1A*/ 07900000
*/*     FOR FUNCTION 9, THE ATTRIBUTES ASSOCIATED WITH THE       @L1A*/ 07950000
*/*       INPUT UNIT NAME IS RETURNED.                           @L1A*/ 08000000
*/*     FOR FUNCTION 12, A LIST OF UNIT NAMES ASSOCIATED WITH    @D1A*/ 08050000
*/*       THE INPUT DEVICE CLASS IS RETURNED.                    @D1A*/ 08100000
*/*     For function 13, OVERRIDE, the OVERESO attribute         @T1A*/ 08125000
*/*       flag is set if the input unitname, UNITNM, is an       @T1A*/ 08150000
*/*       overriding esoteric. The attributes associated with    @02C*/ 08166600
*/*       the input unit name are also returned.                 @02C*/ 08183200
*/*                                                              @L1A*/ 08200000
*/* CHANGE ACTIVITY - G860P2P,G860P44,PCC0908,L1,D1,OY12932  @YA12932*/ 08233300
*/*                   OY18809, T1, 01                            @01C*/ 08260300
*/*                                                                  */ 08287300
*/*  $L1= IOGEN   JBB2220 850130 PDN2: IOGEN RESTRUCTURE         @L1A*/ 08314300
*/*  $D1= DCR88   JBB2220 850417 PDN2: UNIT VERIFICATION         @D1A*/ 08341300
*/*                                    ENHANCEMENTS              @D1A*/ 08368300
*/*  $T1= OY31350 JBB2220 910301 PDHB: 3490 Device Support.      @T1A*/ 08395300
*/*  $01= OY44131 JBB2220 910615 PDAZ: Correct line comments     @01A*/ 08422300
*/*  $02= OW14241 HBB5510 951013 PDG5: Add new return code       @02A*/ 08436100
*/*                                                                  */ 08450000
*/*******************************************************************/  08454600
*/* - Add new return code 36, which corresponds to Return code   @02A*/ 08454900
*/*   4 reason code 3 from EDTINFO. It is issued for Function 4  @02A*/ 08455200
*/*   (function code 3 in the publications) RTNUCBA, when an     @02A*/ 08455500
*/*   empty UCB list is returned because no none of the UCBs     @02A*/ 08455800
*/*   belonging to the specified unit name or device type are    @02A*/ 08456100
*/*   24-bit, Static or Installation-Static, 3-digit UCBs.       @02A*/ 08456400
*/*   Added comments to complete documentation of earlier        @02A*/ 08456700
*/*   functions and document the new return code. The code       @02A*/ 08457000
*/*   that actually sets the new EDTINFO return code 4 reason    @02A*/ 08457300
*/*   code 3 is in IEFEIS01.                                     @02A*/ 08457600
*/*                                                              @02A*/ 08457900
*/* - Correct the line comments (added for APAR OY31350) causing @01A*/ 08459200
*/*   assembly errors.                                           @01A*/ 08463800
*/* - Added a new input function flag, OVERRIDE, which will      @01C*/ 08468400
*/*   instruct the Unit Verification routine, and subsequent     @01C*/ 08473000
*/*   EDTINFO invocation, to check if the esoteric specified     @01C*/ 08477600
*/*   in the UNITNM field of the Unit Name Table is an           @01C*/ 08482200
*/*   overriding esoteric.  If so, a new output Unit Attribute   @01C*/ 08486800
*/*   flag, OVERESO, will be set.                                @T1A*/ 08491400
*/* - Added a new Return Code Constant, ATRPT4UV (32), to have   @01C*/ 08496000
*/*   a better description of the error resulting from a zero    @01C*/ 08500600
*/*   for the Attribute area pointer.                            @T1A*/ 08505200
*/* - ADDED AN ASTERISK TO THE COMMENT LINE FOR UNITERR      @YA18809*/ 08510000
*/* - UNITERR BIT DEFINED TO INDICATE THAT AN INPUT UNIT     @YA12932*/ 08520000
*/*   ADDRESS IS NOT ASSOCIATED WITH THE INPUT UNIT NAME,    @YA12932*/ 08530000
*/*   LOOKUP VALUE OR DEVICE TYPE.                           @YA12932*/ 08540000
*/* - RETNNAME BIT DEFINED TO INDICATE THAT A NAME LIST SHOULD   @D1A*/ 08550000
*/*   BE RETURNED.  THE INPUT TO THIS FUNCTION IS A ONE BYTE     @D1A*/ 08600000
*/*   DEVICE CLASS IN THE UNIT TABLE.  THE OUTPUT IS POINTED TO  @D1A*/ 08650000
*/*   FROM THE UNIT TABLE AND IS IN THE NAMELS12 TABLE.          @D1A*/ 08700000
*/* - ADDED CONSTANT FOR LENGTH OF ATTRIBUTES TABLE              @L1A*/ 08750000
*/* - SPECSUBP BIT DEFINED TO INDICATE THAT A SUBPOOL HAS        @L1A*/ 08800000
*/*   BEEN SPECIFIED IN THE UNSUBPL TABLE FOR A RETURN UCB       @L1A*/ 08850000
*/*   REQUEST                                                    @L1A*/ 08900000
*/* - MADE BILINGUAL AND DISTRIBUTED FROM AMACLIB                @L1A*/ 08950000
*/* - GROPER4UV CHANGED TO GRPER4UV                          @ZMC0908*/ 09000000
*/* - LUVDEVB BIT DEFINED TO INDICATE THAT INPUT IS IN THE   @G860P44*/ 09050000
*/*   FORM OF LOOK-UP VALUE OR DEVICE TYPE RATHER THAN AN    @G860P44*/ 09100000
*/*   EBCDIC UNITNAME. THIS BIT IS ONLY MEANINGFUL FOR THE   @G860P44*/ 09150000
*/*   CHECK UNITS AND RETURN UCB ADDRESSES FUNCTIONS.        @G860P44*/ 09200000
*/* - LUVDEVT FIELD DEFINED FOR INPUT LOOKUP VALUE OR DEVICE @G860P44*/ 09250000
*/*   TYPE FOR CHECK UNIT FUNCTION                           @G860P44*/ 09300000
*/* - CHKUNSTR BIT DEFINED TO INDICATE THAT THE PARAMETER    @G860P2P*/ 09350000
*/*   LISTS SHOULD NOT BE CHANGED.  THIS BIT IS ONLY VALID   @G860P2P*/ 09400000
*/*   FOR THE CHECK UNITS FUNCTION.                          @G860P2P*/ 09450000
*/* - VARIABLE NAMES ORIGINATING INLINE IN IEFAB4UV HAVE     @G860P2P*/ 09500000
*/*   CHANGED, BUT THE FLAGS REMAIN TO PRESERVE A HISTORY    @G860P2P*/ 09550000
*/*   OF THE FUNCTIONS.                                      @G860P2P*/ 09600000
*/* IEFZB4UV A 000000-999999                                 @G860P2P*/ 09650000
*/********************************************************************/ 09700000
*        %GOTO ZB4UVPLS;               /*                          @L1A 09750000
****************************************************************** @L1A 09800000
*                                                                  @L1A 09850000
FUNCFLGS DSECT                         INPUT FUNCTION FLAGS        @L1A 09900000
FUNCFLG1 DS    XL1                     FIRST BYTE OF FLAGS         @L1A 09950000
CHKGROUP EQU   X'80'                   CHECK FOR GROUP SPLITTING   @L1A 10000000
CHKUNITS EQU   X'40'                   CHECK FOR CORRECT UNITS     @L1A 10050000
RETNUNIT EQU   X'20'                   RETURN UNIT NAME            @L1A 10100000
RETNUCBS EQU   X'10'                   RETURN UCB ADDRESSES        @L1A 10150000
RETGRPID EQU   X'08'                   RETURN GROUP ID FUNCTION    @L1A 10200000
LUVDEVB  EQU   X'04'                   INPUT LUV OR DEVICE TYPE    @L1A 10250000
*                                      FOR CHECK UNIT OR RETURN    @L1A 10300000
*                                      UCB ADDRESS FUNCTIONS       @L1A 10350000
RETNLUV  EQU   X'02'                   RETURN LOOK-UP VALUE        @L1A 10400000
CNVTLUV  EQU   X'01'                   CONVERT DEV TYPE TO LUV     @L1A 10450000
FUNCFLG2 DS    XL1                     SECOND BYTE OF FLAGS        @L1A 10500000
RETNATRB EQU   X'80'                   RETURN ATTRIBUTES           @L1A 10550000
CHKUNSTR EQU   X'40'                   DO NOT STORE INTO PARMLIST  @L1A 10600000
SPECSUBP EQU   X'20'                   USER SPECIFIED SUBPOOL      @L1A 10650000
*                                      FOR RETURN UCBS             @L1A 10700000
RETNNAME EQU   X'10'                   RETURN LIST OF UNIT NAMES   @D1A 10750000
OVERRIDE EQU   X'08'                   Indicates to check if the        10762500
*                                      specified unit name can          10775000
*                                      override.                   @T1A 10787500
         SPACE 2                                                   @L1A 10800000
****************************************************************** @L1A 10850000
*                                                                  @L1A 10900000
UNITTAB  DSECT                         UNIT TABLE                  @L1A 10950000
         DS    0F                      MAKE ON A WORD BOUNDARY     @L1A 11000000
UNITNM   DS    0CL8                    UNIT NAME                   @L1A 11050000
UNGRPIDP DS    0A                      PTR TO GROUP ID TABLE       @L1A 11100000
LUVDEVT  DS    CL4                     LUV OR DEVICE TYPE INPUT    @L1A 11150000
*                                      FOR CHECK UNIT FUNCTION     @L1A 11200000
UNUCBL5P DS    A                       PTR TO INPUT UCB LIST       @L1A 11250000
         DS    0F                      MAKE ON A WORD BOUNDARY     @L1A 11300000
UNLUVDEV DS    0CL4                    LOOK-UP VAL OR DEV TYPE     @L1A 11350000
UNUCBL4P DS    0A                      RETURN UCB LIST PTR         @L1A 11400000
UNITNUMB DS    F                       NUM OF UNIT ADDRS SUPPLIED  @L1A 11450000
UNITADDP DS    0A                      UNIT ADDRESS TABLE PTR      @L1A 11500000
UNATRIBP DS    A                       UNIT ATTIBUTES PTR          @L1A 11550000
UNSUBPL  DS    H                       UNIT SUBPOOL FOR UCB LIST   @L1A 11600000
UNDEVCL  DS    CL1                     DEVICE CLASS FOR SEARCH     @D1C 11650000
         DS    CL1                     RESERVED                    @D1A 11700000
         DS    F                       RESERVED                    @L1A 11750000
*                                                                  @L1A 11800000
         SPACE 2                                                   @L1A 11850000
****************************************************************** @L1A 11900000
*                                                                  @L1A 11950000
GROUPIDD DSECT                         GROUP ID DSECT POINTED TO   @L1A 12000000
*                                      BY UNGRPIDP                 @L1A 12050000
GROUPID  DS    F                       ARRAY OF GROUP IDS          @L1A 12100000
*                                                                  @L1A 12150000
         SPACE 2                                                   @L1A 12200000
****************************************************************** @L1A 12250000
*                                                                  @L1A 12300000
UCBLIST5 DSECT                         INPUT UCB LIST (FUNC 5)     @L1A 12350000
*                                      POINTED TO BY UNUCBL5P      @L1A 12400000
LIST5NUM DS    F                       NUMBER ENTRIES              @L1A 12450000
LIST5UCB DS    A                       ARRAY OF UCB ADDRESSES      @L1A 12500000
*                                                                  @L1A 12550000
         SPACE 2                                                   @L1A 12600000
****************************************************************** @L1A 12650000
*                                                                  @L1A 12700000
UCBLIST4 DSECT                         RETURNED UCB LIST (FUNC 4)  @L1A 12750000
*                                      POINTED TO BY UNUCBL4P      @L1A 12800000
LIST4HDR DS    0D                                                  @L1A 12850000
LIST4SP  DS    AL1                     SUBPOOL OF LIST             @L1A 12900000
LIST4SIZ DS    AL3                     LENGTH OF LIST              @L1A 12950000
LIST4NUM DS    F                       NUMBER OF ENTRIES           @L1A 13000000
LIST4UCB DS    A                       ARRAY OF UCB ADDRESSES      @L1A 13050000
*                                                                  @L1A 13100000
         SPACE 2                                                   @L1A 13150000
****************************************************************** @D1A 13200000
*                                                                  @D1A 13250000
NAMELS12 DSECT                         RETURNED NAME LIST (FUNC12) @D1A 13300000
*                                      POINTED TO BY UNNML12P      @D1A 13350000
LST12HDR DS    0D                                                  @D1A 13400000
LST12SPL DS    AL1                     SUBPOOL OF LIST             @D1A 13450000
LST12SIZ DS    AL3                     LENGTH OF LIST              @D1A 13500000
LST12NUM DS    F                       NUMBER OF ENTRIES           @D1A 13550000
LST12NAM DS    CL8                     ARRAY OF UNIT NAMES         @D1A 13600000
*                                                                  @D1A 13650000
         SPACE 2                                                   @D1A 13700000
****************************************************************** @L1A 13750000
*                                                                  @L1A 13800000
UNITADRS DSECT                         UNIT ADDRESSES (FUNC 1,2)   @L1A 13850000
*                                      POINTED TO BY UNITADDP      @L1A 13900000
         DS    0F                      MAKE ON A WORD BOUNDARY     @L1A 13950000
ADDRS    DS    CL3                     ARRAY OF EBCDIC ADDRESSES   @L1A 14000000
UNADRFLG DS    XL1                     UNIT ADDRESS FLAG           @L1A 14050000
INVALID  EQU   X'80'                   INVALID ADDRESS             @L1A 14100000
UNITERR  EQU   X'40'                   UNIT NOT ASSOCIATED     @YA12932 14116600
*                                      WITH INPUT UNIT NAME    @YA18809 14133200
*                                                                  @L1A 14150000
         SPACE 2                                                   @L1A 14200000
****************************************************************** @L1A 14250000
*                                                                  @L1A 14300000
ATRIBUTS DSECT                         UNIT ATTRIBUTES (FUNC 9)    @L1A 14350000
*                                      POINTED TO BY UNATRIBP      @L1A 14400000
         DS    0F                      MAKE ON A WORD BOUNDARY     @L1A 14450000
ATRLEN   DS    FL1                     LENGTH OF AREA              @L1A 14500000
ATRFLGS  DS    0XL2                    ATTRIBUTE FLAGS             @L1A 14550000
ATRFLG1  DS    XL1                     FIRST BYTE OF FLAGS         @L1A 14600000
ESOTERIC EQU   X'80'                   UNIT IS AN ESOTERIC         @L1A 14650000
VIOELIG  EQU   X'40'                   UNIT IS VIO ELIGIBLE        @L1A 14700000
V3330    EQU   X'20'                   CONTAINS 3330V UNITS        @L1A 14750000
TPCLASS  EQU   X'10'                   CONTAINS TP DEVICES         @L1A 14800000
ATRFLG2  DS    XL1                     SECOND BYTE OF FLAGS        @L1A 14850000
OVERESO  EQU   X'80'                   Indicates the specified unit     14875000
*                                      name is an overriding esoteric.  14900000
*                                                                  @T1A 14925000
DEVCLAS# DS    CL1                     NUM OF DEVICE CLASSES       @L1A 14950000
GENDEV#  DS    CL4                     NUM OF GENERIC DEV. TYPES   @L1A 15000000
         DS    CL2                     RESERVED                    @L1A 15050000
ATRLENC  EQU   *-ATRIBUTS              LENGTH OF ATRIBUTS          @L1A 15100000
         SPACE 2                                                   @L1A 15150000
****************************************************************** @L1A 15200000
*                                                                  @L1A 15250000
*                      RETURN CODE CONSTANTS                       @L1A 15300000
*                                                                  @L1A 15350000
****************************************************************** @L1A 15400000
SUCES4UV DC    F'0'                  SUCCESSFUL OPERATION          @L1A 15450000
NAMER4UV DC    F'4'                  INPUT VALUE NOT FOUND IN EDT  @L1A 15500000
UNITR4UV DC    F'8'                  INCORRECT UNITS ASSOCIATED    @L1A 15550000
*                                    WITH UNIT NAME                @L1A 15600000
GRPER4UV DC    F'12'                 INVALID DEVICE GROUPINGS FOR  @L1A 15650000
*                                    INPUT UNIT ADDRESSES          @L1A 15700000
GETER4UV DC    F'16'                 GETMAIN ERROR                 @L1A 15750000
ADDRE4UV DC    F'20'                 INPUT UNIT ADDRESS INVALID    @L1A 15800000
ENVER4UV DC    F'24'                 ENVIRONMENT NOT SET UP        @L1A 15850000
FNCER4UV DC    F'28'                 INVALID, MUTUALLY EXCLUSIVE,  @L1A 15900000
*                                    AND/OR NO FUNCTION REQUESTED  @L1A 15950000
*                                    OR NO LIST INPUT FOR FUNCTION @L1A 16000000
*                                    1, 2, 5, OR 9                 @L1A 16050000
ATRPT4UV DC    F'32'                 A pointer to the attribute    @T1A 16060000
*                                    area is required for the      @T1A 16070000
*                                    specified function(s) but     @T1A 16080000
*                                    is zero.                      @T1A 16090000
NOTAC4UV DC    F'36'                 None of the units within the  @02A 16091400
*                                    specified unit name are       @02A 16092800
*                                    accessible via the IEFEB4UV   @02A 16094200
*                                    /IEFAB4UV/IEFGB4UV interface  @02A 16095600
*                                    (i.e. no 3-digit, STATIC,     @02A 16097000
*                                    devices with 24-bit UCBs).    @02A 16098400
****************************************************************** @L1A 16100000
         MEND  ,                                                   @L1A 16150000
                                                                 @L1A*/ 16200000
*%ZB4UVPLS:  ;                         /*                        @L1A*/ 16250000
*@EJECT;                                                                16275000
*DCL                                                                    16300000
*%IF FUNCDEF = '' %THEN                /*                        @L1A*/ 16350000
*    %GOTO FUNC1;                      /*                        @L1A*/ 16400000
*  1 FUNCFLGS FUNCDEF,                 /*INPUT FLAGS             @L1A*/ 16450000
*    %GOTO FUNC2;                      /*                        @L1A*/ 16500000
*%FUNC1: ;                             /*                        @L1A*/ 16550000
*  1 FUNCFLGS BIT(16) BDY(WORD),       /*INPUT FLAGS             @L1C*/ 16600000
*%FUNC2: ;                             /*                        @L1A*/ 16650000
*   2 CHKGROUP BIT(1),                 /*CHECK FOR GROUP SPLITTING   */ 16700000
*   2 CHKUNITS BIT(1),                 /*CHECK FOR CORRECT UNITS     */ 16750000
*   2 RETNUNIT BIT(1),                 /*RETURN UNIT NAME            */ 16800000
*   2 RETNUCBS BIT(1),                 /*RETURN UCB ADDRS    @Y30LPPC*/ 16850000
*   2 RETGRPID BIT(1),                 /*RETURN GROUP ID FCN @Z40LPPE*/ 16900000
*   2 LUVDEVB  BIT(1),                 /*INPUT LUV OR DEVICE TYPE FOR   16950000
*                                      CHECK UNIT OR RETURN UCB ADDRS   17000000
*                                      FUNCTIONS             @G860P44*/ 17050000
*   2 RETNLUV  BIT(1),                 /*RETURN LOOK-UP-VALUE        */ 17100000
*   2 CNVTLUV  BIT(1),                 /*CONVERT DEV TYPE TO LUV     */ 17150000
*   2 RETNATRB BIT(1),                 /*RETURN ATTRIBUTES           */ 17200000
*   2 CHKUNSTR BIT(1),                 /*DO NOT STORE INTO PARMLIST     17250000
*                                                            @G860P2P*/ 17300000
*   2 SPECSUBP BIT(1),                 /*USER SPECIFIED SUBPOOL         17350000
*                                        FOR  UCBLIST FUNC(4)           17400000
*                                        OR NAME LIST FUNC(12)   @D1C*/ 17450000
*   2 RETNNAME BIT(1),                 /*RETURN UNIT NAMES FOR          17500000
*                                        DEVICE CLASS            @D1A*/ 17550000
*   2 OVERRIDE BIT(1),              /* Indicates to check if the        17570000
*                                      specified unit name is an        17590000
*                                      overriding esoteric.      @T1A*/ 17610000
*   2 *        BIT(3);              /* Not used and available.   @T1C*/ 17630000
* @SPACE (2);                                                           17650000
*DCL                                                                    17700000
*%IF UTDEF = '' %THEN                  /*                        @L1A*/ 17750000
*    %GOTO UTLAB1;                     /*                        @L1A*/ 17800000
*  1 UNITTAB UTDEF,                    /*UNIT TABLE              @L1A*/ 17850000
*    %GOTO UTLAB2;                     /*                        @L1A*/ 17900000
*%UTLAB1: ;                            /*                        @L1A*/ 17950000
*  1 UNITTAB BDY(WORD),                /*UNIT TABLE              @L1C*/ 18000000
*%UTLAB2: ;                            /*                        @L1A*/ 18050000
*   2 UNITNM CHAR(8) BDY(WORD),        /*UNIT NAME                   */ 18100000
*    3 UNGRPIDP PTR(31),               /*PTR-GROUP ID TABLE  @Z40LPPE*/ 18150000
*      4 LUVDEVT CHAR(4),              /*LUV OR DEVICE TYPE INPUT FOR   18200000
*                                       CHECK UNIT FUNCTION @G860P44*/  18250000
*    3 UNUCBL5P PTR(31),               /*PTR-INPUT UCB LIST  @Z40LPPE*/ 18300000
*      4 UNNML12P PTR(31),             /*PTR RETURN NAME LIST    @D1A*/ 18350000
*   2 UNLUVDEV CHAR(4) BDY(WORD),      /*LOOK-UP-VAL & DEVICE TYPE   */ 18400000
*    3 UNUCBL4P PTR(31),               /*RETN UCB LIST PTR   @Y30LPPC*/ 18450000
*     4 UNITNUMB FIXED(31),            /*NO. UNIT ADDRESSES SUPPLIED */ 18500000
*   2 UNITADDP PTR(31),                /*UNIT ADDRRESS TABLE PTR     */ 18550000
*    3 UNATRIBP PTR(31),               /*UNIT ATTRIBUTES PTR     @L1C*/ 18600000
*   2 *       FIXED(31),               /*                        @D1A*/ 18650000
*    3 UNSUBPL FIXED(15),              /*SUBPOOL FOR UCB LIST    @D1C*/ 18700000
*    3 UNDEVCL CHAR(1),                /*DEVICE CLASS FOR SEARCH @D1A*/ 18750000
*    3 *       CHAR(1),                /*RESERVED                @D1A*/ 18800000
*   2 *       FIXED(31);               /*RESERVED                @L1A*/ 18850000
* @SPACE (2);                                                           18900000
*DCL GROUPID (*) FIXED(31) BASED(UNGRPIDP);  /*GRP ID ARRAY (FUNC 5) */ 18950000
* @SPACE (2);                                                           19000000
*DCL                                                                    19050000
*  1 UCBLIST5 BASED(UNUCBL5P),         /*INPUT UCB LIST (FUNC 5)     */ 19100000
*   2 LIST5NUM FIXED(31),              /*NUMBER OF ENTRIES           */ 19150000
*   2 LIST5UCB (*) PTR(31);            /*ARRAY OF UCB ADDRESSES      */ 19200000
* @SPACE (2);                                                           19250000
* DCL                                                                   19300000
*   1 UCBLIST4 BASED(UNUCBL4P),        /* RETURNED UCB LIST (FUNC 4) */ 19350000
*    2 LIST4HDR,                                                        19400000
*     3 LIST4SP  FIXED(8),             /* SUBPOOL OF LIST    @Y30LPPC*/ 19450000
*     3 LIST4SIZ FIXED(24),            /* LENGTH OF LIST     @Y30LPPC*/ 19500000
*     3 LIST4NUM FIXED(31),            /* NUMBER OF ENTRIES  @Y30LPPC*/ 19550000
*    2 LIST4UCB(*) PTR(31);            /*UCB ADDRS (ARRAY)   @Y30LPPC*/ 19600000
* @SPACE (2);                                                           19650000
* DCL                                                                   19700000
*   1 NAMELS12 BASED(UNNML12P),        /* RETURNED NAME LIST            19750000
*                                         (FUNC 12)              @D1A*/ 19800000
*    2 LST12HDR,                       /*                        @D1A*/ 19850000
*     3 LST12SPL FIXED(8),             /* SUBPOOL OF LIST        @D1A*/ 19900000
*     3 LST12SIZ FIXED(24),            /* LENGTH OF LIST         @D1A*/ 19950000
*     3 LST12NUM FIXED(31),            /* NUMBER OF ENTRIES      @D1A*/ 20000000
*    2 LST12NAM(*) CHAR(8);            /* GENERIC OR ESOTERIC NAME      20050000
*                                                                @D1A*/ 20100000
* @SPACE (2);                                                           20150000
*DCL                                                                    20200000
*  1 UNITADRS (*) BASED(UNITADDP),     /*UNIT ADDRESSES (FUNC 1,2)   */ 20250000
*   2 ADDRS CHAR(3),                   /*EBCDIC ADDRESSES            */ 20300000
*   2 *     BIT(8),                                                     20350000
*    3 INVALID BIT(1),                 /*UNIT ADDRESS INVALID        */ 20375000
*    3 UNITERR BIT(1);                 /*UNIT NOT ASSOCIATED WITH       20400000
                                         INPUT UNIT NAME     @YA12932*/ 20425000
* @SPACE (2);                                                           20450000
*DCL                                                                    20500000
*  1 ATRIBUTS BASED(UNATRIBP),      /* Unit Attributes for functions    20534200
                                       9 and 13.                 @T1C*/ 20568400
*    3 ATRLEN   FIXED(8),           /* Length of attribute area.     */ 20602600
*    3 ATRFLGS  BIT(16),            /* Attribute flags.              */ 20636800
*      5 ATRFLG1  BIT(8),           /* First byte of flags.      @T1A*/ 20671000
*        7 ESOTERIC BIT(1),         /* Unit is an esoteric.          */ 20705200
*        7 VIOELIG  BIT(1),         /* Unit is VIO eligible.         */ 20739400
*        7 V3330    BIT(1),         /* Contains 3330V units.         */ 20773600
*        7 TPCLASS  BIT(1),         /* Contains TP devices.          */ 20807800
*        7 *        BIT(4),         /* Not used and available.   @T1A*/ 20842000
*      5 ATRFLG2  BIT(8),           /* Second byte of flags.     @T1A*/ 20876200
*        7 OVERESO  BIT(1),         /* Indicates that the associated    20910400
                                       unit name can override.   @T1A*/ 20944600
*        7 *        BIT(7),         /* Not used and available.   @T1A*/ 20978800
*    3 DEVCLAS# CHAR(1),            /* Number of device classes.     */ 21013000
*    3 GENDEV#  CHAR(4),            /* Number of generic device types*/ 21047200
*    3 *        CHAR(2);            /* Reserved.                     */ 21081400
*@EJECT;                                                                21115600
*/********************************************************************/ 21150000
*/*                                                              @L1A*/ 21200000
*/*                    MISCELLANEOUS CONSTANTS                   @L1A*/ 21250000
*/*                                                              @L1A*/ 21300000
*/********************************************************************/ 21350000
*@SPACE (3);                                                            21400000
*DCL                                                                    21450000
*  ATRLENC   FIXED(8)  CONSTANT(LENGTH(ATRIBUTS));                      21500000
*                                      /* LENGTH OF ATRIBUTS     @L1A*/ 21550000
*/********************************************************************/ 21600000
*/*                                                                  */ 21650000
*/*                    RETURN CODE CONSTANTS                         */ 21700000
*/*                                                                  */ 21750000
*/********************************************************************/ 21800000
*@SPACE (3);                                                            21850000
*DCL                                                                    21900000
*  SUCES4UV  FIXED(31) CONSTANT(0),    /*SUCCESSFUL OPERATION           21950000
*                                                            @G860P44*/ 22000000
*  NAMER4UV  FIXED(31) CONSTANT(4),    /*INPUT VALUE NOT FOUND IN EDT   22050000
*                                                            @G860P44*/ 22100000
*  UNITR4UV  FIXED(31) CONSTANT(8),    /*INCORRECT UNITS ASSOCIATED     22150000
*                                        WITH UNIT NAME      @G860P44*/ 22200000
*  GRPER4UV  FIXED(31) CONSTANT(12),   /*INVALID DEVICE GROUPINGS FOR   22250000
*                                        INPUT UNIT ADDRESSES           22300000
*                                                            @ZMC0908*/ 22350000
*  GETER4UV  FIXED(31) CONSTANT(16),   /*GETMAIN ERROR       @G860P44*/ 22400000
*  ADDRE4UV  FIXED(31) CONSTANT(20),   /*INPUT UNIT ADDRESS INVALID     22450000
*                                                            @G860P44*/ 22500000
*  ENVER4UV  FIXED(31) CONSTANT(24),   /*ENVIRONMENT NOT SET UP         22550000
*                                                            @G860P44*/ 22600000
*  FNCER4UV  FIXED(31) CONSTANT(28),   /*INVALID, MUTUALLY EXCLUSIVE,   22650000
*                                        AND/OR NO FUNCTION REQUESTED   22700000
*                                        OR NO INPUT LIST FOR FUNCTION  22750000
*                                        1, 2, 5, OR 9           @D1C*/ 22800000
*  ATRPT4UV  FIXED(31) CONSTANT(32), /* A pointer to the attribute      22850000
*                                       area is required for the        22900000
*                                       specified function(s) but       22950000
*                                       is zero.                 @02C*/ 23000000
*  NOTAC4UV  FIXED(31) CONSTANT(36); /* None of the units within the    23050000
*                                       specified unit name are         23100000
*                                       accessible via the IEFEB4UV     23150000
*                                       /IEFAB4UV/IEFGB4UV interface    23200000
*                                       (i.e. no 3-digit, STATIC,       23250000
*                                       devices with 24-bit UCBs)       23300000
*                                                                @02C*/ 23350000
