*%DCL IEWPMAR_INCLUDE CHAR EXTERNAL;                                    00050000
*%IF IEWPMAR_INCLUDE ^= 'DONE' %THEN %DO;                               00100000
*%IEWPMAR_INCLUDE = 'DONE';                                             00150000
*                                                                       00200000
*/* BILINGUAL IEWPMAR MAPPING MACRO                                     00250000
         MACRO                                                          00300000
         IEWPMAR &DSECT=YES                                             00350000
** START OF SPECIFICATIONS ******************************************** 00400000
**01* PROPRIETARY_STATEMENT******************************************** 00800000
**                                                                    * 00850000
** LICENSED MATERIALS - PROPERTY OF IBM                               * 00900000
** THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                        * 00950000
** 5647-A01 (C) COPYRIGHT IBM CORP. 1991, 2000                        * 01000000
**                                                                    * 01050000
** STATUS= HBB7703                                                    * 01100000
**                                                                    * 01150000
****END_OF_PROPRIETARY_STATEMENT*************************************** 01200000
**                                                                    * 01250000
**01* EXTERNAL CLASSIFICATION: PI                                     * 01300000
**01* END OF EXTERNAL CLASSIFICATION:                                 * 01350000
**                                                                    * 01400000
**01* MACRO NAME: IEWPMAR                                             * 01403500
**                                                                    * 01407000
**01* DESCRIPTIVE NAME: Program Management Attribute Record           * 01410500
**02* ACRONYM: PMAR                                                   * 01414000
**                                                                    * 01417500
**01* DSECT NAME:                                                     * 01421000
**      PMAR_RS                                                       * 01424500
**                                                                    * 01428000
**01* COMPONENT: Loader (SCLDR)                                       * 01431500
**                                                                    * 01435000
**01* EYE-CATCHER: None                                               * 01438500
**                                                                    * 01442000
**01* STORAGE ATTRIBUTES:                                             * 01445500
**02* SUBPOOL: variable                                               * 01449000
**02* KEY:     variable                                               * 01452500
**                                                                    * 01456000
**01* SIZE: variable                                                  * 01459500
**                                                                    * 01463000
**01* CREATED BY: user                                                * 01466500
**                                                                    * 01470000
**01* DELETED BY: user                                                * 01473500
**                                                                    * 01477000
**01* POINTED TO BY: N/A                                              * 01480500
**                                                                    * 01484000
**01* SERIALIZATION: None                                             * 01487500
**                                                                    * 01491000
**01* FUNCTION:                                                       * 01494500
**     IEWPMAR maps a program's user data in an SMDE and declares     * 01500000
**     constants and mappings for use by routines which manipulate    * 01550000
**     program user data.                                             * 01600000
**                                                                    * 01650000
**     The PMAR mappping is for program attributes which are          * 01700000
**     common to all types of program.  The PMARL and PMARR           * 01750000
**     mappings are for attributes which are unique to specific       * 01800000
**     types of program.  For program objects (SMDE_LFMT is on),      * 01850000
**     the program's user data is mapped by PMAR followed by          * 01900000
**     PMARL. For load modules (SMDE_LFMT is off), the program's      * 01950000
**     user data is mapped by PMAR followed by PMARR.                 * 02000000
**                                                                    * 02050000
**     The PMARA mapping does not map any data in the SMDE. It is     * 02100000
**     used internally by Program Management routines when            * 02150000
**     manipulating program directory entries.                        * 02200000
**                                                                    * 02250000
**                                                                    * 02300000
**01* METHOD OF ACCESS:                                               * 02350000
**02* ASM:                                                            * 02400000
**         IEWPMAR                                                    * 02450000
**02* PL/X:                                                           * 02500000
**         %DCL PMAR__BASE CHAR EXT                                   * 03150000
**         %PMAR__BASE = <'BASING_EXPRESSION'|'BASED'>                * 03200000
**                                            -----                   * 03250000
**         %DCL PMARA__BASE CHAR EXT                                  * 03300000
**         %PMARA__BASE = <'BASING_EXPRESSION'|'BASED'>               * 03350000
**                                            -----                   * 03400000
**         %INCLUDE SYSLIB(IEWPMAR)                                   * 03450000
**                                                                    * 03500000
**         IEWPMAR is included by mapping macro IGWSMDE which maps    * 03550000
**         the SMDE fields.  A program's user data in an SMDE is      * 03600000
**         addressed by adding SMDE_PMAR_OFF to the address of the    * 03650000
**         SMDE.                                                      * 03700000
**                                                                    * 03750000
**01* DEPENDENCIES: None                                              * 03800000
**                                                                    * 03850000
**01* DISTRIBUTION LIBRARY: AMACLIB                                   * 03900000
**                                                                    * 03950000
**01* NOTES: None                                                     * 04000000
**   CHANGE ACTIVITY:                                                 * 04450000
**                                                                    * 04500000
**  $L0=PGMMGMT,JDZ1110,870714,STLSAM:                                * 04550000
**  $L1=PMBINDER,JDZ1110,910628,SJPLPCC: PMAR EXTRACT SUPPORT         * 04600000
**  $P1=KMM1133 ,JDZ1110,911018,SJPLPCC: POSIX SUPPORT                * 04650000
**  $P2=KMM2162 ,JDZ1110,920428,SJPLLTH: PMAR FORMAT CHANGES          * 04700000
**  $01=OW02551,HDZ11B0,940510,SJPLGIN: CONVERT TO BILINGUAL      @01A* 04750000
**  $L2=PM2    ,HDZ11C0,940626,SJPLRK: PM2-Level program object   @L2A* 04800000
**  $02=OW09009,HDZ11B0,941020,SJPLREB: AE OW02551                @02A* 04850000
**  $L3=PM3    ,JSPE002,951205,SJPLRK: PM3-Level program object   @L3A* 04900000
**  $L4=HPLINK .HDZ11E0,980729,SJPLLB: HPLINK support             @L4A* 04950000
**  $L6=PXDxxxx HBB7703 991130 PD00XB: binder on CMS                  * 04983200
** END OF SPECIFICATIONS *********************************************/ 05000000
* %GOTO PMARPLS;                                                        05050000
.* TEST FOR THIS DSECT ALREADY INVOKED, IF SO EXIT                      05100000
.*                                                                      05150000
         GBLB  &SYSIEWPMAR                                              05200000
.*                                                                      05250000
         AIF   (&SYSIEWPMAR EQ 1).ENDMAC                                05300000
&SYSIEWPMAR  SETB 1                                                     05350000
.*                                                                      05400000
**********************************************************************  05450000
**  Attributes common to all types of program. The PMAR data is         05500000
**  always present at offset SMDE_PMAR_OFF in an SMDE.                  05550000
**********************************************************************  05600000
PMAR               DSECT             Basic section of program user data 05650000
PMAR_ENTRY         DS   0CL30    Alternative name for the PMAR section  05700000
PMAR_SLEN          DS   H              Section length.                  05750000
PMAR_LVL           DS   B              PMAR format level                05800000
PMAR_LVL_VAL       EQU  X'03'          level constant              @L3C 05850000
PMAR_PM1_VAL       EQU  X'01'          level constant for PO1      @L2A 05900000
PMAR_PM2_VAL       EQU  X'02'          level constant for PO2      @L2A 05950000
PMAR_PM3_VAL       EQU  X'03'          level constant for PO3      @L3A 06000000
PMAR_PLVL          DS   AL1            Bind processor creating object   06050000
PMAR_PLVL_E_VAL    EQU  X'01'          E-level constant                 06100000
PMAR_PLVL_F_VAL    EQU  X'02'          F-level constant                 06150000
PMAR_PLVL_AOS_VAL  EQU  X'03'          AOS-level constant               06200000
PMAR_PLVL_XA_VAL   EQU  X'04'          XA-level constant                06250000
PMAR_PLVL_B1_VAL   EQU  X'05'          Binder version 1                 06300000
PMAR_PLVL_B2_VAL   EQU  X'06'          Binder version 2            @L2A 06350000
PMAR_PLVL_B3_VAL   EQU  X'07'          Binder version 3            @L3A 06400000
*                                        1 - E-level linkage editor     06450000
*                                        2 - F-level linkage editor     06500000
*                                        3 - AOS (VS1/VS2)              06550000
*                                            linkage editor             06600000
*                                        4 - XA linkage editor          06650000
*                                        5 - binder version 1           06700000
*                                        6 - binder version 2      @L2A 06750000
*                                        7 - binder version 3      @L3A 06800000
PMAR_ATR           DS   0CL4           Attribute bytes.                 06850000
PMAR_ATR1          DS   B              First attribute byte.            06900000
*                                      These flags must be at the same  06950000
*                                      offsets as the corresponding     07000000
*                                      flags in PDS2ATR1 declared by    07050000
*                                      macro IHAPDS.                    07100000
PMAR_RENT          EQU  X'80'          Reenterable                      07150000
PMAR_REUS          EQU  X'40'          Reusable                         07200000
PMAR_OVLY          EQU  X'20'          Overlay structure                07250000
PMAR_TEST          EQU  X'10'          Module to be tested - TESTRAN    07300000
PMAR_LOAD          EQU  X'08'          Only loadable                    07350000
PMAR_SCTR          EQU  X'04'          Scatter format                   07400000
PMAR_EXEC          EQU  X'02'          Executable                       07450000
PMAR_1BLK          EQU  X'01'          Load module contains only one    07500000
*                                      block of text data and has no    07550000
*                                      rld data.                        07600000
PMAR_ATR2          DS   B              Second attribute byte.           07650000
*                                      These flags must be at the same  07700000
*                                      offsets as the corresponding     07750000
*                                      flags in PDS2ATR2 declared by    07800000
*                                      macro IHAPDS.                    07850000
PMAR_FLVL          EQU  X'80'          If on, the program cannot be     07900000
*                                      processed by the e level         07950000
*                                      linkage editor.                  08000000
*                                      If off, the program can be       08050000
*                                      processed by any level of the    08100000
*                                      linkage editor or the Binder.    08150000
PMAR_ORG0          EQU  X'40'          Linkage editor assigned origin   08200000
*                                      of first block of text is        08250000
*                                      zero.                            08300000
*                  EQU  X'20'          RESERVED                         08350000
PMAR_NRLD          EQU  X'10'          Program contains no RLD items    08400000
PMAR_NREP          EQU  X'08'          Module cannot be reprocessed     08450000
*                                      by the linkage editor            08500000
PMAR_TSTN          EQU  X'04'          Module contains TESTRAN symbol   08550000
*                                      cards                            08600000
*                  EQU  X'02'          RESERVED                         08650000
PMAR_REFR          EQU  X'01'          Refreshable program              08700000
PMAR_ATR3          DS   0B             Third attribute byte.            08750000
PMAR_FTB1          DS   B              Alternative name for flags byte  08800000
*                                      These flags must be at the same  08850000
*                                      offsets as the corresponding     08900000
*                                      flags in PDS2FTB1 declared by    08950000
*                                      macro IHAPDS.                    09000000
*                  EQU  X'80'          RESERVED                         09050000
PMAR_BIG           EQU  X'40'          This program requires 16M bytes  09100000
*                                      or more of virtual storage       09150000
PMAR_PAGA          EQU  X'20'          Page alignment is required       09200000
PMAR_XSSI          EQU  X'10'          SSI information present          09250000
PMAR_XAPF          EQU  X'08'          APF information present          09300000
PMAR_LFMT          EQU  X'04'          PMARL follows PMAR.              09350000
*                  EQU  X'02'          RESERVED                         09400000
*                  EQU  X'01'          RESERVED                         09450000
PMAR_ATR4          DS   0B             Fourth attribute byte            09500000
PMAR_FTB2          DS   B              Alternative name for flags byte  09550000
*                                      These flags must be at the same  09600000
*                                      offsets as the corresponding     09650000
*                                      flags in PDS2FTB2 declared by    09700000
*                                      macro IHAPDS.                    09750000
PMAR_ALTP          EQU  X'80'          Alternate primary flag. If on    09800000
*                                      for a primary name, indicates    09850000
*                                      primary name was generated by    09900000
*                                      the Binder. If on for an alias   09950000
*                                      name, indicates the long alias   10000000
*                                      name was specified as the        10050000
*                                      primary name on the bind.   @L2A 10100000
PMAR_RMOD          EQU  X'10'          RMODE is ANY.                    10150000
PMAR_AAMD          EQU  X'0C'          Alias entry point addressing     10200000
*                                      mode                             10233300
*                                      If B'00', AMODE is 24.           10266600
*                                      If B'10', AMODE is 31. Is        10300000
*                                      B'11', AMODE is ANY.             10350000
PMAR_AAMD_MASKOFF  EQU  X'F3'          Mask for AMODE flags             10400000
*                                      in xxxFTB2 flag bytes.           10450000
PMAR_MAMD          EQU  X'03'          Main entry point addressing      10500000
*                                      mode                             10533300
*                                      If B'00', AMODE is 24.           10566600
*                                      If B'10', AMODE is 31. If        10600000
*                                      B'11', AMODE is ANY.             10650000
                   DS   X              RESERVED                         10700000
PMAR_AC            DS   X              APF authorization code           10750000
PMAR_STOR          DS   XL4            Virtual storage required         10800000
PMAR_EPM           DS   XL4            Main entry point offset          10850000
PMAR_EPA           DS   XL4            This entry point offset          10900000
PMAR_SSI           DS   0XL4           SSI information                  10950000
PMAR_CHLV          DS   X              Change level of member           11000000
PMAR_SSFB          DS   B              SSI flag byte                    11050000
PMAR_MSER          DS   CL2            Member serial number             11100000
                   DS   XL4            Reserved                         11150000
PMAR_END           DS   0C             END OF BASIC SECTION             11200000
*                                                                       11250000
*********************************************************************** 11300000
**  LSLoader attributes which are unique to program objects.            11350000
**  IfPMAR_LFMT=ON this section follows the PMAR basic section.         11400000
*********************************************************************** 11450000
*                                                                       11500000
PMARL              DSECT                              LSLoader          11550000
*                                      section for program objects      11600000
PMARL_SLEN         DS   H              Section length                   11650000
PMARL_DATA         DS   0CL48          Section Data                     11700000
PMARL_ATR          DS   0CL4           Attribute bytes                  11750000
PMARL_ATR1         DS   B              Fifth attribute byte             11800000
PMARL_NMIG         EQU  X'80'          This program object cannot be    11850000
*                                      converted directly to PDS load   11900000
*                                      module format.                   11950000
PMARL_PRIM         EQU  X'40'          FETCHOPT PRIME option            12000000
PMARL_PACK         EQU  X'20'          FETCHOPT PACK option             12050000
PMARL_HPL          EQU  X'10'          Module requires HPLINK suppo@L4A 12100000
PMARL_ATR2         DS   B              Sixth attribute byte             12150000
PMARL_CMPR         EQU  X'80'          Compressed format module         12200000
PMARL_1RMOD        EQU  X'40'          1st segment is RMODE Any,   @L2A 12250000
*                                       set for PM2-level PO only  @L2A 12300000
PMARL_2RMOD        EQU  X'20'          2nd segment is RMODE Any,   @L2A 12350000
*                                       set for PM2-level PO if    @L2A 12400000
*                                       there are at least two     @L2A 12450000
*                                       segments.                  @L2A 12500000
PMARL_1ALIN        EQU  X'08'          1st segment is page-aligned,@L2A 12550000
*                                       set for PM2-level PO only  @L2A 12600000
PMARL_2ALIN        EQU  X'04'          2nd segment is page-aligned,@L2A 12650000
*                                       set for PM2-level PO if    @L2A 12700000
*                                       there are at least 2       @L2A 12750000
*                                       segments.                  @L2A 12800000
PMARL_FILL         EQU  X'02'          FILL option specified       @L2A 12850000
*                                       set for PM2-level PO only  @L2A 12900000
PMARL_FILLVAL      DS   CL1            FILL character value        @L2A 12950000
*                                       set for PM2-level PO only  @L2A 13000000
PMARL_RSVD         DS   X              Reserved                    @L6A 13050000
PMARL_MPGS         DS   XL4            Total length of program on       13100000
*                                       DASD in pages (excluding gas).  13150000
PMARL_MDAT         DS   0CL40          DASD program descriptors         13200000
PMARL_TXTL         DS   XL4            Length of initial load text on   13250000
*                                       DASD including gas.             13300000
PMARL_TXTO         DS   AL4            Offset to text                   13350000
PMARL_BDRL         DS   XL4            Length of Binder index           13400000
PMARL_BDRO         DS   AL4            Offset to Binder index           13450000
PMARL_RDTL         DS   XL4            Length of PRDT                   13500000
PMARL_RDTO         DS   AL4            Offset to PRDT                   13550000
PMARL_RATL         DS   XL4            Length of PRAT                   13600000
PMARL_RATO         DS   AL4            Offset to PRAT                   13650000
PMARL_NVSPGS       DS   0XL4           Number of virtual storage   @L2A 13700000
*                                       pages to contain program   @L2A 13750000
*                                       object, for PM2-level PO   @L2A 13800000
PMARL_LMDL         DS   XL4            Length of LSLoader data,         13850000
*                                       for PM1-level PO           @L2C 13900000
PMARL_LMDO         DS   AL4            Offset to LSLoader data          13950000
PMARL_PM2          DS   0CL24          New fields for PM2-Level    @L2A 14000000
*                                       object                     @L2A 14050000
PMARL_NSEG         DS   XL2            Number of loadable segments @L2A 14100000
PMARL_NGAS         DS   XL2            Count of entries in Gas     @L2A 14150000
*                                       Table                      @L2A 14200000
PMARL_1STOR        DS   XL4            Virtual storage required    @L2A 14250000
*                                       for first loadable segment,@L2A 14300000
*                                       valid when PMARL_NSEG > 1. @L2A 14350000
PMARL_2STOR        DS   XL4            Virtual storage required    @L2A 14400000
*                                      for second loadable segment,@L2A 14450000
*                                       valid when PMARL_NSEG > 1. @L2A 14500000
PMARL_2TXTO        DS   XL4            Offset to second txt segment@L2A 14550000
*                                       including gas, valid when  @L2A 14600000
*                                       PMARL_NSEG > 1.            @L2A 14650000
PMARL_TRACE        DS   0CL16          Audit trace data            @L2A 14700000
PMARL_DATE         DS   XL4            Date saved                  @L2A 14750000
PMARL_TIME         DS   XL4            Time saved                  @L2A 14800000
PMARL_USER         DS   CL8            User or job identification  @L2A 14850000
PMARL_PM3          DS   0CL16          New fields for PM3-Level    @L3A 14900000
*                                        object                    @L3A 14950000
PMARL_PM3FL1       DS   B              Flag byte                   @L3A 15000000
PMARL_HIDE         EQU  X'80'          Name is an alias that can   @L3A 15050000
*                                        be hidden                 @L3A 15100000
PMARL_DLLENA       EQU  X'40'          PO is DLL-enabled           @L3A 15150000
PMARL_MUSTDELET    EQU  X'20'          If on and directed LOAD     @L3A 15200000
*                                        invoked for this module,  @L3A 15250000
*                                        Module_Delete function    @L3A 15300000
*                                        must be issued before     @L3A 15350000
*                                        freeing or reusing module @L3A 15400000
*                                        storage                   @L3A 15450000
PMARL_IEWBLITP     EQU  X'10'          If on, PMARL_IEWBLITO is    @L3A 15500000
*                                        valid.                    @L3A 15550000
PMARL_MANGLED      EQU  X'08'          If on, name is mangled.     @L3A 15600000
PMARL_CMS          DS   XL1            CMS flags                   @L6A 15611100
PMARL_CMS_SYSTEM   EQU  X'80' SYSTEM module bit                    @L6A 15622200
PMARL_CMS_NOCLEAN  EQU  X'40' Do not cleanup at end                @L6A 15633300
PMARL_CMS_STRINIT  EQU  X'20' STRINIT bit                          @L6A 15644400
PMARL_CMS_MODDOS   EQU  X'10' Gen'd with DOS                       @L6A 15655500
PMARL_CMS_MODALL   EQU  X'08' Gen'd with ALL                       @L6A 15666600
PMARL_CMS_INVALXA  EQU  X'04' XA-mode invalid                      @L6A 15677700
PMARL_CMS_INVALXC  EQU  X'02' XC-mode invalid                      @L6A 15688800
PMARL_NDEFER       DS   XL2            Number of deferred classes  @L3A 15700000
PMARL_DTEMPL       DS   XL4            Total length of deferred    @L3A 15750000
*                                        text classes on DASD      @L3A 15800000
*                                        (excludes gas).           @L3A 15850000
PMARL_1DTXTO       DS   XL4            Offset of 1st deferred      @L3A 15900000
*                                        class on DASD (includes   @L3A 15950000
*                                        gas).                     @L3A 16000000
PMARL_IEWBLITO     DS   XL4            Byte offset of IEWBLIT      @L3A 16050000
*                                        structure from module     @L3A 16100000
*                                        load point                @L3A 16150000
PMARL_END          DS   0C             END OF LSLOADER SECTION          16200000
*                                                                       16250000
*                                                                       16300000
*********************************************************************** 16350000
**  Attributes unique to load modules (PDS only).                       16400000
**  IfPMAR_LFMT=OFF this section follows the PMAR basic section.        16450000
*********************************************************************** 16500000
*                                                                       16550000
PMARR              DSECT                              Load module       16600000
*                                      (PDS) attributes section         16650000
PMARR_SLEN         DS   H              Section length                   16700000
PMARR_DATA         DS   0CL21          Section data                     16750000
PMARR_TTRS         DS   0CL8           TTR fields                       16800000
PMARR_TTRT         DS   CL3            TTR of first block of text       16850000
PMARR_ZERO         DS   CL1            Zero                             16900000
PMARR_TTRN         DS   CL3            TTR of note list or scatter      16950000
*                                      translation table. Used for      17000000
*                                      modules in scatter load format   17050000
*                                      or overlay structure only.       17100000
PMARR_NL           DS   AL1            Number of entries in note list   17150000
*                                      for scatter format modules and   17200000
*                                      modules in overlay structure,    17250000
*                                      Otherwise zero.                  17300000
PMARR_FTBL         DS   XL2            Length of first block of text.   17350000
*                                                                       17400000
PMARR_ORG          DS   0XL3           Load module origin if ^0         17450000
                   DS   CL2            Reserved                         17500000
PMARR_RLDS         DS   X              Number of RLD/CTL records which  17550000
*                                      follow the first text record     17600000
PMARR_SCAT         DS   0CL8           Scatter load information         17650000
PMARR_SLSZ         DS   XL2            Scatter list length              17700000
PMARR_TTSZ         DS   XL2            Translation table length         17750000
PMARR_ESDT         DS   CL2            ESDID of first text block        17800000
PMARR_ESDC         DS   CL2            ESDID of EP control section      17850000
PMARR_END          DS   0C             END OF LOAD MODULE ATTRIBUTES    17900000
*                                                                       17950000
*********************************************************************** 18000000
**  Alias section in unformatted form. This section is used only        18050000
**  by programs which manipulate program user data.                     18100000
*********************************************************************** 18150000
*                                                                       18200000
PMARA              DSECT               PMAR alias entry section         18250000
PMARA_LEN          DS   H              Section length                   18300000
PMARA_DATA         DS   0B             Section data                     18350000
PMARA_EPA          DS   XL4            Entry point offset               18400000
PMARA_ATR          DS   0CL1           Attribute bytes                  18450000
PMARA_ATR1         DS   0B             First attribute byte             18500000
PMARA_FTB2         DS   B              Alternative name for flags byte  18550000
*                                      These flags must be at the same  18600000
*                                      offsets as the corresponding     18650000
*                                      flags in PDS2FTB2 declared by    18700000
*                                      macro IHAPDS.                    18750000
PMARA_ALTP         EQU  X'80'          Alternate Primary flag.          18800000
*                                       If on, this long alias name     18850000
*                                       was specified as the primary    18900000
*                                       on the bind and a Binder        18950000
*                                       generated 8 byte primary        19000000
*                                       name exists.               @L2C 19050000
PMARA_HIDE         EQU  X'40'          Alias name can be hidden    @L3A 19100000
PMARA_NEXEC        EQU  X'20'          Entry point is non-executable    19150000
*                                                                  @L3A 19200000
PMARA_MANGLED      EQU  X'10'          Alias is a mangled name     @L3A 19250000
PMARA_AMD          EQU  X'0C'          Alias entry addressing mode      19283300
*                                      when                             19316600
*                                      If B'00', AMODE is 24. If        19350000
*                                      B'10', AMODE is 31. If B'11',    19400000
*                                      AMODE is ANY.                    19450000
PMARA_END          DS   0C             END OF ALIAS ENTRY SECTION       19500000
*                                                                       19550000
*                                                                       19600000
*********************************************************************** 19650000
**  Constants used by programs which manipulate program user data.      19700000
*********************************************************************** 19750000
*                                                                       19800000
* Maximum length PMAR                                                   19850000
*  Basic section length                                                 19900000
*  LSLoader section length                                              19950000
*                                                                       20000000
PMAR_MAXLEN        EQU  PMAR_END-PMAR+PMARL_END-PMARL                   20050000
*                                                                       20100000
* Largest PMAR length for program objects                               20150000
*  Basic section length                                                 20200000
*  Program object section length                                        20250000
*                                                                       20300000
PMAR_MAXLEN_PROGOBJ EQU PMAR_END-PMAR+PMARL_END-PMARL                   20350000
*                                                                       20400000
* Largest PMAR length for PO1 format program object                     20450000
*  Basic section length                                                 20500000
*  PO1 format Program object section length                             20550000
*                                                                       20600000
PMAR_MAXLEN_PO1 EQU PMAR_END-PMAR+PMARL_PM2-PMARL                       20650000
*                                                                       20700000
* Largest PMAR length for program objects                               20750000
*  Basic section length                                                 20800000
*  Program object section length for PO2                                20850000
*                                                                       20900000
PMAR_MAXLEN_PO2 EQU PMAR_END-PMAR+PMARL_PM3-PMARL                 @L3C  20950000
*                                                                 @L3A  21000000
* Largest PMAR length for program objects                         @L3A  21050000
*  Basic section length                                           @L3A  21100000
*  Program object section length for PO3                          @L3A  21150000
*                                                                 @L3A  21200000
PMAR_MAXLEN_PO3 EQU PMAR_END-PMAR+PMARL_END-PMARL                 @L3A  21250000
*                                                                       21300000
* Largest PMAR length for PDS load modules                              21350000
*  Load module section length                                           21400000
*                                                                       21450000
PMAR_MAXLEN_LOADMOD EQU PMAR_END-PMAR+PMARR_END-PMARR                   21500000
*                                                                       21550000
* Largest PMARL length for PO1 format program objects                   21600000
*  PO1 format Program object section length                             21650000
*                                                                       21700000
PMARL_LVL1LEN       EQU PMARL_PM2-PMARL                            @L2A 21750000
*                                                                  @L3A 21800000
* Largest PMARL length for PO2 format program objects              @L3A 21850000
*  PO2 format Program object section length                        @L3A 21900000
*                                                                  @L3A 21950000
PMARL_LVL2LEN       EQU PMARL_PM3-PMARL                            @L3A 22000000
.ENDMAC  ANOP                                                           22050000
         MEND                                                           22100000
*%PMARPLS:;                                                             22150000
*                                                                       22200000
*%DCL PMAR__BASE CHAR EXTERNAL;                                         22250000
*%IF PMAR__BASE = '' %THEN                                              22300000
*   %PMAR__BASE = 'BASED';                                              22350000
*%DCL PMARA__BASE CHAR EXTERNAL;                                        22400000
*%IF PMARA__BASE = '' %THEN                                             22450000
*   %PMARA__BASE = 'BASED';                                             22500000
*/********************************************************************/ 22550000
*/* Attributes common to all types of program. The PMAR data is      */ 22600000
*/* always present at offset SMDE_PMAR_OFF in an SMDE.               */ 22650000
*/********************************************************************/ 22700000
*                                                                       22750000
* DECLARE                                                               22800000
*   1 PMAR  BDY(BYTE)PMAR__BASE,   /* Basic section of program user     22850000
*                                      data.                         */ 22900000
*    3 PMAR_ENTRY,                 /* Alternative name for the PMAR     22950000
*                                      section.                      */ 23000000
*     5 PMAR_SLEN FIXED(16) BDY(BYTE),/* Section length.             */ 23050000
*     5 PMAR_LVL FIXED(8),          /* PMAR format level         @P2A*/ 23100000
*     5 PMAR_PLVL FIXED(8),         /* Bind processor creating object   23150000
*                                        1 - E-level linkage editor     23200000
*                                        2 - F-level linkage editor     23250000
*                                        3 - AOS (VS1/VS2)              23300000
*                                            linkage editor             23350000
*                                        4 - XA linkage editor          23400000
*                                        5 - binder version 1    @P2A*/ 23450000
*     5 PMAR_ATR ,                  /* Attribute bytes.              */ 23500000
*      7 PMAR_ATR1 BIT(8),          /* First attribute byte.            23550000
*                                      These flags must be at the same  23600000
*                                      offsets as the corresponding     23650000
*                                      flags in PDS2ATR1 declared by    23700000
*                                      macro IHAPDS.                 */ 23750000
*       9 PMAR_RENT BIT(1),         /* Reenterable                   */ 23800000
*       9 PMAR_REUS BIT(1),         /* Reusable                      */ 23850000
*       9 PMAR_OVLY BIT(1),         /* Overlay structure             */ 23900000
*       9 PMAR_TEST BIT(1),         /* Module to be tested - TESTRAN */ 23950000
*       9 PMAR_LOAD BIT(1),         /* Only loadable                 */ 24000000
*       9 PMAR_SCTR BIT(1),         /* Scatter format                */ 24050000
*       9 PMAR_EXEC BIT(1),         /* Executable                    */ 24100000
*       9 PMAR_1BLK BIT(1),         /* Load module contains only one    24150000
*                                      block of text data and has no    24200000
*                                      rld data.                     */ 24250000
*      7 PMAR_ATR2 BIT(8),          /* Second attribute byte.           24300000
*                                      These flags must be at the same  24350000
*                                      offsets as the corresponding     24400000
*                                      flags in PDS2ATR2 declared by    24450000
*                                      macro IHAPDS.                 */ 24500000
*       9 PMAR_FLVL BIT(1),         /* If on, the program cannot be     24550000
*                                      processed by the E level         24600000
*                                      linkage editor.                  24650000
*                                      If off, the program can be       24700000
*                                      processed by any level of the    24750000
*                                      linkage editor or the Binder. */ 24800000
*       9 PMAR_ORG0 BIT(1),         /* Linkage editor assigned origin   24850000
*                                      of first block of text is        24900000
*                                      zero.                         */ 24950000
*       9 *         BIT(1),         /* Reserved                  @P2C*/ 25000000
*       9 PMAR_NRLD BIT(1),         /* Program contains no RLD items */ 25050000
*       9 PMAR_NREP BIT(1),         /* Module cannot be reprocessed     25100000
*                                      by the linkage editor         */ 25150000
*       9 PMAR_TSTN BIT(1),         /* Module contains TESTRAN symbol   25200000
*                                      cards                         */ 25250000
*       9 *        BIT(1),          /* Reserved                  @P2C*/ 25300000
*       9 PMAR_REFR BIT(1),         /* Refreshable program           */ 25350000
*      7 PMAR_ATR3 BIT(8),          /* Third attribute byte.         */ 25400000
*       8 PMAR_FTB1 BIT(8),         /* Alternative name for flags byte. 25450000
*                                      These flags must be at the same  25500000
*                                      offsets as the corresponding     25550000
*                                      flags in PDS2FTB1 declared by    25600000
*                                      macro IHAPDS.             @P1C*/ 25650000
*        9 *        BIT(1),         /* Reserved                  @P2C*/ 25700000
*        9 PMAR_BIG BIT(1),         /* This program requires 16M bytes  25750000
*                                      or more of virtual storage    */ 25800000
*        9 PMAR_PAGA BIT(1),        /* Page alignment is required    */ 25850000
*        9 PMAR_XSSI BIT(1),        /* SSI information present       */ 25900000
*        9 PMAR_XAPF BIT(1),        /* APF information present       */ 25950000
*        9 PMAR_LFMT BIT(1),        /* PMARL follows PMAR.           */ 26000000
*        9 *         BIT(2),        /* Reserved                  @P1A*/ 26050000
*      7 PMAR_ATR4 BIT(8),          /* Fourth attribute byte         */ 26100000
*       8 PMAR_FTB2 BIT(8),         /* Alternative name for flags byte. 26150000
*                                      These flags must be at the same  26200000
*                                      offsets as the corresponding     26250000
*                                      flags in PDS2FTB2 declared by    26300000
*                                      macro IHAPDS.             @P1C*/ 26350000
*        9 PMAR_ALTP BIT(1),        /* Alternate primary flag. If on    26400000
*                                      for a primary name, indicates    26450000
*                                      primary name was generated by    26500000
*                                      the Binder. If on for an alias   26550000
*                                      name, indicates the long alias   26600000
*                                      name was specified as the        26650000
*                                      primary name on the bind. @L2A*/ 26700000
*        9 * BIT(2),                                                    26750000
*        9 PMAR_RMOD BIT(1),        /* RMODE is ANY.                 */ 26800000
*        9 PMAR_AAMD BIT(2),        /* Alias entry point addressing     26850000
*                                      mode.                            26883300
*                                      If B'00', AMODE is 24.           26916600
*                                      If B'10', AMODE is 31. If        26950000
*                                      B'11', AMODE is ANY.          */ 27000000
*        9 PMAR_MAMD BIT(2),        /* Main entry point addressing      27050000
*                                      mode.                            27083300
*                                      If B'00', AMODE is 24.           27116600
*                                      If B'10', AMODE is 31. If        27150000
*                                      B'11', AMODE is ANY.          */ 27200000
*     5 *         BIT(8),           /* Reserved                      */ 27250000
*     5 PMAR_AC   FIXED(8),         /* APF authorization code        */ 27300000
*     5 PMAR_STOR FIXED(32) BDY(BYTE),/* Virtual storage required    */ 27350000
*     5 PMAR_EPM  FIXED(32) BDY(BYTE),/* Main entry point offset     */ 27400000
*     5 PMAR_EPA  FIXED(32) BDY(BYTE),/* This entry point offset     */ 27450000
*     5 PMAR_SSI BIT(32),           /* SSI information               */ 27500000
*      7 PMAR_CHLV FIXED(8),        /* Change level of member        */ 27550000
*      7 PMAR_SSFB BIT(8),          /* SSI flag byte                 */ 27600000
*      7 PMAR_MSER CHAR(2),         /* Member serial number          */ 27650000
*     5 *          FIXED(32) BDY(BYTE), /* Reserved                  */ 27700000
*    3 PMAR_END CHAR(0);            /* End of basic section          */ 27750000
*                                                                       27800000
*/********************************************************************/ 27850000
*/* LSLoader attributes which are unique to program objects.         */ 27900000
*/* If PMAR_LFMT=ON this section follows the PMAR basic section.     */ 27950000
*/********************************************************************/ 28000000
*                                                                       28050000
* DECLARE                                                               28100000
*   1 PMARL BASED(ADDR(PMAR_ENTRY)+PMAR_SLEN) BDY(BYTE), /* LSLoader    28150000
*                                      section for program objects   */ 28200000
*    3 PMARL_SLEN FIXED(16) BDY(BYTE),/* Section length              */ 28250000
*    3 PMARL_DATA ,                 /* Section data                  */ 28300000
*     5 PMARL_ATR,                  /* Attribute bytes               */ 28350000
*      7 PMARL_ATR1 BIT(8),         /* Fifth attribute byte          */ 28400000
*       9 PMARL_NMIG BIT(1),        /* This program object cannot be    28450000
*                                      converted directly to PDS load   28500000
*                                      module format.                */ 28550000
*       9 PMARL_PRIM BIT(1),        /* FETCHOPT PRIME option         */ 28600000
*       9 PMARL_PACK BIT(1),        /* FETCHOPT PACK option          */ 28650000
*       9 PMARL_HPL  BIT(1),        /* Module requires HPLink sup@L4A*/ 28700000
*       9 *          BIT(4),        /* Reserved                  @L4C*/ 28750000
*      7 PMARL_ATR2 BIT(8),         /* Sixth attribute byte          */ 28800000
*       9 PMARL_CMPR BIT(1),        /* Compressed format module      */ 28850000
*       9 PMARL_1RMOD BIT(1),       /* 1st segment is RMODE Any,        28900000
*                                      set for PM2-level PO only @L2A*/ 28950000
*       9 PMARL_2RMOD BIT(1),       /* 2nd segment is RMODE Any,        29000000
*                                      set for PM2-level PO if there    29050000
*                                      are at least 2 loadable          29100000
*                                      segments.                 @L2A*/ 29150000
*       9  *         BIT(1),        /* Reserved                  @L3C*/ 29200000
*       9 PMARL_1ALIN BIT(1),       /* 1st segment is page-aligned,     29250000
*                                      set for PM2-level PO only @L2A*/ 29300000
*       9 PMARL_2ALIN BIT(1),       /* 2nd segment is page-aligned,     29350000
*                                      set for PM2-level PO only if     29400000
*                                      >1 loadable segment       @L2A*/ 29450000
*       9 PMARL_FILL BIT(1),        /* FILL option specified            29500000
*                                      set for PM2-level PO only @L2A*/ 29550000
*       9 *          BIT(1),        /* Reserved                  @L2C*/ 29600000
*      7 PMARL_FILLVAL CHAR(1),     /* FILL character value             29650000
*                                      set for PM2-level PO only if     29700000
*                                      PMARL_FILL is on.         @L2A*/ 29750000
*      7 PMARL_RSVD CHAR(1),        /* Reserved                  @L6A*/ 29800000
*     5 PMARL_MPGS FIXED(32) BDY(BYTE),/* Total length of program on    29850000
*                                      DASD (excluding gas) in pages */ 29900000
*     5 PMARL_MDAT ,                /* DASD program descriptors      */ 29950000
*          /* Note:  Although the offsets that follow are described  */ 30000000
*          /* independently, the Loader is dependent on the PRAT     */ 30050000
*          /* preceding the PRDT, and LSLoader data following it.    */ 30100000
*          /* LSLoader length should include everything between its  */ 30150000
*          /* start and the beginning of the first text segment.     */ 30200000
*      7 PMARL_TXTL FIXED(32) BDY(BYTE), /* Length of initial load      30250000
*                                            text on DASD including     30300000
*                                            gas.                    */ 30350000
*      7 PMARL_TXTO PTR(32) BDY(BYTE), /* Offset to first text segment  30400000
*                                            on DASD                 */ 30450000
*      7 PMARL_BDRL FIXED(32) BDY(BYTE), /* Length of Binder index   */ 30500000
*      7 PMARL_BDRO PTR(32) BDY(BYTE), /* Offset to Binder index     */ 30550000
*      7 PMARL_RDTL FIXED(32) BDY(BYTE), /* Length of PRDT           */ 30600000
*      7 PMARL_RDTO PTR(32) BDY(BYTE), /* Offset to PRDT             */ 30650000
*      7 PMARL_RATL FIXED(32) BDY(BYTE), /* Length of PRAT           */ 30700000
*      7 PMARL_RATO PTR(32) BDY(BYTE), /* Offset to PRAT             */ 30750000
*      7 PMARL_LMDL FIXED(32) BDY(BYTE), /* Length of LSLoader data,    30800000
*                                 for PM1-level program objects  @L2C*/ 30850000
*        9 PMARL_NVSPGS FIXED(32) BDY(BYTE), /* Number of pages of      30900000
*                                 virtual storage needed to contain     30950000
*                                 entire program object (including      31000000
*                                 gas)                           @L2A*/ 31050000
*      7 PMARL_LMDO PTR(32) BDY(BYTE), /* Offset to LSLoader data    */ 31100000
*     5 PMARL_PM2,            /* New fields for PM2-Level object @L2A*/ 31150000
*      7 PMARL_NSEG FIXED(16) BDY(BYTE), /* Number of loadable segments 31200000
*                                                                @L2A*/ 31250000
*      7 PMARL_NGAS FIXED(16) BDY(BYTE), /* Count of entries in Gas     31300000
*                                            Table               @L2A*/ 31350000
*      7 PMARL_1STOR FIXED(32) BDY(BYTE), /* Virtual storage required   31400000
*                                for first loadable segment, valid      31450000
*                                for all PM2-level program objs  @L2A*/ 31500000
*      7 PMARL_2STOR FIXED(32) BDY(BYTE), /* Virtual storage required   31550000
*                                for second loadable segment, valid     31600000
*                                valid when PMARL_NSEG > 1.      @L2A*/ 31650000
*      7 PMARL_2TXTO PTR(32) BDY(BYTE), /* Offset to second txt segment 31700000
*                                including gas, valid when              31750000
*                                PMARL_NSEG > 1                  @L2A*/ 31800000
*      7 PMARL_TRACE,         /* Audit trace data                @L2A*/ 31850000
*        9 PMARL_DATE BIT(32) BDY(BYTE), /* Date saved           @L2A*/ 31900000
*        9 PMARL_TIME BIT(32) BDY(BYTE), /* Time saved           @L2A*/ 31950000
*        9 PMARL_USER CHAR(8), /* User or job identification     @L2A*/ 32000000
*      5 PMARL_PM3,          /* New fields for PM3-Level object  @L3A*/ 32050000
*       7 PMARL_PM3FL1 BIT(8), /* Flag byte                      @L3A*/ 32100000
*        9 PMARL_HIDE BIT(1),  /* Name is an alias that can be hidden   32150000
*                                                                @L3A*/ 32200000
*        9 PMARL_DLLENA BIT(1), /* PO is DLL-enabled             @L3A*/ 32250000
*        9 PMARL_MUSTDELET BIT(1), /* If on and directed LOAD invoked   32300000
*                                  for this module, Module_Delete       32350000
*                                  function must be issued before       32400000
*                                  freeing or reusing module storage    32450000
*                                                                @L3A*/ 32500000
*        9 PMARL_IEWBLITP BIT(1), /* If on, PMARL_IEWBLITO is valid     32550000
*                                                                @L3A*/ 32600000
*        9 PMARL_MANGLED BIT(1), /* Name is mangled              @L3A*/ 32650000
*        9  * BIT(3),          /* Reserved                       @L3A*/ 32700000
*       7 PMARL_CMS  BIT(8),        /* CMS flags                 @L6A*/ 32710000
*         9 PMARL_CMS_SYSTEM BIT(1), /* SYSTEM module bit        @L6A*/ 32720000
*         9 PMARL_CMS_NOCLEAN BIT(1), /* Do not cleanup at end   @L6A*/ 32730000
*         9 PMARL_CMS_STRINIT BIT(1), /* STRINIT bit             @L6A*/ 32740000
*         9 PMARL_CMS_MODDOS BIT(1), /* Gen'd with DOS           @L6A*/ 32750000
*         9 PMARL_CMS_MODALL BIT(1), /* Gen'd with ALL           @L6A*/ 32760000
*         9 PMARL_CMS_INVALXA BIT(1), /* XA-mode invalid         @L6A*/ 32770000
*         9 PMARL_CMS_INVALXC BIT(1), /* XC-mode invalid         @L6A*/ 32780000
*         9 * BIT(1),                 /* Reserved                @L6A*/ 32790000
*       7 PMARL_NDEFER FIXED(16) BDY(BYTE), /* Number of deferred       32800000
*                                              segments          @L3A*/ 32850000
*       7 PMARL_DTEMPL FIXED(31) BDY(BYTE), /* Total length of deferred 32900000
*                            text classes on DASD (excludes gas) @L3A*/ 32950000
*       7 PMARL_1DTXTO FIXED(31) BDY(BYTE), /* Offset of 1st deferred   33000000
*                                   class on DASD (includes gas) @L3A*/ 33050000
*       7 PMARL_IEWBLITO FIXED(31) BDY(BYTE), /* Byte offset of         33100000
*                            IEWBLIT structure from module load point   33150000
*                                                                @L3A*/ 33200000
*    3 PMARL_END CHAR(0) BDY(BYTE); /* End of LSLoader section       */ 33250000
*                                                                       33300000
*                                                                       33350000
*/********************************************************************/ 33400000
*/* Attributes unique to load modules (PDS only).                    */ 33450000
*/* If PMAR_LFMT=OFF this section follows the PMAR basic section.    */ 33500000
*/********************************************************************/ 33550000
*                                                                       33600000
* DECLARE                                                               33650000
*   1 PMARR BASED(ADDR(PMAR_ENTRY)+PMAR_SLEN) BDY(BYTE), /* Load module 33700000
*                                      (PDS) attributes section      */ 33750000
*    3 PMARR_SLEN FIXED(16) BDY(BYTE),/* Section length              */ 33800000
*    3 PMARR_DATA ,                 /* Section data                  */ 33850000
*     5 PMARR_TTRS CHAR(8),         /* TTR fields                    */ 33900000
*      7 PMARR_TTRT CHAR(3),        /* TTR of first block of text    */ 33950000
*      7 PMARR_ZERO CHAR(1),        /* Zero                          */ 34000000
*      7 PMARR_TTRN CHAR(3),        /* TTR of note list or scatter      34050000
*                                      translation table. Used for      34100000
*                                      modules in scatter load format   34150000
*                                      or overlay structure only.    */ 34200000
*      7 PMARR_NL PTR(8),           /* Number of entries in note list   34250000
*                                      for scatter format modules and   34300000
*                                      modules in overlay structure,    34350000
*                                      Otherwise zero.               */ 34400000
*     5 PMARR_FTBL FIXED(15) BDY(BYTE),/* Length of first block of      34450000
*                                      text.                         */ 34500000
*     5 PMARR_ORG  FIXED(24) BDY(BYTE),/* Load module origin if ^0   */ 34550000
*      7 *          CHAR(2),        /* Reserved                      */ 34600000
*      7 PMARR_RLDS FIXED(8),       /* Number of RLD/CTL records which  34650000
*                                      follow the first text record  */ 34700000
*     5 PMARR_SCAT CHAR(8),         /* Scatter load information      */ 34750000
*      7 PMARR_SLSZ FIXED(16) BDY(BYTE),/* Scatter list length       */ 34800000
*      7 PMARR_TTSZ FIXED(16) BDY(BYTE),/* Translation table length  */ 34850000
*      7 PMARR_ESDT CHAR(2),        /* ESDID of first text block     */ 34900000
*      7 PMARR_ESDC CHAR(2),        /* ESDID of EP control section   */ 34950000
*    3 PMARR_END CHAR(0);           /* End of load module attributes */ 35000000
*                                                                       35050000
*/********************************************************************/ 35100000
*/* Alias section in unformatted form. This section is used only     */ 35150000
*/* by programs which manipulate program user data.                  */ 35200000
*/********************************************************************/ 35250000
*                                                                       35300000
* DECLARE                                                               35350000
*   1 PMARA BDY(BYTE) PMARA__BASE,  /* PMAR alias entry section      */ 35400000
*    3 PMARA_LEN  FIXED(16) BDY(BYTE),/* Section length              */ 35450000
*    3 PMARA_DATA ,                 /* Section data                  */ 35500000
*     5 PMARA_EPA FIXED(32) BDY(BYTE),/* Entry point offset          */ 35550000
*     5 PMARA_ATR CHAR(1),          /* Attribute bytes               */ 35600000
*      7 PMARA_ATR1 BIT(8),         /* First attribute byte          */ 35650000
*       8 PMARA_FTB2 BIT(8),        /* Alternative name for flags byte. 35700000
*                                      These flags must be at the same  35750000
*                                      offsets as the corresponding     35800000
*                                      flags in PDS2FTB2 declared by    35850000
*                                      macro IHAPDS.             @P1A*/ 35900000
*        9 PMARA_ALTP BIT(1),       /* Alternate Primary flag           35950000
*                                       If on, this long alias name     36000000
*                                       was specified as the primary    36050000
*                                       on the bind and a Binder        36100000
*                                       generated 8 byte primary        36150000
*                                       name exists.             @L2C*/ 36200000
*        9 PMARA_HIDE BIT(1),       /* Alias name can be hidden  @L3A*/ 36250000
*        9 PMARA_NEXEC BIT(1),      /* Entry point is not executable    36300000
*                                                                @L3A*/ 36350000
*        9 PMARA_MANGLED BIT(1),    /* Alias is a mangled name   @L3A*/ 36400000
*        9 PMARA_AMD  BIT(2),       /* Alias entry addressing mode      36433300
*                                      when.                            36466600
*                                      If B'00', AMODE is 24.           36500000
*                                      If B'10', AMODE is 31. If        36550000
*                                      B'11', AMODE is ANY.          */ 36600000
*        9 *          BIT(2),       /* Reserved                  @L5C*/ 36650000
*    3 PMARA_END CHAR(0);           /* End of alias entry section    */ 36700000
*                                                                       36750000
*                                                                       36800000
*/********************************************************************/ 36850000
*/* Constants used by programs which manipulate program user data.   */ 36900000
*/********************************************************************/ 36950000
*                                                                       37000000
* DECLARE                                                               37050000
*  PMAR_LVL_VAL FIXED(8) CONSTANT(3),  /* level constant         @L3C*/ 37100000
*  PMAR_PM1_VAL FIXED(8) CONSTANT(1),  /* level constant for PO1 @L2A*/ 37150000
*  PMAR_PM2_VAL FIXED(8) CONSTANT(2),  /* level constant for PO2 @L2A*/ 37200000
*  PMAR_PM3_VAL FIXED(8) CONSTANT(3),  /* level constant for PO3 @L3A*/ 37250000
*  PMAR_PLVL_E_VAL FIXED(8) CONSTANT(1), /* E-level constant     @P2A*/ 37300000
*  PMAR_PLVL_F_VAL FIXED(8) CONSTANT(2), /* F-level constant     @P2A*/ 37350000
*  PMAR_PLVL_AOS_VAL FIXED(8) CONSTANT(3), /* AOS-level constant @P2A*/ 37400000
*  PMAR_PLVL_XA_VAL FIXED(8) CONSTANT(4), /* XA-level constant   @P2A*/ 37450000
*  PMAR_PLVL_B1_VAL FIXED(8) CONSTANT(5), /* Binder version 1    @P2A*/ 37500000
*  PMAR_PLVL_B2_VAL FIXED(8) CONSTANT(6), /* Binder version 2    @L2A*/ 37550000
*  PMAR_PLVL_B3_VAL FIXED(8) CONSTANT(7), /* Binder version 3    @L3A*/ 37600000
*  PMAR_MAXLEN FIXED CONSTANT(      /* Maximum length of program user   37650000
*                                      data in an SMDE               */ 37700000
*            LENGTH(PMAR)+          /* Basic section length          */ 37750000
*            LENGTH(PMARL)          /* LSLoader section length       */ 37800000
*            );                     /*                           @P1D*/ 37850000
*DCL PMAR_MAXLEN_PROGOBJ FIXED(31)  /* Largest SMDE user data length    37900000
*                                      for program objects       @P1C*/ 37950000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @P1C*/ 38000000
*            LENGTH(PMARL));        /* Program object section length    38050000
*                                                                @P1C*/ 38100000
*DCL PMAR_MAXLEN_PO1     FIXED(31)  /* Largest SMDE user data length    38150000
*                                      for PO1                   @L2A*/ 38200000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @L2A*/ 38250000
*            OFFSET(PMARL.PMARL_PM2)); /* PO1 Section length     @L3C*/ 38300000
*DCL PMAR_MAXLEN_PO2     FIXED(31)  /* Largest SMDE user data length    38350000
*                                      for PM2-level PO          @L2A*/ 38400000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @L2A*/ 38450000
*            OFFSET(PMARL.PMARL_PM3));/* Program object section length  38500000
*                                                                @L3C*/ 38550000
*DCL PMAR_MAXLEN_PO3     FIXED(31)  /* Largest SMDE user data length    38600000
*                                      for PM2-level PO          @L3A*/ 38650000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @L3A*/ 38700000
*            LENGTH(PMARL));        /* Program object section length    38750000
*                                                                @L3A*/ 38800000
*DCL PMAR_MAXLEN_LOADMOD FIXED(31)  /* Largest SMDE user data length    38850000
*                                      for PDS load modules      @P1A*/ 38900000
*   CONSTANT(LENGTH(PMAR)+          /* Basic section length      @P1A*/ 38950000
*            LENGTH(PMARR));        /* Load module section length       39000000
*                                                                @P1A*/ 39050000
*DCL PMARL_LVL1LEN FIXED(31)        /* Length of PM1-Level PMARL @L2A*/ 39100000
*   CONSTANT(OFFSET(PMARL.PMARL_PM2));                         /*@L3C*/ 39150000
*DCL PMARL_LVL2LEN FIXED(31)        /* Length of PM2-Level PMARL @L3A*/ 39200000
*   CONSTANT(OFFSET(PMARL.PMARL_PM3));                         /*@L3A*/ 39250000
*%DEACT PMAR__BASE,PMARA__BASE;                                         39300000
*%END;                                                                  39350000
