*                                                                       00110000
*        % GOTO DEBL1;   /*                                             00160000
         MACRO                                                          00200000
         IEZDEB &LIST=NO                                                00300000
DEB      DSECT  ,   */                                                  00400000
*%DEBL1 : ;                                                             00410000
*                                                                       00500000
*/* **************************************************************** */ 00600000
*/*                                                                  */ 00700000
*/* $MAC(IEZDEB):    DEB MAPPING MACRO - BILINGUAL                   */ 00733300
*/*                                                                  */ 00766636
*/* DESCRIPTIVE-NAME = DATA EXTENT BLOCK                             */ 00816600
*/*                                                                  */ 00900000
*/* STATUS - OS/390 DFSMS 3.10                                       */ 00904200
*/*                                                                  */ 00908400
*/*PROPRIETARY V3 STATEMENT                                          */ 00912600
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00916800
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00921000
*/*5694-A01                                                          */ 00925900
*/*(C) COPYRIGHT 1982,2000  IBM CORP.                                */ 00930800
*/*END PROPRIETARY V3 STATEMENT                                      */ 00935700
*/*                                                                  */ 00942000
*/* FUNCTION = MAPPING MACRO                                         */ 00946200
*/*      THE DATA EXTENT BLOCK (DEB) CONTAINS AN EXTENSION OF        */ 00950400
*/*      INFORMATION IN THE DCB OR ACB. EACH DEB IS ASSOCIATED WITH  */ 00954600
*/*      A DCB OR ACB, AND THE TWO POINT TO EACH OTHER.  THE DEB     */ 00958800
*/*      TYPICALLY CONTAINS INFORMATION CONCERNING THE PHYSICAL      */ 00963000
*/*      CHARACTERISTICS OF THE DATA SET AND OTHER INFORMATION THAT  */ 00967200
*/*      IS USED BY THE CONTROL PROGRAM.                             */ 00971400
*/*    METHOD OF ACCESS                                              */ 00975600
*/*      PL/S - DCL (DEBPTR,DEBDAPTR,DEBEXPTR,DEBSBPTR) PTR          */ 00980000
*/*      BAL  - FIVE DSECTS ARE PRODUCED.  USING ON A DSECT NAME     */ 00990000
*/*             GIVES ADDRESSABILITY FOR ALL SYMBOLS WITHIN THAT     */ 01000000
*/*             DSECT.  THE DSECT NAMES AND THE SECTIONS WITHIN EACH */ 01010000
*/*             DSECT ARE                                            */ 01020000
*/*                                                                  */ 01030000
*/*             DEB ***  APPENDAGE VECTOR TABLE SECTION              */ 01040000
*/*                      PREFIX TABLE                                */ 01050000
*/*                      BASIC SECTION                               */ 01060000
*/*                      UNIT RECORD, MAGNETIC TAPE AND              */ 01070000
*/*                        TELECOMMUNICATIONS DEVICES SECTION        */ 01080000
*/*                      3540 ACCESS METHOD DEPENDENT SECTION@X04AA9A*/ 01085000
*/*                      ISAM DEPENDENT SECTION                      */ 01090000
*/*                      *** POINTERS TO THE DEB IN OTHER CONTROL    */ 01092000
*/*                          BLOCKS SUCH AS DCB POINT TO THE BASIC   */ 01094000
*/*                          SECTION.  USING ON DEBBASIC GIVES       */ 01096000
*/*                          ADDRESSABILITY FOR BASIC SECTION AND    */ 01098000
*/*                          NEXT TWO SECTIONS.  DEBAPPAD IN BASIC   */ 01098400
*/*                          SECTION CONTAINS ADDRESS OF APPENDAGE   */ 01098800
*/*                          VECTOR TABLE (AVT) SECTION.  PREFIX     */ 01099200
*/*                          FOLLOWS AVT SECTION IN THE MAPPING BUT  */ 01099400
*/*                          NOT NECESSARILY IN THE REAL DEB.        */ 01099600
*/*             DEBDASD  DIRECT ACCESS STORAGE DEVICE SECTION        */ 01100000
*/*             DEBACSMD EXCP, BSAM AND QSAM DEPENDENT SECTION       */ 01110000
*/*                      BPAM DEPENDENT SECTION                      */ 01120000
*/*                      BDAM DEPENDENT SECTION                      */ 01130000
*/*                      BTAM DEPENDENT SECTION                      */ 01140000
*/*                      GAM DEPENDENT SECTION                       */ 01150000
*/*                      ISAM LOAD MODE EXTENSION **                 */ 01160000
*/*                      ISAM SCAN MODE EXTENSION **                 */ 01170000
*/*                      BISAM MODE EXTENSION **                     */ 01180000
*/*                      ** FOR THESE 3 EXTENSIONS, LOAD REGISTER    */ 01190000
*/*                         FROM DEBEXPT IN ISAM DEPENDENT SECTION   */ 01200000
*/*                         TO SET REGISTER FOR USING.               */ 01210000
*/*             DEBSUBNM SUBROUTINE NAME SECTION                     */ 01220000
*/*             DEBXTN   EXTENSION FOR OS/VS2                        */ 01222000
*/*                                                                  */ 01224000
*/*             WHEN LISTING IS SUPPRESSED, YOU CAN DETERMINE WHICH  */ 01226000
*/*             DSECT A SYMBOL IS IN BY USING THE STATEMENT NUMBER   */ 01227000
*/*             IN THE DEFN COLUMN IN THE CROSS REFERENCE LISTING.   */ 01228400
*/*             FOR EXAMPLE, ANY SYMBOL DEFINED BETWEEN THE          */ 01228800
*/*             STATEMENT NUMBERS FOR DEBDASD AND DEBACSMD IS IN     */ 01229200
*/*             THE DIRECT ACCESS STORAGE DEVICE SECTION.            */ 01229600
*/*   HOW TO CALL                                                    */ 01231600
*/*                                                                  */ 01233600
*/*      ASSEMBLER  - SPECIFY LIST=YES ON MACRO CALL                 */ 01234200
*/*      PL/X - SPECIFY %IHALIST='YES' BEFORE INCLUDE                */ 01234800
*/*      PL/X DEBPREFX - SPECIFY %DEBPRES='YES' BEFORE INCLUDE IF    */ 01235400
*/*                      THE DEB PREFIX IS NOT CONTIGUOUS WITH THE   */ 01236200
*/*                      APPENDAGE VECTOR TABLE.                     */ 01236300
*/*                                                                  */ 01236400
*/*                                                                  */ 01236500
*/*      FOR INTEGRATION, A LISTING SHOULD NOT BE REQUESTED.         */ 01236600
*/*                                                                  */ 01236700
*/*                                                                  */ 01238536
*/* **************************************************************** */ 01238736
*/*                                                                  */ 01238936
*/*  CHANGE-ACTIVITY                                                 */ 01610736
*/*                                                                  */ 01685536
*/*       OS/VS2 RELEASE 3.0 AND 3.7 PTF, 12/20/77, LEVEL=2          */ 01689036
*/*                                                          @ZA34098*/ 01692536
*/*       OS/VS2 RELEASE 3.8   CHANGES, DELETIONS, ADDITIONS         */ 01693600
*/* A046250,A046500,A046750                                  @ZA51573*/ 01694700
*/*                                                                  */ 01696036
*/*$H2=CALYPSO,JDM1136,T800475,STLBGB: DEVICE SUPPORT            @H2A*/ 01696100
*/*$01=SAMELBP,JDM1138,OZ55553,SLTRRB:                           @01A*/ 01696200
*/*$L1=DFP,HDP1102,,STLDAN: BASE AVT ON 3-BYTE ADDRESS           @L1A*/ 01696300
*/*$L2=DFP,HDP1102,,STLDAN: MINOR ENHANCEMENTS                   @L2A*/ 01696400
*/*$L3=DFP,HDP1102,,STLDHC: BASE ISAM ON 3-BYTEADDRESS           @L3A*/ 01696500
*/*$L4=3380M13,JDP1110,T820757,STLHGM: 3380 MODEL 13 DASD SUPPORT@L4A*/ 01696600
*/*$L5=HARP,HDP1202,STLOCE:PREVENT I/O                           @L5A*/ 01696700
*/*$L6=BLOCKID,HDP1202,STLRJM:3480 BLOCKID CHECK                 @L6A*/ 01696800
*/*$L7=DFP,HDP2210,STLPD:CORRECT CACH EQUATES                    @L7A*/ 01696900
*/*$05=OZ83382,JDP1111,,FEGHA: INCORRECT EQUATES IN IEZDEB       @05A*/ 01697000
*/*$06=OY01921,HDP2210,,ISGGHA: ADD FLAGBYTE FOR VOL SER CHKING  @06A*/ 01697100
*/*$L8=DFP,HDP3310,86174,STLDJP: SYSTEM DETERMINED BLOCKSIZE     @L8A*/ 01697200
*/*$08=OY03994,HDP2230,STLRDB: NRD,FASTWRITE SUPPORT             @08A*/ 01697300
*/*$L9=RACF18,HDP3310,,STLMV: PROGRAM LIBRARY EXEC ONLY PROTECT  @L9A*/ 01697400
*/*$LA=DFP,HDP3310,87027,STLCMS: CACHE ATTRIBUTE SELECTION       @LAA*/ 01697500
*/*$LB=OY07704,HDP2230,STLJAH: BYPASS EXCP PREFIX                @LBA*/ 01697600
*/*$LC=OY07766,HDP2230,871116,STLCMS: PDS INTEGRITY              @LCA*/ 01697700
*/*$LD=PDSEIND,HDP3320,,STLJRM: PDSE SUPPORT                     @LDA*/ 01697800
*/*$09=OY14726,HDP3300,NSDGAE: DEFINE DEBXIMSC FOR IMS           @09A*/ 01697900
*/*                                                                  */ 01698000
*/*         MVS/XA DFP 3.1 CHANGES AND DELETIONS                     */ 01698100
*/*$H3=3480X,JDP3311,88281,STLFAO: 3480 COMPACTION SUPPORT       @H3A*/ 01698200
*/*$10=OY23442,JDP3311,89173,STLCMS: MOVE DEBCASFT TO DEBX       @10A*/ 01698300
*/*$11=OY44413,HDP3330,073091,SJPLJAL: SMS GUAR SPACE DATA SET   @11A*/ 01698400
*/*                                    DOESN'T EXTEND ON VOL2    @11A*/ 01698500
*/*$JB=STATS,HDP4410,101791,SJPLJAB:  I/O STATS                  @JBA*/ 01698600
*/*$LE=STRIPES,JDZ1110,920212,SJPLREB: STRIPING SUPPORT          @LEA*/ 01698700
*/*$12=OY57730,JDZ1110,092992,SJPLGEC: "ATTRIBUTE EXTENSION"     @12A*/ 01698900
*/*                                    DATASET SUPPORT           @12A*/ 01699100
*/*$13=OY58424,JDZ1110,920713,SJPLMV: ATL BIG3 SUPPORT           @13A*/ 01699300
*/*$14=OW00739,HDZ11B0,920721,SJPLGEC: CHECKPOINTED D/S SUPPORT  @14A*/ 01699400
*/*$15=OW03748,HDZ11B0,940221,SJPLGEC: MULTIVOLUME SINGLE STRIPE @15A*/ 01699500
*/*                                    SUPPORT                   @15A*/ 01699600
*/*$P1=KRL0290,HDZ11C0,940207,SJPLGEC: VSAM RLS SUPPORT          @P1A*/ 01699700
*/*$16=OW08707,HDZ11B0,931013,SJPLMV: ENFORCE ATL/SPECIFIC MEDIA @16A*/ 01699800
*/*$P2=K130995,HDZ11C0,950112,SJPLGEC: DEBOPTAB OPTIONS UPDATE   @P2A*/ 01702300
*/*$LF=K130891,HDZ11C0,950224,SJPLJAL: EXCP DCB XTIOT SUPPORT    @LFA*/ 01704800
*/*$17=K131665,HDZ11C0,950314,SJPLJAL: DEB2XUOF LENGTH IN PLX    @17A*/ 01706000
*/*$P3=K132667,HDZ11C0,960615,SJPLGEC: DEFINE EXTENT AREA CLNUP  @P3A*/ 01706600
*/*$P4=XSAM,HDZ11C0.950504,SJPLGEC: HFS/REMOTE FILE SUPPRT       @P4A*/ 01706700
*/*$LG=OW15640,HDZ11C0,951015,SJPLJAL: DETECT MISSING TAPE VOLS  @LGA*/ 01706900
*/*$P5=VSAMXSAM,HDZ11C0,960422,SJPLGEC: VSAM HFS SUPPORT         @P5A*/ 01707100
*/*$LH=DSSCPOIT,HDZ11D0,960917,SJPLGEC: REMOVE DEBXCKPT          @LHA*/ 01707200
*/*$18=OW20923,HDZ11C0,960611,SJPLMV:  DCME ENHANCEMENT          @18A*/ 01708100
*/*$P6=TVS,HDZ11E0,970709,SJPLGEC: TRANSACTIONAL VSAM SUPPORT    @P6A*/ 01708500
*/*$LI=DEBTBL,HDZ11E0.971030,SJPLGEC: DEB TABLE SIZE INCREASE    @LIA*/ 01708700
*/*$LJ=ANSIV4,HDZ11E0,981231,SJPLJAL: ANSI VERSION 4 SUPPORT     @LJA*/ 01708800
*/*$19=OW36487,HDZ11E0,981130,SJPLGEC: TVS RLS CHANGES           @19A*/ 01709000
*/*$LK=GT32K,HDZ11F0,980727,SJPLRK:  >32K TAPE BLOCK SIZES       @LKA*/ 01709500
*/*$LL=OW38717,HDZ11E0,990630,SJPLJAL: BLYTHE2 SUPPORT           @LLA*/ 01709600
*/*$LM=OW45309,HDZ11F0,000730,SJPLJAL: MTL SUPPORT               @LMA*/ 01709640
*/* **************************************************************** */ 01709700
*                                                                       01710000
*%GOTO DEBL2;  /*                                                       01720000
         PUSH  PRINT                                                    01770000
         AIF   ('&LIST' EQ 'YES').DEB1                                  01780000
         PRINT OFF                                                      01790000
.DEB1    ANOP                                                           01792000
         SPACE 1                                                        01800000
**********************************************************************  01900000
*            APPENDAGE VECTOR TABLE SECTION OF THE DEB               *  02000000
*              POINTED TO BY DEBAPPAD                                *  02050000
**********************************************************************  02100000
         SPACE 1                                                        02200000
DEBAVT   DS    0D        APPENDAGE VECTOR TABLE                         02250000
DEBEOEA  DS    0A        ADDRESS OF END-OF-EXTENT APPENDAGE ROUTINE     02300000
*                                                                ICB280 02410000
DEBEOEAB DS    B         FLAG BYTE                               ICB280 02425000
DEBTCAMQ EQU   DEBEOEA   TCAM USES AS WORK AREA (BITS 0-3)     @ZA34098 02440000
DEBEOENP EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         02455000
*                        END-OF-EXTENT APPENDAGE                 ICB280 02470000
DEBEOEAD DS    AL3       ADDRESS OF END-OF-EXTENT APPENDAGE ROUTINE     02480000
*                                                                ICB280 02490000
DEBSIOA  DS    0A        ADDRESS OF START I/O APPENDAGE ROUTINE  ICB280 02510000
DEBSIOAB DS    B         FLAG BYTE                               ICB280 02530000
DEBPGFX  EQU   X'80'     ADDRESS IN DEBSIOAD CAN BE USED TO DETERMINE   02550000
*                        THE ENTRY POINT TO THE PAGE FIX (PGFX)         02570000
*                        APPENDAGE ROUTINE BY ADDING 4 TO THE ADDRESS   02580000
*                        IN DEBSIOAD                             ICB280 02592000
DEBSIOX  EQU   X'40'     IF ZERO, DO NOT ENTER SIO APPENDAGE WHEN ERP   02593400
*                        IS ACTIVE.  IF ONE, ENTER SIO APPENDAGE EVEN   02594800
*                        WHEN ERP IS ACTIVE.                     ICB372 02595200
DEBIOVR  EQU   X'20'     IF ONE, EXCPVR REQUEST IS VALID.  IF ZERO,     02595800
*                        EXCPVR REQUEST IS INVALID AND WILL NOT BE      02596400
*                        EXECUTED. CURRENTLY HAS NO EFFECT.      ICB401 02597000
DEBFIX   EQU   X'10'     INDICATION THAT DEB HAS BEEN FIXED (OS/VS2)    02597600
*                        (MDC032)                                YM5929 02598200
DEBSIONP EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         02600600
*                        SIO APPENDAGE                           ICB280 02603100
DEBSIOAD DS    AL3       ADDRESS OF START I/O APPENDAGE ROUTINE  ICB280 02607300
DEBPCIA  DS    0A        ADDRESS OF PCI APPENDAGE ROUTINE        ICB280 02611500
DEBPCIAB DS    B         FLAG BYTE                               ICB280 02615700
DEBRSV24 EQU   X'80',,C'X' RESERVED                                     02620000
DEBRSV25 EQU   X'40',,C'X' RESERVED                                     02630000
DEBRSV26 EQU   X'20',,C'X' RESERVED                                     02640000
DEBRSV27 EQU   X'10',,C'X' RESERVED                                     02642000
DEBPCINP EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         02651000
*                        PCI APPENDAGE                           ICB280 02660000
DEBPCIAD DS    AL3       ADDRESS OF PROGRAM-CONTROLLED-INTERRUPTION     02670000
*                        (PCI) APPENDAGE ROUTINE                 ICB280 02680000
DEBCEA   DS    0A        ADDRESS OF CHANNEL-END APPENDAGE ROUTINE       02695000
*                                                                ICB280 02710000
DEBCEAB  DS    B         FLAG BYTE                               ICB280 02731000
DEBESMVR EQU   X'80',,C'X' VALIDITY CHECK FOR EXCPVR CALLER    @ZA34098 02752000
DEBRSV29 EQU   X'40',,C'X' RESERVED                                     02754000
DEBRSV30 EQU   X'20',,C'X' RESERVED                                     02756000
DEBRSV31 EQU   X'10',,C'X' RESERVED                                     02758000
DEBCENP  EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         02764000
*                        CHANNEL-END APPENDAGE                   ICB280 02770000
DEBCEAD  DS    AL3       ADDRESS OF CHANNEL-END APPENDAGE ROUTINE       02780000
*                                                                ICB280 02790000
DEBXCEA  DS    0A        ADDRESS OF ABNORMAL-END APPENDAGE ROUTINE      02800000
*                                                                ICB280 02810000
DEBXCEAB DS    B         FLAG BYTE                               ICB280 02831000
DEBRSV32 EQU   X'80',,C'X' RESERVED                                     02852000
DEBRSV33 EQU   X'40',,C'X' RESERVED                                     02854000
DEBRSV34 EQU   X'20',,C'X' RESERVED                                     02856000
DEBRSV35 EQU   X'10',,C'X' RESERVED                                     02858000
DEBXCENP EQU   X'0F'     NUMBER OF 2K PAGES TO BE FIXED FOR THE         02864000
*                        ABNORMAL-END APPENDAGE                  ICB280 02870000
DEBXCEAD DS    AL3       ADDRESS OF ABNORMAL-END APPENDAGE ROUTINE      02880000
*                                                                ICB280 02890000
DEBAVTE  EQU   *                  END OF APPENDAGE VECTOR TABLE    @L2A 02895036
         SPACE 1                                                        02900000
**********************************************************************  03000000
*                    DEB PREFIX TABLE                                *  03100000
**********************************************************************  03200000
         SPACE 1                                                        03300000
DEBPREFX DS    0A        DEB PREFIX TABLE                               03350000
DEBWKARA DS    XL1       O/C/E WORK AREA (DIRECT ACCESS)                03400000
DEBDSCBA DS    XL7       DSCB ADDRESS (BBCCHHR) USED BY O/C/E           03450000
*                        (DIRECT ACCESS)                                03610000
DEBXTNP  DS    0A        POINTER TO DEB EXTENSION (OS/VS2)       MDC008 03643400
DEBDCBMK DS    XL4       DCB MODIFICATION MASK USED BY O/C/E            03676800
*                        OBSOLETE                                MDC009 03710200
DEBLNGTH DS    BL1       LENGTH OF DEB IN DOUBLE WORDS                  03743600
DEBAMTYP DS    C         ACCESS METHOD TYPE                      ICB380 03777000
DEBAMNON EQU   0         ACCESS METHOD TYPE NOT KNOWN              @L2A 03810736
DEBAMVSM EQU   1                  VSAM ACCESS METHOD TYPE          @L2A 03811436
DEBAMXCP EQU   2                  EXCP ACCESS METHOD TYPE          @L2A 03812136
DEBAMTCM EQU   4                  TCAM ACCESS METHOD TYPE          @L2A 03812836
DEBAMGAM EQU   8                  GRAPHICS ACCESS METHOD TYPE      @L2A 03813536
DEBAMTAM EQU   16                 BTAM ACCESS METHOD TYPE          @L2A 03814236
DEBAMBPM EQU   32                 BPAM ACCESS METHOD TYPE          @L2A 03814936
DEBAMSAM EQU   32                 SEQUENTIAL ACCESS METHOD TYPE    @L2A 03815636
DEBAMBDM EQU   64                 DIRECT ACCESS METHOD TYPE        @L2A 03816336
DEBAMISM EQU   128                ISAM ACCESS METHOD TYPE          @L2A 03817036
DEBAMSUB EQU   129                SUBSYSTEM ACCESS METHOD TYPE     @L2A 03817736
DEBAMVTM EQU   130                VTAM ACCESS METHOD TYPE          @L2A 03818436
DEBAMTAP EQU   132                TCAM APPLICATION ACC METHOD TYPE @L2A 03819136
DEBTBLOF DS    H         OFFSET IN THE DEB TABLE TO THE ENTRY FOR       03824500
*                        THIS DEB                                ICB380 03830000
DEBPREFE EQU   *                  END OF DEB PREFIX TABLE          @L2A 03880036
         SPACE 1                                                        04000000
*********************************************************************** 04100000
*                     DEB BASIC SECTION                               * 04200000
*********************************************************************** 04300000
         SPACE 1                                                        04400000
DEBBASIC EQU   *                                                        04500000
DEBTCBAD DS    0A        ADDRESS OF TCB FOR THIS DEB                    04550000
DEBAMID  DS    0BL1      VTAM/TCAM DEB ID FLAG                 @ZA51573 04600000
DEBTAMID EQU   X'00'     TCAM DEB ID                           @ZA51573 04650000
DEBVAMID EQU   X'0F'     VTAM DEB ID                           @ZA51573 04700000
DEBNMSUB DS    BL1       NUMBER OF SUBROUTINES LOADED BY OPEN           04750000
*                        EXECUTOR ROUTINES                              04800000
DEBTCBB  DS    AL3       ADDRESS OF TCB FOR THIS DEB                    04850000
DEBDEBAD DS    0A        ADDRESS OF THE NEXT DEB IN THE SAME TASK       04900000
DEBAMLNG DS    BL1       NUMBER OF BYTES IN THE ACCESS METHOD DEPENDENT 04950000
*                        SECTION.  FOR BDAM THIS FIELD CONTAINS THE     05200000
*                        LENGTH EXPRESSED IN NUMBER OF WORDS.           05300000
DEBDEBB  DS    AL3       ADDRESS OF THE NEXT DEB IN THE SAME TASK       05350000
DEBIRBAD DS    0A        IRB STORAGE ADDRESS USED FOR APPENDAGE         05400000
*                        ASYNCHRONOUS EXITS                             05700000
DEBOFLGS DS    B         DATA SET STATUS FLAGS                          05750000
DEBDISP  EQU   X'C0'     DATA SET DISPOSITION FLAGS                     05800000
*                         BIT SETTING  DISPOSITION                      06000000
*              DEBDSOLD     01             OLD DATA SET                 06100000
*              DEBDSMOD     10             MOD DATA SET                 06200000
*              DEBDSNEW     11             NEW DATA SET                 06300000
DEBDSOLD EQU   X'40'              OLD DATA SET                     @L2A 06325036
DEBDSMOD EQU   X'80'              MOD DATA SET                     @L2A 06350036
DEBDSNEW EQU   X'C0'              NEW DATA SET                     @L2A 06375036
DEBEOF   EQU   X'20'     END-OF-FILE (EOF) ENCOUNTERED (TAPE INPUT)     06412500
*                        FORMAT 1 DSCB BIT 93.0 INDICATES THAT THE      06450000
*                        CURRENT VOLUME IS THE LAST VOLUME OF THE DATA  06460000
*                        SET (DASD INPUT)                               06470000
DEBRLSE  EQU   X'10'     RELEASE UNUSED EXTERNAL STORAGE (DASD)         06520000
*                        EMULATOR TAPE WITH SECOND GENERATION FORMAT.   06600000
*                        TAPE MAY CONTAIN BLOCKS SHORTER THAN 12        06650000
*                        CHARACTERS. (TAPE)                             06700000
DEBDCB   EQU   X'08'     DCB MODIFICATION                               06750000
DEBSPLIT EQU   X'04'     SPLIT CYLINDER (DASD). NO LONGER SUPPORTED.    06800000
*                        7-TRACK EMULATOR TAPE WITH POSSIBLE MIXED      07000000
*                        PARITY RECORDS (TAPE)                          07100000
DEBLABEL EQU   X'02'     NONSTANDARD LABELS                             07150000
DEBRERR  EQU   X'01'     USE REDUCED ERROR RECOVERY PROCEDURE (TAPE)    07200000
*                        CONCATENATED PARTITIONED ORGANIZATION DATA     07350000
*                        SETS PROCESSED USING BPAM (DASD)               07400000
DEBIRBB  DS    AL3       IRB STORAGE ADDRESS USED FOR APPENDAGE         07450000
*                        ASYNCHRONOUS EXITS                             07550000
DEBOPATB DS    B         FLAGS INDICATING BOTH THE METHOD OF I/O        07600000
*                        PROCESSING AND THE DISPOSITION THAT IS TO BE   07700000
*                        PERFORMED WHEN AN END-OF-VOLUME (EOV)          07800000
*                        CONDITION OCCURS                               07900000
DEBABEND EQU   X'80'     SET BY ABEND INDICATING A SYSABEND OR          07950000
*                        SYSUDUMP DATA SET                              08000000
DEBZERO  EQU   X'40'     ALWAYS ZERO                                    08050000
DEBPOSIT EQU   X'30'     DATA SET POSITIONING FLAGS                     08100000
*                         BIT SETTING    POSITIONING                    08400000
*              DEBRERED     01             REREAD                       08500000
*              DEBLEAVE     11             LEAVE                        08600000
DEBRERED EQU   X'10'              REREAD                           @L2A 08633336
DEBLEAVE EQU   X'30'              LEAVE                            @L2A 08666636
DEBACCS  EQU   X'0F'     TYPE OF I/O ACCESSING BEING DONE               08716600
*                         BIT SETTING    ACCESSING                      08800000
*              DEBINPUT     0000           INPUT                        08900000
*              DEBOUTPT     1111           OUTPUT OR EXTEND             08950000
*              DEBXTEND     1110           EXTEND(EQUIVALENT TO    @P2A 09033300
*                                            OUTPUT)               @P2A 09066600
*              DEBINOUT     0011           INOUT                        09100000
*              DEBOUTIN     0111           OUTIN OR OUTINX              09150000
*              DEBOTINX     0110           OUTINX(EQUIVALENT TO    @P2A 09233300
*                                            OUTIN)                @P2A 09266600
*              DEBRDBCK     0001           RDBACK                       09300000
*              DEBUPDAT     0100           UPDAT                        09400000
DEBINPUT EQU   0                  INPUT                            @L2A 09414236
DEBOUTPT EQU   X'0F'              OUTPUT                           @L2A 09428436
DEBXTEND EQU   X'0E'              EXTEND                           @P2A 09435500
DEBINOUT EQU   X'03'              INOUT                            @L2A 09442636
DEBOUTIN EQU   X'07'              OUTIN                            @L2A 09456836
DEBOTINX EQU   X'06'              OUTINX                           @P2A 09463900
DEBRDBCK EQU   X'01'              RDBACK                           @L2A 09471036
DEBUPDAT EQU   X'04'              UPDAT                            @L2A 09485236
DEBQSCNT DS    BL1       PURGE (SVC 16) - QUIESCE COUNT.  NUMBER OF     09535200
*                        DEVICES EXECUTING USER'S CHANNEL PROGRAMS,     09600000
*                        AS SHOWN BY BITS 5 AND 6 OF UCBFL1 FIELDS.     09700000
DEBFLGS1 DS    BL1       FLAG FIELD                                     09750000
DEBPWCKD EQU   X'80'     PASSWORD WAS SUPPLIED DURING OPEN.  EOV WILL   09800000
*                        NOT REQUEST A PASSWORD FOR EACH ADDITIONAL     09854000
*                        VOLUME OF A MULTIVOLUME DATA SET.              09856000
DEBEOFDF EQU   X'40'     SET BY EOV TO INFORM CLOSE THAT AN END-OF-FILE 09863000
*                        HAS BEEN ENCOUNTERED AND, THEREFORE, DEFERRED  09870000
*                        USER LABEL PROCESSING IS ALLOWED.              09880000
DEBRSIOA EQU   X'20'     SIO APPENDAGE RE-ENTRY AUTHORIZATION BIT       09881500
*                        (OS/VS1)  (MDC331)                    @XM06077 09883000
DEBEXCPA EQU   X'10'     EXCP IS AUTHORIZED FOR THIS DEB       @ZA20762 09886000
DEBCINDI EQU   X'08'     DCB ASSOCIATED WITH THIS DEB IS BEING          09889000
*                        PROCESSED BY THE COMPATIBILITY INTERFACE       09892000
*                        ROUTINES (VSAM OR SAM)                  ICB462 09893000
DEBF1CEV EQU   X'04'     EOV PROCESSING OCCURRED DURING CLOSE           09894000
*                        PROCESSING.  TESTED AND SET TO ZERO BY CLOSE,  09895000
*                        SET TO ONE BY EOV.  (ICB353)            A42228 09895400
DEBAPFIN EQU   X'02'     IF ON, AUTHORIZED PROGRAMS CAN BE LOADED       09896900
*                                                                MDC001 09898400
DEBXTNIN EQU   X'01'     IF ONE, DEB EXTENSION EXISTS            MDC007 09901600
DEBFLGS2 DS    XL1       FLAG FIELD TWO                            @L5C 09904800
DEBIOPAV EQU   X'80'     THE I/O PREVENTION IDENTIFIER (IOPID)     @L5A 09908000
*                        IN THE DEB EXTENSION IS VALID AND         @L5A 09912600
*                        DEBXTNIN IS ON                            @L5A 09917200
*                                                             2D   @10A 09921800
DEBVCR   EQU   X'40'     RLS=CR JCL OPTION                         @19C 09925800
DEBVNRI  EQU   X'20'     RLS=NRI JCL OPTION                        @19C 09929800
DEBVCRE  EQU   X'10'     RLS=CRE JCL OPTION                        @19C 09933800
DEBVRLS  EQU   X'08'          VSAM RLS ACCESS(VSAM ONLY)           @P5M 09937900
*                                                                  @H3A 09940200
*                        THE FOLLOWING TWO TAPE BITS ARE USED BY   @H3A 09944800
*                        O/C/EOV TO MAINTAIN AN UNIFORM RECORDING  @H3A 09949400
*                        MODE (COMPACTION OR NON-COMPACTION) ON    @H3A 09954000
*                        TAPE DATA SETS THAT SPAN OVER MORE THAN   @H3A 09958600
*                        ONE VOLUME.                               @H3A 09963200
*                                                                  @H3A 09967800
DEBDSCMP EQU   X'08'          TAPE DATA SET COMPACTION MODE        @H3A 09972400
DEBDSNCP EQU   X'04'          TAPE DATA SET NON-COMPACTION MODE    @H3A 09977000
*                                                                  @H3A 09981600
*                                                                  @H3A 09986200
DEBFGRV6 EQU   X'02'      RESERVED                                 @L5A 09990800
DEBTVS   EQU   X'01'     TRANSACTIONAL VSAM                        @P6C 10006700
DEBUSRPG DS    0A        ADDRESS OF FIRST IOB IN THE USER PURGE CHAIN   10022700
*                        (OS/VS1)                                       10050000
*                        ADDRESS OF PURGED I/O RESTORE LIST (PIRL)      10100000
*                        (OS/VS2)  (MDC029)                      YM3158 10150000
DEBNMEXT DS    BL1       NUMBER OF EXTENT DESCRIPTIONS STARTING         10182000
*                         AT DEBBASND.  ONE EXTENT PER UNIT FOR         10214000
*                         EXTENDED FORMAT OR PDSE DATA SETS.       @LEA 10246000
DEBUSRPB DS    AL3       ADDRESS OF FIRST IOB IN THE USER PURGE CHAIN   10278000
*                        (OS/VS1)                                       10310000
*                        ADDRESS OF PURGED I/O RESTORE LIST (PIRL)      10320000
*                        (OS/VS2)  (MDC030)                      YM3158 10330000
DEBRRQ   DS    0A        POINTER TO RELATED REQUEST QUEUE (OS/VS2)      10345000
*                                                                MDC026 10360000
DEBECBAD DS    0A        ADDRESS OF A PARAMETER LIST USED TO LOCATE     10410000
*                        THE PURGE ECB FOR AN SVC PURGE REQUEST         10500000
*                        (OS/VS1)                                MDC025 10550000
DEBPRIOR DS    BL1       PRIORITY OF THE TASK OWNING DEB                10600000
DEBECBB  DS    AL3       ADDRESS OF A PARAMETER LIST USED TO LOCATE     10650000
*                        THE PURGE ECB FOR AN SVC PURGE REQUEST         10750000
*                        (OS/VS1)                                MDC025 10760000
DEBDCBAD DS    0A        ADDRESS OF DCB OR ACB ASSOCIATED WITH THIS DEB 10810000
DEBPROTG DS    0BL1      TASK PROTECTION KEY IN HIGH-ORDER 4 BITS       10860000
DEBDEBID DS    BL1       A HEX F IN LOW-ORDER 4 BITS TO IDENTIFY        10910000
*                        THIS BLOCK AS A DEB                            11100000
DEBDCBB  DS    AL3       ADDRESS OF DCB OR ACB ASSOCIATED WITH THIS DEB 11150000
DEBAPPAD DS    0A        ADDRESS OF THE I/O APPENDAGE VECTOR TABLE      11200000
DEBEXSCL DS    AL1       THIS FIELD IS USED TO DETERMINE THE SIZE OF    11325000
*                        THE DEVICE DEPENDENT SECTION. TWO TO THIS      11350000
*                        POWER GIVES THE LENGTH OF THE DEVICE-          11375000
*                        DEPENDENT SECTION AT DEBBASND. EXTENT SCALE -  11400000
*                        4 (16 BYTES) FOR DIRECT ACCESS DEVICE AND      11425000
*                        3525 CARD PUNCH WITH DEVICE-ASSOCIATED DATA    11450000
*                        SET SUPPORT AND 2 (4 BYTES) FOR NONDIRECT      11500000
*                        ACCESS DEVICE AND COMMUNICATION DEVICE.        11550000
DEBAPPB  DS    AL3       ADDRESS OF THE I/O APPENDAGE VECTOR TABLE      11600000
DEBBASND EQU   *         END OF BASIC SECTION                           11650000
         SPACE 1                                                        12100000
*********************************************************************** 12200000
*      UNIT RECORD, MAGNETIC TAPE, TELECOMMUNICATIONS DEVICES SECTION * 12300000
*                                                                     * 12400000
*        NOTE  FOR TELECOMMUNICATIONS DEVICES, THE UCB ADDRESS IS     * 12500000
*              REPEATED FOR EACH LINE ASSIGNED                        * 12600000
*********************************************************************** 12700000
         SPACE 1                                                        12800000
DEBDDS1  EQU   *                                                        12900000
DEBSUCBA DS    0A        ADDRESS OF A UCB ASSOCIATED WITH A GIVEN       12950000
*                        DATA SET                                       13100000
DEBSDVM  DS    B         DEVICE MODIFIER.  FOR MAGNETIC TAPE, MODESET   13111700
*                        OPERATION CODE OR MODE SET FUNCTION BYTE. @H3C 13123400
*                        FOR UNIT RECORD, NOT USED.                     13135100
*                        9-TRACK TAPE MODESET OPERATION CODES      @H3A 13146800
DEBMTDN4 EQU   X'D3'     9-TRACK MODESET CCW CODE DENSITY=6250BPI  @H3A 13158500
DEBMTDN3 EQU   X'C3'     9-TRACK MODESET CCW CODE DENSITY=1600BPI  @H3A 13170200
DEBMTDN2 EQU   X'CB'     9-TRACK MODESET CCW CODE DENSITY= 800BPI  @H3A 13181900
*                        7-TRACK TAPE MODESET SKELETON CODES       @H3A 13193600
*                        (MUST BE COMPLETED WITH PARITY,           @H3A 13205300
*                                 TRANSLATION AND/OR CONVERSION)   @H3A 13217000
DEBM7DN0 EQU   X'03'     7-TRACK MODESET SKELETON DENSITY=200BPI   @H3A 13228700
DEBM7DN1 EQU   X'43'     7-TRACK MODESET SKELETON DENSITY=556BPI   @H3A 13240400
DEBM7DN2 EQU   X'83'     7-TRACK MODESET SKELETON DENSITY=800BPI   @H3A 13252100
*                        3480 TAPE OPERATION CODE                  @H3A 13263800
DEBMSTWI EQU   X'C3'     3480 SET TAPE WRITE IMMEDIATE CCW CODE    @H3A 13275500
*                        TAPE MODE SET FUNCTION BYTE               @H3A 13287200
DEBMTRF0 EQU   X'80'     TAPE RECORDING FORMAT BIT 0               @H3A 13298900
DEBMTRF1 EQU   X'40'     TAPE RECORDING FORMAT BIT 1               @H3A 13310600
DEBMTWI  EQU   X'20'     TAPE WRITE IMMEDIATE (NON-BUFFERED WRITE) @H3A 13322300
DEBMINHS EQU   X'10'     INHIBIT SUPERVISOR COMMANDS               @H3A 13334000
DEBMCOMP EQU   X'08'     COMPACTED RECORDING MODE                  @H3A 13345700
DEBCMPAC EQU   DEBMCOMP  COMPACTED RECORDING MODE                  @H3A 13357400
DEBM3424 EQU   X'02'     3424 MODE SET FLAG                        @H3A 13369100
DEBM9348 EQU   X'02'     RESERVED(WILL BE DELETED)                 @H3A 13380800
DEBMINHE EQU   X'01'     INHIBIT CONTROL UNIT ERP                  @H3A 13392500
*                                                                  @H3A 13404200
DEBM6250 EQU   DEBMTRF0+DEBMTRF1+DEBM3424 SET 3424 DENSITY=6250BPI @H3A 13415900
DEBM1600 EQU   DEBMTRF1+DEBM3424          SET 3424 DENSITY=1600BPI @H3A 13427600
*                                                                  @H3A 13439300
DEBM4TRK EQU   DEBMTRF0+DEBMTRF1+DEBM9348 RESERVED(WILL BE DELETED)@H3A 13451000
DEBM2TRK EQU   DEBMTRF0+DEBM9348          RESERVED(WILL BE DELETED)@H3A 13462700
DEBM1TRK EQU   DEBMTRF1+DEBM9348          RESERVED(WILL BE DELETED)@H3A 13474400
*                                                                  @H3A 13486100
DEBSUCBB DS    AL3       ADDRESS OF A UCB ASSOCIATED WITH A GIVEN       13494000
*                        DATA SET                                       13502000
DEBDEVED DS    0A        END OF COMMON UNIT RECORD FIELDS  (MDC330)     13503000
*                                                              @X04AA9A 13504000
         SPACE 1                                                        13505000
*        THE FOLLOWING FIELDS ARE PRESENT ONLY FOR THE 3525 WITH        13510000
*        DEVICE-ASSOCIATED DATA SET SUPPORT                             13515000
         SPACE 1                                                        13520000
DEBRDCB  DS    0A        ADDRESS OF DCB FOR THE READ ASSOCIATED DATA    13525000
*                        SET                                     ICB394 13530000
DEBRSV06 DS    X         RESERVED                                ICB394 13534000
DEBRDCBA DS    AL3       ADDRESS OF DCB FOR THE READ ASSOCIATED DATA    13538000
*                        SET                                     ICB394 13542000
DEBPDCB  DS    0A        ADDRESS OF DCB FOR THE PUNCH ASSOCIATED DATA   13546000
*                        SET                                     ICB394 13550000
DEBRSV07 DS    X         RESERVED                                ICB394 13554000
DEBPDCBA DS    AL3       ADDRESS OF DCB FOR THE PUNCH ASSOCIATED DATA   13558000
*                        SET                                     ICB394 13562000
DEBWDCB  DS    0A        ADDRESS OF DCB FOR THE PRINT ASSOCIATED DATA   13566000
*                        SET                                     ICB394 13570000
DEBRSV08 DS    X         RESERVED                                ICB394 13576600
DEBWDCBA DS    AL3       ADDRESS OF DCB FOR THE PRINT ASSOCIATED DATA   13583200
*                        SET                                     ICB394 13590000
DEBASDSE EQU   *                  END OF DEVICE-ASSOCIATED DS SEC. @L2A 13590336
         SPACE 2                                                        13590600
*********************************************************************** 13591200
*                   3540 ACCESS METHOD DEPENDENT SECTION      @X04AA9A* 13591800
*                   (OS/VS1 ONLY)                             @X04AA9A* 13592400
*                                                                     * 13593000
*        NOTE  THIS SECTION FOLLOWS DEBSUCBA IN UNIT RECORD, MAGNETIC * 13593600
*              TAPE, TELECOMMUNICATIONS DEVICES SECTION IF DEB IS     * 13594200
*              FOR 3540 DEVICE.                               @X04AA9A* 13594800
*********************************************************************** 13595400
         SPACE 2                                                        13596000
         ORG   DEBDEVED                                        @X04AA9A 13596600
         SPACE 1                                                        13597200
DEBASC09 DS    0CL16     3540 ACCESS METHOD DEPENDENT SECTION           13597800
*                        (MDC317)                              @X04AA9A 13598400
DEBVOLAC DS    CL1       VOLUME ACCESSABILITY INDICATOR  (MDC327)       13600700
*                                                              @X04AA9A 13603000
DEBDSSQL DS    CL1       DATA SET SECURITY QUALIFIER (MDC328)  @X04AA9A 13606000
DEBVSEQU DS    FL1       VOLUME SEQUENCE NUMBER  (MDC318)      @X04AA9A 13609000
DEBEAMFG DS    B         FLAG BYTE  (MDC319)                   @X04AA9A 13612000
DEBMULTI EQU   X'80'     MULTI-VOLUME INDICATOR  (MDC320)      @X04AA9A 13615000
DEBDSOPN EQU   X'40'     DATA SET IS OPEN  (MDC321)            @X04AA9A 13618000
DEBVAMSG EQU   X'20'     VOLUME ACCESSABILITY MESSAGE HAS BEEN ISSUED   13621000
*                        (MDC329)                              @X04AA9A 13624000
DEBSECVL EQU   X'10'     SECURE VOLUME  (MDC332)               @X04AA9A 13626600
DEBRV004 EQU   X'08',,C'X'   RESERVED                          @X04AA9A 13629200
DEBRV005 EQU   X'04',,C'X'   RESERVED                          @X04AA9A 13631800
DEBRV006 EQU   X'02',,C'X'   RESERVED                          @X04AA9A 13634400
DEBRV007 EQU   X'01',,C'X'   RESERVED                          @X04AA9A 13637000
DEBDSID  DS    0CL8      DATA SET IDENTIFIER (DSID) (INPUT)  (MDC305)   13639600
*                                                              @X04AA9A 13642600
DEBEXDTE DS    CL6       EXPIRATION DATE (OUTPUT)  (MDC333)    @X04AA9A 13643200
DEBWTPTI DS    CL1       WRITE PROTECT INDICATOR (OUTPUT)  (MDC334)     13643800
*                                                              @X04AA9A 13644400
DEBRV008 DS    CL1       RESERVED (OUTPUT)  (MDC335)           @X04AA9A 13647600
DEBEOD   DS    0CL4      END OF DATA (EOD) ADDRESS (INPUT)  (MDC306)    13650800
*                                                              @X04AA9A 13654000
DEBBOE   DS    0CL4      BEGINNING OF EXTENT (BOE) ADDRESS (OUTPUT)     13658500
*                        (MDC322)                              @X04AA9A 13663000
DEBEODRV DS    0XL1      RESERVED  (MDC307)                    @X04AA9A 13666100
DEBBOERV DS    XL1       RESERVED  (MDC323)                    @X04AA9A 13669200
DEBEODTT DS    0XL1      EOD TRACK NUMBER  (MDC308)            @X04AA9A 13672300
DEBBOETT DS    XL1       BOE TRACK NUMBER  (MDC324)            @X04AA9A 13675400
DEBEOD0  DS    0XL1      MUST BE ZERO  (MDC309)                @X04AA9A 13678500
DEBBOE0  DS    XL1       MUST BE ZERO  (MDC325)                @X04AA9A 13681600
DEBEODSS DS    0XL1      EOD SECTOR NUMBER  (MDC310)           @X04AA9A 13684700
DEBBOESS DS    XL1       BOE SECTOR NUMBER  (MDC326)           @X04AA9A 13687800
DEBASC9E EQU   *                  END OF 3540 DEPENDENT SECTION    @L2A 13691536
         SPACE 2                                                        13693000
*********************************************************************** 13700000
*                DEB ISAM DEPENDENT SECTION                           * 13800000
*                                                                     * 13810000
*        NOTE  PRESENT ONLY IF ISAM IS USED.  FOLLOWS THE BASIC       * 13850000
*              SECTION AND PRECEDES THE DIRECT ACCESS STORAGE DEVICE  * 13860000
*              SECTION.  COUNTED AS ONE EXTENT IN DEBNMEXT.           * 13870000
*********************************************************************** 13900000
         SPACE 1                                                        14000000
         ORG   DEBBASND                                                 14100000
         SPACE 1                                                        14200000
DEBISAM  EQU   *                                                        14300000
DEBFIEAD DS    0A        ADDRESS OF FIRST INDEX EXTENT                  14350000
DEBNIEE  DS    BL1       NUMBER OF EXTENTS OF INDEPENDENT INDEX AREA    14400000
DEBFIEB  DS    AL3       ADDRESS OF FIRST INDEX EXTENT                  14450000
DEBFPEAD DS    0A        ADDRESS OF THE FIRST PRIME DATA EXTENT         14500000
DEBNPEE  DS    BL1       NUMBER OF EXTENTS OF PRIME DATA AREA           14550000
*                        (M=0 EXTENT)                                   14950000
DEBFPEB  DS    AL3       ADDRESS OF THE FIRST PRIME DATA EXTENT         15000000
DEBFOEAD DS    0A        ADDRESS OF THE FIRST OVERFLOW EXTENT           15050000
DEBNOEE  DS    BL1       NUMBER OF EXTENTS OF INDEPENDENT OVERFLOW AREA 15100000
DEBFOEB  DS    AL3       ADDRESS OF THE FIRST OVERFLOW EXTENT           15150000
DEBEXPT  DS    0A        ADDRESS OF ISAM DEB EXTENSION           ICB379 15200000
DEBRPSID DS    BL1       ROTATIONAL POSITION SENSING (RPS) DEVICE       15250000
*                        INDICATORS                                     15754000
DEBRPSP  EQU   X'80'     PRIME DATA AREA IS ON RPS DEVICE               15761200
DEBRPSI  EQU   X'40'     INDEPENDENT INDEX AREA IS ON RPS DEVICE        15768400
DEBRPSO  EQU   X'20'     INDEPENDENT OVERFLOW AREA IS ON RPS DEVICE     15775600
DEBRPSAP EQU   X'10'     RPS SIO APPENDAGE HAS BEEN LOADED              15782800
DEBRSV09 EQU   X'08',,C'X' RESERVED                                     15790400
DEBRSV10 EQU   X'04',,C'X' RESERVED                                     15790800
DEBRSV11 EQU   X'02',,C'X' RESERVED                                     15791200
DEBRSV12 EQU   X'01',,C'X' RESERVED                                     15791600
DEBEXPTA DS    AL3       ADDRESS OF ISAM DEB EXTENSION           ICB379 15793800
DEBISAME EQU   *                  END OF ISAM DEPENDENT SECTION    @L2A 15796036
         SPACE 2                                                        15800000
*********************************************************************** 15900000
*             DIRECT-ACCESS STORAGE DEVICE SECTION                    * 16000000
*                                                                     * 16100000
*        NOTE  IF ISAM IS BEING USED, THIS SECTION FOLLOWS THE ISAM   * 16150000
*              DEVICE DEPENDENT SECTION.  OTHERWISE, IT FOLLOWS THE   * 16200000
*              BASIC SECTION.                                         * 16250000
*                                                                     * 16300000
*              THERE IS ONE OF THESE SECTIONS FOR EACH EXTENT.        * 16350000
*********************************************************************** 16500000
         SPACE 1                                                        16600000
DEBDASD  DSECT                                                          16700000
DEBUCBAD DS    0A        ADDRESS OF UCB ASSOCIATED WITH THIS DATA       16750000
*                        EXTENT                                         16850000
DEBDVMOD DS    B         DEVICE MODIFIER - FILE MASK                    16900000
DEBUCBA  DS    AL3       ADDRESS OF UCB ASSOCIATED WITH THIS DATA       16950000
*                        EXTENT                                         17050000
DEBBINUM DS    CL2       BIN NUMBER                                     17100000
DEBSTRCC DS    CL2       CYLINDER ADDRESS FOR THE START OF AN EXTENT.   17150000
*                        FOR A PDSE OR EXTENDED FORMAT DATA             17200000
*                        SET, BIT ZERO OF THE FIRST BYTE IS ON.         17250000
DEBSTRHH DS    CL2       TRACK ADDRESS FOR THE START OF AN EXTENT.      17300000
DEBENDCC DS    CL2       CYLINDER ADDRESS FOR THE END OF AN EXTENT.     17350000
*                        FOR A PDSE THIS FIELD IS RESERVED.             17400000
*                        FOR AN EXTENDED FORMAT DATA SET THIS FIELD     17450000
*                        CONTAINS THE CYLINDER NUMBER OF THE FORMAT-1   17500000
*                        DSCB ADDRESS.                                  17550000
DEBENDHH DS    CL2       TRACK ADDRESS FOR THE END OF AN EXTENT.        17600000
*                        FOR A PDSE THIS FIELD IS RESERVED.             17650000
*                        FOR AN EXTENDED FORMAT DATA SET THIS FIELD     17700000
*                        CONTAINS THE TRACK NUMBER OF THE FORMAT-1      17750000
*                        DSCB ADDRESS.                                  17800000
DEBNMTRK DS    CL2       NUMBER OF TRACKS ALLOCATED TO A GIVEN EXTENT.  17850000
*                        FOR SPLIT CYLINDER DATA SETS, THIS FIELD       18050000
*                        REPRESENTS THE NUMBER OF TRACKS BETWEEN THE    18100000
*                        START ADDRESS OF THE EXTENT AND THE END        18150000
*                        ADDRESS OF THE EXTENT.                         18200000
DEBDASDE EQU   *                  END OF DASD DEVICE SECTION       @L2A 18250036
         SPACE 2                                                        18300000
*********************************************************************** 18400000
*        EXCP ACCESS METHOD, BSAM AND QSAM DEPENDENT SECTION          * 18500000
*********************************************************************** 18600000
         SPACE 1                                                        18700000
DEBACSMD DSECT                                                          18800000
         SPACE 1                                                        18900000
DEBVOLSQ DS    0CL2      VOLUME SEQUENCE NUMBER FOR MULTIVOLUME         18950000
*                        SEQUENTIAL DATA SETS                           19100000
DEBVOLBT DS    B         FIRST BYTE OF DEBVOLSQ (MDC016)        YA00318 19123300
DEBEXFUL EQU   X'80'     SET BY EOV WHEN REWRITING AN OLD DIRECT ACCESS 19146600
*                        DATA SET TO INDICATE THAT ALL PREVIOUS         19170000
*                        EXISTING EXTENTS HAVE BEEN FILLED              19180000
*                        (MDC017)                               YA00318 19182000
DEBRSV36 EQU   X'40',,C'X'   RESERVED                            MDC018 19183900
DEBRSV37 EQU   X'20',,C'X'   RESERVED                            MDC018 19185800
DEBRSV38 EQU   X'10',,C'X'   RESERVED                            MDC018 19187700
DEBRSV39 EQU   X'08',,C'X'   RESERVED                            MDC018 19189600
DEBRSV40 EQU   X'04',,C'X'   RESERVED                            MDC018 19191500
DEBRSV41 EQU   X'02',,C'X'   RESERVED                            MDC018 19193400
DEBRSV42 EQU   X'01',,C'X'   RESERVED                            MDC018 19195300
DEBVLSEQ DS    FL1       FOR DIRECT ACCESS, SEQUENCE NUMBER OF THE      19197200
*                        VOLUME OF THE DATA SET RELATIVE TO THE FIRST   19199600
*                        VOLUME OF THE DATA SET.  FOR TAPE, SEQUENCE    19199700
*                        NUMBER OF THE VOLUME OF THE DATA SET RELATIVE  19199800
*                        TO THE FIRST VOLUME PROCESSED.(MDC019) YA00318 19199900
DEBVOLNM DS    CL2       TOTAL NUMBER OF VOLUMES IN A MULTIVOLUME       19249900
*                        SEQUENTIAL DATA SET.                           19300000
DEBDSNM  DS    0CL8      MEMBER NAME.  THIS FIELD APPEARS ONLY WHEN AN  19350000
*                        OUTPUT DATA SET HAS BEEN OPENED FOR A MEMBER   19500000
*                        NAME AND THE DSCB SPECIFIES A PARTITIONED      19600000
*                        DATA SET.                                      19700000
DEBUTSAA DS    0A        ADDRESS OF THE USER TOTALING SAVE AREA         19750000
DEBRSV13 DS    X         RESERVED                                       19800000
DEBUTSAB DS    AL3       ADDRESS OF THE USER TOTALING SAVE AREA         19850000
DEBRSV14 DS    XL4       RESERVED (IF USER TOTALING WAS SPECIFIED)      19900000
DEBBLKSI DS    H         MAXIMUM BLOCK SIZE  (MDC346)          @ZA03699 19950000
DEBLRECL DS    H         LOGICAL RECORD LENGTH  (MDC347)       @ZA03699 20000000
         SPACE 2                                                        20300000
*********************************************************************** 20400000
*                  BPAM DEPENDENT SECTION                             * 20500000
*********************************************************************** 20600000
         SPACE 2                                                        20700000
         ORG   DEBACSMD                                                 20800000
         SPACE 1                                                        20900000
DEBEXTNM DS    0C        FOR A PARTITIONED DATA SET OPENED FOR INPUT,   20950000
*                        EACH ONE-BYTE FIELD CONTAINS THE EXTENT NUMBER 21100000
*                        OF THE FIRST EXTENT ENTRY FOR EACH DATA SET    21200000
*                        EXCEPT THE FIRST, IF TWO OR MORE DATA SETS ARE 21300000
*                        CONCATENATED.  THE NUMBER OF BYTES IN THE      21400000
*                        FIELD IS EQUAL TO ONE LESS THAN THE NUMBER OF  21500000
*                        DATA SETS CONCATENATED.                        21700000
DEBDSNAM DS    CL8       FOR A PARTITIONED DATA SET OPENED FOR          21750000
*                        OUTPUT FOR A MEMBER NAME, THIS FIELD IS THE    21900000
*                        MEMBER NAME.                                   22000000
         SPACE 2                                                        22100000
*********************************************************************** 22200000
*                  BDAM DEPENDENT SECTION                             * 22300000
*********************************************************************** 22400000
         SPACE 2                                                        22500000
         ORG   DEBACSMD                                                 22600000
         SPACE 1                                                        22700000
*                         *****************************************     22800000
*                         * FOR FIXED LENGTH RECORDS WITH THE     *     22900000
*                         * OPTION OF RELATIVE BLOCK ADDRESSING   *     23000000
*                         * (BUT NOT TRACK OVERFLOW)              *     23100000
*                         *****************************************     23200000
         SPACE 1                                                        23300000
DEBDBLK  DS    0F        ONE FOUR-BYTE FIELD FOR EACH EXTENT            23350000
*                        DESCRIBED IN THE DEVICE DEPENDENT SECTION      23500000
DEBDBPT  DS    AL1       NUMBER OF BLOCKS PER TRACK                     23550000
DEBDBPE  DS    CL3       NUMBER OF BLOCKS PER EXTENT                    23600000
         SPACE 2                                                        23900000
         ORG   DEBACSMD                                                 24000000
         SPACE 1                                                        24100000
*                         *****************************************     24200000
*                         * FOR FIXED LENGTH RECORDS WITH THE     *     24300000
*                         * OPTION OF RELATIVE BLOCK ADDRESSING   *     24400000
*                         * AND TRACK OVERFLOW.                   *     24500000
*                         *****************************************     24600000
         SPACE 1                                                        24700000
DEBDTPP  DS    FL4       NUMBER OF TRACKS PER PERIOD                    24750000
DEBDBPP  DS    FL4       NUMBER OF BLOCKS PER PERIOD                    24800000
         SPACE 1                                                        24950000
*                         THE FOLLOWING FIELD OCCURS ONCE FOR           25000000
*                         EACH EXTENT.                                  25100000
         SPACE 1                                                        25150000
DEBDBPEF DS    FL4       NUMBER OF BLOCKS PER EXTENT                    25200000
         SPACE 2                                                        25300000
*********************************************************************** 25400000
*                 BTAM DEPENDENT SECTION                              * 25500000
*                                                                     * 25550000
*        NOTE  THIS SEGMENT IS ALWAYS PRESENT FOR BTAM.  IT IS USED   * 25560000
*              WHEN A BUFFER POOL OR DYNAMIC BUFFERING IS USED.       * 25570000
*              OTHERWISE, THE FIELDS ARE ZERO.                        * 25580000
*********************************************************************** 25600000
         SPACE 2                                                        25700000
         ORG   DEBACSMD                                                 25800000
         SPACE 1                                                        25900000
DEBTBFRA DS    0A        ADDRESS OF THE BUFFER ROUTINE                  25950000
DEBRSV15 DS    X         RESERVED                                       26000000
DEBTBFRB DS    AL3       ADDRESS OF THE BUFFER ROUTINE                  26050000
         SPACE 1                                                        26650000
*                         THE FOLLOWING FIELD IS REPEATED FOR EACH      26700000
*                         CCW ON THE CHANNEL PROGRAM QUEUE              26800000
         SPACE 1                                                        26850000
DEBTCCWA DS    0A        ADDRESS OF THE FIRST (OR FOLLOWING) CCW ON     26900000
*                        THE QUEUE                                      26950000
DEBRSV16 DS    X         RESERVED                                       27000000
DEBTCCWB DS    AL3       ADDRESS OF THE FIRST (OR FOLLOWING) CCW ON     27050000
*                        THE QUEUE                                      27150000
         SPACE 2                                                        27200000
*********************************************************************** 27300000
*                   GAM DEPENDENT SECTION                             * 27400000
*********************************************************************** 27500000
         SPACE 2                                                        27600000
         ORG   DEBACSMD                                                 27700000
         SPACE 1                                                        27800000
DEBFUCBA DS    0A        ADDRESS OF FIRST UCB                           27850000
DEBRSV17 DS    X         RESERVED                                       27900000
DEBFUCBB DS    AL3       ADDRESS OF FIRST UCB                           27950000
DEBLUCBA DS    0A        ADDRESS OF LAST UCB                            28000000
DEBRSV18 DS    X         RESERVED                                       28050000
DEBLUCBB DS    AL3       ADDRESS OF LAST UCB                            28100000
         SPACE 2                                                        28419600
*********************************************************************** 28420000
*                 ISAM LOAD MODE EXTENSION                            * 28421000
*                 POINTED TO BY DEBEXPT                               * 28422000
*********************************************************************** 28423000
         SPACE 2                                                        28424000
         ORG   DEBACSMD                                                 28426000
         SPACE 1                                                        28430000
DEBDCBFA DS    A         ADDRESS OF DCB FIELD AREA               MDC013 28432000
DEBPUT   DS    A         ADDRESS OF PUT MODULE                   ICB379 28434000
         SPACE 2                                                        28436000
*********************************************************************** 28438000
*                 ISAM SCAN MODE EXTENSION                            * 28440000
*                 POINTED TO BY DEBEXPT                               * 28444000
*********************************************************************** 28446000
         SPACE 2                                                        28448000
         ORG   DEBACSMD                                                 28450000
         SPACE 1                                                        28454000
         DS    A         DEBDCBFA - ADDRESS OF DCB FIELD AREA    MDC014 28456600
DEBGET   DS    A         ADDRESS OF GET OR PUT MODULE - THIS FIELD      28459200
*                        IS ALSO CALLED DEBPUT                   ICB379 28462000
DEBWKPT4 DS    A         SAME AS DCBWKPT4 - ADDRESS OF UCB       ICB379 28464600
DEBWKPT5 DS    A         SAME AS DCBWKPT5 - ADDRESS OF GET APPENDAGE    28467200
*                        MODULE                                  ICB379 28470000
DEBCREAD DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           28472000
*                        READ                                    ICB379 28474000
DEBCSETL DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           28477000
*                        SETL                                    ICB379 28480000
DEBCWRIT DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           28482000
*                        WRITE                                   ICB379 28484000
DEBCCHK  DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           28487000
*                        WRITE VALIDITY CHECK                    ICB379 28490000
DEBCREWT DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           28492000
*                        RE-WRITE                                ICB379 28494000
DEBCRECK DS    A         ADDRESS OF CHANNEL-END APPENDAGE FOR           28496000
*                        RE-CHECK                                ICB379 28498000
DEBAREAD DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          28501000
*                        READ                                    ICB379 28504000
DEBASETL DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          28507000
*                        SETL                                    ICB379 28510000
DEBAWRIT DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          28511400
*                        WRITE                                   ICB379 28512800
DEBACHK  DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          28516400
*                        WRITE VALIDITY CHECK                    ICB379 28520000
DEBAREWT DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          28522000
*                        RE-WRITE                                ICB379 28524000
DEBARECK DS    A         ADDRESS OF ABNORMAL-END APPENDAGE FOR          28526000
*                        RE-CHECK                                ICB379 28528000
DEBRPSST DS    A         ADDRESS OF RPS SIO APPENDAGE IF ADDRSPC=REAL   28530000
*                        WAS NOT SPECIFIED                       ICB379 28532000
         SPACE 2                                                        28534000
*********************************************************************** 28536000
*                 BISAM MODE EXTENSION                                * 28538000
*                 POINTED TO BY DEBEXPT                               * 28540000
*********************************************************************** 28542000
         SPACE 2                                                        28544000
         ORG   DEBACSMD                                                 28546000
         SPACE 1                                                        28548000
         DS    A         DEBDCBFA - ADDRESS OF DCB FIELD AREA    MDC015 28550000
DEBDISAD DS    A         ADDRESS OF PRIVILEGED MODULE ENTERED WHEN A    28552000
*                        BISAM MACRO INSTRUCTION IS EXECUTED     ICB379 28554000
         DS    A         DEBWKPT4 - SAME AS DCBWKPT4 - ADDRESS OF THE   28556000
*                        PART 1 APPENDAGE MODULE (ABNORMAL AND          28558000
*                        CHANNEL-END APPENDAGES)                 ICB379 28560000
         DS    A         DEBWKPT5 - SAME AS DCBWKPT5 - ADDRESS OF THE   28562000
*                        PART 2 APPENDAGE MODULE (ABNORMAL AND          28564000
*                        CHANNEL-END APPENDAGES)                 ICB379 28566000
DEBFREED DS    A         ADDRESS OF DYNAMIC BUFFERING MODULE     ICB379 28568000
DEBRPSIO DS    A         ADDRESS OF RPS SIO APPENDAGE MODULE IF         28570000
*                        ADDRSPC=REAL WAS NOT SPECIFIED AND IF DYNAMIC  28572000
*                        BUFFERING IS USED                       ICB379 28574000
DEBSIOA2 DS    A         ADDRESS OF DYNAMIC BUFFERING APPENDAGE MODULE  28576000
*                        DISPLACED BY PAGE FIX (PGFX) APPENDAGE IF      28578000
*                        ADDRSPC=REAL WAS NOT SPECIFIED          ICB379 28580000
         SPACE 2                                                        28582000
*********************************************************************** 28600000
*                 SUBROUTINE NAME SECTION                             * 28700000
*                                                                     * 28750000
*        NOTE  FOLLOWS THE ACCESS METHOD DEPENDENT SECTION, OR THE    * 28760000
*              DEVICE DEPENDENT SECTION IF THERE IS NO ACCESS         * 28770000
*              METHOD SECTION                                         * 28780000
*********************************************************************** 28800000
         SPACE 1                                                        28900000
DEBSUBNM DSECT                                                          29000000
DEBSUBID DS    CL2       SUBROUTINE IDENTIFICATION.  EACH ACCESS METHOD 29050000
*                        SUBROUTINE, APPENDAGE SUBROUTINE, AND IRB      29550000
*                        ROUTINE WILL HAVE A UNIQUE EIGHT-BYTE NAME.    29600000
*                        THE LOW-ORDER TWO BYTES OF EACH ROUTINE NAME   29650000
*                        WILL BE IN THIS FIELD IF THE SUBROUTINE IS     29700000
*                        LOADED BY THE OPEN ROUTINES.                   29750000
         SPACE 2                                                        29801000
*********************************************************************** 29802000
*                 DEB EXTENSION                                       * 29803000
*                 POINTED TO BY DEBXTNP                               * 29804000
*********************************************************************** 29805000
         SPACE 1                                                        29806000
DEBXTN   DSECT                                                          29807000
DEBXLNGH DS    H         LENGTH OF DEB EXTENSION                 MDC002 29807500
DEBXFLG1 DS    B         FLAG BYTE  (MDC027)                     YM1272 29808000
DEBXCDCB EQU   X'80'     DEBDCBAD FIELD CONTAINS THE ADDRESS OF A       29808500
*                        COPIED DCB.  USED BY END-OF-VOLUME, TCLOSE AND 29809000
*                        TASK CLOSE.  (MDC028)                   YM1272 29809200
DEBXTSKC EQU   X'40'     TASK CLOSE IS CLOSING THE RELATED DCB.  SET BY 29809300
*                        TASK CLOSE AND INTERROGATED BY END-OF-VOLUME,  29809400
*                        FEOV AND TCLOSE FOR DEB'S NOT ON THE CURRENT   29809500
*                        TCB DEB CHAIN.  (MDC031)                YM2869 29809600
DEBXDSSI EQU   X'20'     DATA SET SECURITY INDICATOR.  SET BY OPEN AND  29810800
*                        CHECKPOINT.  INTERROGATED BY EOV.              29812000
*                        (MDC348)                              @Z40RP9A 29812600
DEBXWIND EQU   X'10'     MSS WINDOW PROCESSING INDICATOR.      @ZA37313 29813500
*                        SET BY OPEN.  INTERROGATED BY EOV,    @ZA37313 29814500
*                        SAM EOB AND CLOSE.                    @ZA37313 29815000
DEBXACIS EQU   X'08'     ACQUIRE ISSUED WITH INHIBIT STAGE     @ZA37313 29815500
*                        INDICATED DURING OPEN OR EOV.         @ZA37313 29816000
*                        SET BY OPEN AND EOV.                  @ZA37313 29816500
*                        INTERROGATED BY SVC 126.              @ZA37313 29817000
DEBXNFLS EQU   X'04'     DO NOT FLUSH QSAM BUFFERS IN CLOSE BECAUSE    *29817536
                         AN OPEN/CLOSE/EOV ABEND OCCURRED. SET BY      *29818036
                         IFG0RR0B. TESTED BY IGG0201Z.             @01A 29818536
*                                                                  @L1D 29818736
DEBXSYSB EQU   X'02'     SYSTEM DETERMINED BLOCKSIZE               @L8C 29818900
DEBXRACE EQU   X'01'     RACF EXECUTE ONLY AUTHORITY OF A PROGRAM  @L9A 29819100
*                        LIBRARY. SET BY OPEN AND INTEROGATED BY   @L9A 29819300
*                        OPEN AFTER FINAL DCB MERGE AND BY A SAM   @L9A 29819500
*                        EXECUTOR.                                 @L9A 29819700
DEBXFLG2 DS    B         FLAG BYTE                                 @06C 29819900
DEBXRSAP EQU   X'80'     USED BY RESTART TO INDICATE THAT RESTART  @06A 29820100
*                        HAS INCREASED THE LENGTH OF THE DEB       @06A 29820300
*                        EXTENSION TO INCLUDE A CHKPT/RST APPENDAGE@06A 29820500
*                        TO THE DEB EXTENSION. THE APPENDAGE IS    @06A 29820700
*                        FREEMAINED AND THIS BIT IS TURNED OFF     @06A 29820900
*                        BEFORE RESTART PROCESSING IS COMPLETED.   @06A 29821100
*                        DEBXLNTH INCLUDES THE LENGTH OF THE       @06A 29821300
*                        APPENDAGE WHILE THIS BIT IS ON.           @06A 29821500
DEBBYP   EQU   X'40'     WHEN ON EXCP SCAN ROUTINE WILL SET        @LBC 29821700
*                        IOSBYP ON AND BYPASS BUILDING A PREFIX    @LBA 29821900
DEBCHCMP EQU   X'20'     WHEN ON EXCP SCAN ROUTINE WILL SET        @LBC 29822100
*                        IOSCHCMP ON AND BYPASS BUILDING A PREFIX  @LBA 29822300
DEBXENQA EQU   X'10'     ENQUEUED ON PDS, DISP=SHARE, OUTPUT       @LCC 29822500
DEBXENQS EQU   X'08'     ENQUEUED ON DSCB,DISP=SHR                 @LCC 29822700
DEBXIMSC EQU   X'04',,C'X'   IMS CLOSE IN PROGRESS                 @09C 29822900
DEBXCASV EQU   X'02'     THE CACHE ATTRIBUTE TOKEN IS VALID        @10A 29823100
DEBXMVLF EQU   X'01'     TAPE MULTIVOL & 1ST VOL READ              @LGC 29825600
DEBXDSAB DS    A         POINTER TO DSAB                         MDC004 29828100
DEBXDCBM DS    XL4       DCB MODIFICATION MASK USED BY O/C/EOV          29830600
DEBXDBPR DS    A         POINTER TO DEB                          MDC006 29833100
DEBXDSO1 DS    B         SAME AS DCBDSORG BYTE 1                 MDC020 29835600
DEBXDSO2 DS    B         SAME AS DCBDSORG BYTE 2                 MDC021 29838100
DEBXMCF1 DS    B         SAME AS DCBMACRF BYTE 1                 MDC022 29840600
DEBXMCF2 DS    B         SAME AS DCBMACRF BYTE 2                 MDC023 29843100
DEBXXARG DS    A         ADDRESS OF BDAM READ EXCLUSIVE LIST     MDC024 29845600
DEBXOPNJ DS    A         POINTER TO DSAB (SEPARATE FROM DEBXDSAB)       29848100
*                        DYNAMICALLY ALLOCATED BY OPEN TYPE=J.  THIS    29851000
*                        POINTER WILL EXIST FOR NON-AUTHORIZED CALLERS  29852000
*                        OF OPEN TYPE=J FOR A DIRECT ACCESS DATA SET    29852900
*                        WHERE THE DATA SET NAME BEING OPENED IS        29853800
*                        DIFFERENT FROM THE DATA SET DESCRIBED BY THE   29854700
*                        DDNAME IN DCB AND THE JFCNWRIT BIT IS ON IN    29855600
*                        JFCB.  THE POINTER WILL BE USED BY CLOSE TO    29856500
*                        DYNAMICALLY UNALLOCATE THE DATA SET.           29857400
*                        (MDC352)                              @ZA02193 29858300
DEBXSAMB DS    A         ADDRESS OF SAM BLOCK (SAMB)  (MDC351) @Z40FP9A 29859200
DEBXOPET DS    XL8       DATASET OPEN TIME SET BY OPEN INITIAL @ZA39299 29860100
*****************************************************************  @P3A 29861100
*  THE FOLLOWING MAPPING REPRESENTS THE FIRST 8 BYTES OF        *  @P3A 29861200
*  DEFINE EXTENT DATA WHICH IS PASSED, VIA THE DEFINE           *  @P3A 29861300
*  EXTENT CCW, TO A DASD STORAGE SUBSYSTEM WHICH SUPPORTS       *  @P3A 29861400
*  THE ECKD DEFINE EXTENT CCW.                                  *  @P3A 29861500
*                                                               *  @P3A 29861600
*  THIS INFORMATION WILL BE COPIED FROM THE DEB EXTENSION TO    *  @P3A 29861700
*  THE SYSTEM BUILT DEFINE EXTENT DATA AREA, AND WILL BE SENT   *  @P3A 29861800
*  TO THE STORAGE SUBSYSTEM WITH EACH I/O REQUEST RELATED TO    *  @P3A 29861900
*  THIS DEB.                                                    *  @P3A 29862000
*                                                               *  @P3A 29862100
*  REFER TO THE APPROPRIATE STORAGE CONTROL REFERENCE           *  @P3A 29862200
*  PUBLICATION FOR A DETAILED DESCRIPTION OF THESE FIELDS.      *  @P3A 29862300
*                                                               *  @P3A 29862400
*****************************************************************  @P3A 29862500
DEBXDEF  DS    0XL8      DEFINE EXTENT DATA AREA                   @H2A 29862636
DEBDEFG1 DS    X         FLAG BYTE                                 @H2A 29863236
DEBNSHED EQU   X'80'     NO SEEK HEAD PERMITTED                    @H2A 29864336
DEBXVDEF EQU   X'40'     DEB DEF EXT DATA PARMS VALID. MUST BE ON  @P3C 29865000
*                        FOR DX DATA TO BE USED                    @P3A 29865700
DEBGATTR DS    XL1       GLOBAL ATTRIBUTES                         @H2A 29866536
DEBECKD  EQU   X'C0'     EXTENT DEFINITION                         @H2A 29867636
*                        B'XX......' EXTENT DEFINITION             @H2A 29868736
DEBGAEX1 EQU   X'80'     EXTENT DEFINITION  1                      @H2A 29869836
DEBGAEX2 EQU   X'40'     EXTENT DEFINITION  2                      @H2A 29870936
*                        B'00......' DEFINE EXTENT OPERATES        @H2A 29872036
*                        AS DEFINED FOR FIXED BLOCK ARCH           @H2A 29873136
*                        B'11......' DEFINE EXTENT OPERATES        @H2A 29874236
*                        AS DEFINED FOR CKD EXT-CCHH EXTENTS       @H2A 29875336
DEBSTRTP EQU   X'20'     CKD CONVERSION MODE - FOR SYSTEM USE      @P3C 29876400
*                        B'..1.....' CKD CONVERSION MODE REQD      @P3C 29877500
*                        B'..0.....' CDK CONVERSION MODE NOT REQD  @P3C 29878600
DEBGA345 EQU   X'1C'     ATTRIBUTES BITS  3,4,5                    @H2A 29879736
*                        B'...XXX..' ATTRIBUTE BITS 3,4,5          @H2A 29880836
DEBGA1   EQU   X'10'     ATTRIBUTE  1                              @H2A 29881936
DEBGA2   EQU   X'08'     ATTRIBUTE  2                              @05C 29883000
DEBGA3   EQU   X'04'     ATTRIBUTE  3                              @05C 29884100
*                        B'...000..' NORMAL CACHE ACCESS           @L4C 29885200
*                        B'...001..' BYPASS CACHE LOAD             @L4C 29886300
*                        B'...010..' INHIBIT CACHE LOAD            @L4C 29887400
*                        B'...011..' SEQUENTIAL ACCESS             @L4C 29888500
*                        B'...100..' SEQUENTIAL STAGING MODE       @P3C 29889300
*                        B'...101..' RECORD ACCESS MODE            @P3C 29890100
*                        B'...110..' RESERVED                      @P3A 29890900
*                        B'...111..' RESERVED                      @H2A 29891836
DEBNCACH EQU   X'00'     NORMAL CACHE ACCESS                       @L4A 29893000
DEBBCACH EQU   X'04'     BYPASS CACHE LOAD                         @L7C 29893100
DEBICACH EQU   X'08'     INHIBIT CACHE LOAD                        @L7C 29893200
DEBSCACH EQU   X'0C'     SEQUENTIAL ACCESS                         @L7C 29893300
DEBXRFLG EQU   X'10'     SEQUENTIAL PRESTAGE MODE                  @P3A 29893400
DEBRLC   EQU   X'14'     RECORD ACCESS MODE                        @P3A 29893500
DEBNRD   EQU   X'02'     NON RETENTIVE DATA ACCESS                 @08A 29893600
DEBINHFW EQU   X'01'     INHIBIT FAST WRITE                        @08A 29893700
*                        B'......10' USE NON-RETENTIVE DATA        @P3C 29893800
*                        B'......11' INHIBIT DASD FAST WRITE       @P3A 29893900
DEBBLKSZ DS    XL2       BLOCKSIZE IN BYTES                        @H2A 29894036
DEBEXTOK DS    0CL4      ZERO,EXTENT LOCATOR OR TOKEN              @H2A 29897200
         SPACE 1                                                   @08A 29900500
DEBNRDID DS    CL2       SUBSYSTEM FUNCTION ID: NON-RETENTIVE DATA @P3C 29900700
*                        OR CONCURRENT COPY / XRC SESSION ID       @P3A 29900900
         DS    XL1       RESERVED FOR SYSTEM USE                   @P3C 29901100
DEBGATTX DS    XL1       GLOBAL ATTRIB EXTENDED 2                  @P3A 29901300
*                                   B'00......' NO SPECIAL MODE    @P3A 29901500
*                                   B'01......' REGULAR DATA FMT   @P3A 29901700
*                                   B'10......' SPECIAL KEY SEARCH @P3A 29901900
*                                   B'11......' RESERVED           @P3A 29902100
*                                   B'..111...' RESERVED FOR SYS   @P3A 29902300
*                                   B'.....1..' R0 DATA NOT REQD   @P3A 29902500
*                                   B'......11' RESERVED FOR SYS   @P3A 29902700
DEBRMODE EQU   X'00'    NO SPECIAL MODE                            @P3A 29902900
DEBRDATA EQU   X'40'    REGULAR DATA FORMAT                        @P3A 29903100
DEBSKEY  EQU   X'80'    SPECIAL KEY SEARCH MODE                    @P3A 29903300
DEBDFTR0 EQU   X'04'    R0 DATA NOT REQUIRED                       @P3A 29903500
*****************************************************************  @P3A 29903700
*        END OF DEFINE EXTENT DATA AREA MAPPING                 *  @P3A 29903900
*****************************************************************  @P3A 29904100
DEBIOPID DS    CL4       I/O PREVENTION IDENTIFIER                 @L5A 29905900
DEBBLKID DS    CL4      BLOCK ID VALUE USED TO CALCULATE NUMBER OF @L6A 29907700
*                       BLOCKS IN THIS VOLUME FOR EXTENDED         @L6A 29909500
*                       BLOCK COUNT CHECKING                       @L6A 29911300
DEBXCASF DS    CL4      CACHE ATTRIBUTE SELECTION TOKEN            @LAA 29913100
DEBXFLG3 DS    B        FLAG BYTE                                  @LDA 29914900
DEBXTRNC EQU   X'80'      QSAM TRUNC MACRO HAS BEEN ISSUED FOR A   @P3C 29916100
*                           PDSE - IT WAS IGNORED.                 @P3A 29917300
DEBXNSEG EQU   X'40'      NULL SEGMENT ENCOUNTERED IN PDSE         @P3C 29918500
DEBXSMSG EQU   X'20'      SMS GUARANTEED SPACE DISP NEW OR MOD     @11A 29919700
*        BIT 3            RESERVED                                 @LHC 29920900
DEBXCAP  EQU   X'08'      UCB ADDRESS IN DEB CAPTURED BY OCE       @LFA 29922100
*        BIT 5-7          RESERVED                                 @LHA 29923000
DEBXAMBF DS    XL1      DEFINES THE USE OF DEBXAMB                 @LEA 29923900
DEBXABSS EQU   X'80'      DEBXAMB DEFINES A SSCB PTR...DEBXSSCB IS @LEA 29925700
*                         VALID                                    @LEA 29927500
DEBXARBA EQU   X'40'      DEBXAMB DEFINES AN RBA VALUE..DEBXRBA IS @15A 29927900
*                         THE RBA OF THE CONTROL INTERVAL IN THE   @15A 29928300
*                         VVDS WHICH CONTAINS THE NVR FOR A        @15A 29928700
*                         COMPRESSED FORMAT DATA SET. ONLY VALID   @15A 29929100
*                         UNTIL OPEN EXECUTORS STORE SSCB PTR IN   @15A 29929500
*                         DEBXSSCB.                                @15A 29929900
DEBXAOEF EQU   X'20'      DEBXAMB DEFINES AN IGGSXCB PTR...        @P5C 29930100
*                                                                  @P5D 29930300
DEBXAIB  EQU   X'10'      DEBXAMB DEFINES AN INTERMEDIATE BUFFER   @LKA 29930500
*                         USED FOR READ PREVIOUS TAPE PROCESSING   @LKA 29930700
DEBXSCNT DS    XL2      NUMBER OF STRIPES FOR STRIPED DATA SET     @15C 29930900
DEBXSACB DS    A        POINTER TO SACB CONTROL BLOCK              @LDA 29931100
DEBXAFLG DS    B        "ATTRIBUTE EXTENSION" FLAGS                @P3C 29931400
DEBXADS  EQU   X'80'      ATTRIBUTE EXTENSION DATA SET             @12A 29931700
DEBXAINP EQU   X'40'      INPUT PROCESSING PERFORMED FOR           @12A 29932000
*                         "ATTRIBUTE EXTENSION" DATA SET           @12A 29932300
DEBXAOUT EQU   X'20'      OUTPUT PROCESSING PERFORMED FOR          @12A 29932600
*                         "ATTRIBUTE EXTENSION" DATA SET           @12A 29932900
DEBXAOFO EQU   X'10'      "ATTRIBUTE EXTENSION" D/S OPENED FOR     @12A 29933200
*                         OUTPUT PROCESSING                        @12A 29933500
*        BIT 4-7  - RESERVED                                       @LGC 29933800
DEBXRSV1 DS    B        RESERVED                                   @LGA 29934100
DEBXVLSQ DS    BL2      EXPECTED TAPE VOL SEQ                      @LGA 29934400
DEBXDSSB DS    A        POINTER TO DSSB                            @JBC 29934700
DEBXAMB  DS    0A       ACCESS METHOD BLOCK...THE USE OF THIS PTR  @LEA 29936500
*                        IS DEFINED BY THE FIELD DEBXAMBF          @LEA 29938300
DEBXSSCB DS    0A       ADDRESS OF STRIPED SAM CONTROL BLOCK (SSCB)@LEA 29941600
DEBXRDBK DS    0A       ADDRESS OF INTERMEDIATE BUFFER USED WITH   @LKA 29941900
*                        READ PREVIOUS PROCESSING                  @LKA 29942200
DEBXRBA  DS    A        RBA OF VVDS CI CONTAINING NVR              @P5C 29942500
*                                                                  @P5D 29943400
*                                                                  @P4A 29944300
DEBXDEBX DS    A        POINTER TO SECOND DEB EXTENSION            @13A 29945500
DEBXEND  EQU   *        END OF EXTENSION                           @H2A 29947300
DEBXLEN  EQU   DEBXEND-DEBXTN LENGTH OF DEB EXTENSION              @H2A 29949100
         SPACE 2                                                        29950900
*********************************************************************** 29952700
*                 SECOND DEB EXTENSION                                * 29954500
*                 POINTED TO BY DEBXDEBX IN THE 1ST DEB EXTENSION     * 29956300
*********************************************************************** 29958100
         SPACE 1                                                        29959900
DEB2XTN  DSECT                                                     @13A 29961700
DEB2XTNN DS    CL8       SECOND DEB EXTENSION EYE CATCHER          @13A 29963500
DEB2XLGH DS    H         LENGTH OF SECOND DEB EXTENSION            @13A 29965300
DEB2XRSG DS    0CL32                                               @13A 29967100
DEB2XSGL DS    XL2       STORAGE GROUP NAME LENGTH                 @13A 29968900
DEB2XSGN DS    CL30      STORAGE GROUP NAME                        @13A 29970700
DEB2XRMC DS    0CL32                                               @13A 29972500
DEB2XMCL DS    XL2       MANAGEMENT CLASS NAME LENGTH              @13A 29974300
DEB2XMCN DS    CL30      MANAGEMENT CLASS NAME                     @13A 29976100
DEB2XRSC DS    0CL32                                               @13A 29977900
DEB2XSCL DS    XL2       STORAGE CLASS LENGTH                      @13A 29979700
DEB2XSCN DS    CL30      STORAGE CLASS NAME                        @13A 29981500
DEB2XRDC DS    0CL32                                               @13A 29983300
DEB2XDCL DS    XL2       DATA CLASS LENGTH                         @13A 29985100
DEB2XDCN DS    CL30      DATA CLASS NAME                           @13A 29986900
DEB2XFG1 DS    B         FIRST FLAG BYTE                           @16A 29987300
DEB2XOSM EQU   X'80'     JFCMEDIA TYPE SET BY OPEN                 @16A 29987700
DEB2XNLM EQU   X'40'     NL TAPE DATASET OPENED FOR MOD            @LLA 29987800
DEB2XTCO EQU   X'20'     TCLOSE TAPE OUTPUT                        @LLA 29987900
DEB2XIBC EQU   X'10'     INACCURATE BLOCK COUNT                    @LLA 29988000
DEB2XNL1 EQU   X'08'     NL TAPE FILE SEQ 1                        @LLA 29988100
DEB2XUOF DS    XL1       TIOT DD OFFSET OF UNIT SELECTED BY OCE    @LFA 29988200
DEB2XLSQ DS    BL2       TAPE VOL SEQ FROM LABEL                   @LGA 29988300
DEB2XALV DS    CL1       ANSI VERSION DURING OUTPUT                @LJA 29988600
         DS    CL1       RESERVED                                  @LJC 29988900
DEB2XTIM DS    A         PTR TO TIME STAMP                         @18A 29989200
         DS    BL3       RESERVED                                  @LJA 29989300
DEB2XCFG DS    B         ANSI V4 CCSID FLAGS(NOTE THAT ANY         @LJA 29989400
*                         TO THIS FLAG BYTE REQUIRES THE SAME      @LJA 29989500
*                         CHANGE BE DONE IN MACRO IFGSMF14 FIELD   @LJA 29989600
*                         SMF14CFG                                 @LJA 29989700
DEB2XIBM EQU   X'80'     IBM VERSION 4 CREATED TAPE                @LJA 29989800
DEB2XOUT EQU   X'40'     VERSION 4 TAPE OPENED FOR OUTPUT DISP NOT @LJA 29989900
*                        MOD                                       @LJA 29990000
DEB2XMOD EQU   X'20'     VERSION 4 TAPE OPENED FOR OUTPUT DISP MOD @LJA 29990100
DEB2XUDF EQU   X'10'     USER APPLICATION CCSID WAS DEFAULTED      @LJA 29990200
DEB2XTDF EQU   X'08'     TAPE CCSID WAS DEFAULTED                  @LJA 29990300
DEB2XIGN EQU   X'04'     TAPE CCSID SPECIFIED BUT NO CONVERSION    @LJA 29990500
*                        DONE - CCSID WAS IGNORED                  @LJA 29990700
DEB2XUSR DS    FL4       CCSID OF USER APPLICATION                 @LJA 29990900
DEB2XTPE DS    FL4       CCSID OF TAPE                             @LJA 29991100
DEB2XLBL DS    FL4       CCSID IN EXISTING TAPE LABEL              @LJA 29991300
DEB2XSDC DS    A         PTR TO SAM DATA CONVERSION BLOCK          @LJA 29991500
DEB2XTBL DS    F         ACCUMULATIVE BLOCKCNT ACROSS VOLUMES      @LLA 29991600
DEB2XTCB DS    F         DCB BLKCOUNT AT TCLOSE OUTPUT             @LLA 29991700
DEB2XSGT DS    B         STORAGE GROUP TYPE (GENERAL OR SPECIFIC)  @LMA 29991810
         DS    BL3       RESERVED                                  @LMC 29991820
         DS    1A        RESERVED                                  @LMC 29991830
DEB2XEND EQU   *        END OF EXTENSION                           @13A 29991900
DEB2XLEN EQU   DEB2XEND-DEB2XTN LENGTH OF 2ND DEB EXTENSION        @13A 29992100
         POP   PRINT                                                    29992300
         MEND  , */                                                     29994100
*%DEBL2 : ;                                                             30000000
*%IF IKEPLS=''  %THEN                                                   30050000
*    %GOTO DEBL3;                                                       30060000
*%IHALPUSH='@LISTPUSH';                                                 30070000
*%IHALPOP='@LISTPOP';                                                   30080000
*%IHALOFF='@LISTOFF';                                                   30090000
*IHALPUSH;                                                              30092000
*%IF IHALIST='YES'  %THEN                                               30094000
*    %GOTO DEBL3;                                                       30096000
*IHALOFF;                                                               30098000
*%DEBL3 : ;                                                             30098400
* /* *************************************************************** */ 30100000
* /*                  DEB BASIC SECTION                              */ 30200000
* /* *************************************************************** */ 30300000
*                                                                       30400000
* DECLARE                                                               30500000
* 1 DEBBASIC BASED(DEBPTR) BDY(WORD),                                   30600000
*     3 DEBTCBAD PTR(31),            /* ADDRESS OF TCB FOR THIS DEB  */ 30700000
*      4 DEBNMSUB CHAR(1),           /* NUMBER OF SUBROUTINES LOADED    30900000
*                                       BY OPEN EXECUTOR ROUTINES    */ 31000000
*      4 DEBTCBB  PTR(24),           /* ADDRESS OF TCB FOR THIS DEB  */ 31100000
*     3 DEBDEBAD PTR(31),            /* ADDRESS OF THE NEXT DEB IN      31400000
*                                       THE SAME TASK                */ 31450000
*      4 DEBAMLNG CHAR(1),           /* NUMBER OF BYTES IN THE ACCESS   31500000
*                                       METHOD DEPENDENT SECTION.       31600000
*                                       FOR BDAM THIS FIELD CONTAINS    31650000
*                                       THE LENGTH EXPRESSED IN         31700000
*                                       NUMBER OF WORDS              */ 31800000
*      4 DEBDEBB  PTR(24),           /* *** SAME AS DEBDEBAD ABOVE   */ 31900000
*     3 DEBIRBAD PTR(31),            /* IRB STORAGE ADDRESS USED FOR    32200000
*                                       APPENDAGE ASYNCHRONOUS EXITS */ 32300000
*      4 DEBOFLGS CHAR(1),           /* DATA SET STATUS FLAGS        */ 32400000
*       5 DEBDISP  BIT(2),           /* DATA SET DISPOSITION FLAGS   */ 32500000
* %DCL DEBDSOLD CHAR;                                                   32700000
* %DEBDSOLD='''01''B';               /* OLD                          */ 32800000
* %DCL DEBDSMOD CHAR;                                                   32900000
* %DEBDSMOD='''10''B';               /* MOD                          */ 33000000
* %DCL DEBDSNEW CHAR;                                                   33100000
* %DEBDSNEW='''11''B';               /* NEW                          */ 33200000
*       5 DEBEOF   BIT(1),           /* END-OF-FILE (EOF) ENCOUNTERED   33300000
*                                       (TAPE INPUT)                    33350000
*                                       FORMAT 1 DSCB BIT 93.0          33360000
*                                       INDICATES THAT THE CURRENT      33370000
*                                       VOLUME IS THE LAST VOLUME OF    33380000
*                                       THE DATA SET (DASD INPUT)    */ 33390000
*       5 DEBRLSE  BIT(1),           /* RELEASE UNUSED EXTERNAL         33400000
*                                       STORAGE (DASD)                  33450000
*                                       EMULATOR TAPE WITH SECOND       33460000
*                                       GENERATION FORMAT.  TAPE MAY    33470000
*                                       CONTAIN BLOCKS SHORTER THAN     33480000
*                                       12 CHARACTERS (TAPE)         */ 33490000
*       5 DEBDCB   BIT(1),           /* DCB MODIFICATION             */ 33500000
*       5 DEBSPLIT BIT(1),           /* SPLIT CYLINDER (DASD)           33600000
*                                       7-TRACK EMULATOR TAPE WITH      33650000
*                                       POSSIBLE MIXED PARITY RECORDS   33660000
*                                       (TAPE)                       */ 33670000
*       5 DEBLABEL BIT(1),           /* NONSTANDARD LABELS           */ 33700000
*       5 DEBRERR  BIT(1),           /* USE REDUCED ERROR RECOVERY      33800000
*                                       PROCEDURE (TAPE)                33900000
*                                       CONCATENATED PARTITIONED        33950000
*                                       ORGANIZATION DATA SETS          34000000
*                                       PROCESSED USING BPAM (DASD)  */ 34050000
*      4 DEBIRBB  PTR(24),           /* *** SAME AS DEBIRBAD ABOVE   */ 34100000
*     3 DEBOPATB CHAR(1),            /* FLAGS INDICATING BOTH THE       34400000
*                                       METHOD OF I/O PROCESSING AND    34500000
*                                       THE DISPOSITION THAT IS TO BE   34600000
*                                       PERFORMED WHEN AN END-OF-VOLUME 34700000
*                                       (EOV) CONDITION OCCURS       */ 34800000
*      4 DEBABEND BIT(1),            /* SET BY ABEND INDICATING A       34900000
*                                       SYSABEND OR SYSUDUMP DATA       35000000
*                                       SET (OS/VS2)                 */ 35100000
*      4 DEBZERO  BIT(1),            /* ALWAYS ZERO                  */ 35200000
*      4 DEBPOSIT BIT(2),            /* DATA SET POSITIONING FLAGS   */ 35300000
* %DCL DEBRERED CHAR;                                                   35500000
* %DEBRERED='''01''B';               /* REREAD                       */ 35600000
* %DCL DEBLEAVE CHAR;                                                   35700000
* %DEBLEAVE='''11''B';               /* LEAVE                        */ 35800000
*      4 DEBACCS  BIT(4),            /* TYPE OF I/O ACCESSING BEING     35900000
*                                       DONE                         */ 36000000
* %DCL DEBINPUT CHAR;                                                   36100000
* %DEBINPUT='''0000''B';             /* INPUT                        */ 36200000
* %DCL DEBOUTPT CHAR;                                                   36300000
* %DEBOUTPT='''1111''B';             /* OUTPUT                       */ 36400000
* %DCL DEBINOUT CHAR;                                                   36500000
* %DEBINOUT='''0011''B';             /* INOUT                        */ 36600000
* %DCL DEBOUTIN CHAR;                                                   36700000
* %DEBOUTIN='''0111''B';             /* OUTIN                        */ 36800000
* %DCL DEBRDBCK CHAR;                                                   36900000
* %DEBRDBCK='''0001''B';             /* RDBACK                       */ 37000000
* %DCL DEBUPDAT CHAR;                                                   37100000
* %DEBUPDAT='''0100''B';             /* UPDAT                        */ 37200000
*     3 DEBQSCNT CHAR(1),            /* PURGE (SVC 16) - QUIESCE        37300000
*                                       COUNT.  NUMBER OF DEVICES       37400000
*                                       EXECUTING USER'S CHANNEL        37500000
*                                       PROGRAMS, AS SHOWN BY BITS 5    37600000
*                                       AND 6 OF UCBFL1 FIELDS       */ 37700000
*     3 DEBFLGS1 CHAR(1),            /* FLAG FIELD                   */ 37750000
*      4 DEBPWCKD BIT(1),            /* PASSWORD WAS SUPPLIED DURING    37762000
*                                       OPEN.  EOV WILL NOT REQUEST A   37764000
*                                       PASSWORD FOR EACH ADDITIONAL    37766000
*                                       VOLUME OF A MULTIVOLUME DATA    37768000
*                                       SET                          */ 37768400
*      4 DEBEOFDF BIT(1),            /* SET BY EOV TO INFORM CLOSE      37770000
*                                       THAT AN END-OF-FILE HAS BEEN    37780000
*                                       ENCOUNTERED AND, THEREFORE,     37790000
*                                       DEFERRED LABEL PROCESSING IS    37790400
*                                       ALLOWED                      */ 37790800
*      4 DEBRSIOA BIT(1),            /* SIO APPENDAGE RE-ENTRY          37791200
*                                       AUTHORIZATION BIT (OS/VS1)      37791600
*                                       (MDC331)             @XM06077*/ 37792000
*      4 DEBEXCPA BIT(1),            /* EXCP IS AUTHORIZED   @ZA40332   37792400
*                                       FOR THIS DEB         @ZA40332*/ 37792600
*      4 DEBCINDI BIT(1),            /* DCB ASSOCIATED WITH THIS DEB    37793000
*                                       IS BEING PROCESSED BY THE       37794000
*                                       COMPATIBILITY INTERFACE         37795000
*                                       ROUTINES (VSAM, SAM)   ICB462*/ 37795600
*      4 DEBF1CEV BIT(1),            /* EOV PROCESSING OCCURRED         37796300
*                                       DURING CLOSE PROCESSING.        37798300
*                                       TESTED AND SET TO ZERO BY       37798400
*                                       CLOSE, SET TO ONE BY EOV.       37812900
*                                       (ICB353)               A42228*/ 37822900
*      4 DEBAPFIN BIT(1),            /* IF ON, AUTHORIZED PROGRAMS      37827500
*                                       CAN BE LOADED          MDC001*/ 37842000
*      4 DEBXTNIN BIT(1),            /* IF ONE, DEB EXTENSION EXISTS    37856500
*                                       (OS/VS2)               MDC007*/ 37871000
*     3 DEBFLGS2 CHAR(1),            /* FLAGE FIELD TWO         @L5C */ 37872500
*      4 DEBIOPAV BIT (1),          /* IF ONE THE PREVENTION      @L5A  37874000
*                                      IDENTIFIER IN THE DEB      @L5A  37875500
*                                      EXTENSION IS VALID        @L5A*/ 37877000
*      4 DEBVCR   BIT (1),          /* RLS=CR JCL OPTION         @19C*/ 37878500
*      4 DEBVNRI  BIT (1),          /* RLS=NRI JCL OPTION        @19C*/ 37880000
*      4 DEBVCRE  BIT (1),          /* RLS=CRE JCL OPTION        @19C*/ 37881500
*                                                              /*@H3A*/ 37883000
*      4 DEBVRLS  BIT (1),          /* VSAM RLS ACCESS (VSAM ONLY)      37883500
*                                                                @P5M*/ 37884000
*                                   /* USED BY O/C/EOV TO MAINTAIN      37884500
*                                      AN UNIFORM RECORDING MODE IN     37886000
*                                      TAPE DATA SETS THAT SPAN OVER    37887500
*                                      MORE THAN ONE VOLUME      @H3A*/ 37889000
*        5 DEBDSRM0 BIT (1),        /* TAPE DATA SET RECORDING          37890500
*                                                    MODE FLAG 0 @P5C*/ 37892000
*      4 DEBDSRM1 BIT (1),          /* TAPE DATA SET RECORDING          37893500
*                                                    MODE FLAG 1 @H3C*/ 37895000
*      4 DEBFGRV6 BIT (1),          /* RESERVED                  @L5A*/ 37896500
*      4 DEBTVS   BIT (1),          /* TRANSACTIONAL VSAM        @P6C*/ 37898200
*     3 DEBUSRPG PTR(31),            /* ADDRESS OF FIRST IOB IN THE     37900000
*                                       USER PURGE CHAIN  (OS/VS1)      38000000
*                                       ADDRESS OF PURGED I/O RESTORE   38020000
*                                       LIST (PIRL)  (OS/VS2)           38040000
*                                       (MDC029)               YM3158*/ 38060000
*      4 DEBNMEXT CHAR(1),           /* NUMBER OF EXTENT DESCRIPTIONS   38108000
*                                       STARTING AT DEBBASND. ONE       38156000
*                                       EXTENT PER UNIT FOR EXTENDED    38204000
*                                       FORMAT OR PDSE DATA SETS     */ 38252000
*      4 DEBUSRPB PTR(24),           /* *** SAME AS DEBUSRPG ABOVE   */ 38300000
*     3 DEBRRQ   PTR(31),            /* POINTER TO RELATED REQUEST      38350000
*                                       QUEUE (OS/VS2)         MDC026*/ 38400000
*      4 DEBECBAD PTR(31),           /* ADDRESS OF A PARAMETER LIST     38500000
*                                       USED TO LOCATE THE PURGE ECB    38600000
*                                       FOR AN SVC PURGE REQUEST        38700000
*                                       (OS/VS1)               MDC025*/ 38750000
*       5 DEBPRIOR CHAR(1),          /* PRIORITY OF THE TASK OWNING     38800000
*                                       DEB                          */ 38900000
*       5 DEBECBB  PTR(24),          /* *** SAME AS DEBECBAD ABOVE   */ 39000000
*     3 DEBDCBAD PTR(31),            /* ADDRESS OF DCB OR ACB           39050000
*                                       ASSOCIATED WITH THIS DEB     */ 39100000
*      4 DEBPROTG CHAR(1),           /* TASK PROTECTION KEY IN HIGH-    39500000
*                                       ORDER 4 BITS                 */ 39600000
*       5 DEBDEBID CHAR(1),          /* A HEX F IN LOW-ORDER 4 BITS     39700000
*                                       TO IDENTIFY THIS BLOCK AS A     39800000
*                                       DEB                          */ 39900000
*      4 DEBDCBB PTR(24),            /* *** SAME AS DEBDCBAD ABOVE   */ 40000000
*     3 DEBAPPAD PTR(31),            /* ADDRESS OF THE I/O APPENDAGE    40300000
*                                       VECTOR TABLE                 */ 40400000
*      4 DEBEXSCL CHAR(1),  /*  THIS FIELD DETERMINES THE SIZE OF       40450000
*                        THE DEVICE DEPENDENT SECTION. TWO TO THIS      40500000
*                        POWER GIVES THE LENGTH OF THE DEVICE-          40550000
*                        DEPENDENT SECTION AT DEBBASND. EXTENT SCALE -  40600000
*                        4 (16 BYTES) FOR DIRECT ACCESS DEVICE AND      40650000
*                        3525 CARD PUNCH WITH DEVICE-ASSOCIATED DATA    40700000
*                        SET SUPPORT AND 2 (4 BYTES) FOR NONDIRECT      40750000
*                        ACCESS DEVICE  AND COMMUNICATION DEVICE.*/     40800000
*      4 DEBAPPB  PTR(24),           /* *** SAME AS DEBAPPAD ABOVE   */ 41100000
*     3 DEBBASND CHAR(0) BDY(WORD);                                     41400000
*                                                                       41500000
*                                                             /* @H3A*/ 41516600
*  DECLARE                 /* 3480 TAPE DATA SET RECORDING MODES @H3A*/ 41533200
*    DEBDSCMP BIT(8) CONSTANT('00001000'B), /* COMPACTION MODE   @H3A*/ 41549800
*    DEBDSNCP BIT(8) CONSTANT('00000100'B); /* NON-COMPACTION MODE      41566400
*                                                                @H3A*/ 41583000
* /* *************************************************************** */ 41600000
* /*   UNIT RECORD, MAGNETIC TAPE, TELECOMMUNICATIONS DEVICES SECTION*/ 41700000
* /*                                                                 */ 41800000
* /*     NOTE  FOR TELECOMMUNICATIONS DEVICES, THE UCB ADDRESS       */ 41900000
* /*           IS REPEATED FOR EACH LINE ASSIGNED                    */ 42000000
* /* *************************************************************** */ 42100000
*                                                                       42200000
*  DECLARE 1 DEBBAS02                                                   42250000
*%IF IKEPLS='2'  %THEN                                                  42260000
*    %GOTO DEBA3;                                                       42270000
*       BASED(ADDR(DEBBASND)) BDY(WORD),                                42280000
*%GOTO DEBA4;                                                           42290000
*%DEBA3 : ;                                                             42292000
*       DEF(DEBBASND) BDY(WORD),                                        42294000
*%DEBA4 : ;                                                             42296000
*     3 DEBDDS1 BDY(WORD),                                              42300000
*      4 DEBSUCBA PTR(31),           /* ADDRESS OF UCB ASSOCIATED       42400000
*                                       WITH A GIVEN DATA SET        */ 42500000
*       5 DEBSDVM CHAR(1),        /* DEVICE MODIFIER.  FOR MAGNETIC     42523500
*                                    TAPE, MODE SET OPERATION CODE      42547000
*                                    OR MODE SET FUNCTION BYTE.  @H3C*/ 42570500
*                                 /* FOR UNIT RECORD, NOT USED.      */ 42594000
*                                 /* TAPE MODE SET FUNCTION BYTE @H3A*/ 42617500
*        6 DEBMTRF0 BIT(1),       /* TAPE RECORDING FORMAT BIT 0 @H3A*/ 42641000
*        6 DEBMTRF1 BIT(1),       /* TAPE RECORDING FORMAT BIT 1 @H3A*/ 42664500
*        6 DEBMTWI  BIT(1),       /* TAPE WRITE IMMEDIATE               42688000
*                                           (NON-BUFFERED WRITE) @H3A*/ 42711500
*        6 DEBMINHS BIT(1),       /* INHIBIT SUPERVISOR COMMANDS @H3A*/ 42735000
*        6 DEBMCOMP BIT(1),       /* COMPACTED RECORDING MODE    @H3A*/ 42758500
*         7 DEBCMPAC BIT(1),      /* COMPACTED RECORDING MODE    @H3A*/ 42782000
*        6    *     BIT(1),       /* RESERVED                    @H3A*/ 42805500
*        6 DEBM3424 BIT(1),       /* 3424 MODE SET FLAG          @H3A*/ 42829000
*         7 DEBM9348 BIT(1),      /* RESERVED(WILL BE DELETED)   @H3A*/ 42852500
*        6 DEBMINHE BIT(1),       /* INHIBIT CONTROL UNIT ERP    @H3A*/ 42876000
*       5 DEBSUCBB PTR(24),          /* *** SAME AS DEBSUCBA ABOVE   */ 42900000
*      4 DEBDEVED CHAR(0) BDY(WORD), /* END OF COMMON UNIT RECORD       42901000
*                                       FIELDS  (MDC330)     @X04AA9A*/ 42902000
*                                                                       42905000
* /*     THE FOLLOWING FIELDS ARE PRESENT ONLY FOR THE 3525 WITH     */ 42910000
* /*     DEVICE-ASSOCIATED DATA SET SUPPORT                          */ 42915000
*                                                                       42920000
*      4 DEBRDCB    PTR(31),         /* ADDRESS OF DCB FOR THE READ     42925000
*                                       ASSOCIATED DATA SET    ICB394*/ 42930000
*       5 DEBRSV06   CHAR(1),        /* RESERVED               ICB394*/ 42935000
*       5 DEBRDCBA   PTR(24),        /* SAME AS DEBRDCB ABOVE  ICB394*/ 42940000
*      4 DEBPDCB    PTR(31),         /* ADDRESS OF DCB FOR THE PUNCH    42945000
*                                       ASSOCIATED DATA SET    ICB394*/ 42950000
*       5 DEBRSV07   CHAR(1),        /* RESERVED               ICB394*/ 42955000
*       5 DEBPDCBA   PTR(24),        /* SAME AS DEBPDCB ABOVE  ICB394*/ 42960000
*      4 DEBWDCB    PTR(31),         /* ADDRESS OF DCB FOR THE PRINT    42965000
*                                       ASSOCIATED DATA SET    ICB394*/ 42970000
*       5 DEBRSV08   CHAR(1),        /* RESERVED               ICB394*/ 42975000
*       5 DEBWDCBA   PTR(24);        /* SAME AS DEBWDCB ABOVE  ICB394*/ 42980000
*                                                                       42984000
*                                                             /* @H3A*/ 42984100
*  DECLARE               /* 9-TRACK TAPE MODESET OPERATION CODES @H3A*/ 42984200
*    DEBMTDN4 BIT(8) CONSTANT('11010011'B),    /* 6250 BPI       @H3A*/ 42984300
*    DEBMTDN3 BIT(8) CONSTANT('11000011'B),    /* 1600 BPI       @H3A*/ 42984400
*    DEBMTDN2 BIT(8) CONSTANT('11001011'B);    /*  800 BPI       @H3A*/ 42984500
*  DECLARE                /* 7-TRACK TAPE MODESET SKELETON CODES        42984600
*                            (MUST BE COMPLETED WITH PARITY,            42984700
*                                 TRANSLATION AND/OR CONVERSION) @H3A*/ 42984800
*    DEBM7DN0 BIT(8) CONSTANT('00000011'B),    /*  200 BPI       @H3A*/ 42984900
*    DEBM7DN1 BIT(8) CONSTANT('01000011'B),    /*  556 BPI       @H3A*/ 42985000
*    DEBM7DN2 BIT(8) CONSTANT('10000011'B);    /*  800 BPI       @H3A*/ 42985100
*  DECLARE                        /* 3480 TAPE OPERATION CODE    @H3A*/ 42985200
*    DEBMSTWI BIT(8) CONSTANT('11000011'B);    /* SET TAPE WRITE @H3A*/ 42985300
*                                              /* IMMEDIATE CODE @H3A*/ 42985400
*  DECLARE                        /* 3424 MODE SET DENSITY CODES @H3A*/ 42985500
*    DEBM6250 BIT(8) CONSTANT('11000010'B),    /* 6250 BPI       @H3A*/ 42985600
*    DEBM1600 BIT(8) CONSTANT('01000010'B);    /* 1600 BPI       @H3A*/ 42985700
*  DECLARE                        /* RESERVED(WILL BE DELETED)   @H3A*/ 42985800
*    DEBM4TRK BIT(8) CONSTANT('11000010'B),    /* 4-TRACK        @H3A*/ 42985900
*    DEBM2TRK BIT(8) CONSTANT('10000010'B),    /* 2-TRACK        @H3A*/ 42986000
*    DEBM1TRK BIT(8) CONSTANT('01000010'B);    /* 1-TRACK        @H3A*/ 42986100
*                                                             /* @H3A*/ 42986200
*                                                                       42988000
* /* *************************************************************** */ 42992000
* /*                3540 ACCESS METHOD DEPENDENT SECTION     @X04AA9A*/ 42996000
* /*                (OS/VS1 ONLY)                            @X04AA9A*/ 43000000
* /*                                                                 */ 43004000
* /*     NOTE  THIS SECTION FOLLOWS DEBSUCBA IN UNIT RECORD,         */ 43008000
* /*           MAGNETIC TAPE, TELECOMMUNICATIONS DEVICES SECTION     */ 43012000
* /*           IF DEB IS FOR 3540 DEVICE.                    @X04AA9A*/ 43016000
* /* *************************************************************** */ 43020000
*                                                                       43024000
* DECLARE 1 DEBACS09                                                    43028000
*%IF IKEPLS='2'  %THEN                                                  43032000
*    %GOTO DEBA5;                                                       43036000
*       BASED(ADDR(DEBDEVED)) BDY(WORD),   /*                @X04AA9A*/ 43040000
*%GOTO DEBA6;                                                           43044000
*%DEBA5 : ;                                                             43050000
*       DEF(DEBDEVED) BDY(WORD),     /*                      @X04AA9A*/ 43053000
*%DEBA6 : ;                                                             43056000
*    2 DEBASC09 CHAR(16) BDY(WORD),  /* 3540 ACCESS METHOD DEPENDENT    43059000
*                                       SECTION  (MDC317)    @X04AA9A*/ 43062000
*     3 DEBVOLAC CHAR(1),            /* VOLUME ACCESSABILITY            43065000
*                                       INDICATOR  (MDC327)  @X04AA9A*/ 43068000
*     3 DEBDSSQL CHAR(1),            /* DATA SET SECURITY QUALIFIER     43071000
*                                       (MDC328)             @X04AA9A*/ 43074000
*     3 DEBVSEQU PTR(8),             /* VOLUME SEQUENCE NUMBER          43077000
*                                       (MDC318)             @X04AA9A*/ 43080000
*     3 DEBEAMFG BIT(8),             /* FLAG BYTE  (MDC319)  @X04AA9A*/ 43083000
*      4 DEBMULTI BIT(1),            /* MULTI-VOLUME INDICATOR          43086000
*                                       (MDC320)             @X04AA9A*/ 43089000
*      4 DEBDSOPN BIT(1),            /* DATA SET IS OPEN                43092000
*                                       (MDC321)             @X04AA9A*/ 43095000
*      4 DEBVAMSG BIT(1),            /* VOLUME ACCESSABILITY MESSAGE    43098000
*                                       HAS BEEN ISSUED  (MDC329)       43101000
*                                                            @X04AA9A*/ 43104000
*      4 DEBSECVL BIT(1),            /* SECURE VOLUME  (MDC332)         43107000
*                                                            @X04AA9A*/ 43108000
*      4 DEBRV004 BIT(1),            /* RESERVED             @X04AA9A*/ 43110000
*      4 DEBRV005 BIT(1),            /* RESERVED             @X04AA9A*/ 43113000
*      4 DEBRV006 BIT(1),            /* RESERVED             @X04AA9A*/ 43116000
*      4 DEBRV007 BIT(1),            /* RESERVED             @X04AA9A*/ 43119000
*     3 DEBDSID  CHAR(8),            /* DATA SET IDENTIFIER (DSID)      43122000
*                                       (INPUT)  (MDC305)    @X04AA9A*/ 43125000
*      4 DEBEXDTE CHAR(6),           /* EXPIRATION DATE (OUTPUT)        43125600
*                                       (MDC333)             @X04AA9A*/ 43126200
*      4 DEBWTPTI CHAR(1),           /* WRITE PROTECT INDICATOR         43126800
*                                       (OUTPUT)  (MDC334)   @X04AA9A*/ 43127400
*      4 DEBRV008 CHAR(1),           /* RESERVED (OUTPUT)  (MDC335)     43131000
*                                                            @X04AA9A*/ 43132000
*     3 DEBEOD   CHAR(4) BDY(WORD),  /* END OF DATA (EOD) ADDRESS       43134000
*                                       (INPUT)  (MDC306)    @X04AA9A*/ 43137000
*      4 DEBBOE   CHAR(4) BDY(WORD), /* BEGINNING OF EXTENT (BOE)       43140000
*                                       ADDRESS (OUTPUT)  (MDC322)      43143000
*                                                            @X04AA9A*/ 43146000
*       5 DEBEODRV PTR(8),           /* RESERVED (MDC307)    @X04AA9A*/ 43149000
*        6 DEBBOERV PTR(8),          /* RESERVED  (MDC323)   @X04AA9A*/ 43152000
*       5 DEBEODTT PTR(8),           /* EOD TRACK NUMBER                43155000
*                                       (MDC308)             @X04AA9A*/ 43158000
*        6 DEBBOETT PTR(8),          /* BOE TRACK NUMBER                43161000
*                                       (MDC324)             @X04AA9A*/ 43164000
*       5 DEBEOD0  PTR(8),           /* MUST BE ZERO                    43167000
*                                       (MDC309)             @X04AA9A*/ 43170000
*        6 DEBBOE0  PTR(8),          /* MUST BE ZERO                    43173000
*                                       (MDC325)             @X04AA9A*/ 43176000
*       5 DEBEODSS PTR(8),           /* EOD SECTOR NUMBER               43179000
*                                       (MDC310)             @X04AA9A*/ 43182000
*        6 DEBBOESS PTR(8);          /* BOE SECTOR NUMBER               43185000
*                                       (MDC326)             @X04AA9A*/ 43188000
*                                                                       43192000
*                                                                       43196000
* /* *************************************************************** */ 43200000
* /*             DEB ISAM DEPENDENT SECTION                          */ 43300000
* /*                                                                 */ 43350000
* /*     NOTE  PRESENT ONLY IF ISAM IS USED.  FOLLOWS THE BASIC      */ 43360000
* /*           SECTION AND PRECEDES THE DIRECT ACCESS STORAGE        */ 43370000
* /*           DEVICE SECTION.  COUNTED AS ONE EXTENT IN DEBNMEXT.   */ 43380000
* /* *************************************************************** */ 43400000
*                                                                       43500000
*  DECLARE 1 DEBBAS01                                                   43600000
*%IF IKEPLS='2'  %THEN                                                  43650000
*    %GOTO DEBA1;                                                       43660000
*       BASED(ADDR(DEBBASND)) BDY(WORD),                                43700000
*%GOTO DEBA2;                                                           43750000
*%DEBA1 : ;                                                             43760000
*       DEF(DEBBASND) BDY(WORD),                                        43770000
*%DEBA2 : ;                                                             43780000
*    2 DEBISAM BDY(WORD),                                               43900000
*     3 DEBFIEAD PTR(31),            /* ADDRESS OF FIRST INDEX          44000000
*                                       EXTENT                       */ 44100000
*       4 DEBNIEE  CHAR(1),          /* NUMBER OF EXTENTS OF            44200000
*                                       INDEPENDENT INDEX AREA       */ 44300000
*       4 DEBFIEB  PTR(24),          /* *** SAME AS DEBFIEAD ABOVE   */ 44400000
*     3 DEBFPEAD PTR(31),            /* ADDRESS OF THE FIRST PRIME      44700000
*                                       DATA EXTENT                  */ 44800000
*      4 DEBNPEE  CHAR(1),           /* NUMBER OF EXTENTS OF PRIME      44900000
*                                       DATA AREA (M=0 EXTENT)       */ 45000000
*      4 DEBFPEB  PTR(24),           /* *** SAME AS DEBFPEAD ABOVE   */ 45100000
*     3 DEBFOEAD PTR(31),            /* ADDRESS OF THE FIRST            45400000
*                                       OVERFLOW EXTENT              */ 45500000
*      4 DEBNOEE  CHAR(1),           /* NUMBER OF EXTENTS OF            45600000
*                                       INDEPENDENT OVERFLOW AREA    */ 45700000
*      4 DEBFOEB  PTR(24),           /* *** SAME AS DEBFOEAD ABOVE   */ 45800000
*     3 DEBEXPT  PTR(31),            /* ADDRESS OF ISAM DEB             45900000
*                                       EXTENSION              ICB379*/ 46000000
*      4 DEBRPSID BIT(8),            /* ROTATIONAL POSITION SENSING     46350000
*                                       (RPS) DEVICE INDICATORS      */ 46352000
*       5 DEBRPSP  BIT(1),           /* PRIME DATA AREA IS ON RPS       46360000
*                                       DEVICE                       */ 46370000
*       5 DEBRPSI  BIT(1),           /* INDEPENDENT INDEX AREA IS ON    46380000
*                                       RPS DEVICE                   */ 46390000
*       5 DEBRPSO  BIT(1),           /* INDEPENDENT OVERFLOW AREA IS    46392000
*                                       ON RPS DEVICE                */ 46394000
*       5 DEBRPSAP BIT(1),           /* RPS SIO APPENDAGE HAS BEEN      46396000
*                                       LOADED                       */ 46398000
*       5 DEBRSV09 BIT(1),           /* RESERVED                     */ 46398400
*       5 DEBRSV10 BIT(1),           /* RESERVED                     */ 46398500
*       5 DEBRSV11 BIT(1),           /* RESERVED                     */ 46398600
*       5 DEBRSV12 BIT(1),           /* RESERVED                     */ 46398700
*      4 DEBEXPTA PTR(24);           /* SAME AS DEBEXPT ABOVE  ICB379*/ 46398800
*                                                                       46399200
* /* *************************************************************** */ 46399600
* /*          DIRECT ACCESS STORAGE DEVICE SECTION                   */ 46400000
* /*                                                                 */ 46450000
* /*     NOTE  IF ISAM IS BEING USED, THIS SECTION FOLLOWS THE       */ 46500000
* /*           ISAM DEVICE DEPENDENT SECTION.  OTHERWISE, IT         */ 46550000
* /*           FOLLOWS THE BASIC SECTION.                            */ 46600000
* /*                                                                 */ 46610000
* /*           THERE IS ONE OF THESE SECTIONS FOR EACH EXTENT.       */ 46620000
* /* *************************************************************** */ 46650000
*                                                                       46700000
* DECLARE                                                               46750000
*   1 DEBDASD BASED(DEBDAPTR) BDY(WORD),                                46800000
*     3 DEBUCBAD PTR(31),            /* ADDRESS OF UCB ASSOCIATED       47600000
*                                       WITH THIS DATA EXTENT        */ 47700000
*      4 DEBDVMOD CHAR(1),           /* DEVICE MODIFIER - FILE MASK  */ 47800000
*      4 DEBUCBA  PTR(24),           /* *** SAME AS DEBUCBAD ABOVE   */ 47900000
*     3 DEBBINUM CHAR(2),            /* BIN NUMBER                   */ 48000000
*     3 DEBSTRCC CHAR(2),            /* CYLINDER ADDRESS FOR THE START  48050000
*                                       OF AN EXTENT. FOR A PDSE OR     48100000
*                                       EXTENDED FORMAT DATA SET, BIT   48150000
*                                       ZERO OF THE FIRST BYTE IS ON.*/ 48200000
*     3 DEBSTRHH CHAR(2),            /* TRACK ADDRESS FOR THE START OF  48250000
*                                       AN EXTENT.                   */ 48300000
*     3 DEBENDCC CHAR(2),            /* CYLINDER ADDRESS FOR THE END    48500000
*                                       OF AN EXTENT. FOR A PDSE THIS   48528500
*                                       FIELD IS RESERVED.  FOR AN      48557000
*                                       EXTENDED FORMAT DATA SET THIS   48585500
*                                       FIELD CONTAINS THE CYLINDER     48614000
*                                       NUMBER OF THE FORMAT-1 DSCB     48642500
*                                       ADDRESS.                     */ 48671000
*     3 DEBENDHH CHAR(2),            /* TRACK ADDRESS FOR THE END OF    48699500
*                                       AN EXTENT. FOR A PDSE THIS      48728000
*                                       FIELD IS RESERVED.  FOR AN      48756500
*                                       EXTENDED FORMAT DATA SET THIS   48785000
*                                       FIELD CONTAINS THE TRACK        48813500
*                                       NUMBER OF THE FORMAT-1 DSCB     48842000
*                                       ADDRESS.                     */ 48870500
*     3 DEBNMTRK CHAR(2);            /* NUMBER OF TRACKS ALLOCATED      48900000
*                                       TO A GIVEN EXTENT.  FOR SPLIT   49000000
*                                       CYLINDER DATA SETS, THIS        49050000
*                                       FIELD REPRESENTS THE NUMBER     49060000
*                                       OF TRACKS BETWEEN THE START     49070000
*                                       ADDRESS OF THE EXTENT AND THE   49080000
*                                       END ADDRESS OF THE EXTENT.   */ 49090000
*                                                                       49100000
*                                                                       49300000
* /* *************************************************************** */ 49400000
* /*     EXCP ACCESS METHOD, BSAM AND QSAM DEPENDENT SECTION         */ 49500000
* /* *************************************************************** */ 49600000
*                                                                       49700000
* DECLARE                                                               49800000
*    1 DEBACSMD BASED(DEBEXPTR) BDY(WORD),                              49900000
*     3 DEBVOLSQ CHAR(2),            /* VOLUME SEQUENCE NUMBER FOR      50100000
*                                       MULTIVOLUME SEQUENTIAL DATA     50200000
*                                       SETS                         */ 50300000
*      4 DEBVOLBT BIT(8),            /* FIRST BYTE OF DEBVOLSQ          50350000
*                                       (MDC016)              YA00318*/ 50360000
*       5 DEBEXFUL BIT(1),           /* SET BY EOV WHEN REWRITING AN    50370000
*                                       OLD DIRECT ACCESS DATA SET TO   50380000
*                                       INDICATE THAT ALL PREVIOUS      50390000
*                                       EXISTING EXTENTS HAVE BEEN      50392000
*                                       FILLED (MDC017)       YA00318*/ 50394000
*       5 DEBRSV36 BIT(1),           /* RESERVED               MDC018*/ 50396000
*       5 DEBRSV37 BIT(1),           /* RESERVED               MDC018*/ 50398000
*       5 DEBRSV38 BIT(1),           /* RESERVED               MDC018*/ 50398400
*       5 DEBRSV39 BIT(1),           /* RESERVED               MDC018*/ 50398800
*       5 DEBRSV40 BIT(1),           /* RESERVED               MDC018*/ 50399200
*       5 DEBRSV41 BIT(1),           /* RESERVED               MDC018*/ 50399600
*       5 DEBRSV42 BIT(1),           /* RESERVED               MDC018*/ 50399700
*      4 DEBVLSEQ PTR(8),            /* FOR DIRECT ACCESS, SEQUENCE     50399800
*                                       NUMBER OF THE VOLUME OF THE     50399900
*                                       DATA SET RELATIVE TO THE        50433200
*                                       FIRST VOLUME OF THE DATA SET.   50443200
*                                       FOR TAPE, SEQUENCE NUMBER OF    50453200
*                                       THE VOLUME OF THE DATA SET      50463200
*                                       RELATIVE TO THE FIRST VOLUME    50465200
*                                       PROCESSED.  (MDC019)  YA00318*/ 50465600
*     3 DEBVOLNM CHAR(2),            /* TOTAL NUMBER OF VOLUMES IN A    50466700
*                                       MULTIVOLUME SEQUENTIAL DATA     50500000
*                                       SET.                         */ 50600000
*     3 DEBDSNM CHAR(8) BDY(WORD),   /* MEMBER NAME.  THIS FIELD        50700000
*                                       APPEARS ONLY WHEN AN OUTPUT     50750000
*                                       DATA SET HAS BEEN OPENED FOR    50760000
*                                       A MEMBER NAME AND THE DSCB      50800000
*                                       SPECIFIES A PARTITIONED         50900000
*                                       DATA SET.                    */ 51000000
*       5 DEBUTSAA PTR(31),          /* ADDRESS OF THE USER TOTALING    51100000
*                                       SAVE AREA                    */ 51300000
*        6 DEBRSV13 CHAR(1),         /* RESERVED                     */ 51400000
*        6 DEBUTSAB PTR(24),         /* *** SAME AS DEBUTSAA ABOVE   */ 51500000
*       5 DEBRSV14 CHAR(4) BDY(WORD),/* RESERVED (IF USER TOTALING      51550000
*                                       WAS SPECIFIED)               */ 51850000
*     3 DEBBLKSI FIXED(15),          /* MAXIMUM BLOCK SIZE              51860000
*                                       (MDC346)             @ZA03699*/ 51870000
*     3 DEBLRECL FIXED(15);          /* LOGICAL RECORD LENGTH           51880000
*                                       (MDC347)             @ZA03699*/ 51890000
*                                                                       51900000
*                                                                       52000000
* /* *************************************************************** */ 52100000
* /*               BPAM DEPENDENT SECTION                            */ 52200000
* /* *************************************************************** */ 52300000
*                                                                       52400000
*                                                                       52500000
* DECLARE 1 DEBACS01                                                    52600000
*       BASED(DEBEXPTR) BDY(WORD),                                      52700000
*     3 DEBDSNAM CHAR(8) BDY(WORD),  /* FOR A PARTITIONED DATA SET      52900000
*                                       OPENED FOR OUTPUT FOR A         53000000
*                                       MEMBER NAME, THIS FIELD IS      53100000
*                                       THE MEMBER NAME.             */ 53200000
*      4 DEBEXTNM CHAR(1);           /* FOR A PARTITIONED DATA SET      53300000
*                                       OPENED FOR INPUT, EACH ONE-     53400000
*                                       BYTE FIELD CONTAINS THE         53500000
*                                       EXTENT NUMBER OF THE FIRST      53600000
*                                       EXTENT ENTRY FOR EACH DATA      53700000
*                                       SET EXCEPT THE FIRST, IF TWO    53800000
*                                       OR MORE DATA SETS ARE           53900000
*                                       CONCATENATED. THE NUMBER OF     54000000
*                                       BYTES IN THE FIELD IS EQUAL     54100000
*                                       TO ONE LESS THAN THE NUMBER     54200000
*                                       OF DATA SETS CONCATENATED.   */ 54300000
*                                                                       54400000
*                                                                       54500000
* /* *************************************************************** */ 54600000
* /*               BDAM DEPENDENT SECTION                            */ 54700000
* /* *************************************************************** */ 54800000
*                                                                       54900000
*                                                                       55000000
* DECLARE 1 DEBACS02                                                    55100000
*       BASED(DEBEXPTR) BDY(WORD),                                      55200000
*                                                                       55300000
* /*                      *****************************************  */ 55400000
* /*                      * FOR FIXED LENGTH RECORDS WITH THE     *  */ 55500000
* /*                      * OPTION OF RELATIVE BLOCK ADDRESSING   *  */ 55600000
* /*                      * (BUT NOT TRACK OVERFLOW)              *  */ 55700000
* /*                      *****************************************  */ 55800000
*                                                                       55900000
*     3 DEBDBLK  FIXED(31),          /* ONE FOUR-BYTE FIELD FOR EACH    56000000
*                                       EXTENT DESCRIBED IN THE         56100000
*                                       DEVICE DEPENDENT SECTION.    */ 56200000
*      4 DEBDBPT  PTR(8),            /* NUMBER OF BLOCKS PER TRACK   */ 56300000
*      4 DEBDBPE  CHAR(3);           /* NUMBER OF BLOCKS PER EXTENT  */ 56400000
*                                                                       56500000
*                                                                       56600000
* DECLARE 1 DEBACS03                                                    56700000
*       BASED(DEBEXPTR) BDY(WORD),                                      56800000
*                                                                       56900000
* /*                      *****************************************  */ 57000000
* /*                      * FOR FIXED LENGTH RECORDS WITH THE     *  */ 57100000
* /*                      * OPTION OF RELATIVE BLOCK ADDRESSING   *  */ 57200000
* /*                      * AND TRACK OVERFLOW.                   *  */ 57300000
* /*                      *****************************************  */ 57400000
*                                                                       57500000
*     3 DEBDTPP FIXED(31),           /* NUMBER OF TRACKS PER PERIOD  */ 57600000
*     3 DEBDBPP FIXED(31),           /* NUMBER OF BLOCKS PER PERIOD  */ 57700000
* /*                      THE FOLLOWING FIELD OCCURS ONCE FOR        */ 57800000
* /*                      EACH EXTENT.                               */ 57900000
*     3 DEBDBPEF FIXED(31);          /* NUMBER OF BLOCKS PER EXTENT  */ 58000000
*                                                                       58100000
*                                                                       58200000
* /* *************************************************************** */ 58300000
* /*              BTAM DEPENDENT SECTION                             */ 58400000
* /*                                                                 */ 58450000
* /*     NOTE  THIS SEGMENT IS ALWAYS PRESENT FOR BTAM.  IT IS       */ 58460000
* /*           USED WHEN A BUFFER POOL OR DYNAMIC BUFFERING IS       */ 58470000
* /*           USED.  OTHERWISE, THE FIELDS ARE ZERO.                */ 58480000
* /* *************************************************************** */ 58500000
*                                                                       58600000
*                                                                       58700000
* DECLARE 1 DEBACS04                                                    58800000
*       BASED(DEBEXPTR) BDY(WORD),                                      58900000
*     3 DEBTBFRA PTR(31),            /* ADDRESS OF THE BUFFER ROUTINE*/ 59400000
*      4 DEBRSV15 CHAR(1),           /* RESERVED                     */ 59500000
*      4 DEBTBFRB PTR(24),           /* ADDRESS OF THE BUFFER ROUTINE*/ 59600000
* /*                      THE FOLLOWING FIELD IS REPEATED FOR EACH   */ 59800000
* /*                      CCW ON THE CHANNEL PROGRAM QUEUE           */ 60000000
*     3 DEBTCCWA PTR(31),            /* ADDRESS OF THE FIRST (OR        60100000
*                                       FOLLOWING) CCW ON THE QUEUE  */ 60200000
*      4 DEBRSV16 CHAR(1),           /* RESERVED                     */ 60300000
*      4 DEBTCCWB PTR(24);           /* *** SAME AS DEBCCWA ABOVE    */ 60400000
*                                                                       60700000
*                                                                       60800000
* /* *************************************************************** */ 60900000
* /*                GAM DEPENDENT SECTION                            */ 61000000
* /* *************************************************************** */ 61100000
*                                                                       61200000
*                                                                       61300000
* DECLARE 1 DEBACS05                                                    61400000
*       BASED(DEBEXPTR) BDY(WORD),                                      61500000
*     3 DEBFUCBA PTR(31),            /* ADDRESS OF FIRST UCB         */ 61700000
*      4 DEBRSV17 CHAR(1),           /* RESERVED                     */ 61800000
*      4 DEBFUCBB PTR(24),           /* ADDRESS OF FIRST UCB         */ 61900000
*     3 DEBLUCBA PTR(31),            /* ADDRESS OF LAST UCB          */ 62100000
*      4 DEBRSV18 CHAR(1),           /* RESERVED                     */ 62200000
*      4 DEBLUCBB PTR(24);           /* ADDRESS OF LAST UCB          */ 62300000
*                                                                       62318800
*                                                                       62319200
* /* *************************************************************** */ 62319600
* /*              ISAM LOAD MODE EXTENSION                           */ 62320000
* /* *************************************************************** */ 62320800
*                                                                       62321800
*                                                                       62322800
* DECLARE 1 DEBACS06                                                    62324000
*       BASED(DEBEXPTA) BDY(WORD),   /*                          @L3C*/ 62326036
*    2 DEBDCBFA PTR(31),             /* ADDRESS OF DCB FIELD AREA       62328000
*                                                              MDC013*/ 62330000
*    2 DEBPUT   PTR(31);             /* ADDRESS OF PUT MODULE  ICB379*/ 62332000
*                                                                       62334000
*                                                                       62335000
* /* *************************************************************** */ 62336000
* /*              ISAM SCAN MODE EXTENSION                           */ 62338000
* /* *************************************************************** */ 62340000
*                                                                       62342400
*                                                                       62342800
* DECLARE 1 DEBACS07                                                    62343800
*       BASED(DEBEXPTA) BDY(WORD),   /*                          @L3C*/ 62346036
*    2 *        PTR(31),             /* DEBDCBFA - ADDRESS OF DCB       62348000
*                                       FIELD AREA             MDC014*/ 62350000
*    2 DEBGET   PTR(31),             /* ADDRESS OF GET OR PUT MODULE    62352000
*                                       - THIS FIELD IS ALSO CALLED     62354000
*                                       DEBPUT                 ICB379*/ 62356000
*    2 DEBWKPT4 PTR(31),             /* SAME AS DCBWKPT4 - ADDRESS OF   62357000
*                                       UCB                    ICB379*/ 62358000
*    2 DEBWKPT5 PTR(31),             /* SAME AS DCBWKPT5 - ADDRESS OF   62360000
*                                       GET APPENDAGE MODULE   ICB379*/ 62362000
*    2 DEBCREAD PTR(31),             /* ADDRESS OF CHANNEL-END          62364000
*                                       APPENDAGE FOR READ     ICB379*/ 62366000
*    2 DEBCSETL PTR(31),             /* ADDRESS OF CHANNEL-END          62368000
*                                       APPENDAGE FOR SETL     ICB379*/ 62369000
*    2 DEBCWRIT PTR(31),             /* ADDRESS OF CHANNEL-END          62370000
*                                       APPENDAGE FOR WRITE    ICB379*/ 62372000
*    2 DEBCCHK  PTR(31),             /* ADDRESS OF CHANNEL-END          62374000
*                                       APPENDAGE FOR WRITE VALIDITY    62376000
*                                       CHECK                  ICB379*/ 62378000
*    2 DEBCREWT PTR(31),             /* ADDRESS OF CHANNEL-END          62379000
*                                       APPENDAGE FOR RE-WRITE ICB379*/ 62380000
*    2 DEBCRECK PTR(31),             /* ADDRESS OF CHANNEL-END          62382000
*                                       APPENDAGE FOR RE-CHECK ICB379*/ 62384000
*    2 DEBAREAD PTR(31),             /* ADDRESS OF ABNORMAL-END         62386000
*                                       APPENDAGE FOR READ     ICB379*/ 62388000
*    2 DEBASETL PTR(31),             /* ADDRESS OF ABNORMAL-END         62390000
*                                       APPENDAGE FOR SETL     ICB379*/ 62391000
*    2 DEBAWRIT PTR(31),             /* ADDRESS OF ABNORMAL-END         62392000
*                                       APPENDAGE FOR WRITE    ICB379*/ 62394000
*    2 DEBACHK  PTR(31),             /* ADDRESS OF ABNORMAL-END         62396000
*                                       APPENDAGE FOR WRITE VALIDITY    62398000
*                                       CHECK                  ICB379*/ 62400000
*    2 DEBAREWT PTR(31),             /* ADDRESS OF ABNORMAL-END         62402000
*                                       APPENDAGE FOR RE-WRITE ICB379*/ 62402500
*    2 DEBARECK PTR(31),             /* ADDRESS OF ABNORMAL-END         62404000
*                                       APPENDAGE FOR RE-CHECK ICB379*/ 62406000
*    2 DEBRPSST PTR(31);             /* ADDRESS OF RPS SIO APPENDAGE    62408000
*                                       IF ADDRSPC=REAL WAS NOT         62410000
*                                       SPECIFIED              ICB379*/ 62412000
*                                                                       62413000
*                                                                       62414000
* /* *************************************************************** */ 62416000
* /*              BISAM MODE EXTENSION                               */ 62418000
* /* *************************************************************** */ 62420000
*                                                                       62422400
*                                                                       62422800
* DECLARE 1 DEBACS08                                                    62423800
*       BASED(DEBEXPTA) BDY(WORD),   /*                          @L3C*/ 62426036
*    2 *        PTR(31),             /* DEBDCBFA - ADDRESS OF DCB       62428000
*                                       FIELD AREA             MDC015*/ 62430000
*    2 DEBDISAD PTR(31),             /* ADDRESS OF PRIVILEGED MODULE    62432000
*                                       ENTERED WHEN A BISAM MACRO      62434000
*                                       INSTRUCTION IS EXECUTED         62434400
*                                                              ICB379*/ 62435400
*    2 *        PTR(31),             /* DEBWKPT4 - SAME AS DCBWKPT4 -   62438000
*                                       ADDRESS OF THE PART 1           62440000
*                                       APPENDAGE MODULE (ABNORMAL      62442000
*                                       AND CHANNEL-END APPANDAGES)     62444000
*                                                              ICB379*/ 62446000
*    2 *        PTR(31),             /* DEBWKPT5 - SAME AS DCBWKPT5 -   62447000
*                                       ADDRESS OF THE PART 2           62448000
*                                       APPENDAGE MODULE (ABNORMAL      62450000
*                                       AND CHANNEL-END APPANDAGES)     62452000
*                                                              ICB379*/ 62454000
*    2 DEBFREED PTR(31),             /* ADDRESS OF DYNAMIC BUFFERING    62456000
*                                       MODULE                 ICB379*/ 62458000
*    2 DEBRPSIO PTR(31),             /* ADDRESS OF RPS SIO APPENDAGE    62459000
*                                       MODULE IF ADDRSPC=REAL WAS      62460000
*                                       NOT SPECIFIED AND IF DYNAMIC    62462000
*                                       BUFFERING IS USED      ICB379*/ 62464000
*    2 DEBSIOA2 PTR(31);             /* ADDRESS OF DYNAMIC BUFFERING    62466000
*                                       APPENDAGE MODULE DISPLACED BY   62468000
*                                       PAGE FIX (PGFX) APPENDAGE IF    62470000
*                                       ADDRSPC=REAL WAS NOT            62480000
*                                       SPECIFIED              ICB379*/ 62490000
*                                                                       62500000
*                                                                       62600000
* /* *************************************************************** */ 62700000
* /*              SUBROUTINE NAME SECTION                            */ 62800000
* /*                                                                 */ 62850000
* /*     NOTE  FOLLOWS THE ACCESS METHOD DEPENDENT SECTION, OR THE   */ 62860000
* /*           DEVICE DEPENDENT SECTION IF THERE IS NO ACCESS        */ 62870000
* /*           METHOD SECTION.                                       */ 62880000
* /* *************************************************************** */ 62900000
*                                                                       63000000
* DECLARE                                                               63100000
* 1 DEBSUBNM BASED(DEBSBPTR) BDY(WORD),                                 63200000
*      4 DEBSUBID CHAR(2);           /* SUBORUTINE IDENTIFICATION.      63700000
*                                       EACH ACCESS METHOD SUBROUTINE,  63750000
*                                       APPENDAGE SUBROUTINE, AND IRB   63800000
*                                       ROUTINE WILL HAVE A UNIQUE      63850000
*                                       EIGHT-BYTE NAME.  THE LOW-      63900000
*                                       ORDER TWO BYTES OF EACH         63950000
*                                       ROUTINE NAME WILL BE IN THIS    64000000
*                                       FIELD IF THE SUBROUTINE IS      64050000
*                                       LOADED BY THE OPEN ROUTINES. */ 64100000
*                                                                       64400000
*                                                                       65700000
* /* *************************************************************** */ 65800000
* /*         APPENDAGE VECTOR TABLE SECTION OF THE DEB               */ 65900000
* /* *************************************************************** */ 66000000
*                                                                       66100000
* DECLARE                                                               66110000
*   1 DEB BASED(DEBAPPB) BDY(WORD),  /* DEBAVT BASED DEBAPPAD+1  @L1C*/ 66120036
*    2 DEBAVT BDY(WORD),             /* APPENDAGE VECTOR TABLE       */ 66200000
*     3 DEBEOEA  PTR(31),            /* ADDRESS OF END-OF-EXTENT        66400000
*                                       APPENDAGE ROUTINE            */ 66500000
*      4 DEBEOEAB CHAR(1),           /* FLAG BYTE              ICB280*/ 66510000
*       5 DEBTCAMQ BIT(4),           /* TCAM WORK AREA       @ZA34098*/ 66530000
*       5 DEBEOENP BIT(4),           /* NUMBER OF 2K PAGES TO BE        66560000
*                                       FIXED FOR THE END-OF-EXTENT     66570000
*                                       APPENDAGE              ICB280*/ 66580000
*      4 DEBEOEAD PTR(24),           /* ADDRESS OF END-OF-EXTENT        66590000
*                                       APPENDAGE ROUTINE      ICB280*/ 66592000
*     3 DEBSIOA  PTR(31),            /* ADDRESS OF START I/O            66600000
*                                       APPENDAGE ROUTINE            */ 66700000
*      4 DEBSIOAB CHAR(1),           /* FLAG BYTE              ICB280*/ 66750000
*       5 DEBPGFX  BIT(1),           /* ADDRESS IN DEBSIOAD CAN BE      66752000
*                                       USED TO DETERMINE THE ENTRY     66754000
*                                       POINT TO THE PAGE FIX (PGFX)    66756000
*                                       APPENDAGE ROUTINE BY ADDING     66758000
*                                       4 TO ADDRESS IN DEBSIOAD        66758800
*                                                              ICB280*/ 66759600
*       5 DEBSIOX  BIT(1),           /* IF ZERO, DO NOT ENTER SIO       66759700
*                                       APPENDAGE WHEN ERP IS ACTIVE.   66759800
*                                       IF ONE, ENTER SIO APPENDAGE     66759900
*                                       EVEN WHEN ERP IS ACTIVE.        66763200
*                                                              ICB372*/ 66763600
*       5 DEBIOVR  BIT(1),           /* IF ONE, EXCPVR REQUEST IS       66764200
*                                       VALID.  IF ZERO, EXCPVR         66765200
*                                       REQUEST IS INVALID AND WILL     66766400
*                                       NOT BE EXECUTED. CURRENTLY HAS  66766800
*                                       NO EFFECT.             ICB401*/ 66767200
*       5 DEBFIX   BIT(1),           /* INDICATION THAT DEB HAS BEEN    66767600
*                                       FIXED (OS/VS2)  (MDC032)        66768900
*                                                              YM5929*/ 66769400
*       5 DEBSIONP BIT(4),           /* NUMBER OF 2K PAGES TO BE        66770000
*                                       FIXED FOR THE SIO               66780000
*                                       APPENDAGE              ICB280*/ 66790000
*      4 DEBSIOAD PTR(24),           /* ADDRESS OF START I/O            66792000
*                                       APPENDAGE ROUTINE      ICB280*/ 66794000
*     3 DEBPCIA  PTR(31),            /* ADDRESS OF PCI APPENDAGE        66800000
*                                       ROUTINE                      */ 66810000
*      4 DEBPCIAB CHAR(1),           /* FLAG BYTE              ICB280*/ 66850000
*       5 DEBRSV24 BIT(1),           /* RESERVED                     */ 66860000
*       5 DEBRSV25 BIT(1),           /* RESERVED                     */ 66862000
*       5 DEBRSV26 BIT(1),           /* RESERVED                     */ 66864000
*       5 DEBRSV27 BIT(1),           /* RESERVED                     */ 66866000
*       5 DEBPCINP BIT(4),           /* NUMBER OF 2K PAGES TO BE        66870000
*                                       FIXED FOR THE PCI APPENDAGE     66880000
*                                       ROUTINE                ICB280*/ 66890000
*      4 DEBPCIAD PTR(24),           /* ADDRESS OF PROGRAM-             66892000
*                                       CONTROLLED-INTERRUPTION (PCI)   66892400
*                                       APPENDAGE ROUTINE      ICB280*/ 66894000
*     3 DEBCEA   PTR(31),            /* ADDRESS OF CHANNEL-END          66900000
*                                       APPENDAGE ROUTINE            */ 67000000
*      4 DEBCEAB  CHAR(1),           /* FLAG BYTE              ICB280*/ 67050000
*       5 DEBESMVR BIT(1),           /* EXCPVR VALIDITY CHK  @ZA34098*/ 67060000
*       5 DEBRSV29 BIT(1),           /* RESERVED                     */ 67062000
*       5 DEBRSV30 BIT(1),           /* RESERVED                     */ 67064000
*       5 DEBRSV31 BIT(1),           /* RESERVED                     */ 67066000
*       5 DEBCENP  BIT(4),           /* NUMBER OF 2K PAGES TO BE        67070000
*                                       FIXED FOR THE CHANNEL-END       67080000
*                                       APPENDAGE              ICB280*/ 67090000
*      4 DEBCEAD  PTR(24),           /* ADDRESS OF CHANNEL END          67092000
*                                       APPENDAGE ROUTINE      ICB280*/ 67094000
*     3 DEBXCEA  PTR(31),            /* ADDRESS OF ABNORMAL-END         67100000
*                                       APPENDAGE ROUTINE            */ 67200000
*      4 DEBXCEAB CHAR(1),           /* FLAG BYTE              ICB280*/ 67250000
*       5 DEBRSV32 BIT(1),           /* RESERVED                     */ 67260000
*       5 DEBRSV33 BIT(1),           /* RESERVED                     */ 67262000
*       5 DEBRSV34 BIT(1),           /* RESERVED                     */ 67264000
*       5 DEBRSV35 BIT(1),           /* RESERVED                     */ 67266000
*       5 DEBXCENP BIT(4),           /* NUMBER OF 2K PAGES TO BE        67270000
*                                       FIXED FOR THE ABNORMAL-END      67280000
*                                       APPENDAGE              ICB280*/ 67290000
*      4 DEBXCEAD PTR(24)            /* ADDRESS OF ABNORMAL-END         67292000
*                                       APPENDAGE ROUTINE      ICB280*/ 67294000
*                                                                       67300000
* /* *************************************************************** */ 67400000
* /*                 DEB PREFIX TABLE                                */ 67500000
* /* *************************************************************** */ 67600000
* %IF  DEBPRES^='YES' %THEN %GOTO DEBL5;                                67622200
*       ;                                                               67644400
* DCL 1 DEBPREFX BDY(WORD) BASED(DEBPTR-(LENGTH(DEBPREFX))),            67666600
*                                    /* DEB PREFIX TABLE             */ 67688800
*                                    /*   (DIRECT ACCESS)            */ 67711000
* %GOTO DEBL6;                                                          67733200
* %DEBL5:;                                                              67755400
*       ,                                                               67777600
*    2 DEBPREFX BDY(WORD),           /* DEB PREFIX TABLE             */ 67800000
*                                    /*   (DIRECT ACCESS)            */ 67833300
* %DEBL6:;                                                              67866600
*     3 DEBWKARA CHAR(1) BDY(WORD),  /* O/C/E WORK AREA                 67908300
*                                       (DIRECT ACCESS)              */ 67950000
*     3 DEBDSCBA CHAR(7) BDY(WORD,2),/* DSCB ADDRESS (BBCCHHR) USED     68000000
*                                       BY O/C/EOV (DIRECT ACCESS)   */ 68050000
*     3 DEBXTNP  PTR(31),            /* POINTER TO DEB EXTENSION        68101000
*                                       (OS/VS2)               MDC008*/ 68102000
*      4 DEBDCBMK CHAR(4) BDY(WORD), /* DCB MODIFICATION MASK USED BY   68200000
*                                       O/C/EOV- OBSOLETE      MDC009*/ 68250000
*     3 DEBLNGTH CHAR(1),            /* LENGTH OF DEB IN DOUBLE         68400000
*                                       WORDS                        */ 68500000
*     3 DEBAMTYP FIXED(8),           /* ACCESS METHOD TYPE       @L2C*/ 68600036
*     3 DEBTBLOF FIXED(16);          /* OFFSET IN THE DEB TABLE TO      68650000
*                                       THE ENTRY FOR THIS DEB   @LIC*/ 68700000
*                                                                       68850000
* /**************************************************************@L2A*/ 68862536
* /*   EQUATES FOR DEBAMTYP FIELD                                @L2A*/ 68875036
* /**************************************************************@L2A*/ 68887536
*                                                                       68900000
* DCL DEBAMNON FIXED(8) CONSTANT(0), /* ACCESS METHOD TYPE              68902636
*                                       UNKNOWN                  @L2A*/ 68905236
*    DEBAMVSM FIXED(8) CONSTANT(1),  /* VSAM ACCESS METHOD TYPE  @L2A*/ 68907836
*    DEBAMXCP FIXED(8) CONSTANT(2),  /* EXCP ACCESS METHOD TYPE  @L2A*/ 68910436
*    DEBAMTCM FIXED(8) CONSTANT(4),  /* TCAM ACCESS METHOD TYPE  @L2A*/ 68913036
*    DEBAMGAM FIXED(8) CONSTANT(8),  /* GRAPHICS ACC METHOD TYPE @L2A*/ 68915636
*    DEBAMTAM FIXED(8) CONSTANT(16),  /* BTAM ACCESS METHOD TYPE @L2A*/ 68918236
*    DEBAMBPM FIXED(8) CONSTANT(32),  /* BPAM ACCESS METHOD TYPE @L2A*/ 68920836
*    DEBAMSAM FIXED(8) CONSTANT(32),  /* SAM ACCESS METHOD TYPE  @L2A*/ 68923436
*    DEBAMBDM FIXED(8) CONSTANT(64),  /* DIRECT ACC METHOD TYPE  @L2A*/ 68926036
*    DEBAMISM FIXED(8) CONSTANT(128),  /*ISAM ACCESS METHOD TYPE @L2A*/ 68928636
*    DEBAMSUB FIXED(8) CONSTANT(129),  /* SUBSYSTEM ACCESS              68931236
*                                         METHOD TYPE            @L2A*/ 68933836
*    DEBAMVTM FIXED(8) CONSTANT(130),  /*VTAM ACCESS METHOD TYPE @L2A*/ 68936436
*    DEBAMTAP FIXED(8) CONSTANT(132);  /* TCAM APPLICATION PROGRAM      68939036
*                                         ACCESS METHOD TYPE     @L2A*/ 68941636
*                                                                       68944236
*                                                                       68946836
* /* *************************************************************** */ 68950000
* /*                 DEB EXTENSION (OS/VS2)                          */ 69000000
* /* *************************************************************** */ 69050000
*                                                                       69100000
*%IF DEBDXAD^='YES' %THEN                                               69107100
*    %GOTO DEBL8;                                                       69114200
* DECLARE                                                               69121300
*   1 DEBXTN   BASED(DXDEBXAD) BDY(WORD),                               69128400
*%GOTO DEBL9;                                                           69135500
*%DEBL8 : ;                                                             69142600
* DECLARE                                                               69150000
*   1 DEBXTN   BASED(DEBXTNP)  BDY(WORD),                               69200000
*%DEBL9 : ;                                                             69225000
*    2 DEBXLNGH FIXED(15),           /* LENGTH OF DEB EXTENSION         69250000
*                                                              MDC002*/ 69300000
*    2 DEBXFLG1 BIT(8),              /* FLAG BYTE  (MDC027)    YM1272*/ 69350000
*     3 DEBXCDCB BIT(1),             /* DEBDCBAD FIELD CONTAINS THE     69353000
*                                       ADDRESS OF A COPIED DCB.        69356000
*                                       USED BY END-OF-VOLUME, TCLOSE   69359000
*                                       AND TASK CLOSE.  (MDC028)       69362000
*                                                              YM1272*/ 69365000
*     3 DEBXTSKC BIT(1),             /* TASK CLOSE IS CLOSING THE       69366000
*                                       RELATED DCB.  SET BY TASK       69368000
*                                       CLOSE AND INTERROGATED BY       69368500
*                                       END-OF-VOLUME, FEOV AND         69369000
*                                       TCLOSE FOR DEB'S NOT ON THE     69369500
*                                       CURRENT TCB DEB CHAIN.          69370000
*                                       (MDC031)               YM2869*/ 69370500
*     3 DEBXDSSI BIT(1),             /* DATA SET SECURITY INDICATOR.    69370700
*                                       SET BY OPEN AND CHECKPOINT.     69371000
*                                       INTERROGATED BY EOV.            69371700
*                                       (MDC348)             @Z40RP9A*/ 69372400
*     3 DEBXWIND BIT(1),             /* MSS WINDOW PROCESSING INDIC.    69374000
*                                       SET BY OPEN.  INTERROGATED      69374600
*                                       BY EOV, SAM EOB AND CLOSE.      69375200
*                                                            @ZA37313*/ 69375800
*     3 DEBXACIS BIT(1),             /* ACQUIRE ISSUED WITH INHIBIT     69376400
*                                       STAGE INDICATED DURING OPEN OR  69377000
*                                       EOV.  SET BY OPEN AND EOV.      69377600
*                                       INTERROGATED BY SVC 126.        69378200
*                                                            @ZA37313*/ 69378800
*     3 DEBXNFLS BIT(1),             /* DO NOT FLUSH QSAM BUFFERS IN    69379636
*                                       CLOSE BECAUSE AN OPEN/CLOSE/EOV 69380436
*                                      ABEND OCCURRED. SET BY IFG0RR0B. 69381236
*                                       TESTED BY IGG0201Z.      @01A*/ 69382036
*                                    /*                          @L1D*/ 69382536
*     3 DEBXSYSB BIT(1),             /* SYSTEM DETERMINED BLKSIZE@L8C*/ 69383000
*     3 DEBXRACE BIT(1),             /* RACF EXECUTE ONLY AUTHORITY OF  69383500
*                                       A PROGRAM LIBRARY. SET BY OPEN  69384000
*                                       AND INTEROGATED BY OPEN AFTER   69384500
*                                       FINAL DCB MERGE AND BY A SAM    69385000
*                                       EXECUTOR.                @L9A*/ 69385500
*    2 DEBXFLG2 BIT(8),              /* FLAGBYTE                 @06C*/ 69386000
*     3 DEBXRSAP BIT(1),             /* USED BY RESTART TO INDICATE     69386500
*                                       THAT RESTART HAS INCREASED THE  69387000
*                                       LENGTH OF THE DEB EXTENSION TO  69387500
*                                       INCLUDE A CHKPT/RST APPENDAGE   69388000
*                                       TO THE DEB EXTENSION. THE       69388500
*                                       APPENDAGE IS FREEMAINED AND     69389000
*                                       THIS BIT IS TURNED OFF BEFORE   69389500
*                                       RESTART PROCESSING IS COMPLETED 69390000
*                                       DEBXLNTH INCLUDES THE LENGTH OF 69390500
*                                       THE APPENDAGE WHILE THIS BIT    69391000
*                                       IS ON.                   @06A*/ 69391500
*     3 DEBBYP   BIT(1),             /* WHEN ON EXCP SCAN ROUTINE WILL  69392000
*                                       SET IOSBYP ON AND BYPASS        69392500
*                                       BUILDING A PREFIX        @LBA*/ 69393000
*     3 DEBCHCMP BIT(1),             /* WHEN ON EXCP SCAN ROUTINE WILL  69393500
*                                       SET IOSCHCMP ON AND BYPASS      69394000
*                                       BUILDING A PREFIX        @LBA*/ 69394500
*     3 DEBXENQA BIT(1),             /* PDS ENQ,DISP=SHR,OUTPUT  @LCC*/ 69395000
*     3 DEBXENQS BIT(1),             /* DSCB ENQ,DISP=SHR        @LCC*/ 69395500
*     3 DEBXIMSC BIT(1),             /* IMS CLOSE IN PROGRESS    @09C*/ 69396000
*     3 DEBXCASV BIT(1),             /* CACHE ATTR TOKEN VALID   @10A*/ 69396500
*     3 DEBXMVLF BIT(1),             /* TAPE MULTIVOL 1ST VOL RD @LGC*/ 69398200
*    2 DEBXDSAB PTR(31),             /* POINTER TO DSAB        MDC004*/ 69400000
*    2 DEBXDCBM CHAR(4) BDY(WORD),   /* DCB MODIFICATION MASK USED BY   69450000
*                                       I/O SUPPORT            MDC005*/ 69500000
*    2 DEBXDBPR PTR(31),             /* POINTER TO DEB         MDC006*/ 69550000
*    2 DEBXDSO1 BIT(8),              /* SAME AS DCBDSORG BYTE 1         69600000
*                                                              MDC020*/ 69650000
*    2 DEBXDSO2 BIT(8),              /* SAME AS DCBDSORG BYTE 2         69700000
*                                                              MDC021*/ 69750000
*    2 DEBXMCF1 BIT(8),              /* SAME AS DCBMACRF BYTE 1         69800000
*                                                              MDC022*/ 69850000
*    2 DEBXMCF2 BIT(8),              /* SAME AS DCBMACRF BYTE 2         69900000
*                                                              MDC023*/ 69950000
*    2 DEBXXARG PTR(31),             /* ADDRESS OF BDAM READ            70000000
*                                       EXCLUSIVE LIST         MDC024*/ 70050000
*    2 DEBXOPNJ PTR(31),             /* POINTER TO DSAB (SEPARATE       70100000
*                                       FROM DEBXDSAB) DYNAMICALLY      71450000
*                                       ALLOCATED BY OPEN TYPE=J.       71453000
*                                       THIS POINTER WILL EXIST FOR     71456000
*                                       NON-AUTHORIZED CALLERS OF       71459000
*                                       OPEN TYPE=J FOR A DIRECT        71462000
*                                       ACCESS DATA SET WHERE THE       71465000
*                                       DATA SET BEING OPENED IS        71468000
*                                       DIFFERENT FROM THE DATA SET     71471000
*                                       DESCRIBED BY THE DDNAME IN      71474000
*                                       DCB AND THE JFCNWRIT BIT IS     71477000
*                                       ON IN THE JFCB.  THE POINTER    71480000
*                                       WILL BE USED BY CLOSE TO        71483000
*                                       DYNAMICALLY UNALLOCATE THE      71486000
*                                       DATA SET.  (MDC352)  @ZA02193*/ 71489000
*    2 DEBXSAMB PTR(31),             /* ADDRESS OF SAM BLOCK (SAMB)     71500000
*                                       (MDC351)             @Z40FP9A*/ 71510000
*    2 DEBXOPET CHAR(8),             /* DATASET OPEN TIME SET BY OPEN   71511936
*                                       INITIALIZATION       @ZA39299*/ 71513836
* /************************************************************* @P3A*/ 71513900
* /* THE FOLLOWING MAPPING REPRESENTS THE FIRST 8 BYTES OF       @P3A*/ 71514000
* /* DEFINE EXTENT DATA WHICH IS PASSED, VIA THE DEFINE          @P3A*/ 71514100
* /* EXTENT CCW, TO A DASD STORAGE SUBSYSTEM WHICH SUPPORTS      @P3A*/ 71514200
* /* THE ECKD DEFINE EXTENT CCW.                                 @P3A*/ 71514300
* /*                                                             @P3A*/ 71514400
* /* THIS INFORMATION WILL BE COPIED FROM THE DEB EXTENSION TO   @P3A*/ 71514500
* /* THE SYSTEM BUILT DEFINE EXTENT DATA AREA, AND WILL BE SENT  @P3A*/ 71514600
* /* TO THE STORAGE SUBSYSTEM WITH EACH I/O REQUEST RELATED TO   @P3A*/ 71514700
* /* THIS DEB.                                                   @P3A*/ 71514800
* /*                                                             @P3A*/ 71514900
* /* REFER TO THE APPROPRIATE STORAGE CONTROL REFERENCE          @P3A*/ 71515000
* /* PUBLICATION FOR A DETAILED DESCRIPTION OF THESE FIELDS.     @P3A*/ 71515100
* /*                                                             @P3A*/ 71515200
* /************************************************************  @P3A*/ 71515300
*    2 DEBXDEF CHAR(8) BDY(WORD),    /* DEFINE EXTENT DATA AREA  @H2A*/ 71515736
*      3 DEBDEFG1 BIT(8),            /* FLAG BYTE                @H2A*/ 71517636
*        4 DEBNSHED BIT(1),          /* NO SEEK HEAD PERMITTED   @H2A*/ 71519536
*        4 DEBXVDEF BIT(1),          /* DEB DEF EXT DATA VALID -        71520400
*                                       MUST BE ON FOR DX DATA          71521300
*                                       TO BE USED               @P3C*/ 71522200
*      3 DEBGATTR BIT(8),            /* GLOBAL ATTRIBUTES        @H2A*/ 71523336
*        4 DEBECKD BIT(2),           /* DEFINE EXTENT DEFINITION @H2A*/ 71525236
*        4 DEBSTRTP BIT(1),          /* CKD CONVERSION MODE      @P3C*/ 71527100
*        4 DEBGA345 BIT(3),          /* ATTRIBUTE BITS 3,4,5     @H2A*/ 71529036
*        4 DEBNRD   BIT(1),          /* NON RETENTIVE DATA ACCESS@08A*/ 71530200
*        4 DEBINHFW BIT(1),          /* INHIBIT FAST WRITE       @08A*/ 71531400
*      3 DEBBLKSZ FIXED(16) BDY(WORD,3), /* BLOCKSIZE IN BYTES   @01M*/ 71532836
*      3 DEBEXTOK CHAR(4),           /* ZERO,EXTENT LOCATOR,TOKEN@H2A*/ 71533000
*        4 DEBNRDID CHAR(2),         /* NON RETENTIVE DATA ID    @08A*/ 71533200
*        4 *        CHAR(1),         /* RESERVED - MUST BE ZERO  @P3C*/ 71533300
*        4 DEBGATTX CHAR(1),         /* GLOBAL ATTRIB EXTENDED 2 @P3A*/ 71533400
*          5 DEBGAX12 BIT(2),        /* SPECIAL DX MODES         @P3A*/ 71533500
*          5 *        BIT(3),        /* RESERVED FOR SYTEM USE   @P3A*/ 71533600
*          5 DEBDFTR0 BIT(1),        /* CU MAY CLEAR R0 DATA     @P3A*/ 71533700
*          5 *        BIT(1),        /* RESERVED FOR SYSTEM USE  @P3A*/ 71533800
*          5 *        BIT(1),        /* RESERVED                 @P3A*/ 71533900
*    2 DEBIOPID  CHAR(4),         /* I/O PREVENTION  IDENTIFIER @L5A*/  71534000
*    2 DEBBLKID  CHAR(4),         /* BLOCK ID VALUE USED TO     @L6A    71534100
*                                    CALCULATE NUMBER OF BLOCKS         71534200
*                                    IN THIS VOLUME FOR EXTENDED        71534300
*                                    BLOCK COUNT CHECKING       @L6A*/  71534400
*    2 DEBXCASF  CHAR(4),         /* CACHE ATTRIBUTE                    71534600
*                                    SELECTION TOKEN            @LAA*/  71534800
*    2 DEBXFLG3 BIT(8),           /* FLAG BYTE                  @LDA*/  71535000
*      3 DEBXTRNC BIT(1),         /*  QSAM TRUNC MACRO HAS BEEN         71535100
*                                     ISSUED FOR A PDSE - IT WAS        71535200
*                                     IGNORED.                  @P3C*/  71535300
*      3 DEBXNSEG BIT(1),         /*  NULL SEGMENT ENCOUNTERED IN A     71535400
*                                     PDSE                      @P3C*/  71535500
*      3 DEBXSMSG BIT(1),         /*  SMS GUAR SP DISP NEW/MOD  @11A*/  71535600
*      3 *        BIT(1),         /*  RESERVED                  @LHC*/  71535700
*      3 DEBXCAP  BIT(1),         /*  UCB ADD IN DEB CAP BY OCE @LFA*/  71535800
*      3 *        BIT(3),         /*  RESERVED                 E@LFC*/  71535900
*    2 DEBXAMBF BIT(8),           /* DEFINES THE USE OF DEBXAMB @LEA*/  71536000
*      3 DEBXABSS BIT(1),         /*  DEBXAMB DEFINES A SSCB PTR...     71536200
*                                     DEBXSSCB IS VALID         @LEA*/  71536400
*      3 DEBXARBA BIT(1),         /* DEBXAMB DEFINES AN RBA VALUE..     71536500
*                                    DEBXRBA IS VALID AND IS THE        71536600
*                                    RBA OF THE CI CONTAINING THE NVR   71536700
*                                    FOR A COMPRESSED FORMAT DATA SET.  71536800
*                                    IT IS ONLY VALID UNTIL THE         71536900
*                                    OPEN EXECUTORS STORE SSCB PTR IN   71537000
*                                    DEBXSSCB.                  @15A*/  71537100
*      3 DEBXAOEF BIT(1),         /* DEBXAMB DEFINES AN IGGSXCB PTR ... 71537200
*                                       PTR FOR HFS/REMOTE FILE @P5C*/  71537300
*      3 DEBXAIB  BIT(1),         /* DEBXAMB DEFINES AN INTERMEDIATE    71537400
*                                    BUFFER USED FOR READ PREVIOUS      71537500
*                                    PROCESSING                 @LKA*/  71537600
*      3 *        BIT(4),         /*  RESERVED                  @LKC*/  71537700
*    2 DEBXSCNT FIXED(15),        /* NUMBER OF STRIPES FOR A STRIPED    71537800
*                                     DATASET                   @P3C*/  71537900
*    2 DEBXSACB PTR(31),          /* POINTER TO SACB CNTRL BLK  @LDA*/  71538000
*    2 DEBXAFLG BIT(8),           /* "ATTRIBUTE EXTENSION" FLGS @P3C*/  71538100
*      3 DEBXADS BIT(1),          /* "ATTRIBUTE EXTENSION" DATA         71538200
*                                    SET                        @12A*/  71538300
*      3 DEBXAINP BIT(1),         /* INPUT PROCESSING PERFORMED FOR     71538400
*                                    "ATTRIBUTE EXTENSION" D/S  @12A*/  71538500
*      3 DEBXAOUT BIT(1),         /* OUTPUT PROCESSING PERFORMED FOR    71538600
*                                    "ATTRIBUTE EXTENSION" D/S  @12A*/  71538700
*      3 DEBXAOFO BIT(1),         /* "ATTRIBUTE EXTENSION" D/S OPENED   71538800
*                                    FOR OUTPUT PROCESSING      @12A*/  71538900
*      3 * BIT(4),                /* RESERVED                   @P3C*/  71539000
*    2 *        CHAR(1),          /* RESERVED                   @LGA*/  71539100
*    2 DEBXVLSQ BIT(16),          /* EXPECTED TAPE VOL SEQ      @LGA*/  71539200
*    2 DEBXDSSB PTR(31),          /* POINTER TO DSSB            @JBC*/  71539300
*    2 DEBXAMB  PTR(31),          /* ACCESS METHOD BLOCK...THE USE OF   71539400
*                                    THIS POINTER IS DEFINED BY THE     71539500
*                                    FIELD DEBXAMBF.            @LEA*/  71539600
*      3 DEBXSSCB PTR(31),        /* ADDRESS OF STRIPED SAM CONTROL     71539700
*                                    BLOCK (SSCB)               @LEA*/  71539800
*        4 DEBXRBA PTR(31),       /* RBA OF VVDS CI OF NVR      @15A*/  71539900
*                                 /*                            @P5D*/  71540000
*          5 DEBXRDBK PTR(31),    /* ADDRESS OF INTERMEDIATE BUFFER     71540100
*                                    FOR READ BACK PROCESSING   @LKA*/  71540200
*    2 DEBXDEBX PTR(31),          /* POINTER TO 2ND DEB EXT.    @13A*/  71540300
*    2 DEBXEND CHAR(0);             /* END OF DEB EXTENSION     @H2A*/  71540400
* /* *************************************************************** */ 71540500
* /*  CONSTANTS RELATED TO DEBECKD.                              @P3A*/ 71540600
* /* *************************************************************** */ 71540700
* DCL DEBFBLK  BIT(2) CONSTANT('00'B),/* DEFINE EXTENT OPERATES AS      71540836
*                                        DEFINED FOR FIXED BLOCK @H2A*/ 71542336
*     DEBCKDCX BIT(2) CONSTANT('11'B),/* DEFINE EXTENT OPERATES AS FOR  71544200
*                                        CKD EXTENSIONS-CCHH EXTENTS    71546136
*                                                                @L4C*/ 71546200
* /* *************************************************************** */ 71547400
* /*  CONSTANTS RELATED TO DEBGA345.                             @P3A*/ 71548600
* /* *************************************************************** */ 71549800
*     DEBNCACH BIT(3) CONSTANT('000'B),/* NORMAL CACHE ACCESS    @L4A*/ 71551000
*     DEBBCACH BIT(3) CONSTANT('001'B),/* BYPASS CACHE LOAD      @L4A*/ 71552200
*     DEBICACH BIT(3) CONSTANT('010'B),/* INHIBIT CACHE LOAD     @L4A*/ 71553400
*     DEBSCACH BIT(3) CONSTANT('011'B),/* SEQUENTIAL ACCESS      @P3C*/ 71554600
*     DEBXRFLG BIT(3) CONSTANT('100'B),/* SEQUENTL PRESTAGE MODEE@P3A*/ 71555800
*     DEBRLC   BIT(3) CONSTANT('101'B),/* RECORD ACCESS MODE     @P3A*/ 71557000
* /* *************************************************************** */ 71558200
* /*  CONSTANTS RELATED TO DEBGAX12.                             @P3A*/ 71559400
* /* *************************************************************** */ 71560600
*     DEBRMODE BIT(2) CONSTANT('00'B), /* NO SPECIAL MODE        @P3A*/ 71561800
*     DEBRDATA BIT(2) CONSTANT('01'B), /* REGULAR DATA FORMAT    @P3A*/ 71563000
*     DEBSKEY  BIT(2) CONSTANT('10'B); /* SPECIAL KEY SEARCH MODE@P3A*/ 71564200
*                                                                       71565400
* /* *************************************************************** */ 71566600
* /*                 SECOND DEB EXTENSION                            */ 71567800
* /* *************************************************************** */ 71569000
*                                                                       71570200
* DECLARE                                                               71571400
*   1 DEB2XTN  BASED(DEBXDEBX)  BDY(WORD), /*                    @13A*/ 71572600
*     2 DEB2XTNN    CHAR(8),        /* 2ND DEB EXTN EYE CATCHER  @13A*/ 71573800
*     2 DEB2XLGH    FIXED(15),      /* LENGTH OF 2ND DEB EXT     @13A*/ 71575000
*     2 DEB2XRSG,                   /* RETRIEVED SG INFO         @13A*/ 71576200
*       3 DEB2XSGL  FIXED(15),      /* STORAGE GROUP NAME LENGTH @13A*/ 71577400
*       3 DEB2XSGN  CHAR(30),       /* STORAGE GROUP NAME        @13A*/ 71578600
*     2 DEB2XRMC,                   /* RETRIEVED MC INFO         @13A*/ 71579800
*       3 DEB2XMCL  FIXED(15),      /* MANAGEMENT CLASS NAME LEN @13A*/ 71581000
*       3 DEB2XMCN  CHAR(30),       /* MANAGEMENT CLASS NAME     @13A*/ 71582200
*     2 DEB2XRSC,                   /* RETRIEVED SC INFO         @13A*/ 71583400
*       3 DEB2XSCL  FIXED(15),      /* STORAGE CLASS LENGTH      @13A*/ 71584600
*       3 DEB2XSCN  CHAR(30),       /* STORAGE CLASS NAME        @13A*/ 71585800
*     2 DEB2XRDC,                   /* RETRIEVED DC INFO         @13A*/ 71587000
*       3 DEB2XDCL  FIXED(15),      /* DATA CLASS LENGTH         @13A*/ 71588200
*       3 DEB2XDCN  CHAR(30),       /* DATA CLASS NAME           @13A*/ 71589400
*     2 DEB2XFG1 BIT(8),            /* FIRST FLAG BYTE           @16A*/ 71590600
*       3 DEB2XOSM  BIT(1),         /* JFCMEDIA SET BY OPEN      @16A*/ 71591800
*       3 DEB2XNLM  BIT(1),         /* NL TP DS OPENED FOR MOD   @LLA*/ 71592200
*       3 DEB2XTCO  BIT(1),         /* TCLOSE TAPE OUTPUT        @LLA*/ 71592600
*       3 DEB2XIBC  BIT(1),         /* INACCURATE BLOCK COUNT    @LLA*/ 71593000
*       3 DEB2XNL1  BIT(1),         /* NL TAPE FILE SEQ 1        @LLA*/ 71593400
*       3 *         BIT(3),         /* RESERVED                  @LLA*/ 71593800
*     2 DEB2XUOF FIXED(8),          /* TIOT DD OFFSET OF UNIT    @17C*/ 71594200
*     2 DEB2XLSQ BIT(16),           /* TAPE VOL SEQ FROM LABEL   @LGC*/ 71595400
*     2 DEB2XALV CHAR(1),           /* AL VERSION DURING OUTPUT  @LJA*/ 71595600
*     2 *        CHAR(1),           /* RESERVED                  @LJC*/ 71595800
*     2 DEB2XTIM PTR(31),           /* TIME STAMP POINTER        @18A*/ 71596000
*     2 * CHAR(3),                  /* RESERVED                  @LJA*/ 71596100
*     2 DEB2XCFG BIT(8),            /* ANSI V4 CCSID FLAGS       @LJA*/ 71596200
*       3 DEB2XIBM BIT(1),          /* IBM VERSION 4 CREATED TAPE@LJA*/ 71596300
*       3 DEB2XOUT BIT(1),          /* OPENED FOR OUTPUT NOT MOD @LJA*/ 71596400
*       3 DEB2XMOD BIT(1),          /* OPENED FOR OUTPUT DISP MOD@LJA*/ 71596500
*       3 DEB2XUDF BIT(1),          /* USER APPLICATION CCSID WAS       71596600
*                                      DEFAULTED                 @LJA*/ 71596700
*       3 DEB2XTDF BIT(1),          /* TAPE CCSID WAS DEFAULTED  @LJA*/ 71596800
*       3 DEB2XIGN BIT(1),          /* TAPE CCSID SPECIFIED BUT NO      71597000
*                                      CONVERSION DONE - CCSID WAS      71597200
*                                      IGNORED                   @LJA*/ 71597400
*     2 DEB2XUSR FIXED(32),         /* CCSID OF USER APPLICATION @LJA*/ 71597600
*     2 DEB2XTPE FIXED(32),         /* CCSID OF TAPE             @LJA*/ 71597800
*     2 DEB2XLBL FIXED(32),         /* CCSID IN EXISTING LABEL   @LJA*/ 71598000
*     2 DEB2XSDC PTR(31),           /* PTR TO SAM DATA CONVERSION       71598200
*                                       BLOCK                    @LJA*/ 71598400
*     2 DEB2XTBL FIXED(31),         /* ACCUMULATIVE BLKCNT ACROSS@LLA   71598500
*                                      VOLUMES                   @LLA*/ 71598600
*     2 DEB2XTCB FIXED(31),         /* DCB BLKCOUNT TCLOSE OUTPUT@LLA*/ 71598700
*     2 DEB2XSGT FIXED(8),          /* SG TYPE (GENERAL/SPECIFIC)@LMA*/ 71598820
*     2 *        CHAR(7),           /* RESERVED                  @LMC*/ 71598840
*     2 DEB2XEND CHAR(0);           /*                           @13A*/ 71598900
*%IF IKEPLS=''  %THEN                                                   71599000
*    %GOTO DEBL4;                                                       71600000
*IHALPOP;                                                               71650000
*%DEBL4 : ;                                                             71700000
