*        %GOTO JSCBL1; /*                                               00042600
         MACRO                                                          00063900
         IEZJSCB  ,  */                                                 00085200
*%JSCBL1 : ;                                                            00106500
*                                                                       00127800
*/* Start of Specifications ******************************************/ 00136400
*/*                                                                  */ 00138500
*/*01* MACRO NAME:  IEZJSCB                                      @L1C*/ 00140600
*/*                                                                  */ 00142700
*/*01* DESCRIPTIVE NAME:  Job/Step Control Block                     */ 00144800
*/*                                                                  */ 00146900
*/*02*  ACRONYM:  JSCB                                               */ 00149000
*/*                                                                  */ 00151100
*/*01* PROPRIETARY STATEMENT=                                        */ 00153600
*/***PROPRIETARY_STATEMENT********************************************/ 00157900
*/*                                                                  */ 00162200
*/*                                                                  */ 00167900
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00173600
*/* THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                     */ 00181200
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1979, 2000                      */ 00188900
*/*                                                                  */ 00196600
*/* STATUS= HBB7703                                                  */ 00213800
*/*                                                                  */ 00231000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00281000
*/*                                                                  */ 00420200
*/*01* DSECT NAME:                                                   */ 00437400
*/*     IEZJSCB                                                      */ 00454600
*/*                                                                  */ 00471800
*/*01* COMPONENT:  Initiator (SC1B6)                                 */ 00472300
*/*                                                                  */ 00472800
*/*01* EYE-CATCHER:  None                                            */ 00473300
*/*                                                                  */ 00473800
*/*01* STORAGE ATTRIBUTES:                                           */ 00474300
*/*02*  SUBPOOL:  253                                                */ 00474800
*/*02*  KEY:  0                                                      */ 00475300
*/*02*  RESIDENCY:  Below 16 MB in virtual storage.                  */ 00475800
*/*                                                                  */ 00476300
*/*01* SIZE:  192 bytes                                              */ 00476800
*/*                                                                  */ 00477300
*/*01* CREATED BY:                                                   */ 00477800
*/*     IEESB601                                                     */ 00478300
*/*     IEESB606                                                     */ 00478800
*/*     IEFIB600                                                     */ 00479300
*/*                                                                  */ 00479800
*/*01* POINTED TO BY:                                                */ 00480300
*/*     TCBJSCB field of data area TCB                               */ 00480800
*/*     JSCBACT field of data area JSCB (active JSCB)                */ 00481800
*/*                                                                  */ 00482300
*/*01* SERIALIZATION:                                                */ 00482800
*/*     None required                                                */ 00483300
*/*                                                                  */ 00483800
*/*01* FUNCTION:                                                     */ 00484300
*/*02*  Communication of job or step related data items.  This is    */ 00484800
*/*     the base for the job step environment, in particular SWA     */ 00485300
*/*     and Allocation.                                              */ 00485800
*/*                                                                  */ 00486300
*/*01* METHOD OF ACCESS:                                             */ 00486800
*/*02*  ASM:    L     REG,TCBJSCB                                    */ 00499000
*/*             USING IEZJSCB,REG                                    */ 00511200
*/*                                                                  */ 00532500
*/*             WHERE REG IS ANY REGISTER OTHER THAN ZERO GIVES      */ 00553800
*/*             ADDRESSABILITY FOR ALL SYMBOLS.                      */ 00575100
*/*02*  PL/AS:                                                       */ 00580400
*/*             %INCLUDE SYSLIB(IKJTCB)                          @L1C*/ 00585700
*/*             %INCLUDE SYSLIB(IEZJSCB)                         @L1A*/ 00591000
*/*             Set %IEZJSCB_GENEQU='NO' if you want constants       */ 00592800
*/*              instead of the generated equates.                   */ 00594600
*/*                                                                  */ 00596400
*/*01* DELETED BY: IEFINSWD                                          */ 00646400
*/*                                                                  */ 00771000
*/*01* FREQUENCY: One per 'job step environment'                     */ 00779500
*/*                                                                  */ 00780700
*/*01* EXTERNAL CLASSIFICATION:                                  @P4A*/ 00780800
*/*02*    DMTI:  BASE                                                */ 00780900
*/*02*    PSPI:  FIELDS                                              */ 00781000
*/*                                                                  */ 00781100
*/*         JSCBPASS                                                 */ 00781200
*/*         JSCBAUTH                                                 */ 00781300
*/*02*    GUPI:  FIELDS                                              */ 00781400
*/*                                                                  */ 00782200
*/*         JSCBACT                                                  */ 00782700
*/*         JSCBPGMN                                                 */ 00783700
*/*         JSCBQMPI                                                 */ 00784200
*/*         JSCBSTEP                                                 */ 00785200
*/*                                                                  */ 00786200
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00786700
*/*                                                                  */ 00788100
*/*01* DEPENDENCIES:                                                 */ 00796600
*/*    - Changes to this macro should be reflected in IPCS           */ 00805100
*/*      model IEZMJSCB                                          @L3A*/ 00813600
*/*    - SVAs in this macro should be resolved to real addresses     */ 00822100
*/*      by using SWAREQ                                         @P2A*/ 00830600
*/*    - Most environments should use PSATOLD -> TCBJSCB -> JCSBACT  */ 00833400
*/*      to locate the 'Active JSCB'.                            @P2A*/ 00836200
*/*                                                                  */ 00836700
*/*01* NOTES:                                                        */ 00837200
*/*     The JSCB is also pointed to by the LCTJSCB field of data     */ 00837700
*/*     area LCT.                                                    */ 00838200
*/*                                                                  */ 00839100
*/*01* DISTRIBUTION LIBRARY:                                         */ 00847600
*/*                                                                  */ 00856100
*/*  CHANGE ACTIVITY = L1,OZ95568,OY01530,D1,OY19251,L2,L3,T1,01,    */ 00861800
*/*                    P4                                        @P4A*/ 00867500
*/* The above section of the change activity is no longer updated.   */ 00870400
*/*                                                                  */ 00873300
*/* $L1= SMSSTG2 JBB2223 860324 PDT4: STOR MGMT SUBSYS STG2 SUPT @L1A*/ 00876300
*/* $D1= DCR0023 JBB2223 861117 PDFF: DYNAMIC OUTPUT SUPPORT     @D1A*/ 00879300
*/* $T1= OY39346 JBB2223 901001 PDIB: ADDED FIELD JSCBRSWA       @T1A*/ 00880000
*/* $L2= EMVS2   HBB4410 881107 PDKK: CSCB VSCR                  @L2A*/ 00880800
*/* $P1= PEO3967 HBB4410 900328 PDH1: FIXED RESTRICTION LIFTED   @P1A*/ 00881500
*/* $L3= DDPERF  HBB4420 900406 PDDS: DDLPERFIPCS DD LIMIT           */ 00881700
*/*                                               PERFORMANCE    @L3A*/ 00881900
*/* $P2= PKB1814 HBB4430 920429 PDCC: 10X Defect Elimination     @P2A*/ 00882000
*/*                                   SHOWHDR format complete    @P2A*/ 00882100
*/* $01= OY55080 JBB2223 920423 PDIB: DELETED JSCBRSWA           @01A*/ 00882200
*/* $P4= PIG4009 HBB5510 930421 PDJY: Continuous Improvement PTM @P4A*/ 00883200
*/* $P5= PIG4163 HBB5510 930909 PDDZ: CDPI cleanup               @P5A*/ 00883700
*/* $L4= PR530   HBB6603 950415 PDXB: PL/X Constants             @L4A*/ 00883900
*/* $L5= ALLEN   HBB6606 971231 PDNN: DDLimit Support            @L5A*/ 00884000
*/* $L6=64BITALL HBB7703 981204 PD00XB: ESAME                    @L6A*/ 00884100
*/* $02= OW39838 HBB6601 990814 PDHB: Correct SMS Message processing.*/ 00884300
*/*                                   This is a PE of APAR OW38011.  */ 00884500
*/*                                                              @02A*/ 00884700
*/*                                                                  */ 00884900
*/*      CODE HAS BEEN ADDED FOR THE FOLLOWING SUPPORT               */ 00885300
*/*      CODES: @G860PB2, PCC0915, PCC1264, PCC1510          @ZMC1510*/ 00888300
*/*                                                                  */ 00891300
*/*  NOTE:                                                           */ 00894300
*/*      IN ADDITION TO THE MANDATORY USE OF THIS MACRO FOR          */ 00897300
*/*      REFERENCES TO THE JSCB, MODULES IN 0S/VS1 AND OS/VS2 WHICH  */ 00900300
*/*      ALLOCATE AND/OR FREE THE JSCB ARE REQUIRED TO USE THE       */ 00903300
*/*      GETJSCB AND FREEJSCB MACROS.                                */ 00906300
*/*                                                                  */ 00909300
*/* End of Specifications ********************************************/ 00912300
*/* JSCBECB1 - ADDRESS OF THE CANCEL ECB IN THE CSCB WHILE   @ZMC1510*/ 00915900
*/*            THE INITIATOR IS WAITING FOR A REGION. THIS   @ZMC1510*/ 00937200
*/*            IS THE FIRST ECB IN A LIST OF TWO ECBS.       @ZMC1510*/ 00958500
*/* JSCBECB2 - ADDRESS OF THE WAIT FOR REGION ECB WHILE THE  @ZMC1510*/ 00979800
*/*            INITIATOR IS WAITING FOR A REGION. THIS IS    @ZMC1510*/ 01001100
*/*            THE SECOND ECB IN A LIST OF TWO ECBS.         @ZMC1510*/ 01022400
*/*         THESE TWO ECBS OCCUPY THE SAME SPACE AS JSCBPGMN @ZMC1510*/ 01043700
*/*         SINCE ALL THE FIELDS ARE ONLY USED IN IEFSD263,  @ZMC1510*/ 01065000
*/*         AND THE ECBS ARE USED (IF NEEDED) BEFORE THE     @ZMC1510*/ 01086300
*/*         THE AREA IS REFERENCED AS JSCBPGMN.              @ZMC1510*/ 01107600
*/* JSCBALOC - ADDRESS OF THE ALLOCATION WORK AREA. THIS     @ZMC1264*/ 01128900
*/*            FIELD WAS MOVED TO PREVIOUSLY RESERVED FIELD  @ZMC1264*/ 01150200
*/*            WHICH REPLACED JSCBSWAB. THIS FIELD WAS AFTER @ZMC1264*/ 01171500
*/*            JSCBJRBA.                                     @ZMC1264*/ 01192800
*/* JSCBSECB - RESTORED. THIS FIELD NEEDS TO BE IN THE JSCB  @ZMC1264*/ 01214100
*/*            WHICH IS FIXED RATHER THAN IN THE LCT WHICH   @ZMC1264*/ 01235400
*/*            WHICH IS PAGEABLE. THE ECB NEEDS TO BE FIXED  @ZMC1264*/ 01256700
*/*            BECAUSE WHILE WAITING FOR A REGION, IF THE    @ZMC1264*/ 01278000
*/*            ECB IS IN PAGEABLE STORAGE IT COULD BE PAGED  @ZMC1264*/ 01299300
*/*            OUT TO GET THE NECESSARY SPACE FOR THE REGION.@ZMC1264*/ 01320600
*/* JSCBALOC - ADDRESS OF THE ALLOCATION WORK AREA. THIS     @ZMC0915*/ 01341900
*/*            FIELD REPLACES THE RESERVED FIELD MADE BY     @ZMC0915*/ 01363200
*/*            THE REMOVAL OF JSCBSECB.                      @ZMC0915*/ 01384500
*/* JSCBSECB - NO LONGER NEEDED. FIELD CHANGED TO RESERVED.  @G860PB2*/ 01405800
*/* JSCRIUCP - ADDRESS OF THE DYNAMIC ALLOCATION             @ZA95568*/ 01427100
*/*            COMMUNICATION TABLE                           @ZA95568*/ 01433100
*/* JSCBASW2 - ADDED POINTER TO THE ALLOCATION STAE WORKAREA     @L1A*/ 01439100
*/* JSCBJESW - ADDED ADDRESS OF A JES WORK AREA IN SUPPORT   @YA01530*/ 01445100
*/*            OF JES3 PTM PB50691                           @YA01530*/ 01451100
*/* JSCBODNO - A COUNTER USED BY DYNAMIC OUTPUT TO GENERATE      @D1A*/ 01457100
*/*            OUTPUT DESCRIPTOR NAMES.                          @D1A*/ 01463100
*/* JSCAMCPL - A DEFINED NEW FIELD TO CONTAIN THE ALLOCATION @YA19251*/ 01464700
*/*            MESSAGE CELLPOOL ID IN SUPPORT OF OY15987     @YA19251*/ 01466300
*/*            REPLACES RESERVED FIELD JSCRSV52.             @YA19251*/ 01467900
*/*                                                              @L2A*/ 01468500
*/* A - ADDED JSCBCSCX FIELD TO STORE AMODE24 EXTENSION OF CSCB  @L2A*/ 01469100
*/* C - JSCBSECB COMMENT BECAUSE REQUIREMENT THAT THE            @P1A*/ 01469200
*/*     ECB MUST BE IN FIXED STORAGE HAS BEEN LIFTED AND IS NO   @P1A*/ 01469300
*/*     LONGER A REQUIREMENT.                                    @P1A*/ 01469400
*/* A - ADDED DEPENDENCY NOTE FOR IPCS CONTROL BLOCK MODEL       @L3A*/ 01473700
*/* C - CHANGED JSCRIUCP TO JSCRSV34 BECAUSE FIELD IS NO LONGER  @L3A*/ 01478000
*/*     USED                                                     @L3A*/ 01482300
*/* JSCBRSWA - A DEFINED NEW FIELD TO INDICATE IF SWA            @T1A*/ 01483700
*/*            ALLOCATIONS AND DELETIONS ARE TO BE ALLOWED       @T1A*/ 01485100
*/* C - Changed appropriate TTRs to SVAs, removed JSCBTTTR       @P2A*/ 01485800
*/* JSCBRSWA - CHANGED JSCBRSWA TO RESERVED                      @01A*/ 01486200
*/* C - Changed bits JSCBRV04 and JSCBRV05 to be JSCBSJFY and    @P4A*/ 01486300
*/*     JSCBSJFN, respectively.                                  @P4A*/ 01486400
*/* A - CDPI changes                                             @P4A*/ 01486500
*/* C - Removed JSCDSABQ from list of intended fields            @P5A*/ 01488000
*/* A - Added IEZJSCB_GENEQU support, so users could get PL/X    @L4A*/ 01488500
*/*     constants instead of GEN'd equates                       @L4A*/ 01489000
*/* C - Changed JSCRSV34 to JSCDSNQP for the DD Limit Support    @L5A*/ 01489200
*/* C - Changed Reserved bit JSCRSV18 to JSCBBMO (Buffer Messages    */ 01489400
*/*     Only).  Initialized, set, and reinitialized by IEFAB4B2 and  */ 01489600
*/*     used by IEEAB400 to avoid issuing a WTO when IEFAB4B2 has    */ 01489800
*/*     already issued the WTO for a message when Monitor Status     */ 01490000
*/*     is active.                                               @02A*/ 01490200
*                                                                       01490400
*%GOTO JSCBL2;  /*                                                      01491000
*                                                                       01512300
IEZJSCB  DSECT                                                          01533600
         ORG   IEZJSCB+188 -  ALLOWS ADDRESSABILITY FROM TCBJSCB        01554900
         SPACE                                                          01576200
*********************************************************************** 01600001
*                                                                     * 02000001
*  SECTION 1   DATA ITEMS USED IN OS/VS1 AND OS/VS2                   * 02400000
*                                                                     * 02800001
*********************************************************************** 07200001
JSCBSEC1 EQU   * -            START OF JSCB SECTION 1                   10800001
         SPACE                                                          11200001
JSCRSV01 DS    F -            RESERVED                                  11202900
JSCHPCE  DS    0A -           ADDRESS OF OPTIONAL JOB ENTRY SUBSYSTEM   11205800
*                             (JES) PROCESSOR CONTROL ELEMENT    ICB459 11208700
JSCRSV32 DS    X -            RESERVED                           ICB459 11211600
JSCHPCEA DS    AL3 -          ADDRESS OF OPTIONAL JOB ENTRY SUBSYSTEM   11214500
*                             (JES) PROCESSOR CONTROL ELEMENT    ICB459 11217400
JSCBSHR  DS    A -            ADDRESS OF ASSEMBLY CHAIN (VSAM)   ICB434 11220300
JSCBTCP  DS    A -            ADDRESS OF TIOT CHAINING ELEMENT CHAIN    11223200
*                             (VSAM)                             ICB434 11226100
JSCBPCC  DS    A -            ADDRESS OF PRIVATE CATALOG CONTROL BLOCK  11229000
*                             CHAIN (VSAM)                       ICB434 11231900
JSCBTCBP DS    A -            ADDRESS OF INITIATOR'S TCB (VSAM)  ICB434 11234800
JSCBIJSC DS    A -            ADDRESS OF JSCB OF THE INITIATOR THAT     11237700
*                             ATTACHED THIS JOB STEP (OS/VS1)    MDC003 11240600
JSCBDBTB DS    A -            ADDRESS OF THE DEB TABLE FOR THIS JOB     11243500
*                             STEP  (OS/VS1)                     MDC029 11246400
JSCBID   DS    CL4 -          JOB SERIAL NUMBER (OS/VS1)                11250000
JSCBDCB  DS    0A -           ADDRESS OF DCB FOR DATA SET CONTAINING    11300001
*                             SCHEDULER TABLES FOR THIS JOB             11350001
JSCRSV02 DS    X -            RESERVED                                  11369100
JSCBDCBA DS    AL3 -          ADDRESS OF DCB FOR DATA SET CONTAINING    11388200
*                             SCHEDULER TABLES FOR THIS JOB             11407300
JSCBSTEP DS    FL1 -          CURRENT STEP NUMBER.  THE FIRST STEP IS   11426400
*                             NUMBER 1.                                 11445500
JSCRSV03 DS    XL3 -          RESERVED                                  11464600
JSCBSECB DS    A -            ECB FOR COMMUNICATION BETWEEN    @ZMC1264 11483700
*                             MAIN STORAGE SUPERVISOR AND THE  @ZMC1264 11502800
*                             INITIATOR WHILE WAITING FOR A    @ZMC1264 11521900
*                             REGION.                              @P1C 11541000
*                                                                  @P1D 11560100
JSCBOPTS DS    B -            OPTION SWITCHES                           11580001
JSCRSV04 EQU   X'80',,C'X' -  RESERVED                                  11581400
JSCRSV05 EQU   X'40',,C'X' -  RESERVED                                  11582800
JSCBLONG EQU   X'20' -        THE PARTITION CANNOT BE REDEFINED BECAUSE 11584200
*                             THE JOB OCCUPYING IT IS DEFINED AS LONG   11585600
*                             RUNNING  (OS/VS1)                  ICB351 11587000
JSCRSV06 EQU   X'10',,C'X' -  RESERVED                                  11588400
JSCRSV07 EQU   X'08',,C'X' -  RESERVED                                  11589800
JSCRSV08 EQU   X'04',,C'X' -  RESERVED                                  11591200
JSCSIOTS EQU   X'02' -        CHECKPOINT MUST SCAN SIOT          MDC018 11592600
JSCBAUTH EQU   X'01' -        THE STEP REPRESENTED BY THIS JSCB IS      11594001
*                             AUTHORIZED TO ISSUE THE MODESET MACRO     11596001
*                             INSTRUCTION.                              11612600
*                             ALTHOUGH THIS BIT HAS BEEN DESIGNATED     11629200
*                             PSPI, IBM RECOMMENDS THAT VERY CAREFUL    11645800
*                             DESIGN CONSIDERATION BE GIVEN TO IT'S     11662400
*                             USE.                                 @P4C 11679000
JSCRSV10 DS    XL3 -          RESERVED                           ICB351 11696000
JSCRSV17 DS    XL3 -          Reserved                             @P2C 11746000
JSCBSWT1 DS    B -            STATUS SWITCHES  (OS/VS2)          ICB351 11846000
JSCBPASS EQU   X'80' -        WHEN THIS BIT IS SET TO ONE AND A         11896000
*                             CORRESPONDING BIT IN THE DCB IS SET TO    11946000
*                             ONE, OPEN WILL BYPASS PASSWORD            11996000
*                             PROTECTION FOR THE DATA SET BEING OPENED  12046000
*                             (OS/VS2).                                 12062600
*                             ALTHOUGH THIS BIT HAS BEEN DESIGNATED     12079200
*                             PSPI, IBM RECOMMENDS THAT VERY CAREFUL    12095800
*                             DESIGN CONSIDERATION BE GIVEN TO IT'S     12112400
*                             USE.                                 @P4C 12129000
JSCRSV11 EQU   X'40',,C'X' -  RESERVED                                  12146000
JSCRSV12 EQU   X'20',,C'X' -  RESERVED                                  12196000
JSCRSV13 EQU   X'10',,C'X' -  RESERVED                                  12246000
JSCRSV14 EQU   X'08',,C'X' -  RESERVED                                  12296000
JSCRSV15 EQU   X'04',,C'X' -  RESERVED                                  12346000
JSCRSV16 EQU   X'02',,C'X' -  RESERVED                             @01C 12396000
JSCBPMSG EQU   X'01' -        A MESSAGE HAS BEEN ISSUED BECAUSE THE     12446000
*                             DUMP DATA SET WAS NOT SUCCESSFULLY        12496000
*                             OPENED.  PREVENTS USE OF MULTIPLE SMB'S   12546000
*                             FOR MULTIPLE OPEN FAILURES IN JOB STEP.   12596000
*                             (OS/VS2)                           ICB351 12646000
JSCBQMPI DS    A -            ADDRESS OF THE QUEUE MANAGER PARAMETER    12696000
*                             AREA (QMPA) FOR THE JOB'S INPUT QUEUE     12746000
*                             TABLE ENTRIES   (OS/VS2)                  12796000
JSCBJESW DS    A -            ADDRESS OF THE JES WORKAREA      @YA01530 12846000
JSCBWTP  DS    0CL4 -         WRITE-TO-PROGRAMMER (WTP) DATA            12896000
JSCBWTFG DS    B -            FLAGS USED BY WTP SUPPORT                 12946000
JSCBIOFG EQU   X'80' -        THE PREVIOUS WTP I/O OPERATION HAD AN     12996000
*                             I/O ERROR                                 13046000
JSCBRET  EQU   X'40' -        TEXT BREAKING INDICATOR, ADDITIONAL       13096000
*                             MESSAGE TEXT SCANNING REQUIRED            13146000
*                             (OS/VS1)                           ICB470 13196000
JSCBBMO  EQU   X'20' -              Buffer Messages Only flag.  Set     13207100
*                                   by IEFAB4B2 when an SMS Message     13218200
*                                   is being processed that is being    13229300
*                                   directed to the Programmer when     13240400
*                                   Monitor Status is active.           13251500
*                                   Checked by IEEAB400 to avoid a      13262600
*                                   WTO that was already issued by      13273700
*                                   IEFAB4B2.                      @02C 13284800
JSCRSV19 EQU   X'10',,C'X' -  RESERVED                                  13296000
JSCRSV20 EQU   X'08',,C'X' -  RESERVED                                  13346000
JSCRSV21 EQU   X'04',,C'X' -  RESERVED                                  13396000
JSCRSV22 EQU   X'02',,C'X' -  RESERVED                                  13446000
JSCRSV23 EQU   X'01',,C'X' -  RESERVED                                  13496000
JSCBWTSP DS    FL1 -          NUMBER OF THE LAST JOB STEP TO ISSUE WTP  13546000
JSCBPMG  DS    H -            NUMBER OF WTP OPERATIONS ISSUED FOR THE   13596000
*                             STEP IDENTIFIED BY JSCBWTSP               13646000
JSCBCSCB DS    A -            ADDRESS OF COMMAND SCHEDULING CONTROL     13696000
*                             BLOCK (CSCB) USED TO PROCESS COMMANDS     13746000
*                             RECEIVED FOR THIS JOB STEP         ICB351 13796000
         SPACE                                                          16800001
JSCBS1LN EQU   (*-JSCBSEC1) - LENGTH OF SECTION 1                       17200001
         SPACE                                                          17600001
*********************************************************************** 29600000
*                                                                     * 30000000
*  SECTION 2   DATA ITEMS USED ONLY IN OS/VS1                         * 30400000
*                                                                     * 30800000
*********************************************************************** 31200000
JSCBSEC2 EQU   * -            START OF JSCB SECTION 2            ICB351 32000001
         SPACE                                                          32400001
*  CURRENTLY NO OS/VS1 ONLY DATA ITEMS                           ICB351 32800000
         SPACE                                                          33200001
JSCBS2LN EQU   (*-JSCBSEC2) - LENGTH OF SECTION 2                ICB351 33600001
         SPACE                                                          34000001
*********************************************************************** 34400000
*                                                                     * 34800000
*  SECTION 3   DATA ITEMS USED ONLY IN OS/VS2                         * 35200000
*                                                                     * 35600000
*********************************************************************** 36000000
         ORG   JSCBSEC2 -                                        ICB351 36400001
JSCBSEC3 EQU   * -            START OF JSCB SECTION 3            ICB351 36800001
         SPACE                                                          37200001
JSCBJCT  DS    0F -           Structure containing SVA of JCT      @P2C 37237500
JSCRSV24 DS    X -            RESERVED                           ICB351 37275000
JSCJCTP  DS    0CL3 -         ALIAS FOR JSCBJCTA                 MDC025 37312500
JSCBJCTA DS    CL3 -          SVA of JCT, use SWAREQ to convert    @P2C 37362500
*                             to a pointer                         @P2A 37412500
JSCBPSCB DS    A -            ADDRESS OF TSO PROTECTED STEP CONTROL     37600001
*                             BLOCK                                     38000001
JSCBASID DS    0H -           ADDRESS SPACE IDENTIFIER (MDC028)  YM0446 38050000
JSCBTJID DS    H -            TSO TERMINAL JOB IDENTIFIER               38400001
JSCBFBYT DS    B -            FLAG BYTE  (MDC300)              @Z40RP9A 38450000
JSCBRV01 EQU   X'80',,C'X' -  RESERVED                                  38500000
JSCBADSP EQU   X'40' -        AUTOMATIC DATA SET PROTECTION FOR THIS    38550000
*                             USER  (MDC302)                   @Z40RP9A 38600000
JSCBRV02 EQU   X'20',,C'X' -  RESERVED                                  38650000
JSCBRV03 EQU   X'10',,C'X' -  RESERVED                                  38700000
JSCBSJFY EQU   X'08'       -  Used by BB131                        @P4C 38750000
JSCBSJFN EQU   X'04'       -  Used by BB131                        @P4C 38800000
JSCBRV06 EQU   X'02',,C'X' -  RESERVED                                  38850000
JSCBRV07 EQU   X'01',,C'X' -  RESERVED                                  38900000
JSCBRV08 DS    X -            RESERVED                                  38950000
JSCBIECB DS    F -            ECB USED FOR COMMUNICATION BETWEEN        39200001
*                             DYNAMIC ALLOCATION AND THE INITIATOR      39600001
*                             IN ORDER TO PERFORM DATA SET INTEGRITY    40000001
JSCBJRBA DS    CL8 -          JOB JOURNAL RELATIVE BYTE ADDRESS (RBA)   40005300
*                             (MDC031)                           YM7086 40010600
JSCBALOC DS    A -            ADDRESS OF THE ALLOCATION WORK   @ZMC1264 40015900
*                             AREA                             @ZMC1264 40021200
JSCBJNL  DS    0A -           INITIATOR JSCB ONLY - ADDRESS OF JSCB     40026500
*                             FOR STEP BEING INITIATED.  OTHERWISE,     40031800
*                             ZERO                               ICB431 40037100
JSCBJJSB DS    B -            JOB JOURNAL STATUS INDICATORS      ICB332 40042400
JSCBJNLN EQU   X'80' -        NOTHING SHOULD BE WRITTEN IN              40047700
*                             JOURNAL                            ICB332 40053000
JSCBJNLF EQU   X'40' -        NO JOB JOURNAL                     MDC017 40058300
JSCBJNLE EQU   X'20' -        ERROR IN JOURNAL, DO NOT WRITE     ICB332 40063600
*        EQU   X'10' -        RESERVED (WAS JSCBJSBJ)            MDC001 40068900
JSCBJSBI EQU   X'08' -        JOB HAS NOT ENTERED ALLOCATION FOR THE    40074200
*                             FIRST TIME                         ICB332 40079500
JSCBJSBA EQU   X'04' -        JOB HAS ENTERED ALLOCATION         ICB332 40084800
JSCBJSBX EQU   X'02' -        JOB HAS COMPLETED ALLOCATION       ICB332 40090100
JSCBJSBT EQU   X'01' -        JOB HAS ENTERED TERMINATION        ICB332 40095400
JSCBJNLA DS    AL3 -          INITIATOR JSCB ONLY - ADDRESS OF JSCB     40100700
*                             FOR STEP BEING INITIATED.  OTHERWISE,     40106000
*                             ZERO                               ICB431 40111300
JSCBJNLR DS    A -            POINTER TO JOB JOURNAL RPL         MDC023 40116600
JSCBSMLR DS    A -            ADDRESS OF SYSTEM MESSAGE DATA            40121900
*                             SET RPL                            MDC024 40127200
JSCBSUB  DS    0A -           ADDRESS OF JES-SUBTL FOR THIS JOB         40132500
*                             STEP                               ICB333 40137800
JSCRSV31 DS    X -            RESERVED                           ICB333 40143100
JSCBSUBA DS    AL3 -          ADDRESS OF JES-SUBTL FOR THIS JOB         40148400
*                             STEP                               ICB333 40153700
JSCBSONO DS    H -            THE NUMBER OF SYSOUT DATA SETS PLUS       40159000
*                             ONE                                ICB335 40164300
JSCRSV28 DS    H -            RESERVED                                  40169600
JSCBFRBA DS    CL8 -          RELATIVE BYTE ADDRESS (RBA) OF THE FIRST  40174900
*                             JOURNAL BLOCK  (MDC032)            YM7086 40180200
JSCBSSIB DS    A -            ADDRESS OF THE SUBSYSTEM IDENTIFICATION   40185500
*                             BLOCK                              MDC021 40190800
JSCDSABQ DS    A -            ADDRESS OF QDB FOR DSAB CHAIN      MDC007 40196100
JSCBASW2 DS    A -            POINTER TO THE ALLOCATION STAE WORK AREA  40199600
*                                                                  @L1C 40203100
JSCSCT   DS    0F -           Structure containing SVA of SCT      @P2C 40206700
JSCRSV55 DS    XL1 -          RESERVED                                  40212000
JSCSCTP  DS    CL3 -          SVA of SCT, use SWAREQ to convert    @P2C 40215500
*                             to a pointer                         @P2A 40219000
JSCTMCOR DS    A -            ADDRESS OF TIOT MAIN STORAGE MANAGEMENT   40222600
*                             AREA                               MDC010 40227900
JSCBVATA DS    A -            ADDRESS OF VAT USED DURING SYSTEM RESTART 40233200
*                             OR AUTOMATIC RESTART               MDC011 40238500
JSCDDNNO DS    H -            COUNTER USED BY DYNAMIC ALLOCATION TO     40243800
*                             GENERATE DD NAMES                  MDC012 40249100
JSCBODNO DS    H -            COUNTER USED BY DYNAMIC OUTPUT TO    @D1C 40251200
*                             GENERATE OUTPUT DESCRIPTOR NAMES.    @D1C 40253300
*                             THIS NUMBER INCREASES OVER THE LIFE  @D1C 40255400
*                             OF THE JOB AND WRAPS.                @DIC 40257500
JSCDDNUM DS    H -            NUMBER OF DD ENTRIES CURRENTLY ALLOCATED  40259700
*                             INCLUDING IN USE AND NOT IN USE ENTRIES   40265000
*                                                                MDC022 40270300
JSCRSV33 DS    X -            RESERVED                           MDC019 40275600
JSCBSWSP DS    FL1 -          SWA SUBPOOL                        MDC015 40280900
JSCBACT  DS    A -            POINTER TO ACTIVE JSCB             MDC014 40286200
JSCBUFPT DS    A -            ADDRESS OF ALLOCATION/UNALLOCATION        40291500
*                             WRITE-TO-PROGRAMMER BUFFER         MDC030 40296800
JSCBASWA DS    A -            POINTER TO THE LAST ALLOCATION ESTAE WORK 40302100
*                             AREA  (MDC303)                   @Z40FP9A 40307400
JSCBPGMN DS    0CL8 -         JOB STEP PROGRAM NAME  (MDC304)  @G64RP9A 40312700
JSCBECB1 DS    A -            ADDR OF CANCEL ECB WHILE         @ZMC1510 40318000
*                             WAITING FOR A REGION (IEFSD363)  @ZMC1510 40323300
JSCBECB2 DS    A -            ADDR OF WAIT FOR REGION ECB      @ZMC1510 40328600
*                             WHILE WAITING FOR A REGION       @ZMC1510 40333900
*                             (IEFSD263)                       @ZMC1510 40339200
JSCDSNQP DS    A -            Pointer to the first DSENQ Table     @L5C 40351500
JSCBCSCX DS    A -            ADDRESS OF CSCX EXTENSION TO CSCB    @L2C 40363900
*                                                                 6@L2D 40378000
JSCAMCPL DS    F -            ALLOCATION MESSAGE CELLPOOL ID   @YC19251 40392200
         SPACE                                                          40400001
JSCBS3LN EQU   (*-JSCBSEC3) - LENGTH OF SECTION 3                ICB351 40800001
         SPACE                                                          41200001
*********************************************************************** 41600000
         SPACE                                                          42000001
JSCBDISP EQU   (260-JSCBS1LN) -    DISPLACEMENT OF FIRST JSCB DATA BYTE 42400001
JSCBAOS1 EQU   JSCBS1LN+JSCBS2LN - OS/VS1 JSCB LENGTH            ICB351 42800000
JSCBAOS2 EQU   JSCBS1LN+JSCBS3LN - OS/VS2 JSCB LENGTH            ICB332 43200000
*********************************************************************** 43600001
*              END OF JSCB                                              44000001
         MEND  , */                                                     44400001
*%JSCBL2:;                                                              44450000
*DECLARE                                                                50050001
*  1 IEZJSCB  BASED(TCBJSCB) BDY(WORD),  /* JOB STEP CONTROL BLOCK   */ 50100000
*                                                                       50800001
*   2 *           CHAR(188),             /* ALLOWS ADDRESSABILITY       51250000
*                                           FROM TCBJSCB             */ 51600001
*                                                                       52000001
*/********************************************************************/ 52400000
*/*                                                                  */ 52800001
*/*SECTION 1   DATA ITEMS USED IN OS/VS1 AND OS/VS2                  */ 53200000
*/*                                                                  */ 53600001
*/********************************************************************/ 54000000
*                                                                       54400001
*   2 JSCBSEC1 BDY(WORD),                /* JSCB SECTION 1           */ 54416700
*    3 JSCRSV01    FIXED(31),            /* RESERVED                 */ 54433400
*    3 JSCHPCE     PTR(31),              /* ADDRESS OF OPTIONAL JOB     54450100
*                                           ENTRY SUBSYSTEM (JES)       54466800
*                                           PROCESSOR CONTROL           54483500
*                                           ELEMENT            ICB459*/ 54500200
*     4 JSCRSV32    CHAR(1),             /* RESERVED           ICB459*/ 54516900
*     4 JSCHPCEA    PTR(24),             /* SAME AS JSCHPCE ABOVE       54533600
*                                                              ICB459*/ 54550300
*    3 JSCBSHR     PTR(31),              /* ADDRESS OF ASSEMBLY CHAIN   54567000
*                                           (VSAM)             ICB434*/ 54583700
*    3 JSCBTCP     PTR(31),              /* ADDRESS OF TIOT CHAINING    54600400
*                                           ELEMENT CHAIN (VSAM)        54617100
*                                                              ICB434*/ 54633800
*    3 JSCBPCC     PTR(31),              /* ADDRESS OF PRIVATE          54650500
*                                           CATALOG CONTROL BLOCK       54667200
*                                           CHAIN (VSAM)       ICB434*/ 54683900
*    3 JSCBTCBP    PTR(31),              /* ADDRESS OF INITIATOR'S      54700600
*                                           TCB (VSAM)         ICB434*/ 54717300
*    3 JSCBIJSC    PTR(31),              /* ADDRESS OF JSCB OF THE      54734000
*                                           INITIATOR THAT ATTACHED     54750700
*                                           THIS JOB STEP (OS/VS1)      54767400
*                                                              MDC003*/ 54784100
*    3 JSCBDBTB    PTR(31),              /* ADDRESS OF THE DEB TABLE    54800800
*                                           FOR THIS JOB STEP           54817500
*                                           (OS/VS1)           MDC029*/ 54834200
*    3 JSCBID      CHAR(4) BDY(WORD),    /* JOB SERIAL NUMBER           54846100
*                                           (OS/VS1)                 */ 54858000
*    3 JSCBDCB     PTR(31),              /* ADDRESS OF DCB FOR DATA     54870001
*                                           SET CONTAINING SCHEDULER    54950001
*                                           TABLES FOR THIS JOB      */ 55000001
*     4 JSCRSV02    CHAR(1),             /* RESERVED                 */ 55060000
*     4 JSCBDCBA    PTR(24),             /* SAME AS JSCBDCB ABOVE    */ 55070001
*    3 JSCBSTEP    PTR(8),               /* CURRENT STEP NUMBER.  THE   55094500
*                                           FIRST STEP IS NUMBER 1.  */ 55119000
*    3 JSCRSV03    CHAR(3),              /* RESERVED                 */ 55143500
*    3 JSCBSECB    PTR(31),              /* ECB FOR COMMUNUCATION       55168000
*                                           BETWEEN MAIN STORAGE        55192801
*                                           SUPERVISOR AND THE          55193201
*                                           INITIATOR WHILE WAITING     55193400
*                                           FOR A REGION.        @P1C*/ 55193900
*    3 JSCBOPTS    BIT(8),               /* OPTION SWITCHES          */ 55194401
*     4 JSCRSV04 BIT(1),                 /* RESERVED                 */ 55194600
*     4 JSCRSV05 BIT(1),                 /* RESERVED                 */ 55194800
*     4 JSCBLONG BIT(1),                 /* THE PARTITION CANNOT BE     55195000
*                                           REDEFINED BECAUSE THE JOB   55195200
*                                           OCCUPYING IT IS DEFINED     55195400
*                                           AS LONG RUNNING             55195600
*                                           (OS/VS1)           ICB351*/ 55195800
*     4 JSCRSV06 BIT(1),                 /* RESERVED                 */ 55196000
*     4 JSCRSV07 BIT(1),                 /* RESERVED                 */ 55196200
*     4 JSCRSV08 BIT(1),                 /* RESERVED                 */ 55196400
*     4 JSCSIOTS BIT(1),                 /* CHECKPOINT MUST SCAN SIOT   55196600
*                                                              MDC018*/ 55196800
*     4 JSCBAUTH BIT(1),                 /* STEP REPRESENTED BY THIS    55197801
*                                           JSCB IS AUTHORIZED TO       55199601
*                                           ISSUE THE MODESET MACRO     55249600
*                                           INSTRUCTION.  ALTHOUGH      55262100
*                                           THIS BIT HAS BEEN           55274600
*                                           DESIGNATED PSPI, IBM        55287100
*                                           RECOMMENDS THAT VERY        55299600
*                                           CAREFUL DESIGN              55312100
*                                           CONSIDERATION BE GIVEN TO   55324600
*                                           IT'S USE.            @P4C*/ 55337100
*    3 JSCRSV10    CHAR(3),              /* RESERVED                 */ 55349600
*    3 JSCRSV17    CHAR(3) BDY(WORD),    /* Reserved             @P2C*/ 55399600
*    3 JSCBSWT1    BIT(8),               /* STATUS SWITCHES             55549600
*                                           (OS/VS2)           ICB351*/ 55599600
*     4 JSCBPASS BIT(1),                 /* WHEN THIS BIT IS SET TO     55649600
*                                           ONE AND A CORRESPONDING     55699600
*                                           BIT IN THE DCB IS SET TO    55749600
*                                           ONE, OPEN WILL BYPASS       55799600
*                                           PASSWORD PROTECTION FOR     55849600
*                                           THE DATA SET BEING OPENED   55899600
*                                           (OS/VS2).                   55912100
*                                           ALTHOUGH THIS               55924600
*                                           BIT HAS BEEN DESIGNATED     55937100
*                                           PSPI, IBM RECOMMENDS THAT   55949600
*                                           VERY CAREFUL DESIGN         55962100
*                                           CONSIDERATION BE GIVEN TO   55974600
*                                           IT'S USE.            @P4C*/ 55987100
*     4 JSCRSV11 BIT(1),                 /* RESERVED (OS/VS2)  ICB351*/ 55999600
*     4 JSCRSV12 BIT(1),                 /* RESERVED (OS/VS2)  ICB351*/ 56049600
*     4 JSCRSV13 BIT(1),                 /* RESERVED (OS/VS2)  ICB351*/ 56099600
*     4 JSCRSV14 BIT(1),                 /* RESERVED (OS/VS2)  ICB351*/ 56149600
*     4 JSCRSV15 BIT(1),                 /* RESERVED (OS/VS2)  ICB351*/ 56199600
*     4 JSCRSV16 BIT(1),                 /* RESERVED             @01C*/ 56249600
*     4 JSCBPMSG BIT(1),                 /* A MESSAGE HAS BEEN ISSUED   56299600
*                                           BECAUSE THE DUMP DATA SET   56349600
*                                           WAS NOT SUCCESSFULLY        56399600
*                                           OPENED.  PREVENTS USE OF    56449600
*                                           MULTIPLE SMB'S FOR          56499600
*                                           MULTIPLE OPEN FAILURES IN   56549600
*                                           JOB STEP (OS/VS2)  ICB351*/ 56599600
*    3 JSCBQMPI    PTR(31),              /* ADDRESS OF THE QUEUE        56649600
*                                           MANAGER PARAMETER AREA      56699600
*                                           (QMPA) FOR THE JOB'S        56749600
*                                           INPUT QUEUE TABLE ENTRIES   56799600
*                                           (OS/VS2)                 */ 56849600
*    3 JSCBJESW    PTR(31),              /* ADDRESS OF THE JES          56899600
*                                           WORKAREA         @YA01530*/ 56949600
*    3 JSCBWTP     CHAR(4) BDY(WORD),    /* WRITE-TO-PROGRAMMER (WTP)   56999600
*                                           DATA                     */ 57049600
*     4 JSCBWTFG    BIT(8),              /* FLAGS USED BY WTP SUPPORT*/ 57099600
*      5 JSCBIOFG BIT(1),                /* THE PREVIOUS WTP I/O        57149600
*                                           OPERATION HAD AN I/O        57199600
*                                           ERROR                    */ 57249600
*      5 JSCBRET  BIT(1),                /* TEXT BREAKING INDICATOR,    57299600
*                                           ADDITIONAL MESSAGE TEXT     57349600
*                                           SCANNING REQUIRED           57399600
*                                           (OS/VS1)           ICB470*/ 57449600
*      5 JSCBBMO  BIT(1),         /* Buffer Messages Only flag.  Set    57460700
*                                    by IEFAB4B2 when an SMS Message    57471800
*                                    is being processed that is being   57482900
*                                    directed to the Programmer when    57494000
*                                    Monitor Status is active.          57505100
*                                    Checked by IEEAB400 to avoid a     57516200
*                                    WTO that was already issued by     57527300
*                                    IEFAB4B2.                   @02C*/ 57538400
*      5 JSCRSV19 BIT(1),                /* RESERVED                 */ 57549600
*      5 JSCRSV20 BIT(1),                /* RESERVED                 */ 57599600
*      5 JSCRSV21 BIT(1),                /* RESERVED                 */ 57649600
*      5 JSCRSV22 BIT(1),                /* RESERVED                 */ 57699600
*      5 JSCRSV23 BIT(1),                /* RESERVED                 */ 57749600
*     4 JSCBWTSP    PTR(8),              /* NUMBER OF THE LAST JOB      57799600
*                                           STEP TO ISSUE WTP        */ 57849600
*     4 JSCBPMG     FIXED(15),           /* NUMBER OF WTP OPERATIONS    57899600
*                                           ISSUED FOR THE STEP         57949600
*                                           IDENTIFIED BY JSCBWTSP   */ 57999600
*    3 JSCBCSCB    PTR(31),              /* ADDRESS OF COMMAND          58049600
*                                           SCHEDULING CONTROL BLOCK    58099600
*                                           (CSCB) USED TO PROCESS      58149600
*                                           COMMANDS RECEIVED FOR       58199600
*                                           THIS JOB STEP      ICB351*/ 58249600
*   2 JSCBEND1    CHAR(0) BDY(WORD);     /* END OF SECTION 1         */ 58299600
*                                                                       65600001
*/********************************************************************/ 79600000
*/*                                                                  */ 80000001
*/*SECTION 2   DATA ITEMS USED ONLY IN OS/VS1                        */ 80400000
*/*                                                                  */ 80800001
*/********************************************************************/ 81200000
*                                                                       81600001
*DECLARE                                                                81650001
*%IF IKEPLS='2'  %THEN                                                  81700000
*    %GOTO JSCBA1;                                                      81750000
*  1 JSCBSEC2 BASED(ADDR(JSCBEND1)) BDY(WORD),                          81800000
*%GOTO JSCBA2;                                                          81850000
*%JSCBA1 : ;                                                            81900000
*  1 JSCBSEC2 DEF(JSCBEND1) BDY(WORD),                                  81950000
*%JSCBA2 : ;                                                            82000000
*                                                                       82400001
*              /* CURRENTLY NO OS/VS1 ONLY DATA ITEMS EXIST */          82800000
*                                                                       83200001
*   2 JSCBEND2    CHAR(0) BDY(WORD);     /* END OF SECTION 2   ICB351*/ 83250000
*                                                                       84000001
*/********************************************************************/ 84400000
*/*                                                                  */ 84800001
*/*SECTION 3   DATA ITEMS USED ONLY IN OS/VS2                        */ 85200000
*/*                                                                  */ 85600001
*/********************************************************************/ 86000000
*                                                                       86400001
*DECLARE                                                                86450001
*%IF IKEPLS='2'  %THEN                                                  86500000
*    %GOTO JSCBA3;                                                      86550000
*  1 JSCBSEC3 BASED(ADDR(JSCBEND1)) BDY(WORD),                          86600000
*%GOTO JSCBA4;                                                          86650000
*%JSCBA3 : ;                                                            86700000
*  1 JSCBSEC3 DEF(JSCBEND1) BDY(WORD),                                  86750000
*%JSCBA4 : ;                                                            86800000
*                                                                       87200001
*   2 JSCBJCT     CHAR(4) BDY(WORD),     /* Structure containing SVA of 87233300
*                                           JCT                  @P2C*/ 87266600
*    3 JSCRSV24    CHAR(1),              /* RESERVED           ICB351*/ 87300000
*    3 JSCBJCTA    CHAR(3),              /* SVA of job JCT, use SWAREQ  87318700
*                                           to convert to a pointer     87337400
*                                                                @P2C*/ 87356100
*     4 JSCJCTP     CHAR(3),             /* ALIAS FOR JSCBJCTA MDC025*/ 87375000
*   2 JSCBPSCB    PTR(31),               /* ADDRESS OF TSO PROTECTED    87400001
*                                           STEP CONTROL BLOCK       */ 88000001
*   2 JSCBASID    FIXED(15),             /* ADDRESS SPACE IDENTIFIER    88050000
*                                           (MDC028)           YM0446*/ 88100000
*    3 JSCBTJID    FIXED(15),            /* TSO TERMINAL JOB            88150000
*                                           IDENTIFIER               */ 88900001
*   2 JSCBFBYT    BIT(8),                /* FLAG BYTE                   88950000
*                                           (MDC300)         @Z40RP9A*/ 89000000
*    3 JSCBRV01 BIT(1),                  /* RESERVED                 */ 89050000
*    3 JSCBADSP BIT(1),                  /* AUTOMATIC DATA SET          89100000
*                                           PROTECTION FOR THIS USER    89150000
*                                           (MDC302)         @Z40RP9A*/ 89200000
*    3 JSCBRV02 BIT(1),                  /* RESERVED                 */ 89250000
*    3 JSCBRV03 BIT(1),                  /* RESERVED                 */ 89300000
*    3 JSCBSJFY BIT(1),                  /* Used by BB131        @P4C*/ 89350000
*    3 JSCBSJFN BIT(1),                  /* Used by BB131        @P4C*/ 89400000
*    3 JSCBRV06 BIT(1),                  /* RESERVED                 */ 89450000
*    3 JSCBRV07 BIT(1),                  /* RESERVED                 */ 89500000
*   2 JSCBRV08    CHAR(1),               /* RESERVED                 */ 89550000
*   2 JSCBIECB    FIXED(31),             /* ECB USED FOR COMMUNICATION  90450001
*                                           BETWEEN DYNAMIC ALLOCATION  90500001
*                                           AND THE INITIATOR IN ORDER  90550001
*                                           TO PERFORM DATA SET         90600001
*                                           INTEGRITY                */ 90650001
*   2 JSCBJRBA    CHAR(8) BDY(WORD),     /* JOB JOURNAL RELATIVE BYTE   90671700
*                                           ADDRESS (RBA)               90693400
*                                           (MDC031)           YM7086*/ 90715100
*   2 JSCBALOC    PTR(31),               /* ADDRESS OF THE ALLOCATION   90736800
*                                           WORK AREA        @ZMC1264*/ 90758500
*   2 JSCBJNL     PTR(31),               /* SAME AS JSCBJNLA            90780200
*                                           BELOW              ICB332*/ 90801900
*    3 JSCBJJSB    BIT(8),               /* JOB JOURNAL STATUS          90823600
*                                           INDICATORS         ICB332*/ 90845300
*     4 JSCBJNLN BIT(1),                 /* NOTHING SHOULD BE WRITTEN   90867000
*                                           IN JOURNAL         ICB332*/ 90888700
*     4 JSCBJNLF BIT(1),                 /* NO JOB JOURNAL     MDC017*/ 90910400
*     4 JSCBJNLE BIT(1),                 /* ERROR IN JOURNAL, DO NOT    90932100
*                                           WRITE              ICB332*/ 90953800
*     4 *        BIT(1),                 /* RESERVED (WAS JSCBJSBJ)     90975500
*                                                              MDC001*/ 90997200
*     4 JSCBJSBI BIT(1),                 /* JOB HAS NOT ENTERED         91018900
*                                           ALLOCATION FOR THE FIRST    91040600
*                                           TIME               ICB332*/ 91062300
*     4 JSCBJSBA BIT(1),                 /* JOB HAS ENTERED             91084000
*                                           ALLOCATION         ICB332*/ 91105700
*     4 JSCBJSBX BIT(1),                 /* JOB HAS COMPLETED           91127400
*                                           ALLOCATION         ICB332*/ 91149100
*     4 JSCBJSBT BIT(1),                 /* JOB HAS ENTERED             91170800
*                                           TERMINATION        ICB332*/ 91192500
*    3 JSCBJNLA    PTR(24),              /* INITIATOR JSCB ONLY -       91214200
*                                           ADDRESS OF JSCB FOR STEP    91235900
*                                           BEING INITIATED.            91257600
*                                           OTHERWISE, ZERO    ICB431*/ 91279300
*   2 JSCBJNLR    PTR(31),               /* POINTER TO JOB JOURNAL      91301000
*                                           RPL                MDC023*/ 91322700
*   2 JSCBSMLR    PTR(31),               /* ADDRESS OF SYSTEM MESSAGE   91344400
*                                           DATA SET RPL       MDC024*/ 91366100
*   2 JSCBSUB     PTR(31),               /* SAME AS JSCBSUBA            91387800
*                                           BELOW              ICB333*/ 91409500
*    3 JSCRSV31    CHAR(1),              /* RESERVED           ICB333*/ 91431200
*    3 JSCBSUBA    PTR(24),              /* ADDRESS OF JES-SUBTL FOR    91452900
*                                           THIS JOB STEP      ICB333*/ 91474600
*   2 JSCBSONO    FIXED(15),             /* THE NUMBER OF SYSOUT DATA   91496300
*                                           SETS PLUS ONE      ICB335*/ 91518000
*   2 JSCRSV28    FIXED(15),             /* RESERVED                 */ 91539700
*   2 JSCBFRBA    CHAR(8) BDY(WORD),     /* RELATIVE BYTE ADDRESS       91561400
*                                           (RBA) OF THE FIRST JOURNAL  91583100
*                                           BLOCK  (MDC032)    YM7086*/ 91604800
*   2 JSCBSSIB    PTR(31),               /* ADDRESS OF THE SUBSYSTEM    91626500
*                                           IDENTIFICATION BLOCK        91648200
*                                                              MDC021*/ 91669900
*   2 JSCDSABQ    PTR(31),               /* ADDRESS OF QDB FOR DSAB     91691600
*                                           CHAIN              MDC007*/ 91713300
*   2 JSCBASW2    PTR(31),               /* POINTER TO THE ALLOCATION   91727700
*                                           STAE WORK AREA       @L1C*/ 91742100
*   2 JSCSCT      CHAR(4) BDY(WORD),     /* Structure containing SVA of 91754200
*                                           SCT                  @P2C*/ 91766300
*    3 JSCRSV55    CHAR(1),              /* RESERVED                 */ 91778400
*    3 JSCSCTP     CHAR(3) BDY(WORD,2),  /* SVA of SCT, use SWAREQ to   91792800
*                                           convert to a pointer @P2C*/ 91807200
*   2 JSCTMCOR    PTR(31),               /* ADDRESS OF TIOT MAIN        91821800
*                                           STORAGE MANAGEMENT AREA     91843500
*                                                              MDC010*/ 91865200
*   2 JSCBVATA    PTR(31),               /* ADDRESS OF VAT USED         91886900
*                                           DURING SYSTEM RESTART OR    91908600
*                                           AUTOMATIC RESTART  MDC011*/ 91930300
*   2 JSCDDNNO    FIXED(15),             /* COUNTER USED BY DYNAMIC     91952000
*                                           ALLOCATION TO GENERATE      91973700
*                                           DD NAMES           MDC012*/ 91995400
*   2 JSCBODNO    FIXED(15),             /* COUNTER USED BY DYNAMIC     92001600
*                                           OUTPUT TO GENERATE OUTPUT   92007800
*                                           DESCRIPTOR NAMES            92014000
*                                           THIS NUMBER INCREASES       92020200
*                                           OVER THE LIFE OF THE JOB    92026400
*                                           AND WRAPS.          @DIC */ 92032600
*   2 JSCDDNUM    FIXED(15),             /* NUMBER OF DD ENTRIES        92038800
*                                           CURRENTLY ALLOCATED         92060500
*                                           INCLUDING IN USE AND NOT    92082200
*                                           IN USE ENTRIES     MDC022*/ 92103900
*   2 JSCRSV33    CHAR(1),               /* RESERVED           MDC019*/ 92125600
*   2 JSCBSWSP    PTR(8),                /* SWA SUBPOOL        MDC015*/ 92147300
*   2 JSCBACT     PTR(31),               /* POINTER TO ACTIVE JSCB      92169000
*                                                              MDC014*/ 92190700
*   2 JSCBUFPT    PTR(31),               /* ADDRESS OF ALLOCATION/      92212400
*                                           UNALLOCATION WRITE-TO-      92234100
*                                           PROGRAMMER BUFFER  MDC030*/ 92255800
*   2 JSCBASWA    PTR(31),               /* POINTER TO THE LAST         92277500
*                                           ALLOCATION ESTAE WORK       92299200
*                                           AREA  (MDC303)   @Z40FP9A*/ 92320900
*   2 JSCBPGMN    CHAR(8) BDY(WORD),     /* JOB STEP PROGRAM NAME       92342600
*                                           (MDC304)         @G64RP9A*/ 92364300
*    3 JSCBECB1    FIXED(31),            /* ADDR OF THE CANCEL ECB      92386000
*                                           WHILE WAITING FOR A         92407700
*                                           REGION(IEFSD263) @ZMC1510*/ 92429400
*    3 JSCBECB2    FIXED(31),            /* ADDR OF THE WAIT FOR        92451100
*                                           REGION ECB WHILE WAITING    92472800
*                                           FOR A REGION (IEFSD263)     92494500
*                                                            @ZMC1510*/ 92516200
*   2 JSCDSNQP    PTR(31),               /* Pointer to the first        92551700
*                                           DSENQ Table          @L5C*/ 92587200
*   2 JSCBCSCX    PTR(31),               /* ADDRESS OF CSCX EXTENSION   92622800
*                                           TO CSCB              @L2C*/ 92664300
*                                        /*                     5@L2D*/ 92705800
*   2 JSCAMCPL    PTR(31),               /* ALLOCATION MESSAGE          92747600
*                                           CELLPOOL ID      @YC19251*/ 92762000
*   2 JSCBEND3    CHAR(0) BDY(WORD);     /* END OF SECTION 3   ICB351*/ 92776600
*                                                                       92800001
*        /* MACRO DEFINITIONS OF JSCBDISP, JSCBAOS1, AND JSCBAOS2 */    93200001
*                                                                       93600001
*%IF IEZJSCB_GENEQU = 'NO' %THEN         /*                      @L4A*/ 93616600
* %GOTO IEZJSCB_1;                       /*                      @L4A*/ 93633200
*  DCL (JSCBDISP,JSCBAOS1,JSCBAOS2) LABEL; /*                    @L1A*/ 93650000
*                                                                       95200001
*  JSCBDISP:  GEN  (EQU 188);            /* LENGTH OF SECTION 1      */ 95250000
*  JSCBAOS1:  GEN  (EQU  72);            /* LENGTH OF SECTION 2      */ 95300000
*  JSCBAOS2:  GEN  (EQU 192);            /* LENGTH OF SECTION 3      */ 95350000
*%GOTO IEZJSCB_2;                        /*                      @L4A*/ 95357100
*%IEZJSCB_1:;                            /*                      @L4A*/ 95364200
*DCL JSCBDISP CONSTANT(188);             /* LENGTH OF SECTION 1  @L4A*/ 95371300
*DCL JSCBAOS1 CONSTANT(72);              /* LENGTH OF SECTION 2  @L4A*/ 95378400
*DCL JSCBAOS2 CONSTANT(192);             /* LENGTH OF SECTION 3  @L4A*/ 95385500
*%IEZJSCB_2:;                            /*                      @L4A*/ 95392600
*                                                                       95400000
*              /* END OF JSCB */                                        95600001
