*         %GOTO MCSPROLG; /* BILINGUAL MAPPING                          00050000
          MACRO                                                         00100000
          IEZVG111 &MCSOGT8=,   @P4C*/                                  00150000
*%MCSPROLG: ;                                                           00200000
*/***START OF SPECIFICATIONS******************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* MACRO NAME:  IEZVG111                                     @LAC*/ 00350000
*/*                                                                  */ 00400000
*/*01* DESCRIPTIVE NAME:  MCSOPER OPERPARM Mapping               @LAC*/ 00450000
*/*                                                                  */ 00500000
*/*01* ACRONYM: MCSOP                                            @LAC*/ 00507100
*/*01* EXTERNAL CLASSIFICATION: GUPI                             @LAA*/ 00514200
*/*01*  END OF EXTERNAL CLASSIFICATION:                          @LAA*/ 00521300
*/*01* PROPRIETARY STATEMENT:                                    @LAC*/ 00528400
*/***PROPRIETARY_STATEMENT********************************************/ 00535600
*/*                                                                  */ 00553400
*/*                                                                  */ 00571400
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00607100
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00642800
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1990, 1994                      */ 00678500
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00714200
*/*                                                                  */ 00750000
*/* STATUS= HBB5520                                                  */ 00800000
*/*                                                                  */ 00850000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00861100
*/*                                                                  */ 00872200
*/*01* DSECT NAME:  MCSOPPRM, MCSOTBL, MCSOMAP                   @LAC*/ 00872900
*/*                                                              @P3A*/ 00873600
*/*01* COMPONENT:  Communications Task (SC1CK)                   @LAC*/ 00874300
*/*                                                              @P3A*/ 00875000
*/*01* EYE-CATCHER:  None                                        @LAC*/ 00875300
*/*02*   OFFSET:                                                 @LAA*/ 00875600
*/*02*   LENGTH:                                                 @LAA*/ 00875900
*/*                                                              @P3A*/ 00876400
*/*01* STORAGE ATTRIBUTES:                                       @LAC*/ 00876700
*/*02*   MAIN STORAGE:                                           @LAA*/ 00877000
*/*02*   VIRTUAL STORAGE:                                        @LAA*/ 00877300
*/*02*   AUXILIARY STORAGE:                                      @LAA*/ 00877600
*/*02*   DATA SPACE:                                             @LAA*/ 00877900
*/*02*   SUBPOOL:  Determined by invoker of MCSOPER macro        @LAC*/ 00878200
*/*02*   KEY:  0-7                                               @LAC*/ 00878500
*/*02*   Residency:  Any, determined by invoker of MCSOPER macro @LAC*/ 00878800
*/*                                                              @P3A*/ 00879900
*/*01* SIZE:                                                     @LAC*/ 00880600
*/*02* MCSOPPRM - 60 bytes                                       @LAC*/ 00881000
*/*02* MCSOTBL - maximum systems in sysplex * 8 + 4              @LAC*/ 00881400
*/*                                                              @P3A*/ 00882000
*/*01* FUNCTION:         Mapping of the Operator Data area       @LAC*/ 00883300
*/*                   referenced by MCSOPER ACTIVATE processing  @L2A*/ 00916600
*/*                   via the OPERPARM parameter value.          @LAC*/ 00933300
*/*                                                                  */ 00950000
*/*01* METHOD OF ACCESS:                                         @LAC*/ 01000000
*/*                   BAL  - Specify:                                */ 01025000
*/*                                   IEZVG111                       */ 01050000
*/*                          Specify MCSOGT8=YES to obtain a     @L9A*/ 01055000
*/*                          mapping of MCSOTBL that can hold    @L9A*/ 01060000
*/*                          the number of values required.      @L9A*/ 01065000
*/*                          MCSOPER processing will only accept @L9A*/ 01070000
*/*                          as many system names as there can   @L9A*/ 01075000
*/*                          be systems in a sysplex with the    @L9A*/ 01080000
*/*                          issuing system.                     @L9A*/ 01085000
*/*                          Any other value results in an array @L9A*/ 01090000
*/*                          with a dimension of eight.          @L9A*/ 01095000
*/*                                                                  */ 01100000
*/*                   PL/S - %INCLUDE SYSLIB(IEZVG111)               */ 01150000
*/*                           DCL MCSOOPRM PTR(31)               @L2A*/ 01200000
*/*                          Specify %MCSOGT8='YES' to obtain a  @L9A*/ 01205000
*/*                          mapping of MCSOTBL that can hold    @L9A*/ 01210000
*/*                          the number of values required.      @L9A*/ 01215000
*/*                          MCSOPER processing will only accept @L9A*/ 01220000
*/*                          as many system names as there can   @L9A*/ 01225000
*/*                          be systems in a sysplex with the    @L9A*/ 01230000
*/*                          issuing system.                     @L9A*/ 01235000
*/*                          Any other value results in an array @L9A*/ 01240000
*/*                          with a dimension of eight.          @L9A*/ 01245000
*/*                                                                  */ 01250000
*/*01* CREATED BY:       Invoker of MCSOPER                      @LAC*/ 01300000
*/*                                                                  */ 01350000
*/* DELETED BY=       Invoker of MCSOPER                         @L2C*/ 01400000
*/*                                                                  */ 01450000
*/* DISTRIBUTION=    AMACLIB                                     @LAC*/ 01500000
*/*                                                                  */ 01550000
*/*01* POINTED TO BY:    Invoker of MCSOPER                      @LAC*/ 01575000
*/*                                                                  */ 01600000
*/*01* SERIALIZATION:    None                                    @LAC*/ 01625000
*/*                                                                  */ 01650000
*/* CHANGE ACTIVITY =                                                */ 01700000
*/* $L0=TSOOP,   HBB4410,  870916,  PDBU: TSO OPERATOR               */ 01750000
*/* $L1=TSOOP,   HBB4410,  871113,  PDCW: TSO OPERATOR               */ 01775000
*/* $L2=CNSL1EBU,HBB4410,  890403,  PDBU: CONSOLE ENHANCEMENTS 1     */ 01783300
*/* $L3=CNSL1EEF,HBB4410,  890403,  PDEF: CONSOLE ENHANCEMENTS 1     */ 01791600
*/* $L4=CNSL1ECY,HBB4410,  890403,  PDCY: CONSOLE ENHANCEMENTS 1     */ 01795800
*/* $L5=CNITGFCR,HBB4410,  890612,  PDCR: CNITG  UD Msg Processing   */ 01797900
*/* $P1=PEO2519, HBB4410,  890612,  PDHF: Broadcast messages updated */ 01798900
*/* $01=OY35534, HBB4410,  900915,  PDAD: PEO4787 Missing closing    */ 01799000
*/*                                       comment                    */ 01799100
*/* $L6=CNSL2ADQ,HBB4420,  900105,  PDDQ: CONSOLE ENHANCEMENTS II    */ 01799400
*/* $P2=PH31523, HBB4420,  901026,  PDBU: Fix assembler mapping      */ 01799700
*/* $L7=NETSY6HK,JBB4422,  901112,  PDHK: Netview Automation         */ 01799800
*/* $P3=PKB0806, HBB4430,  920725,  PDCM: Prolog updates             */ 01799900
*/* $L8=OSR4V1,  HBB5510,  921207,  PDV1: OPS Restructure            */ 01826500
*/* $L9=SYSOP6ED,HBB5510,  930304,  PDED: Sysplex Operations         */ 01839800
*/* $P4=PIG4239, HBB5510,  930507,  PDED: Add = to MCSOGT8           */ 01846400
*/* $02=OY62847, HBB4430,  920331,  PDBU: New bit to allow override  */ 01848000
*/*                                       of security product's      */ 01849600
*/*                                       OPERPARMs                  */ 01851200
*/* $LA=SYSOP16, HBB5510,  930520,  PD3J: SHOWHDR updates            */ 01852100
*/* $P5=PN70169, HBB5520,  940210,  PD3J: SHOWHDR updates            */ 01852600
*/*                                                                  */ 01853100
*/*                                                                  */ 01879700
*/***END OF SPECIFICATIONS********************************************/ 01906300
*%GOTO MCSPLS; /*                                                       01933300
.*** START OF CHANGE ACTIVITY  **************************************** 01966600
.* A 000000-999999                                                      02000000
.* D Since MCSOPL is now AMG generated (by MCSOPER macro), MCSOPL  @L2A 02050000
.*    was moved out of IEZVG111 into IEAVG712                      @L2A 02100000
.* C Changed OPERPARMs mapping for future RACF dynamic parse       @L2A 02150000
.*    exploitation                                                 @L2A 02200000
.* A Added MCSOMIG, MCSOMIGY, and MCSOMIGN for RELEASE support     @L3A 02250000
.* A Added code to support CMDSYS and message scope                @L4A 02275000
.* A Added miscellaneous routing byte.                             @L5A 02287500
.* C Changed broadcast message field in PLAS to reference MCSOMLBC @P1C 02293700
.* C Added the closing comment in Prolog                           @01A 02295200
.* A Added MCSOALGP for alternate group support                    @L6A 02296800
.* C Fixed assembler mapping for MCSOALGP.                         @P2A 02298400
.* A Added MCSOAUTY and MCSOAUTN for Automation queuing            @L7A 02299200
.* A Prolog updates                                                @P3A 02299600
.* A Added MCSOHDCY and MCSOHDCN for Hardcopy Message Set Queueing @L8A 02299700
.* C Changed structure of MSCOPE systems names list mapping        @L9A 02309700
.* A Add assember/compiler variable MCSOGT8 to obtain MSCOTBL with @L9A 02319700
.*   a dimension of '*'                                            @L9A 02329700
.* A Add '=' to end of MCSOGT8 for clean assembly                  @P4A 02334700
.* A Added new bit to allow IEZVG111 (OPERPARMs mapped in this     @02A 02336300
.*   macro) to override OPERPARMs stored in the security product.  @02A 02337900
.* C Changed prolog fields for SHOWHDR updates                     @LAA 02338800
.* D Changed prolog fields for SHOWHDR updates                     @P5A 02339200
.*** END OF CHANGE ACTIVITY  ****************************************** 02339700
         EJECT ,                                                   @L2A 02350000
*********************************************************************** 03150000
*                                                                     * 03200000
*       The following is a mapping of the Operator Parameters         * 03250000
*       used with the OPERPARM Keyword.  The user specifying the      * 03300000
*       OPERPARM Keyword is responsible for filling in the            * 03350000
*       appropriate information.                                      * 03400000
*                                                                     * 03450000
*********************************************************************** 03500000
         SPACE                                                          03550000
MCSOPPRM DSECT             OPERPARM Attributes                          03555000
         DS    0F          Start on a fullword boundry             @L2A 03560000
         SPACE ,                                                   @L2A 03565000
*---------------------------------------------------------------------* 03570000
* Message Data Space Size - The Maximum size for the Message data     * 03575000
*                           space, in MegaBytes.                      * 03580000
*---------------------------------------------------------------------* 03585000
MCSOSTOR DS    H           Limit Value                             @L2A 03590000
         SPACE ,                                                   @L2A 03595000
*---------------------------------------------------------------------* 03600000
* Authority Level - Two bit flags reprsenting the Authority levels.   * 03605000
*                   MASTER, ALL, (SYS,IO,CONS), and INFO are mutually * 03610000
*                   exclusive values. SYS, IO, and CONS can be mixed. * 03615000
*---------------------------------------------------------------------* 03620000
MCSOAUTH DS    0XL2        AUTHORITY LEVEL                         @L2C 03625000
MCSOATH1 DS    XL1          Authority flag 1                       @L2A 03630000
MCSOMSTR EQU   X'80'         MASTER                                @L2A 03635000
MCSOAALL EQU   X'40'         ALL (SYS,IO, AND CONS)                @L2A 03640000
MCSOASYS EQU   X'20'         SYS                                   @L2A 03645000
MCSOAIO  EQU   X'10'         I/O                                   @L2A 03650000
MCSOCONS EQU   X'08'         CONS                                  @L2A 03655000
MCSOINFO EQU   X'04'         INFO (DEFUALT)                        @L2A 03660000
MCSOATH2 DS    XL1          Authority flag 2 - reserved            @L2A 03665000
         SPACE ,                                                   @L2A 03670000
*---------------------------------------------------------------------* 03675000
* Message Form - Indicates how a message is displayed.                * 03680000
*---------------------------------------------------------------------* 03685000
MCSOMFRM DS    0XL2        OPERATORS MESSAGE FORM                  @L2C 03690000
MCSOMFM1 DS    XL1          Message Form flag 1                    @L2A 03695000
MCSOMFT  EQU   X'80'         Display with a TIME STAMP             @L2A 03700000
MCSOMFS  EQU   X'40'         Display with the SYSTEM NAME          @L2A 03705000
MCSOMFJ  EQU   X'20'         Display with JOB ID/NAME              @L2A 03710000
MCSOMFM  EQU   X'10'         Display without SYSTEM,TIME, or JOB       +03715000
                                                     (DEFAULT)     @L2A 03720000
MCSOMFX  EQU   X'08'         Suppress SYSTEM and JOB names         @L2A 03725000
MCSOMFM2 DS    XL1          Message Form flag 2                    @L2A 03730000
         EJECT ,                                                   @L2A 03735000
*---------------------------------------------------------------------* 03740000
* Message Level - The level of messages to be received by the console.* 03745000
*---------------------------------------------------------------------* 03750000
MCSOMLVL DS    0XL2        MESSAGE LEVEL                           @L2C 03755000
MCSOMLV1 DS    XL1          Message Level flag 1                   @L2A 03760000
MCSOMLR  EQU   X'80'         Receive WTORs                         @L2A 03765000
MCSOMLI  EQU   X'40'         Receive IMMEDIATE ACTION messages     @L2A 03770000
MCSOMLCE EQU   X'20'         Receive CRITICAL EVENTUAL ACTION msgs @L2A 03775000
MCSOMLE  EQU   X'10'         Receive EVENTUAL ACTION messages      @L2A 03780000
MCSOMLIN EQU   X'08'         Receive INFORMATIONAL messages        @L2A 03785000
MCSOMLBC EQU   X'04'         Receive BROADCAST messages            @P1C 03790000
MCSOMLAL EQU   X'02'         Receive ALL message levels (DEFAULT)  @L2A 03795000
MCSOMLV2 DS    XL1          Message Level flag 2                   @L2A 03800000
         SPACE ,                                                   @L2A 03805000
*---------------------------------------------------------------------* 03810000
* Message Type - This is the MONITOR value. It indicates what events  * 03815000
*                the console will monitor.                            * 03820000
*---------------------------------------------------------------------* 03825000
MCSOMSGT DS    0XL2        MESSAGE TYPE                            @L2C 03830000
MCSOMTP1 DS    XL1          Message Type flag 1                    @L2A 03835000
MCSOMTJN EQU   X'80'         Monitor JOB NAMES                     @L2A 03840000
MCSOMTJT EQU   X'40'         Monitor JOB NAMES, display w/time     @L2A 03845000
MCSOMTSS EQU   X'20'         Monitor SESSIONS                      @L2A 03850000
MCSOMTST EQU   X'10'         Monitor SESSIONS, display w/time      @L2A 03855000
MCSOMTS  EQU   X'08'         Monitor STATUS of freed data sets     @L2A 03860000
MCSOMTP2 DS    XL1          Message Type flag 2                    @L2A 03865000
         SPACE ,                                                   @L2A 03870000
*---------------------------------------------------------------------* 03875000
* Routing Codes -  A 128 bit string where each bit represents a       * 03880000
*                  Route Code. A flag is included for ALL and NONE.   * 03885000
*---------------------------------------------------------------------* 03890000
MCSORCDT DS    0CL17       Routing Code data                       @L2A 03895000
MCSORCFL DS    XL1         Routing Code flag                       @L2A 03900000
MCSORCAL EQU   X'80'        ALL Routing Codes                      @L2A 03905000
MCSORCNO EQU   X'40'        NO Routing Codes (DEFAULT)             @L2A 03910000
MCSORTCD DS    CL16         ROUTING CODES (If not ALL or NONE)     @L2C 03915000
         SPACE ,                                                   @L2A 03920000
*---------------------------------------------------------------------* 03925000
* Log Command Response - Should the Command Response of a console     * 03930000
*                        be logged in the MCS Hardcopy Log.           * 03935000
*---------------------------------------------------------------------* 03940000
MCSOLOGC DS    XL1         LOG COMMAND RESPONSE Value              @L2C 03945000
MCSOLOGS EQU   X'80'        SYSTEM - Log the response (DEFAULT)    @L2A 03950000
MCSOLOGN EQU   X'40'        NO - Do not log the response           @L2A 03955000
         EJECT ,                                                   @L2A 03960000
*---------------------------------------------------------------------* 03965000
* Migration ID - Should the Console be assigned a 1 byte migration ID.* 03970000
*---------------------------------------------------------------------* 03975000
MCSOMIG  DS    XL1         MIGRATION ID Flags                      @L3A 03980000
MCSOMIGY EQU   X'80'        YES - Assign an ID                     @L3A 03985000
MCSOMIGN EQU   X'40'        NO - Don't Assign an ID (DEFAULT)      @L3A 03990000
         SPACE ,                                                   @L3A 03995000
*---------------------------------------------------------------------* 04000000
* DOM - Indicates what type, if any, of Delete Operator Message (DOM) * 04005000
*       the console will receive. Normal will queue DOMs by the       * 04010000
*       message queuing criteria. All will queue all DOMs. None       * 04015000
*       will keep and DOMs from being sent to the console.            * 04020000
*---------------------------------------------------------------------* 04025000
MCSODOM  DS    XL1         DOM Value                               @L2A 04030000
MCSODOMN EQU   X'80'        NORMAL  (DEFAULT)                      @L2A 04035000
MCSODOMA EQU   X'40'        ALL                                    @L2A 04040000
MCSODOMX EQU   X'20'        NONE                                   @L2A 04045000
         SPACE ,                                                   @L2A 04050000
*---------------------------------------------------------------------* 04055000
* Key - The eight byte character name used to associate groups of     * 04060000
*       consoles.                                                     * 04065000
*---------------------------------------------------------------------* 04070000
MCSOKEY  DS    CL8           Key assigned to console entry         @L2A 04075000
*---------------------------------------------------------------------* 04080000
* Command System - The system where all commands from this console    * 04085000
*                  will be sent to execute. A '*' will be          @L4C 04088700
*                  converted to the currently executing system     @L4C 04092400
*                  name.                                           @L4C 04096100
*---------------------------------------------------------------------* 04100000
MCSOCSNM DS    CL8          Command System Name                    @L2A 04120000
         SPACE ,                                                   @L6A 04125000
*---------------------------------------------------------------------* 04136000
* ALTGRP - The alternate group of consoles that will be selected   @P2M 04136100
*          for backup in the event of console failure              @P2M 04136200
*---------------------------------------------------------------------* 04136300
MCSOALGP DS    CL8         Alternate group name                    @P2M 04136400
*---------------------------------------------------------------------* 04136500
* MSCOPE data - The systems for which this console is eligible to  @L4A 04137000
*               receive messages from.  If the console is to be    @L4A 04138000
*               scoped to all systems, then the user sets          @L4A 04139000
*               MCSOSALL on.  If a specific list of system names   @L4A 04140000
*               is to be specified, then MCSOSLST is set on and    @L4A 04141000
*               MCSOMSPT is set to the address of a structure      @L4A 04142000
*               containing a list of systems.  This structure is   @L4A 04143000
*               mapped by the DSECT MCSOTBL.                       @L4A 04144000
*---------------------------------------------------------------------* 04145000
MCSOMSFG DS    X           MSCOPE flags                            @L4A 04147000
MCSOSALL EQU   X'80'       *ALL specified for MSCOPE               @L4A 04148000
MCSOSLST EQU   X'40'       List of MSCOPE values specified         @L4A 04148400
         DS    X           reserved for alignment                  @L4A 04148800
MCSOMSPT DS    A           Pointer to a list of MSCOPE values      @L4A 04149200
MCSOMISC DS    XL1         Miscellaneous Routing Information       @L5A 04149300
*---------------------------------------------------------------------* 04149600
* Undelivered - Should the Console be sent UD messages or not.     @L7A 04149900
*---------------------------------------------------------------------* 04150200
MCSOUDY  EQU   X'80'       Yes - Display UD messages               @L5A 04150500
MCSOUDN  EQU   X'40'       No - Don't display UD messages  DEFAULT @L5A 04150800
*---------------------------------------------------------------------* 04151100
* Automation - Should the Console be sent automatable messages     @L7A 04151400
*---------------------------------------------------------------------* 04151700
MCSOAUTY EQU   X'20'        YES - Queue automatable messages       @L7A 04152000
MCSOAUTN EQU   X'10'        No - Don't queue automatable messages  @L7A 04152300
*---------------------------------------------------------------------* 04152400
* Hardcopy - Should the Console be sent the hardcopy message set   @L8A 04152500
*---------------------------------------------------------------------* 04152600
MCSOHDCY EQU   X'08'        YES - receive hardcopy message set     @L8A 04152700
MCSOHDCN EQU   X'04'        No - Don't receive hardcopy message set    x04152800
                                 DEFAULT                           @L8A 04152900
         SPACE ,                                                   @L2A 04153000
MCSOFLAG DS    XL1         Flags byte                              @02A 04153200
*---------------------------------------------------------------------* 04153400
* Overriding of security product:  The following will be the order @02A 04153600
* of processing for OPERPARMs as determined by the following bits: @02A 04153800
*     MCSOVRDY = ON :  Yes - Override security product             @02A 04154000
*                      Processing will use this data area          @02A 04154200
*                      (IEZVG111) to set the extended console's    @02A 04154400
*                      attributes.                                 @02A 04154600
*     MCSOVRDN = ON :  No - Don't override security product        @02A 04154800
*                      (DEFAULT)                                   @02A 04155000
*                      Processing will first search security       @02A 04155200
*                      security product for an OPERPARM segment.   @02A 04155400
*                      If no segment exists, processing will then  @02A 04155600
*                      use this data area to set the extended      @02A 04155800
*                      console's attributes                        @02A 04156000
*---------------------------------------------------------------------* 04156200
MCSOVRDY EQU   X'80'       Yes - Override security product         @02A 04156400
MCSOVRDN EQU   X'40'       No - Don't override security product    @02A 04156600
*                                                (DEFAULT)         @02A 04156800
         DS    XL6         Reserved                                @02C 04157000
MCSOPLEN EQU *-MCSOPPRM                                                 04157200
*---------------------------------------------------------------------* 04157400
* Table of Message Scope Values                                    @L4A 04158200
*---------------------------------------------------------------------* 04162300
         SPACE 1                                                   @L4A 04166400
MCSOTBL  DSECT               Table pointed to by MCSPMSPT          @L4A 04170500
MCSOMSNM DS     F            Number of MSCOPE values specified     @L4A 04174600
         AIF    ('&MCSOGT8' EQ 'YES').MCSO001                      @L9A 04175700
MCSOTSYS DS     8CL8         Storage for system names              @L4A 04176800
         AGO    .MCSO002                                           @L9A 04177900
.MCSO001 ANOP                                                      @L9A 04179000
MCSOTSYS DS     0CL8         Storage for system names              @L9C 04180100
.MCSO002 ANOP                                                      @L9A 04181200
         SPACE 1                                                   @L4A 04182800
MCSOMAP  DSECT               Template to be mapped over MCSOTSYS   @LAC 04186900
         DS     0F           Put on word boundary                  @L4A 04191000
MCSOSYSE DS     CL8          System name entry                     @L4A 04195100
         MEND   , */                                                    04200000
*%MCSPLS:  ;                                                            04250000
*/********************************************************************/ 05150000
*/*                                                                  */ 05200000
*/*     The following is a mapping of the Operator Parameters        */ 05250000
*/*     used with the OPERPARM Keyword.  The user specifying the     */ 05300000
*/*     OPERPARM Keyword is responsible for filling in the           */ 05350000
*/*     appropriate information.                                     */ 05400000
*/*                                                                  */ 05450000
*/********************************************************************/ 05500000
*@SPACE;                         /*                              @L2A*/ 05525000
* DCL                                                                   05550000
*   1 MCSOPPRM BDY(WORD) BASED(MCSOOPRM),  /* OPERPARM Attributes       05583300
* @L2A*/                                                                05616600
*@SPACE;                         /*                              @L2A*/ 05650000
*/*------------------------------------------------------------------*/ 05700000
*/* Message Data Space Size - The Maximum size for the Message data  */ 05750000
*/*                           space, in MegaBytes.                   */ 05800000
*/*------------------------------------------------------------------*/ 05850000
*     3 MCSOSTOR     FIXED(16),  /* Limit Value                  @L2A*/ 05900000
*@SPACE;                         /*                              @L2A*/ 05950000
*/*------------------------------------------------------------------*/ 06000000
*/* Authority Level - Two bit flags reprsenting the Authority        */ 06050000
*/*                   levels. MASTER, ALL, (SYS,IO,CONS), and INFO   */ 06100000
*/*                   are mutually exclusive values. SYS, IO, and    */ 06150000
*/*                   CONS can be mixed.                             */ 06200000
*/*------------------------------------------------------------------*/ 06250000
*     3 MCSOAUTH     BIT(16),    /* AUTHORITY LEVEL              @L2C*/ 06300000
*       5 MCSOATH1   BIT(8),     /*  Authority flag 1            @L2A*/ 06350000
*         7 MCSOMSTR BIT(1),     /*   MASTER                     @L2A*/ 06400000
*         7 MCSOAALL BIT(1),     /*   ALL (SYS,IO, AND CONS)     @L2A*/ 06450000
*         7 MCSOASYS BIT(1),     /*   SYS                        @L2A*/ 06500000
*         7 MCSOAIO  BIT(1),     /*   I/O                        @L2A*/ 06550000
*         7 MCSOCONS BIT(1),     /*   CONS                       @L2A*/ 06600000
*         7 MCSOINFO BIT(1),     /*   INFO (DEFUALT)             @L2A*/ 06650000
*         7 *        BIT(2),     /*   Reserved                   @L2A*/ 06700000
*       5 MCSOATH2   BIT(8),     /*  Authority flag 2 - reserved @L2A*/ 06750000
*@SPACE;                         /*                              @L2A*/ 06800000
*/*------------------------------------------------------------------*/ 06850000
*/* Message Form - Indicates how a message is displayed.             */ 06900000
*/*------------------------------------------------------------------*/ 06950000
*     3 MCSOMFRM     BIT(16),    /* OPERATORS MESSAGE FORM       @L2C*/ 07000000
*       5 MCSOMFM1   BIT(8),     /*  Message Form flag 1         @L2A*/ 07050000
*         7 MCSOMFT  BIT(1),     /*   Display wiht a TIME STAMP  @L2A*/ 07100000
*         7 MCSOMFS  BIT(1),     /*   Display with SYSTEM NAME   @L2A*/ 07150000
*         7 MCSOMFJ  BIT(1),     /*   Display with JOB ID/NAME   @L2A*/ 07200000
*         7 MCSOMFM  BIT(1),     /*   Display without SYSTEM,           07250000
*                                      TIME, or JOB  (DEFAULT)   @L2A*/ 07300000
*         7 MCSOMFX  BIT(1),     /*   Suppress SYSNAME and JOBNAME      07333300
*                                                                @L2A*/ 07366600
*         7 *        BIT(3),     /*   Reserved                   @L2A*/ 07400000
*       5 MCSOMFM2   BIT(8),     /*  Message Form flag 2         @L2A*/ 07450000
*@EJECT;                         /*                              @L2A*/ 07500000
*/*------------------------------------------------------------------*/ 07550000
*/* Message Level - The level of messages to be received by the      */ 07600000
*/*                 console.                                         */ 07650000
*/*------------------------------------------------------------------*/ 07700000
*     3 MCSOMLVL     BIT(16),    /* MESSAGE LEVEL                @L2C*/ 07750000
*       5 MCSOMLV1   BIT(8),     /*  Message Level flag 1        @L2A*/ 07800000
*         7 MCSOMLR  BIT(1),     /*   Receive WTORs              @L2A*/ 07850000
*         7 MCSOMLI  BIT(1),     /*   Recv IMMEDIATE ACTION msgs @L2A*/ 07900000
*         7 MCSOMLCE BIT(1),     /*   Receive CRITICAL EVENTUAL         07950000
*                                      ACTION messages           @L2A*/ 08000000
*         7 MCSOMLE  BIT(1),     /*   Recv EVENTUAL ACTION msgs  @L2A*/ 08050000
*         7 MCSOMLIN BIT(1),     /*   Recv INFORMATIONAL msgs    @L2A*/ 08100000
*         7 MCSOMLBC BIT(1),     /*   Receive BROADCAST message  @P1C*/ 08150000
*         7 MCSOMLAL BIT(1),     /*   Receive ALL (DEFAULT)      @L2A*/ 08200000
*         7 *        BIT(1),     /*   Reserved                   @L2A*/ 08250000
*       5 MCSOMLV2   BIT(8),     /*  Message Level flag 2        @L2A*/ 08300000
*@SPACE;                         /*                              @L2A*/ 08350000
*/*------------------------------------------------------------------*/ 08400000
*/* Message Type - This is the MONITOR value. It indicates what      */ 08450000
*/*                events the console will monitor.                  */ 08500000
*/*------------------------------------------------------------------*/ 08550000
*     3 MCSOMSGT     BIT(16),    /* MESSAGE TYPE                 @L2C*/ 08600000
*       5 MCSOMTP1   BIT(8),     /*  Message Type flag 1         @L2A*/ 08650000
*         7 MCSOMTJN BIT(1),     /*   Monitor JOB NAMES          @L2A*/ 08700000
*         7 MCSOMTJT BIT(1),     /*   Monitor JOB NAMES,                08750000
*                                      display w/time            @L2A*/ 08800000
*         7 MCSOMTSS BIT(1),     /*   Monitor SESSIONS           @L2A*/ 08850000
*         7 MCSOMTST BIT(1),     /*   Monitor SESSIONS                  08900000
*                                      display w/time            @L2A*/ 08950000
*         7 MCSOMTS  BIT(1),     /*   Monitor STATUS of freed           09000000
*                                      data sets                 @L2A*/ 09050000
*         7 *        BIT(3),     /*   Reserved                   @L2A*/ 09100000
*       5 MCSOMTP2   BIT(8),     /*  Message Type flag 2         @L2A*/ 09150000
*@SPACE;                         /*                              @L2A*/ 09200000
*/*------------------------------------------------------------------*/ 09250000
*/* Routing Codes -  A 128 bit string where each bit represents a    */ 09300000
*/*                  Route Code. A flag is included for ALL and NONE.*/ 09350000
*/*------------------------------------------------------------------*/ 09400000
*     3 MCSORCDT     CHAR(17),   /* Routing Code data            @L2A*/ 09450000
*       5 MCSORCFL   BIT(8),     /* Routing Code flag            @L2A*/ 09500000
*         7 MCSORCAL BIT(1),     /*  ALL Routing Codes           @L2A*/ 09550000
*         7 MCSORCNO BIT(1),     /*  NO Routing Codes (DEFAULT)  @L2A*/ 09600000
*         7 *        BIT(6),     /*   Reserved                   @L2A*/ 09650000
*       5 MCSORTCD   CHAR(16),   /* ROUTING CODES                       09700000
*                                    (If not ALL or NONE)        @L2A*/ 09750000
*@EJECT;                         /*                              @L2A*/ 09800000
*/*------------------------------------------------------------------*/ 09850000
*/* Log Command Response - Should the Command Response of a console  */ 09900000
*/*                        be logged in the MCS Hardcopy Log.        */ 09950000
*/*------------------------------------------------------------------*/ 10000000
*     3 MCSOLOGC     BIT(8),     /* LOG COMMAND RESPONSE Value   @L2C*/ 10050000
*       5 MCSOLOGS   BIT(1),     /* SYSTEM - Log the response           10100000
*                                     (DEFAULT)                  @L2A*/ 10150000
*       5 MCSOLOGN   BIT(1),     /* NO - Do not Log the Response @L2A*/ 10200000
*       5 *          BIT(6),     /* Reserved                     @L2A*/ 10250000
*@SPACE;                         /*                              @L2A*/ 10300000
*/*------------------------------------------------------------------*/ 10350000
*/* Migration ID - Should the Console be assigned a 1 byte migration */ 10400000
*/*                ID.                                               */ 10450000
*/*------------------------------------------------------------------*/ 10500000
*     3 MCSOMIG      BIT(8),     /* MIGRATION ID Flags           @L3A*/ 10550000
*       5 MCSOMIGY   BIT(1),     /*  YES - Assign an ID          @L3A*/ 10600000
*       5 MCSOMIGN   BIT(1),     /*  NO - Don't assign an ID            10650000
*                                     (DEFAULT)                  @L3A*/ 10700000
*       5 *          BIT(6),     /* Reserved                     @L3A*/ 10750000
*@SPACE;                         /*                              @L3A*/ 10800000
*/*------------------------------------------------------------------*/ 10850000
*/* DOM - Indicates what type, if any, of Delete Operator Message    */ 10900000
*/*       the console will receive. Normal will queue DOMs by        */ 10950000
*/*       the message queuing criteria. All will queue all DOMs.     */ 11000000
*/*       None will keep any DOMs from being sent to the console.    */ 11050000
*/*------------------------------------------------------------------*/ 11100000
*     3 MCSODOM      BIT(8),     /* DOM Value                    @L2A*/ 11150000
*       5 MCSODOMN   BIT(1),     /*  NORMAL (DEFAULT)            @L2A*/ 11200000
*       5 MCSODOMA   BIT(1),     /*  ALL                         @L2A*/ 11250000
*       5 MCSODOMX   BIT(1),     /*  NONE                        @L2A*/ 11300000
*       5 *          BIT(5),     /* Reserved                     @L2A*/ 11350000
*@EJECT;                         /*                              @L2A*/ 11400000
*/*------------------------------------------------------------------*/ 11450000
*/* Key - The eight byte character name used to associate groups of  */ 11500000
*/*       consoles.                                                  */ 11550000
*/*------------------------------------------------------------------*/ 11600000
*     3 MCSOKEY  CHAR(8),        /* Key assigned to console entry       11650000
*                                                                @L2A*/ 11700000
*/*------------------------------------------------------------------*/ 11750000
*/* Command System - The system where all commands from this console */ 11800000
*/*                  will be sent to execute. A '*' will be      @L4C*/ 11837500
*/*                  converted to the currently executing system @L4C*/ 11875000
*/*                  name.                                       @L4C*/ 11912500
*/*------------------------------------------------------------------*/ 11950000
*     3 MCSOCSNM     CHAR(8),    /*  Command System Name         @L4C*/ 11960600
*/*------------------------------------------------------------------*/ 11981800
*/* ALTGRP-The alternate group of consoles that will be selected     */ 11983500
*/*        for backup in the event of console failure            @L6A*/ 11985200
*/*------------------------------------------------------------------*/ 11986900
*     3 MCSOALGP CHAR(8),        /* Alternate group name         @L6A*/ 11988600
*/*------------------------------------------------------------------*/ 11990300
*/*MSCOPE data - The systems for which this console is eligible  @L4A*/ 11992400
*/*              to receive messages.  If the console is to be   @L4A*/ 12003000
*/*              scoped to all systems, then the user sets       @L4A*/ 12013600
*/*              MCSOSALL on.  If a specific list of system      @L4A*/ 12024200
*/*              names is to be specified, then MCSOSLST is set  @L4A*/ 12034800
*/*              on and MCSOMSPT is set to the address of a      @L4A*/ 12045400
*/*              structure containing a list of systems.  This   @L4A*/ 12056000
*/*              structure is mapped by the DSECT MCSOTBL.       @L4A*/ 12066600
*/*------------------------------------------------------------------*/ 12077200
*     3 MCSOMSFG     BIT(8),     /* MSCOPE flags                 @L4A*/ 12085600
*       5 MCSOSALL   BIT(1),     /* *ALL specified for MSCOPE    @L4A*/ 12094000
*       5 MCSOSLST   BIT(1),     /* List of MSCOPE systems              12102400
*                                   specified                    @L4A*/ 12110800
*       5 *          BIT(6),     /* Reserved                     @L4A*/ 12119200
*     3 *            CHAR(1),    /* Reserved for alignment       @L4A*/ 12127600
*     3 MCSOMSPT     PTR(31),    /* Pointer to a list of MSCOPE         12136000
*                                   values                       @L4A*/ 12144400
*     3 MCSOMISC     BIT(8),     /* Miscellaneous Routing Info   @L5A*/ 12152800
*/*------------------------------------------------------------------*/ 12162000
*/* Undelivered - Should the Console be sent UD messages or not. @L7A*/ 12172600
*/*------------------------------------------------------------------*/ 12183200
*       5 MCSOUDY    BIT(1),     /* Yes - display UD messages    @L5A*/ 12184600
*       5 MCSOUDN    BIT(1),     /* No - Don't display UD messages      12186000
*                                      DEFAULT                   @L5A*/ 12187400
*/*------------------------------------------------------------------*/ 12188800
*/* Automation - Should the Console be sent automatable messages @L7A*/ 12190200
*/*              or not.                                         @L7A*/ 12191600
*/*------------------------------------------------------------------*/ 12193000
*       5 MCSOAUTY   BIT(1),     /*  YES - Queue automatable            12194400
*                                    messages.                   @L7A*/ 12195800
*       5 MCSOAUTN   BIT(1),     /*  No - Don't Queue automatable       12197200
*                                    messages.                   @L7A*/ 12198600
*/*------------------------------------------------------------------*/ 12198800
*/* Hardcopy  - Should the Console be sent hardcopy messages or  @L8A*/ 12199000
*/*              not.                                            @L8A*/ 12199200
*/*------------------------------------------------------------------*/ 12199400
*       5 MCSOHDCY   BIT(1),     /*  YES - receive hardcopy message     12199600
*                                    set                         @L8A*/ 12199800
*       5 MCSOHDCN   BIT(1),     /*  No - Don't receive hardcopy        12200000
*                                    message set (DEFAULT)       @L8A*/ 12200200
*       5 *          BIT(2),     /* Reserved                     @L8C*/ 12200400
*     3 MCSOFLAG     BIT(8),     /* Flags Byte                   @L5A*/ 12200500
*/*------------------------------------------------------------------*/ 12200600
*/* Overriding of security product:  The following will be the   @02A*/ 12200700
*/* order of processing for OPERPARMs as determined by the       @02A*/ 12200800
*/* following bits:                                              @02A*/ 12200900
*/*   MCSOVRDY = ON :  Yes - Override security product.          @02A*/ 12201000
*/*                    Processing will use this data area        @02A*/ 12201100
*/*                    (IEZVG111) to set the extended console's  @02A*/ 12201200
*/*                    attributes.                               @02A*/ 12201300
*/*   MCSOVRDN = ON :  No - Don't override security product.     @02A*/ 12201400
*/*                    (DEFAULT)                                 @02A*/ 12201500
*/*                    Processing will first search security     @02A*/ 12201600
*/*                    product for an OPERPARM segement.  If no  @02A*/ 12201700
*/*                    segment exists, processing will then use  @02A*/ 12201800
*/*                    this data area to set the extended        @02A*/ 12201900
*/*                    extended console's attributes             @02A*/ 12202000
*/*------------------------------------------------------------------*/ 12202100
*       5 MCSOVRDY   BIT(1),     /* Yes - Override security product     12202200
*                                                                @02A*/ 12202300
*       5 MCSOVRDN   BIT(1),     /* No - Don't override security        12202400
*                                   product (DEFAULT)            @02A*/ 12202500
*       5 *          BIT(6),     /* Reserved                     @02A*/ 12202600
*     3 *            CHAR(6);    /* Reserved                     @02C*/ 12202700
*@SPACE;                           /*                            @L1A*/ 12202800
* DCL                                                                   12204400
*   1  MCSOTBL BASED(MCSOMSPT),    /*                            @L4A*/ 12215000
*      3 MCSOMSNM FIXED(31),       /* Number of MSCOPE values           12225600
*                                     specified                  @L4A*/ 12236200
*      3 MCSOTSYS,                 /* Table of system names      @L4A*/ 12246800
*%IF MCSOGT8 = 'YES' %THEN %GOTO MCSOSTAR;                   /*  @L9A*/ 12254400
*        5 MCSOSYSE(8) CHAR(8);    /* Array of system names      @L9C*/ 12262000
.%GOTO MCSOEND;                                              /*  @L9A*/ 12269600
*%MCSOSTAR: ;                                                /*  @L9A*/ 12277200
*        5 MCSOSYSE(*) CHAR(8);    /* Array of system names      @L9C*/ 12284800
*%MCSOEND: ;                                                 /*  @L9A*/ 12292400
*@EJECT;                         /*                              @L2A*/ 12300000
