*        %GOTO IFAL20;   /*                                             00050000
         MACRO                                                          00100000
&NAME    IFASMFR2 &RECTYPE                                              00150000
.* * MACRO-NAME = IFASMFR2                                        @02C* 00200000
.* *                                                                  * 00250000
.* * PROPRIETARY STATEMENT =                                          * 00560000
.* *  LICENSED MATERIALS - PROPERTY OF IBM                            * 00580000
.* *  5647-A01 (C) COPYRIGHT IBM CORP. 1982, 2000                     * 00600000
.* *                                                                  * 00620000
.* * STATUS = HBB7703                                                 * 00630000
.* *                                                                  * 00640000
.* * EXTERNAL CLASSIFICATION: NONE                                @P4A* 00643300
.* * END OF EXTERNAL CLASSIFICATION:                              @P4A* 00646600
.* *                                                                  * 00650000
.* * MACMEAN IFASMFR2 MEANS SYSTEM MANAGEMENT FACILITY RECORD MAPPING * 00700000
.* * MACCOMP Y-2 SC102/BL27P                                          * 00750000
.* * MACSTAT Y-2 73298/42020                                          * 00800000
.* * METHOD OF ACCESS                                                 * 00850000
.* *   PL/S - INCLUDE MACRO FROM LIBRARY                              * 00900000
.* *           EXAMPLE - %INCLUDE SYSLIB(IFASMFR2)                    * 00950000
.* *                                                                  * 01000000
.* *          THIS MACRO EXPANDS RECORDS 20 -27.                      * 01050000
.* *                                                                  * 01100000
.* *                                                                    01150000
.* THIS IS AN SMF MACRO WHICH BUILDS SMF RECORDS 20-27. THE REQUIRED    01200000
.* FORMAT IS -                                                          01250000
.*                                                                      01300000
.*          IFASMFR2 &RECTYPE                                           01350000
.*                                                                      01400000
.* CHANGE ACTIVITY:                                                     01450000
.*                                                                      01500000
.* TYPE 26 RECORD - REMOVE ORG STMTS APPROX 147550,156550      @ZA12438 01550000
.* TYPE 26 RECORD - ADD ORG STMTS TO EVENTS,ACTUALS SECTIONS   @ZA17757 01600000
.* TYPE 26 RECORD - ADD JES2 ROUTING SECTION                   @G387P27 01650000
.* TYPE 26 RECORD - ADD JES2 NETWORK SECTION                   @ZA62109 01700000
.* TYPE 22 RECORD - ADD CHANNEL PATH SECTION & STORAGE CHANGE  @G860P27 01750000
.* TYPE 26 RECORD - ADD PRINT SECTION                          @ZA74830 01800000
.* TYPE 22 RECORD - GALLUP SUPPORT FOR TYPE 21                     @TCA 01816600
.* TYPE 22 RECORD - 3990 ADDED SUPPORT                         @YA19861 01833200
.* TYPE 22 RECORD - ADD SMF22IND VALUE '8' COMMENT                 @0KA 01836000
.* TYPE 23 RECORD - ADD TIME THE STATUS FUNCTION WAS SCHEDULED FOR @LRA 01838800
.*                  SMF INTERVAL SYNC SUPPORT                      @LRA 01844400
.* TYPE 22 RECORD - MOVE DYNAMIC I/O SECTION TO IOS COMP ID        @LSA 01847200
.* TYPE 21 Record - Transfer Mapping to DFP                        @01A 01848100
.* TYPE 22 RECORD - ADD SMF22IND VALUE '8' COMMENT                 @0KA 01849000
.* TYPE 23 RECORD - Include system-related data fields             @02A 01849500
.* Add External Classification                                     @P4A 01849700
.*                                                                      01850000
.* $H3=ES      ,JBB2133,830912,PDFS: EXTENDED STORE, TYPE 22       @H3A 01900000
.* $H4=VF      ,JBB2214,840320,PDFS: VECTORS SUPPORT, TYPE 22      @H4A 01950000
.* $T7=UZ90334 ,JBB2125,840523,PDFS: TRANSFER REC 25,26 TO SC141   @T7A 02000000
.* $T8=UZ90378 ,JBB2133,841226,PDFS: ADD JES2 TYPE 24 RECORD       @T8A 02050000
.* $T9=UZ90410 ,JBB2214,850620,PDFS: 3480 SUPPORT FOR TYPE 21      @T9A 02100000
.* $TC=YA11323 ,JBB2220,860902,PDFS: GALLUP SUPPORT FOR TYPE 22    @TCA 02112500
.* $DD=DCR290  ,HBB3310,871123,PDFS: TYPE 22 FOR >2G EXT. STOR     @DDA 02125000
.* $TE=OY27075 ,JBB3313,890309,PDLO: ADD INTEGRATED CRYPTO SERVICE      02125700
.*                                   FACILITY SUPPORT              @TEA 02126400
.* $0I=OY32650 ,JBB3313,901109,PDMF: TYPE 22 MAX LENGTH            @0IA 02127100
.* $0J=OY27449 ,JBB3313,901101,PDBR: BUFFER ALLOC PROCESSING       @0JA 02127800
.* $0K=OY59035 ,JBB2220,930131,PDSL: SMF22IND SMF RECORD CREATOR   @0KA 02128500
.*                                   INDICATOR FIELD NOT           @0KA 02129200
.*                                   DOCUMENTED CORRECTLY          @0KA 02129900
.* $H5=DYNAM   ,HBB4420,891231,PDMF: DYNAMIC I/O CONFIGURATION     @H5A 02131200
.* $P1=PH30835 ,HBB4420,900504,PDMF: DYNAMIC I/O CONFIGURATION     @P1A 02137400
.* $P2=PH30923 ,HBB4420,900604,PDMF: DYNAMIC I/O CONFIGURATION     @P2A 02143600
.* $P3=PH31941 ,HBB4420,901206,PDBR: Correct Dynam I/O Section ID  @P3A 02145200
.* $0I=OY32650 ,HBB4420,901109,PDMF: TYPE 22 MAX LENGTH            @0IA 02157700
.* $0J=OY27449 ,HBB4420,901101,PDBR: BUFFER ALLOC PROCESSING       @0JA 02164700
.* $LR=SYNCS   ,HBB4430,911108,PDDH: SMF INTERVAL SYNC SUPPORT     @LRA 02167000
.*                                   (STAGE 3)                     @LRA 02169300
.* $LS=PRSMM   ,HBB4430,920205,PDLQ: TRANSFER I/O CONFIGURATION CHANGE  02169600
.*                                   ELEMENT OF RECORD TYPE 22 TO       02169900
.*                                   SC1C3. NOTE THAT CHANGE ACTIVITY   02170200
.*                                   FLAGGING HAS BEEN REMOVED FOR      02170500
.*                                   PH30835, PH30923, AND PH31941.     02170800
.*                                                                 @LSA 02171100
.* $01=OY56189 ,HBB4410,920825,PDBR: DFP Records Transfer          @01A 02171200
.* $0K=OY59035 ,JBB2220,930131,PDSL: SMF22IND SMF RECORD CREATOR   @0KA 02171300
.*                                   INDICATOR FIELD NOT           @0KA 02171400
.*                                   DOCUMENTED CORRECTLY          @0KA 02171500
.* $02=OW03229 ,HBB5510,940325,PDDH: System data in SMF record     @02A 02171600
.* $P4=PN71727 ,HBB5520,941020,PDDH: CDPI: SHOWHDR Cleanup         @P4A 02171700
.*                                                                      02171800
.********************************************************************** 02200000
         AIF   (&RECTYPE EQ 20).IFAS020                                 02250000
         AIF   (&RECTYPE EQ 21).IFAS021                                 02300000
         AIF   (&RECTYPE EQ 22).IFAS022                         Y02034  02350000
         AIF   (&RECTYPE EQ 23).IFAS023                       @G743PJW  02400000
         AIF   (&RECTYPE EQ 24).IFAS024                           @T8A  02450000
         AIF   (&RECTYPE EQ 25).IFAS025                       @Y02BPSE  02500000
         AIF   (&RECTYPE EQ 26).IFAS026                         Y02120  02550000
.E5      ANOP                                                           02600000
         SPACE 3                                                        02650000
         MNOTE 4,'&RECTYPE INVALID RECORD TYPE SPECIFIED'               02700000
.CONTB   ANOP                                                           02750000
         MEXIT                                                          02800000
.IFAS020 ANOP                                                           02850000
         EJECT                                                          02900000
* JOB COMMENCEMENT RECORD WRITTEN WHEN A JOB IS INITIATED.              02950000
* LENGTH IS VARIABLE. MINIMUM OF 61 BYTES.                              03000000
*                                                                       03050000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    03100000
SMFRCD20 EQU   *         RECORD 20                                      03150000
SMF20LEN DS    BL2'0'    RECORD LENGTH                                  03200000
SMF20SEG DS    BL2'0'    SEGMENT DESCRIPTOR                             03250000
SMF20HDR EQU   *         HEADER SEGMENT                                 03300000
SMF20FLG DS    BL1'0'    HEADER FLAG BYTE                               03350000
SMF20RTY DS    BL1'0'    RECORD TYPE 20                                 03400000
SMF20TME DS    BL4'0'    TOD, USING TIME MACRO W/BIN. INTVL.            03450000
SMF20DTE DS    PL4'0000' DATE, PACKED/DEC FORM; 00YYDDDF                03500000
SMF20SID DS    CL4' '    SYSTEM ID                               Y02901 03550000
SMF20JBN DS    CL8' '    JOB NAME                                       03600000
SMF20RST DS    BL4'0'    READER START TIME                              03650000
SMF20RSD DS    PL4'0000' READER START DATE, PK/DEC FORM: 00YYDDDF       03700000
SMF20UID DS    CL8' '    USERID                                         03750000
SMF20RIN DS    BL2'0'                                          @G32FPRS 03800000
         ORG   SMF20RIN                                        @G32FPRL 03850000
SMF20RLO DS    BL2'0'    OFFSET TO RELOCATE SECTION            @G32FPRL 03900000
SMF20PGM DS    CL20' '   PROGRAMMERS NAME                               03950000
SMF20NAF DS    BL1'0'    NO. ACCOUNTING FIELDS                          04000000
SMF20ACT EQU   *         ACCOUNTING FIELDS                              04050000
* BEGINNING OF RELOCATE SECTION                                         04100000
* SMF20RLO IS ITS OFFSET FROM BEGINNING OF HEADER - SMF20HDR   @G32FPRL 04150000
SMF20RLA EQU   *         RELOCATABLE AREA                      @G32FPRL 04200000
SMF20RLS DS    BL2       SIZE OF RELOCATABLE AREA              @G32FPRL 04250000
SMF20GRP DS    CL8' '    RACF GROUP ID                         @G32FPRS 04300000
SMF20RUD DS    CL8' '    RACF USER ID                          @G32FPRS 04350000
SMF20TID DS    CL8' '    RACF TERMINAL ID                      @G32FPRS 04400000
         AGO   .CONTB                                                   04450000
.IFAS021 ANOP                                                           04500000
         EJECT                                                          04550000
         IGESMF21        Call DFP Macro To Expand Record           @01A 04600000
* Remove Inline Declares                                         30@01D 04650000
         AGO   .CONTB                                                   06250000
.IFAS022 ANOP                                                    Y02034 06300000
         EJECT                                                   Y02034 06350000
*  THIS RECORD IS WRITTEN AFTER EVERY IPL AND EACH TIME A VARY   Y02034 06400000
*  COMMAND IS PROCESSED FOR A CPU, CHANNEL OR STORAGE BOX,         @H5C 06433300
*  OR EACH TIME AN ACTIVATE COMMAND IS ISSUED.                     @H5A 06466600
*  LENGTH IS VARIABLE. MINIMUM OF 24.                            Y02034 06500000
*                                                                Y02034 06550000
         DS    0F                  ALIGN ON FULLWORD BDY         Y02034 06600000
SMFRCD22 EQU   *                   HEADER SEGMENT                Y02034 06650000
SMF22LEN DS    BL2                 RECORD LENGTH                 Y02034 06700000
SMF22SEG DS    BL2                 SEGMENT DESRIPTOR             Y02034 06750000
SMF22FLG DS    BL1                 HEADER FLAG BYTE              Y02034 06800000
SMF22RTY DS    BL1                 RECORD TYPE (22)              Y02034 06850000
SMF22TME DS    BL4                 TOD FROM TIME MACRO BINARY    Y02034 06900000
SMF22DTE DS    PL4                 DATE FROM TIME MACRO          Y02034 06950000
SMF22SID DS    CL4                 SYSTEM INDICATOR              Y02034 07000000
SMF22IND DS    BL2                 RECORD CREATOR INDICATOR      Y02034 07050000
*                                  X'0001' AT IPL                Y02034 07100000
*                                  X'0002' BY VARY ON            Y02034 07150000
*                                  X'0003' BY VARY OFF           Y02034 07200000
*                                  X'0007' BY VARY CHANNEL PATH ONLINE  07250000
*                                  OR OFFLINE                  @G860P27 07300000
*                                  X'0008' BY 3990 STATE CHANGE    @0KA 07312500
*                                  X'0009' BY ACTIVATE             @H5A 07325000
*                                  '0099' RECORD IS A CONTINUATION @0IA 07337500
SMF22ECT DS    BL2                 # OF ELEMENTS FOLLOWING       Y02034 07350000
SMF22RSC EQU   *                   RESOURCE ELEMENTS             Y02034 07400000
*                                  CPU ELEMENT                   Y02034 07450000
SMF22CFG DS    BL1                 CPU FLAGS                       @H4A 07500000
SMF22VFI EQU   X'80'               VECTOR FEATURE INDICATOR        @H4A 07550000
*                                  (1 = ONLINE)                    @H4A 07600000
SMF22CCP EQU   X'20'               CPU RECONFIG INDICATOR          @TEA 07625000
SMF22PID DS    BL1                 PROCESSOR ID X'01'            Y02034 07650000
SMF22CPN DS    BL2                 CPU MODEL #                   Y02034 07700000
SMF22RV1 DS    BL1                 RESV                          Y02034 07750000
SMF22CPA DS    BL1                 CPU ADDRESS                   Y02034 07800000
         ORG   SMF22RSC                                          Y02034 07850000
*                                  CHANNEL ELEMENT               Y02034 07900000
SMF22CSD DS    BL1                 CHANNEL SET ID              @G64APJW 07950000
SMF22CID DS    BL1                 CHANNEL ID X'02'              Y02034 08000000
SMF22CHN DS    BL2                 CHANNEL TYPE AND MODEL #      Y02034 08050000
SMF22CHA DS    BL1                 CHANNEL ADDRESS               Y02034 08100000
SMF22CPD DS    BL1                 CPU ADDRESS                   Y02034 08150000
         ORG   SMF22RSC                                          Y02034 08200000
*                                  STORAGE ELEMENT(MEMORY)       Y02034 08250000
SMF22MFL DS    BL1                 MEMORY FLAGS                @ZMC1115 08300000
SMF22SKP EQU   X'80'               REAL MEMORY IS INTERLEAVED  @ZMC1115 08350000
SMF22TID DS    BL1                 STORAGE ID X'03'              Y02034 08400000
SMF22PGL DS    F                   ADDR OF LOWEST PAGE IN STOR @G860P27 08450000
SMF22NPG DS    F                   # OF PAGES IN REAL STORAGE  @G860P27 08500000
         ORG   SMF22RSC                                        @Y30AQPF 08550000
*                                  IPL ELEMENT                 @Y30AQPF 08600000
SMF22RV4 DS    BL1                 RESV                        @Y30AQPF 08650000
SMF22IID DS    BL1                 IPL ID X'04'                @Y30AQPF 08700000
SMF22ION DS    BL40                UNITS ONLINE AT IPL         @Y30AQPF 08750000
         ORG   SMF22RSC                                        @Y30AQPF 08800000
*                                  VARY S ONLINE ELEMENT       @Y30AQPF 08850000
SMF22RV5 DS    BL1                 RESV                        @Y30AQPF 08900000
SMF22NID DS    BL1                 VARY S ONLINE ID X'05'      @Y30AQPF 08950000
SMF22RVA DS    BL1                 RESV                        @Y30AQPF 09000000
SMF22NSI DS    BL3                 SUBSYSTEM ID                @Y30AQPF 09050000
         ORG   SMF22RSC                                        @Y30AQPF 09100000
*                                  VARY S OFFLINE ELEMTNT      @Y30AQPF 09150000
SMF22RV6 DS    BL1                 RESV                        @Y30AQPF 09200000
SMF22FID DS    BL1                 VARY S OFFLINE ID X'06'     @Y30AQPF 09250000
SMF22RVB DS    BL1                 RESV                        @Y30AQPF 09300000
SMF22FSI DS    BL3                 SUBSYSTEM ID                @Y30AQPF 09350000
         ORG   SMF22RSC                                        @G860P27 09400000
*                                  CHANNEL PATH SECTION        @G860P27 09450000
SMF22RV7 DS    BL1                 RESERVED                    @G860P27 09500000
SMF22UID DS    BL1                 CHANNEL PATH SECT ID X'07'  @G860P27 09550000
SMF22PAR DS    0CL256              CHANNEL PATH ID SECTION     @G860P27 09600000
SMF22CPI DS    256BL1              ARRAY OF 256 ENTRIES TO MAP EACH     09650000
*                                  UNIQUE CPID                 @GSE4P27 09700000
SMF22PFG EQU   X'80'               1=CPID VALID FOR THIS INSTALLATION.  09750000
*                                  IF 0, SMF22POW=0  AND SMF22PON=0     09800000
*                                                              @G860P27 09850000
SMF22POW EQU   X'40'               1=CPID OWNED BY THIS SYSTEM.         09900000
*                                  IF 1, SMF22PFG=1. IF 0, SMF22PON=0   09950000
*                                                              @G860P27 10000000
SMF22PON EQU   X'20'               1=CPID IS ONLINE. IF 1, SMF22PFG=1   10050000
*                                  AND SMF22POW=1              @G860P27 10100000
         ORG   SMF22RSC                                        @ZMC1361 10150000
*                                  VARY CHANNEL PATH SECTION   @ZMC1361 10200000
SMF22RV8 DS    BL1                 RESERVED                    @ZMC1361 10250000
SMF22RID DS    BL1                 CHANNEL PATH SECT ID X'08'  @ZMC1361 10300000
SMF22CNT DS    BL1                 COUNT OF CHPIDS IN SECTION  @ZMC1361 10350000
SMF22CHI DS    256BL1              CHANNEL PATH IDS            @ZMC1361 10400000
         ORG   SMF22RSC                                            @H3A 10450000
*                                  EXTENDED STORAGE ELEMENT        @H3A 10500000
         DS    BL1                 RESERVED                        @H3A 10550000
SMF22XID DS    BL1                 EXTENDED STORAGE ID X'09'       @H3A 10600000
SMF22XAD DS    F                   PAGE ADDR OF LOWEST PAGE IN     @H3A 10609600
*                                  EXTENDED STORAGE BLOCK          @H3A 10619200
SMF22XNP DS    F                   # OF PAGES IN EXTENDED STORAGE  @H3A 10628800
*                                  BLOCK                           @H3A 10638400
         ORG   SMF22RSC                                            @TCA 10648000
*                                  STORAGE CONTROL ELEMENT         @TCA 10657600
         DS    BL1                 RESERVED                        @TCA 10667200
SMF22GID DS    BL1                 STORAGE CONTROL ID X'0A'        @TCA 10676800
SMF22SSI DS    BL2                 SUBSYSTEM IDENTIFIER            @TCA 10686400
SMF22MDL DS    BL1                 SUBSYSTEM MODEL IDENTIFIER      @TCA 10696000
SMF22VOL DS    CL6                 ORIGINATING DEVICE VOLSER       @TCA 10705600
SMF22CUA DS    BL2                 ORIGINATING DEVICE ID           @TCA 10715200
SMF22CCA DS    BL1                 ORIGINATING DEVICE CCA          @TCA 10724800
SMF22DDC DS    BL1                 ORIGINATING DEVICE DDC          @TCA 10734400
SMF22PDC DS    BL1                 ORIGINATING DEVICE PRIOR DDC    @TCA 10744000
SMF22SCS DS    BL1                 SUBSYSTEM CACHING STATUS        @TCA 10753600
SMF22PCS DS    BL1                 SUBSYSTEM CACHING PRIOR STATUS  @TCA 10763200
SMF22SNV DS    BL1                 SUBSYSTEM NVS STATUS            @TCA 10772800
SMF22PNV DS    BL1                 SUBSYSTEM NVS PRIOR STATUS      @TCA 10782400
SMF22SDS DS    BL2                 ORIGINATING DEVICE STATUS       @TCA 10792000
SMF22PDS DS    BL2                 ORIG. DEVICE PRIOR STATUS       @TCA 10801600
SMF22ADS DS    BL1                 ORIG.DEVICE ADDITIONAL STAT @YA19861 10811200
         DS    BL1                 RESERVED                    @YA19861 10820800
SMF22PAD DS    BL1                 ORIG.DEVICE PRIOR ADD.STAT  @YA19861 10830400
         DS    BL1                 RESERVED                    @YA19861 10840000
         ORG   SMF22RSC                                            @0IA 10840100
*                                  CONTINUATION SECTION            @0IA 10840200
SMF22L99 DS    BL1                 LENGTH OF SECTION               @0IA 10840300
SMF22CON DS    BL1                RECORD WILL BE CONTINUED ID '99' @0IA 10840400
.* 111 LINES DELETED FROM REC 22 (TRANSFER OWNERSHIP TO SC1C3)  111@LSD 10848700
         EJECT                                                     @LSA 10857000
         IOSDSMFR         CALL SC1C3 TO EXPAND THE I/O CONFIGURATION    10865300
.*                               CHANGE ELEMENT OF REC TYPE 22     @LSA 10873600
         AGO   .CONTB                                            Y02034 10882200
.IFAS023 ANOP                                                  @G743PJW 10900000
*                                                              @G743PJW 10950000
* SMF TYPE 23 RECORD - SMF STATISTICS                          @G743PJW 11000000
*                                                              @G743PJW 11050000
* THIS RECORD IS WRITTEN AT USER SPECIFIED INTERVALS TO        @G743PJW 11100000
* RECORD SMF STATISTICS COLLECTED DURING THE LAST INTERVAL     @G743PJW 11150000
*                                                              @G743PJW 11200000
* THE RECORD LENGTH IS VARIABLE                                @G743PJW 11250000
*                                                              @G743PJW 11300000
SMFRCD23 DSECT ,                                               @G743PJW 11350000
*                                                              @G743PJW 11400000
*        SMF RECORD HEADER SEGMENT                             @G743PJW 11450000
*                                                              @G743PJW 11500000
SMF23LEN DS    H'0'      RECORD LENGTH                         @G743PJW 11550000
SMF23SEG DS    H'0'      SEGMENT DESCRIPTOR                    @G743PJW 11600000
SMF23FLG DS    BL1       HEADER FLAG BYTE                      @G743PJW 11650000
SMF23RTY DS    BL1       RECORD TYPE - 23                      @G743PJW 11700000
SMF23TME DS    CL4       RECORD WRITTEN TIME                   @G743PJW 11750000
SMF23DTE DS    CL4       RECORD WRITTEN DATE                   @G743PJW 11800000
SMF23SID DS    CL4       SYSTEM IDENTIFICATION                 @G743PJW 11850000
*                                                              @G743PJW 11900000
*        SELF DEFINING SECTION                                 @G743PJW 11950000
*                                                              @G743PJW 12000000
         DS    BL2       RESERVED                              @VS49902 12050000
SMF23SLS DS    0CL24     SELF DEFINING SECTION                 @G744PJW 12100000
SMF23POF DS    F         OFFSET TO PRODUCT SEGMENT             @VS49902 12150000
SMF23PLN DS    H         LENGTH OF PRODUCT SEGMENT             @G743PJW 12200000
SMF23PON DS    H         NUMBER OF PRODUCT SEGMENTS            @G743PJW 12250000
SMF23SOF DS    F         OFFSET TO SYSTEM SEGMENT              @VS49902 12300000
SMF23SLN DS    H         LENGTH OF SYSTEM SEGMENT              @G743PJW 12350000
SMF23SON DS    H         NUMBER OF SYSTEM SEGMENTS             @G743PJW 12400000
SMF23ROF DS    F         OFFSET TO SMF SEGMENT                 @VS49902 12450000
SMF23RLN DS    H         LENGTH OF SMF SEGMENT                 @G743PJW 12500000
SMF23RON DS    H         NUMBER OF SMF SEGMENTS                @G743PJW 12550000
*                                                              @G743PJW 12600000
*        PRODUCT SECTION                                       @G743PJW 12650000
*                                                              @G743PJW 12700000
SMF23PRS DSECT ,                                               @G743PJW 12750000
SMF23TID DS    H         SUBTYPE ID - 0                        @G743PJW 12800000
SMF23RVN DS    CL2       RECORD VERSION - '01'                 @G743PJW 12850000
SMF23PNM DS    CL8       PRODUCT NAME - SMF                    @G743PJW 12900000
*                                                              @G743PJW 12950000
*        SYSTEM DEFINITION SEGMENT                             @G743PJW 13000000
*                                                              @G743PJW 13050000
SMF23SDS DSECT ,                                               @G743PJW 13100000
SMF23INT DS    CL6       INTERVAL IN HHMMSS                    @G743PJW 13150000
SMF23RLS DS    CL4       OPERATING SYSTEM RELEASE NUMBER       @G743PJW 13200000
SMF23OSL DS    CL8       MVS Product Name (copied from CVTPRODN)   @0JA 13225000
SMF23TOD DS    CL8       Time the STATUS function was scheduled    @LRA 13233300
*                        (in TOD format)                           @LRA 13241600
SMF23SYN DS    CL8       System name                               @02A 13244400
SMF23SYP DS    CL8       Sysplex name                              @02A 13247200
*                                                              @G743PJW 13250000
*        SMF STATISTICS SEGMENT                                @G743PJW 13300000
*                                                              @G743PJW 13350000
SMF23SMF DSECT ,                                               @G743PJW 13400000
SMF23BFW DS    F         NUMBER OF BUFFERS WRITTEN             @G743PJW 13450000
SMF23BFQ DS    F         MAXIMUM NUMBER OF FULL BUFFERS        @G743PJW 13500000
SMF23SUS DS    F         NUMBER OF TIMES SUSPENDED             @G743PJW 13550000
SMF23RCW DS    F         NUMBER OF RECORDS WRITTEN             @G743PJW 13600000
SMF23BFA DS    F         Amount of each Buffer Allocation Request  @0JA 13606200
SMF23BFT DS    F         TOTAL Amount of Buffer Storage Currently  @0JA 13612400
*                        Allocated                                 @0JA 13618600
SMF23BFH DS    F         High Water Mark of Buffer Storage         @0JA 13624800
*                        Allocation                                @0JA 13631000
SMF23BFM DS    F         Buffer Storage Maximum in affect          @0JA 13637200
SMF23BFL DS    F         Buffer Warning Level in affect            @0JA 13643400
         AGO   .CONTB                                          @G743PJW 13650000
.IFAS024 ANOP                                                      @T8A 13700000
         EJECT                                                     @T8A 13750000
         IAZSMFR 24      CALL SC141 TO EXPAND REC 24               @T8A 13800000
         AGO   .CONTB                                              @T8A 13850000
.IFAS025 ANOP                                                  @Y02BPSE 13900000
.* 45 LINES DELETED(MAP OF REC 25)TO TRANSFER OWNERSHIP TO SC141 45@T7D 13950000
         EJECT                                                 @Y02BPSE 14000000
         IAZSMFR 25      CALL SC141 TO EXPAND REC 25               @T7A 14050000
         AGO   .CONTB                                                   14100000
.IFAS026 ANOP                                                    Y02120 14150000
.* 185 LINES DELETED(MAP OF REC 26) TO XFER OWNERSHIP TO SC141  185@T7D 14200000
         EJECT                                                   Y02120 14250000
         IAZSMFR 26      CALL SC141 TO EXPAND REC 26               @T7A 14300000
         AGO   .CONTB                                            Y02120 14350000
         MEND       */                                                  14400000
 %IFAL20: INCLIAZ='';             /* INIT SWITCH FOR IAZ MACROS  @T7A*/ 14450000
         %IF IFAR20='' %THEN %GOTO IFAL21;                   /*  @T7C*/ 14500000
    DCL 1 SMFRCD20 BASED(SMF20PTR) BDY(WORD),                           14550000
 /* RECORD TYPE 20 - JOB INITIATION                                  */ 14600000
 /* WRITTEN BY JOB INITIATION                                        */ 14650000
         3 SMF20LEN FIXED(15),    /* RDW RECORD LENGTH               */ 14700000
         3 SMF20SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 14750000
         3 SMF20FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 14800000
         3 SMF20RTY FIXED(8),     /* RECORD TYPE 20                  */ 14850000
         3 SMF20TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 14900000
         3 SMF20DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 14950000
         3 SMF20SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 15000000
         3 SMF20JBN CHAR(8),      /* JOB NAME                        */ 15050000
         3 SMF20RST FIXED(31) BDY(HWORD), /*READER START TIME(.01 SEC)*/15100000
         3 SMF20RSD CHAR(4),      /* READER START DATE               */ 15150000
         3 SMF20UIF CHAR(8),      /* USER ID FIELD                   */ 15200000
          5 SMF20UID CHAR(8),                                           15250000
         3 SMF20RIN FIXED(15) BDY(HWORD),            /*      @G32FPRL*/ 15300000
           5 SMF20RLO FIXED(15) BDY(HWORD), /* OFFSET FROM BEGINNING    15350000
                                              OF RECORD TO RELOCATABLE  15400000
                                              AREA           @G32FPRL*/ 15450000
         3 SMF20PGM CHAR(20),     /* PROGRAMMER'S NAME               */ 15500000
         3 SMF20NAF FIXED(8),     /* # OF ACCT FIELDS FOLLOWING      */ 15550000
         3 SMF20ACT CHAR(*);      /* ACCOUNTING FIELDS       @G32FPRL*/ 15600000
    DCL 1 SMF20AFD BASED BDY(BYTE), /* ACCT SECTION                  */ 15650000
         3 SMF20ANC PTR(8),       /* # OF CHAR IN THIS ACCT FIELD    */ 15700000
         3 SMF20BCD CHAR(*);      /* ACCT FIELD CHARACTERS           */ 15750000
         /* RELOCATABLE AREA  @G32FPRL*/                                15800000
    DCL 1 SMF20RLA BASED(ADDR(SMF20FLG)+SMF20RLO) BDY(BYTE),            15850000
         3 SMF20RLS FIXED(15) BDY(BYTE), /* SIZE OF RELOCATABLE AREA    15900000
                                                             @G32FPRL*/ 15950000
         3 SMF20GRP CHAR(8),      /* RACF GROUP ID           @G32FPRS*/ 16000000
         3 SMF20RUD CHAR(8),      /* RACF USER ID            @G32FPRS*/ 16050000
         3 SMF20TID CHAR(8);      /* RACF TERMINAL ID        @G32FPRS*/ 16100000
 %IFAL21: IF IFAR21='' %THEN %GOTO IFAL22;                              16150000
                                    /* Remove Inline Declares  31@01D*/ 16200000
 %INCLUDE SYSLIB(IGESMF21) NOSEG;   /* Call DFP to Expand Record @01A*/ 16250000
 %IFAL22: IF IFAR22='' %THEN %GOTO IFAL23;                              17850000
    DCL 1 SMFRCD22 BASED(SMF22PTR) BDY(WORD),                           17900000
 /* RECORD TYPE 22 - CPU, CHANNEL AND STORAGE CONFIGURATION          */ 17950000
 /* WRITTEN AT IPL AND BY VARY ON OR OFF WHENEVER A CPU, CHANNEL OR  */ 18000000
 /* STORAGE BOX IS CHANGED. OR WRITTEN WHEN A DYNAMIC I/O            */ 18033300
 /* CONFIGURATION CHANGE IS PERFORMED VIA THE ACTIVATE COMMAND.      */ 18066600
         3 SMF22LEN FIXED(15),    /* RDW RECORD LENGTH               */ 18100000
         3 SMF22SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 18150000
         3 SMF22FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 18200000
         3 SMF22RTY FIXED(8),     /* RECORD TYPE 22                  */ 18250000
         3 SMF22TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 18300000
         3 SMF22DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 18350000
         3 SMF22SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 18400000
         3 SMF22IND FIXED(15),    /* RECORD CREATOR INDICATOR           18450000
                                     X'0001' AT IPL                     18500000
                                     X'0002' BY VARY ON                 18550000
                                     X'0003' BY VARY OFF                18600000
                                     X'0007' BY VARY CHANNEL PATH       18650000
                                     ONLINE OR OFFLINE       @G860P27   18675000
                                     X'0008' BY 3990 STATE CHANGE @0KA  18687500
                                     X'0009' FOR AN I/O                 18700000
                                     CONFIGURATION CHANGE        @H5C   18716600
                                 '0099' RECORD IS A CONTINUATION @0IA*/ 18733200
         3 SMF22ECT FIXED(15);    /* # RESOURCE ELEMENTS FOLLOWING   */ 18750000
    DCL 1 SMF22CPU BASED BDY(HWORD), /* CPU ELEMENT                  */ 18800000
         3 SMF22CFG CHAR(1),      /* CPU FLAGS                   @H4C*/ 18850000
           5 SMF22VFI BIT(1),     /* VECTOR FEATURE INDICATOR           18900000
                                     (1 = ONLINE)                @H4A*/ 18950000
           5    *        BIT(1),     /* RESERVED                 @TEA*/ 18975000
           5    SMF22CCP BIT(1),     /* CPU RECONFIG INDICATOR   @TEA*/ 19000000
           5    *        BIT(5),     /* RESERVED                 @TEC*/ 19025000
         3 SMF22PID FIXED(8),     /* ELEMENT ID, X'01' FOR CPU       */ 19050000
         3 SMF22CPN CHAR(2),      /* CPU MODEL #                     */ 19100000
         3 SMF22RV1 CHAR(1),      /* RESV                            */ 19150000
         3 SMF22CPA CHAR(1);      /* CPU ADDRESS                     */ 19200000
    DCL 1 SMF22CHL BASED BDY(HWORD), /* CHANNEL ELEMENT              */ 19250000
         3 SMF22CSD CHAR(1),      /* CHANNEL SET ID        @G64APJW  */ 19300000
         3 SMF22CID FIXED(8),     /* ELEMENT ID, X'02' FOR CHANNEL   */ 19350000
         3 SMF22CHN CHAR(2),      /* CHANNEL TYPE AND MODEL #        */ 19400000
         3 SMF22CHA CHAR(1),      /* CHANNEL ADDRESS                 */ 19450000
         3 SMF22CPD CHAR(1);      /* CPU ADDRESS                     */ 19500000
    DCL 1 SMF22STR BASED BDY(HWORD), /* STORAGE ELEMENT              */ 19550000
         3 SMF22MFL CHAR(1),      /* MEMORY FLAGS            @ZMC1115*/ 19600000
            4 SMF22SKP BIT(1),    /* REAL MEMORY IS INTERLEAVED         19650000
                                                             @ZMC1115*/ 19700000
         3 SMF22TID FIXED(8),     /* ELEMENT ID, X'03' FOR STORAGE   */ 19750000
         3 SMF22PGL FIXED(31) BDY(HWORD),    /* ADDR OF LOWEST PAGE     19800000
                                        IN STORAGE           @G860P27*/ 19850000
         3 SMF22NPG FIXED(31) BDY(HWORD);    /* # OF PAGES IN           19900000
                                           STORAGE           @G860P27*/ 19950000
    DCL 1  SMF22IPL BASED BDY(BYTE),   /* IPL ELEMENT        @Y30AQPF*/ 20000000
         3 SMF22RV4 CHAR(1),       /*RESV                    @Y30AQPF*/ 20050000
         3 SMF22IID FIXED(8),      /* ELEMENT ID, X'04' FOR IPL         20100000
                                        @Y30AQPF*/                      20150000
         3 SMF22ION BIT(320);      /* SS/I UNITS ONLINE AT IPL          20200000
                                       @Y30AQPF*/                       20250000
    DCL 1 SMF22VON BASED BDY(BYTE), /* VARY S ONLINE ELEMENT @Y30AQPF*/ 20300000
         3 SMF22RV5 CHAR(1),       /* RESERVED               @Y30AQPF*/ 20350000
         3 SMF22NID FIXED(8),      /* ELEMENT ID, X'05' FOR VARY ONLI   20400000
                                       @Y30AQPF*/                       20450000
         3 SMF22RVA CHAR(1),       /* RESERVED               @Y30AQPF*/ 20500000
         3 SMF22NSI CHAR(3);       /* SUBSYSTEM ID           @Y30AQPF*/ 20550000
    DCL 1 SMF22VOF BASED BDY(BYTE), /* VARY S OFFLINE ELEMT  @Y30AQPF*/ 20600000
         3 SMF22RV6 CHAR(1),       /* RESERVED               @Y30AQPF*/ 20650000
         3 SMF22FID FIXED(8),      /* ELEMENT ID, X'06' FOR VARY OFFL   20700000
                                       @Y30AQPF*/                       20750000
         3 SMF22RVB CHAR(1),       /* RESERVED               @Y30AQPF*/ 20800000
         3 SMF22FSI CHAR(3);       /* SUBSYSTEM ID           @Y30AQPF*/ 20850000
    DCL 1 SMF22CHP BASED BDY(BYTE), /* CHANNEL PATH SECTION  @G860P27*/ 20900000
         3 SMF22RV7 CHAR(1),       /* RESERVED               @G860P27*/ 20950000
         3 SMF22UID FIXED(8),      /* ELEMENT ID, X'07' FOR CHANNEL     21000000
                                      PATH SECTION           @G860P27*/ 21050000
         3 SMF22PAR CHAR(256),    /* CHANNEL PATH ID SECTION @G860P27*/ 21100000
         4 SMF22CPI(256) CHAR(1),  /* ARRAY OF 256 TO MAP EACH UNIQUE   21150000
                                      CPID                   @G860P27*/ 21200000
         5 SMF22PFG BIT(1),        /* 1=CPID VALID FOR THIS             21250000
                                      INSTALLATION. IF 0, SMF22POW=0    21300000
                                      AND SMF22PON=0         @G860P27*/ 21350000
         5 SMF22POW BIT(1),        /* 1=CPID OWNED BY THIS              21400000
                                      SYSTEM. IF 1, SMF22PFG=1. IF 0,   21450000
                                          SMF22PON=0         @G860P27*/ 21500000
         5 SMF22PON BIT(1);        /* 1=CPID IS ONLINE. IF 1, SMF22PFG=121550000
                                      AND SMF22POW=1         @G860P27*/ 21600000
    DCL 1 SMF22CHR BASED BDY(BYTE), /* VARY CHANNEL PATH SECTION        21650000
                                                             @ZMC1361*/ 21700000
         3 SMF22RV8 CHAR(1),       /* RESERVED               @ZMC1361*/ 21750000
         3 SMF22RID FIXED(8),      /* ELEMENT ID, X'08' FOR CHANNEL     21800000
                                      PATH SECTION           @ZMC1361*/ 21850000
         3 SMF22CNT FIXED(8),      /* COUNT OF CHPID'S IN THIS          21900000
                                      SECTION                @ZMC1361*/ 21950000
         3 SMF22CHI (*) CHAR(1);   /* CHANNEL PATH ID        @ZMC1361*/ 22000000
    DCL 1 SMF22XST BASED BDY(HWORD), /* EXTENDED STORAGE ELEMENT @H3A*/ 22050000
         3 * CHAR(1),              /* RESERVED                   @H3A*/ 22100000
         3 SMF22XID FIXED(8),     /* ELEMENT ID, X'09' FOR EXTENDED     22150000
                                     STORAGE                     @H3A*/ 22200000
         3 SMF22XAD FIXED(31) BDY(HWORD),/* PAGE ADDRESS OF LOWEST PAGE 22208900
                      IN THIS EXTENDED STORAGE BLOCK             @H3A*/ 22217800
         3 SMF22XNP FIXED(31) BDY(HWORD);    /* # OF PAGES IN EXTENDED  22226700
                                           STORAGE BLOCK         @H3A*/ 22235600
    DCL 1 SMF22SCE BASED BDY(HWORD), /* STORAGE CONTROL ELEMENT  @TCA*/ 22244500
         3 * CHAR(1),              /* RESERVED                   @TCA*/ 22253400
         3 SMF22GID FIXED(8),     /* ELEMENT ID, X'0A' FOR STORAGE      22262300
                                     CONTROL                     @TCA*/ 22271200
         3 SMF22SSI CHAR(2),      /* SUBSYSTEM IDENTIFIER        @TCA*/ 22280100
         3 SMF22MDL CHAR(1),      /* SUBSYSTEM MODEL IDENTIFIER  @TCA*/ 22289000
         3 SMF22VOL CHAR(6),      /* ORIGINATING DEVICE VOLSER   @TCA*/ 22297900
         3 SMF22CUA CHAR(2),      /* ORIGINATING DEVICE ID       @TCA*/ 22306800
         3 SMF22CCA CHAR(1),      /* ORIGINATING DEVICE CCA      @TCA*/ 22315700
         3 SMF22DDC CHAR(1),      /* ORIGINATING DEVICE DDC      @TCA*/ 22324600
         3 SMF22PDC CHAR(1),      /* ORIGINATING DEV PRIOR DDC   @TCA*/ 22333500
         3 SMF22SCS BIT(8),       /* SUBSYSTEM CACHING STATUS    @TCA*/ 22342400
         3 SMF22PCS BIT(8),       /* SUBSYS CACHING PRIOR STATUS @TCA*/ 22351300
         3 SMF22SNV BIT(8),       /* SUBSYSTEM NVS STATUS        @TCA*/ 22360200
         3 SMF22PNV BIT(8),       /* SUBSYSTEM NVS PRIOR STATUS  @TCA*/ 22369100
         3 SMF22SDS BIT(16),      /* ORIGINATING DEVICE STATUS   @TCA*/ 22378000
         3 SMF22PDS BIT(16),      /* ORIG. DEVICE PRIOR STATUS   @TCA*/ 22386900
         3 SMF22ADS BIT(8),         /* ORIGINATING DEVICE ADDITIONAL    22395800
                                       STATUS               @YA19861A*/ 22404700
         3 * BIT(8),                /* RESERVED             @YA19861A*/ 22413600
         3 SMF22PAD BIT(8),         /* ORIGINATING DEVICE PRIOR         22422500
                                       ADDITIONAL STATUS    @YA19861A*/ 22431400
         3 * BIT(8);                /* RESERVED             @YA19861A*/ 22440300
   %INCLUDE SYSLIB(IOSDSMFR) NOSEG; /* INCLUDE IOS TYPE 22 MACRO @LSA*/ 22449200
 /* 123 LINES DELETED FROM RECORD TYPE 22 MAP (I/O CONFIGURATION        22458100
        CHANGE ELEMENT(TO TRANSFER OWNERSHIP TO SC1C3)        123@LSD*/ 22467000
    DCL 1 SMF22CIS BASED BDY(BYTE), /* CONTINUATION SECTION      @0IA*/ 22475900
         3 SMF22L99 FIXED(8),       /* LENGTH OF SECTION         @0IA*/ 22484800
         3 SMF22CON FIXED(8);  /* RECORD TO BE CONTINUED ID '99' @0IA*/ 22493900
 %IFAL23: IF IFAR23='' %THEN %GOTO IFAL25;                              22496900
 /***********************************************************@G743PJW*/ 22500000
 /*                                                          @G743PJW*/ 22550000
 /* SMF TYPE 23 RECORD - SMF STATISTICS                      @G743PJW*/ 22600000
 /*                                                          @G743PJW*/ 22650000
 /* THIS RECORD IS WRITTEN AT USER SPECIFIED INTERVALS       @G743PJW*/ 22700000
 /* TO RECORD SMF STATISTICS COLLECTED DURING THE INTERVAL.  @G743PJW*/ 22750000
 /*                                                          @G743PJW*/ 22800000
 /* THE RECORD LENGTH IS VARIABLE.                           @G743PJW*/ 22850000
 /*                                                          @G743PJW*/ 22900000
 /***********************************************************@G743PJW*/ 22950000
 DCL 1 SMFRCD23 BASED(SMF23PTR),   /*                        @G743PJW*/ 23000000
       2 SMF23LEN FIXED(15),       /* RECORD LENGTH          @G743PJW*/ 23050000
       2 SMF23SEG FIXED(15),       /* SEGMENT DESCRIPTOR     @G743PJW*/ 23100000
       2 SMF23FLG CHAR(1),         /* HEADER FLAG BYTE       @G743PJW*/ 23150000
       2 SMF23RTY FIXED(8),        /* RECORD TYPE - 23       @G743PJW*/ 23200000
       2 SMF23TME FIXED(31) BDY(HWORD),  /* RECORD WRITTEN TIME         23233300
                                                             @G743PJW*/ 23266600
       2 SMF23DTE CHAR(4),         /* RECORD WRITTEN DATE YYDDDF        23300000
                                                             @G743PJW*/ 23350000
       2 SMF23SID CHAR(4),         /* SYSTEM IDENTIFICATION  @G743PJW*/ 23400000
           /*  SELF DEFINING SECTION    @G743PJW*/                      23450000
       2 * FIXED(15),              /* RESERVED               @VS49902*/ 23500000
       2 SMF23SLS,                 /*                        @G743PJW*/ 23550000
         3 SMF23POF FIXED(31),     /* OFFSET TO PRODUCT SEGMENT         23600000
                                                             @VS49902*/ 23650000
         3 SMF23PLN FIXED(15),     /* LENGTH OF PRODUCT SEGMENT         23700000
                                                             @G743PJW*/ 23750000
         3 SMF23PON FIXED(15),     /* NUMBER OF PRODUCT SEGMENTS        23800000
                                                             @G743PJW*/ 23850000
         3 SMF23SOF FIXED(31),     /* OFFSET TO SYSTEM SEGMENT          23900000
                                                             @VS49902*/ 23950000
         3 SMF23SLN FIXED(15),     /* LENGTH OF SYSTEM SEGMENT          24000000
                                                             @G743PJW*/ 24050000
         3 SMF23SON FIXED(15),     /* NUMBER OF SYSTEM SEGMENTS         24100000
                                                             @G743PJW*/ 24150000
         3 SMF23ROF FIXED(31),     /* OFFSET TO SMF SEGMENT  @VS49902*/ 24200000
         3 SMF23RLN FIXED(15),     /* LENGTH OF SMF SEGMENT  @G743PJW*/ 24250000
         3 SMF23RON FIXED(15);     /* NUMBER OF SMF SEGMENTS @G743PJW*/ 24300000
            /* PRODUCT SECTION   @G743PJW*/                             24350000
   DCL 1 SMF23PRS BASED(ADDR(SMFRCD23)+SMF23POF), /*         @G743PJW*/ 24400000
         2 SMF23TID FIXED(15),     /* SUBTYPE ID - 0         @G743PJW*/ 24450000
         2 SMF23RVN CHAR(2),       /* RECORD VERSION NUMBER - 01        24500000
                                                             @G743PJW*/ 24550000
         2 SMF23PNM CHAR(8);       /* PRODUCT NAME - SMF     @G743PJW*/ 24600000
            /* SYSTEM DEFINITION SEGMENT    @G743PJW*/                  24650000
   DCL 1 SMF23SDS BASED(ADDR(SMFRCD23)+SMF23SOF),  /*        @G743PJW*/ 24700000
         2 SMF23INT CHAR(6),       /* INTERVAL - HHMMSS      @G743PJW*/ 24750000
         2 SMF23RLS CHAR(4),       /* OPERATING SYSTEM RELEASE          24800000
                                      NUMBER                 @G743PJW*/ 24850000
         2 SMF23OSL CHAR(8),        /* MVS Product Name (copied from    24866600
                                       CVTPRODN)                 @0JA*/ 24883200
         2 SMF23TOD CHAR(8),        /* Time the STATUS function was     24888800
                                       scheduled (in TOD format) @LRA*/ 24894400
         2 SMF23SYN CHAR(8),              /* System name         @02A*/ 24896200
         2 SMF23SYP CHAR(8);              /* Sysplex name        @02A*/ 24898000
            /*  SMF STATISTICS SECTION          @G743PJW*/              24900000
   DCL 1 SMF23SMF BASED(ADDR(SMFRCD23)+SMF23ROF),       /*   @G743PJW*/ 24950000
         2 SMF23BFW FIXED(31),     /* # OF BUFFERS WRITTEN   @G743PJW*/ 25000000
         2 SMF23BFQ FIXED(31),     /* MAX # OF FULL BUFFERS  @G743PJW*/ 25050000
         2 SMF23SUS FIXED(31),     /* # OF TIMES SUSPENDED   @G743PJW*/ 25100000
         2 SMF23RCW FIXED(31),     /* # OF RECORDS WRITTEN   @G743PJW*/ 25108300
         2 SMF23BFA FIXED(31),      /* Amount of each Buffer Allocation 25116600
                                       Request                   @0JA*/ 25124900
         2 SMF23BFT FIXED(31),      /* TOTAL Amount of Buffer Storage   25133200
                                    Currently Allocated          @0JA*/ 25141500
         2 SMF23BFH FIXED(31),      /* High Water Mark of Buffer        25149800
                                       Storage Allocation        @0JA*/ 25158100
         2 SMF23BFM FIXED(31),      /* Buffer Storage Maximum in affect 25166400
                                                                 @0JA*/ 25174700
         2 SMF23BFL FIXED(31);      /* Buffer Warning Level in affect   25183000
                                                                 @0JA*/ 25191300
 %IFAL25: IF IFAR25='' %THEN %GOTO IFAL26;                              25200000
 /* 43 LINES DELETED(REC 25 MAP)TO TRANSFER OWNERSHIP TO SC141 43@T7D*/ 25250000
 %IAZR25='YES';                                             /*   @T7A*/ 25300000
 %INCLIAZ='YES'; /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR       25350000
                    WILL INCLUDE THE JES IAZSMFR MACRO           @T7A*/ 25400000
 %IFAL26: IF IFAR26='' %THEN %GOTO IFALR3;                              25450000
 /*188 LINES DELETED(REC 26 MAP)TO XFER OWNERSHIP TO SC141    188@T7D*/ 25500000
 %IAZR26='YES';                                             /*   @T7A*/ 25550000
 %INCLIAZ='YES'; /* AN IAZ MACRO IS REQUESTED-SET FLAG SO IFASMFR       25600000
                    WILL INCLUDE THE JES IAZSMFR MACRO           @T7A*/ 25650000
 %IFALR3:   ;                                                           25700000
