*   %GOTO IFAL85;                                                       00025000
*                                                                       00050000
*/*                                                                     00075000
         MACRO                                                          00100000
&NAME    IFASMFRA &RECTYPE                                              00150000
.* *                                                                  * 00200000
.* * $MAC(IFASMFRA) COMP(SCURP) PROD(JBB6609):                        * 00225000
.* *                                                                  * 00250000
.* * MACRO-NAME = IFASMFRA                                         @04C 00275000
.* *                                                                  * 00300000
.* * PROPRIETARY STATEMENT =                                          * 00430000
.* *                                                                  * 00460000
.* *  LICENSED MATERIALS - PROPERTY OF IBM                            * 00490000
.* *  "RESTRICTED MATERIALS OF IBM"                                   * 00530000
.* *  5647-A01 (C) COPYRIGHT IBM CORP. 1982, 2000                  @M6C 00570000
.* *                                                                  * 00610000
.* * STATUS = JBB6609                                              @P4C 00631000
.* *                                                                  * 00652000
.* * EXTERNAL CLASSIFICATION: NONE                                      00664000
.* * END OF EXTERNAL CLASSIFICATION:                                    00676000
.* *                                                                  * 00688000
.* *                                                                  * 00700000
.* * METHOD OF ACCESS                                                 * 00750000
.* *  PL/S - INCLUDE MACRO FROM LIBRARY                               * 00800000
.* *          EXAMPLE - %INCLUDE SYSLIB(IFASMFRA)                     * 00850000
.* *                                                                  * 00900000
.* *         THIS MACRO EXPANDS RECORDS 85-103                    @05C* 00950000
.* *                                                                  * 01000000
.* *                                                                    01050000
.* THIS IS AN SMF MACRO WHICH BUILDS SMF RECORDS 85-103. THE REQUIRED   01100000
.* FORMAT IS -                                                          01150000
.*                                                                      01200000
.*       IFASMFRA  &RECTYPE                                             01250000
.*                                                                      01266600
.* CHANGE ACTIVITY:                                                   * 01283200
.*   TYPE 96 RECORD - (ASSEMBLER) INVOKE EWQSMF96 MACRO            @01A 01285800
.*                    (PLS) ISSUE MSG INDICATING NO PLS MAPPING    @01A 01288400
.*   TYPE 90 RECORD - (ASSEMBLER & PLS) CORRECT SMF90PNO COMMENT   @P1A 01291000
.*   TYPE 94 RECORD - INVOKE IECSMF94 MACRO                        @D5A 01293600
.*   TYPE 92 RECORD - INVOKE BPXYSMFR MACRO                        @D6A 01296200
.*   TYPE 90 RECORD - RESERVED SMF90BUF AND SMF90BUM               @P2A 01298800
.*   TYPE 90 RECORD - UPDATE SETDM SECTION                         @P3A 01301400
.*   TYPE 90 RECORD - Include SID Option Source Flags              @LWA 01304000
.*   TYPE 90 RECORD - Change Dataset Fields to CHAR(44)            @LXA 01306600
.*   TYPE 90 RECORD - Invoke IFBSMF90 macro (Subtype 26)           @LZA 01309200
.*   TYPE 90 RECORD - Invoke IWMSMF90 macro (Subtypes 23,24,25,30, @M7C 01310900
.*                                                    32)          @M7A 01312600
.*   TYPE 90 RECORD - Include initial workload management status   @M2A 01314400
.*                    information fields                           @M2A 01317000
.*   TYPE 90 RECORD - Invoke IXCYSM90 macro (Subtypes 27-28)       @L2A 01319600
.*   TYPE 90 RECORD - Invoke CSVDLSMF macro (Subtype 29)           @M5A 01322200
.*   TYPE 90 RECORD - Change SMF90SSM to a reserved field          @L3A 01324800
.*   TYPE 90 RECORD - Remove Subtypes 29-30 (ARM)                  @D3A 01327400
.*   TYPE 88 RECORD - Invoke IXGSMF88 macro (Logger)               @L4A 01330000
.*   TYPE 89 RECORD - New for Usage                                @02A 01332600
.*   TYPE 89 RECORD - Incorrect ASM Dcls for Reserved              @03A 01335200
.*   TYPE 89 RECORD - Correct SMF89LPI assignment                  @04A 01337800
.*   TYPE 90 RECORD - Invoke CSVLPSMF macro (Subtype 31)           @M6A 01339100
.*   Add External Classification                                        01340400
.*   TYPE 85 RECORD - Invoke CBRSMF macro (for OAM record)         @05A 01342300
.*   TYPE 89 RECORD - Add SMF89LPV - LPAR ID valid                 @P4A 01343300
.*   TYPE 97 RECORD - Invoke IWMSMF97 macro (WLM)                  @M8A 01343800
.*   TYPE 89 RECORD - Include STSI-extracted information           @06A 01344000
.*                                                                      01344300
.* CHANGES FOR JBB1226                                         @G383P26 01358600
.*      ADD SUBTYPES 12 AND 14, ADD SUBPARM SEGMENT TO 5,9,12  @G383P26 01372900
.* $L1=RAPRAS,JBB2110,820604,PD27: RESTARTABLE SMF                 @L1A 01387200
.* $D2=DCR81 ,JBB2110,820727,PDFS: SUBTYPE 16 FOR SET DAE CMD      @D2A 01401500
.* $D4=DCR15 ,JBB2133,830912,PDFS: SRM CONSTRAINT RELIEF           @D4A 01415800
.* $D8=DCR3  ,JBB2220,840210,PDFS: SUBTYPE 17 FOR SET PFK CMD      @D8A 01430100
.* $DI=DCR26 ,JBB3313,881216,PDBR: DATA LOST CHANGES               @DIA 01444400
.*                                                                      01458700
.*    =PGP0165 ,JBB3313,890127,PDBR: IFASMFRA MACRO ERROR               01473000
.*    =OPSSI ,JBB3320,870710,PDFS: SUBTYPE 14 FOR SET MPF CMD           01487300
.* $LL=DYNRNLS,HBB4410,891026,PDBR: SUBTYPE 18 FOR SET GRSRNL CMD  @LLA 01501600
.* $LD=APPC  ,HBB4420,890303,PDLO: SUBTYPE 19 AND 20 FOR SET APPC  @LDA 01515900
.*                                 AND SET SCHPRM CMDS             @LDA 01530200
.* $LK=APPC  ,HBB4420,891009,PDBR: SUBTYPE 21 FOR FOR SET SCH CMD  @LKA 01544500
.* $LO=CE2   ,HBB4420,891009,PDBR: SUBTYPE 22 FOR SET CNGRP CMD    @LOA 01558800
.* $LM=BPAGE ,HBB4420,891104,PDBR: SET DMN CMD UPDATES             @LMA 01573100
.* $D1=DKI0004,JBB4422,910220,PDBR: SET MPF CMD UPDATES            @D1A 01587400
.* $01=OY44384,JBB2220,910719,PDBR: TYPE 96 FOR TIRS               @01A 01601700
.* $P1=PKB2276,HBB4430,920506,PDOH: 10X: SMF90PNO COMMENT WRONG    @P1A 01616000
.* $D5=DKB0095,HBB4430,920506,PDBR: TYPE 94 FOR ATL                @D5A 01630300
.* $D6=DKB0128,HBB4430,920624,PDBR: TYPE 92 FOR O/MVS              @D6A 01644600
.* $P2=PKB3617,HBB4430,920805,PDOH: 10X: OBSOLETE OPTION PROCESSING     01653200
.*                                                                 @P2A 01661800
.* $P3=PKB3714,HBB4430,920731,PDMF: 10X: TYPE 90 FORMAT CHANGE     @P3A 01663800
.* $LW=SMFSID ,HBB5510,930304,PDBR: SID Option Enhancements        @LWA 01665800
.* $LX=SMFDSN ,HBB5510,930415,PDBR: DSNAME Option Enhancements     @LXA 01667800
.* $LZ=SMC    ,HBB5510,930415,PDOH: SMF-SMC Support                @LZA 01669800
.* $M1=WLMI   ,HBB5510,930610,PDOH: SMF-WLM Support                @M1A 01671800
.* $M2=WLMI   ,HBB5510,930715,PDOH: SMF-WLM Support Stage 2        @M2A 01673800
.* $L2=ARM    ,HBB5520,931109,PDOH: SMF-ARM Support                @L2A 01675800
.* $L3=CLONE  ,HBB5520,940414,PDOH: SMF-Cloning Support            @L3A 01677800
.* $D3=DN70040,HBB5520,940505,PDOH: SMF-ARM Support                @D3A 01679800
.* $L4=LOGGR  ,HBB5520,940505,PDOH: SMF-Logger Support             @L4A 01681800
.* $02=OW02855,JBB3313,940110,PDBR: Usage Data Reporting           @02A 01683800
.* $03=OW05616,JBB3313,940615,PDBR: Inccorect Dcls for Reserved    @03A 01685800
.* $04=OW07260,JBB3313,940815,PDOH: SMF89LPI incorrectly filled    @04A 01687800
.*    =PN71727,HBB5520,941020,PDOH: CDPI: SHOWHDR Cleanup               01689800
.* $MX=PRDEDSMF,HBB6601,950601,PDXB: Product enable/disable        @MXA 01691800
.* $M3=PRDEDURP,HBB6601,950731,PDE1: Product enable/disable             01693800
.* $M5=DYNLLSMF,JBB6602,941231,PDXB: Dynamic LNKLST                @M5A 01695800
.* $M6=DYLPASMF,JBB6604,961101,PDXB: Dynamic LPA                   @M6A 01696100
.* $M7=WLMPRES,JBB6604,970226,PDCG: SMF-WLM Support Stage 3        @M7A 01696400
.* $05=OW25672,HBB5510,970630,PDRR: OAM Type 85 Enhancement        @05A 01696800
.* $P4=PUX0281,HBB6605,970701,PDRR: Reship correct level of module @P4A 01697100
.*                                  at JBB6604 with OW25672        @P4A 01697400
.* $P4=PUX0139,HBB6605,970630,PDPF: SMF-SMF89LPV - LPAR ID valid   @P4A 01697600
.* $M8=WLMPMES, JBB6609,980812,PDCO: SMF-WLM Multisystem Enclave   @M8A 01697700
.* $06=OW37091,HBB6601,990528,PDOH: CUoD Support                   @06A 01698400
.*                                                                      01699100
.********************************************************************** 01700000
         AIF   (&RECTYPE EQ 85).IFAS085                            @05A 01706200
         AIF   (&RECTYPE EQ 88).IFAS088                            @L4A 01712500
         AIF   (&RECTYPE EQ 89).IFAS089                            @02A 01725000
         AIF   (&RECTYPE EQ 90).IFAS090                        @G502PJW 01750000
         AIF   (&RECTYPE EQ 92).IFAS092                            @D6A 01756200
         AIF   (&RECTYPE EQ 94).IFAS094                            @D5A 01762500
         AIF   (&RECTYPE EQ 96).IFAS096                            @01A 01775000
         AIF   (&RECTYPE EQ 97).IFAS097                            @M8A 01787500
.E5      ANOP                                                           01800000
         SPACE 3                                                        01850000
         MNOTE 4,'&RECTYPE INVALID RECORD TYPE SPECIFIED'               01900000
.CONTB   ANOP                                                           01950000
         MEXIT                                                          02000000
.IFAS085 ANOP                                                      @05A 02000100
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 85 WRITTEN BY OAM  @05A 02000200
*                                                                  @05A 02000300
         EJECT                                                     @05A 02000400
         CBRSMF                                                    @05A 02000500
         AGO  .CONTB                                               @05A 02000600
.IFAS088 ANOP                                                      @L4A 02000700
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 88 WRITTEN         @L4A 02000800
* BY THE LOGGER                                                    @L4A 02000900
*                                                                  @L4A 02001000
         EJECT                                                     @L4A 02001100
         IXGSMF88                                                  @L4A 02001200
         AGO  .CONTB                                               @L4A 02001300
.IFAS089 ANOP                                                      @02A 02001400
         EJECT                                                     @02P 02001500
*                                                                  @02A 02001600
SMFRCD89 DSECT           Type 89 Subtype 1 mapping                 @02A 02001700
*                                                                  @02A 02001800
*      **************************************************************** 02001900
*      *                                                              * 02002100
*      * Header Section                                            @02A 02002400
*      *                                                              * 02002700
*      **************************************************************** 02003000
*                                                                  @02A 02003300
*                                                                  @02A 02003600
SMF89LEN DS    1FL2      Record Length                             @02A 02003900
SMF89SEG DS    1CL0002   Segment descriptor                        @02A 02004200
SMF89FLG DS    1CL0001   System indicator                          @02A 02004500
SMF89RTY DS    1FL1      Record type - 89, x'59'                   @02A 02004800
SMF89TME DS    1CL0004   Time, in hundredths of a second, record   @02A 02005100
*                        was moved to the SMF buffer.              @02A 02005400
SMF89DTE DS    1CL0004   Date that the record was moved to the SMF @02A 02005700
*                        buffer, in the form of 0cyydddF, where F  @02A 02006000
*                        is the sign                               @02A 02006300
SMF89SID DS    1CL0004   System identification (taken from SID     @02A 02006600
*                        parameter)                                @02A 02006900
SMF89WID DS    1CL0004   Subsystem identifier for the SMF address  @02A 02007200
*                        space - 'STC' for Started Task            @02A 02007500
SMF89STP DS    1FL2      Record Subtype                            @02A 02007700
SMF89STPUSAGE EQU 1      SMF 89 measured usage                     @M3A 02007900
SMF89STPPRODREG EQU 2    SMF 89 product registration               @M3A 02008000
         SPACE 1                                                   @M3P 02008100
SMF89SDL DS    1FL4      Length of self-defining section           @02A 02008200
*                                                                  @02A 02008400
*      **************************************************************** 02008700
*      *                                                              * 02009000
*      * Self-Defining Section                                        * 02009300
*      *                                                              * 02009600
*      **************************************************************** 02009900
*                                                                  @02A 02010200
*                                                                  @02A 02010500
SMF89SDS DS    0CL0024   Self-Defining Section                     @02A 02010800
SMF89PRO DS    1FL4      Offset of Record Product Section (from    @02A 02011100
*                        start of record including the RDW         @02A 02011400
SMF89PRL DS    1FL2      Length of each Record Product Section     @02A 02011700
SMF89PRN DS    1FL2      Number of Record Product Sections - '1'   @02A 02012000
SMF89SIO DS    1FL4      Offset of System ID Section (from start   @02A 02012300
*                        of record including the RDW               @02A 02012600
SMF89SIL DS    1FL2      Length of each System ID Section          @02A 02012900
SMF89SIN DS    1FL2      Number of System ID Sections - '1'        @02A 02013200
SMF89UDO DS    1FL4      Offset of First Usage/Product Data        @MXC 02013300
*                        (section from start of record, including  @MXC 02013400
*                        the RDW)                                  @MXC 02013500
SMF89UDL DS    1FL2      Length of each Usage/Product Data section @MXC 02013600
SMF89UDN DS    1FL2      Number of Usage/Product Data sections     @MXC 02013700
*                        (minimum: 0)                              @MXC 02013800
SMF89UDR DS    1FL4      Number of Product Data sections           @MXA 02013900
*                        remaining. 0 for usage data.              @MXA 02014000
*                                                                  @02A 02014700
*      **************************************************************** 02015000
*      *                                                              * 02015300
*      * Product Section                                           @02A 02015600
*      *                                                              * 02015900
*      **************************************************************** 02016200
*                                                                  @02A 02016500
*                                                                  @02A 02016800
SMF89PR  DSECT                                                     @02A 02017100
SMF89PNM DS    1CL0008   Record Product Name - 'SMF'               @02A 02017400
SMF89RVN DS    1FL4      Record Version Number - '01'              @02A 02017700
SMF89OSL DS    1CL0008   MVS System Level (ie. 'SP4.3.0')          @02A 02018000
SMF89IST DS    1FL4      Reporting Interval START Time (in         @02A 02018300
*                        hundredths of a second). 0 for            @02A 02018600
*                        non-Interval records                      @02A 02018900
SMF89ISD DS    1CL0004   Reporting Interval START Date in the form @02A 02019200
*                        of 0cyydddF, where F is the sign. 0 for   @02A 02019500
*                        non-Interval records                      @02A 02019800
SMF89IET DS    1FL4      Reporting Interval END Time (in           @02A 02020100
*                        hundredths of a second). 0 for            @02A 02020400
*                        non-Interval records                      @02A 02020700
SMF89IED DS    1CL0004   Reporting Interval END Date in the form   @02A 02021000
*                        of 0cyydddF, where F is the sign 0 for    @02A 02021300
*                        non-Interval records                      @02A 02021600
*                                                                  @02A 02021900
*      **************************************************************** 02022200
*      *                                                              * 02022500
*      * System ID Section                                         @02A 02022800
*      *                                                              * 02023100
*      **************************************************************** 02023400
*                                                                  @02A 02023700
*                                                                  @02A 02024000
SMF89SI  DSECT                                                     @02A 02024300
SMF89SYN DS    1CL0008   MVS System Name (taken from SYSNAME in    @02A 02024600
*                        IEASYSxx)                                 @02A 02024900
SMF89UST DS    1FL4      Usage Data Interval START Time (in        @02A 02025200
*                        hundredths of a second). 0 for            @02A 02025500
*                        non-Interval records                      @02A 02025800
SMF89USD DS    1CL0004   Usage Data Interval START Date in the     @02A 02026100
*                        form of 0cyydddF, where F is the sign. 0  @02A 02026400
*                        for non-Interval records                  @02A 02026700
SMF89UET DS    1FL4      Usage Data Interval END Time (in          @02A 02027000
*                        hundredths of a second). 0 for            @02A 02027300
*                        non-Interval records                      @02A 02027600
SMF89UED DS    1CL0004   Usage Data Interval END Date in the form  @02A 02027900
*                        of 0cyydddF, where F is the sign 0 for    @02A 02028200
*                        non-Interval records                      @02A 02028500
SMF89CSU DS    1FL4      CPU Service Coefficient in affect at the  @02A 02028800
*                        time that the record was generated.       @02A 02029100
SMF89SRU DS    1FL4      SRB Service Coefficient in affect at the  @02A 02029400
*                        time that the record was generated.       @02A 02029700
SMF89CMN DS    1CL0002   CPU Model Number (Packed)                 @02A 02030000
SMF89CVN DS    1FL1      CPU Version Number                        @02A 02030300
SMF89LPI DS    1CL0001   LPAR Partition ID                         @04C 02030400
SMF89LP1 EQU   X'F0'     1st nibble - flags                        @P4C 02030500
SMF89LPV EQU   X'80'     LPAR ID is valid (allow LPAR ID = 0)      @P4A 02030600
SMF89LP2 EQU   X'0F'     LPAR Partition ID                         @04A 02030700
SMF89SER DS    1CL0003   CPU Serial Number (Packed)                @02A 02030900
         DS    1CL0001   Reserved                                  @03C 02031200
SMF89RPP DS    1FL4      CPU Relative Processing Power Indicator   @02A 02031500
SMF89SPN DS    1CL0008   MVS SYSPLEX Name                          @02A 02031800
SMF89CPT DS    1CL0006   CPC Type Number                           @02A 02032100
SMF89CPM DS    1CL0003   CPC Model Number                          @02A 02032400
SMF89CPS DS    1CL0012   CPC Sequence Number                       @02A 02032700
         DS    1CL0003   Reserved                                  @03C 02033000
SMF89MNF DS    1CL0016   V1-CPC Manufacturer                       @06A 02033100
SMF89TID DS    1CL0004   V1-CPC Type                               @06A 02033200
SMF89MDL DS    1CL0016   V1-CPC Model                              @06A 02033300
SMF89SQC DS    1CL0016   V1-CPC Sequence Code                      @06A 02033400
SMF89POM DS    1CL0004   V1-CPC Plant of Manufacturer              @06A 02033500
SMF89CPC DS    1FL4      CPU Capability                            @06A 02033600
SMF89CCC DS    1FL2      Configured CPU Count                      @06A 02033700
SMF89SCC DS    1FL2      Standby CPU Count                         @06A 02033800
SMF89MAF DS    1CL30     Array of Multiprocessing CPU Capability   @06A 02033900
*                        Adjustment Factors                        @06A 02034000
*                                                                  @02A 02034100
*      **************************************************************** 02034200
*      *                                                              * 02034300
*      * Usage Data Section                                        @02A 02034400
*      *                                                              * 02034500
*      **************************************************************** 02034800
*                                                                  @02A 02035100
*                                                                  @02A 02035400
SMF89UD  DSECT                                                     @02A 02035700
SMF89UPO DS    1CL0016   Product Owner or Vendor Name (obtained    @02A 02036000
*                        PRODOWNER option ofA IFAUSAGE macro)      @02A 02036300
SMF89UPN DS    1CL0016   Product Name (obtained PRODNAME option of @02A 02036600
*                        IFAUSAGE macro)                           @02A 02036900
SMF89UPV DS    1CL0008   Product Version (obtained PRODVERS option @02A 02037200
*                        of IFAUSAGE macro)                        @02A 02037500
SMF89UPQ DS    1CL0008   Product Qualifier (obtained PRODQUAL      @02A 02037800
*                        option of IFAUSAGE macro)                 @02A 02038100
SMF89UPI DS    1CL0008   Product ID (obtained PRODID option of     @02A 02038400
*                        IFAUSAGE macro)                           @02A 02038700
SMF89UCT DS    1CL0008   Product TCB Time (in hundreths of a       @02A 02039000
*                        second - floating point)                  @02A 02039300
SMF89USR DS    1CL0008   Product SRB Time (in hundreths of a       @02A 02039600
*                        second - floating point)                  @02A 02039900
SMF89UFG DS    1CL0001   Usage Entry Flags                         @02A 02040200
SMF89UUN EQU   X'80'     UNAUTHORIZED REGISTER Requested           @02A 02040500
SMF89UNU EQU   X'40'     Ineligible for measured usage             @MXA 02040600
         DS    1CL0002   Reserved                                  @03C 02040800
SMF89URT DS    1FL1      Data Type of value in SMF89URD (as        @02A 02041100
*                        specified by the FORMAT option on the     @02A 02041400
*                        FUNCTIONDATA Request of the IFAUSAGE      @02A 02041700
*                        macro).                                   @02A 02042000
SMF89URD DS    1CL0008   Product 'Specific' Resource Data          @02A 02042300
*                        (specified by the DATA option on the      @02A 02042600
*                        FUNCTIONDATA Request of the IFAUSAGE      @02A 02042900
*                        macro).                                   @02A 02043200
*                                                                       02043500
*      **************************************************************** 02043600
*      *                                                              * 02043700
*      * Product enable/disable section                            @MXA 02043800
*      *                                                              * 02043900
*      **************************************************************** 02044000
*                                                                  @MXA 02044100
*                                                                  @MXA 02044200
SMF89T2  DSECT                                                     @MXA 02044300
SMF89T2PRODOWNER DS 1CL0016 Product Owner or Vendor Name (from     @MXA 02044400
*                        prodowner parameter of IFAEDREG or        @MXA 02044500
*                        OWNER option of PRODUCT statement of      @MXA 02044600
*                        IFAPEDxx)                                 @MXA 02044700
SMF89T2PRODNAME DS 1CL0016 Product name (from prodname             @MXA 02044800
*                        parameter of IFAEDREG or NAME             @MXA 02044900
*                        option of PRODUCT statement of            @MXA 02045000
*                        IFAPEDxx)                                 @MXA 02045100
SMF89T2FEATURENAME DS 1CL0016 Feature name (from featurename       @MXA 02045200
*                        parameter of IFAEDREG or FEATURENAME      @MXA 02045300
*                        option of PRODUCT statement of            @MXA 02045400
*                        IFAPEDxx)                                 @MXA 02045500
SMF89T2PRODVERS DS 1CL002 Product version (from prodvers           @MXA 02045600
*                        parameter of IFAEDREG or VERSION          @MXA 02045700
*                        option of PRODUCT statement of            @MXA 02045800
*                        IFAPEDxx)                                 @MXA 02045900
SMF89T2PRODREL  DS 1CL002 Product release (from prodrel            @MXA 02046000
*                        parameter of IFAEDREG or RELEASE          @MXA 02046100
*                        option of PRODUCT statement of            @MXA 02046200
*                        IFAPEDxx)                                 @MXA 02046300
SMF89T2PRODMOD  DS 1CL002 Product mod level (from prodmod          @MXA 02046400
*                        parameter of IFAEDREG or MOD              @MXA 02046500
*                        option of PRODUCT statement of            @MXA 02046600
*                        IFAPEDxx)                                 @MXA 02046700
SMF89T2PRODID DS 1CL008  Product ID (from prodID                   @MXA 02046800
*                        parameter of IFAEDREG or ID               @MXA 02046900
*                        option of PRODUCT statement of            @MXA 02047000
*                        IFAPEDxx)                                 @MXA 02047100
SMF89T2FLAGS DS 1CL0001  Flags                                     @MXA 02047200
SMF89T2NOTDEFINED EQU X'80' Product state is Not Defined           @MXA 02047300
SMF89T2ENABLED EQU X'40' Product state is Enabled                  @MXA 02047400
SMF89T2REGENTRY EQU X'08' Register entry                           @MXA 02047500
SMF89T2STATEENTRY EQU X'04' State entry                            @MXA 02047600
SMF89T2NOREPORT EQU X'02' "No Report" - registered with            @MXA 02047700
*                           IFAEDREG_TYPE_NOREPORT                 @MXA 02047800
SMF89T2LICENSEDUNDERPROD EQU X'01'  "Licensed Under Prod" -        @MXA 02047900
*                           registered with                        @MXA 02048000
*                           IFAEDREG_TYPE_LICENSEDUNDERPROD        @MXA 02048100
*                                                                       02048200
         DS    1CL0001   Unused                                    @MXA 02048300
SMF89T2NUMINSTANCES DS   F       Maximum number of instances of    @MXA 02048400
*                                registrations of this product     @MXA 02048500
         AGO  .CONTB                                               @02P 02048600
.IFAS090 ANOP                                                  @G50FPJW 02050000
         EJECT                                                 @G50FPJW 02100000
*        THIS RECORD IS WRITTEN WHEN EVER AN OPERATOR COMMAND OR        02150000
*        RESPONSE OF THE FOLLOWING TYPE IS RECEIVED:               @D2C 02200000
*            1  SET TIME                                                02233300
*            2  SET DATE                                                02266600
*            3  SET DMN                                                 02299900
*            4  SET IPS                                                 02333200
*            5  SET SMF                                                 02366500
*            6  SWITCH SMF                                              02399800
*            7  HALT EOD                                                02433100
*            8  IPL PROMPT (RESPONSE)                                   02466400
*            9  IPL SMF (RESPONSE)                                      02499700
*            10 IPL SRM (RESPONSE)                                      02533000
*            11 SET OPT                                                 02566300
*            12 SET ICS                                                 02599600
*            13 SETSMF                                         @G382P26 02632900
*            14 SET MPF                                        @G382P27 02666200
*            15 RESTART SMF                                        @L1A 02699500
*            16 SET DAE                                            @D2A 02732800
*            17 SET PFK                                            @D8A 02766100
*            18 SET GRSRNL                                         @LLA 02799400
*            19 SET APPC                                           @LDA 02832700
*            20 SET SCHPRM                                         @LDA 02866000
*            21 SET SCH                                            @LKA 02899300
*            22 SET CNGRP                                          @LOA 02932600
*            23 WLM Service Definition Install                     @M1C 02965900
*            24 WLM Service Policy Activation                      @M1C 02999200
*            25 Workload Management Mode Change                    @M1C 03032500
*            26 IPL LOGREC                                         @LZA 03065800
*                                                                 2@D3D 03074300
*            27 ARM restarts enabled                               @D3C 03082800
*            28 ARM restarts disabled                              @D3C 03091300
*            29 CSV LNKLST set activated                           @M5A 03095600
*            30 WLM RESET                                          @M6A 03096700
*            31 Modules added to or deleted from LPA               @M6A 03097800
*            32 WLM Scheduling Environment change                  @M7A 03098900
*                                                                       03100000
*                                                                  @LZC 03150000
*                                                                       03200000
*        RECORD LENGTH IS VARIABLE MINIMUM OF XXX BYTES                 03250000
*                                                                       03300000
SMFRCD90 DSECT           HEADER SEGMENT                                 03350000
*                                                                       03400000
*        SMF RECORD HEADER SEGMENT                                      03450000
*                                                                       03500000
SMF90LEN DS    BL2'0'                  RECORD LENGTH                    03550000
SMF90SEG DS    BL2'0'                  SEGMENT DESCRIPTOR               03600000
SMF90FLG DC    BL1'0'                  HEADER FLAG BYTE                 03650000
SMF90RTY DC    BL1'0'                  RECORD TYPE 90 HEX 5A            03700000
SMF90TME DC    BL4'0'                  RECORD WRITTEN TIME              03750000
SMF90DTE DC    PL4'0000'               RECORD WRITTEN DATE              03800000
SMF90SID DC    CL4' '                  SYSTEM IDENTIFICATION            03850000
*                                                                       03900000
*        SELF DEFINING SECTION                                          03950000
*                                                                       04000000
         DC    BL2'0'                  RESERVED                @VS49902 04050000
SMF90POF DC    BL4'0'                  OFFSET TO PRODUCT SECT  @VS49902 04100000
SMF90PLN DC    BL2'0'                  LENGTH OF PRODUCT SECTION        04150000
SMF90PON DC    BL2'0'                  NUMBER OF PRODUCT SECTION        04200000
SMF90DOF DC    BL4'0'                  OFFSET TO DATA SECTION  @VS49902 04250000
SMF90DLN DC    BL2'0'                  LENGTH OF DATA SECTION           04300000
SMF90DON DC    BL2'0'                  NUMBER OF DATA SECTION           04350000
SMF90LRC EQU   *-SMFRCD90              LENGTH OF RECORD HEADER          04400000
*                                                                       04450000
*        PRODUCT HEADER                                                 04500000
*                                                                       04550000
SMF90PRH DSECT                                                          04600000
SMF90TID DC    BL2'0'                  SUB TYPE ID                      04650000
*                                                                       04700000
*      1 = SET TIME   2 = SET DATE     3 = SET DMN    4 = SET IPS       04750000
*      5 = SET SMF    6 = SWITCH SMF   7 = HALT EOD   8 = IPL PROMPT    04800000
*      9 = IPL SMF   10 = IPL SRM     11 = SET OPT   12 = SET ICS       04850000
*     13 = SETSMF    14 = SET MPF     15=RESTART SMF 16 = SET DAE  @D2A 04900000
*     17 = SET PFK   18 = SET GRSRNL  19 = SET APPC                @LDC 04925000
*     20 = SET SCHPRM                 21 = SET SCH                 @LKC 04950000
*     22 = SET CNGRP                                               @LOA 04975000
*     23 = WLM Service Definition Install                          @M1C 04979100
*     24 = WLM Service Policy Activation                           @M1A 04983200
*     25 = Workload Management Mode Change                         @M1A 04987300
*     26 = IPL LOGREC                                              @LZA 04991600
*                                                                 2@D3D 04993700
*     27 = ARM restarts enabled                                    @D3C 04995800
*     28 = ARM restarts disabled                                   @D3C 04997900
*     29 = CSV LNKLST set activated                                @M5A 04998900
*     30 = WLM RESET                                               @M6A 04999100
*     31 = Modules added to or deleted from LPA                    @M6A 04999300
*     32 = WLM Scheduling Environment change                       @M7A 04999500
*                                                                       05000000
SMF90RVN DC    BL2'0'                  RECORD VERSION NUMBER            05050000
SMF90PNM DC    CL8'0'                  PRODUCT NAME - SMF,SRM,SUP,ETC   05100000
SMF90LPR EQU   *-SMF90PRH              LENGTH OF PRODUCT SECTION        05150000
*                                                                       05200000
*  IPL SMF, SET SMF OR SETSMF COMMAND SEGMENT                           05250000
*    - SUBTYPE ID 5 OR 9 OR 13 OR 15                               @L1C 05300000
*                                                                       05350000
SMF90T5  DSECT                                                     @L1C 05400000
*                                                                       05450000
*  SELF DEFINING SECTION FOR SUBTYPE 5 OR 9 OR 13 OR 15            @L1C 05500000
*                                                                       05550000
SMF90T5  DSECT                                                          05600000
SMF90OSM DC    BL4'0'                  OFFSET OF SMF SEGMENT   @VS49902 05650000
SMF90LSM DC    BL2'0'                  LENGTH OF SMF SEGMENT            05700000
SMF90NSM DC    BL2'0'                  NUMBER OF SMF SEGMENTS           05750000
SMF90ODA DC    BL4'0'                  OFFSET OF DATASET SEG   @VS49902 05800000
SMF90LDA DC    BL2'0'                  LENGTH OF DATASET SEGMENT        05850000
SMF90NDA DC    BL2'0'                  NUMBER OF DATASET SEGMENTS       05900000
SMF90OWK DC    BL4'0'                  OFFSET OF SUBSYSTEM SEG @VS49902 05950000
SMF90LWK DC    BL2'0'                  LENGTH OF SUBSYSTEM SEGMENT      06000000
SMF90NWK DC    BL2'0'                  NUMBER OF SUBSYSTEM SEGMENTS     06050000
SMF90OOT DC    BL4'0'                  OFFSET OF SUBPARM SEGM  @G383P26 06100000
SMF90LOT DC    BL2'0'                  LENGTH OF SUBPARM SEGM  @G383P26 06150000
SMF90NOT DC    BL2'0'                  NUMBER OF SUBPARM SEGM  @G383P26 06200000
SMF90LT5 EQU   *-SMF90T5               LENGTH OF TYPE 5 SELF DEF        06250000
SMF90DSM DSECT                                                          06300000
SMF90MAX DC    CL4' '                  MAXDORM IN MMSS FORMAT           06350000
SMF90STA DC    CL6' '                  STATUS IN HHMMSS FORMAT          06400000
SMF90JWT DC    CL4' '                  JWT IN MMSS FORMAT               06450000
SMF90SYI DC    CL4' '                  SID IN CHARACTER                 06500000
SMF90BUF DC    BL1'0'                  RESERVED (PREVIOUSLY THE         06530000
*                                      MINIMUM NUMBER OF BUFFERS)  @P2C 06560000
SMF90BUM DC    BL1'0'                  RESERVED (PREVIOUSLY THE         06590000
*                                      MAXIMUM NUMBER OF BUFFERS)  @P2C 06620000
SMF90SWT DC    BL1'0'                  SWITCHES                         06650000
SMF90PAL EQU   X'80'                   PROMPT(ALL)                      06700000
SMF90PLT EQU   X'40'                   PROMPT(LIST)                     06750000
SMF90PIP EQU   X'20'                   PROMPT(IPLR)                     06800000
SMF90PNO EQU   X'10'                   NOPROMPT                    @P1C 06850000
SMF90RPR EQU   X'08'                   REC(PERM)                        06900000
SMF90RAL EQU   X'04'                   REC(ALL)                         06950000
SMF90LDS EQU   X'02'                   LISTDSN                          07000000
SMF90NLD EQU   X'01'                   NOLISTDSN                        07050000
SMF90SW2 DC    BL1'0'                  SWITCHES                    @DIA 07064200
SMF90NBM EQU   X'80'                   NOBUFFS(MSG)                @DIA 07078400
SMF90NBH EQU   X'40'                   NOBUFFS(HALT)               @DIA 07092600
SMF90LDM EQU   X'20'                   LASTDS(MSG)                 @DIA 07106800
SMF90LDH EQU   X'10'                   LASTDS(HALT)                @DIA 07121000
*                                                                       07123400
SMF90SBU DS    XL1                     SMF SID Syntax Used         @LWA 07125800
SMF90SDF EQU   X'80'                   'Default'                   @LWA 07128200
SMF90SON EQU   X'40'                   SID(xxxx)                   @LWA 07130600
SMF90SSE EQU   X'20'                   SID(xxxx,ser#)              @LWA 07133000
SMF90SSY EQU   X'10'                   SID(xxxx,SYSNAME(sysname))  @LWA 07135400
SMF90SSM EQU   X'08'                   Reserved                    @L3C 07137800
SMF90SCO EQU   X'04'                   SID(xxxx,COMBIN(ser#,ser#)) @LWA 07140200
SMF90SRV EQU   X'03'                   Reserved                    @LWA 07142600
*                                                                       07145000
SMF90RV7 DC    CL1' '                  RESERVED                    @LWC 07147400
SMF90REL DC    CL4' '                  MVS RELEASE NUMBER               07150000
SMF90IIT DC    CL4' '                  IPL TIME - BINARY                07200000
SMF90IDT DC    CL4' '                  IPL DATE - 0cyydddF              07250000
SMF90DSL EQU   *-SMF90DSM              DATA SECTION LENGTH              07300000
*                                                                       07350000
* SUBTYPE 5 OR 9 OR 13 OR 15 - DATA SET SEGMENT. THERE WILL BE AN ENTRY 07400000
* FOR EACH SMF RECORDING DATA SET.  THE FIRST DATA SET IS THE           07450000
* ACTIVE DATA SET AT IPL.                                      @G383P26 07500000
*                                                                       07550000
SMF90DSE DSECT                                                          07600000
SMF90DSN DC    CL44' '                 SMF DATA SET NAME           @LXC 07650000
*                                                                       07700000
* SUBTYPE 5 OR 9 OR 13 OR 15 - WORK CLASS RECORDING SEGMENT. THERE WILL 07750000
* BE ONE ENTRY FOR EACH SYS OR SUBSYS.                         @G383P26 07800000
*                                                                       07850000
SMF90WCH DSECT                                                          07900000
SMF90WKN DC    CL4' '                  SUBYSTEM NAME                    07950000
SMF90DTL DC    CL1' '                  SMF SUBSYS FLAGS X'80' DETAIL    08000000
SMF90RS9 DC    CL3' '                  RESERVED                         08050000
SMF90SVL DC    CL8' '                  INTERVAL RECORD FOR SUBSYSTEM    08100000
SMF90SYS DC    XL32'00'                BIT REPRESENTATION FOR WORK      08150000
*                                      CLASS RECORDS                    08200000
*                                      1 = RECORD ON, 0 = RECORD OFF    08250000
*                                      BIT 0 = RECORD 0                 08300000
*                                      BIT 255 = RECORD 255             08350000
SMF90EXN DC    15CL8' '                EIGHT BYTE NAME OF EACH EXIT     08400000
SMF90LWC EQU   *-SMF90WCH              LENGTH OF WORK CLASS SECTION     08450000
*                                                                       08500000
* SUBTYPE 5 OR 9 OR 13 OR 15 - SUBPARM SEGMENT. THERE WILL BE AN ENTRY  08550000
* FOR EACH SUBSYSTEM FOR WHICH AN SUBPARM HAS BEEN SPECIFIED   @G383P26 08600000
*                                                                       08650000
SMF90SUB DSECT                                                 @G383P26 08700000
SMF90ASN DC    CL4' '                  SUBSYSTEM NAME          @G383P26 08750000
SMF90APM DC    CL60' '                 ACCOUNTING PARAMETER    @G383P26 08800000
SMF90LAC EQU   *-SMF90SUB              LENGTH OF SUBPARM SEG   @G383P26 08850000
*                                                                       08900000
*                                                                       08950000
* SWITCH SMF SEGMENT/HALT EOD SEGMENT - SUBTYPE 6 OR 7                  09000000
*                                                                       09050000
SMF90T6  DSECT                                                          09100000
SMF90SWO DC    CL10' '                 Old Recording Data Set Name      09106800
*                                                                       09113600
*                                      Subtype 6: Blank, if data   @LXC 09120400
*                                                 is lost          @LXC 09127200
*                                                                       09134000
*                                      Subtype 7: Blank            @LXC 09140800
*                                                                       09147600
*                                      If the length of the data   @LXC 09154400
*                                      set is greater than 10,     @LXC 09161200
*                                      this field is Blank.        @LXC 09168000
*                                      See SMF90SOD for the        @LXC 09174800
*                                      complete data set name.     @LXC 09181600
SMF90SWN DC    CL10' '                 New Recording Data Set Name      09188400
*                                                                       09195200
*                                      Subtype 7: Blank            @LXC 09202000
*                                                                       09208800
*                                      If the length of the data   @LXC 09215600
*                                      set is greater than 10,     @LXC 09222400
*                                      this field is Blank.        @LXC 09229200
*                                      See SMF90SND for the        @LXC 09236000
*                                      complete data set name.     @LXC 09242800
SMF90IT  DC    CL4' '                  IPL TIME                         09250000
SMF90ID  DC    CL4' '                  IPL DATE                         09300000
SMF90SOD DC    CL44' '                 Old Recording Data Set Name      09304100
*                                                                       09308200
*                                      Subtype 6: Blank, if data   @LXC 09312300
*                                                 is lost          @LXC 09316400
*                                                                       09320500
*                                      Subtype 7: Blank            @LXC 09324600
*                                                                       09328700
SMF90SND DC    CL44' '                 New Recording Data Set Name      09332800
*                                                                       09336900
*                                      Subtype 7: Blank            @LXC 09341000
*                                                                       09345100
SMF90LT6 EQU   *-SMF90T6               LENGTH OF TYPE 6 SEGMENT         09350000
*                                                                       09400000
*   SYSTEM IPL PROMPT DATA - SUBTYPE ID 8                               09450000
*                                                                       09500000
SMF90T8  DSECT                                                          09550000
SMF90DTM DC    CL8'0'                  SYSTEM DOWN TIME                 09600000
SMF90RSN DC    CL65' '                 IPL REASON                       09650000
SMF90OPR DC    CL20' '                 OPERATOR'S NAME                  09700000
SMF90ITM DC    CL4' '                  TIME OF IPL                      09750000
SMF90DTT DC    CL4' '                  DATE OF IPL YYDDDF               09800000
SMF90LT8 EQU   *-SMF90T8               LENGTH OF TYPE 8 SEGMENT         09850000
*                                                                       09900000
*   SET DATE / TOD SEGMENT - SUBTYPE ID 1 OR 2                          09950000
*                                                                       10000000
SMF90T1  DSECT                                                          10050000
SMF90OTM DC    BL4'0'                  TIME BEFORE CMD ISSUED           10100000
SMF90ODT DC    CL4' '                  OLD DATE BEFORE CMD ISSUED       10150000
SMF90NTM DC    BL4'0'                  NEW TIME                         10200000
SMF90NDT DC    CL4' '                  DATE AFTER COMMAND ISSUED        10250000
SMF90LT1 EQU   *-SMF90T1               LENGTH OF TYPE 1 SEGMENT         10300000
*                                                                       10350000
*   SET IPS COMMAND SEGMENT - SUBTYPE ID 4                              10400000
*                                                                       10450000
SMF90T4  DSECT                                                          10500000
SMF90TIP DC    BL8'0'                  SET IPS TIME                     10550000
SMF90IPO DC    CL8' '                  OLD IPS NAME                     10600000
SMF90IPN DC    CL8' '                  NEW IPS NAME                     10650000
SMF90LT4 EQU   *-SMF90T4               LENGTH OF TYPE 4 SEGMENT         10700000
*                                                                       10750000
*   SETDMN SEGMENT - SUBTYPE ID 3                                       10800000
*                                                                       10850000
SMF90T3  DSECT                                                          10900000
SMF90DDT DC    CL8' '                  TIME OF CHANGE                   10950000
SMF90DMM DC    BL1'0'                  DOMAIN NUMBER                    11000000
SMF90DFG DC    BL1'0'                  DOMAIN FLAGS                     11050000
SMF90MND EQU   X'80'                   MIN CHANGED                      11100000
SMF90MXD EQU   X'40'                   MAX CHANGED                      11150000
SMF90WGT EQU   X'20'                   WEIGHT CHANGED                   11200000
SMF90AOB EQU   X'10'                   AOBJ CHANGED                     11250000
SMF90DOB EQU   X'08'                   DOBJ CHANGED                     11300000
SMF90FWK EQU   X'04'                   FWKLD CHANGED                    11350000
SMF90ASV EQU   X'02'                   AVERAGE SERVICE RATE SPECIFIED   11360000
*                                                                  @LMA 11370000
SMF90DSV EQU   X'01'                   TOTAL SERVICE RATE SPECIFIED     11380000
*                                                                  @LMA 11411100
SMF90NMI DC    BL2'0'                  NEW MIN VALUE               @D4C 11442200
SMF90NMA DC    BL2'0'                  NEW MAX VALUE               @D4C 11473300
SMF90NWT DC    BL2'0'                  NEW WEIGHT VALUE            @D4C 11504400
SMF90NAO DC    BL2'0'                  NEW AOBJ VALUE              @D4C 11535500
SMF90NDO DC    BL2'0'                  NEW DOBJ VALUE              @D4C 11566600
SMF90WKL DC    BL2'0'                  NEW FWKLD VALUE             @D4C 11597700
SMF90T3R DC    BL2'0'                  RESERVED                    @LMA 11628800
SMF90ALO DC    BL4'0'                  LOW AVERAGE SERVICE RATE VALUE   11660000
*                                        SPECIFIED                 @LMA 11665000
SMF90AHI DC    BL4'0'                  HIGH AVERAGE SERVICE RATE VALUE  11670000
*                                        SPECIFIED                 @LMA 11675000
SMF90DLO DC    BL4'0'                  LOW TOTAL SERVICE RATE VALUE     11680000
*                                        SPECIFIED                 @LMA 11685000
SMF90DHI DC    BL4'0'                  HIGH TOTAL SERVICE RATE VALUE    11690000
*                                        SPECIFIED                 @LMA 11691600
SMF90FL2 DC    BL1'0'                  FLAGS                       @P3A 11693200
SMF90XCF EQU   X'80'                   IF 1, FIXCIDX VALUE IS SET  @P3A 11694800
SMF90TRR DC    BL1'0'                  RESERVED                    @P3A 11696400
SMF90XCI DC    BL2'0'                  FIXED CONTENTION INDEX      @P3A 11698000
SMF90LT3 EQU   *-SMF90T3               LENGTH OF TYPE 3 SEGMENT         11700000
*                                                                       11750000
*   IPL SRM COMMAND SEGMENT - SUBTYPE ID 10                             11800000
*                                                                       11850000
SMF90T10 DSECT                                                          11900000
*  Compatibility mode fields:                                      @M2A 11916600
*    These fields are always filled in.                            @M2A 11933200
SMF90IPT DC    BL8'0'                  TIME OF IPL                      11950000
SMF90IPS DC    CL8'0'                  IEAIPSXX PARMLIB MEMBER          12000000
SMF90OPT DC    CL8'0'                  IEAOPTXX PARMLIB MEMBER          12050000
SMF90ICS DC    CL8'0'                  IEAICSXX PARMLIB MEMBER          12100000
*                                                                  @M2A 12102000
*  Goal mode fields:                                               @M2A 12104000
*    These fields are filled in when goal mode                     @M2A 12106000
*    system operation is applicable.                               @M2A 12108000
SMF90SPN DC    CL8'0'          Active service policy name.         @M2A 12110000
SMF90SPT DC    BL8'0'          Time/date (STCK format) that        @M2A 12112000
*                              the active service policy was       @M2A 12114000
*                              originally activated.               @M2A 12116000
SMF90SPU DC    CL8'0'          Userid of the operator or service   @M2A 12118000
*                              administrator that activated the    @M2A 12120000
*                              service policy.                     @M2A 12122000
SMF90SPS DC    CL8'0'          Name of the system on which the     @M2A 12124000
*                              service policy activation was       @M2A 12126000
*                              initiated.                          @M2A 12128000
SMF90SDN DC    CL8'0'          Name of the installed service       @M2A 12130000
*                              definition at the time the          @M2A 12132000
*                              policy was activated.               @M2A 12134000
SMF90SDT DC    BL8'0'          Time/date (STCK format) that the    @M2A 12136000
*                              service definition was installed    @M2A 12138000
SMF90SDU DC    CL8'0'          Userid of service administrator     @M2A 12140000
*                              that installed the service          @M2A 12142000
*                              definition.                         @M2A 12144000
SMF90SDS DC    CL8'0'          Name of the system on which the     @M2A 12146000
*                              service definition was installed.   @M2A 12148000
SMF90LTA EQU   *-SMF90T10              LENGTH OF TYPE 10 SEGMENT        12150000
*                                                                       12200000
*   SET OPT COMMAND SEGMENT - SUBTYPE ID 11                             12250000
*                                                                       12300000
SMF90T11 DSECT                                                          12350000
SMF90TOP DC    BL8'0'                  TIME OF OPT CHANGE               12400000
SMF90OPO DC    CL8'0'                  OLD OPT PARMLIB MEMBER           12450000
SMF90OPN DC    CL8'0'                  NEW OPT PARMLIB MEMBER           12500000
SMF90LTB EQU   *-SMF90T11              LENGTH OF TYPE 11 SEGMENT        12550000
*                                                                       12600000
*   SET ICS COMMAND SEGMENT - SUBTYPE ID 12                             12650000
*                                                                       12700000
SMF90T12 DSECT                                                          12750000
SMF90TIC DC    BL8'0'                  TIME OF 'SETICS' CHANGE          12800000
SMF90ICO DC    CL8'0'                  OLD PARMLIB MEMBER               12850000
SMF90ICN DC    CL8'0'                  NEW PARMLIB MEMBER               12900000
SMF90LTC EQU   *-SMF90T12              LENGTH OF TYPE 12 SEGMENT        12950000
*                                                              @G383P27 13000000
*   SET MPF COMMAND SEGMENT - SUBTYPE ID 14                    @G383P27 13050000
*                                                              @G383P27 13100000
SMF90T14 DSECT                                                 @G383P27 13150000
SMF90TMP DC    BL8'0'      TIME OF 'SET MPF' CHANGE            @G383P27 13200000
SMF90MPO DC    CL8'0'      RESERVED - WAS OLD PARMLIB MEMBER       @D1C 13225000
SMF90MPN DC    CL8'0'      RESERVED - WAS NEW PARMLIB MEMBER       @D1C 13250000
SMF90MPC DC    CL8'0'      RESERVED - WAS OLD PARMLIB MEM - COLOR  @D1C 13275000
SMF90MCN DC    CL8'0'      RESERVED - WAS NEW PARMLIB MEM - CMD    @D1C 13300000
SMF90MCO DC    CL8'0'      RESERVED - WAS OLD PARMLIB MEM - CMD    @D1C 13325000
SMF90CMP DC    BL4'0'      COUNT OF MPF ENTRIES                    @D1A 13350000
SMF9014D DC    39CL2' '    ARRAY OF MPF SUFFIXES                   @D1A 13375000
SMF90LTE EQU   *-SMF90T14  LENGTH OF TYPE 14 SEGMENT           @G383P27 13400000
*                                                                  @D2A 13411500
*   SET DAE COMMAND SEGMENT - SUBTYPE ID 16                        @D2A 13423000
*                                                                  @D2A 13434500
SMF90T16 DSECT                                                     @D2A 13446000
SMF90DAT DC    BL8'0'      TIME AND DATE OF 'SET DAE' COMMAND      @D2A 13457500
SMF90DAO DC    CL8'0'      OLD PARMLIB MEMBER                      @D2A 13469000
SMF90DAN DC    CL8'0'      NEW PARMLIB MEMBER                      @D2A 13480500
SMF90LTF EQU   *-SMF90T16  LENGTH OF TYPE 16 SEGMENT               @D2A 13492000
*                                                                  @D8A 13503500
*   SET PFK COMMAND SEGMENT - SUBTYPE ID 17                        @D8A 13515000
*                                                                  @D8A 13526500
SMF90T17 DSECT                                                     @D8A 13538000
SMF90TPF DC    BL8'0'                  TIME OF SET PFK CHANGE      @D8A 13549500
SMF90PFO DC    CL8'0'                  OLD PFK PARMLIB MEMBER      @D8A 13561000
SMF90PFN DC    CL8'0'                  NEW PFK PARMLIB MEMBER      @D8A 13572500
SMF90LTG EQU   *-SMF90T17              LENGTH OF TYPE 17 SEGMENT   @D8A 13584000
*                                                                  @LLA 13595500
*   SET GRSRNL COMMAND SEGMENT - SUBTYPE ID 18                     @LLA 13607000
*                                                                  @LLA 13618500
SMF90T18 DSECT                                                     @LLA 13630000
SMF90SGT DC    BL8'0'                  TIME OF SET GRSRNL CHANGE   @LLA 13641500
SMF90SGS DC    CL8' '                  SYSTEM THAT ISSUED THE CMD  @LLA 13653000
SMF90SGC DC    F'0'                    COUNT OF ENTRIES            @LLA 13664500
SMF90SGN DC    39CL2' '                NEW PARMLIB MEMBERS         @LLA 13676000
SMF90LTH EQU   *-SMF90T18              LENGTH OF TYPE 18 SEGMENT   @LLA 13687500
*                                                                  @LDA 13699000
*   SET APPC COMMAND SEGMENT - SUBTYPE ID 19                       @LDA 13710500
*                                                                  @LDA 13722000
SMF90T19 DSECT                                                     @LDA 13733500
SMF90APT DC    BL8'0'         TIME AND DATE OF 'SET APPC' CHANGE   @LDA 13745000
SMF90APC DC    BL4'0'                  NUMBER OF ENTRIES           @LDA 13756500
SMF90APN DC    CL8'0'                  NEW APPC PARMLIB MEMBER     @LDA 13768000
SMF90LTI EQU   *-SMF90T19              LENGTH OF TYPE 19 SEGMENT   @LDA 13779500
*                                                                  @LDA 13791000
*   SET SCHPRM COMMAND SEGMENT - SUBTYPE ID 20                     @LDA 13802500
*                                                                  @LDA 13814000
SMF90T20 DSECT                                                     @LDA 13825500
SMF90SCT DC    BL8'0'         TIME AND DATE OF 'SET SCHPRM' CHANGE @LDA 13837000
SMF90SCC DC    BL4'0'                  COUNT OF ENTRIES            @LDA 13848500
SMF90SCN DC    CL8'0'                  NEW SCHPRM PARMLIB MEMBER   @LDA 13860000
SMF90LTJ EQU   *-SMF90T20              LENGTH OF TYPE 20 SEGMENT   @LDA 13871500
*                                                                  @LKA 13883000
*   SET SCH COMMAND SEGMENT - SUBTYPE ID 21                        @LKA 13894500
*                                                                  @LKA 13906000
SMF90T21 DSECT                                                     @LKA 13917500
SMF90SHT DC    BL8'0'         TIME AND DATE OF 'SET SCH' CHANGE    @LKA 13929000
SMF90SHC DC    BL4'0'                  COUNT OF ENTRIES            @LKA 13940500
SMF90SHN DC    CL8'0'                  NEW SCHPRM PARMLIB MEMBER   @LKA 13952000
SMF90LTK EQU   *-SMF90T21              LENGTH OF TYPE 21 SEGMENT   @LKA 13963500
*                                                                  @LOA 13975000
*   SET CNGRP COMMAND SEGMENT - SUBTYPE ID 22                      @LOA 13986500
*                                                                  @LOA 13998000
SMF90T22 DSECT                                                     @LOA 14009500
SMF90CGT DC    BL8'0'         TIME AND DATE OF 'SET CNGRP' CHANGE  @LOA 14021000
SMF90CGC DC    BL4'0'                  COUNT OF ENTRIES            @LOA 14032500
SMF90CGN DC    CL8'0'                  NEW CNGRP PARMLIB MEMBER    @LOA 14044000
SMF90LTL EQU   *-SMF90T22              LENGTH OF TYPE 22 SEGMENT   @LOA 14055500
*                                                                  @D5A 14067000
*   WLM Service Definition Install Segment  - Subtype ID 23        @M1A 14078500
*   WLM Service Policy Activation Segment   - Subtype ID 24        @M1A 14090000
*   Workload Management Mode Change Segment - Subtype ID 25        @M1A 14101500
*   WLM RESET                               - Subtype ID 30        @M1A 14105300
*   WLM Scheduling Environment change       - Subtype ID 32        @M7A 14109100
*                                                                  @M1A 14113000
         IWMSMF90                                                  @M1A 14124500
*                                                                  @M1A 14136000
*   IPL LOGREC SEGMENT - SUBTYPE ID 26                             @LZA 14147500
*                                                                  @LZA 14159000
         IFBSMF90                                                  @LZA 14170500
*                                                                  @LZA 14182000
*                                                                 2@D3D 14193500
*   ARM restarts enabled                          - Subtype ID 27  @D3C 14205000
*   ARM restarts disabled                         - Subtype ID 28  @D3C 14216500
*                                                                  @L2A 14228000
         IXCYSM90                                                  @L2A 14239500
*                                                                       14254400
*   Dynamic LNKLST activation                     - Subtype ID 29  @M5A 14254500
*                                                                       14254600
         CSVDLSMF                                                  @M5A 14260000
*                                                                       14261000
*   Dynamic LPA add or delete                     - Subtype ID 31  @M6A 14262000
*                                                                       14263000
         CSVLPSMF                                                  @M6A 14264000
         AGO  .CONTB                                               @D6A 14265400
.IFAS092 ANOP                                                      @D6A 14270800
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 92 WRITTEN         @D6A 14276200
* BY THE O/MVS FILE SYSTEM                                         @D6A 14281600
*                                                                  @D6A 14287000
         EJECT                                                     @D6A 14292400
         BPXYSMFR                                                  @D6A 14297800
*                                                                  @D6A 14303200
         AGO  .CONTB                                               @D5A 14308600
.IFAS094 ANOP                                                      @D5A 14314000
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 94 WRITTEN         @D5A 14319400
* BY THE AUTOMATED TAPE LIBRARY FUNCTION                           @D5A 14324800
*                                                                  @D5A 14330200
         EJECT                                                     @D5A 14335600
         IECSMF94                                                  @D5A 14341000
*                                                                  @D5A 14346400
         AGO  .CONTB                                               @01A 14351800
.IFAS096 ANOP                                                      @01A 14357200
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 96 WRITTEN         @01A 14362600
* BY THE INTEGRATED REASONING SHELL (TIRS)                         @01A 14368000
*                                                                  @01A 14373400
         EJECT                                                     @01A 14378800
         EWQSMF96                                                  @01A 14384200
*                                                                  @01A 14389600
         AGO  .CONTB                                               @01A 14395000
*                                                                  @01A 14400400
.IFAS097 ANOP                                                      @M8A 14401000
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 97 WRITTEN         @M8A 14401600
* BY THE WORKLOAD MANAGER                                          @M8A 14402200
*                                                                  @M8A 14402800
         EJECT                                                     @M8A 14403400
         IWMSMF97                                                  @M8A 14404000
         AGO  .CONTB                                               @M8A 14404600
         MEND                                                        */ 14405800
*                                                                       14411200
*%IFAL85:                                                               14411700
*   IF IFAR85 = ''                                                      14412200
*      %THEN                                                            14412700
*     %GOTO IFAL88;                 /*                           @05A*/ 14413200
*                                                                       14413700
*/* THIS STRUCTURE DEFINES THE FORMAT FOR RECORD TYPE 85 WRITTEN @05A*/ 14414200
*/* BY OAM                                                       @05A*/ 14414700
*                                                                       14415200
*   %INCLUDE SYSLIB(CBRSMF) NOSEG;   /* DCLS FOR TYPE 85 RECORD  @05A*/ 14415700
*%IFAL88:                                                               14416600
*   IF IFAR88 = ''                                                      14422000
*      %THEN                                                            14427400
*     %GOTO IFAL89;                 /*                           @L4A*/ 14432800
*                                                                       14440200
*/* THIS STRUCTURE DEFINES THE FORMAT FOR RECORD TYPE 88 WRITTEN @L4A*/ 14490200
*/* BY THE LOGGER                                                @L4A*/ 14540200
*                                                                       14640200
*   %INCLUDE SYSLIB(IXGSMF88) NOSEG; /* DCLS FOR TYPE 88 RECORD  @L4A*/ 14651300
*%IFAL89:                                                               14662400
*   IF IFAR89 = ''                                                      14673500
*      %THEN                                                            14684600
*     %GOTO IFAL90;                 /*                           @02A*/ 14695700
*   DECLARE                         /*                               */ 14706800
*     1    SMFRCD89 BASED(SMF89PTR) BDY(WORD), /* Type 89 Subtype 1     14717900
*                                      Mapping                   @02A*/ 14729000
*                                                                       14740200
*     /***************************************************************/ 14781800
*     /*                                                             */ 14823400
*     /* Header Section                                              */ 14865000
*     /*                                                             */ 14906600
*     /***************************************************************/ 14948200
*                                                                       14990200
*       3    SMF89LEN FIXED(15),    /* Record Length             @02A*/ 15040200
*       3    SMF89SEG CHAR(2),      /* Segment descriptor        @02A*/ 15090200
*       3    SMF89FLG CHAR(1),      /* System indicator          @02A*/ 15140200
*       3    SMF89RTY FIXED(8),     /* Record type - 89, x'59'   @02A*/ 15190200
*       3    SMF89TME CHAR(4),      /* Time, in hundredths of a         15240200
*                                      second, record was moved to      15290200
*                                      the SMF buffer.           @02A*/ 15340200
*       3    SMF89DTE CHAR(4),      /* Date that the record was moved   15390200
*                                      to the SMF buffer, in the form   15440200
*                                      of 0cyydddF, where F is the      15490200
*                                      sign                      @02A*/ 15540200
*       3    SMF89SID CHAR(4),      /* System identification (taken     15590200
*                                      from SID parameter)       @02A*/ 15640200
*       3    SMF89WID CHAR(4),      /* Subsystem identifier for the     15690200
*                                      SMF address space - 'STC' for    15740200
*                                      Started Task              @02A*/ 15790200
*       3    SMF89STP FIXED(15),    /* Record Subtype '1' - Usage       15840200
*                                      Interval.                 @02A*/ 15890200
*       3    SMF89SDL FIXED(31),    /* Length of self-defining          15940200
*                                      section                   @02A*/ 15990200
*                                                                       16040200
*     /***************************************************************/ 16056800
*     /*                                                             */ 16073400
*     /* Self-Defining Section                                       */ 16090000
*     /*                                                             */ 16106600
*     /***************************************************************/ 16123200
*                                                                       16140200
*       3    SMF89SDS,              /* Self-Defining Section     @02A*/ 16190200
*         5    SMF89PRO FIXED(31),  /* Offset of Record Product         16240200
*                                      Section (from start of record    16340200
*                                      including the RDW         @02A*/ 16390200
*         5    SMF89PRL FIXED(15),  /* Length of each Record Product    16440200
*                                      Section                   @02A*/ 16490200
*         5    SMF89PRN FIXED(15),  /* Number of Record Product         16540200
*                                      Sections - '1'            @02A*/ 16590200
*         5    SMF89SIO FIXED(31),  /* Offset of System ID Section      16640200
*                                      (from start of record            16690200
*                                      including the RDW         @02A*/ 16740200
*         5    SMF89SIL FIXED(15),  /* Length of each System ID         16790200
*                                      Section                   @02A*/ 16840200
*         5    SMF89SIN FIXED(15),  /* Number of System ID Sections -   16885600
*                                      '1'                       @02A*/ 16931000
*         5    SMF89UDO FIXED(31),  /* Offset of First Usage/Product    16976400
*                                      Data Section (from start of      17021800
*                                      record, including the RDW).      17067200
*                                                                @02A*/ 17112600
*         5    SMF89UDL FIXED(15),  /* Length of each Usage/Product     17158000
*                                      Data Section.             @02A*/ 17203400
*         5    SMF89UDN FIXED(15),  /* Number of Usage/Product Data     17248800
*                                      Sections (Min '0').       @02A*/ 17294200
*         5    SMF89UDR FIXED(31),  /* Number of Product Data           17340200
*                                      sections remaining. Will be 0    17390200
*                                      for usage data.           @MXA*/ 17440200
*                                                                       17490200
*     /***************************************************************/ 17540200
*     /*                                                             */ 17590200
*     /* SMF 89 record subtypes                                      */ 17640200
*     /*                                                             */ 17690200
*     /***************************************************************/ 17740200
*                                                                       17790200
*     SMF89STPusage CONSTANT(1),    /* SMF 89 measured usage     @M3A*/ 17840200
*     SMF89STPprodreg CONSTANT(2),  /* SMF 89 product registration      17890200
*                                                                @M3A*/ 17940200
*                                                                       17990200
*     /***************************************************************/ 18015200
*     /*                                                             */ 18040200
*     /* Product Section                                             */ 18065200
*     /*                                                             */ 18090200
*     /***************************************************************/ 18115200
*                                                                       18140200
*     1    SMF89PR  BASED(ADDR(SMFRCD89)+SMF89PRO) BDY(WORD), /* @02A*/ 18190200
*       3    SMF89PNM CHAR(8),      /* Record Product Name - 'SMF'      18240200
*                                                                @02A*/ 18340200
*       3    SMF89RVN FIXED(31),    /* Record Version Number - '01'     18390200
*                                                                @02A*/ 18440200
*       3    SMF89OSL CHAR(8),      /* MVS System Level (ie.            18490200
*                                      'SP4.3.0')                @02A*/ 18540200
*       3    SMF89IST FIXED(32),    /* Reporting Interval START Time    18590200
*                                      (in hundredths of a second). 0   18640200
*                                      for non-Interval records  @02A*/ 18690200
*       3    SMF89ISD CHAR(4),      /* Reporting Interval START Date    18740200
*                                      in the form of 0cyydddF, where   18840200
*                                      F is the sign. 0 for             18890200
*                                      non-Interval records      @02A*/ 18940200
*       3    SMF89IET FIXED(32),    /* Reporting Interval END Time      18990200
*                                      (in hundredths of a second). 0   19040200
*                                      for non-Interval records  @02A*/ 19090200
*       3    SMF89IED CHAR(4),      /* Reporting Interval END Date in   19140200
*                                      the form of 0cyydddF, where F    19190200
*                                      is the sign 0 for non-Interval   19240200
*                                      records                   @02A*/ 19290200
*                                                                       19490200
*     /***************************************************************/ 19506800
*     /*                                                             */ 19523400
*     /* System ID Section                                           */ 19540000
*     /*                                                             */ 19556600
*     /***************************************************************/ 19573200
*                                                                       19590200
*     1    SMF89SI  BASED(ADDR(SMFRCD89)+SMF89SIO) BDY(WORD), /* @02A*/ 19640200
*       3    SMF89SYN CHAR(8),      /* MVS System Name (taken from      19690200
*                                      SYSNAME in IEASYSxx)      @02A*/ 19790200
*       3    SMF89UST FIXED(32),    /* Usage Data Interval START Time   19840200
*                                      (in hundredths of a second). 0   19890200
*                                      for non-Interval records  @02A*/ 19940200
*       3    SMF89USD CHAR(4),      /* Usage Data Interval START Date   19990200
*                                      in the form of 0cyydddF, where   20090200
*                                      F is the sign. 0 for             20140200
*                                      non-Interval records      @02A*/ 20190200
*       3    SMF89UET FIXED(32),    /* Usage Data Interval END Time     20240200
*                                      (in hundredths of a second). 0   20290200
*                                      for non-Interval records  @02A*/ 20340200
*       3    SMF89UED CHAR(4),      /* Usage Data Interval END Date     20390200
*                                      in the form of 0cyydddF, where   20540200
*                                      F is the sign 0 for              20590200
*                                      non-Interval records      @02A*/ 20640200
*       3    SMF89CSU FIXED(32),    /* CPU Service Coefficient in       20690200
*                                      affect at the time that the      20790200
*                                      record was generated. 0 for      20840200
*                                      non-Interval records      @02A*/ 20890200
*       3    SMF89SRU FIXED(32),    /* SRB Service Coefficient in       20940200
*                                      affect at the time that the      21040200
*                                      record was generated. 0 for      21090200
*                                      non-Interval records      @02A*/ 21140200
*       3    SMF89CMN CHAR(2),      /* CPU Model Number (Packed) @02A*/ 21190200
*       3    SMF89CVN CHAR(1),      /* CPU Version Number        @02A*/ 21240200
*       3    SMF89LPI CHAR(1),      /* LPAR Partition ID         @02A*/ 21290200
*         5    SMF89LP1 BIT(4),     /* 1st nibble - flags        @P4C*/ 21323500
*           7  SMF89LPV BIT(1),     /* LPAR ID is valid (allow 0)@P4A*/ 21356800
*         5    SMF89LP2 BIT(4),     /* LPAR Partition ID         @04A*/ 21390200
*       3    SMF89SER CHAR(3),      /* CPU Serial Number (Packed)       21440200
*                                                                @02A*/ 21540200
*       3    *        CHAR(1),      /* Reserved                  @02A*/ 21590200
*       3    SMF89RPP FIXED(32),    /* CPU Relative Processing Power    21640200
*                                      Indicator                 @02A*/ 21690200
*       3    SMF89SPN CHAR(8),      /* MVS SYSPLEX Name          @02A*/ 21740200
*       3    SMF89CPT CHAR(6),      /* CPC Type Number           @02A*/ 21790200
*       3    SMF89CPM CHAR(3),      /* CPC Model Number          @02A*/ 21840200
*       3    SMF89CPS CHAR(12),     /* CPC Sequence Number       @02A*/ 21890200
*       3    *        CHAR(3),      /* Reserved                  @02A*/ 21940200
*       3    SMF89S11,              /* SYSIB 1.1 Information     @06A*/ 21943500
*         5  SMF89MNF CHAR(16),     /* V1-CPC Manufacturer       @06A*/ 21946800
*         5  SMF89TID CHAR(4),      /* V1-CPC Type               @06A*/ 21950100
*         5  SMF89MDL CHAR(16),     /* V1-CPC Model              @06A*/ 21953400
*         5  SMF89SQC CHAR(16),     /* V1-CPC Sequence Code      @06A*/ 21956700
*         5  SMF89POM CHAR(4),   /* V1-CPC Plant of Manufacturer @06A*/ 21960000
*       3    SMF89S22,              /* SYSIB 2.2 Information     @06A*/ 21963300
*         5  SMF89CPC FIXED(32),    /* CPU Capability            @06A*/ 21966600
*         5  SMF89CCC FIXED(16),    /* Configured CPU Count      @06A*/ 21969900
*         5  SMF89SCC FIXED(16),    /* Standby CPU Count         @06A*/ 21973200
*         5  SMF89MAF CHAR(30) BDY(HWORD), /*                    @06A*/ 21976500
*            7 SMF89AFE(15) FIXED(16),  /* Array of                     21979800
*                                      Multiprocessing CPU Capability   21983100
*                                      Adjustment Factors        @06A*/ 21986400
*                                                                       21990200
*     /***************************************************************/ 22040200
*     /*                                                             */ 22090200
*     /* Usage Data Section                                          */ 22140200
*     /*                                                             */ 22190200
*     /***************************************************************/ 22240200
*                                                                       22290200
*     1    SMF89UD  BASED(ADDR(SMFRCD89)+SMF89UDO) BDY(WORD), /* @02A*/ 22340200
*       3    SMF89UPO CHAR(16),     /* Product Owner or Vendor Name     22390200
*                                      (obtained PRODOWNER option ofA   22490200
*                                      IFAUSAGE macro)           @02A*/ 22540200
*       3    SMF89UPN CHAR(16),     /* Product Name (obtained           22580200
*                                      PRODNAME option of IFAUSAGE      22620200
*                                      macro)                    @02A*/ 22660200
*       3    SMF89UPV CHAR(8),      /* Product Version (obtained        22700200
*                                      PRODVERS option of IFAUSAGE      22740200
*                                      macro)                    @02A*/ 22790200
*       3    SMF89UPQ CHAR(8),      /* Product Qualifier (obtained      22840200
*                                      PRODQUAL option of IFAUSAGE      22890200
*                                      macro)                    @02A*/ 22940200
*       3    SMF89UPI CHAR(8),      /* Product ID (obtained PRODID      22990200
*                                      option of IFAUSAGE macro) @02A*/ 23040200
*       3    SMF89UCT CHAR(8),      /* Product TCB Time (in hundreths   23090200
*                                      of a second - floating point)    23140200
*                                                                @02A*/ 23190200
*       3    SMF89USR CHAR(8),      /* Product SRB Time (in hundreths   23240200
*                                      of a second - floating point)    23290200
*                                                                @02A*/ 23340200
*       3    SMF89UFG CHAR(1),      /* Usage Entry Flags         @02A*/ 23390200
*         5    SMF89UUN BIT(1),     /* UNAUTHORIZED REGISTER            23440200
*                                      Requested                 @02A*/ 23490200
*         5    SMF89UNU BIT(1),     /* Ineligible for measured usage    23540200
*                                                                @MXA*/ 23590200
*         5    *        BIT(6),     /* Reserved                  @MXC*/ 23640200
*       3    *        CHAR(2),      /* Reserved                  @02A*/ 23690200
*       3    SMF89URT FIXED(8),     /* Data Type of value in SMF89URD   23740200
*                                      (as specified by the FORMAT      23790200
*                                      option on the FUNCTIONDATA       23840200
*                                      Request of the IFAUSAGE          23890200
*                                      macro).                   @02A*/ 23940200
*       3    SMF89URD CHAR(8);      /* Product 'Specific' Resource      23990200
*                                      Data (specified by the DATA      24040200
*                                      option on the FUNCTIONDATA       24090200
*                                      Request of the IFAUSAGE          24140200
*                                      macro).                   @02A*/ 24190200
*   %IF SYSVERSION = '' %THEN                                           24240200
*     %GOTO NOPRODED;               /*                           @MXA*/ 24290200
*                                                                       24340200
*   /*****************************************************************/ 24390200
*   /*                                                               */ 24440200
*   /* Product enable/disable section                                */ 24490200
*   /*                                                               */ 24540200
*   /*****************************************************************/ 24590200
*                                                                       24640200
*   DECLARE                                                             24690200
*     1    SMF89T2  BASED(ADDR(SMFRCD89)+SMF89UDO) BDY(WORD), /* @MXA*/ 24740200
*      2    SMF89T2EI,              /* This matches EdaaeInfo in        24790200
*                                      DSECT EDAA in macro IFAEDIDF     24840200
*                                                                @MxA*/ 24890200
*       3    SMF89T2ProdOwner CHAR(16), /* Product Owner or Vendor      24940200
*                                      Name (from prodowner parameter   24990200
*                                      of IFAEDREG or OWNER option of   25040200
*                                      PRODUCT statement of IFAPEDxx)   25090200
*                                                                @MXA*/ 25140200
*       3    SMF89T2ProdName CHAR(16), /* Product name (from prodname   25190200
*                                      parameter of IFAEDREG or NAME    25240200
*                                      option of PRODUCT statement of   25290200
*                                      IFAPEDxx)                 @MXA*/ 25340200
*       3    SMF89T2FeatureName CHAR(16), /* Feature name (from         25390200
*                                      featurename parameter of         25440200
*                                      IFAEDREG or FEATURENAME option   25490200
*                                      of PRODUCT statement of          25540200
*                                      IFAPEDxx)                 @MXA*/ 25590200
*       3    SMF89T2ProdVers CHAR(2), /* Product version (from          25640200
*                                      prodvers parameter of IFAEDREG   25690200
*                                      or VERSION option of PRODUCT     25740200
*                                      statement of IFAPEDxx)    @MXA*/ 25790200
*       3    SMF89T2ProdRel CHAR(2), /* Product release (from prodrel   25840200
*                                      parameter of IFAEDREG or         25890200
*                                      RELEASE option of PRODUCT        25940200
*                                      statement of IFAPEDxx)    @MXA*/ 25990200
*       3    SMF89T2ProdMod CHAR(2), /* Product modification level      26040200
*                                      (from prodmod parameter of       26090200
*                                      IFAEDREG or MOD option of        26140200
*                                      PRODUCT statement of IFAPEDxx)   26190200
*                                                                @MXA*/ 26240200
*       3    SMF89T2ProdID CHAR(8), /* Product ID (from prodowner       26290200
*                                      parameter of IFAEDREG or OWNER   26340200
*                                      option of PRODUCT statement of   26390200
*                                      IFAPEDxx)                 @MXA*/ 26440200
*      2    *,                      /*                           @MXA*/ 26490200
*       3    SMF89T2Flags BIT(8),   /* Flags                     @MXA*/ 26540200
*         5    SMF89T2NotDefined BIT(1), /* Entry is not defined @MXA*/ 26590200
*         5    SMF89T2Enabled BIT(1), /* State is enabled        @MXA*/ 26640200
*         5    *        BIT(2),     /* Reserved                  @MXA*/ 26690200
*         5    SMF89T2RegEntry BIT(1), /* Register entry         @MXA*/ 26740200
*         5    SMF89T2StateEntry BIT(1), /* State entry          @MXA*/ 26790200
*         5    SMF89T2NoReport BIT(1), /* "No Report" - registered      26840200
*                                      with IFAEDREG_TYPE_NOREPORT      26890200
*                                                                @MXA*/ 26940200
*         5    SMF89T2LicensedUnderProd BIT(1), /* Registered with IF   26990200
*                                      AEDREG_TYPE_LicensedUnderProd    27040200
*                                                                @MXA*/ 27090200
*       3    *        CHAR(1),      /* Reserved                  @MXA*/ 27140200
*      2    SMF89T2NumInstances FIXED(31), /* Maximum number of         27190200
*                                      instances of registrations of    27240200
*                                      this product              @MXA*/ 27290200
*      2    *        CHAR(0);       /*                           @MXA*/ 27340200
*%NOPRODED:                                                             27390200
*   ;                               /*                           @MxA*/ 27440200
*%IFAL90:                                                               27540200
*   IF IFAR90 = ''                                                      27590200
*      %THEN                                                            27640200
*     %GOTO IFAL92;                 /*                           @D6C*/ 27690200
*                                                                       27740200
*/*   THIS RECORD IS WRITTEN WHEN EVER AN OPERATOR COMMAND OR        */ 27775300
*/*   RESPONSE OF THE FOLLOWING TYPE IS RECEIVED:                @D2C*/ 27810400
*/*             1  SET TIME                                          */ 27845500
*/*             2  SET DATE                                          */ 27880600
*/*             3  SETDMN                                            */ 27915700
*/*             4  SET IPS                                           */ 27950800
*/*             5  SET SMF                                           */ 27985900
*/*             6  SWITCH SMF                                        */ 28021000
*/*             7  HALT EOD                                          */ 28056100
*/*             8  IPL PROMPT (RESPONSE)                             */ 28091200
*/*             9  IPL SMF (RESPONSE)                                */ 28126300
*/*             10 IPL SRM (RESPONSE)                                */ 28161400
*/*             11 SET OPT                                           */ 28196500
*/*             12 SET ICS                                           */ 28231600
*/*             13 SETSMF                                    @G383P26*/ 28266700
*/*             14 SET MPF                                   @G382P27*/ 28301800
*/*             15 RESTART SMF                                   @L1A*/ 28336900
*/*             16 SET DAE                                       @D2A*/ 28372000
*/*             17 SET PFK                                       @D8A*/ 28407100
*/*             18 SET GRSRNL                                    @LLA*/ 28442200
*/*             19 SET APPC                                      @LDA*/ 28477300
*/*             20 SET SCHPRM                                    @LDA*/ 28512400
*/*             21 SET SCH                                       @LKA*/ 28547500
*/*             22 SET CNGRP                                     @LOA*/ 28582600
*/*             23 WLM Service Definition Install                @M1C*/ 28617700
*/*             24 WLM Service Policy Activation                 @M1C*/ 28652800
*/*             25 Workload Management Mode Change               @M1C*/ 28687900
*/*             26 IPL LOGREC                                    @LZA*/ 28723000
*/*             27 ARM restarts enabled                          @D3A*/ 28758100
*/*             28 ARM restarts disabled                         @D3A*/ 28793200
*/*             29 CSV LNKLST set activated                      @M5A*/ 28828300
*/*             30 WLM RESET                                     @M5A*/ 28837000
*/*             31 Modules added or deleted from LPA             @M6A*/ 28845700
*/*             32 WLM Scheduling Environment change             @M7A*/ 28854400
*/*                                                                  */ 28863400
*/*                                                              @LZC*/ 28898500
*/*                                                                  */ 28933600
*/*   RECORD LENGTH IS VARIABLE MINIMUM OF XXX BYTES                 */ 28968700
*                                                                       29003800
*   DECLARE                                                             29038900
*                                                                       29074000
*     /***************************************************************/ 29109100
*     /*                                                             */ 29144200
*     /* SMF RECORD HEADER SEGMENT                                   */ 29179300
*     /*                                                             */ 29214400
*     /***************************************************************/ 29249500
*                                                                       29284600
*     1    SMFRCD90 BASED(SMF90PTR) BDY(WORD),                          29319700
*       3    SMF90LEN FIXED(15),    /* RECORD LENGTH                 */ 29354800
*       3    SMF90SEG FIXED(15),    /* SEGMENT DESCRIPTOR            */ 29389900
*       3    SMF90FLG BIT(8),       /* HEADER FLAG BYTE              */ 29425000
*       3    SMF90RTY FIXED(8),     /* RECORD TYPE 90 HEX 5A         */ 29460100
*       3    SMF90TME FIXED(31) BDY(HWORD), /* RECORD WRITTEN TIME   */ 29495200
*       3    SMF90DTE CHAR(4),      /* RECORD WRITTEN DATE           */ 29530300
*       3    SMF90SID CHAR(4),      /* SYSTEM IDENTIFICATION         */ 29565400
*                                                                       29600500
*     /***************************************************************/ 29635600
*     /*                                                             */ 29670700
*     /* SELF DEFINING SECTION                                       */ 29705800
*     /*                                                             */ 29740900
*     /***************************************************************/ 29776000
*                                                                       29811100
*       3    *        FIXED(15),    /* RESERVED              @VS49902*/ 29846200
*     1    SMF90PSG BASED(ADDR(SMFRCD90)+LENGTH(SMFRCD90)), /*          29881300
*                                                            @VS49902*/ 29916400
*       3    SMF90POF FIXED(31),    /* OFFSET TO PROD SECT   @VS49902*/ 29951500
*       3    SMF90PLN FIXED(15),    /* LENGTH OF PRODUCT SECTION     */ 29986600
*       3    SMF90PON FIXED(15),    /* NUMBER OF PRODUCT SECTION     */ 30021700
*       3    SMF90DOF FIXED(31),    /* OFFSET TO DATA SECT   @VS49902*/ 30056800
*       3    SMF90DLN FIXED(15),    /* LENGTH OF DATA SECTION        */ 30091900
*       3    SMF90DON FIXED(15);    /* NUMBER OF DATA SECTION        */ 30127000
*                                                                       30162100
*   /*****************************************************************/ 30197200
*   /*                                                               */ 30232300
*   /* PRODUCT HEADER                                                */ 30267400
*   /*                                                               */ 30302500
*   /*****************************************************************/ 30337600
*                                                                       30372700
*   DECLARE                                                             30407800
*     1    SMF90PRH BASED(ADDR(SMFRCD90)+SMF90POF),                     30442900
*       3    SMF90TID FIXED(15) BDY(BYTE), /* SUB TYPE ID            */ 30478000
*                                                                       30513100
*/*  *************************************************************** */ 30548200
*/*    1 = SET TIME   2 = SET DATE     3 = SETDMN     4 = SET IPS    */ 30583300
*/*    5 = SET SMF    6 = SWITCH SMF   7 = HALT EOD   8 = IPL PROMPT */ 30618400
*/*    9 = IPL SMF   10 = IPL SRM     11 = SET OPT   12 = SET ICS    */ 30653500
*/*   13 = SETSMF    14 = SET MPF     15=RESTART SMF 16 = SET DAE    */ 30688600
*/*   17 = SET PFK   18 = SET GRSRNL  19 = SET APPC              @LLC*/ 30723700
*/*   20 = SET SCHPRM                 21 = SET SCH               @LKC*/ 30758800
*/*   22 = SET CNGRP                                             @LOA*/ 30793900
*/*   23 = WLM Service Definition Install                        @M1C*/ 30829000
*/*   24 = WLM Service Policy Activation                         @M1A*/ 30864100
*/*   25 = Workload Management Mode Change                       @M1A*/ 30899200
*/*   26 = IPL LOGREC                                            @LZA*/ 30934300
*/*                                                             2@D3D*/ 30969400
*/*   27 = ARM restarts enabled                                  @D3C*/ 31004500
*/*   28 = ARM restarts disabled                                 @D3C*/ 31039600
*/*   29 = CSV LNKLST set activated                              @M5A*/ 31074700
*/*   30 = WLM RESET                                             @M6A*/ 31083400
*/*   31 = Modules added to or deleted from LPA                  @M6A*/ 31092100
*/*   32 = WLM Scheduling Environment change                     @M7A*/ 31100800
*/*                                                                  */ 31109800
*/*  *************************************************************** */ 31144900
*                                                                       31180000
*       3    SMF90RVN CHAR(2) BDY(BYTE), /* RECORD VERSION NUMBER    */ 31215100
*       3    SMF90PNM CHAR(8);      /* PRODUCT NAME - SMF,SRM,SUP,ETC*/ 31250200
*                                                                       31285300
*   /*****************************************************************/ 31320400
*   /*                                                               */ 31355500
*   /* IPL SMF/SET SMF/SETSMF COMMAND SEGMENT - SUBTYPE ID 5 OR 9 OR */ 31390600
*   /* 13 OR 15                                                      */ 31425700
*   /*                                                               */ 31460800
*   /*****************************************************************/ 31495900
*                                                                       31531000
*   DECLARE                                                             31566100
*     1    SMF90T5  BASED(ADDR(SMFRCD90)+SMF90DOF),                     31601200
*                                                                       31636300
*     /***************************************************************/ 31671400
*     /*                                                             */ 31706500
*     /* SELF DEFINING SECTION FOR SUBTYPE 5,9,13,OR 15              */ 31741600
*     /*                                                             */ 31776700
*     /***************************************************************/ 31811800
*                                                                       31846900
*       3    SMF90OSM FIXED(31) BDY(BYTE), /* OFFSET OF SMF SEG         31882000
*                                                            @VS49902*/ 31917100
*       3    SMF90LSM FIXED(15) BDY(BYTE), /* LENGTH OF SMF SEGMENT  */ 31952200
*       3    SMF90NSM FIXED(15) BDY(BYTE), /* NUMBER OF SMF SEGMENTS */ 31987300
*       3    SMF90ODA FIXED(31) BDY(BYTE), /* OFFSET OF DATASET SG      32022400
*                                                            @VS49902*/ 32057500
*       3    SMF90LDA FIXED(15) BDY(BYTE), /* LENGTH OF DATASET         32092600
*                                      SEGMENT                       */ 32127700
*       3    SMF90NDA FIXED(15) BDY(BYTE), /* NUMBER OF DATA SETS    */ 32162800
*       3    SMF90OWK FIXED(31) BDY(BYTE), /* OFFSET OF SUBSYS SEG      32197900
*                                                            @VS49902*/ 32233000
*       3    SMF90LWK FIXED(15) BDY(BYTE), /* LENGTH OF SUBSYSTEM       32268100
*                                      SEGMENT                       */ 32303200
*       3    SMF90NWK FIXED(15) BDY(BYTE), /* NUMBER OF SUBSYSTEMS   */ 32338300
*       3    SMF90OOT FIXED(31) BDY(BYTE), /* OFFSET OF SUBPARM SEG     32373400
*                                                            @G383P26*/ 32408500
*       3    SMF90LOT FIXED(15) BDY(BYTE), /* LENGTH OF SUBPARM SEG     32443600
*                                                            @G383P26*/ 32478700
*       3    SMF90NOT FIXED(15) BDY(BYTE); /* NUMBER OF SUBPARM SEG     32513800
*                                                                @L1C*/ 32548900
*                                                                       32590200
*   /*****************************************************************/ 32606800
*   /*                                                               */ 32623400
*   /* SMF SEGMENT - MAPS THE SMFPRMXX PARAMETERS SPECIFIED          */ 32640000
*   /*                                                               */ 32656600
*   /*****************************************************************/ 32673200
*                                                                       32690200
*   DECLARE                                                             32736400
*     1    SMF90DSM BASED(ADDR(SMFRCD90)+SMF90OSM),                     32782600
*       3    SMF90MAX CHAR(4),      /* MAXDORM IN MMSS FORMAT        */ 32828800
*       3    SMF90STA CHAR(6),      /* STATUS IN HHMMSS FORMAT       */ 32875000
*       3    SMF90JWT CHAR(4),      /* JWT IN MMSS FORMAT            */ 32921200
*       3    SMF90SYI CHAR(4),      /* SYSID IN CHARACTER            */ 32967400
*       3    SMF90BUF FIXED(8),     /* RESERVED (PREVIOUSLY THE         33013600
*                                      MINIMUM NUMBER OF BUFFERS)       33059800
*                                                                @P2C*/ 33106000
*       3    SMF90BUM FIXED(8),     /* RESERVED (PREVIOUSLY THE         33152200
*                                      MAXIMUM NUMBER OF BUFFERS)       33198400
*                                                                @P2C*/ 33244600
*       3    SMF90SWT CHAR(1),      /* SWITCHES                      */ 33290800
*         5    SMF90PAL BIT(1),     /* PROMPT(ALL)                   */ 33337000
*         5    SMF90PLT BIT(1),     /* PROMPT(LIST)                  */ 33383200
*         5    SMF90PIP BIT(1),     /* PROMPT(IPLR)                  */ 33429400
*         5    SMF90PNO BIT(1),     /* NOPROMPT                  @P1C*/ 33475600
*         5    SMF90RPR BIT(1),     /* REC(PERM)                     */ 33521800
*         5    SMF90RAL BIT(1),     /* REC(ALL)                      */ 33568000
*         5    SMF90LDS BIT(1),     /* LISTDSN                       */ 33614200
*         5    SMF90NLD BIT(1),     /* NOLISTDSN                     */ 33660400
*       3    SMF90SW2 CHAR(1),      /* SWITCHES                  @DIA*/ 33706600
*         5    SMF90NBM BIT(1),     /* NOBUFFS(MSG)              @DIA*/ 33752800
*         5    SMF90NBH BIT(1),     /* NOBUFFS(HALT)             @DIA*/ 33799000
*         5    SMF90LDM BIT(1),     /* LASTDS(MSG)               @DIA*/ 33845200
*         5    SMF90LDH BIT(1),     /* LASTDS(HALT)              @DIA*/ 33891400
*       3    SMF90SBU FIXED(8),     /* SMF SID Syntax Used       @LWA*/ 33937600
*         5    SMF90SDF BIT(1),     /* 'Default'                 @LWA*/ 33983800
*         5    SMF90SON BIT(1),     /* SID(xxxx)                 @LWA*/ 34030000
*         5    SMF90SSE BIT(1),     /* SID(xxxx,ser#)            @LWA*/ 34076200
*         5    SMF90SSY BIT(1),     /* SID(xxxx,SYSNAME(sysname))       34122400
*                                                                @LWA*/ 34168600
*         5    SMF90SSM BIT(1),     /* Reserved                  @L3C*/ 34214800
*         5    SMF90SCO BIT(1),     /* SID(xxxx,COMBIN(ser#,)    @LWA*/ 34261000
*         5    SMF90SRV BIT(2),     /* Reserved                  @LWA*/ 34307200
*       3    SMF90RV7 CHAR(1),      /* RESERVED                  @LWC*/ 34353400
*       3    SMF90REL CHAR(4),      /* MVS RELEASE NUMBER            */ 34399600
*       3    SMF90IIT CHAR(4),      /* IPL TIME - Binary             */ 34445800
*       3    SMF90IDT CHAR(4);      /* IPL DATE - 0cyydddF           */ 34492000
*                                                                       34540200
*   /*****************************************************************/ 34565200
*   /*                                                               */ 34590200
*   /* SUBTYPE 5,9,13,OR 15 - DATA SET SEGMENT. THERE WILL BE AN     */ 34615200
*   /* ENTRY FOR EACH SMF RECORDING DATA SET. THE FIRST DATA SET IS  */ 34640200
*   /* THE ACTIVE DATA SET AT IPL                                    */ 34665200
*   /*                                                               */ 34690200
*   /*****************************************************************/ 34715200
*                                                                       34740200
*   DECLARE                                                             34790200
*     1    SMF90DSE BASED(ADDR(SMFRCD90)+SMF90ODA),                     34840200
*       3    SMF90DSN CHAR(44);     /* SMF DATA SET NAME         @LXC*/ 34890200
*                                                                       34940200
*   /*****************************************************************/ 34961600
*   /*                                                               */ 34983000
*   /* SUBTYPE 5,9,13, OR 15- WORK CLASS RECORDING SEGMENT. THERE    */ 35004400
*   /* WILL BE ONE ENTRY FOR EACH SYS OR SUBSYS                      */ 35025800
*   /*                                                               */ 35047200
*   /*****************************************************************/ 35068600
*                                                                       35090200
*   DECLARE                                                             35140200
*     1    SMF90WCH BASED(ADDR(SMFRCD90)+SMF90OWK),                     35190200
*       3    SMF90WKN CHAR(4),      /* SUBSYSTEM NAME                */ 35240200
*       3    SMF90DTL CHAR(1),      /* SMF SUBSYS FLAGS X'80' DETAIL */ 35290200
*       3    SMF90RS9 CHAR(3),      /* RESERVED                      */ 35340200
*       3    SMF90SVL CHAR(8),      /* INTERVAL RECORD FOR SUB SYSTEM*/ 35390200
*       3    SMF90SYS BIT(256),     /* BIT REPRESENTATION FOR WORK      35440200
*                                      CLASS RECORDS 1 = RECORD ON, 0   35490200
*                                      = RECORD OFF BIT 0 = RECORD 0    35540200
*                                      BIT 255 = RECORD 255          */ 35590200
*       3    SMF90EXN(15) CHAR(8);  /* EIGHT BYTE NAME OF EACH EXIT  */ 35640200
*                                                                       35740200
*   /*****************************************************************/ 35765200
*   /*                                                               */ 35790200
*   /* SUBTYPE 5 OR 9 OR 13 OR 15 - SUBPARM SEGMENT. THERE WILL BE AN*/ 35815200
*   /* ENTRY FOR EACH SUBSYSTEM FOR WHICH AN SUBPARM HAS BEEN        */ 35840200
*   /* SPECIFIED                                                     */ 35865200
*   /*                                                               */ 35890200
*   /*****************************************************************/ 35915200
*                                                                       35940200
*   DECLARE                                                             35990200
*     1    SMF90SUB BASED(ADDR(SMFRCD90)+SMF90OOT), /*       @G383P26*/ 36040200
*       3    SMF90ASN CHAR(4),      /* SUBSYSTEM NAME        @G383P26*/ 36090200
*       3    SMF90APM CHAR(60);     /* SUBSYSTEM PARAMETER   @G383P26*/ 36140200
*                                                                       36190200
*   /*****************************************************************/ 36231300
*   /*                                                               */ 36272400
*   /* SWITCH SMF/HALT EOD SEGMENT - SUBTYPE 6 OR 7                  */ 36313500
*   /*                                                               */ 36354600
*   /*****************************************************************/ 36395700
*                                                                       36436800
*   DECLARE                                                             36477900
*     1    SMF90T6  BASED(ADDR(SMFRCD90)+SMF90DOF),                     36519000
*       3    SMF90SWO CHAR(10),     /* Old Recording Data Set Name   */ 36560100
*                                                                       36601200
*     /***************************************************************/ 36642300
*     /*                                                             */ 36683400
*     /* Subtype 6: Blank, if data is lost                       @LXC*/ 36724500
*     /* Subtype 7: Blank If the length of the data set is greater   */ 36765600
*     /* than 10, this field is Blank. See SMF90SOD for the complete */ 36806700
*     /* data set name.                                              */ 36847800
*     /*                                                             */ 36888900
*     /***************************************************************/ 36930000
*                                                                       36971100
*       3    SMF90SWN CHAR(10),     /* New Recording Data Set Name   */ 37012200
*                                                                       37053300
*     /***************************************************************/ 37094400
*     /*                                                             */ 37135500
*     /* Subtype 7: Blank                                        @LXC*/ 37176600
*     /* If the length of the data set is greater than 10, this field*/ 37217700
*     /* is Blank. See SMF90SND for the complete data set name.      */ 37258800
*     /*                                                             */ 37299900
*     /***************************************************************/ 37341000
*                                                                       37382100
*       3    SMF90IT  CHAR(4),      /* IPL TIME                      */ 37423200
*       3    SMF90DT  CHAR(4),      /* IPL DATE                      */ 37464300
*       3    SMF90SOD CHAR(44),     /* Old Recording Data Set Name      37505400
*                                                                @LXA*/ 37546500
*                                                                       37590200
*     /***************************************************************/ 37604400
*     /*                                                             */ 37618600
*     /* Subtype 6: Blank, if data is lost                       @LXA*/ 37632800
*     /* Subtype 7: Blank                                            */ 37647000
*     /*                                                             */ 37661200
*     /***************************************************************/ 37675400
*                                                                       37690200
*       3    SMF90SND CHAR(44);     /* New Recording Data Set Name      37713700
*                                                                @LXA*/ 37737200
*                                                                       37760700
*   /*****************************************************************/ 37784200
*   /*                                                               */ 37807700
*   /* Subtype 7: Blank SYSTEM IPL PROMPT DATA - SUBTYPE ID 8        */ 37831200
*   /*                                                               */ 37854700
*   /*****************************************************************/ 37878200
*                                                                       37901700
*   DECLARE                                                             37925200
*     1    SMF90T8  BASED(ADDR(SMFRCD90)+SMF90DOF),                     37948700
*       3    SMF90DTM CHAR(8),      /* SYSTEM DOWN TIME HH.MM.SS OR U*/ 37972200
*       3    SMF90RSN CHAR(65),     /* IPL REASON OR U               */ 37995700
*       3    SMF90OPR CHAR(20),     /* OPERATOR'S NAME OR U          */ 38019200
*       3    SMF90ITM CHAR(4),      /* TIME OF IPL                   */ 38042700
*       3    SMF90DTT CHAR(4);      /* DATE OF IPL YYDDDF            */ 38066200
*                                                                       38090200
*   /*****************************************************************/ 38106800
*   /*                                                               */ 38123400
*   /* SET DATE / TOD SEGMENT - SUBTYPE ID 1 OR 2                    */ 38140000
*   /*                                                               */ 38156600
*   /*****************************************************************/ 38173200
*                                                                       38190200
*   DECLARE                                                             38240200
*     1    SMF90T1  BASED(ADDR(SMFRCD90)+SMF90DOF),                     38290200
*       3    SMF90OTM FIXED(31),    /* TIME BEFORE CMD ISSUED        */ 38340200
*       3    SMF90ODT CHAR(4),      /* OLD DATE BEFORE CMD ISSUED    */ 38390200
*       3    SMF90NTM FIXED(31),    /* NEW TIME                      */ 38440200
*       3    SMF90NDT CHAR(4);      /* DATE AFTER COMMAND ISSUED     */ 38490200
*                                                                       38540200
*   /*****************************************************************/ 38556800
*   /*                                                               */ 38573400
*   /* SET IPS COMMAND SEGMENT - SUBTYPE ID 4                        */ 38590000
*   /*                                                               */ 38606600
*   /*****************************************************************/ 38623200
*                                                                       38640200
*   DECLARE                                                             38690200
*     1    SMF90T4  BASED(ADDR(SMFRCD90)+SMF90DOF),                     38740200
*       3    SMF90TIP CHAR(8),      /* SET IPS TIME                  */ 38790200
*       3    SMF90IPO CHAR(8),      /* OLD IPS NAME                  */ 38840200
*       3    SMF90IPN CHAR(8);      /* NEW IPS NAME                  */ 38890200
*                                                                       38940200
*   /*****************************************************************/ 38956800
*   /*                                                               */ 38973400
*   /* SETDMN SEGMENT - SUBTYPE ID 3                                 */ 38990000
*   /*                                                               */ 39006600
*   /*****************************************************************/ 39023200
*                                                                       39040200
*   DECLARE                                                             39090200
*     1    SMF90T3  BASED(ADDR(SMFRCD90)+SMF90DOF),                     39140200
*       3    SMF90DDT CHAR(8),      /* TIME OF CHANGE                */ 39190200
*       3    SMF90DMM BIT(8),       /* DOMAIN NUMBER                 */ 39240200
*       3    SMF90DFG CHAR(1),      /* DOMAIN FLAGS                  */ 39290200
*         5    SMF90MND BIT(1),     /* MIN CHANGED                   */ 39340200
*         5    SMF90MXD BIT(1),     /* MAX CHANGED                   */ 39390200
*         5    SMF90WGT BIT(1),     /* WEIGHT CHANGED                */ 39440200
*         5    SMF90AOB BIT(1),     /* AOBJ CHANGED                  */ 39490200
*         5    SMF90DOB BIT(1),     /* DOBJ CHANGED                  */ 39540200
*         5    SMF90FWK BIT(1),     /* FWKLD CHANGED                 */ 39590200
*         5    SMF90ASV BIT(1),     /* AVERAGE SERVICE RATE SPECIFIED   39640200
*                                                                @LMC*/ 39690200
*         5    SMF90DSV BIT(1),     /* TOTAL SERVICE RATE SPECIFIED     39740200
*                                                                @LMA*/ 39790200
*       3    SMF90NMI BIT(16),      /* NEW MIN VALUE             @D4C*/ 39837900
*       3    SMF90NMA BIT(16),      /* NEW MAX VALUE             @D4C*/ 39885600
*       3    SMF90NWT BIT(16),      /* NEW WEIGHT VALUE          @D4C*/ 39933300
*       3    SMF90NAO BIT(16),      /* NEW AOBJ VALUE            @D4C*/ 39981000
*       3    SMF90NDO BIT(16),      /* NEW DOBJ VALUE            @D4C*/ 40028700
*       3    SMF90WKL BIT(16),      /* NEW FWKLD VALUE           @D4C*/ 40076400
*       3    SMF90T3R BIT(16),      /* RESERVED                  @LMA*/ 40124100
*       3    SMF90ALO FIXED(31),    /* LOW AVERAGE SERVICE RATE VALUE   40171800
*                                      SPECIFIED                 @LMA*/ 40219500
*       3    SMF90AHI FIXED(31),    /* HIGH AVERAGE SERVICE RATE        40267200
*                                      VALUE SPECIFIED           @LMA*/ 40314900
*       3    SMF90DLO FIXED(31),    /* LOW TOTAL SERVICE RATE VALUE     40362600
*                                      SPECIFIED                 @LMA*/ 40410300
*       3    SMF90DHI FIXED(31),    /* HIGH TOTAL SERVICE RATE VALUE    40458000
*                                      SPECIFIED                 @LMA*/ 40505700
*       3    SMF90FL2 BIT(8),       /* FLAGS                     @P3A*/ 40553400
*         5    SMF90XCF BIT(1),     /* IF 1, FIXCIDX VALUE IS SET       40601100
*                                                                @P3A*/ 40648800
*       3    SMF90TRR BIT(8),       /* RESERVED                  @P3A*/ 40696500
*       3    SMF90XCI FIXED(16),    /* FIXED CONTENTION INDEX    @P3A*/ 40744200
*       3    SMF90T3E CHAR(0);      /* END OF 'SMF90T3' MAPPING  @LMA*/ 40791900
*                                                                       40840200
*   /*****************************************************************/ 40856800
*   /*                                                               */ 40873400
*   /* IPL SRM COMMAND SEGMENT - SUBTYPE ID 10                       */ 40890000
*   /*                                                               */ 40906600
*   /*****************************************************************/ 40923200
*                                                                       40940200
*   DECLARE                                                             40987500
*     1    SMF90T10 BASED(ADDR(SMFRCD90)+SMF90DOF),                     41034800
*      2    SMF90C10,               /* Compatibility mode fields:       41082100
*                                      These fields are always filled   41129400
*                                      in.                       @M2A*/ 41176700
*       3    SMF90IPT CHAR(8),      /* TIME OF IPL                   */ 41224000
*       3    SMF90IPS CHAR(8),      /* IEAIPSXX PARMLIB MEMBER       */ 41271300
*       3    SMF90OPT CHAR(8),      /* IEAOPTXX PARMLIB MEMBER       */ 41318600
*       3    SMF90ICS CHAR(8),      /* IEAICSXX PARMLIB MEMBER       */ 41365900
*      2    SMF90G10,               /* Goal mode fields: These fields   41413200
*                                      are filled in when goal mode     41460500
*                                      system operation is              41507800
*                                      applicable.               @M2A*/ 41555100
*       3    SMF90SPN CHAR(8),      /* Active service policy name.      41602400
*                                                                @M2A*/ 41649700
*       3    SMF90SPT CHAR(8),      /* Time/date (STCK format) that     41697000
*                                      the active service policy was    41744300
*                                      originally activated.     @M2A*/ 41791600
*       3    SMF90SPU CHAR(8),      /* Userid of the operator or        41838900
*                                      service administrator that       41886200
*                                      activated the service policy.    41933500
*                                                                @M2A*/ 41980800
*       3    SMF90SPS CHAR(8),      /* Name of the system on which      42028100
*                                      the service policy activation    42075400
*                                      was initiated.            @M2A*/ 42122700
*       3    SMF90SDN CHAR(8),      /* Name of the installed service    42170000
*                                      definition at the time the       42217300
*                                      policy was activated.     @M2A*/ 42264600
*       3    SMF90SDT CHAR(8),      /* Time/date (STCK format) that     42311900
*                                      the service definition was       42359200
*                                      installed.                @M2A*/ 42406500
*       3    SMF90SDU CHAR(8),      /* Userid of service                42453800
*                                      administrator that installed     42501100
*                                      the service definition.   @M2A*/ 42548400
*       3    SMF90SDS CHAR(8);      /* Name of the system on which      42595700
*                                      the service definition was       42643000
*                                      installed.                @M2A*/ 42690300
*                                                                       42740200
*   /*****************************************************************/ 42756800
*   /*                                                               */ 42773400
*   /* SET OPT COMMAND SEGMENT - SUBTYPE ID 11                       */ 42790000
*   /*                                                               */ 42806600
*   /*****************************************************************/ 42823200
*                                                                       42840200
*   DECLARE                                                             42890200
*     1    SMF90T11 BASED(ADDR(SMFRCD90)+SMF90DOF),                     42940200
*       3    SMF90TOP CHAR(8),      /* TIME OF OPT CHANGE            */ 42990200
*       3    SMF90OPO CHAR(8),      /* OLD OPT PARMLIB MEMBER        */ 43040200
*       3    SMF90OPN CHAR(8);      /* NEW OPT PARMLIB MEMBER        */ 43090200
*                                                                       43140200
*   /*****************************************************************/ 43156800
*   /*                                                               */ 43173400
*   /* SET ICS COMMAND SEGMENT - SUBTYPE ID 12                       */ 43190000
*   /*                                                               */ 43206600
*   /*****************************************************************/ 43223200
*                                                                       43240200
*   DECLARE                                                             43290200
*     1    SMF90T12 BASED(ADDR(SMFRCD90)+SMF90DOF),                     43340200
*       3    SMF90TIC CHAR(8),      /* TIME OF 'SETICS' CHANGE       */ 43390200
*       3    SMF90ICO CHAR(8),      /* OLD PARMLIB MEMBER            */ 43440200
*       3    SMF90ICN CHAR(8);      /* NEW PARMLIB MEMBER            */ 43490200
*                                                                       43540200
*   /*****************************************************************/ 43565200
*   /*                                                               */ 43590200
*   /* SET MPF COMMAND SEGMENT - SUBTYPE ID 14                       */ 43615200
*   /*                                                               */ 43640200
*   /*****************************************************************/ 43665200
*                                                                       43690200
*   DECLARE                                                             43740200
*     1    SMF90T14 BASED(ADDR(SMFRCD90)+SMF90DOF), /*       @G382827*/ 43790200
*       3    SMF90TMP CHAR(8),      /* TIME OF 'SET MPF' CHANGE         43840200
*                                                            @G383P27*/ 43890200
*       3    SMF90MPO CHAR(8),      /* RESERVED - WAS OLD PARMLIB MEM   43940200
*                                                                @D1C*/ 43990200
*       3    SMF90MPN CHAR(8),      /* RESERVED - WAS NEW PARMLIB MEM   44040200
*                                                                @D1C*/ 44090200
*       3    SMF90MPC CHAR(8),      /* RESERVED - WAS OLD PARMLIB MEM   44117900
*                                      - COLOR                   @D1C*/ 44145600
*       3    SMF90MCN CHAR(8),      /* RESERVED - WAS NEW PARMLIB MEM   44173300
*                                      - CMD                     @D1C*/ 44201000
*       3    SMF90MCO CHAR(8),      /* RESERVED - WAS OLD PARMLIB MEM   44228700
*                                      - CMD                     @D1C*/ 44256400
*       3    SMF90CMP FIXED(31),    /* COUNT OF MPF ENTRIES      @D1A*/ 44284100
*       3    SMF9014D(39) CHAR(2);  /* ARRAY OF MPF SUFFIXES     @D1A*/ 44311800
*                                                                       44340200
*   /*****************************************************************/ 44356800
*   /*                                                               */ 44373400
*   /* SET DAE COMMAND SEGMENT - SUBTYPE ID 16                       */ 44390000
*   /*                                                               */ 44406600
*   /*****************************************************************/ 44423200
*                                                                       44440200
*   DECLARE                                                             44483000
*     1    SMF90T16 BASED(ADDR(SMFRCD90)+SMF90DOF), /*           @D2A*/ 44525800
*       3    SMF90DAT CHAR(8),      /* TIME AND DATE OF 'SET DAE' CMD   44568600
*                                                                @D2A*/ 44611400
*       3    SMF90DAO CHAR(8),      /* OLD PARMLIB MEMBER        @D2A*/ 44654200
*       3    SMF90DAN CHAR(8);      /* NEW PARMLIB MEMBER        @D2A*/ 44697000
*                                                                       44740200
*   /*****************************************************************/ 44756800
*   /*                                                               */ 44773400
*   /* SET PFK COMMAND SEGMENT - SUBTYPE ID 17                       */ 44790000
*   /*                                                               */ 44806600
*   /*****************************************************************/ 44823200
*                                                                       44840200
*   DECLARE                                                             44890200
*     1    SMF90T17 BASED(ADDR(SMFRCD90)+SMF90DOF), /*           @D8A*/ 44940200
*       3    SMF90TPF CHAR(8),      /* TIME OF SET PFK CHANGE    @D8A*/ 44990200
*       3    SMF90PFO CHAR(8),      /* OLD PFK PARMLIB MEMBER    @D8A*/ 45040200
*       3    SMF90PFN CHAR(8);      /* NEW PFK PARMLIB MEMBER    @D8A*/ 45090200
*                                                                       45140200
*   /*****************************************************************/ 45156800
*   /*                                                               */ 45173400
*   /* SET GRSRNL COMMAND SEGMENT - SUBTYPE ID 18                    */ 45190000
*   /*                                                               */ 45206600
*   /*****************************************************************/ 45223200
*                                                                       45240200
*   DECLARE                                                             45280200
*     1    SMF90T18 BASED(ADDR(SMFRCD90)+SMF90DOF), /*           @LLA*/ 45320200
*       3    SMF90SGH,              /* SET GRSRNL CMD HEADER SECTION    45360200
*                                                                @LLA*/ 45400200
*         5    SMF90SGT CHAR(8),    /* TIME OF COMMAND           @LLA*/ 45440200
*         5    SMF90SGS CHAR(8),    /* SYSTEM THAT ISSUED THE COMMAND   45480200
*                                                                @LLA*/ 45520200
*         5    SMF90SGC FIXED(31),  /* COUNT OF ENTRIES          @LLA*/ 45560200
*       3    SMF90SGN(39) CHAR(2);  /* NEW PARMLIB MEMBERS       @LLA*/ 45600200
*                                                                       45640200
*   /*****************************************************************/ 45656800
*   /*                                                               */ 45673400
*   /* SET APPC COMMAND SEGMENT - SUBTYPE ID 19                      */ 45690000
*   /*                                                               */ 45706600
*   /*****************************************************************/ 45723200
*                                                                       45740200
*   DECLARE                                                             45790200
*     1    SMF90T19 BASED(ADDR(SMFRCD90)+SMF90DOF), /*           @LDA*/ 45840200
*       3    SMF90APT CHAR(8),      /* TIME OF SET APPC CHANGE   @LDA*/ 45890200
*       3    SMF90APC FIXED(31),    /* COUNT OF ENTRIES          @LDA*/ 45940200
*       3    SMF9019D CHAR(*),      /* NEW PARMLIB MEMBERS       @LDA*/ 45990200
*     SMF90APN BASED(ADDR(SMF9019D)) CHAR(8); /*                 @LDA*/ 46040200
*                                                                       46090200
*   /*****************************************************************/ 46106800
*   /*                                                               */ 46123400
*   /* SET SCHPRM COMMAND SEGMENT - SUBTYPE ID 20                    */ 46140000
*   /*                                                               */ 46156600
*   /*****************************************************************/ 46173200
*                                                                       46190200
*   DECLARE                                                             46240200
*     1    SMF90T20 BASED(ADDR(SMFRCD90)+SMF90DOF), /*           @LDA*/ 46290200
*       3    SMF90SCT CHAR(8),      /* TIME OF SET SCHPRM CHANGE @LDA*/ 46340200
*       3    SMF90SCC FIXED(31),    /* COUNT OF ENTRIES          @LDA*/ 46390200
*       3    SMF9020D CHAR(*),      /* NEW PARMLIB MEMBERS       @LDA*/ 46440200
*     SMF90SCN BASED(ADDR(SMF9020D)) CHAR(8); /*                 @LDA*/ 46490200
*                                                                       46540200
*   /*****************************************************************/ 46556800
*   /*                                                               */ 46573400
*   /* SET SCH COMMAND SEGMENT - SUBTYPE ID 21                       */ 46590000
*   /*                                                               */ 46606600
*   /*****************************************************************/ 46623200
*                                                                       46640200
*   DECLARE                                                             46683900
*     1    SMF90T21 BASED(ADDR(SMFRCD90)+SMF90DOF), /*           @LKA*/ 46727600
*       3    SMF90SHH,              /* SET SCH CMD HEADER SECTION       46771300
*                                                                @LKA*/ 46815000
*         5    SMF90SHT CHAR(8),    /* TIME OF SET SCH CHANGE    @LKA*/ 46858700
*         5    SMF90SHC FIXED(31),  /* COUNT OF ENTRIES          @LKA*/ 46902400
*       3    SMF90SHN(*) CHAR(8);   /* NEW PARMLIB MEMBERS       @LKA*/ 46946100
*                                                                       46990200
*   /*****************************************************************/ 47006800
*   /*                                                               */ 47023400
*   /* SET CNGRP COMMAND SEGMENT - SUBTYPE ID 22                     */ 47040000
*   /*                                                               */ 47056600
*   /*****************************************************************/ 47073200
*                                                                       47090200
*   DECLARE                                                             47140200
*     1    SMF90T22 BASED(ADDR(SMFRCD90)+SMF90DOF), /*           @LOA*/ 47190200
*       3    SMF90CGT CHAR(8),      /* TIME OF SET CNGRP CHANGE  @LOA*/ 47240200
*       3    SMF90CGC FIXED(31),    /* COUNT OF ENTRIES          @LOA*/ 47290200
*       3    SMF9022D CHAR(*),      /* NEW PARMLIB MEMBERS       @LOA*/ 47340200
*     SMF90CGN BASED(ADDR(SMF9022D)) CHAR(8); /*                 @LOA*/ 47390200
*                                                                       47440200
*   /*****************************************************************/ 47471400
*   /*                                                               */ 47502600
*   /* WLM Service Definition Install Segment - Subtype ID 23 WLM    */ 47533800
*   /* Service Policy Activation Segment - Subtype ID 24 Workload    */ 47565000
*   /* Management Mode Change Segment - Subtype ID 25                */ 47596200
*   /* WLM RESET - Subtype ID 30                                     */ 47606600
*   /* WLM Scheduling Environment change - Subtype ID 32         @M7A*/ 47617000
*   /*                                                               */ 47627400
*   /*****************************************************************/ 47658600
*                                                                       47690200
*   %INCLUDE SYSLIB(IWMSMF90) NOSEG; /* DCL Subtypes 23,24,25,30,@M7C*/ 47700200
*/*                                     32                       @M7C*/ 47710200
*                                                                       47720200
*   /*****************************************************************/ 47735200
*   /*                                                               */ 47750200
*   /* IPL LOGREC SEGMENT - SUBTYPE ID 26                            */ 47765200
*   /*                                                               */ 47780200
*   /*****************************************************************/ 47795200
*                                                                       47810200
*   %INCLUDE SYSLIB(IFBSMF90) NOSEG; /* DCLS for Subtype 26      @LZA*/ 47825200
*                                                                       47840200
*/* ARM restarts enabled                         - Subtype ID 27 @D3C*/ 47890200
*/* ARM restarts disabled                        - Subtype ID 28 @D3C*/ 47940200
*   %INCLUDE SYSLIB(IXCYSM90) NOSEG; /* DCLS for Subtype 27-28   @D3C*/ 47990200
*/* Only expand for PL/X users                                   @M5A*/ 48090200
*%IF SYSVERSION = '' %THEN            /* Skip if pre-PL/AS       @M5A*/ 48140200
*    %GOTO IFAL92;                    /*                         @M5A*/ 48190200
*%IF SYSVERSION(1:5) = 'PL/AS' %THEN  /* Skip if PL/AS           @M5A*/ 48240200
*    %GOTO IFAL92;                    /*                         @M5A*/ 48290200
*/* Dynamic LNKLST activation                    - Subtype ID 29 @M5A*/ 48315200
*%INCLUDE SYSLIB(CSVDLSMF) NOSEG;  /* DCLS for Subtype 29        @M5A*/ 48340200
*/* Dynamic LPA add or delete                    - Subtype ID 31 @M6A*/ 48356800
*%INCLUDE SYSLIB(CSVLPSMF) NOSEG;  /* DCLS for Subtype 31        @M6A*/ 48373400
*                                                                       48390200
*%IFAL92:                                                               48410200
*   IF IFAR92 = ''                                                      48430200
*      %THEN                                                            48450200
*     %GOTO IFAL94;                 /*                           @D6A*/ 48470200
*                                                                       48490200
*/* THIS STRUCTURE DEFINES THE FORMAT FOR RECORD TYPE 92 WRITTEN @D6A*/ 48540200
*/* BY THE O/MVS FILE SYSTEM                                     @D6A*/ 48590200
*                                                                       48690200
*   %INCLUDE SYSLIB(BPXYSMFR) NOSEG; /* DCLS FOR TYPE 92 RECORD  @D6A*/ 48706800
*%IFAL94:                                                               48723400
*   IF IFAR94 = ''                                                      48740000
*      %THEN                                                            48756600
*     %GOTO IFAL96;                 /*                           @D5A*/ 48773200
*                                                                       48790200
*/* THIS STRUCTURE DEFINES THE FORMAT FOR RECORD TYPE 94 WRITTEN @D5A*/ 48840200
*/* BY THE AUTOMATED TAPE LIBRARY FUNCTION                       @D5A*/ 48890200
*                                                                       48990200
*   %INCLUDE SYSLIB(IECSMF94) NOSEG; /* DCLS FOR TYPE 94 RECORD  @D5A*/ 49004400
*%IFAL96:                                                               49018600
*   IF IFAR96 = ''                                                      49032800
*      %THEN                                                            49047000
*     %GOTO IFAL97;                 /*                           @M8C*/ 49061200
*                                                                       49075400
*/*                                                              @01A*/ 49090200
*/* NO PLS MAPPING MACRO DEFINED FOR RECORD TYPE 96              @01A*/ 49140200
*/*                                                              @01A*/ 49190200
*                                                                       49240200
*%IFAL97:                                                               49245200
*   IF IFAR97 = ''                                                      49250200
*      %THEN                                                            49255200
*     %GOTO IFALRB;                 /*                           @M8A*/ 49260200
*                                                                       49265200
*/* THIS STRUCTURE DEFINES THE FORMAT FOR RECORD TYPE 97 WRITTEN @M8A*/ 49270200
*/* BY THE WORKLOAD MANAGER                                      @M8A*/ 49275200
*                                                                       49280200
*   %INCLUDE SYSLIB(IWMSMF97) NOSEG; /* DCLS FOR TYPE 97 RECORD  @M8A*/ 49285200
*%IFALRB:                                                               49290200
*   ;                               /*                       @G50FPJW*/ 49340200
