*%GOTO IFABGN1;  /*                                                     00060002
         MACRO                                                          00070002
&NAME    IFASMFR &RECTYPE                                            */ 00072002
.* *                                                                    00072700
.* * MACRO-NAME = IFASMFR                                         @03C  00073400
.* *                                                                    00074100
.* *                                                                    00077600
.* * PROPRIETARY STATEMENT =                                            00077700
.* *                                                                    00077800
.* *  LICENSED MATERIALS - PROPERTY OF IBM                              00077900
.* *  THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       00078000
.* *  5655-068 (C) COPYRIGHT IBM CORP. 1982, 1993                 @LYC  00078100
.* *  SEE COPYRIGHT INSTRUCTIONS.                                       00078200
.* *                                                                    00078300
.* * STATUS = HBB5510                                             @LYC  00078400
.* *                                                                    00078900
.* * EXTERNAL CLASSIFICATION: GUPI                                @P4A  00079100
.* * END OF EXTERNAL CLASSIFICATION:                              @P4A  00079300
.* *                                                                    00079500
*%IFABGN1: ;                                                            00080002
* /*                                                                 */ 00090002
* /* METHOD OF ACCESS                                                */ 00098002
* /*  PL/S - USER DEFINES MACRO VARIABLE IFARXX WHERE XX=RECORD NUM  */ 00098402
* /*         DECLARE SMFXXPTR PTR(31) OR RESPECIFY FOR BASE          */ 00098802
* /*         INCLUDE MACRO FROM LIBRARY                              */ 00099202
* /*          EXAMPLE %IFAR08 = 'YES',           NOTE. THE COMMA REP-*/ 00099602
* /*                  DCL SMF08PTR PTR(31),      RESENTS A SEMI-COLON*/ 00106402
* /*                  %INCLUDE SYSLIB(IFASMFR),  BUT ISN'T TO AVIOD  */ 00109802
* /*                                             A DIAGNOSTIC.       */ 00113202
* /*                                                                 */ 00113300
* /*                                                                 */ 00113400
* /*         THIS MACRO PROCESSES RECORDS IN THE RANGE 00-06. IT     */ 00113500
* /*         ACTS AS A ROUTER TO OTHER MACROS TO PROCESS OTHER       */ 00113600
* /*         RECORDS AS FOLLOWS:                                     */ 00113700
* /*                                                                 */ 00113800
* /*             MACRO        RECORDS                                */ 00113900
* /*            ********      *******                                */ 00114000
* /*            IFASMFR1      07-19                                  */ 00114100
* /*            IFASMFR2      20-27                                  */ 00114200
* /*            IFASMFR3      28-36                                  */ 00114300
* /*            IFASMFR4      37-46                                  */ 00114400
* /*            IFASMFR5      47-54                                  */ 00114500
* /*            IFASMFR6      55-69                                  */ 00114600
* /*            IFASMFR9      80-84                              @07C*/ 00114700
* /*            IFASMFRA      85-103                             @07C*/ 00114800
* /*            IFASMFRB      104-113                                */ 00114900
* /*            IFASMFRC      114-123                                */ 00115000
* /*            IFASMFRD      124-127                                */ 00115100
*%GOTO IFABGN2;   /*                                                    00116602
.*                                                                      00146700
.*                                                                      00176800
.* CHANGE ACTIVITY:                                                     00206900
.*    Z40MPTH, ZA05171, Z40FPTH, ZA10800, G387P27, ZA74830,             00237000
.*    D5A    , ZA75776, T7A    , ZA80943, T8A    , DAA, YA15607,        00252000
.*    LCA    , LBA    , DFA    , LAA    , LEA                           00267000
.*                                                                      00297200
.*    OZ74830 - UPDATE TYPE 6 RECORD, ADD SMF6EFMN FIELD      @ZA74830  00327300
.*    OZ75776 - CHANGE DECLARE LEVEL ON SMF6END               @ZA75776  00357400
.*    OZ80943 - REMOVE MACROS IFASMFR7 AND IFASMFR8 SINCE     @ZA80943  00387500
.*              THEIR FUNCTIONS HAVE BEEN TAKEN OVER BY RMF.  @ZA80943  00417600
.*    OY15607 - ADD RESERVED FIELDS SMF4RSV1 AND SMF5RSV1.    @YA15607  00432600
.*    OY27577 - PSF TYPE 6 CHANGES INCLUDED IN JBB3313        @YA27577  00440100
.*    TYPE 6  - DOC CORRECTIONS FOR THE SMF6JNM FIELD             @P3A  00443900
.*    TYPE 4  - Delete SMF4VDV                                   1@LYA  00445800
.*    TYPE 4  - Documentation change to SMF4PGNO field            @LZA  00446400
.*    TYPE 5  - Documentation change to SMF5PGNO field            @LZA  00447000
.*    TYPE 0  - Include system-related data fields                @01A  00447300
.*    Add External Classification                                 @P4A  00447500
.*    TYPE 6  - Add fields in support of FULL BIN, COMSETUP, and  @04A  00455000
.*              MVS Download Feature.                             @04A  00462500
.*    TYPE 6  - Reserve subsystem identification of X'0009' for   @05A  00465000
.*              IP PrintWay.                                      @05A  00467500
.*    TYPE 6  - Increase file transfer section to have print      @06A  00468100
.*              queue name for IP PrintWay                        @06A  00468700
.*    OW25672 - Shift record types 85-88 mappings to IFASMFR9.    @07A  00469300
.*    TYPE 6  - Add fields in support of PSF/MVS 3.1.0.           @08A  00469600
.*                                                                      00470000
.*    $PV=PAJ0111 ,JBB2125,830627,PDFS: CHANGE SIZE OF SMF4RSH0   @PVA  00477800
.*    $D5=DCR89   ,JBB2125,830627,PDFS: UPDATE TYPE 6 RECORD      @D5A  00507900
.*    $T7=UZ90334 ,JBB2125,830627,PDFS: TRANSFER RECORDS TO JES   @T7A  00538000
.*    $T8=UZ90378 ,JBB2133,840905,PDFS: TYPE 6 RESTRUCTURE        @T8A  00568100
.*    $T6=UZ90370 ,JBB2133,841215,PDFS: UPDATE TYPE 6 FOR 3820    @T6A  00598200
.*    $DA=DCR132  ,JBB2220,850515,PDFS: >1635 DD STATEMENTS       @DAA  00628300
.*    $TB=DCR301  ,HBB3310,860102,PDFS: 10K JOB SUPPORT           @TBA  00643300
.*    $LB=HIPER   ,JBB3311,880418,PDFS: HIPERSPACE SUPPORT        @LBA  00644900
.*    $DF=DCR29   ,JBB3311,880718,PDFS: CREAD PAGE MISS COUNT     @DFA  00646500
.*    $LC=B1SEC   ,JBB3313,880404,PDFS: SECURITY RELATED SUPPORT  @LCA  00648300
.*    $QX=PGP0273 ,JBB3313,890331,PDWC: TYPE 6 LEVEL INDICATOR    @QXA  00648600
.*    $DK=DCR0016 ,JBB3313,890612,PDWC: ADDITIONAL PSF SUPPROT    @DKA  00648900
.*    $DL=DCR0037 ,JBB3313,880612,PDWC: 'DSNAME' FIELD LENGTH CHG @DLA  00649200
.*    $DM=DCR0050 ,JBB3313,880716,PDBR: ADDITIONAL PSF SUPPORT    @DMA  00649500
.*    $LA=SERVC   ,JBB3320,871217,PDFS: >1440 TIME SUPPORT        @LAA  00649900
.*    $P1=PHB1095 ,JBB3320,890328,PDBR: TYPE 4 BASING ERROR       @P1A  00651500
.*    $LE=EMVS2   ,HBB4410,881024,PDFS: ENTERPRISE II - TYPE 6    @LEA  00653300
.*    $P2=PEO4165 ,HBB4410,900507,PDBR: SMF6LEV4 VALUE ERROR      @P2A  00655800
.*    $02=OY30945 ,JBB2220,900409,PDBR: TYPE 6 CHNGES FOR PSF 4.0 @02A  00657100
.*    $P3=PKB3728 ,HBB4430,920731,PDMF: 10X SMF6JNM DOC ERROR     @P3A  00657700
.*    $LY=4DGIT   ,HBB5510,930304,PDSL: SMF 4K UCB Enhancement    @LYA  00657900
.*    $LZ=WLMI    ,HBB5510,930715,PDOH: SMF-WLM Support           @LZA  00658000
.*    $01=OW03229 ,HBB5510,940325,PDOH: System data in SMF record @01A  00658100
.*    $03=OW02855 ,JBB3313,940115,PDBR: Usage Data Reporting      @03A  00658300
.*    $P4=PN71727 ,HBB5520,941020,PDOH: CDPI: SHOWHDR Cleanup     @P4A  00662800
.*    $04=OW13246 ,HBB4420,950601,PDOH: Type 6 Enhancements       @04A  00667300
.*    $05=OW21583 ,HBB4420,960801,PDOH: Type 6 TCP/IP Support     @05A  00671800
.*    $06=OW25152 ,HBB4420,970630,PDRR: IP Printway Enhancement   @06A  00676600
.*    $07=OW25672 ,HBB5510,970630,PDRR: OAM Type 85 Enhancement   @07A  00677400
.*    $08=OW35685 ,HBB5520,981030,PDOH: PSF/MVS 3.1.0 Support     @08A  00677800
.*                                                                      00678300
*  THIS IS AN SMF MACRO WHICH CONTROLS THE BUILDING OF SMF RECORDS. THE 00688500
*  REQUIRED FORMAT IS                                                   00718600
*                                                                       00750002
*        IFASMFR  &RECTYPE                                              00800002
*                                                                       00950002
*  NOTE: VALUES FOR &RECTYPE MUST BE ENCLOSED IN PARENS(UNLESS ONLY 1). 01000000
*                                                                       01300002
         LCLA  &NUM,&B                                                  01500002
.* &NUM IS SET TO THE NUMBER OF SUBSTRING ITEMS IN THE FIRST PARAMETER  01550002
.* AND &B IS USED TO POINT AT EACH SUBSTRING ITEM.                      01600002
         AIF   ('&RECTYPE' EQ '').E1                                    01900002
&NUM     SETA  N'&RECTYPE                                               02000002
         AGO   .CONTC                                                   02050002
.CONTB   ANOP                                                           02100002
&NUM     SETA  &NUM-1                                                   02150002
.CONTC   ANOP                                                           02200002
         AIF   (&NUM LE 0).OUT                                          02250002
&B       SETA  &B+1                                                     02300002
.RTYCHK  AIF   ('&RECTYPE(&B)' EQ '').E3                                02350002
         AIF   (&RECTYPE(&B) GT 127 OR &RECTYPE(&B) LT 0).E5   @Z40FPTH 02400000
         AGO   .CONTA                                                   02450002
.E1      ANOP                                                           02500002
         SPACE 3                                                        02550002
         MNOTE 8,'PARAMETERS OMITTED, PROCESSING TERMINATED'            02600002
         MEXIT                                                          02650002
.E3      ANOP                                                           02900002
         SPACE 3                                                        02950002
         MNOTE 4,'NULL RECORD TYPE PASSED'                              03000002
         AGO   .CONTB                                                   03050002
.E5      ANOP                                                           03300002
         SPACE 3                                                        03350002
         MNOTE 4,'&RECTYPE(&B) INVALID RECORD TYPE SPECIFIED'           03400002
         AGO   .CONTB                                                   03450002
.CONTA   AIF   (&RECTYPE(&B) GE 0 AND &RECTYPE(&B) LE 6).G0             03500000
         AIF   (&RECTYPE(&B) GE 7 AND &RECTYPE(&B) LE 19).G1            03550000
         AIF   (&RECTYPE(&B) GE 20 AND &RECTYPE(&B) LE 27).G2           03600000
         AIF   (&RECTYPE(&B) GE 28 AND &RECTYPE(&B) LE 36).G3           03650000
         AIF   (&RECTYPE(&B) GE 37 AND &RECTYPE(&B) LE 46).G4           03700000
         AIF   (&RECTYPE(&B) GE 47 AND &RECTYPE(&B) LE 54).G5           03750000
         AIF   (&RECTYPE(&B) GE 55 AND &RECTYPE(&B) LE 69).G6           03800000
.*  REMOVED REFERENCES TO IFASMFR7 AND IFASMFR8 - TWO LINES  @ZA80943   03850000
         AIF   (&RECTYPE(&B) GE 80 AND &RECTYPE(&B) LE 84).G9      @07C 03900000
         AIF   (&RECTYPE(&B) GE 85 AND &RECTYPE(&B) LE 103).GA     @07C 03950000
         AIF   (&RECTYPE(&B) GE 104 AND &RECTYPE(&B) LE 113).GB         04000000
         AIF   (&RECTYPE(&B) GE 114 AND &RECTYPE(&B) LE 123).GC         04050000
         AIF   (&RECTYPE(&B) GE 124 AND &RECTYPE(&B) LE 127).GD         04100000
         AGO   .E5                                                      06050002
.G0      ANOP                                                           06100000
         AIF   (&RECTYPE(&B) EQ 0).IFAS000                              06250002
         AIF   (&RECTYPE(&B) EQ 2).IFAS002                              06350002
         AIF   (&RECTYPE(&B) EQ 3).IFAS003                              06400002
         AIF   (&RECTYPE(&B) EQ 4).IFAS004                              06450002
         AIF   (&RECTYPE(&B) EQ 5).IFAS005                              06500002
         AIF   (&RECTYPE(&B) EQ 6).IFAS006                              06700002
         AGO   .E5                                                      07000002
.G1      ANOP                                                           07042800
         IFASMFR1 &RECTYPE(&B)                                          07085600
         AGO   .CONTB                                                   07128400
.G2      ANOP                                                           07171200
         IFASMFR2 &RECTYPE(&B)                                          07214000
         AGO   .CONTB                                                   07256800
.G3      ANOP                                                           07299600
         IFASMFR3 &RECTYPE(&B)                                          07342400
         AGO   .CONTB                                                   07385200
.G4      ANOP                                                           07428000
         IFASMFR4 &RECTYPE(&B)                                          07470800
         AGO   .CONTB                                                   07513600
.G5      ANOP                                                           07556400
         IFASMFR5 &RECTYPE(&B)                                          07599200
         AGO   .CONTB                                                   07642000
.G6      ANOP                                                           07684800
         IFASMFR6 &RECTYPE(&B)                                          07727600
         AGO   .CONTB                                                   07770400
.*  REMOVED REFERENCES TO IFASMFR7 AND IFASMFR8 - SIX LINES  @ZA80943   07813200
.G9      ANOP                                                           07856000
         IFASMFR9 &RECTYPE(&B)                                          07898800
         AGO   .CONTB                                                   07941600
.GA      ANOP                                                           07984400
         IFASMFRA &RECTYPE(&B)                                          08027200
         AGO   .CONTB                                                   08070000
.GB      ANOP                                                           08112800
         IFASMFRB &RECTYPE(&B)                                          08155600
         AGO   .CONTB                                                   08198400
.GC      ANOP                                                           08241200
         IFASMFRC &RECTYPE(&B)                                          08284000
         AGO   .CONTB                                                   08326800
.GD      ANOP                                                           08369600
         IFASMFRD &RECTYPE(&B)                                          08412400
         AGO   .CONTB                                                   08455200
.OUT     MEXIT                                                          08500002
.IFAS000 ANOP                                                           08550002
         EJECT                                                          08600002
*  THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 0 (IPL RECORD)         08650002
*  RECORD LENGTH IS 31 BYTES                                            08700002
*                                                                       08750002
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    08800002
SMFRCD0  EQU   *         HEADER SEGMENT                                 08850002
SMF0LEN  DS    BL2'0'    RECORD LENGTH                                  08900002
SMF0SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                             08950002
SMF0FLG  DC    BL1'0'    HEADER FLAG BYTE                               09000002
SMF0RTY  DC    BL1'0'    RECORD TYPE 0                                  09050002
SMF0TME  DC    BL4'0'    TOD, USING FORMAT FROM TIME MACRO W/BIN. INTVL 09100000
SMF0DTE  DC    PL4'0000'      DATE IN PACKED DECIMAL FORM: 00YYDDDF     09150002
SMF0SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 09250000
SMF0JWT  DC    BL4'0'    JOB WAIT TIME DEFAULT VALUE IN MINUTES(BINARY) 09350000
SMF0BUF  DC    BL4'0'    SMF BUFFER SIZE IN BYTES(BINARY)               09400000
SMF0VST  DC    BL4'0'    VIRTUAL STORAGE SIZE IN K BLOCKS(BINARY)XM4432 09450000
SMF0OPT  DC    BL1'0'    OPTIONS BYTE:                                  09500002
*                        BIT0 - SYSTEM & JOB DATA TO BE COLLECTED       09550002
*                        BIT1 - STEP DATA TO BE COLLECTED               09600002
*                        BIT2 - EXITS REQUESTED                         09650002
*                        BIT3 - DATA SET ACCOUNTING                     09700002
*                        BIT4 - VOLUME ACCOUNTING                       09750002
*                        BIT5 - RESERVED(WAS ESV IN 14 AND 15)          09800002
*                        BIT6 - TEMPORARY-DATA-SET SCRATCH RECORDS      09850002
*                        BIT7 - =0 BACKGROUND JOB; =1 FOREGROUND JOB    09900002
SMF0RST  DC    BL4'0'    REAL STORAGE SIZE IN K BLOCKS(BINARY)   XM4432 09950000
SMF0RSV  DC    BL1'0'    Reserved                                  @01A 09960000
SMF0OSL  DC    CL8' '    MVS Product name                          @01A 09970000
SMF0SYN  DC    CL8' '    System name                               @01A 09980000
SMF0SYP  DC    CL8' '    Sysplex name                              @01A 09990000
         AGO   .CONTB                                                   10000002
.IFAS002 ANOP                                                           11600002
         EJECT                                                          11650002
* THIS RECORD IS WRITTEN BY THE SMF DUMP UTILITY PROGRAM AT THE         11700002
* BEGINNING OF A DUMP DATA SET. RECORD LENGTH IS 14 BYTES               11750002
*                                                                       11800002
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    11850002
SMFRCD2  EQU   *         HEADER SEGMENT                                 11900002
SMF2LEN  DS    BL2'0'    RECORD LENGTH                                  11950002
SMF2SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                             12000002
SMF2FLG  DC    BL1'0'    HEADER FLAG BYTE                               12050002
SMF2RTY  DC    BL1'0'    RECORD TYPE 2                                  12100002
SMF2TME  DC    BL4'0'    TOD, USING FORMAT FROM TIME MACRO W/BIN. INTVL 12150000
SMF2DTE  DC    PL4'0000'      DATE IN PACKED DECIMAL FORM: 00YYDDDF     12200002
SMF2SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 12300000
         AGO   .CONTB                                                   12400002
.IFAS003 ANOP                                                           12450002
         EJECT                                                          12500002
* THIS RECORD IS WRITTEN BY THE SMF DUMP UTILITY PROGRAM AT THE END     12550002
* OF A DUMP DATA SET. RECORD LENGTH IS 14 BYTES.                        12600002
*                                                                       12650002
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    12700002
SMFRCD3  EQU   *         HEADER SEGMENT                                 12750002
SMF3LEN  DS    BL2'0'    RECORD LENGTH                                  12800002
SMF3SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                             12850002
SMF3FLG  DC    BL1'0'    HEADER FLAG BYTE                               12900002
SMF3RTY  DC    BL1'0'    RECORD TYPE 3                                  12950002
SMF3TME  DC    BL4'0'    TOD, USING FORMAT FROM TIME MACRO W/BIN. INTVL 13000000
SMF3DTE  DC    PL4'0000'      DATE IN PACKED DECIMAL FORM: 00YYDDDF     13050002
SMF3SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 13100000
         AGO   .CONTB                                                   13200002
.IFAS004 ANOP                                                           13250002
         EJECT                                                          13300002
* THIS RECORD IS WRITTEN AT NORMAL OR ABNORMAL TERMINATION OF A STEP.   13350002
* RECORD LENGTH IS VARIABLE. MINIMUM OF 137.                            13400002
*                                                                       13450002
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    13500002
SMFRCD4  EQU   *         HEADER SEGMENT                                 13550002
SMF4LEN  DS    BL2'0'    RECORD LENGTH                                  13600002
SMF4SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                             13650002
SMF4FLG  DC    BL1'0'    HEADER FLAG BYTE                               13700002
SMF4RTY  DC    BL1'0'    RECORD TYPE 4                                  13750002
SMF4TME  DC    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL. 13800000
SMF4DTE  DC    PL4'0000' DATE IN PACKED DECIMAL FORM: OOYYDDDF          13850002
SMF4SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 13900000
SMF4JBN  DC    CL8' '    JOB NAME                                       14000000
SMF4RST  DC    BL4'0'    READER START TIME (IN 100THS SECONDS)          14050000
SMF4RSD  DC    PL4'0000' READER START DATE                              14100002
SMF4UIF  DC    CL8' '    USER IDENTIFICATION FIELD                      14150000
SMF4STN  DC    BL1'0'    STEP NUMBER                                    14200002
SMF4SIT  DC    BL4'0'    STEP INITIATION TIME (IN 100THS SECONDS)       14250000
SMF4STID DC    PL4'0000' STEP INITIATION DATE (PACKED DECIMAL FORMAT)   14300002
SMF4NCI  DC    BL4'0'    NUMBER OF CARD IMAGES IN DD DATA OR DD *       14350000
*                        DATA SETS                                      14400002
SMF4SCC  DC    BL2'0'    STEP COMPLETION CODE                  @G50FPRL 14450000
SMF4PRTY DC    BL1'0'    PRIORITY AT WHICH STEP WAS DISPATCHED :        14500002
*                        ACTUAL PRIORITY=251-(15-USER PRIORITY)*16      14550002
SMF4PGMN DC    CL8' '    PROGRAM NAME                                   14600002
SMF4STMN DC    CL8' '    STEP NAME                                      14650002
SMF4RSV5 DC    BL2'0'    RESERVED                                  @PVC 14690000
SMF4SYST DC    BL2'0'    SYSTEM AREA USED(TOP OF PROVATE AREA)   Y02901 14730000
SMF4H0ST DC    BL2'0'    STORAGE USED(VIRT OR REAL-SEE SMF4RIN)         14770000
SMF4STU  EQU   SMF4H0ST  (LOW OF PRIVATE AREA)                   Y02901 14810002
SMF4RV1  DC    BL2'0'    RESERVED                                  @PVC 14832500
SMF4RSH0 DC    BL4'0'    REGION SIZE REQ(PRIVATE AREA 1K UNIT)     @PVM 14855000
SMF4PRV  EQU   SMF4RSH0                                            @PVM 14877500
SMF4SPK  DC    1BL1'0'   STORAGE PROTECT KEY                     A40791 14900002
SMF4STI  DC    1BL1'0'   STEP TERMINATION INDICATOR                     14950002
*                        BIT0 - RESERVED                                15000002
*                        BIT1 - CANCELLED AT EXIT IEFUJV                15050002
*                        BIT2 - CANCELLED AT EXIT IEFUJI                15100002
*                        BIT3 - CANCELLED AT EXIT IEFUSI                15150002
*                        BIT4 - CANCELLED AT EXIT IEFACTRT              15200002
*                        BIT5 - STEP IS TO BE RESTARTED        @YL026WA 15250002
*                        BIT6 - 0=NORMAL COMPLETION                     15300002
*                               1=ABEND                                 15350002
*                        BIT7 - 1=STEP FLUSHED                          15400002
SMF4RV2  DC    BL2'0'    RESERVED                                A40791 15450000
SMF4AST  DC    BL4'0'    DEVICE ALLOC START TIME                 A40791 15500000
SMF4PPST DC    BL4'0'    PROBLEM PROGRAM START TIME              A40791 15550000
SMF4RV3  DC    BL1'0'    RESERVED                              @YL026WA 15600002
SMF4SRBT DC    BL3'0'    STEP CPU TIME UNDER SRB(.01 SEC)      @YL026WA 15612000
SMF4RIN  DC    BL2'0'    RECORD INDICATORS                              15624000
*                        BIT0-3 RESERVED                           @DAC 15630000
*                         4=1 FIELD SMF4SETM NOT VALID FOR SP410   @LAC 15636000
*                            WHEN ACTJTIME >3 BYTES FOR TYPE 30    @DGA 15642000
*                         5 =1 DEVICE DATA NOT RECORDED            @DAA 15648000
*                         6 =1 POSSIBLE ERROR IN DEV ENTRY     @YM02618 15660002
*                         7 =0 STOR IS VIRTUAL, =1 STOR IS REAL@YM02618 15700002
*                         8-15 RESERVED                        @YM02618 15750002
SMF4RLCT DC    BL2'0'    OFFSET TO RELOCATE SECTION                     15800000
SMF4LENN DC    BL2'0'    LENGTH OF EXCP PORTION OF RECORD               15850000
*        FOR EACH DEVICE ASSIGNED TO EACH DATA SET THERE IS AN 8 BYTE   15900002
*        ENTRY HAVING THE FOLLOWING FORMAT:                             15950002
*                                                                       16000002
*     Note: Virtual I/O Devices are identified by the following:   @LYA 16008300
*           Device Class 0                                         @LYA 16016600
*           Unit Type 0                                            @LYA 16024900
*           Device Number x'7FFF'                                  @LYA 16033200
*                                                                       16041500
SMF4DEVC DC    BL1'0'    DEVICE CLASS                                   16050002
SMF4UTYP DC    BL1'0'    UNIT TYPE                                      16100002
SMF4CUAD DC    BL2'0'    Device Number                             @LYC 16137500
*                                                                 1@LYD 16175000
SMF4EXCP DC    BL4'0'    COUNT OF EXCP'S ISSUED FOR THE DEVICE AND      16212500
*                        DATA SET                                       16250002
         ORG   SMF4DEVC                                                 16300002
SMF4LNTH DC    BL1'0'    TOTAL LENGTH OF CPU AND ACCT. SECTION          16350002
SMF4SETM DC    BL3'0'    RESERVED                                 @LAC  16400000
SMF4NAF  DC    BL1'0'    NUMBER OF ACCOUNTING FIELDS                    16450002
SMF4ACTF DS    0C        EXEC STATEMENT ACCOUNTING FIELDS(VARIABLE)     16500002
*                                                                       16550002
*        EACH ENTRY FOR AN ACCOUNTING FIELD CONTAINS THE LENGTH OF THE  16600002
*        FIELD (1 BYTE,BINARY), FOLLOWED BY THE FIELD(EBCDIC).AN        16650002
*        OMITTED FIELD IS REPRESENTED BY A LENGTH INDICATOR OF 0.       16700002
*                                                                       16750002
*        RELOCATE SECTION                                               16800002
SMF4PGIN DS    BL4'0'    NUMBER OF PAGE-INS                             16850000
SMF4PGOT DS    BL4'0'    NUMBER OF PAGE-OUTS                            16900000
SMF4NSW  DS    BL4'0'    NUM OF SWAPS                            Y02901 16910002
SMF4RGNS EQU   SMF4NSW                                           Y02901 16920002
SMF4PSI  DS    BL4'0'    PAGES SWAPPED IN                        Y02901 16930002
SMF4SIN  EQU   SMF4PSI                                           Y02901 16940002
SMF4PSO  DS    BL4'0'    PAGES SWAPPED OUT                       Y02901 16942002
SMF4SOUT EQU   SMF4PSO                                           Y02901 16944002
SMF4VPI  DS    BL4'0'    VAM PAGE INS                            Y02132 16946002
SMF4VPO  DS    BL4'0'    VAM PAGE OUTS                           Y02132 16948002
*        PERFORMANCE SECTION                                            16948100
SMF4SST  DS    BL4'0'              STEP SERVICE TIME           @YM07459 16948200
SMF4ACT  DS    BL4'0'              STEP ACTIVE TIME            @YM07459 16948300
SMF4PGNO DS    BL2'0'      Step performance group number:          @LZC 16950500
*                          - Valid only if workload management     @LZA 16952700
*                            compatibility mode in effect.         @LZA 16954900
*                          - Zero if workload management goal      @LZA 16957100
*                            mode in effect when the Type 4        @LZA 16959300
*                            record is generated.                  @LZA 16961500
SMF4TRAN DS    BL4'0'      STEP TRANSACTION RESIDENCY TIME     @Z40FPPF 16963700
SMF4CPM  DS    BL4'0'      CREAD PAGE MISS COUNT                   @DFC 16965900
SMF4RCLM DS    BL4'0'      NUMBER OF VIO RECLAIMS              @Z40FPPF 16968100
SMF4CPGN DS    BL4'0'      NUMBER OF COMMON PAGE-INS           @Z40FPPF 16970300
SMF4HSPI DS    BL4'0'      HIPERSPACE PAGE IN COUNT                @LBC 16972500
SMF4PGST DS    BL4'0'      NUMBER OF PAGES STOLEN FROM         @Z40FPPF 16974700
*                          THIS MEMORY                         @Z40FPPF 16976900
SMF4PSEC DS    CL8         COUNT OF PAGE SECONDS               @Z40FPPF 16979100
SMF4LPAI DS    BL4'0'      LPA PAGE INS                        @G50FPRL 16981300
SMF4HSPO DS    BL4'0'      HIPERSPACE PAGE OUT COUNT               @LBC 16983500
SMF4CPUS DS    BL4'0'      STEP CPU SERVICE                    @G50FPRL 16985700
SMF4IOCS DS    BL4'0'      STEP I/O SERVICE                    @G50FPRL 16987900
SMF4MSOS DS    BL4'0'      STEP MAIN STORAGE SERVICE           @G50FPRL 16990100
SMF4SRBS DS    BL4'0'      STEP SRB SERVICE                    @G50FPRL 16992300
SMF4RSV1 DS    CL8' '      RESERVED                            @YA15607 16994500
         AGO   .CONTB                                                   16996700
.IFAS005 ANOP                                                           17000002
         EJECT                                                          17050002
* THIS RECORD IS WRITTEN AT  NORMAL OR ABNORMAL TERMINATION OF A JOB.   17100002
* RECORD LENGTH IS VARIABLE. MINIMUM OF 117.                            17150002
*                                                                       17200002
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    17250002
SMFRCD5  EQU   *         HEADER SEGMENT                                 17300002
SMF5LEN  DS    BL2'0'    RECORD LENGTH                                  17350002
SMF5SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                             17400002
SMF5FLG  DC    BL1'0'    HEADER FLAG BYTE                               17450002
SMF5RTY  DC    BL1'0'    RECORD TYPE 5                                  17500002
SMF5TME  DC    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL. 17550000
SMF5DTE  DC    PL4'0000' DATE, PACKED DEC. FORM : OOYYDDDF(F IS A SIGN) 17600002
SMF5SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 17650000
SMF5JBN  DC    CL8' '    JOB NAME                                       17750000
SMF5RST  DC    BL4'0'    READER START TIME FOR JOB (IN 100THS/SECONDS)  17800000
SMF5RSD  DC    PL4'0000' READER START DATE,PACKED DECIMAL FORMAT        17850002
SMF5UIF  DC    CL8' '    USER IDENTIFICATION FIELD                      17900000
SMF5NST  DC    BL1'0'    NUMBER OF STEPS IN THE JOB                     17950002
SMF5JIT  DC    BL4'0'    JOB INITIATION TIME (IN 100THS/SECONDS)        18000000
SMF5JID  DC    PL4'0000' JOB INITIATION DATE, PACKED DECIMAL FORMAT     18050002
SMF5NCI  DC    BL4'0'    NUMBER OF CARD-IMAGE RECORDS IN DD DATA OR DD* 18100000
*                        DATA SETS                                      18150002
SMF5JCC  DC    BL2'0'    JOB COMPLETION CODE                            18200000
SMF5JPTY DC    BL1'0'    JOB PRIORITY                                   18250002
SMF5RSTT DC    BL4'0'    READER STOP TIME FOR JOB (IN 100THS/SECONDS)   18300000
SMF5RSTD DC    PL4'0000' READER STOP DATE FOR JOB (IN PACKED DEC.FORM)  18350002
SMF5JBTI DC    BL1'0'    JOB TERMINATION INDICATOR                      18400002
*                           0-FIELD SMF5JCPU NOT VALID FOR SP410 @LAC   18433300
*                            WHEN ACTJTIME IS >3 BYTES           @DGA   18466600
*                           1-CANCELLED AT EXIT IEFUJV                  18500002
*                           2-CANCELLED AT EXIT IEFUJI                  18550002
*                           3-CANCELLED AT EXIT IEFUSI                  18600002
*                           4-CANCELLED AT EXIT IEFACTRT                18650002
*                           5-RESERVED                                  18700002
*                           6-O=NORMAL COMPLETION                       18750002
*                             1=ABEND                                   18800002
*                           7-RESERVED                                  18850002
SMF5SMCI DC    BL1'0'    RESV-FORMERLY SYSOUT CLASSES INDICATOR  Y02120 18883300
SMF5TRAN DC    BL4'0'    TOTAL TRANSACTION RESIDENCY TIME      @ZM01380 18916600
SMF5CKRE DC    BL1'0'    RESV                                           18950002
SMF5RDCL DC    BL1'0'    READER DEVICE CLASS                            19350002
SMF5RUTY DC    BL1'0'    READER UNIT TYPE                               19400002
SMF5JICL DC    CL1' '    JOB INPUT CLASS                                19450002
SMF5SPK  DC    BL1'0'    STORAGE PROTECT KEY                     A40791 19500000
SMF5SRBT DC    BL3'0'    JOB CPU TIME UNDER SRB(.01 SEC)       @YL026WA 19550000
SMF5TJS  DS    BL4'0'    TOTAL JOB SERVICE(SERVICE UNITS)        Y02133 19560002
SMF5TTAT DS    BL4'0'    TOTAL TRANSACTION ACTIVE TIME FOR JOB   Y02133 19570002
SMF5RV2  DS    BL4'0'    RESERVED                              @YL026WA 19580000
SMF5PGNO DC    BL2'0'    Performance group number                  @LZC 19581700
*                          - Valid only if workload management     @LZA 19583400
*                            compatibility mode in effect.         @LZA 19585100
*                          - Zero if workload management goal      @LZA 19586800
*                            mode in effect when the Type 5        @LZA 19588500
*                            record is generated.                  @LZA 19590200
SMF5RV3  DC    CL2' '    RESERVED                              @YL026WA 19592000
SMF5TLEN DC    BL1'0'    TOTAL LENGTH OF ACCT SECT OF RECORD @G50FPRL   19600000
SMF5PRGN DC    CL20' '   PROGRAMMER'S NAME                              19650000
SMF5JCPU DC    BL3'0'    RESERVED                                  @LAC 19700000
SMF5ACTF DC    BL1'0'    NUMBER OF ACCOUNTING FIELDS                    19750002
SMF5JSAF DS    0C        JOB STATEMENT ACCOUNTING FIELDS(VARIABLE)      19800002
*                                                                       19850002
*        EACH ENTRY FOR AN ACCOUNTING FIELD CONTAINS THE LENGTH OF THE  19900002
*        FIELD(1 BYTE,BINARY),FOLLOWED BY THE FIELD (EBCDIC).AN OMITTED 19950002
*        FIELD IS REPRESENTED BY A LENGTH INDICATOR OF 0.               20000002
SMF5CPUS DS    BL4'0'    JOB CPU SERVICE                       @G50FPRL 20010000
SMF5IOCS DS    BL4'0'    JOB I/O SERVICE                       @G50FPRL 20020000
SMF5MSOS DS    BL4'0'    JOB MAIN STORAGE SERVICE              @G50FPRL 20030000
SMF5SRBS DS    BL4'0'    JOB SRB SERVICE                       @G50FPRL 20040000
SMF5RSV1 DS    CL8' '    RESERVED                              @YA15607 20045000
         AGO   .CONTB                                                   20050002
.IFAS006 ANOP                                                           20100002
         EJECT                                                          20150002
* IN JES2, THIS RECORD IS WRITTEN FOR EACH JOB OUTPUT ELEMENT, @YL02120 20200002
* WHICH REPRESENTS A GROUP OF DS DIFFERENTIATED BY PUNCH OR    @YL02120 20250002
* PRINTER SETUP & TYPE OF OUTPUT(EG HELD VS NON-HELD).         @YL02120 20260002
* FOR JES3, WRITTEN FOR EACH COPY OF A DATA SET                    @T8C 20305000
*                                                                       20350002
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    20400002
SMFRCD6  EQU   *         HEADER SEGMENT                                 20450002
SMF6LEN  DS    BL2'0'    RECORD LENGTH                                  20500002
SMF6SEG  DS    BL2'0'    SEGMENT DESCRIPTOR                             20550002
SMF6FLG  DC    BL1'0'    HEADER FLAG BYTE                               20600002
SMF6RTY  DC    BL1'0'    RECORD TYPE 6                                  20650002
SMFJ6    EQU   6         PRINT/PUNCH RECORD TYPE                   @T8A 20683300
SMF6TME  DC    BL4'0'    TOD, USING FORMAT FROM TIME MACRO W/BIN. INTVL 20716600
SMF6DTE  DC    PL4'0000'      DATE IN PACKED DECIMAL FORM: 00YYDDDF     20750002
SMF6SID  DC    CL4' '    SYSTEM IDENTIFICATION                   Y02901 20850000
SMF6JBN  DC    CL8' '   JOB NAME                                        20950000
SMF6RST  DC    BL4'0'   RDR START TIME, TIME JOB CARD 1ST READ @YL02120 21000000
SMF6RSD  DC    PL4'0000' READER START DATE  00YYDDDF                    21050002
SMF6UIF  DC    CL8' '   USER ID FIELD                                   21100002
SMF6OWC  DC    CL1' '   OUTPUT WTR CLASS, BLANK FOR NON-SYSOUT @YL02120 21150002
SMF6WST  DC    BL4'0'   WRITER START TIME                               21200000
SMF6WSD  DC    PL4'0000' WRITER START DATE                              21250002
SMF6NLR  DC    BL4'0'   # OF LOGICAL RECORDS HANDLED BY WRITER @YL02120 21300000
*                       PER FORM # PER CLASS, INCLUDES REPEATS @YL02120 21350002
*                       AND RESTARTS.                          @YL02120 21370002
SMF6IOE  DC    BL1'0'   IO ERROR INDICATOR:                             21400002
*                       BITS 0-4 RESERVED                        Y02120 21450002
SMF6DIE  EQU   X'04'    5 - DATA INPUT ERROR                   @ZA05171 21550000
*                       6 - RESV                                 Y02120 21600002
SMFCBIE  EQU   X'01'    7 - CONTROL BLOCK INPUT ERROR          @ZA05171 21650000
SMF6NDS  DC    BL1'0'   # OF DATA SETS PROCESSED BY THE OUTPUT   Y02120 21700002
*                       WRITER AND INCLUDED IN THIS RECORD.      Y02120 21750002
*                       (COUNT FOR EACH TIME A DS IS PRINTED)    Y02120 21760002
*                       DOES NOT INCLUDE RESTARTS.             @YL02120 21770002
SMF6FMN  DC    CL4' '   FORM NUMBER                                     21774200
SMF6PAD1 DC    BL1'0'   STATUS INDICATORS - THE SECTIONS WILL BE IN THE 21778400
*                                           ORDER LISTED BELOW WHEN THE 21782600
*                                           BIT IS TURNED ON       @T8C 21786800
*                       BIT  MEANING                           @ZA10800 21791000
SMF6FEXT EQU   X'80'     0   1 - FIRST EXTENSION PRESENT       @ZA10800 21795200
SMF6REXT EQU   X'40'     1   1 - COMMON SECTION PRESENT            @TBC 21799400
SMF6SEXT EQU   X'20'     2   1 - SECOND EXTENSION PRESENT          @T8A 21803600
SMF6ESS1 EQU   X'10'     3   1 - ENHANCED SYSOUT SECTION PRESENT   @LEA 21806400
SMF6FTFR EQU   X'08'     4   1 - FILE TRANSFER SECTION PRESENT     @04A 21808200
*                       5-7  RESERVED                              @04C 21810000
SMF6SBS  DS    BL2      SUBSYSTEM GENERATING ID                @YL02120 21812002
*                       EXTWTR=0, JES2=2, JES3=5, PSF=7,           @T8C 21812200
*                       IP PrintWay = 9                            @05A 21812400
SMF6LN1  DS    BL2      LENGTH OF SECTION INCLUDING THIS FIELD     @T8C 21812800
SMF6DCI  DS    BL1      DS CONTROL INDICATORS FOR DATA GROUP       @T8C 21813200
SMF6DCRV EQU   X'80'    0 - RESERVED                               @T8C 21813600
SMF6SDS  EQU   X'40'    1 - SPUN OFF DS                        @ZA05171 21814000
SMF6OCN  EQU   X'20'    2 - TERMINATED BY OPERATOR             @ZA05171 21814400
SMF6ORD  EQU   X'10'    3 - INTERRUPTED BY OPERATOR (JES2)     @ZA05171 21814800
*                           OPERATOR RESTARTED DATA SET        @ZA05171 21815200
*                           WITH DESTINATION (JES3)            @ZA05171 21815600
SMF6OR   EQU   X'08'    4 - RESTARTED BY OPERATOR              @ZA05171 21816000
SMF6ROR  EQU   X'04'    5 - CONT OF INTERRUPTED GROUP (JES2)   @ZA05171 21816400
*                           RECEIVED OP RESTARTED DS(JES3)     @ZA05171 21816800
SMF6OSS  EQU   X'02'    6 - CARRIAGE OVERRIDEN BY OPER(JES2)   @ZA05171 21817200
*                           OPERATOR STARTED WITH              @ZA05171 21817600
*                           SINGLE SPACE(JES3)                 @ZA05171 21818000
SMF6INT  EQU   X'01'    7 - PUNCH WAS INTERPRETED              @ZA05171 21818400
SMF6INDC DS    BL1      INDICATOR BITS                             @T8A 21818800
*                       BITS 0-3 ARE RESERVED FOR FUTURE EXPANSION @T8A 21819200
*                       OF DATASET CONTROL INDICATORS              @T8A 21819600
*                       BITS 4-7 ARE RECORD LEVEL INDICATORS IN    @T8A 21820000
*                       BIT VALUE FORMAT. EXAMPLE: LEVEL  1=X'01'  @T8A 21820400
*                                                  LEVEL 12=X'0C'  @T8A 21820800
*                                                  LEVEL 15=X'0F'  @T8A 21821200
*                       THIS NUMBER WILL BE INCREMENTED BY 1       @T8A 21821600
*                       EACH TIME A NEW RELEASE CHANGES THE RECORD @T8A 21822000
SMF6LEV2 EQU   X'01'    THIS VARIABLE IS FOR JES2 TO SET THE LEVEL @T8A 21822400
*                       INDICATOR BITS.                            @TBC 21822800
SMF6J2L3 EQU   X'03'    THIS VARIABLE IS FOR JES2 TO SET THE LEVEL @TBA 21823200
*                       INDICATOR BITS.                            @TBA 21823600
SMF6J2L4 EQU   X'04'    THIS VARIABLE IS FOR JES2 TO SET THE LEVEL @QXA 21823700
*                       INDICATOR BITS FOR SECURITY SUPPORT        @QXA 21823800
SMF6LEV3 EQU   X'01'    THIS VARIABLE IS FOR JES3 TO SET THE LEVEL @T8A 21824000
*                       INDICATOR BITS.                            @TBC 21824400
SMF6J3L3 EQU   X'03'    THIS VARIABLE IS FOR JES3 TO SET THE LEVEL @TBA 21824800
*                       INDICATOR BITS.                            @TBA 21825200
SMF6J3L4 EQU   X'04'    THIS VARIABLE IS FOR JES3 TO SET THE LEVEL @QXA 21825300
*                       INDICATOR BITS FOR SECURITY SUPPORT        @QXA 21825400
*                       INDICATOR BITS.                            @TBA 21825500
SMF6LEV4 EQU   X'05'    MVS/JES2 RELEASE 4.1.0                     @P2C 21825900
SMF6LEV6 EQU   X'06'    PSF/MVS RELEASE 3.1.0                      @08A 21826000
SMF6JNM  DS    CL4      WHEN SMF6INDC                              @P3C 21826100
*                       CONTAINS A X'1', THIS FIELD CONTAINS       @P3C 21826200
*                       A FOUR-DIGIT EBCDIC JOB NUMBER.            @P3C 21826300
*                       WHEN SMF6INDC CONTAINS A X'3' OR GREATER,  @P3C 21826400
*                       AND THE JOB NUMBER HAS MORE THAN 4 DIGITS, @P3C 21826700
*                       THIS FIELD CONTAINS ZEROS.                 @P3C 21827100
*                       IF THE JOB NUMBER IS < OR = TO 9999,       @P3C 21827500
*                       THIS FIELD CONTAINS THE JOB NUMBER.        @P3C 21827900
*                       FOR AN APPC TRANSACTION, THIS FIELD        @P3C 21828300
*                       CONTAINS ZEROES. THE CORRECT JOB NUMBER OR @P3C 21828700
*                       APPC TRANSACTION ID IS FOUND IN SMF6JBID.  @P3C 21829100
SMF6OUT  DS    CL8      LOGICAL OUTPUT DEVICE NAME             @YL02120 21830002
*                       FOR THE 3820, ACF/VTAM LOGICAL UNIT NAME   @T6A 21835000
SMF6FCB  DS    CL4      FCB ID                                   Y02120 21840002
SMF6UCS  DS    CL4      UCS ID                                   Y02120 21842002
*                       END OF RECORD FOR EXTERNAL WTR         @YM04806 21842400
SMF6PGE  DS    BL4      APPROXIMATE PHYSICAL PAGE COUNT            @T6C 21844000
*                                                              @YL02120 21844402
SMF6J2S  EQU   *        BEGIN JES2 ONLY SECTION                @YL02120 21844802
SMF6RTE  DS    BL2      OUTPUT ROUTE CODE OR ZERO              @G387P27 21845200
SMF6END2 DS    0X       END OF JES2 RECORD                         @T8A 21845600
SMF6SIZ2 DS    0XL(SMF6END2-SMFRCD6) SIZE OF JES2 SMF6 RECORD      @T8A 21846000
*                                    EXCLUDING OPTIONAL EXTENSIONS @T8A 21846400
SMF6SIZ3 DS    0XL(SMF6END2-SMF6LN1) SIZE OF JES2 SMF6 RECORD      @T8A 21846800
*                                    FROM SMF6LN1 TO HERE          @T8A 21847200
*                                                              @YL02120 21848002
         ORG   SMF6J2S                                         @YL02120 21848402
SMF6J3S  EQU   *        BEGIN JES3 ONLY SECTION                @YL02120 21848502
SMF6DFE  DS    BL2      DATA FORMAT ERROR INDICATORS           @YL02120 21848802
*                       BITS 0-5 RESV                          @YL02120 21849202
SMF6CCE  EQU   X'02'    6 - SOME 1ST CHAR CONTROL DATA BAD,    @ZA05171 21849600
*                           DEFAULT USED                       @YL02120 21849702
SMF6RBE  EQU   X'01'    7 - BAD RECORD LENGTH(TRUNCATE OR PAD) @ZA05171 21849800
*                       8-15 RESV                              @YL02120 21849902
SMF6OPR  DS    BL2      OUTPUT PRIORITY                        @YL02120 21866602
SMF6GRP  DS    CL8      LOGICAL OUTPUT DEVICE GROUP NAME       @YL02120 21876602
SMF6RSVJ DS    CL8      RESERVED FOR JES3                      @ZA05171 21876700
SMF6RSVU DS    CL4      RESERVED FOR USER                      @ZA05171 21876800
SMF6END  DS    0X       END OF JES3 RECORD                     @ZA05171 21876900
SMF6SIZ  DS    0XL(SMF6END-SMFRCD6) SIZE OF JES3 SMF6 RECORD   @ZA05171 21877000
*                                   EXCLUDING OPTIONAL EXTENSIONS  @T8A 21877100
SMF6LSIZ DS    0XL(SMF6END-SMF6LN1) SIZE OF JES3 SMF6 RECORD       @T8A 21877200
*                                   FROM SMF6LN1 TO HERE           @T8A 21877300
*                                                                  @T8C 21877400
*    FIRST EXTENSION - NON-IMPACT PRINTING SUBSYSTEM SECTION       @T8C 21877500
*                      THIS SECTION WILL ONLY BE PRESENT WHEN      @T8A 21877600
*                      SMF6SBS IS SET TO 2, 5 OR 7 INDICATING THAT @T8A 21877700
*                      JES2, JES3 OR PSF HAS GENERATED THIS RECORD @T8A 21877800
*                                                                  @T8A 21877900
         ORG   SMF6LN1                                         @ZA10800 21878000
SMF6LN2  DS    BL2      LENGTH FIRST EXTENSION INCLUDING THIS FLD  @T8C 21878100
SMF6CPS  DS    8CL1     COPIES DISTRIBUTION                    @ZA10800 21878200
SMF6CHR  DS    4CL4     TRANSLATE TABLE NAMES FRO CHARS PARM   @ZA10800 21878300
SMF6MID  DS    CL4      COPY MODIFICATION MODULE NAME          @ZA10800 21878400
SMF6FLI  DS    CL4      FLASH OVERLAY NAME                     @ZA10800 21878500
SMF6FLC  DS    BL1      NUMBER OF COPIES FLASHED               @ZA10800 21878600
SMF6BID  DS    BL1      FLAG BYTE                              @ZA10800 21878700
SMF6BTS  EQU   X'80'    THE BTSS WAS USED FOR OUTPUT           @ZA10800 21878800
SMF6OPJ  EQU   X'40'    OPTCD=J WAS USED FOR OUTPUT            @ZA10800 21878900
SMF6CSP  EQU   X'20'    CUT SHEET PRINTER                          @T6A 21879000
SMF6FEND DS    0X       END OF FIRST EXTENSION                     @T8A 21879100
SMF6FSIZ DS    0XL(SMF6FEND-SMF6LN2) SIZE OF FIRST EXTENSION       @T8A 21879200
*                                                                  @T8A 21879300
*      COMMON SECTION - THIS SECTION IS AN EXTENSION OF THE FIXED  @TBC 21929300
*                       HEADER SECTION AND WILL BE WRITTEN BY ALL  @TBC 21979300
*                       GENERATORS OF THE TYPE 6 RECORD. THIS WAS  @TBC 22029300
*                       PREVIOUSLY CALLED THE ROUTING SECTION.     @TBA 22079300
*                                                                  @T8A 22129300
         ORG   SMF6LN1                                             @T8A 22179300
SMF6LN3  DS    BL2      LENGTH OF SECTION INCLUDING THIS FIELD     @T8M 22229300
SMF6ROUT DS    CL4      OUTPUT ROUTE CODE                          @T8M 22279300
SMF6EFMN DS    CL8      OUTPUT FORM NUMBER                         @T8M 22329300
SMF6REND DS    0X       END OF OLD ROUTING SECTION                 @TBC 22379300
SMF6RSIZ DS    0XL(SMF6REND-SMF6LN3)   SIZE OF OLD ROUTING SECTION @TBC 22429300
         DS    CL16     RESERVED                                   @TBA 22479300
SMF6JBID DS    CL8      JOB ID                                     @TBA 22529300
SMF6STNM DS    CL8      STEPNAME                                   @LCA 22535500
SMF6PRNM DS    CL8      PROCEDURE STEP NAME                        @LCA 22541700
SMF6DDNM DS    CL8      DD NAME                                    @LCA 22547900
SMF6USID DS    CL8      USER ID                                    @LCA 22554100
SMF6SECS DS    CL8      SECURITY LABEL (SECLABEL)                  @LCA 22560300
SMF6PRMD DS    CL8      PROCESSING MODE                            @LCA 22566500
SMF6DSNM DS    CL53     DATA SET RESOURCE NAME                     @DLC 22568900
         DS    CL3      RESERVED                                   @DLA 22571300
SMF6OTOK DS    CL20     OUTPUT GROUP TOKEN                         @DKC 22573800
SMF6DEND DS    0X       END OF ROUTING SECTION                     @QXA 22574900
SMF6DSIZ DS    0XL(SMF6DEND-SMF6LN3)  SIZE OF ROUTING SECTION      @QXA 22577100
*                                                                  @T8A 22579300
*     SECOND EXTENSION - APA (ALL POINTS ADDRESSABLE) PRINTING     @T8A 22629300
*                        SUBSYSTEM SECTION                         @T8A 22679300
*                        THIS SECTION WILL ONLY BE PRESENT WHEN    @T8A 22729300
*                        SMF6SBS IS SET TO 7 INDICATING THAT       @T8A 22779300
*                        PSF HAS GENERATED THIS RECORD             @T8A 22829300
*                                                                  @T8A 22879300
         ORG   SMF6LN1                                             @T8A 22929300
SMF6LN4  DS    BL2      LENGTH SECOND EXTENSION INCLUDING THIS FLD @T8A 22979300
SMF6BNOF DS    BL2      OFFSET TO BIN SECTION                      @02A 23004300
         ORG   SMF6BNOF                                            @02A 23029300
SMF6RES  DS    BL2      RESERVED - REDEFINES SMF6BNOF              @02C 23054300
SMF6FONT DS    BL4      NUMBER OF FONTS USED                       @T8M 23079300
SMF6LFNT DS    BL4      NUMBER OF FONTS LOADED                     @T8M 23129300
SMF6OVLY DS    BL4      NUMBER OF OVERLAYS USED                    @T8M 23179300
SMF6LOLY DS    BL4      NUMBER OF OVERLAYS LOADED                  @T8M 23229300
SMF6PGSG DS    BL4      NUMBER OF PAGE SEGMENTS USED               @T8M 23279300
SMF6LPSG DS    BL4      NUMBER OF PAGE SEGMENTS LOADED             @T8M 23329300
SMF6IMPS DS    BL4      COUNT OF LOGICAL IMPRESSIONS PROCESSED     @T6C 23379300
SMF6FEET DS    BL4      NUMBER OF FEET OF DOCUMENT PRINTED         @T8M 23429300
*                       (ZERO FOR THE 3820)                        @T6C 23479300
SMF6PGDF DS    BL4      NUMBER OF PAGEDEFS USED                    @T8M 23529300
SMF6FMDF DS    BL4      NUMBER OF FORMDEFS USED                    @T8M 23579300
SMF6BIN  DS    BL1      FLAG BYTE                                  @T6C 23629300
SMF6BIN1 EQU   X'80'    BIN1 WAS USED FOR ANY PART OF THE DATA SET @T6A 23679300
SMF6BIN2 EQU   X'40'    BIN2 WAS USED FOR ANY PART OF THE DATA SET @T6A 23729300
SMF6BIN3 EQU   X'20'    BIN3 WAS USED FOR ANY PART OF THE DATA SET @04A 23740400
SMF6BIN4 EQU   X'10'    BIN4 WAS USED FOR ANY PART OF THE DATA SET @04A 23751500
SMF6PGOP DS    BL1      FLAG BYTE                                  @LCC 23762600
         SPACE 1                                                   @LCA 23795900
SMF6DUPS EQU   X'80'    STNDARD DUPLEX WAS USED FOR ANY PART OF DS @T6C 23829300
SMF6DUPT EQU   X'40'    TUMBLE DUPLEX WAS USED FOR ANY PART OF DS  @T6C 23879300
SMF6SYSA EQU   X'20'    KEYWORD SYSAREA=Y                          @LCA 23882200
SMF6DPGL EQU   X'10'    KEYWORD DPAGELBL=Y                         @LCA 23885100
SMF6SUCC EQU   X'08'    PRINT OPERATION WAS SUCCESSFUL             @DKC 23888000
SMF6SPGL EQU   X'04'    KEYWORD SPAGELBL=Y                         @DKC 23890900
SMF6SOER EQU   X'02'    ERROR OCCURRED PROCESSING SECURITY OVERLAY @DKC 23893800
SMF6IGER EQU   X'01'    IMAGE GENERATOR OVERRUN ERROR OCCURRED     @DKC 23896700
         SPACE 1                                                   @LCA 23899600
SMF6FLG3 DS    BL1      FLAG BYTE                                  @LCA 23902500
         SPACE 1                                                   @LCA 23905400
SMF6SLIG EQU   X'80'    SECURITY LABEL INTEGRITY GUARANTEED        @LCA 23908300
SMF6JHPP EQU   X'40'    THE JOB HEADER PAGE WAS PRINTED            @DKC 23908800
SMF6JTPP EQU   X'20'    THE JOB TRAILER PAGE WAS PRINTED           @DKC 23909300
SMF6DPLS EQU   X'10'    DATA PAGE LABELING WAS SUPPRESSED          @DKC 23909800
SMF6UPAS EQU   X'08'    USER PRINTABLE AREA WAS SUPPRESSED         @DKC 23910300
         DS    BL1      RESERVED                                   @LCA 23911200
SMF6NSOL DS    BL4      NUMBER OF SECURITY OVERLAYS USED           @DKC 23914100
SMF6NSFO DS    BL4      NUMBER OF SECURITY FONTS USED              @DKC 23917000
SMF6NSPS DS    BL4      NUMBER OF SECURITY PAGE SEGMENTS USED      @DKC 23919900
SMF6FDNM DS    CL8      FORMDEF NAME                               @LCA 23922800
SMF6PDNM DS    CL8      PAGEDEF NAME                               @LCA 23925700
SMF6PTDV DS    CL8      PRINTDEV NAME                              @DMA 23927500
SMF6OCNM DS    CL32     OBJECT CONTAINER NAME(S)                   @04A 23927700
         ORG   SMF6OCNM                                            @04A 23927900
SMF6SETU DS    CL8      COMSETUP OBJECT CONTAINER NAME             @04A 23928100
         DS    CL8      RESERVED OBJECT CONTAINER NAME             @04A 23928300
         DS    CL8      RESERVED OBJECT CONTAINER NAME             @04A 23928500
         DS    CL8      RESERVED OBJECT CONTAINER NAME             @04A 23928700
SMF6LPGE DS    BL4      Count of logical pages processed           @08A 23929000
SMF6SEND DS    0X       END OF SECOND EXTENSION                    @T8A 23929300
SMF6SSIZ DS    0XL(SMF6SEND-SMF6LN4)  SIZE OF SECOND EXTENSION     @T8A 23979300
*                                                                  @02A 23979600
*     MULTI-BINS HEADER SECTION (OFFSET DEFINED BY SMF6BNOF)       @02A 23979900
*                                                                  @02A 23980200
         ORG   SMFRCD6                                             @02A 23980500
SMF6BNLN DS    BL2      LENGTH BINS SECTION INCLUDING THIS FLD     @02A 23980800
SMF6BNUM DS    BL2      NUMBER OF COUNTERS ENTRIES                 @02A 23981100
*                                                                  @02A 23981400
*     MULTI-BINS COUNTER SECTION                                   @02A 23981700
*       - FOLLOWS "MULTI-BIN" HEADER SECTION                       @02A 23982000
*                                                                  @02A 23982300
         ORG   SMFRCD6                                             @02A 23982600
SMF6BNNO DS    BL1      BIN NUMBER                                 @02A 23982900
SMF6BNCT DS    BL3      BIN COUNTER                                @02A 23983200
SMF6BNLE DS    BL2      Paper length in millimeters                @08A 23983300
SMF6BNWI DS    BL2      Paper width in millimeters                 @08A 23983400
*                                                                  @02A 23983500
*    ENHANCED SYSOUT SECTION                                       @LEA 23984700
*                                                                       23987400
         ORG   SMF6LN1                                             @LEA 23990100
SMF6LN5  DS    BL2      LENGTH ENHANCED SYSOUT SECTION INCLUDING THIS   23992800
*                          FIELD                                   @LEA 23995500
SMF6SGID DS    BL4      SEGMENT IDENTIFIER                         @LEA 23998200
SMF6IND  DS    BL1      SECTION INDICATOR                          @LEA 24000900
SMF6SJF  EQU   X'80'    ERROR OBTAINING SWBTU - SWBTU DATA AREA    @LEA 24003600
*                          NOT PRESENT                             @LEA 24006300
SMF6RSV  DS    BL1      RESERVED                                   @LEA 24009000
SMF6JDVT DS    CL8      JDVTNAME                                   @LEA 24011700
SMF6TUL  DS    BL2      SWBTU DATA AREA LENGTH                     @LEA 24014400
SMF6TU   DS    0C       SWBTU DATA AREA  -  DATA AREA CAN BE       @LEA 24017100
*                         PROCESSED USING SWBTUREQ MACRO           @LEA 24019800
SMF6EEND DS    0X       END OF ENHANCED SYSOUT SECTION             @LEA 24022500
SMF6ESIZ DS    0XL(SMF6EEND-SMF6LN5) SIZE OF ENHANCED SYSOUT SEC.  @LEA 24025200
*                                                                  @T8C 24028000
*    FILE TRANSFER SECTION                                         @04A 24078000
*                                                                  @04A 24128000
         ORG   SMF6LN1                                             @04A 24178000
SMF6LN6  DS    BL2      LENGTH OF FILE TRANSFER SECTION INCLUDING THIS  24228000
*                          FIELD                                   @04A 24278000
SMF6BYTE DS    BL4      TOTAL NUMBER OF BYTES SENT                 @04A 24328000
SMF6IP1  DS    BL1      1ST SEGMENT OF TARGET ADDRESS              @04A 24378000
SMF6IP2  DS    BL1      2ND SEGMENT OF TARGET ADDRESS              @04A 24428000
SMF6IP3  DS    BL1      3RD SEGMENT OF TARGET ADDRESS              @04A 24478000
SMF6IP4  DS    BL1      4TH SEGMENT OF TARGET ADDRESS              @04A 24528000
         DS    CL12     RESERVED                                   @04A 24578000
SMF6PQLN DS    BL2      Length of Print Queue Name                 @06A 24594600
SMF6PRTQ DS    0C       Print Queue Name                           @06A 24611200
SMF6TEND DS    0X       END OF FILE TRANSFER SECTION               @04A 24628000
SMF6TSIZ DS    0XL(SMF6TEND-SMF6LN6) SIZE OF FILE TRANSFER SECTION @04A 24678000
*                                                                  @04A 24728000
         AGO   .CONTB                                                   24778000
         MEND                */                                         61681902
 %IFABGN2:;                                                             61682302
 %IFAL00: IF IFAR00='' %THEN %GOTO IFAL01;                              61682702
    DCL 1 SMFRCD00 BASED(SMF00PTR) BDY(WORD),                           61683102
 /* RECORD TYPE 0 - IPL                                              */ 61683502
 /* FIRST RECORD WRITTEN DURING IPL - OPTIONS IN EFFECT              */ 61683902
         3 SMF0LEN FIXED(15),     /* RDW RECORD LENGTH               */ 61684302
         3 SMF0SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */ 61684702
         3 SMF0FLG BIT(8),        /* OPERATING ENVIRONMENT           */ 61685102
         3 SMF0RTY FIXED(8),      /* RECORD TYPE 0                   */ 61685502
         3 SMF0TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */ 61685900
         3 SMF0DTE CHAR(4),       /* DATE RECORD WRITTEN             */ 61686302
         3 SMF0SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */ 61686702
         3 SMF0JWT FIXED(31) BDY(HWORD), /* CONTINUOUS WAIT TIME        61687100
                                            LIMIT(MIN)               */ 61687500
         3 SMF0BUF FIXED(31) BDY(HWORD), /* VALUE OF BUF KEYWORD     */ 61687900
         3 SMF0VST FIXED(31) BDY(HWORD), /* VIRTUAL MEMORY SIZE(1K)  */ 61688300
         3 SMF0OPT BIT(8),        /* SMF OPTIONS BYTE                   61688702
                                     0-SYSTEM AND JOB                   61689102
                                     1-STEP                             61689502
                                     2-EXITS TAKEN                      61689902
                                     3-DATA SET                         61691902
                                     4-DASD VOLUMES                     61693902
                                     5-RESERVED                         61695902
                                     6-SCRATCH FOR TEMPORARIES          61697902
                                     7-=0 FOR BKGD, =1 FOR FRGD      */ 61698302
         3 SMF0RST FIXED(31) BDY(WORD,4), /* REAL STORAGE SIZE(1K)   */ 61698400
         3 SMF0RSV BIT(8),                /* Reserved            @01A*/ 61698500
         3 SMF0OSL CHAR(8),               /* MVS Product name    @01A*/ 61698600
         3 SMF0SYN CHAR(8),               /* System name         @01A*/ 61698700
         3 SMF0SYP CHAR(8);               /* Sysplex name        @01A*/ 61698800
 %IFAL01:;                                                              61699102
 %IFAL02: IF IFAR02='' %THEN %GOTO IFAL03;                              61709102
    DCL 1 SMFRCD02 BASED(SMF02PTR) BDY(WORD),                           61719102
 /* RECORD TYPE 2 - DUMP HEADER                                      */ 61729102
 /* WRITTEN AT BEGINNING OF SMF DUMP FILE                            */ 61739102
         3 SMF2LEN FIXED(15),     /* RDW RECORD LENGTH               */ 61743102
         3 SMF2SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */ 61745102
         3 SMF2FLG BIT(8),        /* OPERATING ENVIRONMENT           */ 61747102
         3 SMF2RTY FIXED(8),      /* RECORD TYPE 2                   */ 61747502
         3 SMF2TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */ 61747900
         3 SMF2DTE CHAR(4),       /* DATE RECORD WRITTEN             */ 61748302
         3 SMF2SID CHAR(4);       /* SYSTEM ID FROM INSTALLATION     */ 61748702
 %IFAL03: IF IFAR03='' %THEN %GOTO IFAL04;                              61748802
    DCL 1 SMFRCD03 BASED(SMF03PTR) BDY(WORD),                           61748902
 /* RECORD TYPE 3 - DUMP TRAILER                                     */ 61749002
 /* WRITTEN AT END OF SMF DUMP FILE                                  */ 61765702
         3 SMF3LEN FIXED(15),     /* RDW RECORD LENGTH               */ 61777702
         3 SMF3SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */ 61779702
         3 SMF3FLG BIT(8),        /* OPERATING ENVIRONMENT           */ 61781702
         3 SMF3RTY FIXED(8),      /* RECORD TYPE 3                   */ 61782102
         3 SMF3TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */ 61782200
         3 SMF3DTE CHAR(4),       /* DATE RECORD WRITTEN             */ 61782302
         3 SMF3SID CHAR(4);       /* SYSTEM ID FROM INSTALLATION     */ 61787902
 %IFAL04: IF IFAR04='' %THEN %GOTO IFAL05;                              61793502
    DCL 1 SMFRCD04 BASED(SMF04PTR) BDY(WORD),                           61843502
 /* RECORD TYPE 4 - STEP TERMINATE                                   */ 61849102
 /* WRITTEN AT NORMAL OR ABNORMAL TERMINATION OF A BGD JOB STEP      */ 61899102
         3 SMF4LEN FIXED(15),     /* RDW RECORD LENGTH               */ 61999102
         3 SMF4SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */ 62049102
         3 SMF4FLG BIT(8),        /* OPERATING ENVIRONMENT           */ 62099102
         3 SMF4RTY FIXED(8),      /* RECORD TYPE 4                   */ 62149102
         3 SMF4TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */ 62199100
         3 SMF4DTE CHAR(4),       /* DATE RECORD WRITTEN             */ 62249102
         3 SMF4SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */ 62299102
         3 SMF4JBN CHAR(8),       /* JOB NAME                        */ 62349102
         3 SMF4RST FIXED(31) BDY(HWORD), /* READER START TIME(.01 SEC)*/62399100
         3 SMF4RSD CHAR(4),       /* READER START DATE               */ 62449102
         3 SMF4UIF CHAR(8),       /* USER IDENTIFICATION FIELD       */ 62499102
         3 SMF4STN FIXED(8),      /* STEP NUMBER                     */ 62549102
         3 SMF4SIT FIXED(31) BDY(WORD,4), /* STEP INITIATION TIME    */ 62599100
         3 SMF4STID CHAR(4),      /* STEP INITATION DATE             */ 62649102
         3 SMF4NCI FIXED(31) BDY(WORD,4), /* SPOOL IN COUNT          */ 62699100
         3 SMF4SCC FIXED(16) BDY(WORD,4), /* STEP COMPLETION CODE    */ 62749100
         3 SMF4PRTY FIXED(8),     /* DISPATCHING PRIORITY            */ 62799102
         3 SMF4PGMN CHAR(8),      /* PROGRAM NAME                    */ 62849102
         3 SMF4STMN CHAR(8),      /* STEP NAME                       */ 62899102
         3 SMF4RSV5 FIXED(16),    /* RESERVED                    @PVC*/ 62949100
         3 SMF4SYST FIXED(16),    /* SYS AREA USED-TOP OF PRIVATE(1K)*/ 63049102
         3 SMF4STU FIXED(16),     /* STOR USED-LOW OF PRIVATE(1K)    */ 63099102
          5 SMF4H0ST FIXED(16),                                         63149102
         3 SMF4RV1 CHAR(2),       /* RESERVED                    @PVC*/ 63169100
         3 SMF4PRV FIXED(31) BDY(HWORD), /* RGN REQ IN PRIVATE   @PVM*/ 63189100
          5 SMF4RSH0 FIXED(31) BDY(HWORD), /* RGN REQUEST IN PRIVATE    63209100
                                     AREA IN 1K UNITS            @PVM*/ 63229100
         3 SMF4SPK FIXED(8),      /* STORAGE PROTECT KEY             */ 63249102
         3 SMF4STI BIT(8),        /* STEP TERMINATION INDICATOR         63299102
                                     0-RESV                             63349102
                                     1-CANCELLED AT EXIT IEFUJV         63399102
                                     2-CANCELLED AT EXIT IEFUJI         63449102
                                     3-CANCELLED AT EXIT IEFUSI         63499102
                                     4-CANCELLED AT EXIT IEFACTRT       63549102
                                     5-STEP TO BE RESTARTED  @YL026WA   63599102
                                     6-ABEND                            63649102
                                     7-STEP FLUSHED                  */ 63699102
         3 SMF4RV2 CHAR(2),       /* RESV                            */ 63749102
         3 SMF4AST FIXED(31) BDY(HWORD), /* DEVICE ALLOC START TIME  */ 63799100
         3 SMF4PPST FIXED(31) BDY(HWORD), /* PROB PROG START TIME    */ 63849100
         3 SMF4RV3 CHAR(1),       /* RESV                    @YL026WA*/ 63899102
         3 SMF4SRBT PTR(24) BDY(WORD,4), /* STEP CPU UNDER SRB          63915700
                                                             @YL026WA*/ 63932300
         3 SMF4RIN BIT(16),       /* RECORD INDICATORS               */ 63949102
          5 * BIT(4),             /* 0-3 RESV                    @DGC*/ 63959100
          5 SMFBIT4 BIT(1),       /* 4 SMF4SETM NOT VALID FOR SP410     63969100
                                       SEE TYPE 30 RECORD               63979100
                                       WHEN ACTJTIME IS >3 BYTES @LAC*/ 63989100
          5 * BIT(1),              /*5 DEVICE DATA NOT RECORDED  @DAC*/ 63999100
          5 SMF4IEX BIT(1),       /* 6 POSSIBLE ERROR IN DEV ENTRY   */ 64009102
          5 * BIT(9),             /* 7 =0 VIRT, =1 REAL STORAGE      */ 64049100
                                  /* 8-15 RESV                       */ 64099100
         3 SMF4RLCT FIXED(15),    /* OFFSET TO RELOCATE SECTION      */ 64149102
         3 SMF4LENN FIXED(15);    /* LGTH OF EXCP SECTION + THESE 2  */ 64199102
    DCL 1 SMF4EXPS BASED BDY(WORD), /* EXCP SECTION, ENTRY FOR EACH     64249102
                                     DEVICE OF EACH NON-SPOOLED DS   */ 64299102
 /*                                                                  */ 64306200
 /* Note: Virtual I/O Devices are identified by the following:   @LYA*/ 64313300
 /*       Device Class 0                                         @LYA*/ 64320400
 /*       Unit Type 0                                            @LYA*/ 64327500
 /*       Device Number x'7FFF'                                  @LYA*/ 64334600
 /*                                                                  */ 64341700
         3 SMF4CUT CHAR(2),       /* DEVICE CLASS AND UNIT TYPE      */ 64349102
          5 SMF4DEVC CHAR(1),     /* DEVICE CLASS                    */ 64399102
          5 SMF4UTYP CHAR(1),     /* UNIT TYPE                       */ 64449102
         3 SMF4CUAD CHAR(2),      /* Device Number               @LYC*/ 64499100
                                  /*                            1@LYD*/ 64524100
         3 SMF4EXCP FIXED(31);    /* EXCP COUNT FOR DEVICE OF DS     */ 64549102
    DCL 1 SMF4CPUA BASED BDY(WORD), /* CPU  ACCT SECTION HDR    @P1C*/  64599100
         3 SMF4LNTH FIXED(8),     /* LGTH OF CPU AND ACCT SECTIONS   */ 64649102
         3 SMF4SETM PTR(24),      /* ACTJTIME WHEN 3 BYTES       @LAC*/ 64699100
         3 SMF4NAF PTR(8);        /* NUM OF ACCT FIELDS IN ACCT SECT */ 64709102
    DCL 1 SMF4ACTF BASED BDY(BYTE), /* ACCT SECTION                  */ 64749102
         3 SMF4ANC PTR(8),        /* # CHAR IN THIS ACCT FIELD       */ 64799102
         3 SMF4BCD CHAR(*);       /* ACCT FIELD CHARACTERS           */ 64849102
    DCL 1 SMF4RELS BASED BDY(BYTE), /* RELOCATE SECTION              */ 64899102
         3 SMF4PGIN FIXED(31) BDY(BYTE), /* # OF PAGE-INS            */ 64949102
         3 SMF4PGOT FIXED(31) BDY(BYTE), /* # OF PAGE-OUTS           */ 64999102
         3 SMF4NSW  FIXED(31) BDY(BYTE), /* # OF SWAPS               */ 65049102
          5 SMF4RGNS FIXED(31) BDY(BYTE),                               65099102
         3 SMF4PSI  FIXED(31) BDY(BYTE), /* # OF PAGES SWAPPED IN    */ 65149102
          5 SMF4SIN  FIXED(31) BDY(BYTE),                               65199102
         3 SMF4PSO  FIXED(31) BDY(BYTE), /* # OF PAGES SWAPPED OUT   */ 65249102
          5 SMF4SOUT FIXED(31) BDY(BYTE),                               65299102
         3 SMF4VPI  FIXED(31) BDY(BYTE), /* # OF VIO PAGE-INS        */ 65349102
         3 SMF4VPO  FIXED(31) BDY(BYTE), /* # OF VIO PAGE-OUTS          65352500
                                                             @Z40FPPF*/ 65355900
         3 SMF4SST FIXED(31) BDY(BYTE), /* STEP SERVICE TIME @YM07459*/ 65359300
         3 SMF4TAT FIXED(31) BDY(BYTE), /* STEP TRANSACTION ACTIVE      65362700
                                          TIME               @YM07459*/ 65366100
         3 SMF4PGNO FIXED(16) BDY(BYTE), /* Step performance            65366900
                                            group number         @LZC*/ 65367700
                        /* - Valid only if workload management   @LZA*/ 65368500
                        /*   compatibility mode in effect.       @LZA*/ 65369300
                        /* - Zero if workload management goal    @LZA*/ 65370100
                        /*   mode in effect when the Type 4      @LZA*/ 65370900
                        /*   record is generated.                @LZA*/ 65371700
         3 SMF4TRAN FIXED(31) BDY(BYTE), /* STEP TRANSACTION RESIDENCY  65376300
                                            TIME             @Z40FPPF*/ 65379700
         3 SMF4CPM FIXED(31) BDY(BYTE), /* CREAD PAGE MISS COUNT @DFC*/ 65384800
         3 SMF4RCLM FIXED(31) BDY(BYTE), /* NUMBER OF VIO RECLAIMS      65389900
                                                             @Z40FPPF*/ 65393300
         3 SMF4CPGN FIXED(31) BDY(BYTE), /* NUMBER OF COMMON PAGE-INS   65396700
                                                             @Z40FPPF*/ 65400100
         3 SMF4HSPI FIXED(31) BDY(BYTE), /* HIPERSPACE PAGE IN COUNT    65403500
                                                                 @LBC*/ 65406900
         3 SMF4PGST FIXED(31) BDY(BYTE), /* NUMBER OF PAGES STOLEN      65410300
                                            FROM THIS MEMORY @Z40FPPF*/ 65413700
         3 SMF4PSEC CHAR(8),             /* COUNT OF PAGE SECONDS       65417100
                                                             @Z40FPPF*/ 65420500
         3 SMF4LPAI FIXED(31) BDY(BYTE), /* LPA PAGE INS     @G50FPRL*/ 65423900
         3 SMF4HSPO FIXED(31) BDY(BYTE), /* HIPERSPACE PAGE OUT COUNT   65426100
                                                                 @LBC*/ 65428300
         3 SMF4CPUS FIXED(31) BDY(BYTE), /* STEP CPU SERVICE @G50FPRL*/ 65430700
         3 SMF4IOCS FIXED(31) BDY(BYTE), /* STEP I/O SERVICE @G50FPRL*/ 65434100
         3 SMF4MSOS FIXED(31) BDY(BYTE), /* STEP MAIN STORAGE SERVICE   65437500
                                                             @G50FPRL*/ 65440900
         3 SMF4SRBS FIXED(31) BDY(BYTE), /* STEP SRB SERVICE @G50FPRL*/ 65443600
         3 SMF4RSV1 CHAR(8);             /* RESERVED         @YA15607*/ 65446300
 %IFAL05: IF IFAR05='' %THEN %GOTO IFAL06;                              65449102
    DCL 1 SMFRCD05 BASED(SMF05PTR) BDY(WORD),                           65499102
 /* RECORD TYPE 5 - JOB TERMINATION                                  */ 65549102
 /* WRITTEN AT NORMAL OR ABNORMAL TERMINATION OF A JOB               */ 65599102
         3 SMF5LEN FIXED(15),     /* RDW RECORD LENGTH               */ 65699102
         3 SMF5SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */ 65749102
         3 SMF5FLG BIT(8),        /* OPERATING ENVIRONMENT           */ 65799102
         3 SMF5RTY FIXED(8),      /* RECORD TYPE 5                   */ 65849102
         3 SMF5TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */ 65899100
         3 SMF5DTE CHAR(4),       /* DATE RECORD WRITTEN             */ 65949102
         3 SMF5SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */ 65999102
         3 SMF5JBN CHAR(8),       /* JOB NAME                        */ 66049102
         3 SMF5RST FIXED(31) BDY(HWORD), /*READER START TIME (.01 SEC)*/66099100
         3 SMF5RSD CHAR(4),       /* READER START DATE               */ 66149102
         3 SMF5UIF CHAR(8),       /* USER IDENTIFICATION FIELD       */ 66199102
         3 SMF5NST FIXED(8),      /* # OF STEPS IN JOB               */ 66249102
         3 SMF5JIT FIXED(31) BDY(WORD,4), /* JOB INITIATION TIME     */ 66299100
         3 SMF5JID CHAR(4),       /* JOB INITATION DATE              */ 66349102
         3 SMF5NCI FIXED(31) BDY(WORD,4), /* SPOOL-IN COUNT FOR JOB  */ 66399100
         3 SMF5JCC FIXED(16) BDY(WORD,4), /* JOB COMPLETION CODE     */ 66449100
         3 SMF5JPTY FIXED(8),     /* JOB PRIORITY                    */ 66499102
         3 SMF5RSTT FIXED(31) BDY(HWORD), /* READER STOP TIME(.01 SEC)*/66549100
         3 SMF5RSTD CHAR(4),      /* READER STOP DATE                */ 66599102
         3 SMF5JBTI BIT(8),       /* JOB TERMINATION INDICATORS  @DGC*/ 66649100
           5 SMFBIT0 BIT(1),      /* 0-SMF5JCPU NOT VALID FOR SP410     66674100
                                       WHEN ACTJTIME IS >3 BYTES        66755900
                                       SEE TYPE 30 RECORD     @LAC*/    66787700
           5 *  BIT(7),                                                 66819500
                                  /* 1-CANCELLED AT EXIT IEFUJV   */    66851300
                                  /* 2-CANCELLED AT EXIT IEFUJI   */    66883100
                                  /* 3-CANCELLED AT EXIT IEFUSI   */    66914900
                                  /* 4-CANCELLED AT EXIT IEFACTRT */    66946700
                                  /* 5-RESV                       */    66978500
                                  /* 6-ABEND                      */    67010300
                                  /* 7-RESV                          */ 67042100
         3 SMF5SMCI CHAR(1),      /* RESV-FORMERLY SYSOUT CLASS IND  */ 67074100
         3 SMF5TRAN FIXED(31),    /* TOTAL TRANSACTION                  67099100
                                            RESIDENCY TIME   @ZM01380*/ 67124100
         3 SMF5CKRE CHAR(1),      /* RESV                            */ 67149102
         3 SMF5RDCL CHAR(1),      /* READER DEVICE CLASS             */ 67199102
         3 SMF5RUTY CHAR(1),      /* READER UNIT TYPE                */ 67249102
         3 SMF5JICL CHAR(1),      /* JOB INPUT CLASS                 */ 67299102
         3 SMF5SPK FIXED(8),      /* STORAGE PROTECT KEY             */ 67349102
         3 SMF5SRBT PTR(24),      /* JOB CPU UNDER SRB(.01 S)@YL026WA*/ 67399102
         3 SMF5TJS FIXED(31),     /* TOTAL JOB SERV(SERV UNITS)      */ 67449100
         3 SMF5TTAT FIXED(31),    /* TOTAL TRANSACTION ACTIVE           67499100
                                            TIME FOR JOB             */ 67549102
         3 SMF5RV2 CHAR(4),       /* RESV                    @YL026WA*/ 67599102
         3 SMF5PGNO FIXED(16),    /* Performance group number    @LZC*/ 67601900
                        /* - Valid only if workload management   @LZA*/ 67604700
                        /*   compatibility mode in effect.       @LZA*/ 67607500
                        /* - Zero if workload management goal    @LZA*/ 67610300
                        /*   mode in effect when the Type 5      @LZA*/ 67613100
                        /*   record is generated.                @LZA*/ 67615900
         3 SMF5RV3  CHAR(2),      /* RESERVED                @YL026WA*/ 67619100
       3 SMF5TLEN FIXED(8),  /* LGTH OF ACCT SECT OF RECORD @G50FPRL */ 67649100
         3 SMF5PRGN CHAR(20),     /* PROGRAMMER'S NAME               */ 67699102
         3 SMF5JCPU FIXED(24) BDY(WORD,2), /* ACTJTIME WHEN 3 BYTES     67732400
                                                                 @LAC*/ 67765700
         3 SMF5ACTF FIXED(8);     /* # OF ACCT FIELDS IN ACCT SECTION*/ 67799102
    DCL 1 SMF5JSAF BASED BDY(BYTE), /* ACCT SECTION                  */ 67849102
         3 SMF5ANC PTR(8),        /* # CHAR IN THIS ACCT FIELD       */ 67899102
         3 SMF5BCD CHAR(*);       /* ACCT FIELD CHARACTERS           */ 67949102
   DCL 1 SMF5SRMD BASED(ADDR(SMF5PRGN)+SMF5TLEN) BDY(BYTE),             67955700
       /*SRM JOB RELETATED SERVICE DATA                @G50FPRL*/       67962300
         3 SMF5CPUS FIXED(31) BDY(BYTE), /* JOB CPU SERVICE  @G50FPRL*/ 67968900
         3 SMF5IOCS FIXED(31) BDY(BYTE), /* JOB I/O SERVICE  @G50FPRL*/ 67975500
         3 SMF5MSOS FIXED(31) BDY(BYTE), /* JOB MAIN STORAGE SERVICE    67982100
                                                             @G50FPRL*/ 67988700
         3 SMF5SRBS FIXED(31) BDY(BYTE), /* JOB SRB SERVICE  @G50FPRL*/ 67993100
         3 SMF5RSV1 CHAR(8);             /* RESERVED         @YA15607*/ 67997500
 %IFAL06: IF IFAR06='' %THEN %GOTO IFALR1;                              68001900
    DCL 1 SMFRCD06 BASED(SMF06PTR) BDY(WORD),                           68009102
 /* RECORD TYPE 6 - SYSOUT WRITER                                @TBC*/ 68019100
 /* IN JES2, WRITTEN FOR EACH JOB OUTPUT ELEMENT, WHICH      @YL02120   68029102
     REPRESENTS A GROUP OF DS DIFFERENTIATED BY PUNCH OR     @YL02120   68039102
     PRINTER SETUP & TYPE OF OUTPUT(EG HELD VS NON-HELD).    @YL02120   68039502
    IN JES3, WRITTEN FOR EACH COPY OF A DATA SET                 @T8C*/ 68040300
         3 SMF6LEN FIXED(15),     /* RDW RECORD LENGTH               */ 68041102
         3 SMF6SEG FIXED(15),     /* RDW SEGMENT DESCRIPTOR          */ 68043102
         3 SMF6FLG BIT(8),        /* OPERATING ENVIRONMENT           */ 68045102
         3 SMF6RTY FIXED(8),      /* RECORD TYPE 6                   */ 68047102
         3 SMF6TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN       */ 68047500
         3 SMF6DTE CHAR(4),       /* DATE RECORD WRITTEN             */ 68047902
         3 SMF6SID CHAR(4),       /* SYSTEM ID FROM INSTALLATION     */ 68048302
         3 SMF6JBN CHAR(8),       /* JOB NAME FROM JMR               */ 68048702
         3 SMF6RST FIXED(31) BDY(HWORD), /*READER START TIME (.01 SEC)*/68048800
         3 SMF6RSD CHAR(4),       /* READER START DATE               */ 68048902
         3 SMF6UIF CHAR(8),       /* USER IDENTIFICATION FIELD       */ 68049002
         3 SMF6OWC CHAR(1),       /* OUTPUT WRITER CLASS-               68065702
                                     BLANK FOR NON SYSOUT    @YL02120*/ 68067702
         3 SMF6WST FIXED(31) BDY(WORD,4), /* TOD WRITER START        */ 68075700
         3 SMF6WSD CHAR(4),       /* WRITER START DATE               */ 68077702
         3 SMF6NLR FIXED(31) BDY(WORD,4), /* # LOGICAL RECS WRITTEN  */ 68079700
         3 SMF6IOE BIT(8),        /* IO ERROR INDICATOR              */ 68081702
           5 *        BIT(5),     /* RESERVED                @ZA05171*/ 68081800
           5 SMF6DIE  BIT(1),     /* DATA INPUT ERROR        @ZA05171*/ 68081900
           5 *        BIT(1),     /* RESERVED                @ZA05171*/ 68082000
           5 SMF6CBIE BIT(1),     /*CONTROL BLOCK INPUT ERROR@ZA05171*/ 68082100
         3 SMF6NDS FIXED(8),      /* # DS PROCESSED BY WRITER        */ 68082200
         3 SMF6FMN CHAR(4),       /* FORM NUMBER                     */ 68082300
         3 SMF6PAD1 BIT(8),       /* INDICATORS - THE SECTIONS WILL BE  68082400
                                     IN THE ORDER AS LISTED BELOW WHEN  68082500
                                     THE BIT IS TURNED ON        @T8C*/ 68082600
           5 SMF6FEXT BIT(1),     /* FIRST EXTENSION PRESENT     @T8C*/ 68082700
           5 SMF6REXT BIT(1),     /* COMMON SECTION PRESENT      @TBC*/ 68082800
           5 SMF6SEXT BIT(1),     /* SECOND EXTENSION PRESENT    @T8A*/ 68082900
           5 SMF6ESS1 BIT(1),     /* ENHANCED SYSOUT SEC PRESENT @LEA*/ 68083300
           5 SMF6FTFR BIT(1),     /* FILE TRANSFER SEC PRESENT   @04A*/ 68083600
           5 * BIT(3),            /* RESERVED                    @04C*/ 68083900
         3 SMF6SBS FIXED(15),     /* SUBSYSTEM GENERATING ID            68084302
                                EXTWTR=0, JES2-2, JES3-5, PSF=7,        68085100
                                IP PrintWay = 9                  @05C*/ 68085900
         3 SMF6LN1 FIXED(15),     /* LGTH OF SECTION INCLUDING SELF  */ 68086702
         3 SMF6DCI BIT(8),        /* DATA SET CONTROL INDICATORS @T8C*/ 68087200
           5 SMF6DCRV  BIT(1),    /* RESERVED                    @T8A*/ 68087700
           5 SMF6SDS   BIT(1),    /* SPUN OFF DATA SET       @ZA05171*/ 68088200
           5 SMF6OCN   BIT(1),    /* TERMINATED BY OPERATOR  @ZA05171*/ 68088700
           5 SMF6ORD   BIT(1),    /* INTERRUPTED BY OPERATOR(JES2)      68089200
                                     OPERATOR RESTARTED DATA SET WITH   68089700
                                     DESTINATION(JES3)       @ZA05171*/ 68090200
           5 SMF6OR    BIT(1),    /* RESTARTED BY OPERATOR   @ZA05171*/ 68090700
           5 SMF6ROR   BIT(1),    /* CONTINUATION OF INTERRUPTED        68091200
                                     GROUP(JES2)                        68091700
                                     RECEIVED OP RESTARTED DS(JES3)     68092200
                                                             @ZA05171*/ 68092700
           5 SMF6OSS   BIT(1),    /* CARRIAGE OVERRIDEN BY              68093200
                                     OPERATOR(JES2)                     68093700
                                     OPERATOR STARTED WITH SINGLE       68094200
                                     SPACE(JES3)             @ZA05171*/ 68094700
           5 SMF6INT   BIT(1),     /* PUNCH WAS INTERRUPTED  @ZA05171*/ 68095200
         3 SMF6INDC BIT(8),       /* BIT INDICATORS.  BITS 0-3 ARE      68095700
                                     RESERVED FOR FUTURE EXPANSION      68096200
                                     OF DATA SET CONTROL INDICATORS.    68096700
                                     BITS 4-7 ARE RECORD LEVEL          68097200
                                     INDICATORS TO BE SET IN            68097700
                                     BIT VALUE FORMAT.  EXAMPLE:        68098200
                                     LEVEL 1=X'01', LEVEL 12=X'0C'.     68098700
                                     THIS NUMBER WILL BE INCREMENTED    68099200
                                     BY 1 EACH TIME A NEW RELEASE       68099700
                                     CHANGES THE RECORD.         @T8A*/ 68100200
         3 SMF6JNM CHAR(4), /*  WHEN SMF6INDC                           68100300
                             CONTAINS A X'1', THIS FIELD CONTAINS       68100400
                             A FOUR-DIGIT EBCDIC JOB NUMBER.            68100500
                             WHEN SMF6INDC CONTAINS A X'3' OR GREATER,  68100600
                             AND THE JOB NUMBER HAS MORE THAN 4 DIGITS, 68100800
                             THIS FIELD CONTAINS ZEROS.                 68101100
                             IF THE JOB NUMBER IS < OR = TO 9999,       68101400
                             THIS FIELD CONTAINS THE JOB NUMBER.        68101700
                             FOR AN APPC TRANSACTION, THIS FIELD        68102000
                             CONTAINS ZEROES. THE CORRECT JOB NUMBER OR 68102300
                             APPC TRANSACTION ID IS FOUND IN SMF6JBID.  68102600
                                                                @P3C*/  68102900
         3 SMF6OUT CHAR(8),       /* LOGICAL OUTPUT DEVICE NAME (FOR    68103800
                                     THE 3820, ACF/VTAM LOGICAL         68106800
                                     UNIT NAME)                  @T6C*/ 68109800
         3 SMF6FCB CHAR(4),       /* FCB ID                          */ 68113002
         3 SMF6UCS CHAR(4),       /* UCS ID,  END OF REC FOR EXT WTR */ 68119100
         3 SMF6PGE FIXED(31),     /* APPROXIMATE PHYSICAL PAGE          68121900
                                     COUNT                       @T6C*/ 68124700
         3 SMF6J2S CHAR(2) BDY(WORD),  /* SPECIAL JES2 SECTION   @T8C*/ 68127500
           5 SMF6RTE FIXED(15),   /* OUTPUT ROUTE CODE OR ZERO          68130300
                                                             @G387P27*/ 68133100
         3 SMF6END2 CHAR(0);      /* END OF JES2 BASE RECORD     @T8A*/ 68135900
   DCL SMF6LEV2 FIXED(8) CONSTANT(1), /* THIS VARIABLE IS FOR JES2 TO   68136000
                                         SET LEVEL INDICATOR     @QXA*/ 68136100
       SMF6J2L3 FIXED(8) CONSTANT(3), /* THIS VARIABLE IS FOR JES2 TO   68136200
                                         SET LEVEL INDICATOR     @QXA*/ 68136300
       SMF6J2L4 FIXED(8) CONSTANT(4), /* THIS VARIABLE IS FOR JES2 TO   68136400
                                         SET LEVEL INDICATOR FOR        68136500
                                         SECURITY SUPPORT        @QXA*/ 68136600
       SMF6LEV3 FIXED(8) CONSTANT(1), /* THIS VARIABLE IS FOR JES3 TO   68136700
                                         SET LEVEL INDICATOR     @QXA*/ 68136800
       SMF6J3L3 FIXED(8) CONSTANT(3), /* THIS VARIABLE IS FOR JES3 TO   68136900
                                         SET LEVEL INDICATOR     @QXA*/ 68137000
       SMF6J3L4 FIXED(8) CONSTANT(4), /* THIS VARIABLE IS FOR JES3 TO   68137100
                                         SET LEVEL INDICATOR FOR        68137200
                                         SECURITY SUPPORT        @QXA*/ 68137300
       SMF6LEV4 FIXED(8) CONSTANT(5), /* MVS/JES2 RELEASE 4.1.0  @P2A*/ 68137700
       SMF6LEV6 FIXED(8) CONSTANT(6); /* PSF/MVS Release 3.1.0   @08A*/ 68138100
   DCL 1 * CHAR(24) DEFINED(SMF6J2S) BDY(WORD),  /*              @T8A*/ 68138700
         3 SMF6J3S CHAR(24) BDY(WORD),  /* SPECIAL JES3 SECTION  @T8C*/ 68141500
           5 SMF6DFE BIT(16),     /* DATA FORMAT ERROR INDICATORS    */ 68144300
             7 *     BIT(6),      /* 0-5 RESERVED                @T8C*/ 68147100
             7 SMF6CCE BIT(1),    /* 6-ONE OR MORE RECORDS CONTAINED    68149900
                                       INVALID 1ST CHAR CONTROL DATA,   68153702
                                       DEFAULT SUBSTITUTED       @T8C*/ 68203700
             7 SMF6RBE BIT(1),    /* 7-INVALID LGTH REC IN DATA,        68253700
                                       TRUNCATED OR PADDED       @T8C*/ 68303700
             7 *       BIT(8),    /* 8-15 RESERVED               @T8C*/ 68353700
           5 SMF6OPR FIXED(16) BDY(HWORD), /* OUTPUT PRIORITY    @T8C*/ 68403700
           5 SMF6GRP CHAR(8),     /*LOG OUTPUT DEV GROUP NAME    @T8C*/ 68453700
           5 SMF6RSVJ CHAR(8),    /*RESERVED FOR JES3            @T8C*/ 68503700
           5 SMF6RSVU CHAR(4),    /*RESERVED FOR USER            @T8C*/ 68553700
         3 SMF6END CHAR(0);       /* END OF JES3 BASE RECORD @ZA75776*/ 68603700
      /* BEGINNING OF FIRST EXTENSION - THIS SECTION WILL ONLY BE       68653700
         PRESENT WHEN SMF6SBS IS SET TO 2, 5 OR 7 INDICATING THAT       68703700
         JES2, JES3 OR PSF HAS GENERATED THIS RECORD.            @T8A*/ 68753700
   DCL 1 SMF6EXT1 BASED,          /* FIRST EXTENSION - NON-IMPACT       68803700
                                     PRINTING SUBSYSTEM SECTION  @T8C*/ 68853700
         3 SMF6LN2 FIXED(15),   /* LENGTH OF FIRST EXTENSION            68903700
                                     INCLUDING THIS FIELD        @T8C*/ 68953700
         3 SMF6CPS(8) CHAR(1),    /* COPIES DISTRIBUTION     @ZA10800*/ 69003700
         3 SMF6CHR CHAR(16),      /* TRANSLATE TABLE NAMES   @ZA10800   69053700
                                     FROM CHARS PARAMETER    @ZA10800*/ 69103700
         3 SMF6MID CHAR(4),       /* COPY MODIFICATION       @ZA10800   69153700
                                     MODULE NAME             @ZA10800*/ 69203700
         3 SMF6FLI CHAR(4),       /* FLASH OVERLAY NAME      @ZA10800*/ 69253700
         3 SMF6FLC BIT(8),       /* NUMBER OF COPIES FLASHED @ZA10800*/ 69303700
         3 SMF6BID BIT(8),        /* FLAG BYTE               @ZA10800*/ 69353700
           4 SMF6BTS BIT(1),      /* THE BTSS WAS USED FOR   @ZA10800   69403700
                                     OUTPUT                  @ZA10800*/ 69453700
           4 SMF6OPJ BIT(1),      /* OPTCD=J WAS USED FOR    @ZA10800   69503700
                                     OUTPUT                  @ZA10800*/ 69553700
           4 SMF6CSP BIT(1);      /* CUT SHEET PRINTER           @T6A*/ 69603700
      /* BEGINNING OF COMMON SECTION - THIS SECTION IS AN EXTENSION     69645300
         OF THE FIXED HEADER SECTION AND WILL BE WRITTEN BY ALL         69686900
         GENERATORS OF THE TYPE 6 RECORD. THIS WAS PREVIOUSLY CALLED    69728500
         THE ROUTING SECTION.                                    @TBC*/ 69770100
  DCL 1 SMF6RSEC BASED,             /* COMMON SECTION            @TBC*/ 69811700
        3 SMF6LN3 FIXED(15),        /* LENGTH OF THIS SECTION           69853700
                                       INCLUDING THIS FIELD      @T8M*/ 69903700
        3 SMF6ROUT CHAR(4), /* OUTPUT ROUTE CODE                 @T8M*/ 69953700
        3 SMF6EFMN CHAR(8), /* OUTPUT FORM NUMBER                @T8M*/ 69978700
        3 * CHAR(16),               /* RESERVED                  @TBA*/ 70003700
        3 SMF6JBID CHAR(8),         /* JOB ID                    @TBA*/ 70009200
        3 SMF6STNM CHAR(8),         /* STEP NAME                 @LCA*/ 70014700
        3 SMF6PRNM CHAR(8),         /* PROCEDURE STEP NAME       @LCA*/ 70020200
        3 SMF6DDNM CHAR(8),         /* DD NAME                   @LCA*/ 70025700
        3 SMF6USID CHAR(8),         /* USER ID                   @LCA*/ 70031200
        3 SMF6SECS CHAR(8),         /* SECURITY LABEL (SECLABEL) @LCA*/ 70036700
        3 SMF6PRMD CHAR(8),         /* PROCESSING MODE           @LCA*/ 70042200
        3 SMF6DSNM CHAR(53),        /* DATA SET RESOURCE NAME    @DLC*/ 70044700
        3 * CHAR(3),                /* RESERVED                  @DLA*/ 70047200
        3 SMF6OTOK CHAR(20);        /* OUTPUT GROUP TOKEN        @DKC*/ 70049800
      /* BEGINNING OF SECOND EXTENSION - THIS SECTION WILL ONLY BE      70053700
         PRESENT WHEN SMF6SBS IS SET TO 7 INDICATING THAT PSF HAS       70103700
         GENERATED THIS RECORD.                                  @T8A*/ 70153700
  DCL 1 SMF6EXT2 BASED,     /* SECOND EXTENSION - APA (ALL POINTS       70203700
                      ADDRESSABLE) PRINTING SUBSYSTEM SECTION    @T8M*/ 70253700
         3 SMF6LN4 FIXED(15),     /* LENGTH OF SECOND EXTENSION         70303700
                                     INCLUDING THIS FIELD        @T8A*/ 70353700
         3 SMF6BNOF FIXED(15),    /* OFFSET TO 'BINS' SECTION    @02C*/ 70403700
         3 SMF6FONT FIXED(31),    /* NUMBER OF FONTS USED        @T8M*/ 70453700
         3 SMF6LFNT FIXED(31),    /* NUMBER OF FONTS LOADED      @T8M*/ 70503700
         3 SMF6OVLY FIXED(31),    /* NUMBER OF OVERLAYS USED     @T8M*/ 70553700
         3 SMF6LOLY FIXED(31),    /* NUMBER OF OVERLAYS LOADED   @T8M*/ 70603700
         3 SMF6PGSG FIXED(31),    /* NBR OF PAGE SEGMENTS USED   @T8M*/ 70653700
         3 SMF6LPSG FIXED(31),    /* NBR OF PAGE SEGMENTS LOADED @T8M*/ 70703700
         3 SMF6IMPS FIXED(31),    /* COUNT OF LOGICAL IMPRESSIONS       70753700
                                     PROCESSED                   @T6C*/ 70803700
         3 SMF6FEET FIXED(31),    /* NUMBER OF FEET OF DOCUMENT         70853700
                                     PRINTED (ZERO FOR THE 3820) @T6C*/ 70903700
         3 SMF6PGDF FIXED(31),    /* NBR OF PAGEDEFS USED        @T8M*/ 70953700
         3 SMF6FMDF FIXED(31),    /* NUMBER OF FORMDEFS USED     @T8M*/ 71003700
         3 SMF6BIN  BIT(8),       /* FLAG BYTE                   @T6C*/ 71053700
            4 SMF6BIN1 BIT(1),    /* BIN1 WAS USED FOR ANY PART OF THE  71103700
                                     DATA SET                    @T6A*/ 71153700
            4 SMF6BIN2 BIT(1),    /* BIN2 WAS USED FOR ANY PART OF THE  71203700
                                     DATA SET                    @T6A*/ 71253700
            4 SMF6BIN3 BIT(1),    /* BIN3 WAS USED FOR ANY PART OF THE  71263700
                                     DATA SET                    @04A*/ 71273700
            4 SMF6BIN4 BIT(1),    /* BIN4 WAS USED FOR ANY PART OF THE  71283700
                                     DATA SET                    @04A*/ 71293700
         3 SMF6PGOP BIT(8),       /* FLAG BYTE                   @LCC*/ 71303700
            4 SMF6DUPS BIT(1),    /* STANDARD DUPLEX WAS USED FOR ANY   71353700
                                     PART OF THE DATA SET        @T6C*/ 71403700
            4 SMF6DUPT BIT(1),    /* TUMBLE DUPLEX WAS USED FOR ANY     71453700
                                     PART OF THE DATA SET        @T6C*/ 71503700
            4 SMF6SYSA BIT(1),    /* KEYWORD SYSAREA=Y           @LCA*/ 71506800
            4 SMF6DPGL BIT(1),    /* KEYWORD DPAGELBL=Y          @LCA*/ 71509900
            4 SMF6SUCC BIT(1),    /* PRINT OPERATION WAS SUCCESS @LCA*/ 71513000
            4 SMF6SPGL BIT(1),    /* KEYWORD SPAGELBL=Y          @LCA*/ 71516100
            4 SMF6SOER BIT(1),    /* ERROR OCCURRED PROCESSING          71519200
                                     SECURITY OVERLAY            @LCA*/ 71522300
            4 SMF6IGER BIT(1),    /* IMAGE GENERATOR OVERRUN ERROR      71525400
                                     OCCURRED                    @LCA*/ 71528500
         3 SMF6FLG3 BIT(8),       /* FLAG BYTE                   @LCC*/ 71531600
           4 SMF6SLIG BIT(1),     /* SECURITY LABEL INTEGRITY    @LCA*/ 71534700
           4 SMF6JHPP BIT(1),     /* JOB HEADER PAGE WAS PRINTED @DKC*/ 71535000
           4 SMF6JTPP BIT(1),     /* JOB TRAILER PAGE WAS PRINTED       71535300
                                                                 @DKC*/ 71535600
           4 SMF6DPLS BIT(1),     /* DATA PAGE LABELING WAS             71535900
                                       SUPPRESSED                @DKC*/ 71536200
           4 SMF6UPAS BIT(1),     /* USER PRINTABLE AREA WAS            71536500
                                       SUPPRESSED                @DKC*/ 71536800
         3 * BIT(8),              /* RESERVED                    @LCA*/ 71537800
         3 SMF6NSOL FIXED(31),    /* NUMBER OF SECURITY OVERLAYS        71539600
                                       USED                      @DKC*/ 71541400
         3 SMF6NSFO FIXED(31),    /* NUMBER OF SECURITY FONTS           71543200
                                       USED                      @DKC*/ 71545000
         3 SMF6NPS FIXED(31),     /* NUMBER OF SECURITY PAGE SEGMENTS   71547100
                                       USED                      @DKC*/ 71550200
         3 SMF6FDNM CHAR(8),      /* FORMDEF NAME                @LCA*/ 71553300
         3 SMF6PDNM CHAR(8),      /* PAGEDEF NAME                @LCA*/ 71555300
         3 SMF6PTDV CHAR(8),      /* PRINTDEV NAME               @DMA*/ 71555600
         3 SMF6OCNM CHAR(32),     /* OBJECT CONTAINER NAME(S)    @04A*/ 71555900
           5 SMF6SETU CHAR(8), /* COMSETUP OBJECT CONTAINER NAME @04A*/ 71556200
           5 *        CHAR(8), /* RESERVED OBJECT CONTAINER NAME @04A*/ 71556500
           5 *        CHAR(8), /* RESERVED OBJECT CONTAINER NAME @04A*/ 71556800
           5 *        CHAR(8), /* RESERVED OBJECT CONTAINER NAME @04A*/ 71557000
         3 SMF6LPGE FIXED(31);    /* Count of logical pages      @08A*/ 71557200
                                                                        71557400
 /*   MULTI-BINS HEADER SECTION (OFFSET DEFINED BY SMF6BNOF)     @02A*/ 71557500
                                                                        71557600
 DCL 1 SMF6BNMI BASED,            /* MULTI BIN INPUT SECTION     @02A*/ 71557700
       3 SMF6BNLN  FIXED(15),     /* LENGTH OF SECTION INCLUDING        71557800
                                         BIN COUNTERS            @02A*/ 71557900
       3 SMF6BNUM  FIXED(15),     /* NUMBER OF COUNTER ENTRIES   @02A*/ 71558000
       3 SMF6BNCS  CHAR(0);       /* START OF BIN COUNTERS       @02A*/ 71558100
                                                                        71558200
 /*                                                                  */ 71558300
 /*   MULTI-BINS COUNTER SECTION                                 @02A*/ 71558400
 /*     - FOLLOWS "MULTI-BIN" HEADER SECTION                     @02A*/ 71558500
 /*                                                                  */ 71558600
                                                                        71558700
 DCL 1 SMF6BNCN(*) BASED(ADDR(SMF6BNCS)),    /* BIN COUNTER      @02A*/ 71558800
       3 SMF6BNNO       FIXED(8),            /* BIN NUMBER       @02A*/ 71558900
       3 SMF6BNCT       FIXED(24),           /* BIN COUNTER      @02A*/ 71559000
       3 SMF6BNLE       FIXED(16), /* Paper lngth in millimeters @08A*/ 71559100
       3 SMF6BNWI       FIXED(16); /* Paper width in millimeters @08A*/ 71559200
                                                                        71559300
      /* ENHANCED SYSOUT SECTION                                 @LEA*/ 71559500
   DCL 1 SMF6ESS  BASED,          /* ENHANCED SYSOUT SECTION     @LEA*/ 71562600
         3 SMF6LN5 FIXED(15),     /* LENGTH OF ESS SECTION INCLUDING    71565700
                                      THIS FIELD                 @LEA*/ 71568800
         3 SMF6SGID FIXED(31) BDY(HWORD),  /* SEGMENT IDENTIFIER @LEA*/ 71571900
         3 SMF6IND BIT(8),        /* SECTION INDICATOR           @LEA*/ 71575000
           5 SMF6SJF BIT(1),      /* ERROR OBTAINING SWBTU - SWBTU      71578100
                                      DATA AREA NOT PRESENT      @LEA*/ 71581200
         3 SMF6RSV CHAR(1),       /* RESERVED                    @LEA*/ 71584300
         3 SMF6JDVT CHAR(8),      /* JDVTNAME                    @LEA*/ 71587400
         3 SMF6TUL FIXED(15),     /* SWBTU DATA AREA LENGTH      @LEA*/ 71590500
         3 SMF6TU CHAR(*);        /* SWBTU DATA AREA  -  DATA AREA      71593600
                                      CAN BE PROCESSED USING SWBTUREQ   71596700
                                      MACRO                      @LEA*/ 71599800
                                                                        71600100
      /* FILE TRANSFER SECTION                                   @04A*/ 71600400
   DCL 1 SMF6FXFR BASED,          /* FILE TRANSFER SECTION       @04A*/ 71600700
         3 SMF6LN6 FIXED(15),     /* LENGTH OF FILE TRANSFER SECTION    71601000
                                      INCLUDING THIS FIELD       @04A*/ 71601300
         3 SMF6BYTE FIXED(32) BDY(HWORD),  /* TOTAL BYTES SENT   @04A*/ 71601600
         3 SMF6IP1 FIXED(8),    /* 1ST SEGMENT OF TARGET ADDRESS @04A*/ 71601900
         3 SMF6IP2 FIXED(8),    /* 2ND SEGMENT OF TARGET ADDRESS @04A*/ 71602200
         3 SMF6IP3 FIXED(8),    /* 3RD SEGMENT OF TARGET ADDRESS @04A*/ 71602500
         3 SMF6IP4 FIXED(8),    /* 4TH SEGMENT OF TARGET ADDRESS @04A*/ 71602800
         3 *       CHAR(12),    /* RESERVED                      @04A*/ 71603000
         3 SMF6PQLN FIXED(16),  /* Length of Print Queue Name    @06A*/ 71603200
         3 SMF6PRTQ CHAR(*);    /* Print Queue Name              @06A*/ 71603400
 %IFALR1: ;                                                             71603700
 %INCLUDE SYSLIB(IFASMFR1) NOSEG;                                       71653700
 %INCLUDE SYSLIB(IFASMFR2) NOSEG;                                       71703700
 %INCLUDE SYSLIB(IFASMFR3) NOSEG;                                       71753700
 %INCLUDE SYSLIB(IFASMFR4) NOSEG;                                       71803700
 %INCLUDE SYSLIB(IFASMFR5) NOSEG;                                       71853700
 %INCLUDE SYSLIB(IFASMFR6) NOSEG;                                       71903700
 %INCLUDE SYSLIB(IFASMFR9) NOSEG;                                       71953700
 %INCLUDE SYSLIB(IFASMFRA) NOSEG;                                       72003700
 %INCLUDE SYSLIB(IFASMFRB) NOSEG;                                       72053700
 %INCLUDE SYSLIB(IFASMFRC) NOSEG;                                       72103700
 %INCLUDE SYSLIB(IFASMFRD) NOSEG;                                       72153700
 %INCLUDE SYSLIB(IAZSMFR) NOSEG;    /* EXPAND JES SMF MAPPINGS   @T7A*/ 72203700
