*        %GOTO IFAL36;   /*                                        @L8C 00050000
         MACRO                                                          00100000
&NAME    IFASMFI6 &RECTYPE                                              00150000
.* *                                                                  * 00200000
.* * MACMEAN IFASMFI6 MEANS SYSTEM MANAGEMENT FACILITY RECORD MAPPING * 00250000
.* * MACCOMP Y-2 SC102/BL27P                                          * 00300000
.* * MACSTAT Y-2 73298/42020                                          * 00350000
.* * METHOD OF ACCESS                                                 * 00400000
.* *  PL/S - INCLUDE MACRO FROM LIBRARY                               * 00450000
.* *          EXAMPLE - %INCLUDE SYSLIB(IFASMFI6)                     * 00500000
.* *                                                                  * 00550000
.* *          THIS MACRO EXPANDS RECORDS 36, 60, 61, 65, AND 66   @L8C* 00600000
.* *                                                                  * 00650000
.* *                                                                  * 00700000
.* THIS IS AN SMF MACRO WHICH BUILDS SMF RECORDS 36, 60, 61, 65,        00733300
.* AND 66.                                                         @L8C 00766600
.* THE REQUIRED FORMAT IS -                                             00800000
.*       IFASMFI6 &RECTYPE                                              00900000
.* $L8=ICFSMF,HDP2230,,STLKKL: SMF RECORD ON EXPORT                @L8A 00925000
.*                                                                      00927700
.*PROPRIETARY V3 STATEMENT                                              00930400
.*LICENSED MATERIALS - PROPERTY OF IBM                                  00933100
.*"RESTRICTED MATERIALS OF IBM"                                         00935800
.*5695-DF1                                                              00938500
.*(C) COPYRIGHT 1992  IBM CORP.                                         00941200
.*END PROPRIETARY V3 STATEMENT                                          00945600
.********************************************************************** 00950000
         AIF   (&RECTYPE EQ 36).IFAS036                            @L8A 00975000
         AIF   (&RECTYPE EQ 60).IFAS060                                 01000000
         AIF   (&RECTYPE EQ 61).IFAS061                                 01050000
         AIF   (&RECTYPE EQ 65).IFAS065                                 01100000
         AIF   (&RECTYPE EQ 66).IFAS066                                 01150000
.E5      ANOP                                                           01200000
         SPACE 3                                                        01250000
         MNOTE 4,'&RECTYPE INVALID RECORD TYPE SPECIFIED'               01300000
.CONTB   ANOP                                                           01350000
         MEXIT                                                          01400000
.IFAS036 ANOP                                                      @L8A 01400900
         EJECT                                                     @L8A 01401800
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 36 (EXPORT).       @L8A 01402700
* RECORD LENGTH IS 198 BYTES.                                      @L8A 01403600
         DS    0F                  ALIGN TO FULL WORD BOUNDRY      @L8A 01404500
SMFRCD36 EQU   *                   SMF RECORD 36                   @L8A 01405400
SMF36HDR EQU   *                   HEADER SEGMENT                  @L8A 01406300
SMF36LEN DS    BL2'0'              RECORD LENGTH                   @L8A 01407200
SMF36SEG DS    BL2'0'              SEGMENT DESCRIPTOR              @L8A 01408100
SMF36SYS DS    BL1'0'              HEADER FLAG BYTE                @L8A 01409000
SMF36STU EQU   X'40'               SUBTYPE UTILIZED                @L8A 01409400
SMF36RTY DS    BL1'0'              RECORD TYPE 36                  @L8A 01409900
SMF36TME DS    BL4'0'              TOD, USING FORMAT FROM TIME     @L8A 01410800
*                                  MACRO WITH BIN INTERVAL         @L8A 01411700
SMF36DTE DS    PL4'0000'           DATE IN PACKED DECIMAL FORM     @L8A 01412600
*                                  00YYDDDF (F IS THE SIGN)        @L8A 01413500
SMF36CPU DS    CL4' '              SYSTEM IDENTIFICATION           @L8A 01414400
SMF36SBS DS    CL4' '              SUBSYSTEM ID (NOT USED)         @L8A 01415300
SMF36SUB DS    CL2' '              RECORD SUBTYPE                  @L8A 01416200
*                                  '00' - EXPORT ICF CATALOG       @L8A 01417100
SMF36SLF EQU   *                   SELF-DEFINING SECTION           @L8A 01418000
SMF36NOT DS    BL2'0'              NUMBER OF TRIPLETS              @L8A 01418900
         DS    BL2'0'              RESERVED                        @L8A 01419800
SMF36POF DS    BL4'0'              OFFSET TO PRODUCT SECTION       @L8A 01420700
SMF36PLN DS    BL2'0'              LENGTH OF PRODUCT SECTION       @L8A 01421600
SMF36PNO DS    BL2'0'              NUMBER OF PRODUCT SECTIONS      @L8A 01422500
SMF36DOF DS    BL4'0'              OFFSET TO DATA SECTION          @L8A 01423400
SMF36DLN DS    BL2'0'              LENGTH OF DATA SECTION          @L8A 01424300
SMF36DNO DS    BL2'0'              NUMBER OF DATA SECTIONS         @L8A 01425200
SMF36PRD DSECT                     PRODUCT SECTION                 @L8A 01426100
SMF36PVN DS    CL2' '              PRODUCT VERSION                 @L8A 01427000
SMF36PNM DS    CL8' '              PRODUCT NAME                    @L8A 01427900
SMF36PRL DS    CL2' '              RECORD LEVEL                    @L8A 01428800
SMF36DAT DSECT                     DATA SECTION                    @L8A 01429700
SMF36JNM DS    CL8' '              JOBNAME                         @L8A 01430600
SMF36RST DS    BL4'0'              READER START TIMER (.01 SEC)    @L8A 01431500
SMF36RDT DS    PL4'0000'           READER START DATE               @L8A 01432400
SMF36UID DS    CL8' '              USER IDENTIFICATION FIELD       @L8A 01433300
SMF36PGM DS    CL8' '              PROGRAM NAME                    @L8A 01434200
SMF36CNM DS    CL44' '             ICF CATALOG NAME                @L8A 01435100
SMF36CVS DS    CL6' '              CATALOG VOLUME SERIAL           @L8A 01436000
SMF36CDT DS    CL4' '              CATALOG UCB DEVICE TYPE         @L8A 01436900
SMF36EDT DS    CL8' '              DATE OF EXPORT IN FORM MM/DD/YY @L8A 01437800
SMF36ETM DS    CL8' '              TIME OF EXPORT IN FORM HH:MM:SS @L8A 01438700
SMF36PDS DS    CL44' '             PORTABLE DATA SET NAME          @L8A 01439600
SMF36PVS DS    CL6' '              PORTABLE DATA SET VOLUME SERIAL @L8A 01440500
*                                  (FIRST/ONLY VOLUME)             @L8A 01440800
SMF36PDT DS    CL4' '              PORTABLE DATA SET UCB DEVICE    @L8A 01441100
*                                  TYPE (ASSOCIATED WITH           @L8A 01441400
*                                  FIRST/ONLY VOLUME)              @L8A 01441700
SMF36EIN DS    CL2' '              EXPORT INDICATOR                @L8A 01442300
*                                  'AE' - ALIASES WERE EXPORTED    @L8A 01443200
*                                  'NE' - NO ALIASES WERE EXPORTED @L8A 01444100
         AGO   .CONTB                                              @L8A 01446800
.IFAS060 ANOP                                                           01450000
         EJECT                                                          01500000
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 60 (VSAM VOLUME RECORD  01550000
* INSERTED, DELETED, OR UPDATED).  RECORD LENGTH IS VARIABLE.  MINIMUM  01600000
* LENGTH IS UNKNOWN.                                                    01650000
         DS    0F                  ALIGN TO FULL WORD BOUNDRY           01700000
SMFRCD60 EQU   *                   SMF RECORD 60                        01750000
SMF60HDR EQU   *                   HEADER SEGMENT                       01800000
SMF60LEN DS    BL2'0'              RECORD LENGTH                        01850000
SMF60SEG DS    BL2'0'              SEGMENT DESCRIPTOR                   01900000
SMF60SYS DS    BL1'0'              HEADER FLAG BYTE                     01950000
SMF60RTY DS    BL1'0'              RECORD TYPE 60                       02000000
SMF60TME DS    BL4'0'              TOD, USING FORMAT FROM TIME          02050000
*                                  MACRO WITH BIN INTERVAL              02100000
SMF60DTE DS    PL4'0000'           DATE IN PACKED DECIMAL FORM          02150000
*                                  00YYDDDF (F IS THE SIGN)             02200000
SMF60CPU DS    CL4' '              SYSTEM IDENTIFICATION                02250000
SMF60SBS DS    CL4' '              SUBSYSTEM ID (NOT USED)              02300000
SMF60SUB DS    CL2' '              RECORD SUBTYPE                       02350000
SMF60SLF EQU   *                   SELF-DEFINING SECTION                02400000
SMF60POF DS    BL4'0'              OFFSET TO PRODUCT SECTION            02450000
SMF60PLN DS    BL2'0'              LENGTH OF PRODUCT SECTION            02500000
SMF60PNO DS    BL2'0'              NUMBER OF PRODUCT SECTIONS           02550000
SMF60DOF DS    BL4'0'              OFFSET TO DATA SECTION               02600000
SMF60DLN DS    BL2'0'              LENGTH OF DATA SECTION               02650000
SMF60DNO DS    BL2'0'              NUMBER OF DATA SECTIONS              02700000
SMF60PRD EQU   *                   PRODUCT SECTION                      02750000
SMF60VER DS    CL2' '              PRODUCT VERSION                      02800000
SMF60PNM DS    CL8' '              PRODUCT NAME                         02850000
SMF60DAT EQU   *                   DATA SECTION                         02900000
SMF60JNM DS    CL8' '              JOBNAME                              02950000
SMF60RST DS    BL4'0'              READER START TIMER (.01 SEC)         03000000
SMF60RDT DS    PL4'0000'           READER START DATE                    03050000
SMF60UID DS    CL8' '              USER IDENTIFICATION FIELD            03100000
SMF60FNC DS    CL1' '              FUNCTION INDICATOR                   03150000
*                                  MEANING WHEN SET                     03200000
*                                  'U' - ENTRY UNCATALOGED              03250000
*                                  'S' - ENTRY UNCATALOGED & SCRATCHED  03300000
*                                  'R' - ENTRY RENAMED                  03350000
SMF60CNM DS    CL44' '             CATALOG DATA SET NAME                03400000
SMF60TYP DS    CL1' '              ENTRY TYPE                           03450000
SMF60ENM DS    CL44' '             DATA SET NAME (OLD NAME IF RENAMED)  03500000
SMF60NNM DS    CL44' '             NEW DATA SET NAME IF RENAMED         03550000
SMF60END EQU   *                   END OF SMF RECORD 60 FIXED FIELDS    03600000
SMF60CRC DS    0C                  VSAM VOLUME RECORD                   03650000
         AGO   .CONTB                                                   03700000
.IFAS061 ANOP                                                           03750000
         EJECT                                                          03800000
*  THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 61 (ICF CATALOG ENTRY  03850000
*  DEFINED). RECORD LENGTH IS VARIABLE. MINIMUM LENGTH IS UNKNOWN.      03900000
*                                                                       03950000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    04000000
SMFRCD61 EQU   *         SMF RECORD 61                                  04050000
SMF61HDR EQU   *         HEADER SEGMENT                                 04100000
SMF61LEN DS    BL2'0'    RECORD LENGTH                                  04150000
SMF61SEG DS    BL2'0'    SEGMENT DESCRIPTOR                             04200000
SMF61SYS DS    BL1'0'    HEADER FLAG BYTE                               04250000
SMF61RTY DS    BL1'0'    RECORD TYPE 61                                 04300000
SMF61TME DS    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL. 04350000
SMF61DTE DS    PL4'0000' DATE IN PACKED DECIMAL FORM: OOYYDDDF          04400000
SMF61SID DS    CL2' '    SYSTEM IDENTIFICATION                          04450000
SMF61MOD DS    CL2' '    SYSTEM MODEL IDENTIFIER                        04500000
SMF61SBS DS    CL4' '    SUBSYSTEM ID (NOT USED)                        04550000
SMF61SUB DS    CL2' '    RECORD SUBTYPE                                 04600000
SMF61SLF EQU   *         SELF-DEFINING SECTION                          04650000
SMF61POF DS    BL4'0'    OFFSET TO PRODUCT SECTION                      04700000
SMF61PLN DS    BL2'0'    LENGTH OF PRODUCT SECTION                      04750000
SMF61PNO DS    BL2'0'    NUMBER OF PRODUCT SECTIONS                     04800000
SMF61DOF DS    BL4'0'    OFFSET TO DATA SECTION                         04850000
SMF61DLN DS    BL2'0'    LENGTH OF DATA SECTION                         04900000
SMF61DNO DS    BL2'0'    NUMBER OF DATA SECTIONS                        04950000
SMF61PRD EQU   *         PRODUCT SECTION                                05000000
SMF61VER DS    CL2' '    PRODUCT VERSION                                05050000
SMF61PNM DS    CL8' '    PRODUCT NAME                                   05100000
SMF61DAT EQU   *         DATA SECTION                                   05150000
SMF61JNM DS    CL8' '    JOB NAME                                       05200000
SMF61RST DS    BL4'0'    READER START TIME (IN 100THS SECONDS)          05250000
SMF61RDT DS    PL4'0000' READER START DATE                              05300000
SMF61UID DS    CL8' '    USER IDENTIFICATION FIELD                      05350000
SMF61FNC DS    BL1'0'    FUNCTION INDICATOR (NOT USED)                  05400000
SMF61CNM DS    CL44' '   NAME OF CATALOG IN WHICH ENTRY IS DEFINED      05450000
SMF61TYP DS    BL1'0'    TYPE OF ENTRY                                  05500000
SMF61ENM DS    CL44' '   ENTRY NAME                                     05550000
SMF61NNM DS    CL44' '   NEW ENTRY NAME (NOT USED)                      05600000
SMF61END EQU   *         END SMF RECORD 61 FIXED FIELDS                 05650000
SMF61CRC DS    0C        CATALOG RECORD                                 05700000
         AGO   .CONTB                                                   05750000
.IFAS065 ANOP                                                           05800000
         EJECT                                                          05850000
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 65 (ICF CATALOG ENTRY   05900000
* DELETED).  RECORD LENGTH IS VARIABLE.  MINIMUM LENGTH IS UNKNOWN.     05950000
*                                                                       06000000
         DS    0F                   ALIGN TO FULLWORD BOUNDARY          06050000
SMFRCD65 EQU   *                    SMF RECORD 65                       06100000
SMF65HDR EQU   *                    HEADER SEGMENT                      06150000
SMF65LEN DS    BL2'0'               RECORD LENGTH                       06200000
SMF65SEG DS    BL2'0'               SEGMENT DESCRIPTOR                  06250000
SMF65SYS DS    BL1'0'               HEADER FLAG BYTE                    06300000
SMF65RTY DS    BL1'0'               RECORD TYPE 65                      06350000
SMF65TME DS    BL4'0'               TOD, USING FORMAT FROM TIME         06400000
*                                   MACRO WITH BIN INTERVAL             06450000
SMF65DTE DS    PL4'0000'            DATE IN PACKED DECIMAL FORM         06500000
*                                   00YYDDDF (F IS THE SIGN)            06550000
SMF65CPU DS    CL4' '               SYSTEM IDENTIFICATION               06600000
SMF65SBS DS    CL4' '               SUBSYSTEM ID (NOT USED)             06650000
SMF65SUB DS    CL2' '               RECORD SUBTYPE                      06700000
SMF65SLF EQU   *                    SELF-DEFINING SECTION               06750000
SMF65POF DS    BL4'0'               OFFSET TO PRODUCT SECTION           06800000
SMF65PLN DS    BL2'0'               LENGTH OF PRODUCT SECTION           06850000
SMF65PNO DS    BL2'0'               NUMBER OF PRODUCT SECTIONS          06900000
SMF65DOF DS    BL4'0'               OFFSET TO DATA SECTION              06950000
SMF65DLN DS    BL2'0'               LENGTH OF DATA SECTION              07000000
SMF65DNO DS    BL2'0'               NUMBER OF DATA SECTIONS             07050000
SMF65PRD EQU   *                    PRODUCT SECTION                     07100000
SMF65VER DS    CL2' '               PRODUCT VERSION                     07150000
SMF65PNM DS    CL8' '               PRODUCT NAME                        07200000
SMF65DAT EQU   *                    DATA SECTION                        07250000
SMF65JNM DS    CL8' '               JOBNAME                             07300000
SMF65RST DS    BL4'0'               READER START TIME (IN 100THS        07350000
*                                   SECONDS)                            07400000
SMF65RDT DS    PL4'0000'            READER START DATE                   07450000
SMF65UID DS    CL8' '               USER IDENTIFICATION FIELD           07500000
SMF65FNC DS    CL1' '               FUNCTION INDICATOR                  07550000
*                                   MEANING WHEN SET                    07600000
*                                   'U' - ENTRY UNCATALOGED             07650000
*                                   'S' - ENTRY UNCATALOGED & SCRATCHED 07700000
SMF65CNM DS    CL44' '              CATALOG NAME                        07750000
SMF65TYP DS    CL1' '               ENTRY TYPE                          07800000
SMF65ENM DS    CL44' '              ENTRY NAME                          07850000
SMF65NNM DS    CL44' '              NEW ENTRY NAME (NOT USED)           07900000
SMF65END EQU   *                    END SMF RECORD 65 FIXED FIELDS      07950000
SMF65CRC DS    0C                   CATALOG RECORD                      08000000
         AGO   .CONTB                                                   08050000
.IFAS066 ANOP                                                           08100000
         EJECT                                                          08150000
* THIS DSECT DEFINES THE FORMAT FOR RECORD TYPE 66 (ICF CATALOG ENTRY   08183300
* IS ALTERED). RECORD LENGTH IS VARIABLE. MINIMUM LENGTH IS UNKNOWN.    08216600
*                                                                       08250000
         DS    0F                                                       08300000
SMFRCD66 EQU   *         SMF RECORD 66                                  08350000
SMF66HDR EQU   *         HEADER SEGMENT                                 08400000
SMF66LEN DS    BL2'0'    RECORD LENGTH                                  08450000
SMF66SEG DS    BL2'0'    SEGMENT DESCRIPTOR                             08500000
SMF66SYS DS    BL1'0'    HEADER FLAG BYTE                               08550000
SMF66RTY DS    BL1'0'    RECORD TYPE 66                                 08600000
SMF66TME DS    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN INTERVL 08650000
SMF66DTE DS    PL4'0000' DATE IN PACKED DECIMAL FORMAT: 00YYDDDF        08700000
SMF66SID DS    CL2' '    SYSTEM IDENTIFICATION                          08750000
SMF66MOD DS    CL2' '    SYSTEM MODEL IDENTIFIER                        08800000
SMF66SBS DS    CL4' '    SUBSYSTEM ID (NOT USED)                        08850000
SMF66SUB DS    CL2' '    RECORD SUBTYPE                                 08900000
SMF66SLF EQU   *         SELF-DEFINING SECTION                          08950000
SMF66POF DS    BL4'0'    OFFSET TO PRODUCT SECTION                      09000000
SMF66PLN DS    BL2'0'    LENGTH OF PRODUCT SECTION                      09050000
SMF66PNO DS    BL2'0'    NUMBER OF PRODUCT SECTIONS                     09100000
SMF66DOF DS    BL4'0'    OFFSET TO DATA SECTION                         09150000
SMF66DLN DS    BL2'0'    LENGTH OF DATA SECTION                         09200000
SMF66DNO DS    BL2'0'    NUMBER OF DATA SECTIONS                        09250000
SMF66PRD EQU   *         PRODUCT SECTION                                09300000
SMF66VER DS    CL2' '    RECORD VERSION                                 09350000
SMF66PNM DS    CL8' '    PRODUCT NAME                                   09400000
SMF66DAT EQU   *         DATA SECTION                                   09450000
SMF66JNM DS    CL8' '    JOB NAME                                       09500000
SMF66RST DS    BL4'0'    READER START TIME (IN 100THS SECONDS)          09550000
SMF66RDT DS    PL4'0000' READER START DATE                              09600000
SMF66UID DS    CL8' '    USER IDENTIFICATION FIELD                      09650000
SMF66FNC DS    CL1' '    FUNCTION INDICATOR                             09700000
*                        MEANING WHEN SET                               09750000
*                        'R' - ENTRY RENAMED                            09800000
SMF66CNM DS    CL44' '   NAME OF CATALOG IN WHICH ENTRY WAS DEFINED     09850000
SMF66TYP DS    CL1' '    ENTRY TYPE                                     09900000
SMF66ENM DS    CL44' '   NAME OF ENTRY THAT WAS ALTERED                 09950000
SMF66NNM DS    CL44' '   NEW ENTRY NAME IF RENAMED                      10000000
SMF66END EQU   *         END SMF RECORD 66 FIXED FIELDS                 10050000
SMF66CRC DS    0C        CATALOG RECORD                                 10100000
        AGO   .CONTB                                                    10150000
         MEND            */                                             10200000
 %IFAL36: IF IFAR36='' %THEN %GOTO IFAL60;                    /* @L8A*/ 10201000
    DECLARE                                                             10202000
     1 SMFRCD36 BASED(SMF36PTR) BOUNDARY(WORD),                         10203000
     /* RECORD TYPE 36 - EXPORT ICF CATALOG WRITTEN WHENEVER            10204000
           AN ICF CATALOG IS SUCCESSFULLY EXPORTED               @L8A*/ 10205000
      2 SMF36HDR,                   /* SMF HEADER SECTION        @L8A*/ 10206000
       3 SMF36LEN FIXED(15),        /* RDW RECORD LENGTH         @L8A*/ 10207000
       3 SMF36SEG FIXED(15),        /* RDW SEGMENT DESCRIPTION   @L8A*/ 10208000
       3 SMF36SYS BIT(8),           /* OPERATING ENVIRONMENT     @L8A*/ 10209000
        4 SMF36RS0 BIT(1),          /* RESERVED                  @L8A*/ 10209200
        4 SMF36STU BIT(1),          /* SUB TYPE UTILIZED         @L8A*/ 10209400
        4 SMF36RS1 BIT(6),          /* RESERVED                  @L8A*/ 10209600
       3 SMF36RTY FIXED(8),         /* RECORD TYPE 36            @L8A*/ 10210000
       3 SMF36TME FIXED(31) BOUNDARY(BYTE), /*TIME RECORD WRITTEN@L8A*/ 10211000
       3 SMF36DTE CHARACTER(4),     /* DATE RECORD WRITTEN       @L8A*/ 10212000
       3 SMF36CPU CHARACTER(4),     /*SYSTEM ID FROM INSTALLATION@L8A*/ 10213000
        4 SMF36SID CHARACTER(2),    /*SYSTEM ID FROM INSTALLATION@L8A*/ 10214000
        4 SMF36MOD CHARACTER(2),    /* SYSTEM MODULE ID          @L8A*/ 10215000
       3 SMF36SBS CHARACTER(4),     /* SUBSYSTEM ID (NOT USED)   @L8A*/ 10216000
       3 SMF36SUB CHARACTER(2),     /* RECORD SUBTYPE            @L8A*/ 10217000
      2 SMF36SLF,                   /* SELF-DEFINING SECTION     @L8A*/ 10218000
       3 SMF36NOT FIXED(15),        /* NUMBER OF TRIPLETS        @L8A*/ 10219000
       3 *        FIXED(15),        /* RESERVED                  @L8A*/ 10220000
       3 SMF36POF POINTER(31),      /* OFFSET TO PRODUCT SECTION @L8A*/ 10221000
       3 SMF36PLN FIXED(15),        /* LENGTH OF PRODUCT SECTION @L8A*/ 10222000
       3 SMF36PNO FIXED(15),        /* NUMBER OF PRODUCT SECTIONS@L8A*/ 10223000
       3 SMF36DOF POINTER(31),      /* OFFSET TO DATA SECTION    @L8A*/ 10224000
       3 SMF36DLN FIXED(15),        /* LENGTH OF DATA SECTION    @L8A*/ 10225000
       3 SMF36DNO FIXED(15),        /* NUMBER OF DATA SECTIONS   @L8A*/ 10226000
     1 SMF36PRD BASED(SMF36PTH),    /* PRODUCT SECTION           @L8A*/ 10227000
      2 SMF36PVN CHARACTER(2),      /* PRODUCT VERSION           @L8A*/ 10228000
      2 SMF36PNM CHARACTER(8),      /* PRODUCT NAME              @L8A*/ 10229000
      2 SMF36PRL CHARACTER(2),      /* RECORD LEVEL              @L8A*/ 10230000
     1 SMF36DAT BASED(SMF36PTD),    /* DATA SECTION              @L8A*/ 10231000
      2 SMF36JNM CHARACTER(8),      /* JOB NAME                  @L8A*/ 10232000
      2 SMF36RST CHARACTER(4),      /* READER START TIME(.01 SEC @L8A*/ 10233000
      2 SMF36RDT CHARACTER(4),      /* READER START DATE         @L8A*/ 10234000
      2 SMF36UID CHARACTER(8),      /* USER ID FIELD             @L8A*/ 10235000
      2 SMF36PGM CHARACTER(8),      /* PROGRAM NAME              @L8A*/ 10236000
      2 SMF36CNM CHARACTER(44),     /* ICF CATALOG NAME          @L8A*/ 10237000
      2 SMF36CVS CHARACTER(6),      /* ICF CATALOG VOLUME SERIAL @L8A*/ 10238000
      2 SMF36CDT CHARACTER(4),      /* ICF CATALOG UCB DEVICE    @L8A*/ 10238600
                                    /* TYPE                      @L8A*/ 10239200
      2 SMF36EDT CHARACTER(8),      /* DATE OF EXPORT MM/DD/YY   @L8A*/ 10240000
      2 SMF36ETM CHARACTER(8),      /* TIME OF EXPORT HH:MM:SS   @L8A*/ 10241000
      2 SMF36PDS CHARACTER(44),     /* PORTABLE DATA SET NAME    @L8A*/ 10242000
      2 SMF36PVS CHARACTER(6),      /* PORTABLE DATA SET VOLSER  @L8A*/ 10242500
                                    /* (FIRST/ONLY VOLUME        @L8A*/ 10243000
      2 SMF36PDT CHARACTER(4),      /* PORTABLE DATA SET UCB     @L8A*/ 10243500
                                    /* DEVICE TYPE (ASSOCIATED   @L8A*/ 10244000
                                    /* WITH FIRST/ONLY VOLUME)   @L8A*/ 10244500
      2 SMF36EIN CHARACTER(2);      /* EXPORT INDICATOR          @L8A*/ 10245000
                                    /* 'AE' - ALIASES EXPORTED   @L8A*/ 10246000
                                    /* 'NE' - NO ALIASES EXPORTED@L8A*/ 10247000
 %IFAL60: IF IFAR60='' %THEN %GOTO IFAL61;                              10250000
    DECLARE                                                             10300000
      1 SMFRCD60 BASED(SMF60PTR) BOUNDARY(WORD),                        10350000
    /* RECORD TYPE 60 - VSAM VOLUME RECORD INSERTED, DELETED, OR        10400000
                        UPDATED                                         10450000
       WRITTEN WHENEVER A VSAM VOLUME RECORD INSERT, DELETE, OR         10500000
       UPDATE REQUEST IS MADE AGAINST A VSAM VOLUME DATA SET         */ 10550000
       2 SMF60HDR,                  /* SMF HEADER SECTION            */ 10600000
        3 SMF60LEN FIXED(15),       /* RDW RECORD LENGTH             */ 10650000
        3 SMF60SEG FIXED(15),       /* RDW SEGMENT DESCRIPTOR        */ 10700000
        3 SMF60SYS BIT(8),          /* OPERATING ENVIRONMENT         */ 10750000
         4 * BIT(6),                /* RESERVED                      */ 10800000
         4 SMF60VS2 BIT(1),         /* VS2                           */ 10850000
         4 SMF60VS1 BIT(1),         /* VS1                           */ 10900000
        3 SMF60RTY FIXED(8),        /* RECORD TYPE 60                */ 10950000
        3 SMF60TME FIXED(31) BOUNDARY(BYTE), /* TIME RECORD WRITTEN  */ 11000000
        3 SMF60DTE CHARACTER(4),    /* DATE RECORD WRITTEN           */ 11050000
        3 SMF60CPU CHARACTER(4),    /* SYSTEM ID FROM INSTALLATION   */ 11100000
         4 SMF60SID CHARACTER(2),   /* SYSTEM ID FROM INSTALLATION   */ 11150000
         4 SMF60MOD CHARACTER(2),   /* SYSTEM MODULE IDENTIFIER      */ 11200000
        3 SMF60SBS CHARACTER(4),    /* SUBSYSTEM ID (NOT USED)       */ 11250000
        3 SMF60SUB CHARACTER(2),    /* RECORD SUBTYPE                */ 11300000
       2 SMF60SLF,                  /* SELF-DEFINING SECTION         */ 11350000
        3 SMF60POF POINTER(31),     /* OFFSET TO PRODUCT SECTION     */ 11400000
        3 SMF60PLN FIXED(15),       /* LENGTH OF PRODUCT SECTION     */ 11450000
        3 SMF60PNO FIXED(15),       /* NUMBER OF PRODUCT SECTIONS    */ 11500000
        3 SMF60DOF POINTER(31),     /* START OF DATA SECTION         */ 11550000
        3 SMF60DLN FIXED(15),       /* LENGTH OF DATA SECTION        */ 11600000
        3 SMF60DNO FIXED(15),       /* NUMBER OF DATA SECTIONS       */ 11650000
       2 SMF60PRD,                  /* PRODUCT SECTION               */ 11700000
        3 SMF60VER CHARACTER(2),    /* RECORD VERSION                */ 11750000
        3 SMF60PNM CHARACTER(8),    /* PRODUCT NAME                  */ 11800000
       2 SMF60DAT,                  /* DATA SECTION                  */ 11850000
        3 SMF60JNM CHARACTER(8),    /* JOB NAME                      */ 11900000
        3 SMF60RST CHARACTER(4),    /* READER START TIME (.01 SEC)   */ 11950000
        3 SMF60RDT CHARACTER(4),    /* READER START DATE             */ 12000000
        3 SMF60UID CHARACTER(8),    /* USER IDENTIFICATION FIELD     */ 12050000
        3 SMF60FNC CHARACTER(1),    /* FUNCTION INDICATOR            */ 12100000
        3 SMF60CNM CHARACTER(44),   /* NAME OF CATALOG IN WHICH         12150000
                                       ENTRY IS DEFINED              */ 12200000
        3 SMF60TYP CHARACTER(1),    /* ENTRY TYPE                    */ 12250000
        3 SMF60ENM CHARACTER(44),   /* ENTRY NAME                    */ 12300000
         4 SMF60ONM CHARACTER(44),  /* OLD ENTRY NAME                */ 12350000
        3 SMF60NNM CHARACTER(44),   /* NEW ENTRY NAME                */ 12400000
       2 SMF60END CHARACTER(0);     /* END SMF RECORD FIXED FIELDS   */ 12450000
    DECLARE                                                             12500000
      SMF60CRC CHARACTER(*) DEFINED(SMF60END); /* VSAM VOLUME RECORD */ 12550000
 %IFAL61: IF IFAR61='' %THEN %GOTO IFAL65;                              12600000
    DECLARE                                                             12650000
      1 SMFRCD61 BASED(SMF61PTR) BOUNDARY(WORD),                        12700000
    /* RECORD TYPE 61 - ICF ENTRY DEFINED                               12750000
       WRITTEN WHEN AN ICF CATALOG ENTRY IS DEFINED BY THE CATALOG      12800000
       MANAGEMENT SERVICES DEFINE FUNCTION                           */ 12850000
       2 SMF61HDR,                  /* SMF HEADER SECTION            */ 12900000
        3 SMF61LEN FIXED(15),       /* RDW RECORD LENGTH             */ 12950000
        3 SMF61SEG FIXED(15),       /* RDW SEGMENT DESCRIPTOR        */ 13000000
        3 SMF61SYS BIT(8),          /* OPERATING ENVIRONMENT         */ 13050000
         4 * BIT(6),                /* RESERVED                      */ 13100000
         4 SMF61VS2 BIT(1),         /* VS2                           */ 13150000
         4 SMF61VS1 BIT(1),         /* VS1                           */ 13200000
        3 SMF61RTY FIXED(8),        /* RECORD TYPE 61                */ 13250000
        3 SMF61TME FIXED(31) BOUNDARY(BYTE), /* TIME RECORD WRITTEN  */ 13300000
        3 SMF61DTE CHARACTER(4),    /* DATE RECORD WRITTEN           */ 13350000
        3 SMF61CPU CHARACTER(4),    /* SYSTEM ID FROM INSTALLATION   */ 13400000
         4 SMF61SID CHARACTER(2),   /* SYSTEM ID FROM INSTALLATION   */ 13450000
         4 SMF61MOD CHARACTER(2),   /* SYSTEM MODULE IDENTIFIER      */ 13500000
        3 SMF61SBS CHARACTER(4),    /* SUBSYSTEM ID (NOT USED)       */ 13550000
        3 SMF61SUB CHARACTER(2),    /* RECORD SUBTYPE                */ 13600000
       2 SMF61SLF,                  /* SELF-DEFINING SECTION         */ 13650000
        3 SMF61POF POINTER(31),     /* OFFSET TO PRODUCT SECTION     */ 13700000
        3 SMF61PLN FIXED(15),       /* LENGTH OF PRODUCT SECTION     */ 13750000
        3 SMF61PNO FIXED(15),       /* NUMBER OF PRODUCT SECTIONS    */ 13800000
        3 SMF61DOF POINTER(31),     /* START OF DATA SECTION         */ 13850000
        3 SMF61DLN FIXED(15),       /* LENGTH OF DATA SECTION        */ 13900000
        3 SMF61DNO FIXED(15),       /* NUMBER OF DATA SECTIONS       */ 13950000
       2 SMF61PRD,                  /* PRODUCT SECTION               */ 14000000
        3 SMF61VER CHARACTER(2),    /* RECORD VERSION                */ 14050000
        3 SMF61PNM CHARACTER(8),    /* PRODUCT NAME                  */ 14100000
       2 SMF61DAT,                  /* DATA SECTION                  */ 14150000
        3 SMF61JNM CHARACTER(8),    /* JOB NAME                      */ 14200000
        3 SMF61RST CHARACTER(4),    /* READER START TIME (.01 SEC)   */ 14250000
        3 SMF61RDT CHARACTER(4),    /* READER START DATE             */ 14300000
        3 SMF61UID CHARACTER(8),    /* USER IDENTIFICATION FIELD     */ 14350000
        3 SMF61FNC CHARACTER(1),    /* FUNCTION INDICATOR            */ 14400000
        3 SMF61CNM CHARACTER(44),   /* NAME OF CATALOG IN WHICH         14450000
                                       ENTRY IS DEFINED              */ 14500000
        3 SMF61TYP CHARACTER(1),    /* ENTRY TYPE                    */ 14550000
        3 SMF61ENM CHARACTER(44),   /* ENTRY NAME                    */ 14600000
         4 SMF61ONM CHARACTER(44),  /* OLD ENTRY NAME                */ 14650000
        3 SMF61NNM CHARACTER(44),   /* NEW ENTRY NAME                */ 14700000
       2 SMF61END CHARACTER(0);     /* END SMF RECORD FIXED FIELDS   */ 14750000
    DECLARE                                                             14800000
      SMF61CRC CHARACTER(*) DEFINED(SMF61END); /* CATALOG RECORD     */ 14850000
 %IFAL65: IF IFAR65='' %THEN %GOTO IFAL66;                              14900000
    DECLARE                                                             14950000
      1 SMFRCD65 BASED(SMF65PTR) BOUNDARY(WORD),                        15000000
    /* RECORD TYPE 65 - ICF ENTRY DELETED                               15050000
       WRITTEN WHEN AN ICF CATALOG ENTRY IS DELETED BY THE CATALOG      15100000
       MANAGEMENT SERVICES DELETE FUNCTION                           */ 15150000
       2 SMF65HDR,                  /* SMF HEADER SECTION            */ 15200000
        3 SMF65LEN FIXED(15),       /* RDW RECORD LENGTH             */ 15250000
        3 SMF65SEG FIXED(15),       /* RDW SEGMENT DESCRIPTOR        */ 15300000
        3 SMF65SYS BIT(8),          /* OPERATING ENVIRONMENT         */ 15350000
         4 * BIT(6),                /* RESERVED                      */ 15400000
         4 SMF65VS2 BIT(1),         /* VS2                           */ 15450000
         4 SMF65VS1 BIT(1),         /* VS1                           */ 15500000
        3 SMF65RTY FIXED(8),        /* RECORD TYPE 65                */ 15550000
        3 SMF65TME FIXED(31) BOUNDARY(BYTE), /* TIME RECORD WRITTEN  */ 15600000
        3 SMF65DTE CHARACTER(4),    /* DATE RECORD WRITTEN           */ 15650000
        3 SMF65CPU CHARACTER(4),    /* SYSTEM ID FROM INSTALLATION   */ 15700000
         4 SMF65SID CHARACTER(2),   /* SYSTEM ID FROM INSTALLATION   */ 15750000
         4 SMF65MOD CHARACTER(2),   /* SYSTEM MODULE IDENTIFIER      */ 15800000
        3 SMF65SBS CHARACTER(4),    /* SUBSYSTEM ID (NOT USED)       */ 15850000
        3 SMF65SUB CHARACTER(2),    /* RECORD SUBTYPE                */ 15900000
       2 SMF65SLF,                  /* SELF-DEFINING SECTION         */ 15950000
        3 SMF65POF POINTER(31),     /* OFFSET TO PRODUCT SECTION     */ 16000000
        3 SMF65PLN FIXED(15),       /* LENGTH OF PRODUCT SECTION     */ 16050000
        3 SMF65PNO FIXED(15),       /* NUMBER OF PRODUCT SECTIONS    */ 16100000
        3 SMF65DOF POINTER(31),     /* START OF DATA SECTION         */ 16150000
        3 SMF65DLN FIXED(15),       /* LENGTH OF DATA SECTION        */ 16200000
        3 SMF65DNO FIXED(15),       /* NUMBER OF DATA SECTIONS       */ 16250000
       2 SMF65PRD,                  /* PRODUCT SECTION               */ 16300000
        3 SMF65VER CHARACTER(2),    /* RECORD VERSION                */ 16350000
        3 SMF65PNM CHARACTER(8),    /* PRODUCT NAME                  */ 16400000
       2 SMF65DAT,                  /* DATA SECTION                  */ 16450000
        3 SMF65JNM CHARACTER(8),    /* JOB NAME                      */ 16500000
        3 SMF65RST CHARACTER(4),    /* READER START TIME (.01 SEC)   */ 16550000
        3 SMF65RDT CHARACTER(4),    /* READER START DATE             */ 16600000
        3 SMF65UID CHARACTER(8),    /* USER IDENTIFICATION FIELD     */ 16650000
        3 SMF65FNC CHARACTER(1),    /* FUNCTION INDICATOR            */ 16700000
        3 SMF65CNM CHARACTER(44),   /* NAME OF CATALOG IN WHICH         16750000
                                       ENTRY IS DEFINED              */ 16800000
        3 SMF65TYP CHARACTER(1),    /* ENTRY TYPE                    */ 16850000
        3 SMF65ENM CHARACTER(44),   /* ENTRY NAME                    */ 16900000
         4 SMF65ONM CHARACTER(44),  /* OLD ENTRY NAME                */ 16950000
        3 SMF65NNM CHARACTER(44),   /* NEW ENTRY NAME                */ 17000000
       2 SMF65END CHARACTER(0);     /* END SMF RECORD FIXED FIELDS   */ 17050000
    DECLARE                                                             17100000
      SMF65CRC CHARACTER(*) DEFINED(SMF65END); /* CATALOG RECORD     */ 17150000
 %IFAL66: IF IFAR66='' %THEN %GOTO IFALR7;                    /* @L8C*/ 17200000
    DECLARE                                                             17250000
      1 SMFRCD66 BASED(SMF66PTR) BOUNDARY(WORD),                        17300000
    /* RECORD TYPE 66 - ICF ENTRY ALTERED                               17350000
       WRITTEN WHEN AN ICF CATALOG ENTRY (1) IS ALTERED WITH NEW        17400000
       SPACE ALLOCATION INFORMATION (THAT IS, WHEN THE ICF              17450000
       END-OF-VOLUME ROUTINE EXTENDS THE ENTRY'S OBJECT), OR (2) IS     17500000
       CHANGED BY THE CATALOG MANAGEMENT SERVICES ALTER FUNCTION,       17550000
       SUCH AS WHEN AN ENTRY IS RENAMED                              */ 17600000
       2 SMF66HDR,                  /* SMF HEADER SECTION            */ 17650000
        3 SMF66LEN FIXED(15),       /* RDW RECORD LENGTH             */ 17700000
        3 SMF66SEG FIXED(15),       /* RDW SEGMENT DESCRIPTOR        */ 17750000
        3 SMF66SYS BIT(8),          /* OPERATING ENVIRONMENT         */ 17800000
         4 * BIT(6),                /* RESERVED                      */ 17850000
         4 SMF66VS2 BIT(1),         /* VS2                           */ 17900000
         4 SMF66VS1 BIT(1),         /* VS1                           */ 17950000
        3 SMF66RTY FIXED(8),        /* RECORD TYPE 66                */ 18000000
        3 SMF66TME FIXED(31) BOUNDARY(BYTE), /* TIME RECORD WRITTEN  */ 18050000
        3 SMF66DTE CHARACTER(4),    /* DATE RECORD WRITTEN           */ 18100000
        3 SMF66CPU CHARACTER(4),    /* SYSTEM ID FROM INSTALLATION   */ 18150000
         4 SMF66SID CHARACTER(2),   /* SYSTEM ID FROM INSTALLATION   */ 18200000
         4 SMF66MOD CHARACTER(2),   /* SYSTEM MODULE IDENTIFIER      */ 18250000
        3 SMF66SBS CHARACTER(4),    /* SUBSYSTEM ID (NOT USED)       */ 18300000
        3 SMF66SUB CHARACTER(2),    /* RECORD SUBTYPE                */ 18350000
       2 SMF66SLF,                  /* SELF-DEFINING SECTION         */ 18400000
        3 SMF66POF POINTER(31),     /* OFFSET TO PRODUCT SECTION     */ 18450000
        3 SMF66PLN FIXED(15),       /* LENGTH OF PRODUCT SECTION     */ 18500000
        3 SMF66PNO FIXED(15),       /* NUMBER OF PRODUCT SECTIONS    */ 18550000
        3 SMF66DOF POINTER(31),     /* START OF DATA SECTION         */ 18600000
        3 SMF66DLN FIXED(15),       /* LENGTH OF DATA SECTION        */ 18650000
        3 SMF66DNO FIXED(15),       /* NUMBER OF DATA SECTIONS       */ 18700000
       2 SMF66PRD,                  /* PRODUCT SECTION               */ 18750000
        3 SMF66VER CHARACTER(2),    /* RECORD VERSION                */ 18800000
        3 SMF66PNM CHARACTER(8),    /* PRODUCT NAME                  */ 18850000
       2 SMF66DAT,                  /* DATA SECTION                  */ 18900000
        3 SMF66JNM CHARACTER(8),    /* JOB NAME                      */ 18950000
        3 SMF66RST CHARACTER(4),    /* READER START TIME (.01 SEC)   */ 19000000
        3 SMF66RDT CHARACTER(4),    /* READER START DATE             */ 19050000
        3 SMF66UID CHARACTER(8),    /* USER IDENTIFICATION FIELD     */ 19100000
        3 SMF66FNC CHARACTER(1),    /* FUNCTION INDICATOR            */ 19150000
        3 SMF66CNM CHARACTER(44),   /* NAME OF CATALOG IN WHICH         19200000
                                       ENTRY IS DEFINED              */ 19250000
        3 SMF66TYP CHARACTER(1),    /* ENTRY TYPE                    */ 19300000
        3 SMF66ENM CHARACTER(44),   /* ENTRY NAME                    */ 19350000
         4 SMF66ONM CHARACTER(44),  /* OLD ENTRY NAME                */ 19400000
        3 SMF66NNM CHARACTER(44),   /* NEW ENTRY NAME                */ 19450000
       2 SMF66END CHARACTER(0);     /* END SMF RECORD FIXED FIELDS   */ 19500000
    DECLARE                                                             19550000
      SMF66CRC CHARACTER(*) DEFINED(SMF66END); /* CATALOG RECORD     */ 19600000
 %IFALR7: ;                                                             19650000
