*         %GOTO UPCCLST1; /* BILINGUAL MAPPING                          00700000
         MACRO ,                                                        01400000
         IFAUPCC ,                                                      02100000
*                                                                       02800000
.*/      %UPCCLST1: ;                                            /* */  03500000
*/* START OF SPECIFICATIONS ******************************************/ 04200000
*/*                                                                  */ 04900000
*/* $MAC(IFAUPCC) COMP(SCURP) PROD(JBB3313):                         */ 05600000
*/*                                                                  */ 06300000
*/**** PROPRIETARY_STATEMENT *****************************************/ 07000000
*/*01* PROPRIETARY STATEMENT=                                        */ 07700000
*/*                                                                  */ 08400000
*/*  PROPRIETARY STATEMENT =                                         */ 09100000
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 09800000
*/*   THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                   */ 10500000
*/*   5655-068 (C) COPYRIGHT IBM CORP. 1994                          */ 11200000
*/*                                                                  */ 11900000
*/*  STATUS = JBB3313                                                */ 12600000
*/*                                                                  */ 13300000
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 14000000
*/*                                                                  */ 14700000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 15400000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 16100000
*/*                                                                  */ 16800000
*/*01* DESCRIPTIVE NAME: Usage Report Program Product Data           */ 17500000
*/*02*  ACRONYM: UPCC                                                */ 18200000
*/*                                                                  */ 18900000
*/*01* MACRO NAME: IFAUPCC                                           */ 19600000
*/*                                                                  */ 20300000
*/*01* DSECT NAME: UPCC                                              */ 21000000
*/*                                                                  */ 21700000
*/*01* COMPONENT:  Usage Report Program (SCURP)                      */ 22400000
*/*                                                                  */ 23100000
*/*01* EYE-CATCHER:  UPCC                                            */ 23800000
*/*02*  OFFSET:  '00'X                                               */ 24500000
*/*02*  LENGTH:  4                                                   */ 25200000
*/*                                                                  */ 25900000
*/*01* STORAGE ATTRIBUTES:                                           */ 26600000
*/*02*  SUBPOOL:  2                                                  */ 27300000
*/*02*  KEY:  8                                                      */ 28000000
*/*02*  RESIDENCY:  Virual                                           */ 28700000
*/*02*  MAIN STORAGE:  No                                            */ 29400000
*/*02*  AUXILIARY STORAGE:  Yes                                      */ 30100000
*/*02*  VIRTUAL STORAGE:  Yes                                        */ 30800000
*/*02*  DATA SPACE: No                                               */ 31500000
*/*                                                                  */ 32200000
*/*01* SIZE:  90                                                     */ 32900000
*/*                                                                  */ 33600000
*/*01* CREATED BY: IFAUARTN                                          */ 34300000
*/*                                                                  */ 35000000
*/*01* POINTED TO BY: UOCCUPCC, UPCCNEXT                             */ 35700000
*/*                                                                  */ 36400000
*/*01* SERIALIZATION: N/A                                            */ 37100000
*/*                                                                  */ 37800000
*/*01* FUNCTION: Maps info specified on PRODUCT keyword              */ 38500000
*/*              of Usage Report Program, IFAURP.                    */ 39200000
*/*                                                                  */ 39900000
*/*01* METHOD OF ACCESS: Using on Label UPCC                         */ 40600000
*/*                                                                  */ 41300000
*/*01* STATUS: JBB3313                                               */ 42000000
*/*                                                                  */ 42700000
*/*01* DELETED BY: IFAURP                                            */ 43400000
*/*                                                                  */ 44100000
*/*01* DEPENDENCIES: None                                            */ 44800000
*/*                                                                  */ 45500000
*/*01* DISTRIBUTION LIBRARY: AMACLIB                                 */ 46200000
*/*                                                                  */ 46900000
*/*01* CHANGE ACTIVITY:                                              */ 47600000
*/*                                                                  */ 48300000
*/*    $00= OW02856   JBB3313  940627  PDV1:  Usage Report Program   */ 49000000
*/*                                                                  */ 49700000
*/* END OF SPECIFICATIONS ********************************************/ 50400000
*        %GOTO UPCCPLX;                                          /*  *  51100000
UPCC     DSECT                     UPCC Mapping                         51800000
UPCCID   DS    CL4'UPCC'           UPCC eye catcher                     52500000
UPCCLEN  DS    XL2                 UPCC length                          53200000
UPCCVERS DS    XL1                 UPCC verion                          53900000
UPCCFLAG DS    BL1                 Flags                                54600000
UPCCHIST EQU   X'80'               ON=UPCC from history                 55300000
UPCCHFND EQU   X'40'               ON=Match found in history            56000000
UPCCNEXT DS    A                   Address of next UPCC                 56700000
UPCCNAME DS    CL16                Product owner name                   57400000
UPCCFUNC DS    CL8                 Product function                     58100000
UPCCSTRT DS    CL8                 Product start or testdate date      X58800000
                                     in YYYMMDD format                  59500000
UPCCSTAA DS    CL30                Product status array                 60200000
UPCCRSV3 DS    CL16                Reserved                             60900000
UPCCSTAD DSECT                     Mapping of UPCCSTAA array           X61600000
                                   Product status array - one entry    X62300000
                                     for each of last three            X63000000
                                     measurement periods                63700000
UPCCDAT  DS    XL1                 1st day of measurement period in    X64400000
                                     which START or STOP takes effect  X65100000
                                     Blank if UPCCSET=0.               X65800000
                                     Date in YYYMMDD format.            66500000
UPCCSET  DS    XL1                 0= product in neither "START"       X67200000
                                      nor "STOP" state                 X67900000
                                   1= product in "START" state         X68600000
                                   2= product in "STOP" state           69300000
UPCCRSV4 DS    XL1                 Reserved                             70000000
UPCCEND  EQU   *                   End of UPCC                          70700000
UPCCSIZE EQU   UPCCEND-UPCC        Size of UPCC                         71400000
UPCCCID  EQU   C'UPCC'             UPCC Eye catcher                     72100000
UPCC313  EQU   1                   UPCC Version - SP313                 72800000
UPCCVERC EQU   UPCC313             Current Version                      73500000
         MEND  ,                                                        74200000
.*/       %UPCCPLX: ;                                                   74900000
* DCL  1 UPCC     BASED,           /* UPCC Mapping                  */  75600000
*        3 UPCCID   CHAR(4),       /* UPCC eye catcher - 'UPCC'     */  76300000
*        3 UPCCLEN  FIXED(16),     /* UPCC length                   */  77000000
*        3 UPCCVERS FIXED(8),      /* UPCC verion                   */  77700000
*        3 UPCCFLAG BIT(8),        /* Flags                         */  78400000
*          5 UPCCHIST BIT(1),      /* ON=UPCC from history          */  79100000
*          5 UPCCHFND BIT(1),      /* ON=Match found in history     */  79800000
*          5 *        BIT(6),      /* Reserved                      */  80500000
*        3 UPCCNEXT PTR(31),       /* Address of next UPCC          */  81200000
*        3 UPCCNAME CHAR(16),      /* Product name                  */  81900000
*        3 UPCCFUNC CHAR(8),       /* Product function              */  82600000
*        3 UPCCSTRT CHAR(8),       /* Product start or testdate date    83300000
*                                     in YYYMMDD format             */  84000000
*        3 UPCCSTAA(3),            /* Product status array - one entry  84700000
*                                     for each of last three            85400000
*                                     measurement periods           */  86100000
*          5 UPCCDAT CHAR(8),      /* 1st day of measurement period     86800000
*                                     in which START or STOP takes      87500000
*                                     effect.  Blank if UPCCSET=0.      88200000
*                                     YYYMMDD format.               */  88900000
*          5 UPCCSET FIXED(8),     /* 0= product in neither "START"     89600000
*                                        nor "STOP" state               90300000
*                                     1= product in "START" state       91000000
*                                     2= product in "STOP" state    */  91700000
*          5 *       FIXED(8),     /* Reserved                      */  92400000
*        3 *        CHAR(16);      /* Reserved                      */  93100000
*                                                                       93800000
* DCL  UPCCCID    CHAR(4)  CONSTANT('UPCC'); /* Eye catcher         */  94500000
* DCL  UPCC313    FIXED(8) CONSTANT(1); /* Version Level - HBB3313  */  95200000
* DCL  UPCCVERC   FIXED(8) CONSTANT(UPCC313); /* Current version    */  95900000
