*        %GOTO SMF14PLS;  /*                                            00050000
         MACRO                                                          00100000
&NAME    IFGSMF14                                                       00150000
.********************************************************************** 00200000
.*                                                                    * 00250000
.*   MACRO NAME = IFGSMF14                                            * 00300000
.*                                                                    * 00350000
.*PROPRIETARY V3 STATEMENT                                            * 00400000
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00450000
.*"RESTRICTED MATERIALS OF IBM"                                       * 00500000
.*5694-A01                                                            * 00550000
.*(C) COPYRIGHT 1977,2000  IBM CORP.                                  * 00600000
.*END PROPRIETARY V3 STATEMENT                                        * 00650000
.*                                                                    * 00750000
.*   STATUS = OS/390 DFSMS 3.10                                       * 00800000
.*                                                                    * 00850000
.* This is the macro that includes the Assembler and PLS declarations * 00900000
.* for the SMF Type 14 and 15 Records.                                * 00950000
.*                                                                    * 01000000
.* Method of Access:                                                  * 01050000
.*   ASM - User includes Record Type on IFASMFR macro invocation      * 01100000
.*         Examples:                                                  * 01150000
.*         - IFASMFR  14                                              * 01200000
.*         - IFASMFR (...,14,...)                                     * 01250000
.*                                                                    * 01300000
.*  PL/S - User defines a macro variable IFAR14 where 14=Record type  * 01350000
.*         being requested, INCLUDEs the IFASMFR macro and declares   * 01400000
.*         the basing pointer for the record mapping.                 * 01450000
.*         Example:                                                   * 01500000
.*         - %IFAR14 = 'YES'                                          * 01550000
.*           DCL SMF14PTR PTR(31)                                     * 01600000
.*           %INCLUDE SYSLIB(IFASMFR)                                 * 01650000
.*                                                                    * 01700000
.*                                                                    * 01750000
.* CHANGE ACTIVITY =                                                  * 01800000
.*                                                                    * 01850000
.* NOTE: All record mapping changes must be forwarded to the SMF      * 01900000
.*       writer for inclusion in the SMF Manual                       * 01950000
.*                                                                    * 02000000
.* A - Define new macro for record mapping                        @00A* 02050000
.*                                                                    * 02100000
.* $00=.......,.......,......,....: DFP Record Mappings Transfer  @00A* 02150000
.* $01=OY59942,JDZ1110,921201,SJPLREB: STRIPED DATA SET SUPPORT   @01A* 02200000
.* $L1=SAMCOMP,HDZ11B0,930330,SJPLGEC: EXTENDED FORMAT DATA SET   @L1A* 02233300
.*                                     SUPPORT                    @L1A* 02266600
.* $02=OW02142,HDZ11B0,940201,SJPLGEC: CLEANUP                    @02A* 02283300
.* $03=OW05634,HDZ11B0,940603,SJPLRCW: NEW FIELD SUPPORT FOR SMF  @03A* 02288800
.*                                     TYPE 14/15 RECORDS         @03A* 02294300
.* $04=OW06898,HDZ11B0,940728,SJPLGEC: CORRECT PLS VERSION ONLY   @04A* 02297100
.* $05=OW08246,HDZ11B0,940923,SJPLRCW: REPLACE ORG STATEMENT      @05A* 02298500
.* $L2=K14XXXX,HDZ11D0,961021,SJPLGEC: STEP INFORMATION SECTION   @L2A* 02299200
.* $L3=ANSIV4,HDZ11E0,980417,SJPLGEC:  ANSI V4 CCSID SECTION and  @L3A* 02299400
.*                                     GENERAL CLEANUP            @L3A* 02299600
.* $L4=GT32K,HDZ11F0,981109,SJPLGEC: LBI LARGE BLKSIZE SUPPORT    @L4A* 02299800
.*                                                                    * 02300000
.********************************************************************** 02350000
*                                                                       02400000
* THIS RECORD WRITTEN WHEN A USER'S DATA SET IS CLOSED OR PROCESSED     02450000
* BY EOV. LENGTH IS VARIABLE, MINIMUM OF 292 BYTES.               @02C  02500000
* RECORD TYPE: 14-DATA SET OPENED FOR INPUT/RDBACK                      02550000
*              15-DATA SET OPENED FOR OUTPUT/INOUT/OUTIN/UPDAT          02600000
*                                                                       02650000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    02700000
SMF14HDR EQU   *         HEADER SEGMENT FOR RECORD TYPE 14/15           02750000
SMF14LEN DS    BL2'0'    RECORD LENGTH                                  02800000
SMF14SEG DS    BL2'0'    SEGMENT DESCRIPTOR                             02850000
SMF14FLG DS    BL1'0'    HEADER FLAG BYTE                               02900000
SMF14RTY DS    BL1'0'    RECORD TYPE 14                                 02950000
SMF14TME DS    BL4'0'    TIME OF DAY OF EOV OR CLOSE, USING TIME        02987500
*                        MACRO W/ BIN INTVL(HUNDREDTHS OF A SECOND)     03025000
SMF14DTE DS    PL4'0000' DATE OF EOV OR CLOSE,PACKED DECIMAL (00YYDDDF) 03062500
SMF14SID DS    CL4' '    SYSTEM ID                                      03100000
SMF14JBN DS    CL8' '    JOB NAME                                       03150000
SMF14RST DS    BL4'0'    READER START TIME                              03200000
SMF14RSD DS    PL4'0000' READER START DATE, PK/DEC FORM: 00YYDDDF       03250000
SMF14UID DS    CL8' '    USERID                                         03300000
SMF14RIN DS    BL2'0'    RECORD INDICATORS:                             03350000
SMF14RV0 EQU   128       RESERVED                                       03400000
SMF14EOV EQU   64        RECORD WRITTEN BY EOV                          03450000
SMF14DAD EQU   32        DASD DEVICE                                    03500000
SMF14TDS EQU   16        TEMPORARY DATA SET                             03550000
SMF14DDA EQU   8         DCBDSORG = DA                                  03600000
SMF14IS  EQU   4         DCBDSORG = IS                                  03650000
SMF14JIS EQU   2         JFCDSORG = IS                                  03700000
SMF14VIO EQU   1         VIO DATA SET ACCESS                            03750000
SMF14IPD EQU   X'80'     PDSE DATA SET                                  03800000
SMF14TRC EQU   X'40'     QSAM TRUNC MACRO HAS BEEN ISSUED FOR A PDSE    03850000
SMF14NSG EQU   X'20'     NULL SEGMENT ENCOUNTERED IN DATA SET           03900000
SMF14STR EQU   X'10'     EXTENDED SEQUENTIAL DATA SET             @01A  03937500
SMF14HBT EQU   X'08'     HIPERBATCH SECTION PRESENT               @L1A  03975000
SMF14XSG EQU   X'04'     EXTENDED INFORMATION SEGMENT PRESENT     @L1A  04000000
*        BITS 14 - 15    RESERVED                                 @L1C  04025000
SMF14SDC DS    BL1'0'    SIZE OF DCB/DEB SEGMENT                        04050000
SMF14NUC DS    BL1'0'    NO. UCB SEGMENTS                               04100000
SMF14SUC DS    BL1'0'    SIZE OF EACH UCB SEGMENT                       04150000
SMF14SET DS    BL1'0'    SIZE OF ISAM EXTENSION SEGMENT                 04200000
SMF14OPE DS    BL4'0'    TIME OF OPEN USING TIME BIN INTV.              04250000
SMFTIOT  EQU   *         TIOT SEGMENT (FROM DD ENTRY)                   04300000
SMFTIOE1 DS    BL1'0'    TIOELNGH                                       04350000
SMFTIOE2 DS    BL1'0'    TIOESSTA                                       04400000
SMFTIOE3 DS    BL1'0'    TIOEWTCT                                       04450000
SMFTIOE4 DS    BL1'0'    TIOELINK                                       04500000
SMFTIOE5 DS    CL8' '    TIOEDDNM                                       04550000
SMFTIOE6 DS    BL3'0'    TIOEJFCB                                       04600000
SMFTIOE7 DS    BL1'0'    TIOESTTC                                       04650000
*                                                                       04700000
SMFJFCB1 DS    XL176'0'  JFCB SEGMENT (ENTIRE JFCB)                     04750000
*                                                                       04800000
SMFDCBDE EQU   *         DCB/DEB SEGMENT (TAPE AND DASD)                04850000
SMFDCBOR DS    BL2'0'    DCBDSORG                                       04900000
SMFDCBRF DS    BL1'0'    DCBRECFM                                       04950000
SMFDCBMF DS    BL2'0'    DCBMACRF                                       05000000
SMFDCBFL DS    BL1'0'    DCBOFLGS                                       05050000
SMFDCBOP DS    BL1'0'    DCBOPTCD                                       05100000
SMF14RV2 DS    BL1'0'    RESERVED                                       05150000
SMFDEBFL DS    BL1'0'    DEBOFLGS                                       05200000
SMFDEBOP DS    BL1'0'    DEBOPATB                                       05250000
SMFDEBVL DS    BL2'0'    DEBVOLSQ                                       05300000
SMFTDDEX EQU   *         TAPE DCB/DEB EXTENSION                         05350000
SMFDCBBL DS    BL4'0'    DCBBLKCT                                       05400000
SMFDSSNO DS    BL6'0'    DATA SET SERIAL NUMBER                         05450000
SMF14RV3 DS    BL2'0'    RESERVED                                       05500000
SMF14OPD DS    PL4'0000' DATE OF OPEN, PACKED DECIMAL (00YYDDF)    @02M 05525000
         ORG   SMFTDDEX                                                 05550000
SMF14NTU DS    BL4'0'    NUMBER OF TRACKS USED(LAST TTR-FROM DCBFDAD)   05600000
*                        PS ORGANIZATION ONLY (TTR0)                    05650000
*                        FOR EXTENDED SEQUENTIAL DATA SETS IN FORM @01A 05700000
*                        TTTT (NUMBER OF TRACKS ACCUMULATED ACROSS @01A 05750000
*                        ALL VOLUMES.                              @01A 05800000
SMF14NTR DS    BL4'0'    NUMBER OF TRACKS RELEASED BY DADSM RELSE RTN   05850000
SMF14NER DS    BL1'0'    NUMBER OF EXTENTS RELEASED                     05900000
SMF14RV4 DS    BL3'0'    RESERVED                                       05950000
         DS    PL4'0000' SAME AS SMF14OPD. MUST STAY AT SAME       @02A 05962500
*                        RELATIVE POSITION FROM BEGINNING OF       @02A 05975000
*                        DCB/DEB EXTENSION FOR BOTH TAPE AND DASD  @02A 05987500
SMF14UCB EQU   *         UCB SEGMENT(ONE FOR EACH UCB FOR THE DATA SET) 06000000
SMFUCBDV DS    0BL2'0'   UCBCHAN  DEVICE NUMBER                         06050000
SMFUCBCH DS    BL1'0'    UCBCHA                                         06100000
SMFUCBUA DS    BL1'0'    UCBUA                                          06150000
SMFSRTEV DS    BL6'0'    SRTEVOLI                                       06200000
SMFUCBTY DS    BL4'0'    UCBTYP                                         06250000
SMFSRTES DS    BL1'0'    SRTESTAB                                       06300000
SMF14NEX DS    BL1'0'    NUMBER EXTENTS                                 06350000
SMF14RV5 DS    BL2'0'    RESERVED                                       06400000
SMFEXCP  DS    BL4'0'    EXCP COUNT SO FAR IN STEP. FOR PDSE DATA SETS  06414200
*                        THE NUMBER OF 4K BLOCKS THAT WERE READ OR      06428400
*                        WRITTEN. FOR COMPRESSED FORMAT DATA SETS THE   06442600
*                        NUMBER OF PHYSICAL BLOCKS(SEE SMF14CIS FOR     06456800
*                        THE PHYSICAL BLOCK SIZE) THAT WERE READ OR     06471000
*                        WRITTEN.                                       06485200
SMFTAPEX EQU   *         SMF TAPE EXTENSION                             06500000
*        THIS SECTION DESCRIBES THE UCB TAPE EXTENSION SEGMENT          06550000
SMFSRTEF DS    BL2'0'    SRTEFSCT                                       06600000
SMFSRTEQ DS    BL2'0'    SRTEFSEQ                                       06650000
         ORG   SMFTAPEX                                                 06700000
*        THIS SECTION DESCRIBES THE UCB DASD EXTENSION SEGMENT          06750000
SMF14NTA DS    BL4'0'    NUMBER TRACKS ALLOCATED                        06800000
SMF14UCE EQU   *         UCB SEGMENT END                                06850000
*        THIS SECTION DESCRIBES THE DASD INFO ACQUIRED FROM             06900000
*        HIPERSPACE CACHING VIA THE DATA LOOKASIDE FACILITY (DLF)       06950000
SMFHBTCH EQU   *         HIPERBATCH INFORMATION                         07000000
SMFIOREQ DS    BL4'0'    NUMBER OF IO REQUESTS ISSUED                   07050000
SMFCHITS DS    BL4'0'    NUMBER OF CACHE HITS                           07100000
SMFNMWTS DS    BL4'0'    NUMBER OF WAITS                                07150000
SMFPHIOS DS    BL4'0'    NUMBER OF PHYSICAL IO REQUESTS                 07200000
SMFCIOS  DS    BL4'0'    NUMBER OF CACHED IO REQUESTS                   07250000
SMFHBEND EQU   *         END OF HIPERBATCH INFORMATION                  07300000
*                                                                       07304100
         ORG   SMF14UCB                                                 07350000
*                                                                       07400000
SMFISAMX EQU   *         ISAM EXTENSION SEG.(FOR DCBDSORG = IS)         07450000
SMF14RV6 DS    BL2'0'    RESERVED                                       07500000
SMFDCBMA DS    BL1'0'    DCBMAC                                         07550000
SMFDCBNL DS    BL1'0'    DCBNLEV                                        07600000
SMFDCBR3 DS    BL4'0'    DCBRORG3                                       07650000
SMFDCBNR DS    BL4'0'    DCBNREC                                        07700000
SMFDCBR2 DS    BL2'0'    DCBRORG2                                       07750000
SMFDCBNO DS    BL2'0'    DCBNOREC                                       07800000
SMFDCBR1 DS    BL2'0'    DCBRORG1                                       07850000
SMF14RV7 DS    BL1'0'    RESERVED                                       07900000
SMFDEBNI DS    BL1'0'    DEBNIEE                                        07950000
SMFDEBNP DS    BL1'0'    DEBNPEE                                        08000000
SMFDEBNO DS    BL1'0'    DEBNOEE                                        08050000
SMFNCYLS DS    BL2'0'    # CYL'S IN INDEPENDENT INDEX AREA              08100000
SMFNPCYL DS    BL2'0'    NUMBER OF CYL'S IN PRIME AREA                  08150000
SMFNOCYL DS    BL2'0'    NUMBER OF CYL'S IN INDEPENDENT OVFL AREA       08200000
         ORG   SMFISAMX                                            @05A 08201100
*                                                                       08202300
*        THIS SECTION DESCRIBES THE EXTENDED INFORMATION SEGMENT.  @L1A 08204600
*        THE EXTENDED INFORMATION SEGMENT CONTAINS A HALFWORD      @L1A 08206900
*        SEGMENT LENGTH FIELD WHICH IS THE LENGTH OF ALL SECTIONS  @L1A 08209200
*        THAT ARE CONTAINED IN IT. EACH SECTION CONTAINS A         @L1A 08212200
*        HALFWORD SECTION LENGTH FIELD, A SECTION TYPE CODE,       @L1A 08215200
*        AND THEN VARIABLE LENGTH INFORMATION DEPENDING UPON       @L1A 08218200
*        THE SECTION TYPE.                                         @05C 08222900
*                                                                       08227600
SMF14XIS EQU   *         EXTENDED INFORMATION SEGMENT              @L1A 08229900
SMF14SXS DS    HL2'0'    SIZE OF EXTENDED INFO SEGMENT(ALL SECTIONS@L1A 08232200
*                        INCLUDING THIS LENGTH FIELD)              @L1A 08234500
*                                                                       08234600
*        EACH SECTION WITHIN THE EXTENDED INFORMATION SEGMENT      @L1A 08234700
*        BEGINS WITH THE FOLLOWING FOUR BYTES.                     @L1A 08234800
*                                                                       08234900
SMF14XIC EQU   *         EXTENDED INFO SECTION CONTROL DATA        @L1A 08235000
SMF14ESL DS    HL2'0'    LENGTH OF SECTION IN EXTENDED INFORMATION @L1A 08235100
*                        SEGMENT(INCLUDING THESE FOUR BYTES)       @L1A 08235200
         DS    HL1'0'    RESERVED                                  @L1A 08235300
SMF14STY DS    HL1'0'    SECTION TYPE                              @L1A 08235400
SMF14XDS EQU   1         COMPRESSED FORMAT D/S TYPE CODE IS 1      @02C 08235500
SMF14SMS EQU   2         SMS CLASS INFORMATION TYPE CODE IS 2      @03A 08235800
SMF14STP EQU   3         STEP INFORMATION TYPE CODE IS 3           @L2A 08235900
SMF14AV4 EQU   4         ANSI VERSION 4 CCSID TYPE CODE IS 4       @L3A 08236000
SMF14ADC EQU   5         ADDTIONAL DATA SET CHARACTERISTICS TYPE   @L4A 08236100
*                         CODE IS 5                                @L4A 08236200
SMF14COM EQU   *         COMMON CONTINUATION OF SECTION IN         @L1A 08236300
*                        EXTENDED INFORMATION SEGMENT.             @L1A 08236400
*                                                                       08236800
*        THIS DESCRIBES THE COMPRESSED FORMAT DATA SET SECTION OF  @02C 08239500
*        EXTENDED INFORMATION SEGMENT. THE COMPRESSED FORMAT DATA  @02C 08242200
*        SET SECTION HAS A TYPE CODE OF 1. IT CONTAINS INFORMATION @02C 08244900
*        CONCERNING COMPRESSED FORMAT DATA SETS.                   @02C 08247600
*                                                                       08250600
SMF14CSB EQU   *         COMPRESSED FORMAT DATA SET SECTION        @02C 08254400
SMF14XF1 DS    BL1'0'    EXTENDED SEGMENT INDICATOR FLAG BYTE 1    @L1A 08258200
SMF14LBD EQU   X'80'     COMPRESSED FORMAT DATA SET SIZE VALUES    @02C 08262000
*                        (SMF14CDS AND SMF14UDS) ARE INVALID       @L1A 08265800
SMF14CRJ EQU   X'40'     COMPRESSION OF THIS DATA SET HAS BEEN     @L1A 08269600
*                        REJECTED                                  @L1A 08273600
*        BITS  2-7       RESERVED                                  @L1A 08274600
SMF14XF2 DS    BL1'0'    EXTENDED SEGMENT INDICATOR FLAG BYTE 2    @L1A 08275600
*        BITS  0-7       RESERVED                                  @L1A 08276600
SMF14CDL DS    BL8'0'    NUMBER OF BYTES OF COMPRESSED DATA READ   @L1A 08277600
*                        OR WRITTEN SINCE THIS OPEN                @L1A 08278600
SMF14UDL DS    BL8'0'    NUMBER OF BYTES OF DATA READ OR WRITTEN   @L1A 08279600
*                        SINCE THIS OPEN(DATA LENGTH PRIOR TO      @L1A 08280600
*                        COMPRESSION)                              @L1A 08281600
SMF14CDS DS    BL8'0'    COMPRESSED FORMAT DATA SET SIZE TO THIS   @02C 08282600
*                        POINT-NUMBER OF COMPRESSED USER DATA BYTES@L1A 08283600
SMF14UDS DS    BL8'0'    COMPRESSED FORMAT DATA SET SIZE TO THIS   @02C 08284600
*                        POINT-NUMBER OF UNCOMPRESSED USER DATA    @L1A 08285600
*                        BYTES                                     @L1A 08286600
SMF14CIS DS    BL4'0'    PHYSICAL BLOCK SIZE OF COMPRESSED FORMAT  @02C 08287600
*                        DATA SET                                  @L1A 08288600
SMF14TKL DS    HL2'0'    DICTIONARY TOKEN LENGTH(NOT INCLUDING     @L1A 08289600
*                        THIS LENGTH FIELD)                        @L1A 08290600
SMF14T36 EQU   36        CURRENTLY TOKEN LENGTH IS 36 ONLY         @L1A 08292000
SMF14TKN DS    BL36'0'   DICTIONARY TOKEN FOR COMPRESSED FORMAT    @02C 08294000
*                        DATA SET                                  @L1A 08296000
SMF14CSE EQU   *         END OF COMPRESSED FORMAT DATA SET SECTION @02C 08298000
         ORG   SMF14COM                                            @L3A 08298300
*                                                                  @03A 08298600
*              THIS DESCRIBES THE SMS CLASS INFORMATION SECTION OF @03A 08298900
*              THE EXTENDED INFORMATION SEGMENT. THE SMS CLASS     @03A 08299200
*              INFORMATION HAS A TYPE CODE OF 2. IT CONTAINS THE   @03A 08299500
*              FIELDS USED TO STORE THE DATA, STORAGE, AND         @03A 08299800
*              MANAGEMENT CLASS RETURNED FROM THE CASF CALL.       @03A 08300100
*                                                                  @03A 08300400
SMF14SCI EQU   *         SMS CLASS INFORMATION SECTION             @03A 08300700
SMF14MCN DS    CL8' '    SMS MANAGEMENT CLASS NAME                 @03A 08301000
SMF14DCN DS    CL8' '    SMS DATA CLASS NAME                       @03A 08301300
SMF14SCN DS    CL8' '    SMS STORAGE CLASS NAME                    @03A 08301600
SMF14SCE EQU   *                                                   @03A 08301900
         ORG   SMF14COM                                            @L3A 08302200
*                                                                  @L2A 08303400
*              THIS DESCRIBES THE STEP INFORMATION SECTION OF THE  @L2A 08307600
*              EXTENDED INFORMATION SEGMENT. THE JOB INFORMATION   @L2A 08311800
*              HAS A TYPE CODE OF 3. IT CONTAINS THE STEP NAME     @L2A 08316000
*              AND ACTIVE PROGRAM NAME OF THE JOB.                 @L2A 08320200
*                                                                  @L2A 08324400
SMF14SPI EQU   *         STEP INFORMATION SECTION                  @L2A 08328600
SMF14SPN DS    CL8' '    STEP NAME                                 @L2A 08332800
SMF14PGN DS    CL8' '    ACTIVE PROGRAM NAME                       @L2A 08337000
SMF14SPE EQU   *         END OF STEP INFORMATION SECTION           @L2A 08341200
         ORG   SMF14COM                                            @L3A 08341300
*                                                                  @L3A 08341400
*              THIS DESCRIBES THE ANSI VERSION 4 CCSID INFORMATION @L3A 08341600
*              SECTION OF THE EXTENDED INFORMATION SEGMENT.        @L3A 08341800
*              THE CCSID INFORMATION  HAS A TYPE OF 4. IT CONTAINS @L3A 08342000
*              THE CCSID BEING USED BY THE APPLICATION, THE        @L3A 08342200
*              CCSID BEING USED TO PROCESS THE VERSION 4 TAPE      @L3A 08342400
*              AND THE CCSID SPECIFIED IN THE TAPE LABELS IF       @L3A 08342600
*              THIS IS EITHER AN IBM VERSION 4 TAPE BEING READ OR  @L3A 08342700
*              AN IBM VERSION 4 TAPE BEING WRITTEN TO WITH         @L3A 08342800
*              DISP=MOD SPECIFIED. THERE ARE ALSO FLAGS DEFINED    @L3A 08342900
*              TO INDICATE WHETHER THE SOURCE OR TARGET CCSID      @L3A 08343000
*              WERE DEFAULTED AND WHETHER THE CCSID SPECIFIED ON   @L3A 08343100
*              THE DD STATEMENT WAS IGNORED.                       @L3A 08343200
*                                                                  @L3A 08343300
SMF14A4I EQU   *         ANSI VERSION 4 CCSID INFORMATION SECTION  @L3A 08343400
SMF14CFG DS    BL1'0'    CCSID FLAGS                               @L3A 08343500
SMF14IBM EQU   X'80'     IBM VERSION 4 CREATED TAPE                @L3A 08343600
SMF14OUT EQU   X'40'     OPENED FOR OUTPUT NOT DISP=MOD            @L3A 08343700
SMF14MOD EQU   X'20'     OPENED FOR OUTPUT DISP=MOD                @L3A 08343800
SMF14UDF EQU   X'10'     USR CCSID DEFAULTED                       @L3A 08343900
SMF14TDF EQU   X'08'     TAPE CCSID DEFAULTED                      @L3A 08344000
SMF14IGN EQU   X'04'     TAPE CCSID WAS IGNORED                    @L3A 08344100
SMF14USR DS    BL4'0'    CCSID BEING USED BY APPLICATION(SPECIFIED @L3A 08344200
*                          ON JOB/EXEC STATEMENT OR DEFAULTED)     @L3A 08344300
SMF14TPE DS    BL4'0'    CCSID BEING USED TO PROCESS TAPE(SPECIFIED@L3A 08344400
*                          ON DD STATEMENT OR IN TAPE LABEL)       @L3A 08344500
SMF14LBL DS    BL4'0'    CCSID SPECIFIED IN THE TAPE LABELS OF AN  @L3A 08344600
*                          EXISTING TAPE                           @L3A 08344700
SMF14A4E EQU   *         END OF ANSI V4 CCSID INFORMATION SECTION  @L3A 08344800
         ORG   SMF14COM                                            @L4A 08345000
*                                                                  @L4A 08345200
*              THIS DESCRIBES THE ADDITIONAL DATA SET              @L4A 08345400
*              CHARACTERISTICS SECTION OF THE EXTENDED INFORMATION @L4A 08345600
*              SEGMENT. THIS SECTION HAS A TYPE OF 5. IT CONTAINS  @L4A 08345800
*              ADDITIONAL DATA SET CHARACTERISTICS INFORMATION.    @L4A 08346000
*              CURRENTLY THE ONLY ADDITIONAL INFORMATION IT HAS    @L4A 08346200
*              IS THE BLOCK SIZE IF IT IS A LARGE BLKSIZE VALUE    @L4A 08346400
*              OR IF EXCP IS BEING USED AND THE BLKSIZE WAS        @L4A 08346600
*              SPECIFIED IN THE DCBE.                              @L4A 08346800
*                                                                  @L4A 08347000
SMF14ADI EQU   *         ADDITIONAL D/S CHARACTERISTICS SECTION    @L4A 08347200
SMF14BFG DS    BL2'0'    ADC FLAGS(DEFINES INFORMATION PRESENT)    @L4A 08347400
SMF14BLK EQU   X'80'     BLOCK SIZE PRESENT                        @L4A 08347600
*        BIT   1-15      RESERVED                                  @L4A 08347800
SMF14LBS DS    BL8'0'    BLOCK SIZE VALUE                          @L4A 08348000
         DS    BL12'0'   RESERVED                                  @L4A 08348200
SMF14ADE EQU   *         END OF ADC SECTION                        @L4A 08348400
         MEND                                                           08348600
         MEXIT            */                                            08350000
 %SMF14PLS: ;                                                           08400000
                                                                        08450000
    DCL 1 SMFRCD14 BASED(SMF14PTR) BDY(WORD),                           08500000
                                                                        08550000
 /* RECORD TYPE 14 AND 15 - DATA SET CLOSED OR END-OF-VOLUME         */ 08600000
 /* WRITTEN WHEN A USER'S DATA SET IS CLOSED OR PROCESSED BY EOV     */ 08650000
 /* TYPE 14 IF DATA SET WAS OPENED FOR INPUT OR RDBACK               */ 08700000
 /* TYPE 15 IF DATA SET WAS OPENED FOR OUTPUT/INOUT/OUTIN/UPDATE     */ 08750000
                                                                        08800000
         3 SMF14LEN FIXED(15),    /* RDW RECORD LENGTH               */ 08850000
         3 SMF14SEG FIXED(15),    /* RDW SEGMENT DESCRIPTOR          */ 08900000
         3 SMF14FLG BIT(8),       /* OPERATING ENVIRONMENT           */ 08950000
         3 SMF14RTY FIXED(8),     /* RECORD TYPE 14 OR 15            */ 09000000
         3 SMF14TME FIXED(31) BDY(HWORD), /* TOD RECORD WRITTEN      */ 09050000
         3 SMF14DTE CHAR(4),      /* DATE RECORD WRITTEN             */ 09100000
         3 SMF14SID CHAR(4),      /* SYSTEM ID FROM INSTALLATION     */ 09150000
         3 SMF14JBN CHAR(8),      /* JOB NAME                        */ 09200000
         3 SMF14RST FIXED(31) BDY(HWORD), /*READER START TIME(.01 SEC)*/09250000
         3 SMF14RSD CHAR(4),      /* READER START DATE               */ 09300000
         3 SMF14UIF CHAR(8),      /* USER IDENTIFICATION FIELD       */ 09350000
          5 SMF14UID CHAR(8),                                           09400000
         3 SMF14RIN BIT(16),      /* RECORD INDICATORS               */ 09450000
          5 SMF14RV0 BIT(1),      /* RESV                            */ 09500000
          5 SMF14EOV BIT(1),      /* RECORD WRITTEN BY EOV           */ 09550000
          5 SMF14DAD BIT(1),      /* DASD DEVICE                     */ 09600000
          5 SMF14TDS BIT(1),      /* TEMPORARY DATA SET              */ 09650000
          5 SMF14DDA BIT(1),      /* DCBDSORG = DA                   */ 09700000
          5 SMF14IS  BIT(1),      /* DCBDSORG = IS                   */ 09750000
          5 SMF14JIS BIT(1),      /* JFCDSORG = IS                   */ 09800000
          5 SMF14VIO BIT(1),      /* VIO DATA SET                    */ 09850000
          5 SMF14IPD BIT(1),      /* PDSE DATA SET                   */ 09900000
          5 SMF14TRC BIT(1),      /* QSAM TRUNC MACRO HAS BEEN ISSUED   09933300
                                     FOR PDSE                        */ 09966600
          5 SMF14NSG BIT(1),      /* NULL SEGEMENT ENCOUNTED         */ 10000000
          5 SMF14STR BIT(1),      /* EXTENDED SEQUENTIAL DATA SET@01A*/ 10050000
          5 SMF14HBT BIT(1),      /* HIPERBATCH SECTION PRESENT  @L1A*/ 10116600
          5 SMF14XSG BIT(1),      /* EXTENDED INFORMATION SEGMENT       10133200
                                     PRESENT                     @L1A*/ 10149800
          5 * BIT(2),             /* RESERVED                    @L1C*/ 10174900
         3 SMF14SDC FIXED(8),     /* SIZE OF DCB/DEB SEGMENT         */ 10200000
         3 SMF14NUC FIXED(8),     /* # OF UCB SEGMENTS               */ 10250000
         3 SMF14SUC FIXED(8),     /* SIZE OF EACH UCB SEGMENT        */ 10300000
         3 SMF14SET FIXED(8),     /* SIZE OF ISAM EXTENSION SEGMENT  */ 10350000
         3 SMF14OPE FIXED(31),    /*TIME OF OPEN                     */ 10400000
         3 SMFTIOT CHAR(16),      /* TIOT SEGMENT FROM DD ENTRY      */ 10450000
          5 SMFTIOE1 FIXED(8),    /* TIOELNGH                        */ 10500000
          5 SMFTIOE2 FIXED(8),    /* TIOESSTA                        */ 10550000
          5 SMFTIOE3 FIXED(8),    /* TIOEWTCT                        */ 10600000
          5 SMFTIOE4 FIXED(8),    /* TIOELINK                        */ 10650000
          5 SMFTIOE5 CHAR(8),     /* TIOEDDNM                        */ 10700000
          5 SMFTIOE6 CHAR(3),     /* TIOEJFCB                        */ 10750000
          5 SMFTIOE7 CHAR(1),     /* TIOESTTC                        */ 10800000
         3 SMFJFCB1 CHAR(176),    /* JFCB SEGMENT (ENTIRE JFCB)      */ 10850000
         3 SMFDCBDE CHAR(28) BDY(WORD), /* DCB/DEB SGMT (TAPE/DASD)     10883300
                                                                 @04C*/ 10916600
          5 SMFDCBOR CHAR(2),     /* DCBDSORG                        */ 10950000
          5 SMFDCBRF CHAR(1),     /* DCBRECFM                        */ 11000000
          5 SMFDCBMF CHAR(2),     /* DCBMACRF                        */ 11050000
          5 SMFDCBFL CHAR(1),     /* DCBOFLGS                        */ 11100000
          5 SMFDCBOP CHAR(1),     /* DCBOPTCD                        */ 11150000
          5 SMF14RV2 CHAR(1),     /* RESV                            */ 11200000
          5 SMFDEBFL CHAR(1),     /* DEBOFLGS                        */ 11250000
          5 SMFDEBOP CHAR(1),     /* DEBOPATB                        */ 11300000
          5 SMFDEBVL FIXED(15),   /* DEBVOLSQ                        */ 11350000
          5 * CHAR(16) BDY(WORD),        /*                      @02A*/ 11400000
           7 SMFTDDEX CHAR(0) BDY(WORD),  /* TAPE DCB/DEB EXTENSION  */ 11450000
            9 SMFDCBBL FIXED(31),  /* DCBBLKCT                       */ 11500000
            9 SMFDSSNO CHAR(6),   /* DATA SET SERIAL NUMBER          */ 11550000
            9 SMF14RV3 CHAR(2),   /* RESV                            */ 11600000
            9 SMF14OPD CHAR(4),   /* DATE DATA SET OPENED        @02A*/ 11633300
           7 SMFDDDEX CHAR(16) BDY(WORD),/* DASD DCB/DEB XTENSION@02A*/ 11666600
            9 SMF14NTU FIXED(31),  /*TRACKS USED, HIGHEST TTR           11700000
                                    PS ONLY (TTR0). FOR EXTENDED        11750000
                                    SEQUENTIAL DATA SETS - IN FORM OF   11800000
                                    TTTT (NUMBER OF TRACKS ACCUMULATED  11850000
                                    ACROSS ALL VOLUMES)          @01A*/ 11900000
            9 SMF14NTR FIXED(31),  /* TRACKS RELEASED. FOR EXTENDED     11950000
                                    SEQUENTIAL DATA SETS, ACCUMULATES   12000000
                                    TRACKS RELEASED ACROSS ALL VOLUMES. 12050000
                                    HAS LIMIT OF X'00FFFFFF'     @01A*/ 12100000
            9 SMF14NER FIXED(8),  /* EXTENTS RELEASED. FOR EXTENDED     12150000
                                    SEQUENTIAL DATA SETS, ACCUMULATED   12200000
                                    ACROSS ALL VOLUMES. HAS LIMIT OF    12250000
                                    X'FF'.                       @01A*/ 12300000
            9 SMF14RV4 CHAR(3),   /* RESV                        @L1C*/ 12333300
            9 *        CHAR(4);   /* DATE DATA SET OPENED-SEE SMF14OPD- 12344400
                                     THIS FIELD MUST STAY AT THE SAME   12355500
                                     RELATIVE POSITION FROM THE START   12366600
                                     OF DCB/DEB EXTENSION SECTION FOR   12377700
                                     BOTH TAPE AND DASD           @02C*/12388800
                                                                        12400000
    DCL 1 SMF14UCB BASED BDY(HWORD), /* UCB SEGMENT, ONE FOR EACH UCB*/ 12450000
         3 SMFUCBDV CHAR(2),      /* UCBCHAN                         */ 12500000
            5 SMFUCBCH CHAR(1),   /*                                 */ 12550000
            5 SMFUCBUA CHAR(1),   /*                                 */ 12600000
         3 SMFSRTEV CHAR(6),      /* SRTEVOLI                        */ 12650000
         3 SMFUCBTY CHAR(4),      /* UCBTYP                          */ 12700000
         3 SMFSRTES CHAR(1),      /* SRTESTAB                        */ 12750000
         3 SMF14NEX FIXED(8),     /* # OF EXTENTS                    */ 12800000
         3 SMF14RV5 CHAR(2),      /* RESV                            */ 12850000
         3 SMFEXCP FIXED(31) BDY(HWORD), /* EXCP COUNT               */ 12900000
         3 SMFTAPEX CHAR(0),      /* SMF TAPE EXTENSION              */ 12950000
          5 SMFSRTEF CHAR(2),     /* SRTEFSCT                        */ 13000000
          5 SMFSRTEQ CHAR(2),     /* SRTEFSEQ                        */ 13050000
         3 SMF14NTA FIXED(31) BDY(HWORD); /* DASD EXT, # TRACKS ALLOC */13100000
                                                                        13150000
    DCL 1 SMFHBTCH BASED BDY(HWORD), /* HIPERBATCH INFORMATION       */ 13200000
         3 SMFIOREQ FIXED(31) BDY(HWORD), /* NUMBER OF IO REQUESTS      13250000
                                               ISSUED                */ 13300000
         3 SMFCHITS FIXED(31) BDY(HWORD), /* NUMBER OF CACHE HITS       13350000
                                                                     */ 13400000
         3 SMFNMWTS FIXED(31) BDY(HWORD), /* NUMBER OF WAITS            13450000
                                                                     */ 13500000
         3 SMFPHIOS FIXED(31) BDY(HWORD), /* NUMBER OF PHYSICAL IO      13550000
                                               REQUESTS              */ 13600000
         3 SMFCIOS  FIXED(31) BDY(HWORD); /* NUMBER OF CACHED IO        13650000
                                               REQUESTS              */ 13700000
                                                                        13750000
    DCL 1 SMFISAMX BASED BDY(HWORD), /* ISAM EXTENSION               */ 13800000
         3 SMF14RV6 CHAR(2),      /* RESV                            */ 13850000
         3 SMFDCBMA CHAR(1),      /* DCBMAC                          */ 13900000
         3 SMFDCBNL FIXED(8),     /* DCBNLEV                         */ 13950000
         3 SMFDCBR3 CHAR(4),      /* DCBRORG3                        */ 14000000
         3 SMFDCBNR FIXED(31) BDY(HWORD), /* DCBNREC                 */ 14050000
         3 SMFDCBR2 CHAR(2),      /* DCBRORG2                        */ 14100000
         3 SMFDCBNO FIXED(15),    /* DCBNOREC                        */ 14150000
         3 SMFDCBR1 CHAR(2),      /* DCBRORG1                        */ 14200000
         3 SMF14RV7 CHAR(1),      /* RESV                            */ 14250000
         3 SMFDEBNI CHAR(1),      /* DEBNIEE                         */ 14300000
         3 SMFDEBNP CHAR(1),      /* DEBNPEE                         */ 14350000
         3 SMFDEBNO CHAR(1),      /* DEBNOEE                         */ 14400000
         3 SMFNCYLS FIXED(15),    /* # CYLS IN INDEPENDENT INDEX AREA*/ 14450000
         3 SMFNPCYL FIXED(15),    /* 14 CYLS IN PRIME AREA           */ 14500000
         3 SMFNOCYL FIXED(15);    /* # CYLS IN INDEPENDENT OVFL AREA */ 14550000
                                                                        14600000
    DCL 1 SMF14XIS BASED BDY(HWORD), /* EXTENDED INFORMATION            14650000
                                        SEGMENT                  @L1A*/ 14700000
          3 SMF14SXS FIXED(15); /* SIZE OF XTNDED INFO SEGMENT -        14712500
                                   INCLUDING ALL SECTIONS        @L1A*/ 14725000
    DCL 1 SMF14XIC CHAR(4) BASED BDY(HWORD), /* COMMON EXTENDED INFO    14737500
                                   SECTION CONTROL DATA          @L1A*/ 14750000
          3 SMF14ESL FIXED(15), /* SECTION LENGTH                @L1A*/ 14762500
          3 *        FIXED(8),  /* RESERVED                      @L1A*/ 14775000
          3 SMF14STY FIXED(8);  /* SECTION TYPE                  @L1A*/ 14787500
                                                                        14800000
    DCL 1 SMF14CSB DEFINED(SMF14XIC) POSITION(5) BDY(HWORD), /*         14837500
                                  COMPRESSED FORMAT DATA SET            14875000
                                  SECTION                        @L3C*/ 14912500
         3 SMF14XF1 BIT(8),    /* EXTENDED SEGMENT INDICATOR FLAGS-     14950000
                                  BYTE 1                         @L1A*/ 15000000
           5 SMF14LBD BIT(1),  /* COMPRESSED FORMAT DATA SET DATA       15050000
                                  LENGTH VALUES ARE INVALID      @02C*/ 15100000
           5 SMF14CRJ BIT(1),  /* COMPRESSION OF THIS DATA SET HAS      15300000
                                  BEEN REJECTED                  @L1A*/ 15350000
           5 *        BIT(6),  /* RESERVED                       @L1A*/ 15368700
         3 SMF14XF2 BIT(8),    /* EXTENDED SEGMENT INDICATOR FLAGS-     15387400
                                  BYTE 1                         @L1A*/ 15406100
           5 *        BIT(8),  /* RESERVED                       @L1A*/ 15424800
         3 SMF14CDL CHAR(8), /* NUMBER OF BYTES OF COMPRESSED DATA      15443500
                                READ OR WRITTEN SINCE THIS OPEN  @L1A*/ 15462200
         3 SMF14UDL CHAR(8), /* NUMBER OF BYTES OF DATA READ OR WRITTEN 15480900
                                SINCE THIS OPEN(DATA LENGTH PRIOR TO    15499600
                                COMPRESSION)                     @L1A*/ 15518300
         3 SMF14CDS CHAR(8), /* SIZE OF COMPRESSED FORMAT DATA SET TO   15537100
                                THIS POINT-NUMBER OF COMPRESSED USER    15555900
                                DATA BYTES                       @02C*/ 15574700
         3 SMF14UDS CHAR(8), /* SIZE OF COMPRESSED FORMAT DATA SET TO   15593500
                                THIS POINT-NUMBER OF UNCOMPRESSED USER  15612300
                                DATA BYTES                       @02C*/ 15631100
         3 SMF14CIS FIXED(31) BDY(BYTE), /* PHYSICAL BLOCK SIZE OF      15650000
                                  COMPRESSED FORMAT DATA SET      @02C*/15700000
         3 SMF14TKL FIXED(15) BDY(BYTE), /* DICTIONARY TOKEN LENGTH     15750000
                                 (CURRENTLY IT IS 36 ONLY)       @L1A*/ 15800000
         3 SMF14TKN CHAR(36); /* DICTIONARY TOKEN FOR COMPRESSED FORMAT 15850000
                                 DATA SET                        @02C*/ 15900000
    DCL 1 SMF14SCI DEFINED(SMF14XIC) POSITION(5) BDY(HWORD), /*         15950000
                                  SMS CLASS INFORMATION SECTION  @L3C*/ 16000000
         3 SMF14MCN CHAR(8),  /* MANAGEMENT CLASS NAME           @03A*/ 16050000
         3 SMF14DCN CHAR(8),  /* DATA CLASS NAME                 @03A*/ 16100000
         3 SMF14SCN CHAR(8);  /* STORAGE CLASS NAME              @03A*/ 16150000
    DCL 1 SMF14SPI DEFINED(SMF14XIC) POSITION(5) BDY(HWORD), /*         16183300
                                  STEP INFORMATION SECTION       @L3C*/ 16216600
         3 SMF14SPN CHAR(8),  /* STEP NAME                       @L2A*/ 16250000
         3 SMF14PGN CHAR(8);  /* ACTIVE PROGRAM NAME             @L2A*/ 16300000
    DCL 1 SMF14A4I DEFINED(SMF14XIC) POSITION(5) BDY(HWORD), /*         16337500
                                  ANSI VERSION 4 CCSID INFORMATION      16375000
                                  SECTION                        @L3C*/ 16412500
         3 SMF14CFG BIT(8),    /* CCSID FLAGS                    @L3A*/ 16450000
           5 SMF14IBM BIT(1),  /* IBM V4 CREATED TAPE            @L3A*/ 16462500
           5 SMF14OUT BIT(1),  /* OPENED FOR OUTPUT NOT DISP=MOD @L3A*/ 16475000
           5 SMF14MOD BIT(1),  /* OPENED FOR OUTPUT DISP=MOD     @L3A*/ 16487500
           5 SMF14UDF BIT(1),  /* USR CCSID DEFAULTED            @L3A*/ 16500000
           5 SMF14TDF BIT(1),  /* TAPE CCSID DEFAULTED           @L3A*/ 16550000
           5 SMF14IGN BIT(1),  /* TAPE CCSID WAS IGNORED         @L3A*/ 16600000
           5 * BIT(2),         /* RESERVED                       @L3A*/ 16650000
         3 SMF14USR FIXED(31) BDY(BYTE), /* CCSID OF APPLICATION        16700000
                                  (SPECIFIED ON JOB/EXEC STATEMENT      16750000
                                  OR DEFAULTED)                  @L3A*/ 16800000
         3 SMF14TPE FIXED(31) BDY(BYTE), /* CCSID OF TAPE(SPECIFIED     16850000
                                  ON DD STATEMENT OR IN TAPE            16900000
                                  LABEL)                         @L3A*/ 16950000
         3 SMF14LBL FIXED(31) BDY(BYTE); /* CCSID IN TAPE LABEL OF      17000000
                                  AN EXISTING TAPE               @L3A*/ 17050000
    DCL 1 SMF14ADI DEFINED(SMF14XIC) POSITION(5) BDY(HWORD), /*         17100000
                                  ADDITIONAL DATA SET CHARACTERISTICS   17150000
                                  SECTION                        @L4A*/ 17200000
         3 SMF14BFG BIT(16),   /* ADC FLAGS                      @L4A*/ 17250000
           5 SMF14BLK BIT(1),  /* BLOCK SIZE IS PRESENT          @L4A*/ 17300000
           5 * BIT(15),        /* RESERVED                       @L4A*/ 17350000
         3 SMF14LBS BIT(64),   /* BLOCK SIZE VALUE               @L4A*/ 17400000
         3 *        BIT(96);   /* RESERVED                       @L4A*/ 17450000
