*%GOTO TRTBLOCE;                   /* BILINGUAL MAPPING                 00050000
         MACRO                                                          00100000
         IFGTROCE  ,                                                 */ 00150000
*%TRTBLOCE:  ;                                                          00200000
*/** START OF SPECIFICATIONS *****************************************/ 00250000
*/*                                                                  */ 00300000
*/*  $MAC(IFGTROCE):    OCE ACTIVE TRACE TABLE                       */ 00350000
*/*                                                                  */ 00400000
*/********************************************************************/ 00450000
*/*PROPRIETARY V3 STATEMENT                                          */ 00500000
*/*LICENSED MATERIALS - PROPERTY OF IBM                              */ 00550000
*/*"RESTRICTED MATERIALS OF IBM"                                     */ 00600000
*/*5695-DF1                                                          */ 00650000
*/*(C) COPYRIGHT 1997  IBM CORP.                                     */ 00700000
*/*END PROPRIETARY V3 STATEMENT                                      */ 00750000
*/*                                                                  */ 00800000
*/********************************************************************/ 00850000
*/*                                                                  */ 00900000
*/*  MACRO NAME:        IFGTROCE                                     */ 00950000
*/*                                                                  */ 01000000
*/*  DESCRIPTIVE NAME:  TABLE OF DATA SET NAMES, DD NAMES AND        */ 01050000
*/*                     JOBNAMES TO BE TRACED IN AN OCE TRACE.       */ 01100000
*/*                     ANCHORED OFF THE DFVT, DFVOCETB. CREATED     */ 01150000
*/*                     AND MAINTAINED BY STARTED TASK IFG0OCET      */ 01200000
*/*                                                                  */ 01250000
*/*  LINKAGE:                                                        */ 01300000
*/*                     IFGTROCE                                     */ 01350000
*/*                                                                  */ 01400000
*/*                     THE PL/X LINKAGE IS                          */ 01450000
*/*                                                                  */ 01500000
*/*                         %INCLUDE SYSLIB(IFGTROCE)                */ 01550000
*/*                                                                  */ 01600000
*/*                     TO GENERATE A BASED STRUCTURE, SPECIFY:      */ 01650000
*/*                                                                  */ 01700000
*/*                         %TROCE = 'BASED'                         */ 01750000
*/*                                                                  */ 01800000
*/*                     FOLLOWING INCLUDES ALSO NEEDED:              */ 01850000
*/*                                                                  */ 01900000
*/*                         %INCLUDE SYSLIB(IFGTROCE)                */ 01950000
*/*                         %INCLUDE SYSLIB(IHADFVT)                 */ 02000000
*/*                         %INCLUDE SYSLIB(CVT)                     */ 02050000
*/*                                                                  */ 02100000
*/*                     FOLLOWING DECLARE NEEDED:                    */ 02150000
*/*                                                                  */ 02200000
*/*                         DCL CVTPTR PTR(31) LOCATION(16)          */ 02250000
*/*                                                                  */ 02300000
*/*                     ASSEMBLER H                                  */ 02350000
*/*                                                                  */ 02400000
*/*                       TO GENERATE THE TROCE DSECT, SPECIFY:      */ 02450000
*/*                                                                  */ 02500000
*/*                         IFGTROCE ,                               */ 02550000
*/*                                                                  */ 02600000
*/*  USAGE:             THE TROCE TABLE CONSISTS OF HEADER AND       */ 02650000
*/*                     ENTRY(S) CONTAINING A DATA SET NAME AND/OR A */ 02700000
*/*                     DD NAME AND/OR A JOB NAME THAT THE OCE TRACE */ 02750000
*/*                     SHOULD BE ACTIVE FOR. THIS TABLE WILL        */ 02800000
*/*                     BE SEARCHED AT THE TIME IECRES BRANCH=QUEUED */ 02850000
*/*                     IS ISSUED TO TRANSFER CONTROL BETWEEN OCE    */ 02900000
*/*                     CSECTS. IF A MATCH IS FOUND BETWEEN A        */ 02950000
*/*                     TABLE ENTRY AND THE CURRENT DCB WHEN GTF     */ 03000000
*/*                     IS ACTIVE, IFG019TR IS GIVEN CONTROL TO      */ 03050000
*/*                     CREATE AN OCE TRACE ENTRY.                   */ 03100000
*/*                                                                  */ 03150000
*/*    CREATED BY:      THE TROCE TABLE IS CREATED AND MAINTAINED    */ 03200000
*/*                     BY STARTED TASK IFG0OCET IN SYS1.LINKLIB     */ 03250000
*/*                                                                  */ 03300000
*/*    REFERENCED BY:   THE TROCE TABLE IS REFERENCED BY IFG019RA    */ 03350000
*/*                     BRANCH QUEUED SUBROUTINE WHEN TRANSFERRING   */ 03400000
*/*                     CONTROL BETWEEN OCE CSECTS, AND BY IFG0OCET  */ 03450000
*/*                     WHEN CREATING OR DELETING TABLE ENTRIES.     */ 03500000
*/*                     IFG0OCET INCREMENTS THE TABLE ACCESS COUNT   */ 03550000
*/*                     (TRTBACC) WHENEVER THE TABLE IS BEING        */ 03600000
*/*                     ACCESSED AND DECREMENTS TRTBACC ON EXIT.     */ 03650000
*/*                                                                  */ 03700000
*/*    FREED BY:        OCE TRACE TABLE IS FIXED SIZE AND REMAINS    */ 03750000
*/*                     IN SP241 STORAGE DURING LIFE OF IPL.         */ 03800000
*/*                                                                  */ 03850000
*/*    POINTED TO BY:   PTR DFVOCETB IN DFVT (DATA FACILITY VECTOR   */ 03900000
*/*                     TABLE)                                       */ 03950000
*/*                                                                  */ 04000000
*/*    SERIALIZATION:   TABLE IS MAINTAINED BY STARTED TASK          */ 04050000
*/*                     IFG0OCET WHICH IS NONREINTRANT. THE          */ 04100000
*/*                     TROCE TABLE IS FIXED SIZE AND WILL           */ 04150000
*/*                     NOT BE FREED DURING IPL. THE ONLY            */ 04200000
*/*                     CHANGES TO THE TABLE AFTER INITIAL           */ 04250000
*/*                     CREATE ARE TO ACTIVATE OR DEACTIVATE         */ 04300000
*/*                     TABLE ENTRIES. ACTIVATION OF A TABLE ENTRY   */ 04350000
*/*                     ENTRY IS SERIALIZED BY A BUILTIN 'CS'        */ 04400000
*/*                     INSTRUCTION ON TABLE HEADER FIELD:           */ 04450000
*/*                     TRTBACT (ACTIVE ENTRY COUNT) AND BY          */ 04500000
*/*                     ANOTHER 'CS' INSTRUCTION TO TURN ON          */ 04550000
*/*                     BIT TROCEACT IN THE TABLE ENTRY WHICH        */ 04600000
*/*                     MARKS THE ENTRY ACTIVE.                      */ 04650000
*/*                                                                  */ 04700000
*/*  CHANGE ACTIVITY:                                                */ 04750000
*/*                                                                  */ 04800000
*/*    $00=DFSMS140,HDZ11D0,961030,SJPLJAL: STARTED TASK SUPPORT     */ 04850000
*/*                                         FOR OCE TRACE            */ 04900000
*/** END OF SPECIFICATIONS *******************************************/ 04950000
*%GOTO PLSMAP;                     /*                                   05000000
         EJECT ,                                                        05050000
*---------------------------------------------------------------------* 05100000
*                                                                     * 05150000
*        TRACE OCE TABLE                                              * 05200000
*                                                                     * 05250000
*---------------------------------------------------------------------* 05300000
         SPACE 1                                                        05350000
TROCETB  DSECT ,                   OCE TRACE TABLE                      05400000
         DS   0D                                                        05450000
TRTBHID  DS   CL4               EYE-CATCHER                             05500000
TRTBHPTR DS   A                 POINTER TO SELF                         05550000
TRTBACC  DS   F                 OCE TRACE TABLE ACCESS COUNT            05600000
TRTBACT  DS   F                 OCE TRACE TABLE ACTIVE ENTRY COUNT      05650000
TRTBHLN  EQU  *-TRTBHID         LENGTH OF OCE TABLE TBL HEADER          05700000
TRTBLENT DS   0CL68             OCE TRACE TABLE ENTRY                   05750000
TROCEFLG DS   XL1               OCE TRACE TABLE FLAG                    05800000
TROCEACT EQU  X'80'             OCE TRACE ENTRY ACTIVE                  05850000
TROCELST EQU  X'08'             LAST OCE TRACE ENTRY                    05900000
         DS   XL3               RESERVED                                05950000
TROCENAM DS   0CL60             OCE TRACE TBL ENTRY FULL NAME           06000000
TROCEDSN DS   CL44              OCE TRACE TBL ENTRY DATA SET NAME       06050000
TROCEDDN DS   CL8               OCE TRACE TBL ENTRY DD NAME             06100000
TROCEJN  DS   CL8               OCE TRACE TBL ENTRY JOB NAME            06150000
TROCENUM DS   XL2               OCE TRACE TBL ENTRY NUMBER              06200000
         DS   XL2               RESERVED                                06250000
TRENTRYL EQU  *-TRTBLENT        LENGTH OF OCE TRACE TBL ENTRY           06300000
         MEND  ,                                                     */ 06350000
*%PLSMAP:  ;                                                            06400000
*@EJECT;                                                                06450000
*      /* OCE TRACE TABLE                                            */ 06500000
*%IF TROCE = 'BASED' %THEN                                              06550000
*  %DO;                                                                 06600000
*  DECLARE                                                              06650000
*    1 TROCETB BDY(DWORD) BASED(DFVOCETB), /* OCE TRACE TABLE        */ 06700000
*  %END;                                                                06750000
*%ELSE                                                                  06800000
*  %DO;                                                                 06850000
*  DECLARE                                                              06900000
*    1 TROCETB BDY(DWORD),         /* OCE TRACE TABLE                */ 06950000
*  %END;                                                                07000000
*      3 TRTBHID       CHAR(4) BDY(DWORD), /* EYE = TTBL             */ 07050000
*      3 TRTBHPTR      FIXED(31),  /* POINTER TO SELF                */ 07100000
*      3 TRTBACC       FIXED(31),  /* OCE TRACE TABLE ACCESS COUNT   */ 07150000
*      3 TRTBACT       FIXED(31);  /* OCE TRTBL ACTIVE ENTRY COUNT   */ 07200000
*  DECLARE                     /* 10 ELEMENT ARRARY */                  07250000
*    1 TRTBLENT (10) BDY(WORD) BASED(ADDR(TROCETB)+LENGTH(TROCETB)),    07300000
*      3 TROCEFLG    BIT(32) BDY(WORD), /*     OCE TRACE TABLE FLAG  */ 07350000
*        5 TROCEACT  BIT(1),     /* TRACE ENTRY ACTIVE               */ 07400000
*        5 *         BIT(3),     /* RESERVED                         */ 07450000
*        5 TROCELST  BIT(1),     /* LAST TABLE ENTRY                 */ 07500000
*        5 *         BIT(3),     /* RESERVED                         */ 07550000
*        5 *         BIT(24),    /* RESERVED                         */ 07600000
*      3 TROCENAM CHAR(60),      /* TRACE TBL ENTRY FULL NAME        */ 07650000
*        5 TROCEDSN CHAR(44),    /* TRACE TBL ENTRY DATA SET NAME    */ 07700000
*        5 TROCEDDN CHAR(8),     /* TRACE TBL ENTRY DD NAME          */ 07750000
*        5 TROCEJN  CHAR(8),     /* TRACE TBL ENTRY JOB NAME         */ 07800000
*      3 TROCENUM FIXED(15),     /* TRACE TBL ENTRY NUMBER           */ 07850000
*      3 *        FIXED(15);     /* RESERVED                         */ 07900000
*  DECLARE                                                              07950000
*    TRTBHLN  FIXED(31) CONSTANT(LENGTH(TROCETB));  /* LENGTH OF OCE    08000000
*                                                      TRTBL HDR     */ 08050000
*  DECLARE                                                              08100000
*    TRENTRYL FIXED(31) CONSTANT(LENGTH(TRTBLENT)); /* LENGTH OF OCE    08150000
*                                                      TRTBL ENTRY   */ 08200000
*  DECLARE                                                              08250000
*    TRTBEYE  CHAR(4) CONSTANT('TTBL');             /* EYE-CATCHER      08300000
*                                                      TTBL          */ 08350000
*@SPACE(2);                                                             08400000
