*        %GOTO SMF63PLS;      /*                                        00050000
         MACRO                                                          00100000
&NAME    IGGSMF63                                                       00150000
.********************************************************************** 00200000
.*                                                                    * 00250000
.*   MACRO NAME = IGGSMF63                                            * 00300000
.*                                                                    * 00350000
.*PROPRIETARY V3 STATEMENT                                            * 00400000
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00450000
.*"RESTRICTED MATERIALS OF IBM"                                       * 00500000
.*5695-DF1                                                            * 00550000
.*(C) COPYRIGHT 1993  IBM CORP.                                       * 00600000
.*END PROPRIETARY V3 STATEMENT                                        * 00650000
.*                                                                    * 00750000
.*                                                                    * 00800000
.* This is the macro that includes the Assembler and PLS declarations * 00850000
.* for the SMF Type 63 Record.                                        * 00900000
.*                                                                    * 00950000
.* Method of Access:                                                  * 01000000
.*   ASM - User includes Record Type on IFASMFR macro invocation      * 01050000
.*         Examples:                                                  * 01100000
.*         - IFASMFR  63                                              * 01150000
.*         - IFASMFR (...,63,...)                                     * 01200000
.*                                                                    * 01250000
.*  PL/S - User defines a macro variable IFAR63 where 63=Record type  * 01300000
.*         being requested, INCLUDEs the IFASMFR macro and declares   * 01350000
.*         the basing pointer for the record mapping.                 * 01400000
.*         Example:                                                   * 01450000
.*         - %IFAR63 = 'YES'                                          * 01500000
.*           DCL SMF63PTR PTR(31)                                     * 01550000
.*           %INCLUDE SYSLIB(IFASMFR)                                 * 01600000
.*                                                                    * 01650000
.*                                                                    * 01700000
.* CHANGE ACTIVITY =                                                  * 01750000
.*                                                                    * 01800000
.* NOTE: All record mapping changes must be forwarded to the SMF      * 01850000
.*       writer for inclusion in the SMF Manual                       * 01900000
.*                                                                    * 01950000
.* A - Define new macro for record mapping                        @00A* 02000000
.*                                                                    * 02050000
.* $00=.......,.......,......,....: DFP Record Mappings Transfer  @00A* 02100000
.*                                                                    * 02150000
.*                                                                    * 02200000
.********************************************************************** 02250000
*                                                                       02300000
*  THIS RECORD IS WRITTEN AFTER A VSAM CLUSTER OR COMPONENT IS DEFINED  02350000
*  AND WHEN THE DEFINITION IS ALTERED.                                  02400000
*                                                                       02450000
         DS    0F        ALIGN TO FULL WORD BOUNDARY                    02500000
SMFRCD63 EQU   *         HEADER SEGMENT                                 02550000
SMF63LEN DS    BL2'0'    RECORD LENGTH                                  02600000
SMF63SEG DS    BL2'0'    SEGMENT DESCRIPTOR                             02650000
SMF63FLG DS    BL1'0'    HEADER FLAG BYTE                               02700000
SMF63RTY DS    BL1'0'    RECORD TYPE 63                                 02750000
SMF63TME DS    BL4'0'    TOD USING FORMAT FROM TIME MACRO W/BIN. INTVL. 02800000
SMF63DTE DS    PL4'0000' DATE IN PACKED DECIMAL FORM: OOYYDDDF          02850000
SMF63SID DS    CL2' '    SYSTEM IDENTIFICATION                          02900000
SMF63SMI DS    CL2' '    SYSTEM MODEL IDENTIFIER                        02950000
SMF63JBN DS    CL8' '    JOB NAME                                       03000000
SMF63RST DS    BL4'0'    READER START TIME (IN 100THS SECONDS)          03050000
SMF63RSD DS    PL4'0000' READER START DATE                              03100000
SMF63UIF DS    CL8' '    USER IDENTIFICATION FIELD                      03150000
SMF63FDT DS    BL1'0'    FUNCTION AND DATA SET TYPE INDICATOR           03200000
*                        BIT0 - NEW DEFINITION                          03250000
*                        BIT1 - ALTERED DEFINITION                      03300000
*                        BIT2-7 - RESERVED                              03350000
SMF63TYP DS    BL1'0'    TYPE OF ENTRY                                  03400000
*                        BIT0 - CLUSTER                                 03450000
*                        BIT1 - VSAM DATA COMPONENT                     03500000
*                        BIT2 - INDEX COMPONENT                         03550000
*                        BIT3 - CATALOG                                 03600000
*                        BIT4 - NON-VSAM DATA SET                       03650000
*                        BIT5 - GENERATION DATA GROUP                   03700000
*                        BIT6 - ALIAS                                   03750000
*                        BIT7 - RESERVED                                03800000
SMF63NSZ DS    BL2'0'    SIZE OF NEW CATALOG RECORD                     03850000
SMF63OSZ DS    BL2'0'    SIZE OF OLD CATALOG RECORD                     03900000
SMF63CNM DS    CL44' '   NAME OF CATALOG IN WHICH ENTRY IS DEFINED      03950000
SMF63ENM DS    CL44' '   ENTRY NAME                                     04000000
SMF63NCR DS    0H        NEW CATALOG RECORD                             04050000
         ORG   SMF63NCR                                                 04100000
SMF63OCR DS    0H        OLD CATALOG RECORD                             04150000
*                                                                       04200000
         MEND                                                           04250000
         MEXIT            */                                            04300000
 %SMF63PLS:;                                                            04350000
                                                                        04400000
    DCL 1 SMFRCD63 BASED(SMF63PTR) BDY(WORD),                           04450000
                                                                        04500000
 /* RECORD TYPE 63 - VSAM CLUSTER OR COMPONENT CATALOGED             */ 04550000
 /* WRITTEN AFTER A VSAM CLUSTER OR COMPONENT IS DEFINED, AND WHEN   */ 04600000
 /* THE DEFINITION IS ALTERED.                                       */ 04650000
                                                                        04700000
         3 SMF63LEN FIXED(15),    /*RDW RECORD LENGTH                */ 04750000
         3 SMF63SEG FIXED(15),    /*RDW SEGMENT DESCRIPTOR           */ 04800000
         3 SMF63FLG BIT(8),       /*OPERATING ENVIRONMENT            */ 04850000
         3 SMF63RTY FIXED(8),     /*RECORD TYPE 63                   */ 04900000
         3 SMF63TME FIXED(31) BDY(HWORD), /*TOD RECORD WRITTEN       */ 04950000
         3 SMF63DTE CHAR(4),      /*DATE RECORD WRITTEN              */ 05000000
         3 SMF63SID CHAR(2),      /*SYSTEM ID FROM INSTALLATION      */ 05050000
         3 SMF63SMI CHAR(2),      /*SYSTEM MODEL IDENTIFIER          */ 05100000
         3 SMF63JBN CHAR(8),      /*JOB NAME                         */ 05150000
         3 SMF63RST FIXED(31) BDY(HWORD), /*READER START TOD(.01 SEC) */05200000
         3 SMF63RSD CHAR(4),      /*READER START DATE                */ 05250000
         3 SMF63UIF CHAR(8),      /*USER IDENTIFICATION FIELD        */ 05300000
         3 SMF63FDT BIT(8),       /* FUNCTION AND DS TYPE INDICATOR     05350000
                                    BIT MEANING WHEN SET                05400000
                                    BIT0 - NEW DEFINITION               05450000
                                    BIT1 - ALTERED DEFINITION           05500000
                                    BIT2-7 - RESERVED                */ 05550000
         3 SMF63TYP BIT(8),       /*TYPE OF ENTRY                       05600000
                                    BIT MEANING WHEN SET                05650000
                                    BIT0 - CLUSTER                      05700000
                                    BIT1 - VSAM DATA COMPONENT          05750000
                                    BIT2 - INDEX COMPONENT              05800000
                                    BIT3 - CATALOG                      05850000
                                    BIT4 - NON-VSAM DATA SET            05900000
                                    BIT5 - GENERATION DATA GROUP        05950000
                                    BIT6 - ALIAS                        06000000
                                    BIT7 - RESERVED                  */ 06050000
         3 SMF63NSZ FIXED(15),    /*SIZE OF NEW CATALOG RECORD       */ 06100000
         3 SMF63OSZ FIXED(15),    /*SIZE OF OLD CATALOG RECORD       */ 06150000
         3 SMF63CNM CHAR(44),     /*NAME OF CATLG IN WHICH ENTRY        06200000
                                    IS DEFINED                       */ 06250000
         3 SMF63ENM CHAR(44);     /*ENTRY NAME                       */ 06300000
                                                                        06350000
    DCL SMF63NCR BASED;             /*NEW CATALOG RECORD             */ 06400000
    DCL SMF63OCR BASED;             /*OLD CATALOG RECORD             */ 06450000
                                                                        06500000
