*%GOTO DESPLX;                                                          00000200
*/* BILINGUAL IGWDES MAPPING MACRO                                      00000400
*                                                                       00000600
         MACRO                                                          00000800
         IGWDES                                                         00001000
.*                                                                      00014400
.* IF GLOBAL FLAG DESCSECT IS SET TO YES, THEN ECHO THE PREVIOUS        00014500
.* CSECT NAME. THIS FLAG SHOULD ONLY BE SET BY DESERV.                  00014600
.* TEST FOR THIS DSECT ALREADY INVOKED, IF SO EXIT                      00014700
.*                                                                      00014800
         GBLB  &SYSIGWDES                                               00015000
         GBLC  &SYSIGWDESLIST                                           00015100
.*                                                                      00015200
         PUSH  PRINT                                                    00015300
         AIF   (&SYSIGWDES EQ 1).ENDMAC                                 00015400
&SYSIGWDES SETB 1                                                       00015600
         AIF   ('&SYSIGWDESLIST' NE 'OFF').LIST                         00015700
         PRINT OFF                                                      00015800
.LIST    ANOP                                                           00015900
*********************************************************************** 00016000
.*                                                                    * 00016100
.* $MAC(IGWDES)  COMP(28473):                                         * 00016200
**                                                                    * 00016300
**  MACRO NAME: IGWDES                                                * 00016400
**                                                                    * 00016500
**  DESCRIPTION: DE SERVICES MAPPING MACRO, BILINGUAL                 * 00016600
**               (IGWDES macro )                                      * 00016700
**                                                                    * 00016800
.*                                                                    * 00017000
.*  COPYRIGHT:                                                        * 00017100
.*PROPRIETARY V3 STATEMENT                                            * 00017200
.*LICENSED MATERIALS - PROPERTY OF IBM                                * 00017300
.*"RESTRICTED MATERIALS OF IBM"                                       * 00017400
.*5695-DF1                                                            * 00017500
.*(C) COPYRIGHT 1991,1995  IBM CORP.                                  * 00017600
.*END PROPRIETARY V3 STATEMENT                                        * 00017700
.*                                                                    * 00017800
.*  FUNCTION:                                                         * 00017900
.*    THE IGWDES PROVIDES A MAPPING FOR THE DE SERVICES               * 00018000
.*    RELATED CONTROL BLOCKS. THESE CONTROL BLOCKS ARE:               * 00018100
.*                                                                    * 00018200
.*       - DESP : DESERV PARARMETER LIST                              * 00018300
.*       - DESB : DESERV BUFFER                                       * 00018400
.*       - DESL : DESERV INPUT LIST                                   * 00018500
.*       - DESN : DESERV NAME RECORD                                  * 00018600
.*       - DESD : DESERV MEMBER DATA DESCRIPTOR                       * 00018700
.*       - DESZ : DESERV LINKAGE DECLARATIONS, PLX ONLY               * 00018800
.*       - DESR : DESERV RETURN AND REASON CODES                      * 00018900
.*       - DESX : DESERV EXIT PLIST                                   * 00019000
.*       - DST  : DESERV SCREEN TABLE                                 * 00019100
.*                                                                    * 00019200
.*                                                                    * 00019300
.*  NOTES:                                                            * 00019400
.*                                                                    * 00019500
.*    DEPENDENCIES: NONE                                              * 00019600
.*    RESTRICTIONS: NONE                                              * 00019700
.*                                                                    * 00019800
.*  LINKAGE:                                                          * 00019900
.*                                                                    * 00020000
.*  MACRO:                                                            * 00020100
.*                                                                    * 00020200
.*    PROCESSOR: ASSEMBLER H AND PLS                                  * 00020300
.*    MACRO SIZE: 0                                                   * 00020400
.*    DISTRIBUTION LIBRARY: AMACLIB                                   * 00020500
.*    ATTRIBUTES: INCLUDE                                             * 00020600
.*                                                                    * 00020700
.*                                                                    * 00020800
.*  EXTERNAL REFERENCES: NONE                                         * 00020900
.*                                                                    * 00021000
.*    MACROS:                                                         * 00021100
.*      NONE                                                          * 00021200
.*                                                                    * 00021300
.*  CHANGE ACTIVITY:                                                  * 00021400
.*                                                                    * 00021500
.*$L0=DESERV,HDP4410,880801,STLSAM:                                   * 00021600
.*$P1=KV40537,HDP4410,900518,STLREB: CORRECT REASON CODES         @P1A* 00021700
.*$P2=KMM0401,HDP4410,910502,SJPLREB: DELETE UNUSED RSNCODES AND      * 00021800
.*   CORRECT DESCRIPTIONS                                         @P2A* 00021900
.*$P3=DCR,HDP4410,910702,SJPLREB: DESRS_MODULE_BUFFERED_LLA       @P3A* 00022000
.*$01=OY61541,JDZ1110,930208,SJPLREB: ALLOW DSORG=PS AS INPUT     @P3A* 00022100
.*$02=OW02507,HDZ11B0,940510,SJPLGIN: EXTERNALIZE, CONVERT TO         * 00022200
.*                                    BILINGUAL, ADD EXIT FUNCTION@02A* 00022300
.*$L1=PM2,HDZ11C0,940218,SJPLREB: LONG NAME SUPPORT               @L1A* 00022400
.*$L2=PM2,HDZ11C0,940510,SJPLGIN: ADD DELETE, RENAME & UPDATE         * 00022500
.*                         FUNCTIONS, EXTERNALIZE OTHER FUNCTIONS @L2A* 00022600
.*$L3=PM3,HDZ11D0,951012,SJPLREB: C370LIB SUPPORT, CONCAT(ALL) FOR@L3A* 00022700
.*                         GET_ALL, SUBPOOL AND AREAPTR FOR GET,  @L3A* 00022800
.*                         HIDE, SYSTEM_DCB, AND SMDE             @L3A* 00022900
.*$03=OW18449,HDZ11C0,960207,SJPLREB: CORRECT DESB DSECT          @03A* 00023000
.*$04=OW18589,HDZ11C0,960207,SJPLREB: DESRS_MEMBER_PEND_DELETE    @04A* 00023100
.*$05=OW39917,HDZ11E0,000113,SJPLELA: ADD RELEASE FUNC & NEW RSN  @05A* 00023200
.*$06=OW45219,HDZ11f0,000509,SJPLreb: c390lib support             @06A* 00023240
.*$07=OW46079,HDZ11E0,000905,SJPLREB: DESRS_PACB_PTR_ZERO         @07A* 00023260
.*$08=OW47159,HDZ11F0,001121,SJPLREB: DESP_MEMBER_COUNTS_PTR      @08A* 00023270
.*$09=OW48079,HDZ11e0,010206,SJPLREB: DESRS_BAD_DCII              @09A* 00023280
.********************************************************************** 00023300
.*                                                                      00023400
**********************************************************************  00023500
***************    Parameter List for DESERV    **********************  00023600
**********************************************************************  00023700
DESP                   DSECT           DE Services parm list            00023800
*                                                                       00023900
DESP_HEADER            DS   0CL16      Standard Header                  00024000
DESP_ID                DS   CL8        eyecatcher (IGWDES_P)            00024100
DESP_LEN               DS   F          length of buffer                 00024200
DESP_LEV               DS   B          control block level              00024300
DESP_LEV_IV            EQU  X'01'      parm list level                  00024400
                       DS   CL3        RESERVED                         00024500
DESP_FUNC              DS   X          function type (GET_ALL, GET,     00024600
*                                      PUT, RELEASE, GET_NAMES)         00024700
DESP_FUNC_DEFER_RELEASE  EQU  X'10'    PROCESS DEFERRED REQUEST   @05A  00024800
DESP_FUNC_UPDATE       EQU  X'09'      UPDATE request             @L2A  00024900
DESP_FUNC_RENAME       EQU  X'08'      RENAME request             @L2A  00025000
DESP_FUNC_DELETE       EQU  X'07'      DELETE request             @L2A  00025100
DESP_FUNC_EXIT         EQU  X'06'      EXIT request                     00025200
DESP_FUNC_GET_NAMES    EQU  X'05'      GET_NAMES request          @L2A  00025300
DESP_FUNC_PUT          EQU  X'04'      PUT request                      00025400
DESP_FUNC_RELEASE      EQU  X'03'      RELEASE request            @L2A  00025500
DESP_FUNC_GET_ALL      EQU  X'02'      GET_ALL request            @L2A  00025600
DESP_FUNC_GET          EQU  X'01'      GET request                      00025700
DESP_FUNC_OMITTED      EQU  X'00'      NOT SPECIFIED              @L2A  00025800
                       DS   CL3        RESERVED                         00025900
DESP_MEMBER_COUNTS_PTR DS   A          pointer to optional output  @08A 00026010
*             from GET_ALL function. points to two fullwords which @08a 00026020
*             will contain the number of primary names returned and@08a 00026030
*             the number of primary names as indicated in the PDSE @08A 00026040
*             attribute record field. This is only valid when   @08a    00026050
*             processing a single PDSE library.                    @08A 00026060
*                                                                  @08A 00026070
DESP_DATA              DS   0CL12      function data                    00026100
DESP_FLAGS             DS   BL2        DESP FLAG1                       00026200
DESP_BYPASS_LLA        EQU  X'80'      0=USE LLA, 1=BYPASS LLA          00026300
DESP_CONCAT_FLG        EQU  X'40'      0=CONCAT PARM NOT SPECIFIED,     00026400
*                                       1=CONCAT PARM SPECIFIED.        00026500
DESP_SUBPOOL_FLG       EQU  X'20'      0=SUBPOOL PARM NOT SPECIFIED,    00026600
*                                       1=SUBPOOL PARM SPECIFIED.       00026700
DESP_C370LIB           EQU  X'10'    0=C370LIB PARM NOT SPECIFIED, @L3A 00026800
*                                     1=C370LIB PARM SPECIFIED.    @L3A 00026900
DESP_CONCAT_ALL        EQU  X'08'    ONLY VALID IF DESP_CONCAT_FLG @L3A 00027000
*                                      IS ON.                      @L3A 00027100
*                                      1=GET_ALL RETURNS INFO FOR  @L3A 00027200
*                                        ALL DATA SETS IN CONCAT.  @L3A 00027300
*                                      0=GET_ALL RETURNS INFO ONLY @L3A 00027400
*                                       FOR THE DATA SET IDENTIFIED@L3A 00027500
*                                       BY DESP_CONCAT             @L3A 00027600
DESP_HIDE              EQU  X'04'     0=all names are visible      @L3A 00027700
*                                     1=hidden names are not       @L3A 00027800
*                                      visible in name search.     @L3A 00027900
DESP_SYSTEM_DCB        EQU  X'02'     0=SYSTEM DCB NOT SPECIFIED.  @L3A 00028000
*                                     1=TREAT DCB AS SYSTEM DCB    @L3A 00028100
*                      EQU  X'01FF'    BITS 3-15 RESERVED               00028200
DESP_EXIT_SCOPE        DS   B          EXIT SCOPE                       00028300
DESP_EXIT_SCOPE_TASK   EQU  X'01'      SETUP A TASK EXIT                00028400
DESP_EXIT_SCOPE_GLOBAL EQU  X'00'      SETUP A GLOBAL EXIT              00028500
*                                                                       00028600
DESP_CONCAT            DS   AL1        concatenation number       @L2A  00028700
*                                                                       00028800
DESP_LIBTYPE           DS   B          function subtype (DCB, DEB)      00028900
DESP_LIBTYPE_DCB       EQU  X'02'      DCB was input                    00029000
DESP_LIBTYPE_DEB       EQU  X'01'      DEB was input                    00029100
DESP_LIBTYPE_OMITTED   EQU  X'00'      NOT SPECIFIED                    00029200
*                                                                       00029300
DESP_GETTYPE           DS   B          function subtype (NAME_LIST or   00029400
*                                      PDSDE)                           00029500
DESP_GETTYPE_SMDE      EQU  X'03'      GET input is SMDE          @L3A  00029600
DESP_GETTYPE_PDSDE     EQU  X'02'      GET input is PDSDE               00029700
DESP_GETTYPE_NAME_LIST EQU  X'01'      GET input is name list           00029800
DESP_GETTYPE_OMITTED   EQU  X'00'      NOT SPECIFIED                    00029900
*                                                                       00030000
DESP_RELTYPE           DS   B          function subtype (DE_LIST  @L2A  00030100
DESP_RELTYPE_DE_LIST   EQU  X'02'      or RELTYPE                 @L2A  00030200
DESP_RELTYPE_CONN_ID   EQU  X'01'                                 @L2A  00030300
DESP_RELTYPE_OMITTED   EQU  X'00'      NOT SPECIFIED              @L2A  00030400
*                                                                       00030500
DESP_EXIT_OPTION       DS   B          EXIT option                      00030600
DESP_EXIT_OPTION_QUERY      EQU  X'03' QUERY EXISTING EXIT              00030700
DESP_EXIT_OPTION_DELETE     EQU  X'02' DELETE EXISTING EXIT             00030800
DESP_EXIT_OPTION_REPLACE    EQU  X'01' REPLACE EXISTING EXIT            00030900
DESP_EXIT_OPTION_NOREPLACE  EQU  X'00' DO NOT REPLACE EXISTING EXIT     00031000
*                                                                       00031100
DESP_OPTION            DS   B          PUT REPLACE option               00031200
DESP_OPTION_REPLACE    EQU  X'01'      Replace alias or primary         00031300
DESP_OPTION_NOREPLACE  EQU  X'00'      Do not replace                   00031400
*                                                                       00031500
DESP_SUBPOOL           DS   AL1        SUBPOOL identifier         @L2A  00031600
*                                                                       00031700
DESP_CONN_INTENT       DS   AL1        connect intent                   00031800
DESP_CONN_INTENT_INPUT EQU  X'03'      connect for input                00031900
DESP_CONN_INTENT_EXEC  EQU  X'02'      connect for exec                 00032000
DESP_CONN_INTENT_HOLD  EQU  X'01'      connect for hold                 00032100
DESP_CONN_INTENT_NONE  EQU  X'00'      do not connect                   00032200
*                                                                       00032300
*                                                                       00032400
                       DS   B          RESERVED                         00032500
DESP_DCB_PTR           DS   A          DCB address                      00032600
DESP_DEB_PTR           DS   A          DEB address                      00032700
DESP_CONN_ID_PTR       DS   A          connect identifier address       00032800
DESP_AREAPTR_PTR       DS   A          address for buffer address @L2A  00032900
DESP_AREA_PTR          DS   A          buffer address                   00033000
DESP_AREA2             DS   F          buffer length                    00033100
DESP_DE_LIST_PTR       DS   A          DE_LIST address            @L2A  00033200
DESP_DE_LIST2          DS   F          DE_LIST entry count        @L2A  00033300
DESP_ENTRY_GAP         DS   F          entry gap size                   00033400
DESP_ENTRY_GAP_MAX     EQU  2048       maximum entry gap                00033500
*                                                                       00033600
DESP_MEM_DATA_PTR      DS   A          MEM_DATA address                 00033700
DESP_MEM_DATA2         DS   F          MEM_DATA entry count             00033800
DESP_NAME_LIST_PTR     DS   A          name list address                00033900
DESP_NAME_LIST2        DS   F          input list number of entries     00034000
DESP_NAME_PTR          DS   A          name address               @L2A  00034100
DESP_PDSDE_PTR         DS   A          bldl directory entry address     00034200
                       ORG  DESP_PDSDE_PTR                        @L3A  00034300
DESP_SMDE_PTR          DS   A          input smde addr for GET    @L1A  00034400
DESP_EXIT_DST_PTR      DS   A          DESERV exit screen table, DST    00034500
DESP_EXIT_PREV_DSTPTR_PTR  DS   A      Address of pointer to previous   00034600
*                                       DESERV Screen Table             00034700
*                                                                       00034800
DESP_LEN_IV            EQU  *-DESP      parm list length                00034900
DESP_LEN_LIST          EQU  *-DESP_FUNC parm list length w/o header     00035000
*                                                                       00035100
*  Valid constant for DESP_LEN                                          00035200
*DESP_ID_IV            DC   C'IGWDESP ' parm list eyecatcher            00035300
*                                                                       00035400
*                                                                       00035500
**********************************************************************  00035600
* Input_List:                                                           00035700
*                                                                       00035800
*   Used by NAME_LIST for GET, DELETE, RENAME & UPDATE functions  @L2A  00035900
*   Used by DE_LIST for RELEASE function                          @L2A  00036000
*                                                                       00036100
*   Used to provide a list of search descriptors that will              00036200
*   produce a member for each descriptor.                               00036300
*                                                                       00036400
*   This list is an array of entries. Each entry has an                 00036500
*   input field pointing to the attribute (NAME or DE) that             00036600
*   has been initialized by the caller.                                 00036700
*                                                                       00036800
**********************************************************************  00036900
DESL                   DSECT           NAME LIST                        00037000
DESL_ENTRY             DS   0CL16      name entry                       00037100
DESL_FLAGS             DS   B          flags                            00037200
DESL_MODULE_BUFFERED_LLA EQU  X'80'    module is staged by lla          00037300
*                                                                       00037400
DESL_CODE              DS   AL1        result code                      00037600
DESL_CODE_NEWNAME_EXISTS EQU  X'03'    for func=rename, indicates a     00037700
*                                      new name already existed in the  00037800
*                                      PDSE                             00037900
DESL_CODE_ERROR        EQU  X'02'      an unexpected error has          00038000
*                                      occurred. The DESL_ERRCODE       00038100
*                                      field is set to a DESRS          00038200
*                                      value                            00038400
*                                                                       00038600
DESL_CODE_NOTFOUND     EQU  X'01'      entry not found or entry not     00038800
*                                      processed. if func=rename,       00038900
*                                      old name was not found           00039000
DESL_CODE_SUCC         EQU  X'00'      entry successfully processed     00039200
*                                                                       00039400
DESL_ERRCODE           DS   AL2        low order halfword of            00039600
*                                      reason code                      00039800
                       DS   F          reserved                         00040000
DESL_SMDE_PTR          DS   A          pointer to smde                  00040200
                       ORG  DESL_SMDE_PTR                         @L2A  00040300
DESL_NEW_NAME_PTR      DS   A          pointer to new name,       @L2A  00040400
*                                      for RENAME function        @L2A  00040500
                       ORG  DESL_SMDE_PTR+L'DESL_SMDE_PTR         @L2A  00040600
DESL_NAME_PTR          DS   A          pointer to name (DESN)           00040700
*                                      descriptor                       00040800
                       ORG  DESL_NAME_PTR                         @L2A  00040900
DESL_OLD_NAME_PTR      DS   A          pointer to old name,       @L2A  00041000
*                                      for RENAME function        @L2A  00041100
                       ORG  DESL_NAME_PTR+L'DESL_NAME_PTR         @L2A  00041200
*                                                                       00041300
*********************************************************************   00041400
*  Buffer Area Header:                                                  00041500
*    Description for fixed portion of buffer                            00041600
*********************************************************************   00041700
*                                                                       00041800
DESB                   DSECT           DESERV buffer header             00042000
DESB_FIXED             DS   0CL40                                       00042200
DESB_HEADER            DS   0CL16                                       00042400
DESB_ID                DS   CL8        EYECATCHER (IGWDESB )     @03C   00042500
*DESB_ID_IV            DC   C'IGWDESB ' buffer eyecatcher constant      00042600
DESB_LEN               DS   F          LENGTH OF BUFFER                 00042800
DESB_LEV               DS   CL1        CONTROL BLOCK LEVEL              00043000
DESB_LEV_IV            EQU  X'01'      buffer level                     00043200
                       DS   CL3        reserved                         00043400
DESB_NEXT              DS   A          Next Buffer Pointer              00043600
                       DS   A          RESERVED                         00043800
DESB_COUNT             DS   F          count of entries in this         00044000
*                                      buffer                           00044200
DESB_AVAIL             DS   A          Start of free space in buffer    00044400
                       DS   X          RESERVED                         00044600
DESB_SUBPOOL           DS   X          subpool number                   00044800
DESB_GAP_LEN           DS   H          length of user requested gap     00045000
                       DS   A          RESERVED                         00045200
DESB_DATA              DS   0C         start of data area               00045400
*                                                                       00045600
*                                                                       00045800
*                                                                       00046200
********************************************************************    00046400
* DESERV name descriptor                                                00046600
********************************************************************    00046800
DESN                   DSECT           Name record                      00047000
DESN_LEN               DS   H          Length of name that follows      00047200
DESN_VAL               DS   0C         name data                        00047400
*                                                                       00047600
********************************************************************    00047800
* DESERV member data descriptor                                         00048000
*                                                                       00048200
* Used by MEM_DATA for PUT function                                     00048400
* Used as "data" in DESB by GET_NAMES function                   @L2A   00048500
********************************************************************    00048600
DESD                   DSECT           member data descriptor           00048800
DESD_ENTRY             DS   0CL16      entry descriptor                 00049000
DESD_FLAG              DS   AL1        flags                            00049200
DESD_FLAG_ALIAS        EQU  X'80'      alias entry                      00049400
DESD_CODE              DS   AL1        processing code                  00049600
DESD_CODE_ERROR        EQU  X'02'      an unexpected error has          00049800
*                                      occurred. The DESD_ERRCODE       00050000
*                                      field is set to a DESRS          00050200
*                                      value                            00050400
*                                                                       00050600
DESD_CODE_NOGO         EQU  X'01'      the entry has not yet been       00050800
*                                      processed or processing was      00051000
*                                      terminated before this entry     00051200
*                                      was processed.                   00051400
*                                                                       00051600
DESD_CODE_SUCC         EQU  X'00'      successful processing            00051800
*                                                                       00052000
DESD_ERRCODE           DS   XL2        low order half word of           00052200
*                                      reason code                      00052400
DESD_INDEX             DS   H          Index number for name. required  00052500
*                                      input to the PUT function if the 00052600
*                                      name length is greater than      00052700
*                                      63 bytes. This index is used in  00052800
*                                      constructing the compressed      00052900
*                                      name.                       @L1A 00053000
DESD_DATA_LEN          DS   H          length of data area              00053100
DESD_DATA_PTR          DS   A          address of data                  00053200
DESD_NAME_PTR          DS   A          address of varying length name   00053300
*                                                                       00053400
*                                                                       00053600
********************************************************************    00053800
* DESERV EXIT PLIST                                                     00054000
* Exit plist, passed to DESERV Global or Task Level Exits               00054200
* (exits are established by DESERV FUNC=EXIT invocation)                00054400
********************************************************************    00054600
DESX                   DSECT                                            00054800
*                                      DESERV EXIT PLIST HEADER         00055000
DESX_HEADER            DS   0CL16      Standard Header                  00055200
DESX_ID                DS   CL8        eyecatcher (IGWDESX)             00055400
DESX_LEN               DS   F          length of buffer                 00055600
DESX_LEV               DS   B          control block level              00055800
DESX_LEV_IV            EQU  X'01'      parm list level                  00056000
                       DS   CL3        RESERVED                         00056200
*                                                                       00056400
DESX_DESP_PTR          DS   A          Address of DESP                  00056600
DESX_DST_PTR           DS   A          DESERV Screen Table, DST         00056800
DESX_CALLER_KEY        DS   B          High order nibble is DESERV's    00057000
*                                      caller's key                     00057200
DESX_FLAGS             DS   B          Flags                            00057400
DESX_BLDL_BIT          EQU  X'80'      DESERV BLDL path                 00057600
DESX_PRE_BIT           EQU  X'40'      Exit invoked prior to DESERV     00057800
*                                      FUNC=GET or PUT execution        00058000
DESX_POST_BIT          EQU  X'20'      Exit invoked after DESERV        00058200
*                                      FUNC=GET or PUT execution        00058400
                       DS   H          RESERVED                         00058600
*                                                                       00058800
DESX_RETURN_CODE       DS   F          User Exit rtn return code        00059000
DESX_REASON_CODE       DS   F          User Exit rtn reason code        00059200
*                                                                       00059400
DESX_LEN_IV            EQU  *-DESX     parm list length                 00059600
*                                                                       00059800
*  Valid constant for DESX_LEN                                          00060000
*DESX_ID_IV            DC   C'IGWDESX'  parm list eyecatcher            00060200
*                                                                       00060400
********************************************************************    00060600
* DESERV SCREEN TABLE                                                   00060800
* Mapping of DESERV SCREEN TABLE, pointed to by DESP_EXIT_DST_PTR       00061000
* and DESX_DST_PTR                                                      00061200
********************************************************************    00061400
DST                    DSECT                                            00061600
*                                      DESERV EXIT PLIST HEADER         00061800
DST_HEADER             DS   0CL15      Standard Header                  00062000
DST_ID                 DS   CL8        eyecatcher (IGWDST)              00062200
DST_LEN                DS   F          length of buffer                 00062400
DST_LEV                DS   B          control block level              00062600
DST_LEV_IV             EQU  X'01'      parm list level                  00062800
DST_FLAGS              DS   X          DST flags                        00063000
DST_FLAGS_PROP         EQU  X'01'      Propagate                        00063200
DST_RES                DS   CL2        RESERVED                         00063400
*                                                                       00063600
*                                                                       00063800
DST_EXIT_PTR           DS   A          Address of exit routine          00064000
*                                                                       00064200
DST_LEN_IV             EQU  *-DST      parm list length                 00064400
*                                                                       00064600
*  Valid constant for DST_LEN                                           00064800
*DST_ID_IV             DC   C'IGWDST'  parm list eyecatcher             00065000
********************************************************************    00065200
* Return Code and Reason Code mapping                                   00065400
********************************************************************    00065600
DESRCS                 DSECT                                            00065800
DESRC                  DS   CL4        return code                      00066000
* Return Codes returned by the DESERV macro.                            00066200
DESRC_SUCC             EQU  X'00'      successful processing            00066400
DESRC_INFO             EQU  X'04'      not completely successful        00066600
DESRC_WARN             EQU  X'08'      Results questionable             00066800
DESRC_PARM             EQU  X'0C'      Missing/invalid parms            00067000
DESRC_CALR             EQU  X'10'      Caller has a problem             00067200
DESRC_ENVR             EQU  X'14'      Resources unavailable            00067400
DESRC_IOER             EQU  X'18'      I/O error                        00067600
DESRC_MEDE             EQU  X'1C'      Media error                      00067800
DESRC_DSLE             EQU  X'20'      Data Set logical error           00068000
DESRC_SEVE             EQU  X'24'      Severe error                     00068200
*                                                                       00068400
DESR                   DSECT                                            00068600
* see            EQUates below                                          00068800
DESR_COMPID            DS   X          DFP component id                 00069000
DESR_MODID             DS   X          module id within component       00069200
DESRS                  DS   BL2        reason code                      00069400
*                                                                       00069600
*                                                                       00069800
* Reason Codes returned by the DESERV macro.                            00070000
DESRS_BAD_DCII               EQU  X'0466' DCII EYE CATCHER BAD   @09A   00070002
DESRS_IGWLOCK_FAILED         EQU  X'0465' A call to IGWLOCK to get a    00070004
*                                      PDSE directory lock failed@08A   00070005
DESRS_MEM_COUNTS_CONCAT_ALL  EQU  X'0464' MEMBER_COUNTS and CONCAT(ALL) 00070006
*                                      are mutually exclusive    @08A   00070007
DESRS_PACB_PTR_ZERO          EQU  X'0463' An igwftokm extract returned  00070008
*                                      a pacb address of zero    @07C   00070009
DESRS_EARLY_EOF              EQU  X'0462' A C370LIB DIRECTORY IS BAD.   00070010
*                                      GOT EOF BEFORE END RECORD @06A   00070020
DESRS_BAD_ESD_NAME           EQU  X'0461' A C370LIB DIRECTORY IS BAD.   00070030
*                                  FIRST RECORD IS NOT ESD FOR          00070040
*                                  EITHER @@DC370$ OR @@DC390$   @06A   00070050
DESRS_IGWLSRXL_FAILED        EQU  X'0460' A call to RELEASE             00070100
*                                      the DCII latch failed     @05A   00070200
DESRS_IGWLSOXL_FAILED        EQU  X'045F' A call to OBTAIN  the         00070300
*                                      DCII latch failed         @05A   00070400
DESRS_IGWLSIXL_FAILED        EQU  X'045E' A call to initialize          00070500
*                                      the DCII latch failed     @05A   00070600
DESRS_IGWLSNXL_FAILED        EQU  X'045D' A call to nullify the         00070700
*                                      DCII latch failed         @05A   00070800
DESRS_DEFER_ANCHOR_OBTAIN    EQU  X'045C' AN ERROR OCCURED PROCESSING   00070900
*                                      a defer ANCHOR OBTAIN REQ.@05A   00071000
DESRS_DEFER_ANCHOR_RELEASE   EQU  X'045B' AN ERROR OCCURED PROCESSING   00071100
*                                      a defer ANCHOR RELEASE REQ@05A   00071200
DESRS_DEFER_ANCHOR_PURGE     EQU  X'045A' AN ERROR OCCURED PROCESSING   00071300
*                                      a defer ANCHOR PURGE REQ  @05A   00071400
DESRS_DEFER_ELEMENT_PURGE    EQU  X'0459' AN ERROR OCCURED PROCESSING   00071500
*                                      a defer ELEMENT PURGE REQ @05A   00071600
DESRS_MEMBER_PEND_DELETE     EQU  X'0458' A FUNC=PUT request specified  00071700
*                                      an alias name for a primary      00071800
*                                      which was deleted by the time    00071900
*                                      the alias name was to be added   00072000
*                                      to the directory, therefore      00072100
*                                      no directory update was          00072200
*                                      performed for the name.     @04A 00072300
DESRS_LONG_NAME_NOT_ORIGINAL EQU  X'0457' A FUNC=RENAME request         00072400
*                                         specified a new name which    00072500
*                                         is greater than 63 bytes long 00072600
*                                         and was not an original name  00072700
*                                         for the program object        00072800
DESRS_NEW_NAME_EXISTS        EQU  X'0456' A FUNC=RENAME request         00072900
*                                         specified a new name which    00073000
*                                         already exists in the pdse    00073100
DESRS_BOTH_NAMES_BIG         EQU  X'0455' A FUNC=RENAME request         00073200
*                                         specified a new name and a    00073300
*                                         old name which were both      00073400
*                                         greater than 63 bytes         00073500
DESRS_BOTH_NAMES_SAME        EQU  X'0454' A FUNC=RENAME request         00073600
*                                         specified a new name and a    00073700
*                                         old name which were the same  00073800
**************                                                          00073900
DESRS_INVAL_PREVDST_HEADER   EQU  X'0453' The DST header is invalid     00074000
*                                         for the DST pointed to by     00074100
*                                         DESP_PREV_DSTPTR_PTR. This is 00074200
*                                        checked for EXIT_OPTION=DELETE 00074300
DESRS_PREV_DSTPTR_PTR_ZERO   EQU  X'0452' The pointer to the previous   00074400
*                                         DST is zero. This is checked  00074500
*                                         for EXIT_OPTION=DELETE        00074600
DESRS_DST_COMP_SWAP_FAILED   EQU  X'0451' AN EXIT_OPTION=DELETE         00074700
*                                         specified a DST address which 00074800
*                                         was not current, the compare  00074900
*                                         and swap failed.              00075000
DESRS_EXIT_SCOPE_INVALID     EQU  X'0450' The EXIT_SCOPE specified      00075100
*                                         is not supported              00075200
DESRS_EXIT_OPTION_INVALID    EQU  X'044F' The EXIT_OPTION specified     00075300
*                                         is not supported              00075400
DESRS_EXIT_PREV_DSTPTR_ZERO  EQU  X'044E' The EXIT_PREV_DSTPTR parm     00075500
*                                         was not set                   00075600
DESRS_INVAL_DST_HEADER       EQU  X'044D' The DST header is not         00075700
*                                         correct                       00075800
DESRS_EXIT_DST_PTR_ZERO      EQU  X'044C' A ZERO DESP_EXIT_DST_PTR      00075900
*                                         was passed in                 00076000
DESRS_DST_ALREADY_EXISTS     EQU  X'044B' An EXIT exists and DESERV     00076100
*                                         FUNC EXIT with NOREPLACE      00076200
*                                         specified was issued,         00076300
*                                         current exit is not replaced  00076400
DESRS_EXIT_ERROR             EQU  X'044A' Invalid return code           00076500
*                                         set by DESERV EXIT            00076600
*                                                                       00076700
DESRS_AUTH_ERROR             EQU  X'0449' Caller not supervisor state,  00076800
*                                         or system key                 00076900
*                                                                       00077000
*                                                                       00077100
DESRS_PACBLOC_ERROR          EQU  X'0448' A call to the pacb_locate     00077200
*                                         routine failed.               00077300
*                                                                       00077400
DESRS_UNKNOWN                EQU  X'0447' Issued by DESERV recovery     00077500
*                                         routine when entered for      00077600
*                                         unknown reason (eg prog ck)   00077700
*                                         while the exit routines were  00077800
*                                         NOT in control. Most likely   00078000
*                                         a prog ck in a DESERV module. 00078200
*                                                                       00078400
DESRS_GETMAIN_ERROR          EQU  X'0446' A call to GETMAIN failed      00078600
*                                                                       00078800
DESRS_CANT_CHANGE_RECOVERY   EQU  X'0445' A call to IGWFECHG failed     00079000
*                                                                       00079200
DESRS_IGWCDFNC_ERROR         EQU  X'0444' A call to IGWCDFNC failed@L1C 00079500
*                                                                       00079800
DESRS_NO_PNAR_FOR_NAME       EQU  X'0443' A name record was obtained    00080000
*                                         from jcdm but no associated   00080200
*                                         PNAR was found                00080400
*                                                                       00080600
DESRS_UNEXPECTED_SAR_CODE    EQU  X'0442' An unexpected Standard        00080800
*                                         Attribute Record (SAR) code   00081000
*                                         was found when reading        00081200
*                                         attribute records             00081400
*                                                                       00081600
*                                                                       00081800
DESRS_TWO_MLT_NAMES          EQU  X'0441' Two mlt names were found for  00082000
*                                         a single member               00082200
*                                                                       00082400
DESRS_PDSDE_MERGE_ERR        EQU  X'0440' PDSDE merge into PMAR failed  00082600
*                                                                       00082800
DESRS_UNKNOWN_EXIT_ERROR     EQU  X'043F' Issued by the DESERV recovery 00083000
*                                         routine when entered for an   00083200
*                                         unknown reason (eg prog chk)  00083400
*                                         while the exit routine was in 00083600
*                                         control. Most likely an exit  00083800
*                                         error.                        00084000
*                                                                       00084200
DESRS_ECB_POSTED_ERROR       EQU  X'043E' An I/O error occurred,        00084400
*                                         the post code in the ECB      00084600
*                                         was unexpected                00084800
*                                                                       00085000
DESRS_CONNID_OVERFLOW        EQU  X'043D' The maximum allowable         00085200
*                                         connection identifiers (64k)  00085400
*                                         was allocated and a request   00085600
*                                         to add one more failed.       00085800
*                                                                       00086000
DESRS_NAME_IS_PRIMARY_NAME   EQU  X'043C' Alias name specified is a     00086200
*                                         primary name and the options  00086400
*                                         did not allow for deleting    00086600
*                                         primary names.                00086800
*                                                                       00087000
DESRS_CLOCK_ERROR            EQU  X'043B' An STCK instruction failed    00087200
*                                                                       00087400
DESRS_DATA_LENGTH_ERROR      EQU  X'043A' Desd data length is invalid,  00087600
*                                         must be greater than 0        00087800
*                                         and less than 108 bytes.      00088000
*                                                                       00088200
DESRS_ANCHOR_IN_USE          EQU  X'0439' An obtain for a DCLA was      00088400
*                                         attempted but the anchor      00088600
*                                         was not free                  00088800
*                                                                       00089000
DESRS_ANCHOR_FREE            EQU  X'0438' A purge for a DCLA was        00089200
*                                         attempted but the anchor was  00089400
*                                         not in use                    00089600
*                                                                       00089800
DESRS_ADD_STACK_FAILED       EQU  X'0437' Non-zero return code from     00090000
*                                         an IGWFESTK request           00090200
*                                                                       00090400
DESRS_INVALID_CONN_INTENT    EQU  X'0436' The connect intent            00090600
*                                         specified is not valid        00090800
*                                         with this function            00091000
*                                                                       00091200
DESRS_NAME_LIST_@_INVALID    EQU  X'0435' The address of the NAME_LIST  00091400
*                                         structure is 0                00091600
*                                                                       00091800
DESRS_NAME_LIST_COUNT_INVALID EQU  X'0434' The count of entries in      00092000
*                                          the NAME_LIST was 0          00092200
*                                                                       00092400
DESRS_CONNID_INVALID         EQU  X'0433' The connect identifier in     00092600
*                                         SMDE provided is not valid    00092800
*                                                                       00093000
DESRS_INVALID_GETTYPE        EQU  X'0432' The GET function accepts      00093200
*                                         only a NAME_LIST or a PDSDE.  00093400
*                                         Neither was provided          00093600
*                                                                       00093800
DESRS_INVALID_AREA_PTR       EQU  X'0431' The address of a DESB         00094000
*                                         provided is 0                 00094200
*                                                                       00094400
DESRS_INVALID_AREAPTR_PTR    EQU  X'0430' The address of the AREAPTR    00094600
*                                         is 0                          00094800
*                                                                       00095000
DESRS_AREA_LENGTH_TOO_SMALL  EQU  X'042F' The length of the area        00095200
*                                         provided was insufficient.    00095400
*                                         For the GET function, area    00095600
*                                         length must be larger than    00095800
*                                         the fixed portion of the DESB 00096000
*                                                                       00096200
DESRS_INVALID_ENTRY_GAP      EQU  X'042E' Gap specfied was too large.   00096400
*                                         This gap must not be larger   00096600
*                                         than DESP_ENTRY_GAP_MAX       00096800
*                                                                       00097000
*                                                                       00097200
DESRS_INVALID_DE_LIST_PTR    EQU  X'042D' The address of the DE_LIST    00097400
*                                         parameter was 0               00097600
*                                                                       00097800
DESRS_INVALID_DE_LIST_CNT    EQU  X'042C' The number of entries in the  00098000
*                                         DE_LIST was 0                 00098200
*                                                                       00098400
DESRS_INVALID_CONN_ID_PTR    EQU  X'042B' The address of the CONN_ID    00098600
*                                         parameter was 0               00098800
*                                                                       00099000
DESRS_INVALID_RELEASE_TYPE   EQU  X'042A' The RELEASE function          00099200
*                                         must be specified with        00099400
*                                         the CONN_ID parameter or      00099600
*                                         the DE_LIST parameter         00099800
*                                                                       00100000
DESRS_INVALID_PUT_OPTION     EQU  X'0429' PUT function requires         00100200
*                                         OPTION field be specified.    00100400
*                                                                       00100600
*                                                                       00100800
DESRS_INVALID_MEM_DATA_PTR   EQU  X'0428' The address of the MEM_DATA   00101000
*                                         block is 0                    00101200
*                                                                       00101400
DESRS_INVALID_MEM_DATA_CNT   EQU  X'0427' The count of entries in       00101600
*                                         MEM_DATA block is 0           00101800
*                                                                       00102000
DESRS_INVALID_NAME_PTR       EQU  X'0426' The address of the NAME       00102200
*                                         parameter is 0                00102400
*                                                                       00102600
DESRS_INVALID_NAME_LENGTH    EQU  X'0425' The length of a name          00102800
*                                         was either 0 or greater       00103000
*                                         than 8.                       00103200
*                                                                       00103400
DESRS_UNSUPPORTED_FUNC       EQU  X'0424' The FUNC value is incorrect   00103600
*                                                                       00103800
DESRS_DEB_REQUIRES_AUTH      EQU  X'0423' To pass the DEB the caller    00104000
*                                         must be in supervisor state   00104200
*                                         or a privileged key           00104400
*                                                                       00104600
DESRS_INVALID_DCB_PTR        EQU  X'0422' The address of the DCB is 0   00104800
*                                                                       00105000
DESRS_DCB_NOT_OPEN           EQU  X'0421' The passed DCB is not opened  00105200
*                                                                       00105400
DESRS_COMP_NAME_BAD          EQU  X'0420' A compressed name is          00105500
*                                   inconsistant for some reason (such  00105600
*                                   as the the index value is greater   00105700
*                                   than the number of names defined    00105800
*                                   for the program object       @L1C   00105900
*                                                                       00106000
DESRS_DCB_NOT_OPEN_OUTPUT    EQU  X'041F' With function PUT the DCB     00106100
*                                         must be opened for output     00106200
*                                                                       00106400
DESRS_INVALID_DEB_PTR        EQU  X'041E' Address of the DEB is 0 or    00106600
*                                         DCB was input but the DCB     00106800
*                                         pointed to by the DEB did     00107000
*                                         not point back to the DEB     00107200
*                                                                       00107400
DESRS_DEBCHK_FAILED          EQU  X'041D' The DEBCHK macro failed.      00107600
*                                         The DCB or DEB was invalid    00107800
*                                                                       00108000
DESRS_INVALID_CONCAT         EQU  X'041C' The concatenation number      00108200
*                                         specified is greater than     00108400
*                                         the concatenation number      00108600
*                                         of last data set in the       00108800
*                                         the concatenation             00109000
*                                                                       00109200
DESRS_PDSDE_PTR_INVALID      EQU  X'041B' Address of the PDSDE is 0     00109400
*                                                                       00109600
DESRS_INVALID_FT             EQU  X'041A' File token is invalid         00109800
*                                                                       00110000
DESRS_LIB_NOT_BUFFERED       EQU  X'0419' ** INTERNAL CODE **           00110200
*                                                                       00110400
DESRS_INVALID_DFNC_FUNC      EQU  X'0418' An internal function call     00110600
*                                         to IGWCDFNX was invalid       00110800
*                                         because the function code     00111000
*                                         was invalid                   00111200
*                                                                       00111400
DESRS_DISCONNECT_FILE_FAILED EQU  X'0417' A call to disconnect files    00111600
*                                         was rejected                  00111800
*                                                                       00112000
DESRS_INSUF_BUFFER_SIZE      EQU  X'0416' Area provided is too small    00112200
*                                                                       00112400
DESRS_PDS_NOT_SUPPORTED      EQU  X'0415' This function requires a      00112600
*                                         PDSE data set                 00112800
*                                                                       00113000
DESRS_INVALID_CT             EQU  X'0414' Connect token invalid.        00113200
*                                                                       00113400
DESRS_INVALID_MLT            EQU  X'0413' MLT is not valid (PUT func).  00113500
*                                         Caller appears to have tried  00113600
*                                         to update the mlt field       00113700
*                                         (UPDATE function).            00113800
*                                                                       00113900
DESRS_MORE_THAN_1_PRIMARY    EQU  X'0412' The MEM_DATA must have only   00114000
*                                         one member designated as      00114200
*                                         primary                       00114400
*                                                                       00114600
DESRS_INVALID_PARM_LIST_HEADER EQU  X'0411' The id, length, or level    00114800
*                                           of the DESP is invalid      00115000
*                                                                       00115200
DESRS_INVALID_NAME_PREFIX    EQU  X'0410' The first 8 bytes of a name   00115400
*                                         were all X'FF'                00115600
*                                                                       00115800
DESRS_NO_PRIMARY_NAME        EQU  X'040F' The MEM_DATA must have one    00116000
*                                         member designated as primary  00116200
*                                                                       00116400
DESRS_NAME_ALREADY_EXISTS    EQU  X'040E' The PUT failed because of a   00116600
*                                         name conflict                 00116800
*                                                                       00117000
DESRS_LONG_NAME_AND_LLA      EQU  X'040D' LLA does not support long     00117200
*                                         names                         00117400
*                                                                       00117600
DESRS_PROGRAM_OBJECT_ONLY    EQU  X'040C' Function supports PDSE        00117700
*                                         program objects only          00117800
*                                                                       00118000
DESRS_FREEMAIN_ERROR         EQU  X'040B' FREEMAIN failure              00118200
*                                                                       00118400
DESRS_CONVERT_ERROR          EQU  X'040A' Error converting TTR          00118600
*                                         to CCHHR                      00118800
*                                                                       00119000
DESRS_UNEXPECTED_JCDM_ERROR  EQU  X'0409' JCDM returned an unexpected   00119200
*                                         return and reason code        00119400
*                                         combination                   00119600
*                                                                       00119800
DESRS_PDSDE_CONVRT_ERR       EQU  X'0408' Error converting PDSDE        00120000
*                                         to PMAR                       00120200
*                                                                       00120400
DESRS_SETLOCK_ERR            EQU  X'0407' Bad return code from SETLOCK  00120600
*                                                                       00120800
DESRS_EXTRACT_ERROR          EQU  X'0406' IGWFTOKM EXTRACT failed       00121000
*                                                                       00121200
DESRS_SET_ERROR              EQU  X'0405' IGWFTOKM SET failed           00121400
*                                                                       00121600
DESRS_ANCHOR_CREATE_FAILED   EQU  X'0404' Number of CONNIDs exceeded    00121800
*                                                                       00122000
DESRS_ELEMENT_CREATE_FAILED  EQU  X'0403' No space to store connections 00122200
*                                                                       00122400
DESRS_PMAR_MERGE_ERR         EQU  X'0402' PMARA to PMAR merge failed    00122600
*                                                                       00122800
DESRS_IEWLCNVT_ERROR         EQU  X'0401' IEWLCNVT macro call error@L1C 00123000
*                                                                       00123200
DESRS_NAME_NOT_DEFINED       EQU  X'0400' name to be replaced did       00123400
*                                         not previously exist          00123600
*                                                                       00123800
DESRS_CHANGED_PMAR_LENGTH    EQU  X'03FF' For an UPDATE function, the   00123900
*                                         caller has changed the length 00124000
*                                         of the PMAR.             @L2C 00124100
*                                                                       00124200
DESRS_SMDE_TOKEN_BAD         EQU  X'03FE' The smde input defined a      00124300
*                                        token section which was deemed 00124400
*                                         to be bad. The item number    00124500
*                                         may have been inconsistant    00124600
*                                         the alias flag.               00124700
*                                                                       00124800
DESRS_PRI_NM_THIS_FILE       EQU  X'03FD' alias name is same name as    00124900
*                                         primary name for this member  00125000
*                                                                       00125200
*                                                                       00125400
DESRS_CANT_GET_FILELOCK      EQU  X'03FC' file lock unavailable, pos-   00125600
*                                         sible sharing problem         00125800
*                                                                       00126000
DESRS_CONNECTION_NOT_FOUND   EQU  X'03FB' The connection specified in   00126200
*                                         the SMDE could not be found.  00126400
*                                         Possible user error           00126600
*                                                                       00126800
DESRS_DESL_SMDE_PTR          EQU  X'03FA' The SMDE for the release      00127000
*                                         function had a null pointer   00127200
*                                         or eyecatcher was invalid     00127400
*                                                                       00127600
DESRS_RELTYPE_INVALID        EQU  X'03F9' The release function was      00127800
*                                         expecting a subfunction code  00128000
*                                         of connid or smde list.       00128200
*                                         Neither was specified         00128400
*                                                                       00128600
DESRS_BAD_PMAR_FIELD_UPDATED EQU  X'03F8' For the DESERV function       00128700
*                                         UPDATE, the caller updated    00128800
*                                         a field in the PMAR which is  00128900
*                                         not supported for update.     00129000
DESRS_IEWBXILO_ERROR         EQU  X'03F7' a call to iewbxilo returned   00129100
*                                        an unexpected return code @L1C 00129200
*                                                                       00129300
DESRS_MULTIPLE_ERRORS        EQU  X'03F6' MORE THAN ONE ERROR HAS @L1C  00129400
*                                        OCCURRED. CHECK CODES IN       00129500
*                                        DESL                           00129600
*                                                                       00129700
DESRS_AUTH_SUBPOOL           EQU  X'03F5' Caller specified an           00129800
*                                         authorized subpool, but is    00129900
*                                         not authorized                00130000
*                                                                       00130200
DESRS_DIRECTORY_EMPTY        EQU  X'03F4' No members in directory       00130400
*                                                                       00130600
DESRS_CONNECT_AUTH           EQU  X'03F3' A DESERV GET_ALL call was     00130700
*                                         made where the CONNECT=HOLD   00130800
*                                         parameter was specified but   00130900
*                                         the caller was not in a       00131000
*                                         system key nor in supervisor  00131100
*                                         state.                 @XXA   00131200
*                                                                       00131300
DESRS_C370LIB_PDSDE_ME       EQU  X'03F2' C370LIB(YES) and PDSDE are    00131400
*                                         mutually exclusive      @L3A  00131500
*                                                                       00131600
DESRS_BAD_BLKSIZE            EQU  X'03F1' DCBBLKSI is too small   @L3A  00131700
*                                                                       00131800
DESRS_BAD_TXT_CARD           EQU  X'03F0' while processing a C370LIB    00131900
*                                         directory, inconsistancies    00132000
*                                         were found in the txt         00132100
*                                         records                 @L3A  00132200
*                                                                       00132300
DESRS_BAD_C370LIB_DIR        EQU  X'03EF' the C370LIB directory         00132400
*                                         indicates that a symbol is    00132500
*                                         associated with a member name 00132600
*                                         but that name does not exist  00132700
*                                         in the PDS directory.   @L3A  00132800
*                                                                       00132900
DESRS_DCB_NOT_OPEN_PO        EQU  X'03EE' the DCB was not opened with   00133000
*                                         DSORG=PO. This applies only   00133100
*                                         to the get function when      00133200
*                                         C370LIB=YES.            @L3A  00133300
*                                                                       00133400
DESRS_AREA_AREAPTR_ME        EQU  X'03ED' AREA and AREAPTR are mutually 00133500
*                                         exclusive               @L3A  00133600
*                                                                       00133700
DESRS_SMDE_PTR_INVALID       EQU  X'03EC' For GETTYPE=SMDE, the input   00133800
*                                         SMDE pointer was zero   @L3A  00133900
DESRS_C370LIB_SMDE_ME        EQU  X'03EB' The SMDE parameter is         00134000
*                                         mutually exculsive with       00134100
*                                         C370LIB(YES)            @L3A  00134200
DESRS_NOTFOUND               EQU  X'03EA' Some members not found        00134400
*                                                                       00134600
DESRS_MODULE_BUFFERED_LLA    EQU  X'03E9' The module is buffered        00134800
*                                         by lla no connection was      00135000
*                                         established.                  00135200
*                                                                       00135400
DESRS_SUCC                   EQU  X'0000' successful processing         00135600
*                                                                       00135800
.*                                                                      00136000
.* IF GLOBAL FLAG DESCSECT IS SET TO YES, THEN ECHO THE PREVIOUS        00136200
.* CSECT NAME. THIS FLAG SHOULD ONLY BE SET BY DESERV.                  00136400
.*                                                                      00136600
         GBLC   &DESCSECT                                               00136800
         AIF    ('&DESCSECT' NE 'YES').ENDMAC                           00137000
&SYSECT  CSECT                                                          00137200
.ENDMAC  ANOP                                                           00137400
         POP PRINT                                                      00137500
         MEND                                                           00137600
**/                                                                     00137800
*%DESPLX: ;                                                             00138000
*/********************************************************************/ 00138200
*/* Parameter List for DESERV                                        */ 00138400
*/********************************************************************/ 00138600
*DECLARE                                                                00138800
*1 DESP BDY(WORD) BASED,            /* DE Services parm list         */ 00139000
* 3 DESP_HEADER,                    /* Standard Header               */ 00139200
*  5 DESP_ID        CHAR(8),        /* eyecatcher (IGWDES_P)         */ 00139400
*  5 DESP_LEN       FIXED(31),      /* length of buffer              */ 00139600
*  5 DESP_LEV       CHAR(1),        /* control block level           */ 00139800
*  5 *              CHAR(3),        /* RESERVED                      */ 00140000
* 3 DESP_FUNC      FIXED(8),        /* function type (GET_ALL, GET,     00140200
*                                      PUT, RELEASE, GET_NAMES, EXIT,   00140300
*                                      DELETE, RENAME, UPDATE)       */ 00140400
* 3 *              CHAR(3),         /* RESERVED                      */ 00140600
* 3 DESP_MEMBER_COUNTS_PTR PTR(31), /* pointer to optional output       00140810
*                  from GET_ALL function. Points to two fullwords which 00140820
*                  will contain the number of primary names returned and00140830
*                  the number of primary names as indicated in the PDSE 00140840
*                  attribute record field. This is only valid when      00140850
*                  processing a single PDSE library.             @08A*/ 00140860
* 3 DESP_DATA      BDY(WORD),       /* function data                 */ 00141000
*  5 DESP_FLAGS      BIT(16),       /*                               */ 00141200
*   7 DESP_BYPASS_LLA BIT(1),       /* 0=USE LLA, 1=BYPASS LLA       */ 00141400
*   7 DESP_CONCAT_FLG BIT(1),       /* CONCAT parameter specified    */ 00141600
*   7 DESP_SUBPOOL_FLG BIT(1),      /* SUBPOOL parameter specified   */ 00141800
*   7 DESP_C370LIB     BIT(1),      /* C370LIB parameter specified      00141900
*                                                                @L3A*/ 00142000
*   7 DESP_CONCAT_ALL  BIT(1),      /*ONLY VALID IF                     00142100
*                                      DESP_CONCAT_FLG IS ON.           00142200
*                                      1=GET_ALL RETURNS INFO FOR       00142300
*                                        ALL DATA SETS IN CONCAT.       00142400
*                                      0=GET_ALL RETURNS INFO ONLY      00142500
*                                       FOR THE DATA SET IDENTIFIED     00142600
*                                       BY DESP_CONCAT           @L3A*/ 00142700
*                                                                       00142800
*   7 DESP_HIDE        BIT(1),      /* 0=all names are visible          00142900
*                                      1=hidden names are not           00143000
*                                       visible in name search.  @L3A*/ 00143100
*   7 DESP_SYSTEM_DCB  BIT(1),      /* 0=SYSTEM_DCB parameter not       00143200
*                                        specified.                     00143300
*                                      1=treat input DCB as a system    00143400
*                                        DCB.                    @L3A*/ 00143500
*                                                                       00143600
*  5  DESP_EXIT_SCOPE FIXED(8),     /* EXIT SCOPE, TCB OR GLOBAL     */ 00143700
*                                                                       00143800
*  5 DESP_CONCAT     FIXED(8),      /* concatenation number          */ 00143900
*                                                                       00144000
*  5 DESP_LIBTYPE    FIXED(8),      /* function subtype (DCB, DEB)   */ 00144100
*  5 DESP_GETTYPE    FIXED(8),      /* function subtype (NAME_LIST or   00144200
*                                      PDSDE)                        */ 00144300
*  5 DESP_RELTYPE    FIXED(8),      /* function subtype (DE_LIST or     00144400
*                                      CONN_ID)                      */ 00144500
*  5 DESP_EXIT_OPTION FIXED(8),     /* EXIT OPTION                   */ 00144600
*                                                                       00144700
*  5 DESP_OPTION     FIXED(8),      /* PUT REPLACE OPTION            */ 00144800
*  5 DESP_SUBPOOL    FIXED(8),      /* SUBPOOL identifier            */ 00144900
*  5 DESP_CONN_INTENT FIXED(8),     /* connect intent ( NONE, HOLD,     00145000
*                                      EXEC, INPUT)                  */ 00145100
*  5 *               FIXED(8),      /* RESERVED                      */ 00145200
* 3 DESP_DCB_PTR     PTR(31),       /* DCB address                   */ 00145600
* 3 DESP_DEB_PTR     PTR(31),       /* DEB address                   */ 00145800
* 3 DESP_CONN_ID_PTR PTR(31),       /* connect identifier address    */ 00146000
* 3 DESP_AREAPTR_PTR PTR(31),       /* address for buffer address    */ 00146200
* 3 DESP_AREA_PTR    PTR(31),       /* buffer address                */ 00146400
* 3 DESP_AREA2       FIXED(32),     /* buffer length                 */ 00146600
* 3 DESP_DE_LIST_PTR PTR(31),       /* DE_LIST address               */ 00146800
* 3 DESP_DE_LIST2    FIXED(32),     /* DE_LIST entry count           */ 00147000
* 3 DESP_ENTRY_GAP   FIXED(31),     /* entry gap size                */ 00147200
* 3 DESP_MEM_DATA_PTR PTR(31),      /* MEM_DATA address              */ 00147400
* 3 DESP_MEM_DATA2   FIXED(32),     /* MEM_DATA entry count          */ 00147600
* 3 DESP_NAME_LIST_PTR PTR(31),     /* name list address             */ 00147800
* 3 DESP_NAME_LIST2  FIXED(32),     /* input list number of entries  */ 00148000
* 3 DESP_NAME_PTR    PTR(31),       /* name address                  */ 00148200
* 3 DESP_PDSDE_PTR   PTR(31),       /* bldl directory entry address  */ 00148400
*   5 DESP_SMDE_PTR  PTR(31),       /* SMDE input for FUNC(GET)  @L3A*/ 00148500
* 3 DESP_EXIT_DST_PTR    PTR(31),   /* DESERV screen table address   */ 00148600
* 3 DESP_EXIT_PREV_DSTPTR_PTR  PTR(31), /* Address of pointer to        00148800
*                                      previous DST                  */ 00149000
*DESP_ENTRY_GAP_MAX  FIXED CONSTANT(2048),/* maximum entry gap       */ 00149400
*                                                                       00149600
*DESP_FUNC_DEFER_RELEASE   FIXED(8) CONSTANT(10),/* DEFER REQUEST@05A*/ 00149700
*DESP_FUNC_UPDATE    FIXED(8) CONSTANT(9),/* UPDATE request      @L2A*/ 00149800
*DESP_FUNC_RENAME    FIXED(8) CONSTANT(8),/* RENAME request      @L2A*/ 00149900
*DESP_FUNC_DELETE    FIXED(8) CONSTANT(7),/* DELETE request      @L2A*/ 00150000
*DESP_FUNC_EXIT      FIXED(8) CONSTANT(6),/* EXIT request            */ 00150100
*DESP_FUNC_GET_NAMES FIXED(8) CONSTANT(5),/* GET_NAMES request       */ 00150200
*DESP_FUNC_PUT       FIXED(8) CONSTANT(4),/* PUT request             */ 00150300
*DESP_FUNC_RELEASE   FIXED(8) CONSTANT(3),/* RELEASE request         */ 00150400
*DESP_FUNC_GET_ALL   FIXED(8) CONSTANT(2),/* GET_ALL request         */ 00150600
*DESP_FUNC_GET       FIXED(8) CONSTANT(1),/* GET request             */ 00150800
*DESP_FUNC_OMITTED   FIXED(8) CONSTANT(0),/* not specified           */ 00151000
*                                                                       00151200
*DESP_ID_IV  CHAR(8) CONSTANT('IGWDESP '), /* parm list eyecatcher   */ 00151400
*DESP_LEN_IV FIXED CONSTANT(LENGTH(DESP)), /* parm list length       */ 00151600
*DESP_LEV_IV FIXED CONSTANT(1),           /* parm list level         */ 00151800
*                                                                       00152000
*DESP_EXIT_SCOPE_GLOBAL  FIXED(8) CONSTANT(0), /* Setup a GLOBAL EXIT*/ 00152200
*DESP_EXIT_SCOPE_TASK    FIXED(8) CONSTANT(1), /* Setup a TASK EXIT  */ 00152400
*                                                                       00152600
*DESP_CONN_INTENT_INPUT  FIXED(8) CONSTANT(3), /* */                    00152800
*DESP_CONN_INTENT_EXEC   FIXED(8) CONSTANT(2), /* */                    00153000
*DESP_CONN_INTENT_HOLD   FIXED(8) CONSTANT(1), /* connect for hold   */ 00153200
*DESP_CONN_INTENT_NONE   FIXED(8) CONSTANT(0), /* do not connect     */ 00153400
*                                                                       00153600
*DESP_EXIT_OPTION_QUERY     FIXED(8) CONSTANT(3), /* QUERY an           00154400
*                                                    existing exit   */ 00154600
*DESP_EXIT_OPTION_DELETE    FIXED(8) CONSTANT(2), /* delete an          00154800
*                                                    existing exit   */ 00155000
*DESP_EXIT_OPTION_REPLACE   FIXED(8) CONSTANT(1), /* replace an         00155200
*                                                    existing exit   */ 00155400
*DESP_EXIT_OPTION_NOREPLACE FIXED(8) CONSTANT(0), /* do not replace     00155600
*                                                    existing exit   */ 00155800
*                                                                       00156000
*DESP_OPTION_REPLACE      FIXED(8) CONSTANT(1),  /*replace alias or     00156400
*                                                  primary           */ 00156600
*DESP_OPTION_NOREPLACE    FIXED(8) CONSTANT(0),  /* do not replace   */ 00156800
*                                                                       00157000
*DESP_LIBTYPE_DCB         FIXED(8) CONSTANT(2), /* DCB was input */     00157200
*DESP_LIBTYPE_DEB         FIXED(8) CONSTANT(1), /* DEB was input */     00157400
*DESP_LIBTYPE_OMITTED     FIXED(8) CONSTANT(0), /* not specified*/      00157600
*                                                                       00157800
*DESP_RELTYPE_DE_LIST     FIXED(8) CONSTANT(2), /* */                   00158000
*DESP_RELTYPE_CONN_ID     FIXED(8) CONSTANT(1), /* */                   00158200
*DESP_RELTYPE_OMITTED     FIXED(8) CONSTANT(0),/* not specified*/       00158400
*                                                                       00158600
*DESP_GETTYPE_SMDE        FIXED(8) CONSTANT(3), /* */                   00158700
*DESP_GETTYPE_PDSDE       FIXED(8) CONSTANT(2), /* */                   00158800
*DESP_GETTYPE_NAME_LIST   FIXED(8) CONSTANT(1), /* */                   00159000
*DESP_GETTYPE_OMITTED     FIXED(8) CONSTANT(0); /* not specified*/      00159200
*                                                                       00159400
*/********************************************************************/ 00159600
*/* Input_List:                                                      */ 00159800
*/*  Used by NAME_LIST for GET, DELETE, RENAME & UPDATE functions@L2A*/ 00209800
*/*  Used by DE_LIST for RELEASE function                            */ 00259800
*/*   Used to provide a list of search descriptors that will         */ 00333300
*/*   produce a member for each descriptor.                          */ 00366600
*/*   This list is an array of entries. Each entry has an            */ 00425000
*/*   input field pointing to the attribute (NAME or DE) that        */ 00450000
*/*   has been initialized by the caller.                            */ 00475000
*/********************************************************************/ 02950000
*DECLARE                                                                03000000
* 1 DESL(*) BDY(WORD) BASED,        /* name list                     */ 03050000
*  3 DESL_ENTRY BDY(WORD) CHAR(16), /* name entry                    */ 03100000
*   5 DESL_FLAGS      FIXED(8),     /* flags                     @P3C*/ 03150000
*     7 DESL_MODULE_BUFFERED_LLA BIT(1), /* module is staged by lla     03200000
*                                                                @P3A*/ 03250000
*   5 DESL_CODE       FIXED(8),     /* result code                   */ 03300000
*   5 DESL_ERRCODE    FIXED(16),    /* low order halfword is reason     03350000
*                                      reason code                   */ 03400000
*   5 *               FIXED(32),    /* reserved                      */ 03450000
*   5 DESL_SMDE_PTR   PTR(31),      /* pointer to smde               */ 03500000
*     7 DESL_NEW_NAME_PTR  PTR(31),  /* pointer to new name, for        03516600
*                                       RENAME function          @L2A*/ 03533200
*   5 DESL_NAME_PTR   PTR(31),      /* pointer to name (DESN)           03550000
*                                      descriptor                    */ 03600000
*     7 DESL_OLD_NAME_PTR  PTR(31),  /* pointer to old name, for        03607100
*                                       RENAME function          @L2A*/ 03614200
* DESL_CODE_NEWNAME_EXISTS          /* for func=rename, indicates a     03621300
*                                      new name already existed in the  03628400
*                                      PDSE                      @L2A*/ 03635500
*     FIXED(8) CONSTANT(3),                                             03642600
* DESL_CODE_ERROR                   /* an unexpected error has          03650000
*                                      occurred. The DESL_ERRCODE       03700000
*                                      field is set to a DESRS          03750000
*                                      value                         */ 03800000
*     FIXED(8) CONSTANT(2),                                             03850000
* DESL_CODE_NOTFOUND                /* entry not found or entry not     03900000
*                                      processed. if func=rename,       03933300
*                                      old name was not found        */ 03966600
*     FIXED(8) CONSTANT(1),                                             04000000
* DESL_CODE_SUCC                    /* entry successfully processed  */ 04050000
*     FIXED(8) CONSTANT(0);                                             04100000
*                                                                       04150000
*/********************************************************************/ 04200000
*/* Buffer Area Header:                                              */ 04250000
*/*   Description for fixed portion of buffer                        */ 04300000
*/********************************************************************/ 04350000
*DECLARE                                                                04400000
*1 DESB           BDY(WORD) BASED,  /* DEServ buffer header          */ 04450000
* 3 DESB_FIXED,                                                         04500000
*  5 DESB_HEADER,                                                       04550000
*   7 DESB_ID       CHAR(8),        /* EYECATCHER (IGWDESB )         */ 04600000
*   7 DESB_LEN      FIXED(31),      /* LENGTH OF DESB                */ 04650000
*   7 DESB_LEV      CHAR(1),        /* CONTROL BLOCK LEVEL           */ 04700000
*   7 *             CHAR(3),        /* reserved                      */ 04750000
*  5 DESB_NEXT      PTR(32),        /* Next buffer pointer           */ 04800000
*  5 *              PTR(32),        /* RESERVED                      */ 04850000
*  5 DESB_COUNT     FIXED(32),      /* count of entries in this         04900000
*                                      buffer                        */ 04950000
*  5 DESB_AVAIL     PTR(32),        /* Start of free space in buffer */ 05000000
*  5 *              BIT(8),         /* RESERVED                      */ 05050000
*  5 DESB_SUBPOOL   FIXED(8),       /* subpool number                */ 05100000
*  5 DESB_GAP_LEN   FIXED(16),      /* length of user requested gap  */ 05150000
*  5 *              PTR(32),        /* RESERVED                      */ 05200000
* 3 DESB_DATA       CHAR(*),        /* start of data area            */ 05250000
*                                                                       05300000
*DESB_ID_IV  CHAR(8) CONSTANT('IGWDESB '),/* DESB   eyecatcher       */ 05350000
*DESB_LEV_IV FIXED(8) CONSTANT(1);  /* buffer level                  */ 05400000
*                                                                       05450000
*/********************************************************************/ 05500000
*/* Buffer Area Entry:                                               */ 05550000
*/*   Description for the directory portion of the buffer.           */ 05600000
*/*                                                                  */ 05650000
*/********************************************************************/ 05700000
*DECLARE                                                                05750000
*  DESBE_DE CHAR(*) BASED,          /* directory entry (IGWSMDE)     */ 05800000
*  DESBE_GAP CHAR(*) BASED(ADDR(DESBE_DE)-DESB_GAP_LEN)                 05850000
*    CONSTRAINED;                   /* user gap field                */ 05900000
*                                                                       05950000
*/********************************************************************/ 06000000
*/* DESERV name descriptor                                           */ 06050000
*/********************************************************************/ 06100000
*DECLARE                                                                06150000
*  1 DESN BASED BDY(HWORD),         /* Name record                   */ 06200000
*   3 DESN_LEN  FIXED(16),          /* Length of name that follows   */ 06250000
*   3 DESN_VAL  CHAR(*);            /* name data                     */ 06300000
*                                                                       06350000
*/********************************************************************/ 06400000
*/* DESERV member data descriptor                                    */ 06450000
*/*  Used by MEM_DATA for PUT function                               */ 06500000
*/*  Used as "data" in DESB for GET_NAMES function                   */ 06550000
*/********************************************************************/ 06600000
*DECLARE                                                                06650000
*  1 DESD(*) BDY(WORD) BASED,       /* member data descriptor        */ 06700000
*   3 DESD_ENTRY CHAR(16) BDY(WORD),/* entry descriptor              */ 06750000
*    5 DESD_FLAG     BIT(8),        /* flags                         */ 06800000
*     7 DESD_FLAG_ALIAS BIT(1),     /* alias entry                   */ 06850000
*    5 DESD_CODE     FIXED(8),      /* processing code               */ 06900000
*    5 DESD_ERRCODE  FIXED(16),     /* low order halfword is            06950000
*                                      reason code                   */ 07000000
*    5 DESD_INDEX    FIXED(16),     /* Index number for name. Required  07014200
*                                      input to the PUT function if the 07028400
*                                      name length is greater than      07042600
*                                      63 bytes. This index is used in  07056800
*                                      constructing the compressed      07071000
*                                      name                      @L1A*/ 07085200
*    5 DESD_DATA_LEN FIXED(16),     /* length of data area           */ 07100000
*    5 DESD_DATA_PTR PTR(31),       /* address of data               */ 07150000
*    5 DESD_NAME_PTR PTR(31),       /* address of varying length name   07200000
*                                                                    */ 07250000
* DESD_CODE_ERROR                   /* an unexpected error has          07300000
*                                      occurred. The DESD_ERRCODE       07350000
*                                      field is set to a DESRS          07400000
*                                      value                         */ 07450000
*     FIXED(8) CONSTANT(2),                                             07500000
* DESD_CODE_NOGO                    /* the entry has not yet been       07550000
*                                      processed or processing was      07600000
*                                      terminated before this entry     07650000
*                                      was processed.                */ 07700000
*     FIXED(8) CONSTANT(1),                                             07750000
* DESD_CODE_SUCC                    /* successful processing         */ 07800000
*     FIXED(8) CONSTANT(0);                                             07850000
*                                                                       07900000
*/********************************************************************/ 07950000
*/* DESERV EXIT PLIST                                                */ 08000000
*/*   Exit plist, passed to DESERV Global or Task Level Exits        */ 08050000
*/*  (exits are established by DESERV FUNC=EXIT invocation)          */ 08100000
*/********************************************************************/ 08150000
*DECLARE                                                                08200000
*  1 DESX BDY(WORD) BASED,                                              08250000
*    3 DESX_HEADER,                                                     08300000
*     5 DESX_ID       CHAR(8),        /* EYECATCHER (IGWDESX )       */ 08350000
*     5 DESX_LEN      FIXED(31),      /* LENGTH OF DESX              */ 08400000
*     5 DESX_LEV      CHAR(1),        /* CONTROL BLOCK LEVEL         */ 08450000
*     5 *             CHAR(3),        /* reserved                    */ 08500000
*                                                                       08550000
*    3 DESX_DESP_PTR          PTR(31), /* Addr of user key DESP      */ 08600000
*    3 DESX_DST               PTR(31), /* Addr DESERV Screen Table   */ 08650000
*    3 DESX_CALLER_KEY        FIXED(8),                                 08700000
*    3 DESX_FLAGS             BIT(8),                                   08750000
*      5 DESX_BLDL_BIT        BIT(1),  /* DESERV BLDL path           */ 08800000
*      5 DESX_PRE_BIT         BIT(1),  /* EXIT invoked prior to DESERV  08850000
*                                         PUT or GET function */        08900000
*      5 DESX_POST_BIT        BIT(1),  /* EXIT invoked after DESERV     08950000
*                                         PUT or GET function */        09000000
*    3 *                      FIXED(16),  /* RESERVED */                09050000
*    3 DESX_RETURN_CODE       FIXED(32),                                09100000
*    3 DESX_REASON_CODE       FIXED(32),                                09150000
*                                                                       09200000
*DESX_ID_IV  CHAR(8) CONSTANT('IGWDESX '),/* DESX   eyecatcher       */ 09250000
*DESX_LEV_IV FIXED(8) CONSTANT(1);  /* DESX mapping level            */ 09300000
*/********************************************************************/ 09350000
*/* DESERV SCREEN TABLE                                              */ 09400000
*/*   Mapping of DESERV SCREEN TABLE, pointed to by DESP_EXIT_DST_PTR*/ 09450000
*/*   and DESX_DST_PTR                                               */ 09500000
*/*                                                                  */ 09550000
*/********************************************************************/ 09600000
*DECLARE                                                                09650000
*  1 DST BDY(WORD) BASED,                                               09700000
*    3 DST_HEADER,                                                      09750000
*     5 DST_ID       CHAR(8),         /* EYECATCHER (IGWDST )        */ 09800000
*     5 DST_LEN      FIXED(31),       /* LENGTH OF DST               */ 09850000
*     5 DST_LEV      CHAR(1),         /* CONTROL BLOCK LEVEL         */ 09900000
*     5 DST_FLAGS    FIXED(8),        /* DST flags                   */ 09950000
*       7 *          BIT(7),          /* RESERVED                    */ 10000000
*       7 DST_FLAGS_PROP  BIT(1),     /* DST flags                   */ 10050000
*     5 DST_RES      CHAR(2),         /* reserved                    */ 10100000
*                                                                       10150000
*    3 DST_EXIT_PTR          PTR(31),   /*Address of exit routine    */ 10200000
*DST_ID_IV  CHAR(8) CONSTANT('IGWDST  '),  /* DST    eyecatcher      */ 10250000
*DST_LEN_IV FIXED CONSTANT(LENGTH(DST)),   /* length of DST          */ 10300000
*DST_LEV_IV FIXED(8) CONSTANT(1);         /* control block level     */ 10350000
*                                                                       10450000
*/********************************************************************/ 10500000
*/* mapping for member_counts parameter (output from GET_ALL)    @08A*/ 10502990
*/********************************************************************/ 10505980
*declare                                                                10508970
*  1 des_member_counts char(8)                                          10511960
*                      bdy(word)                                        10514950
*                      based,                         /*         @08A*/ 10517940
*    3 des_primary_members fixed(32),     /* number of primary members  10520930
*                                      processed on this get_all        10523920
*                                      request.                  @08A*/ 10526910
*    3 des_dsar_member_count fixed(32);   /* number of primary members  10529900
*                                      as reported by the PDSE attribute10532890
*                                      field DSAR_MEMBER_COUNT.  @08A*/ 10535880
*/********************************************************************/ 10538870
*/* Misc. declarations for parameters of DESERV                      */ 10550000
*/********************************************************************/ 10600000
*DECLARE                                                                10650000
*  DES_CONN_ID   FIXED(32) BDY(WORD) BASED,/* connect id             */ 10700000
*  DES_CONN_ID_NULL FIXED(32) CONSTANT(0);/* invalid connect id      */ 10750000
*                                                                       10800000
*/********************************************************************/ 10850000
*/* Linkage declarations for DESERV macro.                           */ 10900000
*/********************************************************************/ 10950000
*DECLARE                                                                11000000
*  DESZ_CVTPTR PTR LOCATION(16),    /* CVT address                   */ 11050000
*  DESZ_DFAPTR PTR BASED(DESZ_CVTPTR+1216) CONSTRAINED,/* DFA address   11100000
*                                                                    */ 11150000
*  DESZ_DFVTPTR PTR BASED(DESZ_DFAPTR+44) CONSTRAINED,/* DFVT address   11200000
*                                                                    */ 11250000
*  DESZ_DFVDESPC FIXED(32) BASED(DESZ_DFVTPTR+84) CONSTRAINED;/* PC     11300000
*                                      location                      */ 11350000
*                                                                       11400000
*/********************************************************************/ 11450000
*/* Return Code and Reason Code mapping                              */ 11500000
*/********************************************************************/ 11550000
*DECLARE                                                                11600000
*  DESRC           FIXED(31) BASED, /* return code                   */ 11650000
*  1 DESR CHAR(4) BASED BDY(WORD),  /* reason code structure         */ 11700000
*    3 DESR_COMPID  FIXED(8),       /* DFP component id              */ 11750000
*    3 DESR_MODID   FIXED(8),       /* module id within component    */ 11800000
*    3 DESRS        FIXED(16);      /* reason code                   */ 11850000
*                                                                       11900000
*/********************************************************************/ 11950000
*/* Return Codes returned by the DESERV macro.                       */ 12000000
*/********************************************************************/ 12050000
*DECLARE                                                                12100000
*  DESRC_SUCC  FIXED  CONSTANT(00), /* successful processing         */ 12150000
*  DESRC_INFO  FIXED  CONSTANT(04), /* not completely successful     */ 12200000
*  DESRC_WARN  FIXED  CONSTANT(08), /* Results questionable          */ 12250000
*  DESRC_PARM  FIXED  CONSTANT(12), /* Missing/invalid parms         */ 12300000
*  DESRC_CALR  FIXED  CONSTANT(16), /* Caller has a problem          */ 12350000
*  DESRC_ENVR  FIXED  CONSTANT(20), /* Resources unavailable         */ 12400000
*  DESRC_IOER  FIXED  CONSTANT(24), /* I/O error                     */ 12450000
*  DESRC_MEDE  FIXED  CONSTANT(28), /* Media error                   */ 12500000
*  DESRC_DSLE  FIXED  CONSTANT(32), /* Data Set logical error        */ 12550000
*  DESRC_SEVE  FIXED  CONSTANT(36); /* Severe error                  */ 12600000
*                                                                       12650000
*/********************************************************************/ 12700000
*/* Reason Codes returned by the DESERV macro.                       */ 12750000
*/********************************************************************/ 12800000
*DECLARE                                                                12850000
*                                                                       12900000
*  DESRS_BAD_DCII                   /* DCII EYE CATCHER BAD      @09A*/ 12900001
*            FIXED(16) CONSTANT(1126),                                  12900002
*  DESRS_IGWLOCK_FAILED             /* A call to IGWLOCK to get a       12900003
*                                      PDSE directory lock failed@08A*/ 12900004
*            FIXED(16) CONSTANT(1125),                                  12900005
*  DESRS_MEM_COUNTS_CONCAT_ALL      /* MEMBER_COUNTS and CONCAT(ALL)    12900006
*                                      are mutually exclusive    @08A*/ 12900007
*            FIXED(16) CONSTANT(1124),                                  12900008
*  DESRS_PACB_PTR_ZERO              /* An IGWFTOKM extract returned a   12900009
*                                      a pacb address of zero.   @07C*/ 12900010
*            FIXED(16) CONSTANT(1123),                                  12900011
*  DESRS_EARLY_EOF                  /* A C370LIB DIRECTORY IS BAD. GOT  12900012
*                                      EOF BEFORE END RECORD.    @06A*/ 12900020
*            FIXED(16) CONSTANT(1122),                                  12900030
*  DESRS_BAD_ESD_NAME               /* A C370LIB DIRECTORY IS BAD.      12900040
*                                      FIRST RECORD IS NOT ESD FOR      12900050
*                                   EITHER @@DC370$ OR @@DC390$  @06A*/ 12900060
*            FIXED(16) CONSTANT(1121),                                  12900070
*  DESRS_IGWLSRXL_FAILED            /* A call to RELEASE the DCII       12900100
*                                      latch failed.             @05A*/ 12900200
*            FIXED(16) CONSTANT(1120),                                  12900300
*  DESRS_IGWLSOXL_FAILED            /* A call to OBTAIN the DCII latch  12900400
*                                      failed.                   @05A*/ 12900500
*            FIXED(16) CONSTANT(1119),                                  12900600
*  DESRS_IGWLSIXL_FAILED                                                12900700
*                                   /* A call to initialize             12900800
*                                      the DCII latch failed     @05A*/ 12900900
*            FIXED(16) CONSTANT(1118),                                  12901000
*  DESRS_IGWLSNXL_FAILED            /* A call to nullify the            12901100
*                                      DCII latch failed         @05A*/ 12901200
*            FIXED(16) CONSTANT(1117),                                  12901300
*  DESRS_DEFER_ANCHOR_OBTAIN        /* Error processing a deferred      12901400
*                                      ANCHOR OBTAIN REQUEST     @05A*/ 12901500
*            FIXED(16) CONSTANT(1116),                                  12901600
*  DESRS_DEFER_ANCHOR_RELEASE       /* Error processing a deferred      12901700
*                                      ANCHOR RELEASE REQUEST    @05A*/ 12901800
*            FIXED(16) CONSTANT(1115),                                  12901900
*  DESRS_DEFER_ANCHOR_PURGE         /* Error processing a deferred      12902000
*                                      ANCHOR PURGE REQUEST      @05A*/ 12902100
*            FIXED(16) CONSTANT(1114),                                  12902200
*  DESRS_DEFER_ELEMENT_PURGE        /* Error processing a deferred      12902300
*                                      ELEMENT PURGE REQUEST     @05A*/ 12902400
*            FIXED(16) CONSTANT(1113),                                  12902500
*  DESRS_MEMBER_PEND_DELETE         /* A FUNC=PUT request specified an  12902600
*                                      alias name for a primary which   12902700
*                                      was deleted by the time the      12902800
*                                      alias name was to be added to    12902900
*                                      the directory, therefore no      12903000
*                                      directory update was performed   12903100
*                                      for the alias name.       @04A*/ 12903200
*            FIXED(16) CONSTANT(1112),                                  12903300
*  DESRS_LONG_NAME_NOT_ORIGINAL     /* A FUNC=RENAME request specified  12903400
*                                      a new name which is greater than 12905200
*                                      63 bytes long and was not an     12907800
*                                      original name for the program    12910400
*                                      object                        */ 12913000
*            FIXED(16) CONSTANT(1111),                                  12915600
*  DESRS_NEW_NAME_EXISTS            /* A FUNC=RENAME request specified  12918200
*                                      a new name which already exists  12920800
*                                      in the PDSE                   */ 12923400
*            FIXED(16) CONSTANT(1110),                                  12926000
*  DESRS_BOTH_NAMES_BIG             /* A FUNC=RENAME request specified  12928600
*                                      a new name and a old name which  12931200
*                                     were both greater than 63 bytes*/ 12933800
*            FIXED(16) CONSTANT(1109),                                  12936400
*  DESRS_BOTH_NAMES_SAME            /* A FUNC=RENAME request            12939000
*                                      specified a new name and a       12941600
*                                      old name which were the same  */ 12944200
*            FIXED(16) CONSTANT(1108),                                  12946800
*  DESRS_INVAL_PREVDST_HEADER       /* The DST header is not correct    12950000
*                                      for the DST pointed to by        13000000
*                                      DESP_PREV_DSTPTR_PTR. This is    13050000
*                                      checked for EXIT_OPTION=DELETE*/ 13100000
*            FIXED(16) CONSTANT(1107),                                  13150000
*  DESRS_PREV_DSTPTR_PTR_ZERO       /* The pointer to the previous DST  13200000
*                                      is zero. This is checked for     13250000
*                                      EXIT_OPTION=DELETE.           */ 13300000
*            FIXED(16) CONSTANT(1106),                                  13350000
*  DESRS_DST_COMP_SWAP_FAILED       /* An EXIT_OPTION=DELETE specified  13400000
*                                      a DST address which was not      13450000
*                                      current, the compare and swap    13500000
*                                      failed.                       */ 13550000
*            FIXED(16) CONSTANT(1105),                                  13600000
*  DESRS_EXIT_SCOPE_INVALID         /* The EXIT_SCOPE specified is      13650000
*                                      not supported                 */ 13700000
*            FIXED(16) CONSTANT(1104),                                  13750000
*  DESRS_EXIT_OPTION_INVALID        /* The EXIT_OPTION specified is     13800000
*                                      not supported                 */ 13850000
*            FIXED(16) CONSTANT(1103),                                  13900000
*  DESRS_EXIT_PREV_DSTPTR_ZERO      /* The EXIT_PREV_DSTPTR parm was    13950000
*                                      not set                       */ 14000000
*            FIXED(16) CONSTANT(1102),                                  14050000
*  DESRS_INVAL_DST_HEADER           /* The DST header is not            14100000
*                                      correct                       */ 14150000
*            FIXED(16) CONSTANT(1101),                                  14200000
*  DESRS_EXIT_DST_PTR_ZERO          /* A ZERO DESP_EXIT_DST_PTR         14250000
*                                      was passed in                 */ 14300000
*                                                                       14350000
*            FIXED(16) CONSTANT(1100),                                  14400000
*  DESRS_DST_ALREADY_EXISTS         /* An EXIT EXISTS and DESERV        14450000
*                                      FUNC EXIT with NOREPLACE         14500000
*                                      specified was issued             14550000
*                                      current EXIT is NOT REPLACED  */ 14600000
*            FIXED(16) CONSTANT(1099),                                  14650000
*  DESRS_EXIT_ERROR                 /* Invalid return code set by       14700000
*                                      DESERV Exit                  */  14750000
*            FIXED(16) CONSTANT(1098),                                  14800000
*  DESRS_AUTH_ERROR                 /* Caller not supervisor state, or  14850000
*                                      system key                    */ 14900000
*            FIXED(16) CONSTANT(1097),                                  14950000
*                                                                       15000000
*  DESRS_PACBLOC_ERROR              /* A call to the pacb_locate     */ 15050000
*                                   /* routine failed.               */ 15100000
*            FIXED(16) CONSTANT(1096),                                  15150000
*  DESRS_UNKNOWN                    /* Issued by DESERV recovery        15200000
*                                      routine when entered for         15250000
*                                      unknown reason (eg prog ck)      15300000
*                                      while the exit routines were     15350000
*                                      NOT in control. Most likely      15400000
*                                      a prog ck in a DESERV module*/   15450000
*            FIXED(16) CONSTANT(1095),                                  15500000
*  DESRS_GETMAIN_ERROR              /* A call to GETMAIN failed */      15550000
*            FIXED(16) CONSTANT(1094),                                  15600000
*  DESRS_CANT_CHANGE_RECOVERY       /* A call to IGWFECHG failed */     15650000
*            FIXED(16) CONSTANT(1093),                                  15700000
*  DESRS_IGWCDFNC_ERROR             /* A call to IGWCDFNC failed@L1C*/  15750000
*            FIXED(16) CONSTANT(1092),                                  15800000
*  DESRS_NO_PNAR_FOR_NAME           /* A name record was                15900000
*                                      obtained from jcdm but no        15950000
*                                      associated PNAR was found    */  16000000
*            FIXED(16) CONSTANT(1091),                                  16050000
*  DESRS_UNEXPECTED_SAR_CODE        /* An unexpected Standard Attribute 16100000
*                                      Record (SAR) code was found      16150000
*                                      when reading attribute records   16200000
*                                                                   */  16250000
*            FIXED(16) CONSTANT(1090),                                  16300000
*  DESRS_TWO_MLT_NAMES              /* Two mlt names were found for     16350000
*                                      a single member */               16400000
*            FIXED(16) CONSTANT(1089),                                  16450000
*  DESRS_PDSDE_MERGE_ERR            /* PDSDE merge into PMAR failed */  16500000
*            FIXED(16) CONSTANT(1088),                                  16550000
*  DESRS_UNKNOWN_EXIT_ERROR         /* Issued by the DESERV recovery    16600000
*                                      routine when entered for an      16650000
*                                      unknown reason (eg prog chk)     16700000
*                                      while the exit routine was in    16750000
*                                      control. Most likely an exit     16800000
*                                      error.                      */   16850000
*            FIXED(16) CONSTANT(1087),                                  16900000
*  DESRS_ECB_POSTED_ERROR           /* An I/O error was experienced,    16950000
*                                      the post code in the ECB was     17000000
*                                      unexpected */                    17050000
*            FIXED(16) CONSTANT(1086),                                  17100000
*  DESRS_CONNID_OVERFLOW            /* The maximum allowable            17150000
*                                      connection identifiers (64k)     17200000
*                                      was allocated and a request to   17250000
*                                      add one more failed.          */ 17300000
*            FIXED(16) CONSTANT(1085),                                  17350000
*  DESRS_NAME_IS_PRIMARY_NAME       /* The alias name specified is a    17400000
*                                      primary name and the options did 17450000
*                                      not allow for deleting primary   17500000
*                                      names.                        */ 17550000
*            FIXED(16) CONSTANT(1084),                                  17600000
*  DESRS_CLOCK_ERROR                /* An STCK instruction failed    */ 17650000
*            FIXED(16) CONSTANT(1083),                                  17700000
*  DESRS_DATA_LENGTH_ERROR          /* The desd data length is invalid, 17750000
*                                      data length must be greater than 17800000
*                                      0 and less than 108 bytes.    */ 17850000
*            FIXED(16) CONSTANT(1082),                                  17900000
*  DESRS_ANCHOR_IN_USE              /* An obtain for a DCLA was         17950000
*                                      attempted but the anchor was     18000000
*                                      not free                      */ 18050000
*            FIXED(16) CONSTANT(1081),                                  18100000
*  DESRS_ANCHOR_FREE                /* A purge for a DCLA was           18150000
*                                      attempted but the anchor was     18200000
*                                      not in use                    */ 18250000
*            FIXED(16) CONSTANT(1080),                                  18300000
*  DESRS_ADD_STACK_FAILED           /* NON-ZERO RETURN CODE FROM AN     18350000
*                                      IGWFESTK REQUEST              */ 18400000
*            FIXED(16) CONSTANT(1079),                                  18450000
*  DESRS_INVALID_CONN_INTENT        /* The connect intent specified     18500000
*                                      is not valid with this           18550000
*                                      function                      */ 18600000
*            FIXED(16) CONSTANT(1078),                                  18650000
*  DESRS_NAME_LIST_@_INVALID        /* The address of the NAME_LIST     18700000
*                                      structure is 0                */ 18750000
*            FIXED(16) CONSTANT(1077),                                  18800000
*  DESRS_NAME_LIST_COUNT_INVALID    /* The count of entries in the      18850000
*                                      NAME_LIST was 0               */ 18900000
*            FIXED(16) CONSTANT(1076),                                  18950000
*  DESRS_CONNID_INVALID             /* The connect identifier in the    19000000
*                                      SMDE provided is not valid    */ 19050000
*            FIXED(16) CONSTANT(1075),                                  19100000
*  DESRS_INVALID_GETTYPE            /* The GET function accepts only    19150000
*                                      a NAME_LIST or a PDSDE.          19200000
*                                      Neither was provided          */ 19250000
*            FIXED(16) CONSTANT(1074),                                  19300000
*  DESRS_INVALID_AREA_PTR           /* The address of a DESB provided   19350000
*                                      is 0                          */ 19400000
*            FIXED(16) CONSTANT(1073),                                  19450000
*  DESRS_INVALID_AREAPTR_PTR        /* The address of the AREAPTR is    19500000
*                                      0                             */ 19550000
*            FIXED(16) CONSTANT(1072),                                  19600000
*  DESRS_AREA_LENGTH_TOO_SMALL      /* The length of the area           19650000
*                                      provided was insufficient. For   19700000
*                                      the GET function this area       19750000
*                                      length must be larger than the   19800000
*                                      fixed portion of the DESB. */    19850000
*            FIXED(16) CONSTANT(1071),                                  19900000
*  DESRS_INVALID_ENTRY_GAP          /* The gap specfied was too         19950000
*                                      large. This gap must not be      20000000
*                                      larger than DESP_ENTRY_GAP_MAX   20050000
*                                                                    */ 20100000
*            FIXED(16) CONSTANT(1070),                                  20150000
*  DESRS_INVALID_DE_LIST_PTR        /* The address of the DE_LIST       20200000
*                                      parameter was 0               */ 20250000
*            FIXED(16) CONSTANT(1069),                                  20300000
*  DESRS_INVALID_DE_LIST_CNT        /* The number of entries in the     20350000
*                                      DE_LIST was 0                 */ 20400000
*            FIXED(16) CONSTANT(1068),                                  20450000
*  DESRS_INVALID_CONN_ID_PTR        /* The address of the CONN_ID       20500000
*                                      parameter was 0               */ 20550000
*            FIXED(16) CONSTANT(1067),                                  20600000
*  DESRS_INVALID_RELEASE_TYPE       /* The RELEASE function must be     20650000
*                                      specified with the CONN_ID       20700000
*                                      parameter or the DE_LIST         20750000
*                                      parameter                     */ 20800000
*            FIXED(16) CONSTANT(1066),                                  20850000
*  DESRS_INVALID_PUT_OPTION         /* The PUT function requires that   20900000
*                                      the OPTION field be specified.   20950000
*                                                                    */ 21000000
*            FIXED(16) CONSTANT(1065),                                  21050000
*  DESRS_INVALID_MEM_DATA_PTR       /* The address of the MEM_DATA      21100000
*                                      block is 0                    */ 21150000
*            FIXED(16) CONSTANT(1064),                                  21200000
*  DESRS_INVALID_MEM_DATA_CNT       /* The count of entries in the      21250000
*                                      MEM_DATA block is 0           */ 21300000
*            FIXED(16) CONSTANT(1063),                                  21350000
*  DESRS_INVALID_NAME_PTR           /* The address of the NAME          21400000
*                                      parameter is 0                */ 21450000
*            FIXED(16) CONSTANT(1062),                                  21472200
*  DESRS_INVALID_NAME_LENGTH        /* THE LENGTH OF AN ALIAS NAME for  21494400
*                                      A PO1 FORMAT PROGRAM OBJECT WAS  21516600
*                                      EITHER 0 OR GREATER THAN 63.     21538800
*                                      OR, THE LENGTH OF AN ALIAS NAME  21561000
*                                      FOR A PO2 FORMAT PROGRAM OBJECT  21583200
*                                      WAS EITHER 0 OR GREATER THAN     21605400
*                                      1024. OR...                      21627600
*                                      THE LENGTH OF A PRIMARY NAME WAS 21650000
*                                      0 OR GREATER THAN 8.      @L2c*/ 21700000
*            FIXED(16) CONSTANT(1061),                                  21750000
*  DESRS_UNSUPPORTED_FUNC           /* The FUNC value is incorrect   */ 21800000
*            FIXED(16) CONSTANT(1060),                                  21850000
*  DESRS_DEB_REQUIRES_AUTH          /* To pass the DEB the caller       21900000
*                                      must be supervisor state or a    21950000
*                                      privileged key                */ 22000000
*            FIXED(16) CONSTANT(1059),                                  22050000
*  DESRS_INVALID_DCB_PTR            /* The address of the DCB is 0   */ 22100000
*            FIXED(16) CONSTANT(1058),                                  22150000
*  DESRS_DCB_NOT_OPEN               /* The passed DCB is not opened  */ 22200000
*            FIXED(16) CONSTANT(1057),                                  22225000
*  DESRS_COMP_NAME_BAD              /*A compressed name is inconsistant 22250000
*                                      for some reason (such as the     22275000
*                                      index value is greater than the  22300000
*                                      number of names defined for the  22325000
*                                      program object            @L1C*/ 22350000
*            FIXED(16) CONSTANT(1056),                                  22375000
*  DESRS_DCB_NOT_OPEN_OUTPUT        /* With function PUT the DCB must   22400000
*                                      have been opened for output   */ 22450000
*            FIXED(16) CONSTANT(1055),                                  22500000
*  DESRS_INVALID_DEB_PTR            /* Address of the DEB is 0 or DEB   22550000
*                                      was input but the DCB pointed to 22600000
*                                      by the DEB did not point back to 22650000
*                                      the DEB                   @P2C*/ 22700000
*            FIXED(16) CONSTANT(1054),                                  22750000
*  DESRS_DEBCHK_FAILED              /* The DEBCHK macro failed. The     22800000
*                                      DCB or DEB was invalid        */ 22850000
*            FIXED(16) CONSTANT(1053),                                  22900000
*  DESRS_INVALID_CONCAT             /* The concatenation number         22950000
*                                      specified is greater than the    23000000
*                                      concatenation number of the      23050000
*                                      last data set in the             23100000
*                                      concatenation                 */ 23150000
*            FIXED(16) CONSTANT(1052),                                  23200000
*  DESRS_PDSDE_PTR_INVALID          /* Address of the PDSDE is 0     */ 23250000
*            FIXED(16) CONSTANT(1051),                                  23300000
*  DESRS_INVALID_FT                 /* File token is invalid         */ 23350000
*            FIXED(16) CONSTANT(1050),                                  23400000
*  DESRS_LIB_NOT_BUFFERED           /* ** INTERNAL CODE **           */ 23450000
*            FIXED(16) CONSTANT(1049),                                  23500000
*  DESRS_INVALID_DFNC_FUNC          /* An internal function call to     23550000
*                                      IGWCDFNX was invalid because     23600000
*                                      the function code was invalid */ 23650000
*            FIXED(16) CONSTANT(1048),                                  23700000
*  DESRS_DISCONNECT_FILE_FAILED     /* A call to disconnect files was   23750000
*                                      rejected                      */ 23800000
*            FIXED(16) CONSTANT(1047),                                  23850000
*  DESRS_INSUF_BUFFER_SIZE          /* Area provided is too small    */ 23900000
*            FIXED(16) CONSTANT(1046),                                  23950000
*  DESRS_PDS_NOT_SUPPORTED          /* This function requires a PDSE    24000000
*                                      data set                      */ 24050000
*            FIXED(16) CONSTANT(1045),                                  24100000
*  DESRS_INVALID_CT                 /* Connect token invalid.        */ 24150000
*            FIXED(16) CONSTANT(1044),                                  24200000
*  DESRS_INVALID_MLT                /* MLT is not valid.             */ 24250000
*            FIXED(16) CONSTANT(1043),                                  24300000
*  DESRS_MORE_THAN_1_PRIMARY        /* The MEM_DATA must have only      24350000
*                                      one member designated as         24400000
*                                      primary                       */ 24450000
*            FIXED(16) CONSTANT(1042),                                  24500000
*  DESRS_INVALID_PARM_LIST_HEADER   /* The id, length, or level of      24550000
*                                      the DESP is invalid           */ 24600000
*            FIXED(16) CONSTANT(1041),                                  24650000
*  DESRS_INVALID_NAME_PREFIX        /* The first 8 bytes of a name      24700000
*                                      were all X'FF'            @P2C*/ 24750000
*            FIXED(16) CONSTANT(1040),                                  24800000
*  DESRS_NO_PRIMARY_NAME            /* The MEM_DATA must have one       24850000
*                                      member designated as primary  */ 24900000
*            FIXED(16) CONSTANT(1039),                                  24950000
*  DESRS_NAME_ALREADY_EXISTS        /* The PUT failed because of a      25000000
*                                      name conflict                 */ 25050000
*            FIXED(16) CONSTANT(1038),                                  25100000
*  DESRS_LONG_NAME_AND_LLA          /* LLA does not support long        25150000
*                                      names                         */ 25200000
*            FIXED(16) CONSTANT(1037),                                  25240000
*  DESRS_PROGRAM_OBJECT_ONLY        /* Function supports PDSE program   25280000
*                                      objects only                  */ 25320000
*            FIXED(16) CONSTANT(1036),                                  25360000
*  DESRS_FREEMAIN_ERROR             /* FREEMAIN failure              */ 25400000
*            FIXED(16) CONSTANT(1035),                                  25450000
*  DESRS_CONVERT_ERROR              /* Error converting TTR to CCHHR    25500000
*                                                                @P2C*/ 25550000
*            FIXED(16) CONSTANT(1034),                                  25600000
*  DESRS_UNEXPECTED_JCDM_ERROR      /* JCDM returned an unexpected      25650000
*                                      return and reason code           25700000
*                                      combination                   */ 25750000
*            FIXED(16) CONSTANT(1033),                                  25800000
*  DESRS_PDSDE_CONVRT_ERR           /* Error converting PDSDE to PMAR   25850000
*                                                                    */ 25900000
*            FIXED(16) CONSTANT(1032),                                  25950000
*  DESRS_SETLOCK_ERR                /* Bad return code from SETLOCK  */ 26000000
*            FIXED(16) CONSTANT(1031),                                  26050000
*  DESRS_EXTRACT_ERROR              /* IGWFTOKM EXTRACT failed       */ 26100000
*            FIXED(16) CONSTANT(1030),                                  26150000
*  DESRS_SET_ERROR                  /* IGWFTOKM SET failed       @p2c*/ 26200000
*            FIXED(16) CONSTANT(1029),                                  26250000
*  DESRS_ANCHOR_CREATE_FAILED       /* Number of CONNIDs exceeded    */ 26300000
*            FIXED(16) CONSTANT(1028),                                  26350000
*  DESRS_ELEMENT_CREATE_FAILED      /* No space to store connections */ 26400000
*            FIXED(16) CONSTANT(1027),                                  26450000
*  DESRS_PMAR_MERGE_ERR             /* PMARA to PMAR merge failed    */ 26500000
*            FIXED(16) CONSTANT(1026),                                  26550000
*  DESRS_IEWLCNVT_ERROR             /* IEWLCNVT macro call error @L1C*/ 26600000
*            FIXED(16) CONSTANT(1025),                                  26650000
*  DESRS_NAME_NOT_DEFINED           /* name to be replaced did not      26700000
*                                      previously exist          @P2C*/ 26750000
*            FIXED(16) CONSTANT(1024),                                  26775000
*  DESRS_CHANGED_PMAR_LENGTH        /* For an UPDATE function, the   */ 26800000
*                                   /* caller has changed the length */ 26825000
*                                   /* of the PMAR.              @L2C*/ 26850000
*            FIXED(16) CONSTANT(1023),                                  26875000
*  DESRS_SMDE_TOKEN_BAD             /* The smde input defined a         26900000
*                                      token section which was deemed   26925000
*                                      to be bad. The item number       26950000
*                                      may have been inconsistant       26975000
*                                      the alias flag.               */ 27000000
*            FIXED(16) CONSTANT(1022),                                  27025000
*  DESRS_PRI_NM_THIS_FILE           /* alias name is same name as       27050000
*                                      primary name for this member     27100000
*                                                                @P2C*/ 27150000
*            FIXED(16) CONSTANT(1021),                                  27200000
*  DESRS_CANT_GET_FILELOCK          /* file lock unavailable, possible  27250000
*                                      sharing problem.          @P2A*/ 27300000
*            FIXED(16) CONSTANT(1020),                                  27350000
*  DESRS_CONNECTION_NOT_FOUND       /* The connection specified in      27400000
*                                      the SMDE could not be found.     27450000
*                                      probably user error           */ 27500000
*            FIXED(16) CONSTANT(1019),                                  27550000
*  DESRS_DESL_SMDE_PTR              /* The SMDE for the release         27600000
*                                      function had a null pointer or   27650000
*                                      the eyecatcher was invalid    */ 27700000
*            FIXED(16) CONSTANT(1018),                                  27750000
*  DESRS_RELTYPE_INVALID            /* The release function was         27800000
*                                      expecting a subfunction code     27850000
*                                      of connid or smde list.          27900000
*                                      Neither was specified         */ 27950000
*            FIXED(16) CONSTANT(1017),                                  27983300
*  DESRS_BAD_PMAR_FIELD_UPDATED     /* For the DESERV function          28016600
*                                      UPDATE, the caller updated       28049900
*                                      a field in the PMAR which is     28083200
*                                      not supported for update.     */ 28116500
*            FIXED(16) CONSTANT(1016),                                  28149800
*  DESRS_IEWBXILO_ERROR             /* a call to iewbxilo returned an   28183100
*                                      unexpected return code    @L1C*/ 28216400
*            FIXED(16) CONSTANT(1015),                                  28249700
*  DESRS_MULTIPLE_ERRORS            /* MORE THAN ONE ERROR HAS OCCURRED 28283000
*                                      CHECK CODES IN DESL           */ 28316300
*            FIXED(16) CONSTANT(1014),                                  28349600
*  DESRS_AUTH_SUBPOOL               /* Caller specified an autorized    28366200
*                                      subpool, but is not authorized   28382800
*                                                                @L1A*/ 28399400
*            FIXED(16) CONSTANT(1013),                                  28416200
*  DESRS_DIRECTORY_EMPTY            /* No members in directory       */ 28450000
*            FIXED(16) CONSTANT(1012),                                  28500000
*  DESRS_CONNECT_AUTH               /* A DESERV GET_ALL call was made   28516600
*                                      where the CONNECT(HOLD) parm     28533200
*                                      was specified but the caller was 28549800
*                                      not in a system key nor in       28566400
*                                      supervisor state.         @XXA*/ 28583000
*            FIXED(16) CONSTANT(1011),                                  28600000
*  DESRS_C370LIB_PDSDE_ME           /* C370LIB(YES) AND pdsde are       28633300
*                                      mutually exclusive        @L3A*/ 28666600
*            FIXED(16) CONSTANT(1010),                                  28700000
*  DESRS_BAD_BLKSIZE                /* DCBBLKSI is too small     @L3A*/ 28750000
*            FIXED(16) CONSTANT(1009),                                  28800000
*  DESRS_BAD_TXT_CARD               /* while processing a C370LIB       28825000
*                                      directory, inconsistancies were  28850000
*                                      found in the txt records  @L3A*/ 28875000
*            FIXED(16) CONSTANT(1008),                                  28900000
*  DESRS_BAD_C370LIB_DIR            /* The C370LIB directory indicates  28914200
*                                      that a symbol is associated with 28928400
*                                      a member name but that name does 28942600
*                                      not exist in the PDS directory   28956800
*                                                                @L3A*/ 28971000
*                                                                       28985200
*            FIXED(16) CONSTANT(1007),                                  29000000
*  DESRS_DCB_NOT_OPEN_PO            /* the DCB was not opened with      29016600
*                                      DSORG=PO. This applies only to   29033200
*                                      the GET function when            29049800
*                                      C370LIB(YES).             @L3A*/ 29066400
*                                                                       29083000
*            FIXED(16) CONSTANT(1006),                                  29100000
*  DESRS_AREA_AREAPTR_ME            /* AREA and AREAPTR are mutually    29133300
*                                      exclusive                 @L3A*/ 29166600
*            FIXED(16) CONSTANT(1005),                                  29200000
*  DESRS_SMDE_PTR_INVALID           /* For GETTYPE=SMDE, the input SMDE 29233300
*                                      pointer was zero.         @L3A*/ 29266600
*            FIXED(16) CONSTANT(1004),                                  29300000
*  DESRS_C370LIB_SMDE_ME            /* The SMDE parameter is mutually   29333300
*                                     exclusive with C370LIB(YES)@L3A*/ 29366600
*            FIXED(16) CONSTANT(1003),                                  29400000
*  DESRS_NOTFOUND                   /* Some members not found        */ 29450000
*            FIXED(16) CONSTANT(1002),                                  29500000
*  DESRS_MODULE_BUFFERED_LLA        /* The module is buffered by lla,*/ 29550000
*                                   /* no connection was established.*/ 29600000
*                                   /*                           @P3A*/ 29650000
*            FIXED(16) CONSTANT(1001),                                  29700000
*  DESRS_SUCC                       /* successful processing         */ 29750000
*            FIXED(16) CONSTANT(0000);                                  29800000
*                                   /* */                               29850000
