*                                                                       00050000
* %DCL IGWMDSMB_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IGWMDSMB_INCLUDED;                                        00150000
* %IF IGWMDSMB_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 95264. CBGEN compile date 95240         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IGWMDSMB &DSECT=YES,&LIST=YES,&DSMBTYPE=YES                    00450000
         GBLC  &IGWMDSMB_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IGWMDSMB_INCLUDED SETC 'YES'                                           00600000
 TITLE   'IGWMDSMB  - IGWCDATA DATA SET MASK BLOCK                    '*00650000
                                                                        00700000
                                                                        00725000
**/ IGWMDSMB_1:;                                                        00750000
*/* START OF SPECIFICATIONS ******************************************* 00800000
*    $MAC(IGWMDSMB) COMP(DF122) :                                     * 00850000
*                                                                     * 00900000
*                                                                     * 00925000
*   MACRO NAME: IGWMDSMB                                              * 00950000
*                                                                     * 01000000
*   DESCRIPTIVE NAME: IGWCDATA DATA SET MASK BLOCK                    * 01050000
*                                                                     * 01100000
*   STATUS: DFSMS VERSION 1 RELEASE 3.0                               * 01150000
*                                                                     * 01200000
*PROPRIETARY V3 STATEMENT                                             * 01242800
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 01285600
*"RESTRICTED MATERIALS OF IBM"                                        * 01328400
*5695-DF1                                                             * 01371200
*(C) COPYRIGHT 1995  IBM CORP.                                        * 01414000
*END PROPRIETARY V3 STATEMENT                                         * 01456800
*                                                                     * 01500000
*   FUNCTION: THIS MACRO PROVIDES A TYPE DECLARATION WHICH MUST BE    * 01550000
*     USED TO MAP CDTA DATA SET MASK CONTROL BLOCKS.                  * 01600000
*                                                                     * 01650000
*   NOTES:                                                            * 01700000
*                                                                     * 01750000
*     THIS MACRO SHOULD BE INCLUDED VIA THE SSF PROLOG/EPILOG         * 01800000
*     SERVICES.                                                       * 01850000
*                                                                     * 01900000
*  Change History:                                                    * 01950000
*  $00=VSAMRLS,HDZ11C0,950919,SJPLDCO:                                * 02000000
*  $01=OW39785,HDZ11E0,990615,SJPLDLM: Add rls mmf cdata support @01A * 02025000
*  $02=OW44252,HDZ11F0,000428,SJPLMKD: Add RMF fixes             @02A * 02034990
*** END OF SPECIFICATIONS ********************************************/ 02050000
*% /*                                                                   02100000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 02150000
         AIF   ('&LIST' EQ 'YES').P2                                    02200000
.P1      ANOP                                                           02250000
         PUSH  PRINT                                                    02300000
         PRINT OFF                                                      02350000
.P2      ANOP                                                           02400000
*                                                                       02450000
*   ******************************************************************! 02500000
*   *                                                                 ! 02550000
*   * DECLARATION TO DESCRIBE THE BLOCK FOR IGWCDATA INTERFACE        ! 02600000
*   *                                                                 ! 02650000
*   ******************************************************************! 02700000
*                                                                       02750000
*                                                                       02800000
         AIF   ('&DSMBTYPE' EQ 'NO').L0002                              02850000
         AIF   ('&DSECT' EQ 'YES').L0003                                02900000
         AIF   ('&DSMBTYPE' NE 'YES').L0002                             02950000
DSMBTYPE            DS   0D                                             03000000
         AGO   .L0004                                                   03050000
.L0003   ANOP                                                           03100000
DSMBTYPE            DSECT                                               03150000
.L0004   ANOP                                                           03200000
DSMB_HDR            DS   1CL0016   Standard Header                      03250000
         ORG   DSMB_HDR                                                 03300000
CB_EYECATCHER       DS   1CL0008                                        03389990
CB_LENGTH           DS   1FL4                                           03429980
CB_VERSION          DS   1FL1                                           03469970
                    DS   1CL0003                                        03509960
*                                                                       03550000
*                                                                       03600000
*   Array of 100 input dataset masks                                    03650000
*                                                                       03700000
*                                                                       03750000
*                                                                       03800000
DSMB_INPUT_SECTION  DS   1CL6416                                        03850000
         ORG   DSMB_INPUT_SECTION                                       03900000
DSMB_NUM_IMASKS     DS   1FL4                                           03969990
                    DS   1CL12                                          03989980
DSMB_DSMASKS        DS   100CL64                                        04009970
         ORG   DSMB_DSMASKS                                             04050000
DSMB_IMASK_LEN      DS   1CL4                                           04084990
DSMB_DATASET_MASK   DS   1CL0044                                        04094980
DSMB_IMASK_RETURNCODE DS 1FL4                                           04125000
DSMB_IMASK_REASONCODE DS 1FL4                                           04150000
                    DS   1CL8                                           04182990
DSMB_IMASK_ENTRY_END DS 0C                                              04190980
         ORG   DSMB_INPUT_SECTION+X'00001910'                           04200000
DSMB_OUTPUT_SECTION DS   1CL6416                                        04225000
         ORG   DSMB_OUTPUT_SECTION                                      04250000
*                                                                       04300000
*                                                                       04350000
*   IGWCDATA output area for data set masks (100)                       04400000
*                                                                       04450000
*                                                                       04500000
*                                                                       04550000
DSMB_NUM_OMASKS     DS   1FL4                                           04584990
                    DS   1CL12                                          04594980
DSMB_OMASK          DS   100CL0064                                      04604970
         ORG   DSMB_OMASK                                               04650000
DSMB_OMASK_LEN      DS   1FL4                                           04700000
DSMB_OMASK_DATASET_MASK DS 1CL0044                                      04750000
                    DS   1CL16                                          04819990
DSMB_OMASK_ENTRY_END DS 0C                                              04839980
         ORG   DSMB_OMASK+6400                                          04859970
DSMB_END            DS   0C                                             04879960
*                                                                       04900000
*                                                                       04950000
*  THE FOLLOWING ARE CONSTANT DECLARATIONS FOR DSMB                     05000000
*                                                                       05050000
*                                                                       05100000
*                                                                       05150000
DSMB_IMASK_ENTRY_LENGTH EQU DSMB_IMASK_ENTRY_END-DSMB_IMASK_LEN         05209990
DSMB_OMASK_ENTRY_LENGTH EQU DSMB_OMASK_ENTRY_END-DSMB_OMASK_LEN         05219980
DSMB_LENGTHC        EQU  DSMB_END-DSMBTYPE  length of dsmb              05229970
DSMB_LEVELC EQU 1        DSMB level number                              05250000
         ORG   DSMBTYPE+X'00003230'                                     05300000
DSMBTYPE_LEN EQU *-DSMBTYPE                                             05350000
.L0002   ANOP                                                           05400000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 05450000
         AIF   ('&LIST' EQ 'YES').P4                                    05500000
.P3      ANOP                                                           05550000
         POP   PRINT                                                    05600000
.P4      ANOP                                                           05650000
.P_EXIT  ANOP                                                           05700000
         MEND                                                           05750000
**/ IGWMDSMB_2:;                                                        05800000
* %IGWMDSMB_INCLUDED = 'YES';                                           05850000
* %DCL ZCBPRINT CHAR EXT;                                               05900000
* %DEACTIVATE ZCBPRINT;                                                 05950000
* %DCL IGWMDSMB_LIST CHAR EXT;                                          06000000
* %DEACTIVATE IGWMDSMB_LIST;                                            06050000
* %IF IGWMDSMB_LIST ^= 'NO' &                                           06100000
*    ZCBPRINT ^= 'NO' %THEN                                             06150000
*   %GOTO IGWMDSMB_3;                                                   06200000
*   @LIST PUSH NOECHO;                                                  06250000
*   @LIST NOASSEMBLE NOECHO;                                            06300000
*   @LIST OFF C NOECHO;                                                 06350000
* %IGWMDSMB_3:;                                                         06400000
*/* Start of PL/X Source                                             */ 06450000
*                                                                       06500000
*   ! DECLARATION TO DESCRIBE THE BLOCK FOR IGWCDATA INTERFACE          06550000
*                                                                       06600000
*DECLARE                                                                06650000
*1 MmfDsmbType type   BDY(DWORD),                                       06700000
* 2 DSMB_HDR,                            !   Standard Header            06750000
*   4 Dsmb_EYECATCHER       CHAR(8),                                    06800000
*   4 Dsmb_LENGTH           FIXED(31),                                  06850000
*   4 Dsmb_VERSION          FIXED(8),                                   06900000
*   4 *                     CHAR(3),                                    06950000
*                                                                       07000000
* !                                                                     07050000
* ! Array of 100 input dataset masks                                    07100000
* !                                                                     07150000
*                                                                       07200000
* 2 DSMB_INPUT_SECTION             BDY(DWORD),                          07225000
*  3 DSMB_NUM_IMASKS               FIXED(31),                           07250000
*  3 *                             Char(12),                            07275000
*  3 DSMB_DSMASKS(100),                                                 07300000
*   4 DSMB_IMASK_LEN               FIXED(31),                           07325000
*   4 DSMB_IMASK_DATASET_MASK      CHAR(44),                            07350000
*   4 DSMB_IMASK_RETURNCODE        Fixed(31),                           07375000
*   4 DSMB_IMASK_REASONCODE        Fixed(32),                           07400000
*   4 *                            CHAR(8),                             07425000
*                                                                       07450000
* 2 DSMB_OUTPUT_SECTION            BDY(DWORD),                          07500000
* !                                                                     07550000
* ! IGWCDATA output area for data set masks (100)                       07600000
* !                                                                     07650000
*  3 DSMB_NUM_OMASKS               FIXED(31),                           07692800
*  3 *                             Char(12),                            07735600
*  3 DSMB_OMASK(100)               BDY(DWORD),                          07778400
*   4 DSMB_OMASK_LEN               FIXED(31),                           07821200
*   4 DSMB_OMASK_DATASET_MASK      CHAR(44),                            07864000
*   4 *                            CHAR(16);                            07906800
*!                                                                      07950000
*! THE FOLLOWING ARE CONSTANT DECLARATIONS FOR DSMB                     08000000
*!                                                                      08050000
*                                                                       08100000
*DECLARE                                                                08150000
*  DSMB_VISUALC CHAR(8)   CONSTANT('IGWMDSMB'),           ! DSMB eyecatc08200000
*  DSMB_LENGTHC FIXED(31) CONSTANT(LENGTH(MmfDsmbType)),  ! length of DS08250000
*  DSMB_LEVELC  FIXED(8)  CONSTANT(1);                    ! DSMB level n08300000
* %END;                                                                 09100000
