* %GOTO IGWSMF_1;  /*                                                   00003800
         MACRO                                                          00007600
&NAME    IGWSMF &SMF42_01=NO,&SMF42_02=NO,&SMF42_03=NO,&SMF42_04=NO,   X00011400
               &SMF42_05=NO,&SMF42_06=NO,&SMF42_09=NO,&SMF42_0B=NO,    X00012000
               &SMF42_0F=NO,&SMF42_0G=NO,&SMF42_0H=NO,           @P1C  X00012600
               &SMF42_0I=NO,&SMF42_0J=NO                         @11C*/ 00017100
* %IGWSMF_1:;                                                           00019000
*/* START OF SPECIFICATIONS ******************************************* 00022800
*   $MAC(IGWSMF) COMP(DF104):                                         * 00026600
*01* MACRO NAME: IGWSMF                                               * 00030400
*01* DESCRIPTIVE NAME: SMF Record Type 42 Definition                  * 00034200
*                                                                     * 00038000
*                                                                     * 00039900
*    STATUS: MVS/DFSMSdfp 1.3.0                                       * 00041800
*                                                                     * 00045600
*PROPRIETARY V3 STATEMENT                                             * 00048300
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00051000
*"RESTRICTED MATERIALS OF IBM"                                        * 00053700
*5695-DF1                                                             * 00056400
*(C) COPYRIGHT 1989,1994  IBM CORP.                                   * 00059100
*END PROPRIETARY V3 STATEMENT                                         * 00061800
*                                                                     * 00064600
*    FUNCTION: Map the following SMF record type 42 subtypes:         * 00068400
*                                                                     * 00072200
*                                                                     * 00074100
*      Subtype 1 - BMF totals section for analysis of overall BMF     * 00076000
*                  performance.  One storage class summary section    * 00079800
*                  for each storage class.                            * 00083600
*                                                                     * 00087400
*      Subtype 2 - One section for each cache control unit (3990-3)   * 00091200
*                  having at least one SMS managed device attached.   * 00095000
*                  One section for each SMS managed volume attached   * 00098800
*                  to a 3990-3 control unit.                          * 00102600
*                                                                     * 00106400
*      Subtype 3 - For SMS Operational Services event audit records   * 00110200
*                  written each time the SMS configuration changes    * 00114000
*                  when 1) operator issues VARY SMS, or 2) ISMF       * 00117800
*                  'ACTIVATE' or activate via SETSMS, or 3) ENF       * 00121600
*                  event occurred after VARY of SMS managed volume.   * 00125400
*                                                                     * 00129200
*      Subtype 4 - A subtype 4 record will be written for    @OY66824 * 00133000
*                  System Data Mover session statistics for a@OY66824 * 00136800
*                  Concurrent Copy session or for an Extended@OY66824 * 00140600
*                  Sequential Data Set when interfacing with @OY66824 * 00144400
*                  the backup program.                       @OY66824 * 00148200
*                                                                     * 00152000
*      Subtype 5 - Storage Class Response Time Section.          @L1A * 00155800
*                  Contains I/O statistics by storage class.     @L1A * 00159600
*                                                                     * 00163400
*      Subtype 6 - Data Set by Job section.                      @L1A * 00167200
*                  Contains I/O statistics by data set.          @L1A * 00171000
*                  If recorded at end of SMF interval, one       @L1A * 00174800
*                  record contains data for all open data sets   @L1A * 00178600
*                  in an address space.                          @L1A * 00182400
*                  If recorded during Close, one record contains @L1A * 00186200
*                  data for all concatenated data sets.          @L1A * 00190000
*                                                                     * 00193800
*                    ______________________________________      @L1A * 00197600
*                   | SMF42 header                         |     @L1A * 00201400
*                   |______________________________________      @L1A * 00205200
*                   | SMF42 subtype 6 header section       |     @L1A * 00209000
*                   |______________________________________      @L1A * 00212800
*                   | SMF42 product section                |     @L1A * 00216600
*                   |______________________________________      @L1A * 00220400
*                   | SMF42 subtype 6 job header section   |     @L1A * 00224200
*                   |______________________________________      @L1A * 00228000
*                   | SMF42 subtype 6 DS #1 header section |     @L1A * 00231800
*                   |______________________________________      @L1A * 00235600
*                   | SMF42 subtype 6 DS #1 I/O stats      |     @L1A * 00239400
*                   |______________________________________      @L1A * 00243200
*                   | SMF42 subtype 6 DS #2 header section |     @L1A * 00247000
*                   |______________________________________      @L1A * 00250800
*                   | SMF42 subtype 6 DS #2 I/O stats      |     @L1A * 00254600
*                   |______________________________________      @L1A * 00258400
*                                                                     * 00258800
*      Subtype  7 - Used by NFS                                  @10A * 00259200
*                                                                     * 00259600
*      Subtype  8 - Used by NFS                                  @10A * 00260000
*                                                                     * 00260400
*      Subtype  9 - A subtype 9 record will be written for       @P1C * 00260500
*                   B37,D37 or E37 abends to document            @P1A * 00260600
*                   information such as jobnme, data set name,   @P1A * 00260700
*                   volume serial number, number of extents      @P1A * 00260800
*                   on the volume, secondary allocation amount   @P1A * 00260900
*                   etc.                                         @P1A * 00261000
*                                                                     * 00261200
*      Subtype 10 - Available                                    @10A * 00261700
*                                                                     * 00262200
*      Subtype 11 - A subtype 11 record will be written for      @07A * 00262900
*                   System Data Mover session statistics for     @07A * 00263600
*                   Extended Remote Copy (XRC) sessions when     @07A * 00264300
*                   the global SMF interval expires.             @07A * 00265000
*                                                                     * 00265200
*      Subtype 12 - Available                                    @10A * 00265400
*                                                                     * 00265600
*      Subtype 13 - Available                                    @10A * 00265800
*                                                                     * 00266000
*      Subtype 14 - Available                                    @10A * 00266200
*                                                                     * 00266400
*      Subtype 15 - Storage class MSR summary                    @10A * 00266600
*                                                                     * 00266800
*      Subtype 16 - Data set MSR summary                         @10A * 00267000
*                                                                     * 00267200
*      Subtype 17 - Coupling facility lock structure summary     @10A * 00267400
*                                                                     * 00267600
*      Subtype 18 - Coupling facility cache partition summary    @10A * 00267800
*                                                                     * 00268000
*      Subtype 19 - Local Buffer Manager LRU Activity summary    @11A * 00268100
*                                                                     * 00268200
*    NOTES:                                                           * 00269800
*                                                                     * 00273600
*      DEPENDENCIES:                                                  * 00277400
*      RESTRICTIONS: None                                             * 00281200
*                                                                     * 00285000
*    MACRO:                                                           * 00288800
*                                                                     * 00292600
*      PROCESSOR: PLAS                                                * 00296400
*      DISTRIBUTION LIBRARY: PLSMACS                                  * 00300200
*      ATTRIBUTES:                                                    * 00304000
*                                                                     * 00307800
*        This macro produces a PLAS structure which describes the     * 00311600
*        format of the SMF record type 42.                            * 00315400
*                                                                     * 00319200
*    EXIT NORMAL:                                                     * 00323000
*                                                                     * 00326800
*      RETURN CODE: 0                                                 * 00330600
*      No errors detected                                             * 00334400
*                                                                     * 00338200
*    EXIT ERRORS:                                                     * 00342000
*                                                                     * 00345800
*        No errors will be detected by this macro.                    * 00349600
*                                                                     * 00353400
*    EXTERNAL REFERENCES:                                             * 00357200
*                                                                     * 00361000
*      MACROS:                                                        * 00364800
*        None                                                         * 00368600
*                                                                     * 00372400
*    CHANGE ACTIVITY:                                                 * 00376200
*   $L0=EVNTAUD,HDP3320,871123,STLRLF: SMF Event Audit Records        * 00380000
*   $01=OY36584,HDP3320,901008,SJDAB: Make product sect. end word bdy * 00383800
*   $02=OY48288,HDP3330,911022,SJPLMW: Change header to only include  * 00387600
*                      the subtype triplets for the selected subtype  * 00391400
*                      to be written with the SMF record. Fields in   * 00395200
*                      subtype 1 were changed from EBCDIC 8 byte      * 00399000
*                      fields to binary 4 byte fields. New fields     * 00402800
*                      were added to subtype 3.                       * 00406600
*   $L1=DCME,JDZ1110,920121,SJPLMW: Dynamic Cache Mgmt support        * 00410400
*   $03=OY62455,JDZ1110,930517,SJPLMM: Macro not shipped w/110        * 00412800
*   $04=OY66824,JDZ1110,930915,TUCKAD: Add subtype 4                  * 00415200
*   $RT=I/O DELAY,HDZ11B0,931130,SJPLJB: I/O delay statistics         * 00417700
*   $RT=IODELAY,HDZ11B0,931015,SJPLJB:  I/O Delay Statistics     @RTA * 00418700
*   Duplicate symbol name                                     @OW00573* 00419700
*   Stratis support                                           @OW00159* 00420700
*   $07=OW08476,JDZ1110,940929,TUCKAD: Add Subtype 11             @07A* 00421200
*   Changed 1Cl0008 to 1CL0008.                               @OW09203* 00421500
*   $DM=RLS CMM,HDZ11C0,950106,      : Add Subtypes 15,16,17,18   @10A* 00422000
*   $10=OW21970,HDZ11C0,08/06/96,SJPLMKD: Update sub-type 15,16,  @10A* 00422200
*   17,18 to add thread stats and new locking fields.             @10A* 00422400
*   $08=OW16041,HDZ11C0,10/04/95,SJPLRMS: Add bit in Subtype 2 to @08A* 00422600
*   indicate the statistics are for D/T3990-6 enhanced mode.      @08A* 00423600
*   $09=OW16125,HDZ11C0,10/04/95,SJPLRMS: Add GMT offset in sub-  @09A* 00423900
*   type 6 to allow correct calculation of local time.            @09A* 00424200
*   $P1=SMST42,HDZ11D0.103096,SJPLJAL: Add Subtype 9              @P1A* 00424300
*   $P1=OW20866,HDZ11C0,06/06/96,SJPLJAB: Add Volume statistics   @P1A* 00424400
*   to the Subtype 5 record and additional data set flags to the  @P1A* 00424500
*   Subtype 6 record.                                             @P1A* 00424600
*   $11=OW22419,HDZ11C0,10/03/96,SJPLMKD: Add sub-type 19 and     @11A* 00424700
*                                         modify sub-type 18.     @11A* 00424900
*   $P2=K140182,HDZ11D0,12/31/96,SJPLJAL: Remove fld: S42SGNME    @P2A* 00425000
*   $12=OW26451,HDZ11D0,970418,SJPLMV: add two new fields to      @12A* 00425100
*   subtype 6, maximum I/O response and service time by dataset   @12A* 00425200
*   $13=OW30233,HDZ11D0,971103,SJPLGEC: CORRECT ASSEMBLY ERRORS   @13A* 00425300
*   $14=OW28921,HDZ11C0,971210,TUCGEM: Add Planned outage         @14A* 00425400
*   $15=OW32781,HDZ11D0,980414,SJPLGEC: Dup S42DSN label for      @15A* 00426200
*                                       record type 6 and 9       @16A* 00426600
*   $16=OW33202,HDZ11D0,980508,SJPLMKD: Dup S42SRH label for      @16A* 00427000
*                                       record type 1             @16A* 00427400
*   $17=OW35542,HDZ11D0,981020,SJPLJAL: MACRO CONTROL STATEMENT   @17A* 00427500
*                                       INCORRECTLY COMMENTED OUT @17A* 00427600
*   $18=OW38073,HDZ11E0,990309,SJPLRAV: BMF cache metrics         @18A* 00427800
*   $19=OW34238,HDZ11E0,981203,SJPLMV:  Fibre Channel Support     @19A* 00428000
*   $21=OW39785,HDZ11E0,990528,SJPLDLM: Update MMF for CDATA      @21A* 00428100
*   $20=OW41407,HDZ11C0,990819,TUCRNC: Four digit device numbers  @20A* 00428200
*   $22=OW48124,HDZ11C0,010209,TUCDRB: Remove assembler comment   @22A* 00428240
* END OF SPECIFICATIONS **********************************************/ 00428300
* %GOTO IGWSMF_2;                         /*                            00428600
*                                                                       00429400
*                                                                       00433200
*                                                                       00437000
*                                                                       00440800
*   -----------------------------------------------------------------   00444600
*     Header for SMF record type 42                                     00448400
*   -----------------------------------------------------------------   00452200
*                                                                       00456000
*                                                                       00459800
SMF42    DSECT ,                                                        00463600
SMF42BAS DS    0D        SMF42BAS is the basing expr.                   00467400
SMF42RCL DS    1FL2      Record Length                                  00471200
SMF42SGD DS    1FL2      Segment Descriptor (RDW) -- 0 if record is    *00475000
                         not spanned                                    00478800
SMF42FLG DS    0BL1      System indicator flags                         00482600
SMF42FSI EQU   X'80'     When set=subsystem id follows system id        00486400
SMF42FSU EQU   X'40'     When set = subtypes are used                   00490200
SMF42FXA EQU   X'04'     When set = MVS/XA (SMF enters)                 00494000
SMF42FS2 EQU   X'02'     When set = VS2 (SMF enters)                    00497800
SMF42FS1 EQU   X'01'     When set = VS1 (SMF enters)                    00501600
         ORG   SMF42FLG+X'00000001'                                     00505400
SMF42RTY DS    1FL1      Record type: 42 (X'2A')                        00509200
SMF42TME DS    1FL4                                                     00513000
SMF42DTE DS    1CL0004   Record written date (by SMF)                   00516800
SMF42SID DS    1CL0004   System identification (by SMF)                 00520600
SMF42SSI DS    1CL0004   Subsystem Id                                   00524400
SMF42STY DS    1FL2      Record subtype                                 00528200
SMF42NT  DS    1FL2      Number of triplets (optional)                  00532000
         DS    1FL2      Reserved (optional)                            00535800
*                                                                       00539600
*   -----------------------------------------------------------------   00543400
*    Product section triplet                                            00547200
*   -----------------------------------------------------------------   00551000
*                                                                       00554800
*                                                                       00558600
SMF42OPS DS    1FL4      Offset to product section                      00562400
SMF42LPS DS    1FL2      Length of product section                      00566200
SMF42NPS DS    1FL2      Number of product sections                     00570000
*                                                                       00573800
*   -----------------------------------------------------------------   00577600
*    Header must end on word boundary                                   00581400
*   -----------------------------------------------------------------   00585200
*                                                                       00589000
*                                                                       00592800
SMF42END DS    0C        1st data section triplet                       00596600
SMF42_LEN EQU  *-SMF42                                                  00600400
*                                                                       00604200
*   -----------------------------------------------------------------   00608000
*    SMF42 subtype header sections.                                     00611800
*                                                                       00615600
*    Only include the subtype triplet(s) for the selected subtype.      00619400
*   -----------------------------------------------------------------   00623200
*                                                                       00627000
*                                                                       00630800
*                                                                       00634600
         AIF   ('&SMF42_01' EQ 'NO').SKIP_01                            00638400
*                                                                       00642200
*   -----------------------------------------------------------------   00646000
*    SMF42 subtype 1 header section (BMF Statistics)                    00649800
*   -----------------------------------------------------------------   00653600
*                                                                       00657400
*                                                                       00661200
SMF42S1  DSECT ,                                                        00665000
SMF42BMO DS    1FL4      Offset to BMF totals section                   00668800
SMF42BML DS    1FL2      Length of BMF totals section                   00672600
SMF42BMN DS    1FL2      Number of BMF totals sections                  00676400
SMF42SCO DS    1FL4      Offset to storage class summary section        00680200
SMF42SCL DS    1FL2      Length of storage class summary section        00684000
SMF42SCN DS    1FL2      Number of storage class summary sections       00687800
SMF42L1  EQU   16        Length of subtype 1 header section             00691600
SMF42S1_LEN EQU *-SMF42S1                                               00695400
.SKIP_01 ANOP                                                           00699200
*                                                                       00703000
*                                                                       00706800
*                                                                       00710600
*                                                                       00714400
         AIF   ('&SMF42_02' EQ 'NO').SKIP_02                            00718200
*                                                                       00722000
*   -----------------------------------------------------------------   00725800
*    SMF42 subtype 2 header section (Cache summary)                     00729600
*   -----------------------------------------------------------------   00733400
*                                                                       00737200
*                                                                       00741000
SMF42S2  DSECT ,                                                        00744800
SMF42CUO DS    1FL4      Offset to control unit cache section           00748600
SMF42CUL DS    1FL2      Length of control unit cache section           00752400
SMF42CUN DS    1FL2      Number of control unit cache sections          00756200
SMF42VLO DS    1FL4      Offset to volume section                       00760000
SMF42VLL DS    1FL2      Length of volume section                       00763800
SMF42VLN DS    1FL2      Number of volume sections                      00767600
SMF42L2  EQU   16        Length of subtype 2 header section             00771400
SMF42S2_LEN EQU *-SMF42S2                                               00775200
.SKIP_02 ANOP                                                           00779000
*                                                                       00782800
*                                                                       00786600
*                                                                       00790400
*                                                                       00794200
         AIF   ('&SMF42_03' EQ 'NO').SKIP_03                            00798000
*                                                                       00801800
*   -----------------------------------------------------------------   00805600
*    SMF42 subtype 3 header section (Config. audit)                     00809400
*   -----------------------------------------------------------------   00813200
*                                                                       00817000
*                                                                       00820800
SMF42S3  DSECT ,                                                        00824600
SMF42EAO DS    1FL4      Offset to event audit section                  00828400
SMF42EAL DS    1FL2      Length of event audit section                  00832200
SMF42EAN DS    1FL2      Number of event audit sections                 00836000
SMF42L3  EQU   8         Length of subtype 3 header section             00839800
SMF42S3_LEN EQU *-SMF42S3                                               00843600
.SKIP_03 ANOP                                                           00847400
*                                                                       00851200
*                                                                       00855000
*                                                                       00858800
*                                                                       00862600
         AIF   ('&SMF42_04' EQ 'NO').SKIP_04                 @OY66824   00866400
*                                                                       00870200
*   -----------------------------------------------------------------   00874000
*    SMF42 subtype 4 header section (System Data Mover statistics)      00877800
*                   (Concurrent Copy Session (CC) statistics or         00881600
*                   Extended Physical Data Set (EXT)         @OY66824   00885400
*                   statistics)                              @OY66824   00889200
*   -----------------------------------------------------------------   00893000
*                                                                       00896800
*                                                                       00900600
SMF42S4 DSECT ,                                              @OY66824   00904400
SMF42CCO DS    1FL4      Offset to CC statistics             @OY66824   00908200
SMF42CCL DS    1FL2      Length of CC statistics             @OY66824   00912000
SMF42CCN DS    1FL2      Number of CC sessions               @OY66824   00915800
SMF42EXO DS    1FL4      Offset to EXT statistcs             @OY66824   00919600
SMF42EXL DS    1FL2      Length of EXT statitics             @OY66824   00923400
SMF42EXN DS    1FL2      Number of EXT sessions              @OY66824   00927200
SMF42L4  EQU   16        Length of subtype 4 header section  @OY66824   00931000
SMF42S4_LEN EQU *-SMF42S4                                    @OY66824   00934800
.SKIP_04 ANOP                                                @OY66824   00938600
*                                                                       00942400
*                                                                       00946200
*                                                                       00950000
*                                                                       00953800
         AIF   ('&SMF42_05' EQ 'NO').SKIP_05                            00957600
*                                                                       00961400
*   -----------------------------------------------------------------   00965200
*    SMF42 subtype 5 header section                                     00969000
*     (Storage class response time statistics)                          00972800
*   -----------------------------------------------------------------   00976600
*                                                                       00980400
*                                                                       00984200
SMF42S5  DSECT ,                                                        00988000
SMF42SRO DS    1FL4      Offset to storage class response time section  00991800
SMF42SRL DS    1FL2      Length of storage class response time section  00995600
SMF42SRN DS    1FL2      Number of storage class response time         *00999400
                         sections                                       01003200
SMF42VHO DS    1FL4      Offset to volume header section          @P1A  01004700
SMF42VHL DS    1FL2      Length of volume header section          @P1A  01006200
SMF42VHN DS    1FL2      Number of volume header sections (=1)    @P1A  01007700
SMF42L5  EQU   *-SMF42S5 Length of subtype 5 header section       @P1C  01009200
SMF42S5_LEN EQU *-SMF42S5                                               01010800
.SKIP_05 ANOP                                                           01014600
*                                                                       01018400
*                                                                       01022200
*                                                                       01026000
*                                                                       01029800
         AIF   ('&SMF42_06' EQ 'NO').SKIP_06                            01033600
*                                                                       01037400
*   -----------------------------------------------------------------   01041200
*    SMF42 subtype 6 header section                                     01045000
*     (job/dataset statistics)                                          01048800
*   -----------------------------------------------------------------   01052600
*                                                                       01056400
*                                                                       01060200
SMF42S6  DSECT ,                                                        01064000
SMF42JHO DS    1FL4      Offset to job header section                   01067800
SMF42JHL DS    1FL2      Length of job header section                   01071600
SMF42JHN DS    1FL2      Number of job header sections                  01075400
SMF42L6  EQU   8         Length of subtype 6 header section             01079200
SMF42LN  EQU   36        Length of beginning SMF42 header section       01083000
SMF42S6_LEN EQU *-SMF42S6                                               01086800
.SKIP_06 ANOP                                                           01090600
*                                                                       01090700
*                                                                       01090800
*                                                                       01090900
         AIF   ('&SMF42_09' EQ 'NO').SKIP_09                     @P1A   01091000
*                                                                       01091100
*  ------------------------------------------------------------- @P1A   01091200
*    SMF42 subtype 9 header section (B37/D37/E37 abend)          @P1A   01091300
*  ------------------------------------------------------------- @P1A   01091400
*                                                                       01091500
SMF42S9  DSECT ,                                                 @P1A   01091600
SMF42ABO DS    1FL4      Offset to X37 abend section             @P1A   01091700
SMF42ABL DS    1FL2      Length of X37 abend section             @P1A   01091800
SMF42ABN DS    1FL2      Number of X37 abend sections (always 1) @P1A   01091900
SMF42SMO DS    1FL4      Offset to SMS data section              @P1A   01092000
SMF42SML DS    1FL2      Length of SMS data section              @P1A   01092100
SMF42SMN DS    1FL2      Number of SMS data sections (always 1)  @P1A   01092200
SMF42L9  EQU   16        Length of subtype 9 header section      @P1A   01092300
SMF42S9_LEN EQU *-SMF42S9                                               01092400
.SKIP_09 ANOP                                                    @P1A   01092500
*                                                                       01092600
*                                                                       01092700
         AIF   ('&SMF42_0B' EQ 'NO').SKIP_0B                     @07A   01092800
*                                                                       01092900
*   -----------------------------------------------------------------   01093000
*    SMF42 subtype 11 header section (Extended Remote Copy (XRC)        01093100
*                                     Session Statistics)        @07A   01093200
*   -----------------------------------------------------------------   01093300
*                                                                       01093400
*                                                                       01093500
SMF42SB DSECT ,                                                  @07A   01093600
SMF42XRO DS    1FL4      Offset to XRC statistics                @07A   01093700
SMF42XRL DS    1FL2      Length of XRC statistics                @07A   01093800
SMF42XRN DS    1FL2      Number of XRC sessions                  @07A   01093900
SMF42LB  EQU   8         Length of subtype 11 header section     @07A   01094000
SMF42SB_LEN EQU *-SMF42SB                                        @07A   01094100
.SKIP_0B ANOP                                                    @07A   01094200
*                                                                       01094300
*                                                                       01094400
         AIF ('&SMF42_0F' EQ 'NO').SKIP_0F                              01094500
*                                                                       01094600
* /*-----------------------------------------------------------------*/ 01094700
* /* SMF42 subtype 15 header section                                 */ 01094800
* /*  (Storage class response time summary)                          */ 01094900
* /*-----------------------------------------------------------------*/ 01095000
SMF42SF DSECT ,                                                         01095100
SMF42FC1 DS   1FL4                 Offset to SYSPLEX wide SC            01095200
*                                  summary data section          @10A   01095300
SMF42FC2 DS   1FL2                 Length of SYSPLEX wide SC            01095400
*                                  summary data section          @10A   01095500
SMF42FC3 DS   1FL2                 Number of SYSPLEX wide SC            01095600
*                                  summary data sections         @10A   01095700
SMF42FC4 DS   1FL4                 Offset to SC/CF/SYS                  01095800
*                                  summary section               @10A   01095900
SMF42FC5 DS   1FL2                 Length of SC/CF/SYS                  01096000
*                                  summary section               @10A   01096100
SMF42FC6 DS   1FL2                 Number of SC/CF/SYS                  01096200
*                                  summary sections              @10A   01096300
* DECLARE                                                               01096400
SMF42LF EQU *-SMF42SF              Length of subtype 15 header          01096500
*                                          section               @10A   01096600
.SKIP_0F ANOP                                                           01096700
         AIF ('&SMF42_0G' EQ 'NO').SKIP_0G                              01096800
* /*-----------------------------------------------------------------*/ 01096900
* /* SMF42 subtype 16 header section                                 */ 01097000
* /*  (Dataset response time summary)                                */ 01097100
* /*-----------------------------------------------------------------*/ 01097200
SMF42SG DSECT ,                                                         01097300
SMF42GD1 DS    1FL4                Offset to SYSPLEX wide data set      01097400
*                                  summary data section          @10A   01097500
SMF42GD2 DS    1FL2                Length of SYSPLEX wide data set      01097600
*                                  summary data section          @10A   01097700
SMF42GD3 DS    1FL2                Number of SYSPLEX wide data set      01097800
*                                  summary data sections         @10A   01097900
SMF42GD4 DS    1FL4                Offset to data set/CF/SYS            01098000
*                                  summary section               @10A   01098100
SMF42GD5 DS    1FL2                Length of data set/CF/SYS            01098200
*                                  summary section               @10A   01098300
SMF42GD6 DS    1FL2                Number of data set/CF/SYS            01098400
*                                  summary sections              @10A   01098500
SMF42LG EQU *-SMF42SG              Length of subtype 8 header           01098600
*                                  section                              01098700
.SKIP_0G ANOP                                                           01098800
         AIF ('&SMF42_0H' EQ 'NO').SKIP_0H                              01098900
* /*-----------------------------------------------------------------*/ 01099000
* /* SMF42 subtype 17 header section                                 */ 01099100
* /*  (Lock structure activity summary)                              */ 01099200
* /*-----------------------------------------------------------------*/ 01099300
SMF42SH DSECT ,                                                         01099400
SMF42HL1 DS    1FL4                Offset to MVS SYS lock structure     01099500
*                                  activity totals section              01099600
SMF42HL2 DS    1FL2                Length of MVS SYS lock structure     01099700
*                                  activity totals section              01099800
SMF42HL3 DS    1FL2                Number of MVS SYS lock structure     01099900
*                                  activity totals sections             01100000
SMF42HL4 DS    1FL4                Offset to lock structure             01100100
*                                  summary section                      01100200
SMF42HL5 DS    1FL2                Length of lock structure             01100300
*                                  summary section                      01100400
SMF42HL6 DS    1FL2                Number of lock structure             01100500
*                                  summary sections                     01100600
SMF42LH EQU *-SMF42SH              Length of subtype 9 header           01100700
*                                          section                      01100800
.SKIP_0H ANOP                                                           01100900
         AIF ('&SMF42_0I' EQ 'NO').SKIP_0I                              01101000
* /*-----------------------------------------------------------------*/ 01101100
* /* SMF42 subtype 18 header section                                 */ 01101200
* /*  (Coupling Facility Cache Partition summary)                    */ 01101300
* /*-----------------------------------------------------------------*/ 01101400
SMF42SI DSECT ,                                                         01101500
SMF42IM1 DS    1FL4                Offset to CF cache partition         01101600
*                                  activity totals section              01101700
SMF42IM2 DS    1FL2                Length of CF cache partition         01101800
*                                  activity totals section              01101900
SMF42IM3 DS    1FL2                Number of CF cache partition         01102000
*                                  activity totals sections             01102100
SMF42IM4 DS    1FL4                Offset to single cache partition     01102200
*                                  summary section                      01102300
SMF42IM5 DS    1FL2                Length of single CF cache            01102400
*                                  partition summary section            01102500
SMF42IM6 DS    1FL2                Number of single CF cache            01102600
*                                  partition summary sections           01102700
SMF42IM7 DS    1FL4                Offset to directory/element    @11A  01102800
*                                  ratio data summary section     @11A  01102900
SMF42IM8 DS    1FL2                Length of directory/element    @11A  01103000
*                                  data summary section           @11A  01103100
SMF42IM9 DS    1FL2                Number of directory/element    @11A  01103200
*                                  ratio sections                 @11A  01103300
SMF42LI EQU *-SMF42SI              Length of subtype 10 header          01103400
*                                  section                              01103500
.SKIP_0I ANOP                                                           01103600
         AIF ('&SMF42_0J' EQ 'NO').SKIP_0J                              01103700
* --------------------------------------------------------------- @11A  01103800
*    SMF42 subtype 19 header section                              @11A  01103900
*     (Buffer Manager LRU activity)                               @11A  01104000
* --------------------------------------------------------------- @11A  01104100
SMF42SJ DSECT ,                                                   @11A  01104200
SMF42JN1 DS    1FL4                Offset to Buffer Manager LRU   @11A  01104300
*                                  activity total section         @11A  01104400
SMF42JN2 DS    1FL2                Length of Buffer Manager LRU   @11A  01104500
*                                  activity total section         @11A  01104600
SMF42JN3 DS    1FL2                Number of Buffer Manager LRU   @11A  01104700
*                                  activity total sections.       @11A  01104800
SMF42JN4 DS    1FL4                Offset to Buffer Manager LRU   @11A  01104900
*                                  activity section               @11A  01105000
SMF42JN5 DS    1FL2                Length of Buffer Manager LRU   @11A  01105100
*                                  activity section               @11A  01105200
SMF42JN6 DS    1FL2                Number of Buffer Manager LRU   @11A  01105300
*                                  activity sections.             @11A  01105400
SMF42LJ EQU *-SMF42SJ              Length of subtype 19 header    @11A  01105500
*                                  section                        @11A  01105600
.SKIP_0J ANOP                                                     @11A  01105700
*                                                                       01105800
SMF42LEN EQU *-SMF42                Length of beginning SMF42           01105900
*                                   header section                      01106000
*                                                                       01106100
*   -----------------------------------------------------------------   01106200
*     Product Section                                                   01106300
*   -----------------------------------------------------------------   01106400
*                                                                       01109600
*                                                                       01113400
SMF42PRD DSECT ,                                                        01117200
SMF42PDL DS    1CL0008   Product Level                                  01121000
SMF42PDN DS    1CL0010   Product Name                                   01124800
SMF42PSV DS    X         Subtype version number                  @P1A   01127300
         DS    1CL0001   Reserved                                @P1C   01129800
SMF42PTS DS    1CL0008   Interval Start or Open TOD                     01132400
SMF42PTE DS    1CL0008   Interval End or Close TOD                      01136200
         DS    1CL0004   Reserved                                       01140000
*                                                                       01143800
*   -----------------------------------------------------------------   01147600
*    Product section must end on word boundary                          01151400
*   -----------------------------------------------------------------   01155200
*                                                                       01159000
*                                                                       01162800
SMF42PLN EQU   40        Length of Product Section                      01166600
SMF42PVR EQU   1         Product Section Version                 @P1A   01168500
SMF42PRD_LEN EQU *-SMF42PRD                                             01170400
*                                                                       01174200
*                                                                       01178000
*                                                                       01181800
         AIF   ('&SMF42_01' EQ 'NO').SKIP_B1                            01185600
*                                                                       01189400
*   -----------------------------------------------------------------   01193200
*     Start of Buffer Management Facility Section                       01197000
*   -----------------------------------------------------------------   01200800
*                                                                       01204600
*                                                                       01208400
*                                                                       01212200
*   -----------------------------------------------------------------   01216000
*    SMF type 42 subtype 1 (Buffer Manager Statistics, part 1)          01219800
*   -----------------------------------------------------------------   01223600
*                                                                       01227400
*                                                                       01231200
SMF4201A DSECT ,                                                        01235000
SMF42BMF DS    0CL0036   Description of BMF totals section              01238800
SMF42TNA DS    1FL4      Total number of storage classes                01242600
SMF42TMT DS    1FL4      Interval length (total time of measurement    *01246400
                         period)                                        01250200
SMF42TRT DS    1FL4      Total number of member data page reads         01254000
SMF42TRH DS    1FL4      Total number of member data page read hits    *01257800
                         (found in BMF)                                 01261600
SMF42TDT DS    1FL4      Total number of directory data page reads      01265400
SMF42TDH DS    1FL4      Total number of directory data page read hits *01269200
                         (found in BMF)                                 01273000
SMF42BUF DS    1FL4      Total number of active BMF 4K buffers   @18A   01274500
SMF42BMX DS    1FL4      High water mark of BMF buffers          @18A   01276000
SMF42LRU DS    1FL2      BMF LRU interval time                   @18A   01277500
SMF42UIC DS    1FL2      BMF LRU cycles before buffer cast out   @18A   01279000
SMF4201A_LEN EQU *-SMF4201A                                             01280600
*                                                                       01284400
*   -----------------------------------------------------------------   01288200
*    SMF type 42 subtype 1 (Buffer Manager Statistics, part 2)          01292000
*   -----------------------------------------------------------------   01295800
*                                                                       01299600
*                                                                       01303400
SMF4201B DSECT ,                                                        01307200
SMF42SC  DS    0CL0048   Description of Stor Class Sum section @OW00573 01311000
SMF42PNA DS    0CL0032   Storage class name                             01314800
SMF42PNL DS    1FL2      Storage class name length                      01318600
SMF42PNN DS    1CL0030   Storage class name                             01322400
SMF42SRT DS    1FL4      Total number of member data page reads         01326200
SMF42SRH DS    1FL4      Total number of member data page read hits    *01335000
                         (found in BMF)                                 01336200
SMF42SDT DS    1FL4      Total number of directory data page reads      01337600
SMF42SDH DS    1FL4      Total number of directory data page read hits *01341400
                         (found in BMF)                                 01345200
SMF4201B_LEN EQU *-SMF4201B                                             01349000
.SKIP_B1 ANOP                                                           01352800
*                                                                       01356600
*                                                                       01360400
*                                                                       01364200
*                                                                       01368000
         AIF   ('&SMF42_02' EQ 'NO').SKIP_B2                            01371800
*                                                                       01375600
*   -----------------------------------------------------------------   01379400
*     Start of Control Unit Cache Summary Section                       01383200
*   -----------------------------------------------------------------   01387000
*                                                                       01390800
*                                                                       01394600
*                                                                       01398400
*   -----------------------------------------------------------------   01402200
*    SMF type 42 subtype 2 (Control Unit Cache Summary, part 1)         01406000
*   -----------------------------------------------------------------   01409800
*                                                                       01413600
*                                                                       01417400
SMF4202A DSECT ,                                                        01421200
SMF42CUC DS    0CL0088   Description of control unit cache section      01425000
SMF42HWS DS    0CL0032   Description of hardware status section         01428800
SMF42SCS DS    1BL1      Storage director caching status. Format as    *01432600
                         follows: 000xxxxx = Caching is active         *01436400
                         001xxxxx = Caching is pending active 010xxxxx *01440200
                         = Internal subsystem error. Caching has       *01444000
                         terminated 100xxxxx = Caching deactivated due *01447800
                         to explicit host request 110xxxxx = Pending   *01451600
                         off in process. Command to deactivate cache   *01455400
                         received, destage still in progress 111xxxxx  *01459200
                         = Pending off destage failed xxx1xxxx =       *01463000
                         Subsystem storage disabled for maintenance     01466800
*                        xxxxXXxx = Reserved xxxxxx1x = IML device not *01470600
                         available xxxxxxx1 = Non-retentive data is    *01474400
                         deactivated                                    01478200
SMF42NCS DS    1BL1      Subsystem non-volatile storage status. Format *01482000
                         as follows: 00xxxxxx = Non-volatile cache is  *01485800
                         active 01xxxxxx = Internal subsystem error.   *01489600
                         Non-volatile cache availability terminated    *01493400
                         10xxxxxx = Non-volatile cache has been        *01497200
                         deactivated due to explicit host system       *01501000
                         request 11xxxxxx = Pending non-volatile       *01504800
                         unavailable has been received, destage still  *01508600
                         in progress xxXxxXXX = Reserved xxx1xxxx =    *01512400
                         Non-volatile storage disabled for maintenance  01516200
*                        xxxx1xxx = Non-volatile storage disabled due  *01520000
                         to error                                       01523800
SMF42CID DS    1FL2      Subsystem identifier                           01527600
SMF42CSS DS    1FL4      Configured subsystem storage capacity. F'-1'  *01531400
                         = undetermined                                 01535200
SMF42SSA DS    1FL4      Subsystem storage available for allocation as *01539000
                         cache space                                    01542800
SMF42SAP DS    1FL4      Subsystem storage allocated for pinned data    01546600
SMF42SSU DS    1FL4      Subsystem storage unavailable due to          *01550400
                         subsystem failures                             01554200
SMF42NSZ DS    1FL4      Configured non-volatile cache capacity. F'-1' *01558000
                         = undetermined                                 01561800
SMF42SPR DS    1FL4      Non-volatile cache allocated for pinned data   01565600
SMF42SSF DS    1BL1      Subsystem Flags                         @08A   01567500
SMF42ENH EQU   X'80'     Subsystem is D/T3990-6 enhanced mode    @08A   01569400
         DS    1CL0003   Reserved                                @08C   01571300
SMF42SWS DS    0CL0056   Description of software status section         01573200
*                                                                       01577000
*      ***************************************************************  01580800
*      *                                                             *  01584600
*      * Statistics gathered from LAST update period                 *  01588400
*      *                                                             *  01592200
*      ***************************************************************  01596000
*                                                                       01599800
*                                                                       01603600
SMF42LCT DS    1FL4      I/O count for subsystem                        01607400
SMF42LFW DS    1FL4      Fast write wait count                          01611200
SMF42LRH DS    1FL4      Cache normal read hit percent                  01615000
SMF42LWM DS    1FL4      Fast write waits per minute                    01618800
SMF42LTS DS    0CL0008   Time stamp                                     01622600
SMF42LYY DS    1FL2      Year                                           01626400
SMF42LDD DS    1FL2      Day                                            01630200
SMF42LTM DS    1FL4      Time: HH:MM:SS:TH (1 byte ea.)                 01634000
*                                                                       01637800
*      ***************************************************************  01641600
*      *                                                             *  01645400
*      * Statistics gathered from CURRENT update period              *  01649200
*      *                                                             *  01653000
*      ***************************************************************  01656800
*                                                                       01660600
*                                                                       01664400
SMF42CCT DS    1FL4      I/O count for subsystem                        01668200
SMF42CFW DS    1FL4      Fast write wait count                          01672000
SMF42CRH DS    1FL4      Cache normal read hit percent                  01675800
SMF42CWM DS    1FL4      Fast write waits per minute                    01679600
SMF42CTS DS    0CL0008   Time stamp                                     01683400
SMF42CYY DS    1FL2      Year                                           01687200
SMF42CDD DS    1FL2      Day                                            01691000
SMF42CTM DS    1FL4      Time: HH:MM:SS:TH (1 byte ea.)                 01694800
*                                                                       01698600
*      ***************************************************************  01702400
*      *                                                             *  01706200
*      * Statistical averages                                        *  01710000
*      *                                                             *  01713800
*      ***************************************************************  01717600
*                                                                       01721400
*                                                                       01725200
SMF42AHR DS    1FL2      Average hit ratio                              01729000
SMF42AFW DS    1FL2      Average fast write waits per minute            01732800
         DS    1CL0004   Reserved                                       01736600
SMF4202A_LEN EQU *-SMF4202A                                             01740400
*                                                                       01744200
*   -----------------------------------------------------------------   01748000
*     Second part of Control Unit Cache Summary Section                 01751800
*   -----------------------------------------------------------------   01755600
*                                                                       01759400
*                                                                       01763200
*                                                                       01767000
*   -----------------------------------------------------------------   01770800
*    SMF type 42 subtype 2 (Control Unit Cache Summary, part 2)         01774600
*   -----------------------------------------------------------------   01778400
*                                                                       01782200
*                                                                       01786000
SMF4202B DSECT ,                                                        01789800
SMF42VLS DS    0CL0016   Description of volume status section           01793600
SMF42VOL DS    1CL0006   Volume serial number                           01797400
         DS    1CL0002   Reserved                                       01801200
SMF42DEV DS    1FL4      Device number                                  01805000
SMF42VST DS    0BL2      Device status flags                            01808800
SMF42DB1 DS    1BL1      Device status flags, byte 1. Format as        *01812600
                         follows: Bits 0-1 = Device Cache Status       *01816400
                         00xxxxxx = Caching activated 01xxxxxx =       *01820200
                         Unused 10xxxxxx = Deactivate pending by       *01824000
                         explicit host request. Transfer of modified   *01827800
                         data to DASD failed 11xxxxxx = Caching        *01831600
                         deactivated unavailable Bits 2-3 = Fast write *01835400
                         status xx00xxxx = Fast write activated        *01839200
                         xx01xxxx = Unused xx10xxxx = Fast write       *01843000
                         deactivate pending, transfer of data to DASD   01846800
*                        failed xx11xxxx = Fast write deactivated Bits *01850600
                         4-7 = Duplex pair flags xxxx1xxx = Primary of *01854400
                         duplex pair xxxxx1xx = Secondary of duplex    *01858200
                         pair xxxxxx00 = Duplex pair available         *01862000
                         xxxxxx01 = Duplex pair pending (copy to       *01865800
                         establish duplex pair in progress or failed)  *01869600
                         xxxxxx10 = Failed duplex by command xxxxxx11  *01873400
                         = Failed duplex by subsystem                   01877200
SMF42DB2 DS    1BL1      Device status flags, byte 2. Format as        *01881000
                         follows: 1xxxxxxx = Device is 'failed' of     *01884800
                         failed duplex x1xxxxxx = Device has pinned    *01888600
                         data xxXXXXXX = Channel connect address for   *01892400
                         other device in duplex pair                    01896200
         DS    1CL0002   Reserved                                       01900000
SMF4202B_LEN EQU *-SMF4202B                                             01903800
.SKIP_B2 ANOP                                                           01907600
*                                                                       01911400
*                                                                       01915200
*                                                                       01919000
*                                                                       01922800
         AIF   ('&SMF42_03' EQ 'NO').SKIP_B3                            01926600
*                                                                       01930400
*   -----------------------------------------------------------------   01934200
*     Start of Event Audit Section (Operational Services)               01938000
*   -----------------------------------------------------------------   01941800
*                                                                       01945600
*                                                                       01949400
*                                                                       01953200
*   -----------------------------------------------------------------   01957000
*    SMF type 42 subtype 3 (Event Audit Section)                        01960800
*   -----------------------------------------------------------------   01964600
*                                                                       01968400
*                                                                       01972200
SMF4203A DSECT ,                                                        01976000
SMF42EAS DS    0CL0192   Description of event audit section             01979800
SMF42EAC DS    1CL0008   Action which caused record to be created:     *01983600
                         ACTIVATE, ENF, VARY SMS, or SAVEACDS           01987400
SMF42ERC DS    1FL4      Return code from resulting event               01991200
SMF42ERS DS    1FL4      Reason code from resulting event               01995000
*                                                                       01998800
*      ***************************************************************  02002600
*      *                                                             *  02006400
*      * Fields filled in for ENF event                              *  02010200
*      *                                                             *  02014000
*      ***************************************************************  02017800
*                                                                       02021600
*                                                                       02025400
SMF42EUA DS    1AL4      UCB address for device                         02029200
SMF42EVO DS    1CL0006   Volser for device                              02033000
         DS    1CL0002   Reserved                                       02036800
SMF42EOS DS    1FL1      Old MVS volume status                          02040600
SMF42ENS DS    1FL1      New MVS volume status                          02044400
         DS    1CL0002   reserved                                       02048200
*                                                                       02052000
*      ***************************************************************  02055800
*      *                                                             *  02059600
*      * Fields filled in for VARY SMS command                       *  02063400
*      *                                                             *  02067200
*      ***************************************************************  02071000
*                                                                       02074800
*                                                                       02078600
SMF42ETY DS    1CL0008   Type of VARY request: STORGRP, LIBRARY,       *02082400
                         DRIVE, or VOLUME                               02086200
SMF42ERN DS    0CL0032   VARY request name                              02090000
SMF42ENL DS    1FL2      Name length                                    02093800
SMF42ENM DS    1CL0030   STORGRP name or LIBRARY name or DRIVE name     02097600
SMF42EVL DS    1CL0006   Volume serial                                  02101400
         DS    1CL0002   Reserved                                       02105200
SMF42ESY DS    1CL0008   System name or '(ALL)'                         02109000
SMF42EST DS    1CL0012   Resulting status: ENABLE or ENABLE,NEW or     *02112800
                         QUIESCE or QUIESCE,NEW or DISABLE or          *02116600
                         DISABLE,NEW or ONLINE or OFFLINE               02120400
         DS    1CL0004   Reserved                                       02124200
*                                                                       02128000
*      ***************************************************************  02131800
*      *                                                             *  02135600
*      * Fields filled in for ACTIVATE command                       *  02139400
*      *                                                             *  02143200
*      ***************************************************************  02147000
*                                                                       02150800
*                                                                       02154600
SMF42ESD DS    1CL0044   Source control data set name                   02158400
SMF42EAD DS    1CL0044   Active control data set name                   02162200
SMF4203A_LEN EQU *-SMF4203A                                             02166000
.SKIP_B3 ANOP                                                           02169800
*                                                                       02173600
*                                                                       02177400
*                                                                       02181200
*                                                                       02185000
         AIF   ('&SMF42_04' EQ 'NO').SKIP_B4                   @OY66824 02188800
*                                                                       02192600
*                                                                       02196400
*   -----------------------------------------------------------------   02200200
*     Start of System Data Mover Session Statistics            @OY66824 02204000
*   -----------------------------------------------------------------   02207800
*                                                                       02211600
*                                                                       02215400
*   -----------------------------------------------------------------   02219200
*    SMF type 42 subtype 4 (Concurrent Copy Session Statistics)@OY66824 02223000
*   -----------------------------------------------------------------   02226800
*                                                                       02230600
*                                                                       02234400
SMF4204C DSECT  ,        Concurrent Copy SDM Session Statistics@OY66824 02238200
S42CCID  DS    1FL4      Logical Session ID                    @OY66824 02242000
S42CCRQS DS    1CL0002   Request type, 'CC ' = Concurrent copy @OY66824 02245800
S42CCTS  DS    1CL0001   Termination status,                   @OY66824 02249600
*                        'N' = normal, 'A' = abnormal          @OY66824 02253400
         DS    1CL0001   Reserved                              @OY66824 02257200
S42CCJNM DS    1CL0008   Invoking Jobname                      @OY66824 02261000
S42CCJNO DS    1CL0008   Invoking Job number                   @OY66824 02264800
S42CCSST DS    1CL0008   Session start TOD                     @OY66824 02268600
S42CCEIT DS    1CL0008   Initialization end TOD                @OY66824 02272400
S42CCSET DS    1CL0008   Session end TOD                       @OY66824 02276200
S42CCSSO DS    1FL4      Offset to first SSID header           @OY66824 02280000
S42CCSSN DS    1FL2      Number of SSID's for the session      @OY66824 02283800
S42CCSSL DS    1FL2      Length of  SSID header                @OY66824 02287600
         DS    1CL008    Reserved                              @OY66824 02291400
SMF4204C_LEN EQU *-SMF4204C                                    @OY66824 02295200
*                                                                       02299000
*   -----------------------------------------------------------------   02302800
*    CC SSID Header Section (SMF42 subtype 4)                  @OY66824 02306600
*   -----------------------------------------------------------------   02310400
*                                                                       02314200
*                                                                       02318000
S42CSIDH DSECT ,                                               @OY66824 02321800
S42CSNXT DS    1FL4      Offset to next SSID header            @OY66824 02325600
*                        (0 if last SSID)                      @OY66824 02329400
S42CSID  DS    1FL2      SSID                                  @OY66824 02333200
S42CSIDP DS    1FL1      Controller session ID                 @OY66824 02337000
         DS    1CL0001   Reserved                              @OY66824 02340800
S42CSMSF DS    1FL4      Maximum track threshold reached in    @OY66824 02344600
*                        storage control buffers               @OY66824 02348400
S42CSVLO DS    1FL4      Offset to first volume                @OY66824 02352200
S42CSVLN DS    1FL2      Number of volumes                     @OY66824 02356000
S42CSVLL DS    1FL2      Length of volume section              @OY66824 02359800
         DS    1CL004    Reserved                              @OY66824 02363600
S42CSIDH_LEN EQU *-S42CSIDH                                    @OY66824 02367400
*                                                                       02371200
*   -----------------------------------------------------------------   02375000
*    CC Volume section (SMF42 subtype 4)                       @OY66824 02378800
*   -----------------------------------------------------------------   02382600
*                                                                       02386400
*                                                                       02390200
S42CVL   DSECT ,                                               @OY66824 02394000
S42CVLNX DS    1FL4      Offset to next volume (0 if last      @OY66824 02397800
*                        volume)                               @OY66824 02401600
S42CVLSR DS    1CL0006   Volume Serial                         @OY66824 02405400
         DS    1CL0002   Reserved                              @OY66824 02409200
S42CVLDV DS    1CL0001   Device type  (UCBTBYT4)               @OY66824 02413000
S42CVLUA DS    1CL0003   Unit address (UCBNAME)                @OY66824 02416800
S42CVLTK DS    1FL4      Number of tracks to be processed on   @OY66824 02420600
*                        vol                                   @OY66824 02424400
S42CVLRD DS    1FL4      Number of tracks read directly from   @OY66824 02428200
*                        DASD                                  @OY66824 02432000
S42CVLRS DS    1FL4      Number of tracks read from the        @OY66824 02435800
*                        storage control buffers               @OY66824 02439600
S42CVLEP DS    1FL4      Number of EXCPs                       @OY66824 02443400
S42CVLUX DS    1CL0004   Unit address (UCBNAME) extended           @20C 02447200
S42CVL_LEN EQU *-S42CVL                                        @OY66824 02451000
*                                                                       02454800
*                                                                       02458600
*   -----------------------------------------------------------------   02462400
*    SMF type 42 subtype 4 (Extended Sequential Data Set       @OY66824 02466200
*                           session statistics)                @OY66824 02470000
*   -----------------------------------------------------------------   02473800
*                                                                       02477600
*                                                                       02481400
SMF4204E DSECT  ,        Extended Sequential Data Set SMD      @OY66824 02485200
*                        Session Statistics                    @OY66824 02489000
S42EXID  DS    1FL4      Logical Session ID                    @OY66824 02492800
S42EXRQS DS    1CL0003   Request type, 'EXT' = Extended        @OY66824 02496600
*                        Sequential Data Set                   @OY66824 02500400
         DS    1CL0001   Reserved                              @OY66824 02504200
S42EXJNM DS    1CL0008   Invoking Jobname                      @OY66824 02508000
S42EXJNO DS    1CL0008   Invoking Job number                   @OY66824 02511800
S42EXSTM DS    1CL0008   Session start TOD                     @OY66824 02515600
S42EXETM DS    1CL0008   Session end TOD                       @OW09203 02519400
S42EXTS  DS    1CL0001   Termination status,                   @OY66824 02523200
*                        'N' = normal, 'A' = abnormal          @OY66824 02527000
         DS    1CL0003   Reserved                              @OY66824 02530800
S42EVLRT DS    1FL8      Number of tracks read                 @OY66824 02534600
S42EVLWT DS    1FL8      Number of tracks written              @OY66824 02538400
         DS    1CL00012  Reserved                              @OY66824 02542200
SMF4204E_LEN EQU *-SMF4204E                                    @OY66824 02546000
.SKIP_B4 ANOP                                                  @OY66824 02549800
*                                                                       02553600
*                                                                       02557400
         AIF   ('&SMF42_05' EQ 'NO').SKIP_B5                            02561200
*                                                                       02565000
*   -----------------------------------------------------------------   02568800
*    Storage Class Response Time Section (SMF42 subtype 5)              02572600
*   -----------------------------------------------------------------   02576400
*                                                                       02580200
*                                                                       02584000
SMF4205A DSECT ,                                                        02587800
S42SCNAM DS    0CL0032   Storage class name                             02591600
S42SCRNL DS    1FL2      Storage class name length                      02595400
S42SCRNN DS    1CL0030   Storage class name                             02599200
S42SCIO  DS    0CL0040   Description of I/O Stats                       02603000
S42SCIOR DS    1FL4      Response time                                  02606800
S42SCIOC DS    1FL4      Avg I/O connect time                           02610600
S42SCIOP DS    1FL4      Avg I/O pending time                           02614400
S42SCIOD DS    1FL4      Avg I/O disconnect time                        02618200
S42SCIOQ DS    1FL4      Avg cntl unit queue time                       02622000
S42SCION DS    1FL4      Total number of I/Os                           02625800
*                                                                       02629600
*      ***************************************************************  02633400
*      *                                                             *  02637200
*      * 3990 Control unit cache statistics                             02641000
*      *                                                             *  02644800
*      ***************************************************************  02648600
*                                                                       02652400
*                                                                       02656200
S42SCCND DS    1FL4      No. of cache candidates                        02660000
S42SCHIT DS    1FL4      No. of cache hits                              02663800
S42SCWCN DS    1FL4      No. of write candidates                        02667600
S42SCWHI DS    1FL4      No. of write hits                              02671400
S42SCSEQ DS    1FL4      No. of sequential I/Os            @OW00573     02672100
S42SCRLC DS    1FL4      No. of RLC I/O's                  @OW00573     02672800
S42SCICL DS    1FL4      No. of ILC I/O's                  @OW00573     02673500
S42SCDAO DS    1FL4      Average I/O device-active-only time   @19C     02674300
SMF4205A_LEN EQU *-SMF4205A                                             02675200
*   -----------------------------------------------------------@P1A     02675300
*    Volume Statistics Header section (SMF Subtype 5)          @P1A     02675400
*      Note that offsets to component sections are zero        @P1A     02675500
*      if there are no statistics for the component            @P1A     02675600
*   -----------------------------------------------------------@P1A     02675700
*                                                              @P1A     02675800
SMF4205B DSECT ,                                               @P1A     02675900
S42VTNXT DS    1FL4      Offset to next volume                 @P1A     02676000
S42VTSER DS    CL6       Volume serial                         @P1A     02676100
S42VTADR DS    1FL2      Device address                        @P1A     02676200
S42VTFL1 DS    1FL1      Flags                                 @P1A     02676300
S42VTONL EQU   X'80'     Device online                         @P1A     02676400
S42VTSMS EQU   X'40'     SMS volume                            @P1A     02676500
         DS    CL7       Reserved                              @P1A     02676600
S42VTUNC DS    1FL4      I/O count, unknown data set           @P1A     02676700
S42VTVDO DS    1FL4      Offset to VTOC Data component section @P1A     02676800
S42VTVDL DS    1FL2      Length of VTOC Data component section @P1A     02676900
*        DS    1FL2      Reserved                              @P1A     02677000
S42VTVXO DS    1FL4      Offset to VTOC Index section          @P1A     02677100
S42VTVXL DS    1FL2      Length of VTOC Index section          @P1A     02677200
*        DS    1FL2      Reserved                              @P1A     02677300
S42VTVVO DS    1FL4      Offset to VVDS section                @P1A     02677400
S42VTVVL DS    1FL2      Length of VVDS section                @P1A     02677500
*        DS    1FL2      Reserved                              @P1A     02677600
SMF4205B_LEN EQU *-SMF4205B                                    @P1A     02677700
*   -----------------------------------------------------------@P1A     02677800
*    VTOC data component (Subtype 5)                           @P1A     02677900
*   -----------------------------------------------------------@P1A     02678000
*                                                              @P1A     02678100
SMF4205C DSECT ,                                               @P1A     02678200
S42VDIOR DS    1FL4      Response time                         @P1A     02678300
S42VDIOC DS    1FL4      Avg I/O connect time                  @P1A     02678400
S42VDIOP DS    1FL4      Avg I/O pending time                  @P1A     02678500
S42VDIOD DS    1FL4      Avg I/O disconnect time               @P1A     02678600
S42VDIOQ DS    1FL4      Avg cntl unit queue time              @P1A     02678700
S42VDION DS    1FL4      Total number of I/Os                  @P1A     02678800
S42VDCND DS    1FL4      No. of cache candidates               @P1A     02678900
S42VDHIT DS    1FL4      No. of cache hits                     @P1A     02679000
S42VDWCN DS    1FL4      No. of write candidates               @P1A     02679100
S42VDWHI DS    1FL4      No. of write hits                     @P1A     02679200
S42VDSEQ DS    1FL4      No. of sequential I/Os                @P1A     02679300
S42VDRLC DS    1FL4      No. of RLC I/O's                      @P1A     02679400
S42VDICL DS    1FL4      No. of ICL I/O's                      @P1A     02679500
S42VDDAO DS    1FL4      Average I/O device-active-only time   @19C     02679600
*                                                              @P1A     02679700
*                                                              @P1A     02679800
SMF4205C_LEN EQU *-SMF4205C                                    @P1A     02679900
*   -----------------------------------------------------------@P1A     02680000
*    VTOC index component (Subtype 5)                          @P1A     02680100
*   -----------------------------------------------------------@P1A     02680200
*                                                              @P1A     02680300
SMF4205D DSECT ,                                               @P1A     02680400
S42VXIOR DS    1FL4      Response time                         @P1A     02680500
S42VXIOC DS    1FL4      Avg I/O connect time                  @P1A     02680600
S42VXIOP DS    1FL4      Avg I/O pending time                  @P1A     02680700
S42VXIOD DS    1FL4      Avg I/O disconnect time               @P1A     02680800
S42VXIOQ DS    1FL4      Avg cntl unit queue time              @P1A     02680900
S42VXION DS    1FL4      Total number of I/Os                  @P1A     02681000
S42VXCND DS    1FL4      No. of cache candidates               @P1A     02681100
S42VXHIT DS    1FL4      No. of cache hits                     @P1A     02681200
S42VXWCN DS    1FL4      No. of write candidates               @P1A     02681300
S42VXWHI DS    1FL4      No. of write hits                     @P1A     02681400
S42VXSEQ DS    1FL4      No. of sequential I/Os                @P1A     02681500
S42VXRLC DS    1FL4      No. of RLC I/O's                      @P1A     02681600
S42VXICL DS    1FL4      No. of ICL I/O's                      @P1A     02681700
S42VXDAO DS    1FL4      Average I/O device-active-only time   @19C     02681800
*                                                              @P1A     02681900
*                                                              @P1A     02682000
SMF4205D_LEN EQU *-SMF4205D                                    @P1A     02682100
*   -----------------------------------------------------------@P1A     02682200
*    VVDS component (Subtype 5)                                @P1A     02682300
*   -----------------------------------------------------------@P1A     02682400
*                                                              @P1A     02682500
SMF4205E DSECT ,                                               @P1A     02682600
S42VVIOR DS    1FL4      Response time                         @P1A     02682700
S42VVIOC DS    1FL4      Avg I/O connect time                  @P1A     02682800
S42VVIOP DS    1FL4      Avg I/O pending time                  @P1A     02682900
S42VVIOD DS    1FL4      Avg I/O disconnect time               @P1A     02683000
S42VVIOQ DS    1FL4      Avg cntl unit queue time              @P1A     02683100
S42VVION DS    1FL4      Total number of I/Os                  @P1A     02683200
S42VVCND DS    1FL4      No. of cache candidates               @P1A     02683300
S42VVHIT DS    1FL4      No. of cache hits                     @P1A     02683400
S42VVWCN DS    1FL4      No. of write candidates               @P1A     02683500
S42VVWHI DS    1FL4      No. of write hits                     @P1A     02683600
S42VVSEQ DS    1FL4      No. of sequential I/Os                @P1A     02683700
S42VVRLC DS    1FL4      No. of RLC I/O's                      @P1A     02683800
S42VVICL DS    1FL4      No. of ICL I/O's                      @P1A     02683900
S42VVDAO DS    1FL4      Average I/O device-active-only time   @19C     02684000
*                                                              @P1A     02684100
*                                                              @P1A     02684200
SMF4205E_LEN EQU *-SMF4205E                                    @P1A     02684300
.SKIP_B5 ANOP                                                           02684400
*                                                                       02684500
*                                                                       02686600
*                                                                       02690400
*                                                                       02694200
         AIF   ('&SMF42_06' EQ 'NO').SKIP_B6                            02698000
*                                                                       02701800
*   -----------------------------------------------------------------   02705600
*    Job section - Data set statistics (SMF42 subtype 6)                02709400
*   -----------------------------------------------------------------   02713200
*                                                                       02717000
*                                                                       02720800
SMF4206A DSECT ,                                                        02724600
S42JDJNM DS    1CL0008   Job name                                       02728400
S42JDRST DS    1FL4      Time, in hundreds of a second, reader         *02732200
                         recognized the JOB card for this job           02736000
S42JDRSD DS    1CL0004   Date reader recognized the JOB card for this  *02739800
                         job, in the form 0cyydddF, where F is the     *02743600
                         sign                                           02747400
S42JDUID DS    1CL0008   User identification (taken from common exit   *02751200
                         parameter area)                                02755000
S42JDDSO DS    1FL4      Offset to first data set hdr                   02758800
S42JDDSL DS    1FL2      Length of DS header sec                        02762600
S42JDCOD DS    1FL1      0=Close, 1=Interval record                     02766400
         DS    1CL0001   Reserved                                       02770200
S42JDPGN DS    1FL2      Job performance group number                   02774000
S42JDIOL DS    1FL2      Length of Data Set I/O section                 02777800
S42JDAML DS    1FL2      Length of AM section               @OW00573    02779700
         DS    1CL0002   Reserved                               @09A    02780100
S42JDGMO DS    1FL4      GMT Offset represented in 1.048576 sec @09A    02780500
S42JDWSC DS    1CL8      Workload Manager Service Class name    @P1A    02780600
S42JDWLD DS    1CL8      Workload Manager Workload name         @P1A    02780700
         DS    1CL0004   Reserved                               @09A    02780900
SMF4206A_LEN EQU *-SMF4206A                                             02781600
*                                                                       02785400
*   -----------------------------------------------------------------   02789200
*    Data set header section (SMF42 subtype 6)                          02793000
*   -----------------------------------------------------------------   02796800
*                                                                       02800600
*                                                                       02804400
S42DSH   DSECT ,                                                        02808200
S42DSNXT DS    1FL4      Offset to next DS header                       02812000
S42DSN   DS    1CL0044   Data set name                                  02815800
S42DSTYP DS    1CL0001   Reserved                                       02819600
S42DSCOD DS    0BL1      Entry descriptor flags                         02823400
S42FIRST EQU   X'80'     1st DS entry since Open                        02827200
         ORG   S42DSCOD+X'00000001'                                     02831000
S42DSFL1 DS    X         Data set descriptor flags               @P1A   02831500
S42DSVBU EQU   X'80'     VSAM buffer flags          @            @P1A   02832000
S42DSGSR EQU   X'C0'       GSR                                   @P1A   02832500
S42DSLSR EQU   X'80'       LSR                                   @P1A   02833000
S42DSRLS EQU   X'40'       RLS                                   @P1A   02833500
S42DSNSR EQU   X'00'       NSR                                   @P1A   02834000
S42DSEXC EQU   X'10'     Open for EXCP processing                @P1A   02834500
S42DSFXD EQU   X'08'     Non-VSAM fixed length records           @P1A   02835000
S42DSPL  EQU   X'04'     Program library                         @P1A   02835500
S42DSEF  EQU   X'02'     Extended format                         @P1A   02836000
S42DSEFC EQU   X'01'     Compressed format                       @P1A   02836500
         DS    X         Reserved                                @P1C   02837000
S42DSIOO DS    1FL4      Offset to I/O section                          02838600
S42DSAMO DS    1FL4      Offset to AM  section               @OW00159   02839200
S42DSVOL DS    1CL0006   VOLSER                              @OW00159   02839800
S42DSDEV DS    1CL0002   Device number                       @OW00159   02840400
S42DSSC  DS    1CL0008   Storage class name                  @OW00159   02841000
S42DSBSZ DS    1FL4      block size                          @OW00159   02841600
S42DSTRP DS    H         Number of stripes                       @P1A   02841800
         DS    CL6       Reserved                                @P1A   02842000
S42DSH_LEN EQU *-S42DSH                                                 02842400
*                                                                       02846200
*   -----------------------------------------------------------------   02850000
*    Data set I/O statistics (SMF42 subtype 6)                          02853800
*                                                                       02857600
*    I/O response/service time components are recorded                  02861400
*    in multiples of 128 micro-seconds.                                 02865200
*    The length of these statistics must be identical                   02869000
*    with the length of DSSBSTAT in the DSSB.                           02872800
*   -----------------------------------------------------------------   02876600
*                                                                       02880400
*                                                                       02884200
S42DSIO  DSECT ,                                                        02888000
S42DSIOR DS    1FL4      Response time                                  02891800
S42DSIOC DS    1FL4      Avg I/O connect time                           02895600
S42DSIOP DS    1FL4      Avg I/O pending time                           02899400
S42DSIOD DS    1FL4      Avg I/O disconnect time                        02903200
S42DSIOQ DS    1FL4      Avg cntl unit queue time                       02907000
S42DSION DS    1FL4      Total number of I/Os                           02910800
*                                                                       02914600
*      ***************************************************************  02918400
*      *                                                             *  02922200
*      * 3990 Control unit cache statistics                             02926000
*      *                                                             *  02929800
*      ***************************************************************  02933600
*                                                                       02937400
*                                                                       02941200
S42DSCND DS    1FL4      No. of cache candidates                        02945000
S42DSHTS DS    1FL4      No. of cache hits                              02948800
S42DSWCN DS    1FL4      No. of write candidates                        02952600
S42DSWHI DS    1FL4      No. of write hits                              02956400
S42DSSEQ DS    1FL4      No. of sequential I/Os            @OW00573     02957100
S42DSRLC DS    1FL4      No. of RLC I/O's                  @OW00573     02957800
S42DSICL DS    1FL4      No. of ILC I/O's                  @OW00573     02958500
S42DSDAO DS    1FL4      Average I/O device-active-only time   @19C     02958900
*                                                                       02959300
*  Following two fields are not part of DSSSBSTAT                       02959400
*                                                                       02959500
S42DSMAX DS    0D                                                 @12A  02959600
S42DSMXR DS    1FL4      maximum dataset I/O response time        @12A  02959700
S42DSMXS DS    1FL4      maximum dataset service time             @12A  02959800
S42DSIO_LEN EQU *-S42DSIO                                               02960200
*                                                                       02960300
*      *                                                             *  02960500
*      *                                                             *  02960700
*                                                                       02960900
S42DSAM  DSECT ,                                              @OW00159  02961100
S42AMSRB DS    1FL4                Sequential read no. of blocks  @RTA  02961300
S42AMSRR DS    1FL4                Sequential read I/O delay      @RTA  02961500
S42AMSWB DS    1FL4                Sequential write no. of blocks @RTA  02961700
S42AMSWR DS    1FL4                Sequential write I/O delay     @RTA  02961900
S42AMDRB DS    1FL4                Direct read no. of blocks      @RTA  02962100
S42AMDRR DS    1FL4                Direct read I/O total delay    @RTA  02962300
S42AMDWB DS    1FL4                Direct write no. of blocks     @RTA  02962500
S42AMDWR DS    1FL4                Direct write total I/O delay   @RTA  02962700
S42AMZRB DS    1FL4                No. of directory reads         @RTA  02962900
S42AMZRR DS    1FL4                Directory read I/O delay       @RTA  02963100
S42AMZWB DS    1FL4                No. of directory writes        @RTA  02963300
S42AMZWR DS    1FL4                Directory write I/O delay      @RTA  02963500
S42DSAM_LEN EQU *-S42DSAM                                         @RTA  02963700
.SKIP_B6 ANOP                                                           02964000
*                                                                       02964100
*                                                                       02964200
         AIF   ('&SMF42_09' EQ 'NO').SKIP_B9                      @17C  02964300
*                                                                       02964400
*                                                                       02964500
*   -------------------------------------------------------------- @P1A 02964600
*     SMF type 42 subtype 9 (X37 ABEND record, part 1)             @P1A 02964700
*   -------------------------------------------------------------- @P1A 02964800
*                                                                       02964900
*                                                                       02965000
SMF4209A DSECT ,                                                   @P1A 02965100
SMF09X37 DS    0CL0102             Descripton of X37 ABEND section @P1A 02965200
S42ASYID DS    1CL0004             System ID                       @P1A 02965300
S42JOBN  DS    1CL0008             Job name                        @P1A 02965400
S42RDST  DS    1BL0004             Reader start time               @P1A 02965500
S42RDSD  DS    1PL0004             Reader start date(packed)       @P1A 02965600
S42AAUID DS    1CL0008             User identification             @P1A 02965700
S42ASTPN DS    1BL0001             Step number                     @P1A 02965800
S42FLAGS DS    1BL0001             Flags                           @P1A 02965900
S42B37   EQU   X'80'               1... .... B37 Abend             @P1A 02966000
S42D37   EQU   X'40'               .1.. .... D37 Abend             @P1A 02966100
S42E37   EQU   X'20'               ..1. .... E37 Abend             @P1A 02966200
         DS    1CL0004             Reserved                        @P1A 02966300
S42DSORG DS    1BL0002             Data set organization           @P1A 02966400
S42ADISP DS    1BL0001             Disp                            @P1A 02966500
S42DSNME DS    1CL0044             Data set name                   @15C 02966600
S42VOLSR DS    1CL0006             Volser of current volume        @P1A 02966700
S42UCBTP DS    1BL0004             UCB type field of current vol   @P1A 02966800
S42NEXT  DS    1FL1                Number of extents for data set  @P1A 02966900
*                                    on current volume             @P1A 02967000
S42TNTRK DS    1FL4                Total tracks allocated for      @P1A 02967100
*                                    data set on current volume    @P1A 02967200
S42ASSAT DS    1BL0004             Secondary allocation amount     @P1A 02967300
S42ADRLH DS    1BL0003             Average data block length if    @P1A 02967400
*                                    specified                     @P1A 02967500
         DS    1CL0005             Reserved                        @P1A 02967600
SMF4209A_LEN EQU *-SMF4209A        Length of subtype 9 part 1      @P1A 02967700
*                                                                  @P1A 02967800
*  --------------------------------------------------------------  @P1A 02967900
*    SMF type 42 subtype 9 (X37 ABEND record, part 2 SMS info)     @P1A 02968000
*  --------------------------------------------------------------  @P1A 02968100
*                                                                  @P1A 02968200
SMF4209B DSECT ,                                                   @P1A 02968300
S4209SMS DS    0CL0120             Discription of SMS section      @P1A 02968400
*                                                                1 @P2D 02968500
S42MCNME DS    1CL0030             Management class name           @P1A 02968600
S42SCNME DS    1CL0030             Storage class name              @P1A 02968700
S42DCNME DS    1CL0030             Data class name                 @P1A 02968800
SMF4209B_LEN EQU *-SMF4209B                                        @13C 02968900
.SKIP_B9 ANOP                                                      @P1A 02969000
*                                                                  @P1A 02969100
*                                                                  @P1A 02969200
         AIF  ('&SMF42_0B' EQ 'NO').SKIP_BB                       @07A  02969300
*                                                                       02969400
*                                                                       02969500
*   -----------------------------------------------------------------   02969600
*     Start of Extended Remote Copy (XRC) Session Statistics       @07A 02969700
*   -----------------------------------------------------------------   02969800
*                                                                       02969900
*                                                                       02970000
*   -----------------------------------------------------------------   02970100
*    SMF type 42 subtype 11 (Extended Remote Copy (XRC)            @07A 02970200
*                            Session Statistics)                   @07A 02970300
*   -----------------------------------------------------------------   02970400
*                                                                       02970500
*                                                                       02970600
SMF420BA DSECT  ,        XRC Session Statistics                    @07A 02970700
S42XRID  DS    1CL0008   Logical Session ID                        @07A 02970800
S42XRTYP DS    1CL0008   Session type                              @07A 02970900
S42XRSSO DS    1FL4      Offset to first SSID data section         @07A 02971000
S42XRSSN DS    1FL2      Number of SSID's for the session          @07A 02971100
S42XRSSL DS    1FL2      Length of  SSID data section              @07A 02971200
S42XRVLO DS    1FL4      Offset to first volume data SECTION       @14A 02971300
S42XRVLN DS    1FL2      Number of volume data SECTIONS            @14A 02971400
S42XRVLL DS    1FL2      Length of volume data                     @14C 02971500
SMF420BA_LEN EQU *-SMF420BA                                        @07A 02971600
*                                                                       02971700
*   -----------------------------------------------------------------   02971800
*   XRC SSID Data Section (SMF42 subtype 11)                       @07A 02971900
*   -----------------------------------------------------------------   02972000
*                                                                       02972100
*                                                                       02972200
S42XRSSD DSECT ,                                                   @07A 02972300
S42XRSNX DS    1FL4      Offset to next SSID data section          @07A 02972400
*                        (0 if last SSID)                          @07A 02972500
S42XRSID DS    1FL2      SSID                                      @07A 02972600
S42XRIDP DS    1FL1      Controller session ID                     @07A 02972700
         DS    1CL0001   Reserved                                  @07A 02972800
S42XRVSH DS    1FL4      Number of volumes being shadowed               02972900
*                        for this SSID. Includes utility devices   @14C 02973000
S42XRTPR DS    1FL4      Total number of primary data mover        @07A 02973100
*                        reads                                     @07A 02973200
S42XRNWD DS    1FL4      Number of primary data mover reads        @07A 02973300
*                        with data                                 @07A 02973400
S42XRNND DS    1FL4      Number of primary data mover reads        @07A 02973500
*                        with no data                              @07A 02973600
S42XRNLR DS    1FL4      Number of primary data mover reads        @07A 02973700
*                        left to be read                           @07A 02973800
S42XRNFW DS    1FL4      Number of format writes                   @07A 02973900
S42XRNUW DS    1FL4      Number of update writes                   @07A 02974000
S42XRARS DS    1FL4      Average record size                       @07A 02974100
         DS    1CL004    Reserved                                  @07A 02974200
S42XRSSD_LEN EQU *-S42XRSSD                                        @07A 02974300
*                                                                  @14A 02974400
*   ----------------------------------------------------------------    02974500
*   XRC Volume Data Section (SMF42 subtype 11)                          02974600
*   Information on XRC primary and secondary volumes.              @14A 02974700
*   -----------------------------------------------------------------   02974800
*                                                                  @14A 02974900
*                                                                  @14A 02975000
S42XRVLD DSECT ,                                                   @14A 02975100
S42XRVLX DS    1FL4      Offset to next volume data section,            02975200
*                        (0 if last volume)                        @14A 02975300
S42XRVLV DS    1CL0006   Volser                                    @14A 02975400
S42XRVAV DS    1CL0006   Other volser in pair                      @14A 02975500
S42XRVPS DS    1CL0001   'P' if primary volume                          02975600
*                        'S' if secondary volume                   @14A 02975700
*                        'U' if utility volume                     @14A 02975800
         DS    1CL0001   Reserved                                  @22A 02975900
S42XRVSS DS    1FL2      SSID associated with volume               @14A 02976000
S42XRVPR DS    1FL4      Total number data mover reads if               02976100
*                        primary. Total number data mover               02976200
*                        writes if secondary.                      @14A 02976300
S42XRVWD DS    1FL4      Number of data mover reads with                02976400
*                        data if primary.  Always 0 for                 02976500
*                        secondary.                                @14A 02976600
S42XRVND DS    1FL4      Number of primary data mover                   02976700
*                        reads with no data.  Always 0 for              02976800
*                        secondary.                                @14A 02976900
S42XRVFW DS    1FL4      Number of format writes                   @14A 02977000
S42XRVUW DS    1FL4      Number of update writes                   @14A 02977100
S42XRVRS DS    1FL4      Average record size                       @14A 02977200
S42XRVRW DS    1FL4      Number of read tracks if primary.              02977300
*                        Number of write tracks if SECONDARY       @14A 02977400
*        DS    1CL0004   Reserved                                  @14A 02977500
S42XRVLD_LEN EQU *-S42XRVLD                                        @14A 02977600
.SKIP_BB ANOP                                                      @07A 02977700
*                                                                       02977800
         AIF ('&SMF42_0F' EQ 'NO').SKIP_BF                              02977900
*                                                                       02978000
*   -----------------------------------------------------------------   02978100
*    STORAGE CLASS MSR SUMMARY (SMF42 SUBTYPE 15)                       02978200
*   -----------------------------------------------------------------   02978300
SMF420FA DSECT ,                                                 @10A   02978400
SMF42FA1 DS   0CL1280                SYSPLEX WIDE SUMMARY        @10A   02978500
SMF42FAA DS   1FL4                   INTERVAL LENGTH. THIS IS THE       02978600
*                                    TOTAL TIME OF THE MEASUREMENT      02978700
*                                    PERIOD. (IN SECONDS)        @10A   02978800
SMF42F00 DS   CL12                   RESERVED                    @10A   02978900
*                                                                       02979000
SMF42FAB DS   1FL2                   LENGTH OF THE STORAGE CLASS        02979100
*                                    NAME                        @10A   02979200
SMF42FAC DS   CL30                   STORAGE CLASS NAME          @10A   02979300
*                                                                       02979400
SMF42F01 DS   1FL2                   CACHESETNAME LENGTH         @10A   02979500
SMF42FAD DS   CL30                   CACHESET NAME               @10A   02979600
*                                                                       02979700
SMF42FAE DS   1FL4                   NUMBER OF LOCK REQUESTS            02979800
*                                    PROCESSED                   @10A   02979900
SMF42FAF DS   1FL4                   NUMBER OF TRUE CONTENTION          02980000
*                                    LOCK REQUESTS               @10A   02980100
SMF42FAG DS   1FL4                   NUMBER OF FALSE CONTENTION         02980200
*                                    LOCK REQUESTS               @10A   02980300
SMF42F02 DS   1FL2                   SMSDIRECTWEIGHT             @10A   02980400
SMF42F12 DS   1FL2                   SMSSEQUENTIALWEIGHT         @10A   02980500
SMF42FAH DS   CL16                   RESERVED                    @10A   02980600
*                                                                @10A   02980700
SMF42FA2 DS   0CL336                 DIRECT ACCESS SECTION       @10A   02980800
*                                                                       02980900
SMF42FA3 DS   0CL168                 NORMAL DIRECT ACCESS SUMMARY       02981000
*                                    SECTION                     @10A   02981100
SMF42FCA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    02981200
*                                    NUMBER                      @10A   02981300
SMF42FCB DS   1FL4                   TOTAL NUMBER OF REQUESTS           02981400
*                                                                @10A   02981500
SMF42FCC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    02981600
*                                    NRI - NO READ INTEGERITY           02981700
*                                                                @10A   02981800
SMF42FCD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    02981900
*                                    CONSISTENT READS   @10A            02982000
*                                                                       02982100
SMF42FCE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     02982200
*                                                                @10A   02982300
SMF42FCF DS   1FL4                   NUMBER OF BMF REQUESTS             02982400
*                                                                @10A   02982500
SMF42FCG DS   1FL4                   NUMBER OF BMF READ REQUESTS        02982600
*                                                                @10A   02982700
SMF42FCH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       02982800
*                                                                @10A   02982900
*                                                                       02983000
SMF42FCI DS   1FL4                   NUMBER OF BMF READ HITS            02983100
*                                                                @10A   02983200
SMF42FCJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      02983300
*                                                                @10A   02983400
SMF42FCK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       02983500
*                                                                @10A   02983600
SMF42FCL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    02983700
*                                    THE SYSPLEX CACHE MANAGER   @10A   02983800
*                                                                       02983900
SMF42FCM DS   1FL4                   NUMBER OF CF READ REQUESTS         02984000
*                                                                @10A   02984100
SMF42FCN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   02984200
SMF42FCO DS   1FL4                   NUMBER OF CF READ HITS      @10A   02984300
SMF42FCP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   02984400
SMF42FCQ DS   2F                     NUMBER OF BYTES XFERED INTO THE    02984500
*                                    DFSMS CACHE STRUCTURE       @10A   02984600
SMF42FCR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  02984700
*                                    TO DASD.                    @10A   02984800
SMF42FCS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  02984900
*                                    TO DASD.                    @10A   02985000
SMF42FCT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     02985100
*                                    DASD FOR THE READ   REQUESTS @10A  02985200
*                                                                @10A   02985300
SMF42FCU DS   2F                     NUMBER OF                          02985400
*                                    DASD FOR THE WRITE REQUESTS @10A   02985500
*                                                                @10A   02985600
SMF42FCV DS   CL16                   RESERVED                           02985700
*                                                                @10A   02985800
SMF42FCW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   02985900
*                                    REQUESTS IN THIS                   02986000
*                                    INTERVAL. (THE VALUE IS EXPRESSED  02986100
*                                    IN MILLI- SECONDS)          @21A   02986200
*                                                                       02986300
SMF42FCX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   02986400
*                                    THE REQUESTS IN THIS INTERVAL.     02986500
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    02986600
*                                                                @10A   02986700
SMF42FCY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   02986800
*                                    OF THE REQUESTS IN THIS INTERVAL   02986900
*                                    (TOTAL TIME/NUMBER OF BYTES        02987000
*                                    TRANSFERED/4K)              @10A   02987100
SMF42FCZ DS   CL8                    RESERVED                    @10A   02987200
SMF42FC7 DS   CL32                   RESERVED                    @10A   02987300
SMF42FA3_LEN  EQU *-SMF42FA3                                            02987400
*                                                                       02987500
SMF42FA4 DS   0CL168                 RE-DO DURING DIRECT ACCESS         02987600
*                                    SECTION                     @10A   02987700
SMF42FDA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    02987800
*                                    NUMBER                      @10A   02987900
SMF42FDB DS   1FL4                   TOTAL NUMBER OF REQUESTS           02988000
*                                                                @10A   02988100
SMF42FDC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    02988200
*                                    NRI - NO READ INTEGERITY           02988300
*                                                                @10A   02988400
SMF42FDD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    02988500
*                                    CONSISTENT READS   @10A            02988600
*                                                                       02988700
SMF42FDE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     02988800
*                                                                @10A   02988900
SMF42FDF DS   1FL4                   NUMBER OF BMF REQUESTS             02989000
*                                                                @10A   02989100
SMF42FDG DS   1FL4                   NUMBER OF BMF READ REQUESTS        02989200
*                                                                @10A   02989300
SMF42FDH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       02989400
*                                                                @10A   02989500
*                                                                       02989600
SMF42FDI DS   1FL4                   NUMBER OF BMF READ HITS            02989700
*                                                                @10A   02989800
SMF42FDJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      02989900
*                                                                @10A   02990000
SMF42FDK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       02990100
*                                                                @10A   02990200
SMF42FDL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    02990300
*                                    THE SYSPLEX CACHE MANAGER   @10A   02990400
*                                                                       02990500
SMF42FDM DS   1FL4                   NUMBER OF CF READ REQUESTS         02990600
*                                                                @10A   02990700
SMF42FDN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   02990800
SMF42FDO DS   1FL4                   NUMBER OF CF READ HITS      @10A   02990900
SMF42FDP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   02991000
SMF42FDQ DS   2F                     NUMBER OF BYTES XFERED INTO THE    02991100
*                                    DFSMS CACHE STRUCTURE       @10A   02991200
*                                                                @10A   02991300
SMF42FDR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  02991400
*                                    TO DASD.                    @10A   02991500
SMF42FDS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  02991600
*                                    TO DASD.                    @10A   02991700
SMF42FDT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     02991800
*                                    DASD FOR THE READ  REQUESTS @10A   02991900
*                                                                @10A   02992000
SMF42FDU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     02992100
*                                    DASD FOR THE WRITE REQUESTS @10A   02992200
*                                                                @10A   02992300
SMF42FDV DS   CL16                   RESERVED                           02992400
*                                                                @10A   02992500
SMF42FDW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   02992600
*                                    REQUESTS IN THIS                   02992700
*                                    INTERVAL. (THE VALUE IS EXPRESSED  02992800
*                                    IN MILLI- SECONDS)          @21A   02992900
*                                                                       02993000
SMF42FDX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   02993100
*                                    THE REQUESTS IN THIS INTERVAL.     02993200
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    02993300
*                                                                @10A   02993400
SMF42FDY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   02993500
*                                    OF THE REQUESTS IN THIS INTERVAL   02993600
*                                    (TOTAL TIME/NUMBER OF BYTES        02993700
*                                    TRANSFERED/4K)              @10A   02993800
SMF42FDZ DS   CL8                    RESERVED                    @10A   02993900
SMF42FD7 DS   CL32                   RESERVED                    @10A   02994000
SMF42FA4_LEN  EQU *-SMF42FA4                                            02994100
*                                                                       02994200
SMF42FA5 DS   0CL672                 SEQUENTIAL ACCESS SUMMARY SECTION  02994300
*                                                                @10A   02994400
SMF42FA6 DS   0CL168                 NORMAL SEQUENTIAL ACCESS SECTION   02994500
*                                                                @10A   02994600
SMF42FEA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    02994700
*                                    NUMBER                      @10A   02994800
SMF42FEB DS   1FL4                   TOTAL NUMBER OF REQUESTS           02994900
*                                                                @10A   02995000
SMF42FEC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    02995100
*                                    NRI - NO READ INTEGERITY           02995200
*                                                                @10A   02995300
SMF42FED DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    02995400
*                                    CONSISTENT READS   @10A            02995500
*                                                                       02995600
SMF42FEE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     02995700
*                                                                @10A   02995800
SMF42FEF DS   1FL4                   NUMBER OF BMF REQUESTS             02995900
*                                                                @10A   02996000
SMF42FEG DS   1FL4                   NUMBER OF BMF READ REQUESTS        02996100
*                                                                @10A   02996200
SMF42FEH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       02996300
*                                                                @10A   02996400
*                                                                       02996500
SMF42FEI DS   1FL4                   NUMBER OF BMF READ HITS            02996600
*                                                                @10A   02996700
SMF42FEJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      02996800
*                                                                @10A   02996900
SMF42FEK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       02997000
*                                                                @10A   02997100
SMF42FEL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    02997200
*                                    THE SYSPLEX CACHE MANAGER   @10A   02997300
*                                                                       02997400
SMF42FEM DS   1FL4                   NUMBER OF CF READ REQUESTS         02997500
*                                                                @10A   02997600
SMF42FEN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   02997700
SMF42FEO DS   1FL4                   NUMBER OF CF READ HITS      @10A   02997800
SMF42FEP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   02997900
SMF42FEQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   02998000
*                                    DFSMS CACHE STRUCTURE       @10A   02998100
*                                                                @10A   02998200
SMF42FER DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  02998300
*                                    TO DASD.                    @10A   02998400
SMF42FES DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  02998500
*                                    TO DASD.                    @10A   02998600
SMF42FET DS   2F                     NUMBER OF BYTES TRANSFERRED TO     02998700
*                                    DASD FOR THE READ   REQUESTS @10A  02998800
*                                                                @10A   02998900
SMF42FEU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     02999000
*                                    DASD FOR THE WRITE REQUESTS @10A   02999100
*                                                                @10A   02999200
SMF42FEV DS   CL16                   RESERVED                           02999300
*                                                                @10A   02999400
SMF42FEW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   02999500
*                                    REQUESTS IN THIS                   02999600
*                                    INTERVAL. (THE VALUE IS EXPRESSED  02999700
*                                    IN MILLI- SECONDS)          @21A   02999800
*                                                                       02999900
SMF42FEX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03000000
*                                    THE REQUESTS IN THIS INTERVAL.     03000100
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03000200
*                                                                @10A   03000300
SMF42FEY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03000400
*                                    OF THE REQUESTS IN THIS INTERVAL   03000500
*                                    (TOTAL TIME/NUMBER OF BYTES        03000600
*                                    TRANSFERED/4K)              @10A   03000700
SMF42FEZ DS   CL8                    RESERVED                    @10A   03000800
SMF42FE7 DS   CL32                   RESERVED                    @10A   03000900
SMF42FA6_LEN  EQU *-SMF42FA6                                            03001000
*                                                                       03001100
SMF42FA7 DS   0CL168                 RE-DO DURING SEQUENTIAL ACCESS     03001200
*                                    SECTION                     @10A   03001300
SMF42FFA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03001400
*                                    NUMBER                      @10A   03001500
SMF42FFB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03001600
*                                                                @10A   03001700
SMF42FFC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03001800
*                                    NRI - NO READ INTEGERITY           03001900
*                                                                @10A   03002000
SMF42FFD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03002100
*                                    CONSISTENT READS   @10A            03002200
*                                                                       03002300
SMF42FFE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03002400
*                                                                @10A   03002500
SMF42FFF DS   1FL4                   NUMBER OF BMF REQUESTS             03002600
*                                                                @10A   03002700
SMF42FFG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03002800
*                                                                @10A   03002900
SMF42FFH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03003000
*                                                                @10A   03003100
*                                                                       03003200
SMF42FFI DS   1FL4                   NUMBER OF BMF READ HITS            03003300
*                                                                @10A   03003400
SMF42FFJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03003500
*                                                                @10A   03003600
SMF42FFK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03003700
*                                                                @10A   03003800
SMF42FFL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03003900
*                                    THE SYSPLEX CACHE MANAGER   @10A   03004000
*                                                                       03004100
SMF42FFM DS   1FL4                   NUMBER OF CF READ REQUESTS         03004200
*                                                                @10A   03004300
SMF42FFN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03004400
SMF42FFO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03004500
SMF42FFP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03004600
SMF42FFQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03004700
*                                    DFSMS CACHE STRUCTURE       @10A   03004800
*                                                                @10A   03004900
SMF42FFR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03005000
*                                    TO DASD.                    @10A   03005100
SMF42FFS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03005200
*                                    TO DASD.                    @10A   03005300
SMF42FFT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03005400
*                                    DASD FOR THE READ  REQUESTS @10A   03005500
*                                                                @10A   03005600
SMF42FFU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03005700
*                                    DASD FOR THE WRITE REQUESTS @10A   03005800
*                                                                @10A   03005900
SMF42FFV DS   CL16                   RESERVED                           03006000
*                                                                @10A   03006100
SMF42FFW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03006200
*                                    REQUESTS IN THIS                   03006300
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03006400
*                                    IN MILLI- SECONDS)          @21A   03006500
*                                                                       03006600
SMF42FFX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03006700
*                                    THE REQUESTS IN THIS INTERVAL.     03006800
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03006900
*                                                                @10A   03007000
SMF42FFY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03007100
*                                    OF THE REQUESTS IN THIS INTERVAL   03007200
*                                    (TOTAL TIME/NUMBER OF BYTES        03007300
*                                    TRANSFERED/4K)              @10A   03007400
SMF42FFZ DS   CL8                    RESERVED                    @10A   03007500
SMF42FF7 DS   CL32                   RESERVED                    @10A   03007600
SMF42FA7_LEN  EQU *-SMF42FA7                                            03007700
*                                                                       03007800
SMF42FA8 DS   0CL168                 READ-A-HEAD SEQUENTIAL ACCESS      03007900
*                                    SECTION                     @10A   03008000
SMF42FGA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03008100
*                                    NUMBER                      @10A   03008200
SMF42FGB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03008300
*                                                                @10A   03008400
SMF42FGC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03008500
*                                    NRI - NO READ INTEGERITY           03008600
*                                                                @10A   03008700
SMF42FGD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03008800
*                                    CONSISTENT READS   @10A            03008900
*                                                                       03009000
SMF42FGE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03009100
*                                                                @10A   03009200
SMF42FGF DS   1FL4                   NUMBER OF BMF REQUESTS             03009300
*                                                                @10A   03009400
SMF42FGG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03009500
*                                                                @10A   03009600
SMF42FGH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03009700
*                                                                @10A   03009800
*                                                                       03009900
SMF42FGI DS   1FL4                   NUMBER OF BMF READ HITS            03010000
*                                                                @10A   03010100
SMF42FGJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03010200
*                                                                @10A   03010300
SMF42FGK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03010400
*                                                                @10A   03010500
SMF42FGL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03010600
*                                    THE SYSPLEX CACHE MANAGER   @10A   03010700
*                                                                       03010800
SMF42FGM DS   1FL4                   NUMBER OF CF READ REQUESTS         03010900
*                                                                @10A   03011000
SMF42FGN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03011100
SMF42FGO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03011200
SMF42FGP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03011300
SMF42FGQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03011400
*                                    DFSMS CACHE STRUCTURE       @10A   03011500
*                                                                @10A   03011600
SMF42FGR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03011700
*                                    TO DASD.                    @10A   03011800
SMF42FGS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03011900
*                                    TO DASD.                    @10A   03012000
SMF42FGT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03012100
*                                    DASD FOR THE READ  REQUESTS @10A   03012200
*                                                                @10A   03012300
SMF42FGU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03012400
*                                    DASD FOR THE WRITE REQUESTS @10A   03012500
*                                                                @10A   03012600
SMF42FGV DS   CL16                   RESERVED                           03012700
*                                                                @10A   03012800
SMF42FGW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03012900
*                                    REQUESTS IN THIS                   03013000
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03013100
*                                    IN MILLI- SECONDS)          @21A   03013200
*                                                                       03013300
SMF42FGX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03013400
*                                    THE REQUESTS IN THIS INTERVAL.     03013500
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03013600
*                                                                @10A   03013700
SMF42FGY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03013800
*                                    OF THE REQUESTS IN THIS INTERVAL   03013900
*                                    (TOTAL TIME/NUMBER OF BYTES        03014000
*                                    TRANSFERED/4K)              @10A   03014100
SMF42FGZ DS   CL8                    RESERVED                    @10A   03014200
SMF42FG7 DS   CL32                   RESERVED                    @10A   03014300
SMF42FA8_LEN  EQU *-SMF42FA8                                            03014400
*                                                                       03014500
SMF42FA9 DS   0CL168                 PRE-FORMAT SEQUENTIAL ACCESS       03014600
*                                    SECTION                     @10A   03014700
SMF42FHA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03014800
*                                    NUMBER                      @10A   03014900
SMF42FHB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03015000
*                                                                @10A   03015100
SMF42FHC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03015200
*                                    NRI - NO READ INTEGERITY           03015300
*                                                                @10A   03015400
SMF42FHD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03015500
*                                    CONSISTENT READS   @10A            03015600
*                                                                       03015700
SMF42FHE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03015800
*                                                                @10A   03015900
SMF42FHF DS   1FL4                   NUMBER OF BMF REQUESTS             03016000
*                                                                @10A   03016100
SMF42FHG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03016200
*                                                                @10A   03016300
SMF42FHH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03016400
*                                                                @10A   03016500
*                                                                       03016600
SMF42FHI DS   1FL4                   NUMBER OF BMF READ HITS            03016700
*                                                                @10A   03016800
SMF42FHJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03016900
*                                                                @10A   03017000
SMF42FHK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03017100
*                                                                @10A   03017200
SMF42FHL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03017300
*                                    THE SYSPLEX CACHE MANAGER   @10A   03017400
*                                                                       03017500
SMF42FHM DS   1FL4                   NUMBER OF CF READ REQUESTS         03017600
*                                                                @10A   03017700
SMF42FHN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03017800
SMF42FHO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03017900
SMF42FHP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03018000
SMF42FHQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03018100
*                                    DFSMS CACHE STRUCTURE       @10A   03018200
*                                                                @10A   03018300
SMF42FHR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03018400
*                                    TO DASD.                    @10A   03018500
SMF42FHS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03018600
*                                    TO DASD.                    @10A   03018700
SMF42FHT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03018800
*                                    DASD FOR THE READ  REQUESTS @10A   03018900
*                                                                @10A   03019000
SMF42FHU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03019100
*                                    DASD FOR THE WRITE REQUESTS @10A   03019200
*                                                                @10A   03019300
SMF42FHV DS   CL16                   RESERVED                           03019400
*                                                                @10A   03019500
SMF42FHW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03019600
*                                    REQUESTS IN THIS                   03019700
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03019800
*                                    IN MILLI- SECONDS)          @21A   03019900
*                                                                       03020000
SMF42FHX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03020100
*                                    THE REQUESTS IN THIS INTERVAL.     03020200
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03020300
*                                                                @10A   03020400
SMF42FHY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03020500
*                                    OF THE REQUESTS IN THIS INTERVAL   03020600
*                                    (TOTAL TIME/NUMBER OF BYTES        03020700
*                                    TRANSFERED/4K)              @10A   03020800
SMF42FHZ DS   CL8                    RESERVED                    @10A   03020900
SMF42FH7 DS   CL32                   RESERVED                    @10A   03021000
SMF42FA9_LEN  EQU *-SMF42FA9                                            03021100
SMF42FA5_LEN  EQU *-SMF42FA5                                            03021200
*                                                                       03021300
SMF42FX1 DS   0CL128                 LOCKING STATISTCS SUMMARY   @10A   03021400
SMF42FOA DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03021500
*                                    REQUESTS                    @10A   03021600
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03021700
SMF42FOB DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03021800
*                                    REQUESTS THAT CAUSE TRUE    @10A   03021900
*                                    CONTENTION                  @10A   03022000
SMF42FOC DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03022100
*                                    REQUESTS THAT CAUSE FALSE   @10A   03022200
*                                    CONTENTION                  @10A   03022300
SMF42FOD DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03022400
*                                    RELEASE REQUESTS            @10A   03022500
SMF42FOE DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03022600
*                                    LOCK REQUESTS               @10A   03022700
SMF42FOF DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03022800
*                                    RELEASE LOCK REQUESTS       @10A   03022900
SMF42FOG DS   CL8                    RESERVED                    @10A   03023000
SMF42FOH DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03023100
*                                    CLASS_1 (DIWA) LOCKS        @10A   03023200
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03023300
SMF42FOI DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03023400
*                                    CLASS_1 (DIWA) LOCKS        @10A   03023500
*                                    THAT CAUSE TRUE CONTENTION  @10A   03023600
SMF42FOJ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03023700
*                                    CLASS_1 (DIWA) LOCKS        @10A   03023800
*                                    THAT CAUSE FALSE CONTENTION @10A   03023900
SMF42FOK DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03024000
*                                    CLASS_1 (DIWA) RELEASE      @10A   03024100
*                                    LOCK REQUESTS               @10A   03024200
SMF42FOL DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03024300
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03024400
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03024500
SMF42FOM DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03024600
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03024700
*                                    THAT CAUSE TRUE CONTENTION  @10A   03024800
SMF42FON DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03024900
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03025000
*                                    THAT CAUSE FALSE CONTENTION @10A   03025100
SMF42FOO DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03025200
*                                    CLASS_2 (UPGRADE) RELEASE   @10A   03025300
*                                    LOCK REQUESTS               @10A   03025400
SMF42FOP DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03025500
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03025600
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03025700
SMF42FOQ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03025800
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03025900
*                                    THAT CAUSE TRUE CONTENTION  @10A   03026000
SMF42FOR DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03026100
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03026200
*                                    THAT CAUSE FALSE CONTENTION @10A   03026300
SMF42FOS DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03026400
*                                    CLASS_3 (PREFORMAT) RELEASE @10A   03026500
*                                    LOCK REQUESTS               @10A   03026600
SMF42FOT DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03026700
*                                    LOCK REQUESTS               @10A   03026800
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03026900
SMF42FOU DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03027000
*                                    THAT CAUSE TRUE CONTENTION  @10A   03027100
SMF42FOV DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03027200
*                                    THAT CAUSE FALSE CONTENTION @10A   03027300
SMF42FOW DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03027400
*                                    RELEASE LOCK REQUESTS       @10A   03027500
SMF42FOX DS   CL32                   RESERVED                    @10A   03027600
*                                                                @10A   03027700
*                                                                @10A   03027800
SMF42FX1_LEN  EQU *-SMF42FX1                                     @10A   03027900
*                                                                @10A   03028000
SMF42FX2 DS   0CL32                  THREAD LEVEL STATISTICS     @10A   03028100
SMF42FPR DS   CL8                    TOTAL TIME ALL THREAD       @10A   03028200
*                                    REQUESTS                    @10A   03028300
SMF42FPS DS   1FL4                   TOTAL NUMBER OF ALL THREAD  @10A   03028400
*                                    REQUESTS                    @10A   03028500
SMF42FPT DS   1FL4                   RESERVED                    @10A   03028600
SMF42FPU DS   1FL4                   AVERAGE RESPONSE TIME FOR   @10A   03028700
*                                    ALL OF THE THREAD REQUESTS  @10A   03028800
*                                    IN THE INTERVAL             @10A   03028900
*                                    (TOTAL TIME/NUMBER OF       @10A   03029000
*                                     THREAD REQUESTS)           @10A   03029100
SMF42FPV DS   1FL4                   NORMALIZED RESPONSE TIME    @10A   03029200
*                                    FOR ALL OF THE THREAD       @10A   03029300
*                                    REQUESTS IN THE INTERVAL    @10A   03029400
*                                    (TOTAL TIME/NUMBER OF BYTES @10A   03029500
*                                     TRANSFERED/4K)             @10A   03029600
SMF42FPW DS   CL8                    RESERVED                    @10A   03029700
*                                                                @10A   03029800
SMF42FX2_LEN  EQU *-SMF42FX2                                     @10A   03029900
SMF420FA_LEN  EQU *-SMF420FA                                     @10A   03030000
*                                                                @10A   03030100
SMF420FB DSECT ,                                                        03030200
SMF42F1A DS   0CL1328                SC/SYS/CF CLASS SUMMARY            03030300
*                                    SECTION                     @10A   03030400
SMF42FBA DS   1FL4                   INTERVAL LENGTH. THIS IS THE       03030500
*                                    TOTAL TIME OF THE MEASUREMENT      03030600
*                                    PERIOD. (IN SECONDS)        @10A   03030700
SMF42F03 DS   CL12                   RESERVED                    @10A   03030800
*                                                                       03030900
SMF42FBB DS   1FL2                   LENGTH OF THE STORAGE CLASS        03031000
*                                    NAME                        @10A   03031100
SMF42FBC DS   CL30                   STORAGE CLASS NAME          @10A   03031200
*                                                                       03031300
SMF42F04 DS   1FL2                   CACHESETNAMELENGTH                 03031400
SMF42FBD DS   CL30                   CACHESETNAME                @10A   03031500
*                                                                       03031600
SMF42FBE DS   CL8                    MVS SYSTEM NAME             @10A   03031700
SMF42F05 DS   CL8                    RESERVED                    @10A   03031800
*                                                                       03031900
SMF42FBF DS   CL2                    RESERVED                    @10A   03032000
SMF42FBG DS   CL30                   DFP CACHE STRUCTURE  NAME   @10A   03032100
SMF42FBH DS   1FL4                   NUMBER OF LOCK REQUESTS            03032200
*                                    PROCESSED (not used)        @21A   03032300
SMF42FBI DS   1FL4                   NUMBER OF TRUE CONTENTION          03032400
*                                    LOCK REQUESTS (not used)    @21A   03032500
SMF42FBJ DS   1FL4                   NUMBER OF FALSE CONTENTION         03032600
*                                    LOCK REQUESTS (not used)    @21A   03032700
SMF42FB2 DS   1FL2                   SMSDIRECTWEIGHT             @10A   03032800
SMF42FB3 DS   1FL2                   SMSSEQUENTIALWEIGHT         @10A   03032900
SMF42FBL DS   CL16                   RESERVED                    @10A   03033000
*                                                                       03033100
SMF42F1B DS   0CL336                 DIRECT ACCESS SUMMARY SECTION      03033200
*                                                                @10A   03033300
SMF42F1C DS   0CL168                 NORMAL DIRECT ACCESS SUMMARY       03033400
*                                    SECTION                     @10A   03033500
SMF42FIA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03033600
*                                    NUMBER                      @10A   03033700
SMF42FIB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03033800
*                                                                @10A   03033900
SMF42FIC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03034000
*                                    NRI - NO READ INTEGERITY           03034100
*                                                                @10A   03034200
SMF42FID DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03034300
*                                    CONSISTENT READS   @10A            03034400
*                                                                       03034500
SMF42FIE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03034600
*                                                                @10A   03034700
SMF42FIF DS   1FL4                   NUMBER OF BMF REQUESTS             03034800
*                                                                @10A   03034900
SMF42FIG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03035000
*                                                                @10A   03035100
SMF42FIH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03035200
*                                                                @10A   03035300
*                                                                       03035400
SMF42FII DS   1FL4                   NUMBER OF BMF READ HITS            03035500
*                                                                @10A   03035600
SMF42FIJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03035700
*                                                                @10A   03035800
SMF42FIK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03035900
*                                                                @10A   03036000
SMF42FIL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03036100
*                                    THE SYSPLEX CACHE MANAGER   @10A   03036200
*                                                                       03036300
SMF42FIM DS   1FL4                   NUMBER OF CF READ REQUESTS         03036400
*                                                                @10A   03036500
SMF42FIN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03036600
SMF42FIO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03036700
SMF42FIP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03036800
SMF42FIQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03036900
*                                    DFSMS CACHE STRUCTURE       @10A   03037000
*                                                                @10A   03037100
SMF42FIR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03037200
*                                    TO DASD.                    @10A   03037300
SMF42FIS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03037400
*                                    TO DASD.                    @10A   03037500
SMF42FIT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03037600
*                                    DASD FOR THE READ  REQUESTS @10A   03037700
*                                                                @10A   03037800
SMF42FIU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03037900
*                                    DASD FOR THE WRITE REQUESTS @10A   03038000
*                                                                @10A   03038100
SMF42FIV DS   CL16                   RESERVED                           03038200
*                                                                @10A   03038300
SMF42FIW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03038400
*                                    REQUESTS IN THIS                   03038500
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03038600
*                                    IN MILLI- SECONDS)          @21A   03038700
*                                                                       03038800
SMF42FIX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03038900
*                                    THE REQUESTS IN THIS INTERVAL.     03039000
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03039100
*                                                                @10A   03039200
SMF42FIY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03039300
*                                    OF THE REQUESTS IN THIS INTERVAL   03039400
*                                    (TOTAL TIME/NUMBER OF BYTES        03039500
*                                    TRANSFERED/4K)              @10A   03039600
SMF42FIZ DS   CL8                    RESERVED                    @10A   03039700
SMF42FI7 DS   CL32                   RESERVED                    @10A   03039800
SMF42F1C_LEN  EQU *-SMF42F1C                                     @10A   03039900
*                                                                       03040000
SMF42F1D DS   0CL168                 RE-DO DURING DIRECT ACCESS         03040100
*                                    SECTION                     @10A   03040200
SMF42FJA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03040300
*                                    NUMBER                      @10A   03040400
SMF42FJB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03040500
*                                                                @10A   03040600
SMF42FJC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03040700
*                                    NRI - NO READ INTEGERITY           03040800
*                                                                @10A   03040900
SMF42FJD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03041000
*                                    CONSISTENT READS   @10A            03041100
*                                                                       03041200
SMF42FJE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03041300
*                                                                @10A   03041400
SMF42FJF DS   1FL4                   NUMBER OF BMF REQUESTS             03041500
*                                                                @10A   03041600
SMF42FJG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03041700
*                                                                @10A   03041800
SMF42FJH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03041900
*                                                                @10A   03042000
*                                                                       03042100
SMF42FJI DS   1FL4                   NUMBER OF BMF READ HITS            03042200
*                                                                @10A   03042300
SMF42FJJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03042400
*                                                                @10A   03042500
SMF42FJK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03042600
*                                                                @10A   03042700
SMF42FJL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03042800
*                                    THE SYSPLEX CACHE MANAGER   @10A   03042900
*                                                                       03043000
SMF42FJM DS   1FL4                   NUMBER OF CF READ REQUESTS         03043100
*                                                                @10A   03043200
SMF42FJN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03043300
SMF42FJO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03043400
SMF42FJP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03043500
SMF42FJQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03043600
*                                    DFSMS CACHE STRUCTURE       @10A   03043700
*                                                                @10A   03043800
SMF42FJR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03043900
*                                    TO DASD.                    @10A   03044000
SMF42FJS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03044100
*                                    TO DASD.                    @10A   03044200
SMF42FJT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03044300
*                                    DASD FOR THE READ  REQUESTS @10A   03044400
*                                                                @10A   03044500
SMF42FJU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03044600
*                                    DASD FOR THE WRITE REQUESTS @10A   03044700
*                                                                @10A   03044800
SMF42FJV DS   CL16                   RESERVED                           03044900
*                                                                @10A   03045000
SMF42FJW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03045100
*                                    REQUESTS IN THIS                   03045200
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03045300
*                                    IN MILLI- SECONDS)          @21A   03045400
*                                                                       03045500
SMF42FJX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03045600
*                                    THE REQUESTS IN THIS INTERVAL.     03045700
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03045800
*                                                                @10A   03045900
SMF42FJY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03046000
*                                    OF THE REQUESTS IN THIS INTERVAL   03046100
*                                    (TOTAL TIME/NUMBER OF BYTES        03046200
*                                    TRANSFERED/4K)              @10A   03046300
SMF42FJZ DS   CL8                    RESERVED                    @10A   03046400
SMF42FJ7 DS   CL32                   RESERVED                    @10A   03046500
SMF42F1D_LEN  EQU *-SMF42F1D                                     @10A   03046600
SMF42F1B_LEN  EQU *-SMF42F1B                                     @10A   03046700
*                                                                       03046800
SMF42F1E DS   0CL672                 SEQUENTIAL ACCESS SUMMARY SECTION  03046900
*                                                                @10A   03047000
SMF42F1F DS   0CL168                 NORMAL SEQUENTIAL ACCESS SECTION   03047100
*                                                                @10A   03047200
SMF42FKA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03047300
*                                    NUMBER                      @10A   03047400
SMF42FKB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03047500
*                                                                @10A   03047600
SMF42FKC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03047700
*                                    NRI - NO READ INTEGERITY           03047800
*                                                                @10A   03047900
SMF42FKD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03048000
*                                    CONSISTENT READS   @10A            03048100
*                                                                       03048200
SMF42FKE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03048300
*                                                                @10A   03048400
SMF42FKF DS   1FL4                   NUMBER OF BMF REQUESTS             03048500
*                                                                @10A   03048600
SMF42FKG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03048700
*                                                                @10A   03048800
SMF42FKH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03048900
*                                                                @10A   03049000
*                                                                       03049100
SMF42FKI DS   1FL4                   NUMBER OF BMF READ HITS            03049200
*                                                                @10A   03049300
SMF42FKJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03049400
*                                                                @10A   03049500
SMF42FKK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03049600
*                                                                @10A   03049700
SMF42FKL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03049800
*                                    THE SYSPLEX CACHE MANAGER   @10A   03049900
*                                                                       03050000
SMF42FKM DS   1FL4                   NUMBER OF CF READ REQUESTS         03050100
*                                                                @10A   03050200
SMF42FKN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03050300
SMF42FKO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03050400
SMF42FKP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03050500
SMF42FKQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03050600
*                                    DFSMS CACHE STRUCTURE       @10A   03050700
*                                                                @10A   03050800
SMF42FKR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03050900
*                                    TO DASD.                    @10A   03051000
SMF42FKS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03051100
*                                    TO DASD.                    @10A   03051200
SMF42FKT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03051300
*                                    DASD FOR THE READ  REQUESTS @10A   03051400
*                                                                @10A   03051500
SMF42FKU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03051600
*                                    DASD FOR THE WRITE REQUESTS @10A   03051700
*                                                                @10A   03051800
SMF42FKV DS   CL16                   RESERVED                           03051900
*                                                                @10A   03052000
SMF42FKW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03052100
*                                    REQUESTS IN THIS                   03052200
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03052300
*                                    IN MILLI- SECONDS)          @21A   03052400
*                                                                       03052500
SMF42FKX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03052600
*                                    THE REQUESTS IN THIS INTERVAL.     03052700
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03052800
*                                                                @10A   03052900
SMF42FKY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03053000
*                                    OF THE REQUESTS IN THIS INTERVAL   03053100
*                                    (TOTAL TIME/NUMBER OF BYTES        03053200
*                                    TRANSFERED/4K)              @10A   03053300
SMF42FKZ DS   CL8                    RESERVED                    @10A   03053400
SMF42FK7 DS   CL32                   RESERVED                    @10A   03053500
SMF42F1F_LEN  EQU *-SMF42F1F                                     @10A   03053600
*                                                                       03053700
SMF42F1G DS   0CL168                 RE-DO DURING SEQUENTIAL ACCESS     03053800
*                                    SECTION                     @10A   03053900
SMF42FLA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03054000
*                                    NUMBER                      @10A   03054100
SMF42FLB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03054200
*                                                                @10A   03054300
SMF42FLC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03054400
*                                    NRI - NO READ INTEGERITY           03054500
*                                                                @10A   03054600
SMF42FLD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03054700
*                                    CONSISTENT READS   @10A            03054800
*                                                                       03054900
SMF42FLE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03055000
*                                                                @10A   03055100
SMF42FLF DS   1FL4                   NUMBER OF BMF REQUESTS             03055200
*                                                                @10A   03055300
SMF42FL6 DS   1FL4                   NUMBER OF BMF READ REQUESTS        03055400
*                                                                @10A   03055500
SMF42FLH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03055600
*                                                                @10A   03055700
*                                                                       03055800
SMF42FLI DS   1FL4                   NUMBER OF BMF READ HITS            03055900
*                                                                @10A   03056000
SMF42FLJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03056100
*                                                                @10A   03056200
SMF42FLK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03056300
*                                                                @10A   03056400
SMF42FLL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03056500
*                                    THE SYSPLEX CACHE MANAGER   @10A   03056600
*                                                                       03056700
SMF42FLM DS   1FL4                   NUMBER OF CF READ REQUESTS         03056800
*                                                                @10A   03056900
SMF42FLN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03057000
SMF42FLO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03057100
SMF42FLP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03057200
SMF42FLQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03057300
*                                    DFSMS CACHE STRUCTURE       @10A   03057400
*                                                                @10A   03057500
SMF42FLR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03057600
*                                    TO DASD.                    @10A   03057700
SMF42FLS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03057800
*                                    TO DASD.                    @10A   03057900
SMF42FLT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03058000
*                                    DASD FOR THE READ  REQUESTS @10A   03058100
*                                                                @10A   03058200
SMF42FLU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03058300
*                                    DASD FOR THE WRITE REQUESTS @10A   03058400
*                                                                @10A   03058500
SMF42FLV DS   CL16                   RESERVED                           03058600
*                                                                @10A   03058700
SMF42FLW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03058800
*                                    REQUESTS IN THIS                   03058900
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03059000
*                                    IN MILLI- SECONDS)          @21A   03059100
*                                                                       03059200
SMF42FLX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03059300
*                                    THE REQUESTS IN THIS INTERVAL.     03059400
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03059500
*                                                                @10A   03059600
SMF42FLY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03059700
*                                    OF THE REQUESTS IN THIS INTERVAL   03059800
*                                    (TOTAL TIME/NUMBER OF BYTES        03059900
*                                    TRANSFERED/4K)              @10A   03060000
SMF42FLZ DS   CL8                    RESERVED                    @10A   03060100
SMF42FL7 DS   CL32                   RESERVED                    @10A   03060200
SMF42F1G_LEN  EQU *-SMF42F1G                                     @10A   03060300
*                                                                       03060400
SMF42F1H DS   0CL168                 READ-A-HEAD SEQUENTIAL ACCESS      03060500
*                                    SECTION                     @10A   03060600
SMF42FMA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03060700
*                                    NUMBER                      @10A   03060800
SMF42FMB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03060900
*                                                                @10A   03061000
SMF42FMC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03061100
*                                    NRI - NO READ INTEGERITY           03061200
*                                                                @10A   03061300
SMF42FMD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03061400
*                                    CONSISTENT READS   @10A            03061500
*                                                                       03061600
SMF42FME DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03061700
*                                                                @10A   03061800
SMF42FMF DS   1FL4                   NUMBER OF BMF REQUESTS             03061900
*                                                                @10A   03062000
SMF42FMG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03062100
*                                                                @10A   03062200
SMF42FMH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03062300
*                                                                @10A   03062400
*                                                                       03062500
SMF42FMI DS   1FL4                   NUMBER OF BMF READ HITS            03062600
*                                                                @10A   03062700
SMF42FMJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03062800
*                                                                @10A   03062900
SMF42FMK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03063000
*                                                                @10A   03063100
SMF42FML DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03063200
*                                    THE SYSPLEX CACHE MANAGER   @10A   03063300
*                                                                       03063400
SMF42FMM DS   1FL4                   NUMBER OF CF READ REQUESTS         03063500
*                                                                @10A   03063600
SMF42FMN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03063700
SMF42FMO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03063800
SMF42FMP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03063900
SMF42FMQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03064000
*                                    DFSMS CACHE STRUCTURE       @10A   03064100
*                                                                @10A   03064200
SMF42FMR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03064300
*                                    TO DASD.                    @10A   03064400
SMF42FMS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03064500
*                                    TO DASD.                    @10A   03064600
SMF42FMT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03064700
*                                    DASD FOR THE READ  REQUESTS @10A   03064800
*                                                                @10A   03064900
SMF42FMU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03065000
*                                    DASD FOR THE WRITE REQUESTS @10A   03065100
*                                                                @10A   03065200
SMF42FMV DS   CL16                   RESERVED                           03065300
*                                                                @10A   03065400
SMF42FMW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03065500
*                                    REQUESTS IN THIS                   03065600
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03065700
*                                    IN MILLI- SECONDS)          @21A   03065800
*                                                                       03065900
SMF42FMX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03066000
*                                    THE REQUESTS IN THIS INTERVAL.     03066100
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03066200
*                                                                @10A   03066300
SMF42FMY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03066400
*                                    OF THE REQUESTS IN THIS INTERVAL   03066500
*                                    (TOTAL TIME/NUMBER OF BYTES        03066600
*                                    TRANSFERED/4K)              @10A   03066700
SMF42FMZ DS   CL8                    RESERVED                    @10A   03066800
SMF42FM7 DS   CL32                   RESERVED                    @10A   03066900
SMF42F1H_LEN  EQU *-SMF42F1H                                     @10A   03067000
*                                                                       03067100
SMF42F1I DS   0CL168                 PRE-FORMAT SEQUENTIAL ACCESS       03067200
*                                    SECTION                     @10A   03067300
SMF42FNA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03067400
*                                    NUMBER                      @10A   03067500
SMF42FNB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03067600
*                                                                @10A   03067700
SMF42FNC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03067800
*                                    NRI - NO READ INTEGERITY           03067900
*                                                                @10A   03068000
SMF42FND DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03068100
*                                    CONSISTENT READS   @10A            03068200
*                                                                       03068300
SMF42FNE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03068400
*                                                                @10A   03068500
SMF42FNF DS   1FL4                   NUMBER OF BMF REQUESTS             03068600
*                                                                @10A   03068700
SMF42FNG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03068800
*                                                                @10A   03068900
SMF42FNH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03069000
*                                                                @10A   03069100
*                                                                       03069200
SMF42FNI DS   1FL4                   NUMBER OF BMF READ HITS            03069300
*                                                                @10A   03069400
SMF42FNJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03069500
*                                                                @10A   03069600
SMF42FNK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03069700
*                                                                @10A   03069800
SMF42FNL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03069900
*                                    THE SYSPLEX CACHE MANAGER   @10A   03070000
*                                                                       03070100
SMF42FNM DS   1FL4                   NUMBER OF CF READ REQUESTS         03070200
*                                                                @10A   03070300
SMF42FNN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03070400
SMF42FNO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03070500
SMF42FNP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03070600
SMF42FNQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03070700
*                                    DFSMS CACHE STRUCTURE       @10A   03070800
*                                                                @10A   03070900
SMF42FNR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03071000
*                                    TO DASD.                    @10A   03071100
SMF42FNS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03071200
*                                    TO DASD.                    @10A   03071300
SMF42FNT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03071400
*                                    DASD FOR THE READ  REQUESTS @10A   03071500
*                                                                @10A   03071600
SMF42FNU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03071700
*                                    DASD FOR THE WRITE REQUESTS @10A   03071800
*                                                                @10A   03071900
SMF42FNV DS   CL16                   RESERVED                           03072000
*                                                                @10A   03072100
SMF42FNW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03072200
*                                    REQUESTS IN THIS                   03072300
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03072400
*                                    IN MILLI- SECONDS)          @21A   03072500
*                                                                       03072600
SMF42FNX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03072700
*                                    THE REQUESTS IN THIS INTERVAL.     03072800
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03072900
*                                                                @10A   03073000
SMF42FNY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03073100
*                                    OF THE REQUESTS IN THIS INTERVAL   03073200
*                                    (TOTAL TIME/NUMBER OF BYTES        03073300
*                                    TRANSFERED/4K)              @10A   03073400
SMF42FNZ DS   CL8                    RESERVED                    @10A   03073500
SMF42FN7 DS   CL32                   RESERVED                    @10A   03073600
SMF42F1I_LEN  EQU *-SMF42F1I                                     @10A   03073700
SMF42F1E_LEN  EQU *-SMF42F1E                                     @10A   03073800
*                                                                       03073900
SMF42FX3 DS   0CL128                 LOCKING STATISTCS SUMMARY   @10A   03074000
SMF42FRA DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03074100
*                                    REQUESTS                    @10A   03074200
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03074300
SMF42FRB DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03074400
*                                    REQUESTS THAT CAUSE TRUE    @10A   03074500
*                                    CONTENTION                  @10A   03074600
SMF42FRC DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03074700
*                                    REQUESTS THAT CAUSE FALSE   @10A   03074800
*                                    CONTENTION                  @10A   03074900
SMF42FRD DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03075000
*                                    RELEASE REQUESTS            @10A   03075100
SMF42FRE DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03075200
*                                    LOCK REQUESTS               @10A   03075300
SMF42FRF DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03075400
*                                    RELEASE LOCK REQUESTS       @10A   03075500
SMF42FRG DS   CL8                    RESERVED                    @10A   03075600
SMF42FRH DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03075700
*                                    CLASS_1 (DIWA) LOCKS        @10A   03075800
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03075900
SMF42FRI DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03076000
*                                    CLASS_1 (DIWA) LOCKS        @10A   03076100
*                                    THAT CAUSE TRUE CONTENTION  @10A   03076200
SMF42FRJ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03076300
*                                    CLASS_1 (DIWA) LOCKS        @10A   03076400
*                                    THAT CAUSE FALSE CONTENTION @10A   03076500
SMF42FRK DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03076600
*                                    CLASS_1 (DIWA) RELEASE      @10A   03076700
*                                    LOCK REQUESTS               @10A   03076800
SMF42FRL DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03076900
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03077000
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03077100
SMF42FRM DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03077200
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03077300
*                                    THAT CAUSE TRUE CONTENTION  @10A   03077400
SMF42FRN DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03077500
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03077600
*                                    THAT CAUSE FALSE CONTENTION @10A   03077700
SMF42FRO DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03077800
*                                    CLASS_2 (UPGRADE) RELEASE   @10A   03077900
*                                    LOCK REQUESTS               @10A   03078000
SMF42FRP DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03078100
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03078200
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03078300
SMF42FRQ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03078400
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03078500
*                                    THAT CAUSE TRUE CONTENTION  @10A   03078600
SMF42FRR DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03078700
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03078800
*                                    THAT CAUSE FALSE CONTENTION @10A   03078900
SMF42FRS DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03079000
*                                    CLASS_3 (PREFORMAT) RELEASE @10A   03079100
*                                    LOCK REQUESTS               @10A   03079200
SMF42FRT DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03079300
*                                    LOCK REQUESTS               @10A   03079400
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03079500
SMF42FRU DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03079600
*                                    THAT CAUSE TRUE CONTENTION  @10A   03079700
SMF42FRV DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03079800
*                                    THAT CAUSE FALSE CONTENTION @10A   03079900
SMF42FRW DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03080000
*                                    RELEASE LOCK REQUESTS       @10A   03080100
SMF42FRX DS   CL32                   RESERVED                    @10A   03080200
*                                                                @10A   03080300
*                                                                @10A   03080400
SMF42FX3_LEN  EQU *-SMF42FX3                                     @10A   03080500
*                                                                @10A   03080600
SMF42FX4 DS   0CL32                  THREAD LEVEL STATISTICS     @10A   03080700
SMF42FQR DS   CL8                    TOTAL TIME ALL THREAD       @10A   03080800
*                                    REQUESTS                    @10A   03080900
SMF42FQS DS   1FL4                   TOTAL NUMBER OF ALL THREAD  @10A   03081000
*                                    REQUESTS                    @10A   03081100
SMF42FQT DS   1FL4                   RESERVED                    @10A   03081200
SMF42FQU DS   1FL4                   AVERAGE RESPONSE TIME FOR   @10A   03081300
*                                    ALL OF THE THREAD REQUESTS  @10A   03081400
*                                    IN THE INTERVAL             @10A   03081500
*                                    (TOTAL TIME/NUMBER OF       @10A   03081600
*                                     THREAD REQUESTS)           @10A   03081700
SMF42FQV DS   1FL4                   NORMALIZED RESPONSE TIME    @10A   03081800
*                                    FOR ALL OF THE THREAD       @10A   03081900
*                                    REQUESTS IN THE INTERVAL    @10A   03082000
*                                    (TOTAL TIME/NUMBER OF BYTES @10A   03082100
*                                     TRANSFERED/4K)             @10A   03082200
SMF42FQW DS   CL8                    RESERVED                    @10A   03082300
*                                                                @10A   03082400
SMF42FX4_LEN  EQU *-SMF42FX4                                     @10A   03082500
SMF420FB_LEN  EQU *-SMF420FB                                     @10A   03082600
*                                                                       03082700
.SKIP_BF ANOP                                                           03082900
         AIF ('&SMF42_0G' EQ 'NO').SKIP_BG                              03083000
*                                                                       03083100
*   -----------------------------------------------------------------   03083200
*    CF DATASET RESPONSE TIME SUMMARY (SMF42 SUBTYPE 16)                03083300
*   -----------------------------------------------------------------   03083400
SMF420GA DSECT ,                                                        03083500
SMF42GA1 DS   0CL1472                SYSPLEX WIDE SUMMARY        @21A   03083600
SMF42GAA DS   1FL4                   INTERVAL LENGTH. THIS IS THE       03083700
*                                    TOTAL TIME OF THE MEASUREMENT      03083800
*                                    PERIOD. (IN SECONDS)        @10A   03083900
SMF42A00 DS   CL12                   RESERVED                    @MDK   03084000
*                                                                       03084100
SMF42GAB DS   CL44                   DATA SET NAME               @10A   03084200
SMF42A01 DS   1FL4                   RESERVED                    @10A   03084300
*                                                                       03084400
SMF42GAC DS   CL44                   VSAM SPHERE NAME            @10A   03084500
SMF42A02 DS   1FL4                   RESERVED                    @10A   03084600
*                                                                       03084700
SMF42GAD DS   1FL2                   LENGTH OF THE STORAGE CLASS        03084800
*                                    NAME                        @10A   03084900
SMF42GAE DS   CL30                   STORAGE CLASS NAME          @10A   03085000
*                                                                       03085100
SMF42A03 DS   1FL2                   CACHESETNAME LENGTH         @10A   03085200
SMF42GAF DS   CL30                   CACHESET NAME               @10A   03085300
*                                                                       03085400
SMF42GAG DS   CL2                    RESERVED                    @10A   03085500
SMF42GAH DS   CL30                   DFP CACHE STRUCTURE NAME    @10A   03085600
*                                                                       03085700
SMF42GAI DS   1FL4                   INDICATOR OF COMPONENT BEING       03085800
*                                    PROCESSED                   @10A   03085900
SMF42GAI0 EQU   X'80000000'          DATA COMPONENT              @10A   03086000
SMF42GAI1 EQU   X'40000000'          INDEX COMPONENT             @10A   03086100
*                                                                @10A   03086200
SMF42GAJ DS   CL12                   RESERVED                    @10A   03086300
*                                                                       03086400
SMF42GAK DS   1FL4                   NUMBER OF LOCK REQUESTS            03086500
*                                    PROCESSED                   @10A   03086600
SMF42GAL DS   1FL4                   NUMBER OF TRUE CONTENTION          03086700
*                                    LOCK REQUESTS               @10A   03086800
SMF42GAM DS   1FL4                   NUMBER OF FALSE CONTENTION         03086900
*                                    LOCK REQUESTS               @10A   03087000
SMF42GZ1 DS   1FL2                   SMSDIRECTWEIGHT             @10A   03087100
SMF42GZ2 DS   1FL2                   SMSSEQUENTIALWEIGHT         @10A   03087200
*                                                                       03087300
SMF42GAN DS   CL8              IN DFSMS 1.4   WLM SERV CLASS NAME@10A   03087400
SMF42GAO DS   CL8              IN DFSMS 1.4   WLM REPORT CLS NAME@10A   03087500
*                                                                       03087600
SMF42GAP DS   CL16                   RESERVED                    @10A   03087700
*                                                                       03087800
SMF42GA2 DS   0CL336                 DIRECT ACCESS SUMMARY SECTION      03087900
*                                                                @10A   03088000
SMF42GA3 DS   0CL168                 NORMAL DIRECT ACCESS SUMMARY       03088100
*                                    SECTION                     @10A   03088200
SMF42GCA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03088300
*                                    NUMBER                      @10A   03088400
SMF42GCB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03088500
*                                                                @10A   03088600
SMF42GCC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03088700
*                                    NRI - NO READ INTEGERITY           03088800
*                                                                @10A   03088900
SMF42GCD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03089000
*                                    CONSISTENT READS   @10A            03089100
*                                                                       03089200
SMF42GCE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03089300
*                                                                @10A   03089400
SMF42GCF DS   1FL4                   NUMBER OF BMF REQUESTS             03089500
*                                                                @10A   03089600
SMF42GCG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03089700
*                                                                @10A   03089800
SMF42GCH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03089900
*                                                                @10A   03090000
*                                                                       03090100
SMF42GCI DS   1FL4                   NUMBER OF BMF READ HITS            03090200
*                                                                @10A   03090300
SMF42GCJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03090400
*                                                                @10A   03090500
SMF42GCK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03090600
*                                                                @10A   03090700
SMF42GCL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03090800
*                                    THE SYSPLEX CACHE MANAGER   @10A   03090900
*                                                                       03091000
SMF42GCM DS   1FL4                   NUMBER OF CF READ REQUESTS         03091100
*                                                                @10A   03091200
SMF42GCN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03091300
SMF42GCO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03091400
SMF42GCP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03091500
SMF42GCQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03091600
*                                    DFSMS CACHE STRUCTURE       @10A   03091700
*                                                                @10A   03091800
SMF42GCR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03091900
*                                    TO DASD.                    @10A   03092000
SMF42GCS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03092100
*                                    TO DASD.                    @10A   03092200
SMF42GCT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03092300
*                                    DASD FOR THE READ  REQUESTS @10A   03092400
*                                                                @10A   03092500
SMF42GCU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03092600
*                                    DASD FOR THE WRITE REQUESTS @10A   03092700
*                                                                @10A   03092800
SMF42GCV DS   CL16                   RESERVED                           03092900
*                                                                @10A   03093000
SMF42GCW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03093100
*                                    REQUESTS IN THIS                   03093200
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03093300
*                                    IN MILLI- SECONDS)          @21A   03093400
*                                                                       03093500
SMF42GCX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03093600
*                                    THE REQUESTS IN THIS INTERVAL.     03093700
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03093800
*                                                                @10A   03093900
SMF42GCY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03094000
*                                    OF THE REQUESTS IN THIS INTERVAL   03094100
*                                    (TOTAL TIME/NUMBER OF BYTES        03094200
*                                    TRANSFERED/4K)              @10A   03094300
SMF42GCZ DS   CL8                    RESERVED                    @10A   03094400
SMF42GC7 DS   CL32                   RESERVED                    @10A   03094500
*                                                                       03094600
SMF42GA3_LEN  EQU *-SMF42GA3                                     @10A   03094700
*                                                                       03094800
SMF42GA4 DS   0CL168                 RE-DO DURING DIRECT ACCESS         03094900
*                                    SECTION                     @10A   03095000
SMF42GDA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03095100
*                                    NUMBER                      @10A   03095200
SMF42GDB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03095300
*                                                                @10A   03095400
SMF42GDC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03095500
*                                    NRI - NO READ INTEGERITY           03095600
*                                                                @10A   03095700
SMF42GDD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03095800
*                                    CONSISTENT READS   @10A            03095900
*                                                                       03096000
SMF42GDE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03096100
*                                                                @10A   03096200
SMF42GDF DS   1FL4                   NUMBER OF BMF REQUESTS             03096300
*                                                                @10A   03096400
SMF42GDG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03096500
*                                                                @10A   03096600
SMF42GDH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03096700
*                                                                @10A   03096800
*                                                                       03096900
SMF42GDI DS   1FL4                   NUMBER OF BMF READ HITS            03097000
*                                                                @10A   03097100
SMF42GDJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03097200
*                                                                @10A   03097300
SMF42GDK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03097400
*                                                                @10A   03097500
SMF42GDL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03097600
*                                    THE SYSPLEX CACHE MANAGER   @10A   03097700
*                                                                       03097800
SMF42GDM DS   1FL4                   NUMBER OF CF READ REQUESTS         03097900
*                                                                @10A   03098000
SMF42GDN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03098100
SMF42GDO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03098200
SMF42GDP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03098300
SMF42GDQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03098400
*                                    DFSMS CACHE STRUCTURE       @10A   03098500
*                                                                @10A   03098600
SMF42GDR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03098700
*                                    TO DASD.                    @10A   03098800
SMF42GDS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03098900
*                                    TO DASD.                    @10A   03099000
SMF42GDT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03099100
*                                    DASD FOR THE READ  REQUESTS @10A   03099200
*                                                                @10A   03099300
SMF42GDU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03099400
*                                    DASD FOR THE WRITE REQUESTS @10A   03099500
*                                                                @10A   03099600
SMF42GDV DS   CL16                   RESERVED                           03099700
*                                                                @10A   03099800
SMF42GDW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03099900
*                                    REQUESTS IN THIS                   03100000
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03100100
*                                    IN MILLI- SECONDS)          @21A   03100200
*                                                                       03100300
SMF42GDX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03100400
*                                    THE REQUESTS IN THIS INTERVAL.     03100500
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03100600
*                                                                @10A   03100700
SMF42GDY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03100800
*                                    OF THE REQUESTS IN THIS INTERVAL   03100900
*                                    (TOTAL TIME/NUMBER OF BYTES        03101000
*                                    TRANSFERED/4K)              @10A   03101100
SMF42GDZ DS   CL8                    RESERVED                    @10A   03101200
SMF42GD7 DS   CL32                   RESERVED                    @10A   03101300
*                                                                       03101400
SMF42GA4_LEN  EQU *-SMF42GA4                                     @10A   03101500
SMF42GA2_LEN  EQU *-SMF42GA2                                     @10A   03101600
*                                                                       03101700
SMF42GA5 DS   0CL800                 SEQUENTIAL ACCESS SUMMARY SECTION  03101800
*                                                                @10A   03101900
SMF42GA6 DS   0CL168                 NORMAL SEQUENTIAL ACCESS SECTION   03102000
*                                                                @10A   03102100
SMF42GEA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03102200
*                                    NUMBER                      @10A   03102300
SMF42GEB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03102400
*                                                                @10A   03102500
SMF42GEC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03102600
*                                    NRI - NO READ INTEGERITY           03102700
*                                                                @10A   03102800
SMF42GED DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03102900
*                                    CONSISTENT READS   @10A            03103000
*                                                                       03103100
SMF42GEE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03103200
*                                                                @10A   03103300
SMF42GEF DS   1FL4                   NUMBER OF BMF REQUESTS             03103400
*                                                                @10A   03103500
SMF42GEG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03103600
*                                                                @10A   03103700
SMF42GEH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03103800
*                                                                @10A   03103900
*                                                                       03104000
SMF42GEI DS   1FL4                   NUMBER OF BMF READ HITS            03104100
*                                                                @10A   03104200
SMF42GEJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03104300
*                                                                @10A   03104400
SMF42GEK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03104500
*                                                                @10A   03104600
SMF42GEL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03104700
*                                    THE SYSPLEX CACHE MANAGER   @10A   03104800
*                                                                       03104900
SMF42GEM DS   1FL4                   NUMBER OF CF READ REQUESTS         03105000
*                                                                @10A   03105100
SMF42GEN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03105200
SMF42GEO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03105300
SMF42GEP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03105400
SMF42GEQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03105500
*                                    DFSMS CACHE STRUCTURE       @10A   03105600
*                                                                @10A   03105700
SMF42GER DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03105800
*                                    TO DASD.                    @10A   03105900
SMF42GES DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03106000
*                                    TO DASD.                    @10A   03106100
SMF42GET DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03106200
*                                    DASD FOR THE READ  REQUESTS @10A   03106300
*                                                                @10A   03106400
SMF42GEU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03106500
*                                    DASD FOR THE WRITE REQUESTS @10A   03106600
*                                                                @10A   03106700
SMF42GEV DS   CL16                   RESERVED                           03106800
*                                                                @10A   03106900
SMF42GEW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03107000
*                                    REQUESTS IN THIS                   03107100
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03107200
*                                    IN MILLI- SECONDS)          @21A   03107300
*                                                                       03107400
SMF42GEX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03107500
*                                    THE REQUESTS IN THIS INTERVAL.     03107600
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03107700
*                                                                @10A   03107800
SMF42GEY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03107900
*                                    OF THE REQUESTS IN THIS INTERVAL   03108000
*                                    (TOTAL TIME/NUMBER OF BYTES        03108100
*                                    TRANSFERED/4K)              @10A   03108200
*                                                                       03108300
SMF42GEZ DS   CL8                    RESERVED                    @10A   03108400
SMF42GE7 DS   CL32                   RESERVED                    @10A   03108500
*                                                                       03108600
SMF42GA6_LEN  EQU *-SMF42GA6                                            03108700
*                                                                       03108800
SMF42GA7 DS   0CL168                 RE-DO DURING SEQUENTIAL ACCESS     03108900
*                                    SECTION                     @10A   03109000
SMF42GFA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03109100
*                                    NUMBER                      @10A   03109200
SMF42GFB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03109300
*                                                                @10A   03109400
SMF42GFC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03109500
*                                    NRI - NO READ INTEGERITY           03109600
*                                                                @10A   03109700
SMF42GFD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03109800
*                                    CONSISTENT READS   @10A            03109900
*                                                                       03110000
SMF42GFE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03110100
*                                                                @10A   03110200
SMF42GFF DS   1FL4                   NUMBER OF BMF REQUESTS             03110300
*                                                                @10A   03110400
SMF42GFG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03110500
*                                                                @10A   03110600
SMF42GFH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03110700
*                                                                @10A   03110800
*                                                                       03110900
SMF42GFI DS   1FL4                   NUMBER OF BMF READ HITS            03111000
*                                                                @10A   03111100
SMF42GFJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03111200
*                                                                @10A   03111300
SMF42GFK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03111400
*                                                                @10A   03111500
SMF42GFL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03111600
*                                    THE SYSPLEX CACHE MANAGER   @10A   03111700
*                                                                       03111800
SMF42GFM DS   1FL4                   NUMBER OF CF READ REQUESTS         03111900
*                                                                @10A   03112000
SMF42GFN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03112100
SMF42GFO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03112200
SMF42GFP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03112300
SMF42GFQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03112400
*                                    DFSMS CACHE STRUCTURE       @10A   03112500
*                                                                @10A   03112600
SMF42GFR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03112700
*                                    TO DASD.                    @10A   03112800
SMF42GFS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03112900
*                                    TO DASD.                    @10A   03113000
SMF42GFT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03113100
*                                    DASD FOR THE READ  REQUESTS @10A   03113200
*                                                                @10A   03113300
SMF42GFU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03113400
*                                    DASD FOR THE WRITE REQUESTS @10A   03113500
*                                                                @10A   03113600
SMF42GFV DS   CL16                   RESERVED                           03113700
*                                                                @10A   03113800
SMF42GFW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03113900
*                                    REQUESTS IN THIS                   03114000
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03114100
*                                    IN MILLI- SECONDS)          @21A   03114200
*                                                                       03114300
SMF42GFX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03114400
*                                    THE REQUESTS IN THIS INTERVAL.     03114500
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03114600
*                                                                @10A   03114700
SMF42GFY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03114800
*                                    OF THE REQUESTS IN THIS INTERVAL   03114900
*                                    (TOTAL TIME/NUMBER OF BYTES        03115000
*                                    TRANSFERED/4K)              @10A   03115100
*                                                                       03115200
SMF42GFZ DS   CL8                    RESERVED                    @10A   03115300
SMF42GF7 DS   CL32                   RESERVED                    @10A   03115400
*                                                                       03115500
SMF42GA7_LEN  EQU *-SMF42GA7                                            03115600
*                                                                       03115700
SMF42GA8 DS   0CL168                 READ-A-HEAD SEQUENTIAL ACCESS      03115800
*                                    SECTION                     @10A   03115900
SMF42GGA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03116000
*                                    NUMBER                      @10A   03116100
SMF42GGB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03116200
*                                                                @10A   03116300
SMF42GGC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03116400
*                                    NRI - NO READ INTEGERITY           03116500
*                                                                @10A   03116600
SMF42GGD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03116700
*                                    CONSISTENT READS   @10A            03116800
*                                                                       03116900
SMF42GGE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03117000
*                                                                @10A   03117100
SMF42GGF DS   1FL4                   NUMBER OF BMF REQUESTS             03117200
*                                                                @10A   03117300
SMF42GGG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03117400
*                                                                @10A   03117500
SMF42GGH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03117600
*                                                                @10A   03117700
*                                                                       03117800
SMF42GGI DS   1FL4                   NUMBER OF BMF READ HITS            03117900
*                                                                @10A   03118000
SMF42GGJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03118100
*                                                                @10A   03118200
SMF42GGK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03118300
*                                                                @10A   03118400
SMF42GGL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03118500
*                                    THE SYSPLEX CACHE MANAGER   @10A   03118600
*                                                                       03118700
SMF42GGM DS   1FL4                   NUMBER OF CF READ REQUESTS         03118800
*                                                                @10A   03118900
SMF42GGN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03119000
SMF42GGO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03119100
SMF42GGP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03119200
SMF42GGQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03119300
*                                    DFSMS CACHE STRUCTURE       @10A   03119400
*                                                                @10A   03119500
SMF42GGR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03119600
*                                    TO DASD.                    @10A   03119700
SMF42GGS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03119800
*                                    TO DASD.                    @10A   03119900
SMF42GGT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03120000
*                                    DASD FOR THE READ  REQUESTS @10A   03120100
*                                                                @10A   03120200
SMF42GGU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03120300
*                                    DASD FOR THE WRITE REQUESTS @10A   03120400
*                                                                @10A   03120500
SMF42GGV DS   CL16                   RESERVED                           03120600
*                                                                @10A   03120700
SMF42GGW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03120800
*                                    REQUESTS IN THIS                   03120900
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03121000
*                                    IN MILLI- SECONDS)          @21A   03121100
*                                                                       03121200
SMF42GGX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03121300
*                                    THE REQUESTS IN THIS INTERVAL.     03121400
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03121500
*                                                                @10A   03121600
SMF42GGY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03121700
*                                    OF THE REQUESTS IN THIS INTERVAL   03121800
*                                    (TOTAL TIME/NUMBER OF BYTES        03121900
*                                    TRANSFERED/4K)              @10A   03122000
*                                                                       03122100
SMF42GGZ DS   CL8                    RESERVED                    @10A   03122200
SMF42GG7 DS   CL32                   RESERVED                    @10A   03122300
*                                                                       03122400
SMF42GA8_LEN  EQU *-SMF42GA8                                            03122500
*                                                                       03122600
SMF42GA9 DS   0CL168                 PRE-FORMAT SEQUENTIAL ACCESS       03122700
*                                    SECTION                     @10A   03122800
SMF42GHA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03122900
*                                    NUMBER                      @10A   03123000
SMF42GHB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03123100
*                                                                @10A   03123200
SMF42GHC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03123300
*                                    NRI - NO READ INTEGERITY           03123400
*                                                                @10A   03123500
SMF42GHD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03123600
*                                    CONSISTENT READS   @10A            03123700
*                                                                       03123800
SMF42GHE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03123900
*                                                                @10A   03124000
SMF42GHF DS   1FL4                   NUMBER OF BMF REQUESTS             03124100
*                                                                @10A   03124200
SMF42GHG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03124300
*                                                                @10A   03124400
SMF42GHH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03124500
*                                                                @10A   03124600
*                                                                       03124700
SMF42GHI DS   1FL4                   NUMBER OF BMF READ HITS            03124800
*                                                                @10A   03124900
SMF42GHJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03125000
*                                                                @10A   03125100
SMF42GHK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03125200
*                                                                @10A   03125300
SMF42GHL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03125400
*                                    THE SYSPLEX CACHE MANAGER   @10A   03125500
*                                                                       03125600
SMF42GHM DS   1FL4                   NUMBER OF CF READ REQUESTS         03125700
*                                                                @10A   03125800
SMF42GHN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03125900
SMF42GHO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03126000
SMF42GHP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03126100
SMF42GHQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03126200
*                                    DFSMS CACHE STRUCTURE       @10A   03126300
*                                                                @10A   03126400
SMF42GHR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03126500
*                                    TO DASD.                    @10A   03126600
SMF42GHS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03126700
*                                    TO DASD.                    @10A   03126800
SMF42GHT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03126900
*                                    DASD FOR THE READ  REQUESTS @10A   03127000
*                                                                @10A   03127100
SMF42GHU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03127200
*                                    DASD FOR THE WRITE REQUESTS @10A   03127300
*                                                                @10A   03127400
SMF42GHV DS   CL16                   RESERVED                           03127500
*                                                                @10A   03127600
SMF42GHW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03127700
*                                    REQUESTS IN THIS                   03127800
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03127900
*                                    IN MILLI- SECONDS)          @21A   03128000
*                                                                       03128100
SMF42GHX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03128200
*                                    THE REQUESTS IN THIS INTERVAL.     03128300
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03128400
*                                                                @10A   03128500
SMF42GHY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03128600
*                                    OF THE REQUESTS IN THIS INTERVAL   03128700
*                                    (TOTAL TIME/NUMBER OF BYTES        03128800
*                                    TRANSFERED/4K)              @10A   03128900
*                                                                       03129000
SMF42GHZ DS   CL8                    RESERVED                    @10A   03129100
SMF42GH7 DS   CL32                   RESERVED                    @10A   03129200
*                                                                       03129300
SMF42GA9_LEN  EQU *-SMF42GA9                                            03129400
SMF42GA5_LEN  EQU *-SMF42GA5                                            03129500
*                                                                       03129600
SMF42FX5 DS   0CL128                 LOCKING STATISTCS SUMMARY   @10A   03129700
SMF42GPA DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03129800
*                                    REQUESTS                    @10A   03129900
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03130000
SMF42GPB DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03130100
*                                    REQUESTS THAT CAUSE TRUE    @10A   03130200
*                                    CONTENTION                  @10A   03130300
SMF42GPC DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03130400
*                                    REQUESTS THAT CAUSE FALSE   @10A   03130500
*                                    CONTENTION                  @10A   03130600
SMF42GPD DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03130700
*                                    RELEASE REQUESTS            @10A   03130800
SMF42GPE DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03130900
*                                    LOCK REQUESTS               @10A   03131000
SMF42GPF DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03131100
*                                    RELEASE LOCK REQUESTS       @10A   03131200
SMF42GPG DS   CL8                    RESERVED                    @10A   03131300
SMF42GPH DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03131400
*                                    CLASS_1 (DIWA) LOCKS        @10A   03131500
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03131600
SMF42GPI DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03131700
*                                    CLASS_1 (DIWA) LOCKS        @10A   03131800
*                                    THAT CAUSE TRUE CONTENTION  @10A   03131900
SMF42GPJ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03132000
*                                    CLASS_1 (DIWA) LOCKS        @10A   03132100
*                                    THAT CAUSE FALSE CONTENTION @10A   03132200
SMF42GPK DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03132300
*                                    CLASS_1 (DIWA) RELEASE      @10A   03132400
*                                    LOCK REQUESTS               @10A   03132500
SMF42GPL DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03132600
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03132700
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03132800
SMF42GPM DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03132900
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03133000
*                                    THAT CAUSE TRUE CONTENTION  @10A   03133100
SMF42GPN DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03133200
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03133300
*                                    THAT CAUSE FALSE CONTENTION @10A   03133400
SMF42GPO DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03133500
*                                    CLASS_2 (UPGRADE) RELEASE   @10A   03133600
*                                    LOCK REQUESTS               @10A   03133700
SMF42GPP DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03133800
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03133900
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03134000
SMF42GPQ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03134100
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03134200
*                                    THAT CAUSE TRUE CONTENTION  @10A   03134300
SMF42GPR DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03134400
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03134500
*                                    THAT CAUSE FALSE CONTENTION @10A   03134600
SMF42GPS DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03134700
*                                    CLASS_3 (PREFORMAT) RELEASE @10A   03134800
*                                    LOCK REQUESTS               @10A   03134900
SMF42GPT DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03135000
*                                    LOCK REQUESTS               @10A   03135100
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03135200
SMF42GPU DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03135300
*                                    THAT CAUSE TRUE CONTENTION  @10A   03135400
SMF42GPV DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03135500
*                                    THAT CAUSE FALSE CONTENTION @10A   03135600
SMF42GPW DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03135700
*                                    RELEASE LOCK REQUESTS       @10A   03135800
SMF42GPX DS   CL32                   RESERVED                    @10A   03135900
*                                                                @10A   03136000
SMF42FX5_LEN  EQU *-SMF42FX5                                     @10A   03136100
*                                                                       03136200
SMF42FX7 DS   0CL64                  DATASET BMF LRU STATS       @21A   03136300
SMF42GRA DS   1FL4                   NUMBER OF REDOS             @21A   03136400
SMF42GRB DS   1FL4                   NUMBER OF RECURSIVE REDOS   @21A   03136500
SMF42GRC DS   1FL4                   NUMBER OF BMF WRITES        @21A   03136600
SMF42GRD DS   1FL4                   NUMBER OF SCM READ REQUESTS @21A   03136700
SMF42GRE DS   1FL4                   NUMBER OF SCM READ REQUESTS @21A   03136800
*                                    THAT ENCOUNTERED CASTOUT    @21A   03136900
*                                    LOCK CONTENTION             @21A   03137000
SMF42GRG DS   1FL4                   REDO PERCENT                @21A   03137100
SMF42GRH DS   1FL4                   RECURSIVE REDO PERCENT      @21A   03137200
SMF42GRI DS   1FL4                   SCM CASTOUT LOCK PERCENT    @21A   03137300
SMF42GRF DS   CL12                   RESERVED                    @21A   03137400
SMF42GRJ DS   CL4                    RESERVED                    @21A   03137500
SMF42GRK DS   CL16                   RESERVED                    @21A   03137600
*                                                                @21A   03137700
SMF42FX7_LEN  EQU *-SMF42FX7                                     @21A   03137800
SMF420GA_LEN  EQU *-SMF420GA                                     @10A   03137900
*                                                                       03138000
SMF420GB DSECT ,                                                        03138100
SMF42G1A DS   0CL1488                DATA SET/MVS SYSTEM SUMMARY @21A   03138200
*                                    SECTION                     @21C   03138300
SMF42GBA DS   1FL4                   INTERVAL LENGTH. THIS IS THE       03138400
*                                    TOTAL TIME OF THE MEASUREMENT      03138500
*                                    PERIOD. (IN SECONDS)        @10A   03138600
SMF42A05 DS   CL12                   RESERVED                    @10A   03138700
*                                                                       03138800
SMF42GBB DS   CL44                   DATA SET NAME               @10A   03138900
SMF42A06 DS   1FL4                   RESERVED                    @10A   03139000
*                                                                       03139100
SMF42GBC DS   CL44                   VSAM SPHERE NAME            @10A   03139200
SMF42A07 DS   1FL4                   RESERVED                    @10A   03139300
*                                                                       03139400
SMF42GBD DS   1FL2                   LENGTH OF THE STORAGE CLASS        03139500
*                                    NAME                        @10A   03139600
SMF42GBE DS   CL30                   STORAGE CLASS NAME          @10A   03139700
*                                                                       03139800
SMF42A08 DS   1FL2                   CACHESETNAME LENGTH         @10A   03139900
SMF42GBF DS   CL30                   CACHESET NAME               @10A   03140000
*                                                                       03140100
SMF42A12 DS   1FL2                   RESERVED                    @10A   03140200
SMF42GBG DS   CL30                   DFP CACHE STRUCTURE NAME    @10A   03140300
*                                                                       03140400
SMF42GBH DS   CL8                    MVS SYSTEM NAME             @10A   03140500
SMF42A11 DS   CL8                    RESERVED                    @10A   03140600
*                                                                       03140700
SMF42GBI DS   1FL4                   INDICATOR OF COMPONENT BEING       03140800
*                                    PROCESSED                   @10A   03140900
SMF42GBI0 EQU   X'80000000'          DATA COMPONENT              @10A   03141000
SMF42GBI1 EQU   X'40000000'          INDEX COMPONENT             @10A   03141100
SMF42A09 DS   CL12                   RESERVED                    @10A   03141200
*                                                                       03141300
SMF42GBK DS   1FL4                   NUMBER OF LOCK REQUESTS            03141400
*                                    PROCESSED                   @10A   03141500
SMF42GBL DS   1FL4                   NUMBER OF TRUE CONTENTION          03141600
*                                    LOCK REQUESTS               @10A   03141700
SMF42GBM DS   1FL4                   NUMBER OF FALSE CONTENTION         03141800
*                                    LOCK REQUESTS               @10A   03141900
SMF42GZ8 DS   1FL2                   SMSDIRECTWEIGHT             @10A   03142000
SMF42GZ9 DS   1FL2                   SMSSEQUENTIALWEIGHT         @10A   03142100
*                                                                       03142200
SMF42GBN DS   CL8              IN DFSMS 1.4   WLM SERV CLASS NAME@10A   03142300
SMF42GBO DS   CL8              IN DFSMS 1.4   WLM REPORT CLS NAME@10A   03142400
*                                                                       03142500
SMF42GBP DS   CL16                   RESERVED                    @10A   03142600
*                                                                       03142700
SMF42G1B DS   0CL336                 DIRECT ACCESS SUMMARY SECTION      03142800
*                                                                @10A   03142900
SMF42G1C DS   0CL168                 NORMAL DIRECT ACCESS SUMMARY       03143000
*                                    SECTION                     @10A   03143100
SMF42GIA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03143200
*                                    NUMBER                      @10A   03143300
SMF42GIB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03143400
*                                                                @10A   03143500
SMF42GIC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03143600
*                                    NRI - NO READ INTEGERITY           03143700
*                                                                @10A   03143800
SMF42GID DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03143900
*                                    CONSISTENT READS   @10A            03144000
*                                                                       03144100
SMF42GIE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03144200
*                                                                @10A   03144300
SMF42GIF DS   1FL4                   NUMBER OF BMF REQUESTS             03144400
*                                                                @10A   03144500
SMF42GIG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03144600
*                                                                @10A   03144700
SMF42GIH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03144800
*                                                                @10A   03144900
*                                                                       03145000
SMF42GII DS   1FL4                   NUMBER OF BMF READ HITS            03145100
*                                                                @10A   03145200
SMF42GIJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03145300
*                                                                @10A   03145400
SMF42GIK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03145500
*                                                                @10A   03145600
SMF42GIL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03145700
*                                    THE SYSPLEX CACHE MANAGER   @10A   03145800
*                                                                       03145900
SMF42GIM DS   1FL4                   NUMBER OF CF READ REQUESTS         03146000
*                                                                @10A   03146100
SMF42GIN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03146200
SMF42GIO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03146300
SMF42GIP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03146400
SMF42GIQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03146500
*                                    DFSMS CACHE STRUCTURE       @10A   03146600
*                                                                @10A   03146700
SMF42GIR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03146800
*                                    TO DASD.                    @10A   03146900
SMF42GIS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03147000
*                                    TO DASD.                    @10A   03147100
SMF42GIT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03147200
*                                    DASD FOR THE READ  REQUESTS @10A   03147300
*                                                                @10A   03147400
SMF42GIU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03147500
*                                    DASD FOR THE WRITE REQUESTS @10A   03147600
*                                                                @10A   03147700
SMF42GIV DS   CL16                   RESERVED                           03147800
*                                                                @10A   03147900
SMF42GIW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03148000
*                                    REQUESTS IN THIS                   03148100
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03148200
*                                    IN MILLI- SECONDS)          @21A   03148300
*                                                                       03148400
SMF42GIX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03148500
*                                    THE REQUESTS IN THIS INTERVAL.     03148600
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03148700
*                                                                @10A   03148800
SMF42GIY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03148900
*                                    OF THE REQUESTS IN THIS INTERVAL   03149000
*                                    (TOTAL TIME/NUMBER OF BYTES        03149100
*                                    TRANSFERED/4K)              @10A   03149200
*                                                                       03149300
SMF42GIZ DS   CL8                    RESERVED                    @10A   03149400
SMF42GI7 DS   CL32                   RESERVED                    @10A   03149500
*                                                                       03149600
SMF42G1C_LEN  EQU *-SMF42G1C                                     @10A   03149700
*                                                                       03149800
SMF42G1D DS   0CL168                 RE-DO DURING DIRECT ACCESS         03149900
*                                    SECTION                     @10A   03150000
SMF42GJA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03150100
*                                    NUMBER                      @10A   03150200
SMF42GJB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03150300
*                                                                @10A   03150400
SMF42GJC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03150500
*                                    NRI - NO READ INTEGERITY           03150600
*                                                                @10A   03150700
SMF42GJD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03150800
*                                    CONSISTENT READS   @10A            03150900
*                                                                       03151000
SMF42GJE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03151100
*                                                                @10A   03151200
SMF42GJF DS   1FL4                   NUMBER OF BMF REQUESTS             03151300
*                                                                @10A   03151400
SMF42GJG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03151500
*                                                                @10A   03151600
SMF42GJH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03151700
*                                                                @10A   03151800
*                                                                       03151900
SMF42GJI DS   1FL4                   NUMBER OF BMF READ HITS            03152000
*                                                                @10A   03152100
SMF42GJJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03152200
*                                                                @10A   03152300
SMF42GJK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03152400
*                                                                @10A   03152500
SMF42GJL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03152600
*                                    THE SYSPLEX CACHE MANAGER   @10A   03152700
*                                                                       03152800
SMF42GJM DS   1FL4                   NUMBER OF CF READ REQUESTS         03152900
*                                                                @10A   03153000
SMF42GJN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03153100
SMF42GJO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03153200
SMF42GJP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03153300
SMF42GJQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03153400
*                                    DFSMS CACHE STRUCTURE       @10A   03153500
*                                                                @10A   03153600
SMF42GJR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03153700
*                                    TO DASD.                    @10A   03153800
SMF42GJS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03153900
*                                    TO DASD.                    @10A   03154000
SMF42GJT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03154100
*                                    DASD FOR THE READ  REQUESTS @10A   03154200
*                                                                @10A   03154300
SMF42GJU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03154400
*                                    DASD FOR THE WRITE REQUESTS @10A   03154500
*                                                                @10A   03154600
SMF42GJV DS   CL16                   RESERVED                           03154700
*                                                                @10A   03154800
SMF42GJW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03154900
*                                    REQUESTS IN THIS                   03155000
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03155100
*                                    IN MILLI- SECONDS)          @21A   03155200
*                                                                       03155300
SMF42GJX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03155400
*                                    THE REQUESTS IN THIS INTERVAL.     03155500
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03155600
*                                                                @10A   03155700
SMF42GJY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03155800
*                                    OF THE REQUESTS IN THIS INTERVAL   03155900
*                                    (TOTAL TIME/NUMBER OF BYTES        03156000
*                                    TRANSFERED/4K)              @10A   03156100
*                                                                       03156200
SMF42GJZ DS   CL8                    RESERVED                    @10A   03156300
SMF42GJ7 DS   CL32                   RESERVED                    @10A   03156400
*                                                                       03156500
SMF42G1D_LEN  EQU *-SMF42G1D                                     @10A   03156600
SMF42G1B_LEN  EQU *-SMF42G1B                                     @10A   03156700
*                                                                       03156800
SMF42G1E DS   0CL800                 SEQUENTIAL ACCESS SUMMARY SECTION  03156900
*                                                                @10A   03157000
SMF42G1F DS   0CL168                 NORMAL SEQUENTIAL ACCESS SECTION   03157100
*                                                                @10A   03157200
SMF42GKA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03157300
*                                    NUMBER                      @10A   03157400
SMF42GKB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03157500
*                                                                @10A   03157600
SMF42GKC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03157700
*                                    NRI - NO READ INTEGERITY           03157800
*                                                                @10A   03157900
SMF42GKD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03158000
*                                    CONSISTENT READS   @10A            03158100
*                                                                       03158200
SMF42GKE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03158300
*                                                                @10A   03158400
SMF42GKF DS   1FL4                   NUMBER OF BMF REQUESTS             03158500
*                                                                @10A   03158600
SMF42GKG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03158700
*                                                                @10A   03158800
SMF42GKH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03158900
*                                                                @10A   03159000
*                                                                       03159100
SMF42GKI DS   1FL4                   NUMBER OF BMF READ HITS            03159200
*                                                                @10A   03159300
SMF42GKJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03159400
*                                                                @10A   03159500
SMF42GKK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03159600
*                                                                @10A   03159700
SMF42GKL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03159800
*                                    THE SYSPLEX CACHE MANAGER   @10A   03159900
*                                                                       03160000
SMF42GKM DS   1FL4                   NUMBER OF CF READ REQUESTS         03160100
*                                                                @10A   03160200
SMF42GKN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03160300
SMF42GKO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03160400
SMF42GKP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03160500
SMF42GKQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03160600
*                                    DFSMS CACHE STRUCTURE       @10A   03160700
*                                                                @10A   03160800
SMF42GKR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03160900
*                                    TO DASD.                    @10A   03161000
SMF42GKS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03161100
*                                    TO DASD.                    @10A   03161200
SMF42GKT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03161300
*                                    DASD FOR THE READ  REQUESTS @10A   03161400
*                                                                @10A   03161500
SMF42GKU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03161600
*                                    DASD FOR THE WRITE REQUESTS @10A   03161700
*                                                                @10A   03161800
SMF42GKV DS   CL16                   RESERVED                           03161900
*                                                                @10A   03162000
SMF42GKW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03162100
*                                    REQUESTS IN THIS                   03162200
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03162300
*                                    IN MILLI- SECONDS)          @21A   03162400
*                                                                       03162500
SMF42GKX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03162600
*                                    THE REQUESTS IN THIS INTERVAL.     03162700
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03162800
*                                                                @10A   03162900
SMF42GKY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03163000
*                                    OF THE REQUESTS IN THIS INTERVAL   03163100
*                                    (TOTAL TIME/NUMBER OF BYTES        03163200
*                                    TRANSFERED/4K)              @10A   03163300
*                                                                       03163400
SMF42GKZ DS   CL8                    RESERVED                    @10A   03163500
SMF42GK7 DS   CL32                   RESERVED                    @10A   03163600
*                                                                       03163700
SMF42G1F_LEN  EQU *-SMF42G1F                                     @10A   03163800
*                                                                       03163900
SMF42G1G DS   0CL168                 RE-DO DURING SEQUENTIAL ACCESS     03164000
*                                    SECTION                     @10A   03164100
SMF42GLA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03164200
*                                    NUMBER                      @10A   03164300
SMF42GLB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03164400
*                                                                @10A   03164500
SMF42GLC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03164600
*                                    NRI - NO READ INTEGERITY           03164700
*                                                                @10A   03164800
SMF42GLD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03164900
*                                    CONSISTENT READS   @10A            03165000
*                                                                       03165100
SMF42GLE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03165200
*                                                                @10A   03165300
SMF42GLF DS   1FL4                   NUMBER OF BMF REQUESTS             03165400
*                                                                @10A   03165500
SMF42GLG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03165600
*                                                                @10A   03165700
SMF42GLH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03165800
*                                                                @10A   03165900
*                                                                       03166000
SMF42GLI DS   1FL4                   NUMBER OF BMF READ HITS            03166100
*                                                                @10A   03166200
SMF42GLJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03166300
*                                                                @10A   03166400
SMF42GLK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03166500
*                                                                @10A   03166600
SMF42GLL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03166700
*                                    THE SYSPLEX CACHE MANAGER   @10A   03166800
*                                                                       03166900
SMF42GLM DS   1FL4                   NUMBER OF CF READ REQUESTS         03167000
*                                                                @10A   03167100
SMF42GLN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03167200
SMF42GLO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03167300
SMF42GLP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03167400
SMF42GLQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03167500
*                                    DFSMS CACHE STRUCTURE       @10A   03167600
*                                                                @10A   03167700
SMF42GLR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03167800
*                                    TO DASD.                    @10A   03167900
SMF42GLS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03168000
*                                    TO DASD.                    @10A   03168100
SMF42GLT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03168200
*                                    DASD FOR THE READ  REQUESTS @10A   03168300
*                                                                @10A   03168400
SMF42GLU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03168500
*                                    DASD FOR THE WRITE REQUESTS @10A   03168600
*                                                                @10A   03168700
SMF42GLV DS   CL16                   RESERVED                           03168800
*                                                                @10A   03168900
SMF42GLW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03169000
*                                    REQUESTS IN THIS                   03169100
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03169200
*                                    IN MILLI- SECONDS)          @21A   03169300
*                                                                       03169400
SMF42GLX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03169500
*                                    THE REQUESTS IN THIS INTERVAL.     03169600
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03169700
*                                                                @10A   03169800
SMF42GLY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03169900
*                                    OF THE REQUESTS IN THIS INTERVAL   03170000
*                                    (TOTAL TIME/NUMBER OF BYTES        03170100
*                                    TRANSFERED/4K)              @10A   03170200
*                                                                       03170300
SMF42GLZ DS   CL8                    RESERVED                    @10A   03170400
SMF42GL7 DS   CL32                   RESERVED                    @10A   03170500
*                                                                       03170600
SMF42G1G_LEN  EQU *-SMF42G1G                                     @10A   03170700
*                                                                       03170800
SMF42G1H DS   0CL168                 READ-A-HEAD SEQUENTIAL ACCESS      03170900
*                                    SECTION                     @10A   03171000
SMF42GMA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03171100
*                                    NUMBER                      @10A   03171200
SMF42GMB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03171300
*                                                                @10A   03171400
SMF42GMC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03171500
*                                    NRI - NO READ INTEGERITY           03171600
*                                                                @10A   03171700
SMF42GMD DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03171800
*                                    CONSISTENT READS   @10A            03171900
*                                                                       03172000
SMF42GME DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03172100
*                                                                @10A   03172200
SMF42GMF DS   1FL4                   NUMBER OF BMF REQUESTS             03172300
*                                                                @10A   03172400
SMF42GMG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03172500
*                                                                @10A   03172600
SMF42GMH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03172700
*                                                                @10A   03172800
*                                                                       03172900
SMF42GMI DS   1FL4                   NUMBER OF BMF READ HITS            03173000
*                                                                @10A   03173100
SMF42GMJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03173200
*                                                                @10A   03173300
SMF42GMK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03173400
*                                                                @10A   03173500
SMF42GML DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03173600
*                                    THE SYSPLEX CACHE MANAGER   @10A   03173700
*                                                                       03173800
SMF42GMM DS   1FL4                   NUMBER OF CF READ REQUESTS         03173900
*                                                                @10A   03174000
SMF42GMN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03174100
SMF42GMO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03174200
SMF42GMP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03174300
SMF42GMQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03174400
*                                    DFSMS CACHE STRUCTURE       @10A   03174500
*                                                                @10A   03174600
SMF42GMR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03174700
*                                    TO DASD.                    @10A   03174800
SMF42GMS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03174900
*                                    TO DASD.                    @10A   03175000
SMF42GMT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03175100
*                                    DASD FOR THE READ  REQUESTS @10A   03175200
*                                                                @10A   03175300
SMF42GMU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03175400
*                                    DASD FOR THE WRITE REQUESTS @10A   03175500
*                                                                @10A   03175600
SMF42GMV DS   CL16                   RESERVED                           03175700
*                                                                @10A   03175800
SMF42GMW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03175900
*                                    REQUESTS IN THIS                   03176000
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03176100
*                                    IN MILLI- SECONDS)          @21A   03176200
*                                                                       03176300
SMF42GMX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03176400
*                                    THE REQUESTS IN THIS INTERVAL.     03176500
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03176600
*                                                                @10A   03176700
SMF42GMY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03176800
*                                    OF THE REQUESTS IN THIS INTERVAL   03176900
*                                    (TOTAL TIME/NUMBER OF BYTES        03177000
*                                    TRANSFERED/4K)              @10A   03177100
*                                                                       03177200
SMF42GMZ DS   CL8                    RESERVED                    @10A   03177300
SMF42GM7 DS   CL32                   RESERVED                    @10A   03177400
*                                                                       03177500
SMF42G1H_LEN  EQU *-SMF42G1H                                     @10A   03177600
*                                                                       03177700
SMF42G1I DS   0CL168                 PRE-FORMAT SEQUENTIAL ACCESS       03177800
*                                    SECTION                     @10A   03177900
SMF42GNA DS   1FL4                   COUPLE FACILITY CACHE PARTITION    03178000
*                                    NUMBER                      @10A   03178100
SMF42GNB DS   1FL4                   TOTAL NUMBER OF REQUESTS           03178200
*                                                                @10A   03178300
SMF42GNC DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03178400
*                                    NRI - NO READ INTEGERITY           03178500
*                                                                @10A   03178600
SMF42GND DS   1FL4                   TOTAL NUMBER OF READ REQUESTS -    03178700
*                                    CONSISTENT READS   @10A            03178800
*                                                                       03178900
SMF42GNE DS   1FL4                   TOTAL NUMBER OF WRITE REQUESTS     03179000
*                                                                @10A   03179100
SMF42GNF DS   1FL4                   NUMBER OF BMF REQUESTS             03179200
*                                                                @10A   03179300
SMF42GNG DS   1FL4                   NUMBER OF BMF READ REQUESTS        03179400
*                                                                @10A   03179500
SMF42GNH DS   1FL4                   NUMBER OF BMF WRITE REQUESTS       03179600
*                                                                @10A   03179700
*                                                                       03179800
SMF42GNI DS   1FL4                   NUMBER OF BMF READ HITS            03179900
*                                                                @10A   03180000
SMF42GNJ DS   1FL4                   NUMBER OF BMF VALID READ HITS      03180100
*                                                                @10A   03180200
SMF42GNK DS   1FL4                   NUMBER OF BMF FALSE INVALIDS       03180300
*                                                                @10A   03180400
SMF42GNL DS   1FL4                   NUMBER OF REQUESTS PROCESSED BY    03180500
*                                    THE SYSPLEX CACHE MANAGER   @10A   03180600
*                                                                       03180700
SMF42GNM DS   1FL4                   NUMBER OF CF READ REQUESTS         03180800
*                                                                @10A   03180900
SMF42GNN DS   1FL4                   NUMBER OF CF WRITE REQUESTS @10A   03181000
SMF42GNO DS   1FL4                   NUMBER OF CF READ HITS      @10A   03181100
SMF42GNP DS   1FL4                   NUMBER OF CF READ CASTINS   @10A   03181200
SMF42GNQ DS   2F                     NUMBER OF BYTES XFERRED INTO THE   03181300
*                                    DFSMS CACHE STRUCTURE       @10A   03181400
*                                                                @10A   03181500
SMF42GNR DS   1FL4                   NUMBER OF READ  REAL I/O REQUESTS  03181600
*                                    TO DASD.                    @10A   03181700
SMF42GNS DS   1FL4                   NUMBER OF WRITE REAL I/O REQUESTS  03181800
*                                    TO DASD.                    @10A   03181900
SMF42GNT DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03182000
*                                    DASD FOR THE READ  REQUESTS @10A   03182100
*                                                                @10A   03182200
SMF42GNU DS   2F                     NUMBER OF BYTES TRANSFERRED TO     03182300
*                                    DASD FOR THE WRITE REQUESTS @10A   03182400
*                                                                @10A   03182500
SMF42GNV DS   CL16                   RESERVED                           03182600
*                                                                @10A   03182700
SMF42GNW DS   2F                     TOTAL AMOUNT OF TIME FOR ALL THE   03182800
*                                    REQUESTS IN THIS                   03182900
*                                    INTERVAL. (THE VALUE IS EXPRESSED  03183000
*                                    IN MILLI- SECONDS)          @21A   03183100
*                                                                       03183200
SMF42GNX DS   1FL4                   AVERAGE RESPONSE TIME FOR ALL OF   03183300
*                                    THE REQUESTS IN THIS INTERVAL.     03183400
*                                    (TOTAL TIME/NUMBER OF REQUESTS)    03183500
*                                                                @10A   03183600
SMF42GNY DS   1FL4                   NORMALIZED RESPONSE TIME FOR ALL   03183700
*                                    OF THE REQUESTS IN THIS INTERVAL   03183800
*                                    (TOTAL TIME/NUMBER OF BYTES        03183900
*                                    TRANSFERED/4K)              @10A   03184000
*                                                                       03184100
SMF42GNZ DS   CL8                    RESERVED                    @10A   03184200
SMF42GN7 DS   CL32                   RESERVED                    @10A   03184300
*                                                                       03184400
SMF42G1I_LEN  EQU *-SMF42G1I                                     @10A   03184500
SMF42G1E_LEN  EQU *-SMF42G1E                                     @10A   03184600
*                                                                @10A   03184700
*                                                                @10A   03184800
SMF42GX6 DS   0CL128                 LOCKING STATISTCS SUMMARY   @10A   03184900
SMF42GQA DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03185000
*                                    REQUESTS                    @10A   03185100
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03185200
SMF42GQB DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03185300
*                                    REQUESTS THAT CAUSE TRUE    @10A   03185400
*                                    CONTENTION                  @10A   03185500
SMF42GQC DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03185600
*                                    REQUESTS THAT CAUSE FALSE   @10A   03185700
*                                    CONTENTION                  @10A   03185800
SMF42GQD DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03185900
*                                    RELEASE REQUESTS            @10A   03186000
SMF42GQE DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03186100
*                                    LOCK REQUESTS               @10A   03186200
SMF42GQF DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03186300
*                                    RELEASE LOCK REQUESTS       @10A   03186400
SMF42GQG DS   CL8                    RESERVED                    @10A   03186500
SMF42GQH DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03186600
*                                    CLASS_1 (DIWA) LOCKS        @10A   03186700
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03186800
SMF42GQI DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03186900
*                                    CLASS_1 (DIWA) LOCKS        @10A   03187000
*                                    THAT CAUSE TRUE CONTENTION  @10A   03187100
SMF42GQJ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03187200
*                                    CLASS_1 (DIWA) LOCKS        @10A   03187300
*                                    THAT CAUSE FALSE CONTENTION @10A   03187400
SMF42GQK DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03187500
*                                    CLASS_1 (DIWA) RELEASE      @10A   03187600
*                                    LOCK REQUESTS               @10A   03187700
SMF42GQL DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03187800
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03187900
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03188000
SMF42GQM DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03188100
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03188200
*                                    THAT CAUSE TRUE CONTENTION  @10A   03188300
SMF42GQN DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03188400
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03188500
*                                    THAT CAUSE FALSE CONTENTION @10A   03188600
SMF42GQO DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03188700
*                                    CLASS_2 (UPGRADE) RELEASE   @10A   03188800
*                                    LOCK REQUESTS               @10A   03188900
SMF42GQP DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03189000
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03189100
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03189200
SMF42GQQ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03189300
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03189400
*                                    THAT CAUSE TRUE CONTENTION  @10A   03189500
SMF42GQR DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03189600
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03189700
*                                    THAT CAUSE FALSE CONTENTION @10A   03189800
SMF42GQS DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03189900
*                                    CLASS_3 (PREFORMAT) RELEASE @10A   03190000
*                                    LOCK REQUESTS               @10A   03190100
SMF42GQT DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03190200
*                                    LOCK REQUESTS               @10A   03190300
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03190400
SMF42GQU DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03190500
*                                    THAT CAUSE TRUE CONTENTION  @10A   03190600
SMF42GQV DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03190700
*                                    THAT CAUSE FALSE CONTENTION @10A   03190800
SMF42GQW DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03190900
*                                    RELEASE LOCK REQUESTS       @10A   03191000
SMF42GQX DS   CL32                   RESERVED                    @10A   03191100
*                                                                @10A   03191200
SMF42GX6_LEN  EQU *-SMF42GX6                                     @10A   03191300
*                                                                       03191400
SMF42FX8 DS   0CL64                  DATASET BMF LRU STATS       @21A   03191500
SMF42GRL DS   1FL4                   NUMBER OF REDOS             @21A   03191600
SMF42GRM DS   1FL4                   NUMBER OF RECURSIVE REDOS   @21A   03191700
SMF42GRN DS   1FL4                   NUMBER OF BMF WRITES        @21A   03191800
SMF42GRO DS   1FL4                   NUMBER OF SCM READ REQUESTS @21A   03191900
SMF42GRP DS   1FL4                   NUMBER OF SCM READ REQUESTS @21A   03192000
*                                    THAT ENCOUNTERED CASTOUT    @21A   03192100
*                                    LOCK CONTENTION             @21A   03192200
SMF42GRR DS   1FL4                   REDO PERCENT                @21A   03192300
SMF42GRS DS   1FL4                   RECURSIVE REDO PERCENT      @21A   03192400
SMF42GRT DS   1FL4                   SCM CASTOUT LOCK PERCENT    @21A   03192500
SMF42GRQ DS   CL12                   RESERVED                    @21A   03192600
SMF42GRU DS   CL4                    RESERVED                    @21A   03192700
SMF42GRV DS   CL16                   RESERVED                    @21A   03192800
*                                                                @21A   03192900
SMF42FX8_LEN  EQU *-SMF42FX8                                     @21A   03193000
SMF420GB_LEN  EQU *-SMF420GB                                     @10A   03193100
*                                                                @10A   03193200
*                                                                       03193300
.SKIP_BG ANOP                                                           03193400
         AIF ('&SMF42_0H' EQ 'NO').SKIP_BH                              03193500
*                                                                       03193600
*   -----------------------------------------------------------------   03193700
*    LOCK STRUCTURE ACTIVITY SUMMARY (SMF42 SUBTYPE 17)                 03193800
*   -----------------------------------------------------------------   03193900
*   -----------------------------------------------------------------   03194000
*    LOCK ACTIVITY ACROSS THE SYSPLEX FOR THE LOCK STRUCTURE            03194100
*   -----------------------------------------------------------------   03194200
SMF420HA DSECT ,                                                        03194300
*                                                                       03194400
SMF42HA1 DS   0CL288                 LOCK STRUCTURE SUMMARY             03194500
*                                    SECTION                     @10A   03194600
SMF42HAA DS   1FL4                   INTERVAL LENGTH. THIS IS THE       03194700
*                                    TOTAL TIME OF THE MEASUREMENT      03194800
*                                    PERIOD. (IN SECONDS)        @10A   03194900
SMF42H00 DS   CL12                   RESERVED                    @10A   03195000
*                                                                       03195100
SMF42HAB DS   CL16                   DFP LAF NAME                @10A   03195200
SMF42H01 DS   CL16                   RESERVED                    @10A   03195300
*   -----------------------------------------------------------------   03195400
*    LOCKS PROCESSED DURING VSAM/RLS READ/WRITE REQUESTS                03195500
*   -----------------------------------------------------------------   03195600
SMF42HAC DS   1FL4                   NUMBER OF LOCK REQUESTS            03195700
*                                                                @10A   03195800
*                                    NOW CONTAINS ZEROS          @10A   03195900
SMF42HAD DS   1FL4                   NUMBER OF TRUE CONTENTION          03196000
*                                    LOCK REQUESTS               @10A   03196100
*                                    NOW CONTAINS ZEROS          @10A   03196200
SMF42HAE DS   1FL4                   NUMBER OF FALSE CONTENTION         03196300
*                                    LOCK REQUESTS               @10A   03196400
*                                    NOW CONTAINS ZEROS          @10A   03196500
SMF42HAF DS   1FL4                   RESERVED                           03196600
*                                                                       03196700
SMF42HAG DS   CL32                   RESERVED                           03196800
*   -----------------------------------------------------------------   03196900
*    LOCKS PROCESSED WHICH ARE NOT ASSOCAITED WITH SPECIFIC READ/WRITE/ 03197000
*   -----------------------------------------------------------------   03197100
SMF42HAH DS   1FL4                   NUMBER OF LOCK REQUESTS            03197200
*                                                                @10A   03197300
*                                    NOW CONTAINS ZEROS          @10A   03197400
SMF42HAI DS   1FL4                   NUMBER OF TRUE CONTENTION          03197500
*                                    LOCK REQUESTS               @10A   03197600
*                                    NOW CONTAINS ZEROS          @10A   03197700
SMF42HAJ DS   1FL4                   NUMBER OF FALSE CONTENTION         03197800
*                                    LOCK REQUESTS               @10A   03197900
*                                    NOW CONTAINS ZEROS          @10A   03198000
SMF42HAK DS   1FL4                   RESERVED                           03198100
*                                                                       03198200
SMF42HAL DS   CL32                   RESERVED                           03198300
SMF42HCA DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03198400
*                                    REQUESTS                    @10A   03198500
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03198600
SMF42HCB DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03198700
*                                    REQUESTS THAT CAUSE TRUE    @10A   03198800
*                                    CONTENTION                  @10A   03198900
SMF42HCC DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03199000
*                                    REQUESTS THAT CAUSE FALSE   @10A   03199100
*                                    CONTENTION                  @10A   03199200
SMF42HCD DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03199300
*                                    RELEASE REQUESTS            @10A   03199400
SMF42HCE DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03199500
*                                    LOCK REQUESTS               @10A   03199600
SMF42HCF DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03199700
*                                    RELEASE LOCK REQUESTS       @10A   03199800
SMF42HCG DS   CL8                    RESERVED                    @10A   03199900
SMF42HCH DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03200000
*                                    CLASS_1 (DIWA) LOCKS        @10A   03200100
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03200200
SMF42HCI DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03200300
*                                    CLASS_1 (DIWA) LOCKS        @10A   03200400
*                                    THAT CAUSE TRUE CONTENTION  @10A   03200500
SMF42HCJ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03200600
*                                    CLASS_1 (DIWA) LOCKS        @10A   03200700
*                                    THAT CAUSE FALSE CONTENTION @10A   03200800
SMF42HCK DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03200900
*                                    CLASS_1 (DIWA) RELEASE      @10A   03201000
*                                    LOCK REQUESTS               @10A   03201100
SMF42HCL DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03201200
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03201300
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03201400
SMF42HCM DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03201500
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03201600
*                                    THAT CAUSE TRUE CONTENTION  @10A   03201700
SMF42HCN DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03201800
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03201900
*                                    THAT CAUSE FALSE CONTENTION @10A   03202000
SMF42HCO DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03202100
*                                    CLASS_2 (UPGRADE) RELEASE   @10A   03202200
*                                    LOCK REQUESTS               @10A   03202300
SMF42HCP DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03202400
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03202500
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03202600
SMF42HCQ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03202700
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03202800
*                                    THAT CAUSE TRUE CONTENTION  @10A   03202900
SMF42HCR DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03203000
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03203100
*                                    THAT CAUSE FALSE CONTENTION @10A   03203200
SMF42HCS DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03203300
*                                    CLASS_3 (PREFORMAT) RELEASE @10A   03203400
*                                    LOCK REQUESTS               @10A   03203500
SMF42HCT DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03203600
*                                    LOCK REQUESTS               @10A   03203700
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03203800
SMF42HCU DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03203900
*                                    THAT CAUSE TRUE CONTENTION  @10A   03204000
SMF42HCV DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03204100
*                                    THAT CAUSE FALSE CONTENTION @10A   03204200
SMF42HCW DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03204300
*                                    RELEASE LOCK REQUESTS       @10A   03204400
SMF42HCX DS   1FL4                   NUMBER OF SPECIAL LOCK      @10A   03204500
*                                    REQUESTS                    @10A   03204600
SMF42HCY DS   CL12                   RESERVED                    @10A   03204700
SMF42HCZ DS   CL32                   RESERVED                    @10A   03204800
*                                                                @10A   03204900
SMF420HA_LEN EQU *-SMF420HA                                             03205000
*   -----------------------------------------------------------------   03205100
*    LOCK ACTIVITY ON ONE MVS SYSTEM IN THE SYSPLEX                     03205200
*   -----------------------------------------------------------------   03205300
SMF420HB DSECT ,                                                        03205400
SMF42HA2 DS   0CL288                 MVS SYSTEM/LAF ACTIVITY            03205500
*                                    TOTALS SECTION              @10A   03205600
SMF42HBA DS   1FL4                   INTERVAL LENGTH. THIS IS THE       03205700
*                                    TOTAL TIME OF THE MEASUREMENT      03205800
*                                    PERIOD. (IN SECONDS)        @10A   03205900
SMF42H02 DS   CL12                   RESERVED                    @10A   03206000
*                                                                       03206100
SMF42HBB DS   CL16                   DFP LAF NAME                @10A   03206200
*                                                                       03206300
SMF42HBC DS   CL8                    MVS SYSTEM NAME             @10A   03206400
SMF42H03 DS   CL8                    RESERVED                    @10A   03206500
*   -----------------------------------------------------------------   03206600
*    LOCKS PROCESSED DURING VSAM/RLS READ/WRITE REQUESTS                03206700
*   -----------------------------------------------------------------   03206800
SMF42HBD DS   1FL4                   NUMBER OF LOCK REQUESTS            03206900
*                                    PROCESSED BY THIS MVS SYSTEM@10A   03207000
SMF42HBE DS   1FL4                   NUMBER OF TRUE CONTENTION          03207100
*                                    LOCK REQUESTS               @10A   03207200
SMF42HBF DS   1FL4                   NUMBER OF FALSE CONTENTION         03207300
*                                    LOCK REQUESTS               @10A   03207400
SMF42HBG DS   1FL4                   RESERVED                           03207500
*                                                                       03207600
SMF42HBH DS   CL32                   RESERVED                           03207700
*   -----------------------------------------------------------------   03207800
*    LOCKS PROCESSED WHICH ARE NOT ASSOCAITED WITH SPECIFIC READ/WRITE/ 03207900
*   -----------------------------------------------------------------   03208000
SMF42HBI DS   1FL4                   NUMBER OF LOCK REQUESTS            03208100
*                                    PROCESSED BY THIS MVS SYSTEM@10A   03208200
SMF42HBJ DS   1FL4                   NUMBER OF TRUE CONTENTION          03208300
*                                    LOCK REQUESTS               @10A   03208400
SMF42HBK DS   1FL4                   NUMBER OF FALSE CONTENTION         03208500
*                                    LOCK REQUESTS               @10A   03208600
SMF42HBL DS   1FL4                   RESERVED                           03208700
*                                                                       03208800
SMF42HBM DS   CL32                   RESERVED                    @10A   03208900
*                                                                @10A   03209000
SMF42HDA DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03209100
*                                    REQUESTS                    @10A   03209200
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03209300
SMF42HDB DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03209400
*                                    REQUESTS THAT CAUSE TRUE    @10A   03209500
*                                    CONTENTION                  @10A   03209600
SMF42HDC DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03209700
*                                    REQUESTS THAT CAUSE FALSE   @10A   03209800
*                                    CONTENTION                  @10A   03209900
SMF42HDD DS   1FL4                   NUMBER OF RECORD LOCK       @10A   03210000
*                                    RELEASE REQUESTS            @10A   03210100
SMF42HDE DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03210200
*                                    LOCK REQUESTS               @10A   03210300
SMF42HDF DS   1FL4                   NUMBER OF COMPONENT_1 TYPE  @10A   03210400
*                                    RELEASE LOCK REQUESTS       @10A   03210500
SMF42HDG DS   CL8                    RESERVED                    @10A   03210600
SMF42HDH DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03210700
*                                    CLASS_1 (DIWA) LOCKS        @10A   03210800
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03210900
SMF42HDI DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03211000
*                                    CLASS_1 (DIWA) LOCKS        @10A   03211100
*                                    THAT CAUSE TRUE CONTENTION  @10A   03211200
SMF42HDJ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03211300
*                                    CLASS_1 (DIWA) LOCKS        @10A   03211400
*                                    THAT CAUSE FALSE CONTENTION @10A   03211500
SMF42HDK DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03211600
*                                    CLASS_1 (DIWA) RELEASE      @10A   03211700
*                                    LOCK REQUESTS               @10A   03211800
SMF42HDL DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03211900
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03212000
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03212100
SMF42HDM DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03212200
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03212300
*                                    THAT CAUSE TRUE CONTENTION  @10A   03212400
SMF42HDN DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03212500
*                                    CLASS_2 (UPGRADE) LOCKS     @10A   03212600
*                                    THAT CAUSE FALSE CONTENTION @10A   03212700
SMF42HDO DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03212800
*                                    CLASS_2 (UPGRADE) RELEASE   @10A   03212900
*                                    LOCK REQUESTS               @10A   03213000
SMF42HDP DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03213100
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03213200
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03213300
SMF42HDQ DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03213400
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03213500
*                                    THAT CAUSE TRUE CONTENTION  @10A   03213600
SMF42HDR DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03213700
*                                    CLASS_3 (PREFORMAT) LOCKS   @10A   03213800
*                                    THAT CAUSE FALSE CONTENTION @10A   03213900
SMF42HDS DS   1FL4                   NUMBER OF COMPONENT_1       @10A   03214000
*                                    CLASS_3 (PREFORMAT) RELEASE @10A   03214100
*                                    LOCK REQUESTS               @10A   03214200
SMF42HDT DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03214300
*                                    LOCK REQUESTS               @10A   03214400
*                                    (OBTAIN/ALTER/PROMOTE)      @10A   03214500
SMF42HDU DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03214600
*                                    THAT CAUSE TRUE CONTENTION  @10A   03214700
SMF42HDV DS   1FL4                   NUMBER OF COMPONENT_2 LOCKS @10A   03214800
*                                    THAT CAUSE FALSE CONTENTION @10A   03214900
SMF42HDW DS   1FL4                   NUMBER OF COMPONENT_2       @10A   03215000
*                                    RELEASE LOCK REQUESTS       @10A   03215100
SMF42HDX DS   1FL4                   NUMBER OF SPECIAL LOCK      @10A   03215200
*                                    REQUESTS                    @10A   03215300
SMF42HDY DS   CL12                   RESERVED                    @10A   03215400
SMF42HDZ DS   CL32                   RESERVED                    @10A   03215500
*                                                                @10A   03215600
SMF420HB_LEN EQU *-SMF420HB                                             03215700
.SKIP_BH ANOP                                                           03215800
         AIF ('&SMF42_0I' EQ 'NO').SKIP_BI                              03215900
*                                                                       03216000
*   -----------------------------------------------------------------   03216100
*    COUPLING FACILITY CACHE PARTITION SUMMARY (SMF42 SUBTYPE 18)       03216200
*    DATA FOR THIS PARTITION ACROSS ALL CACHE STRUCTURES.               03216300
*   -----------------------------------------------------------------   03216400
SMF420IA DSECT ,                                                        03216500
SMF42IA1 DS   0D              CF CACHE PARTITION TOTALS                 03216600
*                                    SECTION                     @10A   03216700
SMF42IAC DS   0CL196                 CACHE BUFFER POOLS                 03216800
*                                     THERE ARE 23 POOLS:               03216900
*                                     11 SEQUENTIAL, 11 DIRECT,         03217000
*                                     AND 1 DEFAULT                     03217100
*                                     THERE IS A SEPERATE SECTION FOR   03217200
*                                     EACH PARTITION.  THIS MEANS THAT  03217300
*                                     THERE WILL BE A MINUMUM OF 23     03217400
*                                     TOTALS SECTIONS AND 23 SUMMARY    03217500
*                                     SECTIONS.                         03217600
SMF42IAA DS    1FL4                   INTERVAL LENGTH. THIS IS THE      03217700
*                                     TOTAL TIME OF THE MEASUREMENT     03217800
*                                     PERIOD. (IN SECONDS)        @10A  03217900
SMF42I00 DS    CL12                   RESERVED                    @10A  03218000
*                                                                       03218100
SMF42IAB DS    CL32                   RESERVED                    @10A  03218200
*                                                                       03218300
SMF42IBG DS    CL16                   PARTITION TYPE              @10A  03218400
*                                     'SEQUENTIAL' DATA ONLY      @10A  03218500
*                                     'DIRECT' DATA ONLY          @10A  03218600
*                                     'COMBINED' DATA             @10A  03218700
*                                                                       03218800
SMF42IBH DS    1FL4                   SMS SPECIFIED CACHE WEIGHT  @10A  03218900
SMF42I01 DS    CL12                   PARTITIONNAMEWORD           @10A  03219000
SMF42IAD DS    1FL4                   COUPLE FACILITY CACHE             03219100
*                                     PARTITION NUMBER            @10A  03219200
SMF42IAE DS    1FL4                   STATUS CONDITIONS           @10A  03219300
SMF42IAF DS    1FL4                   READ HIT COUNTER            @10A  03219400
SMF42IAG DS    1FL4                   READ MISS DIRECTORY HIT           03219500
*                                     COUNTER                     @10A  03219600
SMF42IAH DS    1FL4                   READ MISS ASSIGN SUPP             03219700
*                                     COUNTER                     @10A  03219800
SMF42IAI DS    1FL4                   READ MISS, NAME ASSIGNED          03219900
*                                     COUNTER                     @10A  03220000
SMF42IAJ DS    1FL4                   READ MISS TARGET STORAGE          03220100
*                                     CLASS FULL COUNTER          @10A  03220200
SMF42IAK DS    1FL4                   WRITE HIT CHANGE BIT 0            03220300
*                                     COUNTER                     @10A  03220400
SMF42IAL DS    1FL4                   WRITE HIT CHANGE BIT 1            03220500
*                                     COUNTER                     @10A  03220600
SMF42IAM DS    1FL4                   WRITE MISS NOT REGISTERED         03220700
*                                     COUNTER                     @10A  03220800
SMF42IAN DS    1FL4                   WRITE MISS INVALID STATE          03220900
*                                     COUNTER                     @10A  03221000
SMF42IAO DS    1FL4                   WRITE MISS TARGET STORAGE CLASS   03221100
*                                     FULL COUNTER                @10A  03221200
SMF42IAP DS    1FL4                   DIRECTORY ENTRY RECLAIM           03221300
*                                     COUNTER                     @10A  03221400
SMF42IAQ DS    1FL4                   DATA TABLE ENTRY RECLAIM          03221500
*                                     COUNTER                     @10A  03221600
SMF42IAR DS    1FL4                   XI FOR DIRECTORY RECLAIM          03221700
*                                     COUNTER                     @10A  03221800
SMF42IAS DS    1FL4                   XI FOR WRITE COUNTER        @10A  03221900
SMF42IAT DS    1FL4                   XI FOR NAME INVALIDATION          03222000
*                                     COUNTER                     @10A  03222100
SMF42IAU DS    1FL4                   XI FOR COMPLEMENT INVALIDATION    03222200
*                                     COUNTER                     @10A  03222300
SMF42IAV DS    1FL4                   CASTOUT COUNTER             @10A  03222400
SMF42IAW DS    1FL4                   REFERENCE SIGNAL MISS             03222500
*                                     COUNTER                     @10A  03222600
SMF42IAX DS    1FL4                   TARGET STORAGE CLASS FULL         03222700
*                                     COUNTER                     @10A  03222800
SMF42IAY DS    1FL4                   DIRECTORY ENTRY COUNTER     @10A  03222900
SMF42IAZ DS    1FL4                   DATA AREA ELEMENT COUNTER   @10A  03223000
SMF42IBA DS    1FL4                   TOTAL CHANGED COUNTER       @10A  03223100
SMF42IBB DS    1FL4                   DATA AREA COUNTER           @10A  03223200
SMF42IBC DS    1FL4                   COMPLETED REFERENCE LISTS         03223300
*                                     COUNTER                     @10A  03223400
SMF42IBD DS    1FL4                   PARTIALLY COMPLETED REFERENCE     03223500
*                                     LIST COUNTER                @10A  03223600
SMF42IBE DS    1FL4                   XI FOR LCEN REPLACEMENT           03223700
*                                     COUNTER                     @10A  03223800
SMF42IBF DS    1FL4                   WRITE UNCHANGED WITH XI           03223900
SMF420IA_LEN EQU *-SMF420IA                                             03224000
*                                     COUNTER                     @10A  03224100
*   -----------------------------------------------------------------   03224200
*    COUPLING FACILITY CACHE PARTITION SUMMARY (SMF42 SUBTYPE 18)       03224300
*    DATA FOR THIS PARTITION FOR A SINGLE CACHE STRUCTURE               03224400
*   -----------------------------------------------------------------   03224500
SMF420IC DSECT ,                                                        03224600
SMF42IC1 DS    0D                     CF CACHE PARTITION SUMMARY        03224700
*                                     SECTION                     @10A  03224800
SMF42ICC DS    0CL196                 CACHE BUFFER POOLS                03224900
*                                     THERE ARE 23 POOLS:               03225000
*                                     11 SEQUENTIAL, 11 DIRECT,         03225100
*                                     AND 1 DEFAULT                     03225200
*                                     THERE IS A SEPERATE SECTION FOR   03225300
*                                     EACH PARTITION.  THIS MEANS THAT  03225400
*                                     THERE WILL BE A MINUMUM OF 23     03225500
*                                     TOTALS SECTIONS AND 23 SUMMARY    03225600
*                                     SECTIONS.                         03225700
SMF42ICA DS    1FL4                   INTERVAL LENGTH. THIS IS THE      03225800
*                                     TOTAL TIME OF THE MEASUREMENT     03225900
*                                     PERIOD. (IN SECONDS)        @10A  03226000
SMF42I02 DS    CL12                   RESERVED                    @10A  03226100
*                                                                       03226200
SMF42I04 DS    1FL2                   RESERVED                    @10A  03226300
SMF42ICB DS    CL30                   CACHE STRUCTURE NAME        @10A  03226400
*                                                                       03226500
SMF42IDG DS    CL16                   PARTITION TYPE              @10A  03226600
*                                     'SEQUENTIAL' DATA ONLY      @10A  03226700
*                                     'DIRECT' DATA ONLY          @10A  03226800
*                                     'COMBINED' DATA             @10A  03226900
*                                                                       03227000
SMF42IDH DS    1F                     SMS SPECIFIED CACHE WEIGHT  @10A  03227100
SMF42I03 DS    CL12                   RESERVED                    @10A  03227200
*                                                                       03227300
SMF42ICD DS    1FL4                   COUPLE FACILITY CACHE             03227400
*                                     PARTITION NUMBER            @10A  03227500
SMF42ICE DS    1FL4                   STATUS CONDITIONS           @10A  03227600
SMF42ICF DS    1FL4                   READ HIT COUNTER            @10A  03227700
SMF42ICG DS    1FL4                   READ MISS DIRECTORY HIT           03227800
*                                     COUNTER                     @10A  03227900
SMF42ICH DS    1FL4                   READ MISS ASSIGN SUPP             03228000
*                                     COUNTER                     @10A  03228100
SMF42ICI DS    1FL4                   READ MISS, NAME ASSIGNED          03228200
*                                     COUNTER                     @10A  03228300
SMF42ICJ DS    1FL4                   READ MISS TARGET STORAGE          03228400
*                                     CLASS FULL COUNTER          @10A  03228500
SMF42ICK DS    1FL4                   WRITE HIT CHANGE BIT 0            03228600
*                                     COUNTER                     @10A  03228700
SMF42ICL DS    1FL4                   WRITE HIT CHANGE BIT 1            03228800
*                                     COUNTER                     @10A  03228900
SMF42ICM DS    1FL4                   WRITE MISS NOT REGISTERED         03229000
*                                     COUNTER                     @10A  03229100
SMF42ICN DS    1FL4                   WRITE MISS INVALID STATE          03229200
*                                     COUNTER                     @10A  03229300
SMF42ICO DS    1FL4                   WRITE MISS TARGET STORAGE CLASS   03229400
*                                     FULL COUNTER                @10A  03229500
SMF42ICP DS    1FL4                   DIRECTORY ENTRY RECLAIM           03229600
*                                     COUNTER                     @10A  03229700
SMF42ICQ DS    1FL4                   DATA TABLE ENTRY RECLAIM          03229800
*                                     COUNTER                     @10A  03229900
SMF42ICR DS    1FL4                   XI FOR DIRECTORY RECLAIM          03230000
*                                     COUNTER                     @10A  03230100
SMF42ICS DS    1FL4                   XI FOR WRITE COUNTER        @10A  03230200
SMF42ICT DS    1FL4                   XI FOR NAME INVALIDATION          03230300
*                                     COUNTER                     @10A  03230400
SMF42ICU DS    1FL4                   XI FOR COMPLEMENT INVALIDATION    03230500
*                                     COUNTER                     @10A  03230600
SMF42ICV DS    1FL4                   CASTOUT COUNTER             @10A  03230700
SMF42ICW DS    1FL4                   REFERENCE SIGNAL MISS             03230800
*                                     COUNTER                     @10A  03230900
SMF42ICX DS    1FL4                   TARGET STORAGE CLASS FULL         03231000
*                                     COUNTER                     @10A  03231100
SMF42ICY DS    1FL4                   DIRECTORY ENTRY COUNTER     @10A  03231200
SMF42ICZ DS    1FL4                   DATA AREA ELEMENT COUNTER   @10A  03231300
SMF42IDA DS    1FL4                   TOTAL CHANGED COUNTER       @10A  03231400
SMF42IDB DS    1FL4                   DATA AREA COUNTER           @10A  03231500
SMF42IDC DS    1FL4                   COMPLETED REFERENCE LISTS         03231600
*                                     COUNTER                     @10A  03231700
SMF42IDD DS    1FL4                   PARTIALLY COMPLETED REFERENCE     03231800
*                                     LIST COUNTER                @10A  03231900
SMF42IDE DS    1FL4                   XI FOR LCEN REPLACEMENT           03232000
*                                     COUNTER                     @10A  03232100
SMF42IDF DS    1FL4                   WRITE UNCHANGED WITH XI           03232200
*                                     COUNTER                     @10A  03232300
*                                                                       03232400
SMF420IC_LEN EQU *-SMF420IC                                             03232500
* -------------------------------------------------------------------   03232600
*    Coupling Facility Cache Partition Summary (SMF42 subtype 18)       03232700
*    Directory/Element ratio data for this cache structure              03232800
* -------------------------------------------------------------------   03232900
SMF420IE DSECT ,                                                 @11A   03233000
SMF42IE1 DS    0CL80                 CF Cache Directory/element  @11A   03233100
*                                    ratio section               @11A   03233200
SMF42IEA DS    1FL4                  Interval length             @11A   03233300
SMF42I06 DS    CL12                  reserved                    @11A   03233400
SMF42I07 DS    CL2                   reserved                    @11A   03233500
SMF42IEB DS    CL30                  DFSMS cache structure name  @11A   03233600
SMF42IEC DS    1FL4                  Number of times the         @11A   03233700
*                                    directory portion of the    @11A   03233800
*                                    dir/ele ratio changes       @11A   03233900
SMF42IED DS    1FL4                  Number of times the         @11A   03234000
*                                    Element   portion of the    @11A   03234100
*                                    dir/ele ratio changes       @11A   03234200
SMF42IEE DS    1FL4                  Low  ratio value in this    @11A   03234300
*                                    interval - directory part   @11A   03234400
SMF42IEF DS    1FL4                  Low  ratio value in this    @11A   03234500
*                                    interval - Element   part   @11A   03234600
SMF42IEG DS    1FL4                  High ratio value in this    @11A   03234700
*                                    interval - directory part   @11A   03234800
SMF42IEH DS    1FL4                  High ratio value in this    @11A   03234900
*                                    interval - Element   part   @11A   03235000
SMF42IEI DS    1FL4                  Current ratio value in this @11A   03235100
*                                    interval - directory part   @11A   03235200
SMF42IEJ DS    1FL4                  Current ratio value in this @11A   03235300
*                                    interval - element part     @11A   03235400
SMF420IE_LEN EQU *-SMF420IE          Length of section           @11A   03235500
*                                                                       03235600
.SKIP_BI ANOP                                                           03235700
         AIF ('&SMF42_0J' EQ 'NO').SKIP_BJ                              03235800
* -------------------------------------------------------------- @11A   03235900
*    Coupling Facility Local Buffer Manager (SMF42 subtype 19)   @11A   03236000
*    Local Buffer Manager LRU Statistics Summary. sysplex totals @11A   03236100
* -------------------------------------------------------------- @11A   03236200
SMF420JA DSECT ,                                                 @11A   03236300
SMF42JA1 DS    0D                       sysplex totals section   @11A   03236400
*                                                                @11A   03236500
SMF42JAC DS    0CL1384                                           @11A   03236600
*                                                                @11A   03236700
SMF42JNA DS    1FL4                Interval length. This is the  @11A   03236800
*                                  total time of the measurement @11A   03236900
*                                  period. (in seconds) total    @11A   03237000
SMF42J00 DS    CL12                reserved                      @11A   03237100
*                                                                @11A   03237200
SMF42JNB DS    CL16                reserved                      @11A   03237300
SMF42JND DS    CL8                 Reserved                      @11A   03237400
*                                                                @11A   03237500
SMF42JNE DS    CL8                                               @11A   03237600
*                                  Average Cpu time for all      @11A   03237700
*                                  systems in the sysplex.  This @11A   03237800
*                                  is the amount of CPU time     @11A   03237900
*                                  (on average) that each system @11A   03238000
*                                  consumed while processing the @11A   03238100
*                                  Local Buffer Manager LRU      @11A   03238200
*                                  alogrithm.                    @11A   03238300
*                                                                @11A   03238400
SMF42JNF DS    CL8                                               @11A   03238500
*                                  Total CPU time for this       @11A   03238600
*                                  record (in milli-seconds)     @11A   03238700
*                                  (sysplex totals)              @11A   03238800
*                                                                @11A   03238900
SMF42JN0 DS    CL4                 Reserved                      @21A   03239000
SMF42JN7 DS    1FL4                Total number of write         @21A   03239100
*                                  requests                      @21A   03239200
*                                  (sysplex totals)              @21A   03239300
SMF42JNG DS    1FL4                Average number of buffer      @11A   03239400
*                                  manager LRU intervals         @11A   03239500
*                                  processed during this period. @11A   03239600
*                                  (sysplex totals)              @11A   03239700
*                                                                @11A   03239800
SMF42JNH DS    1FL4                Total number of buffer        @11A   03239900
*                                  manager LRU intervals         @11A   03240000
*                                  processed during this period. @11A   03240100
*                                  (across the sysplex)          @11A   03240200
*                                                                @11A   03240300
SMF42JNI DS    1FL4                Average                       @11A   03240400
*                                  Number of buffer manager      @11A   03240500
*                                  LRU intervals processed       @11A   03240600
*                                  where BMF was over the goal   @11A   03240700
*                                  and normal algorithms were    @11A   03240800
*                                  bypassed to reclaim buffers.  @11A   03240900
*                                                                @11A   03241000
SMF42JNJ DS    1FL4                Total                         @11A   03241100
*                                  Number of buffer manager      @11A   03241200
*                                  LRU intervals processed       @11A   03241300
*                                  where BMF was over the goal   @11A   03241400
*                                  and normal algorithms were    @11A   03241500
*                                  bypassed to reclaim buffers.  @11A   03241600
*                                  (across the sysplex)          @11A   03241700
*                                                                @11A   03241800
SMF42JNK DS    1FL4                Avg. number of times that     @11A   03241900
*                                  BMF was called on this        @11A   03242000
*                                  interval.                     @11A   03242100
*                                                                @11A   03242200
SMF42JNL DS    1FL4                Total number of times that    @11A   03242300
*                                  BMF was called on this        @11A   03242400
*                                  interval(across the sysplex)  @11A   03242500
*                                                                @11A   03242600
SMF42JNM DS    1FL4                Average number of BMF         @11A   03242700
*                                  hits during this interval.    @11A   03242800
*                                  (sysplex totals)              @11A   03242900
*                                                                @11A   03243000
SMF42JNN DS    1FL4                Total number of BMF           @11A   03243100
*                                  hits during this interval.    @11A   03243200
*                                  (sysplex totals)              @11A   03243300
*                                                                @11A   03243400
SMF42JNO DS    1FL4                Buffer manager number of      @11A   03243500
*                                  'hits' Current percentage     @11A   03243600
*                                  during this interval.         @11A   03243700
*                                  (sysplex totals)              @11A   03243800
*                                                                @11A   03243900
SMF42JNP DS    1FL4                Buffer manager number of      @11A   03244000
*                                  'hits' low percentage during  @11A   03244100
*                                  this interval.                @11A   03244200
*                                  (sysplex totals)              @11A   03244300
*                                                                @11A   03244400
SMF42JNQ DS    1FL4                Buffer manager number of      @11A   03244500
*                                  'hits' high percentage during @11A   03244600
*                                  this interval.                @11A   03244700
*                                  (sysplex totals)              @11A   03244800
*                                                                @11A   03244900
SMF42JNR DS    1FL4                Buffer manager average        @11A   03245000
*                                  'hits' during this interval.  @11A   03245100
*                                  (across the sysplex)          @11A   03245200
*                                                                @11A   03245300
SMF42JNS DS    1FL4                Avg. Sysplex Cache manager    @11A   03245400
*                                  number of 'hits' during this  @11A   03245500
*                                  interval.                     @11A   03245600
*                                  (Across the sysplex)          @11A   03245700
*                                                                @11A   03245800
SMF42JNT DS    1FL4                Tot Sysplex Cache manager     @11A   03245900
*                                  number of 'hits' during this  @11A   03246000
*                                  interval.                     @11A   03246100
*                                  (Across the sysplex)          @11A   03246200
*                                                                @11A   03246300
SMF42JNU DS    1FL4                Sysplex Cache manager hits    @11A   03246400
*                                  current percentage            @11A   03246500
*                                  during this interval          @11A   03246600
*                                  (across the sysplex)          @11A   03246700
*                                                                @11A   03246800
SMF42JNV DS    1FL4                Sysplex Cache manager hits    @11A   03246900
*                                  low percentage during this    @11A   03247000
*                                  interval.                     @11A   03247100
*                                  (across the sysplex)          @11A   03247200
*                                                                @11A   03247300
SMF42JNW DS    1FL4                Sysplex Cache manager hits    @11A   03247400
*                                  high percentage during this   @11A   03247500
*                                  interval.                     @11A   03247600
*                                  (across the sysplex)          @11A   03247700
SMF42JNX DS    1FL4                Sysplex Cache manager hits    @11A   03247800
*                                  average percentage during     @11A   03247900
*                                  this interval.                @11A   03248000
*                                  (across the sysplex)          @11A   03248100
*                                                                @11A   03248200
SMF42JNY DS    1FL4                Avg. DASD number of 'hits'    @11A   03248300
*                                  during this interval          @11A   03248400
*                                  (across the sysplex)          @11A   03248500
*                                                                @11A   03248600
SMF42JNZ DS    1FL4                Tot DASD number of 'hits'     @11A   03248700
*                                  during this interval          @11A   03248800
*                                  (across the sysplex)          @11A   03248900
*                                                                @11A   03249000
SMF42JOA DS    1FL4                DASD 'hits' current           @11A   03249100
*                                  percentage during this        @11A   03249200
*                                  interval (across the sysplex) @11A   03249300
*                                                                @11A   03249400
SMF42JOB DS    1FL4                DASD 'hits' low percentage    @11A   03249500
*                                  during this interval          @11A   03249600
*                                  (across the sysplex)          @11A   03249700
*                                                                @11A   03249800
SMF42JOC DS    1FL4                DASD 'hits' high percentage   @11A   03249900
*                                  during this interval          @11A   03250000
*                                  (across the sysplex)          @11A   03250100
*                                                                @11A   03250200
SMF42JOD DS    1FL4                Average                       @11A   03250300
*                                  DASD average 'hits' during    @11A   03250400
*                                  this interval                 @11A   03250500
*                                  (across the sysplex           @11A   03250600
*                                                                @11A   03250700
SMF42JOE DS    CL512               Sysplex average               @11A   03250800
*                                  Buffer pool count array.      @11A   03250900
*                                  This is a 16 entry array with @11A   03251000
*                                  each entry 32 bytes long.  The@11A   03251100
*                                  first entry is for the 2K     @11A   03251200
*                                  storage pool, the second entry@11A   03251300
*                                  is for the 4K storage pool.   @11A   03251400
*                                  The format is described below.@11A   03251500
*                                  (sysplex totals)              @11A   03251600
*                                  Each Entry is mapped by       @11A   03251700
*                                  dsect SMF420BJ                @11A   03251800
*                                                                @11A   03251900
SMF42JRI DS    CL512               Sysplex wide totals -         @11A   03252000
*                                  Buffer pool count array.      @11A   03252100
*                                  This is a 16 entry array with @11A   03252200
*                                  each entry 32 bytes long.  The@11A   03252300
*                                  first entry is for the 2K     @11A   03252400
*                                  storage pool, the second entry@11A   03252500
*                                  is for the 4K storage pool.   @11A   03252600
*                                  The format is described below.@11A   03252700
*                                  (sysplex totals)              @11A   03252800
*                                  Each Entry is mapped by       @11A   03252900
*                                  DSECT SMF420JC                @11A   03253000
*                                  Average                       @11A   03253100
SMF42JON DS    1FL4                Buffer size goal (in mega-    @11A   03253200
*                                  bytes) - low value            @11A   03253300
*                                  (sysplex totals)              @11A   03253400
*                                                                @11A   03253500
*                                  Total                         @11A   03253600
SMF42JOO DS    1FL4                Buffer size goal (in mega-    @11A   03253700
*                                  bytes) - low value            @11A   03253800
*                                  (sysplex totals)              @11A   03253900
*                                                                @11A   03254000
*                                  Average                       @11A   03254100
SMF42JOP DS    1FL4                Buffer size goal (in mega-    @11A   03254200
*                                  bytes) - high value.          @11A   03254300
*                                  (sysplex totals)              @11A   03254400
*                                                                @11A   03254500
*                                  Total                         @11A   03254600
SMF42JOQ DS    1FL4                Buffer size goal (in mega-    @11A   03254700
*                                  bytes) - high value.          @11A   03254800
*                                  (sysplex totals)              @11A   03254900
*                                                                @11A   03255000
*                                  Average                       @11A   03255100
SMF42JOR DS    1FL4                Buffer size goal (in mega-    @11A   03255200
*                                  bytes) - current value.       @11A   03255300
*                                  (sysplex totals)              @11A   03255400
*                                                                @11A   03255500
*                                  Total                         @11A   03255600
SMF42JOS DS    1FL4                Buffer size goal (in mega-    @11A   03255700
*                                  bytes) - current value.       @11A   03255800
*                                  (sysplex totals)              @11A   03255900
*                                                                @11A   03256000
*                                  Total                         @11A   03256100
SMF42JOT DS    1FL4                Buffer size goal (in mega-    @11A   03256200
*                                  bytes) - Average value.       @11A   03256300
*                                  (sysplex totals)              @11A   03256400
*                                                                @11A   03256500
SMF42JOU DS    1FL4                reserved                      @11A   03256600
*                                                                @11A   03256700
*                                  Average                       @11A   03256800
SMF42JOV DS    1FL4                Buffer size calculated        @11A   03256900
*                                  (in megabytes) - low value    @11A   03257000
*                                  (across the sysplex)          @11A   03257100
*                                                                @11A   03257200
*                                  Total                         @11A   03257300
SMF42JOW DS    1FL4                Buffer size calculated        @11A   03257400
*                                  (in megabytes) - low value    @11A   03257500
*                                  (across the sysplex)          @11A   03257600
*                                                                @11A   03257700
*                                  Average                       @11A   03257800
SMF42JOX DS    1FL4                Buffer size calculated        @11A   03257900
*                                  (in megabytes) - high value   @11A   03258000
*                                  (across the sysplex)          @11A   03258100
*                                                                @11A   03258200
*                                  Total                         @11A   03258300
SMF42JOY DS    1FL4                Buffer size calculated        @11A   03258400
*                                  (in megabytes) - high value   @11A   03258500
*                                  (across the sysplex)          @11A   03258600
*                                                                @11A   03258700
*                                  Average                       @11A   03258800
SMF42JOZ DS    1FL4                Buffer size calculated        @11A   03258900
*                                  (in megabytes) - current value@11A   03259000
*                                  (sysplex totals)              @11A   03259100
*                                                                @11A   03259200
*                                  Total                         @11A   03259300
SMF42JRA DS    1FL4                Buffer size calculated        @11A   03259400
*                                  (in megabytes) - current value@11A   03259500
*                                  (sysplex totals)              @11A   03259600
*                                                                @11A   03259700
*                                  Total                         @11A   03259800
SMF42JRB DS    1FL4                Buffer size calculated        @11A   03259900
*                                  (in megabytes) - Average value@11A   03260000
*                                  (sysplex totals)              @11A   03260100
*                                                                @11A   03260200
SMF42JRC DS    1FL4                Reserved                      @11A   03260300
*                                                                @11A   03260400
SMF42JRD DS    CL8                 Reserved                      @11A   03260500
*                                                                @11A   03260600
*                                  Average                       @11A   03260700
SMF42JRE DS    CL64                Calculated megabytes          @11A   03260800
*                                  distribution array.  this is a@11A   03260900
*                                  16 entry array which contains @11A   03261000
*                                  the number of times the cal-  @11A   03261100
*                                  culated value occurred within @11A   03261200
*                                  a 100mb span.  Entry 1= 0-99m,@11A   03261300
*                                  entry 2 = 100-100m... entry   @11A   03261400
*                                  (across the sysplex)          @11A   03261500
*                                  The entry is mapped by        @11A   03261600
*                                  DSECT SMF420JD                @11A   03261700
*                                                                @11A   03261800
*                                  Total                         @11A   03261900
SMF42JRG DS    CL64                Calculated megabytes          @11A   03262000
*                                  distribution array.  this is a@11A   03262100
*                                  16 entry array which contains @11A   03262200
*                                  the number of times the cal-  @11A   03262300
*                                  culated value occurred within @11A   03262400
*                                  a 100mb span.  Entry 1= 0-99m,@11A   03262500
*                                  entry 2 = 100-100m... entry   @11A   03262600
*                                  (across the sysplex)          @11A   03262700
*                                  The entry is mapped by        @11A   03262800
*                                  DSECT SMF420JE                @11A   03262900
*                                                                @11A   03263000
*                                                                @11A   03263100
*                                                                @11A   03263200
* -------------------------------------------------------------- @11A   03263300
*  Coupling Facility Local Buffer Manager (SMF42 subtype 19)     @11A   03263400
*  Local Buffer Manager LRU Statistics Summary. single system    @11A   03263500
* -------------------------------------------------------------- @11A   03263600
SMF420PA DSECT ,                                                 @11A   03263700
SMF42PA1 DS    0D                                                @11A   03263800
*                                                                @11A   03263900
SMF42PAC DS    0CL800                                            @11A   03264000
*                                                                @11A   03264100
SMF42JPA DS    1FL4                Interval length. This is the  @11A   03264200
*                                  total time of the measurement @11A   03264300
*                                  period. (in seconds) total    @11A   03264400
*                                                                @11A   03264500
SMF42J01 DS    CL12                Reserved                      @11A   03264600
*                                                                @11A   03264700
SMF42JPB DS    CL8                 MVS system name.              @11A   03264800
SMF42JPC DS    CL8                 Reserved                      @11A   03264900
SMF42JPD DS    CL8                 Reserved                      @11A   03265000
*                                                                @11A   03265100
SMF42JPE DS    CL8                 Average CPU time spent by     @11A   03265200
*                                  BMF LRU processing during     @11A   03265300
*                                  each cycle (in milli-seconds) @11A   03265400
*                                                                @11A   03265500
SMF42JPF DS    CL8                 Total CPU time for this       @11A   03265600
*                                  record (in milli-seconds)     @11A   03265700
*                                                                @11A   03265800
SMF42JP1 DS    CL12                Reserved                      @21A   03265900
SMF42JP6 DS    1FL4                Total number of write         @21A   03266000
*                                  requests                      @21A   03266100
SMF42JPG DS    1FL4                Number of buffer manager      @11A   03266200
*                                  LRU intervals processed       @11A   03266300
*                                  during this period.           @11A   03266400
*                                                                @11A   03266500
SMF42JPH DS    1FL4                Number of buffer manager      @11A   03266600
*                                  LRU intervals processed       @11A   03266700
*                                  where BMF was over the goal   @11A   03266800
*                                  and normal algorithms were    @11A   03266900
*                                  bypassed to reclaim buffers.  @11A   03267000
*                                                                @11A   03267100
SMF42JPI DS    1FL4                Total number of times that BMF@11A   03267200
*                                  was called in this interval   @11A   03267300
*                                                                @11A   03267400
SMF42JP2 DS    1FL4                Number of buffer manager      @21A   03267500
*                                  LRU intervals processed       @21A   03267600
*                                  where BMF was over the goal,  @21A   03267700
*                                  accelerated the aging, but    @21A   03267800
*                                  did not go into panic mode.   @21A   03267900
SMF42JPJ DS    1FL4                Buffer manager number of      @11A   03268000
*                                  hits during this interval.    @11A   03268100
SMF42JPK DS    1FL4                Buffer manager number of      @11A   03268200
*                                  'hits' current percentage     @11A   03268300
*                                  during this interval. Value   @11A   03268400
*                                  for the last LRU cycle before @11A   03268500
*                                  the SMF record was processed  @11A   03268600
*                                                                @11A   03268700
SMF42JPL DS    1FL4                Buffer manager number of      @11A   03268800
*                                  'hits' low percentage during  @11A   03268900
*                                  this interval.                @11A   03269000
*                                                                @11A   03269100
SMF42JPM DS    1FL4                Buffer manager number of      @11A   03269200
*                                  'hits' high percentage during @11A   03269300
*                                  this interval.                @11A   03269400
*                                                                @11A   03269500
SMF42JPN DS    1FL4                Buffer manager average        @11A   03269600
*                                  'hits' during this interval.  @11A   03269700
*                                                                @11A   03269800
SMF42JP3 DS    CL12                Reserved                      @11A   03269900
*                                                                @11A   03270000
SMF42JPO DS    1FL4                Sysplex Cache manager         @11A   03270100
*                                  number of 'hits' during this  @11A   03270200
*                                  interval.                     @11A   03270300
*                                                                @11A   03270400
SMF42JPP DS    1FL4                Sysplex cache manager num     @11A   03270500
*                                  of 'hits' current percentage  @11A   03270600
*                                  during this interval. Value   @11A   03270700
*                                  for the last LRU cycle before @11A   03270800
*                                  the SMF record was processed  @11A   03270900
*                                                                @11A   03271000
SMF42JPQ DS    1FL4                Sysplex Cache manager hits    @11A   03271100
*                                  low percentage during this    @11A   03271200
*                                  interval.                     @11A   03271300
*                                                                @11A   03271400
SMF42JPR DS    1FL4                Sysplex Cache manager hits    @11A   03271500
*                                  high percentage during this   @11A   03271600
*                                  interval.                     @11A   03271700
*                                                                @11A   03271800
SMF42JPS DS    1FL4                Sysplex Cache manager hits    @11A   03271900
*                                  average percentage during this@11A   03272000
*                                  interval.                     @11A   03272100
*                                                                @11A   03272200
SMF42JP4 DS    CL12                Reserved                      @11A   03272300
*                                                                @11A   03272400
SMF42JPT DS    1FL4                DASD number of 'hits'         @11A   03272500
*                                  during this interval          @11A   03272600
SMF42JPU DS    1FL4                DASD number                   @11A   03272700
*                                  of 'hits' current percentage  @11A   03272800
*                                  during this interval. Value   @11A   03272900
*                                  for the last LRU cycle before @11A   03273000
*                                  the SMF record was processed  @11A   03273100
*                                                                @11A   03273200
SMF42JPV DS    1FL4                DASD 'hits' low percentage    @11A   03273300
*                                  during this interval          @11A   03273400
*                                                                @11A   03273500
SMF42JPW DS    1FL4                DASD 'hits' high percentage   @11A   03273600
*                                  during this interval          @11A   03273700
*                                                                @11A   03273800
SMF42JPX DS    1FL4                DASD average 'hits' during    @11A   03273900
*                                  this interval                 @11A   03274000
*                                                                @11A   03274100
SMF42JP5 DS    CL12                Reserved                      @11A   03274200
*                                                                @11A   03274300
SMF42JPY DS    CL512               Buffer pool count array.      @11A   03274400
*                                  This is a 16 entry array with @11A   03274500
*                                  each entry 16 bytes long.  The@11A   03274600
*                                  first entry is for the 2K     @11A   03274700
*                                  storage pool, the second entry@11A   03274800
*                                  is for the 4K storage pool.   @11A   03274900
*                                  The format is described below.@11A   03275000
*                                  The entry is mapped by        @11A   03275100
*                                  DSECT SMF420JF                @11A   03275200
*                                                                @11A   03275300
SMF42JQG DS    1FL4                Buffer size goal (in mega-    @11A   03275400
*                                  bytes) - low value            @11A   03275500
*                                                                @11A   03275600
SMF42JQH DS    1FL4                Buffer size goal (in mega-    @11A   03275700
*                                  bytes) - high value.          @11A   03275800
*                                                                @11A   03275900
SMF42JQI DS    1FL4                Buffer size goal (in mega-    @11A   03276000
*                                  bytes) - current value.       @11A   03276100
*                                                                @11A   03276200
SMF42JQJ DS    1FL4                Buffer size goal (in mega-    @11A   03276300
*                                  bytes) - average value.       @11A   03276400
*                                                                @11A   03276500
SMF42JQK DS    1FL4                Buffer size calculated        @11A   03276600
*                                  (in megabytes) - low value    @11A   03276700
*                                                                @11A   03276800
SMF42JQL DS    1FL4                Buffer size calculated        @11A   03276900
*                                  (in megabytes) - high value   @11A   03277000
*                                                                @11A   03277100
SMF42JQM DS    1FL4                Buffer size calculated        @11A   03277200
*                                  (in megabytes) - current value@11A   03277300
*                                                                @11A   03277400
SMF42JQN DS    1FL4                Buffer size calculated        @11A   03277500
*                                  (in megabytes) - average value@11A   03277600
*                                                                @11A   03277700
SMF42JQ3 DS    CL8                 Reserved                      @11A   03277800
*                                                                @11A   03277900
SMF42JQO DS    CL64                Calculated megabytes          @11A   03278000
*                                  distribution array.  this is a@11A   03278100
*                                  16 entry array which contains @11A   03278200
*                                  the number of times the cal-  @11A   03278300
*                                  culated value occurred within @11A   03278400
*                                  a 100mb span.  Entry 1= 0-99m,@11A   03278500
*                                  entry 2 = 100-199m... entry   @11A   03278600
*                                  The entry is mapped by        @11A   03278700
*                                  DSECT SMF420JG                @11A   03278800
*                                                                @11A   03278900
*                                                                @11A   03279000
*                                                                @11A   03279100
*                                                                @11A   03279200
*                                                                @11A   03279300
*                                                                @11A   03279400
* -------------------------------------------------------------- @11A   03279500
* Start  --- Buffer Pool Count Array Element -  AVERAGE          @11A   03279600
* -------------------------------------------------------------- @11A   03279700
SMF420JB DSECT ,                    entry mapping                @11A   03279800
*                                   Average                      @11A   03279900
SMF42JOF DS    1FL4                 Low value of the number of   @11A   03280000
*                                   BMF buffers for this pool    @11A   03280100
*                                   during this interval.        @11A   03280200
*                                   (sysplex totals)             @11A   03280300
*                                                                @11A   03280400
*                                   Average                      @11A   03280500
SMF42JOG DS    1FL4                 High value of the number of  @11A   03280600
*                                   BMF buffers for this pool    @11A   03280700
*                                   during this interval.        @11A   03280800
*                                   (sysplex totals)             @11A   03280900
*                                                                @11A   03281000
*                                   Average current              @11A   03281100
SMF42JOH DS    1FL4                 value of the number of       @11A   03281200
*                                   BMF buffers for this pool    @11A   03281300
*                                   during this interval.        @11A   03281400
*                                   (sysplex totals)             @11A   03281500
*                                                                @11A   03281600
SMF42JOI DS    1FL4                 reserved                     @11A   03281700
*                                                                @11A   03281800
*                                   Average                      @11A   03281900
SMF42JOJ DS    1FL4                 Low value of the number of   @11A   03282000
*                                   extents for this pool        @11A   03282100
*                                   during this interval.        @11A   03282200
*                                   (sysplex totals)             @11A   03282300
*                                                                @11A   03282400
*                                   Average                      @11A   03282500
SMF42JOK DS    1FL4                 High value of the number of  @11A   03282600
*                                   extents for this pool        @11A   03282700
*                                   during this interval.        @11A   03282800
*                                   (sysplex totals)             @11A   03282900
*                                                                @11A   03283000
*                                   Average current              @11A   03283100
SMF42JOL DS    1FL4                 value of the number of       @11A   03283200
*                                   extents for this pool        @11A   03283300
*                                   during this interval.        @11A   03283400
*                                   (sysplex totals)             @11A   03283500
*                                                                @11A   03283600
SMF42JOM DS    1FL4                 reserved                     @11A   03283700
SMF420JB_LEN EQU *-SMF420JB         length of single entry       @11A   03283800
* -------------------------------------------------------------- @11A   03283900
* End    --- Buffer Pool Count Array Element -  AVERAGE          @11A   03284000
* -------------------------------------------------------------- @11A   03284100
* -------------------------------------------------------------- @11A   03284200
* Start  --- Buffer Pool Count Array Element - sysplex totals    @11A   03284300
* -------------------------------------------------------------- @11A   03284400
SMF420JC DSECT ,                    entry mapping                @11A   03284500
*                                   sysplex wide totals          @11A   03284600
*                                                                @11A   03284700
SMF42JRJ DS    1FL4                 Low value of the number of   @11A   03284800
*                                   BMF buffers for this pool    @11A   03284900
*                                   during this interval.        @11A   03285000
*                                   (sysplex totals)             @11A   03285100
*                                                                @11A   03285200
SMF42JRK DS    1FL4                 High value of the number of  @11A   03285300
*                                   BMF buffers for this pool    @11A   03285400
*                                   during this interval.        @11A   03285500
*                                   (sysplex totals)             @11A   03285600
*                                                                @11A   03285700
SMF42JRL DS    1FL4                 value of the number of       @11A   03285800
*                                   BMF buffers for this pool    @11A   03285900
*                                   during this interval.        @11A   03286000
*                                   (sysplex totals)             @11A   03286100
*                                                                @11A   03286200
SMF42JRM DS    1FL4                 reserved                     @11A   03286300
*                                                                @11A   03286400
SMF42JRN DS    1FL4                 Low value of the number of   @11A   03286500
*                                   extents for this pool        @11A   03286600
*                                   during this interval.        @11A   03286700
*                                   (sysplex totals)             @11A   03286800
*                                                                @11A   03286900
SMF42JRO DS    1FL4                 High value of the number of  @11A   03287000
*                                   extents for this pool        @11A   03287100
*                                   during this interval.        @11A   03287200
*                                   (sysplex totals)             @11A   03287300
*                                                                @11A   03287400
*                                   current                      @11A   03287500
SMF42JRP DS    1FL4                 value of the number of       @11A   03287600
*                                   extents for this pool        @11A   03287700
*                                   during this interval.        @11A   03287800
*                                   (sysplex totals)             @11A   03287900
*                                                                @11A   03288000
SMF42JRQ DS    1FL4                 reserved                     @11A   03288100
*                                                                @11A   03288200
* -------------------------------------------------------------- @11A   03288300
* End    --- Buffer Pool Count Array Element - sysplex totals    @11A   03288400
* -------------------------------------------------------------- @11A   03288500
* -------------------------------------------------------------- @11A   03288600
* Start --  Buffer Banager Calculated Distribution Array - Avg.  @11A   03288700
* -------------------------------------------------------------- @11A   03288800
SMF420JD DSECT ,                                                 @11A   03288900
*                                   Average                      @11A   03289000
SMF42JRF DS    1FL4                 Number of times caculated    @11A   03289100
*                                   value was within this range  @11A   03289200
*                                   (across the sysplex)         @11A   03289300
*                                                                @11A   03289400
* -------------------------------------------------------------- @11A   03289500
* End   --  Buffer Banager Calculated Distribution Array - Avg.  @11A   03289600
* -------------------------------------------------------------- @11A   03289700
* -------------------------------------------------------------- @11A   03289800
* Start --  Buffer Banager Calculated Distribution Array - Total @11A   03289900
* -------------------------------------------------------------- @11A   03290000
SMF420JE DSECT ,                                                 @11A   03290100
*                                   Total                        @11A   03290200
SMF42JRH DS    1FL4                 Number of times caculated    @11A   03290300
*                                   value was within this range  @11A   03290400
*                                   (across the sysplex)         @11A   03290500
*                                                                @11A   03290600
* -------------------------------------------------------------- @11A   03290700
* End   --  Buffer Banager Calculated Distribution Array - Total @11A   03290800
* -------------------------------------------------------------- @11A   03290900
*                                                                  @21A 03291000
* Additional statistics for RMF                                    @21A 03291100
*                                                                  @21A 03291200
SMF42JTA DS    1FL4                  Avg. number of scm read reques@21A 03291300
*                                    which encountered castout lock@21A 03291400
*                                    contention during this interva@21A 03291500
*                                    (across the sysplex)          @21A 03291600
SMF42JTB DS    1FL4                  Total number of scm read reque@21A 03291700
*                                    which encountercastout lock   @21A 03291800
*                                    contention during this interva@21A 03291900
*                                    (across the sysplex)          @21A 03292000
SMF42JTC DS    1FL4                  Avg. number of scm read reques@21A 03292100
*                                    during this interval          @21A 03292200
*                                    (across the sysplex)          @21A 03292300
SMF42JTD DS    1FL4                  Total number of scm read reque@21A 03292400
*                                    during this interval          @21A 03292500
*                                    (across the sysplex)          @21A 03292600
SMF42JTE DS    1FL4                  SCM read requests which       @21A 03292700
*                                    encountered castout lock      @21A 03292800
*                                    contention current percentage @21A 03292900
*                                    during this interval          @21A 03293000
*                                    (across the sysplex)          @21A 03293100
SMF42JTF DS    1FL4                  SCM read requests which       @21A 03293200
*                                    encountered castout lock      @21A 03293300
*                                    contention low percentage duri@21A 03293400
*                                    this interval                 @21A 03293500
*                                    (across the sysplex)          @21A 03293600
SMF42JTG DS    1FL4                  SCM read requests which       @21A 03293700
*                                    encountered castout lock      @21A 03293800
*                                    contention high percentage    @21A 03293900
*                                    during this interval          @21A 03294000
*                                    (across the sysplex)          @21A 03294100
SMF42JTH DS    1FL4                  SCM read requests which       @21A 03294200
*                                    encountered castout lock      @21A 03294300
*                                    contention average percentage @21A 03294400
*                                    during this interval          @21A 03294500
*                                    (across the sysplex)          @21A 03294600
SMF42JTI DS    1FL4                  Avg. number of redos          @21A 03294700
*                                    during this interval          @21A 03294800
*                                    (across the sysplex)          @21A 03294900
SMF42JTJ DS    1FL4                  Total number of redos         @21A 03295000
*                                    during this interval          @21A 03295100
*                                    (across the sysplex)          @21A 03295200
SMF42JTK DS    1FL4                  Avg. number of recursive redos@21A 03295300
*                                    during this interval          @21A 03295400
*                                    (across the sysplex)          @21A 03295500
SMF42JTL DS    1FL4                  Total number of recursive redo@21A 03295600
*                                    during this interval          @21A 03295700
*                                    (across the sysplex)          @21A 03295800
SMF42JTM DS    1FL4                  Redos current percentage      @21A 03295900
*                                    during this interval          @21A 03296000
*                                    (across the sysplex)          @21A 03296100
SMF42JTN DS    1FL4                  Redos low percentage          @21A 03296200
*                                    during this interval          @21A 03296300
*                                    (across the sysplex)          @21A 03296400
SMF42JTO DS    1FL4                  Redos high percentage         @21A 03296500
*                                    during this interval          @21A 03296600
*                                    (across the sysplex)          @21A 03296700
SMF42JTP DS    1FL4                  Redos average percentage      @21A 03296800
*                                    during this interval          @21A 03296900
*                                    (across the sysplex)          @21A 03297000
SMF42JTQ DS    1FL4                  Recursive Redos               @21A 03297100
*                                    current percentage during     @21A 03297200
*                                    this interval                 @21A 03297300
*                                    (across the sysplex)          @21A 03297400
SMF42JTR DS    1FL4                  Recursive Redos               @21A 03297500
*                                    low percentage during         @21A 03297600
*                                    this interval                 @21A 03297700
*                                    (across the sysplex)          @21A 03297800
SMF42JTS DS    1FL4                  Recursive Redos               @21A 03297900
*                                    high percentage during        @21A 03298000
*                                    this interval                 @21A 03298100
*                                    (across the sysplex)          @21A 03298200
SMF42JTT DS    1FL4                  Recursive Redos               @21A 03298300
*                                    average percentage during     @21A 03298400
*                                    this interval                 @21A 03298500
*                                    (across the sysplex)          @21A 03298600
SMF42JUA DS    1FL4                  Avg. number of                @21A 03298700
*                                    Number of buffer manager      @21A 03298800
*                                    LRU intervals processed       @21A 03298900
*                                    where BMF was over the goal   @21A 03299000
*                                    accelerated the aging, but    @21A 03299100
*                                    did not go into panic mode.   @21A 03299200
*                                    (across the sysplex)          @21A 03299300
SMF42JUB DS    1FL4                  Total number of               @21A 03299400
*                                    Number of buffer manager      @21A 03299500
*                                    LRU intervals processed       @21A 03299600
*                                    where BMF was over the goal   @21A 03299700
*                                    accelerated the aging, but    @21A 03299800
*                                    did not go into panic mode.   @21A 03299900
*                                    (across the sysplex)          @21A 03300000
* -------------------------------------------------------------- @11A   03300100
* Start  --- Buffer Pool Count Array Element - single system     @11A   03300200
* -------------------------------------------------------------- @11A   03300300
SMF420JF DSECT ,                    entry mapping                @11A   03300400
*                                   single system                @11A   03300500
*                                                                @11A   03300600
SMF42JPZ DS    1FL4                 Low value of the number of   @11A   03300700
*                                   BMF buffers for this pool    @11A   03300800
*                                   during this interval.        @11A   03300900
*                                                                @11A   03301000
SMF42JQA DS    1FL4                 High value of the number of  @11A   03301100
*                                   BMF buffers for this pool    @11A   03301200
*                                   during this interval.        @11A   03301300
*                                                                @11A   03301400
*                                   current                      @11A   03301500
SMF42JQB DS    1FL4                 value of the number of       @11A   03301600
*                                   BMF buffers for this pool    @11A   03301700
*                                   during this interval.        @11A   03301800
*                                                                @11A   03301900
SMF42JQ6 DS    1FL4                 reserved                     @11A   03302000
*                                                                @11A   03302100
SMF42JQC DS    1FL4                 Low value of the number of   @11A   03302200
*                                   extents for this pool        @11A   03302300
*                                   during this interval.        @11A   03302400
*                                                                @11A   03302500
SMF42JQD DS    1FL4                 High value of the number of  @11A   03302600
*                                   extents for this pool        @11A   03302700
*                                   during this interval.        @11A   03302800
*                                                                @11A   03302900
*                                   current                      @11A   03303000
SMF42JQF DS    1FL4                 value of the number of       @11A   03303100
*                                   extents for this pool        @11A   03303200
*                                   during this interval.        @11A   03303300
*                                                                @11A   03303400
SMF42JQ7 DS    1FL4                 reserved                     @11A   03303500
*                                                                @11A   03303600
* -------------------------------------------------------------- @11A   03303700
* End    --- Buffer Pool Count Array Element - single system     @11A   03303800
* -------------------------------------------------------------- @11A   03303900
* -------------------------------------------------------------- @11A   03304000
* Start --  Buffer Banager Calculated Distribution Array         @11A   03304100
* -------------------------------------------------------------- @11A   03304200
SMF420JG DSECT ,                                                 @11A   03304300
*                                   SINGLE SYSTEM                @11A   03304400
SMF42JQP DS    1FL4                 Number of times caculated    @11A   03304500
*                                   value was within this range  @11A   03304600
*                                   (across the sysplex)         @11A   03304700
*                                                                @11A   03304800
* -------------------------------------------------------------- @11A   03304900
* End   --  Buffer Banager Calculated Distribution Array         @11A   03305000
* -------------------------------------------------------------- @11A   03305100
*                                                                  @21A 03305200
* Additional statistics for RMF                                    @21A 03305300
*                                                                  @21A 03305400
SMF42JSA DS    1FL4                 Number of SCM Read requests    @21A 03305500
*                                   which encountered castout      @21A 03305600
*                                   contention during this interva @21A 03305700
SMF42JSB DS    1FL4                 Number of SCM Read requests    @21A 03305800
*                                   during this interval           @21A 03305900
SMF42JSC DS    1FL4                 Current percentage of SCM read @21A 03306000
*                                   request which encountered cast @21A 03306100
*                                   contention during this interva @21A 03306200
*                                   Value for the last LRU cycle   @21A 03306300
*                                   before the SMF record was      @21A 03306400
*                                   processed                      @21A 03306500
SMF42JSD DS    1FL4                 Low percentage during this     @21A 03306600
*                                   interval for SMF42JSC          @21A 03306700
SMF42JSE DS    1FL4                 High percentage during this    @21A 03306800
*                                   interval for SMF42JSC          @21A 03306900
SMF42JSF DS    1FL4                 Average percentage during this @21A 03307000
*                                   interval for SMF42JSC          @21A 03307100
SMF42JSG DS    1FL4                 Number of Redos during         @21A 03307200
*                                   this interval.                 @21A 03307300
SMF42JSH DS    1FL4                 Current percentage of Redos    @21A 03307400
*                                   during this interval.          @21A 03307500
*                                   Value for the last LRU cycle   @21A 03307600
*                                   before the SMF record was      @21A 03307700
*                                   processed                      @21A 03307800
SMF42JSI DS    1FL4                 Low percentage during this     @21A 03307900
*                                   interval for SMF42JSH          @21A 03308000
SMF42JSJ DS    1FL4                 High percentage during this    @21A 03308100
*                                   interval for SMF42JSH          @21A 03308200
SMF42JSK DS    1FL4                 Average percentage during      @21A 03308300
*                                   this interval for SMF42JSH     @21A 03308400
SMF42JSL DS    1FL4                 Number of Recursive Redos duri @21A 03308500
*                                   this interval                  @21A 03308600
SMF42JSM DS    1FL4                 Current percentage of          @21A 03308700
*                                   Recursive Redos during this    @21A 03308800
*                                   interval. Value for the last L @21A 03308900
*                                   cycle before the SMF record wa @21A 03309000
*                                   processed                      @21A 03309100
SMF42JSN DS    1FL4                 Low percentage during this     @21A 03309200
*                                   interval for SMF42JSM          @21A 03309300
SMF42JSO DS    1FL4                 High percentage during this    @21A 03309400
*                                   interval for SMF42JSM          @21A 03309500
SMF42JSP DS    1FL4                 Average percentage during this @21A 03309600
*                                   interval for SMF42JSM          @21A 03309700
*                                                                @11A   03309800
*                                                                @11A   03309900
*                                                                @11A   03310000
*                                                                @11A   03310100
.SKIP_BJ ANOP                                                           03310200
         MEND                    */                                     03310300
* %IGWSMF_2:;                                                           03310400
*/* Start of PL/X Source                                             */ 03310500
*                                                            /* 5@02D*/ 03310600
* %IF SMF42_B = 'NO' %THEN %SMF42BAS = '';                              03310700
*   %ELSE %IF SMF42_B = 'N' %THEN %SMF42BAS = '';                       03310800
*     %ELSE %SMF42BAS = 'BASED';                                        03310900
*                                                                       03311000
*@SPACE;                                                                03311100
* /*-----------------------------------------------------------------*/ 03325000
* /*  Header for SMF record type 42                                  */ 03350000
* /*-----------------------------------------------------------------*/ 03375000
* DECLARE                                                               03400000
*   1 SMF42 SMF42BAS BDY(DWORD),    /* SMF42BAS is the basing expr.  */ 03450000
*     2 SMF42RCL BINARY(16),        /* Record Length                 */ 03500000
*     2 SMF42SGD BINARY(16),        /* Segment Descriptor (RDW) --   */ 03550000
*                                   /* 0 if record is not spanned    */ 03600000
*     2 SMF42FLG BIT(8),            /* System indicator flags        */ 03650000
*       3 SMF42FSI  BIT(1),         /* When set=subsystem id follows */ 03700000
*                                   /* system id                     */ 03750000
*       3 SMF42FSU  BIT(1),         /* When set = subtypes are used  */ 03800000
*       3 *         BIT(3),         /* Reserved                      */ 03850000
*       3 SMF42FXA  BIT(1),         /* When set = MVS/XA (SMF enters)*/ 03900000
*       3 SMF42FS2  BIT(1),         /* When set = VS2 (SMF enters)   */ 03950000
*       3 SMF42FS1  BIT(1),         /* When set = VS1 (SMF enters)   */ 04000000
*     2 SMF42RTY BINARY(8),         /* Record type: 42 (X'2A')       */ 04050000
*     2 SMF42TME BINARY(32) BDY(WORD,3), /* Record written time      */ 04100000
*                                   /* (entered by SMF)              */ 04150000
*     2 SMF42DTE CHAR(4),           /* Record written date (by SMF)  */ 04200000
*     2 SMF42SID CHAR(4),           /* System identification (by SMF)*/ 04250000
*     2 SMF42SSI CHAR(4),           /* Subsystem Id                  */ 04300000
*     2 SMF42STY BINARY(16),        /* Record subtype                */ 04350000
*     2 SMF42NT  BINARY(16),        /* Number of triplets (optional) */ 04400000
*     2 *        BINARY(16),        /* Reserved           (optional) */ 04450000
* /*-----------------------------------------------------------------*/ 04462500
* /* Product section triplet                                         */ 04475000
* /*-----------------------------------------------------------------*/ 04487500
*     2 SMF42OPS BINARY(32),        /* Offset to product section     */ 04500000
*     2 SMF42LPS BINARY(16),        /* Length of product section     */ 04550000
*     2 SMF42NPS BINARY(16),        /* Number of product sections    */ 04600000
*@SPACE;                                                                04608300
* /*-----------------------------------------------------------------*/ 04616600
* /* Header must end on word boundary                                */ 04624900
* /*-----------------------------------------------------------------*/ 04633200
*     2 SMF42END CHAR(0);           /* 1st data section triplet  @02A*/ 04641500
* /*-----------------------------------------------------------------*/ 04649800
* /* SMF42 subtype header sections.                                  */ 04658100
* /*                                                                 */ 04666400
* /* Only include the subtype triplet(s) for the selected subtype.   */ 04674700
* /*-----------------------------------------------------------------*/ 04683000
* %IF SMF42_01 ^= 'YES' %THEN %GOTO SKIP_HEADER_01;                     04691300
*@SPACE;                                                                04699600
* /*-----------------------------------------------------------------*/ 04707900
* /* SMF42 subtype 1 header section (BMF Statistics)                 */ 04716200
* /*-----------------------------------------------------------------*/ 04724500
* DECLARE                                                               04732800
*   1 SMF42S1 BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD), /*@02C*/ 04741100
*       3 SMF42BMO  BINARY(32),     /* Offset to BMF totals section  */ 04750000
*       3 SMF42BML  BINARY(16),     /* Length of BMF totals section  */ 04800000
*       3 SMF42BMN  BINARY(16),     /* Number of BMF totals sections */ 04850000
*       3 SMF42SCO  BINARY(32),     /* Offset to storage class          04900000
*                                      summary section               */ 04950000
*       3 SMF42SCL  BINARY(16),     /* Length of storage class          05000000
*                                      summary section               */ 05050000
*       3 SMF42SCN  BINARY(16);     /* Number of storage class          05100000
*                                      summary sections              */ 05150000
*                                                                       05160700
* DECLARE                                                               05171400
*   SMF42L1 CONSTANT(LENGTH(SMF42S1)); /* Length of subtype 1 header    05182100
*                                          section               @02A*/ 05192800
*                                                                       05203500
* %SKIP_HEADER_01: ;                                                    05214200
* %IF SMF42_02 ^= 'YES'%THEN %GOTO SKIP_HEADER_02;                      05224900
*@SPACE;                                                                05235600
* /*-----------------------------------------------------------------*/ 05246300
* /* SMF42 subtype 2 header section (Cache summary)                  */ 05257000
* /*-----------------------------------------------------------------*/ 05267700
* DECLARE                                                               05278400
*   1 SMF42S2 BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD), /*@02C*/ 05289100
*       3 SMF42CUO  BINARY(32),     /* Offset to control unit cache     05300000
*                                      section                       */ 05350000
*       3 SMF42CUL  BINARY(16),     /* Length of control unit cache     05400000
*                                      section                       */ 05450000
*       3 SMF42CUN  BINARY(16),     /* Number of control unit cache     05500000
*                                      sections                      */ 05550000
*       3 SMF42VLO  BINARY(32),     /* Offset to volume section      */ 05600000
*       3 SMF42VLL  BINARY(16),     /* Length of volume section      */ 05650000
*       3 SMF42VLN  BINARY(16);     /* Number of volume sections     */ 05663300
*                                                                       05676600
* DECLARE                                                               05689900
*   SMF42L2 CONSTANT(LENGTH(SMF42S2)); /* Length of subtype 2 header    05703200
*                                          section               @02A*/ 05716500
*                                                                       05729800
* %SKIP_HEADER_02: ;                                                    05743100
* %IF SMF42_03 ^= 'YES' %THEN %GOTO SKIP_HEADER_03;                     05756400
*@SPACE;                                                                05769700
* /*-----------------------------------------------------------------*/ 05783000
* /* SMF42 subtype 3 header section (Config. audit)                  */ 05796300
* /*-----------------------------------------------------------------*/ 05809600
* DECLARE                                                               05822900
*   1 SMF42S3 BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD), /*@02C*/ 05836200
*       3 SMF42EAO  BINARY(32),     /* Offset to event audit section */ 05850000
*       3 SMF42EAL  BINARY(16),     /* Length of event audit section */ 05900000
*       3 SMF42EAN  BINARY(16);     /* Number of event audit sections*/ 05912500
*                                                                       05925000
* DECLARE                                                               05937500
*   SMF42L3 CONSTANT(LENGTH(SMF42S3)); /* Length of subtype 3 header    05950000
*                                          section               @02A*/ 05962500
*                                                                       05975000
* %SKIP_HEADER_03: ;                                                    05979200
* %IF SMF42_04 ^= 'YES' %THEN %GOTO SKIP_HEADER_04;                     05983400
*@SPACE;                                                                05987700
* /*-----------------------------------------------------------------*/ 05987800
* /* SMF42 subtype 4 header section (System Data Mover statistics)   */ 05987900
* /*                (Concurrent Copy Session (CC) statistics or      */ 05988000
* /*                Extended Physical Data Set (EXT) statistics) @04A*/ 05988100
* /*-----------------------------------------------------------------*/ 05988200
* DECLARE                                                  /*@OY66824*/ 05988300
*   1 SMF42S4 BASED(ADDR(SMF42) + OFFSET(SMF42END))       /* @OY66824*/ 05988400
*             BDY(WORD),        /*                           @OY66824*/ 05988500
*       3 SMF42CCO  BINARY(32), /* Offset to CC statistics   @OY66824*/ 05988600
*       3 SMF42CCL  BINARY(16), /* Length of CC statistics   @OY66824*/ 05988700
*       3 SMF42CCN  BINARY(16), /* Number of CC sessions     @OY66824*/ 05988800
*       3 SMF42EXO  BINARY(32), /* Offset to EXT statistics  @OY66824*/ 05988900
*       3 SMF42EXL  BINARY(16), /* Length of EXT statistics  @OY66824*/ 05989000
*       3 SMF42EXN  BINARY(16); /* Number of EXT sessions    @OY66824*/ 05989100
* DECLARE                                                               05989200
*   SMF42L4  CONSTANT(LENGTH(SMF42S4));  /* Length of subtype 4 header  05989300
*                                          section           @OY66824*/ 05989400
* %SKIP_HEADER_04: ;                                                    05989500
* %IF SMF42_05 ^= 'YES' %THEN %GOTO SKIP_HEADER_05;                     05989600
*@SPACE;                                                                05989700
* /*-----------------------------------------------------------------*/ 05989800
* /* SMF42 subtype 5 header section                                  */ 05989900
* /*  (Storage class response time statistics)                       */ 05990000
* /*-----------------------------------------------------------------*/ 05990100
* DECLARE                                                   /*   @L1A*/ 05990200
*   1 SMF42S5 BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD), /*@L1A*/ 05990300
*       3 SMF42SRO  BINARY(32), /* Offset to storage class              05990400
*                                  response time section         @L1A*/ 05990500
*       3 SMF42SRL  BINARY(16), /* Length of storage class              05990800
*                                  response time section         @L1A*/ 05991100
*       3 SMF42SRN  BINARY(16), /* Number of storage class              05991200
*                                  response time sections        @P1C*/ 05991300
*       3 SMF42VHO  BINARY(32), /* Offset to volume statistics   @P1A*/ 05991400
*       3 SMF42VHL  BINARY(16), /* Length of volume statistics   @P1A*/ 05991500
*       3 SMF42VHN  BINARY(16); /* Number of volume sections     @P1A*/ 05991600
* DECLARE                                                               05992000
*   SMF42L5 CONSTANT(LENGTH(SMF42S5)); /* Length of subtype 5 header    05992300
*                                          section               @L1A*/ 05992600
* %SKIP_HEADER_05: ;                                                    05992900
* %IF SMF42_06 ^= 'YES' %THEN %GOTO SKIP_HEADER_06;                     05993200
*@SPACE;                                                                05993500
* /*-----------------------------------------------------------------*/ 05993800
* /* SMF42 subtype 6 header section                                  */ 05994100
* /*  (job/dataset statistics)                                       */ 05994400
* /*-----------------------------------------------------------------*/ 05994700
* DECLARE                                                   /*   @L1A*/ 05995000
*   1 SMF42S6 BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD), /*@L1A*/ 05995300
*       3 SMF42JHO  BINARY(32), /* Offset to job header section  @L1A*/ 05995600
*       3 SMF42JHL  BINARY(16), /* Length of job header section  @L1A*/ 05995900
*       3 SMF42JHN  BINARY(16); /* Number of job header sections @L1A*/ 05996200
* DECLARE                                                               05996500
*   SMF42L6 CONSTANT(LENGTH(SMF42S6)); /* Length of subtype 6 header    05996800
*                                          section               @L1A*/ 05997100
* %SKIP_HEADER_06: ;                                                    05997400
*                                                                       05997500
* %IF SMF42_09 ^= 'YES' %THEN %GOTO SKIP_HEADER_09;          /*  @P1A*/ 05997600
*@SPACE;                                                     /*  @P1A*/ 05997700
* /*------------------------------------------------------------ @P1A*/ 05997800
* /* SMF42 subtype 9 header section (X37 ABEND)                  @P1A*/ 05997900
* /*------------------------------------------------------------ @P1A*/ 05998000
* DECLARE                                                    /*  @P1A*/ 05998100
*   1 SMF42S9 BASED (ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD),/*@P1A*/ 05998200
*       3 SMF42ABO   BINARY(32),   /* Offset to X37 abend sec    @P1A*/ 05998300
*       3 SMF42ABL   BINARY(16),   /* Length of X37 abend sec    @P1A*/ 05998400
*       3 SMF42ABN   BINARY(16),   /* Number of X37 abend        @P1A   05998500
*                                     sections (always 1)        @P1A*/ 05998600
*       3 SMF42SMO   BINARY(32),   /* Offset to SMS  data sec    @P1A*/ 05998700
*       3 SMF42SML   BINARY(16),   /* Length of SMS data sec     @P1A*/ 05998800
*       3 SMF42SMN   BINARY(16);   /* Number of SMS data sections@P1A   05998900
*                                     (always 1)                 @P1A*/ 05999000
*                                                                       05999100
* DECLARE                                                     /* @P1A*/ 05999200
*   SMF42L9 CONSTANT(LENGTH(SMF42S9)); /* Len of sutbtype 9             05999300
*                                           header section       @P1A*/ 05999400
* %SKIP_HEADER_09: ;                                         /*  @P1A*/ 05999500
* /*-----------------------------------------------------------------*/ 05999600
* /*                                                             @xxA*/ 05999700
* /* SMF42 subtype 10 is not used at this time                   @P1C*/ 05999800
* /*                                                             @xxA*/ 06001000
* /* To used one of these sub-types contact                      @xxA*/ 06002100
* /* Marc Duquette (VSAM/RLS development)                        @xxA*/ 06003200
* /*                                                             @xxA*/ 06004300
* /*-----------------------------------------------------------------*/ 06005400
* %IF SMF42_0B ^= 'YES' %THEN %GOTO SKIP_HEADER_0B;                     06006300
*@SPACE;                                                                06007200
* /*-----------------------------------------------------------------*/ 06007300
* /* SMF42 subtype 11 header section (Extended Remote Copy (XRC)     */ 06007400
* /*                                  Session Statistics)        @07A*/ 06007500
* /*-----------------------------------------------------------------*/ 06007600
* DECLARE                                                  /*    @07A*/ 06007700
*   1 SMF42SB BASED(ADDR(SMF42) + OFFSET(SMF42END))       /*     @07A*/ 06007800
*             BDY(WORD),        /*                               @07A*/ 06007900
*       3 SMF42XRO  BINARY(32), /* Offset to XRC statistics      @07A*/ 06008000
*       3 SMF42XRL  BINARY(16), /* Length of XRC statistics      @07A*/ 06008100
*       3 SMF42XRN  BINARY(16); /* Number of XRC sessions        @07A*/ 06008200
* DECLARE                                                               06008300
*   SMF42LB CONSTANT(LENGTH(SMF42SB));   /* Length of subtype 11 header 06008400
*                                          section               @07A*/ 06008500
* %SKIP_HEADER_0B: ;                                                    06008600
* /*-----------------------------------------------------------------*/ 06008700
* /*                                                             @xxA*/ 06008800
* /* SMF42 subtypes 12, 13, and 14 are not used at this time     @xxA*/ 06008900
* /*                                                             @xxA*/ 06009000
* /* To used one of these sub-types contact                      @xxA*/ 06009100
* /* Marc Duquette (VSAM/RLS development)                        @xxA*/ 06009200
* /*                                                             @xxA*/ 06009300
* /*-----------------------------------------------------------------*/ 06009400
* %IF SMF42_0F ^= 'YES' %THEN %GOTO SKIP_HEADER_0F;                     06009500
*@SPACE;                                                                06009600
* /*-----------------------------------------------------------------*/ 06009700
* /* SMF42 subtype 15 header section                                 */ 06009800
* /*  (Storage class response time summary)                          */ 06009900
* /*-----------------------------------------------------------------*/ 06010000
* DECLARE                                                   /*   @10A*/ 06010100
*   1 SMF42SF BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD), /*@10A*/ 06010200
*       3 SMF42FC1  BINARY(32), /* Offset to SYSPLEX wide SC            06010300
*                                  summary data section          @10A*/ 06010400
*       3 SMF42FC2  BINARY(16), /* Length of SYSPLEX wide SC            06010500
*                                  summary data section          @10A*/ 06010600
*       3 SMF42FC3  BINARY(16), /* Number of SYSPLEX wide SC            06010700
*                                  summary data sections         @10A*/ 06010800
*       3 SMF42FC4  BINARY(32), /* Offset to SC/CF/SYS                  06010900
*                                  summary section               @10A*/ 06011000
*       3 SMF42FC5  BINARY(16), /* Length of SC/CF/SYS                  06011100
*                                  summary section               @10A*/ 06011200
*       3 SMF42FC6  BINARY(16); /* Number of SC/CF/SYS                  06011300
*                                  summary sections              @10A*/ 06011400
* DECLARE                                                               06011500
*   SMF42LF CONSTANT(LENGTH(SMF42SF)); /* Length of subtype 15 header   06011600
*                                          section               @10A*/ 06011700
* %SKIP_HEADER_0F: ;                                                    06011800
* %IF SMF42_0G ^= 'YES' %THEN %GOTO SKIP_HEADER_0G;                     06011900
*@SPACE;                                                                06012000
* /*-----------------------------------------------------------------*/ 06012100
* /* SMF42 subtype 16 header section                                 */ 06012200
* /*  (Dataset response time summary)                                */ 06012300
* /*-----------------------------------------------------------------*/ 06012400
* DECLARE                                                   /*   @10A*/ 06012500
*   1 SMF42SG BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD), /*@10A*/ 06012600
*       3 SMF42GD1  BINARY(32), /* Offset to SYSPLEX wide data set      06012700
*                                  summary data section          @10A*/ 06012800
*       3 SMF42GD2  BINARY(16), /* Length of SYSPLEX wide data set      06012900
*                                  summary data section          @10A*/ 06013000
*       3 SMF42GD3  BINARY(16), /* Number of SYSPLEX wide data set      06013100
*                                  summary data sections         @10A*/ 06013200
*       3 SMF42GD4  BINARY(32), /* Offset to data set/CF/SYS            06013300
*                                  summary section               @10A*/ 06013400
*       3 SMF42GD5  BINARY(16), /* Length of data set/CF/SYS            06013500
*                                  summary section               @10A*/ 06013600
*       3 SMF42GD6  BINARY(16); /* Number of data set/CF/SYS            06013700
*                                  summary sections              @10A*/ 06013800
* DECLARE                                                               06013900
*   SMF42LG CONSTANT(LENGTH(SMF42SG)); /* Length of subtype 16 header   06014000
*                                          section               @11C*/ 06014100
* %SKIP_HEADER_0G: ;                                                    06014200
* %IF SMF42_0H ^= 'YES' %THEN %GOTO SKIP_HEADER_0H;                     06014300
*@SPACE;                                                                06014400
* /*-----------------------------------------------------------------*/ 06014500
* /* SMF42 subtype 17 header section                                 */ 06014600
* /*  (Lock structure activity summary)                              */ 06014700
* /*-----------------------------------------------------------------*/ 06014800
* DECLARE                                                   /*   @10A*/ 06014900
*   1 SMF42SH BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD), /*@10A*/ 06015000
*       3 SMF42HL1  BINARY(32), /* Offset to MVS SYS lock structure     06015100
*                                  activity totals section       @10A*/ 06015200
*       3 SMF42HL2  BINARY(16), /* Length of MVS SYS lock structure     06015300
*                                  activity totals section       @10A*/ 06015400
*       3 SMF42HL3  BINARY(16), /* Number of MVS SYS lock structure     06015500
*                                  activity totals sections      @10A*/ 06015600
*       3 SMF42HL4  BINARY(32), /* Offset to lock structure             06015700
*                                  summary section               @10A*/ 06015800
*       3 SMF42HL5  BINARY(16), /* Length of lock structure             06015900
*                                  summary section               @10A*/ 06016000
*       3 SMF42HL6  BINARY(16); /* Number of lock structure             06016100
*                                  summary sections              @10A*/ 06016200
* DECLARE                                                               06016300
*   SMF42LH CONSTANT(LENGTH(SMF42SH)); /* Length of subtype 17 header   06016400
*                                          section               @11C*/ 06016500
* %SKIP_HEADER_0H: ;                                                    06016600
* %IF SMF42_0I ^= 'YES' %THEN %GOTO SKIP_HEADER_0I;                     06016700
*@SPACE;                                                                06016800
* /*-----------------------------------------------------------------*/ 06016900
* /* SMF42 subtype 18 header section                                 */ 06017000
* /*  (Coupling Facility Cache Partition summary)                    */ 06017100
* /*-----------------------------------------------------------------*/ 06017200
* DECLARE                                                   /*   @10A*/ 06017300
*   1 SMF42SI BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD), /*@10A*/ 06017400
*       3 SMF42IM1  BINARY(32), /* Offset to CF cache partition         06017500
*                                  activity totals section       @10A*/ 06017600
*       3 SMF42IM2  BINARY(16), /* Length of CF cache partition         06017700
*                                  activity totals section       @10A*/ 06017800
*       3 SMF42IM3  BINARY(16), /* Number of CF cache partition         06017900
*                                  activity totals sections      @10A*/ 06018000
*       3 SMF42IM4  BINARY(32), /* Offset to single cache partition     06018100
*                                  summary section               @10A*/ 06018200
*       3 SMF42IM5  BINARY(16), /* Length of single CF cache            06018300
*                                  partition summary section     @10A*/ 06018400
*       3 SMF42IM6  BINARY(16), /* Number of single CF cache            06018500
*                                  partition summary sections    @10A*/ 06018600
*       3 SMF42IM7  BINARY(32), /* Offset to directory/element ratio    06018700
*                                  data summary section          @11A*/ 06018800
*       3 SMF42IM8  BINARY(16), /* Length of directory/element ratio    06018900
*                                  data summary section          @11A*/ 06019000
*       3 SMF42IM9  BINARY(16); /* Number of directory/element ratio    06019100
*                                  data summary sections         @11A*/ 06019200
* DECLARE                                                               06019300
*   SMF42LI CONSTANT(LENGTH(SMF42SI)); /* Length of subtype 18 header   06019400
*                                          section               @11C*/ 06019500
* %SKIP_HEADER_0I: ;                                                    06019600
*                                                                       06019700
* %IF SMF42_0J ^= 'YES' %THEN %GOTO SKIP_HEADER_0J;           /* @11A*/ 06019800
*@SPACE;                                                      /* @11A*/ 06019900
* /*-------------------------------------------------------------@11A*/ 06020000
* /* SMF42 subtype 19 header section                             @11A*/ 06020100
* /*  (Buffer Manager LRU activity)                              @11A*/ 06020200
* /*-------------------------------------------------------------@11A*/ 06020300
* DECLARE                                                     /* @11A*/ 06020400
*   1 SMF42SJ BASED(ADDR(SMF42) + OFFSET(SMF42END)) BDY(WORD),/* @11A*/ 06020500
*       3 SMF42JN1  BINARY(32), /* Offset to Buffer Manager LRU         06020600
*                                  activity total section        @11A*/ 06020700
*       3 SMF42JN2  BINARY(16), /* Length of Buffer Manager LRU         06020800
*                                  activity total section        @11A*/ 06020900
*       3 SMF42JN3  BINARY(16), /* Number of Buffer Manager LRU         06021000
*                                  activity total sections.      @11A*/ 06021100
*       3 SMF42JN4  BINARY(32), /* Offset to Buffer Manager LRU         06021200
*                                  activity section              @11A*/ 06021300
*       3 SMF42JN5  BINARY(16), /* Length of Buffer Manager LRU         06021400
*                                  activity section              @11A*/ 06021500
*       3 SMF42JN6  BINARY(16); /* Number of Buffer Manager LRU         06021600
*                                  activity sections.            @11A*/ 06021700
* DECLARE                                                               06021800
*   SMF42LJ CONSTANT(LENGTH(SMF42SJ)); /* Length of subtype 19 header   06021900
*                                          section               @11A*/ 06022000
* %SKIP_HEADER_0J: ;                                                    06022100
*                                                                       06022200
*@SPACE;                                                                06022300
* DECLARE                                                               06022400
*   SMF42LN CONSTANT(LENGTH(SMF42)); /* Length of beginning SMF42       06025000
*                                        header section          @02C*/ 06037500
*@SPACE;                                                                06050000
* /*-----------------------------------------------------------------*/ 06075000
* /*  Product Section                                                */ 06100000
* /*-----------------------------------------------------------------*/ 06125000
* DECLARE                                                               06150000
*   1 SMF42PRD BASED(ADDR(SMF42) + SMF42OPS),                           06200000
*     2 SMF42PDL    CHAR(8),        /* Product Level             @02C*/ 06225000
*     2 SMF42PDN    CHAR(10),       /* Product Name              @02C*/ 06250000
*     2 SMF42PSV    FIXED(8),       /* Subtype version number    @P1A*/ 06257500
*     2 *           CHAR(1),        /* Reserved                  @P1C*/ 06265000
*     2 SMF42PTS    CHAR(8),        /* Intrval Start or Open TOD @P1C*/ 06272500
*     2 SMF42PTE    CHAR(8),        /* Interval End or Close TOD @L1A*/ 06280000
*     2 *           CHAR(4);        /* Reserved                  @L1A*/ 06290000
* /*-----------------------------------------------------------------*/ 06300000
* /* Product section must end on word boundary                       */ 06325000
* /*-----------------------------------------------------------------*/ 06350000
* DECLARE                                                               06375000
*   SMF42PLN CONSTANT(LENGTH(SMF42PRD)), /* Product Section Len  @P1C*/ 06400000
*   SMF42PVR CONSTANT(1);           /* Product Section Version   @P1A*/ 06425000
*                                                                       06450000
* %IF SMF42_01 ^= 'YES' %THEN %GOTO SKIP_01;                            06500000
*@SPACE;                                                                06600000
* /*-----------------------------------------------------------------*/ 06625000
* /*  Start of Buffer Management Facility Section                    */ 06650000
* /*-----------------------------------------------------------------*/ 06675000
*@SPACE;                                                                06700000
* /*-----------------------------------------------------------------*/ 06725000
* /* SMF type 42 subtype 1 (Buffer Manager Statistics, part 1)       */ 06750000
* /*-----------------------------------------------------------------*/ 06775000
* DECLARE                                                               06800000
*   1 SMF4201A BASED(ADDR(SMF42) + SMF42BMO),                           06850000
*     2 SMF42BMF (*),               /* Description of BMF totals        06900000
*                                      section                       */ 06950000
*       3 SMF42TNA FIXED(31),       /* Total number of storage          07000000
*                                      classes                   @02C*/ 07050000
*       3 SMF42TMT FIXED(31),       /* Interval length (total time of   07100000
*                                      measurement period)       @02C*/ 07150000
*       3 SMF42TRT FIXED(31),       /* Total number of member data      07200000
*                                      page reads                @02C*/ 07250000
*       3 SMF42TRH FIXED(31),       /* Total number of member data      07300000
*                                      page read hits                   07350000
*                                      (found in BMF)            @02C*/ 07400000
*       3 SMF42TDT FIXED(31),       /* Total number of directory data   07450000
*                                      page reads                @02C*/ 07500000
*       3 SMF42TDH FIXED(31),       /* Total number of directory data   07550000
*                                      page read hits                   07600000
*                                      (found in BMF)            @02C*/ 07650000
*       3 SMF42BUF FIXED(31),       /* Total number of active           07675000
*                                      BMF 4K buffers            @18A*/ 07700000
*       3 SMF42BMX FIXED(31),       /* High water mark of BMF           07725000
*                                      buffers                   @18A*/ 07750000
*       3 SMF42LRU FIXED(15),       /* BMF LRU interval time     @18A*/ 07775000
*       3 SMF42UIC FIXED(15);       /* BMF LRU cycles before            07800000
*                                      buffer cast out           @18A*/ 07825000
*@SPACE;                                                                07850000
* /*-----------------------------------------------------------------*/ 07875000
* /* SMF type 42 subtype 1 (Buffer Manager Statistics, part 2)       */ 07900000
* /*-----------------------------------------------------------------*/ 07925000
* DECLARE                                                               07950000
*   1 SMF4201B BASED(ADDR(SMF42) + SMF42SCO),                           08000000
*     2 SMF42SC  (*),               /* Description of Storage Class     08050000
*                                      Summary section       @OW00573*/ 08100000
*       3 SMF42PNA,                 /* Storage class name            */ 08150000
*         4 SMF42PNL FIXED(16),     /* Storage class name length     */ 08200000
*         4 SMF42PNN CHAR(30),      /* Storage class name            */ 08250000
*       3 SMF42SRT FIXED(31),       /* Total number of member data      08290900
*                                      page reads                @02C*/ 08331800
*       3 SMF42SRH FIXED(31),       /* Total number of member data      08372700
*                                      page read hits                   08413600
*                                      (found in BMF)            @02C*/ 08454500
*       3 SMF42SDT FIXED(31),       /* Total number of directory data   08495400
*                                      page reads                @02C*/ 08536300
*       3 SMF42SDH FIXED(31);       /* Total number of directory data   08577200
*                                      page read hits                   08618100
*                                      (found in BMF)            @02C*/ 08659000
* %SKIP_01: ;                                                           08700000
* %IF SMF42_02 ^= 'YES' %THEN %GOTO SKIP_02;                            08750000
*@SPACE;                                                                08850000
* /*-----------------------------------------------------------------*/ 08875000
* /*  Start of Control Unit Cache Summary Section                    */ 08900000
* /*-----------------------------------------------------------------*/ 08925000
*@SPACE;                                                                08950000
* /*-----------------------------------------------------------------*/ 08975000
* /* SMF type 42 subtype 2 (Control Unit Cache Summary, part 1)      */ 09000000
* /*-----------------------------------------------------------------*/ 09025000
* DECLARE                                                               09050000
*   1 SMF4202A BASED(ADDR(SMF42) + SMF42CUO),                           09100000
*     2 SMF42CUC (*),               /* Description of control unit      09150000
*                                      cache section                 */ 09200000
*       3 SMF42HWS,                 /* Description of hardware status   09250000
*                                      section                       */ 09300000
*         4 SMF42SCS BIT(8),        /* Storage director caching         09350000
*                                      status. Format as follows:       09400000
*                                      000xxxxx = Caching is active     09450000
*                                      001xxxxx = Caching is pending    09500000
*                                        active                         09550000
*                                      010xxxxx = Internal subsystem    09600000
*                                        error. Caching has terminated  09650000
*                                      100xxxxx = Caching deactivated   09700000
*                                        due to explicit host request   09750000
*                                      110xxxxx = Pending off in        09800000
*                                        process. Command to deactivate 09850000
*                                        cache received, destage still  09900000
*                                        in progress                    09950000
*                                      111xxxxx = Pending off destage   10000000
*                                        failed                         10050000
*                                      xxx1xxxx = Subsystem storage     10100000
*                                        disabled for maintenance       10150000
*                                      xxxxXXxx = Reserved              10200000
*                                      xxxxxx1x = IML device not        10250000
*                                         available                     10300000
*                                      xxxxxxx1 = Non-retentive data    10350000
*                                         is deactivated             */ 10400000
*         4 SMF42NCS BIT(8),        /* Subsystem non-volatile storage   10450000
*                                      status. Format as follows:       10500000
*                                      00xxxxxx = Non-volatile cache    10550000
*                                        is active                      10600000
*                                      01xxxxxx = Internal subsystem    10650000
*                                        error. Non-volatile cache      10700000
*                                        availability terminated        10750000
*                                      10xxxxxx = Non-volatile cache    10800000
*                                        has been deactivated due to    10850000
*                                        explicit host system request   10900000
*                                      11xxxxxx = Pending non-volatile  10950000
*                                        unavailable has been received, 11000000
*                                        destage still in progress      11050000
*                                      xxXxxXXX = Reserved              11100000
*                                      xxx1xxxx = Non-volatile storage  11150000
*                                        disabled for maintenance       11200000
*                                      xxxx1xxx = Non-volatile storage  11250000
*                                        disabled due to error       */ 11300000
*         4 SMF42CID FIXED(15),     /* Subsystem identifier          */ 11350000
*         4 SMF42CSS FIXED(31),     /* Configured subsystem storage     11400000
*                                      capacity. F'-1' = undetermined*/ 11450000
*         4 SMF42SSA FIXED(31),     /* Subsystem storage available      11500000
*                                      for allocation as cache space */ 11550000
*         4 SMF42SAP FIXED(31),     /* Subsystem storage allocated for  11600000
*                                      pinned data                   */ 11650000
*         4 SMF42SSU FIXED(31),     /* Subsystem storage unavailable    11700000
*                                      due to subsystem failures     */ 11750000
*         4 SMF42NSZ FIXED(31),     /* Configured non-volatile cache    11800000
*                                      capacity. F'-1' = undetermined*/ 11850000
*         4 SMF42SPR FIXED(31),     /* Non-volatile cache allocated for 11900000
*                                      pinned data                   */ 11950000
*         4 SMF42SSF BIT(8),        /* Subsystem flags           @08A*/ 11966600
*           6 SMF42ENH BIT(1),      /* Subsystem is D/T3990-6 in        11983200
*                                      enhanced mode             @08A*/ 11999800
*           6 *        BIT(7),      /* Reserved                  @08A*/ 12016400
*         4 *        CHAR(3),       /* Reserved                  @08C*/ 12033000
*       3 SMF42SWS,                 /* Description of software status   12050000
*                                      section                       */ 12100000
*         /* Statistics gathered from LAST update period             */ 12150000
*         4 SMF42LCT FIXED(31),     /* I/O count for subsystem       */ 12200000
*         4 SMF42LFW FIXED(31),     /* Fast write wait count         */ 12250000
*         4 SMF42LRH FIXED(31),     /* Cache normal read hit percent */ 12300000
*         4 SMF42LWM FIXED(31),     /* Fast write waits per minute   */ 12350000
*         4 SMF42LTS,               /* Time stamp                    */ 12400000
*           5 SMF42LYY FIXED(16),   /* Year                          */ 12450000
*           5 SMF42LDD FIXED(16),   /* Day                           */ 12500000
*           5 SMF42LTM FIXED(31),   /* Time: HH:MM:SS:TH (1 byte ea.)*/ 12550000
*         /* Statistics gathered from CURRENT update period          */ 12600000
*         4 SMF42CCT FIXED(31),     /* I/O count for subsystem       */ 12650000
*         4 SMF42CFW FIXED(31),     /* Fast write wait count         */ 12700000
*         4 SMF42CRH FIXED(31),     /* Cache normal read hit percent */ 12750000
*         4 SMF42CWM FIXED(31),     /* Fast write waits per minute   */ 12800000
*         4 SMF42CTS,               /* Time stamp                    */ 12850000
*           5 SMF42CYY FIXED(16),   /* Year                          */ 12900000
*           5 SMF42CDD FIXED(16),   /* Day                           */ 12950000
*           5 SMF42CTM FIXED(31),   /* Time: HH:MM:SS:TH (1 byte ea.)*/ 13000000
*         /* Statistical averages                                    */ 13050000
*         4 SMF42AHR FIXED(15),     /* Average hit ratio             */ 13100000
*         4 SMF42AFW FIXED(15),     /* Average fast write waits per     13150000
*                                      minute                        */ 13200000
*         4 *        CHAR(4);       /* Reserved                      */ 13250000
*@SPACE;                                                                13300000
* /*-----------------------------------------------------------------*/ 13325000
* /*  Second part of Control Unit Cache Summary Section              */ 13350000
* /*-----------------------------------------------------------------*/ 13375000
*@SPACE;                                                                13400000
* /*-----------------------------------------------------------------*/ 13425000
* /* SMF type 42 subtype 2 (Control Unit Cache Summary, part 2)      */ 13450000
* /*-----------------------------------------------------------------*/ 13475000
* DECLARE                                                               13500000
*   1 SMF4202B BASED(ADDR(SMF42) + SMF42VLO),                           13550000
*     2 SMF42VLS (*),               /* Description of volume status     13600000
*                                      section                       */ 13650000
*       3 SMF42VOL CHAR(6),         /* Volume serial number          */ 13700000
*       3 *        CHAR(2),         /* Reserved                      */ 13750000
*       3 SMF42DEV FIXED(31),       /* Device number                 */ 13800000
*       3 SMF42VST BIT(16),         /* Device status flags           */ 13850000
*         4 SMF42DB1 BIT(8),        /* Device status flags, byte 1.     13900000
*                                      Format as follows:               13950000
*                                      Bits 0-1  = Device Cache Status  14000000
*                                      00xxxxxx = Caching activated     14050000
*                                      01xxxxxx = Unused                14100000
*                                      10xxxxxx = Deactivate pending    14150000
*                                        by explicit host request.      14200000
*                                        Transfer of modified data to   14250000
*                                        DASD failed                    14300000
*                                      11xxxxxx = Caching deactivated   14350000
*                                        unavailable                    14400000
*                                      Bits 2-3  = Fast write status    14450000
*                                      xx00xxxx = Fast write activated  14500000
*                                      xx01xxxx = Unused                14550000
*                                      xx10xxxx = Fast write deactivate 14600000
*                                        pending, transfer of data to   14650000
*                                        DASD failed                    14700000
*                                      xx11xxxx = Fast write            14750000
*                                        deactivated                    14800000
*                                      Bits 4-7  = Duplex pair flags    14850000
*                                      xxxx1xxx = Primary of duplex     14900000
*                                        pair                           14950000
*                                      xxxxx1xx = Secondary of duplex   15000000
*                                        pair                           15050000
*                                      xxxxxx00 = Duplex pair available 15100000
*                                      xxxxxx01 = Duplex pair pending   15150000
*                                        (copy to establish duplex pair 15200000
*                                        in progress or failed)         15250000
*                                      xxxxxx10 = Failed duplex by      15300000
*                                        command                        15350000
*                                      xxxxxx11 = Failed duplex by      15400000
*                                        subsystem                   */ 15450000
*         4 SMF42DB2 BIT(8),        /* Device status flags, byte 2.     15500000
*                                      Format as follows:               15550000
*                                      1xxxxxxx = Device is 'failed'    15600000
*                                        of failed duplex               15650000
*                                      x1xxxxxx = Device has pinned     15700000
*                                        data                           15750000
*                                      xxXXXXXX = Channel connect       15800000
*                                        address for other device in    15850000
*                                        duplex pair                 */ 15900000
*       3 *        CHAR(2);         /* Reserved                      */ 15950000
* %SKIP_02: ;                                                           16000000
* %IF SMF42_03 ^= 'YES' %THEN %GOTO SKIP_03;                            16050000
*@SPACE;                                                                16150000
* /*-----------------------------------------------------------------*/ 16175000
* /*  Start of Event Audit Section (Operational Services)            */ 16200000
* /*-----------------------------------------------------------------*/ 16225000
*@SPACE;                                                                16250000
* /*-----------------------------------------------------------------*/ 16275000
* /* SMF type 42 subtype 3 (Event Audit Section)                     */ 16300000
* /*-----------------------------------------------------------------*/ 16325000
* DECLARE                                                               16350000
*   1 SMF4203A BASED(ADDR(SMF42) + SMF42EAO),                           16400000
*     2 SMF42EAS (*),               /* Description of event audit       16450000
*                                      section                       */ 16500000
*       3 SMF42EAC CHAR(8),         /* Action which caused record to    16550000
*                                      be created: ACTIVATE, ENF,       16600000
*                                      VARY SMS, or SAVEACDS         */ 16650000
*       3 SMF42ERC FIXED(31),       /* Return code from resulting       16700000
*                                      event                         */ 16750000
*       3 SMF42ERS FIXED(31),       /* Reason code from resulting       16800000
*                                      event                         */ 16850000
*       /* Fields filled in for ENF event                            */ 16900000
*       3 SMF42EUA PTR(31),         /* UCB address for device        */ 16950000
*       3 SMF42EVO CHAR(6),         /* Volser for device         @02A*/ 16966600
*       3 *        CHAR(2),         /* Reserved                  @02A*/ 16983200
*       3 SMF42EOS FIXED(8),        /* Old MVS volume status         */ 17000000
*       3 SMF42ENS FIXED(8),        /* New MVS volume status         */ 17050000
*       3 *        CHAR(2),         /* reserved                      */ 17100000
*       /* Fields filled in for VARY SMS command                     */ 17150000
*       3 SMF42ETY CHAR(8),         /* Type of VARY request: STORGRP,   17178500
*                                     LIBRARY, DRIVE, or VOLUME  @02A*/ 17207000
*       3 SMF42ERN,                 /* VARY request name         @02C*/ 17235500
*         4 SMF42ENL FIXED(15),     /* Name length               @02C*/ 17264000
*         4 SMF42ENM CHAR(30),      /* STORGRP name or LIBRARY name     17292500
*                                      or DRIVE name             @02C*/ 17321000
*       3 SMF42EVL CHAR(6),         /* Volume serial                 */ 17350000
*       3 *        CHAR(2),         /* Reserved                      */ 17400000
*       3 SMF42ESY CHAR(8),         /* System name or '(ALL)'        */ 17450000
*       3 SMF42EST CHAR(12),        /* Resulting status: ENABLE or      17500000
*                                      ENABLE,NEW or QUIESCE or         17550000
*                                      QUIESCE,NEW or DISABLE or        17600000
*                                      DISABLE,NEW or ONLINE or         17633300
*                                      OFFLINE                   @02C*/ 17666600
*       3 *        CHAR(4),         /* Reserved                      */ 17700000
*       /* Fields filled in for ACTIVATE command                     */ 17750000
*       3 SMF42ESD CHAR(44),        /* Source control data set name  */ 17800000
*       3 SMF42EAD CHAR(44);        /* Active control data set name  */ 17850000
*                                                                       18124000
* %SKIP_03:;                        /* Remove bilingual mapping  @02D*/ 18140900
* %IF SMF42_04 ^= 'YES' %THEN %GOTO SKIP_04;                            18157800
*                                                                       18174800
*@SPACE;                                                                18175200
* /*-----------------------------------------------------------------*/ 18175600
* /*  Start of System Data Mover Session Statistics          @OY66824*/ 18176000
* /*-----------------------------------------------------------------*/ 18176400
*                                                                       18176800
*                                                                       18177200
* /*-----------------------------------------------------------------*/ 18177600
* /* SMF type 42 subtype 4 (Concurrent Copy Session          @OY66824*/ 18178000
* /* Statistics)                                             @OY66824*/ 18178400
* /*-----------------------------------------------------------------*/ 18178800
*                                                                       18179200
* DECLARE                                                  /*@OY66824*/ 18179600
*   1 SMF4204C BASED(ADDR(SMF42) + SMF42CCO),              /*@OY66824*/ 18180000
*       3 S42CCID  FIXED(32),   /* Logical Session ID        @OY66824*/ 18180400
*       3 S42CCRQS CHAR(2),     /* Request type,                        18180800
*                                  'CC' = Concurrent Copy    @OY66824*/ 18181200
*       3 S42CCTS  CHAR(1),     /* Termination status,                  18181600
*                                  'N' = normal,             @OY66824   18182000
*                                  'A' = abnormal            @OY66824*/ 18182400
*       3 *        CHAR(1),     /* Reserved                  @OY66824*/ 18182800
*       3 S42CCJNM CHAR(8),     /* Invoking Jobname          @OY66824*/ 18183200
*       3 S42CCJNO CHAR(8),     /* Invoking Job number       @OY66824*/ 18183600
*       3 S42CCSST CHAR(8),     /* Session start TOD         @OY66824*/ 18184000
*       3 S42CCEIT CHAR(8),     /* Initialization end TOD    @OY66824*/ 18184400
*       3 S42CCSET CHAR(8),     /* Session end TOD           @OY66824*/ 18184800
*       3 S42CCSSO FIXED(32),   /* Offset to first SSID      @OY66824*/ 18185200
*                               /* header                    @OY66824*/ 18185600
*       3 S42CCSSN FIXED(16),   /* Number of SSID's for      @OY66824*/ 18186000
*                               /* session                   @OY66824*/ 18186400
*       3 S42CCSSL FIXED(16),   /* Length of SSID header     @OY66824*/ 18186800
*       3 *        CHAR(8);     /* Reserved                  @OY66824*/ 18187200
*                                                                       18187600
*@SPACE;                                                                18188000
* /*-----------------------------------------------------------------*/ 18188400
* /* CC SSID Header Section (SMF42 subtype 4)                @OY66824*/ 18188800
* /*-----------------------------------------------------------------*/ 18189200
* DECLARE                                                  /*@OY66824*/ 18189600
*   1 S42CSIDH BASED(ADDR(SMF42) + S42CCSSO),              /*@OY66824*/ 18190000
*       3 S42CSNXT FIXED(32),      /* Offset to next SSID header        18190400
*                                     (0 if last SSID)       @OY66824*/ 18190800
*       3 S42CSID  FIXED(16),      /* SSID                   @OY66824*/ 18191200
*       3 S42CSIDP FIXED(8),       /* Controller session ID  @OY66824*/ 18191600
*       3 *        CHAR(1),        /* Reserved               @OY66824*/ 18192000
*       3 S42CSMSF FIXED(31),      /* Maximum track threshold           18192400
*                                     reached in storage control        18192800
*                                     buffers                @OY66824*/ 18193200
*       3 S42CSVLO FIXED(32),      /* Offset to first volume for        18193600
*                                     this SSID              @OY66824*/ 18194000
*       3 S42CSVLN FIXED(16),      /* Number of volumes      @OY66824*/ 18194400
*       3 S42CSVLL FIXED(16),      /* Length of volume       @OY66824*/ 18194800
*                                  /* section                @OY66824*/ 18195200
*       3 *        CHAR(4);        /* Reserved               @OY66824*/ 18195600
*                                                                       18196000
*@SPACE;                                                                18196400
* /*-----------------------------------------------------------------*/ 18196800
* /* CC Volume section (SMF42 subtype 4)                     @OY66824*/ 18197200
* /*-----------------------------------------------------------------*/ 18197600
* DECLARE                                                               18198000
*   1 S42CVL   BASED(ADDR(SMF42) + S42CSVLO),              /*@OY66824*/ 18198400
*       3 S42CVLNX FIXED(32),      /* Offset to next volume             18198800
*                                     (0 if last volume)     @OY66824*/ 18199200
*       3 S42CVLSR CHAR(6),        /* Volume Serial          @OY66824*/ 18199600
*       3 *        CHAR(2),        /* Reserved               @OY66824*/ 18200000
*       3 S42CVLDV CHAR(1),        /* Device type (UCBTBYT4) @OY66824*/ 18200400
*       3 S42CVLUA CHAR(3),        /* Unit address (UCBNAME) @OY66824*/ 18200800
*       3 S42CVLTK FIXED(31),      /* Number of tracks to be            18201200
*                                     processed on the volume@OY66824*/ 18201600
*       3 S42CVLRD FIXED(31),      /* Number of tracks read             18202000
*                                     directly from DASD     @OY66824*/ 18202400
*       3 S42CVLRS FIXED(31),      /* Number of tracks read from        18202800
*                                     storage control buffers@OY66824*/ 18203200
*       3 S42CVLEP FIXED(31),      /* Number of EXCPs        @OY66824*/ 18203600
*       3 S42CVLUX CHAR(4);        /* Unit address (UCBNAME)     @20C*/ 18203800
*                                  /*  extended                  @20C*/ 18204000
*                                                                       18204400
*                                                                       18204800
*@SPACE;                                                                18205200
* /*-----------------------------------------------------------------*/ 18205600
* /* SMF type 42 subtype 4 (Extended Sequential Data Set session     */ 18206000
* /*                        statistics)                      @OY66824*/ 18206400
* /*-----------------------------------------------------------------*/ 18206800
*                                                                       18207200
* DECLARE                                                  /*@OY66824*/ 18207600
*   1 SMF4204E BASED(ADDR(SMF42) + SMF42EXO),              /*@OY66824*/ 18208000
*       3 S42EXID  FIXED(32),   /* Logical Session ID        @OY66824*/ 18208400
*       3 S42EXRQS CHAR(3),     /* Request type, 'EXT' = Extended       18208800
*                                  Sequential Data Set       @OY66824*/ 18209200
*       3 *        CHAR(1),     /* Reserved                  @OY66824*/ 18209600
*       3 S42EXJNM CHAR(8),     /* Invoking Jobname          @OY66824*/ 18210000
*       3 S42EXJNO CHAR(8),     /* Invoking Job number       @OY66824*/ 18210400
*       3 S42EXSTM CHAR(8),     /* Session start TOD         @OY66824*/ 18210800
*       3 S42EXETM CHAR(8),     /* Session end TOD           @OY66824*/ 18211200
*       3 S42EXTS  CHAR(1),     /* Termination status,                  18211600
*                                  'N' = normal,             @OY66824   18212000
*                                  'A' = abnormal            @OY66824*/ 18212400
*       3 *        CHAR(3),     /* Reserved                  @OY66824*/ 18212800
*       3 S42EVLRT BIT(64),     /* Number of tracks read     @OY66824*/ 18213200
*       3 S42EVLWT BIT(64),     /* Number of tracks written  @OY66824*/ 18213600
*       3 *        CHAR(12);    /* Reserved                  @OY66824*/ 18214000
*                                                                       18214400
* %SKIP_04: ;                                                           18234200
* %IF SMF42_05 ^= 'YES' %THEN %GOTO SKIP_05;                            18254000
*                                                                       18274000
*@SPACE;                                                                18324000
* /*-----------------------------------------------------------------*/ 18374000
* /* Storage Class Response Time Section (SMF42 subtype 5)           */ 18424000
* /*-----------------------------------------------------------------*/ 18474000
* DECLARE                                                   /*   @L1A*/ 18524000
*   1 SMF4205A BASED(ADDR(SMF42) + SMF42SRO),               /*   @L1A*/ 18574000
*      3 S42SCNAM,                /* Storage class name          @L1A*/ 18624000
*         5 S42SCRNL FIXED(16),   /* Storage class name length   @L1A*/ 18674000
*         5 S42SCRNN CHAR(30),    /* Storage class name          @L1A*/ 18724000
*      3 S42SCIO  BDY(DWORD),     /* Description of I/O Stats    @L1A*/ 18774000
*         5 S42SCIOR FIXED(32),   /* Response time               @L1A*/ 18824000
*         5 S42SCIOC FIXED(32),   /* Avg I/O connect time        @L1A*/ 18874000
*         5 S42SCIOP FIXED(32),   /* Avg I/O pending time        @L1A*/ 18924000
*         5 S42SCIOD FIXED(32),   /* Avg I/O disconnect time     @L1A*/ 18974000
*         5 S42SCIOQ FIXED(32),   /* Avg cntl unit queue time    @L1A*/ 19024000
*         5 S42SCION FIXED(32),   /* Total number of I/Os        @L1A*/ 19074000
*         /* 3990 Control unit cache statistics                  @L1A*/ 19124000
*         5 S42SCCND FIXED(32),   /* No. of cache candidates     @L1A*/ 19174000
*         5 S42SCHIT FIXED(32),   /* No. of cache hits           @L1A*/ 19224000
*         5 S42SCWCN FIXED(32),   /* No. of write candidates     @L1A*/ 19274000
*         5 S42SCWHI FIXED(32),   /* No. of write hits           @L1A*/ 19290600
*         5 S42SCSEQ FIXED(32),   /* No. of sequential I/Os  @OW00573*/ 19307200
*         5 S42SCRLC FIXED(32),   /* No. of RLC I/O's        @OW00573*/ 19323800
*         5 S42SCICL FIXED(32),   /* No. of ILC I/O's        @OW00573*/ 19340400
*         5 S42SCDAO FIXED(32);   /* Avg I/O Dev-Act-only time   @19C*/ 19349000
*@SPACE;                                                      /* @P1A*/ 19357700
*/********************************************************************/ 19358400
*/*         Volume Statistics Header section (SMF Subtype 5)         */ 19359100
*/*         Note that offsets to component sections are zero         */ 19359800
*/*         if there are no statistics for the component         @P1A*/ 19360500
*/********************************************************************/ 19361200
* DECLARE                                                     /* @P1A*/ 19361900
*   1 SMF4205B BASED(ADDR(SMF42) + SMF42VHO),                 /* @P1A*/ 19362600
*      3 S42VTNXT FIXED(32),      /* Offset to next volume       @P1A*/ 19363300
*      3 S42VTSER CHAR(6),        /* Volume serial               @P1A*/ 19364000
*      3 S42VTADR FIXED(16),      /* Device address              @P1A*/ 19364700
*      3 S42VTFL1 CHAR(1),        /* Flags                       @P1A*/ 19365400
*        4 S42VTONL BIT(1),       /* Device online               @P1A*/ 19366100
*        4 S42VTSMS BIT(1),       /* SMS volume                  @P1A*/ 19366800
*      3 *        CHAR(7),        /* Reserved                    @P1A*/ 19367500
*      3 S42VTUNC FIXED(32),      /* I/O count, unknown data set @P1A*/ 19368200
*      3 S42VTVDO FIXED(32),      /* Offset to VTOC Data section @P1A*/ 19368900
*      3 S42VTVDL FIXED(16),      /* Length of VTOC Data section @P1A*/ 19369600
*      3 *        CHAR(2),        /* Reserved                    @P1A*/ 19370300
*      3 S42VTVXO FIXED(32),      /* Offset to VTOC Index sect.  @P1A*/ 19371000
*      3 S42VTVXL FIXED(16),      /* Length of VTOC Index sect.  @P1A*/ 19371700
*      3 *        CHAR(2),        /* Reserved                    @P1A*/ 19372400
*      3 S42VTVVO FIXED(32),      /* Offset to VVDS section      @P1A*/ 19373100
*      3 S42VTVVL FIXED(16),      /* Length of VVDS section      @P1A*/ 19373800
*      3 *        CHAR(2);        /* Reserved                    @P1A*/ 19374500
*@SPACE;                                                      /* @P1A*/ 19375200
*/********************************************************************/ 19375900
*/*  VTOC Data component (Subtype 5)                             @P1A*/ 19376600
*/********************************************************************/ 19377300
* DECLARE                                                     /* @P1A*/ 19378000
*   1 SMF4205C BASED(ADDR(SMF42) + S42VTVDO),                 /* @P1A*/ 19378700
*      3 S42VDIOR FIXED(32),      /* Avg I/O response time       @P1A*/ 19379400
*      3 S42VDIOC FIXED(32),      /* Avg I/O connect time        @P1A*/ 19380100
*      3 S42VDIOP FIXED(32),      /* Avg I/O pending time        @P1A*/ 19380800
*      3 S42VDIOD FIXED(32),      /* Avg I/O disconnect time     @P1A*/ 19381500
*      3 S42VDIOQ FIXED(32),      /* Avg cntl unit queue time    @P1A*/ 19382200
*      3 S42VDION FIXED(32),      /* Total number of I/Os        @P1A*/ 19382900
*         /* 3990 Control unit cache statistics                  @P1A*/ 19383600
*      3 S42VDCND FIXED(32),      /* No. of cache candidates     @P1A*/ 19384300
*      3 S42VDHIT FIXED(32),      /* No. of cache hits           @P1A*/ 19385000
*      3 S42VDWCN FIXED(32),      /* No. of write candidates     @P1A*/ 19385700
*      3 S42VDWHI FIXED(32),      /* No. of write hits           @P1A*/ 19386400
*      3 S42VDSEQ FIXED(32),      /* No. of sequential I/Os      @P1A*/ 19387100
*      3 S42VDRLC FIXED(32),      /* No. of RLC I/Os             @P1A*/ 19387800
*      3 S42VDICL FIXED(32),      /* No. of ICL I/Os             @P1A*/ 19388500
*      3 S42VDDAO FIXED(32);      /* Avg I/O Dev-Act-only time   @19C*/ 19389200
*@SPACE;                                                      /* @P1A*/ 19389900
*/********************************************************************/ 19390600
*/*  VTOC Index component (Subtype 5)                            @P1A*/ 19391300
*/********************************************************************/ 19392000
* DECLARE                                                     /* @P1A*/ 19392700
*   1 SMF4205D BASED(ADDR(SMF42) + S42VTVXO),                 /* @P1A*/ 19393400
*      3 S42VXIOR FIXED(32),      /* Avg I/O response time       @P1A*/ 19394100
*      3 S42VXIOC FIXED(32),      /* Avg I/O connect time        @P1A*/ 19394800
*      3 S42VXIOP FIXED(32),      /* Avg I/O pending time        @P1A*/ 19395500
*      3 S42VXIOD FIXED(32),      /* Avg I/O disconnect time     @P1A*/ 19396200
*      3 S42VXIOQ FIXED(32),      /* Avg cntl unit queue time    @P1A*/ 19396900
*      3 S42VXION FIXED(32),      /* Total number of I/Os        @P1A*/ 19397600
*         /* 3990 Control unit cache statistics                  @P1A*/ 19398300
*      3 S42VXCND FIXED(32),      /* No. of cache candidates     @P1A*/ 19399000
*      3 S42VXHIT FIXED(32),      /* No. of cache hits           @P1A*/ 19399700
*      3 S42VXWCN FIXED(32),      /* No. of write candidates     @P1A*/ 19400400
*      3 S42VXWHI FIXED(32),      /* No. of write hits           @P1A*/ 19401100
*      3 S42VXSEQ FIXED(32),      /* No. of sequential I/Os      @P1A*/ 19401800
*      3 S42VXRLC FIXED(32),      /* No. of RLC I/Os             @P1A*/ 19402500
*      3 S42VXICL FIXED(32),      /* No. of ICL I/Os             @P1A*/ 19403200
*      3 S42VXDAO FIXED(32);      /* Avg I/O Dev-Act-only time   @19C*/ 19403900
*@SPACE;                                                      /* @P1A*/ 19404600
*/********************************************************************/ 19405300
*/*  VVDS component (Subtype 5)                                  @P1A*/ 19406000
*/********************************************************************/ 19406700
* DECLARE                                                     /* @P1A*/ 19407400
*   1 SMF4205E BASED(ADDR(SMF42) + S42VTVVO),                 /* @P1A*/ 19408100
*      3 S42VVIOR FIXED(32),      /* Avg I/O response time       @P1A*/ 19408800
*      3 S42VVIOC FIXED(32),      /* Avg I/O connect time        @P1A*/ 19409500
*      3 S42VVIOP FIXED(32),      /* Avg I/O pending time        @P1A*/ 19410200
*      3 S42VVIOD FIXED(32),      /* Avg I/O disconnect time     @P1A*/ 19410900
*      3 S42VVIOQ FIXED(32),      /* Avg cntl unit queue time    @P1A*/ 19411600
*      3 S42VVION FIXED(32),      /* Total number of I/Os        @P1A*/ 19412300
*         /* 3990 Control unit cache statistics                  @P1A*/ 19413000
*      3 S42VVCND FIXED(32),      /* No. of cache candidates     @P1A*/ 19413700
*      3 S42VVHIT FIXED(32),      /* No. of cache hits           @P1A*/ 19414400
*      3 S42VVWCN FIXED(32),      /* No. of write candidates     @P1A*/ 19415100
*      3 S42VVWHI FIXED(32),      /* No. of write hits           @P1A*/ 19415800
*      3 S42VVSEQ FIXED(32),      /* No. of sequential I/Os      @P1A*/ 19416500
*      3 S42VVRLC FIXED(32),      /* No. of RLC I/Os             @P1A*/ 19417200
*      3 S42VVICL FIXED(32),      /* No. of ICL I/Os             @P1A*/ 19417900
*      3 S42VVDAO FIXED(32);      /* Avg I/O Dev-Act-only time   @19C*/ 19420900
* %SKIP_05: ;                                                           19424000
* %IF SMF42_06 ^= 'YES' %THEN %GOTO SKIP_06;                            19474000
*                                                                       19524000
*@SPACE;                                                                19574000
* /*-----------------------------------------------------------------*/ 19624000
* /* Job section - Data set statistics (SMF42 subtype 6)             */ 19674000
* /*-----------------------------------------------------------------*/ 19724000
* DECLARE                                                   /*   @L1A*/ 19774000
*   1 SMF4206A BASED(ADDR(SMF42) + SMF42JHO),               /*   @L1A*/ 19824000
*       3 S42JDJNM CHAR(8),     /* Job name                      @L1A*/ 19874000
*       3 S42JDRST FIXED(32),   /* Time, in hundreds of a second,       19879500
*                                  reader recognized the JOB card       19885000
*                                  for this job                  @L1A*/ 19890500
*       3 S42JDRSD CHAR(4),     /* Date reader recognized the JOB       19896000
*                                  card for this job, in the form       19901500
*                                  0cyydddF, where F is the sign @L1A*/ 19907000
*       3 S42JDUID CHAR(8),     /* User identification (taken from      19912500
*                                  common exit parameter area)   @L1A*/ 19918000
*       3 S42JDDSO FIXED(32),   /* Offset to first data set hdr  @L1A*/ 19924000
*       3 S42JDDSL FIXED(16),   /* Length of DS header sec       @L1A*/ 19974000
*       3 S42JDCOD FIXED(8),    /* 0=Close, 1=Interval record    @L1A*/ 20024000
*       3 *        CHAR(1),     /* Reserved                      @L1A*/ 20057300
*       3 S42JDPGN FIXED(16),   /* Job performance group number  @L1A*/ 20090600
*       3 S42JDIOL FIXED(16),   /* Length of D/S I/O section @OW00573*/ 20109600
*       3 S42JDAML FIXED(16),   /* Length of AM section          @09C*/ 20128600
*       3 *        CHAR(2),     /* Reserved                      @09A*/ 20147600
*       3 S42JDGMO FIXED(32),   /* GMT Offset represented in binary     20166600
*                                  units of 1.048576 seconds     @09A*/ 20185600
*       3 S42JDWSC CHAR(8),     /* WLM Service Class name        @P1A*/ 20191900
*       3 S42JDWLD CHAR(8),     /* WLM Workload name             @P1A*/ 20198200
*       3 *        CHAR(4);     /* Reserved                      @09A*/ 20204600
*                                                                       20224000
*@SPACE;                                                                20274000
* /*-----------------------------------------------------------------*/ 20324000
* /* Data set header section (SMF42 subtype 6)                       */ 20374000
* /*-----------------------------------------------------------------*/ 20424000
* DECLARE                                                   /*   @L1A*/ 20474000
*   1 S42DSH   BASED(ADDR(SMF42) + S42JDDSO),               /*   @L1A*/ 20524000
*       3 S42DSNXT FIXED(31),      /* Offset to next DS header   @L1A*/ 20574000
*       3 S42DSN   CHAR(44),       /* Data set name              @L1A*/ 20624000
*       3 S42DSTYP CHAR(1),        /* Reserved                   @L1A*/ 20657300
*       3 S42DSCOD BIT(8),         /* Entry descriptor flags     @L1A*/ 20690600
*         4 S42FIRST BIT(1),       /* 1st DS entry since Open    @L1A*/ 20723900
*         4 *        BIT(7),       /* Reserved                   @L1A*/ 20757200
*       3 S42DSFL1 BIT(8),         /* Data set descriptor flags  @P1A*/ 20761500
*         4 S42DSVBU BIT(2),       /* VSAM buffer flags          @P1A*/ 20765800
*           5 S42DSLSR BIT(1),     /* '10' = LSR                 @P1A*/ 20770100
*           5 S42DSRLS BIT(1),     /* '01' = RLS                 @P1A*/ 20774400
*                                  /* '11' = GSR                 @P1A*/ 20778700
*                                  /* '00' = NSR                 @P1A*/ 20783000
*         4 * BIT(1),              /* Reserved                   @P1A*/ 20787300
*         4 S42DSEXC BIT(1),       /* Open for EXCP processing   @P1A*/ 20791600
*         4 S42DSFXD BIT(1),       /* Fixed length records       @P1A*/ 20795900
*         4 S42DSPL BIT(1),        /* Program library            @P1A*/ 20800200
*         4 S42DSEF BIT(1),        /* Extended format            @P1A*/ 20804500
*         4 S42DSEFC BIT(1),       /* Compressed format          @P1A*/ 20808800
*       3 *        CHAR(1),        /* Reserved                   @P1C*/ 20813100
*       3 S42DSIOO FIXED(32),      /* Offset to I/O section          */ 20818300
*       3 S42DSAMO FIXED(32),     /* Offset to access method @OW00159*/ 20827500
*       3 S42DSVOL CHAR(6),       /* VOLSER                  @OW00159*/ 20836700
*       3 S42DSDEV CHAR(2),       /* Device number           @OW00159*/ 20845900
*       3 S42DSSC  CHAR(8),       /* Storage class name      @OW00159*/ 20855100
*       3 S42DSBSZ FIXED(32),      /* Block size                 @P1C*/ 20859800
*       3 S42DSTRP FIXED(16),      /* Number of stripes          @P1A*/ 20864500
*       3 *        CHAR(6);        /* Reserved                   @P1A*/ 20869200
*                                                                       20874000
*@SPACE;                                                                20924000
* /*-----------------------------------------------------------------*/ 20974000
* /* Data set I/O statistics (SMF42 subtype 6)                       */ 21474000
* /*                                                                 */ 21524000
* /* I/O response/service time components are recorded               */ 21574000
* /* in multiples of 128 micro-seconds.                              */ 21624000
* /* The length of these statistics must be identical                */ 21674000
* /* with the length of DSSBSTAT in the DSSB.                    @L1A*/ 21724000
* /*-----------------------------------------------------------------*/ 21774000
* DECLARE                                                               21824000
*   1 S42DSIO  BASED(ADDR(SMF42) + S42DSIOO) BDY(DWORD),    /*   @L1A*/ 21874000
*       3 S42DSIOR FIXED(32),       /* Response time             @L1A*/ 21974000
*       3 S42DSIOC FIXED(32),       /* Avg I/O connect time      @L1A*/ 22024000
*       3 S42DSIOP FIXED(32),       /* Avg I/O pending time      @L1A*/ 22074000
*       3 S42DSIOD FIXED(32),       /* Avg I/O disconnect time   @L1A*/ 22124000
*       3 S42DSIOQ FIXED(32),       /* Avg cntl unit queue time  @L1A*/ 22174000
*       3 S42DSION FIXED(32),       /* Total number of I/Os      @L1A*/ 22224000
*       /* 3990 Control unit cache statistics                    @L1A*/ 22274000
*       3 S42DSCND FIXED(32),       /* No. of cache candidates   @L1A*/ 22324000
*       3 S42DSHTS FIXED(32),       /* No. of cache hits         @L1A*/ 22374000
*       3 S42DSWCN FIXED(32),       /* No. of write candidates   @L1A*/ 22424000
*       3 S42DSWHI FIXED(32),       /* No. of write hits         @L1A*/ 22428700
*       3 S42DSSEQ FIXED(32),       /* No. of sequential I/Os    @GRA*/ 22433400
*       3 S42DSRLC FIXED(32),       /* No. of RLC I/O's          @GRA*/ 22438100
*       3 S42DSICL FIXED(32),       /* No. of ILC I/O's          @GRA*/ 22442800
*       3 S42DSDAO FIXED(32),       /* Avg I/O Dev-Act-only time @19C*/ 22443900
*                                                                       22445000
* /*  Following two fields are not part of DSSBSTAT                 */  22446100
*                                                                       22447200
*       3 S42DSMAX CHAR(8) BDY(DWORD), /* maximum data set stats@12A*/  22448300
*         4 S42DSMXR FIXED(32),    /* max ds I/O response time  @12A*/  22449400
*         4 S42DSMXS FIXED(32);    /* max dataset service time  @12A*/  22450500
*                                                                       22452200
* DECLARE                                                               22456900
*   1 S42DSAM  BASED(ADDR(SMF42) + S42DSAMO) BDY(DWORD),    /*   @RTA*/ 22461600
*       3 S42AMSRB FIXED(32),  /* Sequential read no. of blocks  @RTA*/ 22466300
*       3 S42AMSRR FIXED(32),  /* Sequential read I/O delay      @RTA*/ 22471000
*       3 S42AMSWB FIXED(32),  /* Sequential write no. of blocks @RTA*/ 22475700
*       3 S42AMSWR FIXED(32),  /* Sequential write I/O delay     @RTA*/ 22480400
*       3 S42AMDRB FIXED(32),  /* Direct read no. of blocks      @RTA*/ 22485100
*       3 S42AMDRR FIXED(32),  /* Direct read I/O total delay    @RTA*/ 22489800
*       3 S42AMDWB FIXED(32),  /* Direct write no. of blocks     @RTA*/ 22494500
*       3 S42AMDWR FIXED(32),  /* Direct write total I/O delay   @RTA*/ 22499200
*       3 S42AMZRB FIXED(32),  /* No. of directory reads         @RTA*/ 22503900
*       3 S42AMZRR FIXED(32),  /* Directory read I/O delay       @RTA*/ 22508600
*       3 S42AMZWB FIXED(32),  /* No. of directory writes        @RTA*/ 22513300
*       3 S42AMZWR FIXED(32);  /* Directory write I/O delay      @RTA*/ 22518000
*                                                                       22524000
*                                                                       22549000
* %SKIP_06: ;                                                 /* @L1A*/ 22574000
*                                                                       22574200
* %IF SMF42_09 ^= 'YES' %THEN %GOTO SKIP_09;                  /* @P1A*/ 22574400
*@SPACE;                                                      /* @P1A*/ 22574600
* /*------------------------------------------------------------ @P1A*/ 22574800
* /*  Start of X37 Abend Section                                 @P1A*/ 22575000
* /*------------------------------------------------------------ @P1A*/ 22575200
*@SPACE;                                                      /* @P1A*/ 22575400
* /*------------------------------------------------------------ @P1A*/ 22575600
* /*  SMF type 42 subtype 9 (X37 Abend, part 1)                  @P1A*/ 22575800
* /*------------------------------------------------------------ @P1A*/ 22576000
* DECLARE                                                     /* @P1A*/ 22576200
*   1 SMF4209A BASED(ADDR(SMF42) + SMF42ABO),                 /* @P1A*/ 22576400
*     2 SMF09X37,                    /* Description X37 section  @P1A*/ 22576600
*       3 S42ASYID CHAR(4),          /* System ID                @P1A*/ 22576800
*       3 S42JOBN CHAR(8),           /* Job name                 @P1A*/ 22577000
*       3 S42RDST BINARY(32) BOUNDARY(BYTE,1), /*                @P1A*/ 22577200
*       3 S42RDSD CHAR(4),           /* Reader start date        @P1A*/ 22577400
*       3 S42AAUID CHAR(8),          /* User identification      @P1A*/ 22577600
*       3 S42ASTPN BINARY(8),        /* Step number              @P1A*/ 22577800
*       3 S42FLAGS BINARY(8),        /* Flags                    @P1A*/ 22578000
*         4 S42B37 BIT(1),           /* B37 abend                @P1A*/ 22578200
*         4 S42D37 BIT(1),           /* D37 abend                @P1A*/ 22578400
*         4 S42E37 BIT(1),           /* E37 abend                @P1A*/ 22578600
*         4 *      BIT(5),           /* Reserved                 @P1A*/ 22578800
*       3 *        CHAR(4),          /* Reserved                 @P1A*/ 22579000
*       3 S42DSORG BIT(16),          /* Data set organization    @P1A*/ 22579200
*       3 S42ADISP BINARY(8),        /* Disposition              @P1A*/ 22579400
*       3 S42DSNME CHAR(44),         /* Data set name            @15C*/ 22579600
*       3 S42VOLSR CHAR(6),          /* Volser of current volume @P1A*/ 22579800
*       3 S42UCBTP BINARY(32) BOUNDARY(BYTE,1), /*               @P1A*/ 22580000
*       3 S42NEXT FIXED(8),          /* Number of extents on vol @P1A*/ 22580200
*       3 S42TNTRK FIXED(32),        /* Total tracks on volume   @P1A*/ 22580400
*       3 S42ASSAT BIT(32) BOUNDARY(BYTE,1),    /*               @P1A*/ 22580600
*       3 S42ADRLH BIT(24) BOUNDARY(BYTE,1),    /*               @P1A   22580800
*                                       if specified             @P1A*/ 22581000
*       3 *        CHAR(5);          /* Reserved                 @P1A*/ 22581200
*@SPACE;                             /*                          @P1A*/ 22581400
* /*------------------------------------------------------------ @P1A*/ 22581600
* /* SMF type 42 subtype 9 (X37 Abend, part 2 SMS data)          @P1A*/ 22581800
* /*------------------------------------------------------------ @P1A*/ 22582000
* DECLARE                                                     /* @P1A*/ 22582200
*   1 SMF4209B BASED(ADDR(SMF42) + SMF42SMO),                 /* @P1A*/ 22582400
*     2 SMF09SMS,                    /* Description of SMS data  @P1A   22582600
*                                       section                  @P1A*/ 22582800
*                                                           /*   @P2D*/ 22583000
*       3 S42MCNME CHAR(30),         /* Management class name    @P1A*/ 22583200
*       3 S42SCNME CHAR(30),         /* Storage class name       @P1A*/ 22583400
*       3 S42DCNME CHAR(30);         /* Data class name          @P1A*/ 22583600
* %SKIP_09: ;                                                 /* @P1A*/ 22583800
* /*-----------------------------------------------------------------*/ 22584000
* /*                                                             @xxA*/ 22585700
* /* Subtype 10 is not in use at this time                       @P1C*/ 22597000
* /*                                                             @xxA*/ 22608300
* /*-----------------------------------------------------------------*/ 22619600
*                                                                       22631000
* %IF SMF42_0B ^= 'YES' %THEN %GOTO SKIP_0B;                            22667700
*                                                                       22704500
*@SPACE;                                                                22724000
* /*-----------------------------------------------------------------*/ 22774000
* /*  Start of Extended Remote Copy (XRC) Session Statistics     @07A*/ 22824000
* /*-----------------------------------------------------------------*/ 22874000
*                                                                       22924000
*                                                                       22974000
* /*-----------------------------------------------------------------*/ 23024000
* /* SMF type 42 subtype 11 (Extended Remote Copy (XRC)          @07A*/ 23074000
* /*                         Session Statistics)                 @07A*/ 23124000
* /*-----------------------------------------------------------------*/ 23174000
*                                                                       23224000
* DECLARE                                                  /*    @07A*/ 23274000
*   1 SMF420BA BASED(ADDR(SMF42) + SMF42XRO),              /*    @07A*/ 23324000
*       3 S42XRID  CHAR(8),     /* Logical Session ID            @07A*/ 23374000
*       3 S42XRTYP CHAR(8),     /* Session type                  @07A*/ 23424000
*       3 S42XRSSO FIXED(32),   /* Offset to first SSID data            23474000
*                                  section                       @07A*/ 23524000
*       3 S42XRSSN FIXED(16),   /* Number of SSID's for the             23574000
*                                  session                       @07A*/ 23624000
*       3 S42XRSSL FIXED(16),   /* Length of SSID data                  23674000
*                                  section                       @07A*/ 23724000
*       3 S42XRVLO FIXED(32),   /* Offset to first volume data          23738200
*                                  section                       @14A*/ 23752400
*       3 S42XRVLN FIXED(16),   /* Number of volume data                23766600
*                                  sections                      @14A*/ 23780800
*       3 S42XRVLL FIXED(16);   /* Length of volume data                23795000
*                                  section                       @14C*/ 23809200
*                                                                       23824000
*@SPACE;                                                                23874000
* /*-----------------------------------------------------------------*/ 23924000
* /* XRC SSID Data Section (SMF42 subtype 11)                    @07A*/ 23974000
* /*-----------------------------------------------------------------*/ 24024000
* DECLARE                                                  /*    @07A*/ 24074000
*   1 S42XRSSD BASED(ADDR(SMF42) + S42XRSSO),              /*    @07A*/ 24124000
*       3 S42XRSNX FIXED(32),    /* Offset to next SSID data section,   24174000
*                                   (0 if last SSID)             @07A*/ 24224000
*       3 S42XRSID FIXED(16),    /* SSID                         @07A*/ 24274000
*       3 S42XRIDP FIXED(8),     /* Controller session ID        @07A*/ 24324000
*       3 *        CHAR(1),      /* Reserved                     @07A*/ 24374000
*       3 S42XRVSH FIXED(31),    /* Number of volumes associated with   24411500
*                                   this SSID. Includes utility         24449000
*                                   devices                      @14C*/ 24486500
*       3 S42XRTPR FIXED(31),    /* Total number of primary             24524000
*                                   data mover reads             @07A*/ 24574000
*       3 S42XRNWD FIXED(31),    /* Number of primary data mover        24624000
*                                   reads with data              @07A*/ 24674000
*       3 S42XRNND FIXED(31),    /* Number of primary data mover        24724000
*                                   reads with no data           @07A*/ 24774000
*       3 S42XRNLR FIXED(31),    /* Number of primary data mover        24824000
*                                   reads left to be read        @07A*/ 24874000
*       3 S42XRNFW FIXED(31),    /* Number of format writes      @07A*/ 24924000
*       3 S42XRNUW FIXED(31),    /* Number of update writes      @07A*/ 24974000
*       3 S42XRARS FIXED(31),    /* Average record size          @07A*/ 25024000
*       3 *        CHAR(4);        /* Reserved                   @07A*/ 25074000
*                                                                       25075400
*                                                                       25076800
*                                                                       25078200
*@SPACE;                                                                25079600
* /*-----------------------------------------------------------------*/ 25081000
* /* XRC Volume Data Section (SMF42 subtype 11)                  @14A*/ 25082400
* /*     Information on XRC primary and secondary volumes.       @14A*/ 25083800
* /*-----------------------------------------------------------------*/ 25085200
* DECLARE                                                  /*    @14A*/ 25086600
*   1 S42XRVLD BASED(ADDR(SMF42) + S42XRVLO),              /*    @14A*/ 25088000
*       3 S42XRVLX FIXED(32),    /* Offset to next volume data section, 25089400
*                                   (0 if last volume)           @14A*/ 25090800
*       3 S42XRVLV CHAR(6),      /* Volser                       @14A*/ 25092200
*       3 S42XRVAV CHAR(6),      /* Other volser in pair         @14A*/ 25093600
*       3 S42XRVPS CHAR(1),      /* 'P' if primary volume               25095000
*                                   'S' if secondary volume      @14A*/ 25096400
*       3 *        CHAR(1),      /* Reserved                     @14A*/ 25097800
*       3 S42XRVSS FIXED(16),    /* SSID associated with volume  @14A*/ 25099200
*       3 S42XRVPR FIXED(31),    /* Total number data mover reads if    25100600
*                                   primary. Total number data mover    25102000
*                                   writes if secondary.         @14A*/ 25103400
*       3 S42XRVWD FIXED(31),    /* Number of data mover reads with     25104800
*                                   data if primary.  Always 0 for      25106200
*                                   secondary.                   @14A*/ 25107600
*       3 S42XRVND FIXED(31),    /* Number of primary data mover        25109000
*                                   reads with no data.  Always 0 for   25110400
*                                   secondary.                   @14A*/ 25111800
*       3 S42XRVFW FIXED(31),    /* Number of format writes      @14A*/ 25113200
*       3 S42XRVUW FIXED(31),    /* Number of update writes      @14A*/ 25114600
*       3 S42XRVRS FIXED(31),    /* Average record size          @14A*/ 25116000
*       3 S42XRVRW FIXED(31),    /* Number of read tracks if primary.   25117400
*                                   Number of write tracks if           25118800
*                                   secondary.                   @14A*/ 25120200
*       3 *        CHAR(4);      /* Reserved                     @14A*/ 25121600
*                                                                       25124000
*                                                                       25174000
* %SKIP_0B: ;                                              /*    @07A*/ 25224000
*                                                                       25274000
* /*-----------------------------------------------------------------*/ 25324000
* /*                                                             @xxA*/ 25374000
* /* Subtypes  12, 13, and 14 are not in use at this time        @xxA*/ 25424000
* /*                                                             @xxA*/ 25474000
* /*-----------------------------------------------------------------*/ 25524000
*                                                                       25574000
* %IF SMF42_0F ^= 'YES' %THEN %GOTO SKIP_0F;                            25624000
*                                                                       25674000
*@SPACE;                                                                25724000
* /*-----------------------------------------------------------------*/ 25774000
* /* Storage Class MSR Summary (SMF42 subtype 15)                    */ 25824000
* /*-----------------------------------------------------------------*/ 25874000
* DECLARE                                                   /*   @10A*/ 25924000
*   1 SMF420FA BASED(ADDR(SMF42) + SMF42FC1),               /*   @10A*/ 25974000
*    2 SMF42FA1,                  /* SYSPLEX wide summary        @10A*/ 26024000
*     3 SMF42FAA FIXED(32),       /* Interval length. This is the       26074000
*                                    total time of the measurement      26124000
*                                    period. (in seconds)        @10A*/ 26151700
*     3 SMF42F00  Char(12),       /* reserved                    @10A*/ 26179400
*                                                                       26207200
*     3 SMF42FAB FIXED(16),       /* Length of the Storage class        26224000
*                                    name                        @10A*/ 26262800
*     3 SMF42FAC CHAR(30),        /* Storage class name          @10A*/ 26301600
*                                                                       26340600
*     3 SMF42F01 Fixed(16),       /* CacheSetName length         @10A*/ 26357200
*     3 SMF42FAD CHAR(30),        /* CacheSet Name               @10A*/ 26373800
*                                                                       26390400
*     3 SMF42FAE FIXED(32),       /* This field will now contain        26414500
*                                    zeros.                      @10A*/ 26438600
*                                 /* (Used to contain :          @10A*/ 26462700
*                                 /* Number of lock requests     @10A*/ 26486800
*                                 /* processed)                  @10A*/ 26510900
*     3 SMF42FAF FIXED(32),       /* This field will now contain        26535000
*                                    zeros.                      @10A*/ 26559100
*                                 /* (Used to contain :          @10A*/ 26583200
*                                 /* Number of true contention          26607300
*                                    lock requests)              @10A*/ 26631400
*     3 SMF42FAG FIXED(32),       /* This field will now contain        26655500
*                                    zeros.                      @10A*/ 26679600
*                                 /* (Used to contain :          @10A*/ 26703700
*                                 /* Number of false contention         26727800
*                                    lock requests)              @10A*/ 26751900
*     3 SMF42F02 Fixed(16),       /* SmsDirectWeight             @10A*/ 26776000
*     3 SMF42F12 Fixed(16),       /* SmsSequentialWeight         @10A*/ 26800100
*     3 SMF42FAH CHAR(16),        /* Reserved                    @10A*/ 26824200
*     3 SMF42FA2,                 /* Direct access summary section   */ 26848300
*      4 SMF42FA3,                /* Normal direct access summary       26874000
*                                    section                     @10A*/ 26924000
*       5 SMF42FCA FIXED(32),     /* Couple facility cache partition    26974000
*                                    number                      @10A*/ 27022400
*       5 SMF42FCB FIXED(31),     /* Total number of requests           27070800
*                                                                @10A*/ 27117600
*       5 SMF42FCC FIXED(32),     /* Total number of read requests -    27164400
*                                    NRI - No read integerity           27211200
*                                                                @10A*/ 27258000
*       5 SMF42FCD FIXED(32),     /* Total number of read requests -    27304800
*                                    consistent reads            @10A*/ 27351900
*                                                                       27399000
*       5 SMF42FCE FIXED(32),     /* Total number of write requests     27443400
*                                                                @10A*/ 27487800
*       5 SMF42FCF FIXED(32),     /* Number of BMF requests             27532200
*                                                                @10A*/ 27576600
*       5 SMF42FCG FIXED(32),     /* Number of BMF read requests        27621000
*                                                                @10A*/ 27665400
*       5 SMF42FCH FIXED(32),     /* Number of BMF write requests       27709800
*                                                                @10A*/ 27754400
*                                                                       27799000
*       5 SMF42FCI FIXED(32),     /* Number of BMF read hits            27843400
*                                                                @10A*/ 27887800
*       5 SMF42FCJ FIXED(32),     /* Number of BMF Valid read hits      27932200
*                                                                @10A*/ 27976600
*       5 SMF42FCK FIXED(32),     /* Number of BMF False invalids       28021000
*                                                                @10A*/ 28065400
*       5 SMF42FCL FIXED(32),     /* Number of requests processed by    28109800
*                                    the sysplex cache manager   @10A*/ 28154400
*                                                                       28199000
*       5 SMF42FCM FIXED(32),     /* Number of CF read requests         28211300
*                                                                @10A*/ 28223600
*       5 SMF42FCN FIXED(32),     /* Number of CF write requests @10A*/ 28235900
*       5 SMF42FCO FIXED(32),     /* Number of CF read hits      @10A*/ 28248200
*       5 SMF42FCP FIXED(32),     /* Number of CF read castins   @10A*/ 28260500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 28264600
*  %DO;                           /*                             @21A*/ 28268700
*       5 SMF42FCQ                /* Number of bytes xfered into the */ 28272800
*          isa(int64bit_signed),  /* DFSMS Cache structure       @21A*/ 28275800
*  %END;                          /*                             @21A*/ 28278800
* %ELSE                           /*                             @21A*/ 28281800
*  %DO;                           /*                             @21A*/ 28284800
*       5 SMF42FCQ                /* Number of bytes xfered into the */ 28287800
*          CHAR(8),               /* DFSMS Cache structure       @21A*/ 28290800
*  %END;                          /*                             @21A*/ 28293800
*                                 /*                             @10A*/ 28297400
*       5 SMF42FCR FIXED(32),     /* Number of READ  real I/O requests  28309700
*                                    to DASD.                    @10A*/ 28322000
*       5 SMF42FCS FIXED(32),     /* Number of WRITE real I/O requests  28334300
*                                    to DASD.                    @10A*/ 28346600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 28350700
*  %DO;                           /*                             @21A*/ 28354800
*       5 SMF42FCT                /* Number of bytes transferred to  */ 28358900
*          isa(int64bit_signed),/* DASD for the READ    requests @21A*/ 28361900
*  %END;                          /*                             @21A*/ 28364900
* %ELSE                           /*                             @21A*/ 28367900
*  %DO;                           /*                             @21A*/ 28370900
*       5 SMF42FCT                /* Number of bytes transferred to  */ 28373900
*          CHAR(8),               /* DASD for the READ requests  @21A*/ 28376900
*  %END;                          /*                             @21A*/ 28379900
*                                 /*                             @10A*/ 28383500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 28387600
*  %DO;                           /*                             @21A*/ 28391700
*       5 SMF42FCU                /* Number of                       */ 28395800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 28398800
*  %END;                          /*                             @21A*/ 28401800
* %ELSE                           /*                             @21A*/ 28404800
*  %DO;                           /*                             @21A*/ 28407800
*       5 SMF42FCU                /* Number of                   @21A*/ 28410800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 28413800
*  %END;                          /*                             @21A*/ 28416800
*                                 /*                             @10A*/ 28420400
*       5 SMF42FCV CHAR(16),      /* reserved                           28432700
*                                                                @10A*/ 28445000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 28449100
*  %DO;                           /*                             @21A*/ 28453200
*       5 SMF42FCW                  !Total amount of time for all the   28457300
*            isa(int64bit_signed),!requests in this                     28469600
*                                   !interval. (the value is expressed  28481900
*                                   !in MILLI- seconds)          @21A*  28484400
*  %END;                          /*                             @21A*/ 28486900
* %ELSE                           /*                             @21A*/ 28489400
*  %DO;                           /*                             @21A*/ 28491900
*       5 SMF42FCW                  !Total amount of time for all the   28494400
*          CHAR(8),               !requests in this              @21A   28496900
*                                   !interval. (the value is expressed  28499400
*                                   !in MILLI- seconds)          @21A*  28501900
*  %END;                          /*                             @21A*/ 28504400
*                                                                       28507300
*       5 SMF42FCX FIXED(32),     /* Average response time for all of   28540600
*                                    the requests in this interval.     28574000
*                                    (total time/number of requests)    28624000
*                                                                @10A*/ 28674000
*       5 SMF42FCY FIXED(32),     /* Normalized response time for all   28724000
*                                    of the requests in this interval   28774000
*                                    (total time/number of bytes        28824000
*                                    transfered/4K)              @10A*/ 28874000
*       5 SMF42FCZ   CHAR(8),     /* Reserved                    @10A*/ 28924000
*       5 SMF42FC7  CHAR(32),     /* Reserved                    @10A*/ 28974000
*      4 SMF42FA4,                /* RE-DO during direct access         29024000
*                                    section                     @10A*/ 29074000
*       5 SMF42FDA FIXED(32),     /* Couple facility cache partition    29124000
*                                    number                      @10A*/ 29172400
*       5 SMF42FDB FIXED(31),     /* Total number of requests           29220800
*                                                                @10A*/ 29267600
*       5 SMF42FDC FIXED(32),     /* Total number of read requests -    29314400
*                                    NRI - No read integerity           29361200
*                                                                @10A*/ 29408000
*       5 SMF42FDD FIXED(32),     /* Total number of read requests -    29454800
*                                    consistent reads            @10A*/ 29501900
*                                                                       29549000
*       5 SMF42FDE FIXED(32),     /* Total number of write requests     29593400
*                                                                @10A*/ 29637800
*       5 SMF42FDF FIXED(32),     /* Number of BMF requests             29682200
*                                                                @10A*/ 29726600
*       5 SMF42FDG FIXED(32),     /* Number of BMF read requests        29771000
*                                                                @10A*/ 29815400
*       5 SMF42FDH FIXED(32),     /* Number of BMF write requests       29859800
*                                                                @10A*/ 29904400
*                                                                       29949000
*       5 SMF42FDI FIXED(32),     /* Number of BMF read hits            29993400
*                                                                @10A*/ 30037800
*       5 SMF42FDJ FIXED(32),     /* Number of BMF Valid read hits      30082200
*                                                                @10A*/ 30126600
*       5 SMF42FDK FIXED(32),     /* Number of BMF False invalids       30171000
*                                                                @10A*/ 30215400
*       5 SMF42FDL FIXED(32),     /* Number of requests processed by    30259800
*                                    the sysplex cache manager   @10A*/ 30304400
*                                                                       30349000
*       5 SMF42FDM FIXED(32),     /* Number of CF read requests         30361300
*                                                                @10A*/ 30373600
*       5 SMF42FDN FIXED(32),     /* Number of CF write requests @10A*/ 30385900
*       5 SMF42FDO FIXED(32),     /* Number of CF read hits      @10A*/ 30398200
*       5 SMF42FDP FIXED(32),     /* Number of CF read castins   @10A*/ 30410500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 30414600
*  %DO;                           /*                             @21A*/ 30418700
*       5 SMF42FDQ                /* Number of bytes xfered into the */ 30422800
*          isa(int64bit_signed),/* DFSMS Cache structure         @21A*/ 30425800
*  %END;                          /*                             @21A*/ 30428800
* %ELSE                           /*                             @21A*/ 30431800
*  %DO;                           /*                             @21A*/ 30434800
*       5 SMF42FDQ                /* Number of bytes xfered into the */ 30437800
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 30440800
*  %END;                          /*                             @21A*/ 30443800
*                                 /*                             @10A*/ 30447400
*       5 SMF42FDR FIXED(32),     /* Number of READ  real I/O requests  30459700
*                                    to DASD.                    @10A*/ 30472000
*       5 SMF42FDS FIXED(32),     /* Number of WRITE real I/O requests  30484300
*                                    to DASD.                    @10A*/ 30496600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 30500700
*  %DO;                           /*                             @21A*/ 30504800
*       5 SMF42FDT                /* Number of bytes transferred to  */ 30508900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 30521200
*  %END;                          /*                             @21A*/ 30522900
* %ELSE                           /*                             @21A*/ 30524600
*  %DO;                           /*                             @21A*/ 30526300
*       5 SMF42FDT                /* Number of bytes transferred to  */ 30528000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 30529700
*  %END;                          /*                             @21A*/ 30531400
*                                 /*                             @10A*/ 30533500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 30537600
*  %DO;                           /*                             @21A*/ 30541700
*       5 SMF42FDU                /* Number of bytes transferred to  */ 30545800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 30548800
*  %END;                          /*                             @21A*/ 30551800
* %ELSE                           /*                             @21A*/ 30554800
*  %DO;                           /*                             @21A*/ 30557800
*       5 SMF42FDU                /* Number of bytes transferred to  */ 30560800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 30563800
*  %END;                          /*                             @21A*/ 30566800
*                                 /*                             @10A*/ 30570400
*       5 SMF42FDV CHAR(16),      /* reserved                           30582700
*                                                                @10A*/ 30595000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 30599100
*  %DO;                           /*                             @21A*/ 30603200
*       5 SMF42FDW                 ! Total amount of time for all the   30607300
*          isa(int64bit_signed), ! requests in this                     30619600
*                                  ! interval. (the value is expressed  30631900
*                                  ! in MILLI- seconds)          @21A   30634400
*  %END;                          /*                             @21A*/ 30636900
* %ELSE                           /*                             @21A*/ 30639400
*  %DO;                           /*                             @21A*/ 30641900
*       5 SMF42FDW                 ! Total amount of time for all the   30644400
*          CHAR(8),              ! requests in this              @21A   30646900
*                                  ! interval. (the value is expressed  30649400
*                                  ! in MILLI- seconds)          @21A   30651900
*  %END;                          /*                             @21A*/ 30654400
*                                                                       30657300
*       5 SMF42FDX FIXED(32),     /* Average response time for all of   30707300
*                                    the requests in this interval.     30757300
*                                    (total time/number of requests)    30824000
*                                                                @10A*/ 30868400
*       5 SMF42FDY FIXED(32),     /* Normalized response time for all   30912800
*                                    of the requests in this interval   30951600
*                                    (total time/number of bytes        30990400
*                                    transfered/4K)              @10A*/ 31029200
*       5 SMF42FDZ   CHAR(8),     /* Reserved                    @10A*/ 31068000
*       5 SMF42FD7  CHAR(32),     /* Reserved                    @10A*/ 31106800
*                                                                       31145600
*                                                                       31184400
*     3 SMF42FA5,                 /* Sequential access summary section  31224000
*                                                                @10A*/ 31274000
*      4 SMF42FA6,                /* Normal sequential access section   31324000
*                                                                @10A*/ 31374000
*       5 SMF42FEA FIXED(32),     /* Couple facility cache partition    31424000
*                                    number                      @10A*/ 31472400
*       5 SMF42FEB FIXED(31),     /* Total number of requests           31520800
*                                                                @10A*/ 31567600
*       5 SMF42FEC FIXED(32),     /* Total number of read requests -    31614400
*                                    NRI - No read integerity           31661200
*                                                                @10A*/ 31708000
*       5 SMF42FED FIXED(32),     /* Total number of read requests -    31754800
*                                    consistent reads            @10A*/ 31801900
*                                                                       31849000
*       5 SMF42FEE FIXED(32),     /* Total number of write requests     31893400
*                                                                @10A*/ 31937800
*       5 SMF42FEF FIXED(32),     /* Number of BMF requests             31982200
*                                                                @10A*/ 32026600
*       5 SMF42FEG FIXED(32),     /* Number of BMF read requests        32071000
*                                                                @10A*/ 32115400
*       5 SMF42FEH FIXED(32),     /* Number of BMF write requests       32159800
*                                                                @10A*/ 32204400
*                                                                       32249000
*       5 SMF42FEI FIXED(32),     /* Number of BMF read hits            32293400
*                                                                @10A*/ 32337800
*       5 SMF42FEJ FIXED(32),     /* Number of BMF Valid read hits      32382200
*                                                                @10A*/ 32426600
*       5 SMF42FEK FIXED(32),     /* Number of BMF False invalids       32471000
*                                                                @10A*/ 32515400
*       5 SMF42FEL FIXED(32),     /* Number of requests processed by    32559800
*                                    the sysplex cache manager   @10A*/ 32604400
*                                                                       32649000
*       5 SMF42FEM FIXED(32),     /* Number of CF read requests         32661300
*                                                                @10A*/ 32673600
*       5 SMF42FEN FIXED(32),     /* Number of CF write requests @10A*/ 32685900
*       5 SMF42FEO FIXED(32),     /* Number of CF read hits      @10A*/ 32698200
*       5 SMF42FEP FIXED(32),     /* Number of CF read castins   @10A*/ 32710500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 32714600
*  %DO;                           /*                             @21A*/ 32718700
*       5 SMF42FEQ                /* Number of bytes xferred into the*/ 32722800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 32735100
*  %END;                          /*                             @21A*/ 32736800
* %ELSE                           /*                             @21A*/ 32738500
*  %DO;                           /*                             @21A*/ 32740200
*       5 SMF42FEQ                /* Number of bytes xferred into the*/ 32741900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 32743600
*  %END;                          /*                             @21A*/ 32745300
*                                 /*                             @10A*/ 32747400
*       5 SMF42FER FIXED(32),     /* Number of READ  real I/O requests  32759700
*                                    to DASD.                    @10A*/ 32772000
*       5 SMF42FES FIXED(32),     /* Number of WRITE real I/O requests  32784300
*                                    to DASD.                    @10A*/ 32796600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 32800700
*  %DO;                           /*                             @21A*/ 32804800
*       5 SMF42FET                /* Number of bytes transferred to  */ 32808900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 32821200
*  %END;                          /*                             @21A*/ 32822900
* %ELSE                           /*                             @21A*/ 32824600
*  %DO;                           /*                             @21A*/ 32826300
*       5 SMF42FET                /* Number of bytes transferred to  */ 32828000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 32829700
*  %END;                          /*                             @21A*/ 32831400
*                                 /*                             @10A*/ 32833500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 32837600
*  %DO;                           /*                             @21A*/ 32841700
*       5 SMF42FEU                /* Number of bytes transferred to  */ 32845800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   32858100
*  %END;                          /*                             @21A*/ 32859800
* %ELSE                           /*                             @21A*/ 32861500
*  %DO;                           /*                             @21A*/ 32863200
*       5 SMF42FEU                /* Number of bytes transferred to  */ 32864900
*          CHAR(8),             /* DASD for the WRITE requests @10A*/   32866600
*  %END;                          /*                             @21A*/ 32868300
*                                 /*                             @10A*/ 32870400
*       5 SMF42FEV CHAR(16),      /* reserved                           32882700
*                                                                @10A*/ 32895000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 32899100
*  %DO;                           /*                             @21A*/ 32903200
*       5 SMF42FEW                 ! Total amount of time for all the   32907300
*          isa(int64bit_signed),   ! requests in this                   32919600
*                                  ! interval. (the value is expressed  32931900
*                                  ! in MILLI- seconds)          @21A   32934400
*  %END;                          /*                             @21A*/ 32936900
* %ELSE                           /*                             @21A*/ 32939400
*  %DO;                           /*                             @21A*/ 32941900
*       5 SMF42FEW                 ! Total amount of time for all the   32944400
*          CHAR(8),                ! requests in this                   32946900
*                                  ! interval. (the value is expressed  32949400
*                                  ! in MILLI- seconds)          @21A   32951900
*  %END;                          /*                             @21A*/ 32954400
*                                                                       32957300
*       5 SMF42FEX FIXED(32),     /* Average response time for all of   33001700
*                                    the requests in this interval.     33046100
*                                    (total time/number of requests)    33090500
*                                                                @10A*/ 33134900
*       5 SMF42FEY FIXED(32),     /* Normalized response time for all   33179300
*                                    of the requests in this interval   33224000
*                                    (total time/number of bytes        33274000
*                                    transfered/4K)              @10A*/ 33309000
*       5 SMF42FEZ   CHAR(8),     /* Reserved                    @10A*/ 33344000
*       5 SMF42FE7  CHAR(32),     /* Reserved                    @10A*/ 33379000
*                                                                       33414000
*                                                                       33444000
*      4 SMF42FA7,                /* RE-DO during sequential access     33474000
*                                    section                     @10A*/ 33524000
*       5 SMF42FFA FIXED(32),     /* Couple facility cache partition    33574000
*                                    number                      @10A*/ 33622400
*       5 SMF42FFB FIXED(31),     /* Total number of requests           33670800
*                                                                @10A*/ 33717600
*       5 SMF42FFC FIXED(32),     /* Total number of read requests -    33764400
*                                    NRI - No read integerity           33811200
*                                                                @10A*/ 33858000
*       5 SMF42FFD FIXED(32),     /* Total number of read requests -    33904800
*                                    consistent reads            @10A*/ 33951900
*                                                                       33999000
*       5 SMF42FFE FIXED(32),     /* Total number of write requests     34043400
*                                                                @10A*/ 34087800
*       5 SMF42FFF FIXED(32),     /* Number of BMF requests             34132200
*                                                                @10A*/ 34176600
*       5 SMF42FFG FIXED(32),     /* Number of BMF read requests        34221000
*                                                                @10A*/ 34265400
*       5 SMF42FFH FIXED(32),     /* Number of BMF write requests       34309800
*                                                                @10A*/ 34354400
*                                                                       34399000
*       5 SMF42FFI FIXED(32),     /* Number of BMF read hits            34443400
*                                                                @10A*/ 34487800
*       5 SMF42FFJ FIXED(32),     /* Number of BMF Valid read hits      34532200
*                                                                @10A*/ 34576600
*       5 SMF42FFK FIXED(32),     /* Number of BMF False invalids       34621000
*                                                                @10A*/ 34665400
*       5 SMF42FFL FIXED(32),     /* Number of requests processed by    34709800
*                                    the sysplex cache manager   @10A*/ 34754400
*                                                                       34799000
*       5 SMF42FFM FIXED(32),     /* Number of CF read requests         34811300
*                                                                @10A*/ 34823600
*       5 SMF42FFN FIXED(32),     /* Number of CF write requests @10A*/ 34835900
*       5 SMF42FFO FIXED(32),     /* Number of CF read hits      @10A*/ 34848200
*       5 SMF42FFP FIXED(32),     /* Number of CF read castins   @10A*/ 34860500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 34864600
*  %DO;                           /*                             @21A*/ 34868700
*       5 SMF42FFQ                /* Number of bytes xferred into the*/ 34872800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 34885100
*  %END;                          /*                             @21A*/ 34886800
* %ELSE                           /*                             @21A*/ 34888500
*  %DO;                           /*                             @21A*/ 34890200
*       5 SMF42FFQ                /* Number of bytes xferred into the*/ 34891900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 34893600
*  %END;                          /*                             @21A*/ 34895300
*                                 /*                             @10A*/ 34897400
*       5 SMF42FFR FIXED(32),     /* Number of READ  real I/O requests  34909700
*                                    to DASD.                    @10A*/ 34922000
*       5 SMF42FFS FIXED(32),     /* Number of WRITE real I/O requests  34934300
*                                    to DASD.                    @10A*/ 34946600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 34950700
*  %DO;                           /*                             @21A*/ 34954800
*       5 SMF42FFT                /* Number of bytes transferred to  */ 34958900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 34971200
*  %END;                          /*                             @21A*/ 34972900
* %ELSE                           /*                             @21A*/ 34974600
*  %DO;                           /*                             @21A*/ 34976300
*       5 SMF42FFT                /* Number of bytes transferred to  */ 34978000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 34979700
*  %END;                          /*                             @21A*/ 34981400
*                                 /*                             @10A*/ 34983500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 34987600
*  %DO;                           /*                             @21A*/ 34991700
*       5 SMF42FFU                /* Number of bytes transferred to  */ 34995800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   35008100
*  %END;                          /*                             @21A*/ 35009800
* %ELSE                           /*                             @21A*/ 35011500
*  %DO;                           /*                             @21A*/ 35013200
*       5 SMF42FFU                /* Number of bytes transferred to  */ 35014900
*          CHAR(8),             /* DASD for the WRITE requests @10A*/   35016600
*  %END;                          /*                             @21A*/ 35018300
*                                 /*                             @10A*/ 35020400
*       5 SMF42FFV CHAR(16),      /* reserved                           35032700
*                                                                @10A*/ 35045000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 35049100
*  %DO;                           /*                             @21A*/ 35053200
*       5 SMF42FFW                 ! Total amount of time for all the   35057300
*          isa(int64bit_signed),   ! requests in this            @21A   35069600
*                                  ! interval. (the value is expressed  35081900
*                                  ! in MILLI- seconds)          @21A   35084400
*  %END;                          /*                             @21A*/ 35086900
* %ELSE                           /*                             @21A*/ 35089400
*  %DO;                           /*                             @21A*/ 35091900
*       5 SMF42FFW                 ! Total amount of time for all the   35094400
*          CHAR(8),                ! requests in this            @21A   35096900
*                                  ! interval. (the value is expressed  35099400
*                                  ! in MILLI- seconds)          @21A   35101900
*  %END;                          /*                             @21A*/ 35104400
*                                                                       35107300
*       5 SMF42FFX FIXED(32),     /* Average response time for all of   35151700
*                                    the requests in this interval.     35196100
*                                    (total time/number of requests)    35240500
*                                                                @10A*/ 35284900
*       5 SMF42FFY FIXED(32),     /* Normalized response time for all   35329300
*                                    of the requests in this interval   35374000
*                                    (total time/number of bytes        35424000
*                                    transfered/4K)              @10A*/ 35455200
*       5 SMF42FFZ   CHAR(8),     /* Reserved                    @10A*/ 35486400
*       5 SMF42FF7  CHAR(32),     /* Reserved                    @10A*/ 35517600
*                                                                       35549000
*                                                                       35586500
*      4 SMF42FA8,                /* Read-a-head sequential access      35624000
*                                    section                     @10A*/ 35674000
*       5 SMF42FGA FIXED(32),     /* Couple facility cache partition    35724000
*                                    number                      @10A*/ 35772400
*       5 SMF42FGB FIXED(31),     /* Total number of requests           35820800
*                                                                @10A*/ 35867600
*       5 SMF42FGC FIXED(32),     /* Total number of read requests -    35914400
*                                    NRI - No read integerity           35961200
*                                                                @10A*/ 36008000
*       5 SMF42FGD FIXED(32),     /* Total number of read requests -    36054800
*                                    consistent reads            @10A*/ 36101900
*                                                                       36149000
*       5 SMF42FGE FIXED(32),     /* Total number of write requests     36193400
*                                                                @10A*/ 36237800
*       5 SMF42FGF FIXED(32),     /* Number of BMF requests             36282200
*                                                                @10A*/ 36326600
*       5 SMF42FGG FIXED(32),     /* Number of BMF read requests        36371000
*                                                                @10A*/ 36415400
*       5 SMF42FGH FIXED(32),     /* Number of BMF write requests       36459800
*                                                                @10A*/ 36504400
*                                                                       36549000
*       5 SMF42FGI FIXED(32),     /* Number of BMF read hits            36593400
*                                                                @10A*/ 36637800
*       5 SMF42FGJ FIXED(32),     /* Number of BMF Valid read hits      36682200
*                                                                @10A*/ 36726600
*       5 SMF42FGK FIXED(32),     /* Number of BMF False invalids       36771000
*                                                                @10A*/ 36815400
*       5 SMF42FGL FIXED(32),     /* Number of requests processed by    36859800
*                                    the sysplex cache manager   @10A*/ 36904400
*                                                                       36949000
*       5 SMF42FGM FIXED(32),     /* Number of CF read requests         36961300
*                                                                @10A*/ 36973600
*       5 SMF42FGN FIXED(32),     /* Number of CF write requests @10A*/ 36985900
*       5 SMF42FGO FIXED(32),     /* Number of CF read hits      @10A*/ 36998200
*       5 SMF42FGP FIXED(32),     /* Number of CF read castins   @10A*/ 37010500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 37014600
*  %DO;                           /*                             @21A*/ 37018700
*       5 SMF42FGQ                /* Number of bytes xferred into the*/ 37022800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 37035100
*  %END;                          /*                             @21A*/ 37036800
* %ELSE                           /*                             @21A*/ 37038500
*  %DO;                           /*                             @21A*/ 37040200
*       5 SMF42FGQ                /* Number of bytes xferred into the*/ 37041900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 37043600
*  %END;                          /*                             @21A*/ 37045300
*                                 /*                             @10A*/ 37047400
*       5 SMF42FGR FIXED(32),     /* Number of READ  real I/O requests  37059700
*                                    to DASD.                    @10A*/ 37072000
*       5 SMF42FGS FIXED(32),     /* Number of WRITE real I/O requests  37084300
*                                    to DASD.                    @10A*/ 37096600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 37100700
*  %DO;                           /*                             @21A*/ 37104800
*       5 SMF42FGT                /* Number of bytes transferred to  */ 37108900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 37121200
*  %END;                          /*                             @21A*/ 37122900
* %ELSE                           /*                             @21A*/ 37124600
*  %DO;                           /*                             @21A*/ 37126300
*       5 SMF42FGT                /* Number of bytes transferred to  */ 37128000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 37129700
*  %END;                          /*                             @21A*/ 37131400
*                                 /*                             @10A*/ 37133500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 37137600
*  %DO;                           /*                             @21A*/ 37141700
*       5 SMF42FGU                /* Number of bytes transferred to  */ 37145800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 37148800
*  %END;                          /*                             @21A*/ 37151800
* %ELSE                           /*                             @21A*/ 37154800
*  %DO;                           /*                             @21A*/ 37157800
*       5 SMF42FGU                /* Number of bytes transferred to  */ 37160800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 37163800
*  %END;                          /*                             @21A*/ 37166800
*                                 /*                             @10A*/ 37170400
*       5 SMF42FGV CHAR(16),      /* reserved                           37182700
*                                                                @10A*/ 37195000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 37199100
*  %DO;                           /*                             @21A*/ 37203200
*       5 SMF42FGW                 ! Total amount of time for all the   37207300
*          isa(int64bit_signed),   ! requests in this            @21A   37219600
*                                  ! interval. (the value is expressed  37231900
*                                  ! in MILLI- seconds)          @21A*/ 37234400
*  %END;                          /*                             @21A*/ 37236900
* %ELSE                           /*                             @21A*/ 37239400
*  %DO;                           /*                             @21A*/ 37241900
*       5 SMF42FGW                 ! Total amount of time for all the   37244400
*          CHAR(8),                ! requests in this            @21A   37246900
*                                  ! interval. (the value is expressed  37249400
*                                  ! in MILLI- seconds)          @21A*/ 37251900
*  %END;                          /*                             @21A*/ 37254400
*                                                                       37257300
*       5 SMF42FGX FIXED(32),     /* Average response time for all of   37301700
*                                    the requests in this interval.     37346100
*                                    (total time/number of requests)    37390500
*                                                                @10A*/ 37434900
*       5 SMF42FGY FIXED(32),     /* Normalized response time for all   37479300
*                                    of the requests in this interval   37524000
*                                    (total time/number of bytes        37574000
*                                    transfered/4K)              @10A*/ 37605200
*       5 SMF42FGZ   CHAR(8),     /* Reserved                    @10A*/ 37636400
*       5 SMF42FG7  CHAR(32),     /* Reserved                    @10A*/ 37667600
*                                                                       37699000
*                                                                       37736500
*      4 SMF42FA9,                /* PRE-FORMAT sequential access       37774000
*                                    section                     @10A*/ 37824000
*       5 SMF42FHA FIXED(32),     /* Couple facility cache partition    37874000
*                                    number                      @10A*/ 37922400
*       5 SMF42FHB FIXED(31),     /* Total number of requests           37970800
*                                                                @10A*/ 38017600
*       5 SMF42FHC FIXED(32),     /* Total number of read requests -    38064400
*                                    NRI - No read integerity           38111200
*                                                                @10A*/ 38158000
*       5 SMF42FHD FIXED(32),     /* Total number of read requests -    38204800
*                                    consistent reads            @10A*/ 38251900
*                                                                       38299000
*       5 SMF42FHE FIXED(32),     /* Total number of write requests     38343400
*                                                                @10A*/ 38387800
*       5 SMF42FHF FIXED(32),     /* Number of BMF requests             38432200
*                                                                @10A*/ 38476600
*       5 SMF42FHG FIXED(32),     /* Number of BMF read requests        38521000
*                                                                @10A*/ 38565400
*       5 SMF42FHH FIXED(32),     /* Number of BMF write requests       38609800
*                                                                @10A*/ 38654400
*                                                                       38699000
*       5 SMF42FHI FIXED(32),     /* Number of BMF read hits            38743400
*                                                                @10A*/ 38787800
*       5 SMF42FHJ FIXED(32),     /* Number of BMF Valid read hits      38832200
*                                                                @10A*/ 38876600
*       5 SMF42FHK FIXED(32),     /* Number of BMF False invalids       38921000
*                                                                @10A*/ 38965400
*       5 SMF42FHL FIXED(32),     /* Number of requests processed by    39009800
*                                    the sysplex cache manager   @10A*/ 39054400
*                                                                       39099000
*       5 SMF42FHM FIXED(32),     /* Number of CF read requests         39111300
*                                                                @10A*/ 39123600
*       5 SMF42FHN FIXED(32),     /* Number of CF write requests @10A*/ 39135900
*       5 SMF42FHO FIXED(32),     /* Number of CF read hits      @10A*/ 39148200
*       5 SMF42FHP FIXED(32),     /* Number of CF read castins   @10A*/ 39160500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 39164600
*  %DO;                           /*                             @21A*/ 39168700
*       5 SMF42FHQ                /* Number of bytes xferred into the*/ 39172800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 39185100
*  %END;                          /*                             @21A*/ 39186800
* %ELSE                           /*                             @21A*/ 39188500
*  %DO;                           /*                             @21A*/ 39190200
*       5 SMF42FHQ                /* Number of bytes xferred into the*/ 39191900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 39193600
*  %END;                          /*                             @21A*/ 39195300
*                                 /*                             @10A*/ 39197400
*       5 SMF42FHR FIXED(32),     /* Number of READ  real I/O requests  39209700
*                                    to DASD.                    @10A*/ 39222000
*       5 SMF42FHS FIXED(32),     /* Number of WRITE real I/O requests  39234300
*                                    to DASD.                    @10A*/ 39246600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 39250700
*  %DO;                           /*                             @21A*/ 39254800
*       5 SMF42FHT                /* Number of bytes transferred to  */ 39258900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 39271200
*  %END;                          /*                             @21A*/ 39272900
* %ELSE                           /*                             @21A*/ 39274600
*  %DO;                           /*                             @21A*/ 39276300
*       5 SMF42FHT                /* Number of bytes transferred to  */ 39278000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 39279700
*  %END;                          /*                             @21A*/ 39281400
*                                 /*                             @10A*/ 39283500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 39287600
*  %DO;                           /*                             @21A*/ 39291700
*       5 SMF42FHU                /* Number of bytes transferred to  */ 39295800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 39298800
*  %END;                          /*                             @21A*/ 39301800
* %ELSE                           /*                             @21A*/ 39304800
*  %DO;                           /*                             @21A*/ 39307800
*       5 SMF42FHU                /* Number of bytes transferred to  */ 39310800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 39313800
*  %END;                          /*                             @21A*/ 39316800
*                                 /*                             @10A*/ 39320400
*       5 SMF42FHV CHAR(16),      /* reserved                           39332700
*                                                                @10A*/ 39345000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 39349100
*  %DO;                           /*                             @21A*/ 39353200
*       5 SMF42FHW                 ! Total amount of time for all the   39357300
*           isa(int64bit_signed),! requests in this                     39369600
*                                  ! interval. (the value is expressed  39381900
*                                  ! in MILLI- seconds)          @21A*/ 39384400
*  %END;                          /*                             @21A*/ 39386900
* %ELSE                           /*                             @21A*/ 39389400
*  %DO;                           /*                             @21A*/ 39391900
*       5 SMF42FHW                 ! Total amount of time for all the   39394400
*          CHAR(8),              ! requests in this              @21A   39396900
*                                  ! interval. (the value is expressed  39399400
*                                  ! in MILLI- seconds)          @21A*/ 39401900
*  %END;                          /*                             @21A*/ 39404400
*                                                                       39407300
*       5 SMF42FHX FIXED(32),     /* Average response time for all of   39451700
*                                    the requests in this interval.     39496100
*                                    (total time/number of requests)    39540500
*                                                                @10A*/ 39584900
*       5 SMF42FHY FIXED(32),     /* Normalized response time for all   39629300
*                                    of the requests in this interval   39674000
*                                    (total time/number of bytes        39724000
*                                    transfered/4K)              @10A*/ 39755200
*       5 SMF42FHZ   CHAR(8),     /* Reserved                    @10A*/ 39786400
*       5 SMF42FH7  CHAR(32),     /* Reserved                    @10A*/ 39817600
*                                                                       39849000
*      /******************************************************** @10A*/ 39850300
*      /*  locking Statistics summary section                    @10A*/ 39851600
*      /******************************************************** @10A*/ 39852900
*     3 SMF42FX1,                 /* Locking Statistical Section @10A*/ 39854200
*       5 SMF42FOA   Fixed(31),   /* number of record lock       @10A*/ 39855500
*                                 /* requests                    @10A*/ 39856800
*                                 /* (obtain/alter/promote)      @10A*/ 39858100
*       5 SMF42FOB   Fixed(31),   /* number of record lock       @10A*/ 39859400
*                                 /* requests that cause true    @10A*/ 39860700
*                                 /* contention                  @10A*/ 39862000
*       5 SMF42FOC   Fixed(31),   /* number of record lock       @10A*/ 39863300
*                                 /* requests that cause False   @10A*/ 39864600
*                                 /* contention                  @10A*/ 39865900
*       5 SMF42FOD   Fixed(31),   /* number of record lock       @10A*/ 39867200
*                                 /* release lock requests       @10A*/ 39868500
*       5 SMF42FOE   Fixed(31),   /* Number of component_1 type  @10A*/ 39869800
*                                 /* lock requests               @10A*/ 39871100
*                                 /* (obtain/alter/promote)      @10A*/ 39872400
*       5 SMF42FOF   Fixed(31),   /* Number of component_1 type  @10A*/ 39873700
*                                 /* release lock requests       @10A*/ 39875000
*       5 SMF42FOG   Char(8),     /* reserved                    @10A*/ 39876300
*       5 SMF42FOH   Fixed(31),   /* Number of component_1       @10A*/ 39877600
*                                 /* class 1 (DIWA) locks        @10A*/ 39878900
*                                 /* (obtain/alter/promote)      @10A*/ 39880200
*       5 SMF42FOI   Fixed(31),   /* Number of component_1       @10A*/ 39881500
*                                 /* class 1 (DIWA) locks        @10A*/ 39882800
*                                 /* that cause true contention  @10A*/ 39884100
*       5 SMF42FOJ   Fixed(31),   /* Number of component_1       @10A*/ 39885400
*                                 /* class 1 (DIWA) locks        @10A*/ 39886700
*                                 /* that cause false contention @10A*/ 39888000
*       5 SMF42FOK   Fixed(31),   /* Number of component_1       @10A*/ 39889300
*                                 /* class 1 (DIWA) release lock @10A*/ 39890600
*                                 /* requests                    @10A*/ 39891900
*       5 SMF42FOL   Fixed(31),   /* Number of component_1       @10A*/ 39893200
*                                 /* class 2 (upgrade) locks     @10A*/ 39894500
*                                 /* (obtain/alter/promote)      @10A*/ 39895800
*       5 SMF42FOM   Fixed(31),   /* Number of component_1       @10A*/ 39897100
*                                 /* class 2 (upgrade) locks     @10A*/ 39898400
*                                 /* that cause true contention  @10A*/ 39899700
*       5 SMF42FON   Fixed(31),   /* Number of component_1       @10A*/ 39901000
*                                 /* class 2 (upgrade) locks     @10A*/ 39902300
*                                 /* that cause false contention @10A*/ 39903600
*       5 SMF42FOO   Fixed(31),   /* Number of component_1       @10A*/ 39904900
*                                 /* class 2 (upgrade)           @10A*/ 39906200
*                                 /* release lock requests       @10A*/ 39907500
*       5 SMF42FOP   Fixed(31),   /* Number of component_1       @10A*/ 39908800
*                                 /* class 3 (Preformat) locks   @10A*/ 39910100
*                                 /* (obtain/alter/promote)      @10A*/ 39911400
*       5 SMF42FOQ   Fixed(31),   /* Number of component_1       @10A*/ 39912700
*                                 /* class 3 (Preformat) locks   @10A*/ 39914000
*                                 /* that cause true contention  @10A*/ 39915300
*       5 SMF42FOR   Fixed(31),   /* Number of component_1       @10A*/ 39916600
*                                 /* class 3 (Preformat) locks   @10A*/ 39917900
*                                 /* that cause false contention @10A*/ 39919200
*       5 SMF42FOS   Fixed(31),   /* Number of component_1       @10A*/ 39920500
*                                 /* class 3 (Preformat)         @10A*/ 39921800
*                                 /* release lock requests       @10A*/ 39923100
*       5 SMF42FOT   Fixed(31),   /* Number of component_2       @10A*/ 39924400
*                                 /* lock requests               @10A*/ 39925700
*                                 /* (obtain/alter/promote)      @10A*/ 39927000
*       5 SMF42FOU   Fixed(31),   /* Number of component_2       @10A*/ 39928300
*                                 /* lock requests that caused   @10A*/ 39929600
*                                 /* true contention             @10A*/ 39930900
*       5 SMF42FOV   Fixed(31),   /* Number of component_2       @10A*/ 39932200
*                                 /* lock requests that caused   @10A*/ 39933500
*                                 /* false contention            @10A*/ 39934800
*       5 SMF42FOW   Fixed(31),   /* Number of component_2       @10A*/ 39936100
*                                 /* release lock requests       @10A*/ 39937400
*       5 SMF42FOX    Char(32),   /* reserved                    @10A*/ 39938700
*                                 /*                             @10A*/ 39940000
*      /******************************************************** @10A*/ 39941300
*      /*  Thread Level Statistical summary                      @10A*/ 39942600
*      /******************************************************** @10A*/ 39943900
*     3 SMF42FX2,                 /* Thread level section        @10A*/ 39945200
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 39945600
*  %DO;                           /*                             @21A*/ 39946000
*       5 SMF42FPR                /*                             @10A*/ 39946500
*          isa(int64bit_signed),  /* Total time all thread       @10A*/ 39947800
*                                 /* requests                    @10A*/ 39949100
*  %END;                          /*                             @21A*/ 39949200
* %ELSE                           /*                             @21A*/ 39949300
*  %DO;                           /*                             @21A*/ 39949400
*       5 SMF42FPR                /*                             @21A*/ 39949500
*          CHAR(8),               /* Total time all thread       @21A*/ 39949600
*                                 /* requests                    @21A*/ 39949700
*  %END;                          /*                             @21A*/ 39949800
*       5 SMF42FPS    Fixed(31),  /* Total number of all thread  @10A*/ 39950400
*                                 /* requests                    @10A*/ 39951700
*       5 SMF42FPT    Fixed(31),  /* reserved                    @10A*/ 39953000
*       5 SMF42FPU    Fixed(31),  /* Average response time for   @10A*/ 39954300
*                                 /* all of the thread requests  @10A*/ 39955600
*                                 /* in the interval             @10A*/ 39956900
*                                 /* (total time/number of       @10A*/ 39958200
*                                 /* thread requests)            @10A*/ 39959500
*       5 SMF42FPV    Fixed(31),  /* Normalized response time    @10A*/ 39960800
*                                 /* for all of the thread       @10A*/ 39962100
*                                 /* requests in the interval    @10A*/ 39963400
*                                 /* (total time/number of       @10A*/ 39964700
*                                 /* bytes transfered/4k)        @10A*/ 39966000
*       5 SMF42FPW    Char(8),    /* reserved                    @10A*/ 39967300
*       /******************************************************* @10A*/ 39968600
*       /* SC/SYS/CF class summary section                       @10A*/ 39969900
*       /******************************************************* @10A*/ 39971200
*   1 SMF420FB BASED(ADDR(SMF42) + SMF42FC4), /*                 @10A*/ 39972500
*    2 SMF42F1A,                  /* SC/SYS/CF class summary            39974000
*                                    section                     @10A*/ 40024000
*     3 SMF42FBA FIXED(32),       /* Interval length. This is the       40074000
*                                    total time of the measurement      40124000
*                                    period. (in seconds)        @10A*/ 40151700
*     3 SMF42F03  Char(12),       /* reserved                    @10A*/ 40179400
*                                                                       40207200
*     3 SMF42FBB FIXED(16),       /* Length of the Storage class        40224000
*                                    name                        @10A*/ 40263300
*     3 SMF42FBC CHAR(30),        /* Storage class name          @10A*/ 40302600
*                                                                       40342100
*     3 SMF42F04 FIXED(16),       /* CacheSetNameLength              */ 40360200
*     3 SMF42FBD CHAR(30),        /* CacheSetName                @10A*/ 40378300
*                                                                       40396400
*     3 SMF42FBE CHAR(8),         /* MVS system name             @10A*/ 40414500
*     3 SMF42F05 Char(8),         /* reserved                    @10A*/ 40432600
*                                                                       40450700
*     3 SMF42FBF CHAR(2),         /* reserved                    @10A*/ 40468800
*     3 SMF42FBG CHAR(30),        /* DFP cache structure  name   @10A*/ 40486900
*     3 SMF42FBH FIXED(32),       /* Number of lock requests            40505000
*                                    processed (not used)        @21A*/ 40539500
*     3 SMF42FBI FIXED(32),       /* Number of true contention          40574000
*                                    lock requests (not used)    @21A*/ 40624000
*     3 SMF42FBJ FIXED(32),       /* Number of false contention         40674000
*                                    lock requests (not used)    @21A*/ 40714000
*     3 SMF42FB2 Fixed(16),       /* SmsDirectWeight             @10A*/ 40754000
*     3 SMF42FB3 Fixed(16),       /* SmsSequentialWeight         @10A*/ 40794000
*     3 SMF42FBL CHAR(16),        /* Reserved                    @10A*/ 40834000
*     3 SMF42F1B,                 /* Direct access summary section      40874000
*                                                                @10A*/ 40924000
*      4 SMF42F1C,                /* Normal direct access summary       40974000
*                                    section                     @10A*/ 41024000
*       5 SMF42FIA FIXED(32),     /* Couple facility cache partition    41074000
*                                    number                      @10A*/ 41122400
*       5 SMF42FIB FIXED(31),     /* Total number of requests           41170800
*                                                                @10A*/ 41217600
*       5 SMF42FIC FIXED(32),     /* Total number of read requests -    41264400
*                                    NRI - No read integerity           41311200
*                                                                @10A*/ 41358000
*       5 SMF42FID FIXED(32),     /* Total number of read requests -    41404800
*                                    consistent reads            @10A*/ 41451900
*                                                                       41499000
*       5 SMF42FIE FIXED(32),     /* Total number of write requests     41543400
*                                                                @10A*/ 41587800
*       5 SMF42FIF FIXED(32),     /* Number of BMF requests             41632200
*                                                                @10A*/ 41676600
*       5 SMF42FIG FIXED(32),     /* Number of BMF read requests        41721000
*                                                                @10A*/ 41765400
*       5 SMF42FIH FIXED(32),     /* Number of BMF write requests       41809800
*                                                                @10A*/ 41854400
*                                                                       41899000
*       5 SMF42FII FIXED(32),     /* Number of BMF read hits            41943400
*                                                                @10A*/ 41987800
*       5 SMF42FIJ FIXED(32),     /* Number of BMF Valid read hits      42032200
*                                                                @10A*/ 42076600
*       5 SMF42FIK FIXED(32),     /* Number of BMF False invalids       42121000
*                                                                @10A*/ 42165400
*       5 SMF42FIL FIXED(32),     /* Number of requests processed by    42209800
*                                    the sysplex cache manager   @10A*/ 42254400
*                                                                       42299000
*       5 SMF42FIM FIXED(32),     /* Number of CF read requests         42311300
*                                                                @10A*/ 42323600
*       5 SMF42FIN FIXED(32),     /* Number of CF write requests @10A*/ 42335900
*       5 SMF42FIO FIXED(32),     /* Number of CF read hits      @10A*/ 42348200
*       5 SMF42FIP FIXED(32),     /* Number of CF read castins   @10A*/ 42360500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 42364600
*  %DO;                           /*                             @21A*/ 42368700
*       5 SMF42FIQ                /* Number of bytes xferred into the*/ 42372800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 42385100
*  %END;                          /*                             @21A*/ 42386800
* %ELSE                           /*                             @21A*/ 42388500
*  %DO;                           /*                             @21A*/ 42390200
*       5 SMF42FIQ                /* Number of bytes xferred into the*/ 42391900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 42393600
*  %END;                          /*                             @21A*/ 42395300
*                                 /*                             @10A*/ 42397400
*       5 SMF42FIR FIXED(32),     /* Number of READ  real I/O requests  42409700
*                                    to DASD.                    @10A*/ 42422000
*       5 SMF42FIS FIXED(32),     /* Number of WRITE real I/O requests  42434300
*                                    to DASD.                    @10A*/ 42446600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 42450700
*  %DO;                           /*                             @21A*/ 42454800
*       5 SMF42FIT                /* Number of bytes transferred to  */ 42458900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 42471200
*  %END;                          /*                             @21A*/ 42472900
* %ELSE                           /*                             @21A*/ 42474600
*  %DO;                           /*                             @21A*/ 42476300
*       5 SMF42FIT                /* Number of bytes transferred to  */ 42478000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 42479700
*  %END;                          /*                             @21A*/ 42481400
*                                 /*                             @10A*/ 42483500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 42487600
*  %DO;                           /*                             @21A*/ 42491700
*       5 SMF42FIU                /* Number of bytes transferred to  */ 42495800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 42498800
*  %END;                          /*                             @21A*/ 42501800
* %ELSE                           /*                             @21A*/ 42504800
*  %DO;                           /*                             @21A*/ 42507800
*       5 SMF42FIU                /* Number of bytes transferred to  */ 42510800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 42513800
*  %END;                          /*                             @21A*/ 42516800
*                                 /*                             @10A*/ 42520400
*       5 SMF42FIV CHAR(16),      /* reserved                           42532700
*                                                                @10A*/ 42545000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 42549100
*  %DO;                           /*                             @21A*/ 42553200
*       5 SMF42FIW                 ! Total amount of time for all the   42557300
*          isa(int64bit_signed), ! requests in this                     42569600
*                                  ! interval. (the value is expressed  42581900
*                                  ! in MILLI- seconds)          @21A   42584400
*  %END;                          /*                             @21A*/ 42586900
* %ELSE                           /*                             @21A*/ 42589400
*  %DO;                           /*                             @21A*/ 42591900
*       5 SMF42FIW                 ! Total amount of time for all the   42594400
*          CHAR(8),              ! requests in this              @21A   42596900
*                                  ! interval. (the value is expressed  42599400
*                                  ! in MILLI- seconds)          @21A   42601900
*  %END;                          /*                             @21A*/ 42604400
*                                                                       42607300
*       5 SMF42FIX FIXED(32),     /* Average response time for all of   42651700
*                                    the requests in this interval.     42696100
*                                    (total time/number of requests)    42740500
*                                                                @10A*/ 42784900
*       5 SMF42FIY FIXED(32),     /* Normalized response time for all   42829300
*                                    of the requests in this interval   42874000
*                                    (total time/number of bytes        42924000
*                                    transfered/4K)              @10A*/ 42955200
*       5 SMF42FIZ   CHAR(8),     /* Reserved                    @10A*/ 42986400
*       5 SMF42FI7  CHAR(32),     /* Reserved                    @10A*/ 43017600
*                                                                       43049000
*                                                                       43086500
*      4 SMF42F1D,                /* RE-DO during direct access         43124000
*                                    section                     @10A*/ 43174000
*       5 SMF42FJA FIXED(32),     /* Couple facility cache partition    43224000
*                                    number                      @10A*/ 43272400
*       5 SMF42FJB FIXED(31),     /* Total number of requests           43320800
*                                                                @10A*/ 43367600
*       5 SMF42FJC FIXED(32),     /* Total number of read requests -    43414400
*                                    NRI - No read integerity           43461200
*                                                                @10A*/ 43508000
*       5 SMF42FJD FIXED(32),     /* Total number of read requests -    43554800
*                                    consistent reads            @10A*/ 43601900
*                                                                       43649000
*       5 SMF42FJE FIXED(32),     /* Total number of write requests     43693400
*                                                                @10A*/ 43737800
*       5 SMF42FJF FIXED(32),     /* Number of BMF requests             43782200
*                                                                @10A*/ 43826600
*       5 SMF42FJG FIXED(32),     /* Number of BMF read requests        43871000
*                                                                @10A*/ 43915400
*       5 SMF42FJH FIXED(32),     /* Number of BMF write requests       43959800
*                                                                @10A*/ 44004400
*                                                                       44049000
*       5 SMF42FJI FIXED(32),     /* Number of BMF read hits            44093400
*                                                                @10A*/ 44137800
*       5 SMF42FJJ FIXED(32),     /* Number of BMF Valid read hits      44182200
*                                                                @10A*/ 44226600
*       5 SMF42FJK FIXED(32),     /* Number of BMF False invalids       44271000
*                                                                @10A*/ 44315400
*       5 SMF42FJL FIXED(32),     /* Number of requests processed by    44359800
*                                    the sysplex cache manager   @10A*/ 44404400
*                                                                       44449000
*       5 SMF42FJM FIXED(32),     /* Number of CF read requests         44461300
*                                                                @10A*/ 44473600
*       5 SMF42FJN FIXED(32),     /* Number of CF write requests @10A*/ 44485900
*       5 SMF42FJO FIXED(32),     /* Number of CF read hits      @10A*/ 44498200
*       5 SMF42FJP FIXED(32),     /* Number of CF read castins   @10A*/ 44510500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 44514600
*  %DO;                           /*                             @21A*/ 44518700
*       5 SMF42FJQ                /* Number of bytes xferred into the*/ 44522800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 44535100
*  %END;                          /*                             @21A*/ 44536800
* %ELSE                           /*                             @21A*/ 44538500
*  %DO;                           /*                             @21A*/ 44540200
*       5 SMF42FJQ                /* Number of bytes xferred into the*/ 44541900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 44543600
*  %END;                          /*                             @21A*/ 44545300
*                                 /*                             @10A*/ 44547400
*       5 SMF42FJR FIXED(32),     /* Number of READ  real I/O requests  44559700
*                                    to DASD.                    @10A*/ 44572000
*       5 SMF42FJS FIXED(32),     /* Number of WRITE real I/O requests  44584300
*                                    to DASD.                    @10A*/ 44596600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 44600700
*  %DO;                           /*                             @21A*/ 44604800
*       5 SMF42FJT                /* Number of bytes transferred to  */ 44608900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 44621200
*  %END;                          /*                             @21A*/ 44622900
* %ELSE                           /*                             @21A*/ 44624600
*  %DO;                           /*                             @21A*/ 44626300
*       5 SMF42FJT                /* Number of bytes transferred to  */ 44628000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 44629700
*  %END;                          /*                             @21A*/ 44631400
*                                 /*                             @10A*/ 44633500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 44637600
*  %DO;                           /*                             @21A*/ 44641700
*       5 SMF42FJU                /* Number of bytes transferred to  */ 44645800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 44648800
*  %END;                          /*                             @21A*/ 44651800
* %ELSE                           /*                             @21A*/ 44654800
*  %DO;                           /*                             @21A*/ 44657800
*       5 SMF42FJU                /* Number of bytes transferred to  */ 44660800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 44663800
*  %END;                          /*                             @21A*/ 44666800
*                                 /*                             @10A*/ 44670400
*       5 SMF42FJV CHAR(16),      /* reserved                           44682700
*                                                                @10A*/ 44695000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 44699100
*  %DO;                           /*                             @21A*/ 44703200
*       5 SMF42FJW                 ! Total amount of time for all the   44707300
*          isa(int64bit_signed),   ! requests in this            @21A   44719600
*                                  ! interval. (the value is expressed  44731900
*                                  ! in MILLI- seconds)          @21A   44734400
*  %END;                          /*                             @21A*/ 44736900
* %ELSE                           /*                             @21A*/ 44739400
*  %DO;                           /*                             @21A*/ 44741900
*       5 SMF42FJW                 ! Total amount of time for all the   44744400
*          CHAR(8),                ! requests in this            @21A   44746900
*                                  ! interval. (the value is expressed  44749400
*                                  ! in MILLI- seconds)          @21A   44751900
*  %END;                          /*                             @21A*/ 44754400
*                                                                       44757300
*       5 SMF42FJX FIXED(32),     /* Average response time for all of   44801700
*                                    the requests in this interval.     44846100
*                                    (total time/number of requests)    44890500
*                                                                @10A*/ 44934900
*       5 SMF42FJY FIXED(32),     /* Normalized response time for all   44979300
*                                    of the requests in this interval   45024000
*                                    (total time/number of bytes        45074000
*                                    transfered/4K)              @10A*/ 45105200
*       5 SMF42FJZ   CHAR(8),     /* Reserved                    @10A*/ 45136400
*       5 SMF42FJ7  CHAR(32),     /* Reserved                    @10A*/ 45167600
*                                                                       45199000
*                                                                       45236500
*     3 SMF42F1E,                 /* Sequential access summary section  45274000
*                                                                @10A*/ 45324000
*      4 SMF42F1F,                /* Normal sequential access section   45374000
*                                                                @10A*/ 45424000
*       5 SMF42FKA FIXED(32),     /* Couple facility cache partition    45474000
*                                    number                      @10A*/ 45522400
*       5 SMF42FKB FIXED(31),     /* Total number of requests           45570800
*                                                                @10A*/ 45617600
*       5 SMF42FKC FIXED(32),     /* Total number of read requests -    45664400
*                                    NRI - No read integerity           45711200
*                                                                @10A*/ 45758000
*       5 SMF42FKD FIXED(32),     /* Total number of read requests -    45804800
*                                    consistent reads            @10A*/ 45851900
*                                                                       45899000
*       5 SMF42FKE FIXED(32),     /* Total number of write requests     45943400
*                                                                @10A*/ 45987800
*       5 SMF42FKF FIXED(32),     /* Number of BMF requests             46032200
*                                                                @10A*/ 46076600
*       5 SMF42FKG FIXED(32),     /* Number of BMF read requests        46121000
*                                                                @10A*/ 46165400
*       5 SMF42FKH FIXED(32),     /* Number of BMF write requests       46209800
*                                                                @10A*/ 46254400
*                                                                       46299000
*       5 SMF42FKI FIXED(32),     /* Number of BMF read hits            46343400
*                                                                @10A*/ 46387800
*       5 SMF42FKJ FIXED(32),     /* Number of BMF Valid read hits      46432200
*                                                                @10A*/ 46476600
*       5 SMF42FKK FIXED(32),     /* Number of BMF False invalids       46521000
*                                                                @10A*/ 46565400
*       5 SMF42FKL FIXED(32),     /* Number of requests processed by    46609800
*                                    the sysplex cache manager   @10A*/ 46654400
*                                                                       46699000
*       5 SMF42FKM FIXED(32),     /* Number of CF read requests         46711300
*                                                                @10A*/ 46723600
*       5 SMF42FKN FIXED(32),     /* Number of CF write requests @10A*/ 46735900
*       5 SMF42FKO FIXED(32),     /* Number of CF read hits      @10A*/ 46748200
*       5 SMF42FKP FIXED(32),     /* Number of CF read castins   @10A*/ 46760500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 46764600
*  %DO;                           /*                             @21A*/ 46768700
*       5 SMF42FKQ                /* Number of bytes xferred into the*/ 46772800
*          isa(int64bit_signed),  /* DFSMS Cache structure       @21A*/ 46775800
*  %END;                          /*                             @21A*/ 46778800
* %ELSE                           /*                             @21A*/ 46781800
*  %DO;                           /*                             @21A*/ 46784800
*       5 SMF42FKQ                /* Number of bytes xferred into the*/ 46787800
*          CHAR(8),               /* DFSMS Cache structure       @21A*/ 46790800
*  %END;                          /*                             @21A*/ 46793800
*                                 /*                             @10A*/ 46797400
*       5 SMF42FKR FIXED(32),     /* Number of READ  real I/O requests  46809700
*                                    to DASD.                    @10A*/ 46822000
*       5 SMF42FKS FIXED(32),     /* Number of WRITE real I/O requests  46834300
*                                    to DASD.                    @10A*/ 46846600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 46850700
*  %DO;                           /*                             @21A*/ 46854800
*       5 SMF42FKT                /* Number of bytes transferred to  */ 46858900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 46871200
*  %END;                          /*                             @21A*/ 46872900
* %ELSE                           /*                             @21A*/ 46874600
*  %DO;                           /*                             @21A*/ 46876300
*       5 SMF42FKT                /* Number of bytes transferred to  */ 46878000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 46879700
*  %END;                          /*                             @21A*/ 46881400
*                                 /*                             @10A*/ 46883500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 46887600
*  %DO;                           /*                             @21A*/ 46891700
*       5 SMF42FKU                /* Number of bytes transferred to  */ 46895800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   46908100
*  %END;                          /*                             @21A*/ 46909800
* %ELSE                           /*                             @21A*/ 46911500
*  %DO;                           /*                             @21A*/ 46913200
*       5 SMF42FKU                /* Number of bytes transferred to  */ 46914900
*          CHAR(8),             /* DASD for the WRITE requests @10A*/   46916600
*  %END;                          /*                             @21A*/ 46918300
*                                 /*                             @10A*/ 46920400
*       5 SMF42FKV CHAR(16),      /* reserved                           46932700
*                                                                @10A*/ 46945000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 46949100
*  %DO;                           /*                             @21A*/ 46953200
*       5 SMF42FKW                 ! Total amount of time for all the   46957300
*          isa(int64bit_signed),   ! requests in this            @21A   46969600
*                                  ! interval. (the value is expressed  46981900
*                                  ! in MILLI- seconds)          @21A   46984400
*  %END;                          /*                             @21A*/ 46986900
* %ELSE                           /*                             @21A*/ 46989400
*  %DO;                           /*                             @21A*/ 46991900
*       5 SMF42FKW                 ! Total amount of time for all the   46994400
*          CHAR(8),                ! requests in this            @21A   46996900
*                                  ! interval. (the value is expressed  46999400
*                                  ! in MILLI- seconds)          @21A   47001900
*  %END;                          /*                             @21A*/ 47004400
*                                                                       47007300
*       5 SMF42FKX FIXED(32),     /* Average response time for all of   47051700
*                                    the requests in this interval.     47096100
*                                    (total time/number of requests)    47140500
*                                                                @10A*/ 47184900
*       5 SMF42FKY FIXED(32),     /* Normalized response time for all   47229300
*                                    of the requests in this interval   47274000
*                                    (total time/number of bytes        47324000
*                                    transfered/4K)              @10A*/ 47355200
*       5 SMF42FKZ   CHAR(8),     /* Reserved                    @10A*/ 47386400
*       5 SMF42FK7  CHAR(32),     /* Reserved                    @10A*/ 47417600
*                                                                       47449000
*                                                                       47486500
*      4 SMF42F1G,                /* RE-DO during sequential access     47524000
*                                    section                     @10A*/ 47574000
*       5 SMF42FLA FIXED(32),     /* Couple facility cache partition    47624000
*                                    number                      @10A*/ 47672400
*       5 SMF42FLB FIXED(31),     /* Total number of requests           47720800
*                                                                @10A*/ 47767600
*       5 SMF42FLC FIXED(32),     /* Total number of read requests -    47814400
*                                    NRI - No read integerity           47861200
*                                                                @10A*/ 47908000
*       5 SMF42FLD FIXED(32),     /* Total number of read requests -    47954800
*                                    consistent reads            @10A*/ 48001900
*                                                                       48049000
*       5 SMF42FLE FIXED(32),     /* Total number of write requests     48093400
*                                                                @10A*/ 48137800
*       5 SMF42FLF FIXED(32),     /* Number of BMF requests             48182200
*                                                                @10A*/ 48226600
*       5 SMF42FL6 FIXED(32),     /* Number of BMF read requests        48271000
*                                                                @10A*/ 48315400
*       5 SMF42FLH FIXED(32),     /* Number of BMF write requests       48359800
*                                                                @10A*/ 48404400
*                                                                       48449000
*       5 SMF42FLI FIXED(32),     /* Number of BMF read hits            48493400
*                                                                @10A*/ 48537800
*       5 SMF42FLJ FIXED(32),     /* Number of BMF Valid read hits      48582200
*                                                                @10A*/ 48626600
*       5 SMF42FLK FIXED(32),     /* Number of BMF False invalids       48671000
*                                                                @10A*/ 48715400
*       5 SMF42FLL FIXED(32),     /* Number of requests processed by    48759800
*                                    the sysplex cache manager   @10A*/ 48804400
*                                                                       48849000
*       5 SMF42FLM FIXED(32),     /* Number of CF read requests         48861300
*                                                                @10A*/ 48873600
*       5 SMF42FLN FIXED(32),     /* Number of CF write requests @10A*/ 48885900
*       5 SMF42FLO FIXED(32),     /* Number of CF read hits      @10A*/ 48898200
*       5 SMF42FLP FIXED(32),     /* Number of CF read castins   @10A*/ 48910500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 48914600
*  %DO;                           /*                             @21A*/ 48918700
*       5 SMF42FLQ                /* Number of bytes xferred into the*/ 48922800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 48935100
*  %END;                          /*                             @21A*/ 48936800
* %ELSE                           /*                             @21A*/ 48938500
*  %DO;                           /*                             @21A*/ 48940200
*       5 SMF42FLQ                /* Number of bytes xferred into the*/ 48941900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 48943600
*  %END;                          /*                             @21A*/ 48945300
*                                 /*                             @10A*/ 48947400
*       5 SMF42FLR FIXED(32),     /* Number of READ  real I/O requests  48959700
*                                    to DASD.                    @10A*/ 48972000
*       5 SMF42FLS FIXED(32),     /* Number of WRITE real I/O requests  48984300
*                                    to DASD.                    @10A*/ 48996600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 49000700
*  %DO;                           /*                             @21A*/ 49004800
*       5 SMF42FLT                /* Number of bytes transferred to  */ 49008900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 49021200
*  %END;                          /*                             @21A*/ 49022900
* %ELSE                           /*                             @21A*/ 49024600
*  %DO;                           /*                             @21A*/ 49026300
*       5 SMF42FLT                /* Number of bytes transferred to  */ 49028000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 49029700
*  %END;                          /*                             @21A*/ 49031400
*                                 /*                             @10A*/ 49033500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 49037600
*  %DO;                           /*                             @21A*/ 49041700
*       5 SMF42FLU                /* Number of bytes transferred to  */ 49045800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 49048800
*  %END;                          /*                             @21A*/ 49051800
* %ELSE                           /*                             @21A*/ 49054800
*  %DO;                           /*                             @21A*/ 49057800
*       5 SMF42FLU                /* Number of bytes transferred to  */ 49060800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 49063800
*  %END;                          /*                             @21A*/ 49066800
*                                 /*                             @10A*/ 49070400
*       5 SMF42FLV CHAR(16),      /* reserved                           49082700
*                                                                @10A*/ 49095000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 49099100
*  %DO;                           /*                             @21A*/ 49103200
*       5 SMF42FLW                 ! Total amount of time for all the   49107300
*          isa(int64bit_signed),   ! requests in this            @21A   49119600
*                                  ! interval. (the value is expressed  49131900
*                                  ! in MILLI- seconds)          @21A   49134400
*  %END;                          /*                             @21A*/ 49136900
* %ELSE                           /*                             @21A*/ 49139400
*  %DO;                           /*                             @21A*/ 49141900
*       5 SMF42FLW                 ! Total amount of time for all the   49144400
*          CHAR(8),                ! requests in this                   49146900
*                                  ! interval. (the value is expressed  49149400
*                                  ! in MILLI- seconds)          @21A   49151900
*  %END;                          /*                             @21A*/ 49154400
*                                                                       49157300
*       5 SMF42FLX FIXED(32),     /* Average response time for all of   49201700
*                                    the requests in this interval.     49246100
*                                    (total time/number of requests)    49290500
*                                                                @10A*/ 49334900
*       5 SMF42FLY FIXED(32),     /* Normalized response time for all   49379300
*                                    of the requests in this interval   49424000
*                                    (total time/number of bytes        49474000
*                                    transfered/4K)              @10A*/ 49505200
*       5 SMF42FLZ   CHAR(8),     /* Reserved                    @10A*/ 49536400
*       5 SMF42FL7  CHAR(32),     /* Reserved                    @10A*/ 49567600
*                                                                       49599000
*                                                                       49636500
*      4 SMF42F1H,                /* Read-a-head sequential access      49674000
*                                    section                     @10A*/ 49724000
*       5 SMF42FMA FIXED(32),     /* Couple facility cache partition    49774000
*                                    number                      @10A*/ 49822400
*       5 SMF42FMB FIXED(31),     /* Total number of requests           49870800
*                                                                @10A*/ 49917600
*       5 SMF42FMC FIXED(32),     /* Total number of read requests -    49964400
*                                    NRI - No read integerity           50011200
*                                                                @10A*/ 50058000
*       5 SMF42FMD FIXED(32),     /* Total number of read requests -    50104800
*                                    consistent reads            @10A*/ 50151900
*                                                                       50199000
*       5 SMF42FME FIXED(32),     /* Total number of write requests     50243400
*                                                                @10A*/ 50287800
*       5 SMF42FMF FIXED(32),     /* Number of BMF requests             50332200
*                                                                @10A*/ 50376600
*       5 SMF42FMG FIXED(32),     /* Number of BMF read requests        50421000
*                                                                @10A*/ 50465400
*       5 SMF42FMH FIXED(32),     /* Number of BMF write requests       50509800
*                                                                @10A*/ 50554400
*                                                                       50599000
*       5 SMF42FMI FIXED(32),     /* Number of BMF read hits            50643400
*                                                                @10A*/ 50687800
*       5 SMF42FMJ FIXED(32),     /* Number of BMF Valid read hits      50732200
*                                                                @10A*/ 50776600
*       5 SMF42FMK FIXED(32),     /* Number of BMF False invalids       50821000
*                                                                @10A*/ 50865400
*       5 SMF42FML FIXED(32),     /* Number of requests processed by    50909800
*                                    the sysplex cache manager   @10A*/ 50954400
*                                                                       50999000
*       5 SMF42FMM FIXED(32),     /* Number of CF read requests         51011300
*                                                                @10A*/ 51023600
*       5 SMF42FMN FIXED(32),     /* Number of CF write requests @10A*/ 51035900
*       5 SMF42FMO FIXED(32),     /* Number of CF read hits      @10A*/ 51048200
*       5 SMF42FMP FIXED(32),     /* Number of CF read castins   @10A*/ 51060500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 51064600
*  %DO;                           /*                             @21A*/ 51068700
*       5 SMF42FMQ                /* Number of bytes xferred into the*/ 51072800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 51085100
*  %END;                          /*                             @21A*/ 51086800
* %ELSE                           /*                             @21A*/ 51088500
*  %DO;                           /*                             @21A*/ 51090200
*       5 SMF42FMQ                /* Number of bytes xferred into the*/ 51091900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 51093600
*  %END;                          /*                             @21A*/ 51095300
*                                 /*                             @10A*/ 51097400
*       5 SMF42FMR FIXED(32),     /* Number of READ  real I/O requests  51109700
*                                    to DASD.                    @10A*/ 51122000
*       5 SMF42FMS FIXED(32),     /* Number of WRITE real I/O requests  51134300
*                                    to DASD.                    @10A*/ 51146600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 51150700
*  %DO;                           /*                             @21A*/ 51154800
*       5 SMF42FMT                /* Number of bytes transferred to  */ 51158900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 51171200
*  %END;                          /*                             @21A*/ 51172900
* %ELSE                           /*                             @21A*/ 51174600
*  %DO;                           /*                             @21A*/ 51176300
*       5 SMF42FMT                /* Number of bytes transferred to  */ 51178000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 51179700
*  %END;                          /*                             @21A*/ 51181400
*                                 /*                             @10A*/ 51183500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 51187600
*  %DO;                           /*                             @21A*/ 51191700
*       5 SMF42FMU                /* Number of bytes transferred to  */ 51195800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   51208100
*  %END;                          /*                             @21A*/ 51209800
* %ELSE                           /*                             @21A*/ 51211500
*  %DO;                           /*                             @21A*/ 51213200
*       5 SMF42FMU                /* Number of bytes transferred to  */ 51214900
*          CHAR(8),             /* DASD for the WRITE requests @10A*/   51216600
*  %END;                          /*                             @21A*/ 51218300
*                                 /*                             @10A*/ 51220400
*       5 SMF42FMV CHAR(16),      /* reserved                           51232700
*                                                                @10A*/ 51245000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 51249100
*  %DO;                           /*                             @21A*/ 51253200
*       5 SMF42FMW                 ! Total amount of time for all the   51257300
*          isa(int64bit_signed), ! requests in this                     51269600
*                                  ! interval. (the value is expressed  51281900
*                                  ! in MILLI- seconds)          @21A   51284400
*  %END;                          /*                             @21A*/ 51286900
* %ELSE                           /*                             @21A*/ 51289400
*  %DO;                           /*                             @21A*/ 51291900
*       5 SMF42FMW                 ! Total amount of time for all the   51294400
*          CHAR(8),              ! requests in this              @21A   51296900
*                                  ! interval. (the value is expressed  51299400
*                                  ! in MILLI- seconds)          @21A   51301900
*  %END;                          /*                             @21A*/ 51304400
*                                                                       51307300
*       5 SMF42FMX FIXED(32),     /* Average response time for all of   51351700
*                                    the requests in this interval.     51396100
*                                    (total time/number of requests)    51440500
*                                                                @10A*/ 51484900
*       5 SMF42FMY FIXED(32),     /* Normalized response time for all   51529300
*                                    of the requests in this interval   51574000
*                                    (total time/number of bytes        51624000
*                                    transfered/4K)              @10A*/ 51655200
*       5 SMF42FMZ   CHAR(8),     /* Reserved                    @10A*/ 51686400
*       5 SMF42FM7  CHAR(32),     /* Reserved                    @10A*/ 51717600
*                                                                       51749000
*                                                                       51786500
*      4 SMF42F1I,                /* PRE-FORMAT sequential access       51824000
*                                    section                     @10A*/ 51874000
*       5 SMF42FNA FIXED(32),     /* Couple facility cache partition    51924000
*                                    number                      @10A*/ 51972400
*       5 SMF42FNB FIXED(31),     /* Total number of requests           52020800
*                                                                @10A*/ 52067600
*       5 SMF42FNC FIXED(32),     /* Total number of read requests -    52114400
*                                    NRI - No read integerity           52161200
*                                                                @10A*/ 52208000
*       5 SMF42FND FIXED(32),     /* Total number of read requests -    52254800
*                                    consistent reads            @10A*/ 52301900
*                                                                       52349000
*       5 SMF42FNE FIXED(32),     /* Total number of write requests     52393400
*                                                                @10A*/ 52437800
*       5 SMF42FNF FIXED(32),     /* Number of BMF requests             52482200
*                                                                @10A*/ 52526600
*       5 SMF42FNG FIXED(32),     /* Number of BMF read requests        52571000
*                                                                @10A*/ 52615400
*       5 SMF42FNH FIXED(32),     /* Number of BMF write requests       52659800
*                                                                @10A*/ 52704400
*                                                                       52749000
*       5 SMF42FNI FIXED(32),     /* Number of BMF read hits            52793400
*                                                                @10A*/ 52837800
*       5 SMF42FNJ FIXED(32),     /* Number of BMF Valid read hits      52882200
*                                                                @10A*/ 52926600
*       5 SMF42FNK FIXED(32),     /* Number of BMF False invalids       52971000
*                                                                @10A*/ 53015400
*       5 SMF42FNL FIXED(32),     /* Number of requests processed by    53059800
*                                    the sysplex cache manager   @10A*/ 53104400
*                                                                       53149000
*       5 SMF42FNM FIXED(32),     /* Number of CF read requests         53161300
*                                                                @10A*/ 53173600
*       5 SMF42FNN FIXED(32),     /* Number of CF write requests @10A*/ 53185900
*       5 SMF42FNO FIXED(32),     /* Number of CF read hits      @10A*/ 53198200
*       5 SMF42FNP FIXED(32),     /* Number of CF read castins   @10A*/ 53210500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 53214600
*  %DO;                           /*                             @21A*/ 53218700
*       5 SMF42FNQ                /* Number of bytes xferred into the*/ 53222800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 53235100
*  %END;                          /*                             @21A*/ 53236800
* %ELSE                           /*                             @21A*/ 53238500
*  %DO;                           /*                             @21A*/ 53240200
*       5 SMF42FNQ                /* Number of bytes xferred into the*/ 53241900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 53243600
*  %END;                          /*                             @21A*/ 53245300
*                                 /*                             @10A*/ 53247400
*       5 SMF42FNR FIXED(32),     /* Number of READ  real I/O requests  53259700
*                                    to DASD.                    @10A*/ 53272000
*       5 SMF42FNS FIXED(32),     /* Number of WRITE real I/O requests  53284300
*                                    to DASD.                    @10A*/ 53296600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 53300700
*  %DO;                           /*                             @21A*/ 53304800
*       5 SMF42FNT                /* Number of bytes transferred to  */ 53308900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 53321200
*  %END;                          /*                             @21A*/ 53322900
* %ELSE                           /*                             @21A*/ 53324600
*  %DO;                           /*                             @21A*/ 53326300
*       5 SMF42FNT                /* Number of bytes transferred to  */ 53328000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 53329700
*  %END;                          /*                             @21A*/ 53331400
*                                 /*                             @10A*/ 53333500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 53337600
*  %DO;                           /*                             @21A*/ 53341700
*       5 SMF42FNU                /* Number of bytes transferred to  */ 53345800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 53348800
*  %END;                          /*                             @21A*/ 53351800
* %ELSE                           /*                             @21A*/ 53354800
*  %DO;                           /*                             @21A*/ 53357800
*       5 SMF42FNU                /* Number of bytes transferred to  */ 53360800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 53363800
*  %END;                          /*                             @21A*/ 53366800
*                                 /*                             @10A*/ 53370400
*       5 SMF42FNV CHAR(16),      /* reserved                           53382700
*                                                                @10A*/ 53395000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 53399100
*  %DO;                           /*                             @21A*/ 53403200
*       5 SMF42FNW                 ! Total amount of time for all the   53407300
*          isa(int64bit_signed),   ! requests in this            @21A   53419600
*                                  ! interval. (the value is expressed  53431900
*                                  ! in MILLI- seconds)          @21A   53434400
*  %END;                          /*                             @21A*/ 53436900
* %ELSE                           /*                             @21A*/ 53439400
*  %DO;                           /*                             @21A*/ 53441900
*       5 SMF42FNW                 ! Total amount of time for all the   53444400
*          CHAR(8),                ! requests in this            @21A   53446900
*                                  ! interval. (the value is expressed  53449400
*                                  ! in MILLI- seconds)          @21A   53451900
*  %END;                          /*                             @21A*/ 53454400
*                                                                       53457300
*       5 SMF42FNX FIXED(32),     /* Average response time for all of   53501700
*                                    the requests in this interval.     53546100
*                                    (total time/number of requests)    53590500
*                                                                @10A*/ 53634900
*       5 SMF42FNY FIXED(32),     /* Normalized response time for all   53679300
*                                    of the requests in this interval   53724000
*                                    (total time/number of bytes        53774000
*                                    transfered/4K)              @10A*/ 53805200
*       5 SMF42FNZ   CHAR(8),     /* Reserved                    @10A*/ 53836400
*       5 SMF42FN7  CHAR(32),     /* Reserved                    @10A*/ 53867600
*                                                                       53899000
*      /******************************************************** @10A*/ 53899400
*      /*  locking Statistics summary section                    @10A*/ 53899800
*      /******************************************************** @10A*/ 53900200
*      4 SMF42FX3,                /* Locking Statistical Section @10A*/ 53900600
*       5 SMF42FRA   Fixed(31),   /* number of record lock       @10A*/ 53901000
*                                 /* requests                    @10A*/ 53901400
*                                 /* (obtain/alter/promote)      @10A*/ 53901800
*       5 SMF42FRB   Fixed(31),   /* number of record lock       @10A*/ 53902200
*                                 /* requests that cause true    @10A*/ 53902600
*                                 /* contention                  @10A*/ 53903000
*       5 SMF42FRC   Fixed(31),   /* number of record lock       @10A*/ 53903400
*                                 /* requests that cause False   @10A*/ 53903800
*                                 /* contention                  @10A*/ 53904200
*       5 SMF42FRD   Fixed(31),   /* number of record lock       @10A*/ 53904600
*                                 /* release lock requests       @10A*/ 53905000
*       5 SMF42FRE   Fixed(31),   /* Number of component_1 type  @10A*/ 53905400
*                                 /* lock requests               @10A*/ 53905800
*                                 /* (obtain/alter/promote)      @10A*/ 53906200
*       5 SMF42FRF   Fixed(31),   /* Number of component_1 type  @10A*/ 53906600
*                                 /* release lock requests       @10A*/ 53907000
*       5 SMF42FRG   Char(8),     /* reserved                    @10A*/ 53907400
*       5 SMF42FRH   Fixed(31),   /* Number of component_1       @10A*/ 53907800
*                                 /* class 1 (DIWA) locks        @10A*/ 53908200
*                                 /* (obtain/alter/promote)      @10A*/ 53908600
*       5 SMF42FRI   Fixed(31),   /* Number of component_1       @10A*/ 53909000
*                                 /* class 1 (DIWA) locks        @10A*/ 53909400
*                                 /* that cause true contention  @10A*/ 53909800
*       5 SMF42FRJ   Fixed(31),   /* Number of component_1       @10A*/ 53910200
*                                 /* class 1 (DIWA) locks        @10A*/ 53910600
*                                 /* that cause false contention @10A*/ 53911000
*       5 SMF42FRK   Fixed(31),   /* Number of component_1       @10A*/ 53911400
*                                 /* class 1 (DIWA) release lock @10A*/ 53911800
*                                 /* requests                    @10A*/ 53912200
*       5 SMF42FRL   Fixed(31),   /* Number of component_1       @10A*/ 53912600
*                                 /* class 2 (upgrade) locks     @10A*/ 53913000
*                                 /* (obtain/alter/promote)      @10A*/ 53913400
*       5 SMF42FRM   Fixed(31),   /* Number of component_1       @10A*/ 53913800
*                                 /* class 2 (upgrade) locks     @10A*/ 53914200
*                                 /* that cause true contention  @10A*/ 53914600
*       5 SMF42FRN   Fixed(31),   /* Number of component_1       @10A*/ 53915000
*                                 /* class 2 (upgrade) locks     @10A*/ 53915400
*                                 /* that cause false contention @10A*/ 53915800
*       5 SMF42FRO   Fixed(31),   /* Number of component_1       @10A*/ 53916200
*                                 /* class 2 (upgrade)           @10A*/ 53916600
*                                 /* release lock requests       @10A*/ 53917000
*       5 SMF42FRP   Fixed(31),   /* Number of component_1       @10A*/ 53917400
*                                 /* class 3 (Preformat) locks   @10A*/ 53917800
*                                 /* (obtain/alter/promote)      @10A*/ 53918200
*       5 SMF42FRQ   Fixed(31),   /* Number of component_1       @10A*/ 53918600
*                                 /* class 3 (Preformat) locks   @10A*/ 53919000
*                                 /* that cause true contention  @10A*/ 53919400
*       5 SMF42FRR   Fixed(31),   /* Number of component_1       @10A*/ 53919800
*                                 /* class 3 (Preformat) locks   @10A*/ 53920200
*                                 /* that cause false contention @10A*/ 53920600
*       5 SMF42FRS   Fixed(31),   /* Number of component_1       @10A*/ 53921000
*                                 /* class 3 (Preformat)         @10A*/ 53921400
*                                 /* release lock requests       @10A*/ 53921800
*       5 SMF42FRT   Fixed(31),   /* Number of component_2       @10A*/ 53922200
*                                 /* lock requests               @10A*/ 53922600
*                                 /* (obtain/alter/promote)      @10A*/ 53923000
*       5 SMF42FRU   Fixed(31),   /* Number of component_2       @10A*/ 53923400
*                                 /* lock requests that caused   @10A*/ 53923800
*                                 /* true contention             @10A*/ 53924200
*       5 SMF42FRV   Fixed(31),   /* Number of component_2       @10A*/ 53924600
*                                 /* lock requests that caused   @10A*/ 53925000
*                                 /* false contention            @10A*/ 53925400
*       5 SMF42FRW   Fixed(31),   /* Number of component_2       @10A*/ 53925800
*                                 /* release lock requests       @10A*/ 53926200
*       5 SMF42FRX    Char(32),   /* reserved                    @10A*/ 53926600
*                                 /*                             @10A*/ 53927000
*      /******************************************************** @10A*/ 53927400
*      /*  Thread Level Statistical summary                      @10A*/ 53927800
*      /******************************************************** @10A*/ 53928200
*      4 SMF42FX4,                /* Thread level stats          @10A*/ 53928600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 53928700
*  %DO;                           /*                             @21A*/ 53928800
*       5 SMF42FQR                /*                             @10A*/ 53929000
*          isa(int64bit_signed),  /* Total time all thread       @10A*/ 53929400
*                                 /* requests                    @10A*/ 53929800
*  %END;                          /*                             @21A*/ 53929900
* %ELSE                           /*                             @21A*/ 53930000
*  %DO;                           /*                             @21A*/ 53930100
*       5 SMF42FQR                /*                             @21A*/ 53930200
*          CHAR(8),               /* Total time all thread       @21A*/ 53930300
*                                 /* requests                    @21A*/ 53930400
*  %END;                          /*                             @21A*/ 53930500
*       5 SMF42FQS    Fixed(31),  /* Total number of all thread  @10A*/ 53930600
*                                 /* requests                    @10A*/ 53930700
*       5 SMF42FQT    Fixed(31),  /* reserved                    @10A*/ 53931000
*       5 SMF42FQU    Fixed(31),  /* Average response time for   @10A*/ 53931400
*                                 /* all of the thread requests  @10A*/ 53931800
*                                 /* in the interval             @10A*/ 53932200
*                                 /* (total time/number of       @10A*/ 53932600
*                                 /* thread requests)            @10A*/ 53933000
*       5 SMF42FQV    Fixed(31),  /* Normalized response time    @10A*/ 53933400
*                                 /* for all of the thread       @10A*/ 53933800
*                                 /* requests in the interval    @10A*/ 53934200
*                                 /* (total time/number of       @10A*/ 53934600
*                                 /* bytes transfered/4k)        @10A*/ 53935000
*       5 SMF42FQW      Char(8);  /* reserved                    @10A*/ 53935400
*                                 /*                             @10A*/ 53935800
*                                                               !@21A   53949900
*                                                                       53964000
*                                                                       53991500
* %SKIP_0F: ;                                                 /* @10A*/ 54019000
* %IF SMF42_0G ^= 'YES' %THEN %GOTO SKIP_0G;                            54046500
*                                                                       54074000
*@SPACE;                                                                54124000
* /*-----------------------------------------------------------------*/ 54174000
* /* CF Dataset Response Time Summary (SMF42 subtype 16)             */ 54224000
* /*-----------------------------------------------------------------*/ 54274000
* DECLARE                                                   /*   @10A*/ 54324000
*   1 SMF420GA BASED(ADDR(SMF42) + SMF42GD1),               /*   @10A*/ 54374000
*    2 SMF42GA1,                  /* SYSPLEX wide summary        @10A*/ 54424000
*     3 SMF42GAA FIXED(32),       /* Interval length. This is the       54474000
*                                    total time of the measurement      54524000
*                                    period. (in seconds)        @10A*/ 54557300
*     3 SMF42A00  Char(12),       /* reserved                    @mdk*/ 54590600
*                                                                       54607200
*     3 SMF42GAB CHAR(44),        /* Data set name               @10A*/ 54623800
*     3 SMF42A01 Char(4),         /* reserved                    @10A*/ 54640400
*                                                                       54657200
*     3 SMF42GAC CHAR(44),        /* VSAM sphere name            @10A*/ 54673800
*     3 SMF42A02 Char(4),         /* reserved                    @10A*/ 54690400
*                                                                       54707200
*     3 SMF42GAD FIXED(16),       /* Length of the storage class        54724000
*                                    name                        @10A*/ 54764000
*     3 SMF42GAE CHAR(30),        /* Storage class name          @10A*/ 54804000
*                                                                       54844000
*     3 SMF42A03 Fixed(16),       /* CacheSetName length         @10A*/ 54864000
*     3 SMF42GAF CHAR(30),        /* CacheSet Name               @10A*/ 54884000
*                                                                       54904000
*     3 SMF42GAG CHAR(2),         /* Reserved                    @10A*/ 54930600
*     3 SMF42GAH CHAR(30),        /* DFP cache structure Name    @10A*/ 54957200
*                                                                       54984000
*     3 SMF42GAI BIT(32),         /* Indicator of component being       55004000
*                                    processed                   @10A*/ 55048000
*      4 SMF42GAI0 BIT(1),        /* Data component              @10A*/ 55092000
*      4 SMF42GAI1 BIT(1),        /* Index component             @10A*/ 55136000
*     3 SMF42GAJ   Char(12),      /* Reserved                    @10A*/ 55180000
*                                                                       55224000
*     3 SMF42GAK FIXED(32),       /* This field now contains            55246700
*                                    zeros.                      @10A*/ 55269400
*                                 /* (Used to contain:           @10A*/ 55292100
*                                 /* Number of lock requests            55314800
*                                    processed)                  @10A*/ 55337500
*     3 SMF42GAL FIXED(32),       /* This field now contains            55360200
*                                    zeros.                      @10A*/ 55382900
*                                 /* (Used to contain:           @10A*/ 55405600
*                                 /* Number of true contention          55428300
*                                    lock requests)              @10A*/ 55451000
*     3 SMF42GAM FIXED(32),       /* Number of false contention         55474000
*                                    lock requests               @10A*/ 55497200
*     3 SMF42GZ1 Fixed(16),       /* SmsDirectweight             @10A*/ 55520400
*     3 SMF42GZ2 Fixed(16),       /* SmsSequentialweight         @10A*/ 55543600
*                                                                       55566800
*     3 SMF42GAN CHAR(8),   /* In dfsms 1.4   wlm serv class name@10A*/ 55588200
*     3 SMF42GAO CHAR(8),   /* In dfsms 1.4   wlm report cls name@10A*/ 55609600
*                                                                       55631000
*     3 SMF42GAP Char(16),        /* Reserved                    @10A*/ 55652500
*     3 SMF42GA2,                 /* Direct access summary section      55674000
*                                                                @10A*/ 55724000
*      4 SMF42GA3,                /* Normal direct access summary       55774000
*                                    section                     @10A*/ 55824000
*       5 SMF42GCA FIXED(32),     /* Couple facility cache partition    55874000
*                                    number                      @10A*/ 55922400
*       5 SMF42GCB FIXED(31),     /* Total number of requests           55970800
*                                                                @10A*/ 56017600
*       5 SMF42GCC FIXED(32),     /* Total number of read requests -    56064400
*                                    NRI - No read integerity           56111200
*                                                                @10A*/ 56158000
*       5 SMF42GCD FIXED(32),     /* Total number of read requests -    56204800
*                                    consistent reads            @10A*/ 56251900
*                                                                       56299000
*       5 SMF42GCE FIXED(32),     /* Total number of write requests     56343400
*                                                                @10A*/ 56387800
*       5 SMF42GCF FIXED(32),     /* Number of BMF requests             56432200
*                                                                @10A*/ 56476600
*       5 SMF42GCG FIXED(32),     /* Number of BMF read requests        56521000
*                                                                @10A*/ 56565400
*       5 SMF42GCH FIXED(32),     /* Number of BMF write requests       56609800
*                                                                @10A*/ 56654400
*                                                                       56699000
*       5 SMF42GCI FIXED(32),     /* Number of BMF read hits            56743400
*                                                                @10A*/ 56787800
*       5 SMF42GCJ FIXED(32),     /* Number of BMF Valid read hits      56832200
*                                                                @10A*/ 56876600
*       5 SMF42GCK FIXED(32),     /* Number of BMF False invalids       56921000
*                                                                @10A*/ 56965400
*       5 SMF42GCL FIXED(32),     /* Number of requests processed by    57009800
*                                    the sysplex cache manager   @10A*/ 57054400
*                                                                       57099000
*       5 SMF42GCM FIXED(32),     /* Number of CF read requests         57111300
*                                                                @10A*/ 57123600
*       5 SMF42GCN FIXED(32),     /* Number of CF write requests @10A*/ 57135900
*       5 SMF42GCO FIXED(32),     /* Number of CF read hits      @10A*/ 57148200
*       5 SMF42GCP FIXED(32),     /* Number of CF read castins   @10A*/ 57160500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 57164600
*  %DO;                           /*                             @21A*/ 57168700
*       5 SMF42GCQ                /* Number of bytes xferred into the*/ 57172800
*          isa(int64bit_signed),  /* DFSMS Cache structure       @10A*/ 57185100
*  %END;                          /*                             @21A*/ 57186800
* %ELSE                           /*                             @21A*/ 57188500
*  %DO;                           /*                             @21A*/ 57190200
*       5 SMF42GCQ                /* Number of bytes xferred into the*/ 57191900
*          CHAR(8),               /* DFSMS Cache structure       @21A*/ 57193600
*  %END;                          /*                             @21A*/ 57195300
*                                 /*                             @10A*/ 57197400
*       5 SMF42GCR FIXED(32),     /* Number of READ  real I/O requests  57209700
*                                    to DASD.                    @10A*/ 57222000
*       5 SMF42GCS FIXED(32),     /* Number of WRITE real I/O requests  57234300
*                                    to DASD.                    @10A*/ 57246600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 57250700
*  %DO;                           /*                             @21A*/ 57254800
*       5 SMF42GCT                /* Number of bytes transferred to  */ 57258900
*          isa(int64bit_signed),  /* DASD for the READ  requests @10A*/ 57271200
*  %END;                          /*                             @21A*/ 57272900
* %ELSE                           /*                             @21A*/ 57274600
*  %DO;                           /*                             @21A*/ 57276300
*       5 SMF42GCT                /* Number of bytes transferred to  */ 57278000
*          CHAR(8),               /* DASD for the READ  requests @21A*/ 57279700
*  %END;                          /*                             @21A*/ 57281400
*                                 /*                             @10A*/ 57283500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 57287600
*  %DO;                           /*                             @21A*/ 57291700
*       5 SMF42GCU                /* Number of bytes transferred to  */ 57295800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @10A*/ 57308100
*  %END;                          /*                             @21A*/ 57309800
* %ELSE                           /*                             @21A*/ 57311500
*  %DO;                           /*                             @21A*/ 57313200
*       5 SMF42GCU                /* Number of bytes transferred to  */ 57314900
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 57316600
*  %END;                          /*                             @21A*/ 57318300
*                                 /*                             @10A*/ 57320400
*       5 SMF42GCV CHAR(16),      /* reserved                           57332700
*                                                                @10A*/ 57345000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 57349100
*  %DO;                           /*                             @21A*/ 57353200
*       5 SMF42GCW                 ! Total amount of time for all the   57357300
*          isa(int64bit_signed),   ! requests in this                   57369600
*                                  ! interval. (the value is expressed  57381900
*                                  ! in MILLI- seconds)          @21A   57384400
*  %END;                          /*                             @21A*/ 57386900
* %ELSE                           /*                             @21A*/ 57389400
*  %DO;                           /*                             @21A*/ 57391900
*       5 SMF42GCW                 ! Total amount of time for all the   57394400
*          CHAR(8),                ! requests in this            @21A   57396900
*                                  ! interval. (the value is expressed  57399400
*                                  ! in MILLI- seconds)          @21A   57401900
*  %END;                          /*                             @21A*/ 57404400
*                                                                       57407300
*       5 SMF42GCX FIXED(32),     /* Average response time for all of   57440600
*                                    the requests in this interval.     57474000
*                                    (total time/number of requests)    57524000
*                                                                @10A*/ 57574000
*       5 SMF42GCY FIXED(32),     /* Normalized response time for all   57624000
*                                    of the requests in this interval   57674000
*                                    (total time/number of bytes        57724000
*                                    transfered/4K)              @10A*/ 57755200
*       5 SMF42GCZ   CHAR(8),     /* Reserved                    @10A*/ 57786400
*       5 SMF42GC7   CHAR(32),    /* Reserved                    @21A*/ 57836400
*                                                                       57886500
*      4 SMF42GA4,                /* RE-DO during direct access         57924000
*                                    section                     @10A*/ 57974000
*       5 SMF42GDA FIXED(32),     /* Couple facility cache partition    58024000
*                                    number                      @10A*/ 58072400
*       5 SMF42GDB FIXED(31),     /* Total number of requests           58120800
*                                                                @10A*/ 58167600
*       5 SMF42GDC FIXED(32),     /* Total number of read requests -    58214400
*                                    NRI - No read integerity           58261200
*                                                                @10A*/ 58308000
*       5 SMF42GDD FIXED(32),     /* Total number of read requests -    58354800
*                                    consistent reads            @10A*/ 58401900
*                                                                       58449000
*       5 SMF42GDE FIXED(32),     /* Total number of write requests     58493400
*                                                                @10A*/ 58537800
*       5 SMF42GDF FIXED(32),     /* Number of BMF requests             58582200
*                                                                @10A*/ 58626600
*       5 SMF42GDG FIXED(32),     /* Number of BMF read requests        58671000
*                                                                @10A*/ 58715400
*       5 SMF42GDH FIXED(32),     /* Number of BMF write requests       58759800
*                                                                @10A*/ 58804400
*                                                                       58849000
*       5 SMF42GDI FIXED(32),     /* Number of BMF read hits            58893400
*                                                                @10A*/ 58937800
*       5 SMF42GDJ FIXED(32),     /* Number of BMF Valid read hits      58982200
*                                                                @10A*/ 59026600
*       5 SMF42GDK FIXED(32),     /* Number of BMF False invalids       59071000
*                                                                @10A*/ 59115400
*       5 SMF42GDL FIXED(32),     /* Number of requests processed by    59159800
*                                    the sysplex cache manager   @10A*/ 59204400
*                                                                       59249000
*       5 SMF42GDM FIXED(32),     /* Number of CF read requests         59261300
*                                                                @10A*/ 59273600
*       5 SMF42GDN FIXED(32),     /* Number of CF write requests @10A*/ 59285900
*       5 SMF42GDO FIXED(32),     /* Number of CF read hits      @10A*/ 59298200
*       5 SMF42GDP FIXED(32),     /* Number of CF read castins   @10A*/ 59310500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 59314600
*  %DO;                           /*                             @21A*/ 59318700
*       5 SMF42GDQ                /* Number of bytes xferred into the*/ 59322800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 59335100
*  %END;                          /*                             @21A*/ 59336800
* %ELSE                           /*                             @21A*/ 59338500
*  %DO;                           /*                             @21A*/ 59340200
*       5 SMF42GDQ                /* Number of bytes xferred into the*/ 59341900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 59343600
*  %END;                          /*                             @21A*/ 59345300
*                                 /*                             @10A*/ 59347400
*       5 SMF42GDR FIXED(32),     /* Number of READ  real I/O requests  59359700
*                                    to DASD.                    @10A*/ 59372000
*       5 SMF42GDS FIXED(32),     /* Number of WRITE real I/O requests  59384300
*                                    to DASD.                    @10A*/ 59396600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 59400700
*  %DO;                           /*                             @21A*/ 59404800
*       5 SMF42GDT                /* Number of bytes transferred to  */ 59408900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 59421200
*  %END;                          /*                             @21A*/ 59422900
* %ELSE                           /*                             @21A*/ 59424600
*  %DO;                           /*                             @21A*/ 59426300
*       5 SMF42GDT                /* Number of bytes transferred to  */ 59428000
*          Char(8),             /* DASD for the READ    requests @21A*/ 59429700
*  %END;                          /*                             @21A*/ 59431400
*                                 /*                             @10A*/ 59433500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 59437600
*  %DO;                           /*                             @21A*/ 59441700
*       5 SMF42GDU                /* Number of bytes transferred to  */ 59445800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 59448800
*  %END;                          /*                             @21A*/ 59451800
* %ELSE                           /*                             @21A*/ 59454800
*  %DO;                           /*                             @21A*/ 59457800
*       5 SMF42GDU                /* Number of bytes transferred to  */ 59460800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 59463800
*  %END;                          /*                             @21A*/ 59466800
*                                 /*                             @10A*/ 59470400
*       5 SMF42GDV CHAR(16),      /* reserved                           59482700
*                                                                @10A*/ 59495000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 59499100
*  %DO;                           /*                             @21A*/ 59503200
*       5 SMF42GDW                 ! Total amount of time for all the   59507300
*          isa(int64bit_signed),   ! requests in this            @21A   59519600
*                                  ! interval. (the value is expressed  59531900
*                                  ! in MILLI- seconds)          @21A   59534400
*  %END;                          /*                             @21A*/ 59536900
* %ELSE                           /*                             @21A*/ 59539400
*  %DO;                           /*                             @21A*/ 59541900
*       5 SMF42GDW                 ! Total amount of time for all the   59544400
*          CHAR(8),                ! requests in this            @21A   59546900
*                                  ! interval. (the value is expressed  59549400
*                                  ! in MILLI- seconds)          @21A   59551900
*  %END;                          /*                             @21A*/ 59554400
*                                                                       59557300
*       5 SMF42GDX FIXED(32),     /* Average response time for all of   59607300
*                                    the requests in this interval.     59657300
*                                    (total time/number of requests)    59724000
*                                                                @10A*/ 59768600
*       5 SMF42GDY FIXED(32),     /* Normalized response time for all   59813200
*                                    of the requests in this interval   59852400
*                                    (total time/number of bytes        59891600
*                                    transfered/4K)              @10A*/ 59930900
*       5 SMF42GDZ   CHAR(8),     /* Reserved                    @10A*/ 59970200
*       5 SMF42GD7   CHAR(32),    /* Reserved                    @21A*/ 60020200
*                                                                       60086500
*     3 SMF42GA5,                 /* Sequential access summary section  60124000
*                                                                @10A*/ 60174000
*      4 SMF42GA6,                /* Normal sequential access section   60224000
*                                                                @10A*/ 60274000
*       5 SMF42GEA FIXED(32),     /* Couple facility cache partition    60324000
*                                    number                      @10A*/ 60372400
*       5 SMF42GEB FIXED(31),     /* Total number of requests           60420800
*                                                                @10A*/ 60467600
*       5 SMF42GEC FIXED(32),     /* Total number of read requests -    60514400
*                                    NRI - No read integerity           60561200
*                                                                @10A*/ 60608000
*       5 SMF42GED FIXED(32),     /* Total number of read requests -    60654800
*                                    consistent reads            @10A*/ 60701900
*                                                                       60749000
*       5 SMF42GEE FIXED(32),     /* Total number of write requests     60793400
*                                                                @10A*/ 60837800
*       5 SMF42GEF FIXED(32),     /* Number of BMF requests             60882200
*                                                                @10A*/ 60926600
*       5 SMF42GEG FIXED(32),     /* Number of BMF read requests        60971000
*                                                                @10A*/ 61015400
*       5 SMF42GEH FIXED(32),     /* Number of BMF write requests       61059800
*                                                                @10A*/ 61104400
*                                                                       61149000
*       5 SMF42GEI FIXED(32),     /* Number of BMF read hits            61193400
*                                                                @10A*/ 61237800
*       5 SMF42GEJ FIXED(32),     /* Number of BMF Valid read hits      61282200
*                                                                @10A*/ 61326600
*       5 SMF42GEK FIXED(32),     /* Number of BMF False invalids       61371000
*                                                                @10A*/ 61415400
*       5 SMF42GEL FIXED(32),     /* Number of requests processed by    61459800
*                                    the sysplex cache manager   @10A*/ 61504400
*                                                                       61549000
*       5 SMF42GEM FIXED(32),     /* Number of CF read requests         61561300
*                                                                @10A*/ 61573600
*       5 SMF42GEN FIXED(32),     /* Number of CF write requests @10A*/ 61585900
*       5 SMF42GEO FIXED(32),     /* Number of CF read hits      @10A*/ 61598200
*       5 SMF42GEP FIXED(32),     /* Number of CF read castins   @10A*/ 61610500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 61614600
*  %DO;                           /*                             @21A*/ 61618700
*       5 SMF42GEQ                /* Number of bytes xferred into the*/ 61622800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 61635100
*  %END;                          /*                             @21A*/ 61636800
* %ELSE                           /*                             @21A*/ 61638500
*  %DO;                           /*                             @21A*/ 61640200
*       5 SMF42GEQ                /* Number of bytes xferred into the*/ 61641900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 61643600
*  %END;                          /*                             @21A*/ 61645300
*                                 /*                             @10A*/ 61647400
*       5 SMF42GER FIXED(32),     /* Number of READ  real I/O requests  61659700
*                                    to DASD.                    @10A*/ 61672000
*       5 SMF42GES FIXED(32),     /* Number of WRITE real I/O requests  61684300
*                                    to DASD.                    @10A*/ 61696600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 61700700
*  %DO;                           /*                             @21A*/ 61704800
*       5 SMF42GET                /* Number of bytes transferred to  */ 61708900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 61721200
*  %END;                          /*                             @21A*/ 61722900
* %ELSE                           /*                             @21A*/ 61724600
*  %DO;                           /*                             @21A*/ 61726300
*       5 SMF42GET                /* Number of bytes transferred to  */ 61728000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 61729700
*  %END;                          /*                             @21A*/ 61731400
*                                 /*                             @10A*/ 61733500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 61737600
*  %DO;                           /*                             @21A*/ 61741700
*       5 SMF42GEU                /* Number of bytes transferred to  */ 61745800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   61758100
*  %END;                          /*                             @21A*/ 61759800
* %ELSE                           /*                             @21A*/ 61761500
*  %DO;                           /*                             @21A*/ 61763200
*       5 SMF42GEU                /* Number of bytes transferred to  */ 61764900
*          CHAR(8),             /* DASD for the WRITE requests @10A*/   61766600
*  %END;                          /*                             @21A*/ 61768300
*                                 /*                             @10A*/ 61770400
*       5 SMF42GEV CHAR(16),      /* reserved                           61782700
*                                                                @10A*/ 61795000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 61799100
*  %DO;                           /*                             @21A*/ 61803200
*       5 SMF42GEW                 ! Total amount of time for all the   61807300
*          isa(int64bit_signed), ! requests in this                     61819600
*                                  ! interval. (the value is expressed  61831900
*                                  ! in MILLI- seconds)          @21A   61834400
*  %END;                          /*                             @21A*/ 61836900
* %ELSE                           /*                             @21A*/ 61839400
*  %DO;                           /*                             @21A*/ 61841900
*       5 SMF42GEW                 ! Total amount of time for all the   61844400
*          CHAR(8),              ! requests in this              @21A   61846900
*                                  ! interval. (the value is expressed  61849400
*                                  ! in MILLI- seconds)          @21A   61851900
*  %END;                          /*                             @21A*/ 61854400
*                                                                       61857300
*       5 SMF42GEX FIXED(32),     /* Average response time for all of   61901700
*                                    the requests in this interval.     61946100
*                                    (total time/number of requests)    61990500
*                                                                @10A*/ 62034900
*       5 SMF42GEY FIXED(32),     /* Normalized response time for all   62079300
*                                    of the requests in this interval   62124000
*                                    (total time/number of bytes        62174000
*                                    transfered/4K)              @10A*/ 62205200
*       5 SMF42GEZ   CHAR(8),     /* Reserved                    @10A*/ 62236400
*       5 SMF42GE7   CHAR(32),    /* Reserved                    @21A*/ 62286400
*                                                                       62336500
*      4 SMF42GA7,                /* RE-DO during sequential access     62374000
*                                    section                     @10A*/ 62424000
*       5 SMF42GFA FIXED(32),     /* Couple facility cache partition    62474000
*                                    number                      @10A*/ 62522400
*       5 SMF42GFB FIXED(31),     /* Total number of requests           62570800
*                                                                @10A*/ 62617600
*       5 SMF42GFC FIXED(32),     /* Total number of read requests -    62664400
*                                    NRI - No read integerity           62711200
*                                                                @10A*/ 62758000
*       5 SMF42GFD FIXED(32),     /* Total number of read requests -    62804800
*                                    consistent reads            @10A*/ 62851900
*                                                                       62899000
*       5 SMF42GFE FIXED(32),     /* Total number of write requests     62943400
*                                                                @10A*/ 62987800
*       5 SMF42GFF FIXED(32),     /* Number of BMF requests             63032200
*                                                                @10A*/ 63076600
*       5 SMF42GFG FIXED(32),     /* Number of BMF read requests        63121000
*                                                                @10A*/ 63165400
*       5 SMF42GFH FIXED(32),     /* Number of BMF write requests       63209800
*                                                                @10A*/ 63254400
*                                                                       63299000
*       5 SMF42GFI FIXED(32),     /* Number of BMF read hits            63343400
*                                                                @10A*/ 63387800
*       5 SMF42GFJ FIXED(32),     /* Number of BMF Valid read hits      63432200
*                                                                @10A*/ 63476600
*       5 SMF42GFK FIXED(32),     /* Number of BMF False invalids       63521000
*                                                                @10A*/ 63565400
*       5 SMF42GFL FIXED(32),     /* Number of requests processed by    63609800
*                                    the sysplex cache manager   @10A*/ 63654400
*                                                                       63699000
*       5 SMF42GFM FIXED(32),     /* Number of CF read requests         63711300
*                                                                @10A*/ 63723600
*       5 SMF42GFN FIXED(32),     /* Number of CF write requests @10A*/ 63735900
*       5 SMF42GFO FIXED(32),     /* Number of CF read hits      @10A*/ 63748200
*       5 SMF42GFP FIXED(32),     /* Number of CF read castins   @10A*/ 63760500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 63764600
*  %DO;                           /*                             @21A*/ 63768700
*       5 SMF42GFQ                /* Number of bytes xferred into the*/ 63772800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 63785100
*  %END;                          /*                             @21A*/ 63786800
* %ELSE                           /*                             @21A*/ 63788500
*  %DO;                           /*                             @21A*/ 63790200
*       5 SMF42GFQ                /* Number of bytes xferred into the*/ 63791900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 63793600
*  %END;                          /*                             @21A*/ 63795300
*                                 /*                             @10A*/ 63797400
*       5 SMF42GFR FIXED(32),     /* Number of READ  real I/O requests  63809700
*                                    to DASD.                    @10A*/ 63822000
*       5 SMF42GFS FIXED(32),     /* Number of WRITE real I/O requests  63834300
*                                    to DASD.                    @10A*/ 63846600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 63850700
*  %DO;                           /*                             @21A*/ 63854800
*       5 SMF42GFT                /* Number of bytes transferred to  */ 63858900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 63871200
*  %END;                          /*                             @21A*/ 63872900
* %ELSE                           /*                             @21A*/ 63874600
*  %DO;                           /*                             @21A*/ 63876300
*       5 SMF42GFT                /* Number of bytes transferred to  */ 63878000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 63879700
*  %END;                          /*                             @21A*/ 63881400
*                                 /*                             @10A*/ 63883500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 63887600
*  %DO;                           /*                             @21A*/ 63891700
*       5 SMF42GFU                /* Number of bytes transferred to  */ 63895800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 63898800
*  %END;                          /*                             @21A*/ 63901800
* %ELSE                           /*                             @21A*/ 63904800
*  %DO;                           /*                             @21A*/ 63907800
*       5 SMF42GFU                /* Number of bytes transferred to  */ 63910800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 63913800
*  %END;                          /*                             @21A*/ 63916800
*                                 /*                             @10A*/ 63920400
*       5 SMF42GFV CHAR(16),      /* reserved                           63932700
*                                                                @10A*/ 63945000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 63949100
*  %DO;                           /*                             @21A*/ 63953200
*       5 SMF42GFW                 ! Total amount of time for all the   63957300
*          isa(int64bit_signed), ! requests in this                     63969600
*                                  ! interval. (the value is expressed  63981900
*                                  ! in MILLI- seconds)          @21A   63984400
*  %END;                          /*                             @21A*/ 63986900
* %ELSE                           /*                             @21A*/ 63989400
*  %DO;                           /*                             @21A*/ 63991900
*       5 SMF42GFW                 ! Total amount of time for all the   63994400
*          CHAR(8),              ! requests in this              @21A   63996900
*                                  ! interval. (the value is expressed  63999400
*                                  ! in MILLI- seconds)          @21A   64001900
*  %END;                          /*                             @21A*/ 64004400
*                                                                       64007300
*       5 SMF42GFX FIXED(32),     /* Average response time for all of   64051700
*                                    the requests in this interval.     64096100
*                                    (total time/number of requests)    64140500
*                                                                @10A*/ 64184900
*       5 SMF42GFY FIXED(32),     /* Normalized response time for all   64229300
*                                    of the requests in this interval   64274000
*                                    (total time/number of bytes        64324000
*                                    transfered/4K)              @10A*/ 64355200
*       5 SMF42GFZ   CHAR(8),     /* Reserved                    @10A*/ 64386400
*       5 SMF42GF7   CHAR(32),    /* Reserved                    @21A*/ 64436400
*                                                                       64486500
*      4 SMF42GA8,                /* Read-a-head sequential access      64524000
*                                    section                     @10A*/ 64574000
*       5 SMF42GGA FIXED(32),     /* Couple facility cache partition    64624000
*                                    number                      @10A*/ 64672400
*       5 SMF42GGB FIXED(31),     /* Total number of requests           64720800
*                                                                @10A*/ 64767600
*       5 SMF42GGC FIXED(32),     /* Total number of read requests -    64814400
*                                    NRI - No read integerity           64861200
*                                                                @10A*/ 64908000
*       5 SMF42GGD FIXED(32),     /* Total number of read requests -    64954800
*                                    consistent reads            @10A*/ 65001900
*                                                                       65049000
*       5 SMF42GGE FIXED(32),     /* Total number of write requests     65093400
*                                                                @10A*/ 65137800
*       5 SMF42GGF FIXED(32),     /* Number of BMF requests             65182200
*                                                                @10A*/ 65226600
*       5 SMF42GGG FIXED(32),     /* Number of BMF read requests        65271000
*                                                                @10A*/ 65315400
*       5 SMF42GGH FIXED(32),     /* Number of BMF write requests       65359800
*                                                                @10A*/ 65404400
*                                                                       65449000
*       5 SMF42GGI FIXED(32),     /* Number of BMF read hits            65493400
*                                                                @10A*/ 65537800
*       5 SMF42GGJ FIXED(32),     /* Number of BMF Valid read hits      65582200
*                                                                @10A*/ 65626600
*       5 SMF42GGK FIXED(32),     /* Number of BMF False invalids       65671000
*                                                                @10A*/ 65715400
*       5 SMF42GGL FIXED(32),     /* Number of requests processed by    65759800
*                                    the sysplex cache manager   @10A*/ 65804400
*                                                                       65849000
*       5 SMF42GGM FIXED(32),     /* Number of CF read requests         65861300
*                                                                @10A*/ 65873600
*       5 SMF42GGN FIXED(32),     /* Number of CF write requests @10A*/ 65885900
*       5 SMF42GGO FIXED(32),     /* Number of CF read hits      @10A*/ 65898200
*       5 SMF42GGP FIXED(32),     /* Number of CF read castins   @10A*/ 65910500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 65914600
*  %DO;                           /*                             @21A*/ 65918700
*       5 SMF42GGQ                /* Number of bytes xferred into the*/ 65922800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 65935100
*  %END;                          /*                             @21A*/ 65936800
* %ELSE                           /*                             @21A*/ 65938500
*  %DO;                           /*                             @21A*/ 65940200
*       5 SMF42GGQ                /* Number of bytes xferred into the*/ 65941900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 65943600
*  %END;                          /*                             @21A*/ 65945300
*                                 /*                             @10A*/ 65947400
*       5 SMF42GGR FIXED(32),     /* Number of READ  real I/O requests  65959700
*                                    to DASD.                    @10A*/ 65972000
*       5 SMF42GGS FIXED(32),     /* Number of WRITE real I/O requests  65984300
*                                    to DASD.                    @10A*/ 65996600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 66000700
*  %DO;                           /*                             @21A*/ 66004800
*       5 SMF42GGT                /* Number of bytes transferred to  */ 66008900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 66021200
*  %END;                          /*                             @21A*/ 66022900
* %ELSE                           /*                             @21A*/ 66024600
*  %DO;                           /*                             @21A*/ 66026300
*       5 SMF42GGT                /* Number of bytes transferred to  */ 66028000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 66029700
*  %END;                          /*                             @21A*/ 66031400
*                                 /*                             @10A*/ 66033500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 66037600
*  %DO;                           /*                             @21A*/ 66041700
*       5 SMF42GGU                /* Number of bytes transferred to  */ 66045800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   66058100
*  %END;                          /*                             @21A*/ 66059800
* %ELSE                           /*                             @21A*/ 66061500
*  %DO;                           /*                             @21A*/ 66063200
*       5 SMF42GGU                /* Number of bytes transferred to  */ 66064900
*          CHAR(8),             /* DASD for the WRITE requests @21A*/   66066600
*  %END;                          /*                             @21A*/ 66068300
*                                 /*                             @10A*/ 66070400
*       5 SMF42GGV CHAR(16),      /* reserved                           66082700
*                                                                @10A*/ 66095000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 66099100
*  %DO;                           /*                             @21A*/ 66103200
*       5 SMF42GGW                 ! Total amount of time for all the   66107300
*          isa(int64bit_signed),   ! requests in this            @21A   66119600
*                                  ! interval. (the value is expressed  66131900
*                                  ! in MILLI- seconds)          @21A   66134400
*  %END;                          /*                             @21A*/ 66136900
* %ELSE                           /*                             @21A*/ 66139400
*  %DO;                           /*                             @21A*/ 66141900
*       5 SMF42GGW                 ! Total amount of time for all the   66144400
*          CHAR(8),                ! requests in this            @21A   66146900
*                                  ! interval. (the value is expressed  66149400
*                                  ! in MILLI- seconds)          @21A   66151900
*  %END;                          /*                             @21A*/ 66154400
*                                                                       66157300
*       5 SMF42GGX FIXED(32),     /* Average response time for all of   66201700
*                                    the requests in this interval.     66246100
*                                    (total time/number of requests)    66290500
*                                                                @10A*/ 66334900
*       5 SMF42GGY FIXED(32),     /* Normalized response time for all   66379300
*                                    of the requests in this interval   66424000
*                                    (total time/number of bytes        66474000
*                                    transfered/4K)              @10A*/ 66505200
*       5 SMF42GGZ   CHAR(8),     /* Reserved                    @10A*/ 66536400
*       5 SMF42GG7   CHAR(32),    /* Reserved                    @21A*/ 66586400
*                                                                       66636500
*      4 SMF42GA9,                /* PRE-FORMAT sequential access       66674000
*                                    section                     @10A*/ 66724000
*       5 SMF42GHA FIXED(32),     /* Couple facility cache partition    66774000
*                                    number                      @10A*/ 66822400
*       5 SMF42GHB FIXED(31),     /* Total number of requests           66870800
*                                                                @10A*/ 66917600
*       5 SMF42GHC FIXED(32),     /* Total number of read requests -    66964400
*                                    NRI - No read integerity           67011200
*                                                                @10A*/ 67058000
*       5 SMF42GHD FIXED(32),     /* Total number of read requests -    67104800
*                                    consistent reads            @10A*/ 67151900
*                                                                       67199000
*       5 SMF42GHE FIXED(32),     /* Total number of write requests     67243400
*                                                                @10A*/ 67287800
*       5 SMF42GHF FIXED(32),     /* Number of BMF requests             67332200
*                                                                @10A*/ 67376600
*       5 SMF42GHG FIXED(32),     /* Number of BMF read requests        67421000
*                                                                @10A*/ 67465400
*       5 SMF42GHH FIXED(32),     /* Number of BMF write requests       67509800
*                                                                @10A*/ 67554400
*                                                                       67599000
*       5 SMF42GHI FIXED(32),     /* Number of BMF read hits            67643400
*                                                                @10A*/ 67687800
*       5 SMF42GHJ FIXED(32),     /* Number of BMF Valid read hits      67732200
*                                                                @10A*/ 67776600
*       5 SMF42GHK FIXED(32),     /* Number of BMF False invalids       67821000
*                                                                @10A*/ 67865400
*       5 SMF42GHL FIXED(32),     /* Number of requests processed by    67909800
*                                    the sysplex cache manager   @10A*/ 67954400
*                                                                       67999000
*       5 SMF42GHM FIXED(32),     /* Number of CF read requests         68011300
*                                                                @10A*/ 68023600
*       5 SMF42GHN FIXED(32),     /* Number of CF write requests @10A*/ 68035900
*       5 SMF42GHO FIXED(32),     /* Number of CF read hits      @10A*/ 68048200
*       5 SMF42GHP FIXED(32),     /* Number of CF read castins   @10A*/ 68060500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 68064600
*  %DO;                           /*                             @21A*/ 68068700
*       5 SMF42GHQ                /* Number of bytes xferred into the*/ 68072800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 68085100
*  %END;                          /*                             @21A*/ 68086800
* %ELSE                           /*                             @21A*/ 68088500
*  %DO;                           /*                             @21A*/ 68090200
*       5 SMF42GHQ                /* Number of bytes xferred into the*/ 68091900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 68093600
*  %END;                          /*                             @21A*/ 68095300
*                                 /*                             @10A*/ 68097400
*       5 SMF42GHR FIXED(32),     /* Number of READ  real I/O requests  68109700
*                                    to DASD.                    @10A*/ 68122000
*       5 SMF42GHS FIXED(32),     /* Number of WRITE real I/O requests  68134300
*                                    to DASD.                    @10A*/ 68146600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 68150700
*  %DO;                           /*                             @21A*/ 68154800
*       5 SMF42GHT                /* Number of bytes transferred to  */ 68158900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 68171200
*  %END;                          /*                             @21A*/ 68172900
* %ELSE                           /*                             @21A*/ 68174600
*  %DO;                           /*                             @21A*/ 68176300
*       5 SMF42GHT                /* Number of bytes transferred to  */ 68178000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 68179700
*  %END;                          /*                             @21A*/ 68181400
*                                 /*                             @10A*/ 68183500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 68187600
*  %DO;                           /*                             @21A*/ 68191700
*       5 SMF42GHU                /* Number of bytes transferred to  */ 68195800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   68208100
*  %END;                          /*                             @21A*/ 68209800
* %ELSE                           /*                             @21A*/ 68211500
*  %DO;                           /*                             @21A*/ 68213200
*       5 SMF42GHU                /* Number of bytes transferred to  */ 68214900
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 68216600
*  %END;                          /*                             @21A*/ 68218300
*                                 /*                             @10A*/ 68220400
*       5 SMF42GHV CHAR(16),      /* reserved                           68232700
*                                                                @10A*/ 68245000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 68249100
*  %DO;                           /*                             @21A*/ 68253200
*       5 SMF42GHW                 ! Total amount of time for all the   68257300
*          isa(int64bit_signed),   ! requests in this            @21A   68269600
*                                  ! interval. (the value is expressed  68281900
*                                  ! in MILLI- seconds)          @21A*/ 68284400
*  %END;                          /*                             @21A*/ 68286900
* %ELSE                           /*                             @21A*/ 68289400
*  %DO;                           /*                             @21A*/ 68291900
*       5 SMF42GHW                 ! Total amount of time for all the   68294400
*          CHAR(8),                ! requests in this            @21A   68296900
*                                  ! interval. (the value is expressed  68299400
*                                  ! in MILLI- seconds)          @21A*/ 68301900
*  %END;                          /*                             @21A*/ 68304400
*                                                                       68307300
*       5 SMF42GHX FIXED(32),     /* Average response time for all of   68351700
*                                    the requests in this interval.     68396100
*                                    (total time/number of requests)    68440500
*                                                                @10A*/ 68484900
*       5 SMF42GHY FIXED(32),     /* Normalized response time for all   68529300
*                                    of the requests in this interval   68574000
*                                    (total time/number of bytes        68624000
*                                    transfered/4K)              @10A*/ 68655200
*       5 SMF42GHZ   CHAR(8),     /* Reserved                    @10A*/ 68686400
*       5 SMF42GH7   CHAR(32),    /* Reserved                    @21A*/ 68717700
*                                                                       68749000
*      /******************************************************** @10A*/ 68749500
*      /*  locking Statistics summary section                    @10A*/ 68750000
*      /******************************************************** @10A*/ 68750500
*      4 SMF42FX5,                /* Locking Statistical Section @10A*/ 68751000
*       5 SMF42GPA   Fixed(31),   /* number of record lock       @10A*/ 68751500
*                                 /* requests                    @10A*/ 68752000
*                                 /* (obtain/alter/promote)      @10A*/ 68752500
*       5 SMF42GPB   Fixed(31),   /* number of record lock       @10A*/ 68753000
*                                 /* requests that cause true    @10A*/ 68753500
*                                 /* contention                  @10A*/ 68754000
*       5 SMF42GPC   Fixed(31),   /* number of record lock       @10A*/ 68754500
*                                 /* requests that cause False   @10A*/ 68755000
*                                 /* contention                  @10A*/ 68755500
*       5 SMF42GPD   Fixed(31),   /* number of record lock       @10A*/ 68756000
*                                 /* release lock requests       @10A*/ 68756500
*       5 SMF42GPE   Fixed(31),   /* Number of component_1 type  @10A*/ 68757000
*                                 /* lock requests               @10A*/ 68757500
*                                 /* (obtain/alter/promote)      @10A*/ 68758000
*       5 SMF42GPF   Fixed(31),   /* Number of component_1 type  @10A*/ 68758500
*                                 /* release lock requests       @10A*/ 68759000
*       5 SMF42GPG   Char(8),     /* reserved                    @10A*/ 68759500
*       5 SMF42GPH   Fixed(31),   /* Number of component_1       @10A*/ 68760000
*                                 /* class 1 (DIWA) locks        @10A*/ 68760500
*                                 /* (obtain/alter/promote)      @10A*/ 68761000
*       5 SMF42GPI   Fixed(31),   /* Number of component_1       @10A*/ 68761500
*                                 /* class 1 (DIWA) locks        @10A*/ 68762000
*                                 /* that cause true contention  @10A*/ 68762500
*       5 SMF42GPJ   Fixed(31),   /* Number of component_1       @10A*/ 68763000
*                                 /* class 1 (DIWA) locks        @10A*/ 68763500
*                                 /* that cause false contention @10A*/ 68764000
*       5 SMF42GPK   Fixed(31),   /* Number of component_1       @10A*/ 68764500
*                                 /* class 1 (DIWA) release lock @10A*/ 68765000
*                                 /* requests                    @10A*/ 68765500
*       5 SMF42GPL   Fixed(31),   /* Number of component_1       @10A*/ 68766000
*                                 /* class 2 (upgrade) locks     @10A*/ 68766500
*                                 /* (obtain/alter/promote)      @10A*/ 68767000
*       5 SMF42GPM   Fixed(31),   /* Number of component_1       @10A*/ 68767500
*                                 /* class 2 (upgrade) locks     @10A*/ 68768000
*                                 /* that cause true contention  @10A*/ 68768500
*       5 SMF42GPN   Fixed(31),   /* Number of component_1       @10A*/ 68769000
*                                 /* class 2 (upgrade) locks     @10A*/ 68769500
*                                 /* that cause false contention @10A*/ 68770000
*       5 SMF42GPO   Fixed(31),   /* Number of component_1       @10A*/ 68770500
*                                 /* class 2 (upgrade)           @10A*/ 68771000
*                                 /* release lock requests       @10A*/ 68771500
*       5 SMF42GPP   Fixed(31),   /* Number of component_1       @10A*/ 68772000
*                                 /* class 3 (Preformat) locks   @10A*/ 68772500
*                                 /* (obtain/alter/promote)      @10A*/ 68773000
*       5 SMF42GPQ   Fixed(31),   /* Number of component_1       @10A*/ 68773500
*                                 /* class 3 (Preformat) locks   @10A*/ 68774000
*                                 /* that cause true contention  @10A*/ 68774500
*       5 SMF42GPR   Fixed(31),   /* Number of component_1       @10A*/ 68775000
*                                 /* class 3 (Preformat) locks   @10A*/ 68775500
*                                 /* that cause false contention @10A*/ 68776000
*       5 SMF42GPS   Fixed(31),   /* Number of component_1       @10A*/ 68776500
*                                 /* class 3 (Preformat)         @10A*/ 68777000
*                                 /* release lock requests       @10A*/ 68777500
*       5 SMF42GPT   Fixed(31),   /* Number of component_2       @10A*/ 68778000
*                                 /* lock requests               @10A*/ 68778500
*                                 /* (obtain/alter/promote)      @10A*/ 68779000
*       5 SMF42GPU   Fixed(31),   /* Number of component_2       @10A*/ 68779500
*                                 /* lock requests that caused   @10A*/ 68780000
*                                 /* true contention             @10A*/ 68780500
*       5 SMF42GPV   Fixed(31),   /* Number of component_2       @10A*/ 68781000
*                                 /* lock requests that caused   @10A*/ 68781500
*                                 /* false contention            @10A*/ 68782000
*       5 SMF42GPW   Fixed(31),   /* Number of component_2       @10A*/ 68782500
*                                 /* release lock requests       @10A*/ 68783000
*       5 SMF42GPX    Char(32),   /* reserved                    @10A*/ 68783500
*                                                                       68783600
*      /******************************************************** @21A*/ 68783700
*      /*  DataSet BMF LRU statistical section                   @21A*/ 68783800
*      /******************************************************** @21A*/ 68783900
*      4 SMF42FX7,                /* DataSet BMF LRU stats       @21A*/ 68784000
*                                                                       68784100
*       5 SMF42GRA Fixed(32),     /* NUMBER OF REDOS             @21A*/ 68784200
*       5 SMF42GRB Fixed(32),     /* NUMBER OF RECURSIVE REDOS   @21A*/ 68784300
*       5 SMF42GRC Fixed(32),     /* NUMBER OF BMF WRITES        @21A*/ 68784400
*       5 SMF42GRD Fixed(32),     /* NUMBER OF SCM READ REQUESTS @21A*/ 68784500
*       5 SMF42GRE Fixed(32),     /* NUMBER OF SCM READ REQUESTS @21A*/ 68784600
*                                 /* THAT ENCOUNTERED CASTOUT    @21A*/ 68784700
*                                 /* LOCK CONTENTION             @21A*/ 68784800
*       5 SMF42GRG Fixed(31),     /* REDO PERCENT                @21A*/ 68784900
*       5 SMF42GRH Fixed(31),     /* RECURSIVE REDO PERCENT      @21A*/ 68785000
*       5 SMF42GRI Fixed(31),     /* SCM CASTOUT LOCK PERCENT    @21A*/ 68785100
*       5 SMF42GRF Char(12),      /* RESERVED                    @21A*/ 68785200
*       5 SMF42GRJ Char(4),       /* RESERVED                    @21A*/ 68785300
*       5 SMF42GRK Char(16),      /* RESERVED                    @21A*/ 68785400
*                                                                       68786500
*   1 SMF420GB BASED(ADDR(SMF42) + SMF42GD4), /*                 @10A*/ 68830200
*    2 SMF42G1A,                  /* Data set/MVS system summary        68874000
*                                    section                     @10A*/ 68902700
*     3 SMF42GBA FIXED(32),       /* Interval length. This is the       68931500
*                                    total time of the measurement      68939000
*                                    period. (in seconds)        @10A*/ 68946500
*     3 SMF42A05 Char(12),        /* reserved                    @10A*/ 68954000
*                                                                       68961500
*     3 SMF42GBB CHAR(44),        /* Data set name               @10A*/ 68969000
*     3 SMF42A06 Char(4),         /* reserved                    @10A*/ 68976500
*                                                                       68984000
*     3 SMF42GBC CHAR(44),        /* VSAM sphere name            @10A*/ 68991500
*     3 SMF42A07 Char(4),         /* reserved                    @10A*/ 68999000
*                                                                       69006500
*     3 SMF42GBD FIXED(16),       /* Length of the storage class        69014000
*                                    name                        @10A*/ 69021500
*     3 SMF42GBE CHAR(30),        /* Storage class name          @10A*/ 69029000
*                                                                       69036500
*     3 SMF42A08 Fixed(16),       /* CacheSetName length         @10A*/ 69044000
*     3 SMF42GBF CHAR(30),        /* CacheSet Name               @10A*/ 69051500
*                                                                       69059000
*     3 SMF42A12 Fixed(16),       /* reserved                    @10A*/ 69064000
*     3 SMF42GBG CHAR(30),        /* DFP cache structure Name    @10A*/ 69069000
*                                                                       69074000
*     3 SMF42GBH CHAR(8),         /* Mvs System Name             @10A*/ 69081500
*     3 SMF42A11 Char(8),         /* reserved                    @10A*/ 69089000
*                                                                       69096500
*     3 SMF42GBI BIT(32),         /* Indicator of component being       69104000
*                                    processed                   @10A*/ 69111500
*      4 SMF42GBI0 BIT(1),        /* Data component              @10A*/ 69119000
*      4 SMF42GBI1 BIT(1),        /* Index component             @10A*/ 69126500
*     3 SMF42A09  Char(12),       /* reserved                    @10A*/ 69134000
*                                                                       69141500
*     3 SMF42GBK FIXED(32),       /* Number of lock requests            69149000
*                                    processed                   @10A*/ 69156500
*     3 SMF42GBL FIXED(32),       /* Number of true contention          69164000
*                                    lock requests               @10A*/ 69194000
*     3 SMF42GBM FIXED(32),       /* Number of false contention         69224000
*                                    lock requests               @10A*/ 69247200
*     3 SMF42GZ8 Fixed(16),       /* SmsDirectWeight             @10A*/ 69270400
*     3 SMF42GZ9 Fixed(16),       /* SmsSequentialWeight         @10A*/ 69293600
*                                                                       69316800
*     3 SMF42GBN CHAR(8),   /* In dfsms 1.4   wlm serv class name@10A*/ 69338200
*     3 SMF42GBO CHAR(8),   /* In dfsms 1.4   wlm report cls name@10A*/ 69359600
*                                                                       69381000
*     3 SMF42GBP Char(16),        /* Reserved                    @10A*/ 69402500
*     3 SMF42G1B,                 /* Direct access summary section      69424000
*                                                                @10A*/ 69474000
*      4 SMF42G1C,                /* Normal direct access summary       69524000
*                                    section                     @10A*/ 69574000
*       5 SMF42GIA FIXED(32),     /* Couple facility cache partition    69624000
*                                    number                      @10A*/ 69672400
*       5 SMF42GIB FIXED(31),     /* Total number of requests           69720800
*                                                                @10A*/ 69767600
*       5 SMF42GIC FIXED(32),     /* Total number of read requests -    69814400
*                                    NRI - No read integerity           69861200
*                                                                @10A*/ 69908000
*       5 SMF42GID FIXED(32),     /* Total number of read requests -    69954800
*                                    consistent reads            @10A*/ 70001900
*                                                                       70049000
*       5 SMF42GIE FIXED(32),     /* Total number of write requests     70093400
*                                                                @10A*/ 70137800
*       5 SMF42GIF FIXED(32),     /* Number of BMF requests             70182200
*                                                                @10A*/ 70226600
*       5 SMF42GIG FIXED(32),     /* Number of BMF read requests        70271000
*                                                                @10A*/ 70315400
*       5 SMF42GIH FIXED(32),     /* Number of BMF write requests       70359800
*                                                                @10A*/ 70404400
*                                                                       70449000
*       5 SMF42GII FIXED(32),     /* Number of BMF read hits            70493400
*                                                                @10A*/ 70537800
*       5 SMF42GIJ FIXED(32),     /* Number of BMF Valid read hits      70582200
*                                                                @10A*/ 70626600
*       5 SMF42GIK FIXED(32),     /* Number of BMF False invalids       70671000
*                                                                @10A*/ 70715400
*       5 SMF42GIL FIXED(32),     /* Number of requests processed by    70759800
*                                    the sysplex cache manager   @10A*/ 70804400
*                                                                       70849000
*       5 SMF42GIM FIXED(32),     /* Number of CF read requests         70861300
*                                                                @10A*/ 70873600
*       5 SMF42GIN FIXED(32),     /* Number of CF write requests @10A*/ 70885900
*       5 SMF42GIO FIXED(32),     /* Number of CF read hits      @10A*/ 70898200
*       5 SMF42GIP FIXED(32),     /* Number of CF read castins   @10A*/ 70910500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 70914600
*  %DO;                           /*                             @21A*/ 70918700
*       5 SMF42GIQ                /* Number of bytes xferred into the*/ 70922800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 70935100
*  %END;                          /*                             @21A*/ 70936800
* %ELSE                           /*                             @21A*/ 70938500
*  %DO;                           /*                             @21A*/ 70940200
*       5 SMF42GIQ                /* Number of bytes xferred into the*/ 70941900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 70943600
*  %END;                          /*                             @21A*/ 70945300
*                                 /*                             @10A*/ 70947400
*       5 SMF42GIR FIXED(32),     /* Number of READ  real I/O requests  70959700
*                                    to DASD.                    @10A*/ 70972000
*       5 SMF42GIS FIXED(32),     /* Number of WRITE real I/O requests  70984300
*                                    to DASD.                    @10A*/ 70996600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 71000700
*  %DO;                           /*                             @21A*/ 71004800
*       5 SMF42GIT                /* Number of bytes transferred to  */ 71008900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 71021200
*  %END;                          /*                             @21A*/ 71022900
* %ELSE                           /*                             @21A*/ 71024600
*  %DO;                           /*                             @21A*/ 71026300
*       5 SMF42GIT                /* Number of bytes transferred to  */ 71028000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 71029700
*  %END;                          /*                             @21A*/ 71031400
*                                 /*                             @10A*/ 71033500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 71037600
*  %DO;                           /*                             @21A*/ 71041700
*       5 SMF42GIU                /* Number of bytes transferred to  */ 71045800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   71058100
*  %END;                          /*                             @21A*/ 71059800
* %ELSE                           /*                             @21A*/ 71061500
*  %DO;                           /*                             @21A*/ 71063200
*       5 SMF42GIU                /* Number of bytes transferred to  */ 71064900
*          CHAR(8),             /* DASD for the WRITE requests @21A*/   71066600
*  %END;                          /*                             @21A*/ 71068300
*                                 /*                             @10A*/ 71070400
*       5 SMF42GIV CHAR(16),      /* reserved                           71082700
*                                                                @10A*/ 71095000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 71099100
*  %DO;                           /*                             @21A*/ 71103200
*       5 SMF42GIW                 ! Total amount of time for all the   71107300
*          isa(int64bit_signed), ! requests in this                     71119600
*                                  ! interval. (the value is expressed  71131900
*                                  ! in MILLI- seconds)          @21A   71134400
*  %END;                          /*                             @21A*/ 71136900
* %ELSE                           /*                             @21A*/ 71139400
*  %DO;                           /*                             @21A*/ 71141900
*       5 SMF42GIW                 ! Total amount of time for all the   71144400
*          CHAR(8),              ! requests in this              @21A   71146900
*                                  ! interval. (the value is expressed  71149400
*                                  ! in MILLI- seconds)          @21A   71151900
*  %END;                          /*                             @21A*/ 71154400
*                                                                       71157300
*       5 SMF42GIX FIXED(32),     /* Average response time for all of   71201700
*                                    the requests in this interval.     71246100
*                                    (total time/number of requests)    71290500
*                                                                @10A*/ 71334900
*       5 SMF42GIY FIXED(32),     /* Normalized response time for all   71379300
*                                    of the requests in this interval   71424000
*                                    (total time/number of bytes        71474000
*                                    transfered/4K)              @10A*/ 71505200
*       5 SMF42GIZ   CHAR(8),     /* Reserved                    @10A*/ 71536400
*       5 SMF42GI7   CHAR(32),    /* Reserved                    @21A*/ 71582200
*                                 /*                             @21A*/ 71628000
*      4 SMF42G1D,                /* RE-DO during direct access         71674000
*                                    section                     @10A*/ 71724000
*       5 SMF42GJA FIXED(32),     /* Couple facility cache partition    71774000
*                                    number                      @10A*/ 71822400
*       5 SMF42GJB FIXED(31),     /* Total number of requests           71870800
*                                                                @10A*/ 71917600
*       5 SMF42GJC FIXED(32),     /* Total number of read requests -    71964400
*                                    NRI - No read integerity           72011200
*                                                                @10A*/ 72058000
*       5 SMF42GJD FIXED(32),     /* Total number of read requests -    72104800
*                                    consistent reads            @10A*/ 72151900
*                                                                       72199000
*       5 SMF42GJE FIXED(32),     /* Total number of write requests     72243400
*                                                                @10A*/ 72287800
*       5 SMF42GJF FIXED(32),     /* Number of BMF requests             72332200
*                                                                @10A*/ 72376600
*       5 SMF42GJG FIXED(32),     /* Number of BMF read requests        72421000
*                                                                @10A*/ 72465400
*       5 SMF42GJH FIXED(32),     /* Number of BMF write requests       72509800
*                                                                @10A*/ 72554400
*                                                                       72599000
*       5 SMF42GJI FIXED(32),     /* Number of BMF read hits            72643400
*                                                                @10A*/ 72687800
*       5 SMF42GJJ FIXED(32),     /* Number of BMF Valid read hits      72732200
*                                                                @10A*/ 72776600
*       5 SMF42GJK FIXED(32),     /* Number of BMF False invalids       72821000
*                                                                @10A*/ 72865400
*       5 SMF42GJL FIXED(32),     /* Number of requests processed by    72909800
*                                    the sysplex cache manager   @10A*/ 72954400
*                                                                       72999000
*       5 SMF42GJM FIXED(32),     /* Number of CF read requests         73011300
*                                                                @10A*/ 73023600
*       5 SMF42GJN FIXED(32),     /* Number of CF write requests @10A*/ 73035900
*       5 SMF42GJO FIXED(32),     /* Number of CF read hits      @10A*/ 73048200
*       5 SMF42GJP FIXED(32),     /* Number of CF read castins   @10A*/ 73060500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 73064600
*  %DO;                           /*                             @21A*/ 73068700
*       5 SMF42GJQ                /* Number of bytes xferred into the*/ 73072800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 73085100
*  %END;                          /*                             @21A*/ 73086800
* %ELSE                           /*                             @21A*/ 73088500
*  %DO;                           /*                             @21A*/ 73090200
*       5 SMF42GJQ                /* Number of bytes xferred into the*/ 73091900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 73093600
*  %END;                          /*                             @21A*/ 73095300
*                                 /*                             @10A*/ 73097400
*       5 SMF42GJR FIXED(32),     /* Number of READ  real I/O requests  73109700
*                                    to DASD.                    @10A*/ 73122000
*       5 SMF42GJS FIXED(32),     /* Number of WRITE real I/O requests  73134300
*                                    to DASD.                    @10A*/ 73146600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 73150700
*  %DO;                           /*                             @21A*/ 73154800
*       5 SMF42GJT                /* Number of bytes transferred to  */ 73158900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 73171200
*  %END;                          /*                             @21A*/ 73172900
* %ELSE                           /*                             @21A*/ 73174600
*  %DO;                           /*                             @21A*/ 73176300
*       5 SMF42GJT                /* Number of bytes transferred to  */ 73178000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 73179700
*  %END;                          /*                             @21A*/ 73181400
*                                 /*                             @10A*/ 73183500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 73187600
*  %DO;                           /*                             @21A*/ 73191700
*       5 SMF42GJU                /* Number of bytes transferred to  */ 73195800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   73208100
*  %END;                          /*                             @21A*/ 73209800
* %ELSE                           /*                             @21A*/ 73211500
*  %DO;                           /*                             @21A*/ 73213200
*       5 SMF42GJU                /* Number of bytes transferred to  */ 73214900
*          CHAR(8),             /* DASD for the WRITE requests @21A*/   73216600
*  %END;                          /*                             @21A*/ 73218300
*                                 /*                             @10A*/ 73220400
*       5 SMF42GJV CHAR(16),      /* reserved                           73232700
*                                                                @10A*/ 73245000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 73249100
*  %DO;                           /*                             @21A*/ 73253200
*       5 SMF42GJW                 ! Total amount of time for all the   73257300
*          isa(int64bit_signed),   ! requests in this            @21A   73269600
*                                  ! interval. (the value is expressed  73281900
*                                  ! in MILLI- seconds)          @21A   73284400
*  %END;                          /*                             @21A*/ 73286900
* %ELSE                           /*                             @21A*/ 73289400
*  %DO;                           /*                             @21A*/ 73291900
*       5 SMF42GJW                 ! Total amount of time for all the   73294400
*          CHAR(8),                ! requests in this            @21A   73296900
*                                  ! interval. (the value is expressed  73299400
*                                  ! in MILLI- seconds)          @21A   73301900
*  %END;                          /*                             @21A*/ 73304400
*                                                                       73307300
*       5 SMF42GJX FIXED(32),     /* Average response time for all of   73351700
*                                    the requests in this interval.     73396100
*                                    (total time/number of requests)    73440500
*                                                                @10A*/ 73484900
*       5 SMF42GJY FIXED(32),     /* Normalized response time for all   73529300
*                                    of the requests in this interval   73574000
*                                    (total time/number of bytes        73624000
*                                    transfered/4K)              @10A*/ 73656500
*       5 SMF42GJZ   CHAR(8),     /* Reserved                    @10A*/ 73689000
*       5 SMF42GJ7   CHAR(32),    /* Reserved                    @21A*/ 73739000
*                                                                       73794000
*     3 SMF42G1E,                 /* Sequential access summary section  73834000
*                                                                @10A*/ 73879000
*      4 SMF42G1F,                /* Normal sequential access section   73924000
*                                                                @10A*/ 73974000
*       5 SMF42GKA FIXED(32),     /* Couple facility cache partition    74024000
*                                    number                      @10A*/ 74072400
*       5 SMF42GKB FIXED(31),     /* Total number of requests           74120800
*                                                                @10A*/ 74167600
*       5 SMF42GKC FIXED(32),     /* Total number of read requests -    74214400
*                                    NRI - No read integerity           74261200
*                                                                @10A*/ 74308000
*       5 SMF42GKD FIXED(32),     /* Total number of read requests -    74354800
*                                    consistent reads            @10A*/ 74401900
*                                                                       74449000
*       5 SMF42GKE FIXED(32),     /* Total number of write requests     74493400
*                                                                @10A*/ 74537800
*       5 SMF42GKF FIXED(32),     /* Number of BMF requests             74582200
*                                                                @10A*/ 74626600
*       5 SMF42GKG FIXED(32),     /* Number of BMF read requests        74671000
*                                                                @10A*/ 74715400
*       5 SMF42GKH FIXED(32),     /* Number of BMF write requests       74759800
*                                                                @10A*/ 74804400
*                                                                       74849000
*       5 SMF42GKI FIXED(32),     /* Number of BMF read hits            74893400
*                                                                @10A*/ 74937800
*       5 SMF42GKJ FIXED(32),     /* Number of BMF Valid read hits      74982200
*                                                                @10A*/ 75026600
*       5 SMF42GKK FIXED(32),     /* Number of BMF False invalids       75071000
*                                                                @10A*/ 75115400
*       5 SMF42GKL FIXED(32),     /* Number of requests processed by    75159800
*                                    the sysplex cache manager   @10A*/ 75204400
*                                                                       75249000
*       5 SMF42GKM FIXED(32),     /* Number of CF read requests         75261300
*                                                                @10A*/ 75273600
*       5 SMF42GKN FIXED(32),     /* Number of CF write requests @10A*/ 75285900
*       5 SMF42GKO FIXED(32),     /* Number of CF read hits      @10A*/ 75298200
*       5 SMF42GKP FIXED(32),     /* Number of CF read castins   @10A*/ 75310500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 75314600
*  %DO;                           /*                             @21A*/ 75318700
*       5 SMF42GKQ                /* Number of bytes xferred into the*/ 75322800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 75335100
*  %END;                          /*                             @21A*/ 75336800
* %ELSE                           /*                             @21A*/ 75338500
*  %DO;                           /*                             @21A*/ 75340200
*       5 SMF42GKQ                /* Number of bytes xferred into the*/ 75341900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 75343600
*  %END;                          /*                             @21A*/ 75345300
*                                 /*                             @10A*/ 75347400
*       5 SMF42GKR FIXED(32),     /* Number of READ  real I/O requests  75359700
*                                    to DASD.                    @10A*/ 75372000
*       5 SMF42GKS FIXED(32),     /* Number of WRITE real I/O requests  75384300
*                                    to DASD.                    @10A*/ 75396600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 75400700
*  %DO;                           /*                             @21A*/ 75404800
*       5 SMF42GKT                /* Number of bytes transferred to  */ 75408900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 75421200
*  %END;                          /*                             @21A*/ 75422900
* %ELSE                           /*                             @21A*/ 75424600
*  %DO;                           /*                             @21A*/ 75426300
*       5 SMF42GKT                /* Number of bytes transferred to  */ 75428000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 75429700
*  %END;                          /*                             @21A*/ 75431400
*                                 /*                             @10A*/ 75433500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 75437600
*  %DO;                           /*                             @21A*/ 75441700
*       5 SMF42GKU                /* Number of bytes transferred to  */ 75445800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   75458100
*  %END;                          /*                             @21A*/ 75459800
* %ELSE                           /*                             @21A*/ 75461500
*  %DO;                           /*                             @21A*/ 75463200
*       5 SMF42GKU                /* Number of bytes transferred to  */ 75464900
*          CHAR(8),             /* DASD for the WRITE requests @21A*/   75466600
*  %END;                          /*                             @21A*/ 75468300
*                                 /*                             @10A*/ 75470400
*       5 SMF42GKV CHAR(16),      /* reserved                           75482700
*                                                                @10A*/ 75495000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 75499100
*  %DO;                           /*                             @21A*/ 75503200
*       5 SMF42GKW                 ! Total amount of time for all the   75507300
*          isa(int64bit_signed),   ! requests in this            @21A   75519600
*                                  ! interval. (the value is expressed  75531900
*                                  ! in MILLI- seconds)          @21A*/ 75534400
*  %END;                          /*                             @21A*/ 75536900
* %ELSE                           /*                             @21A*/ 75539400
*  %DO;                           /*                             @21A*/ 75541900
*       5 SMF42GKW                 ! Total amount of time for all the   75544400
*          CHAR(8),                ! requests in this            @21A   75546900
*                                  ! interval. (the value is expressed  75549400
*                                  ! in MILLI- seconds)          @21A*/ 75551900
*  %END;                          /*                             @21A*/ 75554400
*                                                                       75557300
*       5 SMF42GKX FIXED(32),     /* Average response time for all of   75601700
*                                    the requests in this interval.     75646100
*                                    (total time/number of requests)    75690500
*                                                                @10A*/ 75734900
*       5 SMF42GKY FIXED(32),     /* Normalized response time for all   75779300
*                                    of the requests in this interval   75824000
*                                    (total time/number of bytes        75874000
*                                    transfered/4K)              @10A*/ 75905200
*       5 SMF42GKZ   CHAR(8),     /* Reserved                    @10A*/ 75936400
*       5 SMF42GK7   CHAR(32),    /* Reserved                    @21A*/ 75986400
*                                                                       76036500
*      4 SMF42G1G,                /* RE-DO during sequential access     76074000
*                                    section                     @10A*/ 76124000
*       5 SMF42GLA FIXED(32),     /* Couple facility cache partition    76174000
*                                    number                      @10A*/ 76222400
*       5 SMF42GLB FIXED(31),     /* Total number of requests           76270800
*                                                                @10A*/ 76317600
*       5 SMF42GLC FIXED(32),     /* Total number of read requests -    76364400
*                                    NRI - No read integerity           76411200
*                                                                @10A*/ 76458000
*       5 SMF42GLD FIXED(32),     /* Total number of read requests -    76504800
*                                    consistent reads            @10A*/ 76551900
*                                                                       76599000
*       5 SMF42GLE FIXED(32),     /* Total number of write requests     76643400
*                                                                @10A*/ 76687800
*       5 SMF42GLF FIXED(32),     /* Number of BMF requests             76732200
*                                                                @10A*/ 76776600
*       5 SMF42GLG FIXED(32),     /* Number of BMF read requests        76821000
*                                                                @10A*/ 76865400
*       5 SMF42GLH FIXED(32),     /* Number of BMF write requests       76909800
*                                                                @10A*/ 76954400
*                                                                       76999000
*       5 SMF42GLI FIXED(32),     /* Number of BMF read hits            77043400
*                                                                @10A*/ 77087800
*       5 SMF42GLJ FIXED(32),     /* Number of BMF Valid read hits      77132200
*                                                                @10A*/ 77176600
*       5 SMF42GLK FIXED(32),     /* Number of BMF False invalids       77221000
*                                                                @10A*/ 77265400
*       5 SMF42GLL FIXED(32),     /* Number of requests processed by    77309800
*                                    the sysplex cache manager   @10A*/ 77354400
*                                                                       77399000
*       5 SMF42GLM FIXED(32),     /* Number of CF read requests         77411300
*                                                                @10A*/ 77423600
*       5 SMF42GLN FIXED(32),     /* Number of CF write requests @10A*/ 77435900
*       5 SMF42GLO FIXED(32),     /* Number of CF read hits      @10A*/ 77448200
*       5 SMF42GLP FIXED(32),     /* Number of CF read castins   @10A*/ 77460500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 77464600
*  %DO;                           /*                             @21A*/ 77468700
*       5 SMF42GLQ                /* Number of bytes xferred into the*/ 77472800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 77485100
*  %END;                          /*                             @21A*/ 77486800
* %ELSE                           /*                             @21A*/ 77488500
*  %DO;                           /*                             @21A*/ 77490200
*       5 SMF42GLQ                /* Number of bytes xferred into the*/ 77491900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 77493600
*  %END;                          /*                             @21A*/ 77495300
*                                 /*                             @10A*/ 77497400
*       5 SMF42GLR FIXED(32),     /* Number of READ  real I/O requests  77509700
*                                    to DASD.                    @10A*/ 77522000
*       5 SMF42GLS FIXED(32),     /* Number of WRITE real I/O requests  77534300
*                                    to DASD.                    @10A*/ 77546600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 77550700
*  %DO;                           /*                             @21A*/ 77554800
*       5 SMF42GLT                /* Number of bytes transferred to  */ 77558900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 77571200
*  %END;                          /*                             @21A*/ 77572900
* %ELSE                           /*                             @21A*/ 77574600
*  %DO;                           /*                             @21A*/ 77576300
*       5 SMF42GLT                /* Number of bytes transferred to  */ 77578000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 77579700
*  %END;                          /*                             @21A*/ 77581400
*                                 /*                             @10A*/ 77583500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 77587600
*  %DO;                           /*                             @21A*/ 77591700
*       5 SMF42GLU                /* Number of bytes transferred to  */ 77595800
*          isa(int64bit_signed),  /* DASD for the WRITE requests @21A*/ 77598800
*  %END;                          /*                             @21A*/ 77601800
* %ELSE                           /*                             @21A*/ 77604800
*  %DO;                           /*                             @21A*/ 77607800
*       5 SMF42GLU                /* Number of bytes transferred to  */ 77610800
*          CHAR(8),               /* DASD for the WRITE requests @21A*/ 77613800
*  %END;                          /*                             @21A*/ 77616800
*                                 /*                             @10A*/ 77620400
*       5 SMF42GLV CHAR(16),      /* reserved                           77632700
*                                                                @10A*/ 77645000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 77649100
*  %DO;                           /*                             @21A*/ 77653200
*       5 SMF42GLW                 ! Total amount of time for all the   77657300
*          isa(int64bit_signed),   ! requests in this            @21A   77669600
*                                  ! interval. (the value is expressed  77681900
*                                  ! in MILLI- seconds)          @21A   77684400
*  %END;                          /*                             @21A*/ 77686900
* %ELSE                           /*                             @21A*/ 77689400
*  %DO;                           /*                             @21A*/ 77691900
*       5 SMF42GLW                 ! Total amount of time for all the   77694400
*          CHAR(8),                ! requests in this            @21A   77696900
*                                  ! interval. (the value is expressed  77699400
*                                  ! in MILLI- seconds)          @21A   77701900
*  %END;                          /*                             @21A*/ 77704400
*                                                                       77707300
*       5 SMF42GLX FIXED(32),     /* Average response time for all of   77751700
*                                    the requests in this interval.     77796100
*                                    (total time/number of requests)    77840500
*                                                                @10A*/ 77884900
*       5 SMF42GLY FIXED(32),     /* Normalized response time for all   77929300
*                                    of the requests in this interval   77974000
*                                    (total time/number of bytes        78024000
*                                    transfered/4K)              @10A*/ 78055200
*       5 SMF42GLZ   CHAR(8),     /* Reserved                    @10A*/ 78086400
*       5 SMF42GL7   CHAR(32),    /* Reserved                    @21A*/ 78136400
*                                                                       78186500
*      4 SMF42G1H,                /* Read-a-head sequential access      78224000
*                                    section                     @10A*/ 78274000
*       5 SMF42GMA FIXED(32),     /* Couple facility cache partition    78324000
*                                    number                      @10A*/ 78372400
*       5 SMF42GMB FIXED(31),     /* Total number of requests           78420800
*                                                                @10A*/ 78467600
*       5 SMF42GMC FIXED(32),     /* Total number of read requests -    78514400
*                                    NRI - No read integerity           78561200
*                                                                @10A*/ 78608000
*       5 SMF42GMD FIXED(32),     /* Total number of read requests -    78654800
*                                    consistent reads            @10A*/ 78701900
*                                                                       78749000
*       5 SMF42GME FIXED(32),     /* Total number of write requests     78793400
*                                                                @10A*/ 78837800
*       5 SMF42GMF FIXED(32),     /* Number of BMF requests             78882200
*                                                                @10A*/ 78926600
*       5 SMF42GMG FIXED(32),     /* Number of BMF read requests        78971000
*                                                                @10A*/ 79015400
*       5 SMF42GMH FIXED(32),     /* Number of BMF write requests       79059800
*                                                                @10A*/ 79104400
*                                                                       79149000
*       5 SMF42GMI FIXED(32),     /* Number of BMF read hits            79193400
*                                                                @10A*/ 79237800
*       5 SMF42GMJ FIXED(32),     /* Number of BMF Valid read hits      79282200
*                                                                @10A*/ 79326600
*       5 SMF42GMK FIXED(32),     /* Number of BMF False invalids       79371000
*                                                                @10A*/ 79415400
*       5 SMF42GML FIXED(32),     /* Number of requests processed by    79459800
*                                    the sysplex cache manager   @10A*/ 79504400
*                                                                       79549000
*       5 SMF42GMM FIXED(32),     /* Number of CF read requests         79561300
*                                                                @10A*/ 79573600
*       5 SMF42GMN FIXED(32),     /* Number of CF write requests @10A*/ 79585900
*       5 SMF42GMO FIXED(32),     /* Number of CF read hits      @10A*/ 79598200
*       5 SMF42GMP FIXED(32),     /* Number of CF read castins   @10A*/ 79610500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 79614600
*  %DO;                           /*                             @21A*/ 79618700
*       5 SMF42GMQ                /* Number of bytes xferred into the*/ 79622800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 79635100
*  %END;                          /*                             @21A*/ 79636800
* %ELSE                           /*                             @21A*/ 79638500
*  %DO;                           /*                             @21A*/ 79640200
*       5 SMF42GMQ                /* Number of bytes xferred into the*/ 79641900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 79643600
*  %END;                          /*                             @21A*/ 79645300
*                                 /*                             @10A*/ 79647400
*       5 SMF42GMR FIXED(32),     /* Number of READ  real I/O requests  79659700
*                                    to DASD.                    @10A*/ 79672000
*       5 SMF42GMS FIXED(32),     /* Number of WRITE real I/O requests  79684300
*                                    to DASD.                    @10A*/ 79696600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 79700700
*  %DO;                           /*                             @21A*/ 79704800
*       5 SMF42GMT                /* Number of bytes transferred to  */ 79708900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 79721200
*  %END;                          /*                             @21A*/ 79722900
* %ELSE                           /*                             @21A*/ 79724600
*  %DO;                           /*                             @21A*/ 79726300
*       5 SMF42GMT                /* Number of bytes transferred to  */ 79728000
*          Char(8),             /* DASD for the READ    requests @21A*/ 79729700
*  %END;                          /*                             @21A*/ 79731400
*                                 /*                             @10A*/ 79733500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 79737600
*  %DO;                           /*                             @21A*/ 79741700
*       5 SMF42GMU                /* Number of bytes transferred to  */ 79745800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   79758100
*  %END;                          /*                             @21A*/ 79759800
* %ELSE                           /*                             @21A*/ 79761500
*  %DO;                           /*                             @21A*/ 79763200
*       5 SMF42GMU                /* Number of bytes transferred to  */ 79764900
*          CHAR(8),             /* DASD for the WRITE requests @21A*/   79766600
*  %END;                          /*                             @21A*/ 79768300
*                                 /*                             @10A*/ 79770400
*       5 SMF42GMV CHAR(16),      /* reserved                           79782700
*                                                                @10A*/ 79795000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 79799100
*  %DO;                           /*                             @21A*/ 79803200
*       5 SMF42GMW                 ! Total amount of time for all the   79807300
*          isa(int64bit_signed),   ! requests in this            @21A   79819600
*                                  ! interval. (the value is expressed  79831900
*                                  ! in MILLI- seconds)          @21A   79834400
*  %END;                          /*                             @21A*/ 79836900
* %ELSE                           /*                             @21A*/ 79839400
*  %DO;                           /*                             @21A*/ 79841900
*       5 SMF42GMW                 ! Total amount of time for all the   79844400
*          CHAR(8),                ! requests in this            @21A   79846900
*                                  ! interval. (the value is expressed  79849400
*                                  ! in MILLI- seconds)          @21A   79851900
*  %END;                          /*                             @21A*/ 79854400
*                                                                       79857300
*       5 SMF42GMX FIXED(32),     /* Average response time for all of   79901700
*                                    the requests in this interval.     79946100
*                                    (total time/number of requests)    79990500
*                                                                @10A*/ 80034900
*       5 SMF42GMY FIXED(32),     /* Normalized response time for all   80079300
*                                    of the requests in this interval   80124000
*                                    (total time/number of bytes        80174000
*                                    transfered/4K)              @10A*/ 80205200
*       5 SMF42GMZ   CHAR(8),     /* Reserved                    @10A*/ 80236400
*       5 SMF42GM7   CHAR(32),    /* Reserved                    @21A*/ 80286400
*                                                                       80336500
*      4 SMF42G1I,                /* PRE-FORMAT sequential access       80374000
*                                    section                     @10A*/ 80424000
*       5 SMF42GNA FIXED(32),     /* Couple facility cache partition    80474000
*                                    number                      @10A*/ 80522400
*       5 SMF42GNB FIXED(31),     /* Total number of requests           80570800
*                                                                @10A*/ 80617600
*       5 SMF42GNC FIXED(32),     /* Total number of read requests -    80664400
*                                    NRI - No read integerity           80711200
*                                                                @10A*/ 80758000
*       5 SMF42GND FIXED(32),     /* Total number of read requests -    80804800
*                                    consistent reads            @10A*/ 80851900
*                                                                       80899000
*       5 SMF42GNE FIXED(32),     /* Total number of write requests     80943400
*                                                                @10A*/ 80987800
*       5 SMF42GNF FIXED(32),     /* Number of BMF requests             81032200
*                                                                @10A*/ 81076600
*       5 SMF42GNG FIXED(32),     /* Number of BMF read requests        81121000
*                                                                @10A*/ 81165400
*       5 SMF42GNH FIXED(32),     /* Number of BMF write requests       81209800
*                                                                @10A*/ 81254400
*                                                                       81299000
*       5 SMF42GNI FIXED(32),     /* Number of BMF read hits            81343400
*                                                                @10A*/ 81387800
*       5 SMF42GNJ FIXED(32),     /* Number of BMF Valid read hits      81432200
*                                                                @10A*/ 81476600
*       5 SMF42GNK FIXED(32),     /* Number of BMF False invalids       81521000
*                                                                @10A*/ 81565400
*       5 SMF42GNL FIXED(32),     /* Number of requests processed by    81609800
*                                    the sysplex cache manager   @10A*/ 81654400
*                                                                       81699000
*       5 SMF42GNM FIXED(32),     /* Number of CF read requests         81711300
*                                                                @10A*/ 81723600
*       5 SMF42GNN FIXED(32),     /* Number of CF write requests @10A*/ 81735900
*       5 SMF42GNO FIXED(32),     /* Number of CF read hits      @10A*/ 81748200
*       5 SMF42GNP FIXED(32),     /* Number of CF read castins   @10A*/ 81760500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 81764600
*  %DO;                           /*                             @21A*/ 81768700
*       5 SMF42GNQ                /* Number of bytes xferred into the*/ 81772800
*          isa(int64bit_signed),/* DFSMS Cache structure         @10A*/ 81785100
*  %END;                          /*                             @21A*/ 81786800
* %ELSE                           /*                             @21A*/ 81788500
*  %DO;                           /*                             @21A*/ 81790200
*       5 SMF42GNQ                /* Number of bytes xferred into the*/ 81791900
*          CHAR(8),             /* DFSMS Cache structure         @21A*/ 81793600
*  %END;                          /*                             @21A*/ 81795300
*                                 /*                             @10A*/ 81797400
*       5 SMF42GNR FIXED(32),     /* Number of READ  real I/O requests  81809700
*                                    to DASD.                    @10A*/ 81822000
*       5 SMF42GNS FIXED(32),     /* Number of WRITE real I/O requests  81834300
*                                    to DASD.                    @10A*/ 81846600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 81850700
*  %DO;                           /*                             @21A*/ 81854800
*       5 SMF42GNT                /* Number of bytes transferred to  */ 81858900
*          isa(int64bit_signed),/* DASD for the READ    requests @10A*/ 81871200
*  %END;                          /*                             @21A*/ 81872900
* %ELSE                           /*                             @21A*/ 81874600
*  %DO;                           /*                             @21A*/ 81876300
*       5 SMF42GNT                /* Number of bytes transferred to  */ 81878000
*          CHAR(8),             /* DASD for the READ    requests @21A*/ 81879700
*  %END;                          /*                             @21A*/ 81881400
*                                 /*                             @10A*/ 81883500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 81887600
*  %DO;                           /*                             @21A*/ 81891700
*       5 SMF42GNU                /* Number of bytes transferred to  */ 81895800
*          isa(int64bit_signed),/* DASD for the WRITE requests @10A*/   81908100
*  %END;                          /*                             @21A*/ 81909800
* %ELSE                           /*                             @21A*/ 81911500
*  %DO;                           /*                             @21A*/ 81913200
*       5 SMF42GNU                /* Number of bytes transferred to  */ 81914900
*          CHAR(8),             /* DASD for the WRITE requests @10A*/   81916600
*  %END;                          /*                             @21A*/ 81918300
*                                 /*                             @10A*/ 81920400
*       5 SMF42GNV CHAR(16),      /* reserved                           81932700
*                                                                @10A*/ 81945000
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 81949100
*  %DO;                           /*                             @21A*/ 81953200
*       5 SMF42GNW                 ! Total amount of time for all the   81957300
*          isa(int64bit_signed),   ! requests in this            @21A   81969600
*                                  ! interval. (the value is expressed  81981900
*                                  ! in milli seconds)           @21A   81984400
*  %END;                          /*                             @21A*/ 81986900
* %ELSE                           /*                             @21A*/ 81989400
*  %DO;                           /*                             @21A*/ 81991900
*       5 SMF42GNW                 ! Total amount of time for all the   81994400
*          CHAR(8),                ! requests in this            @21A   81996900
*                                  ! interval. (the value is expressed  81999400
*                                  ! in milli seconds)           @21A   82001900
*  %END;                          /*                             @21A*/ 82004400
*                                                                       82007300
*       5 SMF42GNX FIXED(32),     /* Average response time for all of   82051700
*                                    the requests in this interval.     82096100
*                                    (total time/number of requests)    82140500
*                                                                @10A*/ 82184900
*       5 SMF42GNY FIXED(32),     /* Normalized response time for all   82229300
*                                    of the requests in this interval   82274000
*                                    (total time/number of bytes        82324000
*                                    transfered/4K)              @10A*/ 82325600
*       5 SMF42GNZ   CHAR(8),     /* Reserved                    @10A*/ 82327200
*       5 SMF42GN7   CHAR(32),    /* Reserved                    @21A*/ 82328800
*                                                                       82330400
*      /******************************************************** @10A*/ 82332000
*      /*  locking Statistics summary section                    @10A*/ 82333600
*      /******************************************************** @10A*/ 82335200
*      4 SMF42FX6,                /* Locking Statistical Section @10A*/ 82336800
*       5 SMF42GQA   Fixed(31),   /* number of record lock       @10A*/ 82338400
*                                 /* requests                    @10A*/ 82340000
*                                 /* (obtain/alter/promote)      @10A*/ 82341600
*       5 SMF42GQB   Fixed(31),   /* number of record lock       @10A*/ 82343200
*                                 /* requests that cause true    @10A*/ 82344800
*                                 /* contention                  @10A*/ 82346400
*       5 SMF42GQC   Fixed(31),   /* number of record lock       @10A*/ 82348000
*                                 /* requests that cause False   @10A*/ 82349600
*                                 /* contention                  @10A*/ 82351200
*       5 SMF42GQD   Fixed(31),   /* number of record lock       @10A*/ 82352800
*                                 /* release lock requests       @10A*/ 82354400
*       5 SMF42GQE   Fixed(31),   /* Number of component_1 type  @10A*/ 82356000
*                                 /* lock requests               @10A*/ 82357600
*                                 /* (obtain/alter/promote)      @10A*/ 82359200
*       5 SMF42GQF   Fixed(31),   /* Number of component_1 type  @10A*/ 82360800
*                                 /* release lock requests       @10A*/ 82362400
*       5 SMF42GQG   Char(8),     /* reserved                    @10A*/ 82364000
*       5 SMF42GQH   Fixed(31),   /* Number of component_1       @10A*/ 82365600
*                                 /* class 1 (DIWA) locks        @10A*/ 82367200
*                                 /* (obtain/alter/promote)      @10A*/ 82368800
*       5 SMF42GQI   Fixed(31),   /* Number of component_1       @10A*/ 82370400
*                                 /* class 1 (DIWA) locks        @10A*/ 82372000
*                                 /* that cause true contention  @10A*/ 82373600
*       5 SMF42GQJ   Fixed(31),   /* Number of component_1       @10A*/ 82375200
*                                 /* class 1 (DIWA) locks        @10A*/ 82376800
*                                 /* that cause false contention @10A*/ 82378400
*       5 SMF42GQK   Fixed(31),   /* Number of component_1       @10A*/ 82380000
*                                 /* class 1 (DIWA) release lock @10A*/ 82381600
*                                 /* requests                    @10A*/ 82383200
*       5 SMF42GQL   Fixed(31),   /* Number of component_1       @10A*/ 82384800
*                                 /* class 2 (upgrade) locks     @10A*/ 82386400
*                                 /* (obtain/alter/promote)      @10A*/ 82388000
*       5 SMF42GQM   Fixed(31),   /* Number of component_1       @10A*/ 82389600
*                                 /* class 2 (upgrade) locks     @10A*/ 82391200
*                                 /* that cause true contention  @10A*/ 82392800
*       5 SMF42GQN   Fixed(31),   /* Number of component_1       @10A*/ 82394400
*                                 /* class 2 (upgrade) locks     @10A*/ 82396000
*                                 /* that cause false contention @10A*/ 82397600
*       5 SMF42GQO   Fixed(31),   /* Number of component_1       @10A*/ 82399200
*                                 /* class 2 (upgrade)           @10A*/ 82400800
*                                 /* release lock requests       @10A*/ 82402400
*       5 SMF42GQP   Fixed(31),   /* Number of component_1       @10A*/ 82404000
*                                 /* class 3 (Preformat) locks   @10A*/ 82405600
*                                 /* (obtain/alter/promote)      @10A*/ 82407200
*       5 SMF42GQQ   Fixed(31),   /* Number of component_1       @10A*/ 82408800
*                                 /* class 3 (Preformat) locks   @10A*/ 82410400
*                                 /* that cause true contention  @10A*/ 82412000
*       5 SMF42GQR   Fixed(31),   /* Number of component_1       @10A*/ 82413600
*                                 /* class 3 (Preformat) locks   @10A*/ 82415200
*                                 /* that cause false contention @10A*/ 82416800
*       5 SMF42GQS   Fixed(31),   /* Number of component_1       @10A*/ 82418400
*                                 /* class 3 (Preformat)         @10A*/ 82420000
*                                 /* release lock requests       @10A*/ 82421600
*       5 SMF42GQT   Fixed(31),   /* Number of component_2       @10A*/ 82423200
*                                 /* lock requests               @10A*/ 82424800
*                                 /* (obtain/alter/promote)      @10A*/ 82426400
*       5 SMF42GQU   Fixed(31),   /* Number of component_2       @10A*/ 82428000
*                                 /* lock requests that caused   @10A*/ 82429600
*                                 /* true contention             @10A*/ 82431200
*       5 SMF42GQV   Fixed(31),   /* Number of component_2       @10A*/ 82432800
*                                 /* lock requests that caused   @10A*/ 82434400
*                                 /* false contention            @10A*/ 82436000
*       5 SMF42GQW   Fixed(31),   /* Number of component_2       @10A*/ 82437600
*                                 /* release lock requests       @10A*/ 82439200
*       5 SMF42GQX    Char(32),   /* reserved                    @21A*/ 82440800
*                                 /*                             @10A*/ 82442400
*      /******************************************************** @21A*/ 82443700
*      /*  DataSet BMF LRU statistical section                   @21A*/ 82445000
*      /******************************************************** @21A*/ 82446300
*      4 SMF42FX8,                /* DataSet BMF LRU stats       @21A*/ 82447600
*                                                                       82449000
*       5 SMF42GRL Fixed(32),     /* NUMBER OF REDOS             @21A*/ 82452500
*       5 SMF42GRM Fixed(32),     /* NUMBER OF RECURSIVE REDOS   @21A*/ 82456000
*       5 SMF42GRN Fixed(32),     /* NUMBER OF BMF WRITES        @21A*/ 82459500
*       5 SMF42GRO Fixed(32),     /* NUMBER OF SCM READ REQUESTS @21A*/ 82463000
*       5 SMF42GRP Fixed(32),     /* NUMBER OF SCM READ REQUESTS @21A*/ 82466500
*                                 /* THAT ENCOUNTERED CASTOUT    @21A*/ 82470000
*                                 /* LOCK CONTENTION             @21A*/ 82473500
*       5 SMF42GRR Fixed(31),     /* REDO PERCENT                @21A*/ 82477000
*       5 SMF42GRS Fixed(31),     /* RECURSIVE REDO PERCENT      @21A*/ 82480500
*       5 SMF42GRT Fixed(31),     /* SCM CASTOUT LOCK PERCENT    @21A*/ 82484000
*       5 SMF42GRQ Char(12),      /* RESERVED                    @21A*/ 82487500
*       5 SMF42GRU Char(4),       /* RESERVED                    @21A*/ 82491000
*       5 SMF42GRV Char(16);      /* RESERVED                    @21A*/ 82494500
*                                                                       82499000
* %SKIP_0G: ;                                                 /* @10A*/ 82540600
* %IF SMF42_0H ^= 'YES' %THEN %GOTO SKIP_0H;                            82582200
*                                                                       82624000
*@SPACE;                                                                82674000
* /*-----------------------------------------------------------------*/ 82724000
* /* Lock Structure Activity Summary (SMF42 subtype 17)              */ 82774000
* /*-----------------------------------------------------------------*/ 82824000
* /*-----------------------------------------------------------------*/ 82874000
* /* Lock activity across the sysplex for the lock structure         */ 82924000
* /*-----------------------------------------------------------------*/ 82974000
* DECLARE                                                   /*   @10A*/ 83024000
*   1 SMF420HA BASED(ADDR(SMF42) + SMF42HL1),               /*   @10A*/ 83074000
*    2 SMF42HA1,                  /* Lock Structure Summary             83174000
*                                    section                     @10A*/ 83224000
*     3 SMF42HAA FIXED(32),       /* Interval length. This is the       83274000
*                                    total time of the measurement      83324000
*                                    period. (in seconds)        @10A*/ 83351700
*     3 SMF42H00 CHAR(12),        /* reserved                    @10A*/ 83379400
*                                                                       83407200
*     3 SMF42HAB CHAR(16),        /* DFP LAF name                @10A*/ 83429400
*     3 SMF42H01 CHAR(16),        /* reserved                    @10A*/ 83451600
* /*-----------------------------------------------------------------*/ 83474000
* /* locks processed during VSAM/RLS read/write requests             */ 83524000
* /*-----------------------------------------------------------------*/ 83574000
*     3 SMF42HAC FIXED(32),       /* Now contains zeros (used to @10A*/ 83596300
*                                 /* contain:                    @10A*/ 83618600
*                                 /* Number of lock requests     @10A*/ 83640900
*                                 /*                             @10A*/ 83663200
*                                 /*                             @10A*/ 83685500
*     3 SMF42HAD FIXED(32),       /* Now contains zeros (used to @10A*/ 83707800
*                                 /* contain:                    @10A*/ 83730100
*                                 /* Number of true contention   @10A*/ 83752400
*                                 /* lock requests               @10A*/ 83774700
*     3 SMF42HAE FIXED(32),       /* Now contains zeros (Used to @10A*/ 83797000
*                                 /* contain:                    @10A*/ 83819300
*                                 /* Number of false contention  @10A*/ 83841600
*                                 /* lock requests               @10A*/ 83863900
*     3 SMF42HAF FIXED(32),       /* Reserved                        */ 83886500
*                                                                       83899000
*     3 SMF42HAG  Char(32),       /* reserved                        */ 83911500
* /*-----------------------------------------------------------------*/ 83924000
* /*locks processed which are not assocaited with specific read/write*/ 83974000
* /*-----------------------------------------------------------------*/ 84024000
*     3 SMF42HAH FIXED(32),       /* Now contains zeros (used to @10A*/ 84048000
*                                 /* contain:                    @10A*/ 84072000
*                                 /* Number of lock requests     @10A*/ 84096000
*                                 /*                             @10A*/ 84120000
*     3 SMF42HAI FIXED(32),       /* Now contains zeros (used to @10A*/ 84144000
*                                 /* contain:                    @10A*/ 84168000
*                                 /* Number of true contention   @10A*/ 84192000
*                                 /* lock requests               @10A*/ 84216000
*     3 SMF42HAJ FIXED(32),       /* Now contains zeros (used to @10A*/ 84240000
*                                 /* contain:                    @10A*/ 84264000
*                                 /* Number of false contention  @10A*/ 84288000
*                                 /* lock requests               @10A*/ 84312000
*     3 SMF42HAK FIXED(32),       /* Reserved                        */ 84336500
*                                                                       84349000
*     3 SMF42HAL  Char(32),       /* reserved                        */ 84361500
*                                                                       84361600
*     3 SMF42HCA   Fixed(31),     /* number of record lock       @10A*/ 84361700
*                                 /* requests                    @10A*/ 84361800
*                                 /* (obtain/alter/promote)      @10A*/ 84361900
*     3 SMF42HCB   Fixed(31),     /* number of record lock       @10A*/ 84362000
*                                 /* requests that cause true    @10A*/ 84362100
*                                 /* contention                  @10A*/ 84362200
*     3 SMF42HCC   Fixed(31),     /* number of record lock       @10A*/ 84362300
*                                 /* requests that cause False   @10A*/ 84362400
*                                 /* contention                  @10A*/ 84362500
*     3 SMF42HCD   Fixed(31),     /* number of record lock       @10A*/ 84362600
*                                 /* Release requests            @10A*/ 84362700
*     3 SMF42HCE   Fixed(31),     /* Number of component_1 type  @10A*/ 84362800
*                                 /* locks                       @10A*/ 84362900
*                                 /* (obtain/alter/promote)      @10A*/ 84363000
*     3 SMF42HCF   Fixed(31),     /* Number of component_1 type  @10A*/ 84363100
*                                 /* Release locks               @10A*/ 84363200
*     3 SMF42HCG   Char(8),       /* reserved                    @10A*/ 84363300
*     3 SMF42HCH   Fixed(31),     /* Number of component_1       @10A*/ 84363400
*                                 /* class 1 (DIWA) locks        @10A*/ 84363500
*                                 /* (obtain/alter/promote)      @10A*/ 84363600
*     3 SMF42HCI   Fixed(31),     /* Number of component_1       @10A*/ 84363700
*                                 /* class 1 (DIWA) locks        @10A*/ 84363800
*                                 /* that cause true contention  @10A*/ 84363900
*     3 SMF42HCJ   Fixed(31),     /* Number of component_1       @10A*/ 84364000
*                                 /* class 1 (DIWA) locks        @10A*/ 84364100
*                                 /* that cause false contention @10A*/ 84364200
*     3 SMF42HCK   Fixed(31),     /* Number of component_1       @10A*/ 84364300
*                                 /* class 1 (DIWA) Release lock @10A*/ 84364400
*     3 SMF42HCL   Fixed(31),     /* Number of component_1       @10A*/ 84364500
*                                 /* class 2 (upgrade) locks     @10A*/ 84364600
*                                 /* (obtain/alter/promote)      @10A*/ 84364700
*     3 SMF42HCM   Fixed(31),     /* Number of component_1       @10A*/ 84364800
*                                 /* class 2 (upgrade) locks     @10A*/ 84364900
*                                 /* that cause true contention  @10A*/ 84365000
*     3 SMF42HCN   Fixed(31),     /* Number of component_1       @10A*/ 84365100
*                                 /* class 2 (upgrade) locks     @10A*/ 84365200
*                                 /* that cause false contention @10A*/ 84365300
*     3 SMF42HCO   Fixed(31),     /* Number of component_1       @10A*/ 84365400
*                                 /* class 2 (upgrade) release   @10A*/ 84365500
*                                 /* release lock requests       @10A*/ 84365600
*     3 SMF42HCP   Fixed(31),     /* Number of component_1       @10A*/ 84365700
*                                 /* class 3 (Preformat) locks   @10A*/ 84365800
*                                 /* (obtain/alter/promote)      @10A*/ 84365900
*     3 SMF42HCQ   Fixed(31),     /* Number of component_1       @10A*/ 84366000
*                                 /* class 3 (Preformat) locks   @10A*/ 84366100
*                                 /* that cause true contention  @10A*/ 84366200
*     3 SMF42HCR   Fixed(31),     /* Number of component_1       @10A*/ 84366300
*                                 /* class 3 (Preformat) locks   @10A*/ 84366400
*                                 /* that cause false contention @10A*/ 84366500
*     3 SMF42HCS   Fixed(31),     /* Number of component_1       @10A*/ 84366600
*                                 /* class 3 (Preformat)         @10A*/ 84366700
*                                 /* release lock requests       @10A*/ 84366800
*     3 SMF42HCT   Fixed(31),     /* Number of component_2       @10A*/ 84366900
*                                 /* lock requests               @10A*/ 84367000
*                                 /* (obtain/alter/promote)      @10A*/ 84367100
*     3 SMF42HCU   Fixed(31),     /* Number of component_2       @10A*/ 84367200
*                                 /* lock requests that caused   @10A*/ 84367300
*                                 /* true contention             @10A*/ 84367400
*     3 SMF42HCV   Fixed(31),     /* Number of component_2       @10A*/ 84367500
*                                 /* lock requests that caused   @10A*/ 84367600
*                                 /* false contention            @10A*/ 84367700
*     3 SMF42HCW   Fixed(31),     /* Number of component_2       @10A*/ 84367800
*                                 /* release lock requests       @10A*/ 84367900
*     3 SMF42HCX   Fixed(31),     /* Number of special lock      @10A*/ 84368000
*                                 /* requests                    @10A*/ 84368100
*     3 SMF42HCY    Char(12),     /* reserved                    @10A*/ 84368200
*     3 SMF42HCZ    Char(32),     /* reserved                    @10A*/ 84368300
*                                 /*                             @10A*/ 84368400
* /*-----------------------------------------------------------------*/ 84374000
* /* Lock activity on One Mvs system in the sysplex                  */ 84424000
* /*-----------------------------------------------------------------*/ 84474000
*   1 SMF420HB BASED(ADDR(SMF42) + SMF42HL4), /*                 @10A*/ 84507300
*                                                                       84540600
*    2 SMF42HA2,                  /* MVS SYSTEM/LAF activity            84574000
*                                    totals section              @10A*/ 84624000
*     3 SMF42HBA FIXED(32),       /* Interval length. This is the       84674000
*                                    total time of the measurement      84724000
*                                    period. (in seconds)        @10A*/ 84750100
*     3 SMF42H02 CHAR(12),        /* reserved                    @10A*/ 84776200
*                                                                       84802400
*     3 SMF42HBB CHAR(16),        /* DFP LAF name                @10A*/ 84816600
*                                                                       84830800
*     3 SMF42HBC CHAR(8),         /* MVS system name             @10A*/ 84845200
*     3 SMF42H03 CHAR(8),         /* reserved                    @10A*/ 84859600
* /*-----------------------------------------------------------------*/ 84874000
* /* locks processed during VSAM/RLS read/write requests             */ 84924000
* /*-----------------------------------------------------------------*/ 84974000
*     3 SMF42HBD FIXED(32),       /* Now contains zeros (used to @10A*/ 84999000
*                                 /* contain:                    @10A*/ 85024000
*                                 /* Number of lock requests     @10A*/ 85049000
*                                 /* processed by this MVS system@10A*/ 85074000
*     3 SMF42HBE FIXED(32),       /* Now contains zeros (used to @10A*/ 85099000
*                                 /* contain:                    @10A*/ 85124000
*                                 /* Number of true contention   @10A*/ 85149000
*                                 /* lock requests               @10A*/ 85174000
*     3 SMF42HBF FIXED(32),       /* Now contains zeros (used to @10A*/ 85199000
*                                 /* contain:                    @10A*/ 85224000
*                                 /* Number of false contention  @10A*/ 85249000
*                                 /* lock requests               @10A*/ 85274000
*     3 SMF42HBG FIXED(32),       /* Reserved                        */ 85299000
*                                                                       85324000
*     3 SMF42HBH  Char(32),       /* reserved                        */ 85349000
* /*-----------------------------------------------------------------*/ 85374000
* /*locks processed which are not assocaited with specific read/write*/ 85424000
* /*-----------------------------------------------------------------*/ 85474000
*     3 SMF42HBI FIXED(32),       /* Now contains zeros (used to @10A*/ 85499000
*                                 /* contain:                    @10A*/ 85524000
*                                 /* Number of lock requests     @10A*/ 85549000
*                                 /* processed by this MVS system@10A*/ 85574000
*     3 SMF42HBJ FIXED(32),       /* Now contains zeros (used to @10A*/ 85599000
*                                 /* contain:                    @10A*/ 85624000
*                                 /* Number of true contention   @10A*/ 85649000
*                                 /* lock requests               @10A*/ 85674000
*     3 SMF42HBK FIXED(32),       /* Now contains zeros (used to @10A*/ 85699000
*                                 /* contain:                    @10A*/ 85724000
*                                 /* Number of false contention  @10A*/ 85749000
*                                 /* lock requests               @10A*/ 85774000
*     3 SMF42HBL FIXED(32),       /* Reserved                        */ 85799000
*                                                                       85824000
*     3 SMF42HBM  Char(32),       /* reserved                        */ 85825900
*                                                                       85827800
*                                                                       85829700
*                                                                       85831600
*     3 SMF42HDA   Fixed(31),     /* number of record lock       @10A*/ 85833500
*                                 /* requests                    @10A*/ 85835400
*                                 /* (obtain/alter/promote)      @10A*/ 85837300
*     3 SMF42HDB   Fixed(31),     /* number of record lock       @10A*/ 85839200
*                                 /* requests that cause true    @10A*/ 85841100
*                                 /* contention                  @10A*/ 85843000
*     3 SMF42HDC   Fixed(31),     /* number of record lock       @10A*/ 85844900
*                                 /* requests that cause False   @10A*/ 85846800
*                                 /* contention                  @10A*/ 85848700
*     3 SMF42HDD   Fixed(31),     /* number of record lock       @10A*/ 85850600
*                                 /* Release requests            @10A*/ 85852500
*     3 SMF42HDE   Fixed(31),     /* Number of component_1 type  @10A*/ 85854400
*                                 /* locks                       @10A*/ 85856300
*                                 /* (obtain/alter/promote)      @10A*/ 85858200
*     3 SMF42HDF   Fixed(31),     /* Number of component_1 type  @10A*/ 85860100
*                                 /* Release locks               @10A*/ 85862000
*     3 SMF42HDG   Char(8),       /* reserved                    @10A*/ 85863900
*     3 SMF42HDH   Fixed(31),     /* Number of component_1       @10A*/ 85865800
*                                 /* class 1 (DIWA) locks        @10A*/ 85867700
*                                 /* (obtain/alter/promote)      @10A*/ 85869600
*     3 SMF42HDI   Fixed(31),     /* Number of component_1       @10A*/ 85871500
*                                 /* class 1 (DIWA) locks        @10A*/ 85873400
*                                 /* that cause true contention  @10A*/ 85875300
*     3 SMF42HDJ   Fixed(31),     /* Number of component_1       @10A*/ 85877200
*                                 /* class 1 (DIWA) locks        @10A*/ 85879100
*                                 /* that cause false contention @10A*/ 85881000
*     3 SMF42HDK   Fixed(31),     /* Number of component_1       @10A*/ 85882900
*                                 /* class 1 (DIWA) Release lock @10A*/ 85884800
*     3 SMF42HDL   Fixed(31),     /* Number of component_1       @10A*/ 85886700
*                                 /* class 2 (upgrade) locks     @10A*/ 85888600
*                                 /* (obtain/alter/promote)      @10A*/ 85890500
*     3 SMF42HDM   Fixed(31),     /* Number of component_1       @10A*/ 85892400
*                                 /* class 2 (upgrade) locks     @10A*/ 85894300
*                                 /* that cause true contention  @10A*/ 85896200
*     3 SMF42HDN   Fixed(31),     /* Number of component_1       @10A*/ 85898100
*                                 /* class 2 (upgrade) locks     @10A*/ 85900000
*                                 /* that cause false contention @10A*/ 85901900
*     3 SMF42HDO   Fixed(31),     /* Number of component_1       @10A*/ 85903800
*                                 /* class 2 (upgrade) release   @10A*/ 85905700
*                                 /* release lock requests       @10A*/ 85907600
*     3 SMF42HDP   Fixed(31),     /* Number of component_1       @10A*/ 85909500
*                                 /* class 3 (Preformat) locks   @10A*/ 85911400
*                                 /* (obtain/alter/promote)      @10A*/ 85913300
*     3 SMF42HDQ   Fixed(31),     /* Number of component_1       @10A*/ 85915200
*                                 /* class 3 (Preformat) locks   @10A*/ 85917100
*                                 /* that cause true contention  @10A*/ 85919000
*     3 SMF42HDR   Fixed(31),     /* Number of component_1       @10A*/ 85920900
*                                 /* class 3 (Preformat) locks   @10A*/ 85922800
*                                 /* that cause false contention @10A*/ 85924700
*     3 SMF42HDS   Fixed(31),     /* Number of component_1       @10A*/ 85926600
*                                 /* class 3 (Preformat)         @10A*/ 85928500
*                                 /* release lock requests       @10A*/ 85930400
*     3 SMF42HDT   Fixed(31),     /* Number of component_2       @10A*/ 85932300
*                                 /* lock requests               @10A*/ 85934200
*                                 /* (obtain/alter/promote)      @10A*/ 85936100
*     3 SMF42HDU   Fixed(31),     /* Number of component_2       @10A*/ 85938000
*                                 /* lock requests that caused   @10A*/ 85939900
*                                 /* true contention             @10A*/ 85941800
*     3 SMF42HDV   Fixed(31),     /* Number of component_2       @10A*/ 85943700
*                                 /* lock requests that caused   @10A*/ 85945600
*                                 /* false contention            @10A*/ 85947500
*     3 SMF42HDW   Fixed(31),     /* Number of component_2       @10A*/ 85949400
*                                 /* release lock requests       @10A*/ 85951300
*     3 SMF42HDX   Fixed(31),     /* Number of special lock      @10A*/ 85953200
*                                 /* requests                    @10A*/ 85955100
*     3 SMF42HDY    Char(12),     /* reserved                    @10A*/ 85957000
*     3 SMF42HDZ    Char(32);     /* reserved                    @10A*/ 85958900
*                                 /*                             @10A*/ 85960800
*                                                                       85962700
* %SKIP_0H: ;                                                 /* @10A*/ 85964600
* %IF SMF42_0I ^= 'YES' %THEN %GOTO SKIP_0I;                            85966500
*                                                                       85974000
*@SPACE;                                                                86024000
* /*-----------------------------------------------------------------*/ 86074000
* /* Coupling Facility Cache Partition Summary (SMF42 subtype 18)    */ 86124000
* /* Data for this partition across ALL cache structures.            */ 86149000
* /*-----------------------------------------------------------------*/ 86174000
* DECLARE                                                   /*   @10A*/ 86224000
*   1 SMF420IA BASED(ADDR(SMF42) + SMF42IM1),               /*   @10A*/ 86274000
*    2 SMF42IA1,                  /* CF Cache Partition Totals          86324000
*                                    Section                     @10A*/ 86355500
*     3 SMF42IAC,                 /* Cache buffer pools                 86387000
*                                     there are 23 pools:               86400000
*                                     11 sequential, 11 direct,         86413000
*                                     and 1 default                     86426000
*                                     There is a SEPERATE section for   86439000
*                                     each partition.  This means that  86452000
*                                     there will be a minumum of 23     86465000
*                                     totals sections and 23 summary    86478000
*                                     sections.                      */ 86491000
*      4 SMF42IAA FIXED(32),       /* Interval length. This is the      86504000
*                                     total time of the measurement     86517000
*                                     period. (in seconds)       @10A*/ 86530400
*      4 SMF42I00 Char(12),        /* reserved                   @10A*/ 86543800
*                                                                       86557200
*      4 SMF42IAB CHAR(32),        /* Reserved                   @10A*/ 86568300
*                                                                       86579500
*      4 SMF42IBG Char(16),        /* partition type             @10A*/ 86585000
*                                  /* 'sequential' data only     @10A*/ 86590500
*                                  /* 'direct' data only         @10A*/ 86596000
*                                  /* 'Combined' data            @10A*/ 86601500
*                                                                       86607000
*      4 SMF42IBH Fixed(31),       /* SMS specified Cache weight @10A*/ 86657000
*      4 SMF42I01 Char(12),        /* partitionNameWord          @10A*/ 86707000
*      4 SMF42IAD FIXED(32),       /* Couple facility cache             86757000
*                                     partition number           @10A*/ 86807000
*      4 SMF42IAE FIXED(32),       /* Status conditions          @10A*/ 86857000
*      4 SMF42IAF FIXED(32),       /* Read hit counter           @10A*/ 86907000
*      4 SMF42IAG FIXED(32),       /* Read miss directory hit           86957000
*                                     counter                    @10A*/ 87007000
*      4 SMF42IAH FIXED(32),       /* Read miss assign supp             87057000
*                                     counter                    @10A*/ 87107000
*      4 SMF42IAI FIXED(32),       /* Read miss, name assigned          87157000
*                                     counter                    @10A*/ 87207000
*      4 SMF42IAJ FIXED(32),       /* Read miss target storage          87257000
*                                     class full counter         @10A*/ 87307000
*      4 SMF42IAK FIXED(32),       /* Write hit change bit 0            87357000
*                                     counter                    @10A*/ 87407000
*      4 SMF42IAL FIXED(32),       /* Write hit change bit 1            87457000
*                                     counter                    @10A*/ 87507000
*      4 SMF42IAM FIXED(32),       /* Write miss not registered         87557000
*                                     counter                    @10A*/ 87607000
*      4 SMF42IAN FIXED(32),       /* Write miss invalid state          87657000
*                                     counter                    @10A*/ 87707000
*      4 SMF42IAO FIXED(32),       /* Write miss target storage class   87757000
*                                     full counter               @10A*/ 87807000
*      4 SMF42IAP FIXED(32),       /* Directory entry reclaim           87857000
*                                     counter                    @10A*/ 87907000
*      4 SMF42IAQ FIXED(32),       /* Data table entry reclaim          87957000
*                                     counter                    @10A*/ 88007000
*      4 SMF42IAR FIXED(32),       /* XI for directory reclaim          88057000
*                                     counter                    @10A*/ 88107000
*      4 SMF42IAS FIXED(32),       /* XI for write counter       @10A*/ 88157000
*      4 SMF42IAT FIXED(32),       /* XI for name invalidation          88207000
*                                     counter                    @10A*/ 88257000
*      4 SMF42IAU FIXED(32),       /* XI for complement invalidation    88307000
*                                     counter                    @10A*/ 88357000
*      4 SMF42IAV FIXED(32),       /* Castout counter            @10A*/ 88407000
*      4 SMF42IAW FIXED(32),       /* Reference signal miss             88457000
*                                     counter                    @10A*/ 88507000
*      4 SMF42IAX FIXED(32),       /* Target storage class full         88557000
*                                     counter                    @10A*/ 88607000
*      4 SMF42IAY FIXED(32),       /* Directory entry counter    @10A*/ 88657000
*      4 SMF42IAZ FIXED(32),       /* Data area element counter  @10A*/ 88707000
*      4 SMF42IBA FIXED(32),       /* Total changed counter      @10A*/ 88757000
*      4 SMF42IBB FIXED(32),       /* Data area counter          @10A*/ 88807000
*      4 SMF42IBC FIXED(32),       /* Completed reference lists         88857000
*                                     counter                    @10A*/ 88907000
*      4 SMF42IBD FIXED(32),       /* Partially completed reference     88957000
*                                     list counter               @10A*/ 89007000
*      4 SMF42IBE FIXED(32),       /* XI for LCEN replacement           89057000
*                                     counter                    @10A*/ 89107000
*      4 SMF42IBF FIXED(32),       /* Write unchanged with XI           89157000
*                                     counter                    @10A*/ 89207000
* /*-----------------------------------------------------------------*/ 89284000
* /* Coupling Facility Cache Partition Summary (SMF42 subtype 18)    */ 89294000
* /* Data for this partition for a Single cache structure            */ 89304000
* /*-----------------------------------------------------------------*/ 89314000
*   1 SMF420IC BASED(ADDR(SMF42) + SMF42IM4),               /*   @10A*/ 89344000
*    2 SMF42IC1,                  /* CF Cache Partition Summary         89374000
*                                    Section                     @10A*/ 89405500
*     3 SMF42ICC,                 /* Cache buffer pools                 89437000
*                                    there are 23 pools:                89450000
*                                    11 sequential, 11 direct,          89463000
*                                    and 1 default                      89476000
*                                     There is a SEPERATE section for   89489000
*                                     each partition.  This means that  89502000
*                                     there will be a minumum of 23     89515000
*                                     totals sections and 23 summary    89528000
*                                     sections.                      */ 89541000
*      4 SMF42ICA FIXED(32),       /* Interval length. This is the      89554000
*                                     total time of the measurement     89567000
*                                     period. (in seconds)       @10A*/ 89580400
*      4 SMF42I02 Char(12),        /* reserved                   @10A*/ 89593800
*                                                                       89607200
*      4 SMF42I04 Fixed(16),       /* reserved                   @10A*/ 89614400
*      4 SMF42ICB CHAR(30),        /* Cache Structure Name       @10A*/ 89621600
*                                                                       89629000
*      4 SMF42IDG Char(16),        /* partition type             @10A*/ 89634000
*                                  /* 'sequential' data only     @10A*/ 89639000
*                                  /* 'direct' data only         @10A*/ 89644000
*                                  /* 'Combined' data            @10A*/ 89649000
*                                                                       89654000
*      4 SMF42IDH Fixed(31),       /* SMS specified Cache weight @10A*/ 89659000
*      4 SMF42I03 Char(12),        /* reserved                   @10A*/ 89664000
*                                                                       89669000
*      4 SMF42ICD FIXED(32),       /* Couple facility cache             89719000
*                                     partition number           @10A*/ 89769000
*      4 SMF42ICE FIXED(32),       /* Status conditions          @10A*/ 89819000
*      4 SMF42ICF FIXED(32),       /* Read hit counter           @10A*/ 89869000
*      4 SMF42ICG FIXED(32),       /* Read miss directory hit           89919000
*                                     counter                    @10A*/ 89969000
*      4 SMF42ICH FIXED(32),       /* Read miss assign supp             90019000
*                                     counter                    @10A*/ 90069000
*      4 SMF42ICI FIXED(32),       /* Read miss, name assigned          90119000
*                                     counter                    @10A*/ 90169000
*      4 SMF42ICJ FIXED(32),       /* Read miss target storage          90219000
*                                     class full counter         @10A*/ 90269000
*      4 SMF42ICK FIXED(32),       /* Write hit change bit 0            90319000
*                                     counter                    @10A*/ 90369000
*      4 SMF42ICL FIXED(32),       /* Write hit change bit 1            90419000
*                                     counter                    @10A*/ 90469000
*      4 SMF42ICM FIXED(32),       /* Write miss not registered         90519000
*                                     counter                    @10A*/ 90569000
*      4 SMF42ICN FIXED(32),       /* Write miss invalid state          90619000
*                                     counter                    @10A*/ 90669000
*      4 SMF42ICO FIXED(32),       /* Write miss target storage class   90719000
*                                     full counter               @10A*/ 90769000
*      4 SMF42ICP FIXED(32),       /* Directory entry reclaim           90819000
*                                     counter                    @10A*/ 90869000
*      4 SMF42ICQ FIXED(32),       /* Data table entry reclaim          90919000
*                                     counter                    @10A*/ 90969000
*      4 SMF42ICR FIXED(32),       /* XI for directory reclaim          91019000
*                                     counter                    @10A*/ 91069000
*      4 SMF42ICS FIXED(32),       /* XI for write counter       @10A*/ 91119000
*      4 SMF42ICT FIXED(32),       /* XI for name invalidation          91169000
*                                     counter                    @10A*/ 91219000
*      4 SMF42ICU FIXED(32),       /* XI for complement invalidation    91269000
*                                     counter                    @10A*/ 91319000
*      4 SMF42ICV FIXED(32),       /* Castout counter            @10A*/ 91369000
*      4 SMF42ICW FIXED(32),       /* Reference signal miss             91419000
*                                     counter                    @10A*/ 91469000
*      4 SMF42ICX FIXED(32),       /* Target storage class full         91519000
*                                     counter                    @10A*/ 91569000
*      4 SMF42ICY FIXED(32),       /* Directory entry counter    @10A*/ 91619000
*      4 SMF42ICZ FIXED(32),       /* Data area element counter  @10A*/ 91669000
*      4 SMF42IDA FIXED(32),       /* Total changed counter      @10A*/ 91719000
*      4 SMF42IDB FIXED(32),       /* Data area counter          @10A*/ 91769000
*      4 SMF42IDC FIXED(32),       /* Completed reference lists         91819000
*                                     counter                    @10A*/ 91869000
*      4 SMF42IDD FIXED(32),       /* Partially completed reference     91919000
*                                     list counter               @10A*/ 91969000
*      4 SMF42IDE FIXED(32),       /* XI for LCEN replacement           92019000
*                                     counter                    @10A*/ 92069000
*      4 SMF42IDF FIXED(32);       /* Write unchanged with XI           92119000
*                                     counter                    @10A*/ 92169000
* /*-----------------------------------------------------------------*/ 92169200
* /* Coupling Facility Cache Partition Summary (SMF42 subtype 18)    */ 92169400
* /* Directory/Element ratio data for this cache structure           */ 92169600
* /*-----------------------------------------------------------------*/ 92169800
* DECLARE                                                   /*   @11A*/ 92170000
*   1 SMF420IE BASED(ADDR(SMF42) + SMF42IM7),               /*   @11A*/ 92170200
*    2 SMF42IE1,                  /* CF Cache Directory/element  @11A*/ 92170400
*                                 /* ratio section               @11A*/ 92170600
*     3 SMF42IEA   Fixed(31),     /* Interval length             @11A*/ 92170800
*     3 SMF42I06   Char(12),      /* reserved                    @11A*/ 92171000
*     3 SMF42I07   Char(2),       /* reserved                    @11A*/ 92171200
*     3 SMF42IEB   Char(30),      /* DFSMS cache structure name  @11A*/ 92171400
*     3 SMF42IEC   Fixed(31),     /* Number of times the         @11A*/ 92171600
*                                 /* directory portion of the    @11A*/ 92171800
*                                 /* dir/ele ratio changes       @11A*/ 92172000
*     3 SMF42IED   Fixed(31),     /* Number of times the         @11A*/ 92172200
*                                 /* Element   portion of the    @11A*/ 92172400
*                                 /* dir/ele ratio changes       @11A*/ 92172600
*     3 SMF42IEE   Fixed(31),     /* Low  ratio value in this    @11A*/ 92172800
*                                 /* interval - directory part   @11A*/ 92173000
*     3 SMF42IEF   Fixed(31),     /* Low  ratio value in this    @11A*/ 92173200
*                                 /* interval - Element   part   @11A*/ 92173400
*     3 SMF42IEG   Fixed(31),     /* High ratio value in this    @11A*/ 92173600
*                                 /* interval - directory part   @11A*/ 92173800
*     3 SMF42IEH   Fixed(31),     /* High ratio value in this    @11A*/ 92174000
*                                 /* interval - Element   part   @11A*/ 92174200
*     3 SMF42IEI   Fixed(31),     /* Current ratio value in this @11A*/ 92174400
*                                 /* interval - directory part   @11A*/ 92174600
*     3 SMF42IEJ   Fixed(31);     /* Current ratio value in this @11A*/ 92174800
*                                                                       92175000
* %SKIP_0I: ;                                                 /* @11A*/ 92175200
*                                                                       92175400
* %IF SMF42_0J ^= 'YES' %THEN %GOTO SKIP_0J;                  /* @11A*/ 92175600
*                                                             /* @11A*/ 92175800
*@SPACE;                                                      /* @11A*/ 92176000
* /*------------------------------------------------------------ @11A*/ 92176200
* /* Coupling Facility Local Buffer Manager (SMF42 subtype 19)   @11A*/ 92176400
* /* Local Buffer Manager LRU Statistics Summary. sysplex totals @11A*/ 92176600
* /*------------------------------------------------------------ @11A*/ 92176800
* DECLARE                                                     /* @11A*/ 92177000
*   1 SMF420JA BASED(ADDR(SMF42) + SMF42JN1),                 /* @11A*/ 92177200
*    2 SMF42JA1,                   /*   sysplex totals section   @11A*/ 92177400
*                                                                       92177600
*     3 SMF42JAC,                  /*                                */ 92177800
*                                                                       92178000
*      4 SMF42JNA Fixed(32),       /* Interval length. This is the   */ 92178200
*                                  /* total time of the measurement  */ 92178400
*                                  /* period. (in seconds) total @11A*/ 92178600
*      4 SMF42J00 Char(12),        /* reserved                   @11A*/ 92178800
*                                                                       92179000
*      4 SMF42JNB Char(16),        /* reserved                   @11A*/ 92179200
*      4 SMF42JND Char(8),         /* Reserved                   @11A*/ 92179400
*                                                                       92179600
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 92179700
*  %DO;                           /*                             @21A*/ 92179800
*      4 SMF42JNE isa(int64bit_signed),                                 92179900
*                                  /* Average Cpu time for all   @11A*/ 92180000
*                                  /* systems in the sysplex.  This  */ 92180200
*                                  /* is the amount of CPU time      */ 92180400
*                                  /* (on average) that each system  */ 92180600
*                                  /* consumed while processing the  */ 92180800
*                                  /* Local Buffer Manager LRU       */ 92181000
*                                  /* alogrithm.                     */ 92181200
*  %END;                          /*                             @21A*/ 92181300
* %ELSE                           /*                             @21A*/ 92181400
*  %DO;                           /*                             @21A*/ 92181500
*      4 SMF42JNE                                                       92181600
*         CHAR(8),                 /* Average Cpu time for all   @21A*/ 92181700
*                                  /* systems in the sysplex.  This  */ 92181800
*                                  /* is the amount of CPU time  @21A*/ 92181900
*                                  /* (on average) that each system  */ 92182000
*                                  /* consumed while processing the  */ 92182100
*                                  /* Local Buffer Manager LRU   @21A*/ 92182200
*                                  /* alogrithm.                 @21A*/ 92182300
*  %END;                          /*                             @21A*/ 92182400
*                                                                       92182500
* %IF SMF42_ARU_DEFINITION = 'YES' %THEN                      /* @21A*/ 92182600
*  %DO;                           /*                             @21A*/ 92182700
*      4 SMF42JNF isa(int64bit_signed),                                 92182800
*                                  /* Total CPU time for this    @11A*/ 92182900
*                                  /* record (in milli-seconds)      */ 92183000
*                                  /* (sysplex totals)               */ 92183100
*  %END;                          /*                             @21A*/ 92183200
* %ELSE                           /*                             @21A*/ 92183300
*  %DO;                           /*                             @21A*/ 92183400
*      4 SMF42JNF                                               !@21A   92183500
*         CHAR(8),                 /* Total CPU time for this    @21A*/ 92183600
*                                  /* record (in milli-seconds)  @21A*/ 92183700
*                                  /* (sysplex totals)           @21A*/ 92183800
*  %END;                          /*                             @21A*/ 92183900
*                                                                       92184000
*      4 SMF42JN0 Char(4),         /* Reserved                   @21A*/ 92184100
*      4 SMF42JN7 Fixed(31),       /* Total number of write      @21A*/ 92184200
*                                  /* requests                   @21A*/ 92184300
*                                  /* (sysplex totals)           @21A*/ 92184400
*                                                                       92184500
*      4 SMF42JNG Fixed(31),       /* Average number of buffer   @11A*/ 92184600
*                                  /* manager LRU intervals processed*/ 92184700
*                                  /* during this period.            */ 92184800
*                                  /* (sysplex totals)               */ 92184900
*                                                                       92185000
*      4 SMF42JNH Fixed(31),       /* Total number of buffer     @11A*/ 92185100
*                                  /* manager LRU intervals processed*/ 92185200
*                                  /* during this period.            */ 92185300
*                                  /* (across the sysplex)           */ 92185400
*                                                                       92185500
*      4 SMF42JNI Fixed(31),       /* Average                    @11A*/ 92185600
*                                  /* Number of buffer manager       */ 92185700
*                                  /* LRU intervals processed        */ 92185800
*                                  /* where BMF was over the goal    */ 92185900
*                                  /* and normal algorithms were     */ 92186000
*                                  /* bypassed to reclaim buffers.   */ 92186100
*                                                                       92186200
*      4 SMF42JNJ Fixed(31),       /* Total                      @11A*/ 92186400
*                                  /* Number of buffer manager       */ 92186600
*                                  /* LRU intervals processed        */ 92186800
*                                  /* where BMF was over the goal    */ 92187000
*                                  /* and normal algorithms were     */ 92187200
*                                  /* bypassed to reclaim buffers.   */ 92187400
*                                  /* (across the sysplex)           */ 92187600
*                                                                       92187800
*      4 SMF42JNK Fixed(31),       /* Avg. number of times that  @11A*/ 92188000
*                                  /* BMF was called on this interval*/ 92188200
*                                  /*                                */ 92188400
*                                                                       92188600
*      4 SMF42JNL Fixed(31),       /* Total number of times that @11A*/ 92188800
*                                  /* BMF was called on this interval*/ 92189000
*                                  /* (across the sysplex)           */ 92189200
*                                                                       92189400
*      4 SMF42JNM Fixed(31),       /* Average number of BMF      @11A*/ 92189600
*                                  /* hits during this interval.     */ 92189800
*                                  /* (sysplex totals)               */ 92190000
*                                                                       92190200
*      4 SMF42JNN Fixed(31),       /* Total number of BMF        @11A*/ 92190400
*                                  /* hits during this interval.     */ 92190600
*                                  /* (sysplex totals)               */ 92190800
*                                                                       92191000
*      4 SMF42JNO Fixed(31),       /* Buffer manager number of   @11A*/ 92191200
*                                  /* 'hits' Current percentage      */ 92191400
*                                  /* during this interval.          */ 92191600
*                                  /* (sysplex totals)               */ 92191800
*                                                                       92192000
*      4 SMF42JNP Fixed(31),       /* Buffer manager number of   @11A*/ 92192200
*                                  /* 'hits' low percentage during   */ 92192400
*                                  /* this interval.                 */ 92192600
*                                  /* (sysplex totals)               */ 92192800
*                                                                       92193000
*      4 SMF42JNQ Fixed(31),       /* Buffer manager number of   @11A*/ 92193200
*                                  /* 'hits' high percentage during  */ 92193400
*                                  /* this interval.                 */ 92193600
*                                  /* (sysplex totals)               */ 92193800
*                                                                       92194000
*      4 SMF42JNR Fixed(31),       /* Buffer manager average     @11A*/ 92194200
*                                  /* 'hits' during this interval.   */ 92194400
*                                  /* (across the sysplex)           */ 92194600
*                                                                       92194800
*      4 SMF42JNS Fixed(31),       /* Avg. Sysplex Cache manager @11A*/ 92195000
*                                  /* number of 'hits' during this   */ 92195200
*                                  /* interval.                      */ 92195400
*                                  /* (Across the sysplex)           */ 92195600
*                                                                       92195800
*      4 SMF42JNT Fixed(31),       /* Tot Sysplex Cache manager  @11A*/ 92196000
*                                  /* number of 'hits' during this   */ 92196200
*                                  /* interval.                      */ 92196400
*                                  /* (Across the sysplex)           */ 92196600
*                                                                       92196800
*      4 SMF42JNU Fixed(31),       /* Sysplex Cache manager hits @11A*/ 92197000
*                                  /* current percentage             */ 92197200
*                                  /* during this interval           */ 92197400
*                                  /* (across the sysplex)           */ 92197600
*                                                                       92197800
*      4 SMF42JNV Fixed(31),       /* Sysplex Cache manager hits @11A*/ 92198000
*                                  /* low percentage during this     */ 92198200
*                                  /* interval.                      */ 92198400
*                                  /* (across the sysplex)           */ 92198600
*                                                                       92198800
*      4 SMF42JNW Fixed(31),       /* Sysplex Cache manager hits @11A*/ 92199000
*                                  /* high percentage during this    */ 92199200
*                                  /* interval.                      */ 92199400
*                                  /* (across the sysplex)           */ 92199600
*                                                                       92199800
*      4 SMF42JNX Fixed(31),       /* Sysplex Cache manager hits @11A*/ 92200000
*                                  /* average percentage during this */ 92200200
*                                  /* interval.                      */ 92200400
*                                  /* (across the sysplex)           */ 92200600
*                                                                       92200800
*      4 SMF42JNY Fixed(31),       /* Avg. DASD number of 'hits' @11A*/ 92201000
*                                  /* during this interval           */ 92201200
*                                  /* (across the sysplex)           */ 92201400
*                                                                       92201600
*      4 SMF42JNZ Fixed(31),       /* Tot DASD number of 'hits'  @11A*/ 92201800
*                                  /* during this interval           */ 92202000
*                                  /* (across the sysplex)           */ 92202200
*                                                                       92202400
*      4 SMF42JOA Fixed(31),       /* DASD 'hits' current        @11A*/ 92202600
*                                  /* percentage during this         */ 92202800
*                                  /* interval (across the sysplex)  */ 92203000
*                                                                       92203200
*      4 SMF42JOB Fixed(31),       /* DASD 'hits' low percentage @11A*/ 92203400
*                                  /* during this interval           */ 92203600
*                                  /* (across the sysplex)           */ 92203800
*                                                                       92204000
*      4 SMF42JOC Fixed(31),       /* DASD 'hits' high percentage@11A*/ 92204200
*                                  /* during this interval           */ 92204400
*                                  /* (across the sysplex)           */ 92204600
*                                                                       92204800
*      4 SMF42JOD Fixed(31),       /* Average                    @11A*/ 92205000
*                                  /* DASD average 'hits' during     */ 92205200
*                                  /* this interval                  */ 92205400
*                                  /* (across the sysplex)       @21A*/ 92205600
*                                                                       92205800
*      4 SMF42JOE(16),             /* Sysplex average            @11A*/ 92206000
*                                  /* Buffer pool count array.       */ 92206200
*                                  /* This is a 16 entry array with  */ 92206400
*                                  /* each entry 32 bytes long.  The */ 92206600
*                                  /* first entry is for the 2K      */ 92206800
*                                  /* storage pool, the second entry */ 92207000
*                                  /* is for the 4K storage pool.    */ 92207200
*                                  /* The format is described below. */ 92207400
*                                  /* (sysplex totals)               */ 92207600
*        /*----------------------------------------------------------*/ 92207800
*        /* Start  --- Buffer Pool Count Array Element - average     */ 92208000
*        /*----------------------------------------------------------*/ 92208200
*       5 SMF420JB,                /* Average                    @11A*/ 92208400
*        6 SMF42JOF Fixed(32),     /* Low value of the number of     */ 92208600
*                                  /* BMF buffers for this pool      */ 92208800
*                                  /* during this interval.          */ 92209000
*                                  /* (sysplex totals)               */ 92209200
*                                                                       92209400
*                                  /* Average                    @11A*/ 92209600
*        6 SMF42JOG Fixed(32),     /* High value of the number of    */ 92209800
*                                  /* BMF buffers for this pool      */ 92210000
*                                  /* during this interval.          */ 92210200
*                                  /* (sysplex totals)               */ 92210400
*                                                                       92210600
*                                  /* Average current            @11A*/ 92210800
*        6 SMF42JOH Fixed(32),     /* value of the number of         */ 92211000
*                                  /* BMF buffers for this pool      */ 92211200
*                                  /* during this interval.          */ 92211400
*                                  /* (sysplex totals)               */ 92211600
*                                                                       92211800
*        6 SMF42JOI Fixed(32),     /* reserved                   @11A*/ 92212000
*                                                                       92212200
*                                  /* Average                    @11A*/ 92212400
*        6 SMF42JOJ Fixed(32),     /* Low value of the number of     */ 92212600
*                                  /* extents for this pool          */ 92212800
*                                  /* during this interval.          */ 92213000
*                                  /* (sysplex totals)               */ 92213200
*                                                                       92213400
*                                  /* Average                    @11A*/ 92213600
*        6 SMF42JOK Fixed(32),     /* High value of the number of    */ 92213800
*                                  /* extents for this pool          */ 92214000
*                                  /* during this interval.          */ 92214200
*                                  /* (sysplex totals)               */ 92214400
*                                                                       92214600
*                                  /* Average current            @11A*/ 92214800
*        6 SMF42JOL Fixed(32),     /* value of the number of         */ 92215000
*                                  /* extents for this pool          */ 92215200
*                                  /* during this interval.          */ 92215400
*                                  /* (sysplex totals)               */ 92215600
*                                                                       92215800
*        6 SMF42JOM Fixed(32),     /* reserved                   @11A*/ 92216000
*        /*----------------------------------------------------------*/ 92216200
*        /* End  ---  Buffer Pool Count Array Element - average      */ 92216400
*        /*----------------------------------------------------------*/ 92216600
*                                                                       92219000
*                                                                       92269000
*                                                                       92289000
*      4 SMF42JRI(16),             /* Sysplex wide totals -      @11A*/ 92309000
*                                  /* Buffer pool count array.       */ 92329000
*                                  /* This is a 16 entry array with  */ 92349000
*                                  /* each entry 32 bytes long.  The */ 92369000
*                                  /* first entry is for the 2K      */ 92389000
*                                  /* storage pool, the second entry */ 92409000
*                                  /* is for the 4K storage pool.    */ 92429000
*                                  /* The format is described below. */ 92449000
*                                  /* (sysplex totals)               */ 92469000
*        /*----------------------------------------------------------*/ 92489000
*        /* Start - Buffer Pool Count Array Element - sysplex totals */ 92509000
*        /*----------------------------------------------------------*/ 92529000
*       5 SMF420JC,                /*                            @11A*/ 92549000
*                                  /* Average                    @11A*/ 92569000
*        6 SMF42JRJ Fixed(32),     /* Low value of the number of     */ 92589000
*                                  /* BMF buffers for this pool      */ 92609000
*                                  /* during this interval.          */ 92629000
*                                  /* (sysplex totals)               */ 92649000
*                                                                       92669000
*                                  /* Average                    @11A*/ 92689000
*        6 SMF42JRK Fixed(32),     /* High value of the number of    */ 92709000
*                                  /* BMF buffers for this pool      */ 92729000
*                                  /* during this interval.          */ 92749000
*                                  /* (sysplex totals)               */ 92769000
*                                                                       92789000
*                                  /* Average current            @11A*/ 92809000
*        6 SMF42JRL Fixed(32),     /* value of the number of         */ 92829000
*                                  /* BMF buffers for this pool      */ 92849000
*                                  /* during this interval.          */ 92869000
*                                  /* (sysplex totals)               */ 92889000
*                                                                       92909000
*        6 SMF42JRM Fixed(32),     /* reserved                   @11A*/ 92929000
*                                                                       92949000
*                                  /* Average                    @11A*/ 92969000
*        6 SMF42JRN Fixed(32),     /* Low value of the number of     */ 92989000
*                                  /* extents for this pool          */ 93009000
*                                  /* during this interval.          */ 93029000
*                                  /* (sysplex totals)               */ 93049000
*                                                                       93069000
*                                  /* Average                    @11A*/ 93089000
*        6 SMF42JRO Fixed(32),     /* High value of the number of    */ 93109000
*                                  /* extents for this pool          */ 93129000
*                                  /* during this interval.          */ 93149000
*                                  /* (sysplex totals)               */ 93169000
*                                                                       93189000
*                                  /* Average current            @11A*/ 93209000
*        6 SMF42JRP Fixed(32),     /* value of the number of         */ 93229000
*                                  /* extents for this pool          */ 93249000
*                                  /* during this interval.          */ 93269000
*                                  /* (sysplex totals)               */ 93289000
*                                                                       93309000
*        6 SMF42JRQ Fixed(32),     /* reserved                   @11A*/ 93329000
*        /*----------------------------------------------------------*/ 93349000
*        /* End   - Buffer Pool Count Array Element - sysplex totals */ 93369000
*        /*----------------------------------------------------------*/ 93389000
*                                                                       93409000
*                                  /* Average                    @11A*/ 93429000
*      4 SMF42JON Fixed(32),       /* Buffer size goal (in mega-     */ 93449000
*                                  /* bytes) - low value             */ 93469000
*                                  /* (sysplex totals)               */ 93489000
*                                                                       93509000
*                                  /* Total                      @11A*/ 93529000
*      4 SMF42JOO Fixed(32),       /* Buffer size goal (in mega-     */ 93549000
*                                  /* bytes) - low value             */ 93569000
*                                  /* (sysplex totals)               */ 93589000
*                                                                       93609000
*                                  /* Average                    @11A*/ 93629000
*      4 SMF42JOP Fixed(32),       /* Buffer size goal (in mega-     */ 93649000
*                                  /* bytes) - high value.           */ 93669000
*                                  /* (sysplex totals)               */ 93689000
*                                                                       93709000
*                                  /* Total                      @11A*/ 93729000
*      4 SMF42JOQ Fixed(32),       /* Buffer size goal (in mega-     */ 93749000
*                                  /* bytes) - high value.           */ 93769000
*                                  /* (sysplex totals)               */ 93789000
*                                                                       93809000
*                                  /* Average                    @11A*/ 93829000
*      4 SMF42JOR Fixed(32),       /* Buffer size goal (in mega-     */ 93849000
*                                  /* bytes) - current value.        */ 93869000
*                                  /* (sysplex totals)               */ 93889000
*                                                                       93909000
*                                  /* Total                      @11A*/ 93929000
*      4 SMF42JOS Fixed(32),       /* Buffer size goal (in mega-     */ 93949000
*                                  /* bytes) - current value.        */ 93969000
*                                  /* (sysplex totals)               */ 93989000
*                                                                       94009000
*                                  /* Total                      @11A*/ 94029000
*      4 SMF42JOT Fixed(32),       /* Buffer size goal (in mega-     */ 94049000
*                                  /* bytes) - Average value.        */ 94069000
*                                  /* (sysplex totals)               */ 94089000
*                                                                       94109000
*      4 SMF42JOU Fixed(32),       /* reserved                   @11A*/ 94129000
*                                                                       94149000
*                                  /* Average                    @11A*/ 94169000
*      4 SMF42JOV Fixed(32),       /* Buffer size calculated         */ 94189000
*                                  /* (in megabytes) - low value     */ 94209000
*                                  /* (across the sysplex)           */ 94229000
*                                                                       94249000
*                                  /* Total                      @11A*/ 94269000
*      4 SMF42JOW Fixed(32),       /* Buffer size calculated         */ 94289000
*                                  /* (in megabytes) - low value     */ 94309000
*                                  /* (across the sysplex)           */ 94329000
*                                                                       94349000
*                                  /* Average                    @11A*/ 94369000
*      4 SMF42JOX Fixed(32),       /* Buffer size calculated         */ 94389000
*                                  /* (in megabytes) - high value    */ 94409000
*                                  /* (across the sysplex)           */ 94429000
*                                                                       94449000
*                                  /* Total                      @11A*/ 94469000
*      4 SMF42JOY Fixed(32),       /* Buffer size calculated         */ 94489000
*                                  /* (in megabytes) - high value    */ 94509000
*                                  /* (across the sysplex)           */ 94529000
*                                                                       94549000
*                                  /* Average                    @11A*/ 94569000
*      4 SMF42JOZ Fixed(32),       /* Buffer size calculated         */ 94589000
*                                  /* (in megabytes) - current value */ 94609000
*                                  /* (sysplex totals)               */ 94629000
*                                                                       94649000
*                                  /* Total                      @11A*/ 94669000
*      4 SMF42JRA Fixed(32),       /* Buffer size calculated         */ 94689000
*                                  /* (in megabytes) - current value */ 94709000
*                                  /* (sysplex totals)               */ 94729000
*                                                                       94749000
*                                  /* Total                      @11A*/ 94769000
*      4 SMF42JRB Fixed(32),       /* Buffer size calculated         */ 94789000
*                                  /* (in megabytes) - Average value */ 94809000
*                                  /* (sysplex totals)               */ 94829000
*                                                                       94849000
*      4 SMF42JRC Fixed(31),       /* Reserved                   @11A*/ 94869000
*                                                                       94889000
*      4 SMF42JRD Char(8),         /* Reserved                   @11A*/ 94909000
*                                                                       94929000
*                                  /* Average                    @11A*/ 94949000
*      4 SMF42JRE(16),             /* Calculated megabytes           */ 94969000
*                                  /* distribution array.  this is a */ 94989000
*                                  /* 16 entry array which contains  */ 95009000
*                                  /* the number of times the cal-   */ 95029000
*                                  /* culated value occurred within  */ 95049000
*                                  /* a 100mb span.  Entry 1= 0-99m, */ 95069000
*                                  /* entry 2 = 100-100m... entry    */ 95089000
*                                  /* (across the sysplex)           */ 95109000
*        /*----------------------------------------------------------*/ 95129000
*        /* Start --  Buffer Banager Calculated Distribution Array   */ 95149000
*        /*----------------------------------------------------------*/ 95169000
*       5 SMF420JD,                /*                            @11A*/ 95189000
*                                                                       95209000
*                                  /* Average                    @11A*/ 95229000
*        6 SMF42JRF Fixed(32),     /* Number of times caculated      */ 95249000
*                                  /* value was within this range    */ 95269000
*                                  /* (across the sysplex)           */ 95289000
*                                                                       95309000
*        /*----------------------------------------------------------*/ 95329000
*        /* End   --  Buffer Banager Calculated Distribution Array   */ 95349000
*        /*----------------------------------------------------------*/ 95369000
*                                  /* Total                      @11A*/ 95389000
*      4 SMF42JRG(16),             /* Calculated megabytes           */ 95409000
*                                  /* distribution array.  this is a */ 95429000
*                                  /* 16 entry array which contains  */ 95449000
*                                  /* the number of times the cal-   */ 95469000
*                                  /* culated value occurred within  */ 95489000
*                                  /* a 100mb span.  Entry 1= 0-99m, */ 95509000
*                                  /* entry 2 = 100-199m... entry    */ 95529000
*                                  /* (sysplex totals)               */ 95549000
*        /*----------------------------------------------------------*/ 95569000
*        /* Start --  Buffer Banager Calculated Distribution Array   */ 95589000
*        /*----------------------------------------------------------*/ 95609000
*       5 SMF420JE,                /*                            @11A*/ 95629000
*                                                                       95649000
*                                  /* Total                      @11A*/ 95669000
*        6 SMF42JRH Fixed(32),     /* Number of times caculated  @21A*/ 95689000
*                                  /* value was within this range    */ 95709000
*                                  /* (across the sysplex)           */ 95729000
*                                                                       95749000
*        /*----------------------------------------------------------*/ 95769000
*        /* End   --  Buffer Banager Calculated Distribution Array   */ 95789000
*        /*----------------------------------------------------------*/ 95809000
*      !                                                           @21A 95809200
*      ! Additional statistics for RMF                             @21A 95809400
*      !                                                           @21A 95809600
*      4 SMF42JTA Fixed(31),       ! Avg. number of scm read reques@21A 95809800
*                                  ! which encountered castout lock@21A 95810000
*                                  ! contention during this interva@21A 95810200
*                                  ! (across the sysplex)          @21A 95810400
*      4 SMF42JTB Fixed(31),       ! Total number of scm read reque@21A 95810600
*                                  ! which encountercastout lock   @21A 95810800
*                                  ! contention during this interva@21A 95811000
*                                  ! (across the sysplex)          @21A 95811200
*      4 SMF42JTC Fixed(31),       ! Avg. number of scm read reques@21A 95811400
*                                  ! during this interval          @21A 95811600
*                                  ! (across the sysplex)          @21A 95811800
*      4 SMF42JTD Fixed(31),       ! Total number of scm read reque@21A 95812000
*                                  ! during this interval          @21A 95812200
*                                  ! (across the sysplex)          @21A 95812400
*      4 SMF42JTE Fixed(31),       ! SCM read requests which       @21A 95812600
*                                  ! encountered castout lock      @21A 95812800
*                                  ! contention current percentage @21A 95813000
*                                  ! during this interval          @21A 95813200
*                                  ! (across the sysplex)          @21A 95813400
*      4 SMF42JTF Fixed(31),       ! SCM read requests which       @21A 95813600
*                                  ! encountered castout lock      @21A 95813800
*                                  ! contention low percentage duri@21A 95814000
*                                  ! this interval                 @21A 95814200
*                                  ! (across the sysplex)          @21A 95814400
*      4 SMF42JTG Fixed(31),       ! SCM read requests which       @21A 95814600
*                                  ! encountered castout lock      @21A 95814800
*                                  ! contention high percentage    @21A 95815000
*                                  ! during this interval          @21A 95815200
*                                  ! (across the sysplex)          @21A 95815400
*      4 SMF42JTH Fixed(31),       ! SCM read requests which       @21A 95815600
*                                  ! encountered castout lock      @21A 95815800
*                                  ! contention average percentage @21A 95816000
*                                  ! during this interval          @21A 95816200
*                                  ! (across the sysplex)          @21A 95816400
*      4 SMF42JTI Fixed(31),       ! Avg. number of redos          @21A 95816600
*                                  ! during this interval          @21A 95816800
*                                  ! (across the sysplex)          @21A 95817000
*      4 SMF42JTJ Fixed(31),       ! Total number of redos         @21A 95817200
*                                  ! during this interval          @21A 95817400
*                                  ! (across the sysplex)          @21A 95817600
*      4 SMF42JTK Fixed(31),       ! Avg. number of recursive redos@21A 95817800
*                                  ! during this interval          @21A 95818000
*                                  ! (across the sysplex)          @21A 95818200
*      4 SMF42JTL Fixed(31),       ! Total number of recursive redo@21A 95818400
*                                  ! during this interval          @21A 95818600
*                                  ! (across the sysplex)          @21A 95818800
*      4 SMF42JTM Fixed(31),       ! Redos current percentage      @21A 95819000
*                                  ! during this interval          @21A 95819200
*                                  ! (across the sysplex)          @21A 95819400
*      4 SMF42JTN Fixed(31),       ! Redos low percentage          @21A 95819600
*                                  ! during this interval          @21A 95819800
*                                  ! (across the sysplex)          @21A 95820000
*      4 SMF42JTO Fixed(31),       ! Redos high percentage         @21A 95820200
*                                  ! during this interval          @21A 95820400
*                                  ! (across the sysplex)          @21A 95820600
*      4 SMF42JTP Fixed(31),       ! Redos average percentage      @21A 95820800
*                                  ! during this interval          @21A 95821000
*                                  ! (across the sysplex)          @21A 95821200
*      4 SMF42JTQ Fixed(31),       ! Recursive Redos               @21A 95821400
*                                  ! current percentage during     @21A 95821600
*                                  ! this interval                 @21A 95821800
*                                  ! (across the sysplex)          @21A 95822000
*      4 SMF42JTR Fixed(31),       ! Recursive Redos               @21A 95822200
*                                  ! low percentage during         @21A 95822400
*                                  ! this interval                 @21A 95822600
*                                  ! (across the sysplex)          @21A 95822800
*      4 SMF42JTS Fixed(31),       ! Recursive Redos               @21A 95823000
*                                  ! high percentage during        @21A 95823200
*                                  ! this interval                 @21A 95823400
*                                  ! (across the sysplex)          @21A 95823600
*      4 SMF42JTT Fixed(31),       ! Recursive Redos               @21A 95823800
*                                  ! average percentage during     @21A 95824000
*                                  ! this interval                 @21A 95824200
*                                  ! (across the sysplex)          @21A 95824400
*      4 SMF42JUA Fixed(31),       ! Avg. number of                @21A 95824600
*                                  ! Number of buffer manager      @21A 95824800
*                                  ! LRU intervals processed       @21A 95825000
*                                  ! where BMF was over the goal   @21A 95825200
*                                  ! accelerated the aging, but    @21A 95825400
*                                  ! did not go into panic mode.   @21A 95825600
*                                  ! (across the sysplex)          @21A 95825800
*      4 SMF42JUB Fixed(31);       ! Total number of               @21A 95826000
*                                  ! Number of buffer manager      @21A 95826200
*                                  ! LRU intervals processed       @21A 95826400
*                                  ! where BMF was over the goal   @21A 95826600
*                                  ! accelerated the aging, but    @21A 95826800
*                                  ! did not go into panic mode.   @21A 95827000
*                                  ! (across the sysplex)          @21A 95827200
* /*------------------------------------------------------------ @11A*/ 95829000
* /* Coupling Facility Local Buffer Manager (SMF42 subtype 19)   @11A*/ 95849000
* /* Local Buffer Manager LRU Statistics Summary. single system  @11A*/ 95869000
* /*------------------------------------------------------------ @11A*/ 95889000
* DECLARE                                                     /* @11A*/ 95909000
*   1 SMF420PA BASED(ADDR(SMF42) + SMF42JN4),                 /* @11A*/ 95929000
*    2 SMF42PA1,                   /*                            @11A*/ 95949000
*                                                                       95969000
*     3 SMF42PAC,                  /*                                */ 95989000
*                                                                       96009000
*      4 SMF42JPA Fixed(32),       /* Interval length. This is the   */ 96029000
*                                  /* total time of the measurement  */ 96049000
*                                  /* period. (in seconds) total @11A*/ 96069000
*                                                                       96089000
*      4 SMF42J01 Char(12),        /* Reserved                   @11A*/ 96109000
*                                                                       96129000
*      4 SMF42JPB Char(8),         /* MVS system name.           @11A*/ 96149000
*      4 SMF42JPC Char(8),         /* Reserved                       */ 96169000
*      4 SMF42JPD Char(8),         /* Reserved                   @11A*/ 96189000
*                                                                       96209000
*      4 SMF42JPE Char(8),         /* Average CPU time spent by  @11A*/ 96229000
*                                  /* BMF LRU processing during      */ 96249000
*                                  /* each cycle (in milli-seconds)  */ 96269000
*                                                                       96289000
*      4 SMF42JPF Char(8),         /* Total CPU time for this    @11A*/ 96309000
*                                  /* record (in milli-seconds)      */ 96329000
*                                                                       96349000
*      4 SMF42JP1 Char(12),        /* Reserved                   @21C*/ 96357000
*                                                                       96365000
*      4 SMF42JP6 Fixed(31),       /* Total number of write      @21A*/ 96373000
*                                  /* requests                   @21A*/ 96381000
*                                                                       96389000
*      4 SMF42JPG Fixed(31),       /* Number of buffer manager   @11A*/ 96409000
*                                  /* LRU intervals processed        */ 96429000
*                                  /* during this period.            */ 96449000
*                                                                       96469000
*      4 SMF42JPH Fixed(31),       /* Number of buffer manager   @11A*/ 96489000
*                                  /* LRU intervals processed        */ 96509000
*                                  /* where BMF was over the goal    */ 96529000
*                                  /* and normal algorithms were     */ 96549000
*                                  /* bypassed to reclaim buffers.   */ 96569000
*                                                                       96589000
*      4 SMF42JPI Fixed(31),       /* Total number of times that @11A*/ 96609000
*                                  /* BMF was called on this interval*/ 96629000
*                                                                       96649000
*      4 SMF42JP2 Fixed(31),       /* Number of buffer manager   @21A*/ 96659000
*                                  /* LRU intervals processed    @21A*/ 96669000
*                                  /* where BMF was over the goal@21A*/ 96679000
*                                  /* accelerated the aging, but @21A*/ 96689000
*                                  /* did not go into panic mode.@21A*/ 96699000
*      4 SMF42JPJ Fixed(31),       /* Buffer manager number of   @11A*/ 96709000
*                                  /* hits during this interval.     */ 96729000
*                                                                       96749000
*      4 SMF42JPK Fixed(31),       /* Buffer manager number of   @11A*/ 96769000
*                                  /* 'hits' current percentage      */ 96789000
*                                  /* during this interval. Value    */ 96809000
*                                  /* for the last LRU cycle before  */ 96829000
*                                  /* the SMF record was processed   */ 96849000
*                                                                       96869000
*      4 SMF42JPL Fixed(31),       /* Buffer manager number of   @11A*/ 96889000
*                                  /* 'hits' low percentage during   */ 96909000
*                                  /* this interval.                 */ 96929000
*                                                                       96949000
*      4 SMF42JPM Fixed(31),       /* Buffer manager number of   @11A*/ 96969000
*                                  /* 'hits' high percentage during  */ 96989000
*                                  /* this interval.                 */ 97009000
*                                                                       97029000
*      4 SMF42JPN Fixed(31),       /* Buffer manager average     @11A*/ 97049000
*                                  /* 'hits' during this interval.   */ 97069000
*                                                                       97089000
*      4 SMF42JP3 Char(12),        /* Reserved                   @11A*/ 97109000
*                                                                       97129000
*      4 SMF42JPO Fixed(31),       /* Sysplex Cache manager      @11A*/ 97149000
*                                  /* number of 'hits' during this   */ 97169000
*                                  /* interval.                      */ 97189000
*                                                                       97209000
*      4 SMF42JPP Fixed(31),       /* Sysplex cache manager num  @11A*/ 97229000
*                                  /* of 'hits' current percentage   */ 97249000
*                                  /* during this interval. Value    */ 97269000
*                                  /* for the last LRU cycle before  */ 97289000
*                                  /* the SMF record was processed   */ 97309000
*                                                                       97329000
*      4 SMF42JPQ Fixed(31),       /* Sysplex Cache manager hits @11A*/ 97349000
*                                  /* low percentage during this     */ 97369000
*                                  /* interval.                      */ 97389000
*                                                                       97409000
*      4 SMF42JPR Fixed(31),       /* Sysplex Cache manager hits @11A*/ 97429000
*                                  /* high percentage during this    */ 97449000
*                                  /* interval.                      */ 97469000
*                                                                       97489000
*      4 SMF42JPS Fixed(31),       /* Sysplex Cache manager hits @11A*/ 97509000
*                                  /* average percentage during this */ 97529000
*                                  /* interval.                      */ 97549000
*                                                                       97569000
*      4 SMF42JP4 Char(12),        /* Reserved                   @11A*/ 97589000
*                                                                       97609000
*      4 SMF42JPT Fixed(31),       /* DASD number of 'hits'      @11A*/ 97629000
*                                  /* during this interval           */ 97649000
*                                                                       97669000
*      4 SMF42JPU Fixed(31),       /* DASD number                @11A*/ 97689000
*                                  /* of 'hits' current percentage   */ 97709000
*                                  /* during this interval. Value    */ 97729000
*                                  /* for the last LRU cycle before  */ 97749000
*                                  /* the SMF record was processed   */ 97769000
*                                                                       97789000
*      4 SMF42JPV Fixed(31),       /* DASD 'hits' low percentage @11A*/ 97809000
*                                  /* during this interval           */ 97829000
*                                                                       97849000
*      4 SMF42JPW Fixed(31),       /* DASD 'hits' high percentage@11A*/ 97869000
*                                  /* during this interval           */ 97889000
*                                                                       97909000
*      4 SMF42JPX Fixed(31),       /* DASD average 'hits' during @11A*/ 97929000
*                                  /* this interval                  */ 97949000
*                                                                       97969000
*      4 SMF42JP5 Char(12),        /* Reserved                   @11A*/ 97989000
*                                                                       98009000
*      4 SMF42JPY(16),             /* Buffer pool count array.   @11A*/ 98029000
*                                  /* This is a 16 entry array with  */ 98049000
*                                  /* each entry 16 bytes long.  The */ 98069000
*                                  /* first entry is for the 2K      */ 98089000
*                                  /* storage pool, the second entry */ 98109000
*                                  /* is for the 4K storage pool.    */ 98129000
*                                  /* The format is described below. */ 98149000
*        /*----------------------------------------------------------*/ 98169000
*        /* Start  --- Buffer Pool Count Array Element               */ 98189000
*        /*----------------------------------------------------------*/ 98209000
*       5 SMF420JF,                                                     98229000
*                                                                       98249000
*        6 SMF42JPZ Fixed(32),     /* Low value of the number of @11A*/ 98269000
*                                  /* BMF buffers for this pool      */ 98289000
*                                  /* during this interval.          */ 98309000
*                                                                       98329000
*        6 SMF42JQA Fixed(32),     /* High value of the number of@11A*/ 98349000
*                                  /* BMF buffers for this pool      */ 98369000
*                                  /* during this interval.          */ 98389000
*                                                                       98409000
*        6 SMF42JQB Fixed(32),     /* Current value of the       @11A*/ 98429000
*                                  /* number of BMF buffers for      */ 98449000
*                                  /* this pool during this interval */ 98469000
*                                  /* This is the value that BMF     */ 98489000
*                                  /* used during the last LRU       */ 98509000
*                                  /* cycle before this SMF record   */ 98529000
*                                  /* was processed.                 */ 98549000
*                                                                       98569000
*        6 SMF42JQ6 Fixed(32),     /* Reserved                   @11A*/ 98589000
*                                                                       98609000
*        6 SMF42JQC Fixed(32),     /* Low value of the number of @11A*/ 98629000
*                                  /* extents for this pool          */ 98649000
*                                  /* during this interval.          */ 98669000
*                                                                       98689000
*        6 SMF42JQD Fixed(32),     /* High value of the number of@11A*/ 98709000
*                                  /* extents for this pool          */ 98729000
*                                  /* during this interval.          */ 98749000
*                                                                       98769000
*        6 SMF42JQF Fixed(32),     /* Current value of the       @11A*/ 98789000
*                                  /* number of extents for          */ 98809000
*                                  /* this pool during this interval */ 98829000
*                                  /* This is the value that BMF     */ 98849000
*                                  /* used during the last LRU       */ 98869000
*                                  /* cycle before this SMF record   */ 98889000
*                                  /* was processed.                 */ 98909000
*                                                                       98929000
*        6 SMF42JQ7 Fixed(32),     /* Reserved                   @11A*/ 98949000
*                                                                       98969000
*        /*----------------------------------------------------------*/ 98989000
*        /* End  ---  Buffer Pool Count Array Element                */ 99009000
*        /*----------------------------------------------------------*/ 99029000
*                                                                       99049000
*      4 SMF42JQG Fixed(32),       /* Buffer size goal (in mega- @11A*/ 99069000
*                                  /* bytes) - low value         @11A*/ 99089000
*                                                                       99109000
*      4 SMF42JQH Fixed(32),       /* Buffer size goal (in mega- @11A*/ 99129000
*                                  /* bytes) - high value.       @11A*/ 99149000
*                                                                       99169000
*      4 SMF42JQI Fixed(32),       /* Buffer size goal (in mega- @11A*/ 99189000
*                                  /* bytes) - current value.    @11A*/ 99209000
*                                                                       99229000
*      4 SMF42JQJ Fixed(32),       /* Buffer size goal (in mega- @11A*/ 99249000
*                                  /* bytes) - average value.    @11A*/ 99269000
*                                                                       99289000
*      4 SMF42JQK Fixed(32),       /* Buffer size calculated     @11A*/ 99309000
*                                  /* (in megabytes) - low value     */ 99329000
*                                                                       99349000
*      4 SMF42JQL Fixed(32),       /* Buffer size calculated     @11A*/ 99369000
*                                  /* (in megabytes) - high value    */ 99389000
*                                                                       99409000
*      4 SMF42JQM Fixed(32),       /* Buffer size calculated     @11A*/ 99429000
*                                  /* (in megabytes) - current value */ 99449000
*                                                                       99469000
*      4 SMF42JQN Fixed(32),       /* Buffer size calculated     @11A*/ 99489000
*                                  /* (in megabytes) - average value */ 99509000
*                                                                       99529000
*      4 SMF42JQ3 Char(8),         /* Reserved                   @11A*/ 99549000
*                                                                       99569000
*      4 SMF42JQO(16),             /* Calculated megabytes       @11A*/ 99589000
*                                  /* distribution array.  this is a */ 99609000
*                                  /* 16 entry array which contains  */ 99629000
*                                  /* the number of times the cal-   */ 99649000
*                                  /* culated value occurred within  */ 99669000
*                                  /* a 100mb span.  Entry 1= 0-99m, */ 99689000
*                                  /* entry 2 = 100-199m... entry    */ 99709000
*        /*----------------------------------------------------------*/ 99729000
*        /* Start --  Buffer Banager Calculated Distribution Array   */ 99749000
*        /*----------------------------------------------------------*/ 99769000
*       5 SMF420JG,                                                     99789000
*                                                                       99809000
*        6 SMF42JQP Fixed(32),     /* Number of times caculated  @21A*/ 99829000
*                                  /* value was within this range    */ 99849000
*                                                                       99869000
*        /*----------------------------------------------------------*/ 99889000
*        /* End   --  Buffer Banager Calculated Distribution Array   */ 99909000
*        /*----------------------------------------------------------*/ 99929000
*      !                                                           @21A 99930400
*      ! Additional statistics for RMF                             @21A 99931800
*      !                                                           @21A 99933200
*      4 SMF42JSA FIXED(31),       ! Number of SCM Read requests   @21A 99934600
*                                  ! which encountered castout     @21A 99936000
*                                  ! contention during this interva@21A 99937400
*      4 SMF42JSB FIXED(31),       ! Number of SCM Read requests   @21A 99938800
*                                  ! during this interval          @21A 99940200
*      4 SMF42JSC FIXED(31),       ! Current percentage of SCM read@21A 99941600
*                                  ! request which encountered cast@21A 99943000
*                                  ! contention during this interva@21A 99944400
*                                  ! Value for the last LRU cycle  @21A 99945800
*                                  ! before the SMF record was     @21A 99947200
*                                  ! processed                     @21A 99948600
*      4 SMF42JSD FIXED(31),       ! Low percentage during this    @21A 99950000
*                                  ! interval for SMF42JSC         @21A 99951400
*      4 SMF42JSE FIXED(31),       ! High percentage during this   @21A 99952800
*                                  ! interval for SMF42JSC         @21A 99954200
*      4 SMF42JSF FIXED(31),       ! Average percentage during this@21A 99955600
*                                  ! interval for SMF42JSC         @21A 99957000
*      4 SMF42JSG FIXED(31),       ! Number of Redos during        @21A 99958400
*                                  ! this interval.                @21A 99959800
*      4 SMF42JSH FIXED(31),       ! Current percentage of Redos   @21A 99961200
*                                  ! during this interval.         @21A 99962600
*                                  ! Value for the last LRU cycle  @21A 99964000
*                                  ! before the SMF record was     @21A 99965400
*                                  ! processed                     @21A 99966800
*      4 SMF42JSI FIXED(31),       ! Low percentage during this    @21A 99968200
*                                  ! interval for SMF42JSH         @21A 99969600
*      4 SMF42JSJ FIXED(31),       ! High percentage during this   @21A 99971000
*                                  ! interval for SMF42JSH         @21A 99972400
*      4 SMF42JSK FIXED(31),       ! Average percentage during     @21A 99973800
*                                  ! this interval for SMF42JSH    @21A 99975200
*      4 SMF42JSL FIXED(31),       ! Number of Recursive Redos duri@21A 99976600
*                                  ! this interval                 @21A 99978000
*      4 SMF42JSM FIXED(31),       ! Current percentage of         @21A 99979400
*                                  ! Recursive Redos during this   @21A 99980800
*                                  ! interval. Value for the last L@21A 99982200
*                                  ! cycle before the SMF record wa@21A 99983600
*                                  ! processed                     @21A 99985000
*      4 SMF42JSN FIXED(31),       ! Low percentage during this    @21A 99986400
*                                  ! interval for SMF42JSM         @21A 99987800
*      4 SMF42JSO FIXED(31),       ! High percentage during this   @21A 99989200
*                                  ! interval for SMF42JSM         @21A 99990600
*      4 SMF42JSP FIXED(31);       ! Average percentage during this@21A 99992000
*                                  ! interval for SMF42JSM         @21A 99993400
* %SKIP_0J: ;                                                     !@21A 99994800
