*                                                                       00000100
* %DCL IHACDR_INCLUDED CHAR EXT;                                        00000200
* %DEACTIVATE IHACDR_INCLUDED;                                          00000300
* %IF IHACDR_INCLUDED = '' %THEN                                        00000400
* %DO;                                                                  00000500
*/* Macro made bi-lingual on 93039. CBGEN compile date 92322         */ 00000600
*% /*                                                                   00000700
         MACRO                                                          00000800
         IHACDR &DSECT=YES,&LIST=YES,&CDR=YES,&GNEQ=COND,&SNEQ=COND,   *00000900
               &NED=COND                                                00001000
         GBLC  &IHACDR_INCLUDED                                         00001100
         GBLC  &ZCBPRINT                                                00001200
&IHACDR_INCLUDED SETC 'YES'                                             00001300
 TITLE   'IHACDR  - Configuration Data Record                     '     00001400
**/ IHACDR_1:;                                                          00001500
*/**** START OF SPECIFICATIONS **************************************** 00001600
*                                                                     * 00001700
*01* MACRO NAME:  IHACDR                                              * 00001800
*                                                                     * 00001900
*01* DESCRIPTIVE NAME:  Configuration Data Record                     * 00002000
*                                                                     * 00002100
*02*   ACRONYM: CDR                                                   * 00002200
*                                                                     * 00002300
*01*   DSECT-NAME: CDR, NED, GNEQ, SNEQ                               * 00002400
*                                                                     * 00002500
*01* PROPRIETARY STATEMENT=                                           * 00002600
* LICENSED MATERIALS - PROPERTY OF IBM                                * 00002700
* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                         * 00002800
* 5655-068 (C) COPYRIGHT IBM CORP. 1992,1993                          * 00002900
* SEE COPYRIGHT INSTRUCTIONS                                          * 00003000
*                                                                     * 00003100
*01* STATUS= HBB5510                                                  * 00003200
*                                                                     * 00003300
*                                                                     * 00003400
*01* FUNCTION:      IHACDR maps the configuration data record (CDR),  * 00003500
*                   which is returned by the read configuration data  * 00003600
*                   (RCD) command. A CDR consists of a variable       * 00003700
*                   number of 32-byte fields. Each 32-byte field is   * 00003800
*                   identified in the first 2 bits (field identifier) * 00003900
*                   as one of four types: unused, a general node      * 00004000
*                   element qualifier (GNEQ), a specific node element * 00004100
*                   qualifier (SNEQ), or a node element descriptor    * 00004200
*                   (NED).  After the field identifier, the contents  * 00004300
*                   of the rest of the 32-byte field depends on the   * 00004400
*                   type. If the 32-byte field is a GNEQ, it is       * 00004500
*                   mapped by the GNEQ structure included in IHACDR.  * 00004600
*                   If the 32-byte field is an SNEQ, it is mapped by  * 00004700
*                   the SNEQ structure included in IHACDR.  If the    * 00004800
*                   32-byte field is an NED, it is mapped by the NED  * 00004900
*                   structure included in IHACDR. Unused fields have  * 00005000
*                   no mapping.                                       * 00005100
*                                                                     * 00005200
*                   The GNEQ is required and is the last 32-byte      * 00005300
*                   field in a CDR.  The GNEQ contains information    * 00005400
*                   that applies to all of the node elements in a     * 00005500
*                   CDR.                                              * 00005600
*                                                                     * 00005700
*                   An SNEQ or set of contiguous SNEQs contain        * 00005800
*                   information regarding the node element described  * 00005900
*                   by the immediately preceding NED in the CDR.      * 00006000
*                   SNEQs are optional.                               * 00006100
*                                                                     * 00006200
*                   An NED is a required 32-byte field in a CDR.      * 00006300
*                   There may be more than 1 NED in a CDR.  The NED   * 00006400
*                   contains information that uniquely identifies a   * 00006500
*                   node element.                                     * 00006600
*                                                                     * 00006700
*01* COMPONENT: I/O Supervisor (SC1C3)                                * 00006800
*                                                                     * 00006900
*01* EYE-CATCHER: none                                                * 00007000
*02*   OFFSET: N/A                                                    * 00007100
*02*   LENGTH: N/A                                                    * 00007200
*                                                                     * 00007300
*01* STORAGE ATTRIBUTES:                                              * 00007400
*02*   SUBPOOL:  caller-provided                                      * 00007500
*02*   KEY:  caller-provided                                          * 00007600
*02*   RESIDENCY: caller-provided                                     * 00007700
*                                                                     * 00007800
*01* METHOD OF ACCESS:                                                * 00007900
*                                                                     * 00008000
*02*   ASM: IHACDR                                                    * 00008100
*             ,DSECT=YES|NO to specify if macro should be defined     * 00008200
*                           as a DSECT.                               * 00008300
*             ,LIST=YES|NO to control whether or not the macro        * 00008400
*                          will appear in the assembler listing.      * 00008500
*             ,CDR=YES|NO to control whether the CDR mapping is       * 00008600
*                         expanded.                                   * 00008700
*             ,GNEQ=YES|NO to control whether the GNEQ mapping is     * 00008800
*                          expanded.                                  * 00008900
*             ,SNEQ=YES|NO to control whether the SNEQ mapping is     * 00009000
*                          expanded.                                  * 00009100
*             ,NED=YES|NO to control whether the NED mapping is       * 00009200
*                         expanded.                                   * 00009300
*                                                                     * 00009400
*                                                                     * 00009500
*02*   PL/X: %INCLUDE SYSLIB(IHACDR)                                  * 00009600
*                                                                     * 00009700
*      Printing of the macro expansion can be controlled by the       * 00009800
*      IHACDR_INCLUDED global macro variable.                         * 00009900
*      Any value other than 'NO' will result in                       * 00010000
*      the  macro  expansion being printed.  The default is 'YES'.    * 00010100
*      following examples illustrate how the                          * 00010200
*      the IHACDR_INCLUDED variable should be set.                    * 00010300
*                                                                     * 00010400
*            PL/X:  %IHACDR_INCLUDED='YES' %IHACDR_INCLUDED='NO'      * 00010500
*                                                                     * 00010600
*01* CREATED BY = issuer of IOSCDR service                            * 00010700
*                                                                     * 00010800
*01* DELETED BY =  issuer of IOSCDR service                           * 00010900
*                                                                     * 00011000
*01* POINTED TO BY: User defined                                      * 00011100
*                                                                     * 00011200
*01* SIZE: Variable                                                   * 00011300
*02*             CDR  -- Device dependent number of X'0020'           * 00011400
*02*                     byte records.                                * 00011500
*02*             GNEQ -- X'0020' bytes                                * 00011600
*02*             SNEQ -- X'0020' bytes                                * 00011700
*02*             NED  -- X'0020' bytes                                * 00011800
*                                                                     * 00011900
*01* STORAGE ESTIMATE =                                               * 00012000
*   One per issuance of IOSCDR service.                               * 00012100
*                                                                     * 00012200
*01* SERIALIZATION = N/A                                              * 00012300
*                                                                     * 00012400
* EXTERNAL CLASSIFICATION: GUPI                                       * 00012500
* END OF EXTERNAL CLASSIFICATION                                      * 00012600
*                                                                     * 00012700
*01* NOTES =                                                          * 00012800
*                                                                     * 00012900
*      1.  Printing of the macro expansion is controlled by the       * 00013000
*          ZCBPRINT global macro variable.  Any value other than 'NO' * 00013100
*          will result in the macro expansion being printed.  The     * 00013200
*          default is 'YES'.  The following examples illustrate how   * 00013300
*          the ZCBPRINT variable should be set.                       * 00013400
*                                                                     * 00013500
*               ASM:  GBLC &ZCBPRINT                                  * 00013600
*                     &ZCBPRINT SETC 'YES'  or   &ZCBPRINT SETC 'NO'  * 00013700
*              PL/X:  %DCL ZCBPRINT CHAR EXT                          * 00013800
*                     %ZCBPRINT='YES'       or   %ZCBPRINT='NO'       * 00013900
*                                                                     * 00014000
*     2.  A  global  variable IHACDR_INCLUDED is set to YES the first*  00014100
*          time the macro is invoked.                                 * 00014200
*               ASM:  This variable can be checked by the caller, to  * 00014300
*                     determine if the macro has already been invoked.* 00014400
*              PL/X:  This variable is checked in the macro code to   * 00014500
*                     determine if the control block should be        * 00014600
*                     included.                                       * 00014700
*                                                                     * 00014800
*01* CHANGE ACTIVITY:                                                 * 00014900
*                                                                     * 00015000
*   Flag LineItem  FMID    Date   ID    Comment                       * 00015100
*                                                                     * 00015200
*    $L0=OY21399  JBB2220 880201 PDLG:  Configuration Data Record     * 00015300
*    $L1=VERS     HBB3310 880201 PDLG:  Version macro into product    * 00015400
*    $L2=SNWY2    HBB4410 891023 PDLH:  Sunway II support             * 00015500
*    $L3=DEVSD    HBB5510 930304 PDLU:  IOS CDR Interface.            * 00015600
*                                       Externalize and make          * 00015700
*                                       bilingual.                    * 00015800
*    $P1=PIG2270  HBB5510 930823 PDLU:  Prolog updates            @P1A* 00015900
*    $P2=PIG3270  HBB5510 931104 PDLU:  Prolog updates, CDPI      @P2A* 00016000
*                                                                     * 00016100
*    $01=OW09673  HBB4430 950410 PDMC:  Correct mapping for time-out. * 00016130
*                                                                 @01A* 00016160
*    $02=OW25260  HBB4430 970331 PDNO:  3590 support for OS/390 R3    * 00016170
*                                                                 @02A* 00016180
*                                                                     * 00016200
****** END OF SPECIFICATIONS *****************************************/ 00016300
*% /*                                                                   00016400
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00016500
         AIF   ('&LIST' EQ 'YES').P2                                    00016600
.P1      ANOP                                                           00016700
         PUSH  PRINT                                                    00016800
         PRINT OFF                                                      00016900
.P2      ANOP                                                           00017000
         AIF   ('&CDR' EQ 'NO').L0002                                   00017100
         AIF   ('&DSECT' EQ 'YES').L0003                                00017200
         AIF   ('&CDR' NE 'YES').L0002                                  00017300
CDR      DS    0D        Configuration data record                      00017400
         AGO   .L0004                                                   00017500
.L0003   ANOP                                                           00017600
CDR      DSECT ,         Configuration data record                      00017700
.L0004   ANOP                                                           00017800
CDRFIELD DS    0CL0032   A CDR consists of a variable number of        *00017900
                         32-byte fields                                 00018000
CDRFINFO DS    0CL0032   CDR field information                          00018100
CDRFLDID EQU   X'C0'     Field identifier - identifies the contents of *00018200
                         the 32-byte field. The content of the         *00018300
                         remaining fields of this structure depend on  *00018400
                         the field identifier.                          00018500
         ORG   CDRFINFO+X'00000001'                                @01A 00018550
         DS    1CL0031                                                  00018600
*                                                                       00018700
*    *****************************************************************  00018800
*    *                                                               *  00018900
*    * Values for CDRFLDID                                           *  00019000
*    *                                                               *  00019100
*    *****************************************************************  00019200
*                                                                       00019300
*                                                                       00019400
CDRFUNUS EQU   B'00000000' Unused                                       00019500
CDRFSNEQ EQU   B'01000000' SNEQ                                         00019600
CDRFGNEQ EQU   B'10000000' GNEQ                                         00019700
CDRFNED  EQU   B'11000000' NED                                          00019800
CDR_LEN  EQU   *-CDR                                                    00019900
.L0002   ANOP                                                           00020000
*                                                                       00020100
*    *****************************************************************  00020200
*    *                                                               *  00020300
*    * GNEQ                                                          *  00020400
*    *                                                               *  00020500
*    *****************************************************************  00020600
*                                                                       00020700
*                                                                       00020800
         AIF   ('&GNEQ' EQ 'NO').L0005                                  00020900
         AIF   ('&DSECT' EQ 'YES').L0006                                00021000
         AIF   ('&GNEQ' NE 'YES').L0005                                 00021100
GNEQ     DS    0D        General Node-Element Qualifier                 00021200
         AGO   .L0007                                                   00021300
.L0006   ANOP                                                           00021400
GNEQ     DSECT ,         General Node-Element Qualifier                 00021500
.L0007   ANOP                                                           00021600
GNEFLAGS DS    0CL0001   Flags                                          00021700
GNEFLDID EQU   X'C0'     Field identifier                               00021800
         ORG   GNEFLAGS+X'00000001'                                     00021900
GNERS    DS    1BL1      Record selector                                00022000
GNEINTID DS    1FL2      Interface ID                                   00022100
GNEDDTO  DS    1FL1      Device-Dependent Time Out                 @01C 00022250
         DS    1CL0001   Reserved                                  @02C 00022310
GNEMIHPT DS    1FL1      MIH primary time out                      @02A 00022320
GNEMIHST DS    1FL1      MIH secondary time out                    @02A 00022330
GNEXINFO DS    0CL0024   General node element extended information      00022400
GNEQFLDS DS    1FL1      Q fields                                       00022500
         ORG   GNEQ+X'00000020'                                         00022600
GNEQ_LEN EQU   *-GNEQ                                                   00022700
.L0005   ANOP                                                           00022800
*                                                                       00022900
*    *****************************************************************  00023000
*    *                                                               *  00023100
*    * SNEQ                                                          *  00023200
*    *                                                               *  00023300
*    *****************************************************************  00023400
*                                                                       00023500
*                                                                       00023600
         AIF   ('&SNEQ' EQ 'NO').L0008                                  00023700
         AIF   ('&DSECT' EQ 'YES').L0009                                00023800
         AIF   ('&SNEQ' NE 'YES').L0008                                 00023900
SNEQ     DS    0D        Specific Node-Element Qualifier                00024000
         AGO   .L000A                                                   00024100
.L0009   ANOP                                                           00024200
SNEQ     DSECT ,         Specific Node-Element Qualifier                00024300
.L000A   ANOP                                                           00024400
SNEFLAGS DS    0CL0001   Flags                                          00024500
SNEFLDID EQU   X'C0'     Field identifier                               00024600
         ORG   SNEFLAGS+X'00000001'                                     00024700
         DS    1CL0007   Reserved                                       00024800
SNEXINFO DS    1CL0024   Specific node element extended information     00024900
SNEQ_LEN EQU   *-SNEQ                                                   00025000
.L0008   ANOP                                                           00025100
*                                                                       00025200
*    *****************************************************************  00025300
*    *                                                               *  00025400
*    * NED                                                           *  00025500
*    *                                                               *  00025600
*    *****************************************************************  00025700
*                                                                       00025800
*                                                                       00025900
         AIF   ('&NED' EQ 'NO').L000B                                   00026000
         AIF   ('&DSECT' EQ 'YES').L000C                                00026100
         AIF   ('&NED' NE 'YES').L000B                                  00026200
NED      DS    0D        Node-Element Descriptor                        00026300
         AGO   .L000D                                                   00026400
.L000C   ANOP                                                           00026500
NED      DSECT ,         Node-Element Descriptor                        00026600
.L000D   ANOP                                                           00026700
NEDFLAGS DS    0CL0001   Flags                                          00026800
NEDFLDID EQU   X'C0'     Field identifier                               00026900
NEDTOKEN EQU   X'20'     Token indicator                                00027000
NEDSNIND EQU   X'10'     Serial number indicator                        00027100
NEDSUBSN EQU   X'08'     Substitute serial number indicator             00027200
NEDRECON EQU   X'04'     Reconfiguration NED indicator                  00027300
NEDEMULA EQU   X'02'     Emulation NED indicator                        00027400
         ORG   NEDFLAGS+X'00000001'                                     00027500
NEDTYPE  DS    1FL1      Type of node element described by this NED     00027600
NEDCLASS DS    1FL1      I/O device class. Valid only for I/O device   *00027700
                         type NEDs                                      00027800
NEDFLAG2 DS    0FL1                                                     00027900
NEDLEVEL EQU   X'01'     Level indicator                                00028000
         ORG   NEDFLAG2+X'00000001'                                     00028100
NEDID    DS    0CL0028   Node element identifier                        00028200
NEDTYPEN DS    1CL0006   Type number                                    00028300
NEDMODN  DS    1CL0003   Model number                                   00028400
NEDMANUF DS    1CL0003   Manufacturer                                   00028500
NEDPMANU DS    1CL0002   Plant of manufacture                           00028600
NEDSEQN  DS    1CL0012   Sequence number                                00028700
NEDTAG   DS    1FL2      Tag                                            00028800
*                                                                       00028900
*    *****************************************************************  00029000
*    *                                                               *  00029100
*    * Values for NEDTYPE                                            *  00029200
*    *                                                               *  00029300
*    *****************************************************************  00029400
*                                                                       00029500
*                                                                       00029600
NEDTUNSP EQU   0         Unspecified                                    00029700
NEDTIODV EQU   1         I/O device                                     00029800
NEDTCU   EQU   2         Control Unit                                   00029900
*                                                                       00030000
*    *****************************************************************  00030100
*    *                                                               *  00030200
*    * Values for NEDCLASS                                           *  00030300
*    *                                                               *  00030400
*    *****************************************************************  00030500
*                                                                       00030600
*                                                                       00030700
NEDCUNSP EQU   0         Unspecified                                    00030800
NEDCDASD EQU   1         DASD                                           00030900
NEDCTAPE EQU   2         Magnetic tape                                  00031000
NEDCURIN EQU   3         Unit record (input)                            00031100
NEDCUROT EQU   4         Unit record (output)                           00031200
NEDCPRT  EQU   5         Printer                                        00031300
NEDCCOMM EQU   6         Communications controller                      00031400
NEDCFST  EQU   7         Full screen terminal                           00031500
NEDCLMT  EQU   8         Line mode terminal                             00031600
NEDCCTCA EQU   9         Channel-to-channel adapter                     00031700
NEDCSWIT EQU   10        Switch                                         00031800
*                                                                       00031900
*    *****************************************************************  00032000
*    *                                                               *  00032100
*    * Values for GNEQFLDS                                              00032200
*    *                                                               *  00032300
*    *****************************************************************  00032400
*                                                                       00032500
*                                                                       00032600
GNEQITME EQU   1         Device dependent time out value field offset   00032700
NED_LEN  EQU   *-NED                                                    00032800
.L000B   ANOP                                                           00032900
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00033000
         AIF   ('&LIST' EQ 'YES').P4                                    00033100
.P3      ANOP                                                           00033200
         POP   PRINT                                                    00033300
.P4      ANOP                                                           00033400
.P_EXIT  ANOP                                                           00033500
         MEND                                                           00033600
**/ IHACDR_2:;                                                          00033700
* %IHACDR_INCLUDED = 'YES';                                             00033800
* %DCL ZCBPRINT CHAR EXT;                                               00033900
* %DEACTIVATE ZCBPRINT;                                                 00034000
* %DCL IHACDR_LIST CHAR EXT;                                            00034100
* %DEACTIVATE IHACDR_LIST;                                              00034200
* %IF IHACDR_LIST ^= 'NO' &                                             00034300
*    ZCBPRINT ^= 'NO' %THEN                                             00034400
*   %GOTO IHACDR_3;                                                     00034500
*   @LIST PUSH NOECHO;                                                  00034600
*   @LIST NOASSEMBLE NOECHO;                                            00034700
*   @LIST OFF C NOECHO;                                                 00034800
* %IHACDR_3:;                                                           00034900
*/* Start of PL/X Source                                             */ 00035000
* DCL 1 CDR BDY(DWORD) BASED(CDRPTR), /* Configuration data record   */ 00035100
*       3 CDRFIELD(*) CHAR(32),   /* A CDR consists of a variable       00035200
*                                    number of 32-byte fields        */ 00035300
*         5 CDRFINFO,             /* CDR field information           */ 00035400
*           7 CDRFLDID BIT(2),    /* Field identifier - identifies the  00035500
*                                    contents of the 32-byte field.     00035600
*                                    The content of the remaining       00035700
*                                    fields of this structure depend    00035800
*                                    on the field identifier.        */ 00035900
*           7 * BIT(6),                                                 00036000
*           7 * CHAR(31);                                               00036100
*     /* Values for CDRFLDID                                         */ 00036200
* DCL                                                                   00036300
*   CDRFUNUS BIT(8) CONSTANT('00000000'B), /* Unused             @L3C*/ 00036400
*   CDRFSNEQ BIT(8) CONSTANT('01000000'B), /* SNEQ               @L3C*/ 00036500
*   CDRFGNEQ BIT(8) CONSTANT('10000000'B), /* GNEQ               @L3C*/ 00036600
*   CDRFNED  BIT(8) CONSTANT('11000000'B); /* NED                @L3C*/ 00036700
*                                                                       00036800
*     /* GNEQ                                                        */ 00036900
* DCL 1 GNEQ BDY(DWORD) BASED(GNEQPTR), /* General Node-Element         00037000
*                                          Qualifier                 */ 00037100
*       3 GNEFLAGS,               /* Flags                           */ 00037200
*         5 GNEFLDID BIT(2),      /* Field identifier                */ 00037300
*         5 * BIT(6),             /* Reserved                        */ 00037400
*       3 GNERS BIT(8),           /* Record selector                 */ 00037500
*       3 GNEINTID FIXED(16),     /* Interface ID                    */ 00037600
*       3 GNEDDTO FIXED(8),       /* Device-Dependent Time Out   @01C*/ 00037750
*       3 * CHAR(1),              /* Reserved                    @02C*/ 00037810
*       3 GNEMIHPT FIXED(8),      /* MIH primary time out        @02A*/ 00037820
*       3 GNEMIHST FIXED(8),      /* MIH secondary time out      @02A*/ 00037830
*       3 GNEXINFO CHAR(24),      /* General node element extended      00037900
*                                    information                     */ 00038000
*         5 GNEQFLDS(24) FIXED(8); /* Q fields                       */ 00038100
*                                                                       00038200
*     /* SNEQ                                                        */ 00038300
* DCL 1 SNEQ BDY(DWORD) BASED(SNEQPTR), /* Specific Node-Element        00038400
*                                          Qualifier                 */ 00038500
*       3 SNEFLAGS,               /* Flags                           */ 00038600
*         5 SNEFLDID BIT(2),      /* Field identifier                */ 00038700
*         5 * BIT(6),             /* Reserved                        */ 00038800
*       3 * CHAR(7),              /* Reserved                        */ 00038900
*       3 SNEXINFO CHAR(24);      /* Specific node element extended     00039000
*                                    information                     */ 00039100
*                                                                       00039200
*     /* NED                                                         */ 00039300
* DCL 1 NED BDY(DWORD) BASED(NEDPTR), /* Node-Element Descriptor     */ 00039400
*       3 NEDFLAGS,               /* Flags                           */ 00039500
*         5 NEDFLDID BIT(2),      /* Field identifier                */ 00039600
*         5 NEDTOKEN BIT(1),      /* Token indicator                 */ 00039700
*         5 NEDSNIND BIT(1),      /* Serial number indicator         */ 00039800
*         5 NEDSUBSN BIT(1),      /* Substitute serial number           00039900
*                                    indicator                       */ 00040000
*         5 NEDRECON BIT(1),      /* Reconfiguration NED indicator   */ 00040100
*         5 NEDEMULA BIT(1),      /* Emulation NED indicator         */ 00040200
*         5 * BIT(1),             /* Reserved                        */ 00040300
*       3 NEDTYPE FIXED(8),       /* Type of node element described     00040400
*                                    by this NED                     */ 00040500
*       3 NEDCLASS FIXED(8),      /* I/O device class. Valid only for   00040600
*                                    I/O device type NEDs            */ 00040700
*       3 NEDFLAG2 FIXED(8),                                /*   @L3A*/ 00040800
*         5 * BIT(7),             /* Reserved                    @L3C*/ 00040900
*         5 NEDLEVEL BIT(1),      /* Level indicator             @L3C*/ 00041000
*       3 NEDID,                  /* Node element identifier         */ 00041100
*         5 NEDTYPEN CHAR(6),     /* Type number                     */ 00041200
*         5 NEDMODN CHAR(3),      /* Model number                    */ 00041300
*         5 NEDMANUF CHAR(3),     /* Manufacturer                    */ 00041400
*         5 NEDPMANU CHAR(2),     /* Plant of manufacture            */ 00041500
*         5 NEDSEQN CHAR(12),     /* Sequence number                 */ 00041600
*         5 NEDTAG FIXED(16);     /* Tag                             */ 00041700
*     /* Values for NEDTYPE                                          */ 00041800
* DCL                                                                   00041900
*   NEDTUNSP FIXED(8) CONSTANT(0), /* Unspecified                    */ 00042000
*   NEDTIODV FIXED(8) CONSTANT(1), /* I/O device                     */ 00042100
*   NEDTCU   FIXED(8) CONSTANT(2); /* Control Unit                   */ 00042200
*     /* Values for NEDCLASS                                         */ 00042300
* DCL                                                                   00042400
*   NEDCUNSP FIXED(8) CONSTANT(0), /* Unspecified                    */ 00042500
*   NEDCDASD FIXED(8) CONSTANT(1), /* DASD                           */ 00042600
*   NEDCTAPE FIXED(8) CONSTANT(2), /* Magnetic tape                  */ 00042700
*   NEDCURIN FIXED(8) CONSTANT(3), /* Unit record (input)            */ 00042800
*   NEDCUROT FIXED(8) CONSTANT(4), /* Unit record (output)           */ 00042900
*   NEDCPRT  FIXED(8) CONSTANT(5), /* Printer                        */ 00043000
*   NEDCCOMM FIXED(8) CONSTANT(6), /* Communications controller      */ 00043100
*   NEDCFST  FIXED(8) CONSTANT(7), /* Full screen terminal           */ 00043200
*   NEDCLMT  FIXED(8) CONSTANT(8), /* Line mode terminal             */ 00043300
*   NEDCCTCA FIXED(8) CONSTANT(9), /* Channel-to-channel adapter     */ 00043400
*   NEDCSWIT FIXED(8) CONSTANT(10);/* Switch                         */ 00043500
*     /* Values for GNEQFLDS                                     @L2A*/ 00043600
* DCL                                                                   00043700
*   GNEQITME FIXED(8) CONSTANT(1); /* Device dependent time out value   00043800
*                                     field offset               @L2A*/ 00043900
*/* End of PL/X Source                                               */ 00044000
* %IF IHACDR_LIST ^= 'NO' &                                             00044100
*    ZCBPRINT ^= 'NO' %THEN                                             00044200
*   %GOTO IHACDR_4;                                                     00044300
*   @LIST POP NOECHO;                                                   00044400
* %IHACDR_4:;                                                           00044500
* %END;                                                                 00044600
