*                                                                       00002900
* %DCL IHADWHDR_INCLUDED CHAR EXT;                                      00005800
* %DEACTIVATE IHADWHDR_INCLUDED;                                        00008700
* %IF IHADWHDR_INCLUDED = '' %THEN                                      00011600
* %DO;                                                                  00014500
*/* Macro made bi-lingual on 98230. CBGEN compile date 98009         */ 00017400
*% /*                                                                   00020300
         MACRO                                                          00023200
         IHADWHDR &DSECT=YES,&LIST=YES,&TITLE=YES,&DWHDR=YES,          *00026100
               &DWHDRDUMPCNTLSMAP=COND                                  00029000
         GBLC  &IHADWHDR_INCLUDED                                       00031900
         GBLC  &ZCBPRINT                                                00034800
&IHADWHDR_INCLUDED SETC 'YES'                                           00037700
         AIF   ('&LIST' EQ 'NONE').P0                                   00039100
         AIF   ('&TITLE' EQ 'NO').P5                                    00040500
 TITLE   'IHADWHDR  - Dump Writing Structure Dump Header         @P1C '*00041900
                                                                        00043300
.P5      ANOP                                                           00044700
**/ IHADWHDR_1:;                                                        00046400
*/* START OF SPECIFICATIONS ******************************************* 00073200
*                                                                       00100000
*01* SECURITY:                                                          00150000
* *01* PROPRIETARY STATEMENT=                                        */ 00188400
*/***PROPRIETARY_STATEMENT********************************************/ 00226800
*/*  Proprietary Statement =                                         */ 00265200
*/*  Licensed Materials - Property of IBM                            */ 00274800
*/*  "Restricted Materials of IBM"                                   */ 00284400
*/*  5647-A01                                                        */ 00294000
*/*                                                                  */ 00303600
*/*  (C) Copyright IBM Corp. 1993, 1999                              */ 00353600
*/*                                                                  */ 00495600
*/*  US Government Users Restricted Rights - Use, duplication or     */ 00512000
*/*  disclosure restricted by GSA ADP Schedule Contract with         */ 00528400
*/*  IBM Corp.                                                       */ 00544800
*/*                                                                  */ 00561200
*/*  Status = HBB6608                                                */ 00577600
*/*                                                              @L1C*/ 00594000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00610800
*/*                                                                     00630400
*02*  ACRONYM:  DWHDR                                                   00650000
*                                                                       00700000
*01* MACRO NAME:  IHADWHDR                                              00750000
*                                                                       00800000
*01* DESCRIPTIVE NAME: Dump Writing Structure Dump Header         @P1C  00816600
*                                                                       00833200
*01* DSECT NAME:                                                        00850000
*     DWHDR                                                             00900000
*     DwhdrDumpCntlsMap                                                 00950000
*                                                                       01000000
*01* COMPONENT:  SVC Dump (SCDMP)                                 @D3C  01050000
*                                                                       01100000
*01* EYE-CATCHER:  NONE                                                 01150000
*                                                                       01300000
*01* STORAGE ATTRIBUTES:                                                01350000
*02*  SUBPOOL:  N/A                                                     01400000
*02*  KEY:  N/A                                                         01450000
*02*  RESIDENCY:  N/A                                                   01500000
*                                                                       01550000
*01* SIZE:                                                              01600000
*     DWHDRDUMPCNTLSMAP -- X'0200' bytes                                01650000
*     DWHDR             -- X'2000' bytes                                01700000
*                                                                       01750000
*01* CREATED BY:  N/A                                                   01800000
*                                                                       01850000
*01* POINTED TO BY:                                                     01900000
*     N/A                                                               01950000
*                                                                       02000000
*01* SERIALIZATION:                                                     02050000
*     None required                                                     02100000
*                                                                       02150000
*01* FUNCTION:                                                          02200000
*02*  Provides a map of the dump header. There is one dump header per   02250000
*     structure in the dump.  It contains the structure controls,       02300000
*     dumping controls, dumping status, dump tailoring options, and the 02350000
*     associated request block.                                         02400000
*     In the dump dataset, the dump                                     02450000
*     header is located before the data associated with a given         02550000
*     structure.                                                        02583300
*01*  During write phase processing, a copy of the dump                 02616600
*     header is also in the buffer data space.                          02650000
*                                                                       02700000
*                                                                       02712500
*01* EXTERNAL CLASSIFICATION: GUPI                                      02725000
*01* END OF EXTERNAL CLASSIFICATION:                                    02737500
*                                                                       02750000
*01* METHOD OF ACCESS:                                                  02800000
*                                                                       02850000
*     ASM:                                                              02866600
*         IHADWHDR                                                      02883200
*     PL/AS:                                                            02900000
*         %dcl DumpHdrAttr char                                         02950000
*         %DumpHdrAttr = 'based/defined/via attributes'                 03000000
*         %INCLUDE SYSLIB(IHADWHDR)                                     03050000
*                                                                       03100000
*         If the DumpHdrAttr macro variable is not set,                 03150000
*         DWHDR will be declared as based.                         @P1C 03200000
*                                                                       03250000
*01* DELETED BY:  N/A                                                   03400000
*                                                                       03450000
*01* FREQUENCY:  N/A                                                    03500000
*                                                                       03550000
*01* DEPENDENCIES:  N/A                                                 03600000
*                                                                       03650000
*01* DISTRIBUTION LIBRARY:                                              03700000
*     AMACLIB                                                           03720000
*                                                                       03740000
*                                                                       03800000
*01* CHANGE ACTIVITY:                                                   03850000
*     $L0= SYSLKD  HBB5510 920812 PD00HX: Dumping for CF structures     03883300
*     $D1=DIG0032  HBB5510 921105 PD00LA: Externalize Dumping Mappings  03905500
*     $D2=DIG0036  HBB5510 930114 PD00FR: Architecture upgrade          03927700
*     $01=OW01117  HBB5510 931216 PDHT:   Prolog updates           @01A 03938800
*     $D3=DR20001  HBB6601 950907 PD00KV: Split from SC1CM         @D3A 03944400
*     $P1=PR20014  HBB6601 950918 PD00KV: Fix prolog               @P1A 03947200
*     $L1=AUTOR    HBB6608 980831 PD00GW: Auto Rebuild             @L1A 03948600
*                                                                       03950000
* END OF SPECIFICATIONS *********************************************/  04000000
*% /*                                                                   04050000
.P0      ANOP                                                           04075000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04100000
         AIF   ('&LIST' EQ 'YES').P2                                    04150000
.P1      ANOP                                                           04200000
         PUSH  PRINT                                                    04250000
         PRINT OFF                                                      04300000
.P2      ANOP                                                           04350000
*                                                                       04400000
* ****************************************************************** *  04450000
* *                                                                  *  04500000
* *                  Dump Writing Dump Header                        *  04550000
* *                                                                  *  04600000
* ****************************************************************** *  04650000
*                                                                       04700000
*                                                                       04750000
         AIF   ('&DWHDR' EQ 'NO').L0002                                 04800000
         AIF   ('&DSECT' EQ 'YES').L0003                                04850000
         AIF   ('&DWHDR' NE 'YES').L0002                                04900000
DWHDR    DS    0F        Mapping for dump header                        04950000
         AGO   .L0004                                                   05000000
.L0003   ANOP                                                           05050000
DWHDR    DSECT           Mapping for dump header                        05100000
.L0004   ANOP                                                           05150000
DWHDRSTRCONTROLS DS 1CL0256 Structure controls                          05200000
         DS    1CL0256   Reserved                                       05250000
DWHDRDUMPCONTROLS DS 1CL0512                                            05300000
DWHDRDUMPSTATUS DS 0CL0032 Dumping status                               05400000
DWHDRCAPCOMPCODE DS 1FL1 Capture-completion code X'00'                 *05450000
                         Capture-in-progress X'01' Normal completion   *05500000
                         X'02' Dump table full X'03' Serialization     *05550000
                         released                                       05600000
         DS    1CL0001   Reserved                                       05650000
DWHDRLASTOBJTYPE DS 1CL0002 Last dumping-object type. Object type of   *05700000
                         the object specified by the LOID operand.     *05750000
                         Valid only when the last range object         *05800000
                         contains a nonzero value.                      05850000
DWHDRLASTRANGE DS 1FL4   Last range value processed by a dump request. *05900000
                         Initialized to zero.                           05950000
DWHDRLASTOBJID DS 1FL4   Last object identifier (LOID) processed by a  *06050000
                         dump request Valid only when both last range  *06100000
                         nonzero and last dumping-object-type X'0302', *06150000
                         X'0401', or X'0402'                            06200000
DWHDRLASTDIBCT DS 1FL4   Last DIB count. Number of DIBs stored in the  *06300000
                         dump table for the object specified by the    *06350000
                         LOID. Valid only when last range nonzero.      06400000
DWHDRLASTELEMCT DS 1FL4  Last element count. Number of elements        *06450000
                         contained in the object specified by the      *06500000
                         LOID. Valid only when last range nonzero.      06550000
DWHDRLASTDTEN DS 1FL4    Last dump-table-entry number. Highest valued  *06600000
                         dump-table entry that contains a captured     *06650000
                         block.                                         06700000
         DS    1CL0008   Reserved                                       06750000
         DS    1CL0224   Reserved                                       06800000
DWHDRDUMPTLROPT DS 0CL0008 Dumping-tailoring options                    06850000
DWHDRDUMPLISTLEN DS 1FL2 Dumping-list length. Number of ranges in the  *06900000
                         range list of a dump request                   06950000
         DS    1CL0001   Reserved                                       07050000
DWHDRDUMPCACHEID DS 0CL0001 Identifier of an attached local-cache      *07100000
                         associated with the dump table. Zero => no    *07150000
                         local cache. Only maintained when the         *07200000
                         structure type is X'04'.                       07250000
         DS    1CL0001   Reserved for list                              07300000
         DS    1CL0004   Reserved                                       07350000
         DS    1CL0760   Reserved                                       07375000
DWHDRSCC DS    1CL0512   Structure Copy Controls                        07400000
         DS    1CL1536   Reserved                                       07425000
DWHDRASSOCREQBLK DS 1CL4096 Associated Request Block (ARB) Contains    *07450000
                         the dumping information and list of           *07500000
                         object-identifier ranges to be included in    *07550000
                         the dump. Also contains the dumping-object    *07600000
                         type, adjunct-inclusion indicator, and        *07650000
                         DIB-exclusion indicator for each object-      *07700000
                         identifier range. The ARB is provided in the  *07750000
                         data block of the associate-dump-table        *07800000
                         command when the dump table is created, and   *07850000
                         is copied into the dump header by the capture  07900000
*                        process. To view the contents of this area,   *07950000
                         use the ARB mapping found in IHAARB macro      08000000
DWHDR_LEN EQU  *-DWHDR                                                  08050000
.L0002   ANOP                                                           08100000
*                                                                       08150000
* ****************************************************************** *  08200000
* *                                                                  *  08250000
* *              Mapping of the Dumping Controls                     *  08300000
* *                                                                  *  08350000
* ****************************************************************** *  08400000
*                                                                       08450000
*                                                                       08500000
         AIF   ('&DWHDRDUMPCNTLSMAP' EQ 'NO').L0005                     08550000
         AIF   ('&DSECT' EQ 'YES').L0006                                08600000
         AIF   ('&DWHDRDUMPCNTLSMAP' NE 'YES').L0005                    08650000
DWHDRDUMPCNTLSMAP DS 0F  Mapping for dumping controls                   08700000
         AGO   .L0007                                                   08750000
.L0006   ANOP                                                           08800000
DWHDRDUMPCNTLSMAP DSECT   Mapping for dumping controls                  08850000
.L0007   ANOP                                                           08900000
DWHDRDUMPINFO DS 1CL0128 Dumping Information                            08950000
         DS    1CL0128   Reserved                                       09000000
DWHDRDUMPAUTH DS 1CL0016 Dumping authority. Zero => dumping controls   *09050000
                         available Nonzero => dumping controls in use   09100000
DWHDRDUMPSER DS 1CL0016  Dumping serialization. Nonzero => Dumping     *09150000
                         serialization held on the structure            09200000
DWHDRDUMPTBLSIZE DS 1FL4 Dump-table size. Number of 4096-byte units of *09500000
                         CF storage assigned to the dump table.         09550000
DWHDRSTRTYPE DS 1CL0001  Structure type                                 09600000
DWHDRFLAGS DS  0CL0001                                                  09650000
DWHDRINITCOMP EQU X'80'  Initialization complete indicator              09700000
DWHDRRELEASEINPROG EQU X'40' Release in progress indicator              09725000
         ORG   DWHDRFLAGS+X'00000001'                                   09750000
         DS    1CL0218   Reserved                                       09800000
*                                                                       09850000
*   Capture Complete Constants                                          09900000
*                                                                       09950000
*                                                                       10000000
DWHDRCAPCMPCIP EQU X'00' Capture is in progress                         10050000
DWHDRCAPCMPOK EQU X'01'  Normal completion                              10100000
DWHDRCAPCMPTABFULL EQU X'02' Dump table is full                         10150000
DWHDRCAPCMPSERREL EQU X'03' Dump serialization was released             10200000
DWHDRDUMPCNTLSMAP_LEN EQU *-DWHDRDUMPCNTLSMAP                           10250000
.L0005   ANOP                                                           10300000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 10350000
         AIF   ('&LIST' EQ 'YES').P4                                    10400000
.P3      ANOP                                                           10450000
         POP   PRINT                                                    10500000
.P4      ANOP                                                           10550000
.P_EXIT  ANOP                                                           10600000
         MEND                                                           10650000
**/ IHADWHDR_2:;                                                        10700000
* %IHADWHDR_INCLUDED = 'YES';                                           10750000
* %DCL ZCBPRINT CHAR EXT;                                               10800000
* %DEACTIVATE ZCBPRINT;                                                 10850000
* %DCL IHADWHDR_LIST CHAR EXT;                                          10900000
* %DEACTIVATE IHADWHDR_LIST;                                            10950000
* %IF IHADWHDR_LIST ^= 'NO' &                                           11000000
*    ZCBPRINT ^= 'NO' %THEN                                             11050000
*   %GOTO IHADWHDR_3;                                                   11100000
*   @LIST PUSH NOECHO;                                                  11150000
*   @LIST NOASSEMBLE NOECHO;                                            11200000
*   @LIST OFF C NOECHO;                                                 11250000
* %IHADWHDR_3:;                                                         11300000
*/* Start of PL/X Source                                             */ 11350000
*                                                                       11400000
* %IF DumpHdrAttr = '' %THEN                                            11450000
*   %DumpHdrAttr = 'based';                                             11500000
*                                                                       11550000
*/*******************************************************************/  11600000
*/*                                                                 */  11650000
*/*                  Dump Writing Dump Header                       */  11700000
*/*                                                                 */  11750000
*/*******************************************************************/  11800000
*declare                                                                11850000
* 1   DWHDR bdy(word) DumpHdrAttr,     /* Mapping for dump header    */ 11900000
*   3   DwhdrStrControls char(256),    /* Structure controls         */ 11950000
*   3   *                char(256),    /* Reserved                   */ 12000000
*   3   DwhdrDumpControls like(DwhdrDumpCntlsMap),                      12050000
*   3   DwhdrDumpStatus,               /* Dumping status             */ 12100000
*     5   DwhdrCapCompCode  fixed(8),  /* Capture-completion code       12150000
*                                        X'00' Capture-in-progress      12200000
*                                        X'01' Normal completion        12250000
*                                        X'02' Dump table full          12300000
*                                        X'03' Serialization released*/ 12350000
*     5   *                char(1),    /* Reserved                   */ 12400000
*     5   DwhdrLastObjType  char(2),   /* Last dumping-object type.     12450000
*                                        Object type of the object      12500000
*                                        specified by the LOID operand. 12550000
*                                        Valid only when the last range 12600000
*                                        object contains a nonzero      12650000
*                                        value.                      */ 12700000
*     5   DwhdrLastRange fixed(32),    /* Last range value processed by 12750000
*                                         a dump request.               12800000
*                                         Initialized to zero.       */ 12850000
*     5 DwhdrLastObjID fixed(32),      /* Last object identifier (LOID) 13000000
*                                        processed by a dump request    13050000
*                                        Valid only when                13100000
*                                        both last range nonzero and    13150000
*                                        last dumping-object-type       13200000
*                                        X'0302', X'0401', or X'0402'*/ 13250000
*     5   DwhdrLastDIBCt    fixed(32), /* Last DIB count.  Number of    13300000
*                                         DIBs stored in the dump table 13350000
*                                         for the object specified by   13400000
*                                         the LOID.  Valid only when    13450000
*                                         last range nonzero.        */ 13500000
*     5   DwhdrLastElemCt   fixed(32),/* Last element count.  Number of 13550000
*                                        elements contained in the      13600000
*                                        object specified by the LOID.  13650000
*                                        Valid only when last range     13700000
*                                        nonzero.                    */ 13750000
*     5   DwhdrLastDTEN     fixed(32), /* Last dump-table-entry number. 13800000
*                                         Highest valued dump-table     13850000
*                                         entry that contains a         13900000
*                                         captured block.            */ 13950000
*     5   *                char(8),    /* Reserved                   */ 14000000
*   3   *                char(224),    /* Reserved                   */ 14050000
*   3   DwhdrDumpTlrOpt,               /* Dumping-tailoring options  */ 14100000
*     5   DwhdrDumpListLen  fixed(16), /* Dumping-list length.  Number  14150000
*                                         of ranges in the range list   14200000
*                                         of a dump request          */ 14250000
*     5   *                char(1),    /* Reserved                   */ 14350000
*     5   DwhdrDumpCacheID  char(1),   /* Identifier of an attached     14400000
*                                         local-cache associated with   14450000
*                                         the dump table.               14500000
*                                         Zero => no local cache.       14550000
*                                         Only maintained when the      14600000
*                                         structure type is X'04'.   */ 14650000
*       7   *                char(1),  /* Reserved for list          */ 14700000
*     5   *                char(4),    /* Reserved                   */ 14750000
*   3   *                char(760),    /* Reserved               @L1C*/ 14775000
*   3   DwhdrScc         char(512),    /* Structure Copy Controls@L1A*/ 14800000
*   3   *                char(1536),   /* Reserved               @L1A*/ 14825000
*   3   DwhdrAssocReqBlk  char(4096); /* Associated Request Block (ARB) 14850000
*                                        Contains the dumping           14900000
*                                        information and list of        14950000
*                                        object-identifier ranges to be 15000000
*                                        included in the dump.  Also    15050000
*                                        contains the dumping-object    15100000
*                                        type, adjunct-inclusion        15150000
*                                        indicator, and DIB-exclusion   15200000
*                                        indicator for each object-     15250000
*                                        identifier range.  The ARB is  15300000
*                                        provided in the data block of  15350000
*                                        the associate-dump-table       15400000
*                                        command when the dump table is 15450000
*                                        created, and is copied into    15500000
*                                        the dump header by the capture 15550000
*                                        process.  To view the contents 15600000
*                                        of this area, use the ARB      15650000
*                                        mapping found in IHAARB macro  15700000
*                                                                    */ 15750000
*@space;                                                                15800000
*                                                                       15850000
*                                                                       15900000
*/*******************************************************************/  15950000
*/*                                                                 */  16000000
*/*              Mapping of the Dumping Controls                    */  16050000
*/*                                                                 */  16100000
*/*******************************************************************/  16150000
*                                                                       16200000
*declare                                                                16250000
* 1   DwhdrDumpCntlsMap char(512) based bdy(word), /* Mapping for       16300000
*                                         dumping controls           */ 16350000
*   3   DwhdrDumpInfo     char(128),   /* Dumping Information        */ 16400000
*   3   *                 char(128),   /* Reserved                   */ 16450000
*   3   DwhdrDumpAuth     char(16),    /* Dumping authority.            16500000
*                                         Zero => dumping controls      16600000
*                                          available                    16650000
*                                         Nonzero => dumping controls   16700000
*                                          in use                    */ 16750000
*   3   DwhdrDumpSer      char(16),   /* Dumping serialization.         16800000
*                                        Nonzero => Dumping             17000000
*                                        serialization held on the      17050000
*                                        structure                   */ 17100000
*   3   DwhdrDumpTblSize  fixed(32),   /* Dump-table size.  Number of   17150000
*                                        4096-byte units of CF storage  17200000
*                                        assigned to the dump table. */ 17250000
*   3   DwhdrStrType    char(1),       /* Structure type             */ 17300000
*   3   DwhdrFlags,                                                     17350000
*     5   DwhdrInitComp     bit(1),    /* Initialization complete       17400000
*                                         indicator                  */ 17450000
*     5   DwhdrReleaseInProg bit(1),    /* Release in progress          17475000
*                                         indicator              @D2A*/ 17500000
*     5   *                 bit(6),    /* reserved               @D2C*/ 17525000
*   3    *                char(218);   /* Reserved                   */ 17550000
*@space;                                                                17600000
*                                                                       17650000
*/* Capture Complete Constants                                       */ 17700000
*Declare                                                                17750000
*   DwhdrCapCmpCIP bit(8)                                               17800000
*     constant('00'x),               /* Capture is in progress      */  17850000
*   DwhdrCapCmpOK bit(8)                                                17900000
*     constant('01'x),               /* Normal completion           */  17950000
*   DwhdrCapCmpTabFull bit(8)                                           18000000
*     constant('02'x),               /* Dump table is full          */  18050000
*   DwhdrCapCmpSerRel bit(8)                                            18100000
*     constant('03'x);               /* Dump serialization was          18150000
*                                         released                   */ 18200000
*/* End of PL/X Source                                               */ 18250000
* %IF IHADWHDR_LIST ^= 'NO' &                                           18300000
*    ZCBPRINT ^= 'NO' %THEN                                             18350000
*   %GOTO IHADWHDR_4;                                                   18400000
*   @LIST POP NOECHO;                                                   18450000
* %IHADWHDR_4:;                                                         18500000
* %END;                                                                 18550000
