*%       GOTO EPIEPLS1;  /*                                             00050000
         MACRO                                                          00100000
         IHAEPIE                                                        00150000
.*A000000-999999                                               @G860PPY 00200000
*                                                                    */ 00250000
*%EPIEPLS1 : ;                                                          00300000
*/** START OF SPECIFICATIONS *****************************************/ 00325000
*/*                                                                  */ 00350000
*/* PROPRIETARY STATEMENT:                                           */ 00375000
*/* 5647-A01                                                         */ 00400000
*/* THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                     */ 00425000
*/* (C) COPYRIGHT IBM CORP. 1980,2000                                */ 00450000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00475000
*/*                                                                  */ 00500000
*/* STATUS = HBB7703                                                 */ 00525000
*/*                                                                  */ 00550000
*/* EXTERNAL CLASSIFICATION: PI                                      */ 00587500
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 00625000
*/*                                                                  */ 00650000
*/* MACRO NAME:  IHAEPIE                                             */ 00675000
*/*                                                                  */ 00700000
*/* DESCRIPTIVE NAME:  Extended Program Interruption Element         */ 00725000
*/*                                                                  */ 00750000
*/* DSECT NAME: EPIE                                                 */ 00775000
*/*                                                                  */ 00800000
*/* COMPONENT: Recovery Termination Manager (SCRTM)                  */ 00825000
*/*                                                                  */ 00850000
*/* EYE CATCHER: EPIE                                                */ 00875000
*/* OFFSET: X'0'                                                     */ 00900000
*/* LENGTH: 4                                                        */ 00925000
*/*                                                                  */ 00950000
*/* STORAGE ATTRIBUTES:                                              */ 00975000
*/*  SUBPOOL:  130 or 250                                            */ 01000000
*/*  KEY:  TCB Key                                                   */ 01025000
*/*                                                                  */ 01050000
*/* SIZE: 160 bytes                                                  */ 01075000
*/*                                                                  */ 01100000
*/* CREATED BY: IEAVTESP                                             */ 01125000
*/*                                                                  */ 01150000
*/* POINTED TO BY:                                                   */ 01175000
*/*     Register 1 upon entry to an ESPIE exit routine.  The EPIE    */ 01193700
*/*     can also be found via SCAPIE + 32 (The EPIE immediately      */ 01212400
*/*     follows the PIE in storage).                             @P2C*/ 01231200
*/*                                                                  */ 01250000
*/* SERIALIZATION: Task Active                                       */ 01275000
*/*                                                                  */ 01300000
*/* FUNCTION:                                                        */ 01325000
*/*     The EPIE is used to pass program interruption information    */ 01350000
*/*     to an ESPIE exit routine.                                    */ 01375000
*/*                                                                  */ 01400000
*/* METHOD OF ACCESS:                                                */ 01425000
*/* ASM:                                                             */ 01450000
*/*            IHAEPIE                                               */ 01475000
*/*                                                                  */ 01500000
*/* PLS:                                                             */ 01525000
*/*           DCL EPIEPTR PTR                                        */ 01550000
*/*           %INCLUDE SYSLIB(IHAEPIE)                               */ 01575000
*/*                                                                  */ 01600000
*/*                                                                  */ 01675000
*/* CHANGE ACTIVITY:                                                 */ 01700000
*/*     $01 = OY21512  HBB3310 890401 PDCK: PASS ARS                 */ 01725000
*/*     $02 = OY36454  HBB4410 901015 PDCK: ESPIE RETRY MODE         */ 01750000
*/*     $P1 = PIG2274  HBB5510 930806 PDKD: SHOWHDR                  */ 01775000
*/*$P2=PN70102  HBB5520 940106 PD16KD: Update 'POINTED TO BY'    @P2A*/ 01787500
*/*$P3=PN70279  HBB5520 940307 PDKD: Provide more field granularity  */ 01791600
*/*                                  no version change needed    @P3A*/ 01795700
*/*$P4=PR20011  HBB6601 950908 PDKD: SC1CM compid split          @P4A*/ 01797800
*/*$L1=IEEERTM  HBB6606 970807 PDXB: DXC                             */ 01798900
*/*$P5=PVT0427  HBB6606 980112 PDXB: EPIEIRSV                        */ 01799400
*/*$L2=64BITRTM HBB7703 971101 PDXB: 64-bit GPRs                     */ 01799700
*/*                                                                  */ 01800000
*/*** END OF SPECIFICATIONS ******************************************/ 01825000
*%       GOTO EPIEPLS;  /*                                              01850000
EPIE     DSECT                                                          01900000
EPIEEPIE DS    CL4                 EPIE CONTROL BLOCK IDENTIFIER       *01950000
                                   IN EBCDIC                            02000000
EPIEPARM DS    A                   PARAMETER LIST ADDRESS SPECIFIED    *02050000
                                   BY PARAM OPTION OF ESPIE MACRO       02100000
EPIEGPR  DS    0CL64               GENERAL PURPOSE REGISTERS AT TIME   *02108600
                                   OF INTERRUPTION                 @P3C 02117200
EPIEGR00 DS    F -                 Register 0                      @P3A 02125800
EPIEGR01 DS    F -                 Register 1                      @P3A 02134400
EPIEGR02 DS    F -                 Register 2                      @P3A 02143000
EPIEGR03 DS    F -                 Register 3                      @P3A 02151600
EPIEGR04 DS    F -                 Register 4                      @P3A 02160200
EPIEGR05 DS    F -                 Register 5                      @P3A 02168800
EPIEGR06 DS    F -                 Register 6                      @P3A 02177400
EPIEGR07 DS    F -                 Register 7                      @P3A 02186000
EPIEGR08 DS    F -                 Register 8                      @P3A 02194600
EPIEGR09 DS    F -                 Register 9                      @P3A 02203200
EPIEGR10 DS    F -                 Register 10                     @P3A 02211800
EPIEGR11 DS    F -                 Register 11                     @P3A 02220400
EPIEGR12 DS    F -                 Register 12                     @P3A 02229000
EPIEGR13 DS    F -                 Register 13                     @P3A 02237600
EPIEGR14 DS    F -                 Register 14                     @P3A 02246200
EPIEGR15 DS    F -                 Register 15                     @P3A 02254800
EPIEPSW  DS    0CL8                EC MODE PROGRAM OLD PSW         @P3C 02263400
EPIEEMK1 DS    B                   Interrupt information masks     @P3A 02272000
EPIEMWP1 DS    B                   PSW key and 'M-W-P'             @P3A 02280600
EPIECCPM DS    B                   Condition code and program mask @P3A 02289200
         DS    B                   Reserved                        @P3A 02297800
EPIENXT1 DS    0F                  Address of the next instruction      02306400
*                                  to be executed                  @P3A 02315000
EPIEAMF1 DS    B                   Addressing mode flag            @P3A 02323600
EPIEMOD1 EQU   X'80'               Addressing mode of the next          02332200
*                                  instruction to be executed      @P3A 02340800
EPIEADD1 DS    CL3                 24 bit instruction address      @P3A 02345100
EPIEINT  DS    0CL4                Program interruption information     02349400
*                                  for EPIEPSW                     @P3C 02358000
EPIEIRSV DS    CL1                 Reserved                        @P5C 02363900
EPIEILC1 DS    B                   Instruction Length Code byte         02369800
*                                  (indicates the number of bytes in    02373000
*                                  the failing instruction)        @P3A 02376200
EPIEIL1  EQU   X'06'               Instruction Length Code Mask         02379400
*                                  (can be used to access the number    02382600
*                                  of halfwords in the failing          02385800
*                                  instruction)                    @P3A 02389000
EPIEINC1 DS    0CL2                Interrupt Code bytes            @P3A 02392400
         DS    CL1                 Reserved                        @P3A 02401000
EPIEICD1 DS    B                   Program Interrupt Code          @P3A 02409600
EPIETEA  DS    A                   TRANSLATION EXCEPTION ADDRESS IF    *02420000
                                   EPIEINT FIELD CONTAINS A PAGE FAULT *02440000
                                   INTERRUPT CODE                       02460000
         ORG   EPIETEA                                             @L1A 02460100
         DS    XL3                                                 @L1A 02460200
EPIEDXC  DS    X                   Data exception code if EPIEINC1     *02460300
                                   indicates program interrupt 7   @L1A 02460500
EPIEAR   DS    0CL64               ACCESS REGISTERS AT TIME            *02460700
                                   OF INTERRUPTION                 @P3C 02461400
EPIEAR00 DS    F -                 Access Register 0               @P3A 02462100
EPIEAR01 DS    F -                 Access Register 1               @P3A 02462800
EPIEAR02 DS    F -                 Access Register 2               @P3A 02463500
EPIEAR03 DS    F -                 Access Register 3               @P3A 02464200
EPIEAR04 DS    F -                 Access Register 4               @P3A 02464900
EPIEAR05 DS    F -                 Access Register 5               @P3A 02465600
EPIEAR06 DS    F -                 Access Register 6               @P3A 02466300
EPIEAR07 DS    F -                 Access Register 7               @P3A 02467000
EPIEAR08 DS    F -                 Access Register 8               @P3A 02467700
EPIEAR09 DS    F -                 Access Register 9               @P3A 02468400
EPIEAR10 DS    F -                 Access Register 10              @P3A 02469100
EPIEAR11 DS    F -                 Access Register 11              @P3A 02469800
EPIEAR12 DS    F -                 Access Register 12              @P3A 02470500
EPIEAR13 DS    F -                 Access Register 13              @P3A 02471200
EPIEAR14 DS    F -                 Access Register 14              @P3A 02471900
EPIEAR15 DS    F -                 Access Register 15              @P3A 02472600
EPIEVERS DS    XL1                 EPIE VERSION INDICATOR          @02A 02475100
EPIEV1   EQU   1                   VERSION 1 INDICATOR             @02A 02477000
EPIEV2   EQU   2                   VERSION 2 INDICATOR             @L2A 02477900
EPIEFLGS DS    XL1                 EPIE FLAGS                      @02A 02478900
EPIERCTL EQU   X'80'               RETRY MODE FROM AN EXIT ROUTINE IS  *02480800
                                   CONTROLLED BY THE CORRESPONDING     *02482700
                                   BIT SETTINGS IN THE EPIEPSW FOR THE *02484600
                                   FOLLOWING CONDITION(S):             *02486500
                                   . BIT(17) - PRIMARY(0) VS AR(1) ASC *02488400
                                               MODES                   *02490300
                                   NOTE: ALL RESERVED BITS IN THE PSW  *02492200
                                         MUST REMAIN ZERO IN THE       *02494100
                                         EPIEPSW                   @02A 02496000
EPIEUP64 EQU   X'40'               If on, use the values in EPIEG64 to *02496400
                                   update the registers, rather than   *02496800
                                   those in EPIEGPR                @L2A 02497200
         DS    CL6                 RESERVED                             02497900
EPIEV0LEN EQU  *-EPIE              VERSION-0 LENGTH                     02498400
EPIEV1LEN EQU  *-EPIE              VERSION-1 LENGTH                     02498900
EPIEG64   DS   0CL128              64-bit GPRs at time of              *02501200
                                   interruption.                   @L2C 02503500
EPIEG6400 DS   D -                 Register 0                      @L2A 02505800
EPIEG6401 DS   D -                 Register 1                      @L2A 02508100
EPIEG6402 DS   D -                 Register 2                      @L2A 02510400
EPIEG6403 DS   D -                 Register 3                      @L2A 02512700
EPIEG6404 DS   D -                 Register 4                      @L2A 02515000
EPIEG6405 DS   D -                 Register 5                      @L2A 02517300
EPIEG6406 DS   D -                 Register 6                      @L2A 02519600
EPIEG6407 DS   D -                 Register 7                      @L2A 02521900
EPIEG6408 DS   D -                 Register 8                      @L2A 02524200
EPIEG6409 DS   D -                 Register 9                      @L2A 02526500
EPIEG6410 DS   D -                 Register 10                     @L2A 02528800
EPIEG6411 DS   D -                 Register 11                     @L2A 02531100
EPIEG6412 DS   D -                 Register 12                     @L2A 02533400
EPIEG6413 DS   D -                 Register 13                     @L2A 02535700
EPIEG6414 DS   D -                 Register 14                     @L2A 02538000
EPIEG6415 DS   D -                 Register 15                     @L2A 02540300
EPIEV2LEN EQU  *-EPIE              VERSION-2 LENGTH                @L2A 02542600
EPIELEN  EQU   *-EPIE              CURRENT-VERSION LENGTH               02544900
         MEND  ,                                                     */ 02547200
*%EPIEPLS  :  ;                                                         02550000
*DECLARE                                                                02600000
*  1 EPIE BASED(EPIEPTR) BDY(DWORD),                                    02650000
*    3 EPIEEPIE CHAR(4),        /* EPIE CONTROL BLOCK IDENTIFIER        02700000
*                                  IN EBCDIC                         */ 02750000
*    3 EPIEPARM PTR(31),        /* PARAMETER LIST ADDRESS SPECIFIED     02800000
*                                  BY PARAM OPTION OF ESPIE MACRO    */ 02850000
*    3 EPIEGPR(16) FIXED(31),   /* GENERAL PURPOSE REGISTERS AT TIME    02900000
*                                  OF INTERRUPTION                   */ 02950000
*    3 EPIEPSW CHAR(8) BDY(WORD),  /* EC mode Program Old PSW    @P3C*/ 03002900
*      5 EPIEEMK1 CHAR(1),      /* Interrupt information masks   @P3A*/ 03009500
*      5 EPIEMWP1 CHAR(1),      /* PSW key and 'M-W-P'           @P3A*/ 03019000
*      5 EPIECCPM CHAR(1),      /* Condition code and program mask      03028500
*                                                                @P3A*/ 03038000
*      5 *        CHAR(1),      /* Reserved                      @P3A*/ 03047500
*      5 EPIENXT1 PTR(31),      /* Address of the next instruction      03057000
*                                  to be executed                @P3A*/ 03066500
*        7 EPIEAMF1 CHAR(1),    /* Addressing mode flag byte     @P3A*/ 03076000
*          9 EPIEMOD1 BIT(1),   /* Addressing mode of the next          03085500
*                                  instruction to be executed    @P3A*/ 03095000
*        7 EPIEADD1 PTR(24),    /* 24 bit instruction address    @P3A*/ 03099700
*    3 EPIEINT CHAR(4),         /* Program interruption information     03104500
*                                  for EPIEPSW                   @P3C*/ 03114000
*      5 EPIEIRSV CHAR(1),      /* Reserved                      @P5C*/ 03121100
*      5 EPIEILC1  BIT(8),      /* Instruction length code byte         03128200
*                                  (indicates number of bytes in the    03132900
*                                  failing instruction)          @P3A*/ 03137600
*        7 *         BIT(5),    /* Reserved                      @P3A*/ 03142500
*        7 EPIEIL1   BIT(2),    /* Instruction length code              03147200
*                                  (indicates number of halfwords in    03151900
*                                  the failing instruction)      @P3A*/ 03156600
*        7 *         BIT(1),    /* Reserved                      @P3A*/ 03161500
*      5 EPIEINC1 CHAR(2),      /* Interrupt code bytes          @P3A*/ 03171000
*        7 *        CHAR(1),    /* Reserved                      @P3A*/ 03180500
*        7 EPIEICD1  BIT(8),    /* Program Interrupt Code        @P3A*/ 03190000
*    3 EPIETEA PTR(31),         /* TRANSLATION EXCEPTION ADDRESS IF     03200000
*                                  EPIEINT FIELD CONTAINS A PAGE FAULT  03250000
*                                  INTERRUPT CODE                    */ 03300000
*      4 * CHAR(3),             /*                               @L1C*/ 03305500
*      4 EPIEDXC FIXED(8),      /* Data exception code if EPIEINC1      03311000
*                                  field indicates program interrupt    03316500
*                                  7                             @L1C*/ 03322100
*    3 EPIEAR(16) FIXED(31),    /* ACCESS REGISTERS AT TIME             03327700
*                                  OF INTERRUPTION               @01A*/ 03355400
*    3 EPIEVERS FIXED(8),       /* EPIE VERSION INDICATOR        @02A*/ 03383200
*    3 EPIEFLGS BIT(8),         /* EPIE FLAGS                    @02A*/ 03433200
*      5 EPIERCTL BIT(1),       /* RETRY MODE FROM AN EXIT ROUTINE IS   03483200
*                                  CONTROLLED BY THE CORRESPONDING      03533200
*                                  BIT SETTINGS IN THE EPIEPSW FOR THE  03583200
*                                  FOLLOWING CONDITION(S):              03633200
*                                  . BIT(17) - PRIMARY(0) VS AR(1) ASC  03683200
*                                              MODES                    03733200
*                                  NOTE: ALL RESERVED BITS IN THE PSW   03783200
*                                        MUST REMAIN ZERO IN THE        03833200
*                                        EPIEPSW                 @02A*/ 03883200
*      5 EPIEUP64 BIT(1),       /* If on, use the values in EPIEG64     03898200
*                                  to update the registers, rather      03913200
*                                  than those in EPIEGPR         @L2A*/ 03928200
*      5 *  BIT(6),             /* RESERVED                          */ 03943200
*    3 * CHAR(6),               /* RESERVED                      @02A*/ 03958200
*    3 EPIEG64S CHAR(128) BDY(DWORD),  /* 64-bit GPRs at time of        03970700
*                                  interruption                  @L2A*/ 03983200
*      5 EPIEG64(16) CHAR(8) BDY(DWORD); /* 64-bit GPRs at time of      03995700
*                                  interruption                  @L2A*/ 04008200
*  DECLARE                                                              04033200
*     EPIEV1 FIXED(8) CONSTANT(1);/* VERSION 1 INDICATOR         @02A*/ 04083200
*  DECLARE                                                              04133200
*     EPIEV2 FIXED(8) CONSTANT(2);/* VERSION 2 INDICATOR         @L2A*/ 04183200
