*                                                                       00050000
* %DCL IHAEASCE_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IHAEASCE_INCLUDED;                                        00150000
* %IF IHAEASCE_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 98327. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IHAEASCE &DSECT=YES,&LIST=YES,&TITLE=YES,&EASCE=YES            00450000
         GBLC  &IHAEASCE_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IHAEASCE_INCLUDED SETC 'YES'                                           00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00650000
         AIF   ('&TITLE' EQ 'NO').P5                                    00700000
 TITLE   'IHAEASCE  - ESAME Address-Space-Control Element            '  00750000
.P5      ANOP                                                           00800000
**/ IHAEASCE_1:;                                                        00850000
*/* START OF SPECIFICATIONS ******************************************* 00900000
*                                                                       00950000
*  **PROPRIETARY_STATEMENT********************************************  01000000
***01* PROPRIETARY STATEMENT=                                        *  01050000
*                                                                    *  01100000
*                                                                    *  01150000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  01200000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  01250000
*   5647-A01 (C) COPYRIGHT IBM CORP. 2000                            *  01300000
*                                                                    *  01350000
*   STATUS= HBB7703                                                  *  01400000
*                                                                    *  01450000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  01500000
*                                                                       01550000
*01* DESCRIPTIVE NAME:  ESAME Address-Space-Control Element             01600000
*02*  ACRONYM:  EASCE                                                   01650000
*                                                                       01700000
*01* MACRO NAME:  IHAEASCE                                              01750000
*                                                                       01800000
*01* EXTERNAL CLASSIFICATION: NONE                                      01850000
*01* END OF EXTERNAL CLASSIFICATION:                                    01900000
*                                                                       01950000
*01* DSECT NAME:                                                        02000000
*     EASCE                                                             02050000
*                                                                       02100000
*01* COMPONENT:  SUPERVISOR CONTROL (SC1C5)                             02150000
*                                                                       02200000
*01* EYE-CATCHER:  NONE                                                 02250000
*                                                                       02300000
*01* STORAGE ATTRIBUTES:                                                02350000
*02*  SUBPOOL:  N/A                                                     02400000
*02*  KEY:      N/A                                                     02450000
*02*  RESIDENCY:  N/A                                                   02500000
*                                                                       02550000
*01* SIZE:                                                              02600000
*                EASCE -- X'0008' bytes                                 02650000
*                                                                       02700000
*01* CONTROL BLOCK CHANGES:                                             02750000
*02*  IHAEASCE                                                          02800000
*02*   6.8                                                              02850000
*03*    New                                                             02900000
*03*    Migration Considerations: NONE                                  02950000
*01* END CONTROL BLOCK CHANGES                                          03000000
*                                                                       03050000
*01* CREATED BY:                                                        03100000
*     SYSTEM                                                            03150000
*                                                                       03200000
*01* POINTED TO BY:                                                     03250000
*     N/A                                                               03300000
*                                                                       03350000
*01* SERIALIZATION:                                                     03400000
*     N/A                                                               03450000
*                                                                       03500000
*01* FUNCTION:                                                          03550000
*02* Maps the architected segment table entry                           03600000
*                                                                       03650000
*                                                                       03700000
*01* METHOD OF ACCESS:                                                  03750000
*02*  ASM:                                                              03800000
*      IHAEASCE                                                         03850000
*           DSECT=YES|NO  -- Request DSECT definition                   03900000
*           EASCE=YES|NO|COND -- Request EASCE mapping                  03950000
*                            USING on EASCE                             04000000
*     Default: DSECT=YES,EASCE=YES                                      04050000
*     Notes: name=YES  => expand                                        04100000
*            name=NO   => do not expand                                 04150000
*            name=COND => expand only if DSECT=YES                      04200000
*                                                                       04250000
*02*  PL/X:                                                             04300000
*      %INCLUDE SYSLIB(IHAEASCE)                                        04350000
*                                                                       04400000
*01* DELETED BY:  N/A                                                   04450000
*                                                                       04500000
*01* FREQUENCY:  N/A                                                    04550000
*                                                                       04600000
*01* DEPENDENCIES:  None                                                04650000
*                                                                       04700000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04750000
*                                                                       04800000
*01* CHANGE ACTIVITY:                                                   04850000
*   $L0=64BITCBG HBB7703  980112  PD00XB:  ESAME                        04900000
*   $L1=64BITSUP HBB7703  980112  PD00XB:  ESAME                        04950000
*                                                                       05000000
* END OF SPECIFICATIONS *********************************************/  05050000
*% /*                                                                   05100000
.P0      ANOP                                                           05150000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05200000
         AIF   ('&LIST' EQ 'YES').P2                                    05250000
.P1      ANOP                                                           05300000
         PUSH  PRINT                                                    05350000
         PRINT OFF                                                      05400000
.P2      ANOP                                                           05450000
         AIF   ('&EASCE' EQ 'NO').L0002                                 05500000
         AIF   ('&DSECT' EQ 'YES').L0003                                05550000
         AIF   ('&EASCE' NE 'YES').L0002                                05600000
EASCE    DS    0X                                                       05650000
         AGO   .L0004                                                   05700000
.L0003   ANOP                                                           05750000
EASCE    DSECT                                                          05800000
.L0004   ANOP                                                           05850000
EASCE_UNION DS 1CL0008                                                  05900000
         ORG   EASCE_UNION                                              05950000
EASCE_STD DS   1CL0008   Segment Table descriptor                       06000000
         ORG   EASCE_STD                                                06050000
         DS    1CL0006                                                  06100000
EASCE_STD_BYTE6 DS 1BL1                                                 06150000
         ORG   EASCE_STD_BYTE6                                          06200000
EASCE_STD_G EQU X'02'    Subspace-group control                         06250000
EASCE_STD_P EQU X'01'    Private-space control                          06300000
         ORG   EASCE_STD_BYTE6+X'00000001'                              06350000
EASCE_STD_BYTE7 DS 1BL1                                                 06400000
         ORG   EASCE_STD_BYTE7                                          06450000
EASCE_STD_S EQU X'80'    Storage-alteration-event control               06500000
EASCE_STD_X EQU X'40'    Space-switch-event control                     06550000
EASCE_STD_STL EQU X'0F'  Segment table length                           06600000
         ORG   EASCE_UNION                                              06650000
EASCE_RTD DS   1CL0008   Region Table descriptor                        06700000
         ORG   EASCE_RTD                                                06750000
         DS    1CL0006                                                  06800000
EASCE_RTD_BYTE6 DS 1BL1                                                 06850000
         ORG   EASCE_RTD_BYTE6                                          06900000
EASCE_RTD_G EQU X'02'    Subspace-group control                         06950000
EASCE_RTD_P EQU X'01'    Private-space control                          07000000
         ORG   EASCE_RTD_BYTE6+X'00000001'                              07050000
EASCE_RTD_BYTE7 DS 1BL1                                                 07100000
         ORG   EASCE_RTD_BYTE7                                          07150000
EASCE_RTD_S EQU X'80'    Storage-alteration-event control               07200000
EASCE_RTD_X EQU X'40'    Space-switch-event control                     07250000
EASCE_RTD_TR EQU X'18'   Bits 59/60 Type+Real B'11' => RSD B'10' =>    *07300000
                         RTD                                            07350000
EASCE_RTD_TYPE EQU X'10' Bit 59: 1 indicates RTD or RSD                 07400000
EASCE_RTD_REAL EQU X'08' Bit 60: 1 indicates real                       07450000
EASCE_RTD_U EQU X'01'    Unusual-reference-pattern bit                  07500000
EASCE_STO_MASK_0TO3 EQU X'FFFFFFFF' This is the first 4-byte segment   *07550000
                         of an 8-byte constant. Mask to isolate        *07600000
                         51-bits of STO                                 07650000
EASCE_STO_MASK_4TO7 EQU X'FFFFF000' This is the second 4-byte segment  *07700000
                         of an 8-byte constant. Mask to isolate        *07750000
                         51-bits of STO                                 07800000
EASCE_RTO_MASK_0TO3 EQU X'FFFFFFFF' This is the first 4-byte segment   *07850000
                         of an 8-byte constant. Mask to isolate        *07900000
                         51-bits of RTO                                 07950000
EASCE_RTO_MASK_4TO7 EQU X'FFFFF000' This is the second 4-byte segment  *08000000
                         of an 8-byte constant. Mask to isolate        *08050000
                         51-bits of RTO                                 08100000
         ORG   EASCE+X'00000008'                                        08150000
EASCE_LEN EQU  *-EASCE                                                  08200000
.L0002   ANOP                                                           08250000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08300000
         AIF   ('&LIST' EQ 'YES').P4                                    08350000
.P3      ANOP                                                           08400000
         POP   PRINT                                                    08450000
.P4      ANOP                                                           08500000
.P_EXIT  ANOP                                                           08550000
         MEND                                                           08600000
**/ IHAEASCE_2:;                                                        08650000
* %IHAEASCE_INCLUDED = 'YES';                                           08700000
* %DCL ZCBPRINT CHAR EXT;                                               08750000
* %DEACTIVATE ZCBPRINT;                                                 08800000
* %DCL IHAEASCE_LIST CHAR EXT;                                          08850000
* %DEACTIVATE IHAEASCE_LIST;                                            08900000
* %IF IHAEASCE_LIST ^= 'NO' &                                           08950000
*    ZCBPRINT ^= 'NO' %THEN                                             09000000
*   %GOTO IHAEASCE_3;                                                   09050000
*   @LIST PUSH NOECHO;                                                  09100000
*   @LIST NOASSEMBLE NOECHO;                                            09150000
*   @LIST OFF C NOECHO;                                                 09200000
* %IHAEASCE_3:;                                                         09250000
*/* Start of PL/X Source                                             */ 09300000
*DCL 1 EASCE TYPE Bit(64) BDY(WORD)                                     09350000
*      ,3 EASCE_UNION UNION                                             09400000
*        ,5 EASCE_STD               /* Segment Table descriptor  @L1A*/ 09450000
*          ,7 * CHAR(6)             /*                           @L1A*/ 09500000
*          ,7 EASCE_STD_BYTE6 Bit(8) /*                          @L1A*/ 09550000
*            ,9 * Bit(6)            /*                           @L1A*/ 09600000
*            ,9 EASCE_STD_G Bit(1)  /* Subspace-group control    @L1A*/ 09650000
*            ,9 EASCE_STD_P Bit(1)  /* Private-space control     @L1A*/ 09700000
*          ,7 EASCE_STD_BYTE7 Bit(8) /*                          @L1A*/ 09750000
*            ,9 EASCE_STD_S Bit(1)  /* Storage-alteration-event         09800000
*                                      control                   @L1A*/ 09850000
*            ,9 EASCE_STD_X Bit(1)  /* Space-switch-event               09900000
*                                      control                   @L1A*/ 09950000
*            ,9 * Bit(1)            /* Bit 58: 0 indicates STD   @L1A*/ 10000000
*            ,9 * Bit(1)            /* Reserved                  @L1A*/ 10050000
*            ,9 EASCE_STD_STL Bit(4) /* Segment table length     @L1A*/ 10100000
*        ,5 EASCE_RTD               /* Region Table descriptor   @L1A*/ 10150000
*          ,7 * CHAR(6)             /*                           @L1A*/ 10200000
*          ,7 EASCE_RTD_BYTE6 Bit(8) /*                          @L1A*/ 10250000
*            ,9 * Bit(6)            /*                           @L1A*/ 10300000
*            ,9 EASCE_RTD_G Bit(1)  /* Subspace-group control    @L1A*/ 10350000
*            ,9 EASCE_RTD_P Bit(1)  /* Private-space control     @L1A*/ 10400000
*          ,7 EASCE_RTD_BYTE7 Bit(8) /*                          @L1A*/ 10450000
*            ,9 EASCE_RTD_S Bit(1)  /* Storage-alteration-event         10500000
*                                      control                   @L1A*/ 10550000
*            ,9 EASCE_RTD_X Bit(1)  /* Space-switch-event               10600000
*                                      control                   @L1A*/ 10650000
*            ,9 * Bit(1)            /* Reserved                  @L1A*/ 10700000
*            ,9 EASCE_RTD_TR Bit(2) /* Bits 59/60 Type+Real      @L1A*/ 10750000
*                                   /* B'11' => RSD              @L1A*/ 10800000
*                                   /* B'10' => RTD              @L1A*/ 10850000
*              ,11 EASCE_RTD_Type Bit(1) /* Bit 59: 1 indicates RTD     10900000
*                                      or RSD                    @L1A*/ 10950000
*              ,11 EASCE_RTD_Real Bit(1) /*                             11000000
*                                      Bit 60: 1 indicates real  @L1A*/ 11050000
*            ,9 * Bit(2)            /* Reserved                  @L1A*/ 11100000
*            ,9 EASCE_RTD_U Bit(1)  /* Unusual-reference-pattern        11150000
*                                      bit                       @L1A*/ 11200000
*        ;                                                              11250000
*DCL EASCE_STO_MASK Bit(64) CONSTANT('FFFFFFFFFFFFF000'x); /* Mask to   11300000
*                                  isolate 51-bits of STO        @L1A*/ 11350000
*DCL EASCE_RTO_MASK Bit(64) CONSTANT('FFFFFFFFFFFFF000'x); /* Mask to   11400000
*                                  isolate 51-bits of RTO        @L1A*/ 11450000
*@LOGIC;                                                                11500000
*#PRAGMA TOOL=CBGEN.                                                    11550000
*#USEORG.                                                               11600000
*#EPRAGMA.                                                              11650000
*@ENDLOGIC;                                                             11700000
*/* End of PL/X Source                                               */ 11750000
* %IF IHAEASCE_LIST ^= 'NO' &                                           11800000
*    ZCBPRINT ^= 'NO' %THEN                                             11850000
*   %GOTO IHAEASCE_4;                                                   11900000
*   @LIST POP NOECHO;                                                   11950000
* %IHAEASCE_4:;                                                         12000000
* %END;                                                                 12050000
