*                                                                       00050000
* %DCL IHAPSAE_INCLUDED CHAR EXT;                                       00100000
* %DEACTIVATE IHAPSAE_INCLUDED;                                         00150000
* %IF IHAPSAE_INCLUDED = '' %THEN                                       00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 99280. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IHAPSAE &DSECT=YES,&LIST=YES,&TITLE=YES,&FLCESAME=YES          00450000
         GBLC  &IHAPSAE_INCLUDED                                        00500000
         GBLC  &ZCBPRINT                                                00550000
&IHAPSAE_INCLUDED SETC 'YES'                                            00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00650000
         AIF   ('&TITLE' EQ 'NO').P5                                    00700000
 TITLE   'IHAPSAE  - PSA Extension (ESAME)                          '   00750000
.P5      ANOP                                                           00800000
**/ IHAPSAE_1:;                                                         00850000
*/* START OF SPECIFICATIONS ******************************************* 00900000
*                                                                       00950000
*  **PROPRIETARY_STATEMENT********************************************  01000000
***01* PROPRIETARY STATEMENT=                                        *  01050000
*                                                                    *  01100000
*                                                                    *  01150000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  01200000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  01250000
*   5647-A01 (C) COPYRIGHT IBM CORP. 2000                            *  01300000
*                                                                    *  01350000
*   STATUS= HBB7703                                                  *  01400000
*                                                                    *  01450000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  01500000
*                                                                       01550000
*01* DESCRIPTIVE NAME:  PSA Extension (ESAME)                           01600000
*02*  ACRONYM:  PSAE                                                    01650000
*                                                                       01700000
*01* MACRO NAME:  IHAPSAE                                               01750000
*                                                                       01800000
*01* EXTERNAL CLASSIFICATION:                                           01825000
*01*   NOTPI: BASE                                                      01850000
*01*   PI:    FIELDS FlceFacilitiesList                                 01875000
*01* END OF EXTERNAL CLASSIFICATION:                                    01912500
*                                                                       01950000
*01* DSECT NAME:                                                        02000000
*     FLCESAME                                                          02050000
*                                                                       02100000
*01* COMPONENT:  SUPERVISOR CONTROL (SC1C5)                             02150000
*                                                                       02200000
*01* EYE-CATCHER:  NONE                                                 02250000
*                                                                       02300000
*01* STORAGE ATTRIBUTES:                                                02350000
*02*  SUBPOOL:  N/A                                                     02400000
*02*  KEY:      N/A                                                     02450000
*02*  RESIDENCY:  N/A                                                   02500000
*                                                                       02550000
*01* SIZE:                                                              02600000
*                FLCESAME -- X'0200' bytes                              02650000
*                                                                       02700000
*01* CONTROL BLOCK CHANGES:                                             02750000
*02*  IHAPSAE                                                           02800000
*02*   6.8                                                              02850000
*03*    New                                                             02900000
*03*    Migration Considerations: NONE                                  02950000
*01* END CONTROL BLOCK CHANGES                                          03000000
*                                                                       03050000
*01* CREATED BY:                                                        03100000
*       IEAVFX00                                                        03125000
*       IEAVNIP0                                                        03150000
*       IEEVCPRA                                                        03175000
*                                                                       03200000
*01* POINTED TO BY:                                                     03250000
*       The PSAE maps the storage that starts at location 0 for the     03283300
*       related processor.                                              03316600
*                                                                       03350000
*01* SERIALIZATION:                                                     03400000
*       Disablement.                                                    03433300
*       None needed for FlceFacilitiesList.                             03466600
*                                                                       03500000
*01* FUNCTION:                                                          03550000
*02* Maps the ESAME format of the first page of the PSA.                03600000
*02* This macro is automatically included when IHAPSA is included.      03650000
*                                                                       03700000
*                                                                       03750000
*01* METHOD OF ACCESS:                                                  03800000
*02*  ASM:                                                              03850000
*      IHAPSAE                                                          03900000
*           DSECT=YES|NO  -- Request DSECT definition                   03950000
*           PSAE=YES|NO|COND -- Request PSAE mapping                    04000000
*                            USING on PSAE                              04050000
*     Default: DSECT=YES,PSAE=YES                                       04100000
*     Notes: name=YES  => expand                                        04150000
*            name=NO   => do not expand                                 04200000
*            name=COND => expand only if DSECT=YES                      04250000
*                                                                       04300000
*02*  PL/X:                                                             04350000
*      %INCLUDE SYSLIB(IHAPSAE)                                         04400000
*                                                                       04450000
*01* DELETED BY:  N/A                                                   04500000
*                                                                       04550000
*01* FREQUENCY:  N/A                                                    04600000
*                                                                       04650000
*01* DEPENDENCIES:  None                                                04700000
*                                                                       04750000
*01* NOTES: The FLCX can also be used to map the second 512 bytes       04800000
*           of the area saved by Store Status at Address.               04850000
*                                                                       04900000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04950000
*                                                                       05000000
*01* CHANGE ACTIVITY:                                                   05050000
*   $L0=64BITCBG HBB7703  971101  PD00XB:  AR 8537                      05100000
*   $L1=64BITSUP HBB7703  971101  PD00XB:  AR 8537                      05150000
*   $P1=         HBB7703  990331  PDHC  :  AR-8660-02 and nits          05175000
*                                                                       05200000
* END OF SPECIFICATIONS *********************************************/  05250000
*% /*                                                                   05300000
.P0      ANOP                                                           05350000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05400000
         AIF   ('&LIST' EQ 'YES').P2                                    05450000
.P1      ANOP                                                           05500000
         PUSH  PRINT                                                    05550000
         PRINT OFF                                                      05600000
.P2      ANOP                                                           05650000
         AIF   ('&FLCESAME' EQ 'NO').L0002                              05700000
         AIF   ('&DSECT' EQ 'YES').L0003                                05750000
         AIF   ('&FLCESAME' NE 'YES').L0002                             05800000
FLCESAME DS    0D        FLCE 0x: defined by architecture               05850000
         AGO   .L0004                                                   05900000
.L0003   ANOP                                                           05950000
FLCESAME DSECT           FLCE 0x: defined by architecture               06000000
.L0004   ANOP                                                           06050000
FLCEIPPSW DS   1CL0008   FLCE 0x: IPL PSW                               06100000
FLCEICCW1 DS   1CL0008   FLCE 8x: IPL CCW1                              06150000
FLCEICCW2 DS   1CL0008   FLCE 10x: IPL CCW1                             06200000
FLCER018 DS    1CL0104   FLCE 18x: reserved                             06250000
FLCEEPARM DS   1CL0004   FLCE 80x: External interruption parameter      06300000
FLCECPUAD DS   1CL0002   FLCE 84x: CPU address                          06350000
FLCEEICODE DS  1CL0002   FLCE 86x: External interruption code           06400000
FLCESDATA DS   1CL0004   FLCE 88x: Additional SVC interruption data     06450000
         ORG   FLCESDATA                                                06500000
FLCESDATABYTE0 DS 1CL0002 FLCE 88x:                                     06550000
         ORG   FLCESDATABYTE0                                           06600000
         DS    1CL0001   FLCE 88x: Reserved                             06650000
FLCESILC DS    1FL1      FLCE 89x: SVC interruption length code         06700000
         ORG   FLCESILC                                                 06750000
FLCESILCB EQU  X'07'     FLCE 89x: Significant bits in ILC. Last bit   *06800000
                         is always zero                                 06850000
         ORG   FLCESDATABYTE0+X'00000002'                               06900000
FLCESICODE DS  1CL0002   FLCE 8Ax: SVC interruption code                06950000
FLCEPDATA DS   1CL0004   FLCE 8Cx: Additional Program interruption     *07000000
                         data                                           07050000
         ORG   FLCEPDATA                                                07100000
FLCEPDATABYTE0 DS 1CL0002 FLCE 8Cx:                                     07150000
         ORG   FLCEPDATABYTE0                                           07200000
         DS    1CL0001   FLCE 8Cx: Reserved                             07250000
FLCEPILC DS    1FL1      FLCE 8Dx: Program interruption length code     07300000
         ORG   FLCEPILC                                                 07350000
FLCEPILCB EQU  X'07'     FLCE 8Dx: Significant bits in ILC. Last bit   *07400000
                         is always zero                                 07450000
         ORG   FLCEPDATABYTE0+X'00000002'                               07500000
FLCEPICODE DS  1CL0002   FLCE 8Ex: Program interruption code            07550000
         ORG   FLCEPICODE                                               07600000
FLCEPICODE0 DS 1FL1      FLCE 8Ex: Exception extension code             07650000
FLCEPICODE1 DS 1FL1      FLCE 8Fx: 8-bit interruption code              07700000
         ORG   FLCEPICODE1                                              07750000
FLCEPIPER EQU  X'80'     FLCE 8Fx: PER interruption code                07800000
FLCEPIMC EQU   X'40'     FLCE 8Fx: Monitor Call interruption code       07850000
FLCEPIPC EQU   X'3F'     FLCE 8Fx: An unsolicited program interruption *07900000
                         has occurred if any of these bits are on       07950000
         ORG   FLCEPDATA+X'00000004'                                    08000000
FLCEPIINFORMATION DS 1CL0004 FLCE 90x:                                  08050000
         ORG   FLCEPIINFORMATION                                        08100000
         DS    1CL0003                                                  08150000
FLCEDXC  DS    1FL1      FLCE 93x: Data exception code for PI 7         08200000
FLCEMCNUM DS   1CL0002   FLCE 94x: Monitor class number                 08250000
FLCEPERCODE DS 1CL0002   FLCE 96x: PER code                             08300000
         ORG   FLCEPERCODE                                              08350000
FLCEPERCODE0 DS 1BL1     FLCE 96x: Byte 0                               08400000
         ORG   FLCEPERCODE0                                             08450000
FLCEPERSB EQU  X'80'     FLCE 96x: PER successful branch event          08500000
FLCEPERIF EQU  X'40'     FLCE 96x: PER instruction fetch event          08550000
FLCEPERSA EQU  X'20'     FLCE 96x: PER storage alteration event         08600000
FLCEPERSAR EQU X'08'     FLCE 96x: PER storage alteration using real   *08650000
                         event                                          08700000
         ORG   FLCEPERCODE0+X'00000001'                                 08750000
FLCEPERATMID DS 1BL1     FLCE 97x: PER addressing and translation mode *08800000
                         ID                                             08850000
         ORG   FLCEPERATMID                                             08900000
FLCEPERPSW4 EQU X'80'    FLCE 97x: PER PSW bit 4                        08950000
FLCEPERATMIDVALID EQU X'40' FLCE 97x: When 1, the ATMID bits are valid  09000000
FLCEPERPSW32 EQU X'20'   FLCE 97x: PER PSW bit 32                       09050000
FLCEPERPSW5 EQU X'10'    FLCE 97x: PER PSW bit 5                        09100000
FLCEPERPSW16 EQU X'08'   FLCE 97x: PER PSW bit 16                       09150000
FLCEPERPSW17 EQU X'04'   FLCE 97x: PER PSW bit 17                       09200000
FLCEPERASCEID EQU X'03'  FLCE 97x: PER ASCE identification. If a       *09250000
                         storage alteration event when DAT is on,      *09300000
                         identifies the ASCE used: '00' - primary ASCE *09350000
                         '01' - AR-specified AR. '10' - secondary ASCE *09400000
                         '11' - home ASCE                               09450000
         ORG   FLCEPERCODE+X'00000002'                                  09500000
FLCEPER  DS    1CL0008   FLCE 98x: PER address                          09550000
         ORG   FLCEPER                                                  09600000
FLCEPERW0 DS   1CL0004   FLCE 98x: PER address word 0                   09650000
FLCEPERW1 DS   1AL4      FLCE 9Cx: PER address word 1                   09700000
FLCEEAID DS    1FL1      FLCE A0x: Exception access ID (The AR number  *09750000
                         involved in the translation exception when    *09800000
                         bits 30-31 of the TEA='01'                     09850000
FLCEPERAID DS  1FL1      FLCE A1x: PER access ID (the access register  *09900000
                         number involved in the PER storage alteration *09950000
                         event)                                         10000000
FLCEOPACID DS  1FL1      FLCE A2x:                                      10050000
FLCEAMDID DS   1CL0001   FLCE A3x: Architecture mode ID (See FLCARCH   *10100000
                         in IHAPSA)                                     10150000
         ORG   FLCEAMDID                                                10162500
FLCELOEME EQU  X'01'     Logout is ESAME                                10175000
         ORG   FLCEAMDID+X'00000001'                                    10187500
FLCEMPL  DS    1AL4      FLCE A4x: MPL address                          10200000
FLCETEID DS    1CL0008   FLCE A8x: Translation exception               *10250000
                         identification                                 10300000
         ORG   FLCETEID                                                 10350000
FLCETEA  DS    1CL0008   FLCE A8x: Translation exception address        10400000
         ORG   FLCETEA                                                  10450000
         DS    1CL0007                                                  10500000
FLCETEA7 DS    1BL1      FLCE AFx: Byte 7 of FlceTEA                    10550000
         ORG   FLCETEA7                                                 10600000
FLCEPEALC EQU  X'08'     FLCE AFx: Protection exception due to         *10650000
                         access-list control                            10700000
FLCESOPI EQU   X'04'     FLCE AFx: Suppress on protection indication    10750000
FLCETEASTD EQU X'03'     FLCE AFx: Segment table designation for TEA:  *10800000
                         '00' - primary STD '01' - STD was             *10850000
                         AR-qualified '10' - secondary STD '11' - home *10900000
                         STD                                            10950000
         ORG   FLCETEID                                                 11000000
FLCETEASNINFO DS 1CL0008 FLCE A8x: ASN Info                             11050000
         ORG   FLCETEASNINFO                                            11100000
         DS    1CL0006                                                  11150000
FLCETEASN DS   1FL2      FLCE AEx: ASN                                  11200000
         ORG   FLCETEID                                                 11250000
FLCETEPCINFO DS 1CL0008  FLCE A8x: PC Info                              11300000
         ORG   FLCETEPCINFO                                             11350000
         DS    1CL0004                                                  11400000
FLCEPCNUM DS   1FL4      FLCE ACx: PC#. Bits 0-10 are 0, bit 11 is 1,  *11450000
                         and the PC# is in bits 12-31                   11500000
FLCEMONITORCODE DS 1CL0008 FLCE B0x: Monitor Code                       11550000
FLCESSID DS    1CL0004   FLCE B8x: Subsystem ID word                    11600000
FLCEIOINTPARM DS 1CL0004 FLCE BCx: I/O interruption parameter           11650000
FLCEIOINTID DS 1CL0004   FLCE C0x: I/O interruption ID                  11700000
FLCER0C4 DS    1CL0004   FLCE C4x: Reserved                             11727900
FLCEFACILITIESLIST DS 1CL0004 FLCE C8x: Facilities list stored by STFL  11755800
         ORG   FLCEFACILITIESLIST                                       11761600
FLCEFACILITIESLISTBYTE0 DS 1BL1 FLCE C8x                                11767400
         ORG   FLCEFACILITIESLISTBYTE0                                  11773200
FLCEESAMEN3 EQU X'80'    Instructions marked "N3" in the instruction   *11779000
                         summary are available on the CPU in ESA/390   *11784800
                         mode                                           11790600
FLCEESAMEINSTALLED EQU X'40' The ESAME architectural mode is installed *11796400
                         on the CPU                                     11802200
FLCEESAME EQU  X'20'     The ESAME architectural mode is active on the *11808000
                         CPU                                            11813800
         ORG   FLCEFACILITIESLISTBYTE0+X'00000001'                      11819600
FLCEFACILITIESLISTBYTE1 DS 1BL1 FLCE C9x                                11825400
FLCEFACILITIESLISTBYTE2 DS 1BL1 FLCE CAx                                11831200
FLCEFACILITIESLISTBYTE3 DS 1BL1 FLCE CBx                                11837000
FLCER0CC DS    1CL0008   FLCE CCx: Reserved                             11842800
FLCER0D4 DS    1CL0004   FLCE D4x: Reserved                             11850000
FLCER0D8 DS    1CL0016   FLCE D8x: Reserved                             11900000
FLCEMCIC DS    1CL0008   FLCE E8x: Machine check interruption code      11950000
FLCEMCICE DS   1CL0004   FLCE F0x: Machine check interruption code     *12000000
                         extension                                      12050000
FLCEEDCODE DS  1CL0004   FLCE F4x: External damage code                 12100000
FLCEFSA  DS    1CL0008   FLCE F8x: Failing storage address              12150000
FLCER100 DS    1CL0032   FLCE 100x: Reserved                            12200000
FLCEROPSW DS   1CL0016   FLCE 120x: Restart old PSW                     12250000
FLCEEOPSW DS   1CL0016   FLCE 130x: External old PSW                    12300000
FLCESOPSW DS   1CL0016   FLCE 140x: SVC old PSW                         12350000
FLCEPOPSW DS   1CL0016   FLCE 150x: Program old PSW                     12400000
FLCEMOPSW DS   1CL0016   FLCE 160x: Machine check old PSW               12450000
FLCEIOPSW DS   1CL0016   FLCE 170x: I/O old PSW                         12500000
FLCER180 DS    1CL0032   FLCE 180x: reserved                            12550000
FLCERNPSW DS   1CL0016   FLCE 1A0x: Restart new PSW                     12600000
FLCEENPSW DS   1CL0016   FLCE 1B0x: External new PSW                    12650000
FLCESNPSW DS   1CL0016   FLCE 1C0x: SVC new PSW                         12700000
FLCEPNPSW DS   1CL0016   FLCE 1D0x: Program new PSW                     12750000
FLCEMNPSW DS   1CL0016   FLCE 1E0x: Machine check new PSW               12800000
FLCEINPSW DS   1CL0016   FLCE 1F0x: I/O new PSW                         12850000
FLCESAME_LEN EQU *-FLCESAME                                             12900000
.L0002   ANOP                                                           12950000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 13000000
         AIF   ('&LIST' EQ 'YES').P4                                    13050000
.P3      ANOP                                                           13100000
         POP   PRINT                                                    13150000
.P4      ANOP                                                           13200000
.P_EXIT  ANOP                                                           13250000
         MEND                                                           13300000
**/ IHAPSAE_2:;                                                         13350000
* %IHAPSAE_INCLUDED = 'YES';                                            13400000
* %DCL ZCBPRINT CHAR EXT;                                               13450000
* %DEACTIVATE ZCBPRINT;                                                 13500000
* %DCL IHAPSAE_LIST CHAR EXT;                                           13550000
* %DEACTIVATE IHAPSAE_LIST;                                             13600000
* %IF IHAPSAE_LIST ^= 'NO' &                                            13650000
*    ZCBPRINT ^= 'NO' %THEN                                             13700000
*   %GOTO IHAPSAE_3;                                                    13750000
*   @LIST PUSH NOECHO;                                                  13800000
*   @LIST NOASSEMBLE NOECHO;                                            13850000
*   @LIST OFF C NOECHO;                                                 13900000
* %IHAPSAE_3:;                                                          13950000
*/* Start of PL/X Source                                             */ 14000000
*DCL 1 FlcESAME BDY(DWORD) TYPE           /* FLCE 0x: defined by        14050000
*                                             architecture       @L1A*/ 14100000
*       ,3 FlceIPPSW CHAR(8)              /* FLCE   0x: IPL PSW         14150000
*                                                                @L1A*/ 14200000
*       ,3 FlceICCW1 CHAR(8)              /* FLCE   8x: IPL CCW1        14250000
*                                                                @L1A*/ 14300000
*       ,3 FlceICCW2 CHAR(8)              /* FLCE  10x: IPL CCW1        14350000
*                                                                @L1A*/ 14400000
*       ,3 FlceR018 CHAR(68x)             /* FLCE  18x: reserved        14450000
*                                                                @L1A*/ 14500000
*       ,3 FlceEPARM Char(4)              /* FLCE  80x: External        14550000
*                                     interruption parameter     @L1A*/ 14600000
*       ,3 FlceCpuAd Char(2)              /* FLCE  84x: CPU             14650000
*                                     address                    @L1A*/ 14700000
*       ,3 FlceEICode Char(2)             /* FLCE  86x: External        14750000
*                                     interruption code          @L1A*/ 14800000
*       ,3 FlceSData  Char(4)             /* FLCE  88x: Additional      14850000
*                                     SVC interruption data      @L1A*/ 14900000
*         ,5 FlceSdataByte0 Char(2)       /* FLCE  88x:                 14950000
*                                                                @L1A*/ 15000000
*           ,7 *      Char(1)             /* FLCE  88x: Reserved        15050000
*                                                                @L1A*/ 15100000
*           ,7 FlceSILC Fixed(8)          /* FLCE  89x: SVC             15150000
*                                     interruption length code   @L1A*/ 15200000
*             ,9 *    Bit(5)              /* FLCE  89x: Reserved        15250000
*                                                                @L1A*/ 15300000
*             ,9 FlceSILCB Bit(3)         /* FLCE  89x: Significant     15350000
*                                     bits in ILC. Last bit is          15400000
*                                     always zero                @L1A*/ 15450000
*         ,5 FlceSICode Char(2)           /* FLCE  8Ax: SVC             15500000
*                                     interruption code          @L1A*/ 15550000
*       ,3 FlcePData  Char(4)             /* FLCE  8Cx: Additional      15600000
*                                     Program interruption data  @L1A*/ 15650000
*         ,5 FlcePDataByte0 Char(2)       /* FLCE  8Cx:                 15700000
*                                                                @L1A*/ 15750000
*           ,7 *      Char(1)             /* FLCE  8Cx: Reserved        15800000
*                                                                @L1A*/ 15850000
*           ,7 FlcePILC Fixed(8)          /* FLCE  8Dx: Program         15900000
*                                     interruption length code   @L1A*/ 15950000
*             ,9 *    Bit(5)              /* FLCE  8Dx: Reserved        16000000
*                                                                @L1A*/ 16050000
*             ,9 FlcePILCB Bit(3)         /* FLCE  8Dx: Significant     16100000
*                                     bits in ILC. Last bit is          16150000
*                                     always zero                @L1A*/ 16200000
*         ,5 FlcePICode Char(2)           /* FLCE  8Ex: Program         16250000
*                                     interruption code          @L1A*/ 16300000
*           ,7 FlcePICode0 Fixed(8)       /* FLCE  8Ex: Exception       16350000
*                                     extension code             @L1A*/ 16400000
*           ,7 FlcePICode1 Fixed(8)       /* FLCE  8Fx: 8-bit           16450000
*                                     interruption code          @L1A*/ 16500000
*             ,9 FlcePIPER Bit(1)         /* FLCE  8Fx: PER             16550000
*                                     interruption code          @L1A*/ 16600000
*             ,9 FlcePIMC Bit(1)          /* FLCE  8Fx: Monitor Call    16650000
*                                     interruption code          @L1A*/ 16700000
*             ,9 FlcePIPC Bit(6)          /* FLCE  8Fx: An unsolicited  16750000
*                                     program interruption has          16800000
*                                     occurred if any of these bits     16850000
*                                     are on                     @L1A*/ 16900000
*       ,3 FlcePIInformation                                            16950000
*               Bdy(Word)                 /* FLCE  90x:          @L1A*/ 17000000
*           ,5 *      Char(3)             /*                     @L1A*/ 17050000
*           ,5 FlceDXC Fixed(8)           /* FLCE  93x: Data exception  17100000
*                                     code for PI 7              @L1A*/ 17150000
*       ,3 FlceMCNUM Char(2)              /* FLCE  94x: Monitor         17200000
*                                     class number               @L1A*/ 17250000
*       ,3 FlcePerCode Char(2)            /* FLCE  96x: PER code        17300000
*                                                                @L1A*/ 17350000
*         ,4 FlcePerCode0 Bit(8)          /* FLCE  96x: Byte 0   @L1A*/ 17400000
*           ,5 FlcePerSB Bit(1)           /* FLCE  96x: PER successful  17450000
*                                     branch event               @L1A*/ 17500000
*           ,5 FlcePerIF Bit(1)           /* FLCE  96x: PER instruction 17550000
*                                     fetch event                @L1A*/ 17600000
*           ,5 FlcePerSA Bit(1)           /* FLCE  96x: PER storage     17650000
*                                     alteration event           @L1A*/ 17700000
*           ,5 * Bit(1)                   /* FLCE  96x:          @L1A*/ 17750000
*           ,5 FlcePerSAR Bit(1)          /* FLCE  96x: PER storage     17800000
*                                     alteration using real event       17850000
*                                                                @L1A*/ 17900000
*           ,5 * Bit(3)                   /* FLCE  96x:          @L1A*/ 17950000
*         ,4 FlcePerATMID Bit(8)          /* FLCE  97x: PER addressing  18000000
*                                     and translation mode ID    @L1A*/ 18050000
*           ,5 FlcePerPSW4 Bit(1)         /* FLCE  97x: PER PSW bit 4   18100000
*                                                                @L1A*/ 18150000
*           ,5 FlcePerAtmidValid Bit(1)   /* FLCE  97x: When 1, the     18200000
*                                     ATMID bits are valid       @L1A*/ 18250000
*           ,5 FlcePerPSW32 Bit(1)        /* FLCE  97x: PER PSW bit 32  18300000
*                                                                @L1A*/ 18350000
*           ,5 FlcePerPSW5 Bit(1)         /* FLCE  97x: PER PSW bit 5   18400000
*                                                                @L1A*/ 18450000
*           ,5 FlcePerPSW16 Bit(1)        /* FLCE  97x: PER PSW bit 16  18500000
*                                                                @L1A*/ 18550000
*           ,5 FlcePerPSW17 Bit(1)        /* FLCE  97x: PER PSW bit 17  18600000
*                                                                @L1A*/ 18650000
*           ,5 FlcePerAsceId Bit(2)       /* FLCE  97x: PER ASCE        18700000
*                                     identification. If a storage      18750000
*                                     alteration event when DAT is on,  18800000
*                                     identifies the ASCE used:         18850000
*                                     '00' - primary ASCE               18900000
*                                     '01' - AR-specified AR.           18950000
*                                     '10' - secondary ASCE             19000000
*                                     '11' - home ASCE           @L1A*/ 19050000
*       ,3 FlcePer Char(8) Bdy(Dword)     /* FLCE  98x: PER address     19100000
*                                                                @L1A*/ 19150000
*         ,5 FlcePerW0 Char(4)            /* FLCE  98x: PER address     19200000
*                                            word 0              @L1A*/ 19250000
*         ,5 FlcePerW1 Ptr(31)            /* FLCE  9Cx: PER address     19300000
*                                            word 1              @L1A*/ 19350000
*       ,3 FlceEAID Fixed(8)              /* FLCE  A0x: Exception       19400000
*                                     access ID (The AR number          19450000
*                                     involved in the translation       19500000
*                                     exception when bits 30-31 of      19550000
*                                     the TEA='01'               @L1A*/ 19600000
*       ,3 FlcePerAID Fixed(8)            /* FLCE  A1x: PER access ID   19650000
*                                     (the access register number       19700000
*                                     involved in the PER storage       19750000
*                                     alteration event)          @L1A*/ 19800000
*       ,3 FlceOpAcID Fixed(8)            /* FLCE  A2x:                 19850000
*                                                                @L1A*/ 19900000
*       ,3 FlceAMdID CHAR(1)              /* FLCE  A3x: Architecture    19950000
*                                     mode ID (See FLCARCH in           20000000
*                                     IHAPSA)                    @P1C*/ 20020000
*         ,5 * BIT(7)                     /* Reserved            @P1A*/ 20040000
*         ,5 FlceLoEME Bit(1)             /* Logout is ESAME     @P1A*/ 20060000
*                                                                       20080000
*       ,3 FlceMPL Ptr(31)                /* FLCE  A4x: MPL address     20100000
*                                                                @L1A*/ 20150000
*       ,3 FlceTEID UNION CHAR(8) Bdy(Dword)  /* FLCE  A8x: Translation 20200000
*                                     exception identification   @L1A*/ 20250000
*         ,5 FlceTEA CHAR(8) Bdy(Dword)   /* FLCE  A8x: Translation     20300000
*                                     exception address          @L1A*/ 20350000
*           ,7 * CHAR(7)                                                20400000
*           ,7 FlceTEA7 Bit(8)            /* FLCE  AFx: Byte 7 of       20450000
*                                     FlceTEA                    @L1A*/ 20500000
*             ,9 * Bit(4)                 /*                     @L1A*/ 20550000
*             ,9 FlcePEALC Bit(1)         /* FLCE  AFx: Protection      20600000
*                                     exception due to access-list      20650000
*                                     control                    @L1A*/ 20700000
*             ,9 FlceSOPI Bit(1)          /* FLCE  AFx: Suppress on     20750000
*                                     protection indication      @L1A*/ 20800000
*             ,9 FlceTeaSTD Bit(2)        /* FLCE  AFx: Segment table   20850000
*                                     designation for TEA:              20900000
*                                     '00' - primary STD                20950000
*                                     '01' - STD was AR-qualified       21000000
*                                     '10' - secondary STD              21050000
*                                     '11' - home STD            @L1A*/ 21100000
*         ,5 FlceTEASNInfo CHAR(8) Bdy(Dword)  /*                       21150000
*                                            FLCE  A8x: ASN Info @L1A*/ 21200000
*           ,7 * CHAR(6)                                                21250000
*           ,7 FlceTEASN Fixed(15)        /* FLCE  AEx: ASN      @L1A*/ 21300000
*         ,5 FlceTEPCInfo CHAR(8) Bdy(Dword)   /*                       21350000
*                                            FLCE  A8x: PC Info  @L1A*/ 21400000
*           ,7 * CHAR(4)                                                21450000
*           ,7 FlcePCNUM Fixed(31)        /* FLCE  ACx: PC#. Bits 0-10  21500000
*                              are 0, bit 11 is 1, and the PC# is in    21550000
*                              bits 12-31                        @L1A*/ 21600000
*       ,3 FlceMonitorCode Char(8)        /* FLCE  B0x: Monitor Code    21650000
*                                                                @L1A*/ 21700000
*       ,3 FlceSSID Char(4)               /* FLCE  B8x: Subsystem ID    21750000
*                                     word                       @L1A*/ 21800000
*       ,3 FlceIOIntParm Char(4)          /* FLCE  BCx: I/O             21850000
*                                     interruption parameter     @L1A*/ 21900000
*       ,3 FlceIOIntID Char(4)            /* FLCE  C0x: I/O             21950000
*                                     interruption ID            @L1A*/ 22000000
*       ,3 FlceR0C4 CHAR(4)               /* FLCE  C4x: Reserved @L1A*/ 22050000
*       ,3 FlceFacilitiesList CHAR(4)     /* FLCE  C8x: Facilities      22105500
*                                     list stored by STFL        @L1A*/ 22111000
*         ,4 FlceFacilitiesListByte0 Bit(8)  /* FLCE C8x         @L1A*/ 22116500
*           ,5 FlceEsameN3 Bit(1)         /* Instructions               22122000
*                                     marked "N3" in the instruction    22127500
*                                     summary are available on the CPU  22133000
*                                     in ESA/390 mode            @L1A*/ 22138500
*           ,5 FlceEsameInstalled Bit(1)  /* The ESAME architectural    22144000
*                                     mode is installed on the CPU      22149500
*                                                                @L1A*/ 22155000
*           ,5 FlceEsame Bit(1)           /* The ESAME architectural    22160500
*                                     mode is active on the CPU         22166000
*                                                                @L1A*/ 22171500
*         ,4 FlceFacilitiesListByte1 Bit(8)  /* FLCE C9x         @L1A*/ 22177000
*         ,4 FlceFacilitiesListByte2 Bit(8)  /* FLCE CAx         @L1A*/ 22182500
*         ,4 FlceFacilitiesListByte3 Bit(8)  /* FLCE CBx         @L1A*/ 22188000
*       ,3 FlceR0CC Char(8)               /* FLCE  CCx: Reserved @L1A*/ 22193500
*       ,3 FlceR0D4 Char(4)               /* FLCE  D4x: Reserved @L1A*/ 22200000
*       ,3 FlceR0D8 Char(10x)             /* FLCE  D8x: Reserved @L1A*/ 22250000
*       ,3 FlceMCIC Char(8)               /* FLCE  E8x: Machine         22300000
*                                     check interruption code    @L1A*/ 22350000
*       ,3 FlceMCICE Char(4)              /* FLCE  F0x: Machine         22400000
*                                     check interruption code           22450000
*                                     extension                  @L1A*/ 22500000
*       ,3 FlceEDCode Char(4)             /* FLCE  F4x: External        22550000
*                                     damage code                @L1A*/ 22600000
*       ,3 FlceFSA Char(8)                /* FLCE  F8x: Failing         22650000
*                                     storage address            @L1A*/ 22700000
*       ,3 FlceR100 Char(20x)             /* FLCE 100x: Reserved @L1A*/ 22750000
*       ,3 FlceROPsw Char(16) Bdy(Dword)  /* FLCE 120x: Restart         22800000
*                                     old PSW                    @L1A*/ 22850000
*       ,3 FlceEOPsw Char(16) Bdy(Dword)  /* FLCE 130x: External        22900000
*                                     old PSW                    @L1A*/ 22950000
*       ,3 FlceSOPsw Char(16) Bdy(Dword)  /* FLCE 140x: SVC             23000000
*                                     old PSW                    @L1A*/ 23050000
*       ,3 FlcePOPsw Char(16) Bdy(Dword)  /* FLCE 150x: Program         23100000
*                                     old PSW                    @L1A*/ 23150000
*       ,3 FlceMOPsw Char(16) Bdy(Dword)  /* FLCE 160x: Machine check   23200000
*                                     old PSW                    @L1A*/ 23250000
*       ,3 FlceIOPsw Char(16) Bdy(Dword)  /* FLCE 170x: I/O             23300000
*                                     old PSW                    @L1A*/ 23350000
*       ,3 FlceR180  Char(20x)            /* FLCE 180x: reserved @L1A*/ 23400000
*       ,3 FlceRNPsw Char(16) Bdy(Dword)  /* FLCE 1A0x: Restart         23450000
*                                     new PSW                    @L1A*/ 23500000
*       ,3 FlceENPsw Char(16) Bdy(Dword)  /* FLCE 1B0x: External        23550000
*                                     new PSW                    @L1A*/ 23600000
*       ,3 FlceSNPsw Char(16) Bdy(Dword)  /* FLCE 1C0x: SVC             23650000
*                                     new PSW                    @L1A*/ 23700000
*       ,3 FlcePNPsw Char(16) Bdy(Dword)  /* FLCE 1D0x: Program         23750000
*                                     new PSW                    @L1A*/ 23800000
*       ,3 FlceMNPsw Char(16) Bdy(Dword)  /* FLCE 1E0x: Machine check   23850000
*                                     new PSW                    @L1A*/ 23900000
*       ,3 FlceINPsw Char(16) Bdy(Dword)  /* FLCE 1F0x: I/O             23950000
*                                     new PSW                    @L1A*/ 24000000
*       ;                                                               24050000
*DCL thePsaESAME Isa(FlcESAME) Location(0);  /*                  @L1A*/ 24100000
*DCL PSAEDummylen1a fixed(32) constant(length(flcesame)-200x);/* @L1A*/ 24150000
*DCL PSAEDummylen1b fixed(32) constant(200x-length(flcesame));/* @L1A*/ 24200000
*@LOGIC;                                                                24250000
*#PRAGMA TOOL=CBGEN.                                                    24300000
*#USEORG.                                                               24350000
*#DELETE.THEPSAESAME                                                    24400000
*#DELETE.PSAEDUMMYLEN1A                                                 24450000
*#DELETE.PSAEDUMMYLEN1B                                                 24500000
*#EPRAGMA.                                                              24550000
*@ENDLOGIC;                                                             24600000
*/* End of PL/X Source                                               */ 24650000
* %IF IHAPSAE_LIST ^= 'NO' &                                            24700000
*    ZCBPRINT ^= 'NO' %THEN                                             24750000
*   %GOTO IHAPSAE_4;                                                    24800000
*   @LIST POP NOECHO;                                                   24850000
* %IHAPSAE_4:;                                                          24900000
* %END;                                                                 24950000
