*                                                                       00002700
* %DCL IHARBUP_INCLUDED CHAR EXT;                                       00005400
* %DEACTIVATE IHARBUP_INCLUDED;                                         00008100
* %IF IHARBUP_INCLUDED = '' %THEN                                       00010800
* %DO;                                                                  00013500
*/* Macro made bi-lingual on 99245. CBGEN compile date 98009         */ 00016200
*% /*                                                                   00018900
         MACRO                                                          00021600
         IHARBUP &DSECT=YES,&LIST=YES,&TITLE=YES                        00024300
         GBLC  &IHARBUP_INCLUDED                                        00027000
         GBLC  &ZCBPRINT                                                00029700
&IHARBUP_INCLUDED SETC 'YES'                                            00032400
         AIF   ('&LIST' EQ 'NONE').P0                                   00035100
         AIF   ('&TITLE' EQ 'NO').P5                                    00037800
 TITLE   'IHARBUP  - RB updated Return Information                  '   00040500
.P5      ANOP                                                           00043200
**/ IHARBUP_1:;                                                         00045900
*/* START OF SPECIFICATIONS ******************************************* 00050000
*                                                                       00100000
*  **PROPRIETARY_STATEMENT********************************************  00150000
***01* PROPRIETARY STATEMENT=                                        *  00200000
*                                                                    *  00250000
*                                                                    *  00300000
*   LICENSED MATERIALS - PROPERTY OF IBM                             *  00350000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  00400000
*   5647-A01 (C) COPYRIGHT IBM CORP. 2000                            *  00450000
*                                                                    *  00500000
*   STATUS= HBB7703                                                  *  00550000
*                                                                    *  00600000
*  **END_OF_PROPRIETARY_STATEMENT*************************************  00650000
*                                                                       00700000
*01* DESCRIPTIVE NAME:  RB updated Return Information                   00750000
*02*  ACRONYM:  RBUP                                                    00800000
*                                                                       00850000
*01* MACRO NAME:  IHARBUP                                               00900000
*                                                                       00950000
*01* EXTERNAL CLASSIFICATION: GUPI                                      01000000
*01* END OF EXTERNAL CLASSIFICATION:                                    01050000
*                                                                       01100000
*01* DSECT NAME:                                                        01150000
*     none                                                              01200000
*                                                                       01250000
*01* COMPONENT:  Supervisor Control (SC1C5)                             01300000
*                                                                       01350000
*01* EYE-CATCHER:  NONE                                                 01400000
*                                                                       01450000
*01* STORAGE ATTRIBUTES:                                                01500000
*02*  SUBPOOL:  n/a                                                     01550000
*02*  KEY:  n/a                                                         01600000
*02*  RESIDENCY:  n/a                                                   01650000
*                                                                       01700000
*01* SIZE:  n/a                                                         01750000
*                                                                       01800000
*01* CREATED BY:                                                        01850000
*     n/a                                                               01900000
*                                                                       01950000
*01* POINTED TO BY:                                                     02000000
*     n/a                                                               02050000
*                                                                       02100000
*01* SERIALIZATION:                                                     02150000
*     None required                                                     02200000
*                                                                       02250000
*01* FUNCTION:                                                          02300000
*02* Return Codes from IEARBUP service                                  02350000
*                                                                       02400000
*01* METHOD OF ACCESS:                                                  02450000
*02*  ASM:                                                              02500000
*      IHARBUP                                                          02550000
*                                                                       02600000
*02*  PL/X:                                                             02650000
*      %INCLUDE SYSLIB(IHARBUP)                                         02700000
*                                                                       02750000
*01* DELETED BY:  n/a                                                   02800000
*                                                                       02850000
*01* FREQUENCY:  n/a                                                    02900000
*                                                                       02950000
*01* DEPENDENCIES:  None                                                03000000
*                                                                       03050000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     03100000
*                                                                       03150000
*01* CHANGE ACTIVITY:                                                   03200000
*   $L0=64BITCBG ,HBB7703 990820 PD00XB:                                03250000
*   $L0=64BITSUP ,HBB7703 990820 PD00XB:                                03300000
*                                                                       03350000
* END OF SPECIFICATIONS *********************************************/  03400000
*% /*                                                                   03405500
.P0      ANOP                                                           03411000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03416500
         AIF   ('&LIST' EQ 'YES').P2                                    03422000
.P1      ANOP                                                           03427500
         PUSH  PRINT                                                    03433000
         PRINT OFF                                                      03438500
.P2      ANOP                                                           03444000
*                                                                       03450000
*   IEARBUP Return and Reason Code definitions                          03450900
*                                                                       03451800
*                                                                       03452700
IEARBUPRC_OK EQU X'00000000' Meaning: Iearbup request successful.       03453600
IEARBUPRC_INVPARM EQU X'00000008' Meaning: Iearbup request specifies   *03454500
                         invalid parameters. Action: Refer to the      *03455400
                         action provided with the specific reason      *03456300
                         code.                                          03457200
IEARBUPRSNBADVERSION EQU X'00000801' Meaning: The version field in the *03458100
                         parameter list is not valid. Action: Check    *03459000
                         for possible storage overlay.                  03459900
IEARBUPRSNBADAMODEFIELD EQU X'00000802' Meaning: The amode field in    *03460800
                         the parameter list is not valid. Action:      *03461700
                         Check for possible storage overlay.            03462600
IEARBUPRSNBADADDRESS EQU X'00000803' Meaning: The address provided is  *03463500
                         not valid. Action: Only provide an            *03464400
                         instruction address that is less than         *03465300
                         X'80000000'.                                   03466200
IEARBUPRC_ENV EQU X'0000000C' Meaning: Environmental error Action:     *03467100
                         Refer to the action provided with the         *03468000
                         specific reason code.                          03468900
IEARBUPRSNPREVRBNOTFOUND EQU X'00000C01' Meaning: RB=PREV was          *03469800
                         requested, but there is only one RB for the   *03470700
                         current task. Action: Use RB=CURRENT when     *03471600
                         there is only one RB.                          03472500
IEARBUPRSNBADAMODE EQU X'00000C02' Meaning: AMODE=64 was specified but *03473400
                         the architecture level is not ESAME. Action:  *03474300
                         Only request AMODE=64 when the architecture   *03475200
                         level is ESAME.                                03476100
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 03477000
         AIF   ('&LIST' EQ 'YES').P4                                    03477900
.P3      ANOP                                                           03478800
         POP   PRINT                                                    03479700
.P4      ANOP                                                           03480600
.P_EXIT  ANOP                                                           03481500
         MEND                                                           03482400
**/ IHARBUP_2:;                                                         03483300
* %IHARBUP_INCLUDED = 'YES';                                            03484200
* %DCL ZCBPRINT CHAR EXT;                                               03485100
* %DEACTIVATE ZCBPRINT;                                                 03486000
* %DCL IHARBUP_LIST CHAR EXT;                                           03486900
* %DEACTIVATE IHARBUP_LIST;                                             03487800
* %IF IHARBUP_LIST ^= 'NO' &                                            03488700
*    ZCBPRINT ^= 'NO' %THEN                                             03489600
*   %GOTO IHARBUP_3;                                                    03490500
*   @LIST PUSH NOECHO;                                                  03491400
*   @LIST NOASSEMBLE NOECHO;                                            03492300
*   @LIST OFF C NOECHO;                                                 03493200
* %IHARBUP_3:;                                                          03494100
*/* Start of PL/X Source                                             */ 03495000
*                                                                       03495900
*/* IEARBUP Return and Reason Code definitions                       */ 03500000
*DCL IearbupRc_OK BIT(32) Constant('00000000'X) ; /*                    03550000
*                        Meaning: Iearbup request successful.           03600000
*                                                                    */ 03650000
*DCL IearbupRc_InvParm BIT(32) Constant('00000008'X) ; /*               03700000
*                        Meaning: Iearbup request specifies invalid     03750000
*                        parameters.                                    03800000
*                        Action: Refer to the action provided with the  03850000
*                        specific reason code.                       */ 03900000
*DCL IearbupRsnBadVersion BIT(32) Constant('00000801'X) ; /*            03950000
*                        Meaning: The version field in the parameter    04000000
*                        list is not valid.                             04050000
*                        Action: Check for possible storage overlay. */ 04100000
*DCL IearbupRsnBadAMODEField BIT(32) Constant('00000802'X) ; /*         04150000
*                        Meaning: The amode field in the parameter list 04200000
*                        is not valid.                                  04250000
*                        Action: Check for possible storage overlay. */ 04300000
*DCL IearbupRsnBadAddress BIT(32) Constant('00000803'X) ; /*            04350000
*                        Meaning: The address provided is not valid.    04400000
*                        Action: Only provide an instruction address    04450000
*                        that is less than X'80000000'.              */ 04500000
*DCL IearbupRc_Env BIT(32) Constant('0000000C'X) ; /*                   04550000
*                        Meaning: Environmental error                   04600000
*                        Action: Refer to the action provided with the  04650000
*                        specific reason code.                       */ 04700000
*DCL IearbupRsnPrevRBNotFound BIT(32) Constant('00000C01'X) ; /*        04750000
*                        Meaning: RB=PREV was requested, but there is   04800000
*                        only one RB for the current task.              04850000
*                        Action: Use RB=CURRENT when there is only one  04900000
*                        RB.                                         */ 04950000
*DCL IearbupRsnBadAMODE BIT(32) Constant('00000C02'X) ; /*              04958300
*                        Meaning: AMODE=64 was specified but the        04966600
*                        architecture level is not ESAME.               04974900
*                        Action: Only request AMODE=64 when the         04983200
*                        architecture level is ESAME.                */ 04991500
*/* End of IEARBUP Return and Reason Code definitions                */ 05000000
* @LOGIC;                                                               05050000
* #PRAGMA TOOL=CBGEN.                                                   05100000
* #USEORG.                                                              05150000
* #EPRAGMA.                                                             05200000
* @ENDLOGIC;                                                            05250000
*/* End of PL/X Source                                               */ 05300000
* %IF IHARBUP_LIST ^= 'NO' &                                            05350000
*    ZCBPRINT ^= 'NO' %THEN                                             05400000
*   %GOTO IHARBUP_4;                                                    05450000
*   @LIST POP NOECHO;                                                   05500000
* %IHARBUP_4:;                                                          05550000
* %END;                                                                 05600000
