*%GOTO  SCCB0;                     /*  BILINGUAL MAPPING                00050000
         MACRO                                                          00100000
         IHASCCB &SCCBLEN=4096                                       */ 00150000
*%SCCB0: ;                                                              00200000
*/** START OF SPECIFICATIONS ****************************************** 00250000
*                                                                       00300000
*01* DESCRIPTIVE NAME:                                                  00450000
*                                                                       00500000
*      SERVICE CALL CONTROL BLOCK (SCCB)                                00550000
*                                                                       00600000
*02* ACRONYM:    SCCB                                                   00606600
*                                                                       00613200
*01* EXTERNAL CLASSIFICATION:                                           00615800
*02*         NOTPI:BASE                                           @P3C  00618400
*02*         PI:  FIELDS                                                00621000
*                  SCCBETF                                        @L6A  00623000
*                  SCCBETOD                                       @L4C  00625000
*                  SCCBFSDM                                       @P4A  00625200
*                  SCCBIR                                         @L5A  00625500
*                  SCCBPLO                                        @02C  00625600
*                  SCCBRP                                         @P4A  00625700
*                  SCCBSTSI                                       @03A  00625800
*                  SCCBUNIC                                       @L6A  00626000
*01* END OF EXTERNAL CLASSIFICATION:                                    00626400
*                                                                       00633000
*01* MACRO NAME: IHASCCB                                                00639600
*                                                                       00646200
*01* DSECT NAMES: SCCB, SCCBCP, SCCBHSA, SCCBMPF                  @T5C  00652800
*                                                                       00659400
*01* COMPONENT: SERVICE PROCESSOR INTERFACE (SCSPI)                     00666000
*                                                                       00672600
*01* EYE-CATCHER: NONE                                                  00679200
*02* OFFSET:      N/A                                                   00685800
*02* LENGTH:      N/A                                                   00692400
*                                                                       00700000
*01* COPYRIGHT:                                                         00750000
*                                                                       00775000
*      5647-A01                                                         00812500
*      THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                     00850000
*      (C) COPYRIGHT IBM CORP. 1984, 2000                               00900000
*      LICENSED MATERIALS - PROPERTY OF IBM                             01000000
*                                                                       01150000
*01* STATUS: HBB7703                                                    01200000
*                                                                       01250000
*01* FUNCTION:                                                          01300000
*                                                                       01350000
*      MAPS THE COMMON FIELDS OF THE SCCB FOR ALL SERVICE               01400000
*      PROCESSOR COMMANDS AND THE DATA AREA RETURNED FROM               01450000
*      THE SERVICE PROCESSOR ARCHITECTURE COMMAND READ SCP INFO.        01500000
**/                                                                     01550000
*@EJECT;                                                                01600000
*/*                                                                     01650000
*01* METHOD OF ACCESS:                                                  01750000
*                                                                       01800000
*      BAL  -  INCLUDE THE IHASCCB MAPPING MACRO.                       01850000
*              PRODUCES DSECTS SCCB, SCCBCP, SCCBHSA.                   01900000
*              SCCBCP ARRAY BEGINS AT ADDR(SCCB)+SCCBOCP.               01950000
*              SCCBHSA ARRAY BEGINS AT ADDR(SCCB)+SCCBOHSA.             02000000
*              SCCBMPF ARRAY BEGINS AT ADDR(SCCB)+SCCBMPFO.             02025000
*                                                                       02050000
*           -  SET MACRO VARIABLE SCCBLEN FOR AN ALTERNATE              02100000
*              LENGTH FOR SCCB STRUCTURE.                               02150000
*              DEFAULT IS 4096, MINIMUM SUPPORTED BY THE                02200000
*              SERVICE PROCESSOR ARCHITECTURE IS 8.                     02250000
*                                                                       02300000
*      PL/S -  INCLUDE CVT AND IHASCCB MAPPING MACROS FOR DEFAULT       02350000
*              SCCB AND SCP INFO COMMAND DATA ADDRESSABILITY.           02400000
*              PRODUCES BASED STRUCTURES SCCB, SCCBCP, SCCBHSA,         02433300
*              SCCBMPF.                                                 02466600
*              DEFAULT SCCB BASE CVTSCPIN IS DECLARED BY CVT.           02500000
*              SCCBCP ARRAY BEGINS AT ADDR(SCCB)+SCCBOCP.               02550000
*              SCCBHSA ARRAY BEGINS AT ADDR(SCCB)+SCCBOHSA.             02600000
*              SCCBMPF ARRAY BEGINS AT ADDR(SCCB)+SCCBMPFO.             02625000
*                                                                       02650000
*           -  SET MACRO VARIABLE %SCCBBASE FOR AN ALTERNATE            02700000
*              BASE FOR SCCB STRUCTURE.                                 02750000
*                                                                       02800000
*           -  SET MACRO VARIABLE %SCCBLEN FOR AN ALTERNATE             02850000
*              LENGTH FOR SCCB STRUCTURE.                               02900000
*              DEFAULT IS 4096, MINIMUM SUPPORTED BY THE                02950000
*              SERVICE PROCESSOR ARCHITECTURE IS 8.                     03000000
*                                                                       03050000
*01* CREATED BY:                                                        03100000
*                                                                       03150000
*      ANYONE WHO COMMUNICATES WITH THE SERVICE PROCESSOR.              03200000
*                                                                       03500000
*01* USED BY:                                                           03550000
*                                                                       03600000
*      ANYONE WHO COMMUNICATES WITH THE SERVICE PROCESSOR.              03650000
*                                                                       03700000
*      ANYONE WHO ACCESSES THE SYSTEM COPY OF SCP INFO POINTED          03750000
*      TO BY THE FIELD CVTSCPIN.                                        03800000
*                                                                       03850000
*01* DELETED BY:                                                        03950000
*                                                                       04000000
*      ANYONE WHO COMMUNICATES WITH THE SERVICE PROCESSOR.              04050000
*                                                                       04100000
*      THE BLOCK POINTED TO BY THE CVTSCPIN FIELD IS NEVER DELETED      04150000
*      FOR THE LIFE OF THE IPL.                                         04200000
**/                                                                     04300000
*@EJECT;                                                                04350000
*/*                                                                     04400000
*01* POINTED TO BY:                                                     04500000
*                                                                       04550000
*      CALLER'S POINTER, OR CVTSCPIN.                                   04600000
*                                                                       04650000
*01* STORAGE ATTRIBUTES:                                                04700000
*                                                                       04750000
*02*   ALLOCATION METHOD:                                               04800000
*                                                                       04850000
*        GETMAIN.                                                       04900000
*                                                                       04950000
*02*   SUBPOOL:                                                         05000000
*                                                                       05050000
*        CALLER'S SUBPOOL - CALLER'S AREA.                              05100000
*        245              - CVTSCPIN AREA.                              05150000
*                                                                       05200000
*02*   KEY:                                                             05250000
*                                                                       05300000
*        CALLER'S KEY - CALLER'S AREA.                                  05350000
*        0            - CVTSCPIN AREA.                                  05400000
*                                                                       05450000
*02*   FREQUENCY:                                                       05500000
*        ONE FOR THE LIFE OF THE SYSTEM.                                05550000
*        ONE FOR EACH ROUTINE THAT COMMUNICATES WITH THE                05600000
*          SERVICE PROCESSOR.                                           05650000
*                                                                       05662500
*01* SIZE: 4096 BYTES (DEFAULT). IF SCCBLEN IS SPECIFIED THEN SIZE      05675000
*          CAN BE 8 TO 4096 BYTES.                                      05687500
*                                                                       05700000
*01* SERIALIZATION:                                                     05750000
*                                                                       05800000
*      NOT APPLICABLE.                                                  05850000
*                                                                       05900000
*01* DISTRIBUTION LIBRARY:                                              05950000
*                                                                       06000000
*      AMACLIB.                                                         06050000
**/                                                                     06150000
*@EJECT;                                                                06200000
*/*                                                                     06250000
*01* CHANGE ACTIVITY:                                                   06350000
*                                                                       06400000
* FLAG REASON   RELEASE DATE   ORIGIN                                   06450000
*                                                                       06500000
* $H0= SERVPROC JBB2133 830408 PDD5: SERVICE PROCESSOR             @H0A 06550000
*                                    ARCHITECTURE SUPPORT.         @H0A 06600000
* $D1= DCRR0049 JBB2133 840214 PDXU: ARCHITECTURE SUPPORT.         @D1A 06650000
* $T1= ZA91846  JBB2133 850123 PDR7: OZ91846 SYSTEM CONSOLE        @T1A 06666600
*                                    COMMUNICATION SUPPORT         @T1A 06683200
* $H1= VF       JBB2214 840502 PDD5: VECTOR FEATURE.               @H1A 06700000
* $D2= DCRR0017 JBB2214 841012 PDXU: ARCHITECTURE SUPPORT.         @D2A 06750000
* $H2= RG       JBB2217 850827 PDF7: 3090 MODEL 400 SUPPORT.       @H2A 06800000
* $H3= ESE      JBB2217 850827 PDF7: EXTENDED STORAGE ELEMENT      @H3A 06850000
*                                    RECONFIGURATION.              @H3A 06900000
* OZ97796 - REMOVE '*' FROM COLUMN 72 OF 'START OF                      06907200
*           SPECIFICATIONS' LINE.                              @ZA97796 06914400
* $T2= OY11017  JBB2217 870701 PDR7: BFY SUPPORT.                  @T2A 06921800
* $L1= DATASPAC HBB3310 860707 PDF7: DATA SPACES SUPPORT.          @L1A 06925000
* $01= OY24911  HBB3310 900212 PDHC: SYSPLEX SHARED DASD           @01A 06927000
* $H4= PER02    JBB4410 870316 PDR7: PER 2 SUPPORT.                @H4A 06929000
* $H5= CNITG    HBB4410 881024 PDR7: Console Integration.          @H5A 06931200
* $L2= MACRO    JBB3313 881028 PDAF: Macro Library Support         @L1A 06932500
*                                    Ship for IDS updates          @L1A 06933800
* $H6= CLOCK    HBB4410 890612 PDDN: ETR support.                  @H6A 06935100
* $H7= DIOPL    HBB4410 890918 PDDN: Dynamic IO support            @H7A 06936400
* $H8= CNITG    HBB4410 900504 PDDN: Console Integration           @H8A 06937700
*      OY31631  DECLARE BIT X'40' OF THE INSTALLED FACILITIES  @YA31631 06939000
*               MAP (SCCBIFM1) AS SCCBCHPS THE INSTALLED       @YA31631 06940300
*               CHANNEL PATH SUBSYSTEM COMMAND WORD RETURNED   @YA31631 06941600
*               BY THE HARDWARE.  THIS BIT CORRESPONDS WITH    @YA31631 06942900
*               THE READ CHANNEL PATH SUBSYSTEM COMMAND WORD   @YA31631 06944200
*               (SPCSCHPS) ADDITION TO IEEMSPCS.  THESE        @YA31631 06945500
*               CHANGES ARE IN SUPPORT OF IOS APAR OY31640.    @YA31631 06946800
* $H9= OY27049  JBB3313 890313 PDU6: CRYPTO SUPPORT.               @H9A 06948100
* $P1= PH30826  HBB4420 910118 PDDN: Restore deleted CI code.      @P1A 06948500
* $T4= OY41836  HBB3310 910419 PDHC: ALTERNATE PROCESSOR RETRY     @T4A 06948900
* $HA= CAPTU    HBB5520 931207 PDMB: Captured Storage              @HAA 06949400
* $P2= PN70556  HBB5520 940506 PDMB: Make macro SHOWHDR compliant  @P2A 06949700
* $P3= PN70746  HBB5520 940527 PDMB: Change NONE to DMTI           @P3A 06949800
* $T5= OW13625  JBB3313 950615 PDHC: MPF support. 2.2.0 is OW13629 @T5A 06949900
* $D3= CKSUM    HBB6603 960321 PDHC: CheckSum support              @D3A 06966600
* $02= OW29484  HBB6603 970923 PDHC: PLO support                   @02A 06974900
* $L3= IEEESPI  HBB6606 971006 PD00XB: BFP support                      06979100
* $L4= STCKE    HBB6608 981015 PDHC: Extended TOD-clock support.   @L4A 06980500
* $03= OW37268  HBB6601 990315 PDHC: STSI support.                 @03A 06981900
* $L5=64BITSPI  HBB7703 981204 PD00XB: ESAME                       @L5A 06982600
* $L6=UNICOSPI  HBB7703 990809 PD00XB: UNICODE                     @L6A 06982900
* $P4= PXD0384  HBB7703 990831 PDHC: PCF and RP support            @P4A 06983100
* $P5= PXD0449  HBB7703 990917 PDHC: Remove PCF.  Define FAST           06988000
*                                    SYNCHRONOUS DATA MOVER.       @P5A 06993000
* $04= OW45011  HBB6606 000630 PDHC: Read Expanded Storage Usability    06994000
*                                    Bit Map Extended.             @04A 06995000
*                                                                       06996300
**** END OF SPECIFICATIONS *******************************************/ 07000000
*%GOTO SCCB1;  /*                                                       07050000
*                                                                       07100000
*        SERVICE CALL CONTROL BLOCK MAPPING FOR ALL                     07150000
*        SERVICE PROCESSOR ARCHITECTURE COMMANDS.                       07200000
*                                                                       07250000
SCCB     DSECT               SERVICE CALL CONTROL BLOCK.                07300000
SCCBHEAD DS    0CL8          SERVICE CALL CONTROL BLOCK HEADER.         07350000
SCCBLNG  DS    H             LENGTH OF THE ENTIRE SCCB                  07400000
*                            (MAXIMUM 4096).                            07450000
SCCBFLAG DS    CL1           CALLER FLAGS. COMMAND DEPENDENT.           07500000
SCCBR003 DS    CL3           RESERVED.                                  07550000
SCCBRESP DS    0CL2          SERVICE PROCESSOR RESPONSE.           @H2A 07600000
SCCBRSP  DS    0H            SERVICE PROCESSOR RESPONSE.                07650000
SCCBREAS DS    XL1           SERVICE PROCESSOR REASON CODE.             07700000
SCCBRCC  DS    XL1           SERVICE PROCESSOR RESPONSE CLASS CODE.     07750000
SCCBCMDD DS    CL(&SCCBLEN-L'SCCBHEAD) VARIABLE LENGTH COMMAND          07800000
*                            DEPENDENT DATA.                            07850000
SCCBEND  DS    0D            END OF SCCB.                               07900000
         EJECT                                                          07950000
*                                                                       08000000
*        COMMAND DEPENDENT DATA FROM                                    08050000
*        READ SCP INFO COMMAND.                                         08100000
*                                                                       08150000
         ORG   SCCBCMDD                                                 08200000
SCCBSCPI DS    0F            MAPPING OF SCCB COMMAND DEPENDENT DATA     08250000
*                            FIELD, SCCBCMDD, FOR SERVICE PROCESSOR     08300000
*                            COMMAND READ SCP INFO.                     08350000
SCCBSAR  DS    XL2           REAL STORAGE ADDRESS RANGE. MAXIMUM        08400000
*                            STORAGE INCREMENT NUMBER INSTALLED.        08450000
SCCBSAI  DS    XL1           REAL STORAGE ADDRESS INCREMENT, IN UNITS   08500000
*                            OF 1M. When 0, value is in SCCBSAIX.  @L5C 08569990
SCCBSBS  DS    XL1           REAL STORAGE BLOCK SIZE IN UNITS OF 1K.    08600000
SCCBSII  DS    XL2           REAL STORAGE INCREMENT                     08650000
*                            BLOCK INTERLEAVE INTERVAL.                 08700000
SCCBR00E DS    CL2           RESERVED.                                  08750000
SCCBNCPS DS    H             NUMBER OF CPUS INSTALLED.                  08800000
SCCBOCP  DS    H             SCCB OFFSET TO CPU DATA ARRAY              08850000
*                            MAPPED BY SCCBCP.                          08900000
SCCBNHSA DS    H             NUMBER OF HSAS.                            08950000
SCCBOHSA DS    H             SCCB OFFSET TO HSA DATA ARRAY              09000000
*                            MAPPED BY SCCBHSA.                         09050000
SCCBPARM DS    CL8           LOAD PARAMETER INFORMATION FROM            09100000
*                            SERVICE PROCESSOR.                         09150000
SCCBMESI DS    F             EXTENDED STORAGE ADDRESS RANGE.            09200000
*                            MAXIMUM EXTENDED STORAGE INCREMENT         09250000
*                            NUMBER INSTALLED.                          09300000
SCCBNXSB DS    F             NUMBER OF 4K STORAGE BLOCKS IN AN          09350000
*                            EXTENDED STORAGE INCREMENT.                09400000
SCCBMESE DS    H             MAXIMUM EXTENDED STORAGE ELEMENT      @H3A 09450000
*                            NUMBER INSTALLED.                     @H3A 09500000
SCCBR02A DS    CL2           RESERVED.                             @H3C 09550000
SCCBVPRM DS    0F            VECTOR PARAMETERS.                    @D2A 09600000
SCCBVSS  DS    H             VECTOR SECTION SIZE.                  @D2A 09650000
SCCBVPSM DS    H             VECTOR PARTIAL SUM NUMBER.            @D2A 09700000
SCCBIFM  DS    0CL8          INSTALLED FACILITY MAP.               @D1A 09750000
SCCBIFM1 DS    CL1           INSTALLED FACILITY MAP BYTE 1.        @D1A 09800000
SCCBCHPI EQU   X'80'         CHANNEL PATH INFORMATION INSTALLED.   @D1A 09850000
SCCBCHPS EQU   X'40'         CHANNEL PATH SUBSYSTEM COMMAND    @YA31631 09866600
*                            INSTALLED.                        @YA31631 09883200
SCCBCHPR EQU   X'20'         CHANNEL PATH RECONFIGURATION          @D1A 09900000
*                            INSTALLED.                            @D1A 09950000
SCCBCPUI EQU   X'08'         CPU INFORMATION INSTALLED.            @D1A 10000000
SCCBCPUR EQU   X'04'         CPU RECONFIGURATION INSTALLED.        @D1A 10050000
SCCBIFM2 DS    CL1           INSTALLED FACILITY MAP BYTE 2.        @D1A 10100000
SCCBSGNL EQU   X'80'         SIGNAL ALARM INSTALLED.               @D1A 10150000
SCCBOMR  EQU   X'40'         WRITE OPERATOR MESSAGE AND READ       @T1A 10166600
*                            OPERATOR RESPONSE INSTALLED.          @T1A 10183200
SCCBSTST EQU   X'20'         STORE STATUS ON LOAD INSTALLED.       @D1A 10200000
SCCBRSTR EQU   X'10'         RESTART REASONS INSTALLED.            @D1A 10250000
SCCBITRC EQU   X'08'         INSTRUCTION ADDRESS TRACE BUFFER      @D1A 10300000
*                            INSTALLED.                            @D1A 10350000
SCCBLPRM EQU   X'04'         LOAD PARAMETER INSTALLED.             @D1A 10400000
SCCBWDAT EQU   X'02'         READ AND WRITE DATA INSTALLED.        @D1A 10450000
SCCBIFM3 DS    CL1           INSTALLED FACILITY MAP BYTE 3.        @D1A 10500000
SCCBSIR  EQU   X'80'         REAL STORAGE INCREMENT                @D1A 10550000
*                            RECONFIGURATION INSTALLED.            @D1A 10600000
SCCBSEI  EQU   X'40'         REAL STORAGE ELEMENT INFORMATION      @D1A 10650000
*                            INSTALLED.                            @D1A 10700000
SCCBSER  EQU   X'20'         REAL STORAGE ELEMENT RECONFIGURATION  @D1A 10750000
*                            INSTALLED.                            @D1A 10800000
SCCBCARS EQU   X'10'         COPY AND REASSIGN STORAGE INSTALLED.  @D1A 10850000
SCCBESUM EQU   X'08'         EXTENDED STORAGE USABILITY MAP        @D1A 10900000
*                            INSTALLED.                            @D1A 10950000
SCCBESEI EQU   X'04'         EXTENDED STORAGE ELEMENT INFORMATION  @D1A 11000000
*                            INSTALLED.                            @D1A 11050000
SCCBESER EQU   X'02'         EXTENDED STORAGE ELEMENT              @D1A 11100000
*                            RECONFIGURATION INSTALLED.            @D1A 11150000
SCCBCARL EQU   X'01'         COPY AND REASSIGN STORAGE LIST        @H8A 11166600
*                            INSTALLED                             @H8A 11183200
SCCBIFM4 DS    CL1           INSTALLED FACILITY MAP BYTE 4         @H1C 11200000
SCCBVFR  EQU   X'80'         VECTOR FEATURE RECONFIGURATION        @H1A 11250000
*                            INSTALLED.                            @H1A 11300000
SCCBEVNT EQU   X'40'         READ / WRITE EVENT FEATURE            @P1A 11316600
*                            INSTALLED.                            @P1A 11333200
SCCBESUE EQU   X'20'         EXPANDED-STORAGE-USABILITY BIT MAP    @04A 11338200
*                            EXTENDED IS INSTALLED.                @04A 11343200
SCCBRRGI EQU   X'08'         READ RESOURCE GROUP INFORMATION       @H2A 11350000
*                            INSTALLED.                            @H2A 11400000
SCCBIFM5 DS    CL4           INSTALLED FACILITY MAP BYTES 5-8.     @H1A 11450000
SCCBR038 DS    CL8           RESERVED.                             @H2C 11500000
SCCBMRGI DS    XL2           MAXIMUM RESOURCE GROUP INSTALLED.     @H2A 11550000
SCCBR042 DS    CL6           RESERVED.                             @T5C 11555000
SCCBMPFE DS    XL2           NUMBER OF ENTRIES.                    @T5A 11560000
SCCBMPFO DS    XL2           OFFSET.                               @T5A 11565000
SCCBR04C DS    CL4           RESERVED.                             @T5C 11570000
SCCBCONF DS    0CL6          CONFIGURATION CHARACTERISTICS.        @T2A 11575000
SCCBCON1 DS    CL1           BITS 0-7 OF CONFIGURATION             @T2A 11587500
*                            CHARACTERISTICS.                      @T2A 11600000
SCCBBFY  EQU   X'80'         CONFIGURATION IS RUNNING UNDER BFY.   @T2A 11612500
SCCBSOPF EQU   X'20'         SUPPRESSION ON PROTECTION FACILITY    @HAA 11613500
SCCBIRIN EQU   X'10'         INITIATE RESET INSTALLED              @01A 11614500
SCCBCSCF EQU   X'08'         STORE CHANNEL SUBSYSTEM CHARACTERISTICS    11616600
*                            FACILITY IS INSTALLED                 @H7A 11620700
SCCBFSDM EQU   X'01'         Fast synchronous data mover           @P5A 11621200
SCCBCON2 DS    CL1           BITS 8-15 OF CONFIGURATION            @T4C 11621700
*                            CHARACTERISTICS                       @T4C 11622700
SCCBCSLO EQU   X'40'         CSLO IS INSTALLED                     @T4A 11624700
SCCBCON3 DS    CL1           BITS 16-23 OF CONFIGURATION           @D3A 11625200
*                            CHARACTERISTICS. (BYTE 82 OF SCCB).   @D3A 11625700
SCCBDAOM EQU   X'40'         DEVICE-ACTIVE-ONLY MEASUREMENT        @D3A 11626200
*                            FACILITY IS INSTALLED                 @D3A 11626700
SCCBCKSM EQU   X'01'         CHECKSUM INSTRUCTION IS INSTALLED     @D3A 11627200
SCCBCON4 DS    CL1           BITS 24-31 OF CONFIGURATION           @02A 11627400
*                            CHARACTERISTICS. (BYTE 83 OF SCCB).   @02A 11627600
SCCBRP   EQU   X'80'         RESUME PROGRAM IS INSTALLED           @P4A 11627700
SCCBPLO  EQU   X'40'         PERFORM LOCKED OPERATION IS INSTALLED @02A 11627800
SCCBIR   EQU   X'10'         IMMEDIATE and RELATIVE INSTRUCTIONS   @L5A 11628000
SCCBEL   EQU   X'08'         EXTENDED LENGTH (MVCLE,CLCLE)         @L5A 11628100
SCCBBSA  EQU   X'04'         BSA                                   @L5A 11628200
SCCBBFP  EQU   X'02'         Binary Floating Point is installed    @L3A 11628300
SCCBXLOG EQU   X'01'         Extended logical computation facility @L5A 11628400
SCCBCON5 DS    CL1           BITS 32-39 OF CONFIGURATION           @L4A 11628500
*                            CHARACTERISTICS. (BYTE 84 OF SCCB).   @L4A 11628600
SCCBETOD EQU   X'80'         EXTENDED TOD CLOCK FACILITY INSTALLED @L4A 11628800
SCCBETF  EQU   X'40'         Extended translation facility             *11629000
                             (TRE, CUUTF, CUTFU)                   @L6A 11629200
SCCBLRF  EQU   X'20'         Load-reversed facility                @L5A 11629300
SCCBUNIC EQU   X'10'         Extended translation facility 2           *11629400
                             installed (Unicode -- PKA, UNPKA, PKU,    *11629600
                             UNPKU, TP, MVCLU, CLCLU,                  *11629800
                             TRTT, TRTO, TROT, TROO                @L6A 11630000
SCCBSTSI EQU   X'08'         STORE-SYSTEM-INFO. INST. INSTALLED    @03A 11630200
SCCBCON6 DS    CL1           BYTE 85 OF SCCB.                      @L5A 11630400
SCCBESAM EQU   X'01'         ESAME is installed                    @L5A 11630600
SCCBRCCI DS    XL4           CAPACITY.                             @T5A 11630800
         DS    CL1           RESERVED.                             @T5C 11631000
SCCBCARN DS    XL1           MAXIMUM NUMBER OF COPY AND REASSIGN LIST   11631200
*                            ELEMENTS ALLOWED                      @H8A 11634300
SCCBETR  DS    XL4           ETR-SYNC-CHECK TOLERANCE              @H6A 11637400
         DS    CL3           RESERVED.                             @L5C 11639500
SCCBGSTR DS    1X            Guest real                            @L5A 11641600
SCCBSAIX DS    XL4           Real storage address increment in units   *11643700
                             of 1M. Size is a power of 2.          @L5A 11645800
         DS    CL24          RESERVED.                             @L5C 11647900
SCCBDATA DS    0XL1          DATA ARRAYS.                               11650000
*                                                                       11700000
*        ARRAY OF CPU INFORMATION FROM READ SCP INFO COMMAND.           11750000
*        (SCCBNCPS ENTRIES. ENTRIES BEGIN AT ADDR(SCCB)+SCCBOCP.)       11800000
*                                                                       11850000
SCCBCP   DSECT               CPU INFORMATION ENTRY.                     11900000
SCCBCPA  DS    XL1           CPU ADDRESS.                               11950000
SCCBTOD# DS    XL1           TOD CLOCK NUMBER FOR THIS CPU.             12000000
         DS    CL2           RESERVED.                             @H1C 12050000
SCCBCPFL DS    XL1           CPU CHARACTERISTIC FLAGS BYTE 1.          X12083300
                             (BIT POSITIONS 32-39.)                @H1A 12116600
SCCBVFIN EQU   X'80'         VECTOR FEATURE INSTALLED.             @H1A 12150000
SCCBVFCN EQU   X'40'         VECTOR FEATURE CONNECTED.             @H1A 12200000
SCCBVFSB EQU   X'20'         VECTOR FEATURE IN STANDBY STATE.      @H1A 12250000
SCCBCRIN EQU   X'10'         CRYPTO FEATURE INSTALLED.             @H9A 12260000
SCCBCPF2 DS    XL1           CPU CHARACTERISTIC FLAGS BYTE 2.          X12270000
                             (BIT POSITIONS 40-47.)                @L1A 12290000
SCCBMPSB EQU   X'80'         PRIVATE SPACE BIT IS INSTALLED.       @L1A 12310000
SCCBPER2 EQU   X'01'         PER 2 IS INSTALLED.                   @H4A 12320000
         DS    CL9           RESERVED.                             @L1C 12327500
         DS    XL1           RESERVED.                             @H9A 12335000
SCCBKSID EQU   X'01'         KSU ID OF INSTALLED CRYPTO FEATURE.   @H9A 12342500
*                                                                       12350000
*        ARRAY OF HSA INFORMATION FROM READ SCP INFO COMMAND.           12400000
*        (SCCBNHSA ENTRIES. ENTRIES BEGIN AT ADDR(SCCB)+SCCBOHSA.)      12450000
*                                                                       12500000
SCCBHSA  DSECT               HSA INFORMATION ENTRY.                     12550000
SCCBHSSZ DS    XL2           SIZE OF THIS HSA IN UNITS OF 4K.           12600000
SCCBAHSA DS    XL4           ADDRESS OF THIS HSA.                       12650000
*                                                                       12657100
*        ARRAY OF MPF INFORMATION FROM READ SCP INFO COMMAND.           12664200
*        (SCCBMPFE ENTRIES. ENTRIES BEGIN AT ADDR(SCCB)+SCCBMPFO.)      12671300
*                                                                       12678400
SCCBMPF  DSECT               MPF INFORMATION ARRAY.                @T5A 12685500
SCCBMPFY DS    XL2           MPF INFORMATION ARRAY ENTRY.          @T5A 12692600
         MEND                                                           12700000
*         */                                                            12750000
*%SCCB1:  ;                                                             12800000
*%IF SCCBLEN='' %THEN %SCCBLEN='4096';  %;                              12850000
*%IF SCCBBASE='' %THEN                                                  12900000
*   %SCCBBASE='CVTSCPIN';  %;                                           12950000
*@EJECT;                                                                13000000
*    /* SERVICE CALL CONTROL BLOCK MAPPING FOR ALL                   */ 13050000
*    /* SERVICE PROCESSOR ARCHITECTURE COMMANDS.                     */ 13100000
*   DCL 1 SCCB CHAR(SCCBLEN) BDY(DWORD)                                 13150000
*           BASED(SCCBBASE),       /* SERVICE CALL CONTROL BLOCK.    */ 13200000
*        3  SCCBHEAD,              /* SCCB HEADER.                   */ 13250000
*         5 SCCBLNG FIXED(16),     /* LENGTH OF THE ENTIRE SCCB         13300000
*                                     (MAXIMUM 4096).                */ 13350000
*         5 SCCBFLAG BIT(8),       /* CALLER FLAGS. COMMAND             13400000
*                                     DEPENDENT.                     */ 13450000
*         5 SCCBR003 CHAR(3),      /* RESERVED.                      */ 13500000
*         5 SCCBRESP CHAR(2),      /* SERVICE PROCESSOR RESPONSE.       13550000
*                                                                @H2A*/ 13600000
*           7 SCCBRSP BIT(16),     /* SERVICE PROCESSOR RESPONSE.       13650000
*                                                                @H2C*/ 13700000
*             9 SCCBREAS BIT(8),   /* SERVICE PROCESSOR REASON CODE.    13750000
*                                                                @H2C*/ 13800000
*             9 SCCBRCC  BIT(8),   /* SERVICE PROCESSOR RESPONSE        13850000
*                                     CLASS CODE.                @H2C*/ 13900000
*        3  SCCBCMDD CHAR(SCCBLEN-LENGTH(SCCBHEAD)),/* VARIABLE LENGTH  13950000
*                                     COMMAND DEPENDENT DATA.        */ 14000000
*        3  SCCBEND CHAR(0) BDY(DWORD);/* END OF SCCB.               */ 14050000
*@EJECT;                                                                14100000
*    /* COMMAND DEPENDENT DATA FROM READ SCP INFO COMMAND.           */ 14150000
*    DCL  1 SCCBSCPI DEF(SCCBCMDD),/* MAPPING OF SCCB COMMAND DEPENDENT 14200000
*                                     DATA FIELD, SCCBCMDD, FOR         14250000
*                                     SERVICE PROCESSOR COMMAND         14300000
*                                     READ SCP INFO.                 */ 14350000
*           3 SCCBSAR FIXED(16),   /* REAL STORAGE ADDRESS RANGE.       14400000
*                                     MAXIMUM STORAGE INCREMENT         14450000
*                                     NUMBER INSTALLED.              */ 14500000
*           3 SCCBSAI FIXED(8),    /* REAL STORAGE ADDRESS INCREMENT,   14550000
*                                     IN UNITS OF 1M. WHEN 0,           14583300
*                                     value is in SCCBSAIX       @L5C*/ 14616600
*           3 SCCBSBS FIXED(8),    /* REAL STORAGE BLOCK SIZE IN UNITS  14650000
*                                     OF 1K.                         */ 14700000
*           3 SCCBSII FIXED(16),   /* REAL STORAGE INCREMENT BLOCK      14750000
*                                     INTERLEAVE INTERVAL.           */ 14800000
*           3 SCCBR00E CHAR(2),    /* RESERVED.                      */ 14850000
*           3 SCCBNCPS FIXED(16),  /* NUMBER OF CPUS INSTALLED.      */ 14900000
*           3 SCCBOCP FIXED(16),   /* SCCB OFFSET TO CPU DATA ARRAY     14950000
*                                     MAPPED BY SCCBCP.              */ 15000000
*           3 SCCBNHSA FIXED(16),  /* NUMBER OF HSAS.                */ 15050000
*           3 SCCBOHSA FIXED(16),  /* SCCB OFFSET TO HSA DATA ARRAY     15100000
*                                     MAPPED BY SCCBHSA.             */ 15150000
*           3 SCCBPARM CHAR(8),    /* LOAD PARAMETER INFORMATION FROM   15200000
*                                     SERVICE PROCESSOR.             */ 15250000
*           3 SCCBMESI FIXED(32),  /* EXTENDED STORAGE ADDRESS RANGE.   15300000
*                                     MAXIMUM EXTENDED                  15350000
*                                     STORAGE INCREMENT                 15400000
*                                     NUMBER INSTALLED.              */ 15450000
*           3 SCCBNXSB FIXED(32),  /* NUMBER OF 4K STORAGE BLOCKS IN    15500000
*                                     AN EXTENDED STORAGE INCREMENT     15550000
*                                     (BLOCK SIZE SCCBEBSZ).         */ 15600000
*           3 SCCBMESE FIXED(16),  /* MAXIMUM EXTENDED STORAGE ELEMENT  15650000
*                                     NUMBER INSTALLED.          @H3A*/ 15700000
*           3 SCCBR02A CHAR(2),    /* RESERVED.                  @H3C*/ 15750000
*           3 SCCBVPRM FIXED(32),  /* VECTOR PARAMETERS.         @D2A*/ 15800000
*             5 SCCBVSS  FIXED(16),/* VECTOR SECTION SIZE.       @D2A*/ 15850000
*             5 SCCBVPSM FIXED(16),/* VECTOR PARTIAL SUM NUMBER. @D2A*/ 15900000
*@EJECT;                                                                15950000
*           3 SCCBIFM CHAR(8),     /* INSTALLED FACILITY MAP.    @D1A*/ 16000000
*            5 SCCBIFM1 CHAR(1),   /* INSTALLED FACILITY MAP            16050000
*                                     BYTE 1.                    @D1A*/ 16100000
*             7 SCCBCHPI BIT(1),   /* CHANNEL PATH INFORMATION          16150000
*                                     INSTALLED.                 @D1A*/ 16200000
*             7 SCCBCHPS BIT(1),   /* CHANNEL PATH SUBSYSTEM COMMAND    16233300
*                                     INSTALLED.             @YA31631*/ 16266600
*             7 SCCBCHPR BIT(1),   /* CHANNEL PATH RECONFIGURATION      16300000
*                                     INSTALLED.                 @D1A*/ 16350000
*             7 *        BIT(1),   /* RESERVED.                  @D1A*/ 16400000
*             7 SCCBCPUI BIT(1),   /* CPU INFORMATION                   16450000
*                                     INSTALLED.                 @D1A*/ 16500000
*             7 SCCBCPUR BIT(1),   /* CPU RECONFIGURATION               16550000
*                                     INSTALLED.                 @D1A*/ 16600000
*             7 *        BIT(2),   /* RESERVED.                  @D1A*/ 16650000
*            5 SCCBIFM2 CHAR(1),   /* INSTALLED FACILITY MAP            16700000
*                                     BYTE 2.                    @D1A*/ 16750000
*             7 SCCBSGNL BIT(1),   /* SIGNAL ALARM                      16800000
*                                     INSTALLED.                 @D1A*/ 16850000
*             7 SCCBOMR  BIT(1),   /* WRITE OPERATOR MESSAGE AND        16875000
*                                     READ OPERATOR RESPONSE            16900000
*                                     INSTALLED.                 @T1A*/ 16925000
*             7 SCCBSTST BIT(1),   /* STORE STATUS ON LOAD              16950000
*                                     INSTALLED.                 @D1A*/ 17000000
*             7 SCCBRSTR BIT(1),   /* RESTART REASONS                   17050000
*                                     INSTALLED.                 @D1A*/ 17100000
*             7 SCCBITRC BIT(1),   /* INSTRUCTION ADDRESS TRACE BUFFER  17150000
*                                     INSTALLED.                 @D1A*/ 17200000
*             7 SCCBLPRM BIT(1),   /* LOAD PARAMETER                    17250000
*                                     INSTALLED.                 @D1A*/ 17300000
*             7 SCCBWDAT BIT(1),   /* READ AND WRITE DATA               17350000
*                                     INSTALLED.                 @D1A*/ 17400000
*             7 *        BIT(1),   /* RESERVED.                  @D1A*/ 17450000
*            5 SCCBIFM3 CHAR(1),   /* INSTALLED FACILITY MAP            17500000
*                                     BYTE 3.                    @D1A*/ 17550000
*             7 SCCBSIR  BIT(1),   /* REAL STORAGE INCREMENT            17600000
*                                     RECONFIGURATION INSTALLED. @D1A*/ 17650000
*             7 SCCBSEI  BIT(1),   /* REAL STORAGE ELEMENT              17700000
*                                     INFORMATION INSTALLED.     @D1A*/ 17750000
*             7 SCCBSER  BIT(1),   /* REAL STORAGE ELEMENT              17800000
*                                     RECONFIGURATION INSTALLED. @D1A*/ 17850000
*             7 SCCBCARS BIT(1),   /* COPY AND REASSIGN STORAGE         17900000
*                                     INSTALLED.                 @D1A*/ 17950000
*             7 SCCBESUM BIT(1),   /* EXTENDED STORAGE USABILITY MAP    18000000
*                                     INSTALLED.                 @D1A*/ 18050000
*             7 SCCBESEI BIT(1),   /* EXTENDED STORAGE ELEMENT          18100000
*                                     INFORMATION INSTALLED.     @D1A*/ 18150000
*             7 SCCBESER BIT(1),   /* EXTENDED STORAGE ELEMENT          18200000
*                                     RECONFIGURATION INSTALLED. @D1A*/ 18250000
*             7 SCCBCARL BIT(1),   /* COPY AND REASSIGN STORAGE LIST    18283300
*                                     INSTALLED.                 @H8A*/ 18316600
*            5 SCCBIFM4 CHAR(1),   /* INSTALLED FACILITY MAP            18350000
*                                     BYTE 4.                    @H1C*/ 18400000
*             7 SCCBVFR  BIT(1),   /* VECTOR FEATURE                    18450000
*                                     RECONFIGURATION INSTALLED. @H1A*/ 18500000
*             7 SCCBEVNT BIT(1),   /* READ / WRITE EVENT                18525000
*                                     INSTALLED.                 @P1A*/ 18550000
*             7 SCCBESUE BIT(1),   /* EXPANDED-STORAGE-USABILITY BIT    18580990
*                                     MAP EXTENDED IS INSTALLED. @04A*/ 18586980
*             7 *        BIT(1),   /* RESERVED.                  @H2A*/ 18592970
*             7 SCCBRRGI BIT(1),   /* READ RESOURCE GROUP               18600000
*                                     INFORMATION INSTALLED.     @H2A*/ 18650000
*             7 *        BIT(3),   /* RESERVED.                  @H2C*/ 18700000
*            5 SCCBIFM5 CHAR(4),   /* INSTALLED FACILITY MAP            18750000
*                                     BYTES 5-8.                 @H1A*/ 18800000
*           3 SCCBR038 CHAR(8),    /* RESERVED.                  @H2C*/ 18850000
*           3 SCCBMRGI BIT(16),    /* MAXIMUM RESOURCE GROUP INSTALLED. 18900000
*                                                                @H2A*/ 18950000
*           3 SCCBR042 CHAR(6),    /* RESERVED.                  @T5C*/ 18953600
*           3 SCCBMPFE FIXED(16),  /* NUMBER OF ENTRIES.         @T5A*/ 18957200
*           3 SCCBMPFO FIXED(16),  /* OFFSET.                    @T5A*/ 18960800
*           3 SCCBR04C CHAR(4),    /* RESERVED.                  @T5C*/ 18964400
*           3 SCCBCONF CHAR(6),    /* CONFIGURATION                     18968000
*                                     CHARACTERISTICS.           @T2A*/ 18977000
*            5 SCCBCON1 CHAR(1),   /* BITS 0-7 OF CONFIGURATION         18986000
*                                     CHARACTERISTICS.           @T2A*/ 18995000
*             7 SCCBBFY BIT(1),    /* CONFIGURATION IS RUNNING          19004000
*                                     UNDER BFY.                 @H7C*/ 19007600
*             7 * BIT(1),          /* RESERVED.                  @HAC*/ 19009400
*             7 SCCBSOPF BIT(1),   /* SUPPRESSION ON PROTECTION         19011200
*                                     FACILITY                   @HAA*/ 19013000
*             7 SCCBIRIN BIT(1),   /* INITIATE RESET INSTALLED   @01A*/ 19014800
*             7 SCCBCSCF BIT(1),   /* STORE CHANNEL SUBSYSTEM         / 19018400
*                                     CHARACTERISTICS FACILITY IS       19022000
*                                     INSTALLED.                 @H7A*/ 19025000
*             7 * BIT(2),          /* RESERVED.                  @H7C*/ 19026200
*             7 SCCBFSDM BIT(1),   /* Fast synchronous data mover       19027000
*                                                                @P5A*/ 19027800
*            5 SCCBCON2 CHAR(1),   /* BITS 8-15 OF CONFIGURATION        19028700
*                                     CHARACTERISTICS.           @T4C*/ 19029400
*             7 * BIT(1),          /* RESERVED.                  @T4C*/ 19030100
*             7 SCCBCSLO BIT(1),   /* CSLO IS INSTALLED          @T4A*/ 19030800
*             7 * BIT (6),         /* RESERVED.                  @T4C*/ 19031800
*            5 SCCBCON3 CHAR(1),   /* BITS 16-23 OF CONFIGURATION       19032000
*                                     CHARACTERISTICS.                  19032200
*                                     (BYTE 82 OF SCCB).         @D3A*/ 19032400
*             7 * BIT(1),          /* RESERVED.                  @D3A*/ 19032600
*             7 SCCBDAOM BIT(1),   /* DEVICE-ACTIVE-ONLY MEASUREMENT    19032800
*                                     FACILITY IS INSTALLED      @D3A*/ 19033000
*             7 * BIT(5),          /* RESERVED.                  @D3A*/ 19033200
*             7 SCCBCKSM BIT(1),   /* CHECKSUM INSTR. INSTALLED  @D3A*/ 19033400
*            5 SCCBCON4 CHAR(1),   /* BITS 24-31 OF CONFIGURATION       19033500
*                                     CHARACTERISTICS.                  19033600
*                                     (BYTE 83 OF SCCB).         @02A*/ 19033700
*             7 SCCBRP BIT(1),     /* RESUME PROGRAM INSTALLED   @P4A*/ 19033800
*             7 SCCBPLO  BIT(1),   /* PERFORM LOCKED OP. INST.   @02A*/ 19033900
*             7 *       BIT(1),    /* Reserved                   @P5C*/ 19034000
*             7 SCCBIR BIT(1),     /* Immediate and relative     @L5A*/ 19034100
*             7 SCCBEL BIT(1),     /* extended length (MVCLE,           19034200
*                                     CLCLE)                     @L5A*/ 19034300
*             7 SCCBBSA BIT(1),    /* BSA                        @L5A*/ 19034400
*             7 SCCBBFP BIT(1),    /* Binary Floating Point             19034500
*                                     is installed               @L3A*/ 19034700
*             7 SCCBXLOG BIT(1),   /* Extended logical computation      19034800
*                                     facility is installed      @L5A*/ 19034900
*            5 SCCBCON5 CHAR(1),   /* BITS 32-39 OF CONFIGURATION       19035000
*                                     CHARACTERISTICS.                  19035100
*                                     (BYTE 84 OF SCCB).         @L4A*/ 19035200
*             7 SCCBETOD BIT(1),   /* EXTENDED TOD CLOCK FACILITY       19035300
*                                     IS INSTALLED.              @L4A*/ 19035400
*             7 SCCBETF BIT(1),    /* Extended translation facility     19035500
*                                     installed (TRE, CUUTF,            19035600
*                                     CUTFU)                     @L6A*/ 19035700
*             7 SCCBLRF BIT(1),    /* Load-reversed facility     @L5A*/ 19035800
*             7 SCCBUNIC BIT(1),   /* Extended translation facility     19035900
*                                     2 installed (Unicode) (TP,        19036000
*                                     PKA, UNPKA, PKU, UNPKU,           19036100
*                                     MVCLU, CLCLU, TRTT, TRTO,         19036200
*                                     TROT, TROO)                @L6A*/ 19036300
*             7 SCCBSTSI BIT(1),   /* STSI INST. IS INSTALLED.   @03A*/ 19036400
*             7 * BIT(3),          /* RESERVED.                  @L4A*/ 19036500
*            5 SCCBCON6 CHAR(1),   /* BYTE 85                    @L5A*/ 19036600
*             7 * BIT(7),          /* RESERVED.                  @L5A*/ 19036700
*             7 SCCBESAM BIT(1),   /* ESAME is installed         @L5A*/ 19036800
*           3 SCCBRCCI FIXED(32) BDY(HWORD), /* CAPACITY.        @T5A*/ 19036900
*           3 *  CHAR(1),          /* RESERVED.                  @T5C*/ 19037000
*           3 SCCBCARN FIXED(8),   /* NUMBER OF ELEMENTS IN COPY AND    19037200
*                                     REASSIGN LIST              @H8A*/ 19040300
*           3 SCCBETR  BIT(32),    /* ETR-SYNC-CHECK TOLERANCE   @H6A*/ 19043400
*           3 *        CHAR(3),    /* RESERVED.                  @L5C*/ 19044500
*           3 SCCBGSTR FIXED(8),   /* Guest real                 @L5A*/ 19045600
*           3 SCCBSAIX FIXED(32),  /* Real storage address increment    19046700
*                                     in units of 1M. Size is a         19047400
*                                     power of 2.                @L5A*/ 19048100
*           3 *        CHAR(24),   /* RESERVED.                  @L5C*/ 19048900
*           3 SCCBDATA CHAR(*);    /* DATA ARRAYS.                   */ 19050000
*@EJECT;                                                                19100000
*    /* ARRAY OF CPU INFORMATION FROM READ SCP INFO COMMAND.         */ 19150000
*    /* (SCCBNCPS ENTRIES. ENTRIES BEGIN AT ADDR(SCCB)+SCCBOCP.)     */ 19200000
*    DCL 1 SCCBCP BASED,           /* CPU INFORMATION ENTRY.         */ 19250000
*          3 SCCBCPA  FIXED(8),    /* CPU ADDRESS.                   */ 19300000
*          3 SCCBTOD# FIXED(8),    /* TOD CLOCK NUMBER FOR THIS CPU. */ 19350000
*          3 * CHAR(2),            /* RESERVED.                  @H1C*/ 19400000
*          3 SCCBCPFL BIT(8),      /* CPU CHARACTERISTIC FLAGS BYTE 1.  19433300
*                                     (BIT POSITIONS 32-39.)     @H1A*/ 19466600
*            5 SCCBVFIN BIT(1),    /* VECTOR FEATURE INSTALLED.  @H1A*/ 19500000
*            5 SCCBVFCN BIT(1),    /* VECTOR FEATURE CONNECTED.  @H1A*/ 19550000
*            5 SCCBVFSB BIT(1),    /* VECTOR FEATURE                    19600000
*                                     IN STANDBY STATE.          @H1A*/ 19650000
*            5 SCCBCRIN BIT(1),    /* CRYPTO FEATURE INSTALLED.  @H9A*/ 19671400
*            5 * BIT(4),           /* RESERVED.                  @H9C*/ 19692800
*          3 SCCBCPF2 BIT(8),      /* CPU CHARACTERISTIC FLAGS BYTE 2.  19714200
*                                     (BIT POSITIONS 40-47.)     @L1A*/ 19728400
*            5 SCCBMPSB BIT(1),    /* PRIVATE SPACE BIT IS INSTALLED.   19742600
*                                                                @L1A*/ 19756800
*            5 * BIT(6),           /* RESERVED.                  @H4C*/ 19766200
*            5 SCCBPER2 BIT(1),    /* PER 2 INSTALLED.           @H4A*/ 19775600
*          3 * CHAR(9),            /* RESERVED.                  @H9A*/ 19779600
*          3 * CHAR(1),            /* RESERVED.                  @H9A*/ 19783600
*            5 * BIT(7),           /* RESERVED.                  @H9A*/ 19787600
*            5 SCCBKSID BIT(1);    /* KSU ID OF INSTALLED CRYPTO        19791600
*                                     FEATURE.                   @H9A*/ 19795600
*    /* ARRAY OF HSA INFORMATION FROM READ SCP INFO COMMAND.         */ 19800000
*    /* (SCCBNHSA ENTRIES. ENTRIES BEGIN AT ADDR(SCCB)+SCCBOHSA.)    */ 19850000
*    DCL 1 SCCBHSA BASED BDY(WORD,3), /* HSA INFORMATION ENTRY.      */ 19900000
*          3 SCCBHSSZ FIXED(16),   /* SIZE OF THIS HSA IN UNITS OF      19950000
*                                     4K (SCCBHUSZ).                 */ 20000000
*          3 SCCBAHSA PTR(31);     /* ADDRESS OF THIS HSA.           */ 20050000
*@EJECT;                                                                20058300
*    /* ARRAY OF MPF INFORMATION FROM READ SCP INFO COMMAND.         */ 20066600
*    /* (SCCBMPFE ENTRIES. ENTRIES BEGIN AT ADDR(SCCB)+SCCBMPFO.)    */ 20074900
*    DCL 1 SCCBMPF(*) BASED BDY(BYTE),     /* MPF INFO. ARRAY.   @T5A*/ 20083200
*          3 SCCBMPFY FIXED(16) BDY(BYTE); /* MPF INFO. ENTRY.   @T5A*/ 20091500
*    /* SERVICE PROCESSOR ARCHITECTURE AND SUPPORTED CONSTANTS.      */ 20100000
*DCL                                                                    20150000
*SCCB1K   BIT(32) CONSTANT('00000400'X), /* ONE KILOBYTE (1K).       */ 20200000
*SCCB1M   BIT(32) CONSTANT('00100000'X), /* ONE MEGABYTE (1M).       */ 20250000
*SCCBEBSZ BIT(32) CONSTANT('00001000'X), /* EXTENDED STORAGE            20300000
*                                           BLOCK SIZE (4K).         */ 20350000
*SCCBESII FIXED(16) CONSTANT(1),         /* EXTENDED STORAGE            20400000
*                                           INCREMENT BLOCK             20450000
*                                           INTERLEAVE INTERVAL.     */ 20500000
*SCCBFMSZ BIT(32) CONSTANT('00001000'X), /* FRAME SIZE (4K).         */ 20550000
*SCCBHUSZ BIT(32) CONSTANT('00001000'X), /* HSA UNIT SIZE (4K).      */ 20600000
*SCCBMCPU FIXED(16) CONSTANT(16);        /* MAXIMUM NUMBER OF CPUS      20650000
*                                           SUPPORTED.               */ 20700000
