*                                                                       00050000
* %DCL IHASDRMT_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IHASDRMT_INCLUDED;                                        00150000
* %IF IHASDRMT_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 98121. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IHASDRMT &DSECT=YES,&LIST=YES,&TITLE=YES,&SDRMT=YES,          *00443700
               &SDRMT_MODEL=COND,&SDRMT_SYSLIST=COND,                  *00487400
               &SDRMT_GRPLIST=COND,&SDRMT_SDATA=COND,                  *00531100
               &SDRMT_ASIDLST=COND,&SDRMT_STORAGE=COND,                *00574800
               &SDRMT_JOBLIST=COND,&SDRMT_DSPLIST=COND,                *00618500
               &SDRMT_SUBPLST=COND,&SDRMT_KEYLIST=COND,                *00662200
               &SDRMT_COPY=COND                                         00705900
         GBLC  &IHASDRMT_INCLUDED                                       00750000
         GBLC  &ZCBPRINT                                                00800000
&IHASDRMT_INCLUDED SETC 'YES'                                           00850000
         AIF   ('&LIST' EQ 'NONE').P0                                   00866600
         AIF   ('&TITLE' EQ 'NO').P5                                    00883200
 TITLE   'IHASDRMT  - SDUMPX REMOTE keyword information area         '  00900000
.P5      ANOP                                                           00925000
**/ IHASDRMT_1:;                                                        00950000
*/* START OF SPECIFICATIONS ******************************************* 01000000
**/                                                                     01050000
*/*01* PROPRIETARY STATEMENT=                                        */ 01100000
*/***PROPRIETARY_STATEMENT********************************************/ 01150000
*/*  Proprietary Statement =                                         */ 01200000
*/*                                                                  */ 01250000
*/*              LICENSED MATERIALS - PROPERTY OF IBM                */ 01300000
*/*              THIS MACRO IS "RESTRICTED MATERIALS OF IBM"         */ 01350000
*/*              5647-A01 (C) COPYRIGHT IBM CORP 1993,1999           */ 01400000
*/*                                                                  */ 01500000
*/*  Status = JBB6607                                                */ 01550000
*/*                                                              @L2C*/ 01600000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01650000
*/*                                                                     01700000
*01* DESCRIPTIVE NAME:  SDUMPX REMOTE keyword information area          01750000
*02*  ACRONYM:  SDRMT                                                   01800000
*                                                                       01850000
*01* MACRO NAME:  IHASDRMT                                              01900000
*                                                                       01950000
*01* EXTERNAL CLASSIFICATION: GUPI                                      02000000
*01* END OF EXTERNAL CLASSIFICATION:                                    02050000
*                                                                       02100000
*01* DSECT NAME:                                                        02150000
*     SDRMT                                                             02200000
*     SDRMT_MODEL                                                       02250000
*     SDRMT_SYSLIST                                                     02300000
*     SDRMT_GRPLIST                                                     02350000
*     SDRMT_SDATA                                                       02400000
*     SDRMT_ASIDLST                                                     02450000
*     SDRMT_STORAGE                                                     02500000
*     SDRMT_JOBLIST                                                     02550000
*     SDRMT_DSPLIST                                                     02600000
*     SDRMT_SUBPLST                                                     02650000
*     SDRMT_KEYLIST                                                     02700000
*     SDRMT_COPY                                                        02750000
*                                                                       02800000
*01* COMPONENT:  SDUMP (SCDMP)                                     @D1C 02850000
*                                                                       02900000
*01* EYE-CATCHER:  NONE                                                 02950000
*                                                                       03000000
*01* STORAGE ATTRIBUTES:                                                03050000
*02*  SUBPOOL:  Caller-supplied                                         03100000
*02*  KEY:  Caller-supplied                                             03150000
*02*  RESIDENCY:  Caller-supplied                                       03200000
*                                                                       03250000
*01* SIZE:  Variable                                                    03300000
*                SDRMT         -- X'0004' bytes                         03350000
*                SDRMT_MODEL   -- X'0004' bytes                         03400000
*                SDRMT_SYSLIST -- X'0014' bytes                         03450000
*                                 + X'0018' bytes for each entry        03500000
*                                 after the first                       03550000
*                SDRMT_GRPLIST -- X'001C' bytes                         03600000
*                                 + X'0018' bytes for each entry        03650000
*                                 after the first                       03700000
*                SDRMT_SDATA   -- X'000C' bytes                         03750000
*                SDRMT_ASIDLST -- X'0008' bytes                         03800000
*                                 + X'0004' bytes for each entry        03850000
*                                 after the first                       03900000
*                SDRMT_STORAGE -- X'0014' bytes                         03950000
*                                 + X'0010' bytes for each entry        04000000
*                                 after the first                       04050000
*                SDRMT_JOBLIST -- X'000C' bytes                         04100000
*                                 + X'0010' bytes for each entry        04150000
*                                 after the first                       04200000
*                SDRMT_DSPLIST -- X'0014' bytes                         04250000
*                                 + X'0018' bytes for each entry        04300000
*                                 after the first                       04350000
*                SDRMT_SUBPLST -- X'0008' bytes                         04400000
*                                 + X'0004' bytes for each entry        04450000
*                                 after the first                       04500000
*                SDRMT_KEYLIST -- X'0008' bytes                         04550000
*                                 + X'0004' bytes for each entry        04600000
*                                 after the first                       04650000
*                SDRMT_COPY    -- X'0004' bytes                         04700000
*                                                                       04750000
*01* CREATED BY:                                                        04800000
*     Created by Caller and passed as parameter on REMOTE keyword       04850000
*      on SDUMPX                                                        04900000
*                                                                       04950000
*01* POINTED TO BY:                                                     05000000
*     SDUMPX parameter list                                             05050000
*                                                                       05100000
*01* SERIALIZATION:                                                     05150000
*     None required                                                     05200000
*                                                                       05250000
*01* FUNCTION:                                                          05300000
*02* Maps the data passed by the REMOTE keyword.                        05350000
*                                                                       05400000
*01* METHOD OF ACCESS:                                                  05450000
*02*  ASM:                                                              05500000
*      IHASDRMT                                                         05550000
*           DSECT=YES|NO  -- Request DSECT definition                   05600000
*           SDRMT=YES|NO|COND -- Request mapping of parameter           05650000
*                            information                                05700000
*                            USING on SDRMT                             05750000
*           SDRMT_MODEL=YES|NO|COND -- Mapping of model entry           05800000
*           SDRMT_SYSLIST=YES|NO|COND -- Mapping of SYSLIST             05850000
*           SDRMT_GRPLIST=YES|NO|COND -- Mapping of GRPLIST             05900000
*           SDRMT_SDATA=YES|NO|COND -- Mapping of SDATA                 05950000
*           SDRMT_ASIDLST=YES|NO|COND -- Mapping of ASIDLST             06000000
*           SDRMT_STORAGE=YES|NO|COND -- Mapping of STORAGE             06050000
*           SDRMT_JOBLIST=YES|NO|COND -- Mapping of JOBLIST             06100000
*           SDRMT_DSPLIST=YES|NO|COND -- Mapping of DSPLIST             06150000
*           SDRMT_SUBPLST=YES|NO|COND -- Mapping of SUBPLST             06200000
*           SDRMT_KEYLIST=YES|NO|COND -- Mapping of KEYLIST             06250000
*           SDRMT_COPY=YES|NO|COND -- Mapping of COPY'd things          06300000
*     Default: DSECT=YES,SDRMT=YES,                                     06350000
*              SDRMT_MODEL=COND,                                        06400000
*              SDRMT_SYSLIST=COND,                                      06450000
*              SDRMT_GRPLIST=COND,                                      06500000
*              SDRMT_SDATA=COND,                                        06550000
*              SDRMT_ASIDLST=COND,                                      06600000
*              SDRMT_STORAGE=COND,                                      06650000
*              SDRMT_JOBLIST=COND,                                      06700000
*              SDRMT_DSPLIST=COND,                                      06750000
*              SDRMT_SUBPLST=COND,                                      06800000
*              SDRMT_KEYLIST=COND,                                      06850000
*              SDRMT_COPY=COND                                          06900000
*02*  PL/AS:                                                            06950000
*      %INCLUDE SYSLIB(IHASDRMT)                                        07000000
*                                                                       07050000
*01* DELETED BY:  Caller                                                07100000
*                                                                       07150000
*01* FREQUENCY:  Created for input to SDUMP REMOTE=rrrrr                07200000
*                                                                       07250000
*01* DEPENDENCIES:  None                                                07300000
*                                                                       07350000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     07400000
*                                                                       07450000
*01* CHANGE ACTIVITY:                                                   07500000
*   $L0=SDMPECBG ,HBB5510,921217,PD00XB: Remote information             07550000
*   $L1=SDMPE    ,HBB5510,921217,PD00XB: Remote information             07600000
*   $D1=DR20001   HBB6601 950907 PD00KV: Split from SC1CM          @D1A 07625000
*   $L2=TSVCD    ,JBB6607,980413,PD00HT: Tailored SVC Dump         @L2A 07637500
*                                                                       07650000
* END OF SPECIFICATIONS *********************************************/  07700000
*% /*                                                                   07750000
.P0      ANOP                                                           07775000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 07800000
         AIF   ('&LIST' EQ 'YES').P2                                    07850000
.P1      ANOP                                                           07900000
         PUSH  PRINT                                                    07950000
         PRINT OFF                                                      08000000
.P2      ANOP                                                           08050000
         AIF   ('&SDRMT' EQ 'NO').L0002                                 08100000
         AIF   ('&DSECT' EQ 'YES').L0003                                08150000
         AIF   ('&SDRMT' NE 'YES').L0002                                08200000
SDRMT    DS    0F                                                       08250000
         AGO   .L0004                                                   08300000
.L0003   ANOP                                                           08350000
SDRMT    DSECT                                                          08400000
.L0004   ANOP                                                           08450000
SDRMT_LENGTH DS 1FL4     Total length for REMOTE info. Data begins at  *08500000
                         SDRMT_DATA with entries contiguously defined  *08550000
                         from that point.                               08600000
SDRMT_DATA DS  0C        Start of remote data                           08650000
*                                                                       08700000
*    *****************************************************************  08750000
*    *                                                               *  08800000
*    * Constants to identify the DSECT. Note that the constants      *  08850000
*    * ending with "_COPY" should use the SDRMT_COPY DSECT.             08900000
*    *                                                               *  08950000
*    *****************************************************************  09000000
*                                                                       09050000
*                                                                       09100000
SDRMT_IDCON_SYSLIST EQU 4                                               09150000
SDRMT_IDCON_GRPLIST EQU 8                                               09200000
SDRMT_IDCON_SDATA EQU 12                                                09250000
SDRMT_IDCON_SDATA_COPY EQU 13                                           09300000
SDRMT_IDCON_ASIDLST EQU 16                                              09350000
SDRMT_IDCON_ASIDLST_COPY EQU 17 Indicates to copy the ASIDLST used for *09400000
                         this dump.                                     09450000
SDRMT_IDCON_STORAGE EQU 20                                              09500000
SDRMT_IDCON_STORAGE_COPY EQU 21 Indicates to copy the input LISTD      *09550000
                         specification                                  09600000
SDRMT_IDCON_JOBLIST EQU 24                                              09650000
SDRMT_IDCON_JOBLIST_COPY EQU 25                                         09700000
SDRMT_IDCON_DSPLIST EQU 28                                              09750000
SDRMT_IDCON_DSPLIST_COPY EQU 29                                         09800000
SDRMT_IDCON_SUBPLST EQU 32                                              09850000
SDRMT_IDCON_SUBPLST_COPY EQU 33                                         09900000
SDRMT_IDCON_KEYLIST EQU 36                                              09950000
SDRMT_IDCON_KEYLIST_COPY EQU 37                                         10000000
SDRMT_LEN EQU  *-SDRMT                                                  10050000
.L0002   ANOP                                                           10100000
         AIF   ('&SDRMT_MODEL' EQ 'NO').L0005                           10150000
         AIF   ('&DSECT' EQ 'YES').L0006                                10200000
         AIF   ('&SDRMT_MODEL' NE 'YES').L0005                          10250000
SDRMT_MODEL DS 0H                                                       10300000
         AGO   .L0007                                                   10350000
.L0006   ANOP                                                           10400000
SDRMT_MODEL DSECT                                                       10450000
.L0007   ANOP                                                           10500000
SDRMT_MODEL_HEADER DS 1CL0004                                           10550000
         ORG   SDRMT_MODEL_HEADER                                       10600000
SDRMT_MODEL_ID DS 1FL2   Contains the ID of the entry                   10650000
SDRMT_MODEL_LENGTH DS 1FL2 Total length of area including this length  *10700000
                         field and the ID field                         10750000
SDRMT_MODEL_ENTRY DS 0C  Start of data for the entry                    10800000
SDRMT_MODEL_LEN EQU *-SDRMT_MODEL                                       10850000
.L0005   ANOP                                                           10900000
         AIF   ('&SDRMT_SYSLIST' EQ 'NO').L0008                         10950000
         AIF   ('&DSECT' EQ 'YES').L0009                                11000000
         AIF   ('&SDRMT_SYSLIST' NE 'YES').L0008                        11050000
SDRMT_SYSLIST DS 0F                                                     11100000
         AGO   .L000A                                                   11150000
.L0009   ANOP                                                           11200000
SDRMT_SYSLIST DSECT                                                     11250000
.L000A   ANOP                                                           11300000
SDRMT_SYSLIST_HEADER DS 1CL0004                                         11350000
         ORG   SDRMT_SYSLIST_HEADER                                     11400000
SDRMT_SYSLIST_ID DS 1FL2 Use SDRMT_IDCON_SYSLIST to initialize          11450000
SDRMT_SYSLIST_LENGTH DS 1FL2 Total length of area including this       *11500000
                         length field and the ID field                  11550000
SDRMT_SYSLIST_ENTRY DS 1CL0016 This represents an array of             *11600000
                         sysname/jobname or sysname/ASID pairs          11650000
         ORG   SDRMT_SYSLIST_ENTRY                                      11700000
SDRMT_SYSLIST_SYSNAME DS 1CL0008 The system name                        11750000
SDRMT_SYSLIST_JOBNAME_ASID DS 1CL0008 Area that contains either all 0s *11800000
                         (no jobname/ASID), JOBNAME/ID, or ZEROES&ASID  11850000
         ORG   SDRMT_SYSLIST_JOBNAME_ASID                               11900000
SDRMT_SYSLIST_JOBNAME DS 1CL0008 Fill this in, left-justified, padded  *11950000
                         with blanks, if specifying a jobname. The     *12000000
                         entire field should be 0s if neither jobname  *12050000
                         nor ASID is wanted.                            12100000
         ORG   SDRMT_SYSLIST_JOBNAME                                    12150000
SDRMT_SYSLIST_ZEROES DS 1CL0006 Make sure this is zeroes if specifying *12200000
                         an ASID.                                       12250000
SDRMT_SYSLIST_ASID DS 1FL2 Fill this in, zeroing the previous field    *12300000
                         too, if specifying an ASID.                    12350000
SDRMT_SYSLIST_LEN EQU *-SDRMT_SYSLIST                                   12400000
.L0008   ANOP                                                           12450000
         AIF   ('&SDRMT_GRPLIST' EQ 'NO').L000B                         12500000
         AIF   ('&DSECT' EQ 'YES').L000C                                12550000
         AIF   ('&SDRMT_GRPLIST' NE 'YES').L000B                        12600000
SDRMT_GRPLIST DS 0H                                                     12650000
         AGO   .L000D                                                   12700000
.L000C   ANOP                                                           12750000
SDRMT_GRPLIST DSECT                                                     12800000
.L000D   ANOP                                                           12850000
SDRMT_GRPLIST_HEADER DS 1CL0004                                         12900000
         ORG   SDRMT_GRPLIST_HEADER                                     12950000
SDRMT_GRPLIST_ID DS 1FL2 Use SDRMT_IDCON_GRPLIST to initialize          13000000
SDRMT_GRPLIST_LENGTH DS 1FL2 Total length of area including this       *13050000
                         length field and the ID field                  13100000
SDRMT_GRPLIST_ENTRY DS 1CL0024 This represents an array of             *13150000
                         group/member pairs. If all members of the     *13200000
                         group are wanted, use a member name of "*".    13250000
         ORG   SDRMT_GRPLIST_ENTRY                                      13300000
SDRMT_GRPLIST_GRPNAME DS 1CL0008 The group name                         13350000
SDRMT_GRPLIST_MEMNAME DS 1CL0016 The member name                        13400000
SDRMT_GRPLIST_LEN EQU *-SDRMT_GRPLIST                                   13450000
.L000B   ANOP                                                           13500000
         AIF   ('&SDRMT_SDATA' EQ 'NO').L000E                           13550000
         AIF   ('&DSECT' EQ 'YES').L000F                                13600000
         AIF   ('&SDRMT_SDATA' NE 'YES').L000E                          13650000
SDRMT_SDATA DS 0H        This field should be set if the caller has    *13700000
                         indicated SDATA options for the dump.          13750000
         AGO   .L0010                                                   13800000
.L000F   ANOP                                                           13850000
SDRMT_SDATA DSECT        This field should be set if the caller has    *13900000
                         indicated SDATA options for the dump.          13950000
.L0010   ANOP                                                           14000000
SDRMT_SDATA_HEADER DS 1CL0004                                           14050000
         ORG   SDRMT_SDATA_HEADER                                       14100000
SDRMT_SDATA_ID DS 1FL2   Use SDRMT_IDCON_SDATA to initialize            14150000
SDRMT_SDATA_LENGTH DS 1FL2 Total length of area including this length  *14200000
                         field and the ID field                         14250000
SDRMT_SDATA_OPTIONS DS 1CL0008 These are mapped in the same order as   *14300000
                         they appear in the SDUMP parameter list        14350000
         ORG   SDRMT_SDATA_OPTIONS                                      14400000
SDRMT_SDATA_BYTE0 DS 1BL1 This field should be set if the caller has   *14450000
                         indicated SDATA options for the dump.          14500000
         ORG   SDRMT_SDATA_BYTE0                                        14550000
SDRMT_SDATA_ALLPSA EQU X'80' Corresponds to SDUMPX SDATA option ALLPSA  14600000
SDRMT_SDATA_PSA EQU X'40' Corresponds to SDUMPX SDATA option PSA        14650000
SDRMT_SDATA_NUC EQU X'20' Corresponds to SDUMPX SDATA option NUC        14700000
SDRMT_SDATA_SQA EQU X'10' Corresponds to SDUMPX SDATA option SQA        14750000
SDRMT_SDATA_LSQA EQU X'08' Corresponds to SDUMPX SDATA option LSQA      14800000
SDRMT_SDATA_RGN EQU X'04' Corresponds to SDUMPX SDATA option RGN        14850000
SDRMT_SDATA_LPA EQU X'02' Corresponds to SDUMPX SDATA option LPA        14900000
SDRMT_SDATA_TRT EQU X'01' Corresponds to SDUMPX SDATA option TRT        14950000
         ORG   SDRMT_SDATA_BYTE0+X'00000001'                            15000000
SDRMT_SDATA_BYTE1 DS 1BL1 This field should be set if the caller has   *15050000
                         indicated SDATA options for the dump.          15100000
         ORG   SDRMT_SDATA_BYTE1                                        15150000
SDRMT_SDATA_CSA EQU X'80' Corresponds to SDUMPX SDATA option CSA        15200000
SDRMT_SDATA_SWA EQU X'40' Corresponds to SDUMPX SDATA option SWA        15250000
SDRMT_SDATA_SUM EQU X'20' Corresponds to SDUMPX SDATA option SUM        15300000
SDRMT_SDATA_NOALLPSA EQU X'08' Corresponds to SDUMPX SDATA option      *15350000
                         NOALLPSA                                       15400000
SDRMT_SDATA_NOSQA EQU X'04' Corresponds to SDUMPX SDATA option NOSQA    15450000
SDRMT_SDATA_ALLNUC EQU X'02' Corresponds to SDUMPX SDATA option ALLNUC  15500000
SDRMT_SDATA_DEFS EQU X'01' Corresponds to SDUMPX SDATA option DEFS      15550000
         ORG   SDRMT_SDATA_BYTE1+X'00000001'                            15600000
SDRMT_SDATA_BYTE2 DS 1BL1 This field should be set if the caller has   *15650000
                         indicated SDATA options for the dump.          15700000
         ORG   SDRMT_SDATA_BYTE2                                        15750000
SDRMT_SDATA_GRSQ EQU X'80' Corresponds to SDUMPX SDATA option GRSQ      15800000
SDRMT_SDATA_COUPLE EQU X'10' Corresponds to SDUMPX SDATA option COUPLE  15850000
SDRMT_SDATA_XESDATA EQU X'08' Corresponds to SDUMPX SDATA option       *15900000
                         XESDATA                                        15950000
SDRMT_SDATA_WLM EQU X'02' Corresponds to SDUMPX SDATA option WLM        15975000
         ORG   SDRMT_SDATA_BYTE2+X'00000001'                            16000000
SDRMT_SDATA_BYTE3 DS 1BL1 Sdata Byte 3                                  16016600
         ORG   SDRMT_SDATA_BYTE3                                        16033200
SDRMT_SDATA_SERVERS EQU X'20' Corresponds to SDUMPX SDATA option       *16049800
                         SERVERS                                        16066400
         ORG   SDRMT_SDATA_BYTE3+X'00000001'                            16083000
SDRMT_SDATA_BYTE4 DS 1BL1 Sdata Byte 4                                  16100000
         ORG   SDRMT_SDATA_BYTE4                                        16150000
SDRMT_SDATA_NODEFS EQU X'80' Corresponds to SDUMPX SDATA option NODEFS  16200000
SDRMT_SDATA_IO EQU X'40' Corresponds to SDUMPX SDATA option IO          16250000
         ORG   SDRMT_SDATA_BYTE4+X'00000001'                            16300000
SDRMT_SDATA_BYTE5 DS 1BL1 Sdata Byte 5 - Reserved, must be 0            16350000
SDRMT_SDATA_RSVD DS 1CL0002 Reserved, must be 0                         16400000
SDRMT_SDATA_LEN EQU *-SDRMT_SDATA                                       16450000
.L000E   ANOP                                                           16500000
         AIF   ('&SDRMT_ASIDLST' EQ 'NO').L0011                         16550000
         AIF   ('&DSECT' EQ 'YES').L0012                                16600000
         AIF   ('&SDRMT_ASIDLST' NE 'YES').L0011                        16650000
SDRMT_ASIDLST DS 0F                                                     16700000
         AGO   .L0013                                                   16750000
.L0012   ANOP                                                           16800000
SDRMT_ASIDLST DSECT                                                     16850000
.L0013   ANOP                                                           16900000
SDRMT_ASIDLST_HEADER DS 1CL0004                                         16950000
         ORG   SDRMT_ASIDLST_HEADER                                     17000000
SDRMT_ASIDLST_ID DS 1FL2 Use SDRMT_IDCON_ASIDLST to initialize          17050000
SDRMT_ASIDLST_LENGTH DS 1FL2 Total length of area including this       *17100000
                         length field and the ID field                  17150000
SDRMT_ASIDLST_ENTRY DS 1CL0004 This represents an array of ASIDs        17200000
         ORG   SDRMT_ASIDLST_ENTRY                                      17250000
SDRMT_ASIDLST_ASID DS 1FL4 The ASID                                     17300000
SDRMT_ASIDLST_LEN EQU *-SDRMT_ASIDLST                                   17350000
.L0011   ANOP                                                           17400000
         AIF   ('&SDRMT_STORAGE' EQ 'NO').L0014                         17450000
         AIF   ('&DSECT' EQ 'YES').L0015                                17500000
         AIF   ('&SDRMT_STORAGE' NE 'YES').L0014                        17550000
SDRMT_STORAGE DS 0F                                                     17600000
         AGO   .L0016                                                   17650000
.L0015   ANOP                                                           17700000
SDRMT_STORAGE DSECT                                                     17750000
.L0016   ANOP                                                           17800000
SDRMT_STORAGE_HEADER DS 1CL0004                                         17850000
         ORG   SDRMT_STORAGE_HEADER                                     17900000
SDRMT_STORAGE_ID DS 1FL2 Use SDRMT_IDCON_STORAGE to initialize          17950000
SDRMT_STORAGE_LENGTH DS 1FL2 Total length of area including this       *18000000
                         length field and the ID field                  18050000
SDRMT_STORAGE_ENTRY DS 1CL0016 This represents an array of begin/end   *18100000
                         address pairs                                  18150000
         ORG   SDRMT_STORAGE_ENTRY                                      18200000
SDRMT_STORAGE_STOKEN DS 1CL0008 STOKEN of storage                       18250000
SDRMT_STORAGE_BEGIN@ DS 1AL4 Beginning address of range                 18300000
SDRMT_STORAGE_END@ DS 1AL4 Ending address of range                      18350000
SDRMT_STORAGE_LEN EQU *-SDRMT_STORAGE                                   18400000
.L0014   ANOP                                                           18450000
         AIF   ('&SDRMT_JOBLIST' EQ 'NO').L0017                         18500000
         AIF   ('&DSECT' EQ 'YES').L0018                                18550000
         AIF   ('&SDRMT_JOBLIST' NE 'YES').L0017                        18600000
SDRMT_JOBLIST DS 0H                                                     18650000
         AGO   .L0019                                                   18700000
.L0018   ANOP                                                           18750000
SDRMT_JOBLIST DSECT                                                     18800000
.L0019   ANOP                                                           18850000
SDRMT_JOBLIST_HEADER DS 1CL0004                                         18900000
         ORG   SDRMT_JOBLIST_HEADER                                     18950000
SDRMT_JOBLIST_ID DS 1FL2 Use SDRMT_IDCON_JOBLIST to initialize          19000000
SDRMT_JOBLIST_LENGTH DS 1FL2 Total length of area including this       *19050000
                         length field and the ID field                  19100000
SDRMT_JOBLIST_ENTRY DS 1CL0008 This represents an array of job names    19150000
         ORG   SDRMT_JOBLIST_ENTRY                                      19200000
SDRMT_JOBLIST_NAME DS 1CL0008 The jobname. Left-justified, padded with *19250000
                         blanks as needed.                              19300000
SDRMT_JOBLIST_LEN EQU *-SDRMT_JOBLIST                                   19350000
.L0017   ANOP                                                           19400000
         AIF   ('&SDRMT_DSPLIST' EQ 'NO').L001A                         19450000
         AIF   ('&DSECT' EQ 'YES').L001B                                19500000
         AIF   ('&SDRMT_DSPLIST' NE 'YES').L001A                        19550000
SDRMT_DSPLIST DS 0F                                                     19600000
         AGO   .L001C                                                   19650000
.L001B   ANOP                                                           19700000
SDRMT_DSPLIST DSECT                                                     19750000
.L001C   ANOP                                                           19800000
SDRMT_DSPLIST_HEADER DS 1CL0004                                         19850000
         ORG   SDRMT_DSPLIST_HEADER                                     19900000
SDRMT_DSPLIST_ID DS 1FL2 Use SDRMT_IDCON_DSPLIST to initialize          19950000
SDRMT_DSPLIST_LENGTH DS 1FL2 Total length of area including this       *20000000
                         length field and the ID field                  20050000
SDRMT_DSPLIST_ENTRY DS 1CL0016 This represents an array of job names    20100000
         ORG   SDRMT_DSPLIST_ENTRY                                      20150000
SDRMT_DSPLIST_OWNER DS 1CL0008 The owner of the data space: this can   *20200000
                         be by jobname or by ASID                       20250000
         ORG   SDRMT_DSPLIST_OWNER                                      20300000
SDRMT_DSPLIST_OWNER_JOBNAME DS 1CL0008 Fill this in, left-justified,   *20350000
                         padded with blanks, if specifying a jobname   *20400000
                         as the owner.                                  20450000
         ORG   SDRMT_DSPLIST_OWNER_JOBNAME                              20500000
SDRMT_DSPLIST_OWNER_ZEROES DS 1CL0006 Make sure this is zeroes if      *20550000
                         specifying an ASID as the owner.               20600000
SDRMT_DSPLIST_OWNER_ASID DS 1FL2 Fill this in, zeroing the previous    *20650000
                         field too, if specifying an ASID as the       *20700000
                         owner.                                         20750000
SDRMT_DSPLIST_NAME DS 1CL0008 The data space name                       20800000
SDRMT_DSPLIST_LEN EQU *-SDRMT_DSPLIST                                   20850000
.L001A   ANOP                                                           20900000
         AIF   ('&SDRMT_SUBPLST' EQ 'NO').L001D                         20950000
         AIF   ('&DSECT' EQ 'YES').L001E                                21000000
         AIF   ('&SDRMT_SUBPLST' NE 'YES').L001D                        21050000
SDRMT_SUBPLST DS 0H                                                     21100000
         AGO   .L001F                                                   21150000
.L001E   ANOP                                                           21200000
SDRMT_SUBPLST DSECT                                                     21250000
.L001F   ANOP                                                           21300000
SDRMT_SUBPLST_HEADER DS 1CL0004                                         21350000
         ORG   SDRMT_SUBPLST_HEADER                                     21400000
SDRMT_SUBPLST_ID DS 1FL2 Use SDRMT_IDCON_SUBPLST to initialize          21450000
SDRMT_SUBPLST_LENGTH DS 1FL2 Total length of area including this       *21500000
                         length field and the ID field                  21550000
SDRMT_SUBPLST_ENTRY DS 1CL0004 This represents an array of             *21600000
                         ASID/Subpool pairs                             21650000
         ORG   SDRMT_SUBPLST_ENTRY                                      21700000
SDRMT_SUBPLST_ASID DS 1FL2 The ASID to which the subpool applies        21750000
SDRMT_SUBPLST_SUBPOOL DS 1FL2 The subpool                               21800000
SDRMT_SUBPLST_LEN EQU *-SDRMT_SUBPLST                                   21850000
.L001D   ANOP                                                           21900000
         AIF   ('&SDRMT_KEYLIST' EQ 'NO').L0020                         21950000
         AIF   ('&DSECT' EQ 'YES').L0021                                22000000
         AIF   ('&SDRMT_KEYLIST' NE 'YES').L0020                        22050000
SDRMT_KEYLIST DS 0F                                                     22100000
         AGO   .L0022                                                   22150000
.L0021   ANOP                                                           22200000
SDRMT_KEYLIST DSECT                                                     22250000
.L0022   ANOP                                                           22300000
SDRMT_KEYLIST_HEADER DS 1CL0004                                         22350000
         ORG   SDRMT_KEYLIST_HEADER                                     22400000
SDRMT_KEYLIST_ID DS 1FL2 Use SDRMT_IDCON_KEYLIST to initialize          22450000
SDRMT_KEYLIST_LENGTH DS 1FL2 Total length of area including this       *22500000
                         length field and the ID field                  22550000
SDRMT_KEYLIST_ENTRY DS 1CL0004 This represents an array of KEYs which  *22600000
                         are applied to the provided subpools           22650000
         ORG   SDRMT_KEYLIST_ENTRY                                      22700000
SDRMT_KEYLIST_KEY DS 1FL4 The key (must be X'00'-X'F0', not 0-15)       22750000
SDRMT_KEYLIST_LEN EQU *-SDRMT_KEYLIST                                   22800000
.L0020   ANOP                                                           22850000
         AIF   ('&SDRMT_COPY' EQ 'NO').L0023                            22900000
         AIF   ('&DSECT' EQ 'YES').L0024                                22950000
         AIF   ('&SDRMT_COPY' NE 'YES').L0023                           23000000
SDRMT_COPY DS  0H                                                       23050000
         AGO   .L0025                                                   23100000
.L0024   ANOP                                                           23150000
SDRMT_COPY DSECT                                                        23200000
.L0025   ANOP                                                           23250000
SDRMT_COPY_HEADER DS 1CL0004                                            23300000
         ORG   SDRMT_COPY_HEADER                                        23350000
SDRMT_COPY_ID DS 1FL2    Use SDRMT_xxxxx_COPY to initialize             23400000
SDRMT_COPY_LENGTH DS 1FL2 Total length of area including this length   *23450000
                         field and the ID field                         23500000
SDRMT_COPY_LEN EQU *-SDRMT_COPY                                         23550000
.L0023   ANOP                                                           23600000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 23650000
         AIF   ('&LIST' EQ 'YES').P4                                    23700000
.P3      ANOP                                                           23750000
         POP   PRINT                                                    23800000
.P4      ANOP                                                           23850000
.P_EXIT  ANOP                                                           23900000
         MEND                                                           23950000
**/ IHASDRMT_2:;                                                        24000000
* %IHASDRMT_INCLUDED = 'YES';                                           24050000
* %DCL ZCBPRINT CHAR EXT;                                               24100000
* %DEACTIVATE ZCBPRINT;                                                 24150000
* %DCL IHASDRMT_LIST CHAR EXT;                                          24200000
* %DEACTIVATE IHASDRMT_LIST;                                            24250000
* %IF IHASDRMT_LIST ^= 'NO' &                                           24300000
*    ZCBPRINT ^= 'NO' %THEN                                             24350000
*   %GOTO IHASDRMT_3;                                                   24400000
*   @LIST PUSH NOECHO;                                                  24450000
*   @LIST NOASSEMBLE NOECHO;                                            24500000
*   @LIST OFF C NOECHO;                                                 24550000
* %IHASDRMT_3:;                                                         24600000
*/* Start of PL/X Source                                             */ 24650000
*DCL 1 SDRMT BASED,                 /*                           @L1A*/ 24700000
*      2 SDRMT_LENGTH FIXED(31) UNSIGNED,  /* Total length for          24750000
*               REMOTE info. Data begins at SDRMT_DATA with             24800000
*               entries contiguously defined from that point.    @L1A*/ 24850000
*      2 SDRMT_DATA CHAR(0);        /* Start of remote data      @L1A*/ 24900000
*                                                                       24950000
*    /* Constants to identify the DSECT. Note that the                  25000000
*       constants ending with "_COPY" should use the                    25050000
*       SDRMT_COPY DSECT.                                               25100000
*                                                                @L1A*/ 25150000
*DCL SDRMT_IDCON_SYSLIST FIXED(15) Constant(4);     /*           @L1A*/ 25200000
*DCL SDRMT_IDCON_GRPLIST FIXED(15) Constant(8);     /*           @L1A*/ 25250000
*DCL SDRMT_IDCON_SDATA FIXED(15) Constant(12);      /*           @L1A*/ 25300000
*DCL SDRMT_IDCON_SDATA_COPY FIXED(15) Constant(13); /*           @L1A*/ 25350000
*DCL SDRMT_IDCON_ASIDLST FIXED(15) Constant(16);    /*           @L1A*/ 25400000
*DCL SDRMT_IDCON_ASIDLST_COPY FIXED(15) Constant(17);  /* Indicates     25450000
*                     to copy the ASIDLST used for this dump.    @L1A*/ 25500000
*DCL SDRMT_IDCON_STORAGE FIXED(15) Constant(20);    /*           @L1A*/ 25550000
*DCL SDRMT_IDCON_STORAGE_COPY FIXED(15) Constant(21);  /* Indicates     25600000
*                     to copy the input LISTD specification      @L1A*/ 25650000
*DCL SDRMT_IDCON_JOBLIST FIXED(15) Constant(24);    /*           @L1A*/ 25700000
*DCL SDRMT_IDCON_JOBLIST_COPY FIXED(15) Constant(25);  /*        @L1A*/ 25750000
*DCL SDRMT_IDCON_DSPLIST FIXED(15) Constant(28);    /*           @L1A*/ 25800000
*DCL SDRMT_IDCON_DSPLIST_COPY FIXED(15) Constant(29);  /*        @L1A*/ 25850000
*DCL SDRMT_IDCON_SUBPLST FIXED(15) Constant(32);    /*           @L1A*/ 25900000
*DCL SDRMT_IDCON_SUBPLST_COPY FIXED(15) Constant(33);  /*        @L1A*/ 25950000
*DCL SDRMT_IDCON_KEYLIST FIXED(15) Constant(36);    /*           @L1A*/ 26000000
*DCL SDRMT_IDCON_KEYLIST_COPY FIXED(15) Constant(37);  /*        @L1A*/ 26050000
*                                                                       26100000
*DCL 1 SDRMT_MODEL BASED,                           /*           @L1A*/ 26150000
*      2 SDRMT_MODEL_HEADER,                /*                   @L1A*/ 26200000
*        3 SDRMT_MODEL_ID FIXED(15),        /* Contains                 26250000
*                   the ID of the entry                          @L1A*/ 26300000
*        3 SDRMT_MODEL_LENGTH FIXED(15),    /* Total length of area     26350000
*                   including this length field and the ID field @L1A*/ 26400000
*      2 SDRMT_MODEL_ENTRY CHAR(*);         /* Start of data            26450000
*                   for the entry                                @L1A*/ 26500000
*                                                                       26550000
*DCL 1 SDRMT_SYSLIST BASED,                         /*           @L1A*/ 26600000
*      2 SDRMT_SYSLIST_HEADER,              /*                   @L1A*/ 26650000
*        3 SDRMT_SYSLIST_ID FIXED(15),      /* Use                      26700000
*                   SDRMT_IDCON_SYSLIST to initialize            @L1A*/ 26750000
*        3 SDRMT_SYSLIST_LENGTH FIXED(15),  /* Total length of area     26800000
*                   including this length field and the ID field @L1A*/ 26850000
*      2 SDRMT_SYSLIST_ENTRY(*),            /* This represents an       26900000
*                   array of sysname/jobname or sysname/ASID pairs      26950000
*                                                                @L1A*/ 27000000
*        3 SDRMT_SYSLIST_SYSNAME CHAR(8),   /* The system name          27050000
*                                                                @L1A*/ 27100000
*        3 SDRMT_SYSLIST_JOBNAME_ASID BDY(WORD),           /* Area      27150000
*                   that contains either all 0s (no jobname/ASID),      27200000
*                   JOBNAME/ID, or ZEROES&ASID                   @L1A*/ 27250000
*          4 SDRMT_SYSLIST_JOBNAME CHAR(8) BDY(WORD), /* Fill           27300000
*                   this in, left-justified, padded with blanks, if     27350000
*                   specifying a jobname. The entire field should be    27400000
*                   0s if neither jobname nor ASID is wanted.           27450000
*                                                                @L1A*/ 27500000
*            5 SDRMT_SYSLIST_ZEROES CHAR(6), /* Make sure this          27550000
*                   is zeroes if specifying an ASID.                    27600000
*                                                                @L1A*/ 27650000
*            5 SDRMT_SYSLIST_ASID FIXED(15); /* Fill this in,           27700000
*                   zeroing the previous field too, if specifying       27750000
*                   an ASID.                                            27800000
*                                                                @L1A*/ 27850000
*                                                                       27900000
*DCL 1 SDRMT_GRPLIST BASED,                         /*           @L1A*/ 27950000
*      2 SDRMT_GRPLIST_HEADER,              /*                   @L1A*/ 28000000
*        3 SDRMT_GRPLIST_ID FIXED(15),      /* Use                      28050000
*                   SDRMT_IDCON_GRPLIST to initialize            @L1A*/ 28100000
*        3 SDRMT_GRPLIST_LENGTH FIXED(15),  /* Total length of area     28150000
*                   including this length field and the ID field @L1A*/ 28200000
*      2 SDRMT_GRPLIST_ENTRY(*),            /* This represents an       28250000
*                   array of group/member pairs. If all members         28300000
*                   of the group are wanted, use a member name of       28350000
*                   "*".                                         @L1A*/ 28400000
*        3 SDRMT_GRPLIST_GRPNAME CHAR(8),   /* The group name           28450000
*                                                                @L1A*/ 28500000
*        3 SDRMT_GRPLIST_MEMNAME CHAR(16);  /* The member name          28550000
*                                                                @L1A*/ 28600000
*                                                                       28650000
*DCL 1 SDRMT_SDATA BASED,                   /*                          28700000
*               This field should be set if the caller has indicated    28750000
*               SDATA options for the dump.                      @L1A*/ 28800000
*      2 SDRMT_SDATA_HEADER,              /*                     @L1A*/ 28850000
*        3 SDRMT_SDATA_ID FIXED(15),      /* Use                        28900000
*                   SDRMT_IDCON_SDATA to initialize              @L1A*/ 28950000
*        3 SDRMT_SDATA_LENGTH FIXED(15),  /* Total length of area       29000000
*                   including this length field and the ID field @L1A*/ 29050000
*      2 SDRMT_SDATA_OPTIONS,    /* These are mapped in the same        29100000
*                   order as they appear in the SDUMP parameter         29150000
*                   list                                         @L1A*/ 29200000
*       3 SDRMT_SDATA_BYTE0 BIT(8),           /*                        29250000
*               This field should be set if the caller has indicated    29300000
*               SDATA options for the dump.                      @L1A*/ 29350000
*        4 SDRMT_SDATA_ALLPSA BIT(1),          /*                       29400000
*                 Corresponds to SDUMPX SDATA option ALLPSA             29450000
*                                                                @L1A*/ 29500000
*        4 SDRMT_SDATA_PSA BIT(1),          /*                          29550000
*                 Corresponds to SDUMPX SDATA option PSA                29600000
*                                                                @L1A*/ 29650000
*        4 SDRMT_SDATA_NUC BIT(1),          /*                          29700000
*                 Corresponds to SDUMPX SDATA option NUC                29750000
*                                                                @L1A*/ 29800000
*        4 SDRMT_SDATA_SQA BIT(1),          /*                          29850000
*                 Corresponds to SDUMPX SDATA option SQA                29900000
*                                                                @L1A*/ 29950000
*        4 SDRMT_SDATA_LSQA BIT(1),          /*                         30000000
*                 Corresponds to SDUMPX SDATA option LSQA               30050000
*                                                                @L1A*/ 30100000
*        4 SDRMT_SDATA_RGN BIT(1),          /*                          30150000
*                 Corresponds to SDUMPX SDATA option RGN                30200000
*                                                                @L1A*/ 30250000
*        4 SDRMT_SDATA_LPA BIT(1),          /*                          30300000
*                 Corresponds to SDUMPX SDATA option LPA                30350000
*                                                                @L1A*/ 30400000
*        4 SDRMT_SDATA_TRT BIT(1),          /*                          30450000
*                 Corresponds to SDUMPX SDATA option TRT                30500000
*                                                                @L1A*/ 30550000
*       3 SDRMT_SDATA_BYTE1 BIT(8),           /*                        30600000
*               This field should be set if the caller has indicated    30650000
*               SDATA options for the dump.                      @L1A*/ 30700000
*        4 SDRMT_SDATA_CSA BIT(1),        /*                            30750000
*                 Corresponds to SDUMPX SDATA option CSA                30800000
*                                                                @L1A*/ 30850000
*        4 SDRMT_SDATA_SWA BIT(1),        /*                            30900000
*                 Corresponds to SDUMPX SDATA option SWA                30950000
*                                                                @L1A*/ 31000000
*        4 SDRMT_SDATA_SUM BIT(1),        /*                            31050000
*                 Corresponds to SDUMPX SDATA option SUM                31100000
*                                                                @L1A*/ 31150000
*        4 * BIT(1),                        /* Reserved                 31200000
*                                                                @L1A*/ 31250000
*        4 SDRMT_SDATA_NOALLPSA BIT(1),     /*                          31300000
*                 Corresponds to SDUMPX SDATA option NOALLPSA           31350000
*                                                                @L1A*/ 31400000
*        4 SDRMT_SDATA_NOSQA BIT(1),     /*                             31450000
*                 Corresponds to SDUMPX SDATA option NOSQA              31500000
*                                                                @L1A*/ 31550000
*        4 SDRMT_SDATA_ALLNUC BIT(1),  /*                               31600000
*                 Corresponds to SDUMPX SDATA option ALLNUC             31650000
*                                                                @L1A*/ 31700000
*        4 SDRMT_SDATA_DEFS BIT(1),    /*                               31750000
*                 Corresponds to SDUMPX SDATA option DEFS               31800000
*                                                                @L1A*/ 31850000
*       3 SDRMT_SDATA_BYTE2 BIT(8),           /*                        31900000
*               This field should be set if the caller has indicated    31950000
*               SDATA options for the dump.                      @L1A*/ 32000000
*        4 SDRMT_SDATA_GRSQ BIT(1),        /*                           32050000
*                 Corresponds to SDUMPX SDATA option GRSQ               32100000
*                                                                @L1A*/ 32150000
*        4 * BIT(1),                     /* Reserved                    32200000
*                                                                @L1A*/ 32250000
*        4 * BIT(1),                     /* Reserved                    32300000
*                                                                @L1A*/ 32350000
*        4 SDRMT_SDATA_COUPLE BIT(1),    /*                             32400000
*                 Corresponds to SDUMPX SDATA option COUPLE             32450000
*                                                                @L1A*/ 32500000
*        4 SDRMT_SDATA_XESDATA BIT(1),   /*                             32550000
*                 Corresponds to SDUMPX SDATA option XESDATA            32600000
*                                                                @L1A*/ 32650000
*        4 * BIT(1),                           /*                @L2A*/ 32670000
*        4 SDRMT_SDATA_WLM     BIT(1), /* Corresponds to SDUMPX SDATA   32690000
*                                      option WLM                @L2A*/ 32710000
*        4 * BIT(1),                           /*                @L2C*/ 32730000
*       3 SDRMT_SDATA_BYTE3 BIT(8), /* Sdata Byte 3              @L2C*/ 32750000
*        4 * BIT(2),                /* Reserved, must be 0       @L2A*/ 32770000
*        4 SDRMT_SDATA_SERVERS BIT(1), /* Corresponds to SDUMPX SDATA   32790000
*                                      option SERVERS            @L2A*/ 32810000
*        4 * BIT(5),                /* Reserved, must be 0       @L2A*/ 32830000
*       3 SDRMT_SDATA_BYTE4 BIT(8),           /* Sdata Byte 4    @L1A*/ 32850000
*        4 SDRMT_SDATA_NODEFS BIT(1),              /*                   32900000
*                 Corresponds to SDUMPX SDATA option NODEFS             32950000
*                                                                @L1A*/ 33000000
*        4 SDRMT_SDATA_IO BIT(1),              /*                       33050000
*                 Corresponds to SDUMPX SDATA option IO                 33100000
*                                                                @L1A*/ 33150000
*        4 * BIT(6),                /* Reserved, must be 0       @L1A*/ 33200000
*       3 SDRMT_SDATA_BYTE5 BIT(8),           /* Sdata Byte 5 -         33250000
*                                      Reserved, must be 0       @L1A*/ 33300000
*       3 SDRMT_SDATA_RSVD CHAR(2), /* Reserved, must be 0       @L1A*/ 33350000
*      2 * CHAR(0);                 /* End of mapping            @L1A*/ 33400000
*                                                                       33450000
*DCL 1 SDRMT_ASIDLST BASED,                         /*           @L1A*/ 33500000
*      2 SDRMT_ASIDLST_HEADER,              /*                   @L1A*/ 33550000
*        3 SDRMT_ASIDLST_ID FIXED(15),      /* Use                      33600000
*                   SDRMT_IDCON_ASIDLST to initialize            @L1A*/ 33650000
*        3 SDRMT_ASIDLST_LENGTH FIXED(15),  /* Total length of area     33700000
*                   including this length field and the ID field @L1A*/ 33750000
*      2 SDRMT_ASIDLST_ENTRY(*),            /* This represents an       33800000
*                   array of ASIDs                               @L1A*/ 33850000
*        3 SDRMT_ASIDLST_ASID FIXED(31);    /* The ASID                 33900000
*                                                                @L1A*/ 33950000
*                                                                       34000000
*DCL 1 SDRMT_STORAGE BASED,                         /*           @L1A*/ 34050000
*      2 SDRMT_STORAGE_HEADER,              /*                   @L1A*/ 34100000
*        3 SDRMT_STORAGE_ID FIXED(15),      /* Use                      34150000
*                   SDRMT_IDCON_STORAGE to initialize            @L1A*/ 34200000
*        3 SDRMT_STORAGE_LENGTH FIXED(15),  /* Total length of area     34250000
*                   including this length field and the ID field @L1A*/ 34300000
*      2 SDRMT_STORAGE_ENTRY(*),            /* This represents an       34350000
*                   array of begin/end address pairs             @L1A*/ 34400000
*        3 SDRMT_STORAGE_STOKEN CHAR(8),    /* STOKEN of storage        34450000
*                                                                @L1A*/ 34500000
*        3 SDRMT_STORAGE_BEGIN@ PTR(31),    /* Beginning address of     34550000
*                   range                                        @L1A*/ 34600000
*        3 SDRMT_STORAGE_END@ PTR(31);      /* Ending address of range  34650000
*                                                                @L1A*/ 34700000
*                                                                       34750000
*DCL 1 SDRMT_JOBLIST BASED,                         /*           @L1A*/ 34800000
*      2 SDRMT_JOBLIST_HEADER,              /*                   @L1A*/ 34850000
*        3 SDRMT_JOBLIST_ID FIXED(15),      /* Use                      34900000
*                   SDRMT_IDCON_JOBLIST to initialize            @L1A*/ 34950000
*        3 SDRMT_JOBLIST_LENGTH FIXED(15),  /* Total length of area     35000000
*                   including this length field and the ID field @L1A*/ 35050000
*      2 SDRMT_JOBLIST_ENTRY(*),            /* This represents an       35100000
*                   array of job names                           @L1A*/ 35150000
*        3 SDRMT_JOBLIST_NAME CHAR(8);      /* The jobname.             35200000
*                   Left-justified, padded with blanks as needed.       35250000
*                                                                @L1A*/ 35300000
*                                                                       35350000
*DCL 1 SDRMT_DSPLIST BASED,                         /*           @L1A*/ 35400000
*      2 SDRMT_DSPLIST_HEADER,              /*                   @L1A*/ 35450000
*        3 SDRMT_DSPLIST_ID FIXED(15),      /* Use                      35500000
*                   SDRMT_IDCON_DSPLIST to initialize            @L1A*/ 35550000
*        3 SDRMT_DSPLIST_LENGTH FIXED(15),  /* Total length of area     35600000
*                   including this length field and the ID field @L1A*/ 35650000
*      2 SDRMT_DSPLIST_ENTRY(*),            /* This represents an       35700000
*                   array of job names                           @L1A*/ 35750000
*        3 SDRMT_DSPLIST_OWNER,             /* The owner of the data    35800000
*                   space: this can be by jobname or by ASID            35850000
*                                                                @L1A*/ 35900000
*         4 SDRMT_DSPLIST_OWNER_JOBNAME CHAR(8) BDY(WORD),  /* Fill     35950000
*                   this in, left-justified, padded with blanks, if     36000000
*                   specifying a jobname as the owner.                  36050000
*                                                                @L1A*/ 36100000
*          5 SDRMT_DSPLIST_OWNER_ZEROES CHAR(6), /* Make sure this      36150000
*                   is zeroes if specifying an ASID as the owner.       36200000
*                                                                @L1A*/ 36250000
*          5 SDRMT_DSPLIST_OWNER_ASID FIXED(15), /* Fill this in,       36300000
*                   zeroing the previous field too, if specifying       36350000
*                   an ASID as the owner.                               36400000
*                                                                @L1A*/ 36450000
*        3 SDRMT_DSPLIST_NAME CHAR(8);      /* The data space name      36500000
*                                                                @L1A*/ 36550000
*                                                                       36600000
*DCL 1 SDRMT_SUBPLST BASED,                         /*           @L1A*/ 36650000
*      2 SDRMT_SUBPLST_HEADER,              /*                   @L1A*/ 36700000
*        3 SDRMT_SUBPLST_ID FIXED(15),      /* Use                      36750000
*                   SDRMT_IDCON_SUBPLST to initialize            @L1A*/ 36800000
*        3 SDRMT_SUBPLST_LENGTH FIXED(15),  /* Total length of area     36850000
*                   including this length field and the ID field @L1A*/ 36900000
*      2 SDRMT_SUBPLST_ENTRY(*),            /* This represents an       36950000
*                   array of ASID/Subpool pairs                  @L1A*/ 37000000
*        3 SDRMT_SUBPLST_ASID FIXED(15),    /* The ASID to which the    37050000
*                   subpool applies                              @L1A*/ 37100000
*        3 SDRMT_SUBPLST_SUBPOOL FIXED(15); /* The subpool              37150000
*                                                                @L1A*/ 37200000
*                                                                       37250000
*DCL 1 SDRMT_KEYLIST BASED,                         /*           @L1A*/ 37300000
*      2 SDRMT_KEYLIST_HEADER,              /*                   @L1A*/ 37350000
*        3 SDRMT_KEYLIST_ID FIXED(15),      /* Use                      37400000
*                   SDRMT_IDCON_KEYLIST to initialize            @L1A*/ 37450000
*        3 SDRMT_KEYLIST_LENGTH FIXED(15),  /* Total length of area     37500000
*                   including this length field and the ID field @L1A*/ 37550000
*      2 SDRMT_KEYLIST_ENTRY(*),            /* This represents an       37600000
*                   array of KEYs which are applied to the              37650000
*                   provided subpools                            @L1A*/ 37700000
*        3 SDRMT_KEYLIST_KEY FIXED(31);     /* The key (must be         37750000
*                   X'00'-X'F0', not 0-15)                       @L1A*/ 37800000
*                                                                       37850000
*DCL 1 SDRMT_COPY BASED,                            /*           @L1A*/ 37900000
*      2 SDRMT_COPY_HEADER,               /*                     @L1A*/ 37950000
*        3 SDRMT_COPY_ID FIXED(15),       /* Use                        38000000
*                   SDRMT_xxxxx_COPY to initialize               @L1A*/ 38050000
*        3 SDRMT_COPY_LENGTH FIXED(15);   /* Total length of area       38100000
*                   including this length field and the ID field @L1A*/ 38150000
*                                                                       38200000
* @LOGIC;                                                               38250000
* #PRAGMA TOOL=CBGEN.                                                   38300000
* #USEORG.                                                              38350000
* #EPRAGMA.                                                             38400000
* @ENDLOGIC;                                                            38450000
*/* End of PL/X Source                                               */ 38500000
* %IF IHASDRMT_LIST ^= 'NO' &                                           38550000
*    ZCBPRINT ^= 'NO' %THEN                                             38600000
*   %GOTO IHASDRMT_4;                                                   38650000
*   @LIST POP NOECHO;                                                   38700000
* %IHASDRMT_4:;                                                         38750000
* %END;                                                                 38800000
