*%DCL DOSDSTR CHAR EXT;                                                 00050000
*%DEACT DOSDSTR;                                                        00100000
*%IF DOSDSTR ^= 'DONE' %THEN %DO;                                       00150000
*%DOSDSTR = 'DONE';                                                     00200000
*%IF SDSTR_SKIP_COMMENTS ^= '' %THEN %DO;                               00250000
*                                 /* BILINGUAL MAPPING                  00300000
         MACRO                                                          00350000
         IHASDSTR                                                       00400000
         GBLC  &DOSDSTR                    Var for generating DSECTs    00450000
         AIF   ('&DOSDSTR' EQ 'DONE').SDEND If DSECTs generated, branch 00500000
&DOSDSTR   SETC  'DONE'                    DSECTS will be generated     00550000
*                                                                    */ 00600000
*%END;                                                                  00650000
*/* START OF SPECIFICATIONS ******************************************* 00700000
*                                                                       00750000
*01* SECURITY:                                                          00800000
**/                                                                     00842300
*/*01* PROPRIETARY STATEMENT=                                        */ 00884600
*/***PROPRIETARY_STATEMENT********************************************/ 00919200
*/*  Proprietary Statement =                                         */ 00953800
*/*                                                                  */ 00988400
*/*              LICENSED MATERIALS - PROPERTY OF IBM                */ 01023000
*/*              THIS MACRO IS "RESTRICTED MATERIALS OF IBM"         */ 01057600
*/*              5645-001 (C) COPYRIGHT IBM CORP 1996                */ 01092200
*/*              SEE COPYRIGHT INSTRUCTIONS                          */ 01126800
*/*                                                                  */ 01161400
*/*  Status = HBB6601                                                */ 01196000
*/*                                                              @D2C*/ 01230600
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01265200
*/*                                                                     01307600
*01* DESCRIPTIVE NAME:  SDUMPX STRLIST Parameter List Mappings          01350000
*02*  ACRONYM:  N/A                                                     01400000
*                                                                       01450000
*01* MACRO NAME:  IHASDSTR                                              01500000
*                                                                       01550000
*01* DSECT NAME:                                                        01600000
*     SDSTR_HEADER_MAP - STRLIST Header Mapping                         01650000
*     SDSTR_LENGTH_MAP - STRLIST Length Mapping                         01700000
*     SDSTR_WORK_AREAS - IHABLDP Work Area Mapping                      01750000
*     SDSTR_STRUCTURE  - STRLIST Structure Entry Mapping                01800000
*     SDSTR_RANGE      - STRLIST Range/Option Entry Mapping             01850000
*                                                                       01900000
*01* COMPONENT:  SVC Dump (SCDMP)                                  @D2C 01950000
*                                                                       02000000
*01* EXTERNAL CLASSIFICATION: GUPI                                      02040000
*01* END OF EXTERNAL CLASSIFICATION:                                    02080000
*                                                                       02120000
*01* EYE-CATCHER:  NONE                                                 02160000
*                                                                       02200000
*01* STORAGE ATTRIBUTES:                                                02250000
*02*  SUBPOOL:  User Defined                                            02300000
*02*  KEY:  User Defined                                                02350000
*02*  RESIDENCY:  User Defined                                          02400000
*                                                                       02450000
*01* SIZE:  Variable                                                    02500000
*                                                                       02550000
*01* CREATED BY: User                                                   02600000
*                                                                       02650000
*01* POINTED TO BY: User                                                02700000
*                                                                       02750000
*01* SERIALIZATION:                                                     02800000
*     None required                                                     02850000
*                                                                       02900000
*01* FUNCTION:                                                          02950000
*02*  Maps the STRLIST parameter list entries that will be constructed  03000000
*     by the IHABLDP macro and will be provided as input to the         03050000
*     STRLIST parameter on the SDUMPX macro.                            03100000
*                                                                       03150000
*01*  The following is an example of what a STRLIST parameter list      03200000
*     would look like:                                                  03250000
*                  ____________________________                         03300000
*                 |............................|                        03350000
*                 |.STRLIST Header/Length......|                        03400000
*                 |____________________________|                        03450000
*                 |............................|                        03500000
*                 |.STRLIST Structure Entry 1..|                        03550000
*                 |____________________________|                        03600000
*                 |............................|                        03650000
*                 |.STRLIST Range or Option....|                        03700000
*                 |.........Entry..............|                        03750000
*                 |____________________________|__                      03800000
*                 |............-...............| |                      03850000
*                 |............-...............| |                      03900000
*                 |............-...............| |-- There will be one  03950000
*                 |............-...............| |   or more range or   04000000
*                 |............-...............| |   option entries.    04050000
*                 |____________________________|_|                      04100000
*                 |............................|                        04150000
*                 |.STRLIST Structure Entry 2..|                        04200000
*                 |____________________________|                        04250000
*                 |............................|                        04300000
*                 |.STRLIST Range or Option....|                        04350000
*                 |.........Entry..............|                        04400000
*                 |____________________________|_                       04450000
*                 |.............-..............| |                      04500000
*                 |.............-..............| |--There will be one   04550000
*                 |.............-..............| |  or more range or    04600000
*                 |.............-..............| |  option entries.     04650000
*                 |.............-..............| |                      04700000
*                 |____________________________|_|                      04750000
*                 |............................|                        04800000
*                 |.STRLIST Structure Entry N..|-- Will continue for N  04850000
*                 |____________________________|   amount of structures 04900000
*                 |............................|                        04950000
*                 |.STRLIST Range or Option....|                        05000000
*                 |.........Entry..............|                        05050000
*                 |____________________________|                        05100000
*                 |.............-..............|                        05150000
*                 |.............-..............|                        05200000
*                 |.............-..............|                        05250000
*                 |.............-..............|                        05300000
*                 |.............-..............|                        05350000
*                 |____________________________|                        05400000
*                 |............................|                        05450000
*                 |............................|                        05500000
*                 |....IHABLDP's Work Area.....|                        05550000
*                 |............................|                        05600000
*                 |____________________________|                        05650000
*                                                                       05700000
*01* RETURN CODES:                                                      05750000
*    The following return codes will be issued by IHABLDP:              05800000
*    0 - Successful Completion                                          05850000
*    8 - Function Failed                                                05900000
*                                                                       05950000
*01* REASON CODES:                                                      06000000
*    The following reason codes will be issued by IHABLDP:              06050000
*    0 - No Reason Code                                                 06100000
*    4 - Insufficient space to add a requested element to the dump      06150000
*        parameter list.                                                06200000
*    8 - Range entry was not added to the dump parameter list           06250000
*        because the starting range value was greater than the          06300000
*        the ending range value                                         06350000
*                                                                       06400000
*01* METHOD OF ACCESS:                                                  06450000
*02*  ASM:                                                              06500000
*         IHASDSTR                                                      06550000
*02*  PL/AS:                                                            06600000
*         %DCL SDSTR_HDR_ATTR CHAR                                      06650000
*         %DCL SDSTR_LEN_ATTR CHAR                                      06700000
*         %DCL SDSTR_WRK_ATTR CHAR                                      06750000
*         %DCL SDSTR_STR_ATTR CHAR                                      06800000
*         %DCL SDSTR_RNG_ATTR CHAR                                      06850000
*         %SDSTR_HDR_ATTR = 'based/defined/via attribtues'              06900000
*         %SDSTR_LEN_ATTR = 'based/defined/via attribtues'              06950000
*         %SDSTR_WRK_ATTR = 'based/defined/via attribtues'              07000000
*         %SDSTR_STR_ATTR = 'based/defined/via attribtues'              07050000
*         %SDSTR_RNG_ATTR = 'based/defined/via attribtues'              07100000
*         %INCLUDE SYSLIB(IHASDSTR)                                     07150000
*                                                                       07200000
*         Where:                                                        07250000
*            SDSTR_HDR_ATTR is associated with SDSTR_HEADER_MAP         07300000
*            SDSTR_LEN_ATTR is associated with SDSTR_LENGTH_MAP         07350000
*            SDSTR_WRK_ATTR is associated with SDSTR_WORK_AREA          07400000
*            SDSTR_STR_ATTR is associated with SDSTR_STRUCTURE          07450000
*            SDSTR_RNG_ATTR is associated with SDSTR_RANGE              07500000
*                                                                       07550000
*         If any of the above variables is not set,                     07600000
*         the associated mapping will declared as BASED.                07650000
*                                                                       07700000
*01* DELETED BY: User                                                   07850000
*                                                                       07900000
*01* FREQUENCY: N/A                                                     07950000
*                                                                       08000000
*01* DEPENDENCIES: None                                                 08050000
*                                                                       08100000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      08150000
*                                                                       08200000
*01* CHANGE ACTIVITY:                                                   08250000
*                                                                       08300000
*   Flag LineItem    FMID     Date     ID    Comment                    08350000
*                                                                       08400000
*    $L0=SYSLKD     HBB5510  910619  PD00LA: SES Dumping Support        08450000
*    $P1=PIG0308    HBB5510  910923  PD00LA: Assembler version of       08500000
*                                            IHABLDP does not support   08550000
*                                            RSECTS                     08600000
*    $L1=SYSLKD     HBB5510  920213  PD00LA: STRTOKEN Support           08625000
*    $D1=DIGxxxx    HBB5510  921110  PD00LA: Rename fields         @D1A 08633300
*    $P1=PIG0893    HBB5510  921116  PDHT:   Correct name change   @P1A 08641600
*    $P2=PIG3045    HBB5510  930931  PDHT:   Make range values          08644400
*                                            fixed(32)             @P2A 08647200
*    $01=OW01117    HBB5510  931216  PDHT:   Update prolog         @01A 08648600
*    $D2=DR20001    HBB6601  950907 PD00KV: Split from SC1CM       @D2A 08649300
*    $02=OW24532    HBB5520  960701  PDHT:   Event monitoring controls  08649400
*                                            and event queues support   08649500
*                                                                  @02A 08649600
*       =PUX0504    HBB6603  960926  PDKV:   Fix prol. FUNCTION syntax  08649800
*                                                                       08650000
* END OF SPECIFICATIONS *********************************************/  08700000
*%IF SDSTR_SKIP_COMMENTS ^= '' %THEN %DO;                               08750000
*                                          /*                           08800000
         SPACE 1                                                        08850000
SDSTR_HEADER_MAP    EQU  0           STRLIST Header for IHABLDP    @P1C 08900000
SDSTR_WORK_VAR_PTR  EQU  0           Pointer to IHABLDP work areas @P1C 08950000
SDSTR_VERSION       EQU  4           Version Number                @P1C 09000000
SDSTR_HEADER_LENGTH EQU  8           Length of STRLIST header      @P1C 09050000
*********************************************************************   09100000
*                                                                   *   09150000
*          STRLIST Length mapping - 8 bytes                         *   09200000
*                                                                   *   09250000
*********************************************************************   09300000
SDSTR_LENGTH_MAP    EQU  0           STRLIST Header for storing the     09350000
*                                    length                        @P1C 09400000
SDSTR_LENGTH        EQU  0           Total length of the STRLIST        09450000
*                                    parameter list                @P1C 09500000
*********************************************************************   09550000
*                                                                   *   09600000
*          IHABLDP work areas - 16 bytes                            *   09650000
*                                                                   *   09700000
*********************************************************************   09750000
SDSTR_WORK_AREA   EQU  0             IHABLDP Work areas            @P1C 09800000
SDSTR_NEXT_SPACE  EQU  0             Next available space pointer  @P1C 09850000
SDSTR_CUR_STR_PTR EQU  4             Current structure entry            09900000
*                                    pointer                       @P1C 09950000
SDSTR_WORK_LENGTH EQU  16            Length of IHABLDP work areas  @P1C 10000000
********************************************************************    10050000
*                                                                  *    10100000
*         STRLIST structure entry - 48 bytes                   @L1C*    10150000
*                                                                  *    10200000
********************************************************************    10250000
SDSTR_STRUCTURE       EQU 0          STRLIST structure entry       @P1C 10300000
SDSTR_STRUCTURE_NAME  EQU 0          Structure name                @P1C 10350000
SDSTR_CONTOKEN        EQU 16         Provide a CONTOKEN to include      10400000
*                                    user registry information that     10450000
*                                    relates to that user. This         10500000
*                                    should only be used for a          10550000
*                                    cache structure               @P1C 10600000
SDSTR_CONNAME         EQU 16         Provide a CONNAME to include       10606200
*                                    user registry information that     10612400
*                                    relates to that user. This         10618600
*                                    should only be used for a          10624800
*                                    cache structure               @L1A 10631000
*                     EQU 32         Reserved for IBM use          @L1A 10637200
*                     EQU 36         Reserved for IBM use          @L1A 10643400
*                     EQU 38         Reserved for IBM use          @L1A 10649600
*                     EQU 40         Reserved for IBM use          @L1A 10655800
*                     EQU 42         Reserved for IBM use          @L1A 10662000
*                     EQU 43         Reserved                      @L1A 10668200
SDSTR_RANGE_CNTR      EQU 44         Counter of how many range          10674400
*                                    and option entries follow this     10680600
*                                    structure entry               @L1M 10686800
SDSTR_STRUCTURE_FLAGS EQU 46         Structure level flag byte     @L1C 10693000
SDSTR_ACCTIME_NOLIMIT    EQU X'80'   Indicates that the time limit      10700000
*                                    specified on the IXLCONN macro     10750000
*                                    will be ignored to insure          10800000
*                                    that the entry data is dumped      10850000
*                                    serialized                    @D1C 10900000
*                     EQU   X'40'    Reserved for IBM use          @L1A 10950000
*                     EQU   X'20'    Reserved for IBM use          @L1A 11000000
SDSTR_CONNAME_ENTRY   EQU   X'10'    Indicates that the value in the    11050000
*                                    CONTOKEN/CONNAME field is a        11100000
*                                    CONNAME                       @L1A 11150000
*                     EQU   X'08'    Reserved                           11250000
*                     EQU   X'04'    Reserved                           11300000
*                     EQU   X'02'    Reserved                           11350000
*                     EQU   X'01'    Reserved                           11400000
*                     EQU   33       Reserved                      @P1C 11450000
SDSTR_STRUCTURE_LENGTH EQU  48       Length of STRLIST structure        11500000
*                                    entry                         @L1C 11550000
********************************************************************    11750000
*                                                                  *    11800000
*         STRLIST range and option entry - 12 bytes                *    11850000
*                                                                  *    11900000
********************************************************************    11950000
SDSTR_RANGE            EQU 0         STRLIST structure range and        12000000
*                                    option entry                  @P1C 12050000
SDSTR_RANGE_FLAG1      EQU 0         Range level flag byte 1       @P1C 12100000
SDSTR_ADJUNCT_CAPTURE  EQU X'80'     Indicates that the adjunct data    12150000
*                                    will be captured with control      12200000
*                                    data                               12250000
SDSTR_SUMMARY          EQU X'40'     Indicates summary of the range     12300000
*                                    be dumped.  Control elements       12350000
*                                    will be excluded from the dump     12400000
*                      EQU X'20'     Reserved                           12450000
*                      EQU X'10'     Reserved                           12500000
*                      EQU X'08'     Reserved                           12550000
*                      EQU X'04'     Reserved                           12600000
*                      EQU X'02'     Reserved                           12650000
*                      EQU X'01'     Reserved                           12700000
SDSTR_RANGE_FLAG2      EQU  1        Range level flag byte 2       @P1C 12750000
SDSTR_EDATA_SERIALIZE  EQU X'80'     Indicates that entry data for      12800000
*                                    each element in the range          12850000
*                                    should be included in the dump     12900000
*                                    and be dumped serialized           12950000
SDSTR_EDATA_UNSERIALIZE EQU X'40'    Indicates that entry data for      13000000
*                                    each element in the range          13050000
*                                    should be included in the dump     13100000
*                                    and be dumped unserialized         13150000
SDSTR_ADJUNCT_DIRECTIO EQU X'20'     Indicates that the adjunct data    13200000
*                                    should be retrieved with the       13250000
*                                    entry data which is not            13300000
*                                    captured                           13350000
*                      EQU X'10'     Reserved                           13400000
*                      EQU X'08'     Reserved                           13450000
*                      EQU X'04'     Reserved                           13500000
*                      EQU X'02'     Reserved                           13550000
*                      EQU X'01'     Reserved                           13600000
SDSTR_RANGE_FLAG3      EQU  2        Range level flag byte 3       @P1C 13650000
SDSTR_OBJECT_COCLASS   EQU X'80'     Indicates that the range           13700000
*                                    represents a range of cast-out     13750000
*                                    classes                            13800000
SDSTR_OBJECT_STGCLASS  EQU X'40'     Indicates that the range           13850000
*                                    represents a range of storage      13900000
*                                    classes                            13950000
SDSTR_OBJECT_LISTNUM   EQU X'20'     Indicates that the range           14000000
*                                    represents a range of              14050000
*                                    list numbers                       14100000
SDSTR_DUMP_ALL         EQU X'10'     Indicates that all elements of     14150000
*                                    a requested object will be         14200000
*                                    dumped.  If bit on, the fields     14250000
*                                    SDSTR_START_VALUE and              14300000
*                                    SDSTR_END_VALUE will be ignored    14350000
SDSTR_LOCKENTRIES      EQU X'08'     Indicates that lock table          14400000
*                                    entries should be included in      14450000
*                                    the dump.  This is only valid      14500000
*                                    for list structures.               14550000
SDSTR_USERCNTLS        EQU X'04'     Indicates that the user            14600000
*                                    attached controls should be        14650000
*                                    included in the dump               14700000
SDSTR_EVENTQS          EQU X'02'     Indicates that the user event      14721400
*                                    queues should be included in the   14742800
*                                    dump                          @02A 14764200
SDSTR_OBJECT_EMCONTROLS EQU X'01'    Indicates that the range           14785600
*                                    represents a range of event        14807000
*                                    monitoring controls           @02A 14828400
*                      EQU 3         Reserved                      @P1C 14850000
SDSTR_START_VALUE      EQU 4         Starting value for range      @P1C 14900000
SDSTR_END_VALUE        EQU 8         Ending value for range        @P1C 14950000
SDSTR_RANGE_LENGTH     EQU 12        Length of STRLIST structure   @P1C 15000000
*                                    range and option entry             15050000
********************************************************************    15100000
*                                                                  *    15150000
*                   Constants                                      *    15200000
*                                                                  *    15250000
********************************************************************    15300000
INIT_VERSION       EQU  1            Initial Version number             15350000
********************************************************************    15400000
*                                                                  *    15450000
*                   Return codes for IHABLDP                       *    15500000
*                                                                  *    15550000
********************************************************************    15600000
SUCCESS EQU  0                       Successful completion              15650000
FAIL    EQU  8                       IHABLDP failed                     15700000
********************************************************************    15750000
*                                                                  *    15800000
*                   Reason codes for IHABLDP                       *    15850000
*                                                                  *    15900000
********************************************************************    15950000
NO_REASON          EQU  0            No reason code                     16000000
INSUFFICIENT_SPACE EQU  4            Insufficient space in              16050000
*                                    the dump parameter list            16100000
*                                    to add the requested entry         16150000
INVALID_RANGE      EQU  8            Range entry was not added to       16200000
*                                    the dump parameter list            16250000
*                                    because the starting range         16300000
*                                    value was greater than the         16350000
*                                    ending range value.                16400000
.SDEND   ANOP                                                           16450000
         MEND  ,     */                                                 16500000
*%END;                           /*                                */   16550000
*                                                                       16600000
* %IF SDSTR_HDR_ATTR = '' %THEN                                         16650000
*   %SDSTR_HDR_ATTR = 'BASED';                                          16700000
*                                                                       16750000
* %IF SDSTR_LEN_ATTR = '' %THEN                                         16800000
*   %SDSTR_LEN_ATTR = 'BASED';                                          16850000
*                                                                       16900000
* %IF SDSTR_WRK_ATTR = '' %THEN                                         16950000
*   %SDSTR_WRK_ATTR = 'BASED';                                          17000000
*                                                                       17050000
* %IF SDSTR_STR_ATTR = '' %THEN                                         17100000
*   %SDSTR_STR_ATTR = 'BASED';                                          17150000
*                                                                       17200000
* %IF SDSTR_RNG_ATTR = '' %THEN                                         17250000
*   %SDSTR_RNG_ATTR = 'BASED';                                          17300000
*                                                                       17350000
* DCL 1 SDSTR_HEADER_MAP SDSTR_HDR_ATTR BDY(WORD),/* STRLIST Header for 17400000
*                                           IHABLDP                */   17450000
*       5 SDSTR_WORK_VAR_PTR PTR(31),    /* Pointer to IHABLDP work     17500000
*                                           areas                  */   17550000
*       5 SDSTR_VERSION      FIXED(31);  /* Version number         */   17600000
*                                                                       17650000
*/*******************************************************************/  17700000
*/*                                                                 */  17750000
*/*        STRLIST Length mapping - 8 bytes                         */  17800000
*/*                                                                 */  17850000
*/*  NOTE: The STRLIST length mapping is used to put the length of  */  17900000
*/*        the STRLIST into the header of the parameter list.  The  */  17950000
*/*        mapping maps the same area that the SDSTR_HEADER_MAP     */  18000000
*/*        maps.                                                    */  18050000
*/*                                                                 */  18100000
*/*******************************************************************/  18150000
* DCL 1 SDSTR_LENGTH_MAP SDSTR_LEN_ATTR BDY(WORD),/* STRLIST Header     18200000
*                                           for storing                 18250000
*                                           the length              */  18300000
*       5 SDSTR_LENGTH FIXED(31),        /* Total length of the STRLIST 18350000
*                                           STRLIST parameter list   */ 18400000
*       5 *            CHAR(4);          /* Reserved                 */ 18450000
*                                                                       18500000
*/********************************************************************/ 18550000
*/*                                                                  */ 18600000
*/*         IHABLDP work areas - 16 bytes                            */ 18650000
*/*                                                                  */ 18700000
*/********************************************************************/ 18750000
* DCL 1 SDSTR_WORK_AREA SDSTR_WRK_ATTR BDY(WORD), /* IHABLDP            18800000
*                                                   work areas       */ 18850000
*       5 SDSTR_NEXT_SPACE     PTR(31),  /* Next available space        18900000
*                                           pointer                  */ 18950000
*       5 SDSTR_CUR_STR_PTR    PTR(31),  /* Current structure entry     19000000
*                                           pointer                  */ 19050000
*       5 *                    CHAR(8);  /* Reserved                 */ 19100000
*                                                                       19150000
*/*******************************************************************/  19200000
*/*                                                                 */  19250000
*/*        STRLIST structure entry - 48 bytes                   @L1C*/  19300000
*/*                                                                 */  19350000
*/*******************************************************************/  19400000
* DCL 1 SDSTR_STRUCTURE SDSTR_STR_ATTR BDY(WORD), /* STRLIST            19450000
*                                                   structure entry  */ 19500000
*       5 SDSTR_STRUCTURE_NAME CHAR(16), /* Structure name           */ 19550000
*       5 SDSTR_CONTOKEN       CHAR(16), /* Provide a CONTOKEN to       19600000
*                                           include user registry       19650000
*                                           information that relates    19700000
*                                           to that user.  This should  19750000
*                                           only be used for a cache    19800000
*                                           structure                */ 19850000
*         10 SDSTR_CONNAME     CHAR(16), /* Provide a CONNAME to        19853100
*                                           include user registry       19856200
*                                           information that relates    19859300
*                                           to that user.  This should  19862400
*                                           only be used for a cache    19865500
*                                           structure            @L1A*/ 19868600
*       5 *                   FIXED(31), /* Reserved for IBM use @L1A*/ 19871700
*       5 *                   FIXED(16), /* Reserved for IBM use @L1A*/ 19874800
*       5 *                   FIXED(16), /* Reserved for IBM use @L1A*/ 19877900
*       5 *                   FIXED(16), /* Reserved for IBM use @L1A*/ 19881000
*       5 *                    CHAR(1),  /* Reserved for IBM use @L1A*/ 19884100
*       5 *                    CHAR(1),  /* Reserved             @L1A*/ 19887200
*       5 SDSTR_RANGE_CNTR    FIXED(16), /* Counter of how many range   19890300
*                                           and option entries follow   19893400
*                                           this structure entry @L1M*/ 19896500
*       5 SDSTR_STRUCTURE_FLAGS CHAR(1), /* Structure level flags    */ 19900000
*         10 SDSTR_ACCTIME_NOLIMIT  BIT(1), /* Indicates that the time  19950000
*                                           limit specified on the      20000000
*                                           IXLCONN macro will be       20050000
*                                           ignored to insure that      20100000
*                                           the entry data is dumped    20150000
*                                           serialized           @P1C*/ 20200000
*         10 *                    BIT(1),/* Reserved for IBM use @L1A*/ 20250000
*         10 *                    BIT(1),/* Reserved for IBM use @L1A*/ 20300000
*         10 SDSTR_CONNAME_ENTRY  BIT(1),/* Indicates that the value    20350000
*                                           in the CONTOKEN/CONNAME     20400000
*                                           field is a CONNAME   @L1A*/ 20450000
*         10 *                  BIT(4),  /* Reserved             @L1A*/ 20500000
*       5 *                    CHAR(1);  /* Reserved                 */ 20550000
*                                                                       20750000
*/*******************************************************************/  20800000
*/*                                                                 */  20850000
*/*        STRLIST range and option entry - 12 bytes                */  20900000
*/*                                                                 */  20950000
*/*******************************************************************/  21000000
* DCL 1 SDSTR_RANGE SDSTR_RNG_ATTR BDY(WORD), /* STRLIST structure      21050000
*                                               range and option        21100000
*                                               entry                */ 21150000
*       5 SDSTR_RANGE_FLAG1        CHAR(1), /* Range flags byte 1    */ 21200000
*         10 SDSTR_ADJUNCT_CAPTURE  BIT(1), /* Indicates that the       21250000
*                                              adjunct data will be     21300000
*                                              captured with control    21350000
*                                              data                  */ 21400000
*         10 SDSTR_SUMMARY          BIT(1), /* Indicates summary of     21450000
*                                              the range be dumped.     21500000
*                                              Control elements will    21550000
*                                              be excluded from the     21600000
*                                              dump                  */ 21650000
*         10 *                      BIT(6), /* Reserved              */ 21700000
*       5 SDSTR_RANGE_FLAG2        CHAR(1), /* Range flags byte 2    */ 21750000
*         10 SDSTR_EDATA_SERIALIZE  BIT(1), /* Indicates that entry     21800000
*                                              data for each element    21850000
*                                              in the range should be   21900000
*                                              included in the dump     21950000
*                                              and will be dumped       22000000
*                                              serialized            */ 22050000
*         10 SDSTR_EDATA_UNSERIALIZE BIT(1),/* Indicates that entry     22100000
*                                              data for each element    22150000
*                                              in the range should be   22200000
*                                              included in the dump     22250000
*                                              and will be dumped       22300000
*                                              unserialized          */ 22350000
*         10 SDSTR_ADJUNCT_DIRECTIO BIT(1), /* Indicates that the       22400000
*                                              adjunct data will be     22450000
*                                              retrieved with the       22500000
*                                              entry data which is not  22550000
*                                              captured              */ 22600000
*         10 *                      BIT(5), /* Reserved              */ 22650000
*       5 SDSTR_RANGE_FLAG3        CHAR(1), /* Range flags byte 3    */ 22700000
*         10 SDSTR_OBJECT_COCLASS   BIT(1), /* Indicates that the       22750000
*                                              range represents a       22800000
*                                              range of cast-out        22850000
*                                              classes               */ 22900000
*         10 SDSTR_OBJECT_STGCLASS  BIT(1), /* Indicates that the       22950000
*                                              range represents a       23000000
*                                              range of storage         23050000
*                                              classes               */ 23100000
*         10 SDSTR_OBJECT_LISTNUM   BIT(1), /* Indicates that the       23150000
*                                              range represents a       23200000
*                                              range of list numbers */ 23250000
*         10 SDSTR_DUMP_ALL         BIT(1), /* Indicates that all       23300000
*                                              of a requested object    23350000
*                                              will be dumped.  If bit  23400000
*                                              on, SDSTR_START_VALUE    23450000
*                                              and SDSTR_END_VALUE will 23500000
*                                              be ignored            */ 23550000
*         10 SDSTR_LOCKENTRIES      BIT(1), /* Indicates that lock      23600000
*                                              table entries should be  23650000
*                                              included in the dump.    23700000
*                                              This is only valid for   23750000
*                                              list structures       */ 23800000
*         10 SDSTR_USERCNTLS        BIT(1), /* Indicates that the user  23850000
*                                              attached controls        23900000
*                                              should be included in    23950000
*                                              the dump              */ 24000000
*         10 SDSTR_EVENTQS          BIT(1), /* Indicates that the user  24011100
*                                              event queues should be   24022200
*                                              included in the dump     24033300
*                                                                @02A*/ 24044400
*         10 SDSTR_OBJECT_EMCONTROLS BIT(1), /* Indicates that the range24055500
*                                              represents a range of    24066600
*                                              event monitoring controls24077700
*                                                                @02A*/ 24088800
*       5 *                        CHAR(1), /* Reserved              */ 24100000
*       5 SDSTR_START_VALUE       FIXED(32),/* Start value of the       24150000
*                                              range             @P2C*/ 24200000
*       5 SDSTR_END_VALUE         FIXED(32);/* End value of the         24250000
*                                              range             @P2C*/ 24300000
*                                                                       24350000
*/*******************************************************************/  24400000
*/*                                                                 */  24450000
*/*        STRLIST mapping length constants                         */  24500000
*/*                                                                 */  24550000
*/*        SDSTR_HEADER_LENGTH     - Length of STRLIST Header       */  24600000
*/*        SDSTR_WORK_LENGTH       - Length of IHABLDP's work area  */  24650000
*/*        SDSTR_STRUCTURE_LENGTH  - Length of STRLIST structure    */  24700000
*/*                                  entry                          */  24750000
*/*        SDSTR_RANGE_LENGTH      - Length of STRLIST range/option */  24800000
*/*                                  entry                          */  24850000
*/*                                                                 */  24900000
*/*******************************************************************/  24950000
* DCL SDSTR_HEADER_LENGTH FIXED(31)                                     25000000
*       CONSTANT(LENGTH(SDSTR_HEADER_MAP)),                             25050000
*                                                                       25100000
*      SDSTR_WORK_LENGTH FIXED(31)                                      25150000
*       CONSTANT(LENGTH(SDSTR_WORK_AREA)),                              25200000
*                                                                       25250000
*      SDSTR_STRUCTURE_LENGTH FIXED(31)                                 25300000
*       CONSTANT(LENGTH(SDSTR_STRUCTURE)),                              25350000
*                                                                       25400000
*      SDSTR_RANGE_LENGTH FIXED(31)                                     25450000
*       CONSTANT(LENGTH(SDSTR_RANGE));                                  25500000
*                                                                       25550000
*/******************************************************************/   25600000
*/*                                                                */   25650000
*/*                  Constants                                     */   25700000
*/*                                                                */   25750000
*/******************************************************************/   25800000
*  DCL INIT_VERSION FIXED(31) CONSTANT(1); /* Initial Version           25850000
*                                             number                */  25900000
*                                                                       25950000
*/*******************************************************************/  26000000
*/*                                                                 */  26050000
*/*                  Return codes for IHABLDP                       */  26100000
*/*                                                                 */  26150000
*/*******************************************************************/  26200000
*                                                                       26250000
*  DCL SUCCESS FIXED(31) CONSTANT(0);      /* Successful completion */  26300000
*                                                                       26350000
*  DCL FAIL    FIXED(31) CONSTANT(8);      /* IHABLDP failed        */  26400000
*                                                                       26450000
*/*******************************************************************/  26500000
*/*                                                                 */  26550000
*/*                  Reason codes for IHABLDP                       */  26600000
*/*                                                                 */  26650000
*/*******************************************************************/  26700000
*                                                                       26750000
*  DCL NO_REASON          FIXED(31) CONSTANT(0); /* No reason code  */  26800000
*                                                                       26850000
*  DCL INSUFFICIENT_SPACE FIXED(31) CONSTANT(4);                        26900000
*                                         /* Insufficient space in the  26950000
*                                            dump parameter list to     27000000
*                                            add the requested          27050000
*                                            entry                  */  27100000
*                                                                       27150000
*  DCL INVALID_RANGE  FIXED(31) CONSTANT(8);                            27200000
*                                         /* Range entry was not added  27250000
*                                            to the dump parameter list 27300000
*                                            because the starting       27350000
*                                            range value was greater    27400000
*                                            than the ending range      27450000
*                                            value                  */  27500000
*@EJECT;                                                                27550000
*%END;                                                                  27600000
