*         %GOTO PLSSVT1;             /*                                 00050000
         MACRO                                                          00100000
&SVTNAME IHASVT &CSECT=NO,&LIST=NO                                 @H2C 00150000
**/                                                                     00200000
*%PLSSVT1:;                                                             00250000
*/* START OF SPECIFICATIONS ******************************************/ 00275000
*/**** PROPRIETARY_STATEMENT *****************************************/ 00300000
*/*01* PROPRIETARY STATEMENT =                                   @LFC*/ 00325000
*/*                                                                  */ 00350000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00642800
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 00669600
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000                 */ 00709800
*/*                                                                  */ 00750000
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 00800000
*/*                                                                  */ 00850000
*/*01* STATUS:  HBB7703                                          @LHC*/ 00900000
*/*                                                                  */ 01050000
*/*01* DESCRIPTIVE NAME:  Supervisor Vector Table                    */ 01100000
*/*02*  ACRONYM:  SVT                                                */ 01150000
*/*                                                                  */ 01300000
*/*01* MACRO NAME:  IHASVT                                           */ 01350000
*/*                                                                  */ 01400000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 01408300
*/*02* NOTPI: BASE                                                   */ 01416600
*/*02* PI:   FIELDS  SVTSSTSV                                        */ 01424900
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01433200
*/*01*                                                               */ 01441500
*/*01* DSECT NAME:                                                   */ 01450000
*/*     SVT                                                          */ 01500000
*/*                                                                  */ 01550000
*/*01* COMPONENT:  Supervisor Control (SC1C5)                        */ 01562500
*/*                                                                  */ 01587500
*/*01* EYE-CATCHER:  None                                            */ 01587600
*/*                                                                  */ 01587700
*/*01* STORAGE ATTRIBUTES:                                           */ 01587800
*/*02*  RESIDENCY:  Nucleus                                          */ 01587900
*/*                                                                  */ 01588000
*/*01* SIZE:  Offset of SVTEND minus offset of SVT                   */ 01588100
*/*                                                                  */ 01588200
*/*01* CREATED BY:                                                   */ 01588300
*/*     IEAVESVT                                                     */ 01588400
*/*                                                                  */ 01588500
*/*01* POINTED TO BY:                                                */ 01588600
*/*     CVTSVT field of the CVT data area                            */ 01588700
*/*     PSASVT field of the PSA data area                            */ 01588800
*/*                                                                  */ 01588900
*/*01* SERIALIZATION:                                                */ 01589000
*/*     SVTDSREQ - Dispatcher lock                                   */ 01589100
*/*     SVTGSMQ, GSPL, LSMQ, SVTWAS - Compare & Swap                 */ 01589200
*/*     SVTDACTV - Disablement                                       */ 01589300
*/*     SVTPWAIT - Disablement                                       */ 01589400
*/*                                                                  */ 01589500
*/*01* FUNCTION:                                                     */ 01589600
*/*02*  Contains service routine addresses and control blocks used   */ 01589700
*/*     by Supervisor Control.                                       */ 01589800
*/*                                                                  */ 01589900
*/*01* METHOD OF ACCESS:                                             */ 01590000
*/*02*  ASM:                                                         */ 01590100
*/*      DSECT is always produced unless CSECT=YES is specified on   */ 01590200
*/*      macro call.                                                 */ 01590300
*/*      Specify LIST=YES on Macro call for listing.                 */ 01590400
*/*02*  PL/AS:                                                       */ 01590500
*/*      Is Based on PSASVT.                                         */ 01590600
*/*      Specify %IHALIST='YES' before %INCLUDE for a PL/AS listing. */ 01590700
*/*                                                                  */ 01590800
*/*01* DEPENDENCIES:                                                 */ 01590900
*/*      None.                                                       */ 01591000
*/*                                                                  */ 01591100
*/*01* DISTRIBUTION LIBRARY:  AMACLIB                                */ 01591200
*/*                                                                  */ 01591300
*/*01* CHANGE ACTIVITY:                                              */ 01591400
*/*  $L7=PR313    JBB3313  891128  PD16EI:  SHOWHDR format complete  */ 01591500
*/*                                                                  */ 01591600
*/* END OF SPECIFICATIONS ********************************************/ 01591700
*%GOTO PLSSVT2;            /*                                           01594500
.*                                                                      01598000
.*********************************************************************  01601500
.*   CHANGE ACTIVITY =                                                  01605000
.*                                                                      01608500
.*  $H1=ADVPROC2  JBB2133  821013  PD16F5:  AXP                         01612000
.*  $H2=VF        JBB2214  840227  PD16XK:  VECTOR FEATURE              01615500
.*  $D1=DCR0017   JBB2214  841017  PD16H4:  DELETE THE IEAVVRCV VCON    01619000
.*  $L1=TRQ       JBB2217  850325  PD16FN:  TRUE READY QUEUE            01620700
.*  $L2=RASENH    JBB2220  840618  PD16XK:  RAS ENHANCEMENTS FOR RTM    01621300
.*  $D2=DCR0026   JBB2220  840914  PD16R8:  IEEVEXSN INTERFACE CHANGE   01621900
.*  $01=OY02544   JBB2217  861101  PD16H4:  FINDSRB PERFORMANCE         01622000
.*  $02=OY08578   JBB2220  861231  PD16H5:  TCB AND SRB TIMING SUPPORT  01622100
.*  $L3=AR        HBB3310  850903  PD16Q9:  ACCESS REGISTERS            01622200
.*  $L4=CONSVSCR  HBB3310  860416  PD16H5:  CONSOLE VSCR SUPPORT        01622300
.*  $D3=DCR0011   HBB3310  860630  PD16LD:  NULL LINKAGE STACK SUPPORT  01622400
.*  $L5=AR        HBB3310  861027  PD16AH:  REUSABLE EAX                01622500
.*  $L6=DATASPAC  HBB3310  861027  PD16AG:  DATA SPACES                 01622600
.*  $D4=DCR0147   HBB3310  871602  PD16BN:  EXCESSIVE SPIN IMPROVEMENT  01623000
.*  $D5=DCR0220   HBB3310  870216  PD16FH:  REDUCED PREEMPTION          01623600
.*  $D6=DCR0228   HBB3310  870216  PD16FH:  INCREASED SAVEAREA SIZE     01624200
.*                                          FOR IEAVESTS                01624800
.*  OY08963 - CHANGE NUMBER OF SYSTEM LXS (SVTNSLX)            @YA08963 01625100
.*  $03=OY11015   HBB3310  880115  PD16BN:  INCREASE SVTMCBCT FROM      01625200
.*                                          X'7FFF0010' TO X'7FFF0050'  01625300
.*  OY10908 - Integrity                                        @YA10908 01625400
.*                                                                      01625500
.*  OY13926 - DECREASE SVTMCBCT FROM X'7FFF0050' TO X'7FFF0003'         01625600
.*                                                             @YA13926 01625700
.*  $L8=LOCKR     HBB4410  870316  PD16Q4:  LOCK RESTRUCTURE            01625800
.*  $L9=LOCKR     HBB4410  870831  PD16Q9:  LOCK RESTRUCTURE            01625900
.*  $LA=COUPL     HBB4410  880711  PD16Q4:  XCF SUPPORT                 01626000
.*  $04=OY20822   JBB3311  890227  PD16BN:  Common Area Data Space      01626400
.*                                          Support SPE                 01627100
.*  $05=OY29197   HBB3310  900201  PD16CV:  HIGH PERFORMANCE PARALLEL   01627300
.*                                          INTERFACE SUPPORT (AKA HSC) 01627500
.*  $06=OY27050   JBB3313  890403  PD16ES:  ENCRYPTION ASYMMETRIC       01627600
.*                                          FEATURE SUPPORT             01627700
.*  $07=OY58195   HBB4430  920915  PD16H5:  Alternate Wait Management   01627800
.*  $LB=DISPR     HBB5510  930801  PD16EJ:  Dispatcher Restructure      01627900
.*  $LC=DISPR     HBB5510  930801  PDAG:    Dispatcher Restructure      01628000
.*  $LD=DISPR     HBB5510  930801  PD16XZ:  Dispatcher Restructure      01628100
.*  $LE=DISPR     HBB5510  930801  PD16CU:  Dispatcher Restructure      01628200
.*  $08=OW02794   HBB5510  931207  PD162M:  XES performance support     01628300
.*  $LF=ENCLV     HBB5520  940210  PD16AA:  ENCLAVE support             01628400
.*  $LG=ENCLV     HBB5520  940210  PD16XZ:  ENCLAVE support             01628600
.*  $09=OW05328   HBB5510  940629  PD16GD:  XES performance support     01628700
.*  $0A=OW19665   HBB5510  960506  R4GAXZ:  CMSET DIE entry points      01628800
.*  $0B=OW22516   HBB5510  960918  R4GAXZ:  Increase NSLX to 165.       01628900
.*  $LH=IEEESUP   HBB6606  971001  PD00XB:  Larger SVTSSTSV             01629000
.*  $P1=PWK0260   HBB6608  981012  R4GAXZ:  Delete SVTSSRBE/M/C/P/S/A   01629200
.*  $0C=OW33027   HBB5520  980518  R4GAXZ:  Increase SSRBM from 22      01629300
.*                                          to 80. **This fix does      01629400
.*                                          not roll into HBB6608.      01629500
.*                                          This function was           01629600
.*                                          redesigned in HBB6608.**    01629700
.*  $LI=64BITSUP  HBB7703  971101  PD00XB:  Larger SVTSSTSV             01629900
.*                                                                      01630600
.*********************************************************************  01631300
.*                                                                      01632000
.*********************************************************************  01633000
.*                                                                      01636500
.* THE FOLLOWING ARE THE NAMING CONVENTIONS USED FOR RESERVED AREAS     01640000
.*     1. RESERVED FIELDS ARE NAMED AS FOLLOWS                          01643500
.*                        SVTRXXX  DC    XLNNN'00' - RESERVED.          01647000
.*                            XXX IS THE OFFSET WITHIN THE SVT          01650500
.*                            NNN IS THE LENGTH OF THE RESERVED FIELD   01654000
.*                                A VALUE FROM 1 TO 256 INCLUSIVE       01657500
.*                                                                      01661000
.*     2. PL/S - RESERVED FIELDS DEFINED AS BIT STRINGS WHICH ARE NOT   01664500
.*               MULTIPLES OF 8 OR DO NOT START ON A BYTE BOUNDARY      01668000
.*               ARE NOT NAMED.                                         01671500
.*                                                                      01675000
.*********************************************************************  01678500
         PUSH  PRINT                                               @H2A 01682000
         AIF   ('&LIST' EQ 'YES').SVTLIST                          @H2A 01685500
         PRINT OFF                                                 @H2A 01689000
.SVTLIST ANOP                                                      @H2A 01692500
         SPACE 1                                                        01696000
         AIF ('&CSECT' EQ 'NO').A1                                      01700000
&SVTNAME CSECT                                                          01750000
         AGO   .A2                                                      01800000
.A1      ANOP                                                           01850000
SVT      DSECT                                                          01900000
.A2      ANOP                                                           01950000
SVTISECT DC    V(IEAVEINT)         ADDRESS OF INTERSECT ROUTINE         02000000
SVTGSCH1 DC    V(IEAVESC3)         ADDRESS OF GLOBAL SCHEDULE ROUTINE   02050000
*                                  FOR ENABLED USERS                    02100000
SVTGSCH2 DC    V(IEAVESC4)         ADDRESS OF GLOBAL SCHEDULE ROUTINE   02150000
*                                  FOR DISABLED USERS                   02200000
SVTR00C  DC    XL4'00'              Reserved.                      @LBC 02222700
*                                   SERIALIZATION: None                 02245400
*                                   OWNERSHIP: Supervisor Control       02268100
SVTWEEF  DC    A(0)                 Address of the first WEB      @LBA  02313500
*                                   Extent Element Pool.                02336200
*                                   SERIALIZATION: Compare and Swap or  02358900
*                                   Global Recovery protocols.          02381600
*                                   OWNERSHIP: Supervisor Control       02404300
SVTRSCS  DC    V(IEAVRSCS)         RESUME CONDITIONAL ENTRY PT @G387PXU 02450000
SVTJSTEQ DC    F'0'                JOB STEP TIME EXCEEDED QUE           02500000
SVTDSREQ DS    0F                  DISPATCHER SERIALIZATION REQUIRED    02550000
SVTSRQ1  DC    XL1'0'              FIRST BYTE OF SVTDSREQ               02600000
SVTDSG4  EQU   X'80'               SIGNAL WAITING PROCESSORS            02650000
SVTDFLT  EQU   X'40'               DEFAULT GLOBAL INTERSECT             02700000
SVTSRQ2  DC    XL1'0'              SECOND BYTE OF SVTDSREQ              03050000
SVTDSG3  EQU   X'80'               SIGNAL WAITING PROCESSORS            03100000
SVTSRM1  EQU   X'02'               SRM IS INTERSECTING                  03400000
SVTQVER  EQU   X'01'               Q VERIFICATION INTERSECTING          03450000
SVTSRQ3  DC    XL1'0'              THIRD BYTE OF SVTDSREQ               03500000
SVTDSG2  EQU   X'80'               SIGNAL WAITING PROCESSORS            03550000
SVTRCTI  EQU   X'40'               RCT INTERSECTING            @ZM48358 03600000
SVTTCBV  EQU   X'20'               TCB VERIFICATION INTERSECTING        03650000
SVTACHA  EQU   X'10'               ASCB CHAP INTERSECTING               03700000
SVTMTER  EQU   X'04'               MEMTERM INTERSECTING                 03800000
SVTMINI  EQU   X'02'               MEMORY INIT INTERSECTING             03850000
SVTCBVE  EQU   X'01'               CONTROL BLOCK VERIFICATION INTER     03900000
SVTSRQ4  DC    XL1'0'              FOURTH BYTE OF SVTDSREQ              03950000
SVTDSG1  EQU   X'80'               SIGNAL WAITING WAITING PROCESSORS    04000000
SVTDETA  EQU   X'40'               DETACH INTERSECTING                  04050000
SVTATTA  EQU   X'20'               ATTACH INTERSECTING                  04100000
SVTRTM2  EQU   X'10'               RTM2 INTERSECTING                    04150000
SVTRTM1  EQU   X'08'               RTM1 INTERSECTING                    04200000
SVTCHAP  EQU   X'04'               TCB CHAP INTERSECTING                04250000
SVTSTAT  EQU   X'02'               STATUS INTERSECTING                  04300000
SVTPURD  EQU   X'01'               PURGE DQ INTERSECTING                04350000
SVTGSRB  DS    0D                  GLOBAL SRB QUEUES                    04400000
SVTGSMQ  DC    F'0'                GLOBAL SERVICE MANAGEMENT QUEUE      04450000
         AIF   ('&CSECT' EQ 'NO').B1                                    04500000
IEAGSMQ  EQU   SVTGSMQ                                                  04550000
         ENTRY IEAGSMQ                                                  04600000
.B1      ANOP                                                           04650000
SVTGSPL  DC    XL4'FFFFFFFF'        No longer used. Must remain    @LBC 04666600
*                                   x'FFFFFFFF'.                        04683200
*                                   SERIALIZATION: None                 04699800
*                                   OWNERSHIP: Supervisor Control       04716400
         AIF   ('&CSECT' EQ 'NO').C1                                    04750000
IEAGSPL  EQU   SVTGSPL                                                  04800000
         ENTRY IEAGSPL                                                  04850000
.C1      ANOP                                                           04900000
SVTLSMQ  DC    F'0'                LOCAL SERVICE MANAGEMENT QUEUE       04950000
         AIF   ('&CSECT' EQ 'NO').D1                                    05000000
IEALSMQ  EQU   SVTLSMQ                                                  05050000
         ENTRY IEALSMQ                                                  05100000
.D1      ANOP                                                           05150000
SVTWAS   DS    0F                  WAIT ADDRESS SPACE VECTOR   USED     05200000
*                                  TO SIGP MEMORY SWITCH TO WAITING     05250000
*                                  PROCESSOR                            05300000
SVTWAS00 DC    16F'0'              WASV                                 05350000
         DS    0F                                              @G860PXD 05400000
         DC    XL4'FFFFFFFF'       PREVIOUSLY SVTDACTV -       @G860PXD 05435700
*                                  MUST ALWAYS REMAIN NONZERO  @G860PXD 05471400
SVTAPCP  DC    H'4'                Initial value for the number of @LEC 05477300
*                                  WEBs that must be on a WUQ      @LEC 05483200
*                                  as a gating factor for AWM SIGP @LEC 05489100
*                                  SERIALIZATION: NONE             @LEC 05495000
*                                  OWNERSHIP: SRM                  @LEC 05500900
SVTLASTS DC    XL1'00'             Last CP signalled for alternate wait 05507100
*                                  management                      @07A 05519000
SVTR073  DC    XL5'00'             RESERVED.                       @LDC 05523700
SVTCRSCR DC    V(IEAVCRSC)         Address of the Supervisor       @LDA 05528400
*                                  Checkpoint/Restart SRB Check    @LDA 05533100
*                                  Routine.                        @LDA 05537800
         DC    XL4'FFFFFFFF'       PREVIOUSLY SVTPWAIT -       @G860PXD 05542800
*                                  MUST ALWAYS REMAIN NONZERO  @G860PXD 05578500
SVTWPSCT DC    F'0' -              Count of SIGPs to waiting processors 05580000
*                                  due to timeout between waits    @07A 05581500
*                                  SERIALIZATION: NONE             @02A 05583000
SVTMSWCT DC    F'0' -              Count of SIGPs to waiting processors 05584500
*                                  due to WUQADD                   @07A 05586000
*                                  SERIALIZATION: NONE             @02A 05587500
         AIF   ('&CSECT' EQ 'YES').D2                              @02A 05589500
SVTACTR  DC    V(IEAVRT05)         ADDRESS OF ACCUMULATED CPU TIME @02A 05595000
*                                  SERVICE ROUTINE USED BY TIMEUSED     05600500
*                                  MACRO                                05606000
         AGO   .D3                                                 @02A 05611500
.D2      ANOP                                                      @02A 05617000
         EXTRN IEAVRT05                                            @02A 05622500
SVTACTR  DC    A(X'80000000'+IEAVRT05) ADDRESS OF ACCUMULATED CPU  @02A 05628000
*                                  TIME SERVICE ROUTINE USED BY         05633500
*                                  TIMEUSED MACRO                       05639000
.D3      ANOP                                                      @02A 05644500
SVTISECR DC    V(IEAVEINR)         INTERSECT RESET ROUTINE              05650000
SVTXASCB DC    F'0'                ADDRESS OF PC/AUTH ASCB.    @G387PXU 05700000
SVTXMD   DC    F'0'                ADDRESS OF CROSS MEMORY     @G387PXU 05750000
*                                  DIRECTORY (XMD)             @G387PXU 05800000
*                                  (IN PC/AUTH ADDRESS SPACE). @G387PXU 05850000
SVTGSPH  DC    V(IEASTKH)          ADDRESS OF GLOBAL STACK     @G387PXU 05900000
*                                  POOL HEADER FOR PCLINK      @G387PXU 05950000
*                                  SERVICE.                    @G387PXU 06000000
SVTMCADS DC    H'25'               MAXIMUM NUMBER OF ALE SLOTS IN  @04C 06037500
*                                  A PASN ACCESS LIST RESERVED FOR      06075000
*                                  CADS. INITIALIZED TO 25. MAY BE      06112500
*                                  CHANGED BY IEAVNP09.                 06150000
SVTMPALE DC    H'0'                NUMBER OF NON-CADS PASN ACCESS  @04A 06187500
*                                  LIST ENTRIES. INITIALIZED BY         06225000
*                                  IEAVNP09.                            06262500
SVTBBR   DC    V(IEAVEBBR)         ADDRESS OF THE BIND BREAK   @G387PXU 06300000
*                                  ROUTINE.                    @G387PXU 06350000
         AIF   ('&CSECT' EQ 'NO').SVT001A                          @LIA 06362500
         WXTRN IEAVLACB                                            @LIA 06375000
SVTLASCB DC    A(IEAVLACB)         ADDRESS OF LOCASCB SERVICE  @G387PXU 06387500
         AGO   .SVT001B                                            @LIA 06400000
.SVT001A ANOP                                                      @LIA 06412500
SVTLASCB DS    A                   ADDRESS OF LOCASCB SERVICE  @G387PXU 06425000
.SVT001B ANOP                                                      @LIA 06437500
*                                  ROUTINE.                    @G387PXU 06450000
SVTCMCKM DC    X'80000000'         CMSET CONSTANT FOR ICMA     @G387PXU 06500000
*                                  CHECK.                      @G387PXU 06550000
         AIF   ('&CSECT' EQ 'NO').SVT002A                          @LIA 06562500
         WXTRN IEAVCMS1                                            @LIA 06575000
SVTCMST1 DC    A(IEAVCMS1)         ADDRESS OF CMSET SET        @G387PXU 06587500
         AGO   .SVT002B                                            @LIA 06600000
.SVT002A ANOP                                                      @LIA 06612500
SVTCMST1 DS    A                   ADDRESS OF CMSET SET        @G387PXU 06625000
.SVT002B ANOP                                                      @LIA 06637500
*                                  ROUTINE.                    @G387PXU 06650000
         AIF   ('&CSECT' EQ 'NO').SVT003A                          @LIA 06662500
         WXTRN IEAVCMR1                                            @LIA 06675000
SVTCMRT1 DC    A(IEAVCMR1)         ADDRESS OF CMSET RESET,     @G387PXU 06687500
         AGO   .SVT003B                                            @LIA 06700000
.SVT003A ANOP                                                      @LIA 06712500
SVTCMRT1 DS    A                   ADDRESS OF CMSET RESET,     @G387PXU 06725000
.SVT003B ANOP                                                      @LIA 06737500
*                                  CHKAUTH=YES ROUTINE.        @G387PXU 06750000
         AIF   ('&CSECT' EQ 'NO').SVT004A                          @LIA 06762500
         WXTRN IEAVCMR2                                            @LIA 06775000
SVTCMRT2 DC    A(IEAVCMR2)         ADDRESS OF CMSET RESET,     @G387PXU 06787500
         AGO   .SVT004B                                            @LIA 06800000
.SVT004A ANOP                                                      @LIA 06812500
SVTCMRT2 DS    A                   ADDRESS OF CMSET RESET,     @G387PXU 06825000
.SVT004B ANOP                                                      @LIA 06837500
*                                  CHKAUTH=NO ROUTINE.         @G387PXU 06850000
         AIF   ('&CSECT' EQ 'NO').SVT005A                          @LIA 06862500
         WXTRN IEAVCMST                                            @LIA 06875000
SVTCMSTR DC    A(IEAVCMST)         ADDRESS OF CMSET SSARTO     @G387PXU 06887500
         AGO   .SVT005B                                            @LIA 06900000
.SVT005A ANOP                                                      @LIA 06912500
SVTCMSTR DS    A                   ADDRESS OF CMSET SSARTO     @G387PXU 06925000
.SVT005B ANOP                                                      @LIA 06937500
*                                  ROUTINE.                    @G387PXU 06950000
         AIF   ('&CSECT' EQ 'NO').SVT006A                          @LIA 06962500
         WXTRN IEAVCMSB                                            @LIA 06975000
SVTCMSBR DC    A(IEAVCMSB)         ADDRESS OF CMSET SSARBACK   @G387PXU 06987500
         AGO   .SVT006B                                            @LIA 07000000
.SVT006A ANOP                                                      @LIA 07012500
SVTCMSBR DS    A                   ADDRESS OF CMSET SSARBACK   @G387PXU 07025000
.SVT006B ANOP                                                      @LIA 07037500
*                                  ROUTINE.                    @G387PXU 07050000
         AIF   ('&CSECT' EQ 'NO').SVT007A                          @LIA 07062500
         WXTRN IEAVCDEN                                            @LIA 07075000
SVTCDSPE DC    A(IEAVCDEN)         ADDRESS OF CALLDISP ROUTINE @G387PXU 07087500
         AGO   .SVT007B                                            @LIA 07100000
.SVT007A ANOP                                                      @LIA 07112500
SVTCDSPE DS    A                   ADDRESS OF CALLDISP ROUTINE @G387PXU 07125000
.SVT007B ANOP                                                      @LIA 07137500
*                                  FOR ENABLED CALLERS.        @G387PXU 07150000
         AIF   ('&CSECT' EQ 'NO').SVT008A                          @LIA 07162500
         WXTRN IEAVCDDS                                            @LIA 07175000
SVTCDSPD DC    A(IEAVCDDS)         ADDRESS OF CALLDISP ROUTINE @G387PXU 07187500
         AGO   .SVT008B                                            @LIA 07200000
.SVT008A ANOP                                                      @LIA 07212500
SVTCDSPD DS    A                   ADDRESS OF CALLDISP ROUTINE @G387PXU 07225000
.SVT008B ANOP                                                      @LIA 07237500
*                                  FOR DISABLED CALLERS.       @G387PXU 07250000
SVTSRBSV DC    V(IEAVESTS)         ADDRESS OF SRBSTAT SAVE     @G387PXU 07300000
*                                  ROUTINE.                    @G387PXU 07350000
SVTSRBRS DC    V(IEAVESTR)         ADDRESS OF SRBSTAT RESTORE  @G387PXU 07400000
*                                  ROUTINE.                    @G387PXU 07450000
SVTAFFST DC    V(IEAVESAS)         ADDRESS OF SSAFF SET        @G387PXU 07500000
*                                  ROUTINE.                    @G387PXU 07550000
SVTAFFOB DC    V(IEAVESAF)         ADDRESS OF SSAFF OBTAIN     @G387PXU 07600000
*                                  ROUTINE.                    @G387PXU 07650000
SVTSRBG  DC    V(IEAVSPM1)         ADDRESS OF GETSRB ROUTINE.  @G387PXU 07700000
SVTSSRBG DC    V(IEAVSPM2)         ADDRESS OF GETSSRB ROUTINE. @G387PXU 07750000
SVTSRBF  DC    V(IEAVSPM3)         ADDRESS OF FREESRB ROUTINE. @G387PXU 07800000
SVTSSRBF DC    V(IEAVSPM4)         ADDRESS OF FREESSRB ROUTINE @G387PXU 07850000
SVTSRBP  DS    0D                  SUPERVISOR SRB POOL HEADER. @G387PXU 07900000
*                                  SERIALIZATION - CDS.        @G387PXU 07950000
SVTSRBS  DC    F'0'                SRB POOL ELEMENT SYNC COUNT @G387PXU 08000000
SVTSRBA  DC    F'0'                ADDRESS OF FIRST AVAILABLE  @G387PXU 08050000
*                                  SRB.                        @G387PXU 08100000
SVTSRBE  DS    0F                  SRB POOL EXTENT COUNTS.     @G387PXU 08150000
*                                  SERIALIZATION - SALLOC.     @G387PXU 08200000
SVTSRBM  DC    H'3'                MAX SRB POOL EXTENTS.           @LAC 08250000
SVTSRBC  DC    H'0'                CURRENT SRB POOL EXTENTS.   @G387PXU 08300000
SVTR0F4  DC    F'0'                Reserved. Formerly SVTSSRBE/M/C @P1C 08350000
SVTR0F8  DC    XL8'00'             Reserved. Formerly SVTSSRBP/S/A @P1C 08400000
SVTSVT   DC    CL4'SVT '           SVT ACRONYM.                @G387PXU 08800000
SVTRSUA  DC    V(IEAVRSUA)         ADDRESS OF RESUME ROUTINE   @G387PXU 08850000
*                                  FOR ASYNCHRONOUS            @G387PXU 08900000
*                                  UNCONDITIONAL OPTION.       @G387PXU 08950000
SVTRSCA  DC    V(IEAVRSCA)         ADDRESS OF RESUME ROUTINE   @G387PXU 09000000
*                                  FOR ASYNCHRONOUS            @G387PXU 09050000
*                                  CONDITIONAL OPTION.         @G387PXU 09100000
SVTRSUS  DC    V(IEAVRSUS)         ADDRESS OF RESUME ROUTINE   @G387PXU 09150000
*                                  FOR SYNCHRONOUS             @G387PXU 09200000
*                                  UNCONDITIONAL OPTION        @G387PXU 09250000
*                                  WITH ASCB SPECIFIED.        @G387PXU 09300000
SVTDSBCT DS    0XL4 -              MAXIMUM NUMBER OF WEBs the      @07C 09306200
*                                  DISPATCHER CAN PROCESS BEFORE   @07C 09312400
*                                  INVOKING RECOVERY.              @07C 09318600
*                                                                       09324800
*   7FFF0026 is the initial value of SVTDSBCT, but will be replaced by  09331000
*   the SRM RIM, during NIP.  The low half of the value is an           09337200
*   approximation of the number of instructions required during the     09343400
*   dispatcher work search processing to look at one WEB                09349600
*   from the WUQ.  The high half of this value is used only until this  09355800
*   value is replaced, and serves just to make this a large number.     09362000
*                                                                       09368200
         DC    XL1'7F' -                                           @07A 09374400
SVTCHKWP EQU   X'80'               CHECK WAITING PROCESSOR IF ON   @07A 09380600
         DC    XL2'FF00' -                                         @07A 09386800
         DC    XL1'26' -                                           @07A 09393000
SVTAWM   EQU   X'01'               ALTERNATE WAIT MANAGEMENT       @07A 09399200
*                                  ENABLED FLAG (SVTDSBCT LOW BIT) @07A 09405400
*                                  SET BY SRM                      @07A 09411600
*                                  SERIALIZATION: NONE             @07A 09417800
SVTMCBCT DC    X'7FFF0003' -       Maximum number of times to      @LBC 09429800
*                                  loop on a locked WEB before          09441800
*                                  invoking Global Recovery.  The last  09453800
*                                  byte of this field should be equal   09465800
*                                  to the number of instructions        09477800
*                                  executed by the dispatcher in its    09489800
*                                  worksearch loop used to lock a WEB.  09501800
*                                  SERIALIZATION: None                  09513800
*                                  OWNERSHIP: SRM                       09525800
SVTFW1   DS    0F                  FULLWORD SERIALIZED BY CS.  @G387PXU 09550000
SVTCS1   DC    X'00'               FIRST BYTE OF CS WORD.      @G387PXU 09600000
SVTXMSOP EQU   X'80'               PC/AUTH SERVICE ROUTINES    @G387PXU 09650000
*                                  OPERABLE.                   @G387PXU 09700000
SVTXMSUP EQU   X'40'               PC/AUTH ADDRESS SPACE       @G387PXU 09750000
*                                  INITIALIZED.                @G387PXU 09800000
SVTXMCMF EQU   X'20'               CROSS MEMORY CONNECTIONS        @L5A 09807100
*                                  MANAGER HAS FAILED.             @L5A 09814200
*                                  REUSABILITY FUNCTIONS ARE NOT   @L5A 09821300
*                                  OPERATIONAL.  SERIALIZED BY     @L5A 09828400
*                                  PC/AUTH LOCAL LOCK.  SET BY     @L5A 09835500
*                                  IEAVXMCM RECOVERY.              @L5A 09842600
*                                                                 1@LID 09845000
*                                                              @YA10908 09847400
SVTR119  DC    XL3'00'             RESERVED.                   @G387PXU 09850000
*                                  SERIALIZATION - CS.         @G387PXU 10200000
SVTDSPC  DC    V(IEAVDSPC)         ADDRESS OF DISPATCHER ENTRY @G387PXU 10250000
*                                  POINT FOR STOP ROUTINE      @G387PXU 10300000
*                                  CALLERS.                    @G387PXU 10350000
SVTAFTR  DC    F'0'                VIRTUAL ADDRESS OF ADDRESS  @G387PXU 10400000
*                                  SPACE FIRST TABLE (AFT)     @G387PXU 10450000
*                                  CONTAINING REAL ADDRESSES.  @G387PXU 10500000
SVTAFTV  DC    F'0'                VIRTUAL ADDRESS OF ADDRESS  @G387PXU 10550000
*                                  SPACE FIRST TABLE (AFT)     @G387PXU 10600000
*                                  CONTAINING VIRTUAL          @G387PXU 10650000
*                                  ADDRESSES.                  @G387PXU 10700000
SVTSSEM  DC    V(IEAVESSE)         ADDRESS OF SPACE SWITCH     @G387PXU 10750000
*                                  EVENT MANAGER.              @G387PXU 10800000
SVTISSAT DC    V(IEAISSAT)         ADDRESS OF INITIAL          @G387PXU 10850000
*                                  SUBSYSTEM AFFINITY TABLE    @G387PXU 10900000
*                                  FOR ALL TASKS.              @G387PXU 10950000
SVTSSTSV DC    F'1296'             LENGTH REQUIRED FOR             @LIC 11000000
*                                  SRB STATUS SAVE AREA.                11050000
SVTWTSS  DC    F'0'                Short wait time slice           @09C 11100000
SVTMDLQ  DC    F'0'                MEMORY DELETE QUEUE HEADER  @G387PXU 11200000
*                                  FOR ASCBS THAT CANNOT BE    @G387PXU 11250000
*                                  FREED.                      @G387PXU 11300000
SVTSLWLN DC    F'0'                SLIP/PER WORK AREA LENGTH   @G387PXU 11350000
*                                  REQUIRED FOR EACH PROCESSOR @G387PXU 11400000
SVTSRBMD DC    V(IEAVESTM)         ADDRESS OF SRBSTAT MODIFY   @G387PXU 11450000
*                                  ROUTINE.                    @G387PXU 11500000
SVTR144  DC    XL2'00'             RESERVED.                       @H2C 11550000
SVTNSLX  DC    H'165'              NUMBER OF SYSTEM LXS BEYOND     @0BC 11590600
*                                  THE HIGHEST SYSTEM FUNCTION          11631200
*                                  TABLE LX.                            11671800
SVTSET1  DC    V(IEAVSET1)         ADDRESS OF STATUS ENTRY     @G387PXU 11712400
*                                  POINT TO SIGPCPUS ROUTINE.  @G387PXU 11724800
SVTISECG DC    V(IEAVEING)         ADDRESS OF INTERSECT GLOBAL @G860PXH 11726600
*                                  ENTRY POINT                 @G860PXH 11728400
SVTISECL DC    V(IEAVEINL)         ADDRESS OF INTERSECT LOCAL  @G860PXH 11730200
*                                  ENTRY POINT                 @G860PXH 11732000
SVTSWUQ  DC    A(0)                 System WUQ (SWUQ) header       @LBC 11733300
*                                   address.                            11734600
*                                   INITIALIZED: IEAVINIT               11735900
*                                   SERIALIZATION: WEB Lock Protocol    11737200
*                                   OWNERSHIP: Supervisor Control       11738500
         AIF   ('&CSECT' EQ 'NO').SVT009A                          @LIA 11739000
         WXTRN IEAVCMS2                                            @LIA 11739500
SVTCMST2 DC    A(IEAVCMS2)         Address of CMSET SET,DIE=YES    @0AC 11740000
         AGO   .SVT009B                                            @LIA 11740500
.SVT009A ANOP                                                      @LIA 11741000
SVTCMST2 DS    A                   Address of CMSET SET,DIE=YES    @0AC 11741500
.SVT009B ANOP                                                      @LIA 11742300
*                                  routine.                             11743100
SVTBEST@ DC    A(0)                Address of XES Back End         @08A 11745500
*                                  Schedule Table (BEST).               11746000
*                                  SERIALIZATION: XES-determined        11746500
*                                  protocol                             11747000
*                                  OWNERSHIP: XES                       11747500
         DS    0D                  INSURE DOUBLEWORD BDY       @G860PXD 11748300
SVTDACTV DC    16XL1'0'            DISPATCHER ACTIVE INDICATOR @G860PXD 11748400
SVTDLID  EQU   X'40'               HIGH ORDER BIT OF PROCESSOR     @D5A 11748700
*                                  ID MAY BE CHECKED AS A FAST          11748800
*                                  TEST OF DISPATCHER ACTIVE            11748900
SVTDPRMT EQU   X'20'               TASK TIME SLICE FLAG            @D5A 11749000
*                                  1=TASK TIME SLICE HAS EXPIRED        11749100
*                                    BIT SET BY EXTERNAL FLIH           11749400
*                                    AND RESET BY THE DISPATCHER        11749700
SVTDSCAN EQU   X'10'               WORK QUEUE RESCAN REQUIRED           11749800
*                                  BIT IS SET AND RESET BY THE          11749900
*                                  DISPATCHER ONLY WHILE ACTIVE IS      11750000
*                                  ALREADY HELD.                   @09A 11750100
SVTDACT1 EQU   SVTDACTV,16,C'X'    REDEFINE SVTDACTV AS A      @G860PXD 11750200
*                                  SIXTEEN BYTE FIELD          @G860PXD 11750300
         DS    0D                  INSURE DOUBLEWORD BDY       @G860PXD 11750600
SVTPWAIT DC    16XL1'0'            PROCESSOR WAITING INDICATOR @G860PXD 11750900
SVTPWTCK EQU   X'20'               WAIT TASK TIME SLICE FLAG       @D5A 11751200
*                                  1=WAIT TASK TIME SLICE HAS EXPIRED   11751500
*                                  BIT IS SET BY THE EXTERNAL FLIH      11751600
*                                  AND RESET BY THE DISPATCHER          11751700
*                                  VIA A MOVE IMMEDIATE                 11751800
*                                  INSTRUCTION                     @D5A 11751900
SVTPWSTS EQU   X'10'               WAIT TASK TIME SLICE FLAG            11752000
*                                  1=WAIT TASK TIME SLICE WAS A SHORT   11752100
*                                  ONE.  BIT IS SET BY THE DISPATCHER   11752200
*                                  AND RESET BY THE DISPATCHER VIA A    11752300
*                                  MOVE IMMEDIATE INSTRUCTION      @09A 11752400
SVTPWAT1 EQU   SVTPWAIT,16,C'X'    REDEFINE SVTPWAIT AS A      @G860PXD 11752500
*                                  SIXTEEN BYTE FIELD          @G860PXD 11752700
SVTWPBM  DC    F'0'                WAITING PROCESSOR BIT MASK, BIT @07C 11761000
*                                  POSITION CORRESPONDS TO CPU ID.      11769300
*                                  LOW ORDER HALF WORD MUST BE ZERO     11777600
*                                  OWNERSHIP - SUPERVISOR CONTROL       11785900
*                                  SERIALIZATION - COMPARE AND SWAP     11786800
SVTSNCT2 DC    F'0'                COUNT OF THE NUMBER OF ASCBS    @01A 11786900
*                                  SAFETY NET ADDED TO TRQ WITH         11787000
*                                  ASCBSSSS ON                          11787100
         AIF   ('&CSECT' EQ 'NO').SVT010A                          @LIA 11787400
         WXTRN IEAVCMR3                                            @LIA 11787700
SVTCMRT3 DC    A(IEAVCMR3)         Address of CMSET RESET,         @0AC 11788000
         AGO   .SVT010B                                            @LIA 11788300
.SVT010A ANOP                                                      @LIA 11788600
SVTCMRT3 DS    A                   Address of CMSET RESET,         @0AC 11788900
.SVT010B ANOP                                                      @LIA 11789400
*                                  CHKAUTH=YES,DIE=YES routine.         11789900
         AIF   ('&CSECT' EQ 'NO').SVT011A                          @LIA 11790200
         WXTRN IEAVCMR4                                            @LIA 11790500
SVTCMRT4 DC    A(IEAVCMR4)         Address of CMSET RESET,         @0AC 11790800
         AGO   .SVT011B                                            @LIA 11791100
.SVT011A ANOP                                                      @LIA 11791400
SVTCMRT4 DS    A                   Address of CMSET RESET,         @0AC 11791700
.SVT011B ANOP                                                      @LIA 11792200
*                                  CHKAUTH=NO,DIE=YES routine.          11792700
SVTSUSC  DC    V(IEAVSUSC)         GENERALIZED STOP ENTRY POINT    @H2A 11794100
*                                  ADDRESS                              11794200
SVTRSTC  DC    V(IEAVRSTC)         GENERALIZED RESET ENTRY POINT   @H2A 11794300
*                                  ADDRESS                              11794400
SVTCBLS  DC    V(IEAVCBLS)         ADDRESS OF CONTROL BLOCK LENGTH @H2A 11794500
*                                  TABLE.                               11794600
*                                  OWNERSHIP - SUPERVISOR CONTROL       11794700
*                                  SERIALIZATION - N/A                  11794800
SVTSNCNT DC    F'0'                COUNT OF THE NUMBER ASCBS       @L1A 11794900
*                                  SAFETY NET ADDED TO TRQ         @L1A 11795000
SVTSPCP  DC    16XL1'0'            CPUS CAUSING EXCESSIVE SPIN.    @D2A 11796000
*                                  OWNERSHIP     - RECONFIGURATION      11797000
*                                  SERIALIZATION - DISABLEMENT          11798000
SVTLSLO  DC    V(IEAVLSLO)         ADDRESS OF THE LINKAGE STACK    @L3A 11798500
*                                  MANAGER LOCAL OBTAIN ROUTINE.        11799000
SVTLSLR  DC    V(IEAVLSLR)         ADDRESS OF THE LINKAGE STACK    @L3A 11799500
*                                  MANAGER LOCAL RETURN ROUTINE.        11800000
SVTLSGO  DC    V(IEAVLSGO)         ADDRESS OF THE LINKAGE STACK    @L3A 11800500
*                                  MANAGER GLOBAL OBTAIN ROUTINE.       11801000
SVTLSGR  DC    V(IEAVLSGR)         ADDRESS OF THE LINKAGE STACK    @L3A 11801500
*                                  MANAGER GLOBAL RETURN ROUTINE.       11802000
SVTR1C0  DC    XL4'00'             RESERVED                        @LFC 11802700
SVTLSIO  DC    V(IEAVLSIO)         ADDRESS OF THE LINKAGE STACK    @L3A 11803500
*                                  MANAGER INTERRUPT HANDLER LS OBTAIN  11804000
*                                  ROUTINE.                             11804500
SVTLSIR  DC    V(IEAVLSIR)         ADDRESS OF THE LINKAGE STACK    @L3A 11805000
*                                  MANAGER INTERRUPT HANDLER LS RETURN  11805500
*                                  ROUTINE.                             11806000
SVTR1CC  DC    XL4'00'             RESERVED                        @LFC 11806700
SVTGLAL  DS    0D                  GLOBAL ACCESS LIST POOL HEADER  @L3A 11807500
*                                   - SERIALIZATION CDS.                11808000
SVTGLALP DC    A(0)                ADDRESS OF FIRST AVAILABLE      @L3A 11808500
*                                  GLOBAL POOL ACCESS LIST.             11809000
SVTGALPS DC    F'0'                SYNC COUNT FIELD FOR COMPARE    @L3A 11809500
*                                  DOUBLE AND SWAP OF SVTGLALP.         11810000
SVTGLPMX DC    X'00000C00'         MAXIMUM NUMBER OF BYTES BY      @L3A 11810500
*                                  WHICH GLOBAL ACCESS LIST POOL MAY    11811000
*                                  BE EXPANDED.                         11811500
SVTXAPM1 DC    V(IEAVXAPM)         ADDRESS OF ACCESS LIST POOL     @L3A 11812000
*                                  MANAGER EXPAND (IEAVXAPM) SERVICE.   11812500
SVTXAPM2 DC    V(IEAVXAP2)         ADDRESS OF ACCESS LIST POOL     @L3A 11813000
*                                  MANAGER RETURN (IEAVXAP2) SERVICE.   11813500
SVTINIT  DC    V(IEAVINIT)         ADDRESS OF IEAVINIT.            @L3A 11814000
SVTXAACR DC    V(IEAVXAAC)         ADDRESS OF ALET TO ASCB         @L3A 11814500
*                                  CONVERSION ROUTINE (IEAVXAAC).       11815000
SVTOENTY DC    A(0)                ORIGIN OF THE ASVT ENTRY TABLE  @L3A 11815500
*                                  OF ASCB'S.                           11816000
SVTSTKN  DC    A(0)                ADDRESS OF THE STKN TABLE.      @L3A 11816500
SVTSTKNE DC    A(0)                LAST ENTRY OF STKN TABLE.       @L3A 11817000
SVTMEOUT DC    F'0'                SYSTEM SPIN LOOP TIMEOUT VALUE  @D4C 11817200
*                                  IN SECONDS, INITIALIZED BY           11817400
*                                  IEEVESAI                             11817600
SVTNALD  DC    A(0)                NULL ACCESS LIST REAL ADDRESS   @L3A 11818000
*                                  AND LENGTH. BITS 0-25 WITH SIX       11818500
*                                  ZEROS APPENDED ON THE RIGHT FORM     11819000
*                                  THE ADDRESS. BITS 26-31 REPRESENT    11819500
*                                  THE NUMBER OF 128 BYTE ACCESS LISTS, 11820000
*                                  MINUS ONE.                           11820500
SVTNALV  DC    A(0)                NULL ACCESS LIST VIRTUAL        @L3A 11821000
*                                  ADDRESS.                             11821500
SVTDS0E1 DC    A(0)                ADDRESS OF DISPATCHER           @L3A 11822000
*                                  DIAGNOSTIC EXIT-1 (GIVEN CONTROL     11822500
*                                  FOR UNLOCKED TASK DISPATCHES).       11823000
SVTDS0E2 DC    A(0)                ADDRESS OF DISPATCHER           @L3A 11823500
*                                  DIAGNOSTIC EXIT-2 (GIVEN CONTROL     11824000
*                                  FOR LOCKED TASK DISPATCHES).         11824500
SVTDS0E3 DC    A(0)                ADDRESS OF DISPATCHER           @L3A 11825000
*                                  DIAGNOSTIC EXIT-3 (GIVEN CONTROL     11825500
*                                  FOR SRB DISPATCHES).                 11826000
SVTDS0E4 DC    A(0)                ADDRESS OF DISPATCHER           @L3A 11826500
*                                  DIAGNOSTIC EXIT-4 (GIVEN CONTROL     11827000
*                                  FOR SSRB DISPATCHES).                11827500
SVTDS0E5 DC    A(0)                ADDRESS OF DISPATCHER           @L3A 11828000
*                                  DIAGNOSTIC EXIT-5 (GIVEN CONTROL     11828500
*                                  FOR WAIT TASK DISPATCHES).           11829000
SVTASECT DC    A(0)                ADDRESS OF THE ASE CONTROL      @L3A 11829500
*                                  TABLE.                               11830000
SVTEXP3  DC    V(IEAVEXP3)         ADDRESS OF IEAVEXP3 SUBROUTINE  @L3A 11830500
*                                  IN EXIT PROLOGUE (LSED COMPARISON    11831000
*                                  ROUTINE).                            11831500
         AIF   ('&CSECT' EQ 'YES').E1                              @L4A 11832000
SVTEMRQ  DC    V(IEAVEMRQ)         ADDRESS OF MEMORY REQUEST       @L4A 11832500
         AGO   .E1A                                                @L4A 11833000
.E1      ANOP                                                      @L4A 11833500
         EXTRN IEAVEMRQ                                            @L4A 11834000
SVTEMRQ  DC    A(X'80000000'+IEAVEMRQ)  ADDRESS OF MEMORY REQUEST  @L4A 11834500
.E1A     ANOP                                                      @L4A 11834800
         AIF   ('&CSECT' EQ 'YES').E2                              @L4A 11835100
SVTLSCO  DC    V(IEAVLSCO)         ADDRESS OF LS CONSTANTS TABLE   @L4A 11835300
         AGO   .E2A                                                @L4A 11835600
.E2      ANOP                                                      @L4A 11835700
         WXTRN IEAVLSCO                                            @L4A 11835800
SVTLSCO  DC    A(IEAVLSCO)         ADDRESS OF LS CONSTANTS TABLE   @L4A 11835900
.E2A     ANOP                                                      @L4A 11836000
SVTLSLC  DC    V(IEAVLSLC)         ADDRESS OF THE LINKAGE STACK    @L4A 11836100
*                                  LOCATE SERVICE ROUTINE.              11836500
SVTNLSSD DC    V(IEAVNLSD)         ADDRESS OF NULL LS LSSD         @D3A 11837000
SVTNLSDP DC    V(IEAVNLSP)         ADDRESS OF NULL LS LSED         @D3A 11837500
SVTQV4   DC    V(IEAVEQV4)         ADDRESS OF SINGLE SPACE DOUBLE  @L6A 11838000
*                                  LINKED QUEUE VERIFICATION ROUTINE.   11838500
SVTQV5   DC    V(IEAVEQV5)         ADDRESS OF MULTIPLE SPACE       @L6A 11839000
*                                  DOUBLE LINKED QUEUE VERIFICATION     11839500
*                                  ROUTINE.                             11840000
SVTCASTE DC    A(0)                VIRTUAL ADDRESS OF THE BLOCK OF @04C 11840300
*                                  CADS ASTES. INITIALIZED BY IEAVNP09. 11840600
SVTGSCH9 DC    V(IEAVESC9)         ADDRESS OF GLOBAL SCHEDULE WITH @L8A 11841000
*                                  STOKEN ENTRY POINT FOR ENABLED       11841400
*                                  CALLERS.                             11841800
SVTGSCHA DC    V(IEAVESCA)         ADDRESS OF GLOBAL SCHEDULE WITH @L8A 11842200
*                                  STOKEN ENTRY POINT FOR DISABLED      11842600
*                                  CALLERS.                             11843000
SVTLSCHB DC    V(IEAVESCB)         ADDRESS OF LOCAL SCHEDULE WITH  @L8A 11843400
*                                  STOKEN ENTRY POINT FOR ENABLED       11843800
*                                  CALLERS.                             11844200
SVTLSCHC DC    V(IEAVESCC)         ADDRESS OF LOCAL SCHEDULE WITH  @L8A 11844600
*                                  STOKEN ENTRY POINT FOR DISABLED      11845000
*                                  CALLERS.                             11845400
SVTQV6   DC    V(IEAVEQV6)         ADDRESS OF THE SINGLE SPACE     @L8A 11845800
*                                  SINGLE LINKED QUEUE VERIFICATION     11846200
*                                  ROUTINE.                             11846600
SVTESCD  DC    V(IEAVESCD)         ADDRESS OF IEAVESCD, THE NEW    @06A 11847800
*                                  SCHEDULE ENTRY POINT FOR FEATURE     11849000
*                                  (ENABLED GLOBAL).                    11850200
SVTESCE  DC    V(IEAVESCE)         ADDRESS OF IEAVESCE, THE NEW    @06A 11851400
*                                  SCHEDULE ENTRY POINT FOR FEATURE     11852600
*                                  (DISABLED GLOBAL).                   11853800
SVTESCF  DC    V(IEAVESCF)         ADDRESS OF IEAVESCF, THE NEW    @06A 11855000
*                                  SCHEDULE ENTRY POINT FOR FEATURE     11856200
*                                  (ENABLED LOCAL).                     11857400
SVTESCG  DC    V(IEAVESCG)         ADDRESS OF IEAVESCG, THE NEW    @06A 11858600
*                                  SCHEDULE ENTRY POINT FOR FEATURE     11859800
*                                  (DISABLED LOCAL).                    11861000
SVTCPUF DC     V(IEAVCPUF) -       ADDRESS OF IEAMCPUF SERVICE     @05A 11862200
*                                  ROUTINE (IEAVCPUF).                  11863400
*                                  OWNERSHIP: SUPERVISOR CONTROL.       11864600
*                                  SERIALIZATION: NONE.                 11865800
SVTERMF DC     V(IEAVERMF) -       ADDRESS OF IEAMRMF3 SERVICE     @06A 11867000
*                                  ROUTINE (IEAVERMF).                  11868200
*                                  OWNERSHIP: SUPERVISOR CONTROL.       11869400
*                                  SERIALIZATION: NONE.                 11870600
SVTEFCN DC     V(IEAVEFCN) -       ADDRESS OF IEAMFCNT SERVICE     @06A 11871800
*                                  ROUTINE (IEAVEFCN).                  11873000
*                                  OWNERSHIP: SUPERVISOR CONTROL.       11874200
*                                  SERIALIZATION: NONE.                 11875400
*                                                                       11876400
         AIF   ('&CSECT' EQ 'YES').P2                              @LBA 11877400
SVTTWRM DC     V(IEAVTWRM) -       ADDRESS OF THE TAWQ WEB         @LBA 11878400
*                                  ADDRESS SPACE RESOURCE               11879400
*                                  MANAGER ROUTINE (IEAVTWRM).          11880400
*                                  OWNERSHIP: SUPERVISOR CONTROL.       11881400
*                                  SERIALIZATION: NONE.                 11882600
         AGO   .P3                                                 @LBA 11883800
.P2      ANOP                                                      @LBA 11885000
         EXTRN IEAVTWRM                                            @LBA 11886200
SVTTWRM  DC    A(X'80000000'+IEAVTWRM) ADDRESS OF THE TAWQ WEB     @LBA 11887400
*                                  ADDRESS SPACE RESOURCE               11888600
*                                  MANAGER ROUTINE (IEAVTWRM).          11889800
*                                  OWNERSHIP: SUPERVISOR CONTROL.       11891000
*                                  SERIALIZATION: NONE.                 11892200
.P3      ANOP                                                      @LBA 11893400
SVTCPTM  DC    A(1500*4096)        Count down timer start value    @07A 11893800
*                                  4096 for bit 51, 4K mics = 4 ms @07A 11894200
SVTTODDL DC    A(3000*4096)        TOD time to check for SIGP      @07A 11894600
SVTTODST DC    F'0'                TOD time stamp last check       @07A 11895000
SVTEND   DS    0D                  END OF SVT.                     @LBA 11895800
         POP   PRINT                                               @H2A 11897000
         MEND                                                           11898200
* */                                                                    11900000
*%PLSSVT2:;                                                             11950000
*                                                                       11956200
*  @LISTPUSH;                                                  /*@H2A*/ 11962400
*  %IF IHALIST='YES' %THEN                                     /*@H2A*/ 11968600
*     %GOTO SVTLIST;                                           /*@H2A*/ 11974800
*  @LISTOFF;                                                   /*@H2A*/ 11981000
*  %SVTLIST:;                                                  /*@H2A*/ 11987200
*                                                                       11993400
* DECLARE                                                               12000000
*   1 SVT BASED(PSASVT) BDY(DWORD), /* SUPERVISOR VECTOR TABLE       */ 12050000
*     3 SVTISECT PTR(31),           /* ADDRESS OF INTERSECT             12100000
*                                      ROUTINE, IEAVEINT.    @G387PXU*/ 12150000
*     3 SVTGSCH1 PTR(31),           /* ADDRESS OF GLOBAL SCHEDULE       12200000
*                                      ROUTINE FOR ENABLED USERS     */ 12250000
*     3 SVTGSCH2 PTR(31),           /* ADDRESS OF GLOBAL SCHEDULE       12300000
*                                      ROUTINE FOR DISABLED USERS    */ 12350000
*     3 SVTR00C  CHAR(4),           /* Reserved.                        12370800
*                                      SERIALIZATION: None              12391600
*                                      OWNERSHIP: Supervisor Control    12412400
*                                                                @LBC*/ 12433200
*     3 SVTWEEF  PTR(31),           /* Address of the first WEB         12454000
*                                      Extent Element Pool.             12474800
*                                      SERIALIZATION: CS or Global      12495600
*                                        Recovery protocols.            12516400
*                                      OWNERSHIP: Supervisor Control    12537200
*                                                                @LBA*/ 12568600
*     3 SVTRSCS  PTR(31),           /* RESUME CONDITIONAL ENTRY         12600000
*                                      POINT, IEAVRSCS.      @G387PXU*/ 12650000
*     3 SVTJSTEQ PTR(31),           /* JOB STEP TIME EXCEEDED QUEUE  */ 12700000
*     3 SVTDSREQ BIT(32) BDY(WORD), /* DISPATCHER SERIALIZATION         12750000
*                                      REQUIRED                      */ 12800000
*       4 SVTSRQ1 BIT(8),           /* FIRST BYTE OF SVTDSREQ        */ 12850000
*         5 SVTDSG4  BIT(1),        /* SIGNAL WAITING PROCESSOR      */ 12900000
*         5 SVTDFLT  BIT(1),        /* DEFAULT INTERSECT             */ 12950000
*         5 *        BIT(6),        /* RESERVED.                     */ 13000000
*       4 SVTSRQ2 BIT(8),           /* SECOND BYTE OF SVTDSREQ       */ 13300000
*         5 SVTDSG3  BIT(1),        /* SIGNAL WAITING PROCESSOR      */ 13350000
*         5 *        BIT(5),        /* RESERVED.                     */ 13400000
*         5 SVTSRM1  BIT(1),        /* SRM INTERSECTING              */ 13650000
*         5 SVTQVER  BIT(1),        /* Q VERIFICATION INTERSECTING   */ 13700000
*       4 SVTSRQ3 BIT(8),           /* THIRD BYTE OF SVTDSREQ        */ 13750000
*         5 SVTDSG2  BIT(1),        /* SIGNAL WAITING PROCESSOR      */ 13800000
*         5 SVTRCTI  BIT(1),        /* RCT INTERSECTING      @ZM48358*/ 13850000
*         5 SVTTCBV  BIT(1),        /* TCB VERIFICATION INTERSECT    */ 13900000
*         5 SVTACHA  BIT(1),        /* ASCB CHAP INTERSECTING        */ 13950000
*         5 *        BIT(1),        /* RESERVED.                     */ 14000000
*         5 SVTMTER  BIT(1),        /* MEMTERM INTERSECTING          */ 14050000
*         5 SVTMINI  BIT(1),        /* MEMORY INIT INTERSECTING      */ 14100000
*         5 SVTCBVE  BIT(1),        /* CONTROL BLOCK VERIFICATION       14150000
*                                      INTERSECTING                  */ 14200000
*       4 SVTSRQ4 BIT(8),           /* FOURTH BYTE OF SVTDSREQ       */ 14250000
*         5 SVTDSG1  BIT(1),        /* SIGNAL WAITING PROCESSOR      */ 14300000
*         5 SVTDETA  BIT(1),        /* DETACH INTERSECTING           */ 14350000
*         5 SVTATTA  BIT(1),        /* ATTACH INTERSECTING           */ 14400000
*         5 SVTRTM2  BIT(1),        /* RTM2 INTERSECTING             */ 14450000
*         5 SVTRTM1  BIT(1),        /* RTM1 INTERSECTING             */ 14500000
*         5 SVTCHAP  BIT(1),        /* TCB CHAP  INTERSECTING        */ 14550000
*         5 SVTSTAT  BIT(1),        /* STATUS INTERSECTING           */ 14600000
*         5 SVTPURD  BIT(1),        /* PURGE DQ VERIFICATION         */ 14650000
*     3 SVTGSRB CHAR(8) BDY(DWORD), /* GLOBAL SRB QUEUES.    @G387PXU*/ 14700000
*       4 SVTGSMQ FIXED(31),        /* GLOBAL SERVICE MANAGEMENT Q   */ 14750000
*       4 SVTGSPL FIXED(31),        /* Must be x'FFFFFFFF'.             14770000
*                                      SERIALIZATION: None.             14790000
*                                      OWNERSHIP: Supervisor Control    14810000
*                                                                @LBC*/ 14830000
*     3 SVTLSMQ FIXED(31),          /* LOCAL SERVICE MANAGEMENT Q    */ 14850000
*     3 SVTWAS CHAR(64) BDY(WORD),  /* WAIT ADDRESS SPACE VECTOR USED   14900000
*                                      TO SIGP MEMORY SWITCH TO         14950000
*                                      WAITING PROCESSOR             */ 15000000
*       4 SVTWAS00 (16) FIXED(31),  /* WASV                          */ 15050000
*     3 * CHAR(4),                  /* RESERVED FIELD - FORMERLY        15072200
*                                      SVTDACTV - MUST ALWAYS REMAIN    15094400
*                                      NONZERO               @G860PXD*/ 15116600
*     3 SVTAPCP  FIXED(15),         /* Initial value for the number of  15120300
*                                      WEBs that must be on a WUQ       15124000
*                                      as a gating factor for AWM SIGP  15127700
*                                      SERIALIZATION: NONE              15131400
*                                      OWNERSHIP: SRM            @LEC*/ 15135100
*     3 SVTLASTS CHAR(1),           /* Last CP signalled for alternate  15138800
*                                      wait management.          @07A*/ 15146200
*     3 SVTR073 CHAR(5),            /* RESERVED.                 @LDC*/ 15149100
*     3 SVTCRSCR PTR(31),           /* Address of the Supervisor        15152000
*                                      Checkpoint/Restart SRB Check     15154900
*                                      Routine.                  @LDA*/ 15157800
*     3 * CHAR(4),                  /* RESERVED FIELD - FORMERLY        15161000
*                                      SVTPWAIT - MUST ALWAYS REMAIN    15183200
*                                      NONZERO               @G860PXD*/ 15205400
*     3 SVTWPSCT FIXED(32),         /* Count of SIGPs to waiting        15207600
*                                      processors due to timeout        15209800
*                                      between waits.                   15212000
*                                      SERIALIZATION: NONE       @07A*/ 15214200
*     3 SVTMSWCT FIXED(32),         /* Count of SIGPs to waiting        15216400
*                                      processors due to WUQADD         15218600
*                                      SERIALIZATION: NONE       @07A*/ 15220800
*     3 SVTACTR PTR(31),            /* ADDRESS OF ACCUMULATED CPU TIME  15223200
*                                      SERVICE ROUTINE USED BY          15232100
*                                      TIMEUSED MACRO            @02A*/ 15241000
*     3 SVTISECR PTR(31),           /* INTERSECT RESET ROUTINE       */ 15250000
*     3 SVTXASCB PTR(31),           /* ADDRESS OF PC/AUTH               15300000
*                                      ASCB.                 @G387PXU*/ 15350000
*     3 SVTXMD  PTR(31),            /* ADDRESS OF CROSS MEMORY          15400000
*                                      DIRECTORY (XMD) (IN PC/AUTH      15450000
*                                      ADDRESS SPACE).       @G387PXU*/ 15500000
*     3 SVTGSPH  PTR(31),           /* ADDRESS OF GLOBAL STACK          15550000
*                                      POOL HEADER FOR PCLINK           15600000
*                                      SERVICE, IEASTKH.     @G387PXU*/ 15650000
*     3 SVTMCADS FIXED(15),         /* MAXIMUM NUMBER OF ALE SLOTS IN   15700000
*                                      A PASN ACCESS LIST RESERVED FOR  15750000
*                                      CADS. INITIALIZED TO 25. MAY BE  15800000
*                                      CHANGED BY IEAVNP09.      @04C*/ 15850000
*     3 SVTMPALE FIXED(15),         /* NUMBER OF NON-CADS PASN ACCESS   15900000
*                                      LIST ENTRIES. INITIALIZED BY     15950000
*                                      IEAVNP09.                 @04A*/ 16000000
*     3 SVTBBR PTR(31),             /* ADDRESS OF BIND BREAK            16050000
*                                      ROUTINE, IEAVEBBR.    @G387PXU*/ 16100000
*     3 SVTLASCB PTR(31),           /* ADDRESS OF LOCASCB               16150000
*                                      SERVICE ROUTINE,                 16200000
*                                      IEAVLACB.             @G387PXU*/ 16250000
*     3 SVTCMCKM FIXED(32),         /* CMSET CONSTANT FOR ICMA          16300000
*                                      CHECK, X'80000000'.   @G387PXU*/ 16350000
*     3 SVTCMST1 PTR(31),           /* ADDRESS OF CMSET SET             16400000
*                                      ROUTINE, IEAVCMS1.    @G387PXU*/ 16450000
*     3 SVTCMRT1 PTR(31),           /* ADDRESS OF CMSET RESET           16500000
*                                      CHKAUTH(YES) ROUTINE,            16550000
*                                      IEAVCMR1.             @G387PXU*/ 16600000
*     3 SVTCMRT2 PTR(31),           /* ADDRESS OF CMSET RESET           16650000
*                                      CHKAUTH(NO) ROUTINE,             16700000
*                                      IEAVCMR2.             @G387PXU*/ 16750000
*     3 SVTCMSTR PTR(31),           /* ADDRESS OF CMSET SSARTO          16800000
*                                      ROUTINE, IEAVCMST.    @G387PXU*/ 16850000
*     3 SVTCMSBR PTR(31),           /* ADDRESS OF CMSET                 16900000
*                                      SSARBACK ROUTINE,                16950000
*                                      IEAVCMSB.             @G387PXU*/ 17000000
*     3 SVTCDSPE PTR(31),           /* ADDRESS OF CALLDISP              17050000
*                                      ROUTINE FOR ENABLED              17100000
*                                      CALLERS, IEAVCDEN.    @G387PXU*/ 17150000
*     3 SVTCDSPD PTR(31),           /* ADDRESS OF CALLDISP              17200000
*                                      ROUTINE FOR DISABLED             17250000
*                                      CALLERS, IEAVCDDS.    @G387PXU*/ 17300000
*     3 SVTSRBSV PTR(31),           /* ADDRESS OF SRBSTAT SAVE          17350000
*                                      ROUTINE, IEAVESTS.    @G387PXU*/ 17400000
*     3 SVTSRBRS PTR(31),           /* ADDRESS OF SRBSTAT               17450000
*                                      RESTORE ROUTINE,                 17500000
*                                      IEAVESTR.             @G387PXU*/ 17550000
*     3 SVTAFFST PTR(31),           /* ADDRESS OF SSAFF SET             17600000
*                                      ROUTINE, IEAVESAS.    @G387PXU*/ 17650000
*     3 SVTAFFOB PTR(31),           /* ADDRESS OF SSAFF OBTAIN          17700000
*                                      ROUTINE, IEAVESAF.    @G387PXU*/ 17750000
*     3 SVTSRBG PTR(31),            /* ADDRESS OF GETSRB                17800000
*                                      ROUTINE, IEAVSPM1.    @G387PXU*/ 17850000
*     3 SVTSSRBG PTR(31),           /* ADDRESS OF GETSSRB               17900000
*                                      ROUTINE, IEAVSPM2.    @G387PXU*/ 17950000
*     3 SVTSRBF PTR(31),            /* ADDRESS OF FREESRB               18000000
*                                      ROUTINE, IEAVSPM3.    @G387PXU*/ 18050000
*     3 SVTSSRBF PTR(31),           /* ADDRESS OF FREESSRB              18100000
*                                      ROUTINE, IEAVSPM4.    @G387PXU*/ 18150000
*     3 SVTSRBP BDY(DWORD),         /* SUPERVISOR SRB POOL              18200000
*                                      HEADER.                          18250000
*                                      SERIALIZATION - CDS.  @G387PXU*/ 18300000
*       4 SVTSRBS FIXED(31),        /* SRB POOL ELEMENT                 18350000
*                                      SYNC COUNT.           @G387PXU*/ 18400000
*       4 SVTSRBA PTR(31),          /* ADDRESS OF FIRST                 18450000
*                                      AVAILABLE SRB.        @G387PXU*/ 18500000
*     3 SVTSRBE BDY(WORD),          /* SRB POOL EXTENT                  18550000
*                                      COUNTS.                          18600000
*                                      SERIALIZATION -SALLOC.@G387PXU*/ 18650000
*       4 SVTSRBM FIXED(15),        /* MAX SRB POOL EXTENTS. @G387PXU*/ 18700000
*       4 SVTSRBC FIXED(15),        /* CURRENT SRB POOL                 18750000
*                                      EXTENTS.              @G387PXU*/ 18800000
*     3 SVTR0F4 FIXED(31),          /* Reserved. Formerly SVTSSRBE/M/C. 18850000
*                                                                @P1C*/ 18900000
*     3 SVTR0F8 CHAR(8),            /* Reserved. Formerly SVTSSRBP/S/A. 18950000
*                                                                @P1C*/ 19000000
*     3 SVTSVT   CHAR(4),           /* SVT ACRONYM.          @G387PXU*/ 19500000
*     3 SVTRSUA  PTR(31),           /* ADDRESS OF RESUME                19550000
*                                      UNCONDITIONAL,ASYNC=Y            19600000
*                                      ROUTINE, IEAVRSUA.    @G387PXU*/ 19650000
*     3 SVTRSCA  PTR(31),           /* ADDRESS OF RESUME                19700000
*                                      CONDITIONAL,ASYNC=Y              19750000
*                                      ROUTINE, IEAVRSCA.    @G387PXU*/ 19800000
*     3 SVTRSUS  PTR(31),           /* ADDRESS OF RESUME                19850000
*                                      UNCONDITIONAL,ASYNC=N            19900000
*                                      ROUTINE FOR ASCB                 19950000
*                                      SPECIFIED, IEAVRSUS.  @G387PXU*/ 20000000
*     3 SVTDSBCT FIXED(31),         /* Maximum number of WEBs the       20043700
*                                   Dispatcher can process before       20087400
*                                      INVOKING RECOVERY.        @07C*/ 20097100
*       4 SVTCHKWP BIT(1),          /* CHECK WAITING PROCESSOR          20106800
*                                      IF ON                     @07A*/ 20116500
*       4 *      BIT(30),                                     /* @07A*/ 20126200
*       4 SVTAWM BIT(1),            /* ALTERNATE WAIT MANAGEMENT        20135900
*                                      ENABLED FLAG (SVTDSBCT LOW BIT)  20145600
*                                      SET BY SRM.                      20155300
*                                      SERIALIZATION: NONE       @07A*/ 20165000
*     3 SVTMCBCT FIXED(31),         /* Maximum number of times to loop  20180400
*                                   on a locked WEB before invoking     20195800
*                                   WUQ Global Recovery.  The last byte 20211200
*                                   of this field should be equal to    20226600
*                                   the number of instructions executed 20242000
*                                   by the Dispatcher in its worksearch 20257400
*                                   loop used to lock a WEB.            20272800
*                                      SERIALIZATION: None              20288200
*                                      OWNERSHIP: SRM                   20303600
*                                                                @LBC*/ 20326800
*     3 SVTFW1 FIXED(32),           /* FULLWORD SERIALIZED              20350000
*                                      BY CS.                @G387PXU*/ 20400000
*       4 SVTCS1 BIT(8),            /* FIRST BYTE OF CS WORD.@G387PXU*/ 20450000
*         5 SVTXMSOP BIT(1) ABNL,   /* PC/AUTH SERVICE ROUTINES         20500000
*                                      OPERABLE.             @G387PXU*/ 20550000
*         5 SVTXMSUP BIT(1) ABNL,   /* PC/AUTH ADDRESS SPACE            20600000
*                                      INITIALIZED.          @G387PXU*/ 20650000
*         5 SVTXMCMF BIT(1) ABNL,   /* CROSS MEMORY CONNECTIONS         20660700
*                                      MANAGER HAS FAILED.              20671400
*                                      REUSABILITY FUNCTIONS ARE NOT    20682100
*                                      OPERATIONAL. SERIALIZED BY       20692800
*                                      PC/AUTH LOCAL LOCK.              20703500
*                                      SET BY IEAVXMCM RECOVERY.        20714200
*                                                                @L5A*/ 20725000
*         5 *        BIT(5) ABNL,   /* RESERVED.                 @LIC*/ 20737500
*       4 SVTR119 CHAR(3),          /* RESERVED.                        20750000
*                                      SERIALIZATION - CS.   @G387PXU*/ 21050000
*     3 SVTDSPC PTR(31),            /* ADDRESS OF DISPATCHER            21100000
*                                      ENTRY POINT FOR STOP             21150000
*                                      ROUTINE CALLERS.      @G387PXU*/ 21200000
*     3 SVTAFTR PTR(31),            /* VIRTUAL ADDRESS OF ADDRESS       21250000
*                                      SPACE FIRST TABLE (AFT)          21300000
*                                      CONTAINING REAL                  21350000
*                                      ADDRESSES.            @G387PXU*/ 21400000
*     3 SVTAFTV PTR(31),            /* VIRTUAL ADDRESS OF               21450000
*                                      ADDRESS SPACE FIRST              21500000
*                                      TABLE (AFT) CONTAINING           21550000
*                                      VIRTUAL ADDRESSES.    @G387PXU*/ 21600000
*     3 SVTSSEM PTR(31),            /* ADDRESS OF SPACE SWITCH          21650000
*                                      EVENT MANAGER, IEAVESSE.         21700000
*                                                            @G387PXU*/ 21750000
*     3 SVTISSAT PTR(31),           /* ADDRESS OF INITIAL               21800000
*                                      SUBSYSTEM AFFINITY               21850000
*                                      TABLE FOR ALL TASKS,             21900000
*                                      IEAISSAT.             @G387PXU*/ 21950000
*     3 SVTSSTSV FIXED(31),         /* LENGTH REQUIRED FOR              22000000
*                                      SRB STATUS SAVE AREA.     @L9C*/ 22050000
*     3 SVTWTSS  FIXED(32),         /* Short wait time slice     @09C*/ 22100000
*     3 SVTMDLQ  PTR(31),           /* MEMORY DELETE QUEUE              22250000
*                                      HEADER FOR ASCBS THAT            22300000
*                                      CANNOT BE FREED.      @G387PXU*/ 22350000
*     3 SVTSLWLN FIXED(31),         /* SLIP/PER WORK AREA               22400000
*                                      LENGTH REQUIRED FOR              22450000
*                                      EACH PROCESSOR.       @G387PXU*/ 22500000
*     3 SVTSRBMD PTR(31),           /* ADDRESS OF SRBSTAT               22550000
*                                      MODIFY ROUTINE,                  22600000
*                                      IEAVESTM.             @G387PXU*/ 22650000
*     3 SVTR144  CHAR(2),           /* RESERVED.                 @H2C*/ 22700000
*     3 SVTNSLX  FIXED(16),         /* NUMBER OF SYSTEM LXS             22750000
*                                      BEYOND THE HIGHEST               22800000
*                                      SYSTEM FUNCTION TABLE            22850000
*                                      LX.                   @G387PXU*/ 22900000
*     3 SVTSET1 PTR(31),            /* ADDRESS OF STATUS ENTRY          22909900
*                                      POINT TO SIGPCPUS                22919800
*                                      ROUTINE.              @G387PXU*/ 22929700
*     3 SVTISECG PTR(31),           /* ADDRESS OF INTERSECT             22931100
*                                      GLOBAL ENTRY POINT.   @G860PXH*/ 22932500
*     3 SVTISECL PTR(31),           /* ADDRESS OF INTERSECT             22933900
*                                      LOCAL ENTRY POINT.    @G860PXH*/ 22935300
*     3 SVTSWUQ PTR(31),            /* System WUQ (SWUQ) header         22936400
*                                   address.                            22937500
*                                      SERIALIZATION: WEB Lock Protocol 22938600
*                                      OWNERSHIP: Supervisor Control    22939700
*                                                                @LBC*/ 22941300
*     3 SVTCMST2 PTR(31),           /* Address of CMSET SET,DIE=YES     22942800
*                                      routine.                  @0AC*/ 22944300
*     3 SVTBEST@ PTR(31),           /* Address of XES Back End Schedule 22946000
*                                      Table (BEST).                    22946400
*                                      SERIALIZATION: XES-determined    22946800
*                                      protocol                         22947200
*                                      OWNERSHIP: XES            @08C*/ 22947600
*     3 SVTDACT1 CHAR(16)           /* DISPATCHER ACTIVE     @G860PXD*/ 22948000
*       BDY(DWORD),                 /* INDICATORS            @G860PXD*/ 22948100
*       4 SVTDACTV(16) CHAR(1),     /* DISPATCHER ACTIVE -   @G860PXD*/ 22948200
*                                   /* FIELD REDEFINITION    @G860PXD*/ 22948300
*          5 *        BIT(1),       /*                           @06D*/ 22948400
*          5 SVTDLID  BIT(1),       /* HIGH ORDER BIT OF PROCESSOR      22948600
*                                      ID MAY BE CHECKED AS A FAST      22948700
*                                      TEST OF DISPATCHER ACTIVE @D5A*/ 22948800
*          5 SVTDPRMT BIT(1),       /* TASK TIME SLICE FLAG             22948900
*                                      1=TASK TIME SLICE HAS EXPIRED    22949000
*                                        BIT SET BY EXTERNAL FLIH AND   22949100
*                                        RESET BY THE DISPATCHER @D5A*/ 22949200
*          5 SVTDSCAN BIT(1),       /* WORK QUEUE RESCAN REQUIRED       22949400
*                                      BIT IS SET AND RESET BY THE      22949600
*                                      DISPATCHER ONLY WHILE ACTIVE IS  22949800
*                                      ALREADY HELD.             @09A*/ 22950000
*          5 *        BIT(4),       /* RESERVED (USED FOR PHYSICAL      22950200
*                                      CPU ADDRESS)              @09C*/ 22950400
*     3 SVTPWAT1 CHAR(16) BDY(DWORD),/* PROCESSOR WAITING    @G860PXD*/ 22950600
*                                   /* INDICATORS            @G860PXD*/ 22950800
*       4 SVTPWAIT(16) CHAR(1),     /* PROCESSOR WAITING     @G860PXD*/ 22951000
*                                   /* INDICATORS - FIELD    @G860PXD*/ 22951200
*                                   /* REDEFINITION          @G860PXD*/ 22951400
*          5 *        BIT(1),       /* RESERVED                  @D5A*/ 22951600
*          5 *        BIT(1),       /* RESERVED (USED FOR HI-ORDER BIT  22951800
*                                      OF PROCESSOR ID)          @D5A*/ 22952000
*          5 SVTPWTCK BIT(1),       /* WAIT TASK TIME SLICE FLAG        22952200
*                                      1=WAIT TASK TIME SLICE           22952400
*                                      HAS EXPIRED                      22952600
*                                      BIT IS SET BY THE EXTERNAL       22952800
*                                      FLIH AND RESET BY THE            22953000
*                                      DISPATCHER VIA A MOVE            22953200
*                                      IMMEDIATE INSTRUCTION     @D5A*/ 22953400
*          5 SVTPWSTS BIT(1),       /* WAIT TASK TIME SLICE FLAG        22953600
*                                      1=WAIT TASK TIME SLICE WAS A     22953800
*                                      SHORT ONE.  BIT IS SET BY THE    22954000
*                                      DISPATCHER AND RESET BY THE      22954200
*                                      DISPATCHER VIA A MOVE IMMEDIATE  22954400
*                                      INSTRUCTION               @09A*/ 22954600
*                                                                       22954800
*          5 *        BIT(4),       /* RESERVED (USED FOR PHYSICAL      22955000
*                                      CPU ADDRESS)              @09C*/ 22955200
*     3 SVTWPBM  FIXED(32),         /* WAITING PROCESSOR BIT MASK, BIT  22956400
*                                      POSITION CORRESPONDS TO CPU ID.  22961700
*                                      LOW ORDER HALF WORD MUST BE ZERO 22967000
*                                      OWNERSHIP - SUPERVISOR CONTROL   22972400
*                                      SERIALIZATION - COMPARE AND      22974200
*                                      SWAP.                     @07C*/ 22976000
*     3 SVTSNCT2 FIXED(31),         /* COUNT OF THE NUMBER OF ASCBS     22976400
*                                      SAFETY NET ADDED TO TRQ WITH     22976800
*                                      ASCBSSSS ON               @01A*/ 22977200
*     3 SVTCMRT3 PTR(31),           /* Address of CMSET RESET,          22979600
*                                      CHKAUTH=YES,DIE=YES routine.     22982000
*                                                                @0AC*/ 22984400
*     3 SVTCMRT4 PTR(31),           /* Address of CMSET RESET,          22986800
*                                      CHKAUTH=NO,DIE=YES routine.      22989200
*                                                                @0AC*/ 22991600
*     3 SVTSUSC  PTR(31),           /* GENERALIZED STOP ENTRY POINT     22994300
*                                      ADDRESS                   @H2A*/ 22994600
*     3 SVTRSTC  PTR(31),           /* GENERALIZED RESET ENTRY POINT    22994900
*                                      ADDRESS                   @H2A*/ 22995200
*     3 SVTCBLS  PTR(31),           /* ADDRESS OF CONTROL BLOCK         22995500
*                                      LENGTH TABLE.                    22995800
*                                      OWNERSHIP - SUPERVISOR CONTROL   22996100
*                                      SERIALIZATION - N/A       @H2A*/ 22996400
*     3 SVTSNCNT FIXED(31),         /* COUNT OF THE NUMBER OF ASCBS     22996600
*                                      SAFETY NET ADDED TO TRQ   @L1A*/ 22996800
*     3 SVTSPCP(0:15) CHAR(1),      /* CPUS CAUSING EXCESSIVE SPIN.     22997300
*                                      OWNERSHIP     - RECONFIGURATION. 22997800
*                                      SERIALIZATION - DISABLEMENT.     22998300
*                                                                @D2A*/ 22998800
*     3 SVTLSLO PTR(31),            /* ADDRESS OF THE LINKAGE STACK     23000800
*                                      MANAGER LOCAL OBTAIN ROUTINE.    23002800
*                                                                @L3A*/ 23004800
*     3 SVTLSLR PTR(31),            /* ADDRESS OF THE LINKAGE STACK     23006800
*                                      MANAGER LOCAL RETURN ROUTINE.    23008800
*                                                                @L3A*/ 23010800
*     3 SVTLSGO PTR(31),            /* ADDRESS OF THE LINKAGE STACK     23012800
*                                      MANAGER GLOBAL OBTAIN ROUTINE.   23014800
*                                                                @L3A*/ 23016800
*     3 SVTLSGR PTR(31),            /* ADDRESS OF THE LINKAGE STACK     23018800
*                                      MANAGER GLOBAL RETURN ROUTINE.   23020800
*                                                                @L3A*/ 23022800
*     3 SVTR1C0 CHAR(4),            /* RESERVED                  @LFC*/ 23026800
*     3 SVTLSIO PTR(31),            /* ADDRESS OF THE LINKAGE STACK     23030800
*                                      MANAGER INTERRUPT HANDLER LS     23032800
*                                      OBTAIN ROUTINE.           @L3A*/ 23034800
*     3 SVTLSIR PTR(31),            /* ADDRESS OF THE LINKAGE STACK     23036800
*                                      MANAGER INTERRUPT HANDLER LS     23038800
*                                      RETURN ROUTINE.           @L3A*/ 23040800
*     3 SVTR1CC CHAR(4),            /* RESERVED                  @LFC*/ 23043800
*     3 SVTGLAL CHAR(8) BDY(WORD),  /* GLOBAL ACCESS LIST POOL HEADER - 23046800
*                                      SERIALIZATION CDS.        @L3A*/ 23048800
*       5 SVTGLALP PTR(31),         /* ADDRESS OF THE FIRST AVAILABLE   23050800
*                                      GLOBAL POOL ACCESS LIST.  @L3A*/ 23052800
*       5 SVTGALPS FIXED(32),       /* SYNC COUNT FIELD FOR COMPARE     23054800
*                                      DOUBLE AND SWAP OF SVTGLALP.     23056800
*                                                                @L3A*/ 23058800
*     3 SVTGLPMX FIXED(32),         /* MAXIMUM NUMBER OF BYTES BY WHICH 23060800
*                                      GLOBAL ACCESS LIST POOL MAY BE   23062800
*                                      EXPANDED.                 @L3A*/ 23064800
*     3 SVTXAPM1 PTR(31),           /* ADDRESS OF ACCESS LIST POOL      23066800
*                                      MANAGER EXPAND (IEAVXAPM)        23068800
*                                      SERVICE.                  @L3A*/ 23070800
*     3 SVTXAPM2 PTR(31),           /* ADDRESS OF ACCESS LIST POOL      23072800
*                                      MANAGER RETURN (IEAVXAP2)        23074800
*                                      SERVICE.                  @L3A*/ 23076800
*     3 SVTINIT  PTR(31),           /* ADDRESS OF IEAVINIT.      @L3A*/ 23078800
*     3 SVTXAACR PTR(31),           /* ADDRESS OF ALET TO ASCB.         23080800
*                                      CONVERSION ROUTINE (IEAVXAAC).   23082800
*                                                                @L3A*/ 23084800
*     3 SVTOENTY PTR(31),           /* ORIGIN OF THE ASVT ENTRY TABLE   23086800
*                                      OF ASCB'S.                @L3A*/ 23088800
*     3 SVTSTKN  PTR(31),           /* ADDRESS OF THE STKN TABLE @L3A*/ 23090800
*     3 SVTSTKNE PTR(31),           /* LAST ENTRY OF STKN TABLE. @L3A*/ 23092800
*     3 SVTMEOUT FIXED(32),         /* SYSTEM SPIN LOOP TIMEOUT         23093800
*                                      VALUE IN SECONDS, INITIALIZED BY 23094800
*                                      IEEVESAI                  @D4C*/ 23095800
*     3 SVTNALD  PTR(31),           /* NULL ACCESS LIST REAL ADDRESS    23096800
*                                      AND LENGTH. BITS 0-25 WITH SIX   23098800
*                                      ZEROS APPENDED ON THE RIGHT,     23100800
*                                      FORM THE ADDRESS. BITS 26-31     23102800
*                                      REPRESENT THE NUMBER OF 128 BYTE 23104800
*                                      ACCESS LISTS, MINUS ONE.  @L3A*/ 23106800
*     3 SVTNALV  PTR(31),           /* NULL ACCESS LIST VIRTUAL         23108800
*                                      ADDRESS.                  @L3A*/ 23110800
*     3 SVTDS0E1 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC 23112800
*                                      EXIT-1 (GIVEN CONTROL FOR        23114800
*                                      UNLOCKED TASK DISPATCHES. @L3A*/ 23116800
*     3 SVTDS0E2 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC 23118800
*                                      EXIT-2 (GIVEN CONTROL FOR LOCKED 23120800
*                                      TASK DISPATCHES).         @L3A*/ 23122800
*     3 SVTDS0E3 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC 23124800
*                                      EXIT-3 (GIVEN CONTROL FOR SRB    23126800
*                                      DISPATCHES).              @L3A*/ 23128800
*     3 SVTDS0E4 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC 23130800
*                                      EXIT-4 (GIVEN CONTROL FOR SSRB   23132800
*                                      DISPATCHES).              @L3A*/ 23134800
*     3 SVTDS0E5 PTR(31),           /* ADDRESS OF DISPATCHER DIAGNOSTIC 23136800
*                                      EXIT-5 (GIVEN CONTROL FOR WAIT   23138800
*                                      TASK DISPATCHES).         @L3A*/ 23140800
*     3 SVTASECT PTR(31),           /* ADDRESS OF THE ASE CONTROL       23142800
*                                      TABLE.                    @L3A*/ 23144800
*     3 SVTEXP3  PTR(31),           /* ADDRESS OF IEAVEXP3 SUBROUTINE   23146800
*                                      IN EXIT PROLOGUE (LSED           23148800
*                                      COMPARISON ROUTINE).      @L3A*/ 23150800
*     3 SVTEMRQ  PTR(31),           /* ADDRESS OF MEMORY REQUEST @L4A*/ 23152800
*     3 SVTLSCO  PTR(31),           /* ADDRESS OF LS CONSTANTS TABLE    23154800
*                                                                @L4A*/ 23156800
*     3 SVTLSLC  PTR(31),           /* ADDRESS OF THE LINKAGE STACK     23158800
*                                      LOCATE SERVICE ROUTINE    @L4A*/ 23160800
*     3 SVTNLSSD PTR(31),           /* ADDRESS OF NULL LS LSSD   @D3A*/ 23162800
*     3 SVTNLSDP PTR(31),           /* ADDRESS OF NULL LS LSED   @D3A*/ 23164800
*     3 SVTQV4   PTR(31),           /* ADDRESS OF SINGLE SPACE DOUBLE   23166800
*                                      LINKED QUEUE VERIFICATION        23168800
*                                      ROUTINE.                  @L6A*/ 23170800
*     3 SVTQV5   PTR(31),           /* ADDRESS OF MULTIPLE SPACE DOUBLE 23172800
*                                      LINKED QUEUE VERIFICATION        23174800
*                                      ROUTINE.                  @L6A*/ 23176800
*     3 SVTCASTE PTR(31),           /* VIRTUAL ADDRESS OF THE BLOCK OF  23177800
*                                      CADS ASTES. INITIALIZED BY       23178800
*                                      IEAVNP09.                 @04C*/ 23179800
*     3 SVTGSCH9 PTR(31),           /* ADDRESS OF GLOBAL SCHEDULE WITH  23179900
*                                      STOKEN ROUTINE FOR ENABLED       23180000
*                                      CALLERS. (IEAVESC9)       @L8A*/ 23180100
*     3 SVTGSCHA PTR(31),           /* ADDRESS OF GLOBAL SCHEDULE WITH  23180200
*                                      STOKEN ROUTINE FOR DISABLED      23180300
*                                      CALLERS. (IEAVESCA)       @L8A*/ 23180400
*     3 SVTLSCHB PTR(31),           /* ADDRESS OF LOCAL SCHEDULE WITH   23180500
*                                      STOKEN ROUTINE FOR ENABLED       23180600
*                                      CALLERS. (IEAVESCB)       @L8A*/ 23180700
*     3 SVTLSCHC PTR(31),           /* ADDRESS OF LOCAL SCHEDULE WITH   23180800
*                                      STOKEN ROUTINE FOR DISABLED      23180900
*                                      CALLERS. (IEAVESCC)       @L8A*/ 23181000
*     3 SVTQV6   PTR(31),           /* ADDRESS OF SINGLE SPACE SINGLE   23181100
*                                      LINKED QUEUE VERIFICATION        23181200
*                                      ROUTINE.                  @L8A*/ 23181300
*     3 SVTESCD  PTR(31),           /* ADDRESS OF IEAVESCD, THE NEW     23181400
*                                      SCHEDULE ENTRY POINT FOR FEATURE 23181500
*                                      (ENABLED GLOBAL).         @06A*/ 23181600
*     3 SVTESCE  PTR(31),           /* ADDRESS OF IEAVESCE, THE NEW     23181700
*                                      SCHEDULE ENTRY POINT FOR FEATURE 23181800
*                                      (DISABLED GLOBAL).        @06A*/ 23181900
*     3 SVTESCF  PTR(31),           /* ADDRESS OF IEAVESCF, THE NEW     23182000
*                                      SCHEDULE ENTRY POINT FOR FEATURE 23182100
*                                      (ENABLED LOCAL).          @06A*/ 23182200
*     3 SVTESCG  PTR(31),           /* ADDRESS OF IEAVESCG, THE NEW     23182300
*                                      SCHEDULE ENTRY POINT FOR FEATURE 23182400
*                                      (DISABLED LOCAL).         @06A*/ 23182500
*     3 SVTCPUF  PTR(31),           /* ADDRESS OF IEAMCPUF SERVICE      23182600
*                                      ROUTINE (IEAVCPUF).              23182700
*                                      OWNERSHIP: SUPERVISOR            23182800
*                                                 CONTROL.              23182900
*                                      SERIALIZATION: NONE.      @05A*/ 23183000
*     3 SVTERMF  PTR(31),           /* ADDRESS OF IEAMRMF3 SERVICE      23183100
*                                      ROUTINE (IEAVERMF).              23183200
*                                      OWNERSHIP: SUPERVISOR            23183300
*                                                 CONTROL.              23183400
*                                      SERIALIZATION: NONE.      @06A*/ 23183500
*     3 SVTEFCN  PTR(31),           /* ADDRESS OF IEAMFCNT SERVICE      23183600
*                                      ROUTINE (IEAVEFCN).              23183700
*                                      OWNERSHIP: SUPERVISOR            23183800
*                                                 CONTROL.              23183900
*                                      SERIALIZATION: NONE.      @06A*/ 23184000
*     3 SVTTWRM  PTR(31),           /* ADDRESS OF THE TAWQ WEB          23184100
*                                      ADDRESS SPACE                    23184200
*                                      RESOURCE MANAGER ROUTINE         23184300
*                                      (IEAVTWRM).                      23184400
*                                      OWNERSHIP: SUPERVISOR            23184500
*                                                 CONTROL.              23184600
*                                      SERIALIZATION: NONE.      @LBA*/ 23184700
*     3 SVTCPTM FIXED(32),          /* Count down timer start value     23184900
*                                                                @07A*/ 23185100
*     3 SVTTODDL FIXED(32),         /* TOD time to check for SIGP@07A*/ 23185300
*     3 SVTTODST FIXED(32),         /* TOD time stamp last check @07A*/ 23185500
*     3 SVTEND CHAR(0) BDY(DWORD);  /* END OF SVT.           @G387PXU*/ 23185700
*                                                                       23185800
*%IF SYSVERSION = '' %THEN          /*                           @LIA*/ 23185900
*    %GOTO SVT09;                   /*                           @LIA*/ 23186000
*%IF SYSRULESMOD='PL/S-III ' %THEN                            /* @LIA*/ 23186100
*    %GOTO SVT09;                   /*                           @LIA*/ 23186200
*DCL SVTAL#rsv Constant(2);         /* Number of reserved entries       23186300
*                               (these are entries 0/1)          @LIA*/ 23186400
*DCL SVTALMAX# Constant(256-SvtAl#Rsv); /* Access list Max taking into  23186500
*                               account reserved entries 0/1     @LIA*/ 23186600
*DCL SVT#RsmCads Constant(2);       /* RSM CADS                  @LIA*/ 23186700
*%SVT09:;                           /*                           @LIA*/ 23186800
*%IF SVTENTS='NO'  % THEN           /*                           @SJK*/ 23186900
*    %GOTO SVT10;                   /*                           @SJK*/ 23187000
*                                                                       23187100
*                                                                       23187200
*   DCL IEAVCMS1 ENTRY BASED(SVTCMST1) VALRG(*) OPTIONS(AMODE(ANY)      23187300
*                                                       RMODE(24));     23187400
*                                      /* CMSET ENTRY POINT.     @L3C*/ 23187500
*   DCL IEAVCMR1 ENTRY BASED(SVTCMRT1) VALRG(*) OPTIONS(AMODE(ANY)      23188800
*                                                       RMODE(24));     23190800
*                                      /* CMSET RESET CHKAUTH(YES)      23200000
*                                      ENTRY POINT               @L3C*/ 23237500
*   DCL IEAVCMR2 ENTRY BASED(SVTCMRT2) VALRG(*) OPTIONS(AMODE(ANY)      23275000
*                                                       RMODE(24));     23312500
*                                      /* CMSET RESET NOAUTH            23350000
*                                      CHKAUTH(NO) ENTRY PT.     @L3C*/ 23387500
*   DCL IEAVCMS2 ENTRY BASED(SVTCMST2) VALRG(*) OPTIONS(AMODE(ANY)      23391600
*          RMODE(24));                 /* CMSET SET DIE(YES) EP  @0AA*/ 23395700
*   DCL IEAVCMR3 ENTRY BASED(SVTCMRT3) VALRG(*) OPTIONS(AMODE(ANY)      23399800
*          RMODE(24));                 /* CMSET RESET DIE(YES)          23403900
*                                         CHKAUTH(YES) EP        @0AA*/ 23408000
*   DCL IEAVCMR4 ENTRY BASED(SVTCMRT4) VALRG(*) OPTIONS(AMODE(ANY)      23412100
*          RMODE(24));                 /* CMSET RESET DIE(YES)          23416200
*                                         CHKAUTH(NO) EP         @0AA*/ 23420300
*   DCL IEAVCMST ENTRY BASED(SVTCMSTR) VALRG(*) OPTIONS(AMODE(ANY)      23425000
*                                                       RMODE(24));     23462500
*                                      /* CMSET SSARTO                  23500000
*                                      ENTRY POINT.              @L3C*/ 23537500
*   DCL IEAVCMSB ENTRY BASED(SVTCMSBR) VALRG(*) OPTIONS(AMODE(ANY)      23575000
*                                                       RMODE(24));     23612500
*                                      /* CMSET SSARBACK                23650000
*                                      ENTRY POINT.              @L3C*/ 23700000
*   DCL IEAVCDEN ENTRY BASED(SVTCDSPE) VALRG(*) OPTIONS(AMODE(ANY)      23750000
*                                                       RMODE(24));     23800000
*                                      /* CALLDISP ENABLED              23950000
*                                      ENTRY POINT.              @L3C*/ 23987500
*   DCL IEAVCDDS ENTRY BASED(SVTCDSPD) VALRG(*) OPTIONS(AMODE(ANY)      24025000
*                                                       RMODE(24));     24062500
*                                      /* CALLDISP DISABLED             24100000
*                                      ENTRY POINT.              @L3C*/ 24137500
*   DCL IEAVSPM1 ENTRY BASED(SVTSRBG) VALRG(*) OPTIONS(AMODE(ANY)       24175000
*                                                       RMODE(24));     24212500
*                                      /* GETSRB ROUTINE                24250000
*                                      ENTRY POINT.              @L3C*/ 24287500
*   DCL IEAVSPM2 ENTRY BASED(SVTSSRBG) VALRG(*) OPTIONS(AMODE(ANY)      24325000
*                                                       RMODE(24));     24362500
*                                      /* GETSSRB ROUTINE               24400000
*                                      ENTRY POINT.              @L3C*/ 24437500
*   DCL IEAVSPM3 ENTRY BASED(SVTSRBF) VALRG(*) OPTIONS(AMODE(ANY)       24475000
*                                                       RMODE(24));     24512500
*                                      /* FREESRB ROUTINE               24550000
*                                      ENTRY POINT.              @L3C*/ 24587500
*   DCL IEAVSPM4 ENTRY BASED(SVTSSRBF) VALRG(*) OPTIONS(AMODE(ANY)      24625000
*                                                       RMODE(24));     24662500
*                                      /* FREESSRB ROUTINE              24700000
*                                      ENTRY POINT.              @L3C*/ 24704100
*   DCL IEAVINT ENTRY BASED(SVTINIT) VALRG(*) OPTIONS(AMODE(31));       24708200
*                                      /* NULL ACCESS LIST AND SRB AND  24712300
*                                      IH DUCT INITIALIZATION ROUTINE   24716400
*                                      ENTRY POINT.  USE FOR IEAVINIT   24720500
*                                                                @L3A*/ 24724600
*   DCL IEAVXAAC ENTRY BASED(SVTXAACR) VALRG(*) OPTIONS(AMODE(31));     24728700
*                                      /* ALET TO ASCB CONVERSION       24732800
*                                      ROUTINE ENTRY POINT.      @L3A*/ 24736900
*   DCL IEAVEXP3 ENTRY BASED(SVTEXP3) VALRG(*) OPTIONS(AMODE(ANY)       24741000
*                                                       RMODE(24));     24745100
*                                      /* LSED COMPARISON ROUTINE       24749200
*                                      ENTRY POINT.              @L3A*/ 24753300
*   DCL IEAVMRQ  ENTRY BASED(SVTEMRQ) VALRG(*) OPTIONS(AMODE(31,*));    24757400
*                                      /* IEAVEMRQ ENTRY POINT   @L4A*/ 24761500
*   DCL IEAVEQV4 ENTRY BASED(SVTQV4)  VALRG(*) OPTIONS(AMODE(31,*));    24765600
*                                      /* QUEUE VERIFICATION ROUTINE    24769700
*                                         FOR DOUBLE THREADED SINGLE    24773800
*                                         SPACE QUEUES.          @L6A*/ 24777900
*   DCL IEAVEQV5 ENTRY BASED(SVTQV5)  VALRG(*) OPTIONS(AMODE(31,*));    24782000
*                                      /* QUEUE VERIFICATION ROUTINE    24786100
*                                         FOR DOUBLE THREADED MULTIPLE  24790200
*                                         SPACE QUEUES.          @L6A*/ 24794300
*   DCL IEAVEQV6 ENTRY BASED(SVTQV6)  VALRG(*) OPTIONS(AMODE(31,*));    24795400
*                                      /* QUEUE VERIFICATION ROUTINE    24796500
*                                         FOR SINGLE THREADED SINGLE    24797600
*                                         SPACE QUEUES.          @L8A*/ 24798700
*   DCL IEATWRM ENTRY BASED(SVTTWRM) VALRG(*) OPTIONS(AMODE(31)         24798800
*                                                   RMODE(ANY));        24798900
*                                      /* ENTRY POINT OF THE            24799000
*                                         TAWQ WEB ADDRESS              24799100
*                                         SPACE RESOURCE MANAGER        24799200
*                                         ROUTINE (IEAVTWRM).    @LBA*/ 24799400
*%SVT10 : ;                            /*                        @SJK*/ 24799600
*  @LISTPOP;                                                   /*@H2A*/ 24800000
