*                                                                       00050000
* %DCL IHASDMSE_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IHASDMSE_INCLUDED;                                        00150000
* %IF IHASDMSE_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 98124. CBGEN compile date 98009         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IHASDMSE &DSECT=YES,&LIST=YES,&TITLE=YES,&SDMSE=YES,          *00441600
               &SDMSE_MODEL=COND,&SDMSE_ASIDLST=COND,                  *00483200
               &SDMSE_STORAGE=COND,&SDMSE_JOBLIST=COND,                *00524800
               &SDMSE_DSPLIST=COND,&SDMSE_SUBPLST=COND,                *00566400
               &SDMSE_KEYLIST=COND                                      00608000
         GBLC  &IHASDMSE_INCLUDED                                       00650000
         GBLC  &ZCBPRINT                                                00700000
&IHASDMSE_INCLUDED SETC 'YES'                                           00750000
         AIF   ('&LIST' EQ 'NONE').P0                                   00766600
         AIF   ('&TITLE' EQ 'NO').P5                                    00783200
 TITLE   'IHASDMSE  - SDUMPX Multisystem SDUMP Exit parameter area   '  00800000
.P5      ANOP                                                           00825000
**/ IHASDMSE_1:;                                                        00850000
*/* START OF SPECIFICATIONS ******************************************* 00900000
**/                                                                     00950000
*/*01* PROPRIETARY STATEMENT=                                        */ 01000000
*/***PROPRIETARY_STATEMENT********************************************/ 01050000
*/*  Proprietary Statement =                                         */ 01100000
*/*                                                                  */ 01150000
*/*              LICENSED MATERIALS - PROPERTY OF IBM                */ 01200000
*/*              THIS MACRO IS "RESTRICTED MATERIALS OF IBM"         */ 01250000
*/*              5647-A01 (C) COPYRIGHT IBM CORP 1993,1999           */ 01300000
*/*                                                                  */ 01400000
*/*  Status = JBB6607                                                */ 01450000
*/*                                                              @L2C*/ 01500000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01550000
*/*                                                                     01600000
*01* DESCRIPTIVE NAME:  SDUMPX Multisystem SDUMP Exit parameter area    01650000
*02*  ACRONYM:  SDMSE                                                   01700000
*                                                                       01750000
*01* MACRO NAME:  IHASDMSE                                              01800000
*                                                                       01850000
*01* EXTERNAL CLASSIFICATION: GUPI                                      01900000
*01* END OF EXTERNAL CLASSIFICATION:                                    01950000
*                                                                       02000000
*01* DSECT NAME:                                                        02050000
*02*  SDMSE                                                             02100000
*02*  SDMSE_MODEL                                                       02150000
*02*  SDMSE_ASIDLST                                                     02200000
*02*  SDMSE_STORAGE                                                     02250000
*02*  SDMSE_JOBLIST                                                     02300000
*02*  SDMSE_DSPLIST                                                     02350000
*02*  SDMSE_SUBPLST                                                     02400000
*02*  SDMSE_KEYLIST                                                     02450000
*                                                                       02500000
*01* COMPONENT:  SDUMP (SCDMP)                                     @D1C 02550000
*                                                                       02600000
*01* EYE-CATCHER:  NONE                                                 02650000
*                                                                       02700000
*01* STORAGE ATTRIBUTES:                                                02750000
*02*  SUBPOOL:  252                                                     02800000
*02*  KEY:  0                                                           02850000
*02*  RESIDENCY:  Above 16M                                             02900000
*                                                                       02950000
*01* SIZE:                                                              03000000
*                SDMSE         -- X'0060' bytes                         03050000
*                SDMSE_MODEL   -- X'0008' bytes                         03100000
*                SDMSE_ASIDLST -- X'0006' bytes                         03150000
*                                 + X'0002' bytes for each entry        03200000
*                                 after the first                       03250000
*                SDMSE_STORAGE -- X'0014' bytes                         03300000
*                                 + X'0010' bytes for each entry        03350000
*                                 after the first                       03400000
*                SDMSE_JOBLIST -- X'000C' bytes                         03450000
*                                 + X'0010' bytes for each entry        03500000
*                                 after the first                       03550000
*                SDMSE_DSPLIST -- X'0014' bytes                         03600000
*                                 + X'0018' bytes for each entry        03650000
*                                 after the first                       03700000
*                SDMSE_SUBPLST -- X'0008' bytes                         03750000
*                                 + X'0004' bytes for each entry        03800000
*                                 after the first                       03850000
*                SDMSE_KEYLIST -- X'0005' bytes                         03900000
*                                 + X'0001' bytes for each entry        03950000
*                                 after the first                       04000000
*                                                                       04050000
*01* CREATED BY:                                                        04100000
*     Created by SDUMP and passed via R1 to multisystem Sdump exit      04150000
*                                                                       04200000
*01* POINTED TO BY:                                                     04250000
*     R1 on entry to multisystem SDUMP exit                             04300000
*                                                                       04350000
*01* SERIALIZATION:                                                     04400000
*     None required                                                     04450000
*                                                                       04500000
*01* FUNCTION:                                                          04550000
*02* Maps the parameter information passed to the multisystem           04600000
*    Sdump exit.                                                        04650000
*                                                                       04700000
*01* METHOD OF ACCESS:                                                  04750000
*02*  ASM:                                                              04800000
*      IHASDMSE                                                         04850000
*           DSECT=YES|NO  -- Request DSECT definition                   04900000
*           SDMSE=YES|NO|COND -- Request mapping of parameter           04950000
*                            information                                05000000
*                            USING on SDMSE                             05050000
*           SDMSE_MODEL=YES|NO|COND -- Mapping of SDATA                 05100000
*           SDMSE_ASIDLST=YES|NO|COND -- Mapping of ASIDLST             05150000
*           SDMSE_STORAGE=YES|NO|COND -- Mapping of STORAGE             05200000
*           SDMSE_JOBLIST=YES|NO|COND -- Mapping of JOBLIST             05250000
*           SDMSE_DSPLIST=YES|NO|COND -- Mapping of DSPLIST             05300000
*           SDMSE_SUBPLST=YES|NO|COND -- Mapping of SUBPLST             05350000
*           SDMSE_KEYLIST=YES|NO|COND -- Mapping of KEYLIST             05400000
*     Default: DSECT=YES,SDMSE=YES,                                     05450000
*              SDMSE_MODEL=COND,                                        05500000
*              SDMSE_ASIDLST=COND,                                      05550000
*              SDMSE_STORAGE=COND,                                      05600000
*              SDMSE_JOBLIST=COND,                                      05650000
*              SDMSE_DSPLIST=COND,                                      05700000
*              SDMSE_SUBPLST=COND,                                      05750000
*              SDMSE_KEYLIST=COND                                       05800000
*02*  PL/AS:                                                            05850000
*      %INCLUDE SYSLIB(IHASDMSE)                                        05900000
*                                                                       05950000
*01* DELETED BY:  SDUMP                                                 06000000
*                                                                       06050000
*01* FREQUENCY:  Created for call to multisystem SDUMP exit             06100000
*                                                                       06150000
*01* DEPENDENCIES:  None                                                06200000
*                                                                       06250000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     06300000
*                                                                       06350000
*01* CHANGE ACTIVITY:                                                   06400000
*   $L0=HPCSRCBG ,HBB5510,921217,PD00XB: MultiSys Dump Exit parameters  06450000
*   $L1=HPCSR    ,HBB5510,921217,PD00XB: MultiSys Dump Exit parameters  06500000
*   $D1=DR20001   HBB6601 950907 PD00KV: Split from SC1CM          @D1A 06525000
*   $L2=TSVCD    ,JBB6607,980413,PD00HT: Tailored SVC Dump         @L2A 06537500
*                                                                       06550000
* END OF SPECIFICATIONS *********************************************/  06600000
*% /*                                                                   06650000
.P0      ANOP                                                           06675000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 06700000
         AIF   ('&LIST' EQ 'YES').P2                                    06750000
.P1      ANOP                                                           06800000
         PUSH  PRINT                                                    06850000
         PRINT OFF                                                      06900000
.P2      ANOP                                                           06950000
         AIF   ('&SDMSE' EQ 'NO').L0002                                 07000000
         AIF   ('&DSECT' EQ 'YES').L0003                                07050000
         AIF   ('&SDMSE' NE 'YES').L0002                                07100000
SDMSE    DS    0F                                                       07150000
         AGO   .L0004                                                   07200000
.L0003   ANOP                                                           07250000
SDMSE    DSECT                                                          07300000
.L0004   ANOP                                                           07350000
SDMSE_VERSION DS 1FL1    Initial version is 0. This can be used by the *07400000
                         exit to tell just how the parameter area is   *07450000
                         mapped.                                        07500000
         DS    1CL0003   Unused                                         07550000
SDMSE_INPUT_PROBDESC_ADDR DS 1AL4 Address of problem description       *07600000
                         information provided via PROBDESC keyword     *07650000
                         when the SDUMP was initiated on a remote      *07700000
                         system. If this pointer is 0, no such         *07750000
                         information was provided. Otherwise, the area *07800000
                         is in the format described for that keyword.   07850000
SDMSE_INPUT_WORKAREA_ADDR DS 1AL4 Address of 4096-byte workarea that   *07900000
                         the exit can use to build information for use *07950000
                         by SDUMP. This field is an input value for    *08000000
                         the exit.                                      08050000
SDMSE_OUTPUT_WORKAREA_ADDR DS 1AL4 Address of workarea that the exit   *08100000
                         provided via GETMAIN or STORAGE OBTAIN when   *08150000
                         the input workarea was not large enough. This *08200000
                         field is to be set by the exit when storage   *08250000
                         is so obtained. SDUMP will FREEMAIN this      *08300000
                         storage. The length and subpool and key must  *08350000
                         also be provided.                              08400000
SDMSE_OUTPUT_WORKAREA_LENGTH DS 1AL4 Length of workarea pointed to by  *08450000
                         the output workarea. SDUMP will FREEMAIN this *08500000
                         area. This field is to be set by the exit     *08550000
                         when storage is so obtained.                   08600000
SDMSE_OUTPUT_WORKAREA_SUBPOOL DS 1FL1 Subpool of output workarea. This *08650000
                         field is to be set by the exit when storage   *08700000
                         is so obtained.                                08750000
SDMSE_OUTPUT_WORKAREA_KEY DS 1FL1 Key of output workarea (must be in   *08800000
                         range 0-X'F0'). This field is to be set by    *08850000
                         the exit when storage is so obtained.          08900000
         DS    1CL0002   Reserved                                       08950000
SDMSE_OUTPUT_ASIDLST_ADDR DS 1AL4 This field should be set if the exit *09000000
                         has indicated ASID(s) to be incorporated in   *09050000
                         the dump. The area pointed to by this field   *09100000
                         is mapped by DSECT SDMSE_ASIDLST               09150000
SDMSE_OUTPUT_STORAGE_ADDR DS 1AL4 This field should be set if the exit *09200000
                         has indicated Storage Ranges to be            *09250000
                         incorporated in the dump. The area pointed to *09300000
                         by this field is mapped by DSECT              *09350000
                         SDMSE_STORAGE                                  09400000
SDMSE_OUTPUT_JOBLIST_ADDR DS 1AL4 This field should be set if the exit *09450000
                         has indicated a list of jobnames to be        *09500000
                         incorporated in the dump. The area pointed to *09550000
                         by this field is mapped by DSECT              *09600000
                         SDMSE_JOBLIST                                  09650000
SDMSE_OUTPUT_DSPLIST_ADDR DS 1AL4 This field should be set if the exit *09700000
                         has indicated a list of data space names by   *09750000
                         which data spaces are to be incorporated in   *09800000
                         the dump. The area pointed to by this field   *09850000
                         is mapped by DSECT SDMSE_DSPLIST               09900000
SDMSE_OUTPUT_SUBPLST_ADDR DS 1AL4 This field should be set if the exit *09950000
                         has indicated a list of subpools to be        *10000000
                         incorporated in the dump. The area pointed to *10050000
                         by this field is mapped by DSECT              *10100000
                         SDMSE_SUBPLST                                  10150000
SDMSE_OUTPUT_KEYLIST_ADDR DS 1AL4 This field should be set if the exit *10200000
                         has indicated a list of keys to be            *10250000
                         incorporated in the dump. This is ignored     *10300000
                         unless SDMSE_SUBPLST_ADDR is also specified.  *10350000
                         The area pointed to by this field is mapped   *10400000
                         by DSECT SDMSE_KEYLIST                         10450000
         DS    1CL0008   Reserved                                       10500000
SDMSE_SDATA_OPTIONS DS 1CL0008 These are mapped in the same order as   *10550000
                         they appear in the SDUMP parameter list. The  *10600000
                         desired subfields should be set if the exit   *10650000
                         has indicated SDATA options for the dump.      10700000
         ORG   SDMSE_SDATA_OPTIONS                                      10750000
SDMSE_SDATA_BYTE0 DS 1BL1 This field should be set if the exit has     *10800000
                         indicated SDATA options for the dump.          10850000
         ORG   SDMSE_SDATA_BYTE0                                        10900000
SDMSE_SDATA_ALLPSA EQU X'80' Corresponds to SDUMPX SDATA option ALLPSA  10950000
SDMSE_SDATA_PSA EQU X'40' Corresponds to SDUMPX SDATA option PSA        11000000
SDMSE_SDATA_NUC EQU X'20' Corresponds to SDUMPX SDATA option NUC        11050000
SDMSE_SDATA_SQA EQU X'10' Corresponds to SDUMPX SDATA option SQA        11100000
SDMSE_SDATA_LSQA EQU X'08' Corresponds to SDUMPX SDATA option LSQA      11150000
SDMSE_SDATA_RGN EQU X'04' Corresponds to SDUMPX SDATA option RGN        11200000
SDMSE_SDATA_LPA EQU X'02' Corresponds to SDUMPX SDATA option LPA        11250000
SDMSE_SDATA_TRT EQU X'01' Corresponds to SDUMPX SDATA option TRT        11300000
         ORG   SDMSE_SDATA_BYTE0+X'00000001'                            11350000
SDMSE_SDATA_BYTE1 DS 1BL1 This field should be set if the exit has     *11400000
                         indicated SDATA options for the dump.          11450000
         ORG   SDMSE_SDATA_BYTE1                                        11500000
SDMSE_SDATA_CSA EQU X'80' Corresponds to SDUMPX SDATA option CSA        11550000
SDMSE_SDATA_SWA EQU X'40' Corresponds to SDUMPX SDATA option SWA        11600000
SDMSE_SDATA_SUM EQU X'20' Corresponds to SDUMPX SDATA option SUM        11650000
SDMSE_SDATA_ALLNUC EQU X'02' Corresponds to SDUMPX SDATA option ALLNUC  11700000
SDMSE_SDATA_DEFS EQU X'01' Corresponds to SDUMPX SDATA option DEFS      11750000
         ORG   SDMSE_SDATA_BYTE1+X'00000001'                            11800000
SDMSE_SDATA_BYTE2 DS 1BL1 This field should be set if the exit has     *11850000
                         indicated SDATA options for the dump.          11900000
         ORG   SDMSE_SDATA_BYTE2                                        11950000
SDMSE_SDATA_GRSQ EQU X'80' Corresponds to SDUMPX SDATA option GRSQ      12000000
SDMSE_SDATA_COUPLE EQU X'10' Corresponds to SDUMPX SDATA option COUPLE  12050000
SDMSE_SDATA_XESDATA EQU X'08' Corresponds to SDUMPX SDATA option       *12100000
                         XESDATA                                        12150000
SDMSE_SDATA_WLM EQU X'02' Corresponds to SDUMPX SDATA option XESDATA    12175000
         ORG   SDMSE_SDATA_BYTE2+X'00000001'                            12200000
SDMSE_SDATA_BYTE3 DS 1BL1 Sdata Byte 3                                  12216600
         ORG   SDMSE_SDATA_BYTE3                                        12233200
SDMSE_SDATA_SERVERS EQU X'20' Corresponds to SDUMPX SDATA option       *12249800
                         SERVERS                                        12266400
         ORG   SDMSE_SDATA_BYTE3+X'00000001'                            12283000
SDMSE_SDATA_BYTE4 DS 1BL1 Sdata Byte 4                                  12300000
         ORG   SDMSE_SDATA_BYTE4                                        12350000
SDMSE_SDATA_IO EQU X'40' Corresponds to SDUMPX SDATA option IO          12400000
         ORG   SDMSE_SDATA_BYTE4+X'00000001'                            12450000
SDMSE_SDATA_BYTE5 DS 1BL1 Sdata Byte 5 - Reserved, must be 0            12500000
SDMSE_SDATA_RSVD DS 1CL0002 Reserved, must be 0                         12550000
SDMSE_INPUT_ASIDLST_ADDR DS 1AL4 This field indicates the ASID(s)      *12555200
                         incorporated in the dump. The area pointed to *12560400
                         by this field is mapped by DSECT              *12565600
                         SDMSE_ASIDLST                                  12570800
SDMSE_INPUT_STORAGE_ADDR DS 1AL4 This field indicates the Storage      *12576000
                         Ranges incorporated in the dump. The area     *12581200
                         pointed to by this field is mapped by DSECT   *12586400
                         SDMSE_STORAGE                                  12591600
SDMSE_INPUT_SUBPLST_ADDR DS 1AL4 This field indicates the list of      *12596800
                         subpools incorporated in the dump. The area   *12602000
                         pointed to by this field is mapped by DSECT   *12607200
                         SDMSE_SUBPLST                                  12612400
SDMSE_INPUT_KEYLIST_ADDR DS 1AL4 This field indicates the list of keys *12617600
                         incorporated in the dump. This will only be   *12622800
                         specified if SDMSE_SUBPLST_ADDR is also       *12628000
                         specified. The area pointed to by this field  *12633200
                         is mapped by DSECT SDMSE_KEYLIST               12638400
         DS    1CL0016   Unused                                         12643600
SDMSE_VERSION_CURRENT EQU 0                                             12650000
SDMSE_VERSION_0 EQU 0                                                   12700000
SDMSE_LEN EQU  *-SDMSE                                                  12750000
.L0002   ANOP                                                           12800000
         AIF   ('&SDMSE_MODEL' EQ 'NO').L0005                           12850000
         AIF   ('&DSECT' EQ 'YES').L0006                                12900000
         AIF   ('&SDMSE_MODEL' NE 'YES').L0005                          12950000
SDMSE_MODEL DS 0F        Model entry                                    13000000
         AGO   .L0007                                                   13050000
.L0006   ANOP                                                           13100000
SDMSE_MODEL DSECT        Model entry                                    13150000
.L0007   ANOP                                                           13200000
SDMSE_MODEL_HEADER DS 1CL0004 Header area                               13250000
         ORG   SDMSE_MODEL_HEADER                                       13300000
SDMSE_MODEL_LENGTH DS 1FL2 Total length of area including this length  *13350000
                         field                                          13400000
         DS    1CL0002   Reserved                                       13450000
SDMSE_MODEL_ENTRY DS 1FL4 An entry                                      13500000
SDMSE_MODEL_LEN EQU *-SDMSE_MODEL                                       13550000
.L0005   ANOP                                                           13600000
         AIF   ('&SDMSE_ASIDLST' EQ 'NO').L0008                         13650000
         AIF   ('&DSECT' EQ 'YES').L0009                                13700000
         AIF   ('&SDMSE_ASIDLST' NE 'YES').L0008                        13750000
SDMSE_ASIDLST DS 0H                                                     13800000
         AGO   .L000A                                                   13850000
.L0009   ANOP                                                           13900000
SDMSE_ASIDLST DSECT                                                     13950000
.L000A   ANOP                                                           14000000
SDMSE_ASIDLST_HEADER DS 1CL0004 Header area                             14050000
         ORG   SDMSE_ASIDLST_HEADER                                     14100000
SDMSE_ASIDLST_LENGTH DS 1FL2 Total length of area including this       *14150000
                         length field                                   14200000
         DS    1CL0002   Reserved                                       14250000
SDMSE_ASIDLST_ENTRY DS 1CL0002 This represents an array of ASIDs        14300000
         ORG   SDMSE_ASIDLST_ENTRY                                      14350000
SDMSE_ASIDLST_ASID DS 1FL2 The ASID                                     14400000
SDMSE_ASIDLST_LEN EQU *-SDMSE_ASIDLST                                   14450000
.L0008   ANOP                                                           14500000
         AIF   ('&SDMSE_STORAGE' EQ 'NO').L000B                         14550000
         AIF   ('&DSECT' EQ 'YES').L000C                                14600000
         AIF   ('&SDMSE_STORAGE' NE 'YES').L000B                        14650000
SDMSE_STORAGE DS 0F                                                     14700000
         AGO   .L000D                                                   14750000
.L000C   ANOP                                                           14800000
SDMSE_STORAGE DSECT                                                     14850000
.L000D   ANOP                                                           14900000
SDMSE_STORAGE_HEADER DS 1CL0004 Header area                             14950000
         ORG   SDMSE_STORAGE_HEADER                                     15000000
SDMSE_STORAGE_LENGTH DS 1FL2 Total length of area including this       *15050000
                         length field                                   15100000
         DS    1CL0002   Reserved                                       15150000
SDMSE_STORAGE_ENTRY DS 1CL0016 This represents an array of start/end   *15200000
                         address pairs                                  15250000
         ORG   SDMSE_STORAGE_ENTRY                                      15300000
SDMSE_STORAGE_STOKEN DS 1CL0008 STOKEN of storage                       15350000
SDMSE_STORAGE_START DS 1AL4 Start of range                              15400000
SDMSE_STORAGE_END DS 1AL4 End of range                                  15450000
SDMSE_STORAGE_LEN EQU *-SDMSE_STORAGE                                   15500000
.L000B   ANOP                                                           15550000
         AIF   ('&SDMSE_JOBLIST' EQ 'NO').L000E                         15600000
         AIF   ('&DSECT' EQ 'YES').L000F                                15650000
         AIF   ('&SDMSE_JOBLIST' NE 'YES').L000E                        15700000
SDMSE_JOBLIST DS 0H                                                     15750000
         AGO   .L0010                                                   15800000
.L000F   ANOP                                                           15850000
SDMSE_JOBLIST DSECT                                                     15900000
.L0010   ANOP                                                           15950000
SDMSE_JOBLIST_HEADER DS 1CL0004 Header area                             16000000
         ORG   SDMSE_JOBLIST_HEADER                                     16050000
SDMSE_JOBLIST_LENGTH DS 1FL2 Total length of area including this       *16100000
                         length field                                   16150000
         DS    1CL0002   Reserved                                       16200000
SDMSE_JOBLIST_ENTRY DS 1CL0008 This represents an array of job names    16250000
         ORG   SDMSE_JOBLIST_ENTRY                                      16300000
SDMSE_JOBLIST_NAME DS 1CL0008 The jobname                               16350000
SDMSE_JOBLIST_LEN EQU *-SDMSE_JOBLIST                                   16400000
.L000E   ANOP                                                           16450000
         AIF   ('&SDMSE_DSPLIST' EQ 'NO').L0011                         16500000
         AIF   ('&DSECT' EQ 'YES').L0012                                16550000
         AIF   ('&SDMSE_DSPLIST' NE 'YES').L0011                        16600000
SDMSE_DSPLIST DS 0F                                                     16650000
         AGO   .L0013                                                   16700000
.L0012   ANOP                                                           16750000
SDMSE_DSPLIST DSECT                                                     16800000
.L0013   ANOP                                                           16850000
SDMSE_DSPLIST_HEADER DS 1CL0004 Header area                             16900000
         ORG   SDMSE_DSPLIST_HEADER                                     16950000
SDMSE_DSPLIST_LENGTH DS 1FL2 Total length of area including this       *17000000
                         length field                                   17050000
         DS    1CL0002   Reserved                                       17100000
SDMSE_DSPLIST_ENTRY DS 1CL0016 This represents an array of data space  *17150000
                         owners and names                               17200000
         ORG   SDMSE_DSPLIST_ENTRY                                      17250000
SDMSE_DSPLIST_OWNER DS 1CL0008 The owner of the data space: this can   *17300000
                         be by jobname or by ASID                       17350000
         ORG   SDMSE_DSPLIST_OWNER                                      17400000
SDMSE_DSPLIST_OWNER_JOBNAME DS 1CL0008 Fill this in, left-justified,   *17450000
                         padded with blanks, if specifying a jobname   *17500000
                         as the owner.                                  17550000
         ORG   SDMSE_DSPLIST_OWNER_JOBNAME                              17600000
SDMSE_DSPLIST_OWNER_ZEROES DS 1CL0006 Make sure this is zeroes if      *17650000
                         specifying an ASID as the owner.               17700000
SDMSE_DSPLIST_OWNER_ASID DS 1FL2 Fill this in, zeroing the previous    *17750000
                         field too, if specifying an ASID as the       *17800000
                         owner.                                         17850000
SDMSE_DSPLIST_NAME DS 1CL0008 The data space name                       17900000
SDMSE_DSPLIST_LEN EQU *-SDMSE_DSPLIST                                   17950000
.L0011   ANOP                                                           18000000
         AIF   ('&SDMSE_SUBPLST' EQ 'NO').L0014                         18050000
         AIF   ('&DSECT' EQ 'YES').L0015                                18100000
         AIF   ('&SDMSE_SUBPLST' NE 'YES').L0014                        18150000
SDMSE_SUBPLST DS 0H                                                     18200000
         AGO   .L0016                                                   18250000
.L0015   ANOP                                                           18300000
SDMSE_SUBPLST DSECT                                                     18350000
.L0016   ANOP                                                           18400000
SDMSE_SUBPLST_HEADER DS 1CL0004 Header area                             18450000
         ORG   SDMSE_SUBPLST_HEADER                                     18500000
SDMSE_SUBPLST_LENGTH DS 1FL2 Total length of area including this       *18550000
                         length field                                   18600000
         DS    1CL0002   Reserved                                       18650000
SDMSE_SUBPLST_ENTRY DS 1CL0004 This represents an array of             *18700000
                         ASID/Subpool pairs                             18750000
         ORG   SDMSE_SUBPLST_ENTRY                                      18800000
SDMSE_SUBPLST_ASID DS 1FL2 The ASID to which the subpool applies        18850000
SDMSE_SUBPLST_SUBPOOL DS 1FL2 The subpool                               18900000
SDMSE_SUBPLST_LEN EQU *-SDMSE_SUBPLST                                   18950000
.L0014   ANOP                                                           19000000
         AIF   ('&SDMSE_KEYLIST' EQ 'NO').L0017                         19050000
         AIF   ('&DSECT' EQ 'YES').L0018                                19100000
         AIF   ('&SDMSE_KEYLIST' NE 'YES').L0017                        19150000
SDMSE_KEYLIST DS 0H                                                     19200000
         AGO   .L0019                                                   19250000
.L0018   ANOP                                                           19300000
SDMSE_KEYLIST DSECT                                                     19350000
.L0019   ANOP                                                           19400000
SDMSE_KEYLIST_HEADER DS 1CL0004 Header area                             19450000
         ORG   SDMSE_KEYLIST_HEADER                                     19500000
SDMSE_KEYLIST_LENGTH DS 1FL2 Total length of area including this       *19550000
                         length field                                   19600000
         DS    1CL0002   Reserved                                       19650000
SDMSE_KEYLIST_ENTRY DS 1CL0001 This represents an array of KEYs which  *19700000
                         are applied to the provided subpools           19750000
         ORG   SDMSE_KEYLIST_ENTRY                                      19800000
SDMSE_KEYLIST_KEY DS 1FL1 The key (must be X'00'-X'F0', not 0-15)       19850000
SDMSE_KEYLIST_LEN EQU *-SDMSE_KEYLIST                                   19900000
.L0017   ANOP                                                           19950000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 20000000
         AIF   ('&LIST' EQ 'YES').P4                                    20050000
.P3      ANOP                                                           20100000
         POP   PRINT                                                    20150000
.P4      ANOP                                                           20200000
.P_EXIT  ANOP                                                           20250000
         MEND                                                           20300000
**/ IHASDMSE_2:;                                                        20350000
* %IHASDMSE_INCLUDED = 'YES';                                           20400000
* %DCL ZCBPRINT CHAR EXT;                                               20450000
* %DEACTIVATE ZCBPRINT;                                                 20500000
* %DCL IHASDMSE_LIST CHAR EXT;                                          20550000
* %DEACTIVATE IHASDMSE_LIST;                                            20600000
* %IF IHASDMSE_LIST ^= 'NO' &                                           20650000
*    ZCBPRINT ^= 'NO' %THEN                                             20700000
*   %GOTO IHASDMSE_3;                                                   20750000
*   @LIST PUSH NOECHO;                                                  20800000
*   @LIST NOASSEMBLE NOECHO;                                            20850000
*   @LIST OFF C NOECHO;                                                 20900000
* %IHASDMSE_3:;                                                         20950000
*/* Start of PL/X Source                                             */ 21000000
*DCL 1 SDMSE BASED,                 /*                           @L1A*/ 21050000
*      2 SDMSE_VERSION FIXED(8),    /* Initial version is 0.            21100000
*               This can be used by the exit to tell just how the       21150000
*               parameter area is mapped.                        @L1A*/ 21200000
*      2 * CHAR(3),                 /* Unused                    @L1A*/ 21250000
*      2 SDMSE_INPUT_PROBDESC_ADDR PTR(31),  /* Address of              21300000
*               problem description information provided via            21350000
*               PROBDESC keyword when the SDUMP was initiated on a      21400000
*               remote system. If this pointer is 0, no such            21450000
*               information was provided. Otherwise, the area is        21500000
*               in the format described for that keyword.        @L1A*/ 21550000
*      2 SDMSE_INPUT_WORKAREA_ADDR PTR(31),  /* Address of 4096-byte    21600000
*               workarea that the exit can use to build                 21650000
*               information for use by SDUMP. This field is             21700000
*               an input value for the exit.                     @L1A*/ 21750000
*      2 SDMSE_OUTPUT_WORKAREA_ADDR PTR(31),  /* Address of             21800000
*               workarea that the exit provided via GETMAIN             21850000
*               or STORAGE OBTAIN when the input workarea was           21900000
*               not large enough. This field is to be set by            21950000
*               the exit when storage is so obtained.                   22000000
*               SDUMP will FREEMAIN this storage.                       22050000
*               The length and subpool and key must also be             22100000
*               provided.                                       @L1A*/  22150000
*      2 SDMSE_OUTPUT_WORKAREA_LENGTH PTR(31),  /* Length of            22200000
*               workarea pointed to by the output workarea.             22250000
*               SDUMP will FREEMAIN this area.                          22300000
*               This field is to be set by                              22350000
*               the exit when storage is so obtained.            @L1A*/ 22400000
*      2 SDMSE_OUTPUT_WORKAREA_SUBPOOL FIXED(8),  /*                    22450000
*               Subpool of output workarea.                             22500000
*               This field is to be set by                              22550000
*               the exit when storage is so obtained.            @L1A*/ 22600000
*      2 SDMSE_OUTPUT_WORKAREA_KEY FIXED(8),  /*                        22650000
*               Key of output workarea (must be in range                22700000
*               0-X'F0'). This field is to be set by                    22750000
*               the exit when storage is so obtained.            @L1A*/ 22800000
*      2 * CHAR(2),                           /* Reserved        @L1A*/ 22850000
*      2 SDMSE_OUTPUT_ASIDLST_ADDR PTR(31),          /*                 22900000
*               This field should be set if the exit has indicated      22950000
*               ASID(s) to be incorporated in the dump.                 23000000
*               The area pointed to by this field is mapped by          23050000
*               DSECT SDMSE_ASIDLST                              @L1A*/ 23100000
*      2 SDMSE_OUTPUT_STORAGE_ADDR PTR(31),          /*                 23150000
*               This field should be set if the exit has indicated      23200000
*               Storage Ranges to be incorporated in the dump.          23250000
*               The area pointed to by this field is mapped by          23300000
*               DSECT SDMSE_STORAGE                              @L1A*/ 23350000
*      2 SDMSE_OUTPUT_JOBLIST_ADDR PTR(31),    /*                       23400000
*               This field should be set if the exit has indicated      23450000
*               a list of jobnames to be incorporated in the dump.      23500000
*               The area pointed to by this field is mapped by          23550000
*               DSECT SDMSE_JOBLIST                              @L1A*/ 23600000
*      2 SDMSE_OUTPUT_DSPLIST_ADDR PTR(31),    /*                       23650000
*               This field should be set if the exit has indicated      23700000
*               a list of data space names by which data spaces are     23750000
*               to be incorporated in the dump.                         23800000
*               The area pointed to by this field is mapped by          23850000
*               DSECT SDMSE_DSPLIST                              @L1A*/ 23900000
*      2 SDMSE_OUTPUT_SUBPLST_ADDR PTR(31),   /*                        23950000
*               This field should be set if the exit has indicated      24000000
*               a list of subpools                                      24050000
*               to be incorporated in the dump.                         24100000
*               The area pointed to by this field is mapped by          24150000
*               DSECT SDMSE_SUBPLST                              @L1A*/ 24200000
*      2 SDMSE_OUTPUT_KEYLIST_ADDR PTR(31),   /*                        24250000
*               This field should be set if the exit has indicated      24300000
*               a list of keys to be incorporated in the dump. This     24350000
*               is ignored unless SDMSE_SUBPLST_ADDR is also specified. 24400000
*               The area pointed to by this field is mapped by          24450000
*               DSECT SDMSE_KEYLIST                              @L1A*/ 24500000
*      2 * CHAR(8),              /* Reserved                     @L1A*/ 24550000
*      2 SDMSE_SDATA_OPTIONS,    /* These are mapped in the same        24600000
*                   order as they appear in the SDUMP parameter         24650000
*                   list. The desired subfields should be set if        24700000
*                   the exit has indicated SDATA options for            24750000
*                   the dump.                                    @L1A*/ 24800000
*       3 SDMSE_SDATA_BYTE0 BIT(8),           /*                        24850000
*               This field should be set if the exit has indicated      24900000
*               SDATA options for the dump.                      @L1A*/ 24950000
*        4 SDMSE_SDATA_ALLPSA BIT(1),          /*                       25000000
*                 Corresponds to SDUMPX SDATA option ALLPSA             25050000
*                                                                @L1A*/ 25100000
*        4 SDMSE_SDATA_PSA BIT(1),          /*                          25150000
*                 Corresponds to SDUMPX SDATA option PSA                25200000
*                                                                @L1A*/ 25250000
*        4 SDMSE_SDATA_NUC BIT(1),          /*                          25300000
*                 Corresponds to SDUMPX SDATA option NUC                25350000
*                                                                @L1A*/ 25400000
*        4 SDMSE_SDATA_SQA BIT(1),          /*                          25450000
*                 Corresponds to SDUMPX SDATA option SQA                25500000
*                                                                @L1A*/ 25550000
*        4 SDMSE_SDATA_LSQA BIT(1),          /*                         25600000
*                 Corresponds to SDUMPX SDATA option LSQA               25650000
*                                                                @L1A*/ 25700000
*        4 SDMSE_SDATA_RGN BIT(1),          /*                          25750000
*                 Corresponds to SDUMPX SDATA option RGN                25800000
*                                                                @L1A*/ 25850000
*        4 SDMSE_SDATA_LPA BIT(1),          /*                          25900000
*                 Corresponds to SDUMPX SDATA option LPA                25950000
*                                                                @L1A*/ 26000000
*        4 SDMSE_SDATA_TRT BIT(1),          /*                          26050000
*                 Corresponds to SDUMPX SDATA option TRT                26100000
*                                                                @L1A*/ 26150000
*       3 SDMSE_SDATA_BYTE1 BIT(8),           /*                        26200000
*               This field should be set if the exit has indicated      26250000
*               SDATA options for the dump.                      @L1A*/ 26300000
*        4 SDMSE_SDATA_CSA BIT(1),        /*                            26350000
*                 Corresponds to SDUMPX SDATA option CSA                26400000
*                                                                @L1A*/ 26450000
*        4 SDMSE_SDATA_SWA BIT(1),        /*                            26500000
*                 Corresponds to SDUMPX SDATA option SWA                26550000
*                                                                @L1A*/ 26600000
*        4 SDMSE_SDATA_SUM BIT(1),        /*                            26650000
*                 Corresponds to SDUMPX SDATA option SUM                26700000
*                                                                @L1A*/ 26750000
*        4 * BIT(1),                 /* Reserved, must be 0             26800000
*                                                                @L1A*/ 26850000
*        4 * BIT(1),                 /* Reserved, must be 0             26900000
*                                                                @L1A*/ 26950000
*        4 * BIT(1),                 /* Reserved, must be 0             27000000
*                                                                @L1A*/ 27050000
*        4 SDMSE_SDATA_ALLNUC BIT(1),  /*                               27100000
*                 Corresponds to SDUMPX SDATA option ALLNUC             27150000
*                                                                @L1A*/ 27200000
*        4 SDMSE_SDATA_DEFS BIT(1),    /*                               27250000
*                 Corresponds to SDUMPX SDATA option DEFS               27300000
*                                                                @L1A*/ 27350000
*       3 SDMSE_SDATA_BYTE2 BIT(8),           /*                        27400000
*               This field should be set if the exit has indicated      27450000
*               SDATA options for the dump.                      @L1A*/ 27500000
*        4 SDMSE_SDATA_GRSQ BIT(1),        /*                           27550000
*                 Corresponds to SDUMPX SDATA option GRSQ               27600000
*                                                                @L1A*/ 27650000
*        4 * BIT(1),                 /* Reserved, must be 0             27700000
*                                                                @L1A*/ 27750000
*        4 * BIT(1),                 /* Reserved, must be 0             27800000
*                                                                @L1A*/ 27850000
*        4 SDMSE_SDATA_COUPLE BIT(1),    /*                             27900000
*                 Corresponds to SDUMPX SDATA option COUPLE             27950000
*                                                                @L1A*/ 28000000
*        4 SDMSE_SDATA_XESDATA BIT(1),   /*                             28050000
*                 Corresponds to SDUMPX SDATA option XESDATA            28100000
*                                                                @L1A*/ 28150000
*        4 * BIT(1),                 /* Reserved, must be 0      @L2A*/ 28170000
*        4 SDMSE_SDATA_WLM BIT(1),   /* Corresponds to SDUMPX SDATA     28190000
*                                      option XESDATA            @L2A*/ 28210000
*        4 * BIT(1),                 /* Reserved, must be 0      @L2C*/ 28230000
*       3 SDMSE_SDATA_BYTE3 BIT(8),  /* Sdata Byte 3             @L2C*/ 28250000
*        4 * BIT(2),                 /* Reserved, must be 0      @L2A*/ 28270000
*        4 SDMSE_SDATA_SERVERS BIT(1), /* Corresponds to SDUMPX SDATA   28290000
*                                      option SERVERS            @L2A*/ 28310000
*        4 * BIT(5),                 /* Reserved, must be 0      @L2C*/ 28330000
*       3 SDMSE_SDATA_BYTE4 BIT(8),           /* Sdata Byte 4    @L1A*/ 28350000
*        4 * BIT(1),                 /* Reserved, must be 0             28400000
*                                                                @L1A*/ 28450000
*        4 SDMSE_SDATA_IO BIT(1),              /*                       28500000
*                 Corresponds to SDUMPX SDATA option IO                 28550000
*                                                                @L1A*/ 28600000
*        4 * BIT(6),                /* Reserved, must be 0       @L1A*/ 28650000
*       3 SDMSE_SDATA_BYTE5 BIT(8),           /* Sdata Byte 5 -         28700000
*                                      Reserved, must be 0       @L1A*/ 28750000
*       3 SDMSE_SDATA_RSVD CHAR(2), /* Reserved, must be 0       @L1A*/ 28800000
*      2 SDMSE_INPUT_ASIDLST_ADDR PTR(31), /* This field indicates the  28805500
*               ASID(s) incorporated in the dump. The area pointed to   28811000
*               by this field is mapped by DSECT SDMSE_ASIDLST   @L2A*/ 28816500
*      2 SDMSE_INPUT_STORAGE_ADDR PTR(31), /* This field indicates the  28822000
*               Storage Ranges incorporated in the dump. The area       28827500
*               pointed to by this field is mapped by DSECT             28833000
*               SDMSE_STORAGE                                    @L2A*/ 28838500
*      2 SDMSE_INPUT_SUBPLST_ADDR PTR(31), /* This field indicates the  28844000
*               list of subpools incorporated in the dump.  The area    28849500
*               pointed to by this field is mapped by DSECT             28855000
*               SDMSE_SUBPLST                                    @L2A*/ 28860500
*      2 SDMSE_INPUT_KEYLIST_ADDR PTR(31),    /* This field indicates   28866000
*               the list of keys incorporated in the dump. This will    28871500
*               only be specified if SDMSE_SUBPLST_ADDR is also         28877000
*               specified.  The area pointed to by this field is mapped 28882500
*               by DSECT SDMSE_KEYLIST                           @L2A*/ 28888000
*      2 * CHAR(16),                          /* Unused          @L2A*/ 28893500
*      2 * CHAR(0);                 /* End of mapping            @L1A*/ 28900000
*                                                                       28950000
*DCL SDMSE_VERSION_CURRENT Fixed(8) Constant(0);    /*           @L1A*/ 29000000
*DCL SDMSE_VERSION_0 Fixed(8) Constant(0);          /*           @L1A*/ 29050000
*                                                                       29100000
*DCL 1 SDMSE_MODEL BASED,                   /* Model entry       @L1A*/ 29150000
*      2 SDMSE_MODEL_HEADER,                /* Header area       @L1A*/ 29200000
*        3 SDMSE_MODEL_LENGTH FIXED(15),    /* Total length of area     29250000
*                   including this length field                  @L1A*/ 29300000
*        3 * CHAR(2),                       /* Reserved          @L1A*/ 29350000
*      2 SDMSE_MODEL_ENTRY(*);              /* An entry          @L1A*/ 29400000
*                                                                       29450000
*DCL 1 SDMSE_ASIDLST BASED,                         /*           @L1A*/ 29500000
*      2 SDMSE_ASIDLST_HEADER,              /* Header area       @L1A*/ 29550000
*        3 SDMSE_ASIDLST_LENGTH FIXED(15),  /* Total length of area     29600000
*                   including this length field                  @L1A*/ 29650000
*        3 * CHAR(2),                       /* Reserved          @L1A*/ 29700000
*      2 SDMSE_ASIDLST_ENTRY(*),            /* This represents an       29750000
*                   array of ASIDs                               @L1A*/ 29800000
*        3 SDMSE_ASIDLST_ASID FIXED(15);    /* The ASID                 29850000
*                                                                @L1A*/ 29900000
*                                                                       29950000
*DCL 1 SDMSE_STORAGE BASED,                         /*           @L1A*/ 30000000
*      2 SDMSE_STORAGE_HEADER,              /* Header area       @L1A*/ 30050000
*        3 SDMSE_STORAGE_LENGTH FIXED(15),  /* Total length of area     30100000
*                   including this length field                  @L1A*/ 30150000
*        3 * CHAR(2),                       /* Reserved                 30200000
*                                                                @L1A*/ 30250000
*      2 SDMSE_STORAGE_ENTRY(*),            /* This represents an       30300000
*                   array of start/end address pairs             @L1A*/ 30350000
*        3 SDMSE_STORAGE_STOKEN CHAR(8),    /* STOKEN of storage        30400000
*                                                                @L1A*/ 30450000
*        3 SDMSE_STORAGE_START PTR(31),     /* Start of range           30500000
*                                                                @L1A*/ 30550000
*        3 SDMSE_STORAGE_END PTR(31);       /* End of range             30600000
*                                                                @L1A*/ 30650000
*                                                                       30700000
*DCL 1 SDMSE_JOBLIST BASED,                         /*           @L1A*/ 30750000
*      2 SDMSE_JOBLIST_HEADER,              /* Header area       @L1A*/ 30800000
*        3 SDMSE_JOBLIST_LENGTH FIXED(15),  /* Total length of area     30850000
*                   including this length field                  @L1A*/ 30900000
*        3 * CHAR(2),                       /* Reserved                 30950000
*                                                                @L1A*/ 31000000
*      2 SDMSE_JOBLIST_ENTRY(*),            /* This represents an       31050000
*                   array of job names                           @L1A*/ 31100000
*        3 SDMSE_JOBLIST_NAME CHAR(8);      /* The jobname              31150000
*                                                                @L1A*/ 31200000
*                                                                       31250000
*DCL 1 SDMSE_DSPLIST BASED,                         /*           @L1A*/ 31300000
*      2 SDMSE_DSPLIST_HEADER,              /* Header area       @L1A*/ 31350000
*        3 SDMSE_DSPLIST_LENGTH FIXED(15),  /* Total length of area     31400000
*                   including this length field                  @L1A*/ 31450000
*        3 * CHAR(2),                       /* Reserved                 31500000
*                                                                @L1A*/ 31550000
*      2 SDMSE_DSPLIST_ENTRY(*),            /* This represents an       31600000
*                   array of data space owners and names         @L1A*/ 31650000
*        3 SDMSE_DSPLIST_OWNER,             /* The owner of the data    31700000
*                   space: this can be by jobname or by ASID            31750000
*                                                                @L1A*/ 31800000
*          4 SDMSE_DSPLIST_OWNER_JOBNAME CHAR(8) BDY(WORD), /* Fill     31850000
*                   this in, left-justified, padded with blanks, if     31900000
*                   specifying a jobname as the owner.                  31950000
*                                                                @L1A*/ 32000000
*            5 SDMSE_DSPLIST_OWNER_ZEROES CHAR(6), /* Make sure this    32050000
*                   is zeroes if specifying an ASID as the owner.       32100000
*                                                                @L1A*/ 32150000
*            5 SDMSE_DSPLIST_OWNER_ASID FIXED(15), /* Fill this in,     32200000
*                   zeroing the previous field too, if specifying       32250000
*                   an ASID as the owner.                               32300000
*                                                                @L1A*/ 32350000
*        3 SDMSE_DSPLIST_NAME CHAR(8);      /* The data space name      32400000
*                                                                @L1A*/ 32450000
*                                                                       32500000
*DCL 1 SDMSE_SUBPLST BASED,                         /*           @L1A*/ 32550000
*      2 SDMSE_SUBPLST_HEADER,              /* Header area       @L1A*/ 32600000
*        3 SDMSE_SUBPLST_LENGTH FIXED(15),  /* Total length of area     32650000
*                   including this length field                  @L1A*/ 32700000
*        3 * CHAR(2),                       /* Reserved          @L1A*/ 32750000
*      2 SDMSE_SUBPLST_ENTRY(*),            /* This represents an       32800000
*                   array of ASID/Subpool pairs                  @L1A*/ 32850000
*        3 SDMSE_SUBPLST_ASID FIXED(15),    /* The ASID to which the    32900000
*                   subpool applies                              @L1A*/ 32950000
*        3 SDMSE_SUBPLST_SUBPOOL FIXED(15); /* The subpool              33000000
*                                                                @L1A*/ 33050000
*                                                                       33100000
*DCL 1 sdmse_keylist BASED,                         /*           @L1A*/ 33150000
*      2 sdmse_keylist_HEADER,              /* Header area       @L1A*/ 33200000
*        3 sdmse_keylist_LENGTH FIXED(15),  /* Total length of area     33250000
*                   including this length field                  @L1A*/ 33300000
*        3 * CHAR(2),                       /* Reserved          @L1A*/ 33350000
*      2 sdmse_keylist_ENTRY(*),            /* This represents an       33400000
*                   array of KEYs which are applied to the              33450000
*                   provided subpools                            @L1A*/ 33500000
*        3 sdmse_keylist_KEY FIXED(8);      /* The key (must be         33550000
*                   X'00'-X'F0', not 0-15)                       @L1A*/ 33600000
* @LOGIC;                                                               33650000
* #PRAGMA TOOL=CBGEN.                                                   33700000
* #USEORG.                                                              33750000
* #EPRAGMA.                                                             33800000
* @ENDLOGIC;                                                            33850000
*/* End of PL/X Source                                               */ 33900000
* %IF IHASDMSE_LIST ^= 'NO' &                                           33950000
*    ZCBPRINT ^= 'NO' %THEN                                             34000000
*   %GOTO IHASDMSE_4;                                                   34050000
*   @LIST POP NOECHO;                                                   34100000
* %IHASDMSE_4:;                                                         34150000
* %END;                                                                 34200000
