*                                                                       00050000
* %DCL IHATDRMT_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IHATDRMT_INCLUDED;                                        00150000
* %IF IHATDRMT_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*% /*                                                                   00300000
         MACRO                                                          00350000
         IHATDRMT &DSECT=YES,&LIST=YES,&TITLE=YES,&TDRMT=YES,          *00400000
               &TDRMT_MODEL=COND,&TDRMT_SYSLIST=COND,                  *00450000
               &TDRMT_GRPLIST=COND,&TDRMT_SDATA=COND,                  *00500000
               &TDRMT_SUBPLST=COND,&TDRMT_COPY=COND                     00550000
         GBLC  &IHATDRMT_INCLUDED                                       00600000
         GBLC  &ZCBPRINT                                                00650000
&IHATDRMT_INCLUDED SETC 'YES'                                           00700000
         AIF   ('&LIST' EQ 'NONE').P0                                   00750000
         AIF   ('&TITLE' EQ 'NO').P5                                    00800000
 TITLE   'IHATDRMT  - Transaction dump REMOTE information area       '  00850000
.P5      ANOP                                                           00900000
**/ IHATDRMT_1:;                                                        00950000
*/* START OF SPECIFICATIONS ******************************************* 01000000
**/                                                                     01050000
*/*01* PROPRIETARY STATEMENT=                                        */ 01100000
*/***PROPRIETARY_STATEMENT********************************************/ 01150000
*/*  Proprietary Statement =                                         */ 01200000
*/*                                                                  */ 01250000
*/*              LICENSED MATERIALS - PROPERTY OF IBM                */ 01300000
*/*              THIS MACRO IS "RESTRICTED MATERIALS OF IBM"         */ 01350000
*/*              5645-001 (C) COPYRIGHT IBM CORP 1997                */ 01400000
*/*              SEE COPYRIGHT INSTRUCTIONS                          */ 01450000
*/*                                                                  */ 01500000
*/*  Status = JBB6604                                                */ 01550000
*/*                                                                  */ 01600000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01650000
*/*                                                                     01700000
*01* DESCRIPTIVE NAME:  Transaction dump REMOTE information area        01750000
*02*  ACRONYM:  TDRMT                                                   01800000
*                                                                       01850000
*01* MACRO NAME:  IHATDRMT                                              01900000
*                                                                       01950000
*01* EXTERNAL CLASSIFICATION: GUPI                                      02000000
*01* END OF EXTERNAL CLASSIFICATION:                                    02050000
*                                                                       02100000
*01* DSECT NAME:                                                        02150000
*     TDRMT                                                             02200000
*     TDRMT_MODEL                                                       02250000
*     TDRMT_SYSLIST                                                     02300000
*     TDRMT_GRPLIST                                                     02350000
*     TDRMT_SDATA                                                       02400000
*     TDRMT_SUBPLST                                                     02450000
*     TDRMT_COPY                                                        02500000
*                                                                       02550000
*01* COMPONENT:  SDUMP (SCDMP)                                          02600000
*                                                                       02650000
*01* EYE-CATCHER:  NONE                                                 02700000
*                                                                       02750000
*01* STORAGE ATTRIBUTES:                                                02800000
*02*  SUBPOOL:  Caller-supplied                                         02850000
*02*  KEY:  Caller-supplied                                             02900000
*02*  RESIDENCY:  Caller-supplied                                       02950000
*                                                                       03000000
*01* SIZE:  Variable                                                    03050000
*                TDRMT         -- X'0004' bytes                         03100000
*                TDRMT_MODEL   -- X'0004' bytes                         03150000
*                TDRMT_SYSLIST -- X'0014' bytes                         03200000
*                                 + X'0018' bytes for each entry        03250000
*                                 after the first                       03300000
*                TDRMT_GRPLIST -- X'001C' bytes                         03350000
*                                 + X'0018' bytes for each entry        03400000
*                                 after the first                       03450000
*                TDRMT_SDATA   -- X'0008' bytes                         03500000
*                TDRMT_SUBPLST -- X'0006' bytes                         03550000
*                                 + X'0004' bytes for each entry        03600000
*                                 after the first                       03650000
*                TDRMT_COPY    -- X'0004' bytes                         03700000
*                                                                       03750000
*01* CREATED BY:                                                        03800000
*     Created by Caller and passed as parameter on REMOTE keyword       03850000
*      on IEATDUMP                                                      03900000
*                                                                       03950000
*01* POINTED TO BY:                                                     04000000
*     IEATDUMP parameter list                                           04050000
*                                                                       04100000
*01* SERIALIZATION:                                                     04150000
*     None required                                                     04200000
*                                                                       04250000
*01* FUNCTION:                                                          04300000
*02* Maps the data passed by the REMOTE keyword.                        04350000
*                                                                       04400000
*01* METHOD OF ACCESS:                                                  04450000
*02*  ASM:                                                              04500000
*      IHATDRMT                                                         04550000
*           DSECT=YES|NO  -- Request DSECT definition                   04600000
*           TDRMT=YES|NO|COND -- Request mapping of parameter           04650000
*                            information                                04700000
*                            USING on TDRMT                             04750000
*           TDRMT_MODEL=YES|NO|COND -- Mapping of model entry           04800000
*           TDRMT_SYSLIST=YES|NO|COND -- Mapping of SYSLIST             04850000
*           TDRMT_GRPLIST=YES|NO|COND -- Mapping of GRPLIST             04900000
*           TDRMT_SDATA=YES|NO|COND -- Mapping of SDATA                 04950000
*           TDRMT_SUBPLST=YES|NO|COND -- Mapping of SUBPLST             05000000
*           TDRMT_COPY=YES|NO|COND -- Mapping of COPY'd things          05050000
*     Default: DSECT=YES,TDRMT=YES,                                     05100000
*              TDRMT_MODEL=COND,                                        05150000
*              TDRMT_SYSLIST=COND,                                      05200000
*              TDRMT_GRPLIST=COND,                                      05250000
*              TDRMT_SDATA=COND,                                        05300000
*              TDRMT_SUBPLST=COND,                                      05350000
*              TDRMT_COPY=COND                                          05400000
*02*  PL/AS:                                                            05450000
*      %INCLUDE SYSLIB(IHATDRMT)                                        05500000
*                                                                       05550000
*01* DELETED BY:  Caller                                                05600000
*                                                                       05650000
*01* FREQUENCY:  Created for input to IEATDUMP REMOTE=rrrrr             05700000
*                                                                       05750000
*01* DEPENDENCIES:  TDRMT_IDCONs and mappings must match                05800000
*                   SDRMT_IDCONs and mappings because both are          05850000
*                   procesed by ParseSignal in IEAVTS1T                 05900000
*                                                                       05950000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     06000000
*                                                                       06050000
*01* CHANGE ACTIVITY:                                                   06100000
*  $L0=TDUMP    JBB6604 970101 PDHT: Transaction dump                   06150000
*     =OW27000  JBB6604 970724 PDHT: TDUMP Remote processing            06200000
*                                                                       06250000
* END OF SPECIFICATIONS *********************************************/  06300000
*% /*                                                                   06350000
.P0      ANOP                                                           06400000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 06450000
         AIF   ('&LIST' EQ 'YES').P2                                    06500000
.P1      ANOP                                                           06550000
         PUSH  PRINT                                                    06600000
         PRINT OFF                                                      06650000
.P2      ANOP                                                           06700000
         AIF   ('&TDRMT' EQ 'NO').L0002                                 06750000
         AIF   ('&DSECT' EQ 'YES').L0003                                06800000
         AIF   ('&TDRMT' NE 'YES').L0002                                06850000
TDRMT    DS    0F                                                       06900000
         AGO   .L0004                                                   06950000
.L0003   ANOP                                                           07000000
TDRMT    DSECT                                                          07050000
.L0004   ANOP                                                           07100000
TDRMT_LENGTH DS 1FL4     Total length for REMOTE info. Data begins at  *07150000
                         TDRMT_DATA with entries contiguously defined  *07200000
                         from that point.                               07250000
TDRMT_DATA DS  0C        Start of remote data                           07300000
*                                                                       07350000
*    *****************************************************************  07400000
*    *                                                               *  07450000
*    * Constants to identify the DSECT. Note that the constants      *  07500000
*    * ending with "_COPY" should use the TDRMT_COPY DSECT.          *  07550000
*    *                                                               *  07600000
*    *****************************************************************  07650000
*                                                                       07700000
*                                                                       07750000
TDRMT_IDCON_SYSLIST EQU 4                                               07800000
TDRMT_IDCON_GRPLIST EQU 8                                               07850000
TDRMT_IDCON_SDATA EQU 12                                                07900000
TDRMT_IDCON_SDATA_COPY EQU 13                                           07950000
TDRMT_IDCON_SUBPLST EQU 32                                              08000000
TDRMT_LEN EQU  *-TDRMT                                                  08050000
.L0002   ANOP                                                           08100000
         AIF   ('&TDRMT_MODEL' EQ 'NO').L0005                           08150000
         AIF   ('&DSECT' EQ 'YES').L0006                                08200000
         AIF   ('&TDRMT_MODEL' NE 'YES').L0005                          08250000
TDRMT_MODEL DS 0H                                                       08300000
         AGO   .L0007                                                   08350000
.L0006   ANOP                                                           08400000
TDRMT_MODEL DSECT                                                       08450000
.L0007   ANOP                                                           08500000
TDRMT_MODEL_HEADER DS 0CL0004                                           08550000
TDRMT_MODEL_ID DS 1FL2   Contains the ID of the entry                   08600000
TDRMT_MODEL_LENGTH DS 1FL2 Total length of area including this length  *08650000
                         field and the ID field                         08700000
TDRMT_MODEL_ENTRY DS 0C  Start of data for the entry                    08750000
TDRMT_MODEL_LEN EQU *-TDRMT_MODEL                                       08800000
.L0005   ANOP                                                           08850000
         AIF   ('&TDRMT_SYSLIST' EQ 'NO').L0008                         08900000
         AIF   ('&DSECT' EQ 'YES').L0009                                08950000
         AIF   ('&TDRMT_SYSLIST' NE 'YES').L0008                        09000000
TDRMT_SYSLIST DS 0F                                                     09050000
         AGO   .L000A                                                   09100000
.L0009   ANOP                                                           09150000
TDRMT_SYSLIST DSECT                                                     09200000
.L000A   ANOP                                                           09250000
TDRMT_SYSLIST_HEADER DS 0CL0004                                         09300000
TDRMT_SYSLIST_ID DS 1FL2 Use TDRMT_IDCON_SYSLIST to initialize          09350000
TDRMT_SYSLIST_LENGTH DS 1FL2 Total length of area including this       *09400000
                         length field and the ID field                  09450000
TDRMT_SYSLIST_ENTRY DS 0CL0016 This represents an array of             *09500000
                         sysname/jobname or sysname/ASID pairs          09550000
TDRMT_SYSLIST_SYSNAME DS 1CL0008 The system name                        09600000
TDRMT_SYSLIST_JOBNAME_ASID DS 0CL0008 Area that contains either all 0s *09650000
                         (no jobname/ASID), JOBNAME/ID, or ZEROES&ASID  09700000
TDRMT_SYSLIST_JOBNAME DS 0CL0008 Fill this in, left-justified, padded  *09750000
                         with blanks, if specifying a jobname. The     *09800000
                         entire field should be 0s if neither jobname  *09850000
                         nor ASID is wanted.                            09900000
TDRMT_SYSLIST_ZEROES DS 1CL0006 Make sure this is zeroes if specifying *09950000
                         an ASID.                                       10000000
TDRMT_SYSLIST_ASID DS 1FL2 Fill this in, zeroing the previous field    *10050000
                         too, if specifying an ASID.                    10100000
TDRMT_SYSLIST_LEN EQU *-TDRMT_SYSLIST                                   10150000
.L0008   ANOP                                                           10200000
         AIF   ('&TDRMT_GRPLIST' EQ 'NO').L000B                         10250000
         AIF   ('&DSECT' EQ 'YES').L000C                                10300000
         AIF   ('&TDRMT_GRPLIST' NE 'YES').L000B                        10350000
TDRMT_GRPLIST DS 0H                                                     10400000
         AGO   .L000D                                                   10450000
.L000C   ANOP                                                           10500000
TDRMT_GRPLIST DSECT                                                     10550000
.L000D   ANOP                                                           10600000
TDRMT_GRPLIST_HEADER DS 0CL0004                                         10650000
TDRMT_GRPLIST_ID DS 1FL2 Use TDRMT_IDCON_GRPLIST to initialize          10700000
TDRMT_GRPLIST_LENGTH DS 1FL2 Total length of area including this       *10750000
                         length field and the ID field                  10800000
TDRMT_GRPLIST_ENTRY DS 0CL0024 This represents an array of             *10850000
                         group/member pairs. If all members of the     *10900000
                         group are wanted, use a member name of "*".    10950000
TDRMT_GRPLIST_GRPNAME DS 1CL0008 The group name                         11000000
TDRMT_GRPLIST_MEMNAME DS 1CL0016 The member name                        11050000
TDRMT_GRPLIST_LEN EQU *-TDRMT_GRPLIST                                   11100000
.L000B   ANOP                                                           11150000
         AIF   ('&TDRMT_SDATA' EQ 'NO').L000E                           11200000
         AIF   ('&DSECT' EQ 'YES').L000F                                11250000
         AIF   ('&TDRMT_SDATA' NE 'YES').L000E                          11300000
TDRMT_SDATA DS 0H        This field should be set if the caller has    *11350000
                         indicated SDATA options for the dump.          11400000
         AGO   .L0010                                                   11450000
.L000F   ANOP                                                           11500000
TDRMT_SDATA DSECT        This field should be set if the caller has    *11550000
                         indicated SDATA options for the dump.          11600000
.L0010   ANOP                                                           11650000
TDRMT_SDATA_HEADER DS 0CL0004                                           11700000
TDRMT_SDATA_ID DS 1FL2   Use TDRMT_IDCON_SDATA to initialize            11750000
TDRMT_SDATA_LENGTH DS 1FL2 Total length of area including this length  *11800000
                         field and the ID field                         11850000
TDRMT_SDATA_OPTIONS DS 0CL0004 These are mapped in the same order as   *11900000
                         they appear in the IEATDUMP parameter list     11950000
TDRMT_SDATA_BYTE1 DS 0BL1                                               12000000
TDRMT_SDATA_DEFS EQU X'80' Corresponds to SDATA=DEF on IEATDUMP         12050000
TDRMT_SDATA_ALLNUC EQU X'40' Corresponds to SDATA=ALLNUC on IEATDUMP    12100000
TDRMT_SDATA_CSA EQU X'20' Corresponds to SDATA=CSA on IEATDUMP          12150000
TDRMT_SDATA_GRSQ EQU X'10' Corresponds to SDATA=GRSQ on IEATDUMP        12200000
TDRMT_SDATA_LPA EQU X'08' Corresponds to SDATA=LPA on IEATDUMP          12250000
TDRMT_SDATA_LSQA EQU X'04' Corresponds to SDATA=LSQA on IEATDUMP        12300000
TDRMT_SDATA_NUC EQU X'02' Corresponds to SDATA=NUC on IEATDUMP          12350000
TDRMT_SDATA_RGN EQU X'01' Corresponds to SDATA=RGN on IEATDUMP          12400000
         ORG   TDRMT_SDATA_BYTE1+X'00000001'                            12450000
TDRMT_SDATA_BYTE2 DS 0BL1                                               12500000
TDRMT_SDATA_SQA EQU X'80' Corresponds to SDATA=SQA on IEATDUMP          12550000
TDRMT_SDATA_SUM EQU X'40' Corresponds to SDATA=SUM on IEATDUMP          12600000
TDRMT_SDATA_SWA EQU X'20' Corresponds to SDATA=SWA on IEATDUMP          12650000
TDRMT_SDATA_TRT EQU X'10' Corresponds to SDATA=TRT on IEATDUMP          12700000
TDRMT_SDATA_PSA EQU X'08' Corresponds to SDATA=PSA on IEATDUMP          12750000
         ORG   TDRMT_SDATA_BYTE2+X'00000001'                            12800000
TDRMT_SDATA_RSVD DS 1CL0002 Reserved, must be 0                         12850000
TDRMT_SDATA_LEN EQU *-TDRMT_SDATA                                       12900000
.L000E   ANOP                                                           12950000
         AIF   ('&TDRMT_SUBPLST' EQ 'NO').L0011                         13000000
         AIF   ('&DSECT' EQ 'YES').L0012                                13050000
         AIF   ('&TDRMT_SUBPLST' NE 'YES').L0011                        13100000
TDRMT_SUBPLST DS 0H                                                     13150000
         AGO   .L0013                                                   13200000
.L0012   ANOP                                                           13250000
TDRMT_SUBPLST DSECT                                                     13300000
.L0013   ANOP                                                           13350000
TDRMT_SUBPLST_HEADER DS 0CL0004                                         13400000
TDRMT_SUBPLST_ID DS 1FL2 Use TDRMT_IDCON_SUBPLST to initialize          13450000
TDRMT_SUBPLST_LENGTH DS 1FL2 Total length of area including this       *13500000
                         length field and the ID field                  13550000
TDRMT_SUBPLST_ENTRY DS 0CL0002 This represents an array of Subpools     13600000
TDRMT_SUBPLST_SUBPOOL DS 1FL2 The subpool                               13650000
TDRMT_SUBPLST_LEN EQU *-TDRMT_SUBPLST                                   13700000
.L0011   ANOP                                                           13750000
         AIF   ('&TDRMT_COPY' EQ 'NO').L0014                            13800000
         AIF   ('&DSECT' EQ 'YES').L0015                                13850000
         AIF   ('&TDRMT_COPY' NE 'YES').L0014                           13900000
TDRMT_COPY DS  0H                                                       13950000
         AGO   .L0016                                                   14000000
.L0015   ANOP                                                           14050000
TDRMT_COPY DSECT                                                        14100000
.L0016   ANOP                                                           14150000
TDRMT_COPY_HEADER DS 0CL0004                                            14200000
TDRMT_COPY_ID DS 1FL2    Use TDRMT_xxxxx_COPY to initialize             14250000
TDRMT_COPY_LENGTH DS 1FL2 Total length of area including this length   *14300000
                         field and the ID field                         14350000
TDRMT_COPY_LEN EQU *-TDRMT_COPY                                         14400000
.L0014   ANOP                                                           14450000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 14500000
         AIF   ('&LIST' EQ 'YES').P4                                    14550000
.P3      ANOP                                                           14600000
         POP   PRINT                                                    14650000
.P4      ANOP                                                           14700000
.P_EXIT  ANOP                                                           14750000
         MEND                                                           14800000
**/ IHATDRMT_2:;                                                        14850000
* %IHATDRMT_INCLUDED = 'YES';                                           14900000
* %DCL ZCBPRINT CHAR EXT;                                               14950000
* %DEACTIVATE ZCBPRINT;                                                 15000000
* %DCL IHATDRMT_LIST CHAR EXT;                                          15050000
* %DEACTIVATE IHATDRMT_LIST;                                            15100000
* %IF IHATDRMT_LIST ^= 'NO' &                                           15150000
*    ZCBPRINT ^= 'NO' %THEN                                             15200000
*   %GOTO IHATDRMT_3;                                                   15250000
*   @LIST PUSH NOECHO;                                                  15300000
*   @LIST NOASSEMBLE NOECHO;                                            15350000
*   @LIST OFF C NOECHO;                                                 15400000
* %IHATDRMT_3:;                                                         15450000
*/* Start of PL/X Source                                             */ 15500000
*DCL 1 TDRMT BASED,                 /*                               */ 15550000
*      2 TDRMT_LENGTH FIXED(31) UNSIGNED,  /* Total length for          15600000
*               REMOTE info. Data begins at TDRMT_DATA with             15650000
*               entries contiguously defined from that point.        */ 15700000
*      2 TDRMT_DATA CHAR(0);        /* Start of remote data          */ 15750000
*                                                                       15800000
*    /* Constants to identify the DSECT. Note that the                  15850000
*       constants ending with "_COPY" should use the                    15900000
*       TDRMT_COPY DSECT.                                               15950000
*                                                                    */ 16000000
*DCL TDRMT_IDCON_SYSLIST FIXED(15) Constant(4);     /*               */ 16050000
*DCL TDRMT_IDCON_GRPLIST FIXED(15) Constant(8);     /*               */ 16100000
*DCL TDRMT_IDCON_SDATA FIXED(15) Constant(12);      /*               */ 16150000
*DCL TDRMT_IDCON_SDATA_COPY FIXED(15) Constant(13); /*               */ 16200000
*DCL TDRMT_IDCON_SUBPLST FIXED(15) Constant(32);    /*               */ 16250000
*                                                                       16300000
*DCL 1 TDRMT_MODEL BASED,                           /*               */ 16350000
*      2 TDRMT_MODEL_HEADER,                /*                       */ 16400000
*        3 TDRMT_MODEL_ID FIXED(15),        /* Contains                 16450000
*                   the ID of the entry                              */ 16500000
*        3 TDRMT_MODEL_LENGTH FIXED(15),    /* Total length of area     16550000
*                   including this length field and the ID field     */ 16600000
*      2 TDRMT_MODEL_ENTRY CHAR(*);         /* Start of data            16650000
*                   for the entry                                    */ 16700000
*                                                                       16750000
*DCL 1 TDRMT_SYSLIST BASED,                         /*               */ 16800000
*      2 TDRMT_SYSLIST_HEADER,              /*                       */ 16850000
*        3 TDRMT_SYSLIST_ID FIXED(15),      /* Use                      16900000
*                   TDRMT_IDCON_SYSLIST to initialize                */ 16950000
*        3 TDRMT_SYSLIST_LENGTH FIXED(15),  /* Total length of area     17000000
*                   including this length field and the ID field     */ 17050000
*      2 TDRMT_SYSLIST_ENTRY(*),            /* This represents an       17100000
*                   array of sysname/jobname or sysname/ASID pairs      17150000
*                                                                    */ 17200000
*        3 TDRMT_SYSLIST_SYSNAME CHAR(8),   /* The system name          17250000
*                                                                    */ 17300000
*        3 TDRMT_SYSLIST_JOBNAME_ASID BDY(WORD),           /* Area      17350000
*                   that contains either all 0s (no jobname/ASID),      17400000
*                   JOBNAME/ID, or ZEROES&ASID                       */ 17450000
*          4 TDRMT_SYSLIST_JOBNAME CHAR(8) BDY(WORD), /* Fill           17500000
*                   this in, left-justified, padded with blanks, if     17550000
*                   specifying a jobname. The entire field should be    17600000
*                   0s if neither jobname nor ASID is wanted.           17650000
*                                                                    */ 17700000
*            5 TDRMT_SYSLIST_ZEROES CHAR(6), /* Make sure this          17750000
*                   is zeroes if specifying an ASID.                    17800000
*                                                                    */ 17850000
*            5 TDRMT_SYSLIST_ASID FIXED(15); /* Fill this in,           17900000
*                   zeroing the previous field too, if specifying       17950000
*                   an ASID.                                            18000000
*                                                                    */ 18050000
*                                                                       18100000
*DCL 1 TDRMT_GRPLIST BASED,                         /*               */ 18150000
*      2 TDRMT_GRPLIST_HEADER,              /*                       */ 18200000
*        3 TDRMT_GRPLIST_ID FIXED(15),      /* Use                      18250000
*                   TDRMT_IDCON_GRPLIST to initialize                */ 18300000
*        3 TDRMT_GRPLIST_LENGTH FIXED(15),  /* Total length of area     18350000
*                   including this length field and the ID field     */ 18400000
*      2 TDRMT_GRPLIST_ENTRY(*),            /* This represents an       18450000
*                   array of group/member pairs. If all members         18500000
*                   of the group are wanted, use a member name of       18550000
*                   "*".                                             */ 18600000
*        3 TDRMT_GRPLIST_GRPNAME CHAR(8),   /* The group name           18650000
*                                                                    */ 18700000
*        3 TDRMT_GRPLIST_MEMNAME CHAR(16);  /* The member name          18750000
*                                                                    */ 18800000
*                                                                       18850000
*DCL 1 TDRMT_SDATA BASED,           /* This field should be set if the  18900000
*                                      caller has indicated SDATA       18950000
*                                      options for the dump.         */ 19000000
*      2 TDRMT_SDATA_HEADER,                                            19050000
*        3 TDRMT_SDATA_ID FIXED(15), /* Use TDRMT_IDCON_SDATA to        19100000
*                                      initialize                    */ 19150000
*        3 TDRMT_SDATA_LENGTH FIXED(15), /* Total length of area        19200000
*                                      including this length field and  19250000
*                                      the ID field                  */ 19300000
*      2 TDRMT_SDATA_OPTIONS,       /* These are mapped in the same     19350000
*                                      order as they appear in the      19400000
*                                      IEATDUMP parameter list       */ 19450000
*       3 TDRMT_SDATA_BYTE1 BIT(8),                                     19500000
*        4 TDRMT_SDATA_DEFS BIT(1), /* Corresponds to SDATA=DEF on      19550000
*                                      IEATDUMP                      */ 19600000
*        4 TDRMT_SDATA_ALLNUC BIT(1), /* Corresponds to SDATA=ALLNUC on 19650000
*                                      IEATDUMP                      */ 19700000
*        4 TDRMT_SDATA_CSA BIT(1),  /* Corresponds to SDATA=CSA on      19750000
*                                      IEATDUMP                      */ 19800000
*        4 TDRMT_SDATA_GRSQ BIT(1), /* Corresponds to SDATA=GRSQ on     19850000
*                                      IEATDUMP                      */ 19900000
*        4 TDRMT_SDATA_LPA BIT(1),  /* Corresponds to SDATA=LPA on      19950000
*                                      IEATDUMP                      */ 20000000
*        4 TDRMT_SDATA_LSQA BIT(1), /* Corresponds to SDATA=LSQA on     20050000
*                                      IEATDUMP                      */ 20100000
*        4 TDRMT_SDATA_NUC BIT(1),  /* Corresponds to SDATA=NUC on      20150000
*                                      IEATDUMP                      */ 20200000
*        4 TDRMT_SDATA_RGN BIT(1),  /* Corresponds to SDATA=RGN on      20250000
*                                      IEATDUMP                      */ 20300000
*       3 TDRMT_SDATA_BYTE2 BIT(8),                                     20350000
*        4 TDRMT_SDATA_SQA BIT(1),  /* Corresponds to SDATA=SQA on      20400000
*                                      IEATDUMP                      */ 20450000
*        4 TDRMT_SDATA_SUM BIT(1),  /* Corresponds to SDATA=SUM on      20500000
*                                      IEATDUMP                      */ 20550000
*        4 TDRMT_SDATA_SWA BIT(1),  /* Corresponds to SDATA=SWA on      20600000
*                                      IEATDUMP                      */ 20650000
*        4 TDRMT_SDATA_TRT BIT(1),  /* Corresponds to SDATA=TRT on      20700000
*                                      IEATDUMP                      */ 20750000
*        4 TDRMT_SDATA_PSA BIT(1),  /* Corresponds to SDATA=PSA on      20800000
*                                      IEATDUMP                      */ 20850000
*        4 *               BIT(3),  /* Reserved, must be 0           */ 20900000
*       3 TDRMT_SDATA_RSVD CHAR(2), /* Reserved, must be 0           */ 20950000
*      2 * CHAR(0);                 /* End of mapping                */ 21000000
*                                                                       21050000
*DCL 1 TDRMT_SUBPLST BASED,                         /*               */ 21100000
*      2 TDRMT_SUBPLST_HEADER,              /*                       */ 21150000
*        3 TDRMT_SUBPLST_ID FIXED(15),      /* Use TDRMT_IDCON_SUBPLST  21200000
*                                      to initialize                 */ 21250000
*        3 TDRMT_SUBPLST_LENGTH FIXED(15),  /* Total length of area     21300000
*                                      including this length field and  21350000
*                                      the ID field                  */ 21400000
*      2 TDRMT_SUBPLST_ENTRY(*),    /* This represents an array of      21450000
*                                      Subpools                      */ 21500000
*        3 TDRMT_SUBPLST_SUBPOOL FIXED(15); /* The subpool           */ 21550000
*                                                                       21600000
*DCL 1 TDRMT_COPY BASED,                            /*               */ 21650000
*      2 TDRMT_COPY_HEADER,               /*                         */ 21700000
*        3 TDRMT_COPY_ID FIXED(15),       /* Use                        21750000
*                   TDRMT_xxxxx_COPY to initialize                   */ 21800000
*        3 TDRMT_COPY_LENGTH FIXED(15);   /* Total length of area       21850000
*                   including this length field and the ID field     */ 21900000
*/* End of PL/X Source                                               */ 21950000
* %IF IHATDRMT_LIST ^= 'NO' &                                           22000000
*    ZCBPRINT ^= 'NO' %THEN                                             22050000
*   %GOTO IHATDRMT_4;                                                   22100000
*   @LIST POP NOECHO;                                                   22150000
* %IHATDRMT_4:;                                                         22200000
* %END;                                                                 22250000
