*   %GO TO TTEL1;                                                       00015000
*                                                                       00030000
*/*                                                                     00060000
         MACRO                                                          00090000
         IHATTE &ALL=,&EX=,&AS=,&BR=,&SCH=,&SIGA=,                     X00120000
               &EXT=,&SVC=,&PGM=,&IO=,&DSP=,                           X00150000
               &MCH=,&RST=,&ACR=,&SUSP=,&ALTR=,&SSRV=,&USRN=,&SPER=,   X00170000
               &RCVY=,&TIME=,&MODE=                                @L9C 00184000
*                                                                    */ 00198000
*                                                                       00205000
*%TTEL1:                                                                00212000
*   ;                                                                   00226000
*                                                                       00240000
*/** START OF SPECIFICATIONS *****************************************/ 00270000
*/*                                                                  */ 00300000
*/* $MAC(IHATTE) COMP(SC142) PROD(HBB7703):                          */ 00330000
*/*                                                                  */ 00360000
*/* MACRO NAME: IHATTE                                               */ 00390000
*/*                                                                  */ 00420000
*/* DESCRIPTIVE NAME: System trace table entry (TTE)                 */ 00423000
*/*                                                                  */ 00426000
*/* COMPONENT: System trace (SC142)                                  */ 00435000
*/*                                                                  */ 00444000
*/* EXTERNAL CLASSIFICATION:                                         */ 00451300
*/* DMTI: BASE                                                       */ 00458600
*/* GUPI: FIELDS TTEXP TTE07F TTE07FAD TTE07FCI TTE07FHA TTE07FPA    */ 00465900
*/*     TTE07FPI TTE07FRB TTE07FRV TTE07FSA TTE07FTB                 */ 00473200
*/* END OF EXTERNAL CLASSIFICATION:                                  */ 00480500
*/*                                                                  */ 00487800
*/* PROPRIETARY STATEMENT:                                           */ 00495100
*/*                                                                  */ 00502400
*/* COPYRIGHT =                                                      */ 00509700
*/*   LICENSED MATERIALS - PROPERTY OF IBM                           */ 00517000
*/*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                    */ 00524300
*/*   5647-A01 (C) COPYRIGHT IBM CORP. 1981, 2000                    */ 00531600
*/*                                                                  */ 00540000
*/* STATUS:  HBB7703                                                 */ 00570000
*/*                                                                  */ 00600000
*/* FUNCTION:                                                        */ 00630000
*/*   CONTAIN THE INFORMATION FROM EACH TRACE ENTRY.                 */ 00660000
*/*                                                                  */ 00690000
*/* METHOD OF ACCESS:                                                */ 00705000
*/*                                                                  */ 00720000
*/*  ASM:                                                            */ 00735000
*/*                                                                  */ 00750000
*/*   INCLUDE THE IHATTE MAPPING MACRO.                              */ 00787500
*/*        - DSECT TTE IS PRODUCED.                                  */ 00825000
*/*          USING ON TTE GIVES ADDRESSABILITY FOR ALL SYMBOLS.      */ 00862500
*/*                                                                  */ 00900000
*/*          THE FOLLOWING KEYWORD PARAMETERS MUST BE CODED AS       */ 00930000
*/*          '=YES' ON THE INVOCATION OF THE IHATTE MACRO IN         */ 00960000
*/*          ORDER FOR THE INDICATED SECTIONS TO BE GENERATED:       */ 00990000
*/*                                                                  */ 01020000
*/*            ALL  -  ALL ENTRY MAPPINGS                            */ 01050000
*/*                                                                  */ 01080000
*/*            ACR  -  ACR ENTRY MAPPING                             */ 01223300
*/*            ALTR -  TRACE OPTIONS ALTERATION ENTRY MAPPING        */ 01246600
*/*            AS   -  ALL ASID TRACING ENTRY MAPPINGS (NOP)         */ 01251200
*/*            BR   -  ALL BRANCH TRACING ENTRY MAPPINGS (NOP)       */ 01255800
*/*            EX   -  ALL EXPLICIT TRACING ENTRY MAPPINGS           */ 01260400
*/*                                                                  */ 01265000
*/*            DSP  -  ALL DISPATCHER ENTRY MAPPINGS                 */ 01269900
*/*            EXT  -  ALL EXTERNAL INTERRUPT ENTRY MAPPINGS         */ 01293200
*/*            IO   -  I/O INTERRUPT ENTRY MAPPING                   */ 01316500
*/*            MCH  -  MACHINE CHECK INTERRUPT ENTRY MAPPING         */ 01339800
*/*            MODE -  ALL MODE TRACING ENTRY MAPPINGS (NOP)         */ 01351400
*/*            PGM  -  PROGRAM INTERRUPT ENTRY MAPPING               */ 01363100
*/*            RCVY -  RECOVERY ENTRY MAPPING                        */ 01374700
*/*            RST  -  RESTART INTERRUPT ENTRY MAPPING               */ 01386400
*/*            SCH  -  ALL SUBCHANNEL ENTRY MAPPINGS                 */ 01409700
*/*            SIGA -  Signal adapter mapping                        */ 01421300
*/*            SPER -  SLIP/PER EVENT ENTRY MAPPING                  */ 01433000
*/*            SSRV -  PC OR BRANCH ENTERED SYSTEM SERVICE ENTRY     */ 01456300
*/*                    MAPPING                                       */ 01479600
*/*            SUSP -  SUSPENSION ENTRY MAPPING                      */ 01502900
*/*            SVC  -  ALL SUPERVISOR CALL ENTRY MAPPINGS            */ 01526200
*/*            TIME -  TIMER SERVICES ENTRY MAPPING                  */ 01596100
*/*            USRN -  USER EVENT TRACE ENTRY MAPPING                */ 01608000
*/*                                                                  */ 01620000
*/*          FOR EXAMPLE:  AS=YES,SUSP=YES                           */ 01650000
*/*                                                                  */ 01680000
*/*  PL/S:                                                           */ 01695000
*/*                                                                  */ 01710000
*/*   INCLUDE THE IHATTE MAPPING MACRO.                              */ 01725000
*/*        - BASED STRUCTURE TTE IS PRODUCED.                        */ 01740000
*/*   DECLARE TTEPTR POINTER(31).                                    */ 01755000
*/*                                                                  */ 01770000
*/*          THE FOLLOWING MACRO VARIABLES MUST BE SET TO 'YES'      */ 01800000
*/*          BEFORE INCLUDING THE IHATTE MAPPING MACRO TO CAUSE      */ 01830000
*/*          THE INDICATED SECTIONS TO BE GENERATED:                 */ 01860000
*/*                                                                  */ 01890000
*/*            %TTEALL  -  ALL ENTRY MAPPINGS                        */ 01920000
*/*                                                                  */ 01950000
*/*            %TTEAS   -  ALL ASID TRACING ENTRY MAPPINGS           */ 01974000
*/*            %TTEBR   -  ALL BRANCH TRACING ENTRY MAPPINGS         */ 01998000
*/*            %TTEMO   -  ALL MODE TRACING ENTRY MAPPINGS           */ 02022000
*/*            %TTEEX   -  ALL EXPLICIT TRACING ENTRY MAPPINGS       */ 02046000
*/*                                                                  */ 02070000
*/*            %TTEACR  -  ACR ENTRY MAPPING                         */ 02093300
*/*            %TTEALTR -  TRACE OPTIONS ALTERATION ENTRY MAPPING    */ 02116600
*/*            %TTEDSP  -  ALL DISPATCHER ENTRY MAPPINGS             */ 02139900
*/*            %TTEEXT  -  ALL EXTERNAL INTERRUPT ENTRY MAPPINGS     */ 02163200
*/*            %TTEIO   -  I/O INTERRUPT ENTRY MAPPING               */ 02186500
*/*            %TTEMCH  -  MACHINE CHECK INTERRUPT ENTRY MAPPING     */ 02209800
*/*            %TTEPGM  -  PROGRAM INTERRUPT ENTRY MAPPING           */ 02233100
*/*            %TTERST  -  RESTART INTERRUPT ENTRY MAPPING           */ 02256400
*/*            %TTESCH  -  ALL SUBCHANNEL ENTRY MAPPINGS             */ 02279700
*/*            %TTESIGA -  Signal adapter mapping                    */ 02291300
*/*            %TTESPER -  SLIP/PER EVENT ENTRY MAPPING              */ 02303000
*/*            %TTESSRV -  PC OR BRANCH ENTERED SYSTEM SERVICE       */ 02326300
*/*                        ENTRY MAPPING                             */ 02349600
*/*            %TTESUSP -  SUSPENSION ENTRY MAPPING                  */ 02372900
*/*            %TTESVC  -  ALL SUPERVISOR CALL ENTRY MAPPINGS        */ 02396200
*/*            %TTEUSRN -  USER EVENT TRACE ENTRY MAPPING            */ 02419500
*/*            %TTERCVY -  RECOVERY ENTRY MAPPING                    */ 02442800
*/*            %TTETIME -  TIMER SERVICES ENTRY MAPPING              */ 02466100
*/*                                                                  */ 02490000
*/*          FOR EXAMPLE:  %TTEAS='YES'                              */ 02520000
*/*                        %TTESUSP='YES'                            */ 02550000
*/*                                                                  */ 02580000
*/*   DSECT NAME: TTE                                                */ 02590000
*/*   EYE CATCHER:  NONE                                             */ 02600000
*/*                                                                  */ 02610000
*/* CREATED BY:  IMPLICITLY BY THE HARDWARE OR EXPLICITLY BY:        */ 02640000
*/*   SYSTEM TRACE TABLE ENTRY CREATION ROUTINES (IEAVETRC),         */ 02670000
*/*   THE DISPATCHER (PTRACE IN IEAVEDS0),                           */ 02700000
*/*   EXIT PROLOGUE ROUTINE (PTRACE IN IEAVEEXP),                    */ 02730000
*/*   AND SVC FLIH (PTRACE IN IEAVESVC).                             */ 02760000
*/*                                                                  */ 02790000
*/* DELETED BY: N/A                                                  */ 02820000
*/*                                                                  */ 02850000
*/* POINTED TO BY:                                                   */ 02871400
*/*   CONTROL REGISTER 12                                            */ 02892800
*/*   TBVTCR12                                                       */ 02914200
*/*   TBVTENTY                                                       */ 02935600
*/*   PARAMETER 3 FOR ITRF0N7F, THE USRN FORMATTING ROUTINES,        */ 02957000
*/*     WHERE N IS 0-9.                                              */ 02978400
*/*                                                                  */ 03000000
*/* SERIALIZATION:                                                   */ 03030000
*/*   DISABLEMENT ON THE PROCESSOR AND ZEROED                        */ 03060000
*/*   TRACING CONTROL BITS IN CONTROL REGISTER 12.                   */ 03090000
*/*                                                                  */ 03120000
*/* STORAGE ATTRIBUTES:                                              */ 03170000
*/*                                                                  */ 03240000
*/*   SUBPOOL:                                                       */ 03245000
*/*     245 IN TRACING BUFFERS CREATED BY IEAVNIP0.                  */ 03250000
*/*     255 IN TRACING BUFFERS CREATED BY IEAVETEA.                  */ 03255000
*/*                                                                  */ 03260000
*/*   KEY:      0                                                    */ 03265000
*/*                                                                  */ 03270000
*/*   SIZE:     DEPENDS ON TYPE OF ENTRY.                            */ 03275000
*/*                                                                  */ 03280000
*/* DISTRIBUTION LIBRARY: AMACLIB                                    */ 03285000
*/*                                                                  */ 03290000
*/*   CHANGE ACTIVITY:                                               */ 03295000
*/*      G860PXY - SYSTEM TRACE EXTENSIONS                           */ 03300000
*/* $L1= TREVENT JBB2125 820823 PDXM: TRACE PER EVENTS               */ 03306000
*/*    = DCRR0050 JBB2125 830428 PDXM:  SERVICE SIGNAL TRACE TABLE   */ 03312000
*/*      ENTRY ENHANCEMENT                                           */ 03318000
*/* $L2= AR      HBB3310 860210 PDR8:   ACCESS REGISTERS             */ 03324000
*/* $L3= RTMRAS  HBB3310 860414 PDR8:   RCVY ENTRY SUPPORT           */ 03330000
*/* $L4= LOCKR   HBB4410 871026 PDT7:   PSACLHSE SUPPORT             */ 03336000
*/* $L5= CLOCK   HBB4410 880428 PD88CT: TIME ENTRY SUPPORT           */ 03342000
*/* $L6= CNITG   HBB4410 881128 PD88CT: UPDATE THE MAPPING FOR THE   */ 03348000
*/*      CHANGED SS TRACE ENTRY                                      */ 03354000
*/* $P1= PEO2361 HBB4410 890814 PD88CT: UPDATE TYPE=SUSP TTE ENTRY   */ 03360000
*/*      DESCRIPTION                                                 */ 03366000
*/* $P2= PH31564 HBB4420 901130 PD88CT: UPDATE TYPE=SSRB ENTRY       */ 03372000
*/*      DESCRIPTION                                                 */ 03378000
*/*    = FOURDGIT HBB5510 930304 PD88XM:  ADD TOKEN FOR I/O RELATED  */ 03384000
*/*      TTES                                                        */ 03390000
*/* $L7= SUBSP   HBB5510 930412 PD88XM: BSG ENTRY.                   */ 03396000
*/*    = PIG2260 HBB5510 930909 PD88XM: CDPI INFORMATION.            */ 03402000
*/* $L8= PAVS    HBB5520 940215 PDXM: ADD CAPTURED UCB ADDRESS AND   */ 03408000
*/*      CHANGE ADDRESSABILITY TO ACTUAL DEVICE NUMBER FOR SSCH      */ 03414000
*/*      ENTRIES.                                                    */ 03420000
*/* $D1= DN70021 HBB5520 940505 PDXM: ADD WEB ADDRESS TO SRB AND     */ 03426000
*/*      SSRB ENTRIES.                                               */ 03432000
*/* $01= OW38365 JBB6607 981101 PDHT: Signal adapter event support   */ 03435200
*/* $L9= 64BITSLP HBB7703 981204 PD00XB: ESAME                       */ 03438400
*/*    = PXD0809  HBB7703 20000210 PDE1: SHOWHDR compliance          */ 03440500
*/* $LA= DYCHM    HBB7703 20000218 PDDR: DYNAMIC CHPID               */ 03442600
*/*                                      MANAGEMENT                  */ 03443600
*/* $P3= PXD1550  HBB7703 20000325 PDH6: MODE problems               */ 03444200
*/* $P4= PXD1550  HBB7703 20000325 PDE1: New hardware trace formats  */ 03444500
*/*                                                                  */ 03444800
*/** END OF SPECIFICATIONS *******************************************/ 03450000
*/* A-000000-999999                                          @G860PXY*/ 03480000
*                                                                       03500600
*   %GO TO TTEL2;                                                       03521200
*                                                                       03541800
*/*                                                                     03562500
*   SYSTEM TRACE TABLE ENTRY                                            03570000
*                                                                       03600000
         SPACE 1                                                        03630000
TTE      DSECT                          TRACE TABLE ENTRY.              03660000
         DS    0CL4                     MINIMUM TRACE TABLE ENTRY.      03690000
.*                                                                      03720000
         AIF   ('&BR' NE 'YES').ENDBR                              @P4C 03765000
         SPACE 3                                                        03810000
*                                                                       03840000
*   BR - BRANCH TTE no longer mapped                              7@P4D 03870000
*                                                                       03900000
.ENDBR  ANOP                                                            04320000
.*                                                                      04350000
         AIF   ('&MODE' NE 'YES').ENDMODE                          @P4C 04366000
         SPACE 3                                                        04382000
*                                                                       04383000
*   MODE - MODE TTE - no longer mapped                           14@P4D 04384000
*                                                                       04385000
.ENDMODE ANOP                                                      @L9A 04405000
.*                                                                      04406000
         AIF   ('&AS' NE 'YES').ENDAS                              @P4C 04423000
         SPACE 3                                                        04440000
*                                                                       04470000
*     Address space TTEs - no longer mapped                      70@P4D 04500000
*                                                                       04530000
.ENDAS   ANOP                                                           06208000
.*                                                                      06210000
         SPACE 3                                                        06240000
*                                                                       06270000
*     GENERAL EXPLICIT TTE                                              06300000
*                                                                       06330000
         ORG   TTE                                                      06360000
TTEXP    DS    0CL12                   EXPLICIT TRACE TABLE ENTRY.      06390000
TTETYPE  DS    XL1                     TRACE TABLE ENTRY TYPE (X'7N').  06420000
TTETEX   EQU   X'70'                   EXPLICIT TTE TYPE (X'7N').       06450000
TTEMEX   EQU   X'F0'                   MASK FOR EXPLICIT TTE TYPE.      06480000
TTEREGS  EQU   X'0F'                   MASK FOR ONE LESS THAN THE       06510000
*                                      NUMBER OF REGISTERS              06540000
*                                      IN THE TTE.                      06570000
TTEMBZ1  DS    XL1                     RESERVED. (MUST BE ZERO)         06600000
TTETOD   DS    XL6                     TOD-CLOCK BITS 16-63.            06630000
TTETOTE  DS    0XL4                    TRACE OPERAND TABLE ENTRY.       06660000
         DS    XL2                     FLAG BYTES.                      06690000
TTEXPTYP DS    0H                      EXPLICIT ENTRY TYPE.             06720000
TTEXPSID DS    XL1                     EXPLICIT ENTRY SUB-ID.           06750000
TTEMSID  EQU   X'0F'                   MASK FOR EXPLICIT TTE SUB-ID.    06780000
TTEXPID  DS    XL1                     EXPLICIT ENTRY ID.               06810000
TTEUNQ   DS    0F                      UNIQUE ENTRY DESCRIPTIONS.       06840000
TTEEXCOM DS    0CL64                   EXPLICIT ENTRY COMMON FIELD      06870000
*                                      NAMES.                           06900000
TTEWRD0  DS    0CL4                    TTE WORD 0.                      06930000
TTETCB   DS    A                       TCB ADDRESS.                     06960000
TTEWRD1  DS    0CL4                    TTE WORD 1.                      06990000
TTEDEP   DS    H                       DEPENDENT ON EACH                07020000
*                                      EXPLICIT TTE ENTRY.              07050000
TTEASID  DS    H                       ASID.                            07080000
TTEWRD2  DS    CL4                     TTE WORD 2.                      07110000
TTEWRD3  DS    CL4                     TTE WORD 3.                      07140000
TTEWRD4  DS    CL4                     TTE WORD 4.                      07170000
TTEWRD5  DS    CL4                     TTE WORD 5.                      07200000
TTEWRD6  DS    CL4                     TTE WORD 6.                      07230000
TTEWRD7  DS    CL4                     TTE WORD 7.                      07260000
TTEWRD8  DS    CL4                     TTE WORD 8.                      07290000
TTEWRD9  DS    CL4                     TTE WORD 9.                      07320000
TTEWRDA  DS    CL4                     TTE WORD 10.                     07350000
TTEWRDB  DS    CL4                     TTE WORD 11.                     07380000
TTEWRDC  DS    CL4                     TTE WORD 12.                     07410000
TTEWRDD  DS    CL4                     TTE WORD 13.                     07440000
TTEWRDE  DS    CL4                     TTE WORD 14.                     07470000
TTEWRDF  DS    CL4                     TTE WORD 15.                     07500000
TTEXPEND DS    0F                      END OF MAXIMUM EXPLICIT TTE.     07530000
         SPACE 1                                                        07560000
TTETMAX  EQU   76                      MAXIMUM LENGTH OF EXPLICIT       07590000
*                                      ENTRIES.                         07620000
*                                                                       07650000
*                                                                       07680000
TTEMTSCH EQU   X'001'                  SUBCHANNEL TYPE MAJOR ID.        07710000
TTEMTEXT EQU   X'003'                  EXTERNAL INTERRUPT TYPE MAJOR    07740000
*                                      ID.                              07770000
TTEMTSVC EQU   X'005'                  SVC TYPE MAJOR ID.               07800000
TTEMTDSP EQU   X'00F'                  DISPATCHER TYPE MAJOR ID.        07830000
*                                                                       07860000
*                                                                       07890000
TTETSSCH EQU   X'001'                  SSCH TYPE ID.                    07920000
TTETEXT  EQU   X'003'                  GENERAL EXT TYPE ID.             07950000
TTETSVC  EQU   X'005'                  GENERAL SVC TYPE ID.             07980000
TTETPGM  EQU   X'007'                  PGM TYPE ID.                     08010000
TTETSPER EQU   X'009'                  SLIP/PER TYPE ID.           @L1A 08040000
TTETDSP  EQU   X'00F'                  DSP TYPE ID.                     08070000
TTETIO   EQU   X'00B'                  IO TYPE ID.                      08100000
TTETMCH  EQU   X'013'                  MCH TYPE ID.                     08130000
TTETRST  EQU   X'015'                  RST TYPE ID.                     08160000
TTETACR  EQU   X'017'                  ACR TYPE ID.                     08190000
TTETSUSP EQU   X'019'                  SUSP TYPE ID.                    08220000
TTETALTR EQU   X'01B'                  ALTR TYPE ID.                    08250000
TTETRCVY EQU   X'01D'                  RCVY TYPE ID.               @L3A 08265000
TTETTIME EQU   X'01F'                  TIME TYPE ID.               @L5A 08272500
TTETUSR0 EQU   X'07F'                  USR0 TYPE ID.                    08280000
TTETEMS  EQU   X'103'                  EMS EXT TYPE ID.                 08310000
TTETMSCH EQU   X'101'                  MSCH TYPE ID.                    08340000
TTETSVCR EQU   X'105'                  SVCR TYPE ID.                    08370000
TTETSRB  EQU   X'10F'                  SRB TYPE ID.                     08400000
TTETUSR1 EQU   X'17F'                  USR1 TYPE ID.                    08430000
TTETHSCH EQU   X'201'                  HSCH TYPE ID.                    08460000
TTETSS   EQU   X'203'                  SS EXT TYPE ID.                  08490000
TTETSSRV EQU   X'205'                  SSRV TYPE ID.               @L2A 08505000
TTETSSRB EQU   X'20F'                  SSRB TYPE ID.                    08520000
TTETUSR2 EQU   X'27F'                  USR2 TYPE ID.                    08550000
TTETCSCH EQU   X'301'                  CSCH TYPE ID.                    08580000
TTETCALL EQU   X'303'                  EXTERNAL CALL EXT TYPE ID.       08610000
TTETUSR3 EQU   X'37F'                  USR3 TYPE ID.                    08640000
TTETRSCH EQU   X'401'                  RSCH TYPE ID.                    08670000
TTETCLKC EQU   X'403'                  CLOCK COMPARATOR EXT TYPE ID.    08700000
TTETUSR4 EQU   X'47F'                  USR4 TYPE ID.                    08730000
TTETSIGA EQU   X'501'                  SIGA TYPE ID.               @01A 08745000
TTETUSR5 EQU   X'57F'                  USR5 TYPE ID.                    08760000
TTETUSR6 EQU   X'67F'                  USR6 TYPE ID.                    08790000
TTETUSR7 EQU   X'77F'                  USR7 TYPE ID.                    08820000
TTETUSR8 EQU   X'87F'                  USR8 TYPE ID.                    08850000
TTETUSR9 EQU   X'97F'                  USR9 TYPE ID.                    08880000
TTETUSRA EQU   X'A7F'                  USRA TYPE ID.                    08910000
TTETUSRB EQU   X'B7F'                  USRB TYPE ID.                    08940000
TTETUSRC EQU   X'C7F'                  USRC TYPE ID.                    08970000
TTETUSRD EQU   X'D7F'                  USRD TYPE ID.                    09000000
TTETUSRE EQU   X'E7F'                  USRE TYPE ID.                    09030000
TTETSVCE EQU   X'F05'                  SVC ERROR TYPE ID.               09060000
TTETWAIT EQU   X'F0F'                  WAIT TYPE ID.                    09090000
TTETUSRF EQU   X'F7F'                  USRF TYPE ID.                    09120000
.*                                                                      09150000
         AIF   ('&ALL' NE 'YES' AND                                    X09180000
               '&EX' NE 'YES' AND                                      X09210000
               '&ACR' NE 'YES').ENDACR                                  09240000
         SPACE 2                                                        09270000
*     ACR - ALTERNATE CPU RECOVERY TTE                                  09300000
         ORG   TTEUNQ                                                   09330000
TTE017   DS    0F                      ACR (ACR).                       09360000
TTE017TB DS    A                       PSATOLD FROM THE FAILING         09390000
*                                      PROCESSOR.                       09420000
*                                      * FLCCVT->CVTPCCAT->             09450000
*                                      *   PCCAT00P(PSASPAD)->          09480000
*                                      *   PCCAPSAV->PSATOLD.           09510000
TTE017LP DS    H                       PSACPUPA. LOGICAL PROCESSOR      09540000
*                                      ADDRESS.                         09570000
*                                      * FLCCVT->CVTPCCAT->             09600000
*                                      *   PCCAT00P(PSASPAD)->          09630000
*                                      *   PCCAPSAV->PSACPUPA.          09660000
TTE017HA DS    H                       HOME ADDRESS SPACE FROM THE      09690000
*                                      FAILING PROCESSOR.               09720000
*                                      * FLCCVT->CVTPCCAT->             09750000
*                                      *   PCCAT00P(PSASPAD)->          09780000
*                                      *   PCCAPSAV->PSAAOLD->          09810000
*                                      *   ASCBASID.                    09840000
TTE017AD DS    A                       PSAEEPSW FROM THE ACR PROCESSOR. 09870000
*                                      FAILING PROCESSOR ADDRESS.       09900000
*                                      * PSAEEPSW.                      09930000
TTE017FG DS    XL1                     LCCACREX. ACR FLAG BYTE          09960000
*                                      FROM THE FAILING PROCESSOR.      09990000
*                                      * FLCCVT->CVTPCCAT->             10020000
*                                      *   PCCAT00P(PSASPAD)->          10050000
*                                      *   PCCAPSAV->PSALCCAV->         10080000
*                                      *   LCCACREX.                    10110000
TTE017R1 DS    XL3                     RESERVED.                        10140000
TTE017FR DS    A                       PSACSTK. CURRENT FRR STACK       10170000
*                                      ADDRESS FROM THE FAILING         10200000
*                                      PROCESSOR.                       10230000
*                                      * FLCCVT->CVTPCCAT->             10260000
*                                      *   PCCAT00P(PSASPAD)->          10290000
*                                      *   PCCAPSAV->PSACSTK.           10320000
TTE017PS DS    F                       PSASUPER FROM THE FAILING        10350000
*                                      PROCESSOR.                       10380000
*                                      * FLCCVT->CVTPCCAT->             10410000
*                                      *   PCCAT00P(PSASPAD)->          10440000
*                                      *   PCCAPSAV->PSASUPER.          10470000
TTE017MW DS    F                       PSAMODEW FROM THE FAILING        10500000
*                                      PROCESSOR.                       10530000
*                                      * FLCCVT->CVTPCCAT->             10560000
*                                      *   PCCAT00P(PSASPAD)->          10590000
*                                      *   PCCAPSAV->PSAMODEW.          10620000
TTE017LH DS    F                       PSACLHS FROM THE FAILING         10650000
*                                      PROCESSOR.                       10680000
*                                      * FLCCVT->CVTPCCAT->             10710000
*                                      *   PCCAT00P(PSASPAD)->          10740000
*                                      *   PCCAPSAV->PSACLHS.           10770000
TTE017PL DS    A                       PSALOCAL FROM THE FAILING        10800000
*                                      PROCESSOR.                       10830000
*                                      * FLCCVT->CVTPCCAT->             10860000
*                                      *   PCCAT00P(PSASPAD)->          10890000
*                                      *   PCCAPSAV->PSALOCAL.          10920000
TTE017LE DS    F                       PSACLHSE FROM THE FAILING   @L4A 10925000
*                                      PROCESSOR.                  @L4A 10930000
*                                      * FLCCVT->CVTPCCAT->        @L4A 10935000
*                                      *   PCCAT00P(PSASPAD)->     @L4A 10940000
*                                      *   PCCAPSAV->PSACLHSE.     @L4A 10945000
TTE017ED DS    0F                      END OF ACR TTE.                  10950000
.ENDACR  ANOP                                                           10980000
.*                                                                      11010000
         AIF   ('&ALL' NE 'YES' AND                                    X11040000
               '&EX' NE 'YES' AND                                      X11070000
               '&ALTR' NE 'YES').ENDALTR                                11100000
         SPACE 2                                                        11130000
*     ALTR - TRACE OPTIONS ALTERATION TTE                               11160000
         ORG   TTEUNQ                                                   11190000
TTE01B   DS    0F                      TRACE OPTIONS ALTERATION (ALTR). 11220000
TTE01BTB DS    A                       CURRENT TCB ADDRESS OR 0.        11250000
*                                      * PSATOLD.                       11280000
TTE01BR1 DS    H                       RESERVED.                        11310000
TTE01BHA DS    H                       HOME ADDRESS SPACE.              11340000
*                                      * PSAAOLD->ASCBASID.             11370000
TTE01BPA DS    H                       PASID.                           11400000
*                                      * CONTROL REGISTER 4.            11430000
TTE01BSA DS    H                       SASID.                           11460000
*                                      * CONTROL REGISTER 3.            11490000
TTE01BFC DS    F                       REGISTER 0 TRACE FUNCTION CODE.  11520000
*                                      ALTRTRC INPUT.                   11550000
*                                      * INPUT REGISTER 0.              11580000
TTE01BAC DS    F                       REGISTER 1 TRACE ACTION CODE.    11610000
*                                      ALTRTRC INPUT.                   11640000
*                                      * INPUT REGISTER 1.              11670000
TTE01BPT DS    F                       TOBTROPT - CONTROL REGISTER 12   11700000
*                                      MODEL FORMAT.                    11730000
*                                      * PSATRVT->TRVTTOB->TOBTROPT.    11760000
TTE01BCT DS    H                       TOBTRPOL - NUMBER OF PROCESSORS  11790000
*                                      WITH TRACE CURRENTLY ACTIVE      11820000
*                                      AND/OR SUSPENDED.                11850000
*                                      * PSATRVT->TRVTTOB->TOBTRPOL.    11880000
TTE01BBF DS    H                       TOBTRBUF - NUMBER OF TRACE       11910000
*                                      BUFFERS PER PROCESSOR.           11940000
*                                      * PSATRVT->TRVTTOB->TOBTRBUF.    11970000
TTE01BED DS    0F                      END OF ALTR TTE.                 12000000
.ENDALTR ANOP                                                           12030000
.*                                                                      12060000
         AIF   ('&ALL' NE 'YES' AND                                    X12090000
               '&EX' NE 'YES' AND                                      X12120000
               '&EXT' NE 'YES').ENDCALL                                 12150000
         SPACE 1                                                        12180000
*     CALL - EXTERNAL CALL EXTERNAL INTERRUPT TTE                       12210000
         ORG   TTEUNQ                                                   12240000
TTE303   DS    0F                      EXTERNAL CALL EXTERNAL           12270000
*                                      INTERRUPT (CALL).                12300000
TTE303TB DS    A                       CURRENT TCB ADDRESS OR 0.        12330000
*                                      * PSATOLD.                       12360000
TTE303R1 DS    H                       RESERVED.                        12390000
TTE303HA DS    H                       HOME ADDRESS SPACE.              12420000
*                                      * PSAAOLD->ASCBASID.             12450000
TTE303PA DS    H                       PASID.                           12480000
*                                      * INPUT REGISTER 4.              12510000
TTE303SA DS    H                       SASID.                           12540000
*                                      * INPUT REGISTER 4.              12570000
TTE303PW DS    0CL8                    EXTERNAL OLD PSW.                12600000
*                                      * FLCEOPSW.                      12630000
TTE303P1 DS    CL4                     1ST HALF OF PSW.                 12660000
TTE303P2 DS    CL4                     2ND HALF OF PSW.                 12690000
TTE303CD DS    A                       ISSUING PROCESSOR ADDRESS        12720000
*                                      AND EXTERNAL INTERRUPT CODE.     12750000
*                                      * PSAEEPSW.                      12780000
TTE303PB DS    F                       PCCARPB.                         12810000
*                                      * PSAPCCAV->PCCARPB.             12840000
TTE303LH DS    F                       PSACLHS.                         12870000
TTE303PL DS    A                       PSALOCAL.                        12900000
TTE303LE DS    F                       PSACLHSE.                   @L4A 12915000
TTE303ED DS    0F                      END OF CALL TTE.                 12930000
.ENDCALL ANOP                                                           12960000
.*                                                                      12990000
         AIF   ('&ALL' NE 'YES' AND                                    X13020000
               '&EX' NE 'YES' AND                                      X13050000
               '&EXT' NE 'YES').ENDCLKC                                 13080000
         SPACE 1                                                        13110000
*     CLKC - CLOCK COMPARATOR EXTERNAL INTERRUPT TTE                    13140000
         ORG   TTEUNQ                                                   13170000
TTE403   DS    0F                      CLOCK COMPARATOR EXTERNAL        13200000
*                                      INTERRUPT (CLKC).                13230000
TTE403TB DS    A                       CURRENT TCB ADDRESS OR 0.        13260000
*                                      * PSATOLD.                       13290000
TTE403R1 DS    H                       RESERVED.                        13320000
TTE403HA DS    H                       HOME ADDRESS SPACE.              13350000
*                                      * PSAAOLD->ASCBASID.             13380000
TTE403PA DS    H                       PASID.                           13410000
*                                      * INPUT REGISTER 4.              13440000
TTE403SA DS    H                       SASID.                           13470000
*                                      * INPUT REGISTER 4.              13500000
TTE403PW DS    0CL8                    EXTERNAL OLD PSW.                13530000
*                                      * FLCEOPSW.                      13560000
TTE403P1 DS    CL4                     1ST HALF OF PSW.                 13590000
TTE403P2 DS    CL4                     2ND HALF OF PSW.                 13620000
TTE403CD DS    F                       EXTERNAL INTERRUPT CODE.         13650000
*                                      * PSAEEPSW.                      13680000
TTE403TT DS    A                       TQE TCB OR 0.                    13710000
*                                      * PSAPCCAV->PCCATQEP->TQETCB.    13740000
TTE403R2 DS    H                       RESERVED.                        13770000
TTE403TA DS    H                       TQE ASID OR 0.                   13800000
*                                      * PSAPCCAV->PCCATQEP->TQEAID.    13830000
TTE403LH DS    F                       PSACLHS.                         13860000
TTE403PL DS    A                       PSALOCAL.                        13890000
TTE403LE DS    F                       PSACLHSE.                   @L4A 13905000
TTE403ED DS    0F                      END OF CLKC TTE.                 13920000
.ENDCLKC ANOP                                                           13950000
.*                                                                      13980000
         AIF   ('&ALL' NE 'YES' AND                                    X14010000
               '&EX' NE 'YES' AND                                      X14040000
               '&SCH' NE 'YES').ENDCSCH                                 14070000
         SPACE 1                                                        14100000
*     CSCH - CLEAR SUBCHANNEL TTE                                       14130000
         ORG   TTEUNQ                                                   14160000
TTE301   DS    0F                      CLEAR SUBCHANNEL (CSCH).         14190000
TTE301TB DS    A                       TCB ADDRESS FROM SRB.            14220000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  14250000
TTE301AD DS    H                       ASID FROM IOSB.                  14280000
*                                      * IOSBPTR(R2)->IOSASID.          14310000
TTE301HA DS    H                       HOME ADDRESS SPACE.              14340000
*                                      * PSAAOLD->ASCBASID.             14370000
TTE301CC DS    XL1                     CONDITION CODE.                  14400000
*                                      * INPUT REGISTER 0.              14430000
TTE301DI DS    XL1                     DRIVER ID.                       14460000
*                                      * IOSBPTR(R2)->IOSDVRID.         14490000
TTE301DN DS    H                       DEVICE NUMBER.                   14520000
*                                      * IOSBPTR(R2)->IOSUCB->UCBCHAN.  14550000
TTE301UB DS    A                       UCB ADDRESS (COMMON SEGMENT).    14580000
*                                      * ORBPTR(R3)->WORD 1.            14610000
TTE301IQ DS    A                       IOQ ADDRESS.                     14640000
*                                      * ORBPTR(R3)->WORD 2.            14670000
TTE301AI DS    A                       ADDRESS OF IOSB FOR ASSOCIATED   14700000
*                                      SSCH REQUEST (0 IF NO ASSOCIATED 14730000
*                                      REQUEST).                        14760000
*                                      * ORBPTR(R3)->WORD 3.            14790000
TTE301IO DS    A                       IOSB ADDRESS.                    14820000
*                                      * INPUT REGISTER 2.              14850000
TTE301TK DS    0F                      TOKEN.                      @L8C 14860000
*                                      * INPUT REGISTER 1.              14870000
TTE301T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 14872500
TTE301T2 DS    XL1                     RESERVED.                   @L8A 14875000
TTE301T3 DS    H                       BASE DEVICE NUMBER.         @L8A 14877500
TTE301ED DS    0F                      END OF CSCH TTE.                 14880000
.ENDCSCH ANOP                                                           14910000
.*                                                                      14940000
         AIF   ('&ALL' NE 'YES' AND                                    X14970000
               '&EX' NE 'YES' AND                                      X15000000
               '&DSP' NE 'YES').ENDDSP                                  15030000
         SPACE 1                                                        15060000
*     DSP - TASK DISPATCH TTE                                           15090000
         ORG   TTEUNQ                                                   15120000
TTE00F   DS    0F                      TASK DISPATCH (DSP).             15150000
TTE00FTB DS    A                       CURRENT TCB ADDRESS.             15180000
*                                      * PSATOLD.                       15210000
TTE00FR1 DS    H                       RESERVED.                        15240000
TTE00FHA DS    H                       HOME ADDRESS SPACE.              15270000
*                                      * PSAAOLD->ASCBASID.             15300000
TTE00FPA DS    H                       PASID.                           15330000
*                                      * INPUT REGISTER 13.             15360000
TTE00FSA DS    H                       SASID.                           15390000
*                                      * INPUT REGISTER 13.             15420000
TTE00FPW DS    0CL8                    PSW TO BE DISPATCHED.            15450000
*                                      * PSAPSWSV.                      15480000
TTE00FP1 DS    CL4                     1ST HALF OF PSW.                 15510000
TTE00FP2 DS    CL4                     2ND HALF OF PSW.                 15540000
TTE00FG0 DS    F                       REGISTER 0 CONTENTS.             15570000
*                                      * INPUT REGISTER 0.              15600000
TTE00FG1 DS    F                       REGISTER 1 CONTENTS.             15630000
*                                      * INPUT REGISTER 1.              15660000
TTE00FMW DS    F                       PSAMODEW.                        15690000
TTE00FLH DS    F                       PSACLHS.                         15720000
TTE00FPL DS    A                       PSALOCAL.                        15750000
TTE00FED DS    0F                      END OF DSP TTE.                  15780000
.ENDDSP  ANOP                                                           15810000
.*                                                                      15840000
         AIF   ('&ALL' NE 'YES' AND                                    X15870000
               '&EX' NE 'YES' AND                                      X15900000
               '&EXT' NE 'YES').ENDEMS                                  15930000
         SPACE 1                                                        15960000
*     EMS - EMERGENCY SIGNAL EXTERNAL INTERRUPT TTE                     15990000
         ORG   TTEUNQ                                                   16020000
TTE103   DS    0F                      EMS EXTERNAL INTERRUPT (EMS).    16050000
TTE103TB DS    A                       CURRENT TCB ADDRESS OR 0.        16080000
*                                      * PSATOLD.                       16110000
TTE103R1 DS    H                       RESERVED.                        16140000
TTE103HA DS    H                       HOME ADDRESS SPACE.              16170000
*                                      * PSAAOLD->ASCBASID.             16200000
TTE103PA DS    H                       PASID.                           16230000
*                                      * INPUT REGISTER 4.              16260000
TTE103SA DS    H                       SASID.                           16290000
*                                      * INPUT REGISTER 4.              16320000
TTE103PW DS    0CL8                    EXTERNAL OLD PSW.                16350000
*                                      * FLCEOPSW.                      16380000
TTE103P1 DS    CL4                     1ST HALF OF PSW.                 16410000
TTE103P2 DS    CL4                     2ND HALF OF PSW.                 16440000
TTE103CD DS    A                       ISSUING PROCESSOR ADDRESS AND    16470000
*                                      EXTERNAL INTERRUPT CODE.         16500000
*                                      * PSAEEPSW.                      16530000
TTE103SI DS    F                       PCCAEMSI.                        16560000
*                                      * FLCCVT->CVTPCCAT->             16590000
*                                      *   PCCAT00P(PSASPAD)->          16620000
*                                      *   PCCAEMSI.                    16650000
TTE103SP DS    A                       PCCAEMSP.                        16680000
*                                      * FLCCVT->CVTPCCAT->             16710000
*                                      *   PCCAT00P(PSASPAD)->          16740000
*                                      *   PCCAEMSP.                    16770000
TTE103SE DS    A                       PCCAEMSE.                        16800000
*                                      * FLCCVT->CVTPCCAT->             16830000
*                                      *   PCCAT00P(PSASPAD)->          16860000
*                                      *   PCCAEMSE.                    16890000
TTE103LH DS    F                       PSACLHS.                         16920000
TTE103PL DS    A                       PSALOCAL.                        16950000
TTE103LE DS    F                       PSACLHSE.                   @L4A 16965000
TTE103ED DS    0F                      END OF EMS TTE.                  16980000
.ENDEMS  ANOP                                                           17010000
.*                                                                      17040000
         AIF   ('&ALL' NE 'YES' AND                                    X17070000
               '&EX' NE 'YES' AND                                      X17100000
               '&EXT' NE 'YES').ENDEXT                                  17130000
         SPACE 1                                                        17160000
*     EXT - GENERAL EXTERNAL INTERRUPT TTE                              17190000
         ORG   TTEUNQ                                                   17220000
TTE003   DS    0F                      EXTERNAL INTERRUPT (EXT).        17250000
TTE003TB DS    A                       CURRENT TCB ADDRESS OR 0.        17280000
*                                      * PSATOLD.                       17310000
TTE003R1 DS    H                       RESERVED.                        17340000
TTE003HA DS    H                       HOME ADDRESS SPACE.              17370000
*                                      * PSAAOLD->ASCBASID.             17400000
TTE003PA DS    H                       PASID.                           17430000
*                                      * INPUT REGISTER 4.              17460000
TTE003SA DS    H                       SASID.                           17490000
*                                      * INPUT REGISTER 4.              17520000
TTE003PW DS    0CL8                    EXTERNAL OLD PSW.                17550000
*                                      * FLCEOPSW.                      17580000
TTE003P1 DS    CL4                     1ST HALF OF PSW.                 17610000
TTE003P2 DS    CL4                     2ND HALF OF PSW.                 17640000
TTE003CD DS    F                       EXTERNAL INTERRUPT CODE.         17670000
*                                      * PSAEEPSW.                      17700000
TTE003LH DS    F                       PSACLHS.                         17730000
TTE003PL DS    A                       PSALOCAL.                        17760000
TTE003LE DS    F                       PSACLHSE.                   @L4A 17775000
TTE003ED DS    0F                      END OF EXT TTE.                  17790000
.ENDEXT  ANOP                                                           17820000
.*                                                                      17850000
         AIF   ('&ALL' NE 'YES' AND                                    X17880000
               '&EX' NE 'YES' AND                                      X17910000
               '&SCH' NE 'YES').ENDHSCH                                 17940000
         SPACE 1                                                        17970000
*     HSCH - HALT SUBCHANNEL TTE                                        18000000
         ORG   TTEUNQ                                                   18030000
TTE201   DS    0F                      HALT SUBCHANNEL (HSCH).          18060000
TTE201TB DS    A                       TCB ADDRESS FROM SRB.            18090000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  18120000
TTE201AD DS    H                       ASID FROM IOSB.                  18150000
*                                      * IOSBPTR(R2)->IOSASID.          18180000
TTE201HA DS    H                       HOME ADDRESS SPACE.              18210000
*                                      * PSAAOLD->ASCBASID.             18240000
TTE201CC DS    XL1                     CONDITION CODE.                  18270000
*                                      * INPUT REGISTER 0.              18300000
TTE201DI DS    XL1                     DRIVER ID.                       18330000
*                                      * IOSBPTR(R2)->IOSDVRID.         18360000
TTE201DN DS    H                       DEVICE NUMBER.                   18390000
*                                      * IOSBPTR(R2)->IOSUCB->UCBCHAN.  18420000
TTE201UB DS    A                       UCB ADDRESS (COMMON SEGMENT).    18450000
*                                      * ORBPTR(R3)->WORD 1.            18480000
TTE201IQ DS    A                       IOQ ADDRESS.                     18510000
*                                      * ORBPTR(R3)->WORD 2.            18540000
TTE201AI DS    A                       ADDRESS OF IOSB FOR ASSOCIATED   18570000
*                                      SSCH REQUEST (0 IF NO ASSOCIATED 18600000
*                                      REQUEST).                        18630000
*                                      * ORBPTR(R3)->WORD 3.            18660000
TTE201IO DS    A                       IOSB ADDRESS.                    18690000
*                                      * INPUT REGISTER 2.              18720000
TTE201TK DS    0F                      TOKEN.                      @L8C 18730000
*                                      * INPUT REGISTER 1.              18740000
TTE201T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 18742500
TTE201T2 DS    XL1                     RESERVED.                   @L8A 18745000
TTE201T3 DS    H                       BASE DEVICE NUMBER.         @L8A 18747500
TTE201ED DS    0F                      END OF HSCH TTE.                 18750000
.ENDHSCH ANOP                                                           18780000
.*                                                                      18810000
         AIF   ('&ALL' NE 'YES' AND                                    X18840000
               '&EX' NE 'YES' AND                                      X18870000
               '&IO' NE 'YES').ENDIO                                    18900000
         SPACE 2                                                        18930000
*     IO - I/O INTERRUPT TTE                                            18960000
         ORG   TTEUNQ                                                   18990000
TTE00B   DS    0F                      I/O INTERRUPT (IO).              19020000
TTE00BTB DS    A                       CURRENT TCB ADDRESS OR 0.        19050000
*                                      * PSATOLD.                       19080000
TTE00BDN DS    H                       DEVICE NUMBER.                   19110000
*                                      * UCBPTR(R7)->UCBCHAN.           19140000
TTE00BHA DS    H                       HOME ADDRESS SPACE.              19170000
*                                      * PSAAOLD->ASCBASID.             19200000
TTE00BPA DS    H                       PASID.                           19230000
*                                      * CONTROL REGISTER 4.            19260000
TTE00BSA DS    H                       SASID.                           19290000
*                                      * CONTROL REGISTER 3.            19320000
TTE00BPW DS    0CL8                    I/O OLD PSW.                     19350000
*                                      * FLCIOPSW.                      19380000
TTE00BP1 DS    CL4                     1ST HALF OF PSW.                 19410000
TTE00BP2 DS    CL4                     2ND HALF OF PSW.                 19440000
TTE00BFG DS    H                       IRBFLAGS.                        19470000
*                                      * IRBPTR(R3)->WORD 1.            19500000
TTE00BSC DS    H                       SUBCHANNEL CONTROL.              19530000
*                                      * IRBPTR(R3)->WORD 1.            19560000
TTE00BCA DS    A                       CCW ADDRESS.                     19590000
*                                      * IRBPTR(R3)->WORD 2.            19620000
TTE00BDS DS    XL1                     DEVICE STATUS.                   19650000
*                                      * IRBPTR(R3)->WORD 3.            19680000
TTE00BSS DS    XL1                     SUBCHANNEL STATUS.               19710000
*                                      * IRBPTR(R3)->WORD 3.            19740000
TTE00BCT DS    H                       RESIDUAL COUNT.                  19770000
*                                      * IRBPTR(R3)->WORD 3.            19800000
TTE00BEW DS    F                       EXTENDED STATUS WORD.            19830000
*                                      * IRBPTR(R3)->WORD 4.            19860000
TTE00BUB DS    A                       UCB ADDRESS.                     19890000
*                                      * INPUT REGISTER 7.              19920000
TTE00BLH DS    F                       PSACLHS.                         19950000
TTE00BPL DS    A                       PSALOCAL.                        19980000
TTE00BLE DS    F                       PSACLHSE.                   @L4A 19988300
TTE00BTK DS    0F                      TOKEN.                      @L8C 19996600
*                                      * INPUT REGISTER 1.              20005000
TTE00BT1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 20006200
TTE00BT2 DS    XL1                     RESERVED.                   @L8A 20007400
TTE00BT3 DS    H                       BASE DEVICE NUMBER.         @L8A 20008600
TTE00BED DS    0F                      END OF IO TTE.                   20010000
.ENDIO   ANOP                                                           20040000
.*                                                                      20070000
         AIF   ('&ALL' NE 'YES' AND                                    X20100000
               '&EX' NE 'YES' AND                                      X20130000
               '&MCH' NE 'YES').ENDMCH                                  20160000
         SPACE 2                                                        20190000
*     MCH - MACHINE CHECK INTERRUPT TTE                                 20220000
         ORG   TTEUNQ                                                   20250000
TTE013   DS    0F                      MACHINE CHECK INTERRUPT (MCH).   20280000
TTE013TB DS    A                       CURRENT TCB ADDRESS OR 0.        20310000
*                                      * PSATOLD.                       20340000
TTE013R1 DS    H                       RESERVED.                        20370000
TTE013HA DS    H                       HOME ADDRESS SPACE.              20400000
*                                      * PSAAOLD->ASCBASID.             20430000
TTE013PA DS    H                       PASID.                           20460000
*                                      * CONTROL REGISTER 4.            20490000
TTE013SA DS    H                       SASID.                           20520000
*                                      * CONTROL REGISTER 3.            20550000
TTE013PW DS    0CL8                    MACHINE CHECK OLD PSW.           20580000
*                                      * FLCMOPSW.                      20610000
TTE013P1 DS    CL4                     1ST HALF OF PSW.                 20640000
TTE013P2 DS    CL4                     2ND HALF OF PSW.                 20670000
TTE013MC DS    0CL8                    MACHINE CHECK INTERRUPT CODE.    20700000
*                                      * FLCMCIC.                       20730000
TTE013M1 DS    CL4                     PART 1 OF FLCMCIC.               20760000
TTE013M2 DS    CL4                     PART 2 OF FLCMCIC.               20790000
TTE013PS DS    F                       PSASUPER.                        20820000
TTE013LH DS    F                       PSACLHS.                         20850000
TTE013PL DS    A                       PSALOCAL.                        20880000
TTE013LE DS    F                       PSACLHSE.                   @L4A 20895000
TTE013ED DS    0F                      END OF MCH TTE.                  20910000
.ENDMCH  ANOP                                                           20940000
.*                                                                      20970000
         AIF   ('&ALL' NE 'YES' AND                                    X21000000
               '&EX' NE 'YES' AND                                      X21030000
               '&SCH' NE 'YES').ENDMSCH                                 21060000
         SPACE 1                                                        21090000
*     MSCH - MODIFY SUBCHANNEL TTE                                      21120000
         ORG   TTEUNQ                                                   21150000
TTE101   DS    0F                      MODIFY SUBCHANNEL (MSCH).        21180000
TTE101TB DS    A                       TCB ADDRESS FROM SRB.            21210000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  21240000
TTE101AD DS    H                       ASID FROM IOSB.                  21270000
*                                      * IOSBPTR(R2)->IOSASID.          21300000
TTE101HA DS    H                       HOME ADDRESS SPACE.              21330000
*                                      * PSAAOLD->ASCBASID.             21360000
TTE101CC DS    XL1                     CONDITION CODE.                  21390000
*                                      * INPUT REGISTER 0.              21420000
TTE101R1 DS    XL1                     RESERVED.                        21450000
TTE101DN DS    H                       DEVICE NUMBER.                   21480000
*                                      * IOSBPTR(R2)->IOSUCB->UCBCHAN.  21510000
TTE101UB DS    A                       UCB ADDRESS (COMMON SEGMENT).    21540000
*                                      * ORBPTR(R3)->WORD 1.            21570000
TTE101O2 DS    0F                      ORB WORD 2.                      21600000
*                                      * ORBPTR(R3)->WORD 2.            21630000
TTE101F1 DS    XL1                     SCHFLG1 FROM SCHIB               21660000
*                                      USED FOR MSCH INSTRUCTION.       21690000
TTE101F2 DS    XL1                     SCHFLG2 FROM SCHIB               21720000
*                                      USED FOR MSCH INSTRUCTION.       21750000
TTE101LM DS    XL1                     SCHLPM FROM SCHIB                21780000
*                                      USED FOR MSCH INSTRUCTION.       21810000
TTE101PM DS    XL1                     SCHPOM FROM SCHIB                21840000
*                                      USED FOR MSCH INSTRUCTION.       21870000
TTE101O3 DS    0F                      ORB WORD 3.                      21900000
*                                      * ORBPTR(R3)->WORD 3.            21930000
TTE101MI DS    H                       SCHMBI FROM SCHIB                21960000
*                                      USED FOR MSCH INSTRUCTION.       21990000
TTE101P2 DS    XL1                     IOSOPT2 FROM MSCH IOSB.          22020000
TTE101FB DS    XL1                     IOSFLB FROM MSCH IOSB.           22050000
TTE101IO DS    A                       IOSB ADDRESS.                    22080000
*                                      * INPUT REGISTER 2.              22110000
TTE101TK DS    0F                      TOKEN.                      @L8C 22120000
*                                      * INPUT REGISTER 1.              22130000
TTE101T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 22132500
TTE101T2 DS    XL1                     RESERVED.                   @L8A 22135000
TTE101T3 DS    H                       BASE DEVICE NUMBER.         @L8A 22137500
TTE101ED DS    0F                      END OF MSCH TTE.                 22140000
.ENDMSCH ANOP                                                           22170000
.*                                                                      22200000
         AIF   ('&ALL' NE 'YES' AND                                    X22230000
               '&EX' NE 'YES' AND                                      X22260000
               '&PGM' NE 'YES').ENDPGM                                  22290000
         SPACE 2                                                        22320000
*     PGM - PROGRAM INTERRUPT TTE                                       22350000
         ORG   TTEUNQ                                                   22380000
TTE007   DS    0F                      PROGRAM INTERRUPT (PGM).         22410000
TTE007TB DS    A                       CURRENT TCB ADDRESS OR 0.        22440000
*                                      * PSATOLD.                       22470000
TTE007R1 DS    H                       RESERVED.                        22500000
TTE007HA DS    H                       HOME ADDRESS SPACE.              22530000
*                                      * PSAAOLD->ASCBASID.             22560000
TTE007PA DS    H                       PASID.                           22590000
*                                      * CONTROL REGISTER 4.            22620000
TTE007SA DS    H                       SASID.                           22650000
*                                      * CONTROL REGISTER 3.            22680000
TTE007PW DS    0CL8                    PROGRAM INTERRUPT PSW.           22710000
*                                      * PROGRAM INTERRUPT STATUS       22740000
*                                      *   ADDRESS(R2)->WORDS 1         22770000
*                                      *   AND 2.                       22800000
TTE007P1 DS    CL4                     1ST HALF OF PSW.                 22830000
TTE007P2 DS    CL4                     2ND HALF OF PSW.                 22860000
TTE007IL DS    H                       PROGRAM INSTRUCTION LENGTH.      22890000
*                                      * PROGRAM INTERRUPT STATUS       22920000
*                                      *   ADDRESS(R2)->WORD 3.         22950000
TTE007CD DS    H                       PROGRAM INTERRUPT CODE.          22980000
*                                      * PROGRAM INTERRUPT STATUS       23010000
*                                      *   ADDRESS(R2)->WORD 3.         23040000
TTE007TA DS    A                       TEA CONTENTS. HIGH ORDER BIT     23070000
*                                      INDICATES PRIMARY (0) OR         23100000
*                                      SECONDARY (1).                   23130000
*                                      * PROGRAM INTERRUPT STATUS       23160000
*                                      *   ADDRESS(R2)->WORD 4.         23190000
TTE007LH DS    F                       PSACLHS.                         23220000
TTE007PL DS    A                       PSALOCAL.                        23250000
TTE007LE DS    F                       PSACLHSE.                   @L4A 23265000
TTE007ED DS    0F                      END OF PGM TTE.                  23280000
.ENDPGM  ANOP                                                           23310000
.*                                                                      23340000
         AIF   ('&ALL' NE 'YES' AND                                    X23370000
               '&EX' NE 'YES' AND                                      X23400000
               '&SCH' NE 'YES').ENDRSCH                                 23430000
         SPACE 1                                                        23460000
*     RSCH - RESUME SUBCHANNEL TTE                                      23490000
         ORG   TTEUNQ                                                   23520000
TTE401   DS    0F                      RESUME SUBCHANNEL (RSCH).        23550000
TTE401TB DS    A                       TCB ADDRESS FROM SRB.            23580000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  23610000
TTE401AD DS    H                       ASID FROM IOSB.                  23640000
*                                      * IOSBPTR(R2)->IOSASID.          23670000
TTE401HA DS    H                       HOME ADDRESS SPACE.              23700000
*                                      * PSAAOLD->ASCBASID.             23730000
TTE401CC DS    XL1                     CONDITION CODE.                  23760000
*                                      * INPUT REGISTER 0.              23790000
TTE401DI DS    XL1                     DRIVER ID.                       23820000
*                                      * IOSBPTR(R2)->IOSDVRID.         23850000
TTE401DN DS    H                       DEVICE NUMBER.                   23880000
*                                      * IOSBPTR(R2)->IOSUCB->UCBCHAN.  23910000
TTE401UB DS    A                       UCB ADDRESS FROM IOSB.           23940000
*                                      * IOSBPTR(R2)->IOSUCB.           23970000
TTE401IO DS    A                       IOSB ADDRESS.                    24000000
*                                      * INPUT REGISTER 2.              24030000
TTE401TK DS    0F                      TOKEN.                      @L8C 24040000
*                                      * INPUT REGISTER 1.              24050000
TTE401T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 24052500
TTE401T2 DS    XL1                     RESERVED.                   @L8A 24055000
TTE401T3 DS    H                       BASE DEVICE NUMBER.         @L8A 24057500
TTE401ED DS    0F                      END OF RSCH TTE.                 24060000
.ENDRSCH ANOP                                                           24090000
.*                                                                      24120000
         AIF   ('&ALL' NE 'YES' AND                                    X24150000
               '&EX' NE 'YES' AND                                      X24180000
               '&RST' NE 'YES').ENDRST                                  24210000
         SPACE 2                                                        24240000
*     RST - RESTART INTERRUPT TTE                                       24270000
         ORG   TTEUNQ                                                   24300000
TTE015   DS    0F                      RESTART INTERRUPT (RST).         24330000
TTE015TB DS    A                       CURRENT TCB ADDRESS OR 0.        24360000
*                                      * PSATOLD.                       24390000
TTE015R1 DS    H                       RESERVED.                        24420000
TTE015HA DS    H                       HOME ADDRESS SPACE.              24450000
*                                      * PSAAOLD->ASCBASID.             24480000
TTE015PA DS    H                       PASID.                           24510000
*                                      * CONTROL REGISTER 4.            24540000
TTE015SA DS    H                       SASID.                           24570000
*                                      * CONTROL REGISTER 3.            24600000
TTE015PW DS    0CL8                    RESTART OLD PSW.                 24630000
*                                      * FLCROPSW.                      24660000
TTE015P1 DS    CL4                     1ST HALF OF PSW.                 24690000
TTE015P2 DS    CL4                     2ND HALF OF PSW.                 24720000
TTE015GF DS    F                       REGISTER 15 CONTENT.             24750000
*                                      * INPUT REGISTER 15.             24780000
TTE015G0 DS    F                       REGISTER 0 CONTENT.              24810000
*                                      * INPUT REGISTER 0.              24840000
TTE015G1 DS    F                       REGISTER 1 CONTENT.              24870000
*                                      * INPUT REGISTER 1.              24900000
TTE015PS DS    F                       PSASUPER.                        24930000
TTE015MW DS    F                       PSAMODEW.                        24960000
TTE015LH DS    F                       PSACLHS.                         24990000
TTE015PL DS    A                       PSALOCAL.                        25020000
TTE015LE DS    F                       PSACLHSE.                   @L4A 25035000
TTE015ED DS    0F                      END OF RST TTE.                  25050000
.ENDRST  ANOP                                                           25080000
.*                                                                      25110000
         AIF   ('&ALL' NE 'YES' AND                                    X25140000
               '&EX' NE 'YES' AND                                      X25170000
               '&SPER' NE 'YES').ENDSPER                                25200000
         SPACE 2                                                        25230000
*     SPER - SLIP/PER EVENT TTE                                    @L1A 25260000
         ORG   TTEUNQ                                              @L1A 25290000
TTE009   DS    0F                      SLIP/PER (SPER).            @L1A 25320000
TTE009TB DS    A                       CURRENT TCB ADDRESS OR 0.   @L1A 25350000
*                                      * PSATOLD.                  @L1A 25380000
TTE009PC DS    XL2                     PER CODE.                   @L9C 25410000
*                                      * SLIP/PER STATUS ADDRESS   @L1A 25440000
*                                      * (R3)-> BYTE 1.            @L1A 25470000
TTE009HA DS    H                       HOME ADDRESS SPACE.         @L1A 25530000
*                                      * PSAAOLD->ASCBASID.        @L1A 25560000
TTE009PA DS    H                       PASID.                      @L1A 25590000
*                                      * CONTROL REGISTER 4.       @L1A 25620000
TTE009SA DS    H                       SASID.                      @L1A 25650000
*                                      * CONTROL REGISTER 3.       @L1A 25680000
TTE009PW DS    0CL8                    PROGRAM INTERRUPT PSW.      @L1A 25710000
*                                      * PROGRAM INTERRUPT STATUS  @L1A 25740000
*                                      *   ADDRESS(R2)->WORDS 1    @L1A 25770000
*                                      *   AND 2.                  @L1A 25800000
TTE009P1 DS    CL4                     1ST HALF OF PSW.            @L1A 25830000
TTE009P2 DS    CL4                     2ND HALF OF PSW.            @L1A 25860000
TTE009IL DS    H                       PROGRAM INSTRUCTION LENGTH. @L1A 25890000
*                                      * PROGRAM INTERRUPT STATUS  @L1A 25920000
*                                      *   ADDRESS(R2)->WORD 3.    @L1A 25950000
TTE009CD DS    H                       PROGRAM INTERRUPT CODE.     @L1A 25980000
*                                      * PROGRAM INTERRUPT STATUS  @L1A 26010000
*                                      *   ADDRESS(R2)->WORD 3.    @L1A 26040000
TTE009ID DS    CL4                     SLIP/PER TRAP ID.           @L1A 26220000
*                                      * SLIP/PER TRAP ID ADDRESS  @L1A 26250000
*                                      * (R1)->WORD 1.             @L1A 26280000
TTE009IA DS    A                       PER ADDRESS.                @L1A 26310000
*                                      * SLIP/PER STATUS ADDRESS   @L1A 26340000
*                                      * (R3)-> BYTES 3 THROUGH 6. @L1A 26370000
TTE009IB DS    A                       PER ADDRESS.                @L1A 26377500
*                                      * SLIP/PER STATUS ADDRESS   @L1A 26385000
*                                      * (R3)-> BYTES 7 THROUGH 10.@L1A 26392500
TTE009LH DS    F                       PSACLHS.                    @L1A 26400000
TTE009LE DS    F                       PSACLHSE.                   @L4C 26415000
TTE009PL DS    A                       PSALOCAL.                   @L1A 26430000
TTE009ED DS    0F                      END OF SLIP/PER TTE.        @L1A 26460000
.ENDSPER ANOP                                                      @L1A 26490000
.*                                                                      26520000
         AIF   ('&ALL' NE 'YES' AND                                    X26550000
               '&EX' NE 'YES' AND                                      X26580000
               '&DSP' NE 'YES').ENDSRB                                  26610000
         SPACE 1                                                        26640000
*     SRB - SRB DISPATCH TTE                                            26670000
         ORG   TTEUNQ                                                   26700000
TTE10F   DS    0F                      SRB DISPATCH (SRB).              26730000
TTE10FTB DS    A                       WORK UNIT ADDRESS.         @D1C  26760000
*                                      * SRBPTR(R0)->SRBWEB.            26790000
TTE10FSF DS    XL1                     SRB FLAG BYTE.                   26820000
*                                      * SRBPTR(R0)->SRBFLGS.           26850000
TTE10FLH DS    XL1                     SRBHLHI.                         26880000
*                                      * SRBPTR(R0)->SRBHLHI.           26910000
TTE10FHA DS    H                       HOME ADDRESS SPACE.              26940000
*                                      * PSAAOLD->ASCBASID.             26970000
TTE10FPW DS    0CL8                    PSW TO RECEIVE CONTROL ON SRB    27000000
*                                      DISPATCH.                        27030000
*                                      * PSASMPSW.                      27060000
TTE10FP1 DS    CL4                     1ST HALF OF PSW.                 27090000
TTE10FP2 DS    CL4                     2ND HALF OF PSW.                 27120000
TTE10FFN DS    H                       CPU AFFINITY.                    27150000
*                                      * SRBPTR(R0)->SRBCPAFF.          27180000
TTE10FAP DS    H                       RELATED ASID.                    27210000
*                                      * SRBPTR(R0)->SRBPASID.          27240000
TTE10FG0 DS    F                       REGISTER 0 CONTENTS.             27270000
*                                      * INPUT REGISTER 0.              27300000
TTE10FG1 DS    F                       REGISTER 1 CONTENTS.             27330000
*                                      * INPUT REGISTER 1.              27360000
TTE10FPT DS    A                       PURGE TCB ADDRESS.          @D1A 27370000
*                                      * SRBPTR(R0)->SRBPTCB.           27380000
TTE10FED DS    0F                      END OF SRB TTE.                  27390000
.ENDSRB  ANOP                                                           27420000
         AIF   ('&ALL' NE 'YES' AND                                    X27450000
               '&EX' NE 'YES' AND                                      X27480000
               '&EXT' NE 'YES').ENDSS                                   27510000
         SPACE 1                                                        27540000
*     SS - SERVICE SIGNAL EXTERNAL INTERRUPT TTE                        27570000
         ORG   TTEUNQ                                                   27600000
TTE203   DS    0F                      SS EXTERNAL INTERRUPT (SS).      27630000
TTE203TB DS    A                       CURRENT TCB ADDRESS OR 0.        27660000
*                                      * PSATOLD.                       27690000
TTE203R1 DS    H                       RESERVED.                        27720000
TTE203HA DS    H                       HOME ADDRESS SPACE.              27750000
*                                      * PSAAOLD->ASCBASID.             27780000
TTE203PA DS    H                       PASID.                           27810000
*                                      * INPUT REGISTER 4.              27840000
TTE203SA DS    H                       SASID.                           27870000
*                                      * INPUT REGISTER 4.              27900000
TTE203PW DS    0CL8                    EXTERNAL OLD PSW.                27930000
*                                      * FLCEOPSW.                      27960000
TTE203P1 DS    CL4                     1ST HALF OF PSW.                 27990000
TTE203P2 DS    CL4                     2ND HALF OF PSW.                 28020000
TTE203CD DS    F                       EXTERNAL INTERRUPT CODE.         28050000
*                                      * PSAEEPSW.                      28080000
TTE203BA DS    A                       SCCB ADDRESS ASSOCIATED     @L6C 28130000
*                                      WITH THE SERVICE SIGNAL.         28180000
TTE203CM DS    F                       SCLP COMMAND WORD           @L6C 28230000
*                                      ASSOCIATED WITH THE SERVICE      28280000
*                                      SIGNAL INTERRUPT.                28330000
TTE203R3 DS    H                       RESERVED.                   @L6C 28380000
*                                      HARDWARE FLAGS NO LONGER         28430000
*                                      PART OF THE SS TRACE ENTRY       28480000
TTE203RC DS    H                       SERVICE PROCESSOR RESPONSE  @L6C 28530000
*                                      AND REASON CODE.                 28580000
TTE203R2 DS    H                       RESERVED.                        28770000
TTE203AD DS    H                       SS ASID.                    @L6C 28820000
TTE203AT DS    A                       SS TCB ADDRESS.             @L6C 28870000
TTE203LH DS    F                       PSACLHS.                         29220000
TTE203PL DS    A                       PSALOCAL.                        29250000
TTE203LE DS    F                       PSACLHSE.                   @L4A 29265000
TTE203ED DS    0F                      END OF SS TTE.                   29280000
.ENDSS   ANOP                                                           29310000
.*                                                                      29340000
         AIF   ('&ALL' NE 'YES' AND                                    X29370000
               '&EX' NE 'YES' AND                                      X29400000
               '&SIGA' NE 'YES').ENDSIGA                           @01A 29401300
         SPACE 1                                                   @01P 29402600
*     SIGA - Signal adapter TTE                                         29403900
         ORG   TTEUNQ                                              @01P 29405200
TTE501   DS    0F                      Signal adapter (SIGA).      @01A 29406500
TTE501TB DS    A                       TCB address.                @01A 29407800
         DS    H                       Reserved                    @01A 29409100
TTE501HA DS    H                       Home ASID.                  @01A 29410400
TTE501CC DS    XL1                     Condition code              @01A 29411700
TTE501FC DS    XL1                     SIGA function code          @01A 29413000
TTE501DN DS    H                       Device number.              @01A 29414300
TTE501SI DS    F                       SID.                        @01A 29415600
TTE501M1 DS    A                       Bit mask (SYNCH).           @01A 29416900
TTE501M2 DS    A                       Bit mask (SYNCH).           @01A 29418200
TTE501QI DS    F                       QIB pointer.                @01A 29419500
TTE501UB DS    A                       UCB address.                @01A 29420800
TTE501ED DS    0F                      End of SIGA TTE.            @01A 29422100
.ENDSIGA ANOP  ,                                                   @01A 29423400
.*                                                                      29424700
         AIF   ('&ALL' NE 'YES' AND                                    X29426400
               '&EX' NE 'YES' AND                                      X29428100
               '&SCH' NE 'YES').ENDSSCH                                 29430000
         SPACE 1                                                        29460000
*     SSCH - START SUBCHANNEL TTE                                       29490000
         ORG   TTEUNQ                                                   29520000
TTE001   DS    0F                      START SUBCHANNEL (SSCH).         29550000
TTE001TB DS    A                       TCB ADDRESS FROM SRB.            29580000
*                                      * IOSBPTR(R2)->IOSSRB->SRBPTCB.  29610000
TTE001AD DS    H                       ASID FROM IOSB.                  29640000
*                                      * IOSBPTR(R2)->IOSASID.          29670000
TTE001HA DS    H                       HOME ADDRESS SPACE.              29700000
*                                      * PSAAOLD->ASCBASID.             29730000
TTE001CC DS    XL1                     CONDITION CODE.                  29760000
*                                      * INPUT REGISTER 0.              29790000
TTE001DI DS    XL1                     DRIVER ID.                       29820000
*                                      * IOSBPTR(R2)->IOSDVRID.         29850000
TTE001DN DS    H                       DEVICE NUMBER.                   29880000
*                                      * TTE001UB->UCBCHAN.        @L8C 29910000
TTE001UB DS    A                       ORB WORD 1 - UCB ADDRESS.        29940000
*                                      * ORBPTR(R3)->WORD 1.            29970000
TTE001O2 DS    F                       ORB WORD 2.                      30000000
*                                      * ORBPTR(R3)->WORD 2.            30030000
TTE001O3 DS    F                       ORB WORD 3.                      30060000
*                                      * ORBPTR(R3)->WORD 3.            30090000
TTE001O4 DS    F                       ORB WORD 4.                 @LAA 30100000
*                                      * ORBPTR(R3)->WORD 4        @LAA 30110000
TTE001IO DS    A                       IOSB ADDRESS.                    30120000
*                                      * INPUT REGISTER 2.              30150000
TTE001TK DS    0F                      TOKEN.                      @L8C 30160000
*                                      * INPUT REGISTER 1.              30170000
TTE001T1 DS    XL1                     KEY. NOT FORMATTED.         @L8A 30171600
TTE001T2 DS    XL1                     RESERVED.                   @L8A 30173200
TTE001T3 DS    H                       BASE DEVICE NUMBER.         @L8A 30174800
TTE001CU DS    F                       CAPTURE UCB ADDRESS.        @L8A 30176400
*                                      * IOSBPTR(R2)->IOSUCB.           30178000
TTE001ED DS    0F                      END OF SSCH TTE.                 30180000
.ENDSSCH ANOP                                                           30210000
.*                                                                      30240000
         AIF   ('&ALL' NE 'YES' AND                                    X30270000
               '&EX' NE 'YES' AND                                      X30300000
               '&DSP' NE 'YES').ENDSSRB                                 30330000
         SPACE 1                                                        30360000
*     SSRB - SUSPENDED SRB DISPATCH TTE                                 30390000
         ORG   TTEUNQ                                                   30420000
TTE20F   DS    0F                      SUSPENDED SRB DISPATCH (SSRB).   30450000
TTE20FTB DS    A                       WORK UNIT ADDRESS.         @D1C  30480000
*                                      * PSALCCAV->LCCACWEB.            30510000
TTE20FR1 DS    XL1                     RESERVED.                        30540000
TTE20FLH DS    XL1                     PSACLHS BYTE 4.                  30570000
*                                      * PSACLHS4.                      30600000
TTE20FHA DS    H                       HOME ADDRESS SPACE.              30630000
*                                      * PSAAOLD->ASCBASID.             30660000
TTE20FPA DS    H                       PASID.                           30690000
*                                      * INPUT REGISTER 13.             30720000
TTE20FSA DS    H                       SASID.                           30750000
*                                      * INPUT REGISTER 13.             30780000
TTE20FPW DS    0CL8                    PSW TO BE REDISPATCHED.          30810000
*                                      * PSAPSWSV.                      30840000
TTE20FP1 DS    CL4                     1ST HALF OF PSW.                 30870000
TTE20FP2 DS    CL4                     2ND HALF OF PSW.                 30900000
TTE20FPT DS    A                       RELATED TCB.                     30910000
*                                      * PSALCCAV->LCCAPGTA+2.     @D1A 30920000
TTE20FSP DS    F                       SSRB ADDRESS                @P2C 30930000
*                                      * INPUT REGISTER 1               30960000
TTE20FFN DS    H                       CPU AFFINITY.                    30990000
*                                      * PSALCCAV->LCCASAFN.            31020000
TTE20FAP DS    H                       RELATED ASID.                    31050000
*                                      * PSALCCAV->LCCAPGTA.            31080000
TTE20FPL DS    A                       PSALOCAL.                        31110000
TTE20FED DS    0F                      END OF SSRB TTE.                 31140000
.ENDSSRB ANOP                                                           31170000
.*                                                                      31200000
         AIF   ('&ALL' NE 'YES' AND                                    X31230000
               '&EX' NE 'YES' AND                                      X31260000
               '&SUSP' NE 'YES').ENDSUSP                                31290000
         SPACE 2                                                        31320000
*     SUSP - LOCK SUSPENSION TTE                                        31350000
         ORG   TTEUNQ                                                   31380000
TTE019   DS    0F                      SUSPENSION (SUSP).               31410000
TTE019TB DS    A                       ADDRESS OF SUSPENDED TCB OR      31440000
*                                      RELATED TCB.                     31470000
*                                      * INPUT REGISTER 4 OR            31500000
*                                      * SSRBPTR(R4)->SRBPTCB.          31530000
TTE019R1 DS    H                       RESERVED.                        31560000
TTE019HA DS    H                       HOME ADDRESS SPACE.              31590000
*                                      * PSAAOLD->ASCBASID.             31620000
TTE019RT DS    A                       RETURN ADDRESS FOR THE CALLER    31650000
*                                      OF THE SERVICE ROUTINE.          31680000
*                                      * INPUT REGISTER 14.             31710000
TTE019RB DS    A                       ADDRESS OF SUSPENDED RB OR 0.    31740000
*                                      * INPUT REGISTER 5.              31770000
TTE019SB DS    A                       ADDRESS OF SUSPENDED SRB OR 0.   31800000
*                                      * INPUT REGISTER 4 OR 0.         31830000
TTE019SI DS    CL4                     SUSPENSION TYPE IDENTIFIER.      31860000
*                                      (LOCL, CML, CMS, CEDQ, CSMF IN   31890000
*                                      EBCDIC).                         31920000
*                                      * INPUT REGISTER 12.             31950000
TTE019AD DS    A                       ADDRESS ASSOCIATED WITH          31980000
*                                      SUSPENSION OR 0:                 32010000
*                                      LOCL - 0.                        32040000
*                                      CML  - ASCB ADDRESS FOR CML      32070000
*                                             LOCK REQUESTED.           32100000
*                                      CMS  - LOCKWORD ADDRESS.         32130000
*                                      CEDQ - LOCKWORD ADDRESS.         32160000
*                                      CSMF - LOCKWORD ADDRESS.         32190000
*                                      * INPUT REGISTER 11.             32220000
TTE019LH DS    F                       CLHS - CPU LOCKS HELD STRING     32235000
*                                      * INPUT REGISTER 2.         @P1A 32250000
TTE019PL DS    A                       LOCAL LOCK                       32265000
*                                      * INPUT REGISTER 3.         @P1A 32280000
TTE019LE DS    F                       PSACLHSE.                   @L4A 32295000
TTE019ED DS    0F                      END OF SUSP TTE.                 32310000
.ENDSUSP ANOP                                                           32340000
.*                                                                      32370000
         AIF   ('&ALL' NE 'YES' AND                                    X32400000
               '&EX' NE 'YES' AND                                      X32430000
               '&SVC' NE 'YES').ENDSVC                                  32460000
         SPACE 1                                                        32490000
*     SVC - SVC INTERRUPT TTE                                           32520000
         ORG   TTEUNQ                                                   32550000
TTE005   DS    0F                      GENERAL SVC INTERRUPT (SVC).     32580000
TTE005TB DS    A                       CURRENT TCB ADDRESS OR 0.        32610000
*                                      * PSATOLD.                       32640000
TTE005SN DS    H                       SVC NUMBER.                      32670000
*                                      * FLCSVCN.                       32700000
TTE005HA DS    H                       HOME ADDRESS SPACE.              32730000
*                                      * PSAAOLD->ASCBASID.             32760000
TTE005PW DS    0CL8                    SVC OLD PSW.                     32790000
*                                      * FLCSOPSW.                      32820000
TTE005P1 DS    CL4                     1ST HALF OF PSW.                 32850000
TTE005P2 DS    CL4                     2ND HALF OF PSW.                 32880000
TTE005GF DS    F                       REGISTER 15 CONTENTS.            32910000
*                                      * INPUT REGISTER 15.             32940000
TTE005G0 DS    F                       REGISTER 0 CONTENTS.             32970000
*                                      * INPUT REGISTER 0.              33000000
TTE005G1 DS    F                       REGISTER 1 CONTENTS.             33030000
*                                      * INPUT REGISTER 1.              33060000
TTE005ED DS    0F                      END OF SVC TTE.                  33090000
.ENDSVC  ANOP                                                           33120000
.*                                                                      33150000
         AIF   ('&ALL' NE 'YES' AND                                    X33180000
               '&EX' NE 'YES' AND                                      X33210000
               '&SVC' NE 'YES').ENDSVCE                                 33240000
         SPACE 1                                                        33270000
*     SVCE - SVC ERROR TTE                                              33300000
         ORG   TTEUNQ                                                   33330000
TTEF05   DS    0F                      SVC ERROR (SVCE).                33360000
TTEF05TB DS    A                       CURRENT TCB ADDRESS OR 0.        33390000
*                                      * PSATOLD.                       33420000
TTEF05SN DS    H                       SVC NUMBER.                      33450000
*                                      * FLCSVCN.                       33480000
TTEF05HA DS    H                       HOME ADDRESS SPACE.              33510000
*                                      * PSAAOLD->ASCBASID.             33540000
TTEF05PA DS    H                       PASID.                           33570000
*                                      * CONTROL REGISTER 4.            33600000
TTEF05SA DS    H                       SASID.                           33630000
*                                      * CONTROL REGISTER 3.            33660000
TTEF05PW DS    0CL8                    SVC OLD PSW.                     33690000
*                                      * FLCSOPSW.                      33720000
TTEF05P1 DS    CL4                     1ST HALF OF PSW.                 33750000
TTEF05P2 DS    CL4                     2ND HALF OF PSW.                 33780000
TTEF05GF DS    F                       REGISTER 15 CONTENTS.            33810000
*                                      * INPUT REGISTER 15.             33840000
TTEF05G0 DS    F                       REGISTER 0 CONTENTS.             33870000
*                                      * INPUT REGISTER 0.              33900000
TTEF05G1 DS    F                       REGISTER 1 CONTENTS.             33930000
*                                      * INPUT REGISTER 1.              33960000
TTEF05MW DS    F                       PSAMODEW.                        33990000
TTEF05LH DS    F                       PSACLHS.                         34020000
TTEF05PL DS    A                       PSALOCAL.                        34050000
TTEF05LE DS    F                       PSACLHSE.                   @L4A 34065000
TTEF05ED DS    0F                      END OF SVCE TTE.                 34080000
.ENDSVCE ANOP                                                           34110000
.*                                                                      34140000
         AIF   ('&ALL' NE 'YES' AND                                    X34170000
               '&EX' NE 'YES' AND                                      X34200000
               '&SVC' NE 'YES').ENDSVCR                                 34230000
         SPACE 1                                                        34260000
*     SVCR - SVC RETURN TTE                                             34290000
         ORG   TTEUNQ                                                   34320000
TTE105   DS    0F                      SVC RETURN (SVCR).               34350000
TTE105TB DS    A                       CURRENT TCB ADDRESS.             34380000
*                                      * PSATOLD.                       34410000
TTE105SN DS    H                       SVC NUMBER.                      34440000
*                                      * ((PSATOLD->TCBRBP)-            34470000
*                                      *   (RBPRFLNA)->RBINTCOD.        34500000
TTE105HA DS    H                       HOME ADDRESS SPACE.              34530000
*                                      * PSAAOLD->ASCBASID.             34560000
TTE105PW DS    0CL8                    PSW TO RECEIVE CONTROL ON        34590000
*                                      REDISPATCH.                      34620000
*                                      * PSATOLD->TCBRBP->RBOPSW.       34650000
TTE105P1 DS    CL4                     1ST HALF OF PSW.                 34680000
TTE105P2 DS    CL4                     2ND HALF OF PSW.                 34710000
TTE105GF DS    F                       REGISTER 15 CONTENTS.            34740000
*                                      * INPUT REGISTER 15.             34770000
TTE105G0 DS    F                       REGISTER 0 CONTENTS.             34800000
*                                      * INPUT REGISTER 0.              34830000
TTE105G1 DS    F                       REGISTER 1 CONTENTS.             34860000
*                                      * INPUT REGISTER 1.              34890000
TTE105ED DS    0F                      END OF SVCR TTE.                 34920000
.ENDSVCR ANOP                                                           34950000
.*                                                                      34980000
         AIF   ('&ALL' NE 'YES' AND                                    X35010000
               '&EX' NE 'YES' AND                                      X35040000
               '&SSRV' NE 'YES').ENDSSRV  IF ALL ENTRY MAPPINGS IS @L2A 35040700
.*                                     NOT SPECIFIED, ALL EXPLICIT      35041400
.*                                     ENTRY MAPPINGS IS NOT            35042100
.*                                     SPECIFIED, SSRV ENTRY            35042800
.*                                     MAPPING IS NOT SPECIFIED,        35043500
.*                                     SKIP SSRV ENTRY MAPPING          35044200
.*                                     GENERATION.                      35044900
         SPACE 1                                                        35045600
*     SSRV - PC OR BRANCH ENTERED SYSTEM SERVICE TTE                    35046300
         ORG   TTEUNQ                                                   35047000
TTE205   DS    0F                      PC OR BRANCH ENTERED        @L2A 35047700
*                                      SYSTEM SERVICE (SSRV)            35048400
TTE205TB DS    A                       CURRENT TCB ADDRESS OR 0.   @L2A 35049100
*                                      PSATOLD.                         35049800
TTE205SI DS    H                       SSRVID.                     @L2A 35050500
*                                      ASSOCIATED SERVICE IDENTIFIER    35051200
*                                      NUMBER.                          35051900
TTE205HA DS    H                       HOME ADDRESS SPACE.         @L2A 35052600
*                                      PSAAOLD->ASCBASID.               35053300
TTE205CI DS    A                       RETURN ADDRESS OF THE       @L2A 35054000
*                                      CALLER OF THE BRANCH             35054700
*                                      ENTERED SERVICE OR OF THE        35055400
*                                      PC ENTERED SERVICE.              35056100
TTE205U1 DS    F                       1ST WORD OF INFORMATION     @L2A 35056800
*                                      UNIQUE FOR ASSOCIATED            35057500
*                                      SERVICE IDENTIFIER.              35058200
TTE205U2 DS    F                       2ND WORD OF INFORMATION     @L2A 35058900
*                                      UNIQUE FOR ASSOCIATED            35059600
*                                      SERVICE IDENTIFIER.              35060300
TTE205U3 DS    F                       3RD WORD OF INFORMATION     @L2A 35061000
*                                      UNIQUE FOR ASSOCIATED            35061700
*                                      SERVICE IDENTIFIER.              35062400
TTE205U4 DS    F                       4TH WORD OF INFORMATION     @L2A 35063100
*                                      UNIQUE FOR ASSOCIATED            35063800
*                                      SERVICE IDENTIFIER.              35064500
TTE205ED DS    0F                      END OF SSRV TTE.            @L2A 35065200
.ENDSSRV ANOP                                                      @L2A 35065900
.*                                                                      35066600
         AIF   ('&ALL' NE 'YES' AND                                    X35067300
               '&EX' NE 'YES' AND                                      X35068000
               '&USRN' NE 'YES').ENDUSRN                                35070000
         SPACE 2                                                        35100000
*     USRN - USER EVENT TTE                                             35130000
         ORG   TTEUNQ                                                   35160000
TTE07F   DS    0F                      USER EVENT TRACE (USRN).         35190000
TTE07FTB DS    A                       CURRENT TCB ADDRESS OR 0.        35220000
*                                      * PSATOLD.                       35250000
TTE07FRV DS    H                       RESERVED.                        35280000
TTE07FHA DS    H                       HOME ADDRESS SPACE.              35310000
*                                      * PSAAOLD->ASCBASID.             35340000
TTE07FPA DS    H                       PASID.                           35370000
*                                      * CONTROL REGISTER 4.            35400000
TTE07FSA DS    H                       SASID.                           35430000
*                                      * CONTROL REGISTER 3.            35460000
TTE07FAD DS    A                       USER RETURN ADDRESS.             35490000
*                                      * INPUT REGISTER 14.             35520000
TTE07FCI DS    0F                      CONTINUATION INFORMATION.        35550000
TTE07FPI DS    H                       PTRACE IDENTIFICATION COUNT.     35580000
*                                      * PSATRVT->TRVTTOB->TOBTRCI      35610000
TTE07FRB DS    H                       RELATIVE BYTE COUNT.             35640000
*                                      * GENERATED.                     35670000
TTE07FMW EQU   5                       MAXIMUM NUMBER OF DATA WORDS     35700000
*                                      PER USER ENTRY.                  35730000
.ENDUSRN ANOP                                                           35760000
.*                                                                      35790000
         AIF   ('&ALL' NE 'YES' AND                                    X35820000
               '&EX' NE 'YES' AND                                      X35850000
               '&DSP' NE 'YES').ENDWAIT                                 35880000
         SPACE 1                                                        35910000
*     WAIT - WAIT DISPATCH TTE                                          35940000
         ORG   TTEUNQ                                                   35970000
TTEF0F   DS    0F                      WAIT DISPATCH (WAIT).            36000000
TTEF0FTB DS    A                       CURRENT TCB ADDRESS.             36030000
*                                      * PSATOLD.                       36060000
TTEF0FR1 DS    H                       RESERVED.                        36090000
TTEF0FHA DS    H                       HOME ADDRESS SPACE.              36120000
*                                      * PSAAOLD->ASCBASID.             36150000
TTEF0FED DS    0F                      END OF WAIT TTE.                 36180000
.ENDWAIT ANOP                                                           36210000
.*                                                                      36240000
         AIF   ('&ALL' NE 'YES' AND                                    X36240700
               '&EX' NE 'YES' AND                                      X36241400
               '&RCVY' NE 'YES').ENDRCVY                           @L3A 36242100
         SPACE 1                                                        36242800
*     RCVY - RECOVERY EVENT TTE                                         36243500
         ORG   TTEUNQ                                              @L3A 36244200
TTE01D   DS    0F                      RECOVERY EVENT (RCVY).      @L3A 36244900
TTE01DTB DS    A                       CURRENT TCB ADDRESS OR 0.   @L3A 36245600
*                                      * PSATOLD.                       36246300
TTE01DSI DS    H                       RCVY SUBTYPE CODE.          @L3A 36247000
TTE01DHA DS    H                       HOME ADDRESS SPACE.         @L3A 36247700
*                                      * PSAAOLD->ASCBASID.             36248400
TTE01DLH DS    F                       PSACLHS.                    @L3A 36249100
TTE01DLE DS    F                       PSACLHSE.                   @L4A 36249400
TTE01DPL DS    A                       PSALOCAL.                   @L3A 36249800
TTE01DU  DS    0CL32                   INFORMATION UNIQUE TO       @L4C 36250500
*                                      RCVY SUBTYPE CODE.               36251200
TTE01DU1 DS    F                       1ST WORD OF INFORMATION     @L3A 36251900
*                                      UNIQUE TO RCVY SUBTYPE.          36252600
TTE01DU2 DS    F                       2ND WORD OF INFORMATION     @L3A 36253300
*                                      UNIQUE TO RCVY SUBTYPE.          36254000
TTE01DU3 DS    F                       3RD WORD OF INFORMATION     @L3A 36254700
*                                      UNIQUE TO RCVY SUBTYPE.          36255400
TTE01DU4 DS    F                       4TH WORD OF INFORMATION     @L3A 36256100
*                                      UNIQUE TO RCVY SUBTYPE.          36256800
TTE01DU5 DS    F                       5TH WORD OF INFORMATION     @L3A 36257500
*                                      UNIQUE TO RCVY SUBTYPE.          36258200
TTE01DU6 DS    F                       6TH WORD OF INFORMATION     @L3A 36258900
*                                      UNIQUE TO RCVY SUBTYPE.          36259600
TTE01DU7 DS    F                       7TH WORD OF INFORMATION     @L3A 36260300
*                                      UNIQUE TO RCVY SUBTYPE.          36261000
TTE01DU8 DS    F                       8TH WORD OF INFORMATION     @L3A 36261700
*                                      UNIQUE TO RCVY SUBTYPE.          36262400
TTE01DED DS    0F                      END OF RCVY TTE.            @L3A 36264500
.ENDRCVY ANOP                                                      @L3A 36265200
.*                                                                      36265900
         AIF   ('&ALL' NE 'YES' AND                                    X36266000
               '&EX' NE 'YES' AND                                      X36266100
               '&TIME' NE 'YES').ENDTIME                           @L5A 36266200
         SPACE 1                                                        36266300
*     TIME - TIMER SERVICES TTE                                    @L5A 36266400
         ORG   TTEUNQ                                              @L5A 36266500
TTE01F   DS    0F                      TIMER SERVICES ENTRY(TIME)  @L5A 36266600
TTE01FTB DS    A                       CURRENT TCB ADDRESS OR 0.   @L5A 36266700
*                                      * PSATOLD.                       36266800
TTE01FSI DS    H                       TIME SUBTYPE CODE.          @L5A 36266900
TTE01FHA DS    H                       HOME ADDRESS SPACE.         @L5A 36267000
*                                      * PSAAOLD->ASCBASID.             36267100
TTE01FU  DS    0CL44                   INFORMATION UNIQUE TO       @L5A 36267200
*                                      TIME SUBTYPE CODE.               36267300
TTE01FU1 DS    F                       1ST WORD OF INFORMATION     @L5A 36267400
*                                      UNIQUE TO TIME SUBTYPE.          36267500
TTE01FU2 DS    F                       2ND WORD OF INFORMATION     @L5A 36267600
*                                      UNIQUE TO TIME SUBTYPE.          36267700
TTE01FU3 DS    F                       3RD WORD OF INFORMATION     @L5A 36267800
*                                      UNIQUE TO TIME SUBTYPE.          36267900
TTE01FU4 DS    F                       4TH WORD OF INFORMATION     @L5A 36268000
*                                      UNIQUE TO TIME SUBTYPE.          36268100
TTE01FU5 DS    F                       5TH WORD OF INFORMATION     @L5A 36268200
*                                      UNIQUE TO TIME SUBTYPE.          36268300
TTE01FU6 DS    F                       6TH WORD OF INFORMATION     @L5A 36268400
*                                      UNIQUE TO TIME SUBTYPE.          36268500
TTE01FU7 DS    F                       7TH WORD OF INFORMATION     @L5A 36268600
*                                      UNIQUE TO TIME SUBTYPE.          36268700
TTE01FU8 DS    F                       8TH WORD OF INFORMATION     @L5A 36268800
*                                      UNIQUE TO TIME SUBTYPE.          36268900
TTE01FU9 DS    F                       9TH WORD OF INFORMATION     @L5A 36269000
*                                      UNIQUE TO TIME SUBTYPE.          36269100
TTE01FUA DS    F                       10TH WORD OF INFORMATION    @L5A 36269200
*                                      UNIQUE TO TIME SUBTYPE.          36269300
TTE01FUB DS    F                       11TH WORD OF INFORMATION    @L5A 36269400
*                                      UNIQUE TO TIME SUBTYPE.          36269500
TTE01FED DS    0F                      END OF TIME TTE.            @L5A 36269600
.ENDTIME ANOP                                                      @L5A 36269700
.*                                                                      36269800
         MEND  ,                                                     */ 36299900
*                                                                       36330000
*%TTEL2:                                                                36340000
*   ;                                                                   36350000
*                                                                       36360000
*   /*****************************************************************/ 36370000
*   /*                                                               */ 36380000
*   /* SYSTEM TRACE TABLE ENTRY                                      */ 36390000
*   /*                                                               */ 36400000
*   /*****************************************************************/ 36410000
*                                                                       36420000
*   DECLARE                                                             36450000
*     1    TTE      BASED(TTEPTR) BOUNDARY(WORD), /* TRACE TABLE        36472500
*                                      ENTRY.                        */ 36495000
*       3    *        CHARACTER(4); /* MINIMUM TRACE TABLE ENTRY.    */ 36517500
*                                                                       36540000
*/*|NOTATION USED IN THE TTE MAPPING:                                */ 36570000
*/*|                                                                 */ 36600000
*/*|A MODEL OF THE FORMATTED VERSION OF EACH ENTRY TYPE APPEARS AT   */ 36630000
*/*|THE HEAD OF THE ENTRY:                                           */ 36660000
*/*|                                                                 */ 36690000
*/*|PR ASID TCB ID   CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 36720000
*/*|                               U4 U5 U6 CLHSE                    */ 36750000
*/*|                                                                 */ 36780000
*/*|                                                                 */ 36810000
*/*|THE <PR> FIELD IS THE PROCESSOR ID, WHICH IS NOT CONTAINED IN THE*/ 36840000
*/*|ENTRY, BUT IS IMPLIED BY ASSOCIATION OF THE CONTAINING TRACE     */ 36870000
*/*|BUFFER WITH A PROCESSOR.                                         */ 36900000
*/*|                                                                 */ 36930000
*/*|THE <ASID> FIELD IS THE HOME OR RELATED ASID, WHICH IS CONTAINED */ 36960000
*/*|IN AN EXPLICIT TRACE ENTRY AND IS IMPLIED FROM THE PREVIOUS HOME */ 36990000
*/*|ASID FOR AN ASID (PC, PT OR SSAR) OR BRANCH ENTRY.               */ 37020000
*/*|                                                                 */ 37050000
*/*|THE <TCB> FIELD IS THE TCB OR RELATED TCB ADDRESS, WHICH IS      */ 37080000
*/*|CONTAINED IN AN EXPLICIT TRACE ENTRY AND IS IMPLIED FROM THE     */ 37110000
*/*|PREVIOUS TCB FOR AN ASID OR BRANCH ENTRY.                        */ 37140000
*/*|                                                                 */ 37170000
*/*|THE <TIME> FIELD IS COMPOSED FROM THE TIMESTAMP ASSOCIATED WITH  */ 37200000
*/*|THE CONTAINING TRACE BUFFER AND THE PARTIAL TIMESTAMP IN THE     */ 37230000
*/*|EXPLICIT ENTRY.                                                  */ 37260000
*/*|                                                                 */ 37290000
*/*|ALL OTHER FIELDS ARE CONTAINED IN THE PARTICULAR TTE.            */ 37320000
*/*|                                                                 */ 37350000
*/*|                                                                 */ 37380000
*/*|                                                                 */ 37410000
*/*|TTE FIELD COMMENTS INDICATE:                                     */ 37440000
*/*|                                                                 */ 37470000
*/*| WHERE A TTE FIELD APPEARS IN THE FORMATTED VERSION OF THE TTE   */ 37500000
*/*| <FORMAT FIELD>.                                                 */ 37530000
*/*| THE CONTENTS OF THE FIELD.                                      */ 37560000
*/*| THE SOURCE OF DATA IN THE FIELD.  (RX) INDICATES THE REGISTER X */ 37590000
*/*| ON INPUT TO THE PTRACE MACRO.  A RIGHT ARROW (->) INDICATES     */ 37620000
*/*| THE INDIRECT ADDRESSING USED TO OBTAIN THE DATA.                */ 37650000
*/*|                                                                 */ 37680000
*/*|                                                                 */ 37710000
*                                                                       37732500
*%TTELBR:                                                               37755000
*   IF TTEALL ^= 'YES'                                                  37777500
*      %THEN                                                            37800000
*     %IF TTEBR ^= 'YES' %THEN                                          37822500
*       %GO TO ENDBR;                                                   37845000
*                                                                       37867500
*/*|BR - BRANCH TTE                                                  */ 37890000
*/*|                                                                 */ 37920000
*/*|                                                                 */ 37950000
*/*|FORMATTED BR TTE(S):                                             */ 37980000
*/*|                                                                 */ 38010000
*/*|PR ASID TCB BR        PSW ADDR U1 U2 U3 CLHS LOCAL               */ 38040000
*/*|                                                                 */ 38070000
*                                                                       38100000
*   DECLARE                                                             38130000
*     TTETBR24 FIXED(8) CONSTANT(0), /* 24-BIT BRANCH TTE TYPE          38160000
*                                      (X'00').                      */ 38190000
*     1    TTEBRNCH DEFINED(TTE) BOUNDARY(WORD), /* BRANCH TRACE        38212500
*                                      TABLE ENTRY.                  */ 38235000
*       3    TTEBRA31 POINTER(31),  /* <MULTIPLE BRANCH ENTRIES CAN     38257500
*                                      APPEAR IN FIELDS PSW, ADDR,      38280000
*                                      U1, U2, U3, CLHS AND LOCAL>.     38310000
*                                      31-BIT ADDRESS.               */ 38340000
*         5    TTEBRTYP FIXED(8),   /* TRACE TABLE ENTRY TYPE (X'00':   38370000
*                                      24-BIT ADDRESS, X'80'-X'FF':     38400000
*                                      31-BIT ADDRESS).              */ 38430000
*           7    TTEBRMOD BIT(1),   /* ADDRESSING MODE INDICATOR. BIT   38460000
*                                      0. IF 1, BITS 1-31 CONTAIN       38490000
*                                      31-BIT ADDRESS. IF 0 AND BITS    38520000
*                                      1-7 ARE ZERO, BITS 8-31          38550000
*                                      CONTAIN 24-BIT ADDRESS.       */ 38580000
*         5    TTEBRA24 POINTER(24), /* <MULPTIPLE BRANCH ENTRIES CAN   38610000
*                                      APPEAR IN FIELDS PSW, ADDR,      38640000
*                                      U1, U2, U3, CLHS AND LOCAL>.     38670000
*                                      24-BIT ADDRESS.               */ 38700000
*       3    TTEBREND CHARACTER(0) BOUNDARY(WORD); /* END OF BRANCH     38720000
*                                      TTE.                          */ 38740000
*%ENDBR:                                                                38760000
*   IF TTEALL ^= 'YES'                                                  38790000
*      %THEN                                                            38820000
*     %IF TTEMO ^= 'YES' %THEN                                          38850000
*       %GO TO ENDMODE;                                                 38880000
*                                                                       38910000
*/*|TTE for Mode Switch, Mode-Switching Branch, and Branch to        */ 38912800
*/*|    an address larger than 31 bits.                              */ 38915600
*/*|                                                                 */ 38918400
*/*|Formatted TTEs:                                                  */ 38921200
*/*|                                                                 */ 38924000
*/*|PR ASID TCB MODE  ... 24 or 31 address                           */ 38926800
*/*|PR ASID TCB MODE  ... 64       address                           */ 38929600
*/*|PR ASID TCB MODE  ... 64       address_address                   */ 38932400
*/*|PR ASID TCB MOBR  ... 24       address                           */ 38935200
*/*|PR ASID TCB MOBR  ... 31       address                           */ 38938000
*/*|PR ASID TCB MOBR  ... 64       address                           */ 38940800
*/*|PR ASID TCB MOBR  ... 64       address_address                   */ 38943600
*/*|                                                                 */ 38946400
*                                                                       38949900
*   DECLARE                                                             38952600
*     TTETM51  FIXED(8) CONSTANT(81), /* TTE Type X'51'          @P3C*/ 38953500
*     TTETM52  FIXED(8) CONSTANT(82), /* TTE Type X'52'          @P3C*/ 38954400
*     TTEMSF1  BIT(8) CONSTANT('30'X), /* Format 1 Mode Switch   @P3C*/ 38955300
*     TTEMSF2  BIT(8) CONSTANT('20'X), /* Format 2 Mode Switch   @P3C*/ 38956200
*     TTEMSF3  BIT(8) CONSTANT('60'X), /* Format 3 Mode Switch   @P3C*/ 38957100
*     TTEMSBF1 BIT(8) CONSTANT('A0'X), /* Format 1 Mode-Switching       38958000
*                                      Branch                    @P3C*/ 38958900
*     TTEMSBF2 BIT(8) CONSTANT('B0'X), /* Format 2 Mode-Switching       38959800
*                                      Branch                    @P3C*/ 38960700
*     TTEMSBF3 BIT(8) CONSTANT('F0'X), /* Format 3 Mode-Switching       38961600
*                                      Branch                    @P3C*/ 38962500
*     TTEMBF3  BIT(8) CONSTANT('C0'X), /* Format 3 Branch        @P3C*/ 38963400
*     1    TTEM5152 DEFINED(TTE) BOUNDARY(WORD), /* Trace Table Entry   38964500
*                                      for type X'51' and X'52'  @P3C*/ 38965600
*       3    TTEM1TYP CHARACTER(1), /* X'51' or X'52 '           @P3C*/ 38966700
*       3    TTEMFMT  BIT(8),       /* Format indicator          @P3C*/ 38967900
*         5    *        BIT(4),     /* Format indicator          @P3C*/ 38969100
*         5    *        BIT(4),     /* 0'S                       @P3C*/ 38970300
*       3    *        BIT(16),      /* 0'S                       @L9A*/ 38971500
*       3    TTEMADRH POINTER(31),  /* 31 bit address, or high order    38976500
*                                      half of 64 bit address    @P3C*/ 38981500
*         5    TTEMAMD  BIT(1),     /* Amode in F1 Mode Switch and F1   38985800
*                                      Mode-Switching Branch     @P3C*/ 38990100
*       3    TTEMADRL POINTER(31),  /* Low order half of 64 bit         38994400
*                                      address                   @P3C*/ 38998700
*       3    TTEMOEND CHARACTER(0) BOUNDARY(WORD); /* END OF MODE       39003000
*                                      TTE.                      @P3C*/ 39007300
*%ENDMODE:                                                              39012000
*   IF TTEALL ^= 'YES'                                                  39014700
*      %THEN                                                            39017400
*     %IF TTEAS ^= 'YES' %THEN                                          39020100
*       %GO TO ENDAS;                                                   39022800
*                                                                       39025500
*/*|PC - PROGRAM CALL TTE                                            */ 39030000
*/*|                                                                 */ 39060000
*/*|                                                                 */ 39090000
*/*|FORMATTED PC TTE:                                                */ 39120000
*/*|                                                                 */ 39150000
*/*|PR ASID TCB PC    ... PSW ADDR U1                                */ 39180000
*/*|                                                                 */ 39210000
*                                                                       39228600
*   DECLARE                                                             39247200
*     TTETPC   FIXED(8) CONSTANT(33), /* PC TTE TYPE (X'21').        */ 39265800
*     1    TTEPC    DEFINED(TTE) BOUNDARY(WORD), /* PC TRACE TABLE      39278200
*                                      ENTRY.                        */ 39290600
*       3    TTEPCTYP FIXED(8),     /* PC TRACE TABLE ENTRY TYPE        39303000
*                                      (X'21').                      */ 39321600
*       3    TTEPCPKN CHARACTER(3), /* <PSW, U1>. <PSW> PSW KEY IN      39340200
*                                      BITS 0-3 AND <U1> PC NUMBER IN   39358800
*                                      BITS 4-23.                    */ 39377400
*         5    TTEPCPKY BIT(4),     /* PSW KEY.                      */ 39396000
*       3    TTEPCADR POINTER(31),  /* <ADDR>. RETURN ADDRESS FROM      39414600
*                                      THE PC INSTRUCTION.           */ 39433200
*         5    TTEPCAB1 BIT(8),     /* BYTE 1 OF ADDRESS.            */ 39451800
*           7    TTEPCAMD BIT(1),   /* OLD ADDRESSING MODE BIT FROM     39470400
*                                      PSW BEFORE THE PC INSTRUCTION.   39489000
*                                      BIT 0.                        */ 39507600
*         5    *        CHARACTER(2), /* BYTES 2 AND 3 OF ADDRESS.   */ 39526200
*         5    TTEPCAB4 BIT(8),     /* BYTE 4 OF ADDRESS.            */ 39544800
*           7    *        BIT(7),   /* RESERVED.                     */ 39563400
*           7    TTEPCPS  BIT(1),   /* PROBLEM STATE BIT BEFORE THE     39582000
*                                      PC INSTRUCTION. BIT 31.       */ 39600600
*       3    TTEPCEND CHARACTER(0) BOUNDARY(WORD), /* END OF PC TTE. */ 39619200
*     TTETPC64 FIXED(8) CONSTANT(34), /* PC64 TTE TYPE (X'22').  @L9A*/ 39637800
*     1    TTEPC64  DEFINED(TTE) BOUNDARY(WORD), /* PC64 TRACE TABLE    39656400
*                                      ENTRY.                    @L9A*/ 39675000
*       3    TTEP6TYP FIXED(8),     /* PC64 TRACE TABLE ENTRY TYPE      39693600
*                                      (X'21').                  @L9A*/ 39712200
*       3    TTEP6PKN CHARACTER(3), /* <PSW, U1>. <PSW> PSW KEY IN      39730800
*                                      BITS 0-3 AND <U1> PC NUMBER IN   39749400
*                                      BITS 4-23.                @L9A*/ 39768000
*         5    TTEP6PKY BIT(4),     /* PSW KEY.                  @L9A*/ 39786600
*       3    TTEP6ADL POINTER(32),  /* <ADDR> Left half address  @P3A*/ 39805200
*       3    TTEP6ADR POINTER(32),  /* <ADDR>. RETURN ADDRESS FROM      39823800
*                                      THE PC INSTRUCTION.       @L9A*/ 39842400
*         5    TTEP6AB1 BIT(8),     /* BYTE 1 OF ADDRESS.        @L9A*/ 39861000
*         5    *        CHARACTER(2), /* BYTES 2 AND 3 OF ADDRESS.   */ 39879600
*         5    TTEP6AB4 BIT(8),     /* BYTE 4 OF ADDRESS.        @L9A*/ 39898200
*           7    *        BIT(7),   /* RESERVED.                 @L9A*/ 39916800
*           7    TTEP6PS  BIT(1),   /* PROBLEM STATE BIT BEFORE THE     39935400
*                                      PC INSTRUCTION. BIT 31.       */ 39954000
*       3    TTEP6END CHARACTER(0) BOUNDARY(WORD); /* END OF PC64       39966700
*                                      TTE.                      @L9A*/ 39979400
*                                                                       39992300
*/*|PR - PROGRAM RETURN TTE                                          */ 39992500
*/*|                                                                 */ 39992600
*/*|                                                                 */ 39992700
*/*|FORMATTED PR TTE:                                                */ 39992800
*/*|                                                                 */ 39993000
*/*|PR ASID TCB PR    ... PSW ADDR U1                  PASD SASD     */ 39993600
*/*|                                                                 */ 39994200
*                                                                       39994900
*   DECLARE                                                             39995600
*     TTETPR   FIXED(8) CONSTANT(50), /* PR TTE TYPE (X'32').    @L2A*/ 39996300
*     TTEPRL   CONSTANT(12),        /* Length for type X'32'     @P4A*/ 39996400
*     TTETPR2  FIXED(8) CONSTANT(51), /* PR TTE TYPE (X'33').    @P3A*/ 39996500
*     TTEPR2L  CONSTANT(16),        /* Length for type X'33'     @P4A*/ 39996600
*     TTETPR3  FIXED(8) CONSTANT(52), /* PR TTE TYPE (X'34').    @P3A*/ 39996700
*     TTEPR3L  CONSTANT(20),        /* Length for type X'34'     @P4A*/ 39996800
*     1    TTEPR    DEFINED(TTE) BOUNDARY(WORD), /* PR TRACE TABLE      39996900
*                                      ENTRY.                    @L2A*/ 39997000
*                                                                       39997100
*/*                                                                  */ 39997200
*/*    ------------------------------------------------------------- */ 39997400
*/*    All PR entries have an initial word having the same format    */ 39997600
*/*    ------------------------------------------------------------- */ 39997800
*/*                                                                  */ 39998000
*                                                                       39998100
*      2    TTEPRbase,              /* Common fields             @P4A*/ 39998200
*       3    TTEPRTYP FIXED(8),     /* PR TRACE TABLE ENTRY TYPE @L2A*/ 39998400
*       3    TTEPRPKY FIXED(8),     /* <PSW>. PSW KEY IN BITS 0-3.      39999100
*                                                                @L9C*/ 39999800
*        4    TTEPRKY  BIT(4),      /* PSW key                   @P4A*/ 40000100
*        4    TTEPRT   BIT(2),      /* To info                   @P4A*/ 40000400
*         5    TTEPR6M  BIT(1),     /* 64-bit mode               @P4A*/ 40000700
*         5    TTEPR6A  BIT(1),     /* 64-bits present in entry  @P4A*/ 40001000
*        4    TTEPRF   BIT(2) LIKE(TTEPRT), /* From info         @P4A*/ 40001300
*       3    TTEPRASD FIXED(16),    /* NEW ASID SPECIFIED BY THE PR     40001900
*                                      INSTRUCTION.              @L2A*/ 40002600
*                                                                       40002700
*/*                                                                  */ 40002800
*/*    ------------------------------------------------------------- */ 40002900
*/*    The remainder consists of two addresses that may be 31-bit    */ 40003000
*/*    or 64-bit addresses.  Addressing mode and problem state data  */ 40003100
*/*    also appears.                                                 */ 40003200
*/*    ------------------------------------------------------------- */ 40003300
*/*                                                                  */ 40003400
*                                                                       40003500
*      2    *        UNION BOUNDARY(WORD), /* 31/64-bit initial         40003600
*                                      address                   @P4A*/ 40003700
*                                                                       40003800
*/*                                                                  */ 40003900
*/*     ------------------------------------------------------------ */ 40004000
*/*     The older PR entries start with 31-bit addresses             */ 40004100
*/*     ------------------------------------------------------------ */ 40004200
*/*                                                                  */ 40004300
*                                                                       40004400
*       3    TTEPRF31 BOUNDARY(WORD), /* Starts with 31-bit addr @P4A*/ 40004500
*        4    TTEPRTAD POINTER(31), /* <ADDR>. NEW INSTRUCTION          40004600
*                                      ADDRESS AS UPDATED BY THE PR     40004700
*                                      INSTRUCTION.              @P4C*/ 40004800
*         5    TTEPRTB1 BIT(8),     /* BYTE 1 OF ADDRESS.        @L2A*/ 40005400
*           7    TTEPRAM1 BIT(1),   /* ADDRESSING MODE BIT FROM THE     40006100
*                                      PSW AS UPDATED BY THE PR         40006800
*                                      INSTRUCTION. BIT 0.       @L2A*/ 40007500
*         5    *        CHARACTER(2), /* BYTES 2 AND 3 OF ADDRESS.      40007900
*                                                                @L2A*/ 40008300
*         5    TTEPRTB4 BIT(8),     /* BYTE 4 OF ADDRESS.        @L2A*/ 40008900
*           7    *        BIT(7),   /* RESERVED.                 @L2A*/ 40009600
*           7    TTEPRPS  BIT(1),   /* PROBLEM STATE BIT AFTER          40010300
*                                      COMPLETION OF THE PR             40011000
*                                      INSTRUCTION. BIT 31.      @L2A*/ 40011700
*                                                                       40011800
*/*                                                                  */ 40011900
*/*      ----------------------------------------------------------- */ 40012000
*/*      Either a 32-bit or a 64-bit address may appear after the    */ 40012100
*/*      64-bit address in the older PR entries.                     */ 40012200
*/*      ----------------------------------------------------------- */ 40012300
*/*                                                                  */ 40012400
*                                                                       40012500
*        4    *        UNION BOUNDARY(WORD), /* 31/64-bit final         40012600
*                                      address                   @P4A*/ 40012700
*         5    TTEPRFAD POINTER(31), /* <U1>. ADDRESS OF THE LOCATION   40012800
*                                      FOLLOWING TH PR INSTRUCTION.     40013100
*                                                                @P4C*/ 40013200
*         5    TTEPRFA6 CHARACTER(8), /* <U1>. ADDRESS OF THE           40013300
*                                      LOCATION FOLLOWING TH PR         40013400
*                                      INSTRUCTION.              @P4C*/ 40013500
*                                                                       40013600
*/*                                                                  */ 40013700
*/*     ------------------------------------------------------------ */ 40013800
*/*     The newer PR entries start with 64-bit addresses.            */ 40013900
*/*     ------------------------------------------------------------ */ 40014000
*/*                                                                  */ 40014100
*                                                                       40014200
*       3    TTEPRF64 BOUNDARY(WORD), /* Starts with 64-bit addr @P4A*/ 40014300
*        4    TTEPRTA6 CHARACTER(8), /* <ADDR>. NEW INSTRUCTION         40014400
*                                      ADDRESS AS UPDATED BY THE PR     40014500
*                                      INSTRUCTION.              @P4C*/ 40014600
*         5    *        CHARACTER(7), /* BYTES 2 AND 3 OF ADDRESS.      40014700
*                                                                @L2A*/ 40014800
*         5    TTEPRTB8 BIT(8),     /* BYTE 4 OF ADDRESS.        @L2A*/ 40014900
*           7    *        BIT(7),   /* RESERVED.                 @L2A*/ 40015000
*           7    TTEPRPS8 BIT(1),   /* PROBLEM STATE BIT AFTER          40015100
*                                      COMPLETION OF THE PR             40015200
*                                      INSTRUCTION. BIT 31.      @L2A*/ 40015300
*                                                                       40015400
*/*                                                                  */ 40015500
*/*      ----------------------------------------------------------- */ 40015600
*/*      Either a 32-bit or a 64-bit address may appear after the    */ 40015700
*/*      64-bit address in the newer PR entries.                     */ 40015800
*/*      ----------------------------------------------------------- */ 40015900
*/*                                                                  */ 40016000
*                                                                       40016100
*        4    *        UNION BOUNDARY(WORD), /* 31/64-bit final         40016200
*                                      address                   @P4A*/ 40016300
*         5    TTEPRFA6 POINTER(31), /* <U1>. ADDRESS OF THE LOCATION   40016400
*                                      FOLLOWING TH PR INSTRUCTION.     40016500
*                                                                @P4C*/ 40016600
*         5    TTEPRF66 CHARACTER(8), /* <U1>. ADDRESS OF THE           40016700
*                                      LOCATION FOLLOWING TH PR         40016800
*                                      INSTRUCTION.              @P4C*/ 40016900
*       3    TTEPREND CHARACTER(0) BOUNDARY(WORD); /* END OF PR TTE.    40017000
*                                                                @L2A*/ 40017100
*                                                                       40017200
*/*|PT - PROGRAM TRANSFER TTE                                        */ 40020000
*/*|                                                                 */ 40050000
*/*|                                                                 */ 40080000
*/*|FORMATTED PT TTE:                                                */ 40110000
*/*|                                                                 */ 40140000
*/*|PR ASID TCB PT    ... PSW ADDR U1                  PASD SASD     */ 40170000
*/*|                                                                 */ 40200000
*                                                                       40229400
*   DECLARE                                                             40258800
*     TTETPT   FIXED(8) CONSTANT(49), /* PT TTE TYPE (X'31').        */ 40288200
*                                                                       40291400
*/*   -------------------------------------------------------------- */ 40294600
*/*   TTETPT2  FIXED(8) CONSTANT(50), ** PT TTE TYPE (X'32').        */ 40297800
*/*   Note: Entry type 32x is used for both PC and PT.  System trace */ 40301000
*/*         code sensitive to this byte initially considers the      */ 40304200
*/*         entry type as a PC entry type, correcting matters later. */ 40307400
*/*   -------------------------------------------------------------- */ 40310600
*                                                                       40313800
*     1    TTEPT    DEFINED(TTE) BOUNDARY(WORD), /* PT TRACE TABLE      40324800
*                                      ENTRY.                        */ 40335800
*       3    TTEPTTYP FIXED(8),     /* PT TRACE TABLE ENTRY TYPE        40347000
*                                      (X'31').                      */ 40376400
*       3    TTEPTPKY FIXED(8),     /* <PSW>. PSW KEY IN BITS 0-3.      40405800
*                                                                @L9C*/ 40435800
*        4    TTEPTKY  BIT(4),      /* PSW key                   @P4A*/ 40450800
*        4    TTEPTT   BIT(2),      /* To info                   @P4A*/ 40465800
*         5    TTEPT6M  BIT(1),     /* 64-bit mode               @P4A*/ 40480800
*         5    TTEPT6A  BIT(1),     /* 64-bits present in entry  @P4A*/ 40495800
*        4    *        BIT(2),      /* 00                        @P4A*/ 40510800
*       3    TTEPTASD FIXED(16),    /* <U1, PASD AND SASD>. NEW ASID    40526200
*                                      SPECIFIED BY THE PT              40556400
*                                      INSTRUCTION.                  */ 40586600
*       3    TTEPTADR POINTER(31),  /* <ADDR>. NEW INSTRUCTION          40616800
*                                      ADDRESS AS UPDATED BY THE PT     40647000
*                                      INSTRUCTION.                  */ 40677200
*         5    TTEPTAB1 BIT(8),     /* BYTE 1 OF ADDRESS.            */ 40707400
*           7    TTEPTAMD BIT(1),   /* ADDRESSING MODE BIT FROM THE     40737600
*                                      PSW AS UPDATED BY THE PT         40767800
*                                      INSTRUCTION. BIT 0.           */ 40798000
*         5    *        CHARACTER(2), /* BYTES 2 AND 3 OF ADDRESS.   */ 40828200
*         5    TTEPTAB4 BIT(8),     /* BYTE 4 OF ADDRESS.            */ 40858400
*           7    *        BIT(7),                                       40888600
*           7    TTEPTPS  BIT(1),   /* PROBLEM STATE BIT AFTER          40918800
*                                      COMPLETION OF THE PT             40949000
*                                      INSTRUCTION. BIT 31.          */ 40979200
*       3    TTEPTEND CHARACTER(0) BOUNDARY(WORD); /* END OF PT TTE. */ 41009600
*                                                                       41040000
*/*|SSAR - SET SECONDARY ASN TTE                                     */ 41100000
*/*|                                                                 */ 41130000
*/*|                                                                 */ 41160000
*/*|FORMATTED SSAR TTE:                                              */ 41190000
*/*|                                                                 */ 41220000
*/*|PR ASID TCB SSAR  ... PSW                               SASD     */ 41250000
*/*|                                                                 */ 41280000
*                                                                       41307600
*   DECLARE                                                             41335200
*     TTETSSAR FIXED(8) CONSTANT(16), /* SSAR TTE TYPE (X'10').      */ 41362800
*     1    TTESSAR  DEFINED(TTE) BOUNDARY(WORD), /* SSAR TRACE TABLE    41381200
*                                      ENTRY.                        */ 41399600
*       3    TTESSTYP FIXED(8),     /* SSAR TRACE TABLE ENTRY TYPE      41418000
*                                      (X'10').                      */ 41445600
*       3    TTESSRSV BIT(8),       /* RESERVED.                     */ 41473200
*       3    TTESSASD FIXED(16),    /* <PSW AND SASD>. NEW SASID FROM   41500800
*                                      SSAR INSTRUCTION.             */ 41528400
*       3    TTESSEND CHARACTER(0) BOUNDARY(WORD); /* END OF SSAR       41546800
*                                      TTE.                          */ 41565200
*                                                                       41583600
*/*|BSG  - BRANCH IN SUBSPACE GROUP                              @L7A*/ 41598300
*/*|                                                                 */ 41613000
*/*|                                                                 */ 41614000
*/*|FORMATTED BSG TTE:                                               */ 41615000
*/*|                                                                 */ 41616000
*/*|PR ASID TCB BSG   ... PSW ADDR                                   */ 41617000
*/*|                                                                 */ 41618000
*                                                                       41619300
*   DECLARE                                                             41620600
*     TTETBSG  FIXED(8) CONSTANT(65), /* BSG TTE TYPE (X'41').   @L7A*/ 41621900
*     1    TTEBSG   DEFINED(TTE) BOUNDARY(WORD), /* BSG TRACE TABLE     41623200
*                                      ENTRY.                    @L7A*/ 41624500
*       3    TTEBSTYP FIXED(8),     /* BSG TRACE TABLE ENTRY (X'41').   41625800
*                                                                @L7A*/ 41627100
*       3    TTEBSALT CHARACTER(3), /* <PSW>. BITS 7 AND 9-31 OF THE    41628400
*                                      ALET USED DURING THE BSG         41629700
*                                      EXECUTION.                @L7A*/ 41631000
*         5    TTEBSAP  BIT(1),     /* BIT 7 OF THE ALET USED DURING    41632300
*                                      THE BSG EXECUTION (PASN-AL       41633600
*                                      INDICATOR).               @L7A*/ 41634900
*       3    TTEBSADR POINTER(31),  /* <ADDR>. THE AMODE AND BITS       41636200
*                                      1-31 OF THE INSTRUCTION          41637500
*                                      ADDRESS USED AS THE TARGET       41638800
*                                      LOCATION OF THE BSG.      @L7A*/ 41640100
*         5    TTEBSMOD BIT(1),     /* IF THIS BIT IS ON AMODE IS 31    41641400
*                                      OTHERWISE IT IS AMODE 24. @L7A*/ 41642700
*       3    TTEBSEND CHARACTER(0) BOUNDARY(WORD), /* END OF BSG TTE.   41643500
*                                                                @L7A*/ 41644300
*     TTETBS64 FIXED(8) CONSTANT(66), /* BGS64 TTE TYPE (X'42'). @L9A*/ 41645300
*     1    TTEBSG64 DEFINED(TTE) BOUNDARY(WORD), /* BSG64 TRACE TABLE   41646600
*                                      ENTRY.                    @L9A*/ 41647900
*       3    TTEB6TYP FIXED(8),     /* BSG TRACE TABLE ENTRY (X'42').   41649200
*                                                                @L9A*/ 41650500
*       3    TTEB6ALT CHARACTER(3), /* <PSW>. BITS 7 AND 9-31 OF THE    41651800
*                                      ALET USED DURING THE BSG         41653100
*                                      EXECUTION.                @L9A*/ 41654400
*         5    TTEB6AP  BIT(1),     /* BIT 7 OF THE ALET USED DURING    41655700
*                                      THE BSG EXECUTION (PASN-AL       41657000
*                                      INDICATOR).               @L9A*/ 41658300
*       3    *        POINTER(31),  /* ZEROES                    @L9A*/ 41659600
*       3    TTEB6ADR POINTER(31),  /* <ADDR>. BITS 1-31 OF THE         41660900
*                                      INSTRUCTION ADDRESS USED AS      41662200
*                                      THE TARGET LOCATION OF THE       41663500
*                                      BSG.                      @L9A*/ 41664800
*       3    TTEB6END CHARACTER(0) BOUNDARY(WORD); /* END OF BSG64      41665600
*                                      TTE.                      @L9A*/ 41666400
*%ENDAS:                                                                41667400
*   ;                                                                   41668700
*                                                                       41670000
*/*|GENERAL EXPLICIT TTE                                             */ 41760000
*/*|                                                                 */ 41790000
*/*|                                                                 */ 41820000
*/*|GENERAL FORMAT FOR AN EXPLICIT TTE:                              */ 41850000
*/*|                                                                 */ 41880000
*/*|PR ASID TCB ID   CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 41910000
*/*|                               U4 U5 U6                          */ 41940000
*                                                                       41970700
*   DECLARE                                                             42001400
*     TTETEX   FIXED(8) CONSTANT(112), /* EXPLICIT TTE TYPE (X'7N'). */ 42032100
*     TTEMEX   FIXED(8) CONSTANT(240), /* MASK FOR EXPLICIT TTE TYPE.   42062800
*                                      (X'F0').                      */ 42093500
*     TTEMSID  FIXED(8) CONSTANT(15), /* MASK FOR EXPLICIT TTE          42124200
*                                      SUB-ID. (X'0F').              */ 42154900
*     1    TTEXP    DEFINED(TTE) BOUNDARY(WORD), /* EXPLICIT TRACE      42185600
*                                      TABLE ENTRY.                  */ 42216300
*       3    TTETYPE  BIT(8),       /* TRACE TABLE ENTRY TYPE           42247000
*                                      (X'7N').                      */ 42277700
*         5    *        BIT(4),     /* (ALWAYS X'7' FOR EXPLICITS)   */ 42308400
*         5    TTEREGS  BIT(4),     /* ONE LESS THAN THE NUMBER OF      42339100
*                                      REGISTERS IN THE TTE.         */ 42369800
*       3    TTEMBZ1  FIXED(8),     /* RESERVED. (MUST BE ZERO)      */ 42400500
*       3    TTETOD   BIT(48),      /* <TIME(3:8)>. TOD-CLOCK BITS      42431200
*                                      16-63.                        */ 42461900
*       3    TTETOTE  BIT(32) BOUNDARY(WORD), /* TRACE OPERAND TABLE    42492600
*                                      ENTRY.                        */ 42523300
*         5    *        BIT(16),    /* FLAG BYTES.                   */ 42554000
*         5    TTEXPTYP FIXED(16),  /* <ID>. EXPLICIT ENTRY TYPE.    */ 42584700
*           7    TTEXPSID FIXED(8), /* EXPLICIT ENTRY SUB-ID.        */ 42615400
*           7    TTEXPID  FIXED(8), /* EXPLICIT ENTRY ID.            */ 42646100
*       3    TTEUNQ   CHARACTER(*) BOUNDARY(WORD), /* UNIQUE ENTRY      42676800
*                                      DESCRIPTIONS.                 */ 42707500
*     1    TTEEXCOM DEFINED(TTEUNQ), /* EXPLICIT ENTRY COMMON FIELD     42738200
*                                      NAMES.                        */ 42768900
*       3    TTEWRD0  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 0.    */ 42799600
*         5    TTETCB   POINTER(31), /* <TCB>. TCB ADDRESS.          */ 42830300
*       3    TTEWRD1  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 1.    */ 42861000
*         5    TTEDEP   FIXED(16),  /* DEPENDENT ON EACH EXPLICIT TTE   42891700
*                                      ENTRY.                        */ 42922400
*         5    TTEASID  FIXED(16),  /* ASID.                         */ 42953100
*       3    TTEWRD2  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 2.    */ 42983800
*       3    TTEWRD3  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 3.    */ 43014500
*       3    TTEWRD4  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 4.    */ 43045200
*       3    TTEWRD5  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 5.    */ 43075900
*       3    TTEWRD6  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 6.    */ 43106600
*       3    TTEWRD7  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 7.    */ 43137300
*       3    TTEWRD8  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 8.    */ 43168000
*       3    TTEWRD9  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 9.    */ 43198700
*       3    TTEWRDA  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 10.   */ 43229400
*       3    TTEWRDB  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 11.   */ 43260100
*       3    TTEWRDC  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 12.   */ 43290800
*       3    TTEWRDD  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 13.   */ 43321500
*       3    TTEWRDE  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 14.   */ 43352200
*       3    TTEWRDF  CHARACTER(4) BOUNDARY(WORD), /* TTE WORD 15.   */ 43382900
*       3    TTEXPEND CHARACTER(0) BOUNDARY(WORD), /* END OF MAXIMUM    43413600
*                                      EXPLICIT TTE.                 */ 43444300
*     TTETMAX  FIXED(16) CONSTANT(76), /* MAXIMUM LENGTH OF EXPLICIT    43475000
*                                      ENTRIES.                      */ 43505700
*     TTEMTSCH FIXED(16) CONSTANT(1), /* SUBCHANNEL TYPE MAJOR ID       43536400
*                                      (X'001').                     */ 43567100
*     TTEMTEXT FIXED(16) CONSTANT(3), /* EXTERNAL INTERRUPT TYPE        43597800
*                                      MAJOR ID (X'003').            */ 43628500
*     TTEMTSVC FIXED(16) CONSTANT(5), /* SVC TYPE MAJOR ID (X'005'). */ 43659200
*     TTEMTDSP FIXED(16) CONSTANT(15), /* DISPATCHER TYPE MAJOR ID      43689900
*                                      (X'00F').                     */ 43720600
*     TTETSSCH FIXED(16) CONSTANT(1), /* SSCH TYPE ID (X'001').      */ 43751300
*     TTETEXT  FIXED(16) CONSTANT(3), /* GENERAL EXT TYPE ID            43782000
*                                      (X'003').                     */ 43812700
*     TTETSVC  FIXED(16) CONSTANT(5), /* SVC TYPE ID (X'005').       */ 43843400
*     TTETPGM  FIXED(16) CONSTANT(7), /* PGM TYPE ID (X'007').       */ 43874100
*     TTETSPER FIXED(16) CONSTANT(9), /* SPER TYPE ID (X'009').  @L1A*/ 43904800
*     TTETIO   FIXED(16) CONSTANT(11), /* IO TYPE ID (X'00B').       */ 43935500
*     TTETDSP  FIXED(16) CONSTANT(15), /* DSP TYPE ID (X'00F').      */ 43966200
*     TTETMCH  FIXED(16) CONSTANT(19), /* MCH TYPE ID (X'013').      */ 43996900
*     TTETRST  FIXED(16) CONSTANT(21), /* RST TYPE ID (X'015').      */ 44027600
*     TTETACR  FIXED(16) CONSTANT(23), /* ACR TYPE ID (X'017').      */ 44058300
*     TTETSUSP FIXED(16) CONSTANT(25), /* SUSP TYPE ID (X'019').     */ 44089000
*     TTETALTR FIXED(16) CONSTANT(27), /* ALTR TYPE ID (X'01B').     */ 44119700
*     TTETRCVY FIXED(16) CONSTANT(29), /* RCVY TYPE ID (X'01D'). @L3A*/ 44150400
*     TTETTIME FIXED(16) CONSTANT(31), /* TIME TYPE ID (X'01F'). @L5A*/ 44181100
*     TTETUSR0 FIXED(16) CONSTANT(127), /* USR0 TYPE ID (X'07F').    */ 44211800
*     TTETMSCH FIXED(16) CONSTANT(257), /* MSCH TYPE ID (X'101').    */ 44242500
*     TTETEMS  FIXED(16) CONSTANT(259), /* EMS EXT TYPE ID (X'103'). */ 44273200
*     TTETSVCR FIXED(16) CONSTANT(261), /* SVCR TYPE ID (X'105').    */ 44303900
*     TTETSRB  FIXED(16) CONSTANT(271), /* SRB TYPE ID (X'10F').     */ 44334600
*     TTETUSR1 FIXED(16) CONSTANT(383), /* USR1 TYPE ID (X'17F').    */ 44365300
*     TTETHSCH FIXED(16) CONSTANT(513), /* HSCH TYPE ID (X'201').    */ 44396000
*     TTETSS   FIXED(16) CONSTANT(515), /* SS EXT TYPE ID (X'203').  */ 44426700
*     TTETSSRV FIXED(16) CONSTANT(517), /* SSRV TYPE ID (X'205').       44457400
*                                                                @L2A*/ 44488100
*     TTETSSRB FIXED(16) CONSTANT(527), /* SSRB TYPE ID (X'20F').    */ 44518800
*     TTETUSR2 FIXED(16) CONSTANT(639), /* USR2 TYPE ID (X'27F').    */ 44549500
*     TTETCSCH FIXED(16) CONSTANT(769), /* CSCH TYPE ID (X'301').    */ 44580200
*     TTETCALL FIXED(16) CONSTANT(771), /* EXTERNAL CALL EXT TYPE ID    44610900
*                                      (X'303').                     */ 44641600
*     TTETUSR3 FIXED(16) CONSTANT(895), /* USR3 TYPE ID (X'37F').    */ 44672300
*     TTETRSCH FIXED(16) CONSTANT(1025), /* RSCH TYPE ID (X'401').   */ 44703000
*     TTETCLKC FIXED(16) CONSTANT(1027), /* CLOCK COMPARATOR EXT TYPE   44733700
*                                      ID (X'403').                  */ 44764400
*     TTETUSR4 FIXED(16) CONSTANT(1151), /* USR4 TYPE ID (X'47F').   */ 44795100
*     TTETSIGA FIXED(16) CONSTANT(1281), /* SIGA TYPE ID (X'501').      44805300
*                                                                @01A*/ 44815500
*     TTETUSR5 FIXED(16) CONSTANT(1407), /* USR5 TYPE ID (X'57F').   */ 44825800
*     TTETUSR6 FIXED(16) CONSTANT(1663), /* USR6 TYPE ID (X'67F').   */ 44856500
*     TTETUSR7 FIXED(16) CONSTANT(1919), /* USR7 TYPE ID (X'77F').   */ 44887200
*     TTETUSR8 FIXED(16) CONSTANT(2175), /* USR8 TYPE ID (X'87F').   */ 44917900
*     TTETUSR9 FIXED(16) CONSTANT(2431), /* USR9 TYPE ID (X'97F').   */ 44948600
*     TTETUSRA FIXED(16) CONSTANT(2687), /* USRA TYPE ID (X'A7F').   */ 44979300
*     TTETUSRB FIXED(16) CONSTANT(2943), /* USRB TYPE ID (X'B7F').   */ 45010000
*     TTETUSRC FIXED(16) CONSTANT(3199), /* USRC TYPE ID (X'C7F').   */ 45040700
*     TTETUSRD FIXED(16) CONSTANT(3455), /* USRD TYPE ID (X'D7F').   */ 45071400
*     TTETUSRE FIXED(16) CONSTANT(3711), /* USRE TYPE ID (X'E7F').   */ 45102100
*     TTETSVCE FIXED(16) CONSTANT(3845), /* SVC ERROR TYPE ID           45132800
*                                      (X'F05').                     */ 45163500
*     TTETWAIT FIXED(16) CONSTANT(3855), /* WAIT TYPE ID (X'F0F').   */ 45194200
*     TTETUSRF FIXED(16) CONSTANT(3967); /* USRE TYPE ID (X'F7F').   */ 45224900
*   %IF TTEALL ^= 'YES' %THEN                                           45255600
*     %IF TTEEX ^= 'YES' %THEN                                          45286300
*       %IF TTEACR ^= 'YES' %THEN                                       45317000
*         %GO TO ENDACR;                                                45347700
*                                                                       45378400
*/*|ACR - ALTERNATE CPU RECOVERY TTE                                 */ 45409100
*/*|                                                                 */ 45450000
*/*|                                                                 */ 45480000
*/*|FORMATTED ACR TTE:                                               */ 45510000
*/*|                                                                 */ 45540000
*/*|PR ASID TCB ACR  CD/D          U1 U2 U3 CLHS LOCAL           TIME*/ 45570000
*/*|                               U4 U5    CLHSE                    */ 45600000
*                                                                       45636500
*   DECLARE                                                             45673000
*     1    TTE017   DEFINED(TTEUNQ), /* ACR (ACR).                   */ 45709500
*       3    TTE017TB POINTER(31),  /* <TCB>. PSATOLD FROM THE          45746000
*                                      FAILING PROCESSOR. FLCCVT->      45782500
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   45819000
*                                      PCCAPSAV-> PSATOLD.           */ 45855500
*       3    TTE017LP FIXED(16),    /* <CD/D>. PSACPUPA. LOGICAL        45892000
*                                      PROCESSOR ADDRESS. FLCCVT->      45928500
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   45965000
*                                      PCCAPSAV-> PSACPUPA.          */ 46001500
*       3    TTE017HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE       46038000
*                                      FROM THE FAILING PROCESSOR.      46074500
*                                      FLCCVT-> CVTPCCAT->              46111000
*                                      PCCAT00P(PSASPAD)-> PCCAPSAV->   46147500
*                                      PSAAOLD-> ASCBASID.           */ 46184000
*       3    TTE017AD POINTER(31),  /* <U1>. PSAEEPSW FROM THE ACR      46220500
*                                      PROCESSOR. FAILING PROCESSOR     46257000
*                                      ADDRESS. PSAEEPSW.            */ 46293500
*       3    TTE017FG BIT(8),       /* <U2>. LCCACREX. ACR FLAG BYTE    46330000
*                                      FROM THE FAILING PROCESSOR.      46366500
*                                      FLCCVT-> CVTPCCAT->              46403000
*                                      PCCAT00P(PSASPAD)-> PCCAPSAV->   46439500
*                                      PSALCCAV-> LCCACREX.          */ 46476000
*       3    TTE017R1 CHARACTER(3), /* RESERVED.                     */ 46512500
*       3    TTE017FR POINTER(31),  /* <U3>. PSACSTK. CURRENT FRR       46549000
*                                      STACK ADDRESS FROM THE FAILING   46585500
*                                      PROCESSOR. FLCCVT-> CVTPCCAT->   46622000
*                                      PCCAT00P(PSASPAD)-> PCCAPSAV->   46658500
*                                      PSACSTK.                      */ 46695000
*       3    TTE017PS FIXED(32),    /* <U4>. PSASUPER FROM THE          46731500
*                                      FAILING PROCESSOR. FLCCVT->      46768000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   46804500
*                                      PCCAPSAV-> PSASUPER.          */ 46841000
*       3    TTE017MW FIXED(32),    /* <U5>. PSAMODEW FROM THE          46877500
*                                      FAILING PROCESSOR. FLCCVT->      46914000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   46950500
*                                      PCCAPSAV-> PSAMODEW.          */ 46987000
*       3    TTE017LH FIXED(32),    /* <CLHS> PSACLHS FROM THE          47023500
*                                      FAILING PROCESSOR. FLCCVT->      47060000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   47096500
*                                      PCCAPSAV-> PSACLHS.           */ 47133000
*       3    TTE017PL POINTER(31),  /* <LOCAL>. PSALOCAL FROM THE       47169500
*                                      FAILING PROCESSOR. FLCCVT->      47206000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   47242500
*                                      PCCAPSAV-> PSALOCAL.          */ 47279000
*       3    TTE017LE FIXED(32),    /* <CLHSE> PSACLHSE FROM THE        47315500
*                                      FAILING PROCESSOR. FLCCVT->      47352000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   47388500
*                                      PCCAPSAV-> PSACLHSE.      @L4A*/ 47425000
*       3    TTE017ED CHARACTER(0) BOUNDARY(WORD); /* END OF ACR TTE.*/ 47461500
*%ENDACR:                                                               47498000
*   IF TTEALL ^= 'YES'                                                  47534500
*      %THEN                                                            47571000
*     %IF TTEEX ^= 'YES' %THEN                                          47607500
*       %IF TTEALTR ^= 'YES' %THEN                                      47644000
*         %GO TO ENDALTR;                                               47680500
*                                                                       47717000
*/*|ALTR - TRACE OPTIONS ALTERATION TTE                              */ 47753500
*/*|                                                                 */ 47790000
*/*|                                                                 */ 47820000
*/*|FORMATTED ALTR TTE:                                              */ 47850000
*/*|                                                                 */ 47880000
*/*|PR ASID TCB ALTR               U1 U2 U3            PASD SASD TIME*/ 47910000
*/*|                               U4                                */ 47940000
*                                                                       47975100
*   DECLARE                                                             48010200
*     1    TTE01B   DEFINED(TTEUNQ), /* TRACE OPTIONS ALTERATION        48045300
*                                      (ALTR).                       */ 48080400
*       3    TTE01BTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    48115500
*                                      0. PSATOLD.                   */ 48150600
*       3    TTE01BR1 FIXED(16),    /* RESERVED.                     */ 48185700
*       3    TTE01BHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      48220800
*                                      PSAAOLD-> ASCBASID.           */ 48255900
*       3    TTE01BPA FIXED(16),    /* <PASD>. PASID. CONTROL           48291000
*                                      REGISTER 4.                   */ 48326100
*       3    TTE01BSA FIXED(16),    /* <SASD>. SASID. CONTROL           48361200
*                                      REGISTER 3.                   */ 48396300
*       3    TTE01BFC FIXED(32),    /* <U2>. R0 TRACE FUNCTION CODE.    48431400
*                                      ALTRTRC INPUT. INPUT REGISTER    48466500
*                                      0.                            */ 48501600
*       3    TTE01BAC FIXED(32),    /* <U3>. R1 TRACE ACTION CODE.      48536700
*                                      ALTRTRC INPUT. INPUT REGISTER    48571800
*                                      1.                            */ 48606900
*       3    TTE01BPT FIXED(32),    /* <U1>. TOBTROPT - CONTROL         48642000
*                                      REGISTER 12 MODEL FORMAT.        48677100
*                                      PSATRVT-> TRVTTOB-> TOBTROPT. */ 48712200
*       3    TTE01BCT FIXED(16),    /* <U4(1:2)>. TOBTRPOL - NUMBER     48747300
*                                      OF PROCESSORS WITH TRACE         48782400
*                                      CURRENTLY ACTIVE AND/OR          48817500
*                                      SUSPENDED. PSATRVT-> TRVTTOB->   48852600
*                                      TOBTRPOL.                     */ 48887700
*       3    TTE01BBF FIXED(16),    /* <U4(3:4)>. TOBTRBUF - NUMBER     48922800
*                                      OF TRACE BUFFERS PER             48957900
*                                      PROCESSOR. PSATRVT-> TRVTTOB->   48993000
*                                      TOBTRBUF.                     */ 49028100
*       3    TTE01BED CHARACTER(0) BOUNDARY(WORD); /* END OF ALTR       49051500
*                                      TTE.                          */ 49074900
*%ENDALTR:                                                              49098300
*   IF TTEALL ^= 'YES'                                                  49133400
*      %THEN                                                            49168500
*     %IF TTEEX ^= 'YES' %THEN                                          49203600
*       %IF TTEEXT ^= 'YES' %THEN                                       49238700
*         %GO TO ENDCALL;                                               49273800
*                                                                       49308900
*/*|CALL - EXTERNAL CALL EXTERNAL INTERRUPT TTE                      */ 49344000
*/*|                                                                 */ 49380000
*/*|                                                                 */ 49410000
*/*|FORMATTED CALL TTE:                                              */ 49440000
*/*|                                                                 */ 49470000
*/*|PR ASID TCB CALL      PSW ADDR U1 U2    CLHS LOCAL PASD SASD TIME*/ 49500000
*/*|                                        CLHSE                    */ 49530000
*                                                                       49562500
*   DECLARE                                                             49595000
*     1    TTE303   DEFINED(TTEUNQ), /* EXTERNAL CALL EXTERNAL          49627500
*                                      INTERRUPT (CALL).             */ 49660000
*       3    TTE303TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    49692500
*                                      0. PSATOLD.                   */ 49725000
*       3    TTE303R1 FIXED(16),    /* RESERVED.                     */ 49757500
*       3    TTE303HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      49790000
*                                      PSAAOLD-> ASCBASID.           */ 49822500
*       3    TTE303PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    49855000
*                                      4.                            */ 49887500
*       3    TTE303SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    49920000
*                                      4.                            */ 49952500
*       3    TTE303PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>.       49985000
*                                      EXTERNAL OLD PSW. FLCEOPSW.   */ 50017500
*         5    TTE303P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 50050000
*         5    TTE303P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 50082500
*       3    TTE303CD POINTER(31),  /* <U1>. ISSUING PROCESSOR          50115000
*                                      ADDRESS AND EXTERNAL INTERRUPT   50147500
*                                      CODE. PSAEEPSW.               */ 50180000
*       3    TTE303PB FIXED(32),    /* <U2>. PCCARPB. PSAPCCAV->        50212500
*                                      PCCARPB.                      */ 50245000
*       3    TTE303LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 50277500
*       3    TTE303PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 50310000
*       3    TTE303LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 50342500
*       3    TTE303ED CHARACTER(0) BOUNDARY(WORD); /* END OF CALL       50364100
*                                      TTE.                          */ 50385700
*%ENDCALL:                                                              50407500
*   IF TTEALL ^= 'YES'                                                  50440000
*      %THEN                                                            50472500
*     %IF TTEEX ^= 'YES' %THEN                                          50505000
*       %IF TTEEXT ^= 'YES' %THEN                                       50537500
*         %GO TO ENDCLKC;                                               50570000
*                                                                       50602500
*/*|CLKC - CLOCK COMPARATOR EXTERNAL INTERRUPT TTE                   */ 50635000
*/*|                                                                 */ 50670000
*/*|                                                                 */ 50700000
*/*|FORMATTED CLKC TTE:                                              */ 50730000
*/*|                                                                 */ 50760000
*/*|PR ASID TCB CLKC      PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 50790000
*/*|                                        CLHSE                    */ 50820000
*                                                                       50853200
*   DECLARE                                                             50886400
*     1    TTE403   DEFINED(TTEUNQ), /* CLOCK COMPARATOR EXTERNAL       50919600
*                                      INTERRUPT (CLKC).             */ 50952800
*       3    TTE403TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    50986000
*                                      0. PSATOLD.                   */ 51019200
*       3    TTE403R1 FIXED(16),    /* RESERVED.                     */ 51052400
*       3    TTE403HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      51085600
*                                      PSAAOLD-> ASCBASID.           */ 51118800
*       3    TTE403PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    51152000
*                                      4.                            */ 51185200
*       3    TTE403SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    51218400
*                                      4.                            */ 51251600
*       3    TTE403PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>.       51284800
*                                      EXTERNAL OLD PSW. FLCEOPSW.   */ 51318000
*         5    TTE403P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 51351200
*         5    TTE403P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 51384400
*       3    TTE403CD FIXED(32),    /* <U1>. EXTERNAL INTERRUPT CODE.   51417600
*                                      PSAEEPSW.                     */ 51450800
*       3    TTE403TT POINTER(31),  /* <U2>. TQE TCB OR 0. PSAPCCAV->   51484000
*                                      PCCATQEP-> TQETCB.            */ 51517200
*       3    TTE403R2 FIXED(16),    /* RESERVED.                     */ 51550400
*       3    TTE403TA FIXED(16),    /* <U3>. TQE ASID OR 0.             51583600
*                                      PSAPCCAV-> PCCATQEP-> TQEAID. */ 51616800
*       3    TTE403LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 51650000
*       3    TTE403PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 51683200
*       3    TTE403LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 51716400
*       3    TTE403ED CHARACTER(0) BOUNDARY(WORD); /* END OF CLKC       51738500
*                                      TTE.                          */ 51760600
*%ENDCLKC:                                                              51782800
*   IF TTEALL ^= 'YES'                                                  51816000
*      %THEN                                                            51849200
*     %IF TTEEX ^= 'YES' %THEN                                          51882400
*       %IF TTESCH ^= 'YES' %THEN                                       51915600
*         %GO TO ENDCSCH;                                               51948800
*                                                                       51982000
*/*|CSCH - CLEAR SUBCHANNEL TTE                                      */ 52015200
*/*|                                                                 */ 52050000
*/*|                                                                 */ 52080000
*/*|FORMATTED CSCH TTE:                                              */ 52110000
*/*|                                                                 */ 52140000
*/*|PR ASID TCB CSCH CD/D PSW ADDR U1 U2 U3                      TIME*/ 52170000
*/*|                                                                 */ 52200000
*                                                                       52232100
*   DECLARE                                                             52264200
*     1    TTE301   DEFINED(TTEUNQ), /* CLEAR SUBCHANNEL (CSCH).     */ 52296300
*       3    TTE301TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     52328400
*                                      IOSBPTR(R2)-> IOSSRB->           52360500
*                                      SRBPTCB.                      */ 52392600
*       3    TTE301AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          52424700
*                                      IOSBPTR(R2)-> IOSASID.        */ 52456800
*       3    TTE301HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    52488900
*                                      ASCBASID.                     */ 52521000
*       3    TTE301CC FIXED(8),     /* <PSW(1:1)>. CONDITION CODE.      52553100
*                                      INPUT REGISTER 0.             */ 52585200
*       3    TTE301DI FIXED(8),     /* <PSW(3:3)>. DRIVER ID.           52617300
*                                      IOSBPTR(R2)-> IOSDVRID.       */ 52649400
*       3    TTE301DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           52681500
*                                      IOSBPTR(R2)-> IOSUCB->           52713600
*                                      UCBCHAN.                      */ 52745700
*       3    TTE301UB POINTER(31),  /* <U1>. UCB ADDRESS (COMMON        52777800
*                                      SEGMENT). ORBPTR(R3)-> WORD 1.*/ 52809900
*       3    TTE301IQ POINTER(31),  /* <U2>. IOQ ADDRESS.               52842000
*                                      ORBPTR(R3)-> WORD 2.          */ 52874100
*       3    TTE301AI POINTER(31),  /* <U3>. ADDRESS OF IOSB FOR        52906200
*                                      ASSOCIATED SSCH REQUEST (0 IF    52938300
*                                      NO ASSOCIATED REQUEST).          52970400
*                                      ORBPTR(R3)-> WORD 3.          */ 53002500
*       3    TTE301IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      53034600
*                                      REGISTER 2.                   */ 53066700
*       3    TTE301TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    53098800
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 53130900
*         5    TTE301T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 53163000
*         5    TTE301T2 CHARACTER(1), /* RESERVED.               @L8A*/ 53195100
*         5    TTE301T3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 53227200
*       3    TTE301ED CHARACTER(0) BOUNDARY(WORD); /* END OF CSCH       53248600
*                                      TTE.                          */ 53270000
*%ENDCSCH:                                                              53291400
*   IF TTEALL ^= 'YES'                                                  53323500
*      %THEN                                                            53355600
*     %IF TTEEX ^= 'YES' %THEN                                          53387700
*       %IF TTEDSP ^= 'YES' %THEN                                       53419800
*         %GO TO ENDDSP;                                                53451900
*                                                                       53484000
*/*|DSP - TASK DISPATCH TTE                                          */ 53516100
*/*|                                                                 */ 53550000
*/*|                                                                 */ 53580000
*/*|FORMATTED DSP TTE:                                               */ 53610000
*/*|                                                                 */ 53640000
*/*|PR ASID TCB DSP       PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 53670000
*/*|                                                                 */ 53700000
*                                                                       53735400
*   DECLARE                                                             53770800
*     1    TTE00F   DEFINED(TTEUNQ), /* TASK DISPATCH (DSP).         */ 53806200
*       3    TTE00FTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS.      53841600
*                                      PSATOLD.                      */ 53877000
*       3    TTE00FR1 FIXED(16),    /* RESERVED.                     */ 53912400
*       3    TTE00FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      53947800
*                                      PSAAOLD-> ASCBASID.           */ 53983200
*       3    TTE00FPA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    54018600
*                                      13.                           */ 54054000
*       3    TTE00FSA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    54089400
*                                      13.                           */ 54124800
*       3    TTE00FPW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>. PSW   54160200
*                                      TO BE DISPATCHED. PSAPSWSV.   */ 54195600
*         5    TTE00FP1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 54231000
*         5    TTE00FP2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 54266400
*       3    TTE00FG0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       54301800
*                                      INPUT REGISTER 0.             */ 54337200
*       3    TTE00FG1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       54372600
*                                      INPUT REGISTER 1.             */ 54408000
*       3    TTE00FMW FIXED(32),    /* <U1>. PSAMODEW.               */ 54443400
*       3    TTE00FLH FIXED(32),    /* <CLHS>. PSACLHS.              */ 54478800
*       3    TTE00FPL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 54514200
*       3    TTE00FED CHARACTER(0) BOUNDARY(WORD); /* END OF DSP TTE.*/ 54549600
*%ENDDSP:                                                               54585000
*   IF TTEALL ^= 'YES'                                                  54620400
*      %THEN                                                            54655800
*     %IF TTEEX ^= 'YES' %THEN                                          54691200
*       %IF TTEEXT ^= 'YES' %THEN                                       54726600
*         %GO TO ENDEMS;                                                54762000
*                                                                       54797400
*/*|EMS - EMERGENCY SIGNAL EXTERNAL INTERRUPT TTE                    */ 54832800
*/*|                                                                 */ 54870000
*/*|                                                                 */ 54900000
*/*|FORMATTED EMS TTE:                                               */ 54930000
*/*|                                                                 */ 54960000
*/*|PR ASID TCB EMS       PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 54990000
*/*|                               U4       CLHSE                    */ 55020000
*                                                                       55054300
*   DECLARE                                                             55088600
*     1    TTE103   DEFINED(TTEUNQ), /* EMS EXTERNAL INTERRUPT (EMS).*/ 55122900
*       3    TTE103TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    55157200
*                                      0. PSATOLD.                   */ 55191500
*       3    TTE103R1 FIXED(16),    /* RESERVED.                     */ 55225800
*       3    TTE103HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      55260100
*                                      PSAAOLD-> ASCBASID.           */ 55294400
*       3    TTE103PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    55328700
*                                      4.                            */ 55363000
*       3    TTE103SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    55397300
*                                      4.                            */ 55431600
*       3    TTE103PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>.       55465900
*                                      EXTERNAL OLD PSW. FLCEOPSW.   */ 55500200
*         5    TTE103P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 55534500
*         5    TTE103P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 55568800
*       3    TTE103CD POINTER(31),  /* <U1>. ISSUING PROCESSOR          55603100
*                                      ADDRESS AND EXTERNAL INTERRUPT   55637400
*                                      CODE. PSAEEPSW.               */ 55671700
*       3    TTE103SI FIXED(32),    /* <U2>. PCCAEMSI. FLCCVT->         55706000
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   55740300
*                                      PCCAEMSI.                     */ 55774600
*       3    TTE103SP POINTER(31),  /* <U3>. PCCAEMSP. FLCCVT->         55808900
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   55843200
*                                      PCCAEMSP.                     */ 55877500
*       3    TTE103SE POINTER(31),  /* <U4>. PCCAEMSE. FLCCVT->         55911800
*                                      CVTPCCAT-> PCCAT00P(PSASPAD)->   55946100
*                                      PCCAEMSE.                     */ 55980400
*       3    TTE103LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 56014700
*       3    TTE103PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 56049000
*       3    TTE103LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 56083300
*       3    TTE103ED CHARACTER(0) BOUNDARY(WORD); /* END OF EMS TTE.*/ 56117600
*%ENDEMS:                                                               56151900
*   IF TTEALL ^= 'YES'                                                  56186200
*      %THEN                                                            56220500
*     %IF TTEEX ^= 'YES' %THEN                                          56254800
*       %IF TTEEXT ^= 'YES' %THEN                                       56289100
*         %GO TO ENDEXT;                                                56323400
*                                                                       56357700
*/*|EXT - GENERAL EXTERNAL INTERRUPT TTE                             */ 56392000
*/*|                                                                 */ 56430000
*/*|                                                                 */ 56460000
*/*|FORMATTED EXT TTE:                                               */ 56490000
*/*|                                                                 */ 56520000
*/*|PR ASID TCB EXT  CD/D PSW ADDR U1       CLHS LOCAL PASD SASD TIME*/ 56550000
*/*|                                        CLHSE                    */ 56580000
*                                                                       56611900
*   DECLARE                                                             56643800
*     1    TTE003   DEFINED(TTEUNQ), /* EXTERNAL INTERRUPT (EXT).    */ 56675700
*       3    TTE003TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    56707600
*                                      0. PSATOLD.                   */ 56739500
*       3    TTE003R1 FIXED(16),    /* RESERVED.                     */ 56771400
*       3    TTE003HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      56803300
*                                      PSAAOLD-> ASCBASID.           */ 56835200
*       3    TTE003PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    56867100
*                                      4.                            */ 56899000
*       3    TTE003SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    56930900
*                                      4.                            */ 56962800
*       3    TTE003PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>.       56994700
*                                      EXTERNAL OLD PSW. FLCEOPSW.   */ 57026600
*         5    TTE003P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 57058500
*         5    TTE003P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 57090400
*       3    TTE003CD FIXED(32),    /* <CD/D AND U1>. EXTERNAL          57122300
*                                      INTERRUPT CODE. PSAEEPSW.     */ 57154200
*       3    TTE003LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 57186100
*       3    TTE003PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 57218000
*       3    TTE003LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 57249900
*       3    TTE003ED CHARACTER(0) BOUNDARY(WORD); /* END OF EXT TTE.*/ 57281800
*%ENDEXT:                                                               57313700
*   IF TTEALL ^= 'YES'                                                  57345600
*      %THEN                                                            57377500
*     %IF TTEEX ^= 'YES' %THEN                                          57409400
*       %IF TTESCH ^= 'YES' %THEN                                       57441300
*         %GO TO ENDHSCH;                                               57473200
*                                                                       57505100
*/*|HSCH - HALT SUBCHANNEL TTE                                       */ 57537000
*/*|                                                                 */ 57570000
*/*|                                                                 */ 57600000
*/*|FORMATTED HSCH TTE:                                              */ 57630000
*/*|                                                                 */ 57660000
*/*|PR ASID TCB HSCH CD/D PSW ADDR U1 U2 U3                      TIME*/ 57690000
*/*|                                                                 */ 57720000
*                                                                       57750700
*   DECLARE                                                             57781400
*     1    TTE201   DEFINED(TTEUNQ), /* HALT SUBCHANNEL (HSCH).      */ 57812100
*       3    TTE201TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     57842800
*                                      IOSBPTR(R2)-> IOSSRB->           57873500
*                                      SRBPTCB.                      */ 57904200
*       3    TTE201AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          57934900
*                                      IOSBPTR(R2)-> IOSASID.        */ 57965600
*       3    TTE201HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    57996300
*                                      ASCBASID.                     */ 58027000
*       3    TTE201CC FIXED(8),     /* <PSW(1:1)>. CONDITION CODE.      58057700
*                                      INPUT REGISTER 0.             */ 58088400
*       3    TTE201DI FIXED(8),     /* <PSW(3:3)>. DRIVER ID.           58119100
*                                      IOSBPTR(R2)-> IOSDVRID.       */ 58149800
*       3    TTE201DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           58180500
*                                      IOSBPTR(R2)-> IOSUCB->           58211200
*                                      UCBCHAN.                      */ 58241900
*       3    TTE201UB POINTER(31),  /* <U1>. UCB ADDRESS (COMMON        58272600
*                                      SEGMENT. ORBPTR(R3)-> WORD 1. */ 58303300
*       3    TTE201IQ POINTER(31),  /* <U2>. IOQ ADDRESS.               58334000
*                                      ORBPTR(R3)-> WORD 2.          */ 58364700
*       3    TTE201AI POINTER(31),  /* <U3>. ADDRESS OF IOSB FOR        58395400
*                                      ASSOCIATED SSCH REQUEST (0 IF    58426100
*                                      NO ASSOCIATED REQUEST).          58456800
*                                      ORBPTR(R3)-> WORD 3.          */ 58487500
*       3    TTE201IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      58518200
*                                      REGISTER 2.                   */ 58548900
*       3    TTE201TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    58579600
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 58610300
*         5    TTE201T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 58641000
*         5    TTE201T2 CHARACTER(1), /* RESERVED.               @L8A*/ 58671700
*         5    TTE201T3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 58702400
*       3    TTE201ED CHARACTER(0) BOUNDARY(WORD); /* END OF HSCH       58722800
*                                      TTE.                          */ 58743200
*%ENDHSCH:                                                              58763800
*   IF TTEALL ^= 'YES'                                                  58794500
*      %THEN                                                            58825200
*     %IF TTEEX ^= 'YES' %THEN                                          58855900
*       %IF TTEIO ^= 'YES' %THEN                                        58886600
*         %GO TO ENDIO;                                                 58917300
*                                                                       58948000
*/*|IO - I/O INTERRUPT TTE                                           */ 58978700
*/*|                                                                 */ 59010000
*/*|                                                                 */ 59040000
*/*|FORMATTED IO TTE:                                                */ 59070000
*/*|                                                                 */ 59100000
*/*|PR ASID TCB IO   CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 59130000
*/*|                               U4 U5    CLHSE                    */ 59160000
*                                                                       59192900
*   DECLARE                                                             59225800
*     1    TTE00B   DEFINED(TTEUNQ), /* I/O INTERRUPT (IO).          */ 59258700
*       3    TTE00BTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    59291600
*                                      0. PSATOLD.                   */ 59324500
*       3    TTE00BDN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           59357400
*                                      UCBPTR(R7)-> UCBCHAN.         */ 59390300
*       3    TTE00BHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      59423200
*                                      PSAAOLD-> ASCBASID.           */ 59456100
*       3    TTE00BPA FIXED(16),    /* <PASD>. PASID. CONTROL           59489000
*                                      REGISTER 4.                   */ 59521900
*       3    TTE00BSA FIXED(16),    /* <SASD>. SASID. CONTROL           59554800
*                                      REGISTER 3.                   */ 59587700
*       3    TTE00BPW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>. I/O   59620600
*                                      OLD PSW. FLCIOPSW.            */ 59653500
*         5    TTE00BP1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 59686400
*         5    TTE00BP2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 59719300
*       3    TTE00BFG FIXED(16),    /* <U1(1:2)>. IRBFLAGS.             59752200
*                                      IRBPTR(R3)-> WORD 1.          */ 59785100
*       3    TTE00BSC FIXED(16),    /* <U1(3:4)>. SUBCHANNEL CONTROL.   59818000
*                                      IRBPTR(R3)-> WORD 1.          */ 59850900
*       3    TTE00BCA POINTER(31),  /* <U2>. CCW ADDRESS.               59883800
*                                      IRBPTR(R3)-> WORD 2.          */ 59916700
*       3    TTE00BDS FIXED(8),     /* <U3(1:1)>. DEVICE STATUS.        59949600
*                                      IRBPTR(R3)-> WORD 3.          */ 59982500
*       3    TTE00BSS FIXED(8),     /* <U3(2:2)>. SUBCHANNEL STATUS.    60015400
*                                      IRBPTR(R3)-> WORD 3.          */ 60048300
*       3    TTE00BCT FIXED(16),    /* <U3(3:4)>. RESIDUAL COUNT.       60081200
*                                      IRBPTR(R3)-> WORD 3.          */ 60114100
*       3    TTE00BEW FIXED(32),    /* <U6>. EXTENDED STATUS WORD.      60147000
*                                      IRBPTR(R3)-> WORD 4.      @L8C*/ 60179900
*       3    TTE00BUB POINTER(31),  /* <U5>. UCB ADDRESS. INPUT         60212800
*                                      REGISTER 7.                   */ 60245700
*       3    TTE00BLH FIXED(32),    /* <CLHS>. PSACLHS.              */ 60278600
*       3    TTE00BPL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 60311500
*       3    TTE00BLE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 60344400
*       3    TTE00BTK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    60377300
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 60410200
*         5    TTE00BT1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 60443100
*         5    TTE00BT2 CHARACTER(1), /* RESERVED.               @L8A*/ 60476000
*         5    TTE00BT3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 60508900
*       3    TTE00BED CHARACTER(0) BOUNDARY(WORD); /* END OF IO TTE. */ 60541800
*%ENDIO:                                                                60574700
*   IF TTEALL ^= 'YES'                                                  60607600
*      %THEN                                                            60640500
*     %IF TTEEX ^= 'YES' %THEN                                          60673400
*       %IF TTEMCH ^= 'YES' %THEN                                       60706300
*         %GO TO ENDMCH;                                                60739200
*                                                                       60772100
*/*|MCH - MACHINE CHECK INTERRUPT TTE                                */ 60805000
*/*|                                                                 */ 60840000
*/*|                                                                 */ 60870000
*/*|FORMATTED MCH TTE:                                               */ 60900000
*/*|                                                                 */ 60930000
*/*|PR ASID TCB MCH       PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 60960000
*/*|                                        CLHSE                    */ 60990000
*                                                                       61024400
*   DECLARE                                                             61058800
*     1    TTE013   DEFINED(TTEUNQ), /* MACHINE CHECK INTERRUPT         61084600
*                                      (MCH).                        */ 61110400
*       3    TTE013TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    61136200
*                                      0. PSATOLD.                   */ 61162000
*       3    TTE013R1 FIXED(16),    /* RESERVED.                     */ 61196400
*       3    TTE013HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      61230800
*                                      PSAAOLD-> ASCBASID.           */ 61265200
*       3    TTE013PA FIXED(16),    /* <PASD>. PASID. CONTROL           61299600
*                                      REGISTER 4.                   */ 61334000
*       3    TTE013SA FIXED(16),    /* <SASD>. SASID. CONTROL           61368400
*                                      REGISTER 3.                   */ 61402800
*       3    TTE013PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>.       61430900
*                                      MACHINE CHECK OLD PSW.           61459000
*                                      FLCMOPSW.                     */ 61487100
*         5    TTE013P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 61515200
*         5    TTE013P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 61543300
*       3    TTE013MC CHARACTER(8) BOUNDARY(WORD), /* <U1 U2>.          61571400
*                                      MACHINE CHECK INTERRUPT CODE.    61599500
*                                      FLCMCIC.                      */ 61627600
*         5    TTE013M1 CHARACTER(4), /* PART 1 OF FLCMCIC.          */ 61655700
*         5    TTE013M2 CHARACTER(4), /* PART 2 OF FLCMCIC.          */ 61683800
*       3    TTE013PS FIXED(32),    /* <U3>. PSASUPER.               */ 61712400
*       3    TTE013LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 61746800
*       3    TTE013PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 61781200
*       3    TTE013LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 61815600
*       3    TTE013ED CHARACTER(0) BOUNDARY(WORD); /* END OF MCH TTE.*/ 61850000
*%ENDMCH:                                                               61884400
*   IF TTEALL ^= 'YES'                                                  61918800
*      %THEN                                                            61953200
*     %IF TTEEX ^= 'YES' %THEN                                          61987600
*       %IF TTESCH ^= 'YES' %THEN                                       62022000
*         %GO TO ENDMSCH;                                               62056400
*                                                                       62090800
*/*|MSCH - MODIFY SUBCHANNEL TTE                                     */ 62125200
*/*|                                                                 */ 62160000
*/*|                                                                 */ 62190000
*/*|FORMATTED MSCH TTE:                                              */ 62220000
*/*|                                                                 */ 62250000
*/*|PR ASID TCB MSCH CD/D PSW ADDR U1 U2 U3                      TIME*/ 62280000
*/*|                                                                 */ 62310000
*                                                                       62340500
*   DECLARE                                                             62371000
*     1    TTE101   DEFINED(TTEUNQ), /* MODIFY SUBCHANNEL (MSCH).    */ 62401500
*       3    TTE101TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     62432000
*                                      IOSBPTR(R2)-> IOSSRB->           62462500
*                                      SRBPTCB.                      */ 62493000
*       3    TTE101AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          62523500
*                                      IOSBPTR(R2)-> IOSASID.        */ 62554000
*       3    TTE101HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    62584500
*                                      ASCBASID.                     */ 62615000
*       3    TTE101CC FIXED(8),     /* <PSW>. CONDITION CODE. INPUT     62645500
*                                      REGISTER 0.                   */ 62676000
*       3    TTE101R1 FIXED(8),     /* RESERVED.                     */ 62706500
*       3    TTE101DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           62737000
*                                      IOSBPTR(R2)-> IOSUCB->           62767500
*                                      UCBCHAN.                      */ 62798000
*       3    TTE101UB POINTER(31),  /* <U1>. UCB ADDRESS (COMMON        62828500
*                                      SEGMENT). ORBPTR(R3)-> WORD 1.*/ 62859000
*       3    TTE101O2 FIXED(31),    /* <U2>. ORB WORD 2. ORBPTR(R3)->   62889500
*                                      WORD 2.                       */ 62920000
*         5    TTE101F1 BIT(8),     /* SCHFLG1 FROM SCHIB USED FOR      62950500
*                                      MSCH INSTRUCTION.             */ 62981000
*         5    TTE101F2 BIT(8),     /* SCHFLG2 FROM SCHIB USED FOR      63011500
*                                      MSCH INSTRUCTION.             */ 63042000
*         5    TTE101LM FIXED(8),   /* SCHLPM FROM SCHIB USED FOR       63072500
*                                      MSCH INSTRUCTION.             */ 63103000
*         5    TTE101PM FIXED(8),   /* SCHPOM FROM SCHIB USED FOR       63133500
*                                      MSCH INSTRUCTION.             */ 63164000
*       3    TTE101O3 FIXED(31),    /* <U3>. ORB WORD 3. ORBPTR(R3)->   63194500
*                                      WORD 3.                       */ 63225000
*         5    TTE101MI FIXED(16),  /* SCHMBI FROM SCHIB USED FOR       63255500
*                                      MSCH INSTRUCTION.             */ 63286000
*         5    TTE101P2 FIXED(8),   /* IOSOPT2 FROM MSCH IOSB.       */ 63316500
*         5    TTE101FB FIXED(8),   /* IOSFLB FROM MSCH IOSB.        */ 63347000
*       3    TTE101IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      63377500
*                                      REGISTER 2.                   */ 63408000
*       3    TTE101TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    63438500
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 63469000
*         5    TTE101T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 63499500
*         5    TTE101T2 CHARACTER(1), /* RESERVED.               @L8A*/ 63530000
*         5    TTE101T3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 63560500
*       3    TTE101ED CHARACTER(0) BOUNDARY(WORD); /* END OF MSCH       63580800
*                                      TTE.                          */ 63601100
*%ENDMSCH:                                                              63621500
*   IF TTEALL ^= 'YES'                                                  63652000
*      %THEN                                                            63682500
*     %IF TTEEX ^= 'YES' %THEN                                          63713000
*       %IF TTEPGM ^= 'YES' %THEN                                       63743500
*         %GO TO ENDPGM;                                                63774000
*                                                                       63804500
*/*|PGM - PROGRAM INTERRUPT TTE                                      */ 63835000
*/*|                                                                 */ 63870000
*/*|                                                                 */ 63900000
*/*|FORMATTED PGM TTE:                                               */ 63930000
*/*|                                                                 */ 63960000
*/*|PR ASID TCB PGM  CD/D PSW ADDR U1 U2    CLHS LOCAL PASD SASD TIME*/ 63990000
*/*|                                        CLHSE                    */ 64020000
*                                                                       64052700
*   DECLARE                                                             64085400
*     1    TTE007   DEFINED(TTEUNQ), /* PROGRAM INTERRUPT (PGM).     */ 64118100
*       3    TTE007TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    64150800
*                                      0. PSATOLD.                   */ 64183500
*       3    TTE007R1 FIXED(16),    /* RESERVED.                     */ 64216200
*       3    TTE007HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      64248900
*                                      PSAAOLD-> ASCBASID.           */ 64281600
*       3    TTE007PA FIXED(16),    /* <PASD>. PASID. CONTROL           64314300
*                                      REGISTER 4.                   */ 64347000
*       3    TTE007SA FIXED(16),    /* <SASD>. SASID. CONTROL           64379700
*                                      REGISTER 3.                   */ 64412400
*       3    TTE007PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>.       64445100
*                                      PROGRAM INTERRUPT PSW. PROGRAM   64477800
*                                      INTERRUPT STATUS ADDRESS(R2)->   64510500
*                                      WORDS 1 AND 2.                */ 64543200
*         5    TTE007P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 64575900
*         5    TTE007P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 64608600
*       3    TTE007IL FIXED(16),    /* <U1(1:2)>. PROGRAM INSTRUCTION   64641300
*                                      LENGTH. PROGRAM INTERRUPT        64674000
*                                      STATUS ADDRESS(R2)-> WORD 3.  */ 64706700
*       3    TTE007CD FIXED(16),    /* <CD/D AND U1(3:4)>. PROGRAM      64739400
*                                      INTERRUPT CODE. PROGRAM          64772100
*                                      INTERRUPT STATUS ADDRESS(R2)->   64804800
*                                      WORD 3.                       */ 64837500
*       3    TTE007TA POINTER(31),  /* <U2>. TEA CONTENTS. HIGH ORDER   64870200
*                                      BIT INDICATES PRIMARY (0) OR     64902900
*                                      SECONDARY (1). PROGRAM           64935600
*                                      INTERRUPT STATUS ADDRESS(R2)->   64968300
*                                      WORD 4.                       */ 65001000
*       3    TTE007LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 65033700
*       3    TTE007PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 65066400
*       3    TTE007LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 65099100
*       3    TTE007ED CHARACTER(0) BOUNDARY(WORD); /* END OF PGM TTE.*/ 65131800
*%ENDPGM:                                                               65164500
*   IF TTEALL ^= 'YES'                                                  65197200
*      %THEN                                                            65229900
*     %IF TTEEX ^= 'YES' %THEN                                          65262600
*       %IF TTESCH ^= 'YES' %THEN                                       65295300
*         %GO TO ENDRSCH;                                               65328000
*                                                                       65360700
*/*|RSCH - RESUME SUBCHANNEL TTE                                     */ 65393400
*/*|                                                                 */ 65430000
*/*|                                                                 */ 65460000
*/*|FORMATTED RSCH TTE:                                              */ 65490000
*/*|                                                                 */ 65520000
*/*|PR ASID TCB RSCH CD/D PSW ADDR U1                            TIME*/ 65550000
*/*|                                                                 */ 65580000
*                                                                       65609100
*   DECLARE                                                             65638200
*     1    TTE401   DEFINED(TTEUNQ), /* RESUME SUBCHANNEL (RSCH).    */ 65667300
*       3    TTE401TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     65696400
*                                      IOSBPTR(R2)-> IOSSRB->           65725500
*                                      SRBPTCB.                      */ 65754600
*       3    TTE401AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          65783700
*                                      IOSBPTR(R2)-> IOSASID.        */ 65812800
*       3    TTE401HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    65841900
*                                      ASCBASID.                     */ 65871000
*       3    TTE401CC FIXED(8),     /* <PSW(1:1)>. CONDITION CODE.      65900100
*                                      INPUT REGISTER 0.             */ 65929200
*       3    TTE401DI FIXED(8),     /* <PSW(3:3)>. DRIVER ID.           65958300
*                                      IOSBPTR(R2)-> IOSDVRID.       */ 65987400
*       3    TTE401DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           66016500
*                                      IOSBPTR(R2)-> IOSUCB->           66045600
*                                      UCBCHAN.                      */ 66074700
*       3    TTE401UB POINTER(31),  /* <U1>. UCB ADDRESS FROM IOSB.     66103800
*                                      IOSBPTR(R2)-> IOSUCB.         */ 66132900
*       3    TTE401IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      66162000
*                                      REGISTER 2.                   */ 66191100
*       3    TTE401TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    66220200
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 66249300
*         5    TTE401T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 66278400
*         5    TTE401T2 CHARACTER(1), /* RESERVED.               @L8A*/ 66307500
*         5    TTE401T3 FIXED(16),  /* <U4>. BASE DEVICE NUMBER. @L8A*/ 66336600
*       3    TTE401ED CHARACTER(0) BOUNDARY(WORD); /* END OF RSCH       66356000
*                                      TTE.                          */ 66375400
*%ENDRSCH:                                                              66394800
*   IF TTEALL ^= 'YES'                                                  66423900
*      %THEN                                                            66453000
*     %IF TTEEX ^= 'YES' %THEN                                          66482100
*       %IF TTERST ^= 'YES' %THEN                                       66511200
*         %GO TO ENDRST;                                                66540300
*                                                                       66569400
*/*|RST - RESTART INTERRUPT TTE                                      */ 66598500
*/*|                                                                 */ 66630000
*/*|                                                                 */ 66660000
*/*|FORMATTED RST TTE:                                               */ 66690000
*/*|                                                                 */ 66720000
*/*|PR ASID TCB RST       PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 66750000
*/*|                               U4 U5    CLHSE                    */ 66780000
*                                                                       66816600
*   DECLARE                                                             66853200
*     1    TTE015   DEFINED(TTEUNQ), /* RESTART INTERRUPT (RST).     */ 66889800
*       3    TTE015TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    66926400
*                                      0. PSATOLD.                   */ 66963000
*       3    TTE015R1 FIXED(16),    /* RESERVED.                     */ 66999600
*       3    TTE015HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      67036200
*                                      PSAAOLD-> ASCBASID.           */ 67072800
*       3    TTE015PA FIXED(16),    /* <PASD>. PASID. CONTROL           67109400
*                                      REGISTER 4.                   */ 67146000
*       3    TTE015SA FIXED(16),    /* <SASD>. SASID. CONTROL           67182600
*                                      REGISTER 3.                   */ 67219200
*       3    TTE015PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>.       67255800
*                                      RESTART OLD PSW. FLCROPSW.    */ 67292400
*         5    TTE015P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 67329000
*         5    TTE015P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 67365600
*       3    TTE015GF FIXED(32),    /* <U1>. R15 CONTENT. INPUT         67402200
*                                      REGISTER 15.                  */ 67438800
*       3    TTE015G0 FIXED(32),    /* <U2>. R0 CONTENT. INPUT          67475400
*                                      REGISTER 0.                   */ 67512000
*       3    TTE015G1 FIXED(32),    /* <U3>. R1 CONTENT. INPUT          67548600
*                                      REGISTER 1.                   */ 67585200
*       3    TTE015PS FIXED(32),    /* <U4>. PSASUPER.               */ 67621800
*       3    TTE015MW FIXED(32),    /* <U5>. PSAMODEW.               */ 67658400
*       3    TTE015LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 67695000
*       3    TTE015PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 67731600
*       3    TTE015LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 67768200
*       3    TTE015ED CHARACTER(0) BOUNDARY(WORD); /* END OF RST TTE.*/ 67804800
*%ENDRST:                                                               67841400
*   IF TTEALL ^= 'YES'                                                  67878000
*      %THEN                                                            67914600
*     %IF TTEEX ^= 'YES' %THEN                                          67951200
*       %IF TTESPER ^= 'YES' %THEN                                      67987800
*         %GO TO ENDSPER;                                               68024400
*                                                                       68061000
*/*|SPER - SLIP/PER EVENT TTE                                    @L1A*/ 68100000
*/*|                                                                 */ 68130000
*/*|                                                                 */ 68160000
*/*|FORMATTED SLIP/PER TTE:                                          */ 68190000
*/*|                                                                 */ 68220000
*/*|PR ASID TCB SPER CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 68250000
*/*|                               U4       CLHSE                    */ 68280000
*/*|                                                                 */ 68310000
*                                                                       68347300
*   DECLARE                                                             68384600
*     1    TTE009   DEFINED(TTEUNQ), /* SLIP/PER EVENT (SPER).   @L1A*/ 68421900
*       3    TTE009TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    68459200
*                                      0. PSATOLD.               @L1A*/ 68496500
*       3    TTE009PC CHARACTER(2), /* <CD/D>. PER CODE. SLIP/PER       68533800
*                                      STATUS ADDRESS (R3)-> BYTE 1.    68571100
*                                                                @L9C*/ 68608400
*       3    TTE009HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      68645700
*                                      PSAAOLD-> ASCBASID.       @L1A*/ 68683000
*       3    TTE009PA FIXED(16),    /* <PASD>. PASID. CONTROL           68720300
*                                      REGISTER 4.               @L1A*/ 68757600
*       3    TTE009SA FIXED(16),    /* <SASD>. SASID. CONTROL           68794900
*                                      REGISTER 3.               @L1A*/ 68832200
*       3    TTE009PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>.       68869500
*                                      PROGRAM INTERRUPT PSW. PROGRAM   68906800
*                                      INTERRUPT STATUS ADDRESS(R2)->   68944100
*                                      WORDS 1 AND 2.            @L1A*/ 68981400
*         5    TTE009P1 CHARACTER(4), /* 1ST HALF OF PSW.        @L1A*/ 69018700
*         5    TTE009P2 CHARACTER(4), /* 2ND HALF OF PSW.        @L1A*/ 69056000
*       3    TTE009IL FIXED(16),    /* <U1(1:2)>. PROGRAM INSTRUCTION   69093300
*                                      LENGTH. PROGRAM INTERRUPT        69130600
*                                      STATUS ADDRESS(R2)-> WORD 3.     69167900
*                                                                @L1A*/ 69205200
*       3    TTE009CD FIXED(16),    /* <DT/C> PROGRAM INTERRUPT CODE.   69242500
*                                      PROGRAM INTERRUPT STATUS         69279800
*                                      ADDRESS(R2)-> WORD 3.     @L1A*/ 69317100
*       3    TTE009ID CHARACTER(4), /* <U3>. SLIP/PER TRAP ID.          69354400
*                                      SLIP/PER TRAP ID ADDRESS         69391700
*                                      (R1)-> WORD 1.            @L1A*/ 69429000
*       3    TTE009IA POINTER(31),  /* <U1> PER ADDRESS PART 1.         69466300
*                                      SLIP/PER STATUS ADDRESS(R3)->    69503600
*                                      BYTES 3 THROUGH 6         @L9A*/ 69540900
*       3    TTE009IB POINTER(31),  /* <U2> PER ADDRESS PART 2.         69578200
*                                      SLIP/PER STATUS ADDRESS(R3)->    69615500
*                                      BYTES 7 THROUGH 10.       @L9A*/ 69652800
*       3    TTE009LH FIXED(32),    /* <CLHS>. PSACLHS.          @L1A*/ 69690100
*       3    TTE009PL POINTER(31),  /* <LOCAL>. PSALOCAL.        @L1A*/ 69727400
*       3    TTE009LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 69764700
*       3    TTE009ED CHARACTER(0) BOUNDARY(WORD); /* END OF SLIP/PER   69789500
*                                      TTE.                      @L1A*/ 69814300
*%ENDSPER:                                                              69839300
*   IF TTEALL ^= 'YES'                                                  69876600
*      %THEN                                                            69913900
*     %IF TTEEX ^= 'YES' %THEN                                          69951200
*       %IF TTEDSP ^= 'YES' %THEN                                       69988500
*         %GO TO ENDSRB;                                                70025800
*                                                                       70063100
*/*|SRB - SRB DISPATCH TTE                                           */ 70100400
*/*|                                                                 */ 70140000
*/*|                                                                 */ 70170000
*/*|FORMATTED SRB TTE:                                               */ 70200000
*/*|                                                                 */ 70230000
*/*|PR ASID TCB SRB       PSW ADDR U1 U2 U3 CLHS       PASD SASD TIME*/ 70260000
*/*|                               U4 U5                             */ 70290000
*                                                                       70323300
*   DECLARE                                                             70356600
*     1    TTE10F   DEFINED(TTEUNQ), /* SRB DISPATCH (SRB).          */ 70389900
*       3    TTE10FTB POINTER(31),  /* <TCB>. WORK UNIT ADDRESS.        70423200
*                                      SRBPTR(R0)-> SRBWEB.      @D1C*/ 70456500
*       3    TTE10FSF BIT(8),       /* <U5>. SRB FLAG BYTE.             70489800
*                                      SRBPTR(R0)-> SRBFLGS.     @D1C*/ 70523100
*       3    TTE10FLH BIT(8),       /* <CLHS>. SRBHLHI. SRBPTR(R0)->    70556400
*                                      SRBHLHI.                      */ 70589700
*       3    TTE10FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      70623000
*                                      PSAAOLD-> ASCBASID.           */ 70656300
*       3    TTE10FPW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>. PSW   70689600
*                                      TO RECEIVE CONTROL ON SRB        70722900
*                                      DISPATCH. PSASMPSW.           */ 70756200
*         5    TTE10FP1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 70789500
*         5    TTE10FP2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 70822800
*       3    TTE10FFN FIXED(16),    /* <U1(1:2)>. CPU AFFINITY.         70856100
*                                      SRBPTR(R0)-> SRBCPAFF.        */ 70889400
*       3    TTE10FAP FIXED(16),    /* <U1(3:4)>. RELATED ASID.         70922700
*                                      SRBPTR(R0)-> SRBPASID.        */ 70956000
*       3    TTE10FG0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       70989300
*                                      INPUT REGISTER 0.             */ 71022600
*       3    TTE10FG1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       71055900
*                                      INPUT REGISTER 1.             */ 71089200
*       3    TTE10FPT POINTER(31),  /* <U4>. PURGE TCB ADDRESS.         71122500
*                                      SRBPTR(R0)-> SRBPTCB.     @D1A*/ 71155800
*       3    TTE10FED CHARACTER(0) BOUNDARY(WORD); /* END OF SRB TTE.*/ 71189100
*%ENDSRB:                                                               71222400
*   IF TTEALL ^= 'YES'                                                  71255700
*      %THEN                                                            71289000
*     %IF TTEEX ^= 'YES' %THEN                                          71322300
*       %IF TTEEXT ^= 'YES' %THEN                                       71355600
*         %GO TO ENDSS;                                                 71388900
*                                                                       71422200
*/*|SS - SERVICE SIGNAL EXTERNAL INTERRUPT TTE                       */ 71455500
*/*|                                                                 */ 71490000
*/*|                                                                 */ 71520000
*/*|FORMATTED SS TTE:                                                */ 71550000
*/*|                                                                 */ 71580000
*/*|PR ASID TCB SS        PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 71610000
*/*|                               U4 U5 U6 CLHSE                    */ 71640000
*                                                                       71690000
*   DECLARE                                                             71740000
*     1    TTE203   DEFINED(TTEUNQ), /* SS EXTERNAL INTERRUPT (SS).  */ 71790000
*       3    TTE203TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    71840000
*                                      0. PSATOLD.                   */ 71890000
*       3    TTE203R1 FIXED(16),    /* RESERVED.                     */ 71940000
*       3    TTE203HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      71990000
*                                      PSAAOLD-> ASCBASID.           */ 72040000
*       3    TTE203PA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    72090000
*                                      4.                            */ 72140000
*       3    TTE203SA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    72190000
*                                      4.                            */ 72240000
*       3    TTE203PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>.       72290000
*                                      EXTERNAL OLD PSW. FLCEOPSW.   */ 72340000
*         5    TTE203P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 72390000
*         5    TTE203P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 72440000
*       3    TTE203CD FIXED(32),    /* <U1>. EXTERNAL INTERRUPT CODE.   72490000
*                                      PSAEEPSW.                     */ 72540000
*       3    TTE203BA POINTER(31),  /* <U2>. SCCB ADDRESS ASSOCIATED    72590000
*                                      WITH THE SERVICE SIGNAL.  @L6C*/ 72640000
*       3    TTE203CM FIXED(32),    /* <U3>. SCLP COMMAND WORD          72690000
*                                      ASSOCIATED WITH THE SERVICE      72740000
*                                      SIGNAL INTERRUPT.         @L6C*/ 72790000
*       3    TTE203R3 FIXED(16),    /* RESERVED. MSSF HARDWARE FLAGS    72840000
*                                      NO LONGER PART OF THE SS TRACE   72890000
*                                      ENTRY.                    @L6C*/ 72940000
*       3    TTE203RC FIXED(16),    /* <U4(3:4)>. SERVICE PROCESSOR     72990000
*                                      RESPONSE AND REASON CODE. @L6C*/ 73040000
*       3    TTE203R2 FIXED(16),    /* RESERVED.                     */ 73090000
*       3    TTE203AD FIXED(16),    /* <U5>. SS ASID.            @L6C*/ 73140000
*       3    TTE203AT POINTER(31),  /* <U6>. SS TCB ADDRESS.     @L6C*/ 73190000
*       3    TTE203LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 73240000
*       3    TTE203PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 73290000
*       3    TTE203LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 73340000
*       3    TTE203ED CHARACTER(0) BOUNDARY(WORD); /* END OF SS TTE. */ 73390000
*%ENDSS:                                                                73440000
*   IF TTEALL ^= 'YES'                                                  73444100
*      %THEN                                                            73448200
*     %IF TTEEX ^= 'YES' %THEN      /*                           @01P*/ 73452300
*       %IF TTESIGA ^= 'YES' %THEN  /*                           @01A*/ 73456400
*         %GO TO ENDSIGA;           /*                           @01A*/ 73460500
*                                                                       73464600
*/*|SIGA - Signal adapter TTE                                        */ 73468700
*/*|                                                                 */ 73472800
*/*|                                                                 */ 73476900
*/*|FORMATTED SIGA TTE:                                              */ 73481000
*/*|                                                                 */ 73485100
*/*|PR ASID TCB SIGA CD/D PSW ADDR U1 U2 U3                      TIME*/ 73489200
*/*|                               U4                                */ 73493300
*/*|                                                                 */ 73497400
*                                                                       73501500
*   DECLARE                                                             73505600
*     1    TTE501   DEFINED(TTEUNQ), /* Signal adapter (SIGA).   @01A*/ 73509700
*      2    TTE501TB POINTER(31),   /* <TCB> TCB address         @01A*/ 73513800
*      2    *        FIXED(16),     /* Reserved                  @01A*/ 73517900
*      2    TTE501HA FIXED(16),     /* <ASID> Home address space @01A*/ 73522000
*      2    TTE501CC UNSIGNED BINARY(8), /* <PSW(1:1)> Condition code   73526100
*                                                                @01A*/ 73530200
*      2    TTE501FC UNSIGNED BINARY(8), /* <PSW(3:3)> SIGA function    73534300
*                                      code.                     @01A*/ 73538400
*      2    TTE501DN UNSIGNED BINARY(16), /* <CD/D> Device number       73542500
*                                                                @01A*/ 73546600
*      2    TTE501SI UNSIGNED BINARY(32), /* <U1> SID            @01A*/ 73550700
*      2    TTE501M1 UNSIGNED BINARY(32), /* <U2> Queue Mask 1   @01A*/ 73554800
*      2    TTE501M2 UNSIGNED BINARY(32), /* <U3> Queue Mask 2   @01A*/ 73558900
*      2    TTE501QI POINTER(31),   /* <ADDR> QIB Pointer        @01A*/ 73562100
*      2    TTE501UB POINTER(31),   /* <U4> UCB address.         @01A*/ 73565300
*      2    TTE501ED CHARACTER(0) BOUNDARY(WORD); /* End of SIGA TTE.   73568500
*                                                                @01A*/ 73571700
*%ENDSIGA:                          /*                           @01A*/ 73575300
*   IF TTEALL ^= 'YES'                                                  73579400
*      %THEN                                                            73583500
*     %IF TTEEX ^= 'YES' %THEN                                          73590000
*       %IF TTESCH ^= 'YES' %THEN                                       73640000
*         %GO TO ENDSSCH;                                               73690000
*                                                                       73740000
*/*|SSCH - START SUBCHANNEL TTE                                      */ 73790000
*/*|                                                                 */ 73950000
*/*|                                                                 */ 73980000
*/*|FORMATTED SSCH TTE:                                              */ 74010000
*/*|                                                                 */ 74040000
*/*|PR ASID TCB SSCH CD/D PSW ADDR U1 U2 U3                      TIME*/ 74070000
*/*|                                                                 */ 74100000
*                                                                       74130000
*   DECLARE                                                             74160000
*     1    TTE001   DEFINED(TTEUNQ), /* START SUBCHANNEL (SSCH).     */ 74190000
*       3    TTE001TB POINTER(31),  /* <TCB>. TCB ADDRESS FROM SRB.     74220000
*                                      IOSBPTR(R2)-> IOSSRB->           74250000
*                                      SRBPTCB.                      */ 74280000
*       3    TTE001AD FIXED(16),    /* <ASID>. ASID FROM IOSB.          74310000
*                                      IOSBPTR(R2)-> IOSASID.        */ 74340000
*       3    TTE001HA FIXED(16),    /* HOME ADDRESS SPACE. PSAAOLD->    74370000
*                                      ASCBASID.                     */ 74400000
*       3    TTE001CC FIXED(8),     /* <PSW(1:1)>. CONDITION CODE.      74430000
*                                      INPUT REGISTER 0.             */ 74460000
*       3    TTE001DI FIXED(8),     /* <PSW(3:3)>. DRIVER ID.           74490000
*                                      IOSBPTR(R2)-> IOSDVRID.       */ 74520000
*       3    TTE001DN FIXED(16),    /* <CD/D>. DEVICE NUMBER.           74550000
*                                      TTE001UB-> UCBCHAN.       @L8C*/ 74580000
*       3    TTE001UB POINTER(31),  /* <U1>. ORB WORD 1 - UCB           74610000
*                                      ADDRESS. ORBPTR(R3)-> WORD 1. */ 74640000
*       3    TTE001O2 FIXED(32),    /* <U2>. ORB WORD 2. ORBPTR(R3)->   74670000
*                                      WORD 2.                       */ 74700000
*       3    TTE001O3 FIXED(32),    /* <U3>. ORB WORD 3. ORBPTR(R3)->   74730000
*                                      WORD 3.                       */ 74760000
*       3    TTE001O4 FIXED(32),    /* <U4>. ORB WORD 4. ORBPTR(R3)->   74771200
*                                      WORD 4.                   @LAA*/ 74782500
*       3    TTE001IO POINTER(31),  /* <ADDR>. IOSB ADDRESS. INPUT      74801200
*                                      REGISTER 2.                   */ 74820000
*       3    TTE001TK FIXED(32),    /* <CD/D> IF COPROCESSOR DEVICE.    74850000
*                                      TOKEN. INPUT REGISTER 1.  @L8C*/ 74880000
*         5    TTE001T1 FIXED(8),   /* KEY. NOT FORMATTED.       @L8A*/ 74910000
*         5    TTE001T2 CHARACTER(1), /* RESERVED.               @L8A*/ 74940000
*         5    TTE001T3 FIXED(16),  /* <U6>. BASE DEVICE NUMBER. @LAC*/ 74970000
*       3    TTE001CU POINTER(31),  /* <U5>. CAPTURE UCB ADDRESS.       75000000
*                                      IOSBPTR(R2)->IOSUCB.      @L8A*/ 75030000
*       3    TTE001ED CHARACTER(0) BOUNDARY(WORD); /* END OF SSCH       75050000
*                                      TTE.                          */ 75070000
*%ENDSSCH:                                                              75090000
*   IF TTEALL ^= 'YES'                                                  75120000
*      %THEN                                                            75150000
*     %IF TTEEX ^= 'YES' %THEN                                          75180000
*       %IF TTEDSP ^= 'YES' %THEN                                       75210000
*         %GO TO ENDSSRB;                                               75240000
*                                                                       75270000
*/*|SSRB - SUSPENDED SRB DISPATCH TTE                                */ 75300000
*/*|                                                                 */ 75330000
*/*|                                                                 */ 75360000
*/*|FORMATTED SSRB TTE:                                              */ 75390000
*/*|                                                                 */ 75420000
*/*|PR ASID TCB SSRB      PSW ADDR U1    U3 CLHS LOCAL PASD SASD TIME*/ 75450000
*/*|                               U4                                */ 75465000
*/*|                                                                 */ 75480000
*                                                                       75513200
*   DECLARE                                                             75546400
*     1    TTE20F   DEFINED(TTEUNQ), /* SUSPENDED SRB DISPATCH          75571300
*                                      (SSRB).                       */ 75596200
*       3    TTE20FTB POINTER(31),  /* <TCB>. WORK UNIT ADDRESS.        75621100
*                                      PSALCCAV-> LCCACWEB.      @D1C*/ 75646000
*       3    TTE20FR1 BIT(8),       /* RESERVED.                     */ 75679200
*       3    TTE20FLH BIT(8),       /* <CLHS>. PSACLHS BYTE 4.          75712400
*                                      PSACLHS4.                     */ 75745600
*       3    TTE20FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      75778800
*                                      PSAAOLD-> ASCBASID.           */ 75812000
*       3    TTE20FPA FIXED(16),    /* <PASD>. PASID. INPUT REGISTER    75845200
*                                      13.                           */ 75878400
*       3    TTE20FSA FIXED(16),    /* <SASD>. SASID. INPUT REGISTER    75911600
*                                      13.                           */ 75944800
*       3    TTE20FPW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>. PSW   75978000
*                                      TO BE REDISPATCHED. PSAPSWSV. */ 76011200
*         5    TTE20FP1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 76044400
*         5    TTE20FP2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 76077600
*       3    TTE20FPT POINTER(31),  /* <U4>. RELATED TCB. PSALCCAV->    76110800
*                                      LCCAPGTA+2.               @D1A*/ 76144000
*       3    TTE20FSP FIXED(32),    /* <U3>. SSRB ADDRESS. INPUT        76177200
*                                      REGISTER 1.               @P2C*/ 76210400
*       3    TTE20FFN FIXED(16),    /* <U1(1:2)>. CPU AFFINITY.         76243600
*                                      PSALCCAV-> LCCASAFN.          */ 76276800
*       3    TTE20FAP FIXED(16),    /* <U1(3:4)>. RELATED ASID.         76310000
*                                      PSALCCAV-> LCCAPGTA.          */ 76343200
*       3    TTE20FPL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 76368100
*       3    TTE20FED CHARACTER(0) BOUNDARY(WORD); /* END OF SSRB       76393000
*                                      TTE.                          */ 76417900
*%ENDSSRB:                                                              76442800
*   IF TTEALL ^= 'YES'                                                  76476000
*      %THEN                                                            76509200
*     %IF TTEEX ^= 'YES' %THEN                                          76542400
*       %IF TTESUSP ^= 'YES' %THEN                                      76575600
*         %GO TO ENDSUSP;                                               76608800
*                                                                       76642000
*/*|SUSP - LOCK SUSPENSION TTE                                       */ 76675200
*/*|                                                                 */ 76710000
*/*|                                                                 */ 76740000
*/*|FORMATTED SUSP TTE:                                              */ 76770000
*/*|                                                                 */ 76800000
*/*|PR ASID TCB SUSP          ADDR U1 U2 U3 CLHS LOCAL           TIME*/ 76830000
*/*|                               U4       CLHSE                    */ 76860000
*                                                                       76896400
*   DECLARE                                                             76932800
*     1    TTE019   DEFINED(TTEUNQ), /* SUSPENSION (SUSP).           */ 76969200
*       3    TTE019TB POINTER(31),  /* <TCB>. ADDRESS OF SUSPENDED      77005600
*                                      TCB OR RELATED TCB. INPUT        77042000
*                                      REGISTER 4 OR SSRBPTR(R4)->      77078400
*                                      SRBPTCB.                      */ 77114800
*       3    TTE019R1 FIXED(16),    /* RESERVED.                     */ 77151200
*       3    TTE019HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      77187600
*                                      PSAAOLD-> ASCBASID.           */ 77224000
*       3    TTE019RT POINTER(31),  /* <ADDR>. RETURN ADDRESS FOR THE   77260400
*                                      CALLER OF THE SERVICE ROUTINE.   77296800
*                                      INPUT REGISTER 14.            */ 77333200
*       3    TTE019RB POINTER(31),  /* <U1>. ADDRESS OF SUSPENDED RB    77369600
*                                      OR 0. INPUT REGISTER 5.       */ 77406000
*       3    TTE019SB POINTER(31),  /* <U4>. ADDRESS OF SUSPENDED SRB   77442400
*                                      OR 0. INPUT REGISTER 4 OR 0.  */ 77478800
*       3    TTE019SI CHARACTER(4), /* <U2>. SUSPENSION TYPE            77515200
*                                      IDENTIFIER. (LOCL, CML, CMS,     77551600
*                                      CEDQ, CSMF IN EBCDIC). INPUT     77588000
*                                      REGISTER 12.                  */ 77624400
*       3    TTE019AD POINTER(31),  /* <U3>. ADDRESS ASSOCIATED WITH    77660800
*                                      SUSPENSION OR 0: LOCL - 0. CML   77697200
*                                      - ASCB ADDRESS FOR CML LOCK      77733600
*                                      REQUESTED. CMS - LOCKWORD        77770000
*                                      ADDRESS. CEDQ - LOCKWORD         77806400
*                                      ADDRESS. CSMF - LOCKWORD         77842800
*                                      ADDRESS. INPUT REGISTER 11.   */ 77879200
*       3    TTE019LH FIXED(32),    /* <CLHS>. INPUT REGISTER 2. @P1C*/ 77915600
*       3    TTE019PL POINTER(31),  /* <LOCAL>. INPUT REGISTER 3.       77952000
*                                                                @P1C*/ 77988400
*       3    TTE019LE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 78024800
*       3    TTE019ED CHARACTER(0) BOUNDARY(WORD); /* END OF SUSP       78049000
*                                      TTE.                          */ 78073200
*%ENDSUSP:                                                              78097600
*   IF TTEALL ^= 'YES'                                                  78134000
*      %THEN                                                            78170400
*     %IF TTEEX ^= 'YES' %THEN                                          78206800
*       %IF TTESVC ^= 'YES' %THEN                                       78243200
*         %GO TO ENDSVC;                                                78279600
*                                                                       78316000
*/*|SVC - SVC INTERRUPT TTE                                          */ 78352400
*/*|                                                                 */ 78390000
*/*|                                                                 */ 78420000
*/*|FORMATTED SVC TTE:                                               */ 78450000
*/*|                                                                 */ 78480000
*/*|PR ASID TCB SVC  CD/D PSW ADDR U1 U2 U3                      TIME*/ 78510000
*/*|                                                                 */ 78540000
*                                                                       78574200
*   DECLARE                                                             78608400
*     1    TTE005   DEFINED(TTEUNQ), /* GENERAL SVC INTERRUPT (SVC)  */ 78642600
*       3    TTE005TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    78676800
*                                      0. PSATOLD.                   */ 78711000
*       3    TTE005SN FIXED(16),    /* <CD/D>. SVC NUMBER. FLCSVCN.  */ 78745200
*       3    TTE005HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      78779400
*                                      PSAAOLD->ASCBASID.            */ 78813600
*       3    TTE005PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>. SVC   78847800
*                                      OLD PSW. FLCSOPSW.            */ 78882000
*         5    TTE005P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 78916200
*         5    TTE005P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 78950400
*       3    TTE005GF FIXED(32),    /* <U1>. REGISTER 15 CONTENTS.      78984600
*                                      INPUT REGISTER 15.            */ 79018800
*       3    TTE005G0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       79053000
*                                      INPUT REGISTER 0.             */ 79087200
*       3    TTE005G1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       79121400
*                                      INPUT REGISTER 1.             */ 79155600
*       3    TTE005ED CHARACTER(0) BOUNDARY(WORD); /* END OF SVC TTE.*/ 79189800
*%ENDSVC:                                                               79224000
*   IF TTEALL ^= 'YES'                                                  79258200
*      %THEN                                                            79292400
*     %IF TTEEX ^= 'YES' %THEN                                          79326600
*       %IF TTESVC ^= 'YES' %THEN                                       79360800
*         %GO TO ENDSVCE;                                               79395000
*                                                                       79429200
*/*|SVCE - SVC ERROR TTE                                             */ 79463400
*/*|                                                                 */ 79500000
*/*|                                                                 */ 79530000
*/*|FORMATTED SVCE TTE:                                              */ 79560000
*/*|                                                                 */ 79590000
*/*|PR ASID TCB SVCE CD/D PSW ADDR U1 U2 U3 CLHS LOCAL PASD SASD TIME*/ 79620000
*/*|                               U4       CLHSE                    */ 79650000
*                                                                       79685000
*   DECLARE                                                             79720000
*     1    TTEF05   DEFINED(TTEUNQ), /* SVC ERROR (SVCE).            */ 79755000
*       3    TTEF05TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    79790000
*                                      0. PSATOLD.                   */ 79825000
*       3    TTEF05SN FIXED(16),    /* <CD/D>. SVC NUMBER. FLCSVCN.  */ 79860000
*       3    TTEF05HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      79895000
*                                      PSAAOLD->ASCBASID.            */ 79930000
*       3    TTEF05PA FIXED(16),    /* <PASD>. PASID. CONTROL           79965000
*                                      REGISTER 4.                   */ 80000000
*       3    TTEF05SA FIXED(16),    /* <SASD>. SASID. CONTROL           80035000
*                                      REGISTER 3.                   */ 80070000
*       3    TTEF05PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>. SVC   80105000
*                                      OLD PSW. FLCSOPSW.            */ 80140000
*         5    TTEF05P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 80175000
*         5    TTEF05P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 80210000
*       3    TTEF05GF FIXED(32),    /* <U1>. REGISTER 15 CONTENTS.      80245000
*                                      INPUT REGISTER 15.            */ 80280000
*       3    TTEF05G0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       80315000
*                                      INPUT REGISTER 0.             */ 80350000
*       3    TTEF05G1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       80385000
*                                      INPUT REGISTER 1.             */ 80420000
*       3    TTEF05MW FIXED(32),    /* <U4>. PSAMODEW.               */ 80455000
*       3    TTEF05LH FIXED(32),    /* <CLHS>. PSACLHS.              */ 80490000
*       3    TTEF05PL POINTER(31),  /* <LOCAL>. PSALOCAL.            */ 80525000
*       3    TTEF05LE FIXED(32),    /* <CLHSE>. PSACLHSE.            */ 80560000
*       3    TTEF05ED CHARACTER(0) BOUNDARY(WORD); /* END OF SVCE       80583300
*                                      TTE.                          */ 80606600
*%ENDSVCE:                                                              80630000
*   IF TTEALL ^= 'YES'                                                  80665000
*      %THEN                                                            80700000
*     %IF TTEEX ^= 'YES' %THEN                                          80735000
*       %IF TTESVC ^= 'YES' %THEN                                       80770000
*         %GO TO ENDSVCR;                                               80805000
*                                                                       80840000
*/*|SVCR - SVC RETURN TTE                                            */ 80875000
*/*|                                                                 */ 80910000
*/*|                                                                 */ 80940000
*/*|FORMATTED SVCR TTE:                                              */ 80970000
*/*|                                                                 */ 81000000
*/*|PR ASID TCB SVCR CD/D PSW ADDR U1 U2 U3                      TIME*/ 81030000
*/*|                                                                 */ 81060000
*                                                                       81089000
*   DECLARE                                                             81118000
*     1    TTE105   DEFINED(TTEUNQ), /* SVC RETURN (SVCR).           */ 81147000
*       3    TTE105TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS.      81176000
*                                      PSATOLD.                      */ 81205000
*       3    TTE105SN FIXED(16),    /* <CD/D>. SVC NUMBER.              81234000
*                                      ((PSATOLD-> TCBRBP)-             81263000
*                                      RBPRFLNA)-> RBINTCOD.         */ 81292000
*       3    TTE105HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      81321000
*                                      PSAAOLD-> ASCBASID.           */ 81350000
*       3    TTE105PW CHARACTER(8) BOUNDARY(WORD), /* <PSW ADDR>. PSW   81374800
*                                      TO RECEIVE CONTROL ON            81399600
*                                      REDISPATCH. PSATOLD-> TCBRBP->   81424400
*                                      RBOPSW.                       */ 81449200
*         5    TTE105P1 CHARACTER(4), /* 1ST HALF OF PSW.            */ 81474000
*         5    TTE105P2 CHARACTER(4), /* 2ND HALF OF PSW.            */ 81498800
*       3    TTE105GF FIXED(32),    /* <U1>. REGISTER 15 CONTENTS.      81524000
*                                      INPUT REGISTER 15.            */ 81553000
*       3    TTE105G0 FIXED(32),    /* <U2>. REGISTER 0 CONTENTS.       81582000
*                                      INPUT REGISTER 0.             */ 81611000
*       3    TTE105G1 FIXED(32),    /* <U3>. REGISTER 1 CONTENTS.       81640000
*                                      INPUT REGISTER 1.             */ 81669000
*       3    TTE105ED CHARACTER(0) BOUNDARY(WORD); /* END OF SVCR       81688300
*                                      TTE.                          */ 81707600
*%ENDSVCR:                                                              81727000
*   IF TTEALL ^= 'YES'                                                  81756000
*      %THEN                        /* IF ALL ENTRY MAPPINGS IS NOT     81785000
*                                      SPECIFIED,                @L2A*/ 81814000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    81843000
*                                      IS NOT SPECIFIED,         @L2A*/ 81872000
*       %IF TTESSRV ^= 'YES' %THEN                                      81901000
*         %GO TO ENDSSRV;                                               81930500
*                                                                       81960000
*/*|SSRV - PC OR BRANCH ENTERED SYSTEM SERVICE TTE                   */ 81963000
*/*|                                                                 */ 81966000
*/*|                                                                 */ 81966500
*/*|FORMATTED SSRV TTE:                                              */ 81967000
*/*|                                                                 */ 81967500
*/*|PR ASID TCB SSRV CD/D     ADDR U1 U2 U3 U4                   TIME*/ 81968000
*/*|                                                                 */ 81968500
*                                                                       81986500
*   DECLARE                                                             81990800
*     1    TTE205   DEFINED(TTEUNQ), /* PC OR BRANCH ENTERED SYSTEM     81995100
*                                      SERVICE (SSRV).           @L2A*/ 81999400
*       3    TTE205TB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    82003700
*                                      0. PSATOLD.               @L2A*/ 82008000
*       3    TTE205SI FIXED(16),    /* <CD/D>. ASSOCIATED SERVICE       82012300
*                                      IDENTIFIER NUMBER.        @L2A*/ 82016600
*       3    TTE205HA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      82020900
*                                      PSAAOLD-> ASCBASID.       @L2A*/ 82025200
*       3    TTE205CI POINTER(31),  /* <ADDR>. RETURN ADDRESS OF THE    82029500
*                                      CALLER OF THE BRANCH ENTERED     82033800
*                                      SERVICE OR OF THE PC ENTERED     82038100
*                                      SERVICE.                  @L2A*/ 82042400
*       3    TTE205U1 FIXED(32),    /* <U1>. 1ST WORD OF INFORMATION    82046700
*                                      UNIQUE FOR ASSOCIATED SERVICE    82051000
*                                      IDENTIFIER.               @L2A*/ 82055300
*       3    TTE205U2 FIXED(32),    /* <U2>. 2ND WORD OF INFORMATION    82059600
*                                      UNIQUE FOR ASSOCIATED SERVICE    82063900
*                                      IDENTIFIER.               @L2A*/ 82068200
*       3    TTE205U3 FIXED(32),    /* <U3>. 3RD WORD OF INFORMATION    82072500
*                                      UNIQUE FOR ASSOCIATED SERVICE    82076800
*                                      IDENTIFIER.               @L2A*/ 82081100
*       3    TTE205U4 FIXED(32),    /* <U4>. 4TH WORD OF INFORMATION    82085400
*                                      UNIQUE FOR ASSOCIATED SERVICE    82089700
*                                      IDENTIFIER.               @L2A*/ 82094000
*       3    TTE205ED CHARACTER(0) BOUNDARY(WORD); /* END OF SSRV       82096800
*                                      TTE.                      @L2A*/ 82099600
*%ENDSSRV:                                                              82102600
*   IF TTEALL ^= 'YES'                                                  82106900
*      %THEN                                                            82111200
*     %IF TTEEX ^= 'YES' %THEN                                          82115500
*       %IF TTEUSRN ^= 'YES' %THEN                                      82119800
*         %GO TO ENDUSRN;                                               82124100
*                                                                       82128400
*/*|USRN - USER EVENT TTE                                            */ 82132700
*/*|                                                                 */ 82140000
*/*|                                                                 */ 82170000
*/*|FORMATTED USRN TTE:                                              */ 82200000
*/*|                                                                 */ 82230000
*/*|PR ASID TCB USRN          ADDR U1 U2 U3            PASD SASD TIME*/ 82260000
*/*|                               U4 U5 U6                          */ 82290000
*/*|                                                                 */ 82320000
*/*| U1-U6 ARE OPTIONAL USER DATA FIELDS.                            */ 82350000
*/*| TTE07FCI IS FORMATTED IN FIELD <U1> ONLY IF CONTINUATION        */ 82380000
*/*| IS INDICATED BY NONZERO.                                        */ 82410000
*/*|                                                                 */ 82440000
*                                                                       83340000
*   DECLARE                                                             83346000
*     1    TTE07F   DEFINED(TTEUNQ), /* USER EVENT TRACE (USRN).     */ 83352000
*       3    TTE07FTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    83358000
*                                      0. PSATOLD.                   */ 83364000
*       3    TTE07FRV FIXED(16),    /* RESERVED.                     */ 83370000
*       3    TTE07FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      83376000
*                                      PSAAOLD-> ASCBASID.           */ 83382000
*       3    TTE07FPA FIXED(16),    /* <PASD>. PASID. CONTROL           83388000
*                                      REGISTER 4.                   */ 83394000
*       3    TTE07FSA FIXED(16),    /* <SASD>. SASID. CONTROL           83400000
*                                      REGISTER 3.                   */ 83406000
*       3    TTE07FAD POINTER(31),  /* <ADDR>. USER RETURN ADDRESS.     83412000
*                                      INPUT REGISTER 14.            */ 83418000
*       3    TTE07FCI FIXED(32),    /* <U1>. CONTINUATION               83424000
*                                      INFORMATION.                  */ 83430000
*         5    TTE07FPI FIXED(16),  /* PTRACE IDENTIFICATION COUNT.     83436000
*                                      PSATRVT-> TRVTTOB-> TOBTRCI.  */ 83442000
*         5    TTE07FRB FIXED(16),  /* RELATIVE BYTE COUNT.             83448000
*                                      GENERATED.                    */ 83454000
*     TTE07FMW FIXED(31) CONSTANT(5); /* MAXIMUM NUMBER OF DATA WORDS   83460000
*                                      PER USER ENTRY.               */ 83466000
*%ENDUSRN:                                                              83472000
*   IF TTEALL ^= 'YES'                                                  83478000
*      %THEN                                                            83484000
*     %IF TTEEX ^= 'YES' %THEN                                          83490000
*       %IF TTEDSP ^= 'YES' %THEN                                       83496000
*         %GO TO ENDWAIT;                                               83502000
*                                                                       83508000
*/*|WAIT - WAIT DISPATCH TTE                                         */ 83514000
*/*|                                                                 */ 83520000
*/*|                                                                 */ 83550000
*/*|FORMATTED WAIT TTE:                                              */ 83580000
*/*|                                                                 */ 83610000
*/*|PR ASID TCB WAIT                                             TIME*/ 83640000
*/*|                                                                 */ 83670000
*                                                                       83690000
*   DECLARE                                                             83710000
*     1    TTEF0F   DEFINED(TTEUNQ), /* WAIT DISPATCH (WAIT).        */ 83730000
*       3    TTEF0FTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS.      83750000
*                                      PSATOLD.                      */ 83770000
*       3    TTEF0FR1 FIXED(16),    /* RESERVED.                     */ 83790000
*       3    TTEF0FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      83810000
*                                      PSAAOLD-> ASCBASID.           */ 83830000
*       3    TTEF0FED CHARACTER(0) BOUNDARY(WORD); /* END OF WAIT       83843300
*                                      TTE.                          */ 83856600
*%ENDWAIT:                                                              83870000
*   IF TTEALL ^= 'YES'                                                  83890000
*      %THEN                        /* IF ALL ENTRY MAPPINGS IS NOT     83910000
*                                      SPECIFIED,                @L3A*/ 83930000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    83950000
*                                      IS NOT SPECIFIED,         @L3A*/ 83970000
*       %IF TTERCVY ^= 'YES' %THEN                                      83990000
*         %GO TO ENDRCVY;                                               84010000
*                                                                       84030000
*/*|RCVY - RECOVERY EVENT TTE                                        */ 84580000
*/*|                                                                 */ 84630000
*/*|                                                                 */ 84680000
*/*|FORMATTED RCVY TTE:                                              */ 84730000
*/*|                                                                 */ 84780000
*/*|PR ASID TCB EMS  CD/D PSW ADDR U3 U4 U5 CLHS LOCAL PASD SASD TIME*/ 84830000
*/*|                               U6 U7 U8 CLHSE                    */ 84880000
*                                                                       84930000
*   DECLARE                                                             84980000
*     1    TTE01D   DEFINED(TTEUNQ), /* RECOVERY EVENT (RCVY).   @L3A*/ 85030000
*       3    TTE01DTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    85080000
*                                      0. PSATOLD.               @L3A*/ 85130000
*       3    TTE01DSI FIXED(16),    /* RCVY SUBTYPE CODE         @L3A*/ 85180000
*       3    TTE01DHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      85230000
*                                      PSAAOLD-> ASCBASID.       @L3A*/ 85280000
*       3    TTE01DLH FIXED(32),    /* <CLHS>. PSACLHS.          @L3A*/ 85330000
*       3    TTE01DLE FIXED(32),    /* <CLHSE>. PSACLHSE.        @L4A*/ 85380000
*       3    TTE01DPL POINTER(31),  /* <LOCAL>. PSALOCAL.        @L3A*/ 85430000
*       3    TTE01DU  BOUNDARY(WORD), /* INFORMATION UNIQUE TO RCVY     85480000
*                                      SUBTYPE CODE.             @L3A*/ 85530000
*         5    TTE01DU1 FIXED(32),  /* 1ST WORD OF INFORMATION UNIQUE   85580000
*                                      TO RCVY SUBTYPE.          @L3A*/ 85630000
*         5    TTE01DU2 FIXED(32),  /* 2ND WORD OF INFORMATION UNIQUE   85680000
*                                      TO RCVY SUBTYPE.          @L3A*/ 85730000
*         5    TTE01DU3 FIXED(32),  /* 3RD WORD OF INFORMATION UNIQUE   85780000
*                                      TO RCVY SUBTYPE.          @L3A*/ 85830000
*         5    TTE01DU4 FIXED(32),  /* 4TH WORD OF INFORMATION UNIQUE   85880000
*                                      TO RCVY SUBTYPE.          @L3A*/ 85930000
*         5    TTE01DU5 FIXED(32),  /* 5TH WORD OF INFORMATION UNIQUE   85980000
*                                      TO RCVY SUBTYPE.          @L3A*/ 86030000
*         5    TTE01DU6 FIXED(32),  /* 6TH WORD OF INFORMATION UNIQUE   86080000
*                                      TO RCVY SUBTYPE.          @L3A*/ 86130000
*         5    TTE01DU7 FIXED(32),  /* 7TH WORD OF INFORMATION UNIQUE   86180000
*                                      TO RCVY SUBTYPE.          @L3A*/ 86230000
*         5    TTE01DU8 FIXED(32),  /* 8TH WORD OF INFORMATION UNIQUE   86280000
*                                      TO RCVY SUBTYPE.          @L3A*/ 86330000
*       3    TTE01DED CHARACTER(0) BOUNDARY(WORD); /* END OF RCVY       86363300
*                                      TTE.                      @L3A*/ 86396600
*%ENDRCVY:                                                              86430000
*   IF TTEALL ^= 'YES'                                                  86480000
*      %THEN                        /* IF ALL ENTRY MAPPINGS IS NOT     86530000
*                                      SPECIFIED,                @L5A*/ 86580000
*     %IF TTEEX ^= 'YES' %THEN      /* ALL EXPLICIT TRACING MAPPINGS    86630000
*                                      IS NOT SPECIFIED,         @L5A*/ 86680000
*       %IF TTETIME ^= 'YES' %THEN                                      86730000
*         %GO TO ENDTIME;                                               86780000
*                                                                       87180000
*/*|TIME - TIMER SERVICES TTE                                        */ 87730000
*/*|                                                                 */ 87780000
*/*|                                                                 */ 87830000
*/*|FORMATTED TIME TTE:                                              */ 87880000
*/*|                                                                 */ 87930000
*/*|PR ASID TCB TIME CD/D          U1  U2 U3                     TIME*/ 87980000
*/*|                               U4  U5 U6                         */ 88030000
*/*|                               U7  U8 U9                         */ 88080000
*/*|                               U10 U11                           */ 88130000
*                                                                       90530000
*   DECLARE                                                             90580000
*     1    TTE01F   DEFINED(TTEUNQ), /* TIMER SERVICES ENTRY (TIME).    90630000
*                                                                @L5A*/ 90680000
*       3    TTE01FTB POINTER(31),  /* <TCB>. CURRENT TCB ADDRESS OR    90730000
*                                      0. PSATOLD.               @L5A*/ 90780000
*       3    TTE01FSI FIXED(16),    /* TIME SUBTYPE CODE         @L5A*/ 90830000
*       3    TTE01FHA FIXED(16),    /* <ASID>. HOME ADDRESS SPACE.      90880000
*                                      PSAAOLD-> ASCBASID.       @L5A*/ 90930000
*       3    TTE01FU  BOUNDARY(WORD), /* INFORMATION UNIQUE TO TIME     90980000
*                                      SUBTYPE CODE.             @L5A*/ 91030000
*         5    TTE01FU1 FIXED(32),  /* 1ST WORD OF INFORMATION UNIQUE   91080000
*                                      TO TIME SUBTYPE.          @L5A*/ 91130000
*         5    TTE01FU2 FIXED(32),  /* 2ND WORD OF INFORMATION UNIQUE   91180000
*                                      TO TIME SUBTYPE.          @L5A*/ 91230000
*         5    TTE01FU3 FIXED(32),  /* 3RD WORD OF INFORMATION UNIQUE   91280000
*                                      TO TIME SUBTYPE.          @L5A*/ 91330000
*         5    TTE01FU4 FIXED(32),  /* 4TH WORD OF INFORMATION UNIQUE   91380000
*                                      TO TIME SUBTYPE.          @L5A*/ 91430000
*         5    TTE01FU5 FIXED(32),  /* 5TH WORD OF INFORMATION UNIQUE   91480000
*                                      TO TIME SUBTYPE.          @L5A*/ 91530000
*         5    TTE01FU6 FIXED(32),  /* 6TH WORD OF INFORMATION UNIQUE   91580000
*                                      TO TIME SUBTYPE.          @L5A*/ 91630000
*         5    TTE01FU7 FIXED(32),  /* 7TH WORD OF INFORMATION UNIQUE   91680000
*                                      TO TIME SUBTYPE.          @L5A*/ 91730000
*         5    TTE01FU8 FIXED(32),  /* 8TH WORD OF INFORMATION UNIQUE   91780000
*                                      TO TIME SUBTYPE.          @L5A*/ 91830000
*         5    TTE01FU9 FIXED(32),  /* 9TH WORD OF INFORMATION UNIQUE   91880000
*                                      TO TIME SUBTYPE.          @L5A*/ 91930000
*         5    TTE01FUA FIXED(32),  /* 10TH WORD OF INFORMATION         91980000
*                                      UNIQUE TO TIME SUBTYPE.   @L5A*/ 92030000
*         5    TTE01FUB FIXED(32),  /* 11TH WORD OF INFORMATION         92080000
*                                      UNIQUE TO TIME SUBTYPE.   @L5A*/ 92130000
*       3    TTE01FED CHARACTER(0) BOUNDARY(WORD); /* END OF TIME       92163300
*                                      TTE.                      @L5A*/ 92196600
*%ENDTIME:                                                              92230000
*   ;                                                                   92280000
