*/* COPYRIGHT = 5647-A01                                             */ 00050000
*/*            THIS MODULE IS "RESTRICTED MATERIALS OF IBM"          */ 00100000
*/*            (C) COPYRIGHT IBM CORP. 1988, 2000                    */ 00150000
*/*            LICENSED MATERIALS - PROPERTY OF IBM                  */ 00200000
*/*                                                                  */ 00350000
*/* STATUS  = HBB7703                                                */ 00370000
*/*                                                                  */ 00390000
*/*01* EXTERNAL CLASSIFICATION: NONE                                 */ 00410000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 00430000
*/*                                                                  */ 00450000
*/* CHANGE ACTIVITY =                                                */ 00500000
*/*   $L1 =    AR    HBB3310 850901 PDXB: AR SUPPORT                 */ 00550000
*/*   $L2 = 64BITCSV HBB7703 980311 PDXB: 64-BIT SUPPORT             */ 00575000
         MACRO                                                          00600000
&NAME    IHBINNRR  &A,&B                                                00650000
         LCLC  &LA                      "LA" OR "LAE" VIA SYSSTATE @L1A 00700000
         LCLC  &LR                      "LR" OR "LGR" VIA SYSSTATE @L2A 00750000
         GBLC  &SYSASCE                                            @L1A 01050000
         GBLC  &SYSAM64                                            @L2A 01066600
         GBLA  &SYSALVL                                            @L2A 01083200
         SYSSTATE TEST                  TEST ASC ENVIRONMENT       @L1A 01100000
&LA      SETC  'LA'                     MUST USE LA INSTRUCTION    @L1A 01110000
&LR      SETC  'LR'                     MUST USE LR INSTRUCTION    @L2A 01115000
         AIF   ('&SYSASCE' EQ 'P').NOLAE                           @L1A 01120000
&LA      SETC  'LAE'                    MUST USE LAE               @L1A 01130000
.NOLAE   ANOP                                                      @L1A 01140000
         AIF   (&SYSALVL GT 1).YESAM64                             @L2A 01141600
         AIF   ('&SYSAM64' NE 'YES').NOAM64                        @L2A 01143200
.YESAM64 ANOP                                                      @L2A 01144800
&LR      SETC  'LGR'                    MUST USE LGR               @L2A 01146400
.NOAM64  ANOP                                                      @L2A 01148000
.NOPT    AIF   ('&A' EQ '' OR '&A' EQ '(1)').NAMEIT               19015 01150000
         AIF   ('&A'(1,1) EQ '(').REGA                                  01200000
&NAME    &LA   1,&A                              LOAD PARAMETER REG 1   01250000
         AGO   .CHKB                                                    01300000
.REGA    ANOP                                                           01350000
&NAME    &LR   1,&A(1)                           LOAD PARAMETER REG 1   01400000
         AIF   ('&SYSASCE' EQ 'P').CHKB                                 01450000
         CPYA  1,&A(1)                                                  01500000
         AGO   .CHKB                                                    01550000
.NAMEIT  AIF   ('&NAME' EQ '').CHKB                                     01600000
&NAME    DS    0H                                                       01650000
.CHKB    AIF   ('&B' EQ '' OR '&B' EQ '(0)').END                        01700000
         AIF   ('&B'(1,1) EQ '(').REGB                                  01750000
         &LA   0,&B                              LOAD PARAMETER REG 0   01800000
         AGO   .END                                                     01850000
.REGB    ANOP                                                           01883300
         &LR   0,&B(1)                           LOAD PARAMETER REG 0   01916600
         AIF   ('&SYSASCE' EQ 'P').END                                  01950000
         CPYA  0,&B(1)                                             @L1A 02000000
.END     MEND                                                           02050000
