*%GOTO CNMCB2; /*                                                               
         MACRO                                                                  
         IKJCNMCB                                                               
**/%CNMCB2:;                                                                    
*/***Start of Specifications******************************************/         
*/*                                                                  */         
*/*01* MACRO-NAME: IKJCNMCB                                          */         
*/*                                                                  */         
*/*01* DESCRIPTIVE-NAME: Message Control Block                       */         
*/*                                                                  */         
*/*01*  SECURITY:                                                    */         
*/*             5685-025 COPYRIGHT IBM CORP 1990                     */         
*/*           THIS PRODUCT CONTAINS RESTRICTED MATERIALS OF IBM,     */         
*/*           REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083  */         
*/*                                                                  */         
*/*02*  STATUS: HTE22D2 TSO/E Version 2.2.0             9/1/90       */         
*/*                                                                  */         
*/*01* FUNCTION: This control block serves as a prefix area for      */         
*/*           MDBs (Message Data Blocks).                            */         
*/*                                                                  */         
*/*01* DSECT-NAME: IKJCNMCB                                          */         
*/*                                                                  */         
*/*02*  ACRONYM: CNMCB                                               */         
*/*                                                                  */         
*/*01* EYE-CATCHER: IKJCNMCB                                         */         
*/*                                                                  */         
*/*02*  OFFSET: 0                                                    */         
*/*                                                                  */         
*/*02*  LENGTH: 8                                                    */         
*/*                                                                  */         
*/*01* MACRO-TYPE: Mapping macro                                     */         
*/*                                                                  */         
*/*01* NOTES: This control block is obtained by the GETMSG service   */         
*/*           routine.  The number of CNMCBs that are returned       */         
*/*           may vary from message to message.  The invoker is      */         
*/*           responsible for freeing all CNMCBs passed back from    */         
*/*           this service.                                          */         
*/*                                                                  */         
*/*01* PROCESSOR: PL/AS and Assembler                                */         
*/*                                                                  */         
*/*01* COMPONENT: 28502                                              */         
*/*                                                                  */         
*/*01* STORAGE-ATTRIBUTES:                                           */         
*/*                                                                  */         
*/*02*  SUBPOOL: 78                                                  */         
*/*                                                                  */         
*/*02*  KEY: 8                                                       */         
*/*                                                                  */         
*/*02*  RESIDENCY: Above 16MB line                                   */         
*/*                                                                  */         
*/*01* SIZE: Variable                                                */         
*/*                                                                  */         
*/*01* CREATED-BY: GETMSG Service Routine                            */         
*/*                                                                  */         
*/*01* POINTED-TO-BY: GWPL_MSG_PTR of GWPL parameter list            */         
*/*                                                                  */         
*/*01* SERIALIZATION: None                                           */         
*/*                                                                  */         
*/*01* METHOD-OF-ACCESS: %INCLUDE SYSLIB(IKJCNMCB)                   */         
*/*                                                                  */         
*/*       For the Assembler Version, the DSECT should be             */         
*/*       included by invoking the macro, IKJCNMCB.                  */         
*/*                                                                  */         
*/*       In the PL/AS Version, to get a based mapping, set          */         
*/*           %MCBBASE = 'BASED(xxxx)', where xxxx is the pointer    */         
*/*       on which the mapping is based.                             */         
*/*                                                                  */         
*/*       The MDB mapping, IEAVM105 must also be included to map     */         
*/*       the MDB portion of the CNMCBs.                             */         
*/*                                                                  */         
*/*01* CHANGE-ACTIVITY:                                              */         
*/*  Created for TSO/E Version 2.2.0                         @E22D2SC*/         
*/*                                                                  */         
*/***End of Specifications********************************************/         
* %GOTO CNMCBPLS; /*                                                            
CNMCB    DSECT                                                                  
         DS    0F                                                               
CNMCB_PREFIX   DS  0CL16                                                        
CNMCB_ID       DS  CL8                 CNMCB identifier 'IKJCNMCB'              
CNMCB_VERS     DS  H                   CNMCB version number                     
CNMCB_LEN      DS  H                   CNMCB length                             
CNMCB_NEXT_MCB DS  A                   Pointer to the next MCB if one           
*                                      exists                                   
CNMCB_MDB_AREA EQU *                   Variable length of MDB                   
         MEND                                                                   
**/%CNMCBPLS:;                                                                  
*%IF MCBBASE = '' %THEN                                                         
*   %MCBBASE = 'BDY(WORD)';                                                     
*DECLARE                                                                        
*1 CNMCB MCBBASE,                  /* CONSOLE Message Control Block  */         
*  3 CNMCB_PREFIX,                                                              
*    5 CNMCB_ID CHAR(8),           /* CNMCB identifier 'IKJCNMCB'    */         
*    5 CNMCB_VERS FIXED(15),       /* CNMCB version number           */         
*    5 CNMCB_LEN FIXED(15),        /* CNMCB length                   */         
*    5 CNMCB_NEXT_MCB PTR(31),     /* Pointer to the next MCB if one            
*                                     exists                         */         
*  3 CNMCB_MDB_AREA CHAR(*);       /* Variable length of MDB         */         
