*        %GOTO DPB18BSL;  /*                                            01000000
         MACRO                                                          02000000
         IKJDAP18                                                       03000000
DAPB18   DSECT                                                          04000000
*********************************************************************** 05000000
* THIS OPERATION CAUSES THE REQUESTED DATA SET OR DDNAME TO BE        * 06000000
* UNALLOCATED. DISPOSITION CAN BE SPECIFIED TO OVERRIDE ANY PREVIOUS  * 07000000
* DISPOSITION. LIKEWISE SYSOUT CLASS MAY BE SPECIFIED TO OVERRIDE ANY * 08000000
* PREVIOUS CLASS.                                                     * 09000000
*********************************************************************** 10000000
DA18CD   DS    CL2      DAIR ENTRY CODE                                 11000000
DA18FLG  DS    X        FUNCTIONS TO BE PERFORMED WHEN RET CODE IS 0    12000000
DA18FPE  EQU   X'80'    FUNCT PERFORMED BUT ERROR INDICATED BY RETCD    13000000
         DS    X                                                        14000000
DA18DARC DS    H        DYNAMIC ALLOCATION RETURN CODE                  15000000
DA18CTRC DS    H        CATALOG RETURN CODE AREA                        16000000
DA18PDSN DS    A        POINTER TO DSNAME TO BE SEARCHED IN DSE         17000000
DA18DDN  DS    CL8      DDNAME TO BE SEARCHED IN DSE                    18000000
DA18MNM  DS    CL8      MEMBER NAME                                     19000000
DA18SCLS DS    CL2      SYSOUT CLASS DESIRED WHEN UNALLOCATING  A       20000000
*                       SYSOUT DATA SET                                 21000000
DA18DPS2 DS    X        DATA SET DISPOSITION                            22000000
DA18KEEP EQU   X'08'    CHANGE DISP TO KEEP                             23000000
DA18DEL  EQU   X'04'    CHANGE DISP TO DELETE                           24000000
DA18CAT  EQU   X'02'    CHANGE DISP TO CATALOG                          25000000
DA18UCAT EQU   X'01'    CHANGE DISP TO UNCATLOG                         26000000
DA18CTL  DS    X        FLAGS FOR SPECIAL DAIR PROCESSING               27000000
DA18UID  EQU   X'20'    USER ID IS TO BE PREFIXED TO DSNAME             28000000
DA18PERM EQU   X'10'    UNALLOCATE PERM. ALLOCATED DSE'S      M0765     29000000
DA18JBNM DS    CL8      IGNORED AS OF OS VS/2 RELEASE 2       Y02670    30000000
*  */                                                                   31000000
         MEND                                                           32000000
* %DPB18BSL:  ;                                                         33000000
* DECLARE                                                               34000000
*   1 DAPB18    BASED(DAPB1PTR),                                        35000000
* /*******************************************************************/ 36000000
* /* THIS OPERATION CAUSES THE REQUESTED DATA SET OR DDNAME TO BE    */ 37000000
* /* UNALLOCATED. DISPOSITION CAN BE SPECIFIED TO OVERRIDE ANY       */ 38000000
* /* PREVIOUS DISPOSITION. LIKEWISE SYSOUT CLASS MAY BE SPECIFIED    */ 39000000
* /* TO OVERRIDE ANY PREVIOUS CLASS.                                 */ 40000000
* /*******************************************************************/ 41000000
*    2 DA18CD   CHAR(2),             /* DAIR ENTRY CODE              */ 42000000
*    2 DA18FLG  CHAR(2),             /* FUNCTIONS PERFORMED WHEN        43000000
*                                       RETURN CODE= 0               */ 44000000
*     3 DA18FPE  BIT(1),             /* FUNCT PERFORMED BUT ERROR       45000000
*                                       INDICATED BY RETCD           */ 46000000
*     3 *        BIT(1),             /* RESERVED                     */ 47000000
*     3 *        BIT(1),             /* RESERVED                     */ 48000000
*     3 *        BIT(1),             /* RESERVED                     */ 49000000
*     3 *        BIT(1),             /* RESERVED                     */ 50000000
*     3 *        BIT(1),             /* RESERVED                     */ 51000000
*     3 *        BIT(1),             /* RESERVED                     */ 52000000
*     3 *        BIT(1),             /* RESERVED                     */ 53000000
*    2 DA18DARC FIXED(15),           /* DYNAMIC ALLOCATION RTRN CODE */ 54000000
*    2 DA18CTRC FIXED(15),           /* CTLG RTN                     */ 55000000
*    2 DA18PDSN PTR(31),             /* POINTER TO DSNAME TO BE         56000000
*                                       SEARCHED IN DSE              */ 57000000
*    2 DA18DDN  CHAR(8),             /* DDNAME TO BE SEARCHED IN DSE */ 58000000
*    2 DA18MNM  CHAR(8),             /* MEMBER NAME                  */ 59000000
*    2 DA18SCLS CHAR(2),             /* SYSOUT CLASS DESIRED WHEN       60000000
*                                       UNALLOCATING SYSOUT DATA SET */ 61000000
*    2 DA18DPS2 CHAR(1),             /* DATA SET DISPOSITION         */ 62000000
*     3 *        BIT(1),             /* RESERVED                     */ 63000000
*     3 *        BIT(1),             /* RESERVED                     */ 64000000
*     3 *        BIT(1),             /* RESERVED                     */ 65000000
*     3 *        BIT(1),             /* RESERVED                     */ 66000000
*     3 DA18KEEP BIT(1),             /* CHANGE DISP TO KEEP          */ 67000000
*     3 DA18DEL  BIT(1),             /* CHANGE DISP TO DELETE        */ 68000000
*     3 DA18CAT  BIT(1),             /* CHANGE DISP TO CATALOG       */ 69000000
*     3 DA18UCAT BIT(1),             /* CHANGE DISP TO UNCATLOG      */ 70000000
*    2 DA18CTL  CHAR(1),             /* FLAGS FOR SPECIAL DAIR          71000000
*                                       PROCESSING                   */ 72000000
*     3 *        BIT(1),             /* RESERVED                     */ 73000000
*     3 *        BIT(1),             /* RESERVED                     */ 74000000
*     3 DA18UID  BIT(1),             /* USER ID IS TO BE PREFIXED TO    75000000
*                                       DSNAME                       */ 76000000
*     3 DA18PERM BIT(1),             /* UNALLOC PERMAMENTLY             76050000
*                                       ALLOCATED DSE  M0765         */ 76100000
*     3 *        BIT(1),             /* RESERVED                     */ 78000000
*     3 *        BIT(1),             /* RESERVED                     */ 79000000
*     3 *        BIT(1),             /* RESERVED                     */ 80000000
*     3 *        BIT(1),             /* RESERVED                     */ 80050000
*    2  DA18JBNM CHAR(8);            /* IGNORED AS OF OS VS/2           80100000
*                                       RELEASE 2             Y02670 */ 80150000
*                                                                       83000000
