*%GOTO PLAS_TSV;                                                        00001600
         MACRO                                                          00002000
         IKJEFTSV &TVDSECT=NO                                           00003000
.* A 0-999999                                                           00004000
*/***START OF SPECIFICATIONS******************************************/ 00005000
*/*                                                                  */ 00006000
*/*  MACRO NAME = IKJEFTSV                                           */ 00007000
*/*                                                                  */ 00008000
*/*  DESCRIPTIVE NAME = Mapping for the IKJEFTST parameter list      */ 00009000
*/*          ACRONYM = IKJEFTSV                                      */ 00010000
*/*                                                                  */ 00011000
*/***PROPRIETARY_STATEMENT***************************************@N1A*/ 00011101
*/*                                                                  */ 00011201
*/* Licensed Materials - Property of IBM                             */ 00011301
*/*                                                                  */ 00011401
*/* 5645-001                                                         */ 00011501
*/*                                                                  */ 00011601
*/* (C) Copyright IBM Corp. 1990, 1997                               */ 00011701
*/*                                                                  */ 00011801
*/* US Government Users Restricted Rights - Use, duplication or      */ 00011901
*/* disclosure restricted by GSA ADP Schedule Contract with          */ 00012001
*/* IBM Corp.                                                        */ 00012101
*/*                                                                  */ 00012201
*/* STATUS = HTE26D2                                                 */ 00012301
*/*                                                                  */ 00012401
*/***END_OF_PROPRIETARY_STATEMENT********************************@N1A*/ 00012501
*/*                                                                  */ 00017000
*/* DSECT NAME = IKJEFTSV                                            */ 00018000
*/*                                                                  */ 00019000
*/* COMPONENT = Scheduler (28502)                                    */ 00020000
*/*                                                                  */ 00021000
*/* EYE-CATCHER = Not applicable                                     */ 00022000
*/*                                                                  */ 00023000
*/* STORAGE ATTRIBUTES =                                             */ 00024000
*/*  SUBPOOL = Determined by the invoker of IKJEFTSV                 */ 00025000
*/*  KEY = 8                                                         */ 00026000
*/*  RESIDENCY = Determined by the invoker of IKJEFTSV               */ 00027000
*/*                                                                  */ 00028000
*/* SIZE = See assembler listing                                     */ 00029000
*/*                                                                  */ 00030000
*/* CREATED BY =                                                     */ 00031000
*/*     Invoker of IKJEFTSV                                          */ 00032000
*/*                                                                  */ 00033000
*/* DELETED BY =                                                     */ 00034000
*/*     Invoker of IKJEFTSV                                          */ 00035000
*/*                                                                  */ 00036000
*/* POINTED TO BY =                                                  */ 00037000
*/*     Register 1 on entry to IKJEFTST.                             */ 00038000
*/*                                                                  */ 00039000
*/* SERIALIZATION =                                                  */ 00040000
*/*     None required                                                */ 00041000
*/*                                                                  */ 00042000
*/*  FUNCTION = IKJEFTSV is the mapping macro for the standard       */ 00043000
*/*             parameter list passed to IKJEFTST via register 1.    */ 00044000
*/*                                                                  */ 00045000
*/*  Register 1                                                      */ 00046000
*/*  +--------+    +--------------+    +-------------+               */ 00047000
*/*  |        |--->|ECTPARM@      |--->|ECTPARM      |               */ 00048000
*/*  +--------+    |--------------|    |-------------|               */ 00049000
*/*                |RESERVED@     |--->|RESERVED     |               */ 00050000
*/*                |--------------|    |-------------|               */ 00051000
*/*                |TOKEN@        |--->|TOKEN        |               */ 00052000
*/*                |--------------|    |-------------|               */ 00053000
*/*                |ERROR@        |--->|ERROR        |               */ 00054000
*/*                |--------------|    |-------------|               */ 00055000
*/*                |ABEND@        |--->|ABEND        |               */ 00056000
*/*                |--------------|    |-------------|               */ 00057000
*/*                |REASON@       |--->|REASON       |               */ 00058000
*/*                +--------------+    +-------------+               */ 00059000
*/*                                                                  */ 00060000
*/*  MACRO-TYPE = Mapping macro                                      */ 00061000
*/*                                                                  */ 00062000
*/*  NOTES = None                                                    */ 00063000
*/*                                                                  */ 00064000
*/*  PROCESSOR = BAL                                                 */ 00065000
*/*                                                                  */ 00066000
*/*  INVOCATION = MACRO SPECIFICATION IS:                            */ 00067000
*/*                                                                  */ 00068000
*/*             IKJEFTSV TVDSECT=XX                                  */ 00069000
*/*               TVDSECT=YES  IF DON'T WANT TO GET STORAGE,         */ 00070000
*/*                 THEN CODE      LA    REG,MYTVSTOR  *CALLER AREA* */ 00071000
*/*                                USING TVDSECTD,REG                */ 00072000
*/*               TVDSECT=NO  IS THE DEFAULT.                        */ 00073000
*/*                                                                  */ 00074000
*/*  CHANGE-ACTIVITY =                                               */ 00075000
*/*                                                                  */ 00076000
*/*  Created for TSO/E 2.2.0                                 @E22D2E9*/ 00077000
*/*  PG10120 - Added the RESERVED and ERROR parameters.      @PG10120*/ 00078000
*/*                                                                  */ 00079000
*/*  PG10209 - Define EFTST_TOKEN with a length of 16        @PG10209*/ 00080000
*/*                                                                  */ 00081000
*/*  OW17712 - Length of EFTST_RESERVED, EFTST_ABEND and             */ 00081200
*/*            EFTST_REASON changed from 32 to 4 bytes to            */ 00081400
*/*            match the PLX version of the mapping macro.   @WA17712*/ 00081600
*/*                                                                  */ 00081800
*/* FLAG REASON   RELEASE DATE     ORIGIN                        @N1A*/ 00081901
*/* ---- ------   ------- -------- ------                        @N1A*/ 00082001
*/* $N1= COPYRITE HTE26D2 19970218 VOHS: Insert/Update Copyright @N1A*/ 00082101
*/*                                                                  */ 00082201
*/***END OF SPECIFICATIONS********************************************/ 00082300
         EJECT                                                          00083000
*/********************************************************************/ 00084000
*/*                                                                  */ 00085000
*/*  IKJEFTSV - Parameter List for IKJEFTST                          */ 00086000
*/*                                                                  */ 00087000
*/********************************************************************/ 00088000
         SPACE                                                          00089000
**/                                                                     00090000
*       SET UP DSECT CARD IF TVDSECT=YES ON MACRO                       00091000
         AIF   ('&TVDSECT' EQ 'NO').TVBAL1  **MACRO STATEMENT**         00092000
TVDSECTD DSECT                                                          00093000
.TVBAL1  ANOP                            **MACRO STATEMENT**            00094000
         DS 0D                           Align on double-word boundary  00095000
IKJEFTSV DS CL60                         Total bytes                    00096000
*                                        in structure          @PG10120 00097000
         ORG   IKJEFTSV                                                 00098000
EFTST_ECTPARM@  DS AL4                   Pointer to the                 00099000
*                                        ECT address.          @PG10120 00100000
             ORG EFTST_ECTPARM@                                @PG10120 00101000
EFTST_ECTPARM@_HIBIT DS BL1              This bit must be OFF  @PG10120 00102000
             DS 0F                       Reach next WORD bdy   @PG10120 00103000
EFTST_RESERVED@ DS AL4                   Pointer to RESERVED   @PG10120 00104000
             ORG EFTST_RESERVED@                               @PG10120 00105000
EFTST_RESERVED@_HIBIT DS BL1             End of list           @PG10120 00106000
                   DS 0F                 Reach next WORD bdy   @PG10120 00107000
EFTST_TOKEN@ DS AL4                      Pointer to TOKEN data          00108000
             ORG EFTST_TOKEN@                                           00109000
EFTST_TOKEN@_HIBIT DS BL1                End of list                    00110000
                   DS 0F                 Reach next fullword boundary   00111000
EFTST_ERROR@ DS AL4                      Ptr to ERROR data     @PG10120 00112000
             ORG EFTST_ERROR@                                  @PG10120 00113000
EFTST_ERROR@_HIBIT DS BL1                End of list           @PG10120 00114000
                   DS 0F                 Reach next WORD bdy   @PG10120 00115000
EFTST_ABEND@ DS AL4                      Pointer to ABEND data          00116000
             ORG EFTST_ABEND@                                           00117000
EFTST_ABEND@_HIBIT DS BL1                End of list                    00118000
                   DS 0F                 Reach next fullword boundary   00119000
EFTST_REASON@ DS AL4                     Pointer to REASON data         00120000
              ORG EFTST_REASON@                                         00121000
EFTST_REASON@_HIBIT DS BL1               End of list                    00122000
                    DS 0F                Reach next fullword boundary   00123000
*                                                                       00124000
*/********************************************************************/ 00125000
*/*                                                                  */ 00126000
*/*  Begin declarations for storage pointed to by above addresses:   */ 00127000
*/*                                                                  */ 00128000
*/********************************************************************/ 00129000
*                                                                       00130000
EFTST_ECTPARM  DS AL4                    ECT address.                   00131000
*                                        If zero is specified, then     00132000
*                                        the address of the primary     00133000
*                                        ECT is assumed                 00134000
*                                        and returned.       @PG10120   00135000
EFTST_RESERVED DS BL.32                  Reserved field      @WA17712   00136401
               DS 0F                     Force to a fullword boundary   00137000
*                                                            @PG10209   00138000
EFTST_TOKEN    DS CL16                   Token passed to IKJEFTST.  A   00139000
*                                          list of four fullwords.      00140000
*                                                            @PG10209   00141000
              ORG EFTST_TOKEN                                @PG10209   00142000
EFTST_TOKEN1   DS FL4                        1st fullword    @PG10120   00143000
EFTST_TOKEN2   DS FL4                        2nd fullword    @PG10120   00144000
EFTST_TOKEN3   DS FL4                        3rd fullword    @PG10120   00145000
EFTST_TOKEN4   DS FL4                        4th fullword    @PG10120   00146000
*                                                            @PG10120   00147000
EFTST_ERROR    DS FL4                    Error reason code when         00148000
*                                          IKJEFTST fails to            00149000
*                                          complete                     00150000
*                                          successfully.     @PG10120   00151000
EFTST_ABEND    DS BL.32                  Internal error abend code      00152601
*                                         returned to caller @WA17712   00153301
EFTST_REASON   DS BL.32                  Internal error reason code     00154001
*                                          returned to                  00155000
*                                          caller.           @OW17712   00156401
**/                                                                     00157000
         MEND                                                           00158000
 %PLAS_TSV: ;                                                           00159000
 /***START OF SPECIFICATIONS******************************************/ 00160000
 /*                                                                  */ 00161000
 /*  MACRO-NAME = IKJEFTSV                                           */ 00162000
 /*                                                                  */ 00163000
 /*  DESCRIPTIVE-NAME = Mapping for the IKJEFTST parameter list      */ 00164000
 /*                                                                  */ 00165000
 /*  COPYRIGHT =                                                     */ 00166000
 /*            5685-025 COPYRIGHT (C) IBM CORP. 1990                 */ 00167000
 /*            LICENSED MATERIAL PROGRAM - PROPERTY OF IBM           */ 00168000
 /*            REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083.*/ 00169000
 /*                                                                  */ 00170000
 /* DSECT NAME = IKJEFTSV                                            */ 00171000
 /*                                                                  */ 00172000
 /* COMPONENT = Scheduler (28502)                                    */ 00173000
 /*                                                                  */ 00174000
 /* EYE-CATCHER = Not applicable                                     */ 00175000
 /*                                                                  */ 00176000
 /* STORAGE ATTRIBUTES =                                             */ 00177000
 /*  SUBPOOL = Determined by the invoker of IKJEFTSV                 */ 00178000
 /*  KEY = 8                                                         */ 00179000
 /*  RESIDENCY = Determined by the invoker of IKJEFTSV               */ 00180000
 /*                                                                  */ 00181000
 /* SIZE = See assembler listing                                     */ 00182000
 /*                                                                  */ 00183000
 /* CREATED BY =                                                     */ 00184000
 /*     Invoker of IKJEFTSV                                          */ 00185000
 /*                                                                  */ 00186000
 /* DELETED BY =                                                     */ 00187000
 /*     Invoker of IKJEFTSV                                          */ 00188000
 /*                                                                  */ 00189000
 /* POINTED TO BY =                                                  */ 00190000
 /*     Register 1 on entry to IKJEFTST.                             */ 00191000
 /*                                                                  */ 00192000
 /* SERIALIZATION =                                                  */ 00193000
 /*     None required                                                */ 00194000
 /*                                                                  */ 00195000
 /*  FUNCTION = IKJEFTSV is the mapping macro for the standard       */ 00196000
 /*             parameter list passed to IKJEFTST via register 1.    */ 00197000
 /*                                                                  */ 00198000
 /*  Register 1                                                      */ 00199000
 /*  +--------+    +--------------+    +-------------+               */ 00200000
 /*  |        |--->|ECTPARM@      |--->|ECTPARM      |               */ 00201000
 /*  +--------+    |--------------|    |-------------|               */ 00202000
 /*                |RESERVED@     |--->|RESERVED     |               */ 00203000
 /*                |--------------|    |-------------|               */ 00204000
 /*                |TOKEN@        |--->|TOKEN        |               */ 00205000
 /*                |--------------|    |-------------|               */ 00206000
 /*                |ERROR@        |--->|ERROR        |               */ 00207000
 /*                |--------------|    |-------------|               */ 00208000
 /*                |ABEND@        |--->|ABEND        |               */ 00209000
 /*                |--------------|    |-------------|               */ 00210000
 /*                |REASON@       |--->|REASON       |               */ 00211000
 /*                +--------------+    +-------------+               */ 00212000
 /*                                                                  */ 00213000
 /*  MACRO-TYPE = Mapping macro                                      */ 00214000
 /*                                                                  */ 00215000
 /*  NOTES = None                                                    */ 00216000
 /*                                                                  */ 00217000
 /*  PROCESSOR = PL/AS                                               */ 00218000
 /*                                                                  */ 00219000
 /*  MACRO-SIZE = See listing                                        */ 00220000
 /*                                                                  */ 00221000
 /*  INVOCATION =                                                    */ 00222000
 /*         %TVPLNEW='1' - - - - - IF DON'T WANT BASED               */ 00223000
 /*         %TVPLBASE='ANY BASE' - IF TVPLNEW ISN'T SPECIFIED,       */ 00224000
 /*                                DEFAULTS TO BASED(TVPLPTR)        */ 00225000
 /*         %INCLUDE SYSLIB(IKJEFTSV)                                */ 00226000
 /*                                                                  */ 00227000
 /*                                                                  */ 00228000
 /*  CHANGE-ACTIVITY =                                               */ 00229000
 /*                                                                  */ 00230000
 /*  Created for TSO/E 2.2.0                                 @E22D2E9*/ 00231000
 /*  PG10120 - Added the RESERVED and ERROR parameters.      @PG10120*/ 00232000
 /*                                                                  */ 00233000
 /***END OF SPECIFICATIONS********************************************/ 00234000
 @EJECT;                                                                00235000
 /********************************************************************/ 00236000
 /*                                                                  */ 00237000
 /*  IKJEFTSV - Parameter List for IKJEFTST                          */ 00238000
 /*                                                                  */ 00239000
 /********************************************************************/ 00240000
 @SPACE;                                                                00241000
 DECLARE                                                                00242000
  1 IKJEFTSV                                                            00243000
*%IF TVPLNEW='1' %THEN                                                  00244000
*%GOTO TVPLSKIP1;                                                       00245000
*%IF TVPLBASE='' %THEN                                                  00246000
*%TVPLBASE='BASED(TVPLPTR)';                                            00247000
*           TVPLBASE                                                    00248000
*%TVPLSKIP1:;                                                           00249000
                           BDY(DWORD),                                  00250000
    2 EFTST_ECTPARM@       PTR(31),   /* Pointer to the                 00251000
                                         ECT address.        @PG10120*/ 00252000
      3 EFTST_ECTPARM@_HIBIT BIT(1),  /* Bit must be OFF     @PG10120*/ 00253000
    2 EFTST_RESERVED@      PTR(31),   /* Pointer to RESERVED @PG10120*/ 00254000
      3 EFTST_RESERVED@_HIBIT BIT(1), /* End of list         @PG10120*/ 00255000
    2 EFTST_TOKEN@         PTR(31),   /* Pointer to TOKEN data       */ 00256000
      3 EFTST_TOKEN@_HIBIT BIT(1),    /* Bit must be OFF     @PG10120*/ 00257000
    2 EFTST_ERROR@         PTR(31),   /* Ptr to ERROR data   @PG10120*/ 00258000
      3 EFTST_ERROR@_HIBIT BIT(1),    /* End of list         @PG10120*/ 00259000
    2 EFTST_ABEND@         PTR(31),   /* Pointer to ABEND data       */ 00260000
      3 EFTST_ABEND@_HIBIT BIT(1),    /* Indicates end of list       */ 00261000
    2 EFTST_REASON@        PTR(31),   /* Pointer to REASON data      */ 00262000
      3 EFTST_REASON@_HIBIT BIT(1),   /* Indicates end of list       */ 00263000
                                                                        00264000
 /********************************************************************/ 00265000
 /*                                                                  */ 00266000
 /*  Begin declarations for storage pointed to by above addresses:   */ 00267000
 /*                                                                  */ 00268000
 /********************************************************************/ 00269000
                                                                        00270000
    2 EFTST_ECTPARM        PTR(31),   /* ECT address.                   00271000
                                         If zero is specified, then     00272000
                                         the address of the primary     00273000
                                         ECT is assumed and returned.   00274000
                                         and returned.       @PG10120*/ 00275000
    2 EFTST_RESERVED       BIT(32),   /* Reserved field      @PG10120*/ 00276000
    2 EFTST_TOKEN,                    /* Token passed                   00277000
                                           to IKJEFTST.  A list of      00278000
                                           four fullwords:   @PG10120*/ 00279000
      3 EFTST_TOKEN1       PTR(31),   /*     1st fullword    @PG10120*/ 00280000
      3 EFTST_TOKEN2       PTR(31),   /*     2nd fullword    @PG10120*/ 00281000
      3 EFTST_TOKEN3       PTR(31),   /*     3rd fullword    @PG10120*/ 00282000
      3 EFTST_TOKEN4       PTR(31),   /*     4th fullword    @PG10120*/ 00283000
    2 EFTST_ERROR          FIXED(31), /* Error reason code when         00284000
                                           IKJEFTST fails to            00285000
                                           complete                     00286000
                                           successfully.     @PG10120*/ 00287000
    2 EFTST_ABEND          BIT(32),   /* Internal error abend code      00288000
                                           returned to                  00289000
                                           caller.                   */ 00290000
    2 EFTST_REASON         BIT(32);   /* Internal error reason code     00291000
                                           returned to                  00292000
                                           caller.           @PG10120*/ 00293000
