*        %GOTO STLPLS; /*                                                       
         MACRO                                                                  
         IKJEGSTL                                                               
***********************************************************************         
*                                                                     *         
*        THIS IS THE DSECT MAPPING THE ESTAE PARMAMETER LIST          *         
*        PASSED TO THE TSO TEST ESTAE EXIT ROUTINES.                  *         
*                                                                     *         
*   STATUS -- JBB2115 TSO/E FOR MVS/XA 01/01/82               @E2115B8*         
*                                                                     *         
*   COPYRIGHT --                                              @E2115B8*         
*      5685-025 COPYRIGHT (C) IBM CORP. 1982,                 @E2115B8*         
*      LICENSED MATERIAL PROGRAM - PROPERTY OF IBM            @E2115B8*         
*      REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083. @E2115B8*         
*                                                                     *         
*                                                                     *         
*   CHANGE ACTIVITY --                                        @E2115B8*         
*                   E2115B8 - JBB2115 TSO/E FOR MVS/XA        @E2115B8*         
*                                                                     *         
*                                                                     *         
***********************************************************************         
*A-000000-999999                                              @E2115B8*         
IKJEGSTL DSECT                                                                  
STLID    DS    CL8 -          ID: IKJEGSTL                                      
STLRETRY DS    F -            ADDRESS OF RETRY ROUTINE                          
STLABENT DS    F -            ADDRESS OF ABEND TABLE                            
STLENTRY DS    F -            ADDRESS OF CSECT THAT ISSUED ESTAE                
STLCSCTN DS    CL8 -          NAME OF CSECT THAT ISSUED ESTAE                   
STLLOADN DS    CL8 -          NAME OF LOAD MODULE                               
STLEPTN  DS    CL8 -          NAME OF ENTRY POINT                               
STLLEVEL DS    CL16 -         MODULE LEVEL (DATE AND PTF(PRODUCT) NO.           
STLINSRT DS    0H -           2ND INSERT FOR 2ND LEVEL MESSAGE                  
STLINSL  DS    H -            LENGTH OF COMPLETE TEXT NAME INSERT               
STLINSX  DS    H -            FOR USE BY IKJEGIO                                
STLTEXTN DS    C -            ABENDING MODULE TEXT NAME                         
**/                                                                             
         MEND                                                                   
* %STLPLS: ;                                                                    
*/********************************************************************/         
*/*                                                                  */         
*/*      THIS IS THE DSECT MAPPING THE ESTAE PARMAMETER LIST         */         
*/*      PASSED TO THE TSO TEST ESTAE EXIT ROUTINES.                 */         
*/*                                                                  */         
*/* STATUS -- JBB2115 TSO/E FOR MVS/XA 01/01/82              @E2115B8*/         
*/*                                                                  */         
*/* COPYRIGHT --                                             @E2115B8*/         
*/*    5685-025 COPYRIGHT (C) IBM CORP 1982,                 @E2115B8*/         
*/*    LICENSED MATERIAL - PROGRAM PROPERTY OF IBM           @E2115B8*/         
*/*    REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083.@E2115B8*/         
*/*                                                                  */         
*/* CHANGE ACTIVITY --                                       @E2115B8*/         
*/*                 E2115B8 - JBB2115 TSO/E FOR MVS/XA       @E2115B8*/         
*/*                                                                  */         
*/*                                                                  */         
*/********************************************************************/         
*/*A-000000-999999                                           @E2115B8*/         
*DCL 1 IKJEGSTL BASED,            /* STA PARAMETER LIST              */         
*      3 STLID    CHAR(8),        /* ID: IKJEGSTL                    */         
*      3 STLRETRY PTR(31),        /* ADDRESS OF RETRY ROUTINE        */         
*      3 STLABENT PTR(31),        /* ADDRESS OF ABEND TABLE          */         
*      3 STLENTRY PTR(31),        /* ADDRESS OF CSECT THAT ISSUED               
*                                                              ESTAE */         
*      3 STLCSCTN CHAR(8),        /* NAME OF CSECT THAT ISSUED ESTAE */         
*      3 STLLOADN CHAR(8),        /* NAME OF LOAD MODULE             */         
*      3 STLEPTN  CHAR(8),        /* NAME OF ENTRY POINT             */         
*      3 STLLEVEL CHAR(16),       /* MODULE LEVEL (DATE AND PTF OR              
*                                    PRODUCT NUMBER                  */         
*      3 STLINSRT,                /* 2ND INSERT FOR 2ND LEVEL MESSAGE*/         
*        5 STLINSL FIXED(15),     /* LENGTH OF TEXT NAME INSERT      */         
*        5 STLINSX FIXED(15),     /* USED BY IKJEGIO                 */         
*        5 STLTEXTN CHAR(*);      /* FAILING MODULE TEXT NAME        */         
