*      %GOTO PDEPLS; /*                                                         
         MACRO                                                                  
         IKJPARMA                                                               
***********************************************************************         
*  IKJPARMA -                                                 @E2115KR*         
*     MAPPING MACRO FOR ADDRESS PARAMETER DESCRIPTOR ELEMENT (PDE)    *         
*       AND EXPRESSION-VALUE PDE BUILT BY IKJPARS (VIA IKJPOSIT) FOR  *         
*       TSO TEST SUBCOMMANDS.                                         *         
*                                                                     *         
*   STATUS -- HTE21D2 TSO/E FOR MVS/XA 12/01/88               @E1502C6*         
*                                                                     *         
*   COPYRIGHT --                                              @E2115KR*         
*      5685-025 COPYRIGHT (C) IBM CORP. 1982, 1988,           @E1502C6*         
*      THIS PRODUCT CONTAINS RESTRICTED MATERIALS OF IBM,     @E1402C4*         
*      REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083. @E2115KR*         
*                                                                     *         
*                                                                     *         
*   CHANGE ACTIVITY --                                        @E2115KR*         
*                   E2115KR - JBB2115 TSO/E FOR MVS/XA        @E2115KR*         
*                   E1402C4 - HTE1402 TSO/E RELEASE 4 VECTOR  @E1402C4*         
*                             ARCHITECTURE ENHANCEMENTS       @E1402C4*         
*                   E1502C6 - HTE21D2 TSO/E RELEASE 5         @E1502C6*         
*                             EXTENDED ARCHITECTURE           @E1502C6*         
*                             EXTENSIONS ENHANCEMENTS         @E1502C6*         
*                                                                     *         
*                                                                     *         
***********************************************************************         
IKJPARMA DSECT                DESCRIPTION OF ADDRESS PDE.                       
         SPACE                                                                  
PDELDNAM DS    A              POINTER TO LOAD NAME.                             
PDELEN1  DS    H              LENGTH OF LOAD NAME.                              
PDEFLG1  DS    X              FLAGS FOR LOAD NAME.                              
LDNAMFLG EQU   B'10000000'    INDICATES PRESENCE OF LOAD NAME.                  
PDERSV1  DS    X              RESERVED.                                         
PDECTNAM DS    A              POINTER TO ENTRY NAME.                            
PDELEN2  DS    H              LENGTH OF ENTRY NAME.                             
PDEFLG2  DS    X              FLAGS FOR ENTRY NAME.                             
CTNAMFLG EQU   B'10000000'    INDICATES PRESENCE OF ENTRY NAME.                 
PDEFLGX  DS    X              ADDRESS TYPE FLAGS (EXTENDED)  @E1402C4           
SVECR    EQU   B'10000000'    SINGLE VECTOR REGISTER ELEMENT @E1402C4           
LVECR    EQU   B'01000000'    VECTOR REGISTER PAIR ELEMENT   @E1402C4           
SVECRX   EQU   B'00100000'    COMPLETE SINGLE VECTOR REG     @E1402C4           
LVECRX   EQU   B'00010000'    COMPLETE VECTOR REGISTER PAIR  @E1402C4           
VMRFLG   EQU   B'00001000'    VECTOR MASK REGISTER           @E1502C6           
ARFLG    EQU   B'00000100'    ACCESS REGISTER ELEMENT        @E1502C6           
PDEADRPT DS    A              POINTER TO ADDRESS STRING.                        
PDELEN3  DS    H              LENGTH OF ADDRESS STRING.                         
PDEFLG3  DS    X              FLAGS FOR ADDRESS STRING.                         
AFLG     EQU   B'10000000'    INDICATES PRESENCE OF ADDRESS STRING.             
BFLG     EQU   B'01000000'    INDICATES 31 BIT INDIRECT ADDR @E2115KR           
PDEUFLG  DS    X              USER FLAG FIELD.               @E2115KR           
         SPACE                                                                  
PDEFLG4  DS    X              ADDRESS TYPE FLAGS.                               
ABSADDR  EQU   B'00000000'    ABSOLUTE ADDRESS.                                 
SYMADDR  EQU   B'10000000'    SYMBOLIC ADDRESS.                                 
RELADDR  EQU   B'01000000'    RELATIVE ADDRESS.                                 
GENR     EQU   B'00100000'    GENERAL REGISTER.                                 
LFPR     EQU   B'00010000'    DOUBLE PREC. FLT. PT. REGISTER.                   
SFPR     EQU   B'00001000'    SINGLE PREC. FLT. PT. REGISTER.                   
CTONLY   EQU   B'00000100'    ENTRY NM NOT FOLLOWED BY SYM OR REL.              
PD4NULL  EQU   B'00000010'    PDEFLG4 IS EMPTY (SEE PDEFLGX)  @E1402C4          
ABSCOMPL EQU   B'11111111'    COMPLEMENT FOR ABSOLUTE TEST.                     
         SPACE                                                                  
PDESIGN  DS    C              EXPRESSION SIGN.                                  
PDEINDCT DS    H              INDIRECT COUNT.                                   
PDEEXPTR DS    A              PTR TO 1ST EXPRESSION PDE.                        
PDEUSER  DS    A              RESOLVED ADDR OR SIB POINTER.                     
PDESIB   EQU   X'80'          INDICATES USER WORD POINTS TO SIB.                
PDECONVD EQU   X'40'          INDICATES ADDRESS IS CONVERTED.                   
PDEADLST EQU   X'20'          INDICATES PDE IS ONE OF A LIST.                   
PDEYECH  EQU   X'10'          INDICATES PDE IS USELESS.                         
PDEWRITE EQU   X'08'          INDICATES ADDRESS IS WRITABLE.                    
PDEVLDCK EQU   X'04'          INDICATES NO VALIDITY CHECK.    @E2115B6          
         SPACE                                                                  
PDECHAIN DS    A              CHAIN PTR FIELD FOR ADDRESS LIST.                 
         SPACE                                                                  
         ORG   PDECHAIN       IN AN ADDRESS RANGE, PDE FOR ADDR2                
*                              FOLLOWS PDE FOR ADDR1.                           
PDE2LDNA DS    A              POINTER TO LOAD NAME.                             
PDE2LEN1 DS    H              LENGTH OF LOAD NAME.                              
PDE2FLG1 DS    X              FLAGS FOR LOAD NAME.                              
PDE2RSV1 DS    X              RESERVED.                                         
PDE2CTNA DS    A              POINTER TO ENTRY NAME.                            
PDE2LEN2 DS    H              LENGTH OF ENTRY NAME.                             
PDE2FLG2 DS    X              FLAGS FOR ENTRY NAME.                             
PDE2FLGX DS    X              ADDRESS TYPE FLAGS              @E1402C4          
PDE2ADRP DS    A              POINTER TO ADDRESS STRING.                        
PDE2LEN3 DS    H              LENGTH OF ADDRESS STRING.                         
PDE2FLG3 DS    X              FLAGS FOR ADDRESS STRING.                         
PDE2UFLG DS    X             USER FLAG FIELD.                 @E2115KR          
         SPACE                                                                  
PDE2FLG4 DS    X              ADDRESS TYPE FLAGS.                               
PDE2SIGN DS    C              EXPRESSION SIGN.                                  
PDE2INDC DS    H              INDIRECT COUNT.                                   
PDE2EXPT DS    A              PTR TO 1ST EXPRESSION PDE.                        
PDE2USER DS    A              RESOLVED ADDR OR SIB POINTER.                     
         SPACE                                                                  
PDE2CHAI DS    A              CHAIN POINTER FOR ADDR LIST.                      
* MAPPING FOR EXPRESSION VALUE PDE                            @E2115KR          
PDEXPVAL DSECT                EXPRESSION VALUE PDE            @E2115KR          
PDEVADRP DS    A              POINTER TO ADDRESS STRING       @E2115KR          
PDEVLEN3 DS    H              LENGTH OF ADDRESS STRING        @E2115KR          
PDEVFLG6 DS    X              FLAG BYTE                       @E2115KR          
PDEVAFLG EQU   B'10000000'    INDICATES EXPRESSION SPECIFIED  @E2115KR          
PDEVBFLG EQU   B'01000000'    INDICATES 31 BIT INDIRECT ADDR  @E2115KR          
PDEVRSVD DS    X              RESERVED BYTE                   @E2115KR          
PDEVFLG5 DS    X              FLAG BYTE, TYPE OF EXP VALUE    @E2115KR          
PDEVDEC  EQU   B'00000100'    DECIMAL EXPRESSION VALUE        @E2115KR          
PDEVHEX  EQU   B'00000010'    HEXADECIMAL EXPRESSION VALUE    @E2115KR          
PDEVSIGN DS    C              SIGN OF NEXT EXPRESSION         @E2115KR          
PDEVINCT DS    H              INDIRECT COUNT                  @E2115KR          
PDEVNEXT DS    A              PTR TO NEXT EXP VALUE PDE       @E2115KR          
**/                                                                             
         MEND                                                                   
* %PDEPLS: ;                                                                    
*/********************************************************************/         
*/*  IKJPARMA -                                              @E2115KR*/         
*/*     MAPPING MACRO FOR ADDRESS PARAMETER DESCRIPTOR ELEMENT (PDE) */         
*/*       AND EXPRESSION-VALUE PDE BUILT BY IKJPARS (VIA IKJPOSIT)   */         
*/*       FOR TSO TEST SUBCOMMANDS.                                  */         
*/*                                                                  */         
*/* STATUS -- HTE21D2 TSO/E FOR MVS/XA 12/01/88              @E1502C6*/         
*/*                                                                  */         
*/* COPYRIGHT --                                             @E2115KR*/         
*/*    5685-025 COPYRIGHT (C) IBM CORP 1982, 1988,           @E1502C6*/         
*/*    THIS PRODUCT CONTAINS RESTRICTED MATERIALS OF IBM,    @E1402C4*/         
*/*    REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083.@E2115KR*/         
*/*                                                                  */         
*/* CHANGE ACTIVITY --                                       @E2115KR*/         
*/*                 E2115KR - JBB2115 TSO/E FOR MVS/XA       @E2115KR*/         
*/*                 E1402C4 - HTE1402 TSO/E RELEASE 4 VECTOR @E1402C4*/         
*/*                           ARCHITECTURE ENHANCEMENTS      @E1402C4*/         
*/*                 E1502C6 - HTE21D2 TSO/E RELEASE 5        @E1502C6*/         
*/*                           EXTENDED ARCHITECTURE          @E1502C6*/         
*/*                           EXTENSIONS ENHANCEMENTS        @E1502C6*/         
*/*                                                                  */         
*/*                                                                  */         
*/********************************************************************/         
* DCL 1 IKJPARMA BASED,           /* ADDRESS PDE                     */         
*       2 PDELDNAM PTR(31),       /* POINTER TO LOADNAME             */         
*       2 PDELEN1 FIXED(15),      /* LENGTH OF LOAD NAME             */         
*       2 PDEFLG1 BIT(8),         /* FLAGS FOR LOAD NAME             */         
*         3 LDNAMFLG BIT(1),      /* INDICATES PRESENCE OF LOAD NAME */         
*         3 * BIT(7),                                                           
*       2 PDERSV1 CHAR(1),        /* RESERVED                        */         
*       2 PDECTNAM PTR(31),       /* POINTER TO ENTRY NAME           */         
*       2 PDELEN2 FIXED(15),      /* LENGTH OF ENTRY NAME            */         
*       2 PDEFLG2 BIT(8),         /* FLAGS FOR ENTRY NAME            */         
*         3 CTNAMFLG BIT(1),      /* INDICATES PRESENCE OF ENTRY NAME*/         
*         3 * BIT(7),                                                           
*       2 PDEFLGX CHAR(1),        /* ADDRESS TYPE FLAGS      @E1402C4*/         
*         3 SVECR  BIT(1),        /* SINGLE VEC REG ELEMENT  @E1402C4*/         
*         3 LVECR  BIT(1),        /* VECTOR REG PAIR ELEMENT @E1402C4*/         
*         3 SVECRX BIT(1),        /* COMPLETE VEC REGISTER   @E1402C4*/         
*         3 LVECRX BIT(1),        /* COMPLETE VEC REG PAIR   @E1402C4*/         
*         3 VMRFLG BIT(1),        /* VECTOR MASK REGISTER    @E1502C6*/         
*         3 ARFLG  BIT(1),        /* ACCESS REGISTER ELEMENT @E1502C6*/         
*         3 *      BIT(2),        /* UNUSED FLAG BITS        @E1502C6*/         
*       2 PDEADRPT PTR(31),       /* POINTER TO ADDRESS STRING       */         
*       2 PDELEN3 FIXED(15),      /* LENGTH OF ADDRESS STRING        */         
*       2 PDEFLG3 BIT(8),         /* FLAGS FOR ADDRESS STRING        */         
*         3  AFLG BIT(1),         /* INDICATES PRESENCE OF ADDRESS              
*                                                             STRING */         
*         3  BFLG BIT(1),         /* INDICATES 31 BIT INDIRECT                  
*                                    ADDRESSING              @E2115KR*/         
*         3 * BIT(6),             /* UNUSED FLAG BITS        @E2115KR*/         
*       2 PDEUFLG CHAR(1),        /* USER FLAG FIELD         @E2115KR*/         
*         3 PDESIB BIT(1),        /* INDICATES ADDRESS IS SYMNBOLIC  */         
*         3 PDECONVD BIT(1),      /* INDICATES ADDRESS IS CONVERTED  */         
*         3 PDEADLST BIT(1),      /* INDICATES PDE IS ONE OF A LIST  */         
*         3 PDEYECH BIT(1),       /* INDICATES PDE IS USELESS        */         
*         3 PDEWRITE BIT(1),      /* INDICATES ADDRESS IS WRITABLE   */         
*         3 PDEVLDCK BIT(1),      /* INDICATES NO VALIDITY CHECK.               
*                                                            @E2115B6*/         
*         3 * BIT(2),                                                           
*       2 PDEFLG4 BIT(8),         /* ADDRESS TYPE FLAGS              */         
*         3 SYMADDR BIT(1),       /* SYMBOLIC ADDRESS                */         
*         3 RELADDR BIT(1),       /* RELATIVE ADDRESS                */         
*         3 GENR BIT(1),          /* GENERAL REGISTER                */         
*         3 LFPR BIT(1),          /* DOUBLE PREC. FLT. PT. REGISTER  */         
*         3 SFPR BIT(1),          /* SINGLE PREC. FLT. PT. REGISTER  */         
*         3 CTONLY BIT(1),        /* ENTRY NAME NOT FOLLOWED BY A               
*                                       SYMBOLIC OR RELATIVE ADDRESS */         
*         3 PD4NULL BIT(1),       /* PDEFLG4 IS EMPTY       @E1402C4 */         
*         3 * BIT(1),             /*                        @E1402C4 */         
*       2 PDESIGN CHAR(1),        /* EXPRESSION SIGN                 */         
*       2 PDEINDCT FIXED(15),     /* INDIRECT COUNT                  */         
*       2 PDEEXPTR PTR(31),       /* PTR TO 1ST EXPRESSION PDE       */         
*       2 PDEUSER PTR(31),        /* RESOLVED ADDR OR SIB POINTER    */         
*       2 PDECHAIN  PTR(31),      /* CHAIN PTR FIELD FOR ADDRESS LIST -         
*           IN AN ADDRESS RANGE, PDE FOR ADDR2 FOLLOWS PDE FOR ADDR1 */         
*         3 PDE2LDNA PTR(31),     /* POINTER TO LOAD NAME            */         
*       2 PDE2LEN1 FIXED(15),     /* LENGTH OF LOAD NAME             */         
*       2 PDE2FLG1 BIT(8),        /* FLAGS FOR LOAD NAME             */         
*         3 LDNM2FLG BIT(1),      /* INDICATES PRESENCE OF LOAD NAME */         
*         3 * BIT(7),                                                           
*       2 PDE2RSV1 CHAR(1),       /* RESERVED                        */         
*       2 PDE2CTNA PTR(31),       /* POINTER TO ENTRY NAME           */         
*       2 PDE2LEN2 FIXED(15),     /* LENGTH OF ENTRY NAME            */         
*       2 PDE2FLG2 BIT(8),        /* FLAGS FOR ENTRY NAME            */         
*         3 CTNM2FLG BIT(1),      /* INDICATES PRESENCE OF CSECTNAME */         
*         3 * BIT(7),                                                           
*       2 PDE2FLGX CHAR(1),       /* ADDRESS FLAG(EXTENDED)  @E1402C4*/         
*         3 SVECR2 BIT(1),        /* SINGLE VEC REG ELEMENT  @E1402C4*/         
*         3 LVECR2 BIT(1),        /* VECTOR REG PAIR ELEMENT @E1402C4*/         
*         3 SVECRX2 BIT(1),       /* COMPLETE VEC REGISTER   @E1402C4*/         
*         3 LVECRX2 BIT(1),       /* COMPLETE VEC REG PAIR   @E1402C4*/         
*         3 VMRFLG2 BIT(1),       /* VECTOR MASK REGISTER    @E1502C6*/         
*         3 ARFLG2 BIT(1),        /* ACCESS REGISTER ELEMENT @E1502C6*/         
*         3 *      BIT(2),        /* UNUSED FLAG BITS        @E1502C6*/         
*       2 PDE2ADRP PTR(31),       /* POINTER TO ADDRESS STRING       */         
*       2 PDE2LEN3 FIXED(15),     /* LENGTH OF ADDRESS STRING        */         
*       2 PDE2FLG3 BIT(8),        /* FLAGS FOR ADDRESS STRING        */         
*         3  A2FLG BIT(1),        /* INDICATES PRESENCE OF ADDRESS              
*                                                             STRING */         
*         3 * BIT(7),                                                           
*       2 PDE2UFLG CHAR(1),       /* USER FLAG FIELD         @E2115KR*/         
*         3 PDE2SIB BIT(1),       /* INDICATES USER WORD POINTS TO A            
*                                   SYMBOL INFORMATION BLOCK @E2115KR*/         
*         3 PDE2CONV BIT(1),      /* INDICATES ADDRESS IS CONVERTED  */         
*         3 PDE2ALST BIT(1),      /* INDICATES PDE IS ONE OF A LIST  */         
*         3 PDE2YECH BIT(1),      /* INDICATES PDE IS USELESS        */         
*         3 PDE2WRIT BIT(1),      /* INDICATES ADDRESS IS WRITABLE   */         
*         3 * BIT(3),                                                           
*       2 PDE2FLG4 BIT(8),        /* ADDRESS TYPE FLAGS              */         
*         3 SYMADDR2 BIT(1),      /* SYMBOLIC ADDRESS                */         
*         3 RELADDR2 BIT(1),      /* RELATIVE ADDRESS                */         
*         3 GENR2 BIT(1),         /* GENERAL REGISTER                */         
*         3 LFPR2 BIT(1),         /* DOUBLE PREC. FLT. PT. REGISTER  */         
*         3 SFPR2 BIT(1),         /* SINGLE PREC. FLT. PT. REGISTER  */         
*         3 CTONLY2 BIT(1),       /* ENTRY NAME NOT FOLLOWED BY A               
*                                       SYMBOLIC OR RELATIVE ADDRESS */         
*         3 PD4NULL2 BIT(1),      /* PDE2FLG4 IS EMPTY      @E1402C4 */         
*         3 * BIT(1),             /*                        @E1402C4 */         
*       2 PDE2SIGN CHAR(1),       /* EXPRESSION SIGN                 */         
*       2 PDE2INDC FIXED(15),     /* INDIRECT COUNT                  */         
*       2 PDE2EXPT PTR(31),       /* PTR TO 1ST EXPRESSION PDE       */         
*       2 PDE2USER PTR(31),       /* RESOLVED ADDR OR SIB POINTER    */         
*       2 PDE2CHAI PTR(31);       /* CHAIN POINTER FOR ADDR LIST     */         
*/********************************************************************/         
*/*          MAPPING OF EXPRESSION VALUE PDE                 @E2115KR*/         
*/********************************************************************/         
* DCL 1 PDEXPVAL BASED,           /* EXPRESSION VALUE PDE    @E2115KR*/         
*      2 PDEVADRP PTR(31),        /* PTR TO ADDRESS STRING   @E2115KR*/         
*      2 PDEVLEN3 FIXED(15),      /* LENGTH OF ADDR STRING   @E2115KR*/         
*      2 PDEVFLG6 BIT(8),         /* FLAG BYTE               @E2115KR*/         
*        3 PDEVBFLG BIT(1),       /* INDICATES 31 BIT INDIRECT                  
*                                    ADDRESSING              @E2115KR*/         
*        3 * BIT(7),              /* RESERVED                @E2115KR*/         
*      2 PDEVRSVD BIT(8),         /* RESERVED BYTE           @E2115KR*/         
*      2 PDEVFLG5 BIT(8),         /* FLAG BYTE, EXPRESSION VALUE                
*                                    TYPE                    @E2115KR*/         
*        3 * BIT(5),              /* RESERVED                @E2115KR*/         
*        3 PDEVDEC  BIT(1),       /* DECIMAL EXP VALUE       @E2115KR*/         
*        3 PDEVHEX  BIT(1),       /* HEXADECIMAL EXP VALUE   @E2115KR*/         
*        3 * BIT(1),              /* RESERVED                @E2115KR*/         
*      2 PDEVSIGN CHAR(1),        /* EXPRESSION SIGN         @E2115KR*/         
*      2 PDEVINCT FIXED(15),      /* INDIRECT COUNT          @E2115KR*/         
*      2 PDEVNEXT PTR(31);        /* PTR TO NEXT EXP VAL PDE @E2115KR*/         
*    /*     OTHER POSSIBLE VALUES FOR PDEFLG4 AND PDE2FLG4           */         
* DCL ABSADDR BIT(8) CONSTANT('00000000'B); /* ABSOLUTE ADDRESS      */         
* DCL ABSCOMPL BIT(8) CONSTANT('11111111'B); /* COMPLEMENT FOR ABSOLUTE         
*                                               TEST                 */         
