*        %GOTO TSVTPRO   ; /*                                           00010008
         MACRO                                                          00020008
         IKJTSVT                                                        00030008
.*/ %TSVTPRO: ;                                                         00040008
*/***Start of Specifications******************************************/ 00050008
*/*                                                                  */ 00060008
*/*01* MACRO-NAME: IKJTSVT                                           */ 00070008
*/*                                                                  */ 00080008
*/*01* DESCRIPTIVE-NAME:  TSO/E Vector Table                         */ 00090008
*/*                                                                  */ 00100008
*/*01* PROPRIETARY STATEMENT=                                        */ 00110008
*/***PROPRIETARY_STATEMENT***************************************@N1C*/ 00110117
*/*                                                                  */ 00110217
*/* Licensed Materials - Property of IBM                             */ 00110317
*/*                                                                  */ 00110417
*/* 5645-001                                                         */ 00110517
*/*                                                                  */ 00110617
*/* (C) Copyright IBM Corp. 1984, 1997                               */ 00110717
*/*                                                                  */ 00110817
*/* US Government Users Restricted Rights - Use, duplication or      */ 00110917
*/* disclosure restricted by GSA ADP Schedule Contract with          */ 00111017
*/* IBM Corp.                                                        */ 00111117
*/*                                                                  */ 00111217
*/* STATUS = HTE26D2                                                 */ 00111317
*/*                                                                  */ 00112017
*/***END_OF_PROPRIETARY_STATEMENT********************************@N1C*/ 00120017
*/*                                                                  */ 00230008
*/*01* FUNCTION:                                                     */ 00240008
*/*                                                                  */ 00250008
*/*      Contains addresses of branch entered routines and control   */ 00260008
*/*      blocks.                                                     */ 00270008
*/*                                                                  */ 00280008
*/*01* DSECT-NAME: TSVT                                              */ 00290008
*/*                                                                  */ 00300008
*/*02*  ACRONYM: TSVT                                                */ 00310008
*/*                                                                  */ 00320008
*/*01* EYE-CATCHER: TSVT                                             */ 00330008
*/*                                                                  */ 00340008
*/*02*  OFFSET: 0                                                    */ 00350008
*/*                                                                  */ 00360008
*/*02*  LENGTH: 4                                                    */ 00370008
*/*                                                                  */ 00380008
*/*01* MACRO-TYPE: Mapping macro                                     */ 00390008
*/*                                                                  */ 00400008
*/*01* NOTES:                                                        */ 00410008
*/*                                                                  */ 00420008
*/*01* PROCESSOR: PL/AS and Assembler                                */ 00430008
*/*                                                                  */ 00440008
*/*01* COMPONENT: TSO/E Scheduler (28502)                            */ 00450008
*/*                                                                  */ 00460008
*/*01* STORAGE-ATTRIBUTES:                                           */ 00470008
*/*                                                                  */ 00480008
*/*02*  SUBPOOL: 241                                                 */ 00490008
*/*                                                                  */ 00500008
*/*02*  KEY: 0                                                       */ 00510008
*/*                                                                  */ 00520008
*/*02*  RESIDENCY: Below 16M line.                                   */ 00530008
*/*                                                                  */ 00540008
*/*01* SIZE: See listing                                             */ 00550008
*/*                                                                  */ 00560008
*/*01* CREATED-BY: IKJEFXSR                                          */ 00570008
*/*                                                                  */ 00580008
*/*01* POINTED-TO-BY: CVTTVT field of the CVT data area              */ 00590008
*/*                                                                  */ 00600008
*/*01* SERIALIZATION: None                                           */ 00610008
*/*                                                                  */ 00620008
*/*01* METHOD-OF-ACCESS: %INCLUDE SYSLIB(IKJTSVT)                    */ 00630008
*/*                                                                  */ 00640008
*/*01* External Classification:                                      */ 00650008
*/*02* DMTI: BASE                                                    */ 00660008
*/*02* GUPI: FIELDS                                                  */ 00670008
*/*          TSVTVACC                                                */ 00680008
*/*01* End of External Classification:                               */ 00690008
*/*                                                                  */ 00700008
*/*01* CHANGE-ACTIVITY:  Refer to Prolog below                       */ 00710008
*/*                                                                  */ 00720008
*/***End of Specifications********************************************/ 00730008
*        %GOTO TSVTPLS   ; /*                                           00740008
TSVT     DSECT                                                          00750008
* START OF SPECIFICATIONS ********************************************* 00760008
*                                                                     * 00770008
*             TSO VECTOR TABLE (TSVT)                                 * 00780008
*                                                                     * 00790008
*                                                                     * 00800008
*    THE TSO VECTOR TABLE IS BUILT BY IKJEFXSR AND STORED IN A        * 00810008
*    NON-SHARED SUBPOOL(241). THE TABLE CONTAINS THE ADDRESSES OF     * 00820008
*    BRANCH ENTERED ROUTINES AND CONTROL TABLES. THE TSVT CAN BE      * 00830008
*    LOCATED FROM THE CVT IN THE FIELD LABELED CVTTVT.        @PBY0257* 00840008
*                                                                     * 00850008
*   CHANGE ACTIVITY =                                                 * 00860008
*                                                                     * 00870008
*   @ZTS0005  CORRECT MEND.                                   @ZTS0005* 00880008
*   @ZTS0239  DELETION OF POINTERS TO IKJEFTE8 AND IKJEFTE2   @PBY0257* 00890008
*   @E2267F2  SUPPORT FOR TSO/E REL 2.1                       @E2267F2* 00900008
*   @PBR0129  CHANGE COMMENT TO READ IKJCT440 NOT IKJT440     @PBR0129* 00910008
*   @PBR0135  RETRANSMIT - NO CODE CHANGE                     @PBR0135* 00920008
*   OZ87430   ADD NO IMPLICIT FUNCTION FOR DISPLAY CLIST              * 00930008
*             VARIABLES.                                      @ZA87430* 00940008
*   @E2367H1  ADDRESS FOR THE CLIST ATTENTION FACILITY WAS ADDED      * 00950008
*             FOR TSO/E REL 3.                                @E2367H1* 00960008
*   @PBY0257  ADDITION OF &SYSTSOE TO TSO/E REL 3             @PBY0257* 00970008
*   @E1402S3  NEW RETURN CODES FOR IKJCT441 WERE ADDED                * 00980008
*             FOR TSO/E REL 4.                                @E1402S3* 00990008
*   @E1402C1 ADDITION OF &SYSTSOE TO TSO/E REL 4 DBCS SUPPORT @E1402C1* 01000008
*   @E1402V7  ADDRESSES OF THE BROADCAST DATA SET INTERFACE ROUTINE   * 01010008
*             AND LOGON RACF SUPPORT ROUTINE WERE ADDED FOR TSO/E     * 01020008
*             RELEASE 4.                                      @E1402V7* 01030008
*   @E1402S6  ADDRESS OF THE ROUTER ROUTINE IF IT IS IN LPA.          * 01040008
*             ADDED FOR TSO/E RELEASE 4.                      @E1402S6* 01050008
*   @E21D2G9  TSO/E RELEASE 5 REXX SUPPORT                    @E21D2G9* 01060008
*   @E1502I7  Table Look Up Service and ALTLIB entry points   @E1502I7* 01070008
*   @E1402B1  Common Recovery Code                            @E1402B1* 01080008
*   @PEI0434  Table Lookup Service Routine entry point for            * 01090008
*             IKJTBLSR                                        @PEI0434* 01100008
*   @PEI0617  Add IRXESTK1 to TXVT                            @PEI0617* 01110008
*   @PEI0692  Corrected the status information in the prolog  @PEI0692* 01120008
*   @PEI0432  Add IRXTVARS to TSVT                            @PEI0432* 01130008
*   @PEI0709  Add IRXINIT, IRXIOLAR, and IRXSTO00 to TSVT     @PEI0709* 01140008
*   @PEI0791  Add IKJCT44X to TSVT                            @PEI0791* 01150008
*   @PEI0944  Add IKJEFTS2 to TSVT                            @PEI0944* 01160008
*   @OY19182  Add REXX entry addresses to the TSVT in order   @YA19182* 01170008
*             to provide FORTRAN entry points                 @YA19182* 01180008
*   @OY26799  Added pointer to Exits & Tables vector IKJEXTAB @YA26799* 01190008
*   @E22D2D3  TSO/E 2.2.0 NLS Support                         @E22D2D3* 01200008
*   @E22D2E9  TSO/E 2.2.0 support for commands that can       @E22D2E9* 01210008
*             execute on a TSO/E command platform task.       @E22D2E9* 01220008
*   @DG10015  TSO/E 2.2.0 Performance Enhancement             @DG10015* 01230008
*              - Fields added for SYS1.BRODCAST I/O avoidance @DG10015* 01240008
*    OY34930  Add parmlib lock and related IKJBCMSG fields    @YA34930* 01250008
*   @E23D2DB  TSO/E 2.3.0 TSO Environment Service support     @E23D2DB* 01260008
*             Add the PC number for IKJPCENV to TSVT          @E23D2DB* 01270008
*   @E23D2D5  TSO/E 2.3.0 Performance Enhancement             @E23D2D5* 01280008
*              - TSO/E Exit Avoidance                         @E23D2D5* 01290008
*             Add TSVTNETL indicator indicating               @E23D2D5* 01300008
*             whether any of the TSO/E exits were             @E23D2D5* 01310008
*             found in LPA/ELPA                               @E23D2D5* 01320008
*                                                                     * 01330008
*   @E23D2F1  TSO/E 2.3.0 Performance Enhancement             @E23D2F1* 01340008
*              - TSO/E VLF Virtual Storage relief             @E23D2F1* 01350008
*             Add fields to support the new System            @E23D2F1* 01360008
*             SNTAB and SVTAB.  Also add some extra           @E23D2F1* 01370008
*             space for future use                            @E23D2F1* 01380008
*   @PID0187  Blank out column 72 to avoid assembler error    @PID0187* 01390008
*   OY46260   APPC Unauthorized Async Support                 @YA46260* 01400008
*                                                                     * 01410008
*   @E24D2H3  TSO/E 2.4.0 support for the Unauthorized        @E24D2H3* 01420008
*             Resource Processor Service. Added new field     @E24D2H3* 01430008
*             TSVTURPS to store address of module IKJURPS     @E24D2H3* 01440008
*                                                                     * 01450008
*   @PMH0003  Updated the Prolog to conform to the SHOWHDR    @PMH0003* 01460008
*             tool standards as required by Information       @PMH0003* 01470008
*             Development.                                    @PMH0003* 01480008
*                                                                     * 01490008
*   @E24D2D0  TSO/E 2.4.0 MVS Version 3 toleration support.   @E24D2D0* 01500008
*             Change field TSVTATPL to TSVTAPPC.              @E24D2D0* 01510008
*                                                                     * 01520008
*   @PMH0160  Updated prolog to include CDPI information.     @PMH0160* 01530008
*                                                                     * 01540008
*   @OW03618  Correct the 3 equates to EQU X'..'              @WA03618* 01550008
*             TSVTNCTU      EQU     X'80'                     @WA03618* 01560008
*             TSVTNETL      EQU     X'40'                     @WA03618* 01570008
*             TSVTUPDP      EQU     X'20'                     @WA03618* 01580008
*                                                                     * 01590008
*   @E25D2JC  TSO/E 2.5.0 support for TSOLIB.  Added new      @E25D2JC* 01600008
*             field TSVTCPCR to store the address of          @E25D2JC* 01610008
*             module IKJCMDPC.                                @E25D2JC* 01620008
*                                                                     * 01630008
*   @KO10185  Changes to support a system-wide rather than    @KO10185* 01640009
*             a non-system-wide PC for IKJCMDPC:              @KO10185* 01650009
*                                                             @KO10185* 01660009
*             1.  Remove TSVTCPCR.  IKJCMDPC and IKJCMDRC     @KO10185* 01670009
*                 are REQUIRED to reside in LPA so that       @KO10185* 01680009
*                 ETDEF can resolve addressability            @KO10185* 01690009
*                 to them at RIM time in IKJEFXSR.            @KO10185* 01700009
*             2.  Add TSVTPCN2 to contain the PC number       @KO10185* 01710009
*                 for IKJCMDPC.                               @KO10185* 01720009
*                                                             @KO10185* 01730009
*   $L1=    OW21341  260     951219 BHBR  : TSO GR Support        @L1A* 01740013
*   $L2=    DYNLPA   260     970229 BHBR  : Dynamic LPA support and   * 01741016
*                                           TSVT Extended         @L2A* 01742017
* $N1= COPYRITE HTE26D2 19970218 VOHS: Insert/Update Copyright    @N1A* 01745017
*                                                                     * 01750008
* END OF SPECIFICATIONS *********************************************** 01760008
         SPACE                                                          01770008
           DS    0D        BEGIN TSVT ON DOUBLE WORD BDY      @E2267F2  01780008
TSVTTSVT   DS    CL4       ACRONYM IN EBCDIC 'TSVT'                     01790008
TSVTLEV    DS    CL1       TSVT VERSION                                 01800008
TSVTFLG1   DS    CL1       FLAG INDICATORS                    @DG10015  01810008
TSVTRSV1   DS    CL2       RESERVED                           @DG10015  01820008
TSVTNCT    DS    A         ADDRESS OF THE MOST CURRENT NOTICE           01830008
*                          TABLE                                        01840008
TSVTVACC   DS    A         ADDRESS OF THE CLIST VARIABLE ACCESS ROUTINE 01850008
TSVTASF    DS    A         ADDRESS OF THE AUTHORIZED SERVICE            01860008
*                          FACILITY ROUTINE                             01870008
*********************************************************************** 01880008
***                   TSO/E R2.1 SUPPORT                   @E2267F2  ** 01890008
***                                                                  ** 01900008
*********************************************************************** 01910008
TSVTLTBL   DS    A         ADDRESS OF LOGON ADDRESS TABLE      @E2267F2 01920008
TSVTFLA1   DS    A         ADDRESS OF LOGON INITIALIZATION     @E2267F2 01930008
*                          MODULE                              @E2267F2 01940008
TSVTCTIO   DS    A         ADDRESS OF CLIST I/O LAR            @E2267F2 01950008
TSVTCTAB   DS    A         ADDRESS OF LOAD MODULE CONTAINING   @E2267F2 01960008
*                          MESSAGES IN TRANSLATE TABLES        @E2267F2 01970008
TSVTT440   DS    A         ADDRESS OF CLIST VARIABLE ACCESS    @E2267F2 01980008
*                          METHOD - IKJCT440                   @PBR0129 01990008
TSVTT441   DS    A         ADDRESS OF GENERAL VARIABLE ACCESS  @E2267F2 02000008
*                          METHOD - IKJT441R                   @E2267F2 02010008
TSVTPUTL   DS    A         ADDRESS OF PUTLINE ROUTINE          @E2267F2 02020008
TSVTPTGT   DS    A         ADDRESS OF PUTGET ROUTINE           @E2267F2 02030008
TSVTGETL   DS    A         ADDRESS OF GETLINE ROUTINE          @E2267F2 02040008
TSVTSTCK   DS    A         ADDRESS OF STACK ROUTINE            @E2267F2 02050008
*                                                                       02060008
TSVTTSL    DS    A         ADDRESS OF TMP LAR                  @E2267F2 02070008
TSVTSCAN   DS    A         ADDRESS OF SCAN ROUTINE             @E2267F2 02080008
TSVTPARS   DS    A         ADDRESS OF PARSE ROUTINE            @E2267F2 02090008
TSVTEF02   DS    A         ADDRESS OF MESSAGE WRITER ROUTINE   @E2267F2 02100008
TSVTTPVT   DS    A         Address of TPVT                     @E1402S6 02110008
TSVTRCVY   DS    A        Address of Recovery Routine IKJCMDRC @E1402B1 02120008
TSVTTRAN   DS    A         IKJTRANS                            @E22D2D3 02130008
TSVTBCMT   DS    CL8       Member Token for Broadcast Notice XCF Group  02140008
*                                                              @DG10015 02150008
*********************************************************************** 02160008
***                   TSO/E R3   SUPPORT                   @E2367H1  ** 02170008
***                                                                  ** 02180008
*********************************************************************** 02190008
TSVTCAF    DS    A         CLIST ATTENTION FACILITY ADDR REL 3 @PBY0257 02200008
TSVTTSOL   DS    0CL4      TSO/E LEVEL INDICATOR               @PBY0257 02210008
TSVTLVER   DS    CL1        - VERSION LEVEL                    @PBY0257 02220008
TSVTLREL   DS    CL2        - RELEASE NUMBER                   @PBY0257 02230008
TSVTLMOD   DS    CL1        - MODIFICATION LEVEL               @PBY0257 02240008
*********************************************************************** 02250008
***                   TSO/E R4   SUPPORT                   @E1402C1  ** 02260008
***                                                                  ** 02270008
*********************************************************************** 02280008
TSVTCTDB   DS    A         ADDRESS OF DOUBLE BYTE CHAR ROUTINE @E1402C1 02290008
TSVTRIF    DS    A         BROADCAST DATA SET INTERFACE        @E1402V7 02300008
*                          ROUTINE ADDRESS FOR RELEASE 4       @E1402V7 02310008
TSVTRAF    DS    A         LOGON RACF SUPPORT ROUTINE ADDRESS  @E1402V7 02320008
*                          FOR RELEASE 4                       @E1402V7 02330008
TSVTRTRP   DS    A         TSO ROUTER ADDRESS                  @E1402S6 02340008
TSVTTBLS   DS    A         ADDRESS OF TABLE LOOK UP SERVICE    @E1502I7 02350008
TSVTADTB   DS    A         ADDRESS OF ALTLIB                   @E1502I7 02360008
TSVTTBLR   DS    A         ADDRESS OF TABLE LOOKUP SERVICE RTN @PEI0434 02370008
*********************************************************************** 02380008
TSVTESTK   DS    A         Address of IRXESTK1                 @PEI0617 02390008
*********************************************************************** 02400008
TSVTTVAR   DS    A         Address of IRXTVARS                 @PEI0432 02410008
TSVTINIT   DS    A         Address of IRXINIT                  @PEI0709 02420008
TSVTOLAR   DS    A         Address of IRXIOLAR                 @PEI0709 02430008
TSVTTO00   DS    A         Address of IRXSTO00                 @PEI0709 02440008
TSVTT44X   DS    A         Address of IKJCT44X                 @PEI0791 02450008
TSVTFTS2   DS    A         Address of IKJEFTS2                 @PEI0944 02460008
TSVTEXE    DS    A         Address of IRXEXEC                  @YA19182 02470008
TSVTINOU   DS    A         Address of IRXINOUT                 @YA19182 02480008
TSVTLOA    DS    A         Address of IRXLOAD                  @YA19182 02490008
TSVTTER    DS    A         Address of IRXTERM                  @YA19182 02500008
TSVTSUBC   DS    A         Address of IRXSUBCM                 @YA19182 02510008
TSVTMSGI   DS    A         Address of IRXMSGID                 @YA19182 02520008
TSVTEXCO   DS    A         Address of IRXEXCOM                 @YA19182 02530008
TSVTTERM   DS    A         Address of IRXTERMA                 @YA19182 02540008
TSVTETVP   DS    A        Address of Exit & Vector Table       @YA26799 02550008
TSVTTSFI   DS    A         Address of IKJEFTSI                 @E22D2E9 02560008
TSVTTSFT   DS    A         Address of IKJEFTST                 @E22D2E9 02570008
TSVTPCN1   DS    F         PC number for IKJPCENV              @E23D2DB 02580008
TSVTSNTA   DS    A         System copy of the SNTAB            @E23D2F1 02590008
TSVTSVTA   DS    A         System copy of the SVTAB            @E23D2F1 02600008
TSVTSYML   DS    F         Length of system SNTAB and SVTAB    @E23D2F1 02610008
TSVTXCFU   DS    F         Lock for parmlib updating           @YA34930 02620008
TSVTMSTR   DS    A         Address of Master ASCB              @YA34930 02630008
TSVTBECB   DS    F         ECB for IKJBCMSG                    @YA34930 02640008
TSVTAPPC   DS    A         Addr of APPC callable service table @E24D2D0 02650008
TSVTURPS   DS    A         Address of IKJURPS module           @E24D2H3 02660008
TSVTPCN2   DS    F         PC number for IKJCMDPC              @KO10185 02670009
TSVTMSR0   DS    A         Address of IKJMSR0 module               @L1A 02680012
*********************************************************************** 02681014
***                   TSO/E 2.6  SUPPORT                           @L2A 02682014
*********************************************************************** 02684014
TSVTMDT@   DS    A         Address of module table                 @L2A 02685016
           DS    3F        Reserved                                @L2C 02690016
**********************************************************************/ 02691016
***                  TSO/E  Free Space                             @L2A 02692016
*********************************************************************** 02693016
           DS    8F        Reserved                                @L2C 02694016
TSVTEND    DS    0D        ASSURE TSVT ENDS ON DOUBLE WORD     @E2267F2 02700008
*                          BOUNDRY                             @E2267F2 02710008
***                                                                  ** 02720008
*** THE FOLLOWING DECLARATIONS DEFINE THE ENTRY AND RETURN CODES     ** 02730008
*** USED BY THE CLIST VARIABLE ACCESS ROUTINE (POINTED TO BY         ** 02740008
*** TSVSVACC).                                                       ** 02750008
***                                                                  ** 02760008
*********************************************************************** 02770008
*       ENTRY CODES                                                     02780008
TSVERETR EQU   1                  RETURN VARIABLE VALUE                 02790008
TSVEUPDT EQU   2                  UPDATE VARIABLE                       02800008
TSVELOC  EQU   3                  LOCATE / LOCATE NEXT                  02810008
TSVERSVD EQU   4                  RESERVED                              02820008
TSVNOIMP EQU   18                 NO IMPLICIT                  @ZA87430 02830008
*       RETURN CODES                                                    02840008
TSVROK   EQU   0                  EVERY THING OK                        02850008
TSVRNORS EQU   4                  VARIABLE RETURNED SHOULDN'T           02860008
*                                         BE RE-SCANNED                 02870008
TSVREVAL EQU   8                  VARIABLE RETURNED REQUIRES            02880008
*                                         EVALUATION                    02890008
TSVRLAB  EQU   12                 VARIABLE RETURNED IS A                02900008
*                                         LABEL                         02910008
TSVRNAUP EQU   16                 SYSTEM VARIABLE - CAN'T BE            02920008
*                                        UPDATED BY THE USER            02930008
TSVRNOM  EQU   20                 FOR LOCATE - NO VARIABLE              02940008
*                                         RETURNED - THERE ARE NO       02950008
*                                         MORE VARIABLES                02960008
TSVRPROC EQU   24                 VARIABLE RETURNED IS A PROCEDURE      02970008
*                                         NAME                 @E1402S3 02980008
TSVRSVD2 EQU   30                 RESERVED                     @E21D2G9 02990008
TSVRGETF EQU   32                 GETMAIN/FREEMAIN FAILURE              03000008
TSVRNSIZ EQU   36                 SYMBOL NAME TOO LARGE                 03010008
*                                         OR SMALL                      03020008
TSVRENV  EQU   40                 INCORRECT ENVIRONMENT                 03030008
TSVRPARM EQU   44                 INVALID ENTRY CODE                    03040008
TSVRDUP  EQU   48                 DUPLICATE SYMBOL FOUND                03050008
TSVRUNDF EQU   52                 UNDEFINED VARIABLE                    03060008
TSVRGLER EQU   56                 TOO MANY GLOBAL VARIABLES             03070008
TSVRUNDG EQU   60                 UNDEFINED GLOBAL VARIABLE             03080008
TSVRINVR EQU   64                 VARIABLE NOT VALID AS A CALL BY       03090008
*                                           REFERENCE VARIABLE          03100008
TSVRUNDR EQU   68                 UNDEFINED CALL BY REFERENCE VARIABLE  03110008
TSVIREXX EQU   80                 VARIABLE NAME IS NOT VALID FOR REXX   03120008
*                                                              @E21D2G9 03130008
TSVREXXE EQU   81                 AN UNEXPECTED RETURN CODE WAS         03140008
*                                 RECEIVED FROM A REXX ROUTINE @E21D2G9 03150008
*                                                                       03160008
*       FLAG INDICATORS FOR TSVTFLG1                           @DG10015 03170008
*                                                                       03180008
TSVTNCTU EQU   X'80'              Instorage copy of system notices      03190008
*                                 needs to be updated          @WA03618 03200008
TSVTNETL EQU   X'40'              None of the TSO/E Exits               03210008
*                                 were found in LPA/ELPA       @WA03618 03220008
TSVTUPDP EQU   X'20'              IKJBCMSG posted for parmlib update    03230008
*                                 signalling                   @WA03618 03240008
         MEND , */                                                      03250008
* %TSVTPLS  :  ;                                                        03260008
* /* MAPPING OF TSO VECTOR TABLE                                     */ 03270008
* DECLARE                                                               03280008
*   1 TSVT BASED(TSVTPTR) BDY(DWORD),         /*           @E2267F2 */  03290008
*                                                                       03300008
*    2 TSVTTSVT CHAR(4),          /* ACRONYM IN EBCDIC "TSVT"        */ 03310008
*    2 TSVTLEV CHAR(1),           /* TSVT VERSION                    */ 03320008
*    2 TSVTFLG1 CHAR(1),          /* Flag Indicators         @DG10015*/ 03330008
*      3 TSVTNCTU BIT(1),         /* Instorage copy of system notices   03340008
*                                    needs to be updated     @DG10015*/ 03350008
*      3 TSVTNETL BIT(1),         /* None of the TSO/E Exits            03360008
*                                    were found in LPA/ELPA  @E23D2D5*/ 03370008
*      3 TSVTUPDP BIT(1),         /* IKJBCMSG posted for parmlib update 03380008
*                                    signalling              @YA34930*/ 03390008
*      3 *        BIT(5),         /* Reserved Flags          @YA34930*/ 03400008
*    2 TSVTRSV1 CHAR(2),          /* RESERVED                @DG10015*/ 03410008
*    2 TSVTNCT  PTR(31),          /* ADDRESS OF THE MOST CURRENT        03420008
*                                    NOTICE TABLE                    */ 03430008
*    2 TSVTVACC PTR(31),          /* ADDRESS OF THE CLIST VARIABLE      03440008
*                                    ACCESS ROUTINE                  */ 03450008
*    2 TSVTASF PTR(31),           /* ADDRESS OF THE AUTHORIZED          03460008
*                                    SERVICE FACILITY ROUTINE        */ 03470008
*/********************************************************************/ 03480008
*/*                  TSO/E R2.1 SUPPORT                   @E2267F2  **/ 03490008
*/*                                                                 **/ 03500008
*/********************************************************************/ 03510008
*   2  TSVTLTBL PTR(31), /* ADDRESS OF LOGON ADDRESS TABLE              03520008
*                                                           @E2267F2 */ 03530008
*   2  TSVTFLA1 PTR(31), /* ADDRESS OF LOGON INITIALIZATION             03540008
*                           MODULE                          @E2267F2 */ 03550008
*   2  TSVTCTIO PTR(31), /* ADDRESS OF CLIST I/O LAR        @E2267F2 */ 03560008
*   2  TSVTCTAB PTR(31), /* ADDRESS OF LOAD MODULE CONTAINING           03570008
*                           MESSAGES IN TRANSLATE TABLES    @E2267F2 */ 03580008
*   2  TSVTT440 PTR(31), /* ADDRESS OF CLIST VARIABLE ACCESS            03590008
*                           METHOD - IKJCT440               @PBR0129 */ 03600008
*   2  TSVTT441 PTR(31), /* ADDRESS OF GENERAL VARIABLE ACCESS          03610008
*                           METHOD - IKJT441R               @E2267F2 */ 03620008
*   2  TSVTPUTL PTR(31), /* ADDRESS OF PUTLINE ROUTINE      @E2267F2 */ 03630008
*   2  TSVTPTGT PTR(31), /* ADDRESS OF PUTGET ROUTINE       @E2267F2 */ 03640008
*   2  TSVTGETL PTR(31), /* ADDRESS OF GETLINE ROUTINE      @E2267F2 */ 03650008
*   2  TSVTSTCK PTR(31), /* ADDRESS OF STACK ROUTINE        @E2267F2 */ 03660008
*   2  TSVTTSL PTR(31),  /* ADDRESS OF TMP LAR              @E2267F2 */ 03670008
*   2  TSVTSCAN PTR(31), /* ADDRESS OF SCAN ROUTINE         @E2267F2 */ 03680008
*   2  TSVTPARS PTR(31), /* ADDRESS OF PARSE ROUTINE        @E2267F2 */ 03690008
*   2  TSVTEF02 PTR(31), /* ADDRESS OF MESSAGE WRITER ROUTINE           03700008
*                                                           @E2267F2 */ 03710008
*   2  TSVTTPVT PTR(31), /* Address of TPVT                 @E1402S6 */ 03720008
*   2  TSVTRCVY PTR(31), /* Address of Recovery Routine IKJCMDRC        03730008
                                                             @E1402B1*/ 03740008
*   2  TSVTTRAN PTR(31), /* ADDRESS OF IKJTRANS ROUTINE      @E22D2D3*/ 03750008
*   2  TSVTBCMT CHAR(8), /* Member Token for Broadcast Notice XCF       03760008
*                           Group                            @DG10015*/ 03770008
*/********************************************************************/ 03780008
*/*                  TSO/E R3   SUPPORT                   @E2367H1  **/ 03790008
*/*                                                                 **/ 03800008
*/********************************************************************/ 03810008
*   2  TSVTCAF  PTR(31),/*CLIST ATTENTION FACILITY ADDR REL3 @PBY0257*/ 03820008
*   2  TSVTTSOL CHAR(4),          /* TSO/E LEVEL INDICATOR   @PBY0257*/ 03830008
*     4  TSVTLVER CHAR(1),        /*  - VERSION LEVEL        @PBY0257*/ 03840008
*     4  TSVTLREL CHAR(2),        /*  - RELEASE NUMBER       @PBY0257*/ 03850008
*     4  TSVTLMOD CHAR(1),        /*  - MODIFICATION LEVEL   @PBY0257*/ 03860008
*/********************************************************************/ 03870008
*/*                  TSO/E R4   SUPPORT                   @E1402C1  **/ 03880008
*/*                                                                 **/ 03890008
*/********************************************************************/ 03900008
*   2  TSVTCTDB PTR(31),/* ADDRESS OF DOUBLE BYTE CHAR ROUTINE@E1402C1*/03910008
*   2  TSVTRIF  PTR(31), /* BROADCAST DATA SET INTERFACE ROUTINE        03920008
*                           ADDRESS FOR RELEASE 4            @E1402V7*/ 03930008
*   2  TSVTRAF  PTR(31), /* LOGON RACF SUPPORT ROUTINE ADDRESS FOR      03940008
*                           RELEASE 4                        @E1402V7*/ 03950008
*   2  TSVTRTRP PTR(31), /* TSO ROUTER ADDRESS               @E1402S6*/ 03960008
*   2  TSVTTBLS PTR(31),          /* Address of table look up service   03970008
*                                    used by IKJTSLAR        @PEI0434*/ 03980008
*   2  TSVTADTB PTR(31),          /* Address of ALTLIB       @E1502I7*/ 03990008
*   2  TSVTTBLR PTR(31),          /* Address of table look up service   04000008
*                                    Routine used by TSOCALL @PEI0434*/ 04010008
*   2  TSVTESTK PTR(31),          /* Address of IRXESTK1     @PEI0617*/ 04020008
*   2  TSVTTVAR PTR(31),          /* Address of IRXTVARS     @PEI0432*/ 04030008
*   2  TSVTINIT PTR(31),          /* Address of IRXINIT      @PEI0709*/ 04040008
*      3  TSVTINI  PTR(31),       /* Address of IRXINIT (for the        04050008
*                                    TSOCALL macro)          @YA19182*/ 04060008
*   2  TSVTOLAR PTR(31),          /* Address of IRXIOLAR     @PEI0709*/ 04070008
*   2  TSVTTO00 PTR(31),          /* Address of IRXSTO00     @PEI0709*/ 04080008
*   2  TSVTT44X PTR(31),          /* Address of IKJCT44X     @PEI0791*/ 04090008
*   2  TSVTFTS2 PTR(31),          /* Address of IKJEFTS2     @PEI0944*/ 04100008
*   2  TSVTEXE  PTR(31),          /* Address of IRXEXEC      @YA19182*/ 04110008
*   2  TSVTINOU PTR(31),          /* Address of IRXINOUT     @YA19182*/ 04120008
*   2  TSVTLOA  PTR(31),          /* Address of IRXLOAD      @YA19182*/ 04130008
*   2  TSVTTER  PTR(31),          /* Address of IRXTERM      @YA19182*/ 04140008
*   2  TSVTSUBC PTR(31),          /* Address of IRXSUBCM     @YA19182*/ 04150008
*   2  TSVTMSGI PTR(31),          /* Address of IRXMSGID     @YA19182*/ 04160008
*   2  TSVTEXCO PTR(31),          /* Address of IRXEXCOM     @YA19182*/ 04170008
*   2  TSVTTERM PTR(31),          /* Address of IRXTERMA     @YA19182*/ 04180008
*   2  TSVTETVP PTR(31), /* Address of Exit & Tables Vector  @YA26799*/ 04190008
*   2  TSVTTSFI PTR(31),          /* Address of IKJEFTSI     @E22D2E9*/ 04200008
*   2  TSVTTSFT PTR(31),          /* Address of IKJEFTST     @E22D2E9*/ 04210008
*   2  TSVTPCN1 FIXED(32),        /* PC number for IKJPCENV  @E23D2DB*/ 04220008
*   2  TSVTSNTA PTR(31),          /* System copy of SNTAB    @E23D2F1*/ 04230008
*   2  TSVTSVTA PTR(31),          /* System copy of the SVTAB@E23D2F1*/ 04240008
*   2  TSVTSYML FIXED(31),        /* Length of system SNTAB and         04250008
*                                    SVTAB                   @E23D2F1*/ 04260008
*   2  TSVTXCFU FIXED(31),        /* Lock for updating parmlib between  04270008
*                                    PARMLIB and the SYS1.BRODCAST XCF  04280008
*                                    notify routine.         @YA34930*/ 04290008
*   2  TSVTMSTR PTR(31),          /* Master AS's ASCB address@YA34930*/ 04300008
*   2  TSVTBECB FIXED(31),        /* ECB that IKJBCMSG waits            04310008
*                                    on                      @YA34930*/ 04320008
*   2  TSVTAPPC PTR(31),          /* Address of APPC TABLE   @E24D2D0*/ 04330008
*   2  TSVTURPS PTR(31),          /* Address of IKJURPS      @E24D2H3*/ 04340008
*   2  TSVTPCN2 FIXED(32),        /* PC number for IKJCMDPC  @KO10185*/ 04350009
*   2  TSVTMSR0 PTR(31),          /* Address of IKJMSR0          @L1A*/ 04360012
*/********************************************************************/ 04361014
*/*                  TSO/E 2.6  SUPPORT                          @L2A*/ 04362014
*/********************************************************************/ 04364014
*   2  TSVTMDT@ PTR(31),          /* Address of module table     @L2A*/ 04364316
*   2  *(3)     FIXED(31),        /* Reserved                    @L2C*/ 04370016
*/********************************************************************/ 04371016
*/*                  TSO/E  Free Space                           @L2A*/ 04372016
*/********************************************************************/ 04373016
*   2  *(8)     FIXED(31),        /* Reserved                    @L2C*/ 04374016
*/********************************************************************/ 04375016
*   2  TSVTEND CHAR(0) BDY(DWORD); /* ASSURE TSVT ENDS ON DOUBLE WORD   04380008
*                                     BOUNDRY               @E2267F2 */ 04390008
*@EJECT;                                                  /* @PBY0257*/ 04400008
*/********************************************************************/ 04410008
*/*                                                                  */ 04420008
*/* THE FOLLOWING DECLARATIONS DEFINE THE ENTRY AND RETURN CODES     */ 04430008
*/* USED BY THE CLIST VARIABLE ACCESS ROUTINE (POINTED TO BY         */ 04440008
*/* TSVSVACC).                                                       */ 04450008
*/*                                                                  */ 04460008
*/********************************************************************/ 04470008
* DECLARE                                                               04480008
*/*     ENTRY CODES                                                  */ 04490008
*   TSVERETR   FIXED(31) CONSTANT(1),   /* RETURN VARIABLE VALUE     */ 04500008
*   TSVEUPDT   FIXED(31) CONSTANT(2),   /* UPDATE VARIABLE           */ 04510008
*   TSVELOC    FIXED(31) CONSTANT(3),   /* LOCATE / LOCATE NEXT      */ 04520008
*   TSVERSVD   FIXED(31) CONSTANT(4),   /* RESERVED                  */ 04530008
*   TSVNOIMP   FIXED(31) CONSTANT(18),  /* NO IMPLICIT       @ZA87430*/ 04540008
*/*     RETURN CODES                                                 */ 04550008
*   TSVROK     FIXED(31) CONSTANT(0),   /* EVERY THING OK            */ 04560008
*   TSVRNORS   FIXED(31) CONSTANT(4),   /* VARIABLE RETURNED SHOULDN'T  04570008
*                                         BE RE-SCANNED              */ 04580008
*   TSVREVAL   FIXED(31) CONSTANT(8),   /* VARIABLE RETURNED REQUIRES   04590008
*                                         EVALUATION                 */ 04600008
*   TSVRLAB    FIXED(31) CONSTANT(12),  /* VARIABLE RETURNED IS A       04610008
*                                         LABEL                      */ 04620008
*   TSVRNAUP   FIXED(31) CONSTANT(16),  /* SYSTEM VARIABLE - CAN'T BE   04630008
*                                        UPDATED BY THE USER        */  04640008
*   TSVRNOM    FIXED(31) CONSTANT(20),  /* FOR LOCATE - NO VARIABLE     04650008
*                                         RETURNED - THERE ARE NO       04660008
*                                         MORE VARIABLES             */ 04670008
*   TSVRPROC   FIXED(31) CONSTANT(24),  /* VARIABLE RETURNED IS A       04680008
*                                          PROCEDURE NAME    @E1402S3*/ 04690008
*   TSVRSVD2   FIXED(31) CONSTANT(30),  /* RESERVED          @E21D2G9*/ 04700008
*   TSVRGETF   FIXED(31) CONSTANT(32),  /* GETMAIN/FREEMAIN FAILURE  */ 04710008
*   TSVRNSIZ   FIXED(31) CONSTANT(36),  /* SYMBOL NAME TOO LARGE        04720008
*                                         OR SMALL                   */ 04730008
*   TSVRENV    FIXED(31) CONSTANT(40),  /* INCORRECT ENVIRONMENT     */ 04740008
*   TSVRPARM   FIXED(31) CONSTANT(44),  /* INVALID ENTRY CODE        */ 04750008
*   TSVRDUP    FIXED(31) CONSTANT(48),  /* DUPLICATE SYMBOL FOUND    */ 04760008
*   TSVRUNDF   FIXED(31) CONSTANT(52),  /* UNDEFINED VARIABLE        */ 04770008
*   TSVRGLER   FIXED(31) CONSTANT(56),  /* TOO MANY GLOBAL VARIABLES */ 04780008
*   TSVRUNDG   FIXED(31) CONSTANT(60),  /* UNDEFINED GLOBAL VARIABLE */ 04790008
*   TSVRINVR   FIXED(31) CONSTANT(64),  /* VARIABLE NOT VALID AS A CALL 04800008
*                                          BY REFERENCE VARIABLE        04810008
*                                                            @E1402S3*/ 04820008
*   TSVRUNDR   FIXED(31) CONSTANT(68),  /* UNDEFINED CALL BY REFERENCE  04830008
*                                          VARIABLE          @E1402S3*/ 04840008
*   TSVIREXX   FIXED(31) CONSTANT(80),  /* VARIABLE NAME IS NOT VALID   04850008
*                                          FOR REXX          @E21D2G9*/ 04860008
*   TSVREXXE   FIXED(31) CONSTANT(81);  /* AN UNEXPECTED RETURN CODE    04870008
*                                          WAS RECEIVED FROM A REXX     04880008
*                                          ROUTINE           @E21D2G9*/ 04890008
