 /***Start of Specifications******************************************/ 00001000
 /*                                                                  */ 00002000
 /*01* PROPRIETARY STATEMENT=                                        */ 00003000
 /***PROPRIETARY_STATEMENT********************************************/ 00004000
 /*                                                                  */ 00005000
 /*                                                                  */ 00006000
 /* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00007000
 /* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00008000
 /* 5685-025 (C) COPYRIGHT IBM CORP. 1984, 1995              @E25D2JC*/ 00009000
 /* SEE COPYRIGHT INSTRUCTIONS                                       */ 00010000
 /*                                                                  */ 00011000
 /* STATUS= HTE25D2                                          @E25D2JC*/ 00012000
 /*                                                                  */ 00013000
 /***END_OF_PROPRIETARY_STATEMENT*************************************/ 00014000
 /*                                                                  */ 00015000
 /*01* MACRO NAME:   IKJTMP3                                         */ 00016000
 /*                                                                  */ 00017000
 /*01* DESCRIPTIVE NAME:  TMP Work Area 3                            */ 00018000
 /*                                                                  */ 00019000
 /*01* FUNCTION:                                                     */ 00020000
 /*     TMP3 is a communications area between TMP                    */ 00021000
 /*     initialization, the TMP mainline, and internal TSO/E         */ 00022000
 /*     routines that require processing within the TMP.             */ 00023000
 /*                                                                  */ 00024000
 /*01* DSECT-NAME: TMP3                                              */ 00025000
 /*                                                                  */ 00026000
 /*02*  ACRONYM: TMP3                                                */ 00027000
 /*                                                                  */ 00028000
 /*01* EYE CATCHER:  TMP3                                            */ 00029000
 /*02*  OFFSET:  0                                                   */ 00030000
 /*02*  LENGTH:  4                                                   */ 00031000
 /*                                                                  */ 00032000
 /*01* MACRO-TYPE: Mapping macro                                     */ 00033000
 /*                                                                  */ 00034000
 /*01* PROCESSOR:    PL/X                                            */ 00035000
 /*                                                                  */ 00036000
 /*01* COMPONENT:  28502                                             */ 00037000
 /*                                                                  */ 00038000
 /*01* STORAGE ATTRIBUTES:                                           */ 00039000
 /*02*  SUBPOOL: 230                                                 */ 00040000
 /*02*  KEY:     1                                                   */ 00041000
 /*02*  RESIDENCY: Below 16MB in virtual storage                     */ 00042000
 /*                                                                  */ 00043000
 /*01* SIZE:  See listing                                            */ 00044000
 /*                                                                  */ 00045000
 /*01* CREATED BY: IKJEFT01                                          */ 00046000
 /*                                                                  */ 00047000
 /*01* POINTED TO BY:                                                */ 00048000
 /*     LWATMPW3 field of data area LWA                              */ 00049000
 /*                                                                  */ 00050000
 /*01* SERIALIZATION:                                                */ 00051000
 /*                                                                  */ 00052000
 /*     Serialization is required to change the TMP3TIBQ field.      */ 00053000
 /*     Serialization is provided via ENQ and DEQ macros as          */ 00054000
 /*     follows:                                                     */ 00055000
 /*                                                                  */ 00056000
 /*         Major name:  SYSZTSOE  -- a prefix of SYSZ indicates     */ 00057000
 /*                                   that this is a system          */ 00058000
 /*                                   (authorized) ENQ.              */ 00059000
 /*         Minor name:  TCBAxxxx  -- where xxxx is the active       */ 00060000
 /*                                   IKJEFT02 TCB address at the    */ 00061000
 /*                                   time that the TMP3TIBQ is to   */ 00062000
 /*                                   be changed.                    */ 00063000
 /*                                                                  */ 00064000
 /*                                   The active IKJEFT02 TCB        */ 00065000
 /*                                   address is available in the    */ 00066000
 /*                                   TMP3AT02 field of the TMP3     */ 00067000
 /*                                   data area.                     */ 00068000
 /*         Scope:       Step Level                                  */ 00069000
 /*                                                                  */ 00070000
 /*01* METHOD OF ACCESS:                                             */ 00071000
 /*02*  PLAS: %INCLUDE SYSLIB(IKJTMP3)                               */ 00072000
 /*                                                                  */ 00073000
 /*           Addressability to this control block is obtained       */ 00074000
 /*           by the following chain:                                */ 00075000
 /*                                                                  */ 00076000
 /*               PSAAOLD->ASCBASXB->ASXBLWA->LWATMPW3               */ 00077000
 /*                                                                  */ 00078000
 /*01* NOTES:                                                        */ 00079000
 /*                                                                  */ 00080000
 /*   TMP3LEVL INDICATORS:                                   @E2367I5*/ 00081000
 /*       1 = ORIGINAL TMP3 (REL 2, 2.1)                     @E2367I5*/ 00082000
 /*       2 = TSO/E XA RELEASE 3 SUPPORT                     @E2367I5*/ 00083000
 /*                                                                  */ 00084000
 /*01* CHANGE ACTIVITY:                                              */ 00085000
 /*                                                                  */ 00086000
 /*ZTS0161 RECOVERY SUPPORT FOR IKJEFT02                     @E1213F3*/ 00087000
 /*ZTS0254 SUPPORT FOR ATTENTIONING OUT OF CLIST             @E1213F3*/ 00088000
 /*E2367I5 TSO/E RELEASE 3 SUPPORT FOR INVOKING CLISTS       @E2367I5*/ 00089000
 /*        THROUGH THE TSO SERVICE FACILITY                  @E2367I5*/ 00090000
 /*                                                                  */ 00091000
 /* PBY0239 - DCR TO SUPPORT "STACK BARRIER" ELEMENT.        @PBY0239*/ 00092000
 /*           CHANGE WAS MADE TO IKJTMP3 TO REMOVE           @PBY0239*/ 00093000
 /*           THE TSF LEVEL COUNTER SINCE IT IS NO LONGER    @PBY0239*/ 00094000
 /*           NEEDED.                                        @PBY0239*/ 00095000
 /*                                                                  */ 00096000
 /* PBY0275 - 0C4 OCCURRED IN IKJEFT02 WHEN NO CLIST         @PBY0275*/ 00097000
 /*           ATTENTION EXIT PRESENT.                        @PBY0275*/ 00098000
 /*                                                                  */ 00099000
 /* PEI0974 - ADD A BIT TO TELL TSF WHEN TERMINATION IS      @PEI0974*/ 00100000
 /*           PROGRESS. TSF WILL INTERROGATE THIS BIT AND    @PEI0974*/ 00101000
 /*           IF IT IS ON, WILL NOT ACCEPT ANY FURTHER       @PEI0974*/ 00102000
 /*           REQUESTS.                                      @PEI0974*/ 00103000
 /*                                                                  */ 00104000
 /* @E22D2D3 - TSO/E 2.2.0 CONSOLE SUPPORT                   @E22D2D3*/ 00105000
 /*                                                                  */ 00106000
 /* OY36904 - ADDED FIELD TO HOLD REXX ENVIRONMENT BLOCK     @YA36904*/ 00107000
 /*           ADDRESS USED DURING TMP INIT AND TERM          @YA36904*/ 00108000
 /*           PROCESSING.                                    @YA36904*/ 00109000
 /*                                                                  */ 00110000
 /* OY37243 - DECLARE A FOOTPRINT SET BY IKJEFTSC BEFORE STATUS      */ 00111000
 /*           STOP IS ISSUED FOR THE NON-PARALLEL TMP AND RESET      */ 00112000
 /*           BY THE PARALLEL IKJEFT02 AFTER THE TCBPTR IS           */ 00113000
 /*           STORED IN IKJTMPWA. THIS FOOTPRINT IS CHECKED BY       */ 00114000
 /*           IKJATTN IN IKJEFTSC AND IF SET ON THE ATTENTION        */ 00115000
 /*           WILL BE IGNORED.                               @YA37243*/ 00116000
 /*                                                                  */ 00117000
 /* OW00765 - ADD A BIT WHICH INDICATES THAT THE REGISTER    @WA00765*/ 00118000
 /*           FUNCTION FOR USAGE BASED PRICING HAS BEEN      @WA00765*/ 00119000
 /*           PERFORMED.                                     @WA00765*/ 00120000
 /*                                                                  */ 00121000
 /* E25D2JC - Prolog updated for SHOWHDR tool.  Size of the  @E25D2JC*/ 00122000
 /*           DSECT increased for TSO/E 2.5 TSOLIB support.  @E25D2JC*/ 00123000
 /*                                                          @E25D2JC*/ 00124000
 /*           JDC note:  Make sure that I did not miss       @E25D2JC*/ 00125000
 /*           JDC note:  any maintenance.                    @E25D2JC*/ 00126000
 /*                                                                  */ 00127000
 /* OW24332 - NEW FLAG INDICATING WHETHER THE ESATE FOR IKJEFT01     */ 00127200
 /*           HAS BEEN ESTABLISHED WITH CANCEL=YES OR NO. FOR MORE   */ 00127400
 /*           INFORMATION ABOUT THIS APAR SEE IKJEFT01 DESCR.@WA24332*/ 00127600
 /*                                                                  */ 00127800
 /***End of Specifications********************************************/ 00128000
 /*A000000-999999                                            @E1213G8*/ 00129000
 @SPACE;                                                                00130000
 DECLARE                                                                00131000
   1 TMP3 BASED(LWATMPW3) BDY(DWORD),                                   00132000
     2 TMP3TMP3 CHAR(4),     /* ACRONYM IN EBCDIC 'TMP3'             */ 00133000
     2 TMP3LEV FIXED(8),     /* TMP3 VERSION                         */ 00134000
     2 TMP3FLAG CHAR(1),   /* FLAG NEEDED BY TMP PROCESSING   @ZTS0254*/00135000
       3 TMP3ATTN BIT(1),  /* INDICATE ATTN EXIT ESTABLISHED BY T02 IS  00136000
                              IN CONTROL (IKJEFT03)           @ZTS0254*/00137000
       3 TMP3TSFC BIT(1),  /* AN ATTENTION OCCURRED WHILE IN            00138000
                              TSF/CLIST MODE AND THERE WERE             00139000
                              NO CLIST ATTENTION EXITS TO               00140000
                              PROCESS.                        @PBY0275*/00141000
       3 TMP3NOAT BIT(1),  /* AN ATTENTION OCCURRED WHILE THE           00142000
                              PARALLEL TMP IS INITIALIZING   @YA37243*/ 00143000
       3 TMP3USAG BIT(1),  /* INDIC. REGISTERED FOR USAGE               00144000
                              BASED PRICING                  @WA00765*/ 00145000
       3 TMP3ESTA_CANCEL BIT(1), /* SHOWS HOW THE ESTAE IS SET-UP BY    00146190
                                IKJEFT01, IKJEFTSC YES: CANCEL=YES      00146380
                                NO: CANCEL=NO                @WA24332*/ 00146570
       3 *        BIT(3),    /*  R E S E R V E               @WA24332*/ 00146760
     2 TMP3RS02 BIT(8),      /* RESERVED                     @PBY0239*/ 00147000
     2 TMP3TBIU BIT(1),      /* TMP TIB IN USE BIT MAINTAINED BY        00148000
                                IKJEFTP2 AND IKJEFT08        @E2367I5*/ 00149000
     2 TMP3TSFA BIT(1),      /* AN ATTENTION OCCURRED WHILE IN          00150000
                                TSF/CLIST MODE, AN AUTHORIZED COMMAND   00151000
                                WAS PROCESSING, AND THERE WAS NO        00152000
                                CLIST ATTENTION ROUTINE. THIS INDICATES 00153000
                                THAT THE PARALLEL TMP SHOULD BE         00154000
                                TERMINATED. SET BY IKJEFT03, CHECKED    00155000
                                AND RESET BY IKJEFTP2.       @E2367I5*/ 00156000
     2 TMP3TIP  BIT(1),      /* TERMINATION IN PROGRESS AT THE T01      00157000
                                TASK LEVEL                   @PEI0974*/ 00158000
     2 TMP3RS03 BIT(5),      /* RESERVED                     @PEI0974*/ 00159000
     2 TMP3PECB,             /* ECB USED TO INITIATE PARALLEL TMP       00160000
                                PROCESSING                           */ 00161000
       3 * BIT(1),           /* ECB WAIT BIT                         */ 00162000
       3 TMP3PECP BIT(1),    /* PARALLEL PROCESSING ECB POST BIT     */ 00163000
       3 * BIT(30),          /* ECB COMPLETION CODE                  */ 00164000
     2 TMP3AT02 PTR,         /* TCB ADDR FOR THE T02 CURRENTLY          00165000
                                ACTIVE                               */ 00166000
     2 TMP3TIBQ PTR,         /* ADDR OF THE FIRST BLOCK ON THE TIB      00167000
                                (TMP INTERFACE BLOCK) QUEUE          */ 00168000
     2 TMP3WKA2 PTR,         /* PTR TO AN IMAGE OF TMPWRKA2 USED TO     00169000
                                INITIALIZE THE TMP WORK AREAS PASSED    00170000
                                TO THE PARALLEL T02                  */ 00171000
     2 TMP3ENVB PTR,         /* PTR TO TSO REXX ENVBLOCK     @YA36904*/ 00172000
     2 TMP3WRK2 PTR,         /* PTR TO A TMPWRKA2 (KEY 1) USED BY       00173000
                                T01                                  */ 00174000
     2 TMP3WA2  PTR(31),   /*PTR TO T02'S PROTECTED WORKAREA @ZTS0161*/ 00175000
     2 TMP3AW2  PTR(31),   /*PTR TO ACTIVE T02 PROTECTED WORKAREA       00176000
                             NEED BY ATTN EXIT IN TSC TO GET ACCESS     00177000
                             TO UNPROTECTED WORKAREA TO POST ATTN ECB   00178000
                                                              @ZTS0254*/00179000
     2 TMP3AECB,             /* ECB USED TO INITIATE CONSOLE AUTHORIZED 00180000
                                TASK                         @E22D2D3*/ 00181000
       3 * BIT(1),           /* ECB WAIT BIT                 @E22D2D3*/ 00182000
       3 TMP3AECP BIT(1),    /* ATTACH CONSOLE TASK ECB POST BIT        00183000
                                                             @E22D2D3*/ 00184000
       3 * BIT(30),          /* ECB COMPLETION CODE          @E22D2D3*/ 00185000
     2 TMP3DECB,             /* ECB POSTED BY RTM WHEN THE CONSOLE      00186000
                                AUTHORIZED TASK TERMINATES   @E22D2D3*/ 00187000
       3 * BIT(1),           /* ECB WAIT BIT                 @E22D2D3*/ 00188000
       3 TMP3DECP BIT(1),    /* DETACH CONSOLE TASK ECB POST BIT        00189000
                                                             @E22D2D3*/ 00190000
       3 * BIT(30),          /* ECB COMPLETION CODE          @E22D2D3*/ 00191000
     2 TMP3TECB,             /* TSOLIB's ECB - used to initiate         00192000
                                a TSOLIB request                        00193000
                                within the TMP.              @E25D2JC*/ 00194000
       3 * BIT(1),           /* TSOLIB ECB wait bit          @E25D2JC*/ 00195000
       3 TMP3TECP BIT(1),    /* TSOLIB ECB post bit          @E25D2JC*/ 00196000
       3 * BIT(30),          /* TSOLIB ECB completion code   @E25D2JC*/ 00197000
     2 TMP3FREE(10)  PTR(31),/* Room reserved for                       00198000
                                later use.                   @E25D2JC*/ 00199000
 @SPACE;                                                                00200000
 /********************************************************************/ 00201000
 /*                                                                  */ 00202000
 /* *****    ADD ANY NEW FIELDS BEFORE THE NEXT DECLARE.    *****    */ 00203000
 /*                                                                  */ 00204000
 /********************************************************************/ 00205000
 @SPACE;                                                                00206000
     2 * CHAR(0) BDY(DWORD); /* ASSURE TMP3 ENDS ON A DOUBLE WORD       00207000
                                BOUNDARY                             */ 00208000
 @SPACE;                                                                00209000
 /********************************************************************/ 00210000
 /*                                                                  */ 00211000
 /*    CONSTANTS FOR INITIALIZING THE CONTROL BLOCK ID AND LEVEL     */ 00212000
 /*                                                                  */ 00213000
 /*  **** TMP3LEVL MUST BE INCREMENTED WHEN THE TMP3 IS UPDATED.**** */ 00214000
 /*                                                                  */ 00215000
 /********************************************************************/ 00216000
 @SPACE;                                                                00217000
   DECLARE TMP3CHAR CHAR(4) CONSTANT('TMP3'); /* CHARACTERS FOR         00218000
                                                 INITIALIZING           00219000
                                                 TMP3TMP3            */ 00220000
   DECLARE TMP3LEVL FIXED(8) CONSTANT(3);   /* TMP3 LEVEL = 3           00221000
                                                             @E22D2D3*/ 00222000
