*/** Start of Specifications******************************************/ 00001000
*/*                                                                  */ 00002000
*/*01* MACRO-NAME: IKJTMPWA                                          */ 00003000
*/*                                                                  */ 00004000
*/*01* DESCRIPTIVE-NAME: TMP Work Area                               */ 00005000
*/*                                                                  */ 00006000
*/*01* PROPRIETARY STATEMENT=                                        */ 00007000
*/***PROPRIETARY_STATEMENT***************************************@N1C*/ 00008000
*/*                                                                  */ 00009000
*/* Licensed Materials - Property of IBM                             */ 00010000
*/*                                                                  */ 00011000
*/* 5645-001                                                         */ 00012000
*/*                                                                  */ 00013000
*/* (C) Copyright IBM Corp. 1976, 1997                               */ 00014000
*/*                                                                  */ 00015000
*/* US Government Users Restricted Rights - Use, duplication or      */ 00016000
*/* disclosure restricted by GSA ADP Schedule Contract with          */ 00017000
*/* IBM Corp.                                                        */ 00018000
*/*                                                                  */ 00019000
*/* STATUS = HTE26D2                                                 */ 00020000
*/*                                                                  */ 00021000
*/***END_OF_PROPRIETARY_STATEMENT********************************@N1C*/ 00022000
*/*                                                                  */ 00023000
*/*01* FUNCTION:                                                     */ 00024000
*/*                                                                  */ 00025000
*/*      Contains major internal work areas for the TMP. These       */ 00026000
*/*      include:                                                    */ 00027000
*/*        > TMPWRKA1 - parameter lists and control information      */ 00028000
*/*                     needed for normal operation of the TMP.      */ 00029000
*/*        > TMPWA2   - contains information needed by the           */ 00030000
*/*                     TMPESTAE retry routine.                      */ 00031000
*/*        > TMPWRKA2 - a protected work area that contains infor-   */ 00032000
*/*                     mation needed by the TMP mainline to         */ 00033000
*/*                     indicate what processing the mainline        */ 00034000
*/*                     needs to perform.                            */ 00035000
*/*                                                                  */ 00036000
*/*01* DSECT-NAME: IKJTMPWA                                          */ 00037000
*/*                                                                  */ 00038000
*/*02*  ACRONYM: TMPWA                                               */ 00039000
*/*                                                                  */ 00040000
*/*01* EYE-CATCHER: None                                             */ 00041000
*/*                                                                  */ 00042000
*/*02*  OFFSET: N/A                                                  */ 00043000
*/*                                                                  */ 00044000
*/*02*  LENGTH: N/A                                                  */ 00045000
*/*                                                                  */ 00046000
*/*01* MACRO-TYPE: Bilingual Mapping macro                           */ 00047490
*/*                                                                  */ 00048000
*/*01* NOTES:                                                        */ 00049000
*/*                                                                  */ 00050000
*/*01* PROCESSOR: PL/AS and Assembler                                */ 00051000
*/*                                                                  */ 00052000
*/*01* COMPONENT: TSO/E Scheduler (28502)                            */ 00053000
*/*                                                                  */ 00054000
*/*01* STORAGE-ATTRIBUTES:                                           */ 00055000
*/*                                                                  */ 00056000
*/*02*  SUBPOOL:  230                                                */ 00057000
*/*                                                                  */ 00058000
*/*02*  KEY: 0,1                                                     */ 00059000
*/*                                                                  */ 00060000
*/*02*  RESIDENCY:  Above 16M line                                   */ 00061000
*/*                                                                  */ 00062000
*/*01* SIZE: See listing                                             */ 00063000
*/*                                                                  */ 00064000
*/*01* CREATED-BY:  IKJEFT01, IKJEFTSC                               */ 00065000
*/*                                                                  */ 00066000
*/*01* POINTED-TO-BY: WRKAPTR1 - Program Problem State Work Area Ptr.*/ 00067000
*/*                   WRKAPTR2 - Supervisor State Work Area Ptr.     */ 00068000
*/*                                                                  */ 00069000
*/*01* SERIALIZATION:  None                                          */ 00070000
*/*                                                                  */ 00071000
*/*01* METHOD-OF-ACCESS: See additional Prolog information below     */ 00072000
*/*                                                                  */ 00073000
*/*01* External Classification: GUPI                                 */ 00074000
*/*01* End of External Classification:                               */ 00075000
*/*                                                                  */ 00076000
*/*01* CHANGE-ACTIVITY: See additional Prolog information below      */ 00077000
*/*                                                                  */ 00078000
*/***End of Specifications********************************************/ 00079000
*       %GOTO TMPWABSL;                                                 00080000
* TO EXCLUDE THE MAPPING OF TMPWRKA1 FROM THE PROGRAM    @E1213F3*/     00081000
* SPECIFY THE FOLLOWING OPERAND WHEN INVOKING THE MAPPING@E1213F3*/     00082000
*        1)WORKA1=NO                                     @E1213F3*/     00083000
****                                                        @E1213F3*/  00084000
****   CHANGE ACTIVITY =                                            */  00085000
****    A 0-999999                               @ZA40795 & @ZA40796*/  00086000
****    SUPPORT FOR MVS/SE 2                                @ZA39401*/  00087000
****    SUPPRORT FOR EXTENDED RC SUPPORT                    @E1113KJ*/  00088000
****    CHANGE COPYRITE DATE                                @ZMT0073*/  00089000
****    SUPPORT FOR INTEGRITY PTF                           @E1213F3*/  00090000
****    OZ66275 -ADD TSEVENT ISSUED FLAG                    @ZA66275*/  00091000
****    ZTY0011 -REMOVE RETURN CODE REG 0 SUPPORT           @ZTY0011*/  00092000
****    ZTS0162 -CALL COMMAND RECOVERY PROCESSING           @ZTS0162*/  00093000
****    @E2267H1-INCLUDED POINTERS NEED FOR VSCR            @E2267H1*/  00094000
****    @PBB0045-GET RID OF TMP2ATT                         @PBB0045    00095000
****    @OZ85291- 0C4 IN IKJEFTP2 FOLLOWING A RETRY TO      @ZA85291*/  00096000
****              IKJTWAIT FROM IKJEFT05                    @ZA85291*/  00097000
****    @E2367S4- TSO/E RELEASE 3 SUPPORT FOR THE           @E2367S4*/  00098000
****              CLIST ATTENTION FACILITY AND CLISTS       @E2367S4*/  00099000
****              INVOKED THROUGH THE TSO SERVICE FACILITY. @E2367S4*/  00100000
****    @OZ89253- ADD SKPATTN TO INDICATE WHEN IKJEFT03     @ZA89253*/  00101000
****              CAN PROCESS AN ATTENTION.                 @ZA89253*/  00102000
****                                                                */  00103000
****    @PBY0271- ADDED CODE TO SKIP PPL                    @PBY0271*/  00104000
****     THE LENGTH OF THE PPL (PARSE PARAMETER LIST) IS HARD CODED */  00105000
****     BECAUSE IKJEFTSC CONTAINS ANOTHER MACRO WITH THE SAME NAME.*/  00106000
****     BOTH IKJPPL AND IECDPPL (PURGE PARAMETER LIST) USE PPL.    */  00107000
****                                                        @PBY0271*/  00108000
****                                                                */  00109000
****    @PBY0285- ADD TMP1TSFE BIT. SET BY IKJEFT04 WHEN    @PBY0285*/  00110000
****              AN ERROR OCCURS IN A CLIST RUNNING IN     @PBY0285*/  00111000
****              TSF/CLIST MODE AND THE CLIST HAS BEEN     @PBY0285*/  00112000
****              FLUSHED. THIS INDICATES TO IKJEFT02 THAT  @PBY0285*/  00113000
****              IT SHOULD FLUSH THE STACK.                @PBY0285*/  00114000
****                                                                */  00115000
****    @PBY0306- MERGE OF APAR OZ96882. ADDED PROTECTED            */  00116000
****              SAVEAREAS FOR IKJEFT02 AND IKJEFTP2. MOVED        */  00117000
****              PARAMETER LIST FOR IKJEFT03 INTO TMPWRKA2.        */  00118000
****              ADDED SYNCH PARAMETER LIST.               @ZA96882*/  00119000
****                                                                */  00120000
****    @OZ91237- DEFINE AN ECB FOR IKJEFTSC ATTENTION EXIT         */  00121000
****              (IKJATTN) TO WAIT ON WHILE IKJEFT03 PROCESSES     */  00122000
****              AN ATTENTION.                             @ZA91237*/  00123000
****                                                                */  00124000
****    @PBY0316- MOVED TMP1TSFE BIT (INTRODUCED VIA PTM            */  00125000
****              PBY0285) FROM CALLSWS STRUCTURE TO RESERVED       */  00126000
****              AREA IN TMPSWS. IKJEFT08 REMAPPED THIS AREA       */  00127000
****              CAUSING A CONFLICT.                       @PBY0316*/  00128000
****                                                                */  00129000
****    @E21D2I6- TSOE AUTHORIZED TESTING SUPPORT           @E21D2I6*/  00130000
****                                                                */  00131000
****    @PEI0432- ADDED FIELDS FOR REXX PROTECTION AND      @PEI0432*/  00132000
****              UNPROTECTION.                             @PEI0432*/  00133000
****                                                                */  00134000
****    @PEI0966- INSERT THE TEXT VERSION OF THE COPYRITE   @PEI0966*/  00135000
****                                                                */  00136000
****    OY18897 - ADD A BIT WHICH WILL BE USED TO INDICATE THAT PCF */  00137000
****              HAS ASKED THE TMP TO DO A DIRECT ATTACH OF THE    */  00138000
****              COMMAND PROCESSOR.  THIS WILL BE TURNED ON WHEN   */  00139000
****              THE PCF EXIT RETURNS A RETURN CODE 0.     @YA18897*/  00140000
****                                                                */  00141000
****    OY25597 - CHANGE THE LENGTH OF STPBSP TO 6 WORDS AND        */  00142000
****              THE LENGTH OF STPLSP TO 4 WORDS (ASSEMBLER        */  00143000
****              VERSION ONLY).                            @YA25597*/  00144000
****                                                                */  00145000
****    OY25427 - CHANGE ABEND SUBCODE AND ERROR MESSAGE AREA TO    */  00146000
****              ALLOW FOR 4-BYTE REASON CODES.            @YA25427*/  00147000
****                                                                */  00148000
****    @E23D2I6- TSO/E AUTHORIZED PLATFORM SUPPORT         @E23D2I6*/  00149000
****                                                                */  00150000
****    @PID0180- EXPAND DYNASP, MDYNASP, AND DYNAPARM      @PID0180*/  00151000
****              TO 10 FULLWORDS FOR USE WITH DRITCBAD.    @PID0180*/  00152000
****              TMPWRKA1 RESERVED SPACE IS EXPANDED.      @PID0180*/  00153000
****                                                                */  00154000
****    @PID0241- FIX THE ABMSGSP FIELD IN THE ASM          @PID0241*/  00155000
****              BROKEN BY OY25427                                 */  00156000
****                                                                */  00157000
****    OY34525 - DECLARE A FOOTPRINT SET BY IKJEFTP2 BEFORE        */  00158000
****              ISSUING DETACH AND RESET ON RETURN FROM           */  00159000
****              DETACH. CHECKED BY IKJEFT05 TO DETERMINE IF       */  00160000
****              DETACH SHOULD BE ISSUED BY IKJEFT05.      @YA34525*/  00161000
****                                                                */  00162000
****    OY40214 - DECLARE A FLAG SET BY IKJEFT04 WHEN THE TMP       */  00163000
****              HAS RECEIVED AN ABEND806 WHILE ATTACHING A        */  00164000
****              COMMAND.                                  @YA40214*/  00165000
****                                                                */  00166000
****   @PMH0003 - UPDATED PROLOG TO CONFORM TO THE SHOWHDR  @PMH0003*/  00167000
****              TOOLS STANDARDS REQUIRED BY INFORMATION   @PMH0003*/  00168000
****              DEVELOPMENT.                              @PMH0003*/  00169000
****   @PMH0160 - Added CDPI information                    @PMH0160*/  00170000
****                                                                */  00171000
****   @E25D2JC - Added the following fields:               @E25D2JC*/  00172000
****              -   TMP2TSLB                              @E25D2JC*/  00173000
****              -   TMP2RGQ2                              @E25D2JC*/  00174000
****              -   TMP2DYDC                              @E25D2JC*/  00175000
****              -   TMP1TQ2S                              @E25D2JC*/  00176000
****   @E25D2JC - Added the following fields:               @E25D2JC*/  00177000
****              -   TMP2T01E                              @E25D2JC*/  00178000
****                                                        @E25D2JC*/  00179000
****              -   TMP2ET01                              @E25D2JC*/  00180000
****              -   TMP2ET1A                              @E25D2JC*/  00181000
****              -   TMP2ET1B                              @E25D2JC*/  00182000
****              -   TMP2ET1I                              @E25D2JC*/  00183000
****              Removed the following fields:             @E25D2JC*/  00184000
****              -   T1AENTRY                              @E25D2JC*/  00185000
****                                                                */  00186000
****   @OW21212 - Add three new fields to save R15,R0,R1 for@WA21212*/  00187000
****              IKJEFT05 recovery routine.                @WA21212*/  00188000
****              -   TMP2T5R0                              @WA21212*/  00189000
****              -   TMP2T5R1                              @WA21212*/  00190000
****              -   TMP2T5RF                              @WA21212*/  00191000
****                                                                */  00192000
****   @OW19057 - Enablement of PWS exits introduced in     @WA19057*/  00193000
****              TSO/E 2.5.                                @WA19057*/  00194000
****   @KX00014 - Add two new fields: address and length of @KX00014*/  00195000
****              IKJEFT05 Key 1 save area                  @KX00014*/  00196000
****              -   TMP2T5WL len of T05 key1 GETMAIN area @KX00014*/  00197000
****              -   TMP2T5W1 addr of T05 key1 GETMAIN area@KX00014*/  00198000
****                                                                */  00199000
****   @L1=     - Update PL/X definition to eliminate informational */  00200000
****              compiler messages                             @L1=*/  00201000
****                                                                */  00202000
****   @OW23000 - Add definition for TMP2NTSL to indicate   @WA23000*/  00203000
****              that a command is not eligible to be      @WA23000*/  00204000
****              invoked from a dataset defined by TSOLIB  @WA23000*/  00205000
****                                                                */  00206000
****   @OW25066 - Update BAL portion of OW19057 to remove   @WA25066*/  00207000
****              compiler error                            @WA25066*/  00208000
****                                                                */  00209000
*/* FLAG REASON   RELEASE DATE     ORIGIN                        @N1A*/ 00210000
*/* ---- ------   ------- -------- ------                        @N1A*/ 00211000
*/* $N1= COPYRITE HTE26D2 19970213 VOHS: Insert/Update Copyright @N1A*/ 00212000
*/* $L2= REQ59149 HTE26D2 19970326 VOHS: Add field TMP1CDCA      @L2A*/ 00213000
*/*                                                                  */ 00214000
****   @OW30624 - Update assembler portion of @L2A to remove        */  00214200
****              assembler error                           @WA30624*/  00214400
****                                                                */  00214600
****    OW36096 - Allow the CALL * command to CALL modules which    */  00214620
****              reside only in LPA.  A module is considered to    */  00214640
****              reside only in LPA if a BLDL for the module in    */  00214660
****              the standard search order (DCB=0) fails, but a    */  00214680
****              CSVQUERY is successful.  In this case, the ATTACH */  00214700
****              macro must be coded with the EPLOC parameter,     */  00214720
****              because the DE parameter does not point to a      */  00214740
****              valid Directory Entry list (because the BLDL      */  00214760
****              failed.)  This APAR adds fields BLDLTMP_TT and    */  00214780
****              BLDLTMP_R to the mappings.  These fields simply   */  00214800
****              break down the BLDLTTRZ field so that the TT      */  00214820
****              (relative track) and R (record number) fields     */  00214840
****              returned by BLDL can be addressed directly.       */  00214860
****                                                        @WA36096*/  00214880
****                                                                */  00214900
****                                                                */  00214920
.* A 0-999999                                      @ZA40795 & @ZA40796  00215000
          MACRO                                                         00216000
          IKJTMPWA &WORKA1=YES                                          00217000
          AIF   ('&WORKA1' EQ 'NO').WORKA2                              00218000
*********************************************************************/  00219000
**** TMPWRKA1 -- TMP PROBLEM PROGRAM STATE DYNAMIC WORK AREA        */  00220000
****                                                                */  00221000
****   THIS DYNAMIC WORK AREA IS GOTTEN FROM SUBPOOL 1, PP KEY, BY  */  00222000
****   IKJEFT01  DURING  TMP INITIALIZATION AND ANOTHER ONE         */  00223000
****   WILL BE GOTTEN IN IKJEFTSC IF A PARALLEL TMP IS NEEDED AND   */  00224000
****   THIS WORKAREA WILL BE FREED WHEN THE PARALLEL TMP IS FINISHED*/  00225000
****   WHILE THE ONE GOTTEN FOR THE NON-PARALLEL SIDE BY IKJEFT01   */  00226000
****   WILL NOT BE FREED UNTIL THE END OF THE TERMINAL SESSION.     */  00227000
****   DURING THE TMP SEVERITY 2 STAE RETRY ALL OF STORAGE IS FREED */  00228000
****   AND THIS WORKAREA MUST BE REINITIALIZED.                     */  00229000
****                                                        @E1113KJ*/  00230000
*********************************************************************/  00231000
         IKJTPL                                                         00232000
TMPWRKA1 EQU  TPL    WORK AREA BEGINS WITH TEST PARAMETER LIST          00233000
*     /* TMP COMMON VARIABLES AND WORK AREAS                        */  00234000
TMPNECB  DS    F                     /* ECB FOR STAI WAIT           */  00235000
TMPCECB  DS    F                     /* ECB FOR ATTACHED CP         */  00236000
TMPIECB  DS    F                     /* ECB FOR STAI POST           */  00237000
TMPAECB  DS    F                     /* ECB FOR ATTN POST           */  00238000
TMPCMDWT DS    F                     /* PTR TO CMD FROM ATTN EXIT   */  00239000
*                                                                       00240000
TMPSWS   DS    F                     /* TMP INTERNAL SWITCHES       */  00241000
TMPTEST  EQU   X'80'                 /* TEST PROGRAM IN CONTROL     */  00242000
TMPCMDW  EQU   X'40'                 /* COMMAND WAITING             */  00243000
TMPNFCMD EQU   X'20'                 /* FIRST COMMAND IS PROCESSED  */  00244000
TMPACTRL EQU   X'10'                 /* TMP ATTN EXIT IS IN CONTROL */  00245000
TMPSCTRL EQU   X'08'                 /* TMP STAI EXIT IS IN CONTROL */  00246000
ABND806  EQU   X'04'                 /* NO-MODULE FOUND BY FETCH    */  00247000
FRSTLAB  EQU   X'02'                 /* 1ST LEVEL ATTACHEE ABENDED  */  00248000
NONSCUR  EQU   X'01'                /* SECURITY AUTHORIZATION FAILS */  00249000
*                                                                       00250000
ATCHNOW  EQU   X'80'                 /* ABEND OCCURRED IN ATTACH    */  00251000
LOADNOW  EQU   X'40'                 /* ABEND OCCURRED IN LOAD      */  00252000
LINKNOW  EQU   X'20'                 /* ABEND OCCURRED IN LINK      */  00253000
FRSTEX   EQU   X'10'                /* FIRST EXPL/IMPLICIT EXEC TRY */  00254000
CALLNOW  EQU   X'08'                 /* CALL FUNCTION ACTIVE        */  00255000
TMP1TIME EQU   X'04'                 /* ESTAI ENTERED(TEST) @ZTM5046*/  00256000
T7TDONE  EQU   X'02'                 /* TSEVENT ISSUED     @ZA66275 */  00257000
SKPATTN  EQU   X'01'                 /* 1-BYPASS ATTN       @ZA89253*/  00258000
*                                                                       00259000
TMP1TSFE EQU   X'80'                 /* ERROR OCCURRED IN CLIST         00260000
*                                       WHILE IN TSF/CLIST MODE.        00261000
*                                                           @PBY0316*/  00262000
CALLSWS  EQU   TMPSWS+3              /* TMP-CALL INTERNAL SWITCHES  */  00263000
PDLPRES  EQU   X'80'                 /* PDL RETURNED BY PARSE       */  00264000
DSOPEN   EQU   X'40'                 /* DATA SET IS OPEN            */  00265000
BLANKB   EQU   X'10'                 /* DATA SET NAME PROCESSED     */  00266000
DORELS   EQU   X'08'                 /* RELEASE PDL NOW             */  00267000
GMBRNOW  EQU   X'04'                 /* GET MEMBER NAME             */  00268000
PCFDA    EQU   X'02'                 /* PCF DIRECT ATTACH   @YA18897*/  00269000
*        EQU   X'01'                 /* RESERVED FLAG       @YA18897*/  00270000
*     /* RESERVED AREAS                                             */  00271000
TMPT9ECB DS  A                       /* ECB USED FOR COMMUNICATION      00272000
*                                       BETWEEN IKJEFT09 AND IKJURPS    00273000
*                                                           @E24D2H3*/  00274000
TMPURPA  DS  A                       /* ANCHOR FOR URP REQUEST BLOCK    00275000
*                                       CHAIN FOR IKJEFT09  @E24D2H3*/  00276000
RESCOMM  DS     CL8                  /*                     @E24D2H3*/  00277000
RESCOM2  DS     CL16                                                    00278000
RESCOM3  DS     CL16                                                    00279000
RESCOM4  DS     CL16                                                    00280000
         DS     CL4                /* RESERVED WAS FLOFLGS  @ZA46174*/  00281000
CPPLPTR  DS     F                    /* PTR TO CP PARM LIST         */  00282000
CSOAPTR  DS     F                    /* PTR TO CMD SCAN PARM LIST   */  00283000
CSPLPTR  DS     F                    /* PTR TO CMD SCAN PARM LIST   */  00284000
DAPLPTR  DS     F                    /* PTR TO DAIR PARM LIST       */  00285000
GTPBPTR  DS     F                    /* PTR TO GETLINE PARM BLOCK   */  00286000
IOPLPTR  DS     F                    /* PTR TO I/O RTNS PARM LIST   */  00287000
PGPBPTR  DS     F                    /* PTR TO PUTGET PARM BLOCK    */  00288000
PPLPTR   DS     F                    /* PTR TO PARSE PARM LIST      */  00289000
PTPBPTR  DS     F                    /* PTR TO PUTLINE PARM BLOCK   */  00290000
STPLPTR  DS     F                    /* PTR TO STACK PARM LIST      */  00291000
ACEEPTR  DS     F                    /* ADDR OF ACEE                */  00292000
ASCANAP  DS     F                    /* ADDR OF ATTN SCAN ANSWER    */  00293000
ASRPLPTR DS     F                    /* ADDR OF ATTN SRPL           */  00294000
ATTCHPTR DS     F                    /* ADDR OF ATTACH PARM LIST    */  00295000
CDCBPTR  DS     F                    /* PTR TO CALL DCB             */  00296000
DCBPTR   DS     F                    /* PTR TO DCB                  */  00297000
DYNAPPTR DS     F                    /* PTR TO DYNALLOC PARM LIST   */  00298000
EBCDPTR  DS     F                    /* PTR TO TRANSLATE TABLE      */  00299000
READYPTR DS     F                    /* ADDR OF TMP MODE MESSAGE    */  00300000
SCANAP   DS     F                    /* ADDR OF SCAN ANSWER AREA    */  00301000
SRPLPTR  DS     F                    /* ADDR OF SRPL                */  00302000
         DS     F                    /* RESERVED            @ZA96882*/  00303000
STPBPTR  DS     F                    /* ADDR OF STACK PARM LIST     */  00304000
*     /* RESERVE SPACE FOR PARAMETER LISTS, BLOCKS                  */  00305000
         DS     0D                   /* ALIGN TO DOUBLEWORD         */  00306000
ABMSGSP  DS     CL41                  /* MESSAGE AREA       @PID0241*/  00307000
*     /* PUTLINE ACTIVE SEGMENT LIST    LIST                        */  00308000
ACTSL    DS     0F                   /* NAME OF LIST                */  00309000
ACTSEG   DS     28F                  /* SEGMENTS                    */  00310000
ACTSEGA  EQU    ACTSEG               /* FIRST HWORD OF SEGMENT      */  00311000
ACTSEGB  EQU    ACTSEG+2             /* SECOND HWORD OF SEGMENT     */  00312000
AMSGLIST DS     0F                   /* ATTN MESSAGE LIST           */  00313000
ANUMSEG  DS     F                    /* NUMBER OF MESSAGE SEGMENTS  */  00314000
AMSGSEG  DS     2F                   /* ARRAY OF SEGMENT PTRS       */  00315000
ARCODE   DS     F                    /* ATTN RETURN CODE SAVE AREA  */  00316000
ASCANFLG DS     F                    /* ATTN SCAN FLAGS             */  00317000
ASRPARM  DS     5F                   /* ATTN SR PARM AREA           */  00318000
ATTCHSP  DS     18F                  /* ATTACH PARM LIST SP @ZTY0371*/  00319000
BLDLLST  DS     0CL68                /* BLDL ENTRY                  */  00320000
XTRCLST  DS     0CL12                /* EXTRACT LIST                */  00321000
BLDLENT  DS     H                    /* NUM OF ENTRIES              */  00322000
BLDLELNG DS     H                    /* LENGTH OF ENTRY             */  00323000
BLDLNAME DS     CL8                  /* NAME OF COMMAND             */  00324000
BLDLTTRZ DS     CL56                 /* PAD TO FULL WORD    @ZA40795*/  00325000
         ORG    BLDLTTRZ             /* Redefine BLDLTTRZ   @WA36096*/  00325100
BLDLTMP_TT DS   CL2                  /* TT (relative track) returned    00325200
*                                       from BLDL           @WA36096*/  00325300
BLDLTMP_R DS    C                    /* R (record number) returned      00325400
*                                       from BLDL           @WA36096*/  00325500
         ORG    ,                    /* End of redefine     @WA36096*/  00325600
         DS     0D                   /* ALIGN TO DWORD              */  00326000
CDCBSP   DS     CL140                /* CALL DCB SPACE              */  00327000
CLOSESP  DS     CL12                 /* CLOSE PL SPACE              */  00328000
CPPLSP   DS     4F                   /* CPPL SPACE                  */  00329000
CSOASP   DS     2F                   /* CSOA SPACE                  */  00330000
CSOASP2  DS     2F                   /* 2ND CSOA SP (ATTN)          */  00331000
CSPLSP   DS     6F                   /* CSPL SPACE                  */  00332000
CSPLSP2  DS     6F                   /* 2ND CSPL SP (ATTN)          */  00333000
CTLBKSP  DS     0F                   /* NAME OF BLOCK SPACE         */  00334000
CTLBLKL  DS     F                    /* LENGTH OF BLOCK SPACE       */  00335000
CTLBLKA  DS     F                    /* LOC OF BLOCK SPACE          */  00336000
CTLBLKN  DS     F                    /* SUBPOOL                     */  00337000
DAPBSP   DS     21F                  /* DAIR PARM BLK SPACE         */  00338000
DAPLSP   DS     5F                   /* DAIR PARM LIST SPACE        */  00339000
         DS     0D                   /* ALIGN TO DOUBLEWORD         */  00340000
DCBSP    DS     CL140                /* DCB SPACE                   */  00341000
DYNASP   DS     10F                  /* DYNALLOC PL         @PID0180*/  00342000
DYNATUB  DS     BL4                  /* BIT FORM OF THE PLATFORM        00343000
*                                       TCB ADDRESS USED SO THAT THE    00344000
*                                       ADDRESS, NORMALLY ON A          00345000
*                                       WORD BOUNDARY, CAN BE COPIED    00346000
*                                       INTO THE TEXT UNIT PARM THAT'S  00347000
*                                       ON A HALFWORD                   00348000
*                                       BOUNDARY.           @PID0180*/  00349000
ECTSP    DS     14F                  /* ECT SPACE                   */  00350000
FMLCSP   DS     CL10                 /* FREEM PL SPACE              */  00351000
GTPBSP   DS     2F                   /* GTPB SPACE                  */  00352000
MODESSP  DS     F                    /* MODESET PARM LIST SPACE     */  00353000
NXTCMD   DS     2F                   /* COMMAND NAME FIELD          */  00354000
OPENSP   DS     3F                   /* OPEN PL SPACE               */  00355000
PGPBSP   DS     4F                   /* PGPB SPACE                  */  00356000
PPLSP    DS     7F                   /* PARSE PARM LIST SPACE       */  00357000
PRSMSSP  DS     3F                   /* MESSAGE AREA                */  00358000
PTPBSP   DS     3F                   /* PTPB SPACE                  */  00359000
RCODE    DS     F                    /* RETURN CODE SAVE AREA       */  00360000
R3SAVE   DS     F                    /* SAVE PDL PTR                */  00361000
SAVAR    DS     14F                  /* SAVE REGISTER ENVIRONMENT   */  00362000
SCANFLG  DS     F                    /* SCAN FLAGS                  */  00363000
SNAPSP   DS     10F                  /* SNAP PL SPACE               */  00364000
STPBSP   DS     6F                   /* STPB SPACE          @YA25597*/  00365000
STPLSP   DS     4F                   /* STACK PL SPACE      @YA25597*/  00366000
TMPZEROS DS     F                    /* ALL ZEROS WORD - DUMMY CBUF */  00367000
MODEMSP  DS     5F                  /* DUMMY SPACE FOR MODE MESSAGE */  00368000
         DS     CL20                 /* RESERVED                    */  00369000
*     /* WORK AREA FOR TMP-CALL FUNCTION                            */  00370000
CALLWA   DS     0F                                                      00371000
*       /* PROBLEM PROGRAM WORK AREA FOR CALL FUNCTION              */  00372000
PPWORKAR DS     0F                                                      00373000
PPLIST   DS     0F                                                      00374000
SWBIT    DS     C                                                       00375000
         DS     CL3                                                     00376000
PARMFLD  DS     0F                                                      00377000
LENPARM  DS     H                                                       00378000
PARMS    DS     CL100                                                   00379000
*       /* CALL INTERNAL WORK AREA                                  */  00380000
WORK1    DS     0F                                                      00381000
PARSPARM DS     0F                   /* PARSE PARMS                 */  00382000
PDLADDR  DS     F                   /* PTR TO PARM DESCRIPTOR LIST  */  00383000
PDLADDR2 DS     F                                                       00384000
DSNBUFFR DS     0H                                                      00385000
DSNLENG  DS     H                    /* LENGTH OF DATA SET NAME     */  00386000
DSNBUF   DS     CL44                 /* DSNAME                      */  00387000
         DS     CL2                  /* ALIGNMENT                   */  00388000
MSGNO    DS     F                    /* MESSAGE NUMBER              */  00389000
DAPB0PTR DS     F                                                       00390000
*       /* MEMBER NAME SEGMENT FOR MESSAGE                          */  00391000
MBRSEG   DS     0F                   /* NAME OF AREA                */  00392000
MBRSLEN  DS     H                    /* SEGMENT LENGTH              */  00393000
MBRSOFF  DS     H                    /* SEGMENT OFFSET              */  00394000
MBRSTXT  DS     CL8                  /* MEMBER NAME TEXT            */  00395000
*       /* MEMBER NAME SEGMENT FOR DAIR                             */  00396000
MBRDSEG  DS     0F                   /*   NAME OF AREA              */  00397000
MBRDLEN  DS     H                    /* SEGMENT LENGTH              */  00398000
MBRDTXT  DS     CL8                  /* NAME TEXT                   */  00399000
*       /* DATA SET NAME SEGMENT FOR MESSAGE                        */  00400000
DSSEG    DS     0F                   /* NAME OF AREA                */  00401000
DSSGLEN  DS     H                    /* SEGMENT LENGTH              */  00402000
DSSGOFF  DS     H                    /* SEGMENT OFFSET              */  00403000
DSSGTXT  DS     CL44                 /* DATA SET NAME TEXT          */  00404000
*       /* RETURN CODE RESERVE AREAS                                */  00405000
BLDLRC   DS     F              /* FOR BLDL RETURN CODE              */  00406000
DAIRRC   DS     F              /* FOR DAIR RETURN CODE              */  00407000
PUTLRC   DS     F              /* FOR PUTLINE RETURN CODE           */  00408000
CRCODE   DS     F              /* FOR GENERAL CALL RETURN CODE      */  00409000
*                                                                       00410000
*     /*  TMP RESTRUCTURE WORK AREAS                       @ZA40795 */  00411000
TMPCTCB  DS     A              /* PTR TO ATTACH CP TCB     @ZA40795 */  00412000
TMPTECB  DS     F              /* TEST RETURNED ECB        @ZA40795 */  00413000
TMPECB2  DS     F              /* IKJEFTXX EOT ECB         @ZA40795 */  00414000
CPABECB  DS     F              /* TEST RQST AFTER ABEND    @ZA40795 */  00415000
ECBLPTR  DS     A              /* PTR ECB WAIT LISTS       @ZA40795 */  00416000
TMPECBL2 DS     0F             /*                          @ZA40795 */  00417000
TMPCECB2 DS     A              /* PTR TO ATTACH CP ECB     @ZA40795 */  00418000
TMPIECB2 DS     A              /* PTR TO TMP STAI ECB      @ZA40795 */  00419000
TMPAECB2 DS     A              /* PTR TO TMP ATTN ECB      @ZA40795 */  00420000
         DS     0F             /*                          @E2367S4 */  00421000
*     /* TMP PTF                                           @E1213F3 */  00422000
TMPECBAT DS     A              /* TMP ATTN ECB             @E2367S4 */  00423000
TMPSCECB DS     F              /* IKJEFTSC ATTENTION ECB   @ZA91237 */  00424000
TMPSWAIT EQU  X'80'            /* TESTED BY IKJEFT03 AND                00425000
*                                 IKJEFT05.                @ZA91237 */  00426000
TMP1ECB2 DS     F              /* T02 ATTACH ECB           @E1213F3 */  00427000
         DS    F               /* RESERVED                 @ZTY0011*/   00428000
TMPR15RC DS    F               /* R15 RC FROM CP           @E121324*/   00429000
TMP1RSNC DS    F              /* REASON CODE WHEN CP ABEND @E1213F3*/   00430000
TMP1ABNC DS    F              /* ABEND CODE WHEN CP ABEND  @E1213F3*/   00431000
TMP1NAME DS    CL8            /* NAME OF TMPWRKA1          @E1213F3*/   00432000
TMP1LEV  DS    CL4            /* LEVEL OF TMPWRKA1         @E1213F3*/   00433000
TMPECBL3 DS     0F             /*                          @E2367S4*/   00434000
TMPTECB3 DS     A              /* PTR TO TEST COMPLETE EC  @E2367S4*/   00435000
TMPCECB3 DS     A              /* PTR TO ATTACH CP ECB     @E2367S4*/   00436000
TMPAECB3 DS     A              /* PTR TO TMP ATTN ECB      @E2367S4*/   00437000
TMP1TQ2S DS     18F            /* Savearea for functions that           00438000
*                                 IKJEFTQ2 invokes.        @E25D2JC*/   00439000
TMP1CDCA DS    F               /* Address of DCB for CALL command to    00440000
*                                 use or 0 for LINKLIST request         00441590
*                                                          @WA30624*/   00442180
         DS    CL36           /* RESERVE                       @L2C*/   00443000
TMP1END  DS    0D                /* ASSURE THAT THIS WORKAREA END IN    00444000
*                                   A DOUBLE WORD BOUNDARY. ANY         00445000
*                                   ADDITION TO WORKAREA SHOULD BE      00446000
*                                   PUT BEFORE TMP1END     @E1213F3*/   00447000
*                                                                       00448000
.WORKA2  ANOP                                                           00449000
*********************************************************************/  00450000
**** TMPWRKA2 -- TMP SUPERVISOR STATE DYNAMIC WORK AREA             */  00451000
****                                                                */  00452000
****   THIS DYNAMIC WORK AREA  IS GOTTEN  FROM SUBPOOL 230 KEY 1,   */  00453000
****   BY IKJEFT01 DURING TMP INITIALIZATION.   NORMALLY IT IS NOT  */  00454000
****   FREED  UNTIL  END OF THE TERMINAL SESSION. OTHERS WILL BE    */  00455000
****   GOTTEN BY IKJEFTSC WHEN A PARALLEL T02 IS INITIATED          */  00456000
****   AND FREED WHEN PARALLEL T02 FINISHED IT PROCESSING.          */  00457000
****   SEVERITY 2 STAE RETRY  ALL OF CORE  IS FREED  AND THIS WORK  */  00458000
****   AREA MUST BE REINITALIZED.   THIS WORK AREA  IS  REFERENCED  */  00459000
****   BY ALL OF THE TMP MODULES.                                   */  00460000
****                                                        @E1213F3*/  00461000
****   CHANGE ACTIVITY =                                            */  00462000
****    A 0-999999                               @ZA40795 & @ZA40796*/  00463000
****    SUPPORT FOR MVS/SE 2                                @ZA39401*/  00464000
****    SUPPRORT FOR EXTENDED RC SUPPORT                    @E1113KJ*/  00465000
****    CHANGE COPYRITE DATE                                @ZMT0073*/  00466000
****    SUPPORT FOR INTEGRITY PTF                           @E1213F3*/  00467000
****    OZ66275 -ADD TSEVENT ISSUED FLAG                    @ZA66275*/  00468000
****    ZTS0254 CLIST ATTN                                  @E1213F3*/  00469000
****    ZTY0256 MP PROBLEM                                  @E1213F3*/  00470000
****    @E2267H1-INCLUDED POINTERS NEED FOR VSCR            @E2267H1*/  00471000
****    @OZ85291- 0C4 IN IKJEFTP2 FOLLOWING A RETRY TO      @ZA85291*/  00472000
****              IKJTWAIT FROM IKJEFT05                    @ZA85291*/  00473000
****    @E2367S4- TSO/E RELEASE 3 SUPPORT FOR THE           @E2367S4*/  00474000
****              CLIST ATTENTION FACILITY AND CLISTS       @E2367S4*/  00475000
****              INVOKED THROUGH THE TSO SERVICE FACILITY. @E2367S4*/  00476000
****                                                                */  00477000
****    PBY0160 ADDED 2 BITS (TMP2SYN1 AND TMP2SYN2) TO     @PBY0160*/  00478000
****            INDICATE TO IKJEFT03 WHETHER IT WAS ENTERED @PBY0160*/  00479000
****            VIA A SYNCH FROM IKJEFT02. IF TMP2SYN1      @PBY0160*/  00480000
****            IS SET, IT INDICATES THAT IKJEFT02 SYNCHED  @PBY0160*/  00481000
****            TO IKJEFT03 FROM ROUTINE TTSKCHK. IF        @PBY0160*/  00482000
****            TMP2SYN2 IS SET, IT INDICATES THAT IKJEFT02 @PBY0160*/  00483000
****            SYNCHED TO IKJEFT03 FROM ROUTINE TGETCDX.   @PBY0160*/  00484000
****                                                                */  00485000
****     OZ97523- ADDED TMP2TPS3 - IKJEFTP2'S ADDITIONAL    @ZA97523*/  00486000
****              PROTECTED SAVEAREA                        @ZA97523*/  00487000
****                                                                */  00488000
****     E21D2G9- TSO/E VERSION 2 RELEASE 1 REXX DATA STACK @E21D2G9*/  00489000
****    @E21D2I6- TSOE AUTHORIZED TESTING SUPPORT           @E21D2I6*/  00490000
****     PEI0701- ADD REXX REINITIALIZATION INDICATOR       @PEI0701*/  00491000
****    @E23D2I6- TSO/E AUTHORIZED PLATFORM SUPPORT         @E23D2I6*/  00492000
****    @PID0180- EXPAND DYNASP, MDYNASP, AND DYNAPARM      @PID0180*/  00493000
****              TO 10 FULLWORDS FOR USE WITH DRITCBAD.    @PID0180*/  00494000
****              TMPWRKA1 RESERVED SPACE IS EXPANDED.      @PID0180*/  00495000
****    @PMH0003- UPDATED PROLOG TO CONFORM TO THE SHOWHDR  @PMH0003*/  00496000
****              TOOLS STANDARDS REQUIRED BY INFORMATION   @PMH0003*/  00497000
****              DEVELOPMENT.                              @PMH0003*/  00498000
****    @PMH0057- Added ENQ/DEQ storage to the TMPWRKA2     @PMH0057*/  00499000
****              for IKJEFT08 subrtns TIBENQ and TIBDEQ    @PMH0057*/  00500000
****              and for IKJEFTP2 subrtns TSFENQ and       @PMH0057*/  00501000
****              TSFDEQ.  Added reserved space following   @PMH0057*/  00502000
****              this storage.                             @PMH0057*/  00503000
****    @PMH0071- Ensure all ENQ/DEQ fields are prefixed    @PMH0071*/  00504000
****              with TMP2 for uniqueness.                 @PMH0071*/  00505000
****    @OY58978- Add the length in bytes to the ASM        @PMH0071*/  00506000
****              storage declarations for TMP2EDST         @YA58978*/  00507000
****              and TMP2ENQR.                             @YA58978*/  00508000
****   @E25D2JC - Added the following fields:               @E25D2JC*/  00509000
****              -   TMP2TSLB                              @E25D2JC*/  00510000
****              -   TMP2RGQ2                              @E25D2JC*/  00511000
****              -   TMP2DYDC                              @E25D2JC*/  00512000
****              -   TMP1TQ2S                              @E25D2JC*/  00513000
****   @E25D2JC - Added the following fields:               @E25D2JC*/  00514000
****              -   TMP2T01E                              @E25D2JC*/  00515000
****                                                        @E25D2JC*/  00516000
****              -   TMP2ET01                              @E25D2JC*/  00517000
****              -   TMP2ET1A                              @E25D2JC*/  00518000
****              -   TMP2ET1B                              @E25D2JC*/  00519000
****              -   TMP2ET1I                              @E25D2JC*/  00520000
****              Removed the following fields:             @E25D2JC*/  00521000
****              -   T1AENTRY                              @E25D2JC*/  00522000
****   @KO10167 - Reserve TMP2ET1I                          @KO10167*/  00523000
****                                                                */  00524000
.* A 0-999999                                      @ZA40795 & @ZA40796  00525000
****                                                        @E1113KJ*/  00526000
*********************************************************************/  00527000
TMPWRKA2 DSECT                                                          00528000
TWRKA2A  DS     0D                                                      00529000
WRKA1PTR DS     F                   /* PTR TO PROB PROG WORK AREA   */  00530000
WRKA2PTR DS     F                   /* PTR TO TMP PRIVATE WORK AREA */  00531000
TMPWA2P  DS     F                   /* PTR TO STAE/STAI WORK AREA   */  00532000
SAVARPTR DS     F                   /* PTR TO ORIGINAL SAVE AREA    */  00533000
TMPTIME  DS     F                   /* ADDR OF TIME ROUTINE         */  00534000
TMPT04   DS     F                   /* ADDR OF STAI EXIT ROUTINE    */  00535000
TMPT042  DS     F                   /* ADDR2 OF STAI EXIT ROUTINE   */  00536000
TMPT05   DS     F                   /* ADDR OF STAE EXIT ROUTINE    */  00537000
TEPKEY   DS     F                   /* TMP ENTRY PSW PROTECT KEY    */  00538000
TCBPTR   DS     F                   /* PTR TO TCB                   */  00539000
UPTPTR   DS     F                   /* PTR TO UPT                   */  00540000
ECTPTR   DS     F                   /* PTR TO ECT                   */  00541000
PSCBPTR  DS     F                   /* PTR TO PSCB                  */  00542000
ASCBPTR  DS     F                   /* PTR TO ASCB                  */  00543000
ASXBPTR  DS     F                   /* PTR TO ASXB                  */  00544000
RLGBPTR  DS     F                   /* PTR TO RELOGON BUFFER        */  00545000
LWAPTR   DS     F                   /* PTR TO LOGON WORK AREA       */  00546000
JSCBPTR  DS     F                   /* PTR TO JSCB (IEZJSCB)        */  00547000
CMDACTP  DS     A                   /* PTR SRM PARM LIST    @ZA39401*/  00548000
TMPT043  DS     A                   /* PTR TO ESTAI MSG RTN @ZA40795*/  00549000
*     /* TMP MAINLINE FLOW CONTROL FLAGS                            */  00550000
FLOFLGS  DS     CL4                                                     00551000
FLOFLGS1 EQU    FLOFLGS                                                 00552000
*        EQU    X'80'                                                   00553000
*        EQU    X'40'                                                   00554000
DOLIST   EQU    X'20'                                                   00555000
DOGETC   EQU    X'10'                                                   00556000
DODONE   EQU    X'08'                                                   00557000
DOINVOK  EQU    X'04'                                                   00558000
DOSCAN   EQU    X'02'                                                   00559000
*        EQU    X'01'                                                   00560000
*                                                                       00561000
FLOFLGS2 EQU    FLOFLGS+1                                               00562000
DOPUTM   EQU    X'80'                                                   00563000
DOFRECB  EQU    X'40'                                                   00564000
DOPSTRT  EQU    X'20'                                                   00565000
DOACTV   EQU    X'10'                                                   00566000
DOCHKAT  EQU    X'08'                                                   00567000
DOWAIT   EQU    X'04'                                                   00568000
DOATTN   EQU    X'02'                                                   00569000
DOCHKCP  EQU    X'02'                                                   00570000
*        EQU    X'01'                                                   00571000
*                                                                       00572000
FLOFLGS3 EQU    FLOFLGS+2                                               00573000
*        EQU    X'80'                                                   00574000
DOIMPLX  EQU    X'40'                                                   00575000
DOTEST   EQU    X'20'                                                   00576000
DOSETBF  EQU    X'10'                                                   00577000
DOSETTB  EQU    X'08'               /*                             */   00578000
FLOFLGS4 EQU    FLOFLGS+3                                               00579000
T0ASAVEP DS     F                   /* ADDR OF SAVEAREA FOR RETRY TO    00580000
*                                      IKJEFT0A             @E2267H1*/  00581000
LWAPTR1  DS     A                   /* PTR TO LWA FOR T02   @E23D2I6*/  00582000
         DS     F                   /* RESERVED                     */  00583000
         DS     F                   /* RESERVED                     */  00584000
*       /* TEMPORARY SAVE AREAS FOR CALL LINK REGISTERS             */  00585000
*       /* SAVE AREAS FOR TMP-CALL                                  */  00586000
SAVRA    DS     F                                                       00587000
SAVRB    DS     F                                                       00588000
SAVRC    DS     F                                                       00589000
SAVRM    DS     F                                                       00590000
SVLNKE   DS     F                                                       00591000
*       /* SAVE AREAS FOR TMP MAINLINE LINK REGISTERS               */  00592000
SAVLNKRS DS     0F                   /* NAME OF AREA                */  00593000
SAVLNKA  DS     F                                                       00594000
SAVLNKB  DS     F                                                       00595000
SAVLNKC  DS     F                                                       00596000
SAVLNKD  DS     F                                                       00597000
SAVLNKE  DS     F                                                       00598000
SAVLNKF  DS     F                                                       00599000
SAVLNKG  DS     F                                                       00600000
SAVLNKH  DS     F                                                       00601000
SAVLNKJ  DS     F                                                       00602000
SAVLNKK  DS     F                                                       00603000
SAVLNKL  DS     F                                                       00604000
SAVLNKM  DS     F                                                       00605000
TWRKA2B  DS     0F                   /* DEFINE SECOND AREA          */  00606000
*       /* CONTROL FLAGS                                            */  00607000
MCTLFLGS DS     0F                   /*   NAME OF AREA              */  00608000
MCFLGS1  DS     C                                                       00609000
BKGMODE  EQU    X'80'               /* EXECUTING IN BACKGROUND MODE */  00610000
DRSAPF   EQU    X'40'               /* ON - ATTACH WITH APF         */  00611000
TMP2TSLB EQU    X'20'               /* 1=FOUND IN TSOLIB    @E25D2JC*/  00612000
TMP2NTSL EQU    X'10'               /* 1=NOT ELIGIBLE FOR LOADING FROM  00613000
*                                      A DATASET DEFINED BY THE TSOLIB  00614000
*                                      COMMAND              @WA23000*/  00615000
         DS     CL3                 /* RESERVED                     */  00616000
*        EQU    X'80'               /* Hi-order bit is                  00617000
*                                      now reserved         @E25D2JC*/  00618000
TMP2TSFC EQU    X'40'               /* 1=TMP IS EXECUTING IN            00619000
*                                      TSF/CLIST MODE       @E2367S4*/  00620000
*                                                                       00621000
ATTEXC2  EQU    X'20'               /* 1=EXC2 ATTACHED FOR TSF/CLIST    00622000
*                                      MODE PROCESSING      @E2367S4*/  00623000
*                                                                       00624000
TMP2TSCA EQU    X'10'               /* 1=IKJEFTSC ATTENTION EXIT        00625000
*                                      (IKJATTN) RECEIVED CONTROL       00626000
*                                                           @E2367S4*/  00627000
TMP2SVCI EQU    X'08'               /* 1=TMP PARALLEL SIDE IS SVC       00628000
*                                      INITIATED            @E2367S4*/  00629000
TMP2SYN1 EQU    X'02'               /* 1=SYNCHED TO IKJEFT03 FROM       00630000
*                                      IKJEFT02 IN ROUTINE TTSKCHK      00631000
*                                                           @PBY0160*/  00632000
TMP2SYN2 EQU    X'01'               /* 1=SYNCHED TO IKJEFT03 FROM       00633000
*                                      IKJEFT02 IN ROUTINE TGETCDX      00634000
*                                                           @PBY0160*/  00635000
MTPL     DS     0F                  /* NAME OF MODEL TPL            */  00636000
MTPLCBUF DS     F                   /* POINTER TO COMMAND BUFFER    */  00637000
MTPLPS   DS     0F                  /*   NAME OF POINTER AREA       */  00638000
MTPLUPT  DS     F                   /* POINTER TO UPT               */  00639000
MTPLPSCB DS     F                   /* POINTER TO PSCB              */  00640000
MTPLECT  DS     F                   /* POINTER TO ECT               */  00641000
*                                                                       00642000
RTRYSA   DS     0F                  /* ENVIRONMENTAL AREA           */  00643000
RTRY51   DS     F                   /* T02 BASE PTR 1               */  00644000
RTRY52   DS     F                   /* T02 BASE PTR 2               */  00645000
RTRY53   DS     F                   /* T02 DATAREG                  */  00646000
*                                                                       00647000
MDYNASP  DS     10F                 /* MODEL DYNALLOC PL   @PID0180 */  00648000
TWRKA2C  DS     0F                  /* DEFINE THIRD AREA   @ZA40795 */  00649000
TMPBLDL  DS     0CL68               /* BLDL REQUEST PL     @ZA40795 */  00650000
TMPBLDNR DS     H                   /* BLDL NUMBER OF      @ZA40795 */  00651000
*                                   /* ENTRIES IN LIST     @ZA40795 */  00652000
TMPBLDN  DS     H                   /* BLDL LENGTH OF PL   @ZA40795 */  00653000
TMPBLDNM DS     CL8                 /* BLDL PROGRAM NAME   @ZA40795 */  00654000
TMPBLDAT DS     CL56               /* BLDL USER INFO RETURNED      */   00655000
*                                   /*                     @ZA40795 */  00656000
TMPFLAG1 DS     X                   /* LOCAL FLAGS 1       @ZA40795 */  00657000
TMPCP    EQU    X'80'              /*1=CP ATTACH REQUESTED@ZA40795 */   00658000
TMPCPCAL EQU    X'40'               /* 1=CALL COMMAND ATTACH        */  00659000
*                                   /* REQUESTED           @ZA40795 */  00660000
TMPCPTST EQU    X'20'               /* 1=TEST COMMAND LINK          */  00661000
*                                   /* REQUESTED           @ZA40795 */  00662000
TMPCPABN EQU    X'10'               /*1=CURRENT CMD ABENDED@ZA40795 */  00663000
TMPAPF   EQU    X'08'               /* 1=APF ATTACH ACTIVE @ZA40795 */  00664000
TMPDE    EQU    X'04'               /* 1=DE ATTACH ACTIVE  @ZA40795 */  00665000
TMPTSTAU EQU    X'02'               /* 1=TESTAUTH COMMAND  @E21D2I6 */  00666000
*                                   /*  ENTERED            @E21D2I6 */  00667000
TMPBIT07 EQU    X'01'               /*  R E S E R V E D    @ZA40795 */  00668000
TMPFLAG2 DS     X                   /*  LOCAL FLAGS 2      @ZA40795 */  00669000
TMPFORCE EQU    X'80'               /* FORCE CMD DETACH    @ZA40795 */  00670000
TMPFLAG3 DS     X                   /*  R E S E R V E D    @ZA40795 */  00671000
TMPFLAG4 DS     X                   /*  R E S E R V E D    @ZA40795 */  00672000
TMPTEST@ DS     A                   /*  ADDR OF TEST CMD   @ZA40795 */  00673000
TMPTSKLB DS     A                   /* DCB ADDR FOR TASKLIB         */  00674000
*                                   /* ON ATTACH           @ZA40795 */  00675000
TMPCALST DS     A                   /* ADDR CALL COMMAND PARAMETER  */  00676000
*                                   /* STRING              @ZA40795 */  00677000
TMPCPPL@ DS     A                   /* ADDRESS TPLCPPL  OR @E121324     00678000
*                                      USER PARM LIST FOR  @E121324     00679000
*                                      TSF SVC PGM REQUEST @E121324*/   00680000
TMPABECB DS     A                   /* ADDR ECB POSTED AFTER ABEND  */  00681000
*                                   /* OR ATTENTION        @ZA40795 */  00682000
TMPSTAI  DS     A                   /* PTR TO ESTAI RTN    @ZA40795 */  00683000
TMPSPLS  DS     A                   /* PTR TO ESTAI PARMS  @ZA40795 */  00684000
TMPTSKRC DS     F                   /* SUBTASK CPL CODE(R15)@ZA40795*/  00685000
         DS     X                   /* RESERVE              @E1213F3*/  00686000
         DS     X                   /* RESERVE              @E1213F3*/  00687000
         DS     X                   /* RESERVE              @E1213F3*/  00688000
         DS     X                   /* RESERVE              @E1213F3*/  00689000
TMP2ATNP DS    A              /* @ OF ATTN ROUTINE          @E1213F3*/  00690000
TMP2PARM DS    F              /* INDICATE WHETHER PARAMETER IS          00691000
*                                      GOOD OR BAD          @E1213F3*/  00692000
TMP2SA@  DS    A              /* PTR TO KEY 1 SAVE AREA    @E1213F3*/   00693000
TMP2TIB@ DS    A              /* TIB @ USED BY IKJEFT02    @E1213F3*/   00694000
TMP2ATIB DS    A              /* THE @ OF ACTIVE TIB       @E1213F3*/   00695000
TMP2MECB DS    A              /* @ OF TMP2MECB IN WRKA1    @E1213F3*/   00696000
TMP2AECB DS    A              /* @ OF TMP1ECB2 IN WRKA1    @E1213F3*/   00697000
TMPW1LEN DS    F              /* LENGTH OF TMPWRKA1        @E1213F3*/   00698000
TMPW2LEN DS    F              /* LENGTH OF TMPWA           @E1213F3*/   00699000
TMPBUFF@ DS    F              /* BUFFER @ OBTAINED BY      @E121324*/   00700000
*                             /* IKJEFT02                  @E121324*/   00701000
TMP2PPTR DS    A              /* THE PTR TO ITS OWN PURGE PARM LIST     00702000
*                                                          @E1213F3*/   00703000
TMP2PLEN DS    F              /* LENGTH OF RESTORE PARM AND PURGE       00704000
*                                PARM LIST TO GET AND FREE @E1213F3*/   00705000
TMP2NAME DS   CL8             /* NAME OF TMPWRKA2          @E1213F3*/   00706000
TMP2LEV  DS   CL4             /* LEVEL OF TMPWRKA2         @E1213F3*/   00707000
TMP2FFLG DS   0CL56           /* FLAGS USED FOR DEBUGGING AND           00708000
*                                RECOVERY PURPOSES         @E1213F3*/   00709000
TMP2DBUG DS   0CL4            /* TRACE OF FUNCTIONS PERFORMED WHICH     00710000
*                                CAN BE USED FOR DEBUGGING @E1213F3*/   00711000
TMP2TSFG DS   CL1                   /* FLAGS USED TO INDICATE WHAT      00712000
*                                      FUNCTION WAS PERFORMED BY        00713000
*                                      IKJEFTSC             @E1213F3*/  00714000
TMP2PUR  EQU   X'80'                /* PURGE IS DONE        @E1213F3*/  00715000
TMP2STAT EQU   X'40'                /* STATUS STOP DONE     @E1213F3*/  00716000
TMP2WAIT EQU   X'10'                /* WAIT IS DONE         @E1213F3*/  00717000
TMP2POST EQU   X'08'                /* POST IS DONE         @E1213F3*/  00718000
TMP2W1ST EQU   X'04'                /* BUILD TMPWRKA1       @E1213F3*/  00719000
TMP2WA2S EQU   X'02'                /* BUILD TMPWA2         @E1213F3*/  00720000
TMP2W2ST EQU   X'01'                /* BUILD TMPWRKA2       @E1213F3*/  00721000
T2FLGT08 DS    CL1                  /* FLAG FOR IKJEFT08    @E1213F3*/  00722000
TMP2NPAR EQU   X'80'                /* NO PARALLEL TMP      @E1213F3*/  00723000
TMP2VFPR DS    CL1                  /* TSF PARAMETER VERIFICATION       00724000
*                                      ROUTINE FOOTPRINT                00725000
*                                      (IKJEFTPV)           @E1213F3*/  00726000
TMP2READ EQU   X'80'                /* READING PARAMTERS    @E1213F3*/  00727000
TMP2WRIT EQU   X'40'                /* WRITING PARAMETERS   @E1213F3*/  00728000
TMP2MAIN EQU   X'20'                /* MAINLINE             @E1213F3*/  00729000
TMP2PAGE EQU   X'10'                /* READING FUNCTION BUFF@E1213F3*/  00730000
TMP2PGM  EQU   X'08'                /* READING PGMPARMS     @E1213F3*/  00731000
TMP2CODE EQU   X'04'                /* SETTING RETURN CODES @E1213F3*/  00732000
TMP2TPVR EQU   X'02'                /* RESERVED             @E1213F3*/  00733000
TMP2DONE EQU   X'01'                /* IKJEFTPV DONE        @E1213F3*/  00734000
TMPFLG1  DS    CL1                  /* USED BY T02          @E1213F3*/  00735000
TMPARALL EQU   X'80'           /*PARALLEL TMP ENVIRONMENT   @E121324*/  00736000
TMPAPFCK EQU   X'40'          /* TSRCHAPF HAS BEEN CALLED   @E1213F3*/  00737000
TMPLOAD  EQU   X'20'          /* LOAD WAS ISSUED            @E121324*/  00738000
DIDCALL  EQU   X'10'          /* CALL HAS BEEN PERFORMED BY @E121324*/  00739000
*                             /* THE PARALLEL TMP           @E121324*/  00740000
R1PGMLST EQU   X'08'          /* PGM THRU SVC, R1 SET TO    @E121324*/  00741000
*                             /* PARAMETER LIST FOR PROGRAM @E121324*/  00742000
TMPDETCH EQU   X'04'          /* IKJEFTP2 IS DETACHING      @YA34525*/  00743000
TMPRESV7 EQU   X'02'          /* RESERVED                   @E121324*/  00744000
TMPRESV8 EQU   X'01'          /* RESERVED                   @E121324*/  00745000
TMP2RCOV DS    0CL52          /* FLAGS USED BY RECOVERY     @E1213F3*/  00746000
TMP2MCTL DS    CL2            /* MODULE IN CONTROL FLAGS, SET BY        00747000
*                                ALL TMP MODULES THAT ARE IN            00748000
*                                CONTROL                    @E1213F3*/  00749000
TMP2MT01 EQU   X'8000'         /* IKJEFT01 IN CONTROL       @E1213F3*/  00750000
TMP2MTSC EQU   X'4000'         /* IKJEFTSC IN CONTROL       @E1213F3*/  00751000
TMP2MT02 EQU   X'2000'         /* IKJEFT02 IN CONTROL       @E1213F3*/  00752000
TMP2MTPV EQU   X'1000'         /* IKJEFTPV IN CONTROL       @E1213F3*/  00753000
TMP2MT08 EQU   X'0800'         /* IKJEFT08 IN CONTROL       @E1213F3*/  00754000
TMP2MCAF EQU   X'0400'         /* IKJCAF   IN CONTROL       @E2367S4*/  00755000
TMP2FCTL DS    0CL8            /* MODULAR FUNCTION IN CONTROL, SET      00756000
*                                 BY ALL TMP MODULES THAT ARE IN        00757000
*                                 CONTROL                   @E1213F3*/  00758000
TMP2FT01 DS    CL1              /* IKJEFT01 FUNCTION IN CONTROL         00759000
*                                                          @E1213F3*/   00760000
TMP2FI01 EQU   X'80'            /* IKJEFT01 INITIALIZATION@E1213F3*/    00761000
TMP2FTM1 EQU   X'40'            /* IKJEFT01 TERMINATION   @E1213F3*/    00762000
TMP2FTSC DS    CL1               /* IKJEFTSC FUNCTION IN CONTROL        00763000
*                                                          @E1213F3*/   00764000
TMP2FISC EQU   X'80'             /* IKJEFTSC INITIALIZATION@E1213F3*/   00765000
TMP2FBSC EQU   X'40'             /* IKJEFTSC IN CONTROL AFTER WAIT OF   00766000
*                                   TIBRECB AND BEFORE TERMINATION      00767000
*                                   CODE                   @E1213F3*/   00768000
TMP2FTMC EQU   X'20'             /* IKJEFTSC TERMINATION   @E1213F3*/   00769000
TMP2FT02 DS    CL1               /* IKJEFT02 FUNCTION IN CONTROL        00770000
*                                                          @E1213F3*/   00771000
TMP2FTPV DS    CL1               /* IKJEFTPV FUNCTION IN CONTROL        00772000
*                                                          @E1213F3*/   00773000
TMP2FSUV EQU   X'80'             /* IKJEFTPV SYSTEM/USER FUNCTION,      00774000
*                                   ON IF USER AND OFF IF SYSTEM        00775000
*                                                          @E1213F3*/   00776000
TMP2FT08 DS    CL1               /* IKJEFT08 FUNCTION IN CONTROL        00777000
*                                                          @E1213F3*/   00778000
RESERVE5 DS    CL(3)            /* RESERVED               @E1213F3*/    00779000
TMP2FLRC DS    CL2               /* SET BY IKJEFT05 (RECOVERY) TO       00780000
*                                   INDICATE THE RETRY TARGET CODE      00781000
*                                   (FIRST LEVEL)          @E1213F3*/   00782000
TMP2FLI1 EQU   X'8000'           /*IKJEFT01 INITIALIZATION @E1213F3*/   00783000
TMP2FLIC EQU   X'4000'           /*IKJEFTSC INITIALIZATION @E1213F3*/   00784000
TMP2FLBC EQU   X'2000'           /* IKJEFTSC AFTER WAIT FOR PARALLEL    00785000
*                                   SIDE FOR CLEANUP       @E1213F3*/   00786000
TMP2FL02 EQU   X'1000'           /* IKJEFT02               @E1213F3*/   00787000
TMP2FLTV EQU   X'0800'           /* IKJEFTPV TERMINATION   @E1213F3*/   00788000
TMP2TSFR EQU   X'0400'           /* PARALLEL IKJEFT02      @E2367S4*/   00789000
TMP2SLRC DS    CL2               /* SET BY IKJEFT05 (RECOVERY) TO       00790000
*                                   INDICATE CAUSES FOR A PREVIOUS      00791000
*                                   RETRY TO IKJEFT01                   00792000
*                                   (SECOND LEVEL)         @E1213F3*/   00793000
TMP2SL01 EQU   X'8000'           /* IKJEFT01               @E1213F3*/   00794000
TMP2SLIC EQU   X'4000'           /* IKJEFTSC INITIALIZATION@E1213F3*/   00795000
TMP2SLBC EQU   X'2000'           /* IKJEFTSC AFTER FIRST ATTACH OF      00796000
*                                   IKJEFT02               @E1213F3*/   00797000
TMP2SL02 EQU   X'1000'           /* IKJEFT02               @E1213F3*/   00798000
TMP2SL08 EQU   X'0800'           /* IKJEFT08               @E1213F3*/   00799000
TMP2SLPV EQU   X'0400'           /* IKJEFTPV               @E1213F3*/   00800000
TMP2FAIL DS    CL2              /* SET ON BY IKJEFT05 (RECOVERY) TO     00801000
*                                   INDICATE FAILURE IN A SPECIFIC      00802000
*                                   TMP MODULE. TMP MODULES USE FLAG    00803000
*                                   TO RESET RECURSION FLAGS.           00804000
*                                                          @E1213F3*/   00805000
TMP2DMPF EQU   X'8000'           /* SET BE IKJEFT05 TO INDICATE         00806000
*                                   THAT A SETRP DUMP IS TO BE          00807000
*                                   TAKEN                  @E2267H1*/   00808000
TMP2TSCF EQU   X'4000'           /* IKJEFTSC FAILED        @E1213F3*/   00809000
TMP2T02F EQU   X'2000'           /* IKJEFT02 FAILED        @E1213F3*/   00810000
T2T8T9F  EQU   X'1000'           /* T08 T09 ATTACH FAIL    @ZTS0162*/   00811000
TMP2RTRY DS    0CL20             /* SET BY IKJEFT01 AND IKJEFT02 TO     00812000
*                                   INDICATING ADDRESSES OF RETRY       00813000
*                                   CODE.  IKJEFT05 WILL USE THESE      00814000
*                                   ADDRESSES IN ORDER TO RETRY         00815000
*                                                          @E1213F3*/   00816000
TMP2RBSC DS    A              /* BEGINNING OF IKJEFTSC, SET             00817000
*                                   BY IKJEFT01            @E1213F3*/   00818000
TMP2RWSC DS    A                 /* AFTER WAIT BEFORE TERMINATION       00819000
*                                   CODE IN IKJEFTSC, SET BY            00820000
*                                   IKJEFT01               @E1213F3*/   00821000
TMP2RW02 DS    A                 /* AFTER WAIT ON TIBRECB: SET BY       00822000
*                                   IKJEFT02               @E1213F3*/   00823000
TMP2RT02 DS    A                 /* TERMINATION CODE IN IKJEFT02        00824000
*                                   IN ORDER TO RETURN TO IKJEFT01 FOR  00825000
*                                   A RETRY, SET BY IKJEFT02            00826000
*                                                          @E1213F3*/   00827000
TMP2RTPV DS    A                 /* TERMINATION CODE IN IKJEFTPV        00828000
*                                   IN ORDER TO RETURN TO IKJEFTSC,     00829000
*                                   SET BY IKJEFT02        @E1213F3*/   00830000
TMP2MRG1 DS    0CL16             /* FIRST GROUP OF POINTERS TO MODULE   00831000
*                                   SAVEAREAS - SEE TMP2MRG2 FOR THE    00832000
*                                   REMAINING POINTERS                  00833000
*                                                                       00834000
*                                   EACH TMP MODULE STORE ADDRESS TO    00835000
*                                   ITS REGISTERS SO IKJEFT05 CAN       00836000
*                                   ESTABLISH ADDRESSABILITY DURING     00837000
*                                   A RETRY                @ZA85291*/   00838000
TMP2RG01 DS    A                 /* ADDRESS IKJEFT01'S REGISTERS        00839000
*                                                          @E1213F3*/   00840000
TMP2RGSC DS    A                 /* ADDRESS IKJEFTSC'S REGISTERS        00841000
*                                                          @E1213F3*/   00842000
TMP2RG02 DS    A                 /* ADDRESS IKJEFT02'S REGISTERS        00843000
*                                                          @E1213F3*/   00844000
TMP2RGPV DS    A                 /* ADDRESS IKJEFTPV'S REGISTERS        00845000
*                                                          @E1213F3*/   00846000
TMP2RET@ DS    A                 /* TO INDICATE RETRY ADDRESS ON SETRP  00847000
*                                  MACRO ISSUED IN IKJEFT05@E1213F3*/   00848000
TMP2SR14 DS    A                 /* USED BY RECOVERY ROUTINE TO SAVE    00849000
*                                  RETURN POINT WHEN IT DOES A CALL     00850000
*                                  TO A SUBROUTINE.        @E1213F3*/   00851000
TMP2TSC2 DS    CL1               /* FLAG NEEDED BY TSC                  00852000
*                                                          @E1213F3*/   00853000
TMP2CLR  EQU   X'80'             /* FLAGS NEEDED USED BY TSC TO         00854000
*                                   INDICATE WHAT IS DONE TO INITIATE   00855000
*                                   PARALLEL SIDE          @E1213F3*/   00856000
TMP2REC EQU    X'40'             /* INDICATE RETRY TO IKJEFT01          00857000
*                                                          @E1213F3*/   00858000
TMP2SRCT EQU   X'20'             /* INDICATE TIB IS TO BE UPDATED BY    00859000
*                                    RECOVERY              @ZTY0256*/   00860000
TMP2INIT EQU   X'10'             /* INDICATE T01 GOT CONTROL FROM       00861000
*                                    RECOVERY              @ZTY0336*/   00862000
TMP2RINT EQU   X'08'             /* RESTART REXX           @PEI0701*/   00863000
          DS    CL3               /* RESERVE               @E1213F3*/   00864000
TMP2TAIE  DS    A                 /* PTR TO TAIE USED BY IKJEFT02       00865000
*                                                          @ZTS0254*/   00866000
TMP2TSP   DS    A                /* PTR TO IKJTSP MAPPING MACRO         00867000
*                                                          @E2267H1*/   00868000
TMP2TP2W  DS    A                /* PTR TO SHARED DYNAMIC AREA BETWEEN  00869000
*                                   IKJEFT02 AND IKJEFTP2  @E2267H1*/   00870000
TMP2CAFP  DS    A                /* PTR TO IKJCAFPL PARAMETER LIST      00871000
*                                                          @E2367S4*/   00872000
TMP2MRG2 DS    0CL4              /* SECOND GROUP OF POINTERS TO         00873000
*                                   MODULE SAVEAREAS                    00874000
*                                                                       00875000
*                                   EACH TMP MODULE STORES THE ADDRESS  00876000
*                                   OF ITS REGISTERS SO IKJEFT05 CAN    00877000
*                                   ESTABLISH ADDRESSABILITY DURING     00878000
*                                   A RETRY                @ZA85291*/   00879000
TMP2RGP2 DS    A                 /* ADDRESS IKJEFTP2'S REGISTERS        00880000
*                                                          @ZA85291*/   00881000
TMP2TPSA DS    CL72              /* IKJEFTP2'S PROTECTED SAVEAREA       00882000
*                                   PASSED BY IKJEFT02     @ZA96882*/   00883000
TMP2TPS2 DS    CL72              /* IKJEFTP2'S PROTECTED SAVEAREA       00884000
*                                   USED BY TP2 TO CALL ITS OWN         00885000
*                                   PROCEDURES.            @ZA96882*/   00886000
T3PARMS  DS    0D                /* PARAMETER LIST PASSED TO ATTENTION  00887000
*                                   ROUTINE IKJEFT03.        @ZA96882*/ 00888000
T3TAIE@  DS    A                 /* ADDRESS OF THE TAIE      @ZA96882*/ 00889000
         DS    A                 /* NOT USED                 @ZA96882*/ 00890000
T3WKPTR2 DS    A                 /* ADDRESS OF TMPWRKA2      @ZA96882*/ 00891000
STAXPPTR DS    F                 /* ADDRESS OF STAX PARM LIST@ZA96882*/ 00892000
SYNCHSP  DS    CL16              /* SYNCH PARM LIST          @ZA96882*/ 00893000
TMP2TPS3 DS    CL72              /* IKJEFTP2'S ADDITIONAL PROTECTED     00894000
*                                   SAVEAREAS USED BY TP2 TO CALL       00895000
*                                   ITS OWN PROCEDURES       @ZA97523*/ 00896000
TMP2T08S DS    CL72              /* IKJEFT08'S PROTECTED SAVEAREA       00897000
*                                   USED BY T02 TO FOR LINK             00898000
*                                                            @E21D2G9*/ 00899000
SAVLNKN  DS     F                /* FOR IKJEFT08             @E21D2G9*/ 00900000
**********************************************************************  00901000
*      THE FOLLOWING ARE FOR IKJEFTP2 LINKS TO IRXESTK1      @E21D2G9*  00902000
**********************************************************************  00903000
TMP2FUN@ DS    A                 /* ADDRESS OF IRXESTK1 FUNCTION        00904000
*                                                            @E21D2G9*/ 00905000
TMP2DAT@ DS    A                 /* ADDRESS OF POINTER TO IRXESTK1      00906000
*                                   DATA                     @E21D2G9*/ 00907000
TMP2DAL@ DS    A                 /* ADDRESS OF IRXESTK1 DATA LENGTH     00908000
*                                                            @E21D2G9*/ 00909000
TMP2FUNC DS    F                 /* IRXESTK1 FUNCTION        @E21D2G9*/ 00910000
TMP2DATA DS    A                 /* IRXESTK1 DATA STACK ELEMENT ADDRESS 00911000
*                                                            @E21D2G9*/ 00912000
TMP2DATL DS    F                 /* IRXESTK1 DATA STACK ELEMENT LENGTH  00913000
*                                                            @E21D2G9*/ 00914000
**********************************************************************  00915000
*      THE FOLLOWING ARE FOR IKJEFT08 LINKS TO IRXESTK1      @E21D2G9*  00916000
**********************************************************************  00917000
TMP2FU@2 DS    A                 /* ADDRESS OF IRXESTK1 FUNCTION        00918000
*                                                            @E21D2G9*/ 00919000
TMP2DA2@ DS    A                 /* ADDRESS OF POINTER TO IRXESTK1      00920000
*                                   DATA                     @E21D2G9*/ 00921000
TMP2DL2@ DS    A                 /* ADDRESS OF IRXESTK1 DATA LENGTH     00922000
*                                                            @E21D2G9*/ 00923000
TMP2FUN2 DS    F                 /* IRXESTK1 FUNCTION        @E21D2G9*/ 00924000
TMP2DAT2 DS    A                 /* IRXESTK1 DATA STACK ELEMENT ADDRESS 00925000
*                                                            @E21D2G9*/ 00926000
TMP2DAL2 DS    F                 /* IRXESTK1 DATA STACK ELEMENT LENGTH  00927000
*                                                            @E21D2G9*/ 00928000
**********************************************************************  00929000
TMP2PRO1 DS    F                 /* FUNCTION TO BE PASSED TO IRXESTK1   00930000
*                                                            @PEI0432*/ 00931000
TMP2PRO2 DS    F                 /* FUNCTION TO BE PASSED TO IRXTVARS   00932000
*                                                            @PEI0432*/ 00933000
TMP2EXDP DS    A                 /* ADDRESS OF EXECDATA TO BE PASSED    00934000
*                                   TO IRXTVARS              @PEI0432*/ 00935000
SAVLNKO  DS    F                 /* FOR IKJEFT08             @PEI0432*/ 00936000
TMP2RSVD DS    F                 /* RESERVED                 @E21D2G9*/ 00937000
TMP2EDST DS   0CL24              /* Storage for IKJEFT08 subrtns        00938000
*                                   TIBENQ and TIBDEQ and IKJEFTP2      00939000
*                                   subrtns TSFENQ and                  00940000
*                                   TSFDEQ                   @YA58978*/ 00941000
TMP2ENQR DS   0CL8               /* RNAME FOR ENQUE ON                  00942000
*                                   TMP3TIBQ                 @YA58978*/ 00943000
TMP2TCBA DS    CL4               /* CONTAINS LITERAL CHARACTER          00944000
*                                   STRING 'TCBA'            @PMH0071*/ 00945000
TMP2T02A DS    F                 /* ADDRESS OF ACTIVE                   00946000
*                                   IKJEFT02 TCB             @PMH0071*/ 00947000
TMP2ENDQ DS    CL16                                       /* @PMH0057*/ 00948000
*                                /* Area for ENQ/DEQ         @PMH0057*/ 00949000
TMP2RGQ2 DS    A                 /* Address of the                      00950000
*                                   IKJEFTQ2 storage.        @E25D2JC*/ 00951000
TMP2DYDC DS    A                 /* DY DCB address           @E25D2JC*/ 00952000
TMP2T01E DS    F                 /* T01 entry indicator      @E25D2JC*/ 00953000
TMP2T5R0 DS    F                 /* Reg 0  save area for T05 @WA21212*/ 00954000
TMP2T5R1 DS    F                 /* Reg 1  save area for T05 @WA21212*/ 00955000
TMP2T5RF DS    F                 /* Reg 15 save area for T05 @WA21212*/ 00956000
TMP2T5WL DS    F                 /* len of key1 T05 dyn area @KX00014*/ 00957000
TMP2T5W1 DS    F                 /* addr of key1 T05 dyn area@KX00014*/ 00958000
         DS    CL8               /* RESERVE                  @KX00014*/ 00959000
TMP2END  DS    0D                /* ASSURE THAT THIS WORKAREA END IN    00960000
*                                   A DOUBLE WORD BOUNDARY. ANY         00961000
*                                   ADDITION TO WORKAREA SHOULD BE      00962000
*                                   PUT BEFORE TMP2END     @E1213F3*/   00963000
TMP2ET01 EQU X'00000001'         /* Indicates that the                  00964000
*                                   IKJEFT01 entry point is             00965000
*                                   being processed.         @E25D2JC*/ 00966000
TMP2ET1A EQU X'00000002'         /* Indicates that the                  00967000
*                                   IKJEFT1A entry point is             00968000
*                                   being processed.         @E25D2JC*/ 00969000
TMP2ET1B EQU X'00000003'         /* Indicates that the                  00970000
*                                   IKJEFT1B entry point is             00971000
*                                   being processed.         @E25D2JC*/ 00972000
TMP2ET1I EQU X'0000000A'         /* Indicates that the PWS exits are    00973000
*                                   enabled                  @WA25066*/ 00974000
*  WHEN SETTING A MODULE IN CONTROL FLAG,EACH MODULE WILL HAVE A        00975000
*  SPECIFIC BIT VALUE. WHEN SETTING ONE OF THESE FLAGS, ALL OTHER       00976000
*  MODULE FLAGS WILL BE TURNED OFF                         @E1213F3     00977000
*                                /* IKJEFT01'S BIT VALUE   @E1213F3*/   00978000
TMP2VT01 EQU X'8000'                                                    00979000
*                                /* IKJEFTSC'S BIT VALUE   @E1213F3*/   00980000
TMP2VTSC EQU X'4000'                                                    00981000
*                                /* IKJEFT02'S BIT VALUE   @E1213F3*/   00982000
TMP2VT02 EQU X'2000'                                                    00983000
*                                /* IKJEFTPV'S BIT VALUE   @E1213F3*/   00984000
TMP2VTPV EQU X'1000'                                                    00985000
*                                /* IKJEFT08'S BIT VALUE   @E1213F3*/   00986000
TMP2VT08 EQU X'0800'                                                    00987000
         MEND                                                           00988000
                                                                        00989000
*%TMPWABSL: ;                                                           00990000
* /* INCLUDE MAPPING MACROS FOR PARAMETER LISTS AND BLOCKS           */ 00991000
*                                                                       00992000
*/*                                                                 */  00993000
*/*******************************************************************/  00994000
*/* TO EXCLUDE THE MAPPING OF TMPWRKA1 THE FOLLOWING MUST   @E1213F3*/  00995000
*/*     BE DONE:                                            @E1213F3*/  00996000
*/*         1) WORKA1 MUST BE INITIALIZED TO CONTAIN A NON- @E1213F3*/  00997000
*/*                   BLANK                                 @E1213F3*/  00998000
*/*             A) THIS WILL EXCLUDE ALL MAPPING REFERENCING@E1213F3*/  00999000
*/*                FIELD IN TMPWRKA1                        @E1213F3*/  01000000
*/*         2) SKIPW1  MUST BE INITIALIZED TO CONTAIN A NON-@E1213F3*/  01001000
*/*                   BLANK                                 @E1213F3*/  01002000
*/*             A) THIS WILL EXCLUDE THE MAPPING FOR        @E1213F3*/  01003000
*/*                TMPWRKA1                                 @E1213F3*/  01004000
*/*******************************************************************/  01005000
* %IF WORKA1 ^='' %THEN           /*                  @E1213F3*/        01006000
*  %GOTO WRKA2;                         /*                  @E1213F3*/  01007000
* %INCLUDE SYSLIB(IKJDAPL);                                             01008000
* %INCLUDE SYSLIB(IKJDAP08);                                            01009000
* /* MAPPING MACRO FOR CPPL                                          */ 01010000
* %  INCLUDE  SYSLIB(IKJCPPL);                                          01011000
* /* MAPPING MACRO FOR CSPL                                          */ 01012000
* %  INCLUDE  SYSLIB(IKJCSPL);                                          01013000
* /* MAPPING MACRO FOR CSOA                                          */ 01014000
* %  INCLUDE  SYSLIB(IKJCSOA);                                          01015000
* %  INCLUDE  SYSLIB(IKJECT);                                           01016000
* /* MAPPING MACRO FOR IOPL                                          */ 01017000
* %  INCLUDE  SYSLIB(IKJIOPL);                                          01018000
* /* MAPPING MACRO FOR GTPB                                          */ 01019000
* %  INCLUDE  SYSLIB(IKJGTPB);                                          01020000
* /* MAPPING MACRO FOR PGPB                                          */ 01021000
* %  INCLUDE  SYSLIB(IKJPGPB);                                          01022000
* /* MAPPING MACRO FOR PTPB                                          */ 01023000
* %  INCLUDE  SYSLIB(IKJPTPB);                                          01024000
* %  INCLUDE  SYSLIB(IKJSTPB);                                          01025000
* /* MAPPING MACRO FOR PSCB                                          */ 01026000
* %  INCLUDE  SYSLIB(IKJPSCB);                                          01027000
* %  INCLUDE  SYSLIB(IEZATTCH);                                         01028000
* /* MAPPING MACRO FOR LSD                                           */ 01029000
* %  INCLUDE  SYSLIB(IKJLSD);                                           01030000
* /* MAPPING MACRO FOR EXEC DB                                       */ 01031000
* % IKJECDA = 'NO';                                                     01032000
* % IKJCOMP = 'NO';                                                     01033000
* % IKJNTAB = 'NO';                                                     01034000
* % IKJVTAB = 'NO';                                                     01035000
* % IKJCVMAP = 'NO';                                                    01036000
*@LISTPUSH;                                                             01037000
*@LISTOFF;                                                              01038000
* %  INCLUDE  SYSLIB(IKJEXEC);                                          01039000
*@LISTPOP;                                                              01040000
* %  /* PARAMETERIZATION VALUES FOR DCB MAPPING MACRO                */ 01041000
*    INCLUDE  SYSLIB(IHADCBDF);                                         01042000
* %  DSORGPO = 1;                                                       01043000
* %  DEVDDA = 1;                                                        01044000
* %  INCLUDE  SYSLIB(IHADCB);                                           01045000
* %IF SKIPPPL = 'YES' %THEN                  /* SHOULD IKJPPL BE        01046000
*                                               INCLUDED     @PBY0271*/ 01047000
*  %GOTO PPLSKIP;                            /* NO SKIP IT   @PBY0271*/ 01048000
* %INCLUDE SYSLIB(IKJPPL);                                              01049000
* %PPLSKIP:  ;                               /* LABEL TO SKIP IKJPPL    01050000
*                                                            @PBY0271*/ 01051000
* %INCLUDE SYSLIB(IKJSTPL);                                             01052000
*@EJECT;                                                                01053000
*                                                                       01054000
*                                                                       01055000
* DECLARE                                                               01056000
*   /* ABEND ERROR CODE AND ERROR MESSAGE AREA                       */ 01057000
*   1 ABMSGAR  CHAR(41) BDY(DWORD) BASED,    /* NAME OF MESSAGE AREA    01058000
*                                                            @YA25427*/ 01059000
*     2 MSGBASE  CHAR(25) BDY(DWORD),        /* BASIC MESSAGE AREA   */ 01060000
*       3 *      CHAR(12) BDY(DWORD),        /* SPACER               */ 01061000
*         4 CVDAR  CHAR(8) BDY(DWORD),       /* DECIMAL CONVERSION   */ 01062000
*       3 ABNDCD PTR(31) BDY(WORD),          /* ABEND CODE RECEIVER  */ 01063000
*         4 ABNDCDA CHAR(4) BDY(WORD),       /* ABEND CODE (CHARS)   */ 01064000
*     2 * CHAR(3),                           /* SPACER           @L1A*/ 01065000
*     /* ABEND SUBCODE AND ERROR MESSAGE AREA                        */ 01066000
*     2 SUBCDAR CHAR(13) BDY(WORD), /* NAME OF MESSAGE AREA  @YA25427*/ 01067000
*       3 SUBCDBI  CHAR(5) BDY(WORD),    /* UNPK SOURCE FIELD    @L1C*/ 01068000
*         4 SUBCDRS CHAR(4) BDY(WORD),   /* ERROR SUBCODE AREA   @L1C*/ 01069000
*                                                                       01070000
*   /* THE FOLLOWING DEFINITIONS REDEFINE THE ABMSGAR STRUCTURE  @L1A*/ 01071000
*   1 * DEFINED(MSGBASE) BDY(DWORD),         /* REDEFINE LWR LVL @L1A*/ 01072000
*     2 * CHAR(5) BDY(DWORD),                /* SPACER           @L1C*/ 01073000
*     2 USRCDEC CHAR(4),                     /* CONVERSION AREA  @L1C*/ 01074000
*     2 * CHAR(5),                           /* SPACER           @L1C*/ 01075000
*     2 USRCDBI  PTR(15) BDY(HWORD),         /* USER CODE AREA   @L1C*/ 01076000
*     2 HOLCHAR  CHAR(1),                    /* WORK AREA        @L1C*/ 01077000
*   1 * DEFINED(MSGBASE) BDY(DWORD),         /* REDEFINE LWR LVL @L1A*/ 01078000
*     2 * CHAR(13) BDY(DWORD),               /* SPACER           @L1A*/ 01079000
*     2 SYSCDAR CHAR(3),                     /* SYSTEM CODE AREA @L1C*/ 01080000
*   1 * DEFINED(MSGBASE) BDY(DWORD),         /* REDEFINE LWR LVL @L1A*/ 01081000
*     2 ABMLEN  PTR(15) BDY(DWORD),          /* MESSAGE LENGTH   @L1C*/ 01082000
*     2 ABMOFF  PTR(15) BDY(HWORD),          /* OFFSET TO TEXT   @L1C*/ 01083000
*     2 TRUMSG  CHAR(21),                    /* WHOLE TEXT AREA  @L1C*/ 01084000
*       3 MSGTXT CHAR(16),                   /* BASE TEXT AREA   @L1C*/ 01085000
*       3 TYPAR CHAR(1),                     /* ABEND TYPE AREA  @L1C*/ 01086000
*       3 L1AP1 CHAR(1),                     /* NEXT BYTE        @L1A*/ 01087000
*   1 * DEFINED(TYPAR),                      /* REDEFINE LWR LVL @L1A*/ 01088000
*     2 CODEAR CHAR(6),                      /* ERROR CODE AREA  @L1C*/ 01089000
*   1 * DEFINED(L1AP1),                      /* REDEFINE LWR LVL @L1A*/ 01090000
*     2 VALAR6 CHAR(6),                      /* CONVERSION AREA  @L1C*/ 01091000
*       3 VALAR CHAR(3),                     /* CONVERTED CODE   @L1C*/ 01092000
*   1 * DEFINED(SUBCDAR) BDY(WORD),          /* REDEFINE LWR LVL @L1A*/ 01093000
*     2 SUBCLEN  PTR(15) BDY(WORD),          /* SUBCODE MESSAGE LENGTH  01094000
*                                                                @L1C*/ 01095000
*     2 SUBCOFF  PTR(15) BDY(HWORD),         /* SUBCODE MSG OFFSET      01096000
*                                                                @L1C*/ 01097000
*     2 SUBCAR   CHAR(9) BDY(BYTE),          /* UNPACK TARGET FIELD     01098000
*                                                                @L1C*/ 01099000
*       3 SUBCTXT  CHAR(8) BDY(BYTE),        /* TRANSLATION TARGET      01100000
*                                                                @L1C*/ 01101000
*                                                                       01102000
*   /* PARSE RETURN CODE HOLD AND MESSAGE SEGMENT AREA               */ 01103000
*   1 PRSMAR  CHAR(12) BDY(DWORD) BASED,  /* NAME OF AREA            */ 01104000
*     2 PRSMCVA  CHAR(8) BDY(DWORD),  /* CONVERSION AREA             */ 01105000
*       3 PRSMSAV  CHAR(4) BDY(DWORD),  /* HOLD AREA(CHAR)           */ 01106000
*         4 PARSRC  PTR(32),          /* HOLD PARSE RETURN CODE      */ 01107000
*           5 PRSMLEN  PTR(15),       /* SEGMENT LENGTH              */ 01108000
*           5 PRSMOFF  PTR(15),       /* SEGMENT OFFSET              */ 01109000
*   /* THE FOLLOWING DEFINITIONS REDEFINE THE PRSMAR STRUCTURE   @L1A*/ 01110000
*   1 * DEFINED(PRSMAR),                     /* REDEFINE LWR LVL @L1A*/ 01111000
*     2 * CHAR(4),                           /* SPACER           @L1A*/ 01112000
*     2 PRSMVAL CHAR(6),                     /* TEXT AREA        @L1C*/ 01113000
*       3 PRSMTXT CHAR(4),                   /* SEGMENT TEXT     @L1C*/ 01114000
*   1 * DEFINED(PRSMAR),                     /* REDEFINE LWR LVL @L1A*/ 01115000
*     2 * CHAR(5),                           /* SPACER           @L1A*/ 01116000
*     2 PRSMDEC CHAR(4),                     /* DECIMAL AREA     @L1C*/ 01117000
*@EJECT;                                                                01118000
*                                                                       01119000
*                                                                       01120000
*   /* TMP MAPPING OF DYNAMIC ALLOCATION PARAMETER BLOCKS            */ 01121000
*   1 DYNAPARM  BDY(WORD) BASED(DYNAPPTR),                              01122000
*     2 DYNARBP  CHAR(4),             /* PTR TO REQUEST BLOCK        */ 01123000
*     2 DYNARB   CHAR(20),            /* DYNALLOC REQUEST BLOCK      */ 01124000
*     2 DYNATUP  CHAR(4),             /* PTR TO TEXT UNIT            */ 01125000
*     2 DYNATU,                       /* TEXT UNIT:          @PID0180*/ 01126000
*       3 DYNATUK  CHAR(2),           /*   TEXT UNIT KEY     @PID0180*/ 01127000
*       3 DYNATUN  FIXED(15),         /*   TEXT UNIT NUM     @PID0180*/ 01128000
*       3 DYNATUL  FIXED(15),         /*   TEXT UNIT LEN     @PID0180*/ 01129000
*       3 DYNATUD  CHAR(4),           /*   TEXT UNIT PARM    @PID0180*/ 01130000
*       3 *        CHAR(2),           /* BACK ON FWD BDY     @PID0180*/ 01131000
*                                                                       01132000
*   /* MASK FOR CPPL POINTERS                                        */ 01133000
*   1 CPPLRF  CHAR(LENGTH(CPPL)) DEFINED(CPPL),  /* NAME OF AREA     */ 01134000
*     2 *      PTR(31),               /* RESERVED                    */ 01135000
*     2 CPPLPS  CHAR(12),             /* POINTER AREA                */ 01136000
*                                                                       01137000
*   /* MASK FOR TPL POINTERS                                         */ 01138000
*   1 TPLRF  CHAR(LENGTH(TPL)) DEFINED(TPL),  /* NAME OF AREA        */ 01139000
*     2 *      PTR(31),               /* RESERVED                    */ 01140000
*     2 TPLPS  CHAR(12),              /* POINTER AREA                */ 01141000
*                                                                       01142000
*   /* DCB FLAG FIELD -- OPEN FLAG                                   */ 01143000
*   1 TDCBFLGS  DEFINED(DCBOFLGS) BDY(BYTE),  /* DCB FLAGS           */ 01144000
*     2 *       BIT(3),             /* SPACER                        */ 01145000
*       2 DCBOPEN BIT(1),           /* DCB OPEN FLAG                 */ 01146000
*                                                                       01147000
*   /* I/0 SERVICE ROUTINES LIST -- 1ST ELEMENT                      */ 01148000
*   TIOSRL  PTR(31) BASED(ECTIOWA),   /* NAME OF IOSRL AREA          */ 01149000
*                                                                       01150000
*   /* MAPPING OF TOP ELEMENT OF STACK                               */ 01151000
*   1 TOPSTKL  BDY(WORD) BASED(TIOSRL),  /* NAME OF AREA             */ 01152000
*     2 *        CHAR(4) BDY(WORD),   /* RESERVED                    */ 01153000
*       3 *        CHAR(1),           /* RESERVED                    */ 01154000
*         4 *        BIT(4),          /* RESERVED                    */ 01155000
*         4 XECNOW   BIT(1),          /* CLIST MODE FLAG             */ 01156000
*         4 *        BIT(2),          /* RESERVED                    */ 01157000
*       3 STLLSDP  PTR(24),           /* PTR TO LSD                  */ 01158000
*         4 LSDPTR  PTR(24);          /* PTR TO LSD                  */ 01159000
*                                                                       01160000
* /* MAPPING MACRO FOR GETMAIN                                       */ 01161000
* ?  GETMAIN   MF(L,MDLGML,BASED BDY(WORD));                            01162000
*                                                                       01163000
* /* MAPPING MACRO FOR FREEMAIN                                      */ 01164000
* ?  FREEMAIN   MF(L,MDLFML,BASED BDY(WORD));                           01165000
* @EJECT;                                                               01166000
*                                                                       01167000
*                                                                       01168000
* DECLARE                                                               01169000
*   /* DEFINE REGISTER 13                                            */ 01170000
*   R13  PTR(31) REG(13) RSTD;                                          01171000
*                                                                       01172000
*   /* ENQ PARAMETER LIST MASK                                       */ 01173000
*?  ENQ  LS(1) MF(L,STYNQL,BASED(R1));                                  01174000
*                                                                       01175000
*   /* DEQ PARAMETER LIST MASK                                       */ 01176000
*?  DEQ  LS(1) MF(L,STYDQL,BASED(R1));                                  01177000
*                                                                       01178000
*                                                                       01179000
* /* MAPPINGS OF LINKAGE SAVE AREA                                   */ 01180000
* DECLARE                                                               01181000
*   /* CURRENT POINTERS                                              */ 01182000
*   1 CURPTRS  BASED(R13),           /* NAME OF CURRENT AREA         */ 01183000
*     2 *         PTR(31),           /* *                            */ 01184000
*     2 SAVRBAK   PTR(31),           /* CURRENT BACKWARD POINTER     */ 01185000
*     2 SAVRFOR   PTR(31),           /* CURRENT FORWARD POINTER      */ 01186000
*                                                                       01187000
*   /* SAVE AREA                                                     */ 01188000
*   1 SAVARY  BASED(SAVRBAK),        /* NAME OF AREA                 */ 01189000
*     2 *         PTR(31),           /* *                            */ 01190000
*     2 SR13BAK   PTR(31),           /* BACKWARD LINK AREA POINTER   */ 01191000
*     2 SR13FOR   PTR(31),           /* FORWARD LINK AREA POINTER    */ 01192000
*     2 REG14     PTR(31),           /* SAVED REGISTER 14            */ 01193000
*     2 REG15     PTR(31),           /* SAVED REGISTER 15            */ 01194000
*     2 REG0      PTR(31),           /* SAVED REGISTER 0             */ 01195000
*     2 REG1      PTR(31),           /* SAVED REGISTER 1             */ 01196000
*     2 REG2      PTR(31),           /* SAVED REGISTER 2             */ 01197000
*     2 REG3      PTR(31),           /* SAVED REGISTER 3             */ 01198000
*     2 REG4      PTR(31),           /* SAVED REGISTER 4             */ 01199000
*     2 REG5      PTR(31),           /* SAVED REGISTER 5             */ 01200000
*     2 REG6      PTR(31),           /* SAVED REGISTER 6             */ 01201000
*     2 REG7      PTR(31),           /* SAVED REGISTER 7             */ 01202000
*     2 REG8      PTR(31),           /* SAVED REGISTER 8             */ 01203000
*     2 REG9      PTR(31),           /* SAVED REGISTER 9             */ 01204000
*     2 REG10     PTR(31),           /* SAVED REGISTER 10            */ 01205000
*     2 REG11     PTR(31),           /* SAVED REGISTER 11            */ 01206000
*     2 REG12     PTR(31);           /* SAVED REGISTER 12            */ 01207000
*@EJECT;                                                                01208000
*%WRKA2:    ;                        /*                      @E1213F3*/ 01209000
* /******************************************************************/  01210000
* /* TMPWRKA2 -- TMP SUPERVISOR STATE DYNAMIC WORK AREA             */  01211000
* /*                                                                */  01212000
* /*   THIS DYNAMIC WORK AREA  IS GOTTEN  FROM SUBPOOL 230 KEY 1,   */  01213000
* /*   BY IKJEFT01 DURING TMP INITIALIZATION.   NORMALLY IT IS NOT  */  01214000
* /*   FREED  UNTIL  END OF THE TERMINAL SESSION. OTHERS WILL BE    */  01215000
* /*   GOTTEN BY IKJEFTSC WHEN A PARALLEL T02 IS INITIATED          */  01216000
* /*   AND FREED WHEN PARALLEL T02 FINISHED IT PROCESSING.          */  01217000
* /*   SEVERITY 2 STAE RETRY  ALL OF CORE  IS FREED  AND THIS WORK  */  01218000
* /*   AREA MUST BE REINITALIZED.   THIS WORK AREA  IS  REFERENCED  */  01219000
* /*   BY ALL OF THE TMP MODULES.                                   */  01220000
* /*                                                        @E1113KJ*/  01221000
* /******************************************************************/  01222000
*                                                                       01223000
* DECLARE                                                               01224000
*   1 TMPWRKA2  BASED(WRKAPTR2) BDY(DWORD),                             01225000
*     2 TWRKA2A  BDY(WORD),          /* DEFINE FIRST AREA            */ 01226000
*       3 WRKA1PTR PTR(32),          /* PTR TO PROB PROG WORK AREA   */ 01227000
*       3 WRKA2PTR PTR(32),          /* PTR TO TMP PRIVATE WORK AREA */ 01228000
*       3 TMPWA2P  PTR(32),          /* PTR TO STAE/STAI WORK AREA   */ 01229000
*       3 SAVARPTR PTR(32),          /* PTR TO ORIGINAL SAVE AREA    */ 01230000
*       3 TMPTIME  PTR(32),          /* ADDR OF TIME ROUTINE         */ 01231000
*       3 TMPT04   PTR(32),          /* ADDR OF STAI EXIT ROUTINE    */ 01232000
*       3 TMPT042  PTR(32),          /* ADDR2 OF STAI EXIT ROUTINE   */ 01233000
*       3 TMPT05   PTR(32),          /* ADDR OF STAE EXIT ROUTINE    */ 01234000
*       3 TEPKEY   PTR(32),          /* TMP ENTRY PSW PROTECT KEY    */ 01235000
*       3 TCBPTR   PTR(32),          /* PTR TO TCB                   */ 01236000
*       3 UPTPTR   PTR(32),          /* PTR TO UPT                   */ 01237000
*       3 ECTPTR   PTR(32),          /* PTR TO ECT                   */ 01238000
*       3 PSCBPTR  PTR(32),          /* PTR TO PSCB                  */ 01239000
*       3 ASCBPTR  PTR(32),          /* PTR TO ASCB                  */ 01240000
*       3 ASXBPTR  PTR(32),          /* PTR TO ASXB                  */ 01241000
*       3 RLGBPTR  PTR(32),          /* PTR TO RELOGON BUFFER        */ 01242000
*       3 LWAPTR   PTR(32),          /* PTR TO LOGON WORK AREA       */ 01243000
*       3 JSCBPTR  PTR(32),          /* PTR TO JSCB (IEZJSCB)        */ 01244000
*       3 CMDACTP  PTR(32),          /* PTR SRM PARM LIST    @ZA39401*/ 01245000
*       3 TMPT043  PTR(32),          /* PTR TO ESTAI MSG RTN @ZA40795*/ 01246000
*       @EJECT;                                                         01247000
*     /* TMP MAINLINE FLOW CONTROL FLAGS                             */ 01248000
*     3 FLOFLGS  CHAR(4) BDY(WORD),                                     01249000
*       4 FLOFLGS1 CHAR(1),                                             01250000
*         5 *       BIT(1),                                             01251000
*         5 *       BIT(1),                                             01252000
*         5 DOLIST  BIT(1),                                             01253000
*         5 DOGETC  BIT(1),                                             01254000
*         5 DODONE  BIT(1),                                             01255000
*         5 DOINVOK BIT(1),                                             01256000
*         5 DOSCAN  BIT(1),                                             01257000
*         5 *       BIT(1),                                             01258000
*                                                                       01259000
*       4 FLOFLGS2 CHAR(1),                                             01260000
*         5 DOPUTM  BIT(1),                                             01261000
*         5 DOFRECB BIT(1),                                             01262000
*         5 DOPSTRT BIT(1),                                             01263000
*         5 DOACTV  BIT(1),                                             01264000
*         5 DOCHKAT BIT(1),                                             01265000
*         5 DOWAIT  BIT(1),                                             01266000
*         5 DOATTN  BIT(1),                                             01267000
*           6 DOCHKCP  BIT(1),                                          01268000
*         5 *       BIT(1),                                             01269000
*                                                                       01270000
*       4 FLOFLGS3 CHAR(1),                                             01271000
*         5 *       BIT(1),                                             01272000
*         5 DOIMPLX BIT(1),                                             01273000
*         5 DOTEST  BIT(1),                                             01274000
*         5 DOSETBF BIT(1),                                             01275000
*         5 DOSETTB BIT(1),                                             01276000
*         5 *       BIT(3),                                             01277000
*                                                                       01278000
*       4 FLOFLGS4 CHAR(1),                                             01279000
*         5 *       BIT(8),                                             01280000
*                                                                       01281000
*@EJECT;                            /*                     @ZA40795 */  01282000
*       /* GRAPHIC BIT MAP FOR EASY REFERENCE TO TMP BITS  @ZA40795 */  01283000
*/*******************************************************************/  01284000
*/*                                                                 */  01285000
*/*           8    4    2      1      8      4       2      1       */  01286000
*/* FLOFLGS1                                                        */  01287000
*/*           0    1    2      3      4      5       6      7       */  01288000
*/*                                                                 */  01289000
*/*           *    *    DOLIST DOGETC DODONE DOINVOK DOSCAN *       */  01290000
*/*                                                                 */  01291000
*/* DOWATF1             *      *      *      *       *              */  01292000
*/* DOATTNF1            *      *      *      *                      */  01293000
*/* DOACTF1             *      *      *                             */  01294000
*/* DOTSKF1                    *      *      *       *              */  01295000
*/* DOCHKAF1                   *      *                             */  01296000
*/* DOSTCDF1                   *      *                             */  01297000
*/* DOMPLXF1                   *      *                             */  01298000
*/* DOGTCDF1                          *      *       *              */  01299000
*/*                                                                 */  01300000
*/*******************************************************************/  01301000
*/*                                                                 */  01302000
*/*          8      4       2       1      8       4      2         */  01303000
*/* FLOFLGS2                                                        */  01304000
*/*          0      1       2       3      4       5      6       7 */  01305000
*/*                                                                 */  01306000
*/*          DOPUTM DOFRECB DOPSTRT DOACTV DOCHKAT DOWAIT DOATTN  * */  01307000
*/*                                                       DOCHKCP * */  01308000
*/*                                                                 */  01309000
*/* DOMPLXF2 *      *       *       *      *                        */  01310000
*/* DOGTCDF2                *       *      *       *      *         */  01311000
*/* DOSTCDF2                *       *      *                        */  01312000
*/* DOCHKAF2                *       *                               */  01313000
*/*                                                                 */  01314000
*/*******************************************************************/  01315000
*/*                                                                 */  01316000
*/*           8      4       2       1       8       4 2   1        */  01317000
*/* FLOFLGS3                                                        */  01318000
*/*           0      1       2       3       4       5  6  7        */  01319000
*/*                                                                 */  01320000
*/*           *      DOIMPLX DOTEST  DOSETBF DOSETTB *  *  *        */  01321000
*/*                                                                 */  01322000
*/*******************************************************************/  01323000
*/*                                                                 */  01324000
*/* FLOFLGS4                                                        */  01325000
*/*           0      1       2       3       4       5  6  7        */  01326000
*/*           *      *       *       *       *       *  *  *        */  01327000
*/*                                                                 */  01328000
*/*******************************************************************/  01329000
*       @EJECT;                                                         01330000
*       3 T0ASAVEP PTR(31),          /* ADDR OF SAVEAREA FOR RETRY TO   01331000
*                                       IKJEFT0A             @E2267H1*/ 01332000
*       3 LWAPTR1  PTR(31),          /* ADDR OF LWA FOR T02  @E23D2I6*/ 01333000
*       3 *        PTR(32),          /* RESERVED                     */ 01334000
*       3 *        PTR(32),          /* RESERVED                     */ 01335000
*                                                                       01336000
*       /* TEMPORARY SAVE AREAS FOR CALL LINK REGISTERS              */ 01337000
*       /* SAVE AREAS FOR TMP-CALL                                   */ 01338000
*       3 SAVRA  PTR(31),                                               01339000
*       3 SAVRB  PTR(31),                                               01340000
*       3 SAVRC  PTR(31),                                               01341000
*       3 SAVRM  PTR(31),                                               01342000
*       3 SVLNKE PTR(31),                                               01343000
*       /* SAVE AREAS FOR TMP MAINLINE LINK REGISTERS                */ 01344000
*       3 SAVLNKRS  BDY(WORD),       /* NAME OF AREA                 */ 01345000
*         4 SAVLNKA  PTR(31),                                           01346000
*         4 SAVLNKB  PTR(31),                                           01347000
*         4 SAVLNKC  PTR(31),                                           01348000
*         4 SAVLNKD  PTR(31),                                           01349000
*         4 SAVLNKE  PTR(31),                                           01350000
*         4 SAVLNKF  PTR(31),                                           01351000
*         4 SAVLNKG  PTR(31),                                           01352000
*         4 SAVLNKH  PTR(31),                                           01353000
*         4 SAVLNKJ  PTR(31),                                           01354000
*         4 SAVLNKK  PTR(31),                                           01355000
*         4 SAVLNKL  PTR(31),                                           01356000
*         4 SAVLNKM  PTR(31),                                           01357000
*@EJECT;                                                                01358000
* /*******************************************************************/ 01359000
* /* TMPWRKA2 -- CONTINUED                                           */ 01360000
* /*******************************************************************/ 01361000
*                                                                       01362000
*     2 TWRKA2B  BDY(WORD),          /* DEFINE SECOND AREA           */ 01363000
*       /* CONTROL FLAGS                                             */ 01364000
*       3 MCTLFLGS  CHAR(4) BDY(WORD), /* NAME OF AREA               */ 01365000
*         4 MCFLGS1 CHAR(1),                                            01366000
*           5 BKGMODE  BIT(1),       /* EXECUTING IN BACKGROUND MODE */ 01367000
*           5 DRSAPF   BIT(1),       /* ON - ATTACH WITH APF         */ 01368000
*           5 TMP2TSLB BIT(1),       /* 1=FOUND IN TSOLIB    @E25D2JC*/ 01369000
            5 TMP2NTSL BIT(1),       /* 1=NOT ELIGIBLE TO BE LOADED FROM01370000
                                        A DATASET DEFINED BY THE TSOLIB 01371000
                                        COMMAND              @WA23000*/ 01372000
*           5 *        BIT(4),       /* RESERVED             @WA23000*/ 01373000
*         4 *       CHAR(3),         /* RESERVED                     */ 01374000
*           5 *        BIT(1),       /* Hi-order bit is                 01375000
*                                       now reserved         @E25D2JC*/ 01376000
*           5 TMP2TSFC BIT(1),       /* 1=TMP IS EXECUTING IN           01377000
*                                       TSF/CLIST MODE       @E2367S4*/ 01378000
*           5 ATTEXC2  BIT(1),       /* 1=EXC2 ATTACHED FOR TSF/CLIST   01379000
*                                       MODE PROCESSING      @E2367S4*/ 01380000
*           5 TMP2TSCA BIT(1),       /* 1=IKJEFTSC ATTENTION EXIT       01381000
*                                       (IKJATTN) RECEIVED CONTROL      01382000
*                                                            @E2367S4*/ 01383000
*           5 TMP2SVCI BIT(1),       /* 1=TMP PARALLEL SIDE IS SVC      01384000
*                                       INITIATED            @E2367S4*/ 01385000
*           5 *        BIT(1),       /* RESERVED             @PBY0160*/ 01386000
*           5 TMP2SYN1 BIT(1),       /* 1=SYNCHED TO IKJEFT03 FROM      01387000
*                                       IKJEFT02 IN ROUTINE TTSKCHK.    01388000
*                                                            @PBY0160*/ 01389000
*           5 TMP2SYN2 BIT(1),       /* 1=SYNCHED TO IKJEFT03 FROM      01390000
*                                      IKJEFT02 IN ROUTINE TGETCDX      01391000
*                                                            @PBY0160*/ 01392000
*           5 TMP2PLAT BIT(1),       /* 1=RUNNING ON TMP AUTHORIZED     01393000
*                                      PLATFORM              @E23D2I6*/ 01394000
*       3 MTPL    BDY(WORD),         /* NAME OF MODEL TPL            */ 01395000
*         4 MTPLCBUF  PTR(31),       /* POINTER TO COMMAND BUFFER    */ 01396000
*         4 MTPLPS CHAR(12) BDY(WORD), /* NAME OF POINTER AREA       */ 01397000
*           5 MTPLUPT  PTR(31),      /* POINTER TO UPT               */ 01398000
*           5 MTPLPSCB PTR(31),      /* POINTER TO PSCB              */ 01399000
*           5 MTPLECT  PTR(31),      /* POINTER TO ECT               */ 01400000
*                                                                       01401000
*       3 RTRYSA     BDY(WORD),      /* ENVIRONMENTAL AREA           */ 01402000
*         4 RTRY51   PTR(31),        /* T02 BASE PTR 1               */ 01403000
*         4 RTRY52   PTR(31),        /* T02 BASE PTR 2               */ 01404000
*         4 RTRY53   PTR(31),        /* T02 DATAREG                  */ 01405000
*                                                                       01406000
*       3 MDYNASP   CHAR(40) BDY(WORD),/* MODEL DYNALLOC PL @PID0180 */ 01407000
*       @EJECT;                     /*                      @ZA40795 */ 01408000
* /*******************************************************************/ 01409000
* /* TMPWRKA2 -- CONTINUED                                  @ZA40795 */ 01410000
* /*******************************************************************/ 01411000
*    2 TWRKA2C BDY(WORD),            /* DEFINE THIRD AREA   @ZA40795 */ 01412000
*     3 TMPBLDL BDY(WORD) CHAR(68),  /* BLDL REQUEST PL     @ZA40795 */ 01413000
*       4 TMPBLDNR FIXED(15),        /* BLDL NUMBER OF ENTRIES IN    */ 01414000
*                                    /* LIST                @ZA40795 */ 01415000
*       4 TMPBLDN FIXED(15),         /* BLDL LENGTH OF PL   @ZA40795 */ 01416000
*       4 TMPBLDNM CHAR(8),          /* BLDL PROGRAM NAME   @ZA40795 */ 01417000
*       4 TMPBLDAT CHAR(56),         /* BLDL USER INFO RETURNED      */ 01418000
*                                    /*                     @ZA40795 */ 01419000
*     3 TMPFLAG1 CHAR(1),            /* LOCAL FLAGS 1       @ZA40795 */ 01420000
*       4 TMPCP BIT(1),              /* 1=CP COMMAND ATTACH REQUESTED*/ 01421000
*                                    /*                     @ZA40795 */ 01422000
*       4 TMPCPCAL BIT(1),           /* 1=CALL COMMAND ATTACH        */ 01423000
*                                    /*            REQUESTED@ZA40795 */ 01424000
*       4 TMPCPTST BIT(1),           /* 1=TEST COMMAND LINK REQUESTED*/ 01425000
*                                    /*                     @ZA40795 */ 01426000
*       4 TMPCPABN BIT(1),           /*1=CURRENT CMD ABENDED@ZA40795 */ 01427000
*       4 TMPAPF BIT(1),             /* 1=APF ATTACH ACTIVE @ZA40795 */ 01428000
*       4 TMPDE BIT(1),              /* 1=DE ATTACH REQ     @ZA40795 */ 01429000
*       4 TMPTSTAU BIT(1),           /* 1=TESTAUTH COMMAND  @E21D2I6 */ 01430000
*                                    /*  ENTERED            @E21D2I6 */ 01431000
*       4 TMPBIT07 BIT(1),           /*  R E S E R V E D    @ZA40795 */ 01432000
*     3 TMPFLAG2 CHAR(1),            /*  LOCAL FLAGS 2      @ZA40795 */ 01433000
*       4 TMPFORCE BIT(1),           /*  FORCE CP DETACH    @ZA40795 */ 01434000
*     3 TMPFLAG3 CHAR(1),            /*  R E S E R V E D    @ZA40795 */ 01435000
*     3 TMPFLAG4 CHAR(1),            /*  R E S E R V E D    @ZA40795 */ 01436000
*     3 TMPTEST@ PTR(31),            /* ADDR OF TEST CMD    @ZA40795 */ 01437000
*     3 TMPTSKLB PTR(31),            /* DCB ADDR FOR TASKLIB KEYWORD */ 01438000
*                                    /* ON ATTACH           @ZA40795 */ 01439000
*     3 TMPCALST PTR(31),            /* ADDR CALL COMMAND PARAMETER  */ 01440000
*                                    /* STRING              @ZA40795 */ 01441000
*     3 TMPCPPL@ PTR(31),            /* ADDRESS TPLCPPL OR ADDRESS      01442000
*                                       TO TSO SERVICE FACILITY PROGRAM 01443000
*                                       PARAMETER LIST      @E121324 */ 01444000
*     3 TMPABECB PTR(31),            /* ADDR ECB POSTED AFTER ABEND  */ 01445000
*                                    /* OR ATTENTION        @ZA40795 */ 01446000
*     3 TMPSTAI PTR(31),             /* PTR TO ESTAI RTN    @ZA40795 */ 01447000
*     3 TMPSPLS PTR(31),             /* PTR TO ESTAI PARMS  @ZA40795 */ 01448000
*     3 TMPTSKRC FIXED(31),          /* SUBTASK CPL CODE (R15)       */ 01449000
*    2 RESERVE1 CHAR(1),             /* RESERVED            @E1213F3*/  01450000
*    2 RESERVE2 CHAR(1),             /* RESERVED            @E1213F3*/  01451000
*    2 RESERVE3 CHAR(1),             /* RESERVED            @E1213F3*/  01452000
*    2 RESERVE4 CHAR(1),             /* RESERVED            @E1213F3*/  01453000
*    2 TMP2ATNP PTR(31),        /* @ OF ATTN ROUTINE        @E1213F3*/  01454000
*    2 TMP2PARM FIXED(31),      /* PARM GOOD OR NOT         @E1213F3*/  01455000
*    2 TMP2SA@  PTR(31),        /* PTR TO KEY 1 SAVEAREA   @E1213F3*/   01456000
*    2 TMP2TIB@ PTR(31),        /* @ OF TIB WHICH IS USED BY IKJEFT02   01457000
*                                  IT IS GOTTEN BY IKJEFT01 AND WILL    01458000
*                                  FREED BY IKJEFT01        @E1213F3*/  01459000
*    2 TMP2ATIB PTR(31),        /* @ OF THE ACTIVE TIB      @E1213F3*/  01460000
*    2 TMP2MECB PTR(31),        /* @ OF TPLMECB (STOP/MODIFY ECB)       01461000
*                                  WITHIN TMPWRKA1         @E1213F3*/   01462000
*    2 TMP2AECB PTR(31),        /* @ OF END OF T02 ECB                  01463000
*                                  WITHIN TMPWRKA1         @E1213F3*/   01464000
*    2 TMPW1LEN FIXED(31),      /* LENGTH OF TMPWRKA1      @E1213F3*/   01465000
*    2 TMPW2LEN FIXED(31),      /* LENGTH OF TMPWA2        @E1213F3*/   01466000
*    2 TMPBUFF@ FIXED(31),      /* BUFFER @ OBTAINED BY    @E1213F3*/   01467000
*                               /* IKJEFT02                @E1213F3*/   01468000
*    2 TMP2PPTR PTR(31),        /* @ OF ITS OWN PURGE PARM LIST         01469000
*                                                           @E1213F3*/  01470000
*    2 TMP2PLEN FIXED(31),       /* LENGTH OF RESTORE PARM AND PURGE    01471000
*                                PARM LIST TO GET AND FREE @E1213F3*/   01472000
*    2 TMP2NAME CHAR(8),         /* NAME OF TMPWRKA2       @E1213F3*/   01473000
*    2 TMP2LEV  CHAR(4),         /* LEVEL OF TMPWRKA2      @E1213F3*/   01474000
*  2 TMP2FFLG,                   /* FLAGS USED FOR DEBUGGING AND        01475000
*                                   RECOVERY PURPOSES      @E1213F3*/   01476000
*    3 TMP2DBUG,                 /* TRACE OF FUNCTIONS PERFORMED WHICH  01477000
*                                   CAN BE USED FOR DEBUGGING           01478000
*                                                          @E1213F3*/   01479000
*    4 TMP2TSFG CHAR(1),             /* FLAGS USED TO INDICATE WHAT     01480000
*                                       FUNCTION WAS PERFORMED BY       01481000
*                                       IKJEFTSC             @E1213F3*/ 01482000
*     5 TMP2PUR BIT(1),              /* PURGE I/O WAS DONE   @E1213F3*/ 01483000
*     5 TMP2STAT BIT(1),             /* STATUS RESET WAS DONE@E1213F3*/ 01484000
*     5 *       BIT(1),              /* RESERVE              @PBB0045*/ 01485000
*     5 TMP2WAIT BIT(1),             /* WAIT WAS BEING DONE  @E1213F3*/ 01486000
*     5 TMP2POST BIT(1),             /* POST WAS BEING DONE  @E1213F3*/ 01487000
*     5 TMP2W1ST BIT(1),             /* BUILDING THE WORKAREA           01488000
*                                                           @E1213F3*/  01489000
*     5 TMP2WA2S BIT(1),             /* BUILDING THE WORKAREA           01490000
*                                                           @E1213F3*/  01491000
*     5 TMP2W2ST BIT(1),             /* BUILDING THE WORKAREA           01492000
*                                                           @E1213F3*/  01493000
*    4 T2FLGT08 CHAR(1),             /* FLAG FOR IKJEFT08   @E1213F3*/  01494000
*      5 TMP2NPAR BIT(1),            /* INDICATE NO PARALLEL TMP        01495000
*                                                           @E1213F3*/  01496000
*      5 * BIT(7),                    /*                    @E1213F3*/  01497000
*    4 TMP2VFPR CHAR(1),             /* TSF PARAMETER VERIFICATION      01498000
*                                       DEBUGGING FOOTPRINTS            01499000
*                                       (IKJEFTPV)          @E1213F3*/  01500000
*      5 TMP2READ BIT(1),            /* READING PARAMETERS  @E1213F3*/  01501000
*      5 TMP2WRIT BIT(1),            /* WRITING PARAMETERS  @E1213F3*/  01502000
*      5 TMP2MAIN BIT(1),            /* MAINLINE            @E1213F3*/  01503000
*      5 TMP2PAGE BIT(1),            /*READING FUNCTION BUFF@E1213F3*/  01504000
*      5 TMP2PGM  BIT(1),            /* READING PGM PARMS   @E1213F3*/  01505000
*      5 TMP2CODE BIT(1),            /* SETTING RETURN CODES@E1213F3*/  01506000
*      5 TMP2TPVR BIT(1),            /* RESERVED            @E1213F3*/  01507000
*      5 TMP2DONE BIT(1),            /* IKJEFTPV DONE       @E1213F3*/  01508000
*    4 TMPFLG1 CHAR(1),              /* USED BY IKJEFT02    @E121324*/  01509000
*      5 TMPARALL BIT(1),       /* PARALLEL TMP ENVIRONMENT @E121324*/  01510000
*      5 TMPAPFCK BIT(1),       /* TSRCHAPF HAS BEEN CALLED @E121324*/  01511000
*      5 TMPLOAD  BIT(1),       /* LOAD WAS ISSUED          @E121324*/  01512000
*      5 DIDCALL  BIT(1),       /* CALL HAS BEEN PERFORMED  @E121324*/  01513000
*                               /* BY THE PARALLEL TMP     @E121324*/   01514000
*      5 R1PGMLST BIT(1),       /* R1 SET TO PGM PARM LIST  @E121324*/  01515000
*                               /* FROM SVC                 @E121324*/  01516000
*      5 TMPDETCH BIT(1),       /* IKJEFTP2 IS DETACHING    @YA34525*/  01517000
*      5 * BIT(2),              /* RESERVED                 @YA34525*/  01518000
                                                                        01519000
*    3 TMP2RCOV,                 /* FLAGS USED BY RECOVERY @E1213F3*/   01520000
*      4 TMP2MCTL CHAR(2),       /* MODULE IN CONTROL FLAGS, SET BY     01521000
*                                   ALL TMP MODULES THAT ARE IN         01522000
*                                   CONTROL                @E1213F3*/   01523000
*        5 TMP2MT01 BIT(1),      /* IKJEFT01 IN CONTROL    @E1213F3*/   01524000
*        5 TMP2MTSC BIT(1),      /* IKJEFTSC IN CONTROL    @E1213F3*/   01525000
*        5 TMP2MT02 BIT(1),      /* IKJEFT02 IN CONTROL    @E1213F3*/   01526000
*        5 TMP2MTPV BIT(1),      /* IKJEFTPV IN CONTROL    @E1213F3*/   01527000
*        5 TMP2MT08 BIT(1),      /* IKJEFT08 IN CONTROL    @E1213F3*/   01528000
*        5 TMP2MCAF BIT(1),      /* IKJCAF   IN CONTROL    @E2367S4*/   01529000
*        5 *        BIT(10),     /* RESERVED               @E2367S4*/   01530000
*      4 TMP2FCTL,               /* MODULAR FUNCTION IN CONTROL, SET    01531000
*                                   BY ALL TMP MODULES THAT ARE IN      01532000
*                                   CONTROL                @E1213F3*/   01533000
*        5 TMP2FT01 CHAR(1),     /* IKJEFT01 FUNCTION IN CONTROL        01534000
*                                                          @E1213F3*/   01535000
*          6 TMP2FI01 BIT(1),    /* IKJEFT01 INITIALIZATION@E1213F3*/   01536000
*          6 TMP2FTM1 BIT(1),    /* IKJEFT01 TERMINATION   @E1213F3*/   01537000
*          6 *        BIT(6),    /* RESERVED               @E1213F3*/   01538000
*        5 TMP2FTSC CHAR(1),     /* IKJEFTSC FUNCTION IN CONTROL        01539000
*                                                          @E1213F3*/   01540000
*          6 TMP2FISC BIT(1),    /* IKJEFTSC INITIALIZATION@E1213F3*/   01541000
*          6 TMP2FBSC BIT(1),    /* IKJEFTSC IN CONTROL AFTER WAIT OF   01542000
*                                   TIBRECB AND BEFORE TERMINATION      01543000
*                                   CODE                   @E1213F3*/   01544000
*          6 TMP2FTMC BIT(1),    /* IKJEFTSC TERMINATION   @E1213F3*/   01545000
*          6 *        BIT(5),    /* RESERVED               @E1213F3*/   01546000
*        5 TMP2FT02 CHAR(1),     /* IKJEFT02 FUNCTION IN CONTROL        01547000
*                                                          @E1213F3*/   01548000
*          6 *        BIT(8),    /* RESERVED               @E1213F3*/   01549000
*        5 TMP2FTPV CHAR(1),     /* IKJEFTPV FUNCTION IN CONTROL        01550000
*                                                          @E1213F3*/   01551000
*          6 TMP2FSUV BIT(1),    /* IKJEFTPV SYSTEM/USER FUNCTION,      01552000
*                                   ON IF USER AND OFF IF SYSTEM        01553000
*                                                          @E1213F3*/   01554000
*          6 *        BIT(7),    /* RESERVED               @E1213F3*/   01555000
*        5 TMP2FT08 CHAR(1),     /* IKJEFT08 FUNCTION IN CONTROL        01556000
*                                                          @E1213F3*/   01557000
*          6 *        BIT(8),    /* RESERVED               @E1213F3*/   01558000
*        5 RESERVE5 CHAR(3),    /* RESERVED               @E1213F3*/    01559000
*      4 TMP2FLRC CHAR(2),       /* SET BY IKJEFT05 (RECOVERY) TO       01560000
*                                   INDICATE THE RETRY TARGET CODE      01561000
*                                   (FIRST LEVEL)          @E1213F3*/   01562000
*        5 TMP2FLI1 BIT(1),      /*IKJEFT01 INITIALIZATION @E1213F3*/   01563000
*        5 TMP2FLIC BIT(1),      /*IKJEFTSC INITIALIZATION @E1213F3*/   01564000
*        5 TMP2FLBC BIT(1),      /* IKJEFTSC AFTER WAIT FOR PARALLEL    01565000
*                                   SIDE FOR CLEANUP       @E1213F3*/   01566000
*        5 TMP2FL02 BIT(1),      /* IKJEFT02               @E1213FE*/   01567000
*        5 TMP2FLTV BIT(1),      /* IKJEFTPV TERMINATION   @E1213F3*/   01568000
*        5 TMP2TSFR BIT(1),      /* PARALLEL IKJEFT02      @E2367S4*/   01569000
*        5 *        BIT(10),     /* RESERVED               @E2367S4*/   01570000
*      4 TMP2SLRC CHAR(2),       /* SET BY IKJEFT05 (RECOVERY) TO       01571000
*                                   INDICATE CAUSES FOR A PREVIOUS      01572000
*                                   RETRY TO IKJEFT01                   01573000
*                                   (SECOND LEVEL)         @E1213F3*/   01574000
*        5 TMP2SL01 BIT(1),      /* IKJEFT01               @E1213F3*/   01575000
*        5 TMP2SLIC BIT(1),      /* IKJEFTSC INITIALIZATION@E1213F3*/   01576000
*        5 TMP2SLBC BIT(1),      /* IKJEFTSC AFTER FIRST ATTACH OF      01577000
*                                   IKJEFT02               @E1213F3*/   01578000
*        5 TMP2SL02 BIT(1),      /* IKJEFT02               @E1213F3*/   01579000
*        5 TMP2SLPV BIT(1),      /* IKJEFTPV               @E1213F3*/   01580000
*        5 *        BIT(11),     /* RESERVED               @E1213F3*/   01581000
*      4 TMP2FAIL CHAR(2),       /* SET ON BY IKJEFT05 (RECOVERY) TO    01582000
*                                   INDICATE FAILURE IN A SPECIFIC      01583000
*                                   TMP MODULE. TMP MODULES USE FLAG    01584000
*                                   TO RESET RECURSION FLAGS.           01585000
*                                                          @E1213F3*/   01586000
*        5 TMP2DMPF BIT(1),     /* SET BY IKJEFT05 TO INDICATE          01587000
*                                  THAT A SETRP DUMP IS TO BE           01588000
*                                  TAKEN                   @E2267H1*/   01589000
*        5 TMP2TSCF BIT(1),      /* IKJEFTSC FAILED        @E1213F3*/   01590000
*        5 TMP2T02F BIT(1),      /* IKJEFT02 FAILED        @E1213F3*/   01591000
*        5 T2T8T9F  BIT(1),      /* T08 T09 ATTACH FAIL    @ZTS0162*/   01592000
*        5 *        BIT(12),     /* RESERVED               @ZTS0162*/   01593000
*      4 TMP2RTRY,               /* SET BY IKJEFT01 AND IKJEFT02 TO     01594000
*                                   INDICATING ADDRESSES OF RETRY       01595000
*                                   CODE.  IKJEFT05 WILL USE THESE      01596000
*                                   ADDRESSES IN ORDER TO RETRY         01597000
*                                                          @E1213F3*/   01598000
*        5 TMP2RBSC PTR(31),     /* BEGINNING OF IKJEFTSC, SET          01599000
*                                   BY IKJEFT01            @E1213F3*/   01600000
*        5 TMP2RWSC PTR(31),     /* AFTER WAIT BEFORE TERMINATION       01601000
*                                   CODE IN IKJEFTSC, SET BY            01602000
*                                   IKJEFT01               @E1213F3*/   01603000
*        5 TMP2RW02 PTR(31),     /* AFTER WAIT ON TIBRECB: SET BY       01604000
*                                   IKJEFT02               @E1213F3*/   01605000
*        5 TMP2RT02 PTR(31),     /* TERMINATION CODE IN IKJEFT02        01606000
*                                   IN ORDER TO RETURN TO IKJEFT01 FOR  01607000
*                                   A RETRY, SET BY IKJEFT02            01608000
*                                                          @E1213F3*/   01609000
*        5 TMP2RTPV PTR(31),     /* TERMINATION CODE IN IKJEFTPV        01610000
*                                   IN ORDER TO RETURN TO IKJEFTSC,     01611000
*                                   SET BY IKJEFT02        @E1213F3*/   01612000
*      4 TMP2MRG1,               /* FIRST GROUP OF POINTERS TO MODULE   01613000
*                                   SAVEAREAS - SEE TMP2MRG2 FOR THE    01614000
*                                   REMAINING POINTERS                  01615000
*                                                                       01616000
*                                   EACH TMP MODULE STORES ADDRESS TO   01617000
*                                   ITS REGISTERS SO IKJEFT05 CAN       01618000
*                                   ESTABLISH ADDRESSABILITY DURING     01619000
*                                   A RETRY                @ZA85291*/   01620000
*        5 TMP2RG01 PTR(31),     /* ADDRESS IKJEFT01'S REGISTERS        01621000
*                                                          @E1213F3*/   01622000
*        5 TMP2RGSC PTR(31),     /* ADDRESS IKJEFTSC'S REGISTERS        01623000
*                                                          @E1213F3*/   01624000
*        5 TMP2RG02 PTR(31),     /* ADDRESS IKJEFT02'S REGISTERS        01625000
*                                                          @E1213F3*/   01626000
*        5 TMP2RGPV PTR(31),     /* ADDRESS IKJEFTPV'S REGISTERS        01627000
*                                                          @E1213F3*/   01628000
* 2 TMP2RET@ PTR(31),            /* TO INDICATE RETRY ADDRESS ON SETRP  01629000
*                                  MACRO ISSUED IN IKJEFT05@E1213F3*/   01630000
* 2 TMP2SR14 PTR(31),            /* USED BY RECOVERY ROUTINE TO SAVE    01631000
*                                  RETURN POINT WHEN IT DOES A CALL     01632000
*                                  TO A SUBROUTINE.        @E1213F3*/   01633000
* 2 TMP2TSC2 CHAR(1),            /* FLAGS USED BY TSC WITH REC          01634000
*                                                           @E1213F3*/  01635000
*   3 TMP2CLR  BIT(1),                 /* FLAGS NEEDED USED BY TSC TO   01636000
*                                   INDICATE WHAT IS DONE TO INITIATE   01637000
*                                   PARALLEL SIDE          @E1213F3*/   01638000
*   3 TMP2REC  BIT(1),            /* INDICATE RETRY TO IKJEFT01         01639000
*                                                          @E1213F3*/   01640000
*   3 TMP2SRCT BIT(1),            /* INDICATE WHETHER TO UPDATE TIB     01641000
*                                    BY RECOVERY-UPDATE IF IT FUNCTION  01642000
*                                    REQUEST BY USER IS NOT DONE        01643000
*                                                          @ZTY0256*/   01644000
*   3 TMP2INIT BIT(1),            /* INDICATE RETRY TO IKJEFT01         01645000
*                                                          @ZTY0336*/   01646000
*   3 TMP2RINT BIT(1),            /* INDICATE REXX NEEDS TO BE          01647000
*                                    REINITIALIZED         @PEI0701*/   01648000
*   3 *         BIT(3),          /* RESERVE                @PEI0701*/   01649000
* 2 *       CHAR(3),             /* RESERVE                @E1213F3*/   01650000
* 2 TMP2TAIE PTR(31),            /* PTR TO TAIE USED BY T02@ZTS0254*/   01651000
* 2 TMP2TSP  PTR(31),            /* PTR TO IKJTSP MAPPING MACRO         01652000
*                                                          @E2267H1*/   01653000
* 2 TMP2TP2W PTR(31),            /* PTR TO SHARED DYNAMIC AREA BETWEEN  01654000
*                                   IKJEFT02 AND IKJEFTP2  @E2267H1*/   01655000
* 2 TMP2CAFP PTR(31),            /* PTR TO IKJCAFPL PARAMETER LIST      01656000
*                                                          @E2367S4*/   01657000
* 2 TMP2MRG2,                    /* SECOND GROUP OF POINTERS TO         01658000
*                                   MODULE SAVEAREAS                    01659000
*                                                                       01660000
*                                   EACH TMP MODULE STORES ADDRESS TO   01661000
*                                   ITS REGISTERS SO IKJEFT05 CAN       01662000
*                                   ESTABLISH ADDRESSABILITY DURING     01663000
*                                   A RETRY                @ZA85291*/   01664000
*        3 TMP2RGP2 PTR(31),     /* ADDRESS IKJEFTP2'S REGISTERS        01665000
*                                                          @ZA85291*/   01666000
* 2 TMP2TPSA CHAR(72),           /* IKJEFTP2'S PROTECTED SAVEAREA       01667000
*                                   PASSED BY IKJEFT02     @ZA96882*/   01668000
* 2 TMP2TPS2 CHAR(72),           /* IKJEFTP2'S PROTECTED SAVEAREA       01669000
*                                   USED BY TP2 TO CALL ITS OWN         01670000
*                                   PROCEDURES.            @ZA96882*/   01671000
* /*******************************************************/             01672000
* /*  PARAMETER LIST PASSED TO ATTENTION ROUTINE         */             01673000
* /*  IKJEFT03:                                          */             01674000
* /*                                                     */             01675000
* /*  REG1 ---------------|                              */             01676000
* /*                      |                              */             01677000
* /*                      V                              */             01678000
* /*            --------------------|                    */             01679000
* /*            | TAIE @            |                    */             01680000
* /*            |                   |                    */             01681000
* /*            |-------------------|                    */             01682000
* /*            |  CMD BUFFER @     |                    */             01683000
* /*            |                   |  NOT USED          */             01684000
* /*            |-------------------|                    */             01685000
* /*            |  TMP PRIVATE WORK |                    */             01686000
* /*            |  AREA @           |    WRKAPTR2        */             01687000
* /*            |-------------------|                    */             01688000
* /*                                                     */             01689000
* /*                                                     */             01690000
* /*******************************************************/             01691000
*                                                                       01692000
* 2 T3PARMS BDY(DWORD),        /*                            @ZA96882*/ 01693000
*   5 T3TAIE@ PTR(31),         /*                            @ZA96882*/ 01694000
*   5 *       PTR(31),         /*                            @ZA96882*/ 01695000
*   5 T3WKPTR2 PTR(31),        /*                            @ZA96882*/ 01696000
*                                                                       01697000
* 2 STAXPPTR PTR(31),          /* ADDRESS OF STAX PARM LIST  @ZA96882*/ 01698000
*                                                                       01699000
* 2 SYNCHSP  CHAR(16),         /* SYNCH PARM LIST            @ZA96882*/ 01700000
*                                                                       01701000
* 2 TMP2TPS3 CHAR(72),           /* IKJEFTP2'S ADDITIONAL PROTECTED     01702000
*                                   SAVEAREAS USED BY TP2 TO CALL       01703000
*                                   ITS OWN PROCEDURES       @ZA97523*/ 01704000
*                                                                       01705000
* 2 TMP2T08S CHAR(72),           /* IKJEFT08'S PROTECTED SAVEAREA       01706000
*                                   USED BY T02 TO FOR LINK             01707000
*                                                            @E21D2G9*/ 01708000
*                                                                       01709000
* 2 SAVLNKN  PTR(31),               /* FOR IKJEFT08          @E21D2G9*/ 01710000
*     /*  FOR IKJEFTP2 CALLS TO IRXESTK1                     @E21D2G9*/ 01711000
* 2 TMP2STK@,                       /* PARAMETER LIST FOR IKJEFTP2      01712000
*                                      LINK TO IRXESTK1      @E21D2G9*/ 01713000
*   3 TMP2FUN@ PTR(31),             /* ADDRESS OF IRXESTK1 FUNCTION     01714000
*                                                            @E21D2G9*/ 01715000
*   3 TMP2DAT@ PTR(31),             /* ADDRESS OF POINTER TO IRXESTK1   01716000
*                                      DATA                  @E21D2G9*/ 01717000
*   3 TMP2DAL@ PTR(31),             /* ADDRESS OF IRXESTK1 DATA         01718000
*                                      LENGTH                @E21D2G9*/ 01719000
* 2 TMP2STKP,                       /* PARAMETERS FOR IKJEFTP2          01720000
*                                      LINK TO IRXESTK1      @E21D2G9*/ 01721000
*   3 TMP2FUNC FIXED(32),           /* IRXESTK1 FUNCTION     @E21D2G9*/ 01722000
*   3 TMP2DATA PTR(31),             /* STACK ELEMENT ADDRESS @E21D2G9*/ 01723000
*   3 TMP2DATL FIXED(32),           /* STACK ELEMENT LENGTH  @E21D2G9*/ 01724000
*     /*  FOR IKJEFT08 CALLS TO IRXESTK1                     @E21D2G9*/ 01725000
* 2 TMP2ST@2,                       /* PARAMETER LIST FOR IKJEFT08      01726000
*                                      LINK TO IRXESTK1      @E21D2G9*/ 01727000
*   3 TMP2FU@2 PTR(31),             /* ADDRESS OF IRXESTK1 FUNCTION     01728000
*                                                            @E21D2G9*/ 01729000
*   3 TMP2DA@2 PTR(31),             /* ADDRESS OF POINTER TO IRXESTK1   01730000
*                                      DATA                  @E21D2G9*/ 01731000
*   3 TMP2DL@2 PTR(31),             /* ADDRESS OF IRXESTK1 DATA         01732000
*                                      LENGTH                @E21D2G9*/ 01733000
* 2 TMP2ST2P,                       /* PARAMETERS FOR IKJEFT08          01734000
*                                      LINK TO IRXESTK1      @E21D2G9*/ 01735000
*   3 TMP2FUN2 FIXED(32),           /* IRXESTK1 FUNCTION     @E21D2G9*/ 01736000
*   3 TMP2DAT2 PTR(31),             /* STACK ELEMENT ADDRESS @E21D2G9*/ 01737000
*   3 TMP2DAL2 FIXED(32),           /* STACK ELEMENT LENGTH  @E21D2G9*/ 01738000
* 2 TMP2PRO1 FIXED(31),          /* FUNCTION TO BE PASSED TO IRXESTK1   01739000
*                                                            @PEI0432*/ 01740000
* 2 TMP2PRO2 FIXED(31),          /* FUNCTION TO BE PASSED TO IRXTVARS   01741000
*                                                            @PEI0432*/ 01742000
* 2 TMP2EXDP PTR(31),            /* ADDRESS OF EXECDATA TO BE PASSED    01743000
*                                   TO IRXTVARS              @PEI0432*/ 01744000
* 2 SAVLNKO FIXED(31),           /* FOR IKJEFT08             @PEI0432*/ 01745000
* 2 TMP2RSVD FIXED(32),          /* RESERVED                 @E21D2G9*/ 01746000
* 2 TMP2EDST,                    /* Storage for IKJEFT08 subrtns        01747000
*                                   TIBENQ and TIBDEQ and IKJEFTP2      01748000
*                                   subrtns TSFENQ and                  01749000
*                                   TSFDEQ:                  @PMH0057*/ 01750000
*   3 TMP2ENQR,                  /* RNAME FOR ENQUE ON                  01751000
*                                   TMP3TIBQ                 @PMH0071*/ 01752000
*     4 TMP2TCBA CHAR(4),        /* CONTAINS LITERAL CHARACTER          01753000
*                                   STRING 'TCBA'            @PMH0071*/ 01754000
*     4 TMP2T02A PTR(31),        /* ADDRESS OF ACTIVE                   01755000
*                                   IKJEFT02 TCB             @PMH0071*/ 01756000
*   3 TMP2ENDQ CHAR(16)                                                 01757000
*              BDY(WORD),        /* Area for ENQ/DEQ         @PMH0057*/ 01758000
* 2 TMP2RGQ2 PTR(31),            /* Address of the                      01759000
*                                   IKJEFTQ2 storage.        @E25D2JC*/ 01760000
* 2 TMP2DYDC PTR(31),            /* DY DCB address           @E25D2JC*/ 01761000
* 2 TMP2T01E FIXED(31),          /* T01 entry indicator      @E25D2JC*/ 01762000
* 2 TMP2T5R0 PTR(31),            /* Reg 0  save area for T05 @WA21212*/ 01763000
* 2 TMP2T5R1 PTR(31),            /* Reg 1  save area for T05 @WA21212*/ 01764000
* 2 TMP2T5RF PTR(31),            /* Reg 15 save area for T05 @WA21212*/ 01765000
* 2 TMP2T5WL PTR(32),            /* len of key1 T05 dyn area @KX00014*/ 01766000
* 2 TMP2T5W1 PTR(32),            /* addr of key1 T05 dyn area@KX00014*/ 01767000
* 2 *        CHAR(8),            /* RESERVE                  @KX00014*/ 01768000
* 2 TMP2END CHAR(0) BDY(DWORD);  /* ASSURE THAT THIS WORKAREA END IN    01769000
*                                   A DOUBLE WORD BOUNDARY. ANY         01770000
*                                   ADDITION TO WORKAREA SHOULD BE      01771000
*                                   PUT BEFORE TMP2END     @E1213F3*/   01772000
*  DCL    TMP2ET01 CONSTANT(1)                                          01773000
*                  FIXED(31),    /* Indicates that the                  01774000
*                                   IKJEFT01 entry point is             01775000
*                                   being processed.       @E25D2JC*/   01776000
*         TMP2ET1A CONSTANT(2)                                          01777000
*                  FIXED(31),    /* Indicates that the                  01778000
*                                   IKJEFT1A entry point is             01779000
*                                   being processed.       @E25D2JC*/   01780000
*         TMP2ET1B CONSTANT(3)                                          01781000
*                  FIXED(31),    /* Indicates that the                  01782000
*                                   IKJEFT1B entry point is             01783000
*                                   being processed.       @E25D2JC*/   01784000
*         TMP2ET1I CONSTANT(10)                                         01785000
*                  FIXED(31);    /* Indicates that the PWS exits are    01786000
*                                   enabled                @WA19057*/   01787000
*  DCL                           /* WHEN SETTING A MODULE IN CONTROL    01788000
*                                   FLAG, EACH MODULE WILL HAVE A       01789000
*                                   SPECIFIC BIT VALUE.  WHEN SETTING   01790000
*                                   ONE OF THESE FLAGS, ALL OTHER       01791000
*                                   MODULE FLAGS WILL BE TURNED OFF     01792000
*                                                          @E1213F3*/   01793000
*                                /* IKJEFT01'S BIT VALUE   @E1213F3*/   01794000
*         TMP2VT01 BIT(16) CONSTANT('8000'X),                           01795000
*                                /* IKJEFTSC'S BIT VALUE   @E1213F3*/   01796000
*         TMP2VTSC BIT(16) CONSTANT('4000'X),                           01797000
*                                /* IKJEFT02'S BIT VALUE   @E1213F3*/   01798000
*         TMP2VT02 BIT(16) CONSTANT('2000'X),                           01799000
*                                /* IKJEFTPV'S BIT VALUE   @E1213F3*/   01800000
*         TMP2VTPV BIT(16) CONSTANT('1000'X),                           01801000
*                                /* IKJEFT08'S BIT VALUE   @E1213F3*/   01802000
*         TMP2VT08 BIT(16) CONSTANT('0800'X);                           01803000
*@EJECT;                                                                01804000
* %IF SKIPW1^='' %THEN         /* IF NOT NULL SKIP OVER MAPPING OF      01805000
*                                 TMPWRKA1                @E1213F3*/    01806000
*  %GOTO SKIPWRK1;             /*                         @E1213F3*/    01807000
* /******************************************************************/  01808000
* /* TMPWRKA1 -- TMP PROBLEM PROGRAM STATE DYNAMIC WORK AREA        */  01809000
* /*                                                                */  01810000
* /*   THIS DYNAMIC WORK AREA IS GOTTEN FROM SUBPOOL 1, PP KEY, BY  */  01811000
* /*   IKJEFT01  DURING  TMP INITIALIZATION AND ANOTHER ONE         */  01812000
* /*   WILL BE GOTTEN IN IKJEFTSC IF A PARALLEL TMP IS NEEDED AND   */  01813000
* /*   THIS WORKAREA WILL BE FREED WHEN THE PARALLEL TMP IS FINISHED*/  01814000
* /*   WHILE THE ONE GOTTEN FOR THE NON-PARALLEL SIDE BY IKJEFT01   */  01815000
* /*   WILL NOT BE FREED UNTIL THE END OF THE TERMINAL SESSION.     */  01816000
* /*   DURING THE TMP SEVERITY 2 STAE RETRY ALL OF STORAGE IS FREED */  01817000
* /*   AND THIS WORKAREA MUST BE REINITIALIZED.                     */  01818000
* /*                                                                */  01819000
* /*   CHANGE ACTIVITY =                                            */  01820000
* /*    OZ66275 -ADD TSEVENT ISSUED FLAG                    @ZA66275*/  01821000
* /*                                                                */  01822000
* /******************************************************************/  01823000
*                                                                       01824000
* DECLARE                                                               01825000
*   1 TMPWRKA1 BASED(WRKAPTR1) BDY(DWORD),                              01826000
*                                                                       01827000
*     /* TMP-TEST DYNAMIC INTERFACE AREA                             */ 01828000
*%       TPLSLEV='2';                 /* SET TPL LEVEL TO 2          */ 01829000
*%       TPLOPT1='CONTINUE';          /* INDICATE MORE TO FOLLOW TPL */ 01830000
*%       INCLUDE SYSLIB(IKJTPL);                                        01831000
*%       DEACTIVATE TPLSLEV,TPLOPT1;                                    01832000
*                                                                       01833000
*     /* TMP COMMON VARIABLES AND WORK AREAS                         */ 01834000
*     2 TMPNECB  PTR(31),            /* ECB FOR STAI WAIT            */ 01835000
*     2 TMPCECB  PTR(31),            /* ECB FOR ATTACHED CP          */ 01836000
*     2 TMPIECB  PTR(31),            /* ECB FOR STAI POST            */ 01837000
*     2 TMPAECB  PTR(31),            /* ECB FOR ATTN POST            */ 01838000
*     2 TMPCMDWT PTR(31),            /* PTR TO CMD FROM ATTN EXIT    */ 01839000
*                                                                       01840000
*     2 TMPSWS   CHAR(4),            /* TMP INTERNAL SWITCHES        */ 01841000
*       3 TMPTEST  BIT(1),           /* TEST PROGRAM IN CONTROL      */ 01842000
*       3 TMPCMDW  BIT(1),           /* COMMAND WAITING              */ 01843000
*       3 TMPNFCMD BIT(1),           /* FIRST COMMAND IS PROCESSED   */ 01844000
*       3 TMPACTRL BIT(1),           /* TMP ATTN EXIT IS IN CONTROL  */ 01845000
*       3 TMPSCTRL BIT(1),           /* TMP STAI EXIT IS IN CONTROL  */ 01846000
*       3 ABND806  BIT(1),           /* NO-MODULE FOUND BY FETCH     */ 01847000
*       3 FRSTLAB  BIT(1),           /* 1ST LEVEL ATTACHEE ABENDED   */ 01848000
*       3 NONSCUR  BIT(1),           /* SECURITY AUTHORIZATION FAILS */ 01849000
*                                                                       01850000
*       3 ATCHNOW  BIT(1),           /* ABEND OCCURRED IN ATTACH     */ 01851000
*       3 LOADNOW  BIT(1),           /* ABEND OCCURRED IN LOAD       */ 01852000
*       3 LINKNOW  BIT(1),           /* ABEND OCCURRED IN LINK       */ 01853000
*       3 FRSTEX   BIT(1),           /* FIRST EXPL/IMPLICIT EXEC TRY */ 01854000
*       3 CALLNOW  BIT(1),           /* CALL FUNCTION ACTIVE         */ 01855000
*       3 TMP1TIME BIT(1),           /* ESTAI ENTERED (TEST) @ZTM5046*/ 01856000
*       3 T7TDONE  BIT(1),           /* TSEVENT ISSUED       @ZA66275*/ 01857000
*       3 SKPATTN  BIT(1),           /* 1-BYPASS ATTN        @ZA89253*/ 01858000
*                                                                       01859000
*       3 TMP1TSFE BIT(1),            /* ERROR OCCURRED IN CLIST        01860000
*                                       WHILE IN TSF/CLIST MODE.        01861000
*                                                            @PBY0316*/ 01862000
*       3 *        BIT(7),           /* RESERVED             @PBY0316*/ 01863000
*                                                                       01864000
*       3 CALLSWS  CHAR(1),          /* TMP-CALL INTERNAL SWITCHES   */ 01865000
*         4 PDLPRES  BIT(1),         /* PDL RETURNED BY PARSE        */ 01866000
*         4 DSOPEN   BIT(1),         /* DATA SET IS OPEN             */ 01867000
*         4 *        BIT(1),         /* RESERVED. MAPPED AND USED BY    01868000
*                                       IKJEFT08.           @PBY0316*/  01869000
*         4 BLANKB   BIT(1),         /* DATA SET NAME PROCESSED      */ 01870000
*         4 DORELS   BIT(1),         /* RELEASE PDL NOW              */ 01871000
*         4 GMBRNOW  BIT(1),         /* GET MEMBER NAME              */ 01872000
*         4 PCFDA    BIT(1),         /* PCF DIRECT ATTACH    @YA18897*/ 01873000
*         4 *        BIT(1),         /* RESERVED FLAG        @YA18897*/ 01874000
*@EJECT;                                                                01875000
*     /* RESERVED AREAS                                              */ 01876000
*     2 TMPT9ECB    BIT(32),         /* ECB USED FOR COMMUNICATION      01877000
*                                       BETWEEN IKJEFT09 AND IKJURPS    01878000
*                                                            @E24D2H3*/ 01879000
*      4 TMPT9ECW    BIT(1),         /* WAIT BIT                        01880000
*                                                            @E24D2H3*/ 01881000
*      4 TMPT9ECP    BIT(1),         /* POST BIT                        01882000
*                                                            @E24D2H3*/ 01883000
*      4 TMPT9ECC    BIT(30),        /* COMPLETION CODE                 01884000
*                                                            @E24D2H3*/ 01885000
*     2 TMPURPA     PTR(31),         /* ANCHOR FOR URP REQUEST BLOCK    01886000
*                                       CHAIN FOR IKJEFT09   @E24D2H3*/ 01887000
*     2 RESCOMM  CHAR(8),            /*                      @E24D2H3*/ 01888000
*     2 RESCOM2  CHAR(16),                                              01889000
*     2 RESCOM3  CHAR(16),                                              01890000
*     2 RESCOM4  CHAR(16),                                              01891000
*     2 *        CHAR(4),            /* RESERVED WAS FLOFLGS @ZA46174*/ 01892000
*                                                                       01893000
*% DEFPTRS:  MACRO;                                                     01894000
*   ANSWER                                                              01895000
* ('2 CPPLPTR  PTR(31),            /* PTR TO CP PARM LIST          */') 01896000
*     NORESCAN COL(7);                                                  01897000
*   ANSWER                                                              01898000
* ('2 CSOAPTR  PTR(31),            /* PTR TO CMD SCAN PARM LIST    */') 01899000
*     NORESCAN COL(7);                                                  01900000
*   ANSWER                                                              01901000
* ('2 CSPLPTR  PTR(31),            /* PTR TO CMD SCAN PARM LIST    */') 01902000
*     NORESCAN COL(7);                                                  01903000
*   ANSWER                                                              01904000
* ('2 DAPLPTR  PTR(31),            /* PTR TO DAIR PARM LIST        */') 01905000
*     NORESCAN COL(7);                                                  01906000
*   ANSWER                                                              01907000
* ('2 GTPBPTR  PTR(31),            /* PTR TO GETLINE PARM BLOCK    */') 01908000
*     NORESCAN COL(7);                                                  01909000
*   ANSWER                                                              01910000
* ('2 IOPLPTR  PTR(31),            /* PTR TO I/O RTNS PARM LIST    */') 01911000
*     NORESCAN COL(7);                                                  01912000
*   ANSWER                                                              01913000
* ('2 PGPBPTR  PTR(31),            /* PTR TO PUTGET PARM BLOCK     */') 01914000
*     NORESCAN COL(7);                                                  01915000
*   ANSWER                                                              01916000
* ('2 PPLPTR   PTR(31),            /* PTR TO PARSE PARM LIST       */') 01917000
*     NORESCAN COL(7);                                                  01918000
*   ANSWER                                                              01919000
* ('2 PTPBPTR  PTR(31),            /* PTR TO PUTLINE PARM BLOCK    */') 01920000
*     NORESCAN COL(7);                                                  01921000
*   ANSWER                                                              01922000
* ('2 STPLPTR  PTR(31),            /* PTR TO STACK PARM LIST       */') 01923000
*     NORESCAN COL(7);                                                  01924000
*%  END;                                                                01925000
*? DEFPTRS;                                                             01926000
*     2 ACEEPTR  PTR(31),            /* ADDR OF ACEE                 */ 01927000
*     2 ASCANAP  PTR(31),            /* ADDR OF ATTN SCAN ANSWER     */ 01928000
*     2 ASRPLPTR PTR(31),            /* ADDR OF ATTN SRPL            */ 01929000
*     2 ATTCHPTR PTR(31),            /* ADDR OF ATTACH PARM LIST     */ 01930000
*     2 CDCBPTR  PTR(31),            /* PTR TO CALL DCB              */ 01931000
*     2 DCBPTR   PTR(31),            /* PTR TO DCB                   */ 01932000
*     2 DYNAPPTR PTR(31),            /* PTR TO DYNALLOC PARM LIST    */ 01933000
*     2 EBCDPTR  PTR(31),            /* PTR TO TRANSLATE TABLE       */ 01934000
*     2 READYPTR PTR(31),            /* ADDR OF TMP MODE MESSAGE     */ 01935000
*     2 SCANAP   PTR(31),            /* ADDR OF SCAN ANSWER AREA     */ 01936000
*     2 SRPLPTR  PTR(31),            /* ADDR OF SRPL                 */ 01937000
*     2 *        PTR(31),            /* RESERVED             @ZA96882*/ 01938000
*     2 STPBPTR  PTR(31),            /* ADDR OF STACK PARM LIST      */ 01939000
*     2 * CHAR(4),                   /* SPACER                   @L1A*/ 01940000
*                                                                       01941000
*     /* RESERVE SPACE FOR PARAMETER LISTS, BLOCKS                   */ 01942000
*     2 ABMSGSP CHAR(LENGTH(ABMSGAR)) BDY(DWORD),  /* MESSAGE AREA   */ 01943000
*     2 * CHAR(3),                   /* SPACER                   @L1A*/ 01944000
*     /* PUTLINE ACTIVE SEGMENT LIST    LIST                         */ 01945000
*     2 ACTSL  CHAR(112) BDY(WORD),  /* NAME OF LIST                 */ 01946000
*       3 ACTSEG (28) PTR(32),       /* SEGMENTS                     */ 01947000
*         4 ACTSEGA   PTR(16),       /* FIRST HWORD OF SEGMENT       */ 01948000
*         4 ACTSEGB   PTR(16),       /* SECOND HWORD OF SEGMENT      */ 01949000
*     2 AMSGLIST,                    /* ATTN MESSAGE LIST            */ 01950000
*       3 ANUMSEG  FIXED(31),        /* NUMBER OF MESSAGE SEGMENTS   */ 01951000
*       3 AMSGSEG(2) PTR(31),        /* ARRAY OF SEGMENT PTRS        */ 01952000
*     2 ARCODE   PTR(31),            /* ATTN RETURN CODE SAVE AREA   */ 01953000
*     2 ASCANFLG FIXED(31),          /* ATTN SCAN FLAGS              */ 01954000
*     2 ASRPARM  CHAR(20) BDY(WORD), /* ATTN SR PARM AREA            */ 01955000
*     2 ATTCHSP CHAR(LENGTH(ATTCHLST)) BDY(WORD),  /* ATTACH PL SP   */ 01956000
*     2 BLDLLST  CHAR(68) BDY(WORD), /* BLDL ENTRY                   */ 01957000
*       3 XTRCLST  CHAR(12) BDY(WORD),  /* EXTRACT LIST              */ 01958000
*         4 BLDLENT  FIXED(15),      /* NUM OF ENTRIES               */ 01959000
*         4 BLDLELNG FIXED(15),      /* LENGTH OF ENTRY              */ 01960000
*         4 BLDLNAME CHAR(8),        /* NAME OF COMMAND              */ 01961000
*       3 BLDLTTRZ CHAR(56),         /* PAD TO FULL WORD   @ZA40795 */  01962000
*         4 BLDLTMP_TT  CHAR(2),     /* TT (relative track) returned    01962200
*                                       from BLDL           @WA36096*/  01962400
*         4 BLDLTMP_R   CHAR(1),     /* R (record number) returned      01962600
*                                       from BLDL           @WA36096*/  01962800
*@EJECT;                                                                01963000
*     2 CDCBSP  CHAR(140) BDY(DWORD),  /* CALL DCB SPACE             */ 01964000
*     2 CLOSESP CHAR(12) BDY(WORD),  /* CLOSE PL SPACE               */ 01965000
*     2 CPPLSP  CHAR(LENGTH(CPPL)) BDY(WORD),  /* CPPL SPACE         */ 01966000
*     2 CSOASP  CHAR(LENGTH(CSOA)) BDY(WORD),  /* CSOA SPACE         */ 01967000
*     2 CSOASP2 CHAR(LENGTH(CSOA)) BDY(WORD),  /* 2ND CSOA SP (ATTN) */ 01968000
*     2 CSPLSP  CHAR(LENGTH(CSPL)) BDY(WORD),  /* CSPL SPACE         */ 01969000
*     2 CSPLSP2 CHAR(LENGTH(CSPL)) BDY(WORD),  /* 2ND CSPL SP (ATTN) */ 01970000
*     2 CTLBKSP  BDY(WORD),          /* NAME OF BLOCK SPACE          */ 01971000
*       3 CTLBLKL  PTR(32),          /* LENGTH OF BLOCK SPACE        */ 01972000
*       3 CTLBLKA  PTR(31),          /* LOC OF BLOCK SPACE           */ 01973000
*       3 CTLBLKN  PTR(31),          /* SUBPOOL                      */ 01974000
*     2 DAPBSP  CHAR(LENGTH(DAPB08)) BDY(WORD),  /* DAIR PARM BLK SP */ 01975000
*     2 DAPLSP  CHAR(LENGTH(DAPL)) BDY(WORD),  /* DAIR PL SPACE      */ 01976000
*     2 * CHAR(4),                     /* SPACER                 @L1A*/ 01977000
*     2 DCBSP   CHAR(140) BDY(DWORD),  /* DCB SPACE                  */ 01978000
*     2 DYNASP  CHAR(LENGTH(DYNAPARM))  BDY(WORD), /* DYNALLOC PL SP */ 01979000
*     2 DYNATUB BIT(32) BDY(WORD),     /* BIT FORM OF THE PLATFORM      01980000
*                                         TCB ADDRESS USED SO THAT      01981000
*                                         THE ADDRESS, NORMALLY ON A    01982000
*                                         WORD BOUNDARY, CAN BE COPIED  01983000
*                                         INTO THE TEXT UNIT PARM       01984000
*                                         THAT'S ON A HALFWORD          01985000
*                                         BOUNDARY.         @PID0180 */ 01986000
*     2 ECTSP   CHAR(LENGTH(ECT))  BDY(WORD),  /* ECT SPACE          */ 01987000
*     2 FMLCSP  CHAR(10) BDY(WORD),  /* FREEM PL SPACE               */ 01988000
*     2 * CHAR(2),                     /* SPACER                 @L1A*/ 01989000
*     2 GTPBSP  CHAR(LENGTH(GTPB)) BDY(WORD),  /* GTPB SPACE         */ 01990000
*     2 MODESSP CHAR(4) BDY(WORD),  /* MODESET PARM LIST SPACE       */ 01991000
*     2 NXTCMD  CHAR(8) BDY(WORD),   /* COMMAND NAME FIELD           */ 01992000
*     2 OPENSP  CHAR(12) BDY(WORD),  /* OPEN PL SPACE                */ 01993000
*     2 PGPBSP  CHAR(LENGTH(PGPB)) BDY(WORD),  /* PGPB SPACE         */ 01994000
*     2 PPLSP   CHAR(28) BDY(WORD),       /* PARSE PL SPACE  @PBY0271*/ 01995000
*     2 PRSMSSP CHAR(LENGTH(PRSMAR)) BDY(WORD),  /* MESSAGE AREA     */ 01996000
*     2 PTPBSP  CHAR(LENGTH(PTPB)) BDY(WORD),  /* PTPB SPACE         */ 01997000
*     2 RCODE    PTR(31),            /* RETURN CODE SAVE AREA        */ 01998000
*     2 R3SAVE   PTR(31),            /* SAVE PDL PTR                 */ 01999000
*     2 SAVAR    (14) PTR(32),       /* SAVE REGISTER ENVIRONMENT    */ 02000000
*     2 SCANFLG  FIXED(31),          /* SCAN FLAGS                   */ 02001000
*     2 SNAPSP  CHAR(40) BDY(WORD),  /* SNAP PL SPACE                */ 02002000
*     2 STPBSP  CHAR(LENGTH(STPB)) BDY(WORD),      /* STPB SPACE     */ 02003000
*     2 STPLSP  CHAR(LENGTH(STPL)) BDY(WORD),  /* STACK PL SPACE     */ 02004000
*     2 TMPZEROS FIXED(31),          /* ALL ZEROS WORD - DUMMY CBUF  */ 02005000
*     2 MODEMSP CHAR(20) BDY(WORD),  /* DUMMY SPACE FOR MODE MESSAGE */ 02006000
*     2 *       CHAR(20) BDY(WORD),  /* RESERVED                     */ 02007000
*@EJECT;                                                                02008000
*     /* WORK AREA FOR TMP-CALL FUNCTION                             */ 02009000
*     2 CALLWA  BDY(WORD),                                              02010000
*       /* PROBLEM PROGRAM WORK AREA FOR CALL FUNCTION               */ 02011000
*       3 PPWORKAR,                                                     02012000
*         4 PPLIST  BDY(WORD),                                          02013000
*           5 SWBIT  CHAR(1),                                           02014000
*           5 *      CHAR(3),                                           02015000
*         4 PARMFLD  BDY(WORD),                                         02016000
*           5 LENPARM  FIXED(15),                                       02017000
*           5 PARMS    CHAR(100),                                       02018000
*           5 * CHAR(2),               /* SPACER                 @L1A*/ 02019000
*                                                                       02020000
*       /* CALL INTERNAL WORK AREA                                   */ 02021000
*       3 WORK1,                                                        02022000
*         4 PARSPARM,                /* PARSE PARMS                  */ 02023000
*           5 PDLADDR  PTR(31),      /* PTR TO PARM DESCRIPTOR LIST  */ 02024000
*           5 PDLADDR2  PTR(31),                                        02025000
*         4 DSNBUFFR CHAR(48) BOUNDARY(HWORD),                          02026000
*           5 DSNLENG  FIXED(15),    /* LENGTH OF DATA SET NAME      */ 02027000
*           5 DSNBUF   CHAR(44),     /* DSNAME                       */ 02028000
*           5 *        CHAR(2),      /* ALIGNMENT                    */ 02029000
*       3 MSGNO    FIXED(31),        /* MESSAGE NUMBER               */ 02030000
*       3 DAPB0PTR PTR(31),                                             02031000
*                                                                       02032000
*       /* MEMBER NAME SEGMENT FOR MESSAGE                           */ 02033000
*       3 MBRSEG CHAR(12) BDY(WORD), /* NAME OF AREA                 */ 02034000
*         4 MBRSLEN  PTR(15),        /* SEGMENT LENGTH               */ 02035000
*         4 MBRSOFF  PTR(15),        /* SEGMENT OFFSET               */ 02036000
*         4 MBRSTXT  CHAR(8),        /* MEMBER NAME TEXT             */ 02037000
*                                                                       02038000
*       /* MEMBER NAME SEGMENT FOR DAIR                              */ 02039000
*       3 MBRDSEG CHAR(12) BDY(WORD),  /* NAME OF AREA               */ 02040000
*         4 MBRDLEN  PTR(15),        /* SEGMENT LENGTH               */ 02041000
*         4 MBRDTXT  CHAR(8),        /* NAME TEXT                    */ 02042000
*         4 * CHAR(2),                 /* SPACER                 @L1A*/ 02043000
*                                                                       02044000
*       /* DATA SET NAME SEGMENT FOR MESSAGE                         */ 02045000
*       3 DSSEG CHAR(48) BDY(WORD),  /* NAME OF AREA                 */ 02046000
*         4 DSSGLEN  PTR(15),        /* SEGMENT LENGTH               */ 02047000
*         4 DSSGOFF  PTR(15),        /* SEGMENT OFFSET               */ 02048000
*         4 DSSGTXT  CHAR(44),       /* DATA SET NAME TEXT           */ 02049000
*                                                                       02050000
*       /* RETURN CODE RESERVE AREAS                                 */ 02051000
*       3 BLDLRC  PTR(32),     /* FOR BLDL RETURN CODE               */ 02052000
*       3 DAIRRC  PTR(32),     /* FOR DAIR RETURN CODE               */ 02053000
*       3 PUTLRC  PTR(32),     /* FOR PUTLINE RETURN CODE            */ 02054000
*       3 CRCODE  PTR(32),     /* FOR GENERAL CALL RETURN CODE       */ 02055000
*       /* TMP RE-STRUCTURE WORK AREAS                     @ZA40795 */  02056000
*    2 TMPCTCB PTR(31),              /* PTR TO ATTCH CP TCB@ZA40795 */  02057000
*    2 TMPTECB FIXED(31),         /* TEST COMPLETE ECB     @ZA40795 */  02058000
*    2 TMPECB2 FIXED(31),         /* IKJEFTXX EOT ECB      @ZA40795 */  02059000
*    2 CPABECB FIXED(31),         /* TEST RQST AFTER ABEND @ZA40795 */  02060000
*    2 ECBLPTR PTR(31),           /* PTR ECB WAIT LISTS    @ZA40795 */  02061000
*    2 TMPECBL2,                  /*                       @ZA40795 */  02062000
*     3 TMPCECB2 PTR(31),         /* PTR TO ATTCH CP ECB   @ZA40795 */  02063000
*     3 TMPIECB2 PTR(31),         /* PTR TO TMP STAI ECB   @ZA40795 */  02064000
*     3 TMPAECB2 PTR(31),         /* PTR TO TMP ATTN ECB   @ZA40795 */  02065000
*    2 TMPECBAT PTR(31),          /* ATTN ECB              @E2367S4 */  02066000
*    2 TMPSCECB,                  /* ECB USED BY IKJATTN ROUTINE IN     02067000
*                                    IKJEFTSC TO WAIT FOR IKJEFT03      02068000
*                                    TO PROCESS THE ATTENTION. IT IS    02069000
*                                    POSTED BY IKJEFT03 NORMALLY AND    02070000
*                                    IKJEFT05 IF WAITING AT ABEND       02071000
*                                                          @ZA91237*/   02072000
*      3 TMPSWAIT BIT(1),        /* CHECKED BY IKJEFT03 AND             02073000
*                                   IKJEFT05               @ZA91237*/   02074000
*      3 * BIT(31),              /* POST AND COMPLETION CODE            02075000
*                                                          @ZA91237*/   02076000
*    2 TMP1ECB2,                 /* ECB INDICATING END OF T02 PROCESS   02077000
*                                                          @E1213F3*/   02078000
*      3 * BIT(1),               /* ECB WAIT BIT           @E1213F3*/   02079000
*      3 TP1ECB2P BIT(1),        /* ECB POST BIT          @E1213F3*/    02080000
*      3 * BIT(30),              /* ECB COMPLETION CODE    @E1213F3*/   02081000
*    2  *       FIXED(31),      /* RESERVED                @ZTY0011*/   02082000
*    2 TMPR15RC FIXED(31),      /* R15 RC FROM CP          @E121324*/   02083000
*    2 TMP1RSNC FIXED(31),    /* REASON CODE WHEN CP ABEND @E1213F3*/   02084000
*    2 TMP1ABNC FIXED(31),    /* ABEND CODE WHEN CP ABEND  @E1213F3*/   02085000
*    2 TMP1NAME CHAR(8),      /* NAME OF TMPWRKA1          @E1213F3*/   02086000
*    2 TMP1LEV  CHAR(4),      /* LEVEL OF TMPWRKA1         @E1213F3*/   02087000
*    2 TMPECBL3,                  /*                       @E2367S4*/   02088000
*     3 TMPTECB3 PTR(31),         /* PTR TO TEST FINIS ECB @E2367S4*/   02089000
*     3 TMPCECB3 PTR(31),         /* PTR TO ATTACH CP ECB  @E2367S4*/   02090000
*     3 TMPAECB3 PTR(31),         /* PTR TO TMP ATTN ECB   @E2367S4*/   02091000
*    2 TMP1TQ2S  CHAR(72) BDY(WORD), /* Savearea for functions that     02092000
*                                    IKJEFTQ2 invokes.     @E25D2JC*/   02093000
*    2 TMP1CDCA PTR(31),       /* Address of DCB for CALL command to    02094000
*                                 use or 0 for LINKLIST request         02095000
*                                                              @L1A*/   02096000
*    2 *        CHAR(36),     /* RESERVE                   @PID0180*/   02097000
*    2 TMP1END  CHAR(0) BDY(DWORD);  /* ASSURE THAT THIS WORKAREA END   02098000
*                                   IN A DOUBLE WORD BOUNDARY. ANY      02099000
*                                   ADDITION TO WORKAREA SHOULD BE      02100000
*                                   PUT BEFORE TMP1END     @E1213F3*/   02101000
*@EJECT;                                                                02102000
*    DECLARE                                                            02103000
*     1 MULTLLST  DEFINED(ACTSL),    /* MULTILEVEL MESSAGE LIST      */ 02104000
*       2 MSGLCHP  PTR(31),          /* CHAIN PTR TO 2ND MSG LIST    */ 02105000
*       2 MSGLIST,                   /* FIRST MESSAGE LIST           */ 02106000
*         3 NUMSEG   FIXED(31),      /* NO. OF MESSAGE SEGMENTS      */ 02107000
*         3 MSGSEG(3) PTR(31),       /* ARRAY OF SEGMENT PTRS        */ 02108000
*       2 SECLLIST,                  /* 2ND LEVEL MSG LIST           */ 02109000
*         3 SMSGLCHP PTR(31),        /* LAST CHAIN PTR               */ 02110000
*         3 SNUMSEG  FIXED(31),      /* NO. OF MESSAGE SEGMENTS      */ 02111000
*         3 SMSGSEG(3) PTR(31);      /* ARRAY OF SEGMENT PTRS        */ 02112000
*                                                                       02113000
* DECLARE                                                               02114000
*   /* STAX PARAMETER LIST SPACE                                     */ 02115000
*   STAXSP  CHAR(256) BASED(STAXPPTR);                                  02116000
*                                                                       02117000
* DECLARE                                                               02118000
*   /* MODE MESSAGE IMAGE                                            */ 02119000
*   MODEMSG  CHAR(256) BASED(READYPTR);                                 02120000
*@EJECT;                                                                02121000
*                                                                       02122000
* DECLARE                                                               02123000
*   /* ABEND EXIT PARM AREA -- SUBPOOL 0, PP KEY, WORK AREA  GOTTEN  */ 02124000
*   /*   IN  IKJEFT01 (TMP INITIALIZATION)  AND  USED BY  IKJEFT04   */ 02125000
*   /*   (STAI EXIT), IKJEFT05 (STAE EXIT) AND IKJEFT07 (STAE RETRY) */ 02126000
*   /*   DURING TMP/SUBTASK LEVEL ABEND HANDLING                     */ 02127000
*                                                                       02128000
*   1 TMPWA2 BASED(TMPWA2P),                                            02129000
*                                                                       02130000
*     2 TMPWA2A    BDY(WORD),        /* NAME OF AREA                 */ 02131000
*       3 SVT040A CHAR(72) BDY(WORD),  /* LINKAGE SAVE AREA -- CHARS */ 02132000
*         4 SAVT040  (18) PTR(32),   /*   -- AS POINTERS             */ 02133000
*       3 SVT041A CHAR(72) BDY(WORD),  /* LINKAGE SAVE AREA -- CHARS */ 02134000
*         4 SAVT041  (18) PTR(32),   /*   -- AS POINTERS             */ 02135000
*       3 SVT042A CHAR(72) BDY(WORD),  /* LINKAGE SAVE AREA -- CHARS */ 02136000
*         4 SAVT042  (18) PTR(32),   /*   -- AS POINTERS             */ 02137000
*       3 STYNQWA   BDY(WORD),       /* NAME OF ENQ WORK AREA        */ 02138000
*         4 STYNQLA  CHAR(LENGTH(STYDQL)) BDY(WORD), /* PL AREA      */ 02139000
*         4 MINQNAM  CHAR(8),        /* ENQ MINOR NAME AREA          */ 02140000
*       3 *         CHAR(12),        /* RESERVED                     */ 02141000
*     2 TMPWA2B   BDY(WORD),         /* NAME OF AREA                 */ 02142000
*       3 REG14SAV  PTR(32),         /* TEMPORARY SAVE AREA          */ 02143000
*       3 GMRETC    PTR(32),         /* TEMPORARY SAVE AREA          */ 02144000
*       3 RETRYFLG CHAR(1),          /* TMP RETRY FLAGS              */ 02145000
*         4 TMPRINIT BIT(1),         /* REINITIALIZATION IN PROCESS  */ 02146000
*         4 TMPRTRY  BIT(1),         /* RETRY IN PROCESS             */ 02147000
*       3 *        CHAR(3),          /* RESERVED                     */ 02148000
*       3 GMLNG5  PTR(32),           /* LENGTH OF GETMAIN AREA       */ 02149000
*       3 GMLOC5  PTR(32),           /* LOCATION OF GETMAIN AREA     */ 02150000
*       3 TMPT04F CHAR(1),           /* FLAG FOR IKJEFT04    @ZA89253*/ 02151000
*         4 TWA2POST BIT(1),         /* 1-POST 0-DO NOT POST @ZA89253*/ 02152000
*         4 TWA2CONT BIT(1),         /* 1-CONTINUE 0-GET OUT @ZA89253*/ 02153000
*         4 TMPATTCH BIT(1),         /* 1-TMP ATTACH ABEND   @YA40214*/ 02154000
*       3 *        CHAR(3),          /* RESERVED             @ZA89253*/ 02155000
*       3 TWA2SARB PTR(31),          /* SAVE ADDRESS OF RB   @ZA89253*/ 02156000
*       3 SECNBASE PTR(31),          /* SECOND BASE REGISTER            02157000
*                                       FOR STAI PROCESSING  @YA40214*/ 02158000
*       3 NAMEFCDE CHAR(8),          /* NAME FROM THE CDE    @YA40214*/ 02159000
*         4 NAMESIX CHAR(6),         /* FIRST SIX CHARACTERS @YA40214*/ 02160000
*         4 *       CHAR(2),         /* LAST TWO CHARACTERS  @YA40214*/ 02161000
*       3 *        CHAR(12),         /* RESERVED             @YA40214*/ 02162000
*                                                                       02163000
*                                                                       02164000
*                                                                       02165000
*   /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02166000
*                                                                       02167000
*   /* COMMAND BUFFER --                                             */ 02168000
*   1 CBUF BASED(TPLCBUF) BDY(WORD),                                    02169000
*     2 CBUFLNG  FIXED(15),          /* TOTAL LENGTH OF CBUF         */ 02170000
*     2 CBUFOFF  FIXED(15),          /* CURRENT DATA FIELD OFFSET    */ 02171000
*     2 CBUFDATA CHAR(256),          /* VAR LENGTH DATA FIELD        */ 02172000
*                                                                       02173000
*   /* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 02174000
*                                                                       02175000
*   /* STAI MESSAGE ROUTINE PARAMETER AREA -- SUBPOOL 1, PP KEY AREA */ 02176000
*   /*   GOTTEN IN IKJEFT04 (STAI EXIT) AND USED BY TMP AND TEST     */ 02177000
*   1 STRTPARM BASED(TMPIECB),                                          02178000
*     2 STRTPTR PTR(31),             /* ADDR OF STAI MESSAGE RTN     */ 02179000
*     2 STRTTMPA PTR(31),            /* ADDR OF TMP MAIN WORK AREA   */ 02180000
*     2 STRTBASE PTR(31),            /* BASE REGISTER FOR STAI       */ 02181000
*     2 STRTDYNA PTR(31);            /* ADDR OF STAI DYNAMIC STORAGE */ 02182000
*%SKIPWRK1:   ;                      /*                    @E1213F3*/   02183000
*                                                                       02184000
