*        %GOTO R1BCBSL;       /* BILINGUAL MAPPING                              
         MACRO                                                                  
         IKJZT301  &DSECT=YES                                                   
*        IKJZT301                                                               
***********************************************************************         
***********************************************************************         
*                                                                     *         
*                         SYS1.BRODCAST DATA SET                      *         
*                                RECORD 1                             *         
*                                                                     *         
*                                                                     *         
*   COPYRIGHT =                                                       *         
*            5685-025 COPYRIGHT IBM CORP. 1981, 1984,                 *         
*            THIS PRODUCT CONTAINS RESTRICTED MATERIALS OF IBM,       *         
*            REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083    *         
*                                                             @E1213F2*         
*                                                                     *         
*   STATUS = JBB1213 TSO/E                06/01/84                    *         
*                                                             @E1213F2*         
*                                                                     *         
*        THE FIRST RECORD OF THE SYS1.BRODCAST DATA SET (R1BC) HAS    *         
*        POINTERS TO THE NOTICES AND MAIL SECTIONS, AND OTHER INFO    *         
*        CONCERNING THE DATA SET.                                     *         
*                                                                     *         
***********************************************************************         
***********************************************************************         
         AIF   ('&DSECT' EQ 'NO').NODSECT                                       
R1BC     DSECT , -            RECORD 1 OF SYS1.BRODCAST DATA SET                
         AGO   .SKIP                                                            
.NODSECT ANOP                                                                   
R1BC     DS    0F -           RECORD 1 OF SYS1.BRODCAST DATA SET                
.SKIP    ANOP                                                                   
R1BCPTRP DS    0A -           SAME AS R1BCPTR BELOW                             
R1BCFLGS DS    B -            NOTICES FLAGS - NOT USED                          
R1BCPTR  DS    AL3 -          RELATIVE BLOCK ADDRESS (RBA) OF FIRST             
*                               NOTICES DIRECTORY RECORD                        
R1USPTRP DS    0A -           SAME AS R1USPTR BELOW                             
R1USFLGS DS    B -            USER MAIL FLAGS - NOT USED                        
R1USPTR  DS    AL3 -          RBA OF FIRST USER MAIL DIRECTORY RECORD           
R1RECNUM DS    F -            TOTAL NO. OF RECORDS IN SYS1.BRODCAST DS          
R1BCMAX  DS    H -            MAXIMUM BRODCAST MSG NO. -                        
*                               FROM MASTER SCHEDULER BASEA, BABCMAX            
*                                                                     *         
R1DSN    DS    CL24 -         DATA SET NAME IN EBCDIC =                         
*                               ' SYS1.BRODCAST DATA SET '                      
R1LEVEL  DS    CL7 -          LEVEL NO. = 'LEVEL N', WHERE 'N' IS               
*                               A 1-DIGIT NUMBER                                
         DS    CL1            RESERVED                         @E1113KS         
R1FRESRH DS    CL3            RBA OF FREE SEARCH RECORD        @E1113KS         
R1GENNUM DS    F              GENERATION NUMBER FOR IN-STORAGE                  
*                               NOTICE TABLE                   @E1213F2         
         DS    CL76 -         RESERVED                         @E1213F2         
         MEND  , */                                                             
*%R1BCBSL : ;                                                                   
* /*     IKJZT301                                                    */         
*DECLARE                                                                        
*  1 R1BC     BASED(R1PTR),              /* RECORD 1 SYS1.BRODCAST DS*/         
* /*******************************************************************/         
* /*******************************************************************/         
* /*                                                                 */         
* /*                       SYS1.BRODCAST DATA SET                    */         
* /*                             RECORD 1                            */         
* /*                                                                 */         
* /* COPYRIGHT =                                                     */         
* /*         5685-025 COPYRIGHT IBM CORP. 1981, 1984,                */         
* /*         THIS PRODUCT CONTAINS RESTRICTED MATERIALS OF IBM,      */         
* /*         REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083   */         
* /*                                                         @E1213F2*/         
* /*                                                                 */         
* /* STATUS = JBB1213 TSO/E                06/01/84                  */         
* /*                                                         @E1213F2*/         
* /*                                                                 */         
* /*     THE FIRST RECORD OF THE SYS1.BRODCAST DATA SET (R1BC) HAS   */         
* /*     POINTERS TO THE NOTICES AND MAIL SECTIONS, AND OTHER INFO   */         
* /*     CONCERNING THE DATA SET.                                    */         
* /*                                                                 */         
* /*******************************************************************/         
* /*******************************************************************/         
*   3 R1BCPTRP PTR(31),                  /* SAME AS R1BCPTR BELOW    */         
*    4 R1BCFLGS BIT(8),                  /* NOTICES FLAGS - NOT USED */         
*    4 R1BCPTR  PTR(24),                 /* RELATIVE BLOCK ADDR (RBA)           
*                                            FIRST NOTICES DIRECTORY            
*                                            RCD                     */         
*   3 R1USPTRP PTR(31),                  /* SAME AS R1USPTR BELOW    */         
*    4 R1USFLGS BIT(8),                  /* USER MAIL FLAGS- NOT USED*/         
*    4 R1USPTR  PTR(24),                 /* RBA OF FIRST USER MAIL              
*                                            DIRECTORY RECORD        */         
*   3 R1RECNUM FIXED(31),                /* TOTAL NO. OF RECORDS IN             
*                                            SYS1.BRODCAST DATA SET  */         
*   3 R1BCMAX  FIXED(15),                /* MAXIMUM BRODCAST MSG NO.-           
*                                            FROM MASTER SCHED BASEA */         
*   3 R1DSN    CHAR(24),                 /* DATA SET NAME IN EBCDIC =           
*                                          ' SYS1.BRODCAST DATA SET '*/         
*   3 R1LEVEL  CHAR(7),                  /* LEVEL NO.= 'LEVEL N', WHERE         
*                                           'N' IS A 1-DIGIT NUMBER  */         
*   3 *        CHAR(1),                  /* RESERVED         @E1113KS*/         
*   3 R1FRESRH CHAR(3),                  /* RBA TO START FREE RECORD            
*                                           SEARCH AT        @E1113KS*/         
*   3 R1GENNUM FIXED(31),                /* GENERATION NUMBER FOR IN-           
*                                           STORAGE NOTICE TABLE                
*                                                            @E1213F2*/         
*   3 *        CHAR(76);                 /* RESERVED         @E1213F2*/         
