*   %GOTO TVWAPLS1;                 /* SKIP ASSEMBLER CODE              00050000
         MACRO                                                          00100000
         IKTTVWA ,                                                      00150000
TVWA     DSECT ,                                                     */ 00200000
*%TVWAPLS1:                         /* COMMON SOURCE                 */ 00250000
*   ;                                                                   00300000
*/********************************************************************/ 00350000
*/*                                                                  */ 00400000
*/* TITLE:                                                           */ 00450000
*/*      IKTTVWA                                                     */ 00500000
*/*                                                                  */ 00550000
*/* DESCRIPTION:                                                     */ 00600000
*/*      TSO/VTAM WORK AREA.                                         */ 00650000
*/*                                                                  */ 00700000
*/* COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                  */ 00850000
*/*                                                                  */ 00900000
*/*            THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"   */ 00950000
*/*                                                                  */ 01000000
*/*            5685-085 (C) COPYRIGHT IBM CORP. 1991                 */ 01050000
*/*            ALL RIGHTS RESERVED.                                  */ 01100000
*/*                                                                  */ 01150000
*/*            U.S. GOVERNMENT USERS RESTRICTED RIGHTS -             */ 01200000
*/*            USE, DUPLICATION OR DISCLOSURE RESTRICTED BY          */ 01250000
*/*            GSA ADP SCHEDULE CONTRACT WITH IBM CORP.              */ 01300000
*/*                                                                  */ 01350000
*/*            SEE COPYRIGHT INSTRUCTIONS.                           */ 01400000
*/*                                                                  */ 01450000
*/* ASSEMBLER INVOCATION:                                            */ 01500000
*/*      L     REG,TSBXTVWA            ADDRESS OF TVWA               */ 01550000
*/*      USING TVWA,REG                BASING STATEMENT              */ 01600000
*/*                                                                  */ 01650000
*/*      IKTTVWA ,                     NO PARAMETERS REQUIRED        */ 01700000
*/*                                                                  */ 01750000
*/* PLS INVOCATION:                                                  */ 01800000
*/*      %INCLUDE SYSLIB(IKTTVWA)                                    */ 01850000
*/*      RFY                                                         */ 01900000
*/*        TVWA BASED(TVWAPTR)         DEFAULT BASING                */ 01950000
*/*      TVWAPTR=TSBXTVWA              ESTABLISH ADDRESSABILITY      */ 02000000
*/*                                                                  */ 02050000
*/* NOTES:                                                           */ 02100000
*/*      THE TSO/VTAM WORK AREA (TVWA) CONTAINS POINTERS TO          */ 02150000
*/*      WORK AREAS, CONTROL BLOCKS, AND TSO/VTAM CONTROL FLAGS.     */ 02200000
*/*                                                                  */ 02250000
*/*      THERE IS ONE TVWA FOR EACH TSO/VTAM USER.                   */ 02300000
*/*                                                                  */ 02350000
*/* REVISIONS:                                                       */ 02400000
*/*      FIRST RELEASE OS/VS2 SU13                                   */ 02450000
*/*      FULL SCREEN SUPPORT                        @YM03254,@ZA11997*/ 02500000
*/*      PERFORMANCE                                         @ZA12002*/ 02550000
*/*      SBA TRACKING                                        @ZA19883*/ 02600000
*/*      IWAIT SYSEVENT REQUEST                              @ZA24418*/ 02650000
*/*      IKTIOFRR RECURSION                                  @ZA34957*/ 02700000
*/*      END OF USER SESSION                                 @ZA36205*/ 02750000
*/*      SAVE COLUMN COUNT FOR INPUT                         @ZA42544*/ 02800000
*/*      ADD TVWACRRQ TO INDICATE CARRIAGE RETURN REQUIRED   @ZA46431*/ 02850000
*/*      ADD TVWATGNO TO INDICATE TGET NOWAIT WAS ISSUED     @AZ53450*/ 02900000
*/*      ADD TVWAWO TO INDICATE FULLSCREEN WAS WRITTEN OVER  @AZ63956*/ 02950000
*/*      DATA AREA REWORK - 06/21/85                         @R496308*/ 03000000
*/*      DOUBLE BYTE CHARACTER SUPPORT                       @R506200*/ 03050000
*/*      ADD TVWASKTR FOR NUMBER OF BYTES TO SKIP            @OY10339*/ 03100000
*/*      USER REPLACEMENT EDIT TABLE                         @P054529*/ 03150000
*/*                                                                  */ 03200000
*/* $MAC(IKTTVWA),COMP(TSO/VTAM),PROD(VTAM): TSO/VTAM WORK AREA      */ 03250000
*/*                                                                  */ 03300000
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */ 03350000
*/* ---- -------- ------- ------ ------  --------------------------- */ 03400000
*/* $01= OY32045  VM330   900607 706351: KEYBOARD LOCKED INVALIDLY   */ 03450000
*/* $02= OY37177  HVT3401 901120 706351: CINIT FAILS FOR TSO LOGON   */ 03500000
*/*                                      RECONNECT AFTER             */ 03550000
*/*                                      UNCONDITIONAL LOGOFF        */ 03600000
*/* $03= OY40110  HVT3401 910228 706351: HUNG TSO SESSION AFTER NULL */ 03650000
*/*                                      RU WITH THE CHANGE DIRECTION*/ 03700000
*/*                                      WAS SENT                    */ 03750000
*/* $04= OY45872  HVT3411 910903 445383: INCLUDED * FOR THE FIELD    */ 03800000
*/*                                      AFTER TVWANORS              */ 03850000
*/* $05= OY56782  HATAPPN 920916 062811: HUNG TERMINAL DUE TO RESHOW */ 03900000
*/*                                      CONDITION DURING FULLSCREEN */ 03950000
*/*                                      INITIALIZATION.             */ 04000000
*/* $06= OY59014  HATAPPN 930118 450697: ABEND0AB RC103 RPL RTNCODE  */ 04050000
*/*                                      0800 - TEMPORARY STORAGE    */ 04100000
*/*                                      SHORTAGE                    */ 04150000
*/* $07= OY66225  EMERALD 930917 358168: ADD TVWAABUF - HIGH BUFFER  */ 04200000
*/*                                      THRESHOLD FOR ASID TPUT     */ 04250000
*/* $08= OY67126  EMERALD 931028 358168: ADD OUTPUT BUFFER NUMBER    */ 04300000
*/* $S1= P125213  INDY    961206 633061: Cloning Enhancments         */ 04325000
*/*                                                                  */ 04350000
*/********************************************************************/ 04400000
*   %GOTO TVWAPLS2;                 /* SKIP ASSEMBLER CODE              04450000
TVWAPPL  DS    CL8                     TSO USER APPLID                  04500000
         SPACE                                                          04550000
**                                                                      04600000
**       TIM/TOM AREA VECTORS                                           04650000
**                                                                      04700000
TVWATIMW DS    A                       POINTER TO TIM WORK AREA         04750000
TVWATOMW DS    A                       POINTER TO TOM WORK AREA         04800000
TVWALLWA DS    A                       POINTER TO WORK AREA FOR         04850000
*                                      LOCALLY LOCKED ROUTINES.         04900000
         SPACE                                                          04950000
**                                                                      05000000
**       QUEUE MANAGER AREA                                             05050000
**                                                                      05100000
TVWAQMWA DS    A                       A(WORK AREA FOR QUEUE MANAGER    05150000
*                                      AND IKTVTGTF)         @G98EK3A   05200000
TVWABIQ  DS    A                       A(BEGINNING OF INPUT QUEUE)      05250000
TVWANIM  DS    A                       A(NEXT INPUT MESSAGE)            05300000
TVWAEIQ  DS    A                       A(END OF INPUT QUEUE)            05350000
         SPACE                                                          05400000
TVWABOQ  DS    A                       A(BEGINNING OF OUTPUT QUEUE)     05450000
TVWANOM  DS    A                       A(NEXT OUTPUT MESSAGE)           05500000
TVWAEOQ  DS    A                       A(END OF OUTPUT QUEUE)           05550000
         SPACE                                                          05600000
TVWACPID DS    CL4                     CELL POOL IDENTIFIER             05650000
TVWARECB DS    F                       POSTED BY IKTNSXIT FOR IKTLOGR   05700000
*                                                              @R488200 05750000
         SPACE                                                          05800000
TVWAUSMN DS    F                       AMOUNT OF MAIN STORAGE           05850000
*                                      USED FOR TPUTS                   05900000
TVWATCB  DS    A                       A(TASK CONTROL BLOCK)            05950000
         SPACE                                                          06000000
**                                                                      06050000
**       PARMLIB VALUES FIXED PER SESSION                               06100000
**                                                                      06150000
TVWAHBUF DS    F                       HIGH BUFFER THRESHOLD            06200000
TVWALBUF DS    F                       LOW BUFFER THRESHOLD             06250000
TVWACLSZ DS    H                       BUFFER POOL CELL SIZE            06300000
TVWACHNL DS    H                       MAXIMUM NUMBER OF RU'S IN CHAIN  06350000
*                                                              @G70AKFZ 06400000
*                                      END OF PARMLIB VARIABLES         06450000
         SPACE                                                          06500000
**                                                                      06550000
**       WORK AREA VECTORS                                              06600000
**                                                                      06650000
TVWAFRWI DS    A                       A(INPUT MANAGER FRR WORK AREA)   06700000
*                                                              @ZM20856 06750000
TVWAFRWO DS    A                       A(OUTPUT MANAGER FRR WORK AREA)  06800000
*                                                              @ZM20856 06850000
         SPACE                                                          06900000
TVWAACB  DS    A                       A(ACB)                           06950000
TVWANIB  DS    A                       A(NIB)                           07000000
TVWARPL  DS    A                       A(RPL)                           07050000
TVWAEXL  DS    A                       A(EXLST)                         07100000
         SPACE                                                          07150000
TVWAVST  DS    A                       A(VARIABLE STORAGE AREA)         07200000
TVWAVSZ  DS    F                       NUMBER OF BYTES IN VARIABLE      07250000
*                                      STORAGE AREA            @G70AKFZ 07300000
         SPACE                                                          07350000
TVWADLST DS    0CL12                   INIT ROUTINE LIST                07400000
TVWADIN1 DS    A                       ADDR 3270 INITIALIZATION         07450000
*                                      PROCEDURE                        07500000
TVWADIN2 DS    A                       ADDR 3767/3770 INITIALIZATION    07550000
*                                      PROCEDURE                        07600000
TVWADIN3 DS    A                       A(USER EXIT FOR INITIALIZATION)  07650000
         SPACE                                                          07700000
TVWATGTF DS    A                       A(GTF TRACE DATA)     @G98EK3A   07750000
TVWACHIP DS    F                       A(3270 OUTPUT DATA MANAGER       07800000
*                                        INPUT CHARACTER)               07850000
*                                      (I.E. OUTPUT QUEUE MESSAGE)      07900000
*                                                            @R506200   07950000
TVWACHOP DS    F                       A(3270 OUTPUT DATA MANAGER       08000000
*                                        OUTPUT CHARACTER)              08050000
*                                      (I.E. OUTPUT BUFFER)  @R506200   08100000
TVWASKTR DS    H                       SKIPPING BYTES FOR ORDER THAT    08150000
*                                      IS NOT ALL IN WORK AREA DURING   08200000
*                                      CALL TO IKT32OTR      @OY10339   08250000
TVWATPUT DS    H                       USER TPUT COUNTER         @01C   08300000
TVWAURED DS    F                       A(USER REPLACEMENT EDIT TABLE)   08350000
*                                                            @P054529   08400000
TVWASCHI DS    H                       NUMBER OF TIMES TIM SRB          08450000
*                                      SCHEDULED AFTER TEMPORARY        08500000
*                                      STORAGE SHORTAGE (RPLRTNCD       08550000
*                                      RPLFDB2 - 0800)           @06A   08600000
TVWASCHO DS    H                       NUMBER OF TIMES TIM SRB          08650000
*                                      SCHEDULED AFTER TEMPORARY        08700000
*                                      STORAGE SHORTAGE (RPLRTNCD       08750000
*                                      RPLFDB2 - 0800)           @06A   08800000
TVWAABUF DS    F                       HIGH BUFFER THRESHOLD FOR CROSS  08850000
*                                      MEMORY (ASID) TPUTS       @07A   08900000
TVWABNBR DS    H                       OUTPUT BUFFER NUMBER      @08A   08950000
         DS    H                       RESERVED             @06C @08C   09000000
         SPACE                                                          09050000
**                                                                      09100000
**       EVENT CONTROL AREA                                             09150000
**                                                                      09200000
TVWAECB  DS    F                       TERMINAL CONTROL ECB             09250000
TVWATECB DS    F                       TIMER ECB                        09300000
         SPACE                                                          09350000
TVWAECBL DS    0CL12                   RECONNECT ECB LIST               09400000
TVWAECB1 DS    A                       A(CANCEL ECB) = A(CHCECB)        09450000
TVWAECB2 DS    A                       A(RECONNECT ECB) = A(TSBXECB)    09500000
TVWAECB3 DS    A                       A(TIMER ECB) = A(TVWAECB)        09550000
         SPACE                                                          09600000
**                                                                      09650000
**       USER TRANSLATE TABLE VECTORS                                   09700000
**                                                                      09750000
TVWATABI DS    A                       A(INBOUND TRANSLATE TABLE)       09800000
TVWATABO DS    A                       A(OUTBOUND TRANSLATE TABLE)      09850000
         SPACE                                                          09900000
**                                                                      09950000
**       ASCII TRANSLATE TABLE VECTORS                                  10000000
**                                                                      10050000
TVWAATBI DS    A                       A(INBOUND ASCII XLATE TABLE)     10100000
TVWAATBO DS    A                       A(OUTBOUND ASCII XLATE TABLE)    10150000
         SPACE                                                          10200000
**                                                                      10250000
**       USER TRANSLATE TABLE MEMBER NAME                               10300000
**                                                                      10350000
TVWATRNM DS    CL8                     NAME OF USER TRANSLATE TABLE     10400000
*                                      LIBRARY MEMBER                   10450000
         SPACE                                                          10500000
**                                                                      10550000
**       SCREEN DESCRIPTION AREA                                        10600000
**                                                                      10650000
TVWALNSV DS    H                       LINE COUNT SAVE AREA    @G70AKFZ 10700000
TVWALNCT DS    H                       CURRENT SCREEN LINE COUNT        10750000
*                                                              @G70AKFZ 10800000
TVWAWLNO DS    H                       NUMBER OF LINES AVAILABLE FOR    10850000
*                                      USE ON SCREEN           @G70AKFZ 10900000
TVWAWLSZ DS    H                       NUMBER OF CHARACTERS PER LINE    10950000
*                                      AVAILABLE FOR USE ON SCREEN      11000000
*                                                              @G70AKFZ 11050000
TVWARSHW DS    CL1                     RESHOW CODE BYTE FOR FULL SCREEN 11100000
*                                      APPLICATION             @YM03254 11150000
         DS    CL7                     RESERVED                @G70AKFZ 11200000
TVWAATTN DS    H                       ATTENTION WITH STAX COUNT        11250000
*                                                              @G70AKFZ 11300000
TVWARMAX DS    H                       MAXIMUM RU SIZE FOR TERMINAL     11350000
*                                                              @G70AKFZ 11400000
TVWARTR  DS    H                       RETRY COUNTER           @G70AKFZ 11450000
TVWANCNT DS    H                       COLUMN COUNT OF EXPECTED INPUT   11500000
*                                                              @ZA42544 11550000
TVWACSFS DS    X                       CHARACTER SET FSM       @R506200 11600000
TVWACSRS EQU   B'00000000'             RESET - SINGLE BYTE MODE         11650000
*                                                              @R506200 11700000
TVWACSSB EQU   B'00000000'             SINGLE BYTE MODE        @R506200 11750000
TVWACSDP EQU   B'00000001'             DOUBLE BUYTE PENDING - A SHIFT   11800000
*                                      IN HAS BEEN FOUND       @R506200 11850000
TVWACSDB EQU   B'00000010'             DOUBLE BYTE MODE        @R506200 11900000
TVWACSSO EQU   B'00000011'             SHIFT OUT REQUIRED - A DOUBLE    11950000
*                                      BYTE CHARACTER STRING WAS        12000000
*                                      INTERRUPTED             @R506200 12050000
         DS    X                       RESERVED                @R506200 12100000
         DS    H                       RESERVED                @ZA42544 12150000
         SPACE                                                          12200000
**                                                                      12250000
**       USER AREA                                                      12300000
**                                                                      12350000
TVWAUSRA DS    D                       AREA FOR INSTALLATION DATA       12400000
         SPACE                                                          12450000
**                                                                      12500000
**       FLAG BYTE AREA                                                 12550000
**                                                                      12600000
TVWAFLAG DS    0XL16                   FLAG BYTE AREA          @G70AKFZ 12650000
         SPACE                                                          12700000
TVWAFLG0 DS    X                       RESERVED                @G70AKFZ 12750000
         SPACE                                                          12800000
TVWAFLG1 DS    X                       FLAG BYTE                        12850000
TVWATOD  EQU   B'10000000'             TOM HAS FREED WORK AREA          12900000
*                                      AND EXITED                       12950000
TVWATIS  EQU   B'01000000'             TOM IS SCHEDULED                 13000000
TVWATAS  EQU   B'00100000'             TOM NOT AVAILABLE FOR SCHEDULING 13050000
TVWATID  EQU   B'00010000'             TIM HAS FREED WORK AREA          13100000
*                                      AND EXITED                       13150000
TVWAXSCD EQU   B'00001000'             EXAMINE WORKING SCREEN           13200000
*                                      DIMENSIONS              @G58AK3A 13250000
TVWAILE  EQU   B'00000100'             IGNORE LOSTTERM ENTRY BECAUSE    13300000
*                                      LOSTERM ALREADY ENTERED @G70AKFZ 13350000
TVWALTE  EQU   B'00000010'             LOSTERM ENTERED                  13400000
TVWAOOPS EQU   B'00000001'             OUT OF PAPER INDICATOR           13450000
         SPACE                                                          13500000
TVWAFLG2 DS    X                       FLAG BYTE                        13550000
TVWAENDS EQU   B'10000000'             USER SESSION ENDED      @ZA36205 13600000
TVWAPGN  EQU   B'01000000'             3270 SCREEN PAGING               13650000
TVWATGNO EQU   B'00100000'             TGET NOWAIT WAS ISSUED  @AZ53450 13700000
*        EQU   B'00010000'             RESERVED                @G70AKFZ 13750000
TVWAERMG EQU   B'00001000'             INPUT DATA LOST ERROR MESSAGE    13800000
*                                      REQUIRED                         13850000
TVWANLRQ EQU   B'00000100'             NEW LINE SHOULD BE SENT TO THE   13900000
*                                      TERMINAL                @ZM44924 13950000
TVWACRRQ EQU   B'00000010'             CARRIAGE RETURN SHOULD BE SENT   14000000
*                                      TO THE TERMINAL         @ZA46431 14050000
TVWABIR  EQU   B'00000001'             BREAKIN REQUEST ON OUTPUT QUEUE  14100000
         SPACE                                                          14150000
TVWAFLG3 DS    X                       FLAG BYTE                        14200000
TVWABRIN EQU   B'10000000'             TOM SENT SIGNAL FOR TPUT BREAKIN 14250000
TVWASDSG EQU   B'01000000'             DIRECTION IS REQUIRED BY TIM,    14300000
*                                      BUT IS NOT AVAILABLE    @ZM20268 14350000
TVWAAIGN EQU   B'00100000'             ATTENTION IGNORED                14400000
TVWAQMRT EQU   B'00010000'             QUEUE MANAGER RETRY IN PROGRESS  14450000
TVWAQMIO EQU   B'00001000'             WHICH QUEUE:                     14500000
*                                      0-INPUT, 1-OUTPUT                14550000
*        EQU   B'00000100'             RESERVED                         14600000
TVWATRAN EQU   B'00000010'             TRANSLATE TABLES IN USE          14650000
TVWATRDF EQU   B'00000001'             DEFAULT TRANSLATE TABLES IN USE  14700000
         SPACE                                                          14750000
TVWAFLG4 DS    X                       FLAG BYTE                        14800000
TVWAFMSC EQU   B'10000000'             FORMAT 3270 SCREEN               14850000
TVWADOOQ EQU   B'01000000'             DATA ON OUTPUT QUEUE             14900000
*        EQU   B'00100000'             RESERVED                         14950000
TVWANOFB EQU   B'00010000'             NO FLASH BACK ALLOWED.           15000000
*                                      LAST OUTPUT SET BYPASS.          15050000
*        EQU   B'00001000'             RESERVED                @G70AKFZ 15100000
TVWAQMEV EQU   B'00000100'             FOOTPRINT FOR QUEUE ELEMENT      15150000
*                                      VERIFICATION ROUTINE.            15200000
TVWARCRS EQU   B'00000010'             RECEIVE RESPONSE                 15250000
*        EQU   B'00000001'             RESERVED                @G70AKFZ 15300000
         SPACE                                                          15350000
TVWAFLG5 DS    X                       FLAG BYTE               @YM03227 15400000
TVWAPART EQU   B'10000000'             PARTITIONS BEING USED   @R474105 15450000
TVWAFSM  EQU   B'01000000'             DISPLAY IS IN FULL SCREEN MODE   15500000
*                                                              @YM03254 15550000
TVWAWO   EQU   B'00100000'             FULLSCREEN WRITTEN OVER @AZ63956 15600000
TVWAFSW  EQU   B'00010000'             FULL SCREEN TPUT IS WAITING      15650000
*                                                              @YM03254 15700000
TVWATIR  EQU   B'00001000'             TOM IS RUNNING          @YM03259 15750000
TVWANFSP EQU   B'00000100'             NO FULL SCREEN 'PAGING' AFTER    15800000
*                                      NON-FULLSCREEN TPUT     @YM03254 15850000
TVWAPRMT EQU   B'00000010'             PROMPTING IS IN EFFECT  @YM03601 15900000
TVWAP1ST EQU   B'00000001'             FIRST PROMPT            @YM03601 15950000
         SPACE                                                          16000000
TVWAFLG6 DS    X                       FLAG BYTE               @ZA11997 16050000
TVWAISYS EQU   B'10000000'             IWAIT SYSEVENT ISSUED   @ZA12002 16100000
TVWAIOTR EQU   B'01000000'             I/O TRANSACTION DIRECTION        16150000
*                                      1=IN, 0=OUT             @ZA11997 16200000
*        EQU   B'00100000'             RESERVED                @G70AKFZ 16250000
TVWARCDT EQU   B'00010000'             TIM HAS READ BUFFER CONTENTS     16300000
*                                                              @G58AK3A 16350000
TVWAFMEW EQU   B'00001000'             SEND FORMATTING ERASE-WRITE      16400000
*                                                              @G58AK3A 16450000
*        EQU   B'00000100'             RESERVED                @G70AKFZ 16500000
TVWALTS  EQU   B'00000010'             ALTERNATE SCREEN SIZE IN USE     16550000
*                                                              @G35SKSR 16600000
TVWASCSW EQU   B'00000001'             SCREEN SWITCHED BY CLEAR         16650000
*                                                              @ZM20288 16700000
         SPACE                                                          16750000
TVWAFLG7 DS    X                       FLAG BYTE               @G58AK3A 16800000
TVWABKPG EQU   B'10000000'             BREAK-IN PAGING         @G58AK3B 16850000
TVWATGET EQU   B'01000000'             TGET IS PENDING         @G70AKFZ 16900000
TVWARDBF EQU   B'00100000'             TOM ISSUED READ BUFFER  @G58AK3A 16950000
TVWASND1 EQU   B'00010000'             0=FIRST SEND OF SESSION @P5Z9542 17000000
TVWARISW EQU   B'00001000'             I/O MGRS REINITIALIZED  @ZM20856 17050000
TVWADBCP EQU   B'00000100'             DOUBLE BYTE CAPABLE     @R506200 17100000
TVWAABND EQU   B'00000010'             USER ABENDED                @02A 17150000
TVWAFRRR EQU   B'00000001'             IKTIOFRR IS RECURSING   @ZM45356 17200000
         SPACE                                                          17250000
TVWAFLG8 DS    X                       STATE INDICATORS        @G70AKFZ 17300000
TVWABRKT EQU   B'11000000'             BRACKET STATE MASK      @G70AKFZ 17350000
TVWABSRS EQU   B'00000000'             RESET - BETWEEN BRACKET @G70AKFZ 17400000
TVWABSPB EQU   B'01000000'             PENDING BEGIN BRACKET   @G70AKFZ 17450000
TVWABSIB EQU   B'10000000'             IN BRACKET              @G70AKFZ 17500000
         SPACE                                                          17550000
TVWADIRS EQU   B'00110000'             DIRECTION STATE MASK    @G70AKFZ 17600000
TVWADSRS EQU   B'00000000'             RESET STATE             @G70AKFZ 17650000
*                                      LU1 DIRECTION STATE FLAGS        17700000
*                                                              @G70AKFZ 17750000
TVWADS1R EQU   B'00000000'             RESET - CONTENTION STATE         17800000
*                                                              @G70AKFZ 17850000
TVWADS1C EQU   B'00000000'             CONTENTION STATE        @G70AKFZ 17900000
TVWADS1O EQU   B'00010000'             OUTBOUND (SEND) STATE   @G70AKFZ 17950000
TVWADS1I EQU   B'00100000'             INBOUND (RECEIVE) STATE @G70AKFZ 18000000
TVWADS1S EQU   B'00110000'             PENDING SEND STATE - SIGNAL      18050000
*                                      HAS BEEN SENT           @G70AKFZ 18100000
         SPACE                                                          18150000
*                                      LU2 DIRECTION STATE FLAGS        18200000
*                                                              @G70AKFZ 18250000
TVWADS2R EQU   B'00000000'             RESET - SEND STATE      @G70AKFZ 18300000
TVWADS2O EQU   B'00000000'             OUTBOUND (SEND) STATE   @G70AKFZ 18350000
TVWADS2I EQU   B'00010000'             INBOUND (RECEIVE) STATE @G70AKFZ 18400000
TVWADS2S EQU   B'00100000'             PENDING SEND STATE - SIGNAL      18450000
*                                      HAS BEEN SENT           @G70AKFZ 18500000
TVWADS2C EQU   B'00110000'             CONTENTION STATE        @G70AKFZ 18550000
         SPACE                                                          18600000
TVWAKEYL EQU   B'00001000'             KEYBOARD IS LOGICALLY OPEN       18650000
*                                      FOR INPUT               @G70AKFZ 18700000
TVWAKEYP EQU   B'00000100'             KEYBOARD IS PHYSICALLY OPEN      18750000
*                                      FOR INPUT               @G70AKFZ 18800000
TVWAKEYB EQU   B'00001100'             KEYBOARD STATE MASK - APPLICABLE 18850000
*                                      ONLY TO 3270 DEVICES    @G70AKFZ 18900000
TVWAKBRS EQU   B'00000000'             RESET - LOCKED          @G70AKFZ 18950000
TVWAKBLK EQU   B'00000000'             RESET - LOCKED          @G70AKFZ 19000000
TVWAKBPU EQU   B'00000100'             PHYSICALLY UNLOCKED BUT          19050000
*                                      LOGICALLY LOCKED - STATE OCCURS  19100000
*                                      ONLY IN CONTENTION MODE @G70AKFZ 19150000
TVWAKBLU EQU   B'00001000'             LOGICALLY UNLOCKED BUT           19200000
*                                      PHYSICALLY LOCKED       @G70AKFZ 19250000
TVWAKBUL EQU   B'00001100'             PHYSICALLY AND LOGICALLY         19300000
*                                      UNLOCKED                @G70AKFZ 19350000
         SPACE                                                          19400000
*        EQU   B'00000011'             RESERVED                @G70AKFZ 19450000
         SPACE                                                          19500000
TVWAFLG9 DS    X                       FLAG BYTE                   @03C 19550000
TVWANORS EQU   B'10000000'             NO RESHOW CONDITION         @03A 19600000
TVWAFSIN EQU   B'01000000'             FULLSCREEN MODE INITIALIZING     19650000
*                                                                  @05A 19700000
*        EQU   B'00111111'             AVAILABLE         @03A @04C @05C 19750000
         SPACE                                                          19800000
TVWAFLGA DS    X                       FLAG BYTE               @G70AKFZ 19850000
         SPACE                                                          19900000
TVWAFLGB DS    X                       FLAG BYTE               @G70AKFZ 19950000
         SPACE                                                          20000000
TVWAFLGC DS    X                       FLAG BYTE               @G70AKFZ 20050000
         SPACE                                                          20100000
TVWAFLGD DS    X                       FLAG BYTE               @G70AKFZ 20150000
         SPACE                                                          20200000
TVWAFLGE DS    X                       FLAG BYTE               @G70AKFZ 20250000
         SPACE                                                          20300000
TVWAFLGF DS    X                       FLAG BYTE               @G70AKFZ 20350000
         SPACE                                                          20364200
TVWAPID  DS    0CL9                    APPL ID and length          @S1A 20378400
TVWAPLEN DS    X                       Length (always 8)           @S1A 20392600
TVWAPNAM DS    CL8                     APPL name                   @S1A 20406800
         SPACE                                                          20421000
         DS    7X                      AVAILABLE          @R506200 @S1C 20435200
TVWAEND  EQU   *                       END OF TVWA                      20450000
*                                                                       20500000
TVWAQMAD EQU   304                     LENGTH OF AUTODATA AREA FOR      20550000
*                                      IKTQMNGR AND IKTVTGTF @ZMB6618   20600000
         MEND  ,                       END ASSEMBLER CODE            */ 20650000
*%TVWAPLS2:                                                             20700000
*   ;                                                                   20750000
*   DCL                                                                 20800000
*     1 TVWA BASED(TVWAPTR) BDY(DWORD),                                 20850000
*      2 TVWAPPL CHAR(8),           /* TSO USER APPLID               */ 20900000
*      2 TVWATIMW PTR(31),          /* POINTER TO TIM WORK AREA AND     20950000
*                                      PARAMETER LIST                */ 21000000
*      2 TVWATOMW PTR(31),          /* POINTER TO TOM WORK AREA      */ 21050000
*      2 TVWALLWA PTR(31),          /* POINTER TO WORK AREA FOR         21100000
*                                      LOCALLY LOCKED ROUTINES       */ 21150000
*      2 TVWAQMWA PTR(31),          /* POINTER TO WORK AREA FOR QUEUE   21200000
*                                      MANAGER AND IKTVTGTF  @G98EK3A*/ 21250000
*      2 TVWABIQ PTR(31),           /* POINTER TO BEGINNING OF INPUT    21300000
*                                      QUEUE                         */ 21350000
*      2 TVWANIM PTR(31),           /* POINTER TO NEXT INPUT MESSAGE */ 21400000
*      2 TVWAEIQ PTR(31),           /* POINTER TO END OF INPUT QUEUE */ 21450000
*      2 TVWABOQ PTR(31),           /* POINTER TO BEGINNING OF OUTPUT   21500000
*                                      QUEUE                         */ 21550000
*      2 TVWANOM PTR(31),           /* POINTER TO NEXT OUTPUT           21600000
*                                      MESSAGE                       */ 21650000
*      2 TVWAEOQ PTR(31),           /* POINTER TO END OF OUTPUT QUEUE*/ 21700000
*      2 TVWACPID CHAR(4),          /* CELL POOL IDENTIFIER          */ 21750000
*      2 TVWARECB FIXED(31),        /* POSTED BY IKTNSXIT FOR IKTLOGR   21800000
*                                                            @R488200*/ 21850000
*        3 *      FIXED(15),        /*                       @R488200*/ 21900000
*        3 TVWECBCC FIXED(15),      /* COMPLETION CODE       @R488200*/ 21950000
*      2 TVWAUSMN FIXED(31),        /* AMOUNT OF USED MAIN STORAGE      22000000
*                                      USED FOR TPUTS                */ 22050000
*      2 TVWATCB PTR(31),           /* POINTER TO TASK CONTROL BLOCK */ 22100000
*/********************************************************************/ 22150000
*/*            PARMLIB VALUES FIXED PER SESSION                      */ 22200000
*/********************************************************************/ 22250000
*                                                                       22300000
*      2 TVWAHBUF FIXED(31),        /* HIGH BUFFER THRESHOLD         */ 22350000
*      2 TVWALBUF FIXED(31),        /* LOW BUFFER THRESHOLD          */ 22400000
*      2 TVWACLSZ FIXED(15),        /* CELL POOL CELL SIZE           */ 22450000
*      2 TVWACHNL FIXED(15),        /* MAXIMUM NUMBER OF RU'S IN CHAIN  22500000
*                                                            @G70AKFZ*/ 22550000
*/*                                    END OF PARMLIB VALUES         */ 22600000
*      2 TVWAFRWI PTR(31),          /* POINTER TO INPUT MANAGER FRR     22650000
*                                      WORK AREA             @ZM20856*/ 22700000
*      2 TVWAFRWO PTR(31),          /* POINTER TO OUTPUT MANAGWR FRR    22750000
*                                      WORK AREA             @ZM20856*/ 22800000
*      2 TVWAACB PTR(31),           /* POINTER TO ACB                */ 22850000
*      2 TVWANIB PTR(31),           /* POINTER TO NIB                */ 22900000
*      2 TVWARPL PTR(31),           /* POINTER TO RPL                */ 22950000
*      2 TVWAEXL PTR(31),           /* POINTER TO EXLST              */ 23000000
*      2 TVWAVST PTR(31),           /* POINTER TO VARIABLE STORAGE      23050000
*                                      AREA                          */ 23100000
*      2 TVWAVSZ FIXED(31),         /* NUMBER OF BYTES IN THE           23150000
*                                      VARIABLE STORAGE AREA @G70AKFZ*/ 23200000
*      2 TVWADLST,                  /* INIT ROUTINE LIST             */ 23250000
*       3 TVWADIN1 PTR(31),         /* POINTER TO 3270 INIT PROC     */ 23300000
*       3 TVWADIN2 PTR(31),         /* POINTER TO 3767/3770             23350000
*                                      INITIALIZATION PROCEDURE      */ 23400000
*       3 TVWADIN3 PTR(31),         /* POINTER TO USER EXIT FOR         23450000
*                                      INITIALIZATION PROCEDURE      */ 23500000
*      2 TVWATGTF PTR(31),          /* POINTER TO GTF TRACE DATA        23550000
*                                                            @G98EK3A*/ 23600000
*      2 TVWACHIP PTR,              /* CHARACTER INPUT POINTER          23650000
*                                      FOR 3270 OUTPUT DATA MANAGER     23700000
*                                      (I.E. OUTPUT QUEUE MESSAGE)      23750000
*                                                            @R506200*/ 23800000
*      2 TVWACHOP PTR,              /* CHARACTER OUTPUT POINTER         23850000
*                                      FOR 3270 OUTPUT DATA MANAGER     23900000
*                                      (I.E. OUTPUT BUFFER)  @R506200*/ 23950000
*      2 TVWASKTR FIXED(15),        /* COUNTER TO SKIP NUMBER OF BYTES  24000000
*                                      NEXT TIME AROUND BY IKT32OTR     24050000
*                                                            @OY10339*/ 24100000
*      2 TVWATPUT FIXED(15),        /* USER TPUT COUNTER         @01C*/ 24150000
*      2 TVWAURED PTR,              /* USER REPLACEMENT EDIT TABLE      24200000
*                                                            @P054529*/ 24250000
*      2 TVWASCHI FIXED(15),         /* NUMBER OF TIMES TIM SRB         24300000
*                                      SCHEDULED AFTER TEMPORARY        24350000
*                                      STORAGE SHORTAGE (RPLRTNCD       24400000
*                                      RPLFDB2 - 0800)           @06A*/ 24450000
*      2 TVWASCHO FIXED(15),         /* NUMBER OF TIMES TOM SRB         24500000
*                                      SCHEDULED AFTER TEMPORARY        24550000
*                                      STORAGE SHORTAGE (RPLRTNCD       24600000
*                                      RPLFDB2 - 0800)           @06A*/ 24650000
*      2 TVWAABUF FIXED(31),        /* HIGH BUFFER THRESHOLD FOR CROSS  24700000
*                                      MEMORY (ASID) TPUTS       @07A*/ 24750000
*      2 TVWABNBR FIXED(16),        /* OUTPUT BUFFER NUMBER      @08A*/ 24800000
*      2 *    FIXED(16),            /* RESERVED             @06C @08C*/ 24850000
*      2 TVWAECB FIXED(31),         /* TERMINAL CONTROL ECB          */ 24900000
*      2 TVWATECB FIXED(31),        /* TIMER ECB                     */ 24950000
*      2 TVWAECBL,                  /* RECONNECT ECB LIST            */ 25000000
*       3 TVWAECB1 PTR(31),         /* POINTER TO CANCEL ECB -          25050000
*                                      CHCEBC                        */ 25100000
*       3 TVWAECB2 PTR(31),         /* POINTER TO RECONNECT ECB         25150000
*                                      TSBXECB                       */ 25200000
*       3 TVWAECB3 PTR(31),         /* POINTER TO TIMER ECB -           25250000
*                                      TVWAECB                       */ 25300000
*      2 TVWATABI PTR(31),          /* POINTER TO INBOUND TRANSLATE     25350000
*                                      TABLE                         */ 25400000
*      2 TVWATABO PTR(31),          /* POINTER TO OUTBOUND TRANSLATE    25450000
*                                      TABLE                         */ 25500000
*      2 TVWAATBI PTR(31),          /* POINTER TO INBOUND ASCII         25550000
*                                      TRANSLATE TABLE               */ 25600000
*      2 TVWAATBO PTR(31),          /* POINTER TO OUTBOUND ASCII        25650000
*                                      TRANSLATE TABLE               */ 25700000
*      2 TVWATRNM CHAR(8),          /* NAME OF USER TRANSLATE TABLE     25750000
*                                      LIBRARY MEMBER                */ 25800000
*      2 TVWALNSV FIXED(15),        /* LINE COUNT SAVE AREA  @G70AKFZ*/ 25850000
*      2 TVWALNCT FIXED(15),        /* CURRENT SCREEN LINE COUNT        25900000
*                                                            @G70AKFZ*/ 25950000
*      2 TVWAWLNO FIXED(15),        /* NUMBER OF LINES AVAILABLE FOR    26000000
*                                      USE ON SCREEN         @G70AKFZ*/ 26050000
*      2 TVWAWLSZ FIXED(15),        /* NUMBER OF CHARACTERS PER LINE    26100000
*                                      AVAILABLE FOR USE ON SCREEN      26150000
*                                                            @G70AKFZ*/ 26200000
*      2 TVWARSHW CHAR(1),          /* RESHOW CODE BYTE FOR FULL        26250000
*                                      SCREEN APPLICATION    @YM03254*/ 26300000
*      2 *(7) CHAR(1),              /* RESERVED                      */ 26350000
*      2 TVWAATTN FIXED(15),        /* ATTENTION WITH STAX COUNT        26400000
*                                                            @G70AKFZ*/ 26450000
*      2 TVWARMAX FIXED(15),        /* MAXIMUM RU SIZE FOR TERMINAL     26500000
*                                                            @G70AKFZ*/ 26550000
*      2 TVWARTR FIXED(15),         /* RETRY COUNTER         @G70AKFZ*/ 26600000
*      2 TVWANCNT FIXED(15),        /* COLUMN COUNT OF EXPECTED INPUT   26650000
*                                                            @ZA42544*/ 26700000
*      2 TVWACSFS CHAR(1),          /* CHARACTER SET FSM     @R506200*/ 26750000
*      2 *        CHAR(1),          /* RESERVED              @R506200*/ 26800000
*      2 *        CHAR(2),          /* RESERVED              @R506200*/ 26850000
*      2 TVWAUSRA CHAR(8) BDY(DWORD), /* AREA FOR INSTALLATION DATA  */ 26900000
*      2 TVWAFLAG,                  /* FLAG BYTE AREA        @G70AKFZ*/ 26950000
*       3 TVWAFLG0 CHAR(1),         /* RESERVED              @G70AKFZ*/ 27000000
*       3 TVWAFLG1 CHAR(1),         /* FLAG BYTE                     */ 27050000
*        4 TVWATOD BIT(1),          /* TOM HAS FREED WORK AREA AND      27100000
*                                      EXITED NORMALLY               */ 27150000
*        4 TVWATIS BIT(1),          /* TOM IS SCHEDULED              */ 27200000
*        4 TVWATAS BIT(1),          /* TOM NOT AVAILABLE FOR            27250000
*                                      SCHEDULING                    */ 27300000
*        4 TVWATID BIT(1),          /* TIM HAS FREED WORK AREA AND      27350000
*                                      EXITED NORMALLY               */ 27400000
*        4 TVWAXSCD BIT(1),         /* EXAMINE WORKING SCREEN           27450000
*                                      DIMENSIONS            @G58AK3A*/ 27500000
*        4 TVWAILE BIT(1),          /* IGNORE LOSTTERM ENTRY BECAUSE    27550000
*                                      LOSTERM ALREADY ENTERED          27600000
*                                                            @G70AKFZ*/ 27650000
*        4 TVWALTE BIT(1),          /* LOSTERM ENTERED               */ 27700000
*        4 TVWAOOPS BIT(1),         /* OUT OF PAPER INDICATOR        */ 27750000
*       3 TVWAFLG2 CHAR(1),         /* FLAG BYTE                     */ 27800000
*        4 TVWAENDS BIT(1),         /* USER SESSION ENDED    @ZA36205*/ 27850000
*        4 TVWAPGN BIT(1),          /* 3270 SCREEN PAGING            */ 27900000
*        4 TVWATGNO BIT(1),         /* TGET NOWAIT WAS ISSUED           27950000
*                                                            @AZ53450*/ 28000000
*        4 * BIT(1),                /* RESERVED              @G70AKFZ*/ 28050000
*        4 TVWAERMG BIT(1),         /* INPUT DATA LOST ERROR MESSAGE    28100000
*                                      REQUIRED                      */ 28150000
*        4 TVWANLRQ BIT(1),         /* NEW LINE SHOULD BE SENT TO THE   28200000
*                                      TERMINAL              @ZM44924*/ 28250000
*        4 TVWACRRQ BIT(1),         /* CARRIAGE RETURN SHOULD BE SENT   28300000
*                                      TO THE TERMINAL       @ZA46431*/ 28350000
*        4 TVWABIR BIT(1),          /* BREAKIN REQUEST ON OUTPUT        28400000
*                                      QUEUE                         */ 28450000
*       3 TVWAFLG3 CHAR(1),         /* FLAG BYTE                     */ 28500000
*        4 TVWABRIN BIT(1),         /* TOM SENT SIGNAL FOR              28550000
*                                      TPUT-BREAKIN                  */ 28600000
*        4 TVWASDSG BIT(1),         /* DIRECTION IS REQUIRED BY TIM,    28650000
*                                      BUT IS NOT AVAILABLE  @ZM20268*/ 28700000
*        4 TVWAAIGN BIT(1),         /* ATTENTION IGNORED             */ 28750000
*        4 TVWAQMRT BIT(1),         /* QUEUE MANAGER RETRYING ABENDED   28800000
*                                      REQUEST                       */ 28850000
*        4 TVWAQMIO BIT(1),         /* WHICH QUEUE SERVICE,             28900000
*                                      0 = IN                           28950000
*                                      1 = OUT                       */ 29000000
*        4 * BIT(1),                /* RESERVED                      */ 29050000
*        4 TVWATRAN BIT(1),         /* TRANSLATE TABLE IN USE        */ 29100000
*        4 TVWATRDF BIT(1),         /* DEFAULT TRANSLATE TABLES IN      29150000
*                                      USE                           */ 29200000
*       3 TVWAFLG4 CHAR(1),         /* FLAG BYTE                     */ 29250000
*        4 TVWAFMSC BIT(1),         /* FORMAT 3270 SCREEN            */ 29300000
*        4 TVWADOOQ BIT(1),         /* DATA ON OUTPUT QUEUE          */ 29350000
*        4 * BIT(1),                /* RESERVED                      */ 29400000
*        4 TVWANOFB BIT(1),         /* NO FLASH BACK. LAST OUTPUT HAD   29450000
*                                      BYPASS SET                    */ 29500000
*        4 * BIT(1),                /* RESERVED              @G70AKFZ*/ 29550000
*        4 TVWAQMEV BIT(1),         /* FOOTPRINT FOR QUEUE ELEMENT      29600000
*                                      VERIFICATION ROUTINE          */ 29650000
*        4 TVWARCRS BIT(1),         /* RECEIVE RESPONSES             */ 29700000
*        4 * BIT(1),                /* RESERVED              @G70AKFZ*/ 29750000
*       3 TVWAFLG5 CHAR(1),         /* FLAG BYTE             @YM03227*/ 29800000
*        4 TVWAPART BIT(1),         /* PARTITIONS BEING USED @R474105*/ 29850000
*        4 TVWAFSM BIT(1),          /* DISPLAY IN FULL SCREEN MODE      29900000
*                                                            @YM03254*/ 29950000
*        4 TVWAWO BIT(1),           /* FULLSCREEN WRITTEN OVER          30000000
                                                             @AZ63956*/ 30050000
*        4 TVWAFSW BIT(1),          /* FULL SCR TPUT WAITING @YM03254*/ 30100000
*        4 TVWATIR BIT(1),          /* TOM IS RUNNING        @YM03259*/ 30150000
*        4 TVWANFSP BIT(1),         /* NO FULL SCREEN 'PAGING' AFTER    30200000
*                                      NON-FULLSCREEN TPUT   @YM03254*/ 30250000
*        4 TVWAPRMT BIT(1),         /* PROMPTING IS IN EFFECT           30300000
*                                                            @YM03601*/ 30350000
*        4 TVWAP1ST BIT(1),         /* FIRST PROMPT          @YM03601*/ 30400000
*       3 TVWAFLG6 CHAR(1),         /* FLAG BYTE                     */ 30450000
*        4 TVWAISYS BIT(1),         /* IWAIT SYSEVENT ISSUES @ZA12002*/ 30500000
*        4 TVWAIOTR BIT(1),         /* I/O TRANSACTION,                 30550000
*                                      0 = OUT                          30600000
*                                      1 = IN                @ZA11997*/ 30650000
*        4 * BIT(1),                /* RESERVED              @G70AKFZ*/ 30700000
*        4 TVWARCDT BIT(1),         /* TIM HAS READ BUFFER CONTENTS     30750000
*                                                            @G58AK3A*/ 30800000
*        4 TVWAFMEW BIT(1),         /* SENT FORMATTING ERASE-WRT        30850000
*                                                            @G58AK3A*/ 30900000
*        4 * BIT(1),                /* RESERVED              @G70AKFZ*/ 30950000
*        4 TVWALTS BIT(1),          /* ALTERNATE SCREEN SIZE IN USE     31000000
*                                                            @G35SKSR*/ 31050000
*        4 TVWASCSW BIT(1),         /* SCREEN SWITCHED BY CLEAR         31100000
*                                                            @ZM20288*/ 31150000
*       3 TVWAFLG7 CHAR(1),         /* FLAG BYTE                     */ 31200000
*        4 TVWABKPG BIT(1),         /* BREAK-IN PAGING       @G58AK3B*/ 31250000
*        4 TVWATGET BIT(1),         /* TGET IS PENDING       @G70AKFZ*/ 31300000
*        4 TVWARDBF BIT(1),         /* TOM ISSUED READ BUFFER           31350000
*                                                            @G58AK3A*/ 31400000
*        4 TVWASND1 BIT(1),         /* 0=FIRST SEND OF SESSION          31450000
*                                      1=NOT FIRST SEND      @P5Z9542*/ 31500000
*        4 TVWARISW BIT(1),         /* I/O MGRS REINITIALIZED           31550000
*                                                            @ZM20856*/ 31600000
*        4 TVWADBCP BIT(1),         /* TERMINAL IS DOUBLE BYTE CAPABLE  31650000
*                                                            @R506200*/ 31700000
*        4 TVWAABND BIT(1),         /* USER ABENDED              @02A*/ 31750000
*        4 TVWAFRRR BIT(1),         /* IKTIOFRR IS RECURSING @ZA34957*/ 31800000
*       3 TVWAFLG8 CHAR(1),         /* STATE INDICATORS      @G70AKFZ*/ 31850000
*        4 TVWABRKT BIT(2),         /* BRACKET STATE         @G70AKFZ*/ 31900000
*        4 TVWADIRS BIT(2),         /* DIRECTION STATE       @G70AKFZ*/ 31950000
*        4 TVWAKEYB BIT(2),         /* KEYBOARD STATE - APPLICABLE      32000000
*                                      ONLY TO 3270 DEVICES  @G70AKFZ*/ 32050000
*         5 TVWAKEYL BIT(1),        /* KEYBOARD IS LOGICALLY OPEN       32100000
*                                      FOR INPUT             @G70AKFZ*/ 32150000
*         5 TVWAKEYP BIT(1),        /* KEYBOARD IS PHYSICALLY OPEN      32200000
*                                      FOR INPUT             @G70AKFZ*/ 32250000
*        4 * BIT(2),                /* RESERVED              @G70AKFZ*/ 32300000
*       3 TVWAFLG9 CHAR(1),         /* FLAG BYTE                 @03C*/ 32350000
*        4 TVWANORS BIT(1),         /* NO RESHOW CONDITION       @03A*/ 32400000
*        4 TVWAFSIN BIT(1),         /* FULLSCREEN MODE INITIALIZING     32450000
*                                                                @05A*/ 32500000
*        4 *        BIT(6),         /* AVAILABLE            @03A @05C*/ 32550000
*       3 TVWAFLGA CHAR(1),         /* RESERVED              @G70AKFZ*/ 32600000
*       3 TVWAFLGB CHAR(1),         /* RESERVED              @G70AKFZ*/ 32650000
*       3 TVWAFLGC CHAR(1),         /* RESERVED              @G70AKFZ*/ 32700000
*       3 TVWAFLGD CHAR(1),         /* RESERVED              @G70AKFZ*/ 32750000
*       3 TVWAFLGE CHAR(1),         /* RESERVED              @G70AKFZ*/ 32800000
*       3 TVWAFLGF CHAR(1),         /* RESERVED              @G70AKFZ*/ 32850000
*       3 TVWAPID  CHAR(9),         /* APPL ID and length        @S1A*/ 32870000
*         4  TVWAPLEN   CHAR(1),    /* Length (always 8)         @S1A*/ 32890000
*         4  TVWAPNAM   CHAR(8),    /* APPL name                 @S1A*/ 32910000
*       3 *        CHAR(7),         /* AVAILABLE        @R506200 @S1C*/ 32930000
*      2 TVWAEND CHAR(0);           /* END OF TSO/VTAM WORK AREA     */ 32950000
*   DCL                             /* TVWABRKT CODES        @G70AKFZ*/ 33000000
*     TVWABSRS BIT(2) CONSTANT('00'B), /* RESET - BETWEEN BRACKET       33050000
*                                                            @G70AKFZ*/ 33100000
*     TVWABSPB BIT(2) CONSTANT('01'B), /* PENDING BEGIN BRACKET         33150000
*                                                            @G70AKFZ*/ 33200000
*     TVWABSIB BIT(2) CONSTANT('10'B); /* IN BRACKET         @G70AKFZ*/ 33250000
*   DCL                             /* TVWADIRS CODES        @G70AKFZ*/ 33300000
*     TVWADSRS BIT(2) CONSTANT('00'B); /* RESET STATE        @G70AKFZ*/ 33350000
*   DCL                             /* TVWADIRS CODES FOR LU1           33400000
*                                      DEVICES               @G70AKFZ*/ 33450000
*     TVWADS1R BIT(2) CONSTANT('00'B), /* RESET - CONTENTION STATE      33500000
*                                                            @G70AKFZ*/ 33550000
*     TVWADS1C BIT(2) CONSTANT('00'B), /* CONTENTION STATE   @G70AKFZ*/ 33600000
*     TVWADS1O BIT(2) CONSTANT('01'B), /* OUTBOUND (SEND) STATE         33650000
*                                                            @G70AKFZ*/ 33700000
*     TVWADS1I BIT(2) CONSTANT('10'B), /* INBOUND (RECEIVE) STATE       33750000
*                                                            @G70AKFZ*/ 33800000
*     TVWADS1S BIT(2) CONSTANT('11'B); /* PENDING SEND STATE - SIGNAL   33850000
*                                      HAS BEEN SENT         @G70AKFZ*/ 33900000
*   DCL                             /* TVWADIRS CODES FOR LU2           33950000
*                                      DEVICES               @G70AKFZ*/ 34000000
*     TVWADS2R BIT(2) CONSTANT('00'B), /* RESET - SEND STATE            34050000
*                                                            @G70AKFZ*/ 34100000
*     TVWADS2O BIT(2) CONSTANT('00'B), /* OUTBOUND (SEND) STATE         34150000
*                                                            @G70AKFZ*/ 34200000
*     TVWADS2I BIT(2) CONSTANT('01'B), /* INBOUND (RECEIVE) STATE       34250000
*                                                            @G70AKFZ*/ 34300000
*     TVWADS2S BIT(2) CONSTANT('10'B), /* PENDING SEND STATE - SIGNAL   34350000
*                                      HAS BEEN SENT         @G70AKFZ*/ 34400000
*     TVWADS2C BIT(2) CONSTANT('11'B); /* CONTENTION STATE   @G70AKFZ*/ 34450000
*   DCL                             /* TVWAKEYB CODES        @G70AKFZ*/ 34500000
*     TVWAKBRS BIT(2) CONSTANT('00'B), /* RESET - LOCKED     @G70AKFZ*/ 34550000
*     TVWAKBLK BIT(2) CONSTANT('00'B), /* RESET - LOCKED     @G70AKFZ*/ 34600000
*     TVWAKBPU BIT(2) CONSTANT('01'B), /* PHYSICALLY UNLOCKED BUT       34650000
*                                      LOGICALLY LOCKED - STATE         34700000
*                                      OCCURS ONLY IN CONTENTION        34750000
*                                      MODE                  @G70AKFZ*/ 34800000
*     TVWAKBLU BIT(2) CONSTANT('10'B), /* LOGICALLY UNLOCKED BUT        34850000
*                                      PHYCIALLY LOCKED      @G70AKFZ*/ 34900000
*     TVWAKBUL BIT(2) CONSTANT('11'B); /* PHYSICALLY AND LOGICALLY      34950000
*                                      UNLOCKED              @G70AKFZ*/ 35000000
*   DCL                             /* TVWACSFS CODES        @R506200*/ 35050000
*     TVWACSRS FIXED(8) CONSTANT(0),/* RESET - SINGLE BYTE   @R506200*/ 35100000
*     TVWACSSB FIXED(8) CONSTANT(0),/* SINGLE BYTE           @R506200*/ 35150000
*     TVWACSDP FIXED(8) CONSTANT(1),/* DOUBLE BYTE PENDING - A SHIFTOUT 35200000
*                                      HAS BEEN FOUND        @R506200*/ 35250000
*     TVWACSDB FIXED(8) CONSTANT(2),/* DOUBLE BYTE           @R506200*/ 35300000
*     TVWACSSO FIXED(8) CONSTANT(3);/* SHIFTOUT REQUIRED - A DOUBLE     35350000
*                                      BYTE STRING WAS INTERRUPTED      35400000
*                                                            @R506200*/ 35450000
*   DCL                                                                 35500000
*     TVWAQMAD CONSTANT(304);       /* LENGTH OF AUTODATA AREA FOR      35550000
*                                      IKTQMNGR AND IKTVTGTF @ZMB6618*/ 35600000
