*%GOTO   IEDBPRLG;               /* BILINGUAL MAPPING                   00050000
         MACRO                                                          00100000
         IOSDIEDB                                                       00150000
**/%IEDBPRLG: ;                                                         00200000
*/*** Start of Specifications ****************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* Macro Name: IOSDIEDB                                          */ 00350000
*/*                                                                  */ 00450000
*/*01* Descriptive Name: I/O Error Data Block                        */ 00500000
*/*                                                                  */ 00600000
*/*02*   Acronym:  IEDB                                              */ 00616600
*/*                                                                  */ 00633200
*/*02*   Dsect Name: IOSDIEDB                                        */ 00649800
*/*                                                                  */ 00666400
*/*01* Proprietary Statement:                                        */ 00683000
*/*                                                                  */ 00700000
*/*         Licensed materials - Property of IBM                     */ 00750000
*/*         This macro is "RESTRICTED MATERIALS OF IBM"              */ 00800000
*/*         5647-A01 (C) Copyright IBM Corporation 1991,1999     @L1C*/ 00850000
*/*                                                                  */ 00950000
*/*01* Status = JBB6607                                          @L1C*/ 01000000
*/*                                                                  */ 01050000
*/*01* Component: I/O Supervisor (SC1C3)                             */ 01075000
*/*                                                                  */ 01100000
*/*01* Function:                                                     */ 01125000
*/*         An optional control block used by users of EXCP or of    */ 01150000
*/*         the I/O driver interface.  EXCP uses this block to       */ 01200000
*/*         save error data related to an EXCP request.  This        */ 01250000
*/*         data is obtained from the ERP Work Area (EWA).           */ 01300000
*/*                                                                  */ 01350000
*/*         I/O drivers may use this for the same reason, ie, to     */ 01400000
*/*         save data from one exit to another even after the EWA    */ 01450000
*/*         has been freed.  However, like EXCP, the I/O driver's    */ 01500000
*/*         normal or abnormal exit is expected to set the data      */ 01550000
*/*         in this field from the EWA.  IOS does not provide        */ 01600000
*/*         this data for the user.                                  */ 01650000
*/*                                                                  */ 01700000
*/*                                                                  */ 01750000
*/*01* Eye-Catcher: IEDB                                             */ 01787500
*/*02*   Offset:    0                                                */ 01825000
*/*02*   Length:    4                                                */ 01862500
*/*                                                                  */ 01900000
*/*01* Created by:  Issuer of EXCP or STARTIO                        */ 01950000
*/*                                                                  */ 02000000
*/*01* Deleted by:  Issuer of EXCP or STARTIO                        */ 02050000
*/*                                                                  */ 02150000
*/*01* Pointed to by:  IOBEIEDB for EXCP or STARTIO                  */ 02200000
*/*                                                                  */ 02300000
*/*01* Size:  48-bytes                                               */ 02350000
*/*                                                                  */ 02450000
*/*01* Module Type:  Mapping Macro                                   */ 02500000
*/*                                                                  */ 02600000
*/*01* Method of access                                              */ 02650000
*/*                                                                  */ 02750000
*/*         ASM:  IOSDIEDB                                           */ 02800000
*/*                                                                  */ 02850000
*/*         PL/X:                                                    */ 02900000
*/*                                                                  */ 03750000
*/*         %INCLUDE SYSLIB(IOSDIEDB)                                */ 03800000
*/*                                                                  */ 03850000
*/*         The default storage attribute is BASED.  The             */ 03900000
*/*         storage expression may be overridden using the           */ 03950000
*/*         macro variable %IEDBBASE.                                */ 04000000
*/*                                                                  */ 04050000
*/*         For example,                                             */ 04100000
*/*           %IEDBBASE = 'BASED(IEDBPTR)'                           */ 04150000
*/*                                                                  */ 04200000
*/*           This creates a mapping of the IEDB based on IEDBPTR.   */ 04250000
*/*                                                                  */ 04300000
*/*01* Dependencies:  None                                           */ 04350000
*/*                                                                  */ 04400000
*/*01* Restrictions:  None                                           */ 04450000
*/*                                                                  */ 04500000
*/*01* Serialization: None                                           */ 04550000
*/*                                                                  */ 04650000
*/*01* Storage Attributes:                                           */ 04657100
*/*02*  Subpool:     User                                            */ 04664200
*/*02*  Key:         User                                            */ 04671300
*/*02*  Data Space:  No                                              */ 04678400
*/*02*  Residency:   Any                                             */ 04685500
*/*02*  Frequency:   One per EXCP                                    */ 04692600
*/*                                                                  */ 04699700
*/*01* Distribution Library (DLIB):  AMACLIB                         */ 04706800
*/*                                                                  */ 04713900
*/*01* External Classification: GUPI                                 */ 04721000
*/*01* End of External Classification:                               */ 04728100
*/*                                                                  */ 04735200
*/*01* Change Activity:                                              */ 04742300
*/*                                                                  */ 04750000
*/*  $MAC(IOSDIEDB),COMP(SC1C3):                                     */ 04800000
*/*                                                                  */ 04850000
*/*   PN REASON  RELEASE  DATE   ORG   COMMENTS                      */ 04900000
*/*  $L0=OY39007 JBB2220 910331 PDLL: Expanded EXCP interface        */ 04950000
*/*  $L1=HERMS   JBB6607 980302 PDLE  FICON Support              @L1A*/ 04975000
*/*                                                                  */ 05000000
*/*  $01=OW38541 HBB6603 990430 PDLE: FICON support              @01A*/ 05050000
*/*                                                                  */ 05100000
*/*** End of Specifications ******************************************/ 05150000
*%GOTO IEDBPLAS;                    /*                                  05350000
         SPACE 1                                                        05400000
IEDB     DSECT                         I/O Error Data Block             05450000
         SPACE 1                                                        05500000
IEDBID   DS    CL4                     Eye catcher.  Must be IEDB.      05550000
IEDBVERS DS    XL1                     Version number.                  05600000
IEDBFLG1 DS    BL1                     Flags field.                     05650000
IEDBBDSN EQU   X'80'                   The sense data was determined to 05700000
*                                      be invalid and contains '10FE'x. 05750000
*        EQU   X'40'                   Reserved                         05800000
*        EQU   X'20'                   Reserved                         05850000
*        EQU   X'10'                   Reserved                         05900000
*        EQU   X'08'                   Reserved                         05950000
*        EQU   X'04'                   Reserved                         06000000
*        EQU   X'02'                   Reserved                         06050000
*        EQU   X'01'                   Reserved                         06100000
IEDBCOD  DS    CL1                     I/O completion code field.  This 06150000
*                                      is the original completion code  06200000
*                                      prior to EXCP changing it.       06250000
         DS    CL1                     Reserved.                        06300000
IEDBSNS  DS    0CL32                   Sense data.                      06350000
IEDBSN00 DS    CL1                     Sense byte 0.                    06400000
IEDBSN01 DS    CL1                     Sense byte 1.                    06450000
IEDBSN02 DS    CL1                     Sense byte 2.                    06500000
IEDBSN03 DS    CL1                     Sense byte 3.                    06550000
IEDBSN04 DS    CL1                     Sense byte 4.                    06600000
IEDBSN05 DS    CL1                     Sense byte 5.                    06650000
IEDBSN06 DS    CL1                     Sense byte 6.                    06700000
IEDBSN07 DS    CL1                     Sense byte 7.                    06750000
IEDBSN08 DS    CL1                     Sense byte 8.                    06800000
IEDBSN09 DS    CL1                     Sense byte 9.                    06850000
IEDBSN10 DS    CL1                     Sense byte 10.                   06900000
IEDBSN11 DS    CL1                     Sense byte 11.                   06950000
IEDBSN12 DS    CL1                     Sense byte 12.                   07000000
IEDBSN13 DS    CL1                     Sense byte 13.                   07050000
IEDBSN14 DS    CL1                     Sense byte 14.                   07100000
IEDBSN15 DS    CL1                     Sense byte 15.                   07150000
IEDBSN16 DS    CL1                     Sense byte 16.                   07200000
IEDBSN17 DS    CL1                     Sense byte 17.                   07250000
IEDBSN18 DS    CL1                     Sense byte 18.                   07300000
IEDBSN19 DS    CL1                     Sense byte 19.                   07350000
IEDBSN20 DS    CL1                     Sense byte 20.                   07400000
IEDBSN21 DS    CL1                     Sense byte 21.                   07450000
IEDBSN22 DS    CL1                     Sense byte 22.                   07500000
IEDBSN23 DS    CL1                     Sense byte 23.                   07550000
IEDBSN24 DS    CL1                     Sense byte 24.                   07600000
IEDBSN25 DS    CL1                     Sense byte 25.                   07650000
IEDBSN26 DS    CL1                     Sense byte 26.                   07700000
IEDBSN27 DS    CL1                     Sense byte 27.                   07750000
IEDBSN28 DS    CL1                     Sense byte 28.                   07800000
IEDBSN29 DS    CL1                     Sense byte 29.                   07850000
IEDBSN30 DS    CL1                     Sense byte 30.                   07900000
IEDBSN31 DS    CL1                     Sense byte 31.                   07950000
         DS    CL4                     Reserved for future CSW          07957100
*                                      expansion                  @01C  07964200
IEDB2CSW DS    F                       If the I/O requestor allowed     07971300
*                                      prefetching of CCWs and data     07978400
*                                      (IOBEP/IOSP) and specified       07985500
*                                      that it wants to see both the    07992600
*                                      channel and CU ending CCW        07999700
*                                      address for errors that occur    08006800
*                                      when the CU executes ahead of    08013900
*                                      the channel and the 2nd CCW      08019000
*                                      address is valid, this field     08024100
*                                      contains the virtual CCW         08029200
*                                      address of the last CCW          08034300
*                                      executed by the control          08039400
*                                      unit                       @01C  08044700
IEDBEND  EQU   *                       End of IEDB.                     08050000
IEDBLNTH EQU   IEDBEND-IEDB            Length of IEDB.                  08100000
IEDBVRSC EQU  1                        Version number.                  08150000
         MEND ,                                                      */ 08200000
*%IEDBPLAS: ;                                                           08250000
*%IF IEDBBASE = '' %THEN                                                08300000
*    % IEDBBASE = 'BASED';                                              08350000
*DCL 1 IEDB IEDBBASE,               /* I/O Error Data Block.         */ 08400000
*      3 IEDBID   CHAR(4),          /* Eye catcher.                  */ 08450000
*      3 IEDBVERS FIXED(8),         /* Version number.               */ 08500000
*      3 IEDBFLG1 BIT(8),           /* Flags field.                  */ 08550000
*        5 IEDBBDSN BIT(1),         /* The sense data was determined to 08600000
*                                      be invalid and contains '10FE'x. 08650000
*                                                                    */ 08700000
*        5 *        BIT(7),         /* Reserved.                     */ 08750000
*      3 IEDBCOD  CHAR(1),          /* I/O completion code field.  This 08800000
*                                      is the original completion code  08850000
*                                      prior to EXCP changing it.    */ 08900000
*      3 *        CHAR(1),          /* Reserved.                     */ 08950000
*      3 IEDBSNS  CHAR(32),         /* Sense data.                   */ 09000000
*        5 IEDBSN00 CHAR(1),        /* Sense byte 0.                 */ 09050000
*        5 IEDBSN01 CHAR(1),        /* Sense byte 1.                 */ 09100000
*        5 IEDBSN02 CHAR(1),        /* Sense byte 2.                 */ 09150000
*        5 IEDBSN03 CHAR(1),        /* Sense byte 3.                 */ 09200000
*        5 IEDBSN04 CHAR(1),        /* Sense byte 4.                 */ 09250000
*        5 IEDBSN05 CHAR(1),        /* Sense byte 5.                 */ 09300000
*        5 IEDBSN06 CHAR(1),        /* Sense byte 6.                 */ 09350000
*        5 IEDBSN07 CHAR(1),        /* Sense byte 7.                 */ 09400000
*        5 IEDBSN08 CHAR(1),        /* Sense byte 8.                 */ 09450000
*        5 IEDBSN09 CHAR(1),        /* Sense byte 9.                 */ 09500000
*        5 IEDBSN10 CHAR(1),        /* Sense byte 10.                */ 09550000
*        5 IEDBSN11 CHAR(1),        /* Sense byte 11.                */ 09600000
*        5 IEDBSN12 CHAR(1),        /* Sense byte 12.                */ 09650000
*        5 IEDBSN13 CHAR(1),        /* Sense byte 13.                */ 09700000
*        5 IEDBSN14 CHAR(1),        /* Sense byte 14.                */ 09750000
*        5 IEDBSN15 CHAR(1),        /* Sense byte 15.                */ 09800000
*        5 IEDBSN16 CHAR(1),        /* Sense byte 16.                */ 09850000
*        5 IEDBSN17 CHAR(1),        /* Sense byte 17.                */ 09900000
*        5 IEDBSN18 CHAR(1),        /* Sense byte 18.                */ 09950000
*        5 IEDBSN19 CHAR(1),        /* Sense byte 19.                */ 10000000
*        5 IEDBSN20 CHAR(1),        /* Sense byte 20.                */ 10050000
*        5 IEDBSN21 CHAR(1),        /* Sense byte 21.                */ 10100000
*        5 IEDBSN22 CHAR(1),        /* Sense byte 22.                */ 10150000
*        5 IEDBSN23 CHAR(1),        /* Sense byte 23.                */ 10200000
*        5 IEDBSN24 CHAR(1),        /* Sense byte 24.                */ 10250000
*        5 IEDBSN25 CHAR(1),        /* Sense byte 25.                */ 10300000
*        5 IEDBSN26 CHAR(1),        /* Sense byte 26.                */ 10350000
*        5 IEDBSN27 CHAR(1),        /* Sense byte 27.                */ 10400000
*        5 IEDBSN28 CHAR(1),        /* Sense byte 28.                */ 10450000
*        5 IEDBSN29 CHAR(1),        /* Sense byte 29.                */ 10500000
*        5 IEDBSN30 CHAR(1),        /* Sense byte 30.                */ 10550000
*        5 IEDBSN31 CHAR(1),        /* Sense byte 31.                */ 10600000
*      3 *        CHAR(4),          /* Reserved for future CSW          10607100
*                                      expansion                 @01C*/ 10614200
*      3 IEDB2CSW PTR(31);          /* If the I/O requestor allowed     10621300
*                                      prefetching of CCWs and data     10628400
*                                      (IOBEP/IOSP) and specified       10635500
*                                      that it wants to see both the    10642600
*                                      channel and CU ending CCW        10649700
*                                      address for errors that occur    10656800
*                                      when the CU executes ahead of    10663900
*                                      the channel and the 2nd CCW      10669000
*                                      address is valid, this field     10674100
*                                      contains the virtual CCW         10679200
*                                      address of the last CCW          10684300
*                                      executed by the control          10689400
*                                      unit                      @01C*/ 10694700
*                                                                       10700000
*DCL IEDBIDC      CHAR(4) CONSTANT('IEDB'); /* Eye catcher constant. */ 10750000
*DCL IEDBVRSC     FIXED(8) CONSTANT(1); /* Version number.           */ 10800000
*DCL IEDBLNTH     FIXED(31) CONSTANT(LENGTH(IEDB)); /* Length of the    10850000
*                                      IEDB.                         */ 10900000
