* %      GOTO DCCPLS1;             /* BILINGUAL MAPPING                 00050000
         MACRO                                                          00100000
         IOSDDCCD                                                       00150000
*                                  */                                   00200000
*%DCCPLS1: ;                       /*                                */ 00250000
*/*START OF SPECIFICATIONS ******************************************** 00300000
*                                                                       00350000
* MACRO-NAME: IOSDDCCD                                                  00400000
*                                                                       00450000
* DESCRIPTIVE-NAME: Dynamic Configuration Change Data                   00500000
*                                                                       00550000
*  ACRONYM: DCCD                                                        00553800
*                                                                       00557600
* COMPONENT:  I/O Supervisor (SC1C3)                                    00565200
*                                                                       00572800
* EYE-CATCHER: DCCD                                                     00576600
*                                                                       00580400
*     OFFSET: 0                                                         00584200
*                                                                       00588000
*     LENGTH: 4                                                         00591800
*                                                                       00595600
* PROPRIETARY STATEMENT =                                               00645600
*  LICENSED MATERIALS - PROPERTY OF IBM                                 00695600
*  THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                         00745600
*  5647-A01 (C) COPYRIGHT IBM CORP. 1990,2000                    @P5C   00795600
*                                                                       00900000
* STATUS = HBB7703                                               @L3C   00950000
*                                                                       01000000
* FUNCTION:  IOSDDCCD maps the Dynamic Configuration Change Data        01050000
*            which contains the I/O components and                      01079100
*            coupling facility components                               01108200
*            that were changed as a result of a dynamic configuration   01137400
*            change.  The DCCD is passed as input to the CONFCHG        01181100
*            CHGREQ and CONFCHG CHGCOMPL exits.  In addition, fields    01224800
*            from the DCCD are placed in the SMF record type 22         01268500
*            subtype 9, which identifies a dynamic configuration        01312200
*            change.                                               @D1C 01355900
*                                                                       01400000
* METHOD-OF-ACCESS:                                                     01450000
*                                                                       01500000
*   PLAS: %INCLUDE SYSLIB(IOSDDCCD)                                     01550000
*   ASSEMBLER: IOSDDCCD                                                 01600000
*                                                                       01650000
* POINTED-TO-BY: Register 1 points to the address of IOSDDCCD when      01670800
*                the Configuration Change Exit receives control.        01691600
*                                                                       01712500
*01* DSECT Name: DCCD, DCCDARRY, DCCDEDEV, DCCDEPCU, DCCDECHP           01731200
*                                                                       01750000
* CREATED-BY: The IOS Configuration Change Manager.                     01800000
*                                                                       01850000
* DELETED-BY: The IOS Configuration Change Manager.                     01900000
*                                                                       01950000
* STORAGE-ATTRIBUTES:                                                   02000000
*                                                                       02050000
*   ALLOCATION-METHOD: GETMAIN                                          02100000
*                                                                       02150000
*   SUBPOOL: 1                                                          02200000
*                                                                       02250000
*   KEY: 0                                                              02300000
*                                                                       02312500
*                                                                       02325000
* SIZE: VARIABLE                                                        02337500
*                                                                       02350000
* SERIALIZATION: None                                                   02400000
*                                                                       02450000
* DEPENDENCIES: None                                                    02500000
*                                                                       02550000
* NOTES: None                                                           02600000
*                                                                       02650000
* EXTERNAL CLASSIFICATION: GUPI                                         02662500
* END OF EXTERNAL CLASSIFICATION:                                       02675000
*                                                                       02687500
* CHANGE-ACTIVITY:                                                      02700000
*   $L0=DYNAM,HBB4410,891231,PDLG: Dynamic I/O Configuration            02750000
*   $L1=PRSMM,HBB4430,911202,PDLQ: MIF support                          02753500
*   $L2=SYSLK,HBB5510,930325,PDLS: Dynamic XES support. Added two new   02754200
*                                  entries DCCDMDEV and DCCDMP for      02754900
*                                  coupling facility device and         02755200
*                                  coupling facility control unit  @L2A 02755500
*   $L3=DYCHM,HBB7703,991231,PDGG: Add new request code for DCCDEREQU   02755600
*                                                                  @L3A 02755700
*   $L4=DYCHM,HBB7703,991231,PDGG: Add logical control unit number for  02755800
*                                  RMF                             @L4A 02755900
*                                                                       02756000
*   $D1=DIG0108,HBB5510,930520,PDLS: Name changes                  @D1A 02756100
*                                                                       02756400
*   $P1=PEO4245,HBB4410,900508,PDLG: Split up 2-byte flag fields with   02757100
*                                  equates into 1-byte fields, so       02764200
*                                  that TM can be used in assembler.    02771300
*                                  Also create constant for length      02778400
*                                  of a CCB entry in assembler          02785500
*                                  version.                             02792600
*   $P2=PKB3748 HBB4430 920729 PDLS: DCCD and SMF record changes for    02795000
*                                  activating partition indicator  @P2A 02797400
*   $P3=PIG2270 HBB5510 930823 PDLU: Prolog updates                @P3A 02798700
*   $P4=PIG3270 HBB5510 931104 PDLU: Prolog updates, CDPI          @P4A 02799300
*   $P5=PXD1206 HBB7703 990131 PDNO: Propcheck errors on copyright      02799500
*                                    statement.                    @P5A 02799700
*                                                                       02799760
*   $01=OW45982 HBB7703 000910 PDDR: Correct assembly errors and        02799820
*                                    add new fields/constants      @01A 02799880
*   $02=OW47846 HBB7703 010815 PDNO: Pass device type information       02799950
*                                    for delete device requests    @02A 02799960
*                                                                       02800000
*END OF SPECIFICATIONS ***********************************************/ 02850000
*%GOTO DCCPLS2;   /*                                                    02900000
         SPACE 1                                                        02950000
DCCD     DSECT                                                          03000000
DCCDHDR  EQU   *                   Header information                   03050000
DCCDID   DS    CL4                 Control block acronym                03100000
DCCDVERN DS    XL1                 DCCD version number                  03150000
DCCDFUNC DS    FL1                 For CONFCHG CHGREQ exit, indicates   03200000
*                                  function to be performed. Otherwise, 03250000
*                                  zero.                                03300000
DCCDFLGS DS    B                   Flags                           @P1C 03333300
DCCDSOFT EQU   X'80'               Software-only configuration          03366600
*                                  change                          @P1C 03399900
*        EQU   X'7F'               Reserved                        @P1C 03433200
         DS    B                   Reserved                        @P1C 03466500
DCCDSIZE DS    F                   Total size of DCCD                   03500000
DCCDSTRT DS    F                   Offset of first DCCD entry           03550000
DCCDENTC DS    F                   Number of entries in the DCCD        03600000
DCCDIODF DS    0CL48               IODF dataset which contains new      03650000
*                                  configuration                        03700000
DCCDIODN DS    CL44                IODF dataset name                    03750000
         DS    CL4                 Reserved                             03800000
DCCDEDT  DS    CL2                 ID of new EDT                        03850000
         DS    CL2                 Reserved                        @01C 03919990
DCCDCFID DS    CL8                 Operating system configuration ID    03950000
*                                  for new configuration                04000000
DCCD#UA  DS    F                   Number of UCBs added                 04050000
DCCD#UD  DS    F                   Number of UCBs deleted               04100000
DCCDACTF DS    FL1                 Activate function requested          04112500
*                                  (activate or recover)                04125000
         DS    CL3                 Reserved                             04137500
DCCDHLEN EQU   *-DCCD              Length of DCCD header                04150000
         SPACE 1                                                        04200000
*********************************************************************** 04250000
*                                                                     * 04300000
* The following structure maps the DCCD entry array.                  * 04350000
*                                                                     * 04400000
*********************************************************************** 04450000
DCCDARRY DSECT                     DCCD entry array                     04500000
DCCDE    DS    0XL32               DCCD entry                           04550000
DCCDEHDR DS    0F                  DCCD entry header                    04600000
DCCDETYP DS    XL1                 DCCD entry type                      04650000
DCCDEREQ DS    XL1                 DCCD entry request type              04700000
DCCDEFLG DS    B                   DCCD entry flags                @P1C 04750000
DCCDEHDW EQU   X'80'               Hardware change                 @P1C 04800000
DCCDESFT EQU   X'40'               Software change                 @P1C 04850000
DCCDESTA EQU   X'20'               Indicates that this entry was        04900000
*                                  created because a static device      04950000
*                                  is being changed to a dynamic        05000000
*                                  device. This entry represents the    05050000
*                                  delete request (DCCDEREQ=DCCDDDEL).  05100000
*                                  There will be another entry which    05150000
*                                  represents the add request.     @P1C 05200000
DCCDECON EQU   X'10'               Indicates whether UCB for device is  05250000
*                                  connected to a subchannel. Valid     05300000
*                                  only when DCCDETYP=DCCDDEV and       05350000
*                                  DCCDEREQ=DCCDADD. Also, valid only   05400000
*                                  for CONFCHG CHGCOMPL exit       @P1C 05435700
*        EQU   X'0C'               Reserved                        @P2C 05438600
DCCDEAP  EQU   X'02'               The activating partition will lose   05441500
*                                  access to the device because either  05444400
*                                  the device is deleted from the       05447300
*                                  configuration, or the activating     05450200
*                                  partition is being removed from the  05453100
*                                  candidate list of the device.        05456000
*                                  Valid when:                          05458900
*                                  DCCDETYP=DCCDDEV and                 05461800
*                                    DCCDEREQ=DCCDDDEL             @P2A 05464700
DCCDECC  EQU   X'01'               Indicates that this entry was        05467600
*                                  created because the candidate        05470500
*                                  list of the device was changed.      05473400
*                                  When DCCDETYP=DCCDDEV,               05476300
*                                  DCCDEREQ=DCCDDDEL and DCCDECC        05479200
*                                  is on, partition(s)                  05482100
*                                  were deleted from the device         05485000
*                                  candidate list.                      05487900
*                                  When DCCDETYP=DCCDDEV,               05490800
*                                  DCCDEREQ=DCCDDADD and DCCDECC        05493700
*                                  is on, partition(s)                  05496600
*                                  were added to the device             05499500
*                                  candidate list.                 @P2A 05502400
         DS    B   '               Reserved                        @P1C 05507100
DCCDENTY DS    XL28                Entry type specific information      05542800
*                                  described below                 @P1C 05578500
DCCDELEN EQU   *-DCCDARRY          Length of DCCD entry            @P1A 05614200
         SPACE 1                                                        05650000
*********************************************************************** 05700000
*                                                                     * 05750000
* The following structure provides the mapping for device             * 05800000
* entries in the DCCD (DCCDETYP = DCCDDEV or DCCDMDEV).           @L2C* 05850000
*                                                                     * 05900000
*********************************************************************** 05950000
DCCDEDEV ORG   DCCDENTY            DCCD device entry                    06000000
DCCDDEVN DS    FL2                 Device number                        06050000
DCCDDEVA DS   0CL26                Device entry area               @02A 06070000
DCCDDCMK DS    BL1                 Mask of CHPIDs contained in DCCDDCHP 06100000
*                                  that are to be added/deleted from    06150000
*                                  this device. Valid only when         06200000
*                                  DCCDEREQ = DCCDDAC, DCCDDDC, DCCDDDP 06250000
*                                  or DCCDDDP. Otherwise, zero.         06300000
DCCDDPMK DS    BL1                 Mask of physical control unit        06350000
*                                  numbers in DCCDDPCU that are to be   06400000
*                                  added/deleted from this device.      06450000
*                                  Valid only when DCCDEREQ = DCCDDAP   06500000
*                                  or DCCDDP. Otherwise, zero.          06550000
DCCDDCHP DS    8FL1                Array of CHPIDs that are to be       06600000
*                                  added/deleted from this device.      06650000
*                                  Valid only when DCCDEREQ = DCCDDAC,  06700000
*                                  DCCDDDC, DCCDDDP or DCCDDAP.         06750000
*                                  Otherwise, zero.                     06800000
DCCDDPCU DS    8FL2                Array of physical control unit       06850000
*                                  numbers that are to be               06900000
*                                  added/deleted from this device.      06950000
*                                  Valid only when DCCDEREQ = DCCDDAP   07000000
*                                  or DCCDDDP. Otherwise, zero.         07050000
*---------------------------------------------------------------------* 07052000
*  Remap of the device entry area when DCCDEREQ = DCCDDDEL        @02A* 07054000
*---------------------------------------------------------------------* 07056000
         ORG DCCDDEVA              Remap of area to be used when        07058000
*                                  DCCDEREQ = DCCDDDEL            @02A  07060000
DCCDDTYP DS    BL1                 Device type.  This field is copied   07062000
*                                  from UCBTBYT3                  @02A  07064000
DCCDDTYF DS    B                   Device type flags              @02A  07066000
*------------------- Unit Record Flags                            @02A  07068000
DCCDSWTC EQU   X'80'               If 1, indicates that the device      07070000
*                                  being deleted is a switch device.    07072000
*                                  Valid when DCCDDTYP indicates a      07074000
*                                  device type of Unit Record     @02A  07076000
*------------------- DASD Flags                                   @02A  07078000
DCCDPAVB EQU   X'80'               If 1, indicates that the device      07080000
*                                  being deleted is a PAV Base device.  07082000
*                                  Valid when DCCDDTYP indicates a      07084000
*                                  device type of DASD            @02A  07086000
DCCDPAVA EQU   X'40'               If 1, indicates that the device      07088000
*                                  being deleted is a PAV Alias         07090000
*                                  device.  Valid when DCCDDTYP         07092000
*                                  indicates a device type of           07094000
*                                  DASD                           @02A  07096000
         DS    CL24                Reserved for future use        @02A  07098000
         SPACE 1                                                        07100000
*********************************************************************** 07150000
*                                                                     * 07200000
* The following structure provides the mapping for control unit       * 07250000
* entries in the DCCD (DCCDETYP = DCCDPCU or DCCDMP).             @L2C* 07300000
*                                                                     * 07350000
*********************************************************************** 07400000
DCCDEPCU ORG   DCCDENTY            DCCD control unit entry              07450000
DCCDPCUN DS    FL2                 Physical control unit number         07500000
DCCDFLG2 DS    B                   Flag byte                       @01C 07559990
DCCDVLD  EQU   X'80'               If 1, indicates that DCCDLCU,        07569980
*                                  DCCDSBC, DCCDCUBC, and DCCDSCNT      07579970
*                                  are valid                       @01A 07589960
DCCDPCMK DS    BL1                 Mask of channel path IDs that are to 07600000
*                                  be added/deleted from this CU. Valid 07650000
*                                  only when DCCDEREQ = DCCDPAC or      07700000
*                                  DCCDPDC. Otherwise, zero.            07750000
DCCDPCHP DS    8FL1                Array of CHPIDs that are to be       07800000
*                                  added/deleted from this CU. Valid    07850000
*                                  only when DCCDEREQ = DCCDPAC or      07900000
*                                  DCCDPDC. Otherwise, zero.            07950000
DCCDPUA  DS    0F                  Represents the range of unit         08000000
*                                  addresses that are to be added to or 08050000
*                                  deleted from the control unit. Valid 08100000
*                                  only when DCCDEREQ = DCCDPMA or      08150000
*                                  DCCDPMD. Otherwise, zero.            08200000
         DS    CL1                 Reserved                             08250000
DCCDPUAC DS    XL1                 Count of unit addresses              08300000
         DS    CL1                 Reserved                             08350000
DCCDPSUA DS    XL1                 Starting unit address                08400000
*********************************************************************** 08402000
*                                                                     * 08404000
* The following fields are counts required by RMF. They are only      * 08406000
* valid when DCCDVLD is 1 and either DCCDACTF=DCCDDCM or              * 08408000
* DCCDACTF=DCCDIMCU.                                                  * 08410000
*                                                                 @01A* 08412000
*********************************************************************** 08414000
DCCDSBC  DS    F                   Switch busy count               @01A 08416000
DCCDCUBC DS    F                   Control unit busy count         @01A 08418000
DCCDSCNT DS    F                   Success count                   @01A 08420000
*                                                                       08422000
DCCDFLTN EQU   DCCDPUA+2,2         Number of managed CHPIDs.  Valid     08424000
*                                  only when DCCDACTF=DCCDACTV and      08426000
*                                  DCCDEREQ=DCCDPMNF               @01A 08428000
*                                                                       08430000
DCCDLCU  EQU   DCCDPUA,2           Logical control unit number.         08432000
*                                  Valid only when DCCDACTF=DCCDDCM     08434000
*                                  or DCCDIMCU.                    @01A 08436000
         SPACE 1                                                        08450000
*********************************************************************** 08500000
*                                                                     * 08550000
* The following structure provides the mapping for CHPID              * 08600000
* entries in the DCCD (DCCDETYP = DCCDCHP).                           * 08650000
*                                                                     * 08700000
*********************************************************************** 08750000
DCCDECHP ORG   DCCDENTY            DCCD CHPID entry                     08800000
DCCDCCHP DS    XL1                 Channel path ID                      08850000
         DS    CL3                 Reserved                             08900000
         SPACE 1                                                        08950000
*********************************************************************** 09000000
*                                                                     * 09050000
*    The following constant is used to place an identifier in the     * 09100000
*    DCCD (field DCCDID).                                             * 09150000
*                                                                     * 09200000
*********************************************************************** 09250000
DCCDCBID EQU   C'DCCD'             DCCD control block acronym           09300000
         SPACE 1                                                        09350000
*********************************************************************** 09400000
*                                                                     * 09450000
*    The following constant is used to place the version number in    * 09500000
*    the DCCD (field DCCDVERN).                                       * 09550000
*                                                                     * 09600000
*********************************************************************** 09650000
DCCDCBVN EQU   X'01'               DCCD version number                  09700000
         SPACE 1                                                        09750000
*********************************************************************** 09800000
*                                                                     * 09850000
* The following constants are used to identify the function requested * 09900000
* in DCCDFUNC. These functions are valid only on input to the CONFCHG * 09950000
* CHGREQ exit.                                                        * 10000000
*                                                                     * 10050000
*********************************************************************** 10100000
DCCDFPFC EQU   X'01'               Prepare for configuration change     10150000
DCCDFCCR EQU   X'02'               Configuration change rejected        10200000
         SPACE 1                                                        10250000
*********************************************************************** 10300000
*                                                                     * 10350000
* The following constants are used to identify the function           * 10355000
* in DCCDACTF.                                                        * 10360000
*                                                                     * 10365000
*********************************************************************** 10370000
DCCDACTV EQU   X'01'               Activate function                    10375000
DCCDRECV EQU   X'05'               Recover function                     10380000
DCCDDCM  EQU   X'06'               DCM change function            @L3A  10382500
DCCDIMCU EQU   X'07'               Internal IOS request to modify       10383100
*                                    a control unit (e.g. to            10383700
*                                    remove a managed CHPID)      @01A  10384300
         SPACE 1                                                        10385000
*********************************************************************** 10390000
*                                                                     * 10395000
* The following constants are used to identify the entry type in      * 10400000
* DCCDETYP.                                                           * 10450000
*                                                                     * 10500000
*********************************************************************** 10550000
DCCDDEV  EQU   X'01'               Device entry                         10600000
DCCDPCU  EQU   X'02'               Control unit entry                   10650000
DCCDCHP  EQU   X'03'               CHPID entry                          10700000
DCCDMDEV EQU   X'04'               coupling facility device entry @D1C  10716600
DCCDMP   EQU   X'05'               coupling facility CU entry     @D1C  10733200
         SPACE 1                                                        10750000
*********************************************************************** 10800000
*                                                                     * 10850000
* The following constants define DCCDEREQ when DCCDETYP is            * 10900000
* equal to DCCDDEV or DCCDMDEV.                                   @L2C* 10950000
*                                                                     * 11000000
*********************************************************************** 11050000
DCCDDDEL EQU   X'01'               Delete device                        11100000
DCCDDADD EQU   X'02'               Add device                           11150000
*********************************************************************** 11157100
*                                                                     * 11164200
* The following constants define DCCDEREQ when DCCDETYP is            * 11171300
* equal to DCCDDEV.                                               @L2A* 11178400
*                                                                     * 11185500
*********************************************************************** 11192600
DCCDDDC  EQU   X'03'               Modify to remove CHPID(s)            11200000
DCCDDAC  EQU   X'04'               Modify to add CHPID(s)               11250000
DCCDDDP  EQU   X'05'               Modify to remove CU(s)               11300000
DCCDDAP  EQU   X'06'               Modify to add CU(s)                  11350000
DCCDDMSC EQU   X'07'               Modify subchannel characteristics    11400000
*                                  (illegal status detection and        11450000
*                                  interface timeout facility)          11500000
DCCDDMPP EQU   X'08'               Modify preferred path                11550000
*                                                                 2@P2D 11575000
         SPACE 1                                                        11600000
*********************************************************************** 11650000
*                                                                     * 11700000
* The following constants define DCCDEREQ when DCCDETYP is            * 11750000
* equal to DCCDPCU or DCCDMP.                                     @L2C* 11800000
*                                                                     * 11850000
*********************************************************************** 11900000
DCCDPDEL EQU   X'01'               Delete control unit                  11950000
DCCDPADD EQU   X'02'               Add control unit                     12000000
DCCDPDC  EQU   X'03'               Modify to delete CHPID(s)            12050000
DCCDPAC  EQU   X'04'               Modify to add CHPID(s)               12100000
         SPACE 1                                                  @01A  12103000
*********************************************************************** 12107100
*                                                                     * 12114200
* The following constants define DCCDEREQ when DCCDETYP is            * 12121300
* equal to DCCDPCU.                                               @L2A* 12128400
*                                                                     * 12135500
*********************************************************************** 12142600
DCCDPMDU EQU   X'05'               Modify to delete unit address range  12150000
DCCDPMAU EQU   X'06'               Modify to add unit address range     12200000
DCCDPMNF EQU   X'07'               Modify to change the number          12213290
*                                  of managed CHPIDs              @01C  12218280
DCCDPMDF EQU   X'08'               Modify to delete a managed           12223270
*                                  CHPID                          @01A  12228260
DCCDPMAF EQU   X'09'               Modify to delete a managed           12233250
*                                  CHPID with intent to add a           12238240
*                                  static CHPID                   @01C  12243230
         SPACE 1                                                        12250000
*********************************************************************** 12300000
*                                                                     * 12350000
* The following constants define DCCDEREQ when DCCDETYP is            * 12400000
* equal to DCCDCHP.                                                   * 12450000
*                                                                     * 12500000
*********************************************************************** 12550000
DCCDCDEL EQU   X'01'               Delete CHPID                         12600000
DCCDCADD EQU   X'02'               Add CHPID                            12650000
DCCDCDI  EQU   X'03'               Modify to delete logical             12657100
*                                  partition(s) from the                12664200
*                                  CHPID candidate list            @L1A 12671300
DCCDCAI  EQU   X'04'               Modify to add logical                12678400
*                                  partition(s) to the                  12685500
*                                  CHPID candidate list            @L1A 12692600
         MEND ,                    */                                   12700000
*%DCCPLS2: ;                                                            12750000
* DECLARE                                                               12800000
* 1 DCCD BASED,                   /* Dynamic Configuration Change       12850000
*                                    Data                            */ 12900000
*   3 DCCDHDR BDY(WORD),          /* Header information              */ 12950000
*     5 DCCDID   CHAR(4),         /* Control block acronym           */ 13000000
*     5 DCCDVERN BIT(8),          /* DCCD version number             */ 13050000
*     5 DCCDFUNC FIXED(8),        /* For CONFCHG CHGREQ exit,           13100000
*                                    indicates function to be           13150000
*                                    performed. Otherwise, zero.     */ 13200000
*     5 DCCDFLGS BIT(8),          /* Flags                       @P1C*/ 13250000
*       7 DCCDSOFT BIT(1),        /* Software-only configuration        13300000
*                                    change                      @P1C*/ 13337500
*       7 *        BIT(7),        /* Reserved                    @P1C*/ 13375000
*     5 * BIT(8),                 /* Reserved                    @P1C*/ 13412500
*     5 DCCDSIZE FIXED(31),       /* Total size of DCCD              */ 13450000
*     5 DCCDSTRT  FIXED(31),      /* Offset of first DCCD entry      */ 13500000
*     5 DCCDENTC  FIXED(31),      /* Number of entries in the DCCD   */ 13550000
*     5 DCCDIODF  CHAR(48),       /* IODF dataset which contains new    13600000
*                                    configuration                   */ 13650000
*       7 DCCDIODN CHAR(44),      /* IODF dataset name               */ 13700000
*       7 * CHAR(4),              /* Reserved                        */ 13750000
*     5 DCCDEDT   CHAR(2),        /* ID of new EDT                   */ 13800000
*     5 *         CHAR(2),        /* Reserved                    @01C*/ 13869990
*                                                                       13900000
*     5 DCCDCFID  CHAR(8),        /* Operating system configuration     13950000
*                                    ID for new configuration        */ 14000000
*     5 DCCD#UA   FIXED(31),      /* Number of UCBs added            */ 14050000
*     5 DCCD#UD   FIXED(31),      /* Number of UCBs deleted          */ 14070000
*     5 DCCDACTF  FIXED(8),       /* Activate function requested        14090000
*                                    (activate or recover)           */ 14110000
*     5 * CHAR(3);                /* Reserved                        */ 14130000
*/********************************************************************/ 14150000
*/*                                                                  */ 14200000
*/*  The following structure maps the DCCD entry array.              */ 14250000
*/*                                                                  */ 14300000
*/********************************************************************/ 14350000
* DECLARE                                                               14400000
* 1 DCCDARRY BASED(ADDR(DCCD)+DCCDSTRT) BDY(WORD), /* DCCD entry        14450000
*                                    array                           */ 14500000
*   3 DCCDE(*) BDY(WORD),         /* DCCD entries                    */ 14550000
*     5 DCCDEHDR,                 /* DCCD entry header               */ 14600000
*       7 DCCDETYP FIXED(8),      /* DCCD entry type                 */ 14650000
*       7 DCCDEREQ FIXED(8),      /* DCCD entry request type         */ 14700000
*       7 DCCDEFLG BIT(8),        /* DCCD entry flags            @P1C*/ 14750000
*         9 DCCDEHDW BIT(1),      /* Hardware change                 */ 14800000
*         9 DCCDESFT BIT(1),      /* Software change                 */ 14850000
*         9 DCCDESTA BIT(1),      /* Indicates that this entry was      14900000
*                                  created because a static device      14950000
*                                  is being changed to a dynamic        15000000
*                                  device. This entry represents the    15050000
*                                  delete request (DCCDEREQ=DCCDDDEL).  15100000
*                                  There will be another entry which    15150000
*                                  represents the add request.       */ 15200000
*         9 DCCDECON BIT(1),      /* Indicates whether UCB for device   15250000
*                                  is connected to a subchannel. Valid  15300000
*                                  only when DCCDETYP=DCCDDEV and       15350000
*                                  DCCDEREQ=DCCDADD. Also, valid only   15400000
*                                  for CONFCHG CHGCOMPL exit         */ 15450000
*         9 * BIT(2),             /* Reserved                    @P2C*/ 15452700
*         9 DCCDEAP BIT(1),       /* The activating partition will lose 15455400
*                                  access to the device because either  15458100
*                                  the device is deleted from the       15460800
*                                  configuration, or the activating     15463500
*                                  partition is being removed from the  15466200
*                                  candidate list of the device.        15468900
*                                  Valid when:                          15471600
*                                  DCCDETYP=DCCDDEV and                 15474300
*                                    DCCDEREQ=DCCDDDEL           @P2A*/ 15477000
*         9 DCCDECC BIT(1),       /* Indicates that this entry was      15479700
*                                  created because the candidate        15482400
*                                  list of the device was changed.      15485100
*                                  When DCCDETYP=DCCDDEV,               15487800
*                                  DCCDEREQ=DCCDDDEL and DCCDECC        15490500
*                                  is on, partition(s)                  15493200
*                                  were deleted from the device         15495900
*                                  candidate list.                      15498600
*                                  When DCCDETYP=DCCDDEV,               15501300
*                                  DCCDEREQ=DCCDDADD and DCCDECC        15504000
*                                  is on, partition(s)                  15506700
*                                  were added to the device             15509400
*                                  candidate list.               @P2A*/ 15512100
*       7 * BIT(8),               /* Reserved                    @P1C*/ 15516600
*     5 DCCDENTY CHAR(28) BDY(WORD); /* Entry type specific information 15550000
*                                    described below                 */ 15600000
*/********************************************************************/ 15650000
*/*                                                                  */ 15700000
*/*  The following structure provides the mapping for device         */ 15750000
*/*  entries in the DCCD (DCCDETYP = DCCDDEV or DCCDMDEV)        @L2C*/ 15800000
*/*                                                                  */ 15850000
*/********************************************************************/ 15900000
*DCL 1 DCCDEDEV BASED CHAR(LENGTH(DCCDENTY)) BDY(WORD),                 15950000
*                                      /* DCCD device                   16000000
*                                         entry                      */ 16050000
*       3 DCCDDEVN FIXED(16),          /* Device number              */ 16100000
*       3 DCCDDEVA CHAR(26),           /* Device entry area      @02A*/ 16159990
*         5 DCCDDCMK BIT(8),           /* Mask of CHPIDs contained      16169980
*                                         in DCCDDCHP that are to be    16200000
*                                         added/deleted from this       16250000
*                                         device. Valid only when       16300000
*                                         DCCDEREQ = DCCDDAC, DCCDDDC,  16350000
*                                         DCCDDAP or DCCDDAP.           16400000
*                                         Otherwise, zero.       @02C*/ 16479990
*         5 DCCDDPMK BIT(8),           /* Mask of physical control unit 16509980
*                                         numbers in DCCDDPCU that are  16550000
*                                         to be added/deleted from this 16600000
*                                         device. Valid only when       16650000
*                                         DCCDEREQ = DCCDDAP or         16700000
*                                         DCCDDDP. Otherwise, zero.     16769990
*                                                                @02C*/ 16789980
*         5 DCCDDCHP(8) CHAR(1),       /* Array of CHPIDs that are      16809970
*                                         to be added/deleted from      16850000
*                                         this device. Valid only when  16900000
*                                         DCCDEREQ = DCCDDAC, DCCDDDC,  16950000
*                                         DCCDDAP or DCCDDDP.           17000000
*                                         Otherwise, zero.       @02C*/ 17079990
*         5 DCCDDPCU(8) CHAR(2);       /* Array of physical control     17109980
*                                         unit numbers that are         17150000
*                                         to be added/deleted from      17200000
*                                         this device. Valid only when  17250000
*                                         DCCDEREQ = DCCDDAP or         17300000
*                                         DCCDDDP. Otherwise, zero.     17355990
*                                                                @02C*/ 17361980
*                                                                       17370000
*/*------------------------------------------------------------------*/ 17370900
*/*  Remap of the device entry area when DCCDEREQ = DCCDDDEL     @02A*/ 17371800
*/*------------------------------------------------------------------*/ 17372700
*DCL 1 * CHAR(LENGTH(DCCDDEVA)) DEF(DCCDDEVA), /* Device entry area     17373600
*                                         when DCCDEREQ=DCCDDDEL @02A*/ 17374500
*         5 DCCDDTYP BIT(8),           /* Device type.  This field      17375400
*                                         is copied from UCBTBYT3       17376300
*                                                                @02A*/ 17377200
*         5 DCCDDTYF BIT(8),           /* Device type flags.            17378100
*                                         (Mapped Below)         @02A*/ 17379000
*         5 * CHAR(24);                /* Reserved for future use       17379900
*                                                                @02A*/ 17380800
*DCL 1 * CHAR(LENGTH(DCCDDTYF)) DEF(DCCDDTYF), /* Unit Record           17381700
*                                         flags                  @02A*/ 17382600
*           7 DCCDSWTC BIT(1);         /* If 1, indicates that the      17383500
*                                         device being deleted is a     17384400
*                                         switch device.  Valid when    17385300
*                                         DCCDDTYP indicates a          17386200
*                                         device type of Unit           17387100
*                                         Record                 @02A*/ 17388000
*DCL 1 * CHAR(LENGTH(DCCDDTYF)) DEF(DCCDDTYF), /* DASD flags     @02A*/ 17388900
*           7 DCCDPAVB BIT(1),         /* If 1, indicates that the      17389800
*                                         device being deleted is a     17390700
*                                         PAV Base device.  Valid       17391600
*                                         when DCCDDTYP indicates a     17392500
*                                         device type of DASD    @02A*/ 17393400
*           7 DCCDPAVA BIT(1);         /* If 1, indicates that the      17394300
*                                         device being deleted is a     17395200
*                                         PAV Alias device.  Valid      17396100
*                                         when DCCDDTYP indicates a     17397000
*                                         device type of DASD    @02A*/ 17397900
*/********************************************************************/ 17400000
*/*                                                                  */ 17450000
*/*  The following structure provides the mapping for control unit   */ 17500000
*/*  entries in the DCCD (DCCDETYP = DCCDPCU or DCCDMP)          @L2C*/ 17550000
*/*                                                                  */ 17600000
*/********************************************************************/ 17650000
*DCL 1 DCCDEPCU BASED CHAR(LENGTH(DCCDENTY)) BDY(WORD),                 17700000
*                                      /* DCCD control unit entry    */ 17750000
*       3 DCCDPCUN FIXED(16),          /* Physical control unit         17800000
*                                         number                     */ 17850000
*       3 DCCDFLG2 BIT(8),             /* Flag byte              @01C*/ 17907990
*         5 DCCDVLD BIT(1),            /* If 1, indicates that          17915980
*                                         DCCDLCU, DCCDSBC, DCCDCUBC    17923970
*                                         and DCCDSCNT are valid @01A*/ 17931960
*         5 *       BIT(7),            /* Reserved               @01A*/ 17939950
*       3 DCCDPCMK BIT(8),             /* Mask of channel path IDs      17950000
*                                         that are to be added/deleted  18000000
*                                         from this CU. Valid only when 18050000
*                                         DCCDEREQ = DCCDPAC or         18100000
*                                         DCCDPDC. Otherwise, zero.  */ 18150000
*       3 DCCDPCHP(8) CHAR(1),         /* Array of CHPIDs that are      18200000
*                                         to be added/deleted from      18250000
*                                         this CU. Valid only when      18300000
*                                         DCCDEREQ = DCCDPAC or         18350000
*                                         DCCDPDC. Otherwise, zero.  */ 18400000
*       3 DCCDPUA CHAR(4) BDY(WORD),   /* Represents the range of unit  18450000
*                                         addresses that are to be      18500000
*                                         added to or deleted from the  18550000
*                                         control unit. Valid only when 18600000
*                                         DCCDEREQ = DCCDPMA or         18650000
*                                         DCCDPMD. Otherwise, zero.     18683300
*                                                                @L3C*/ 18716600
*         5 * CHAR(1),                 /* Reserved                   */ 18750000
*         5 DCCDPUAC FIXED(8),         /* Count of unit addresses    */ 18800000
*         5 * CHAR(1),                 /* Reserved                   */ 18841490
*         5 DCCDPSUA FIXED(8),         /* Starting unit address  @01C*/ 18845480
*/********************************************************************/ 18849470
*/*                                                                  */ 18853460
*/*  The following fields are counts required by RMF. They are only  */ 18857450
*/*  valid when DCCDVLD is 1 and either DCCDACTF=DCCDDCM or          */ 18861440
*/*  DCCDACTF=DCCDIMCU.                                              */ 18865430
*/*                                                              @01A*/ 18869420
*/********************************************************************/ 18873410
*       3 DCCDSBC FIXED(31),           /* Switch busy count      @01A*/ 18877400
*       3 DCCDCUBC FIXED(31),          /* Control unit busy count       18881390
*                                                                @01A*/ 18885380
*       3 DCCDSCNT FIXED(31);          /* Success count          @01A*/ 18889370
*DCL DCCDFLTN FIXED(16) DEFINED(DCCDPUA) POS(3);                        18893360
*                                      /* Number of managed CHPIDs.     18897350
*                                         Valid only when               18901340
*                                         DCCDACTF=DCCDACTV and         18905330
*                                         DCCDEREQ=DCCDPMNF      @01A*/ 18909320
*DCL DCCDLCU  FIXED(16) DEFINED(DCCDPUA);                               18913310
*                                      /* Logical control unit          18917300
*                                         number.  Valid only when      18921290
*                                         DCCDACTF=DCCDDCM or           18925280
*                                         DCCDIMCU.              @01A*/ 18929270
*                                                                       18933260
*/********************************************************************/ 18950000
*/*                                                                  */ 19000000
*/*  The following structure provides the mapping for CHPID          */ 19050000
*/*  entries in the DCCD (DCCDETYP = DCCDCHP).                       */ 19100000
*/*                                                                  */ 19150000
*/********************************************************************/ 19200000
*DCL 1 DCCDECHP BASED CHAR(LENGTH(DCCDENTY)) BDY(WORD),                 19250000
*                                      /* DCCD CHPID                    19300000
*                                         entry                      */ 19350000
*       3 DCCDCCHP FIXED(8),           /* Channel path ID            */ 19400000
*       3 *        CHAR(3);            /* Reserved                   */ 19450000
*/********************************************************************/ 19500000
*/*                                                                  */ 19550000
*/*  The following constant is used to place an identifier in the    */ 19600000
*/*  DCCD (field DCCDID).                                            */ 19650000
*/*                                                                  */ 19700000
*/********************************************************************/ 19750000
*DECLARE DCCDCBID CHAR(4) CONSTANT('DCCD'); /* DCCD identifier       */ 19800000
*/********************************************************************/ 19850000
*/*                                                                  */ 19900000
*/*  The following constant is used to place the version number in   */ 19950000
*/*  the DCCD (field DCCDVERN).                                      */ 20000000
*/*                                                                  */ 20050000
*/********************************************************************/ 20100000
*DECLARE DCCDCBVN FIXED(8) CONSTANT(1); /* DCCD version number       */ 20150000
*/********************************************************************/ 20200000
*/*                                                                  */ 20250000
*/*  The following constants are used to identify the function       */ 20300000
*/*  requested in DCCDFUNC. These functions are valid only on input  */ 20350000
*/*  to the CONFCHG CHGREQ exit.                                     */ 20400000
*/*                                                                  */ 20450000
*/********************************************************************/ 20500000
*DECLARE DCCDFPFC FIXED(8) CONSTANT(1);   /* Prepare for configuration  20550000
*                                            change                  */ 20600000
*DECLARE DCCDFCCR FIXED(8) CONSTANT(2);   /* Configuration change       20650000
*                                            rejected                */ 20700000
*/********************************************************************/ 20750000
*/*                                                                  */ 20800000
*/*  The following constants are used to identify the function       */ 20805500
*/*  in DCCDACTF.                                                    */ 20811000
*/*                                                                  */ 20816500
*/********************************************************************/ 20822000
*DECLARE DCCDACTV FIXED(8) CONSTANT(1);   /* Activate function       */ 20827500
*DECLARE DCCDRECV FIXED(8) CONSTANT(5);   /* Recover function        */ 20833000
*DECLARE DCCDDCM  FIXED(8) CONSTANT(6);   /* DCM change function @L3A*/ 20835700
*DECLARE DCCDIMCU FIXED(8) CONSTANT(7);   /* Internal IOS request       20836100
*                                            to modify a control        20836500
*                                            unit (e.g. to delete       20836900
*                                            a managed CHPID)    @01A*/ 20837300
*                                                                       20837700
*/********************************************************************/ 20838500
*/*                                                                  */ 20844000
*/*  The following constant places the entry type in DCCDETYP.       */ 20850000
*/*                                                                  */ 20900000
*/********************************************************************/ 20950000
*DECLARE DCCDDEV  FIXED(8) CONSTANT(1);   /* Device entry            */ 21000000
*DECLARE DCCDPCU  FIXED(8) CONSTANT(2);   /* Control unit entry      */ 21050000
*DECLARE DCCDCHP  FIXED(8) CONSTANT(3);   /* CHPID entry             */ 21100000
*DECLARE DCCDMDEV FIXED(8) CONSTANT(4);   /* coupling facility          21110000
*                                            device entry        @D1C*/ 21120000
*DECLARE DCCDMP   FIXED(8) CONSTANT(5);   /* coupling facility          21130000
*                                            control unit entry  @D1C*/ 21140000
*/********************************************************************/ 21150000
*/*                                                                  */ 21200000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 21250000
*/*  equal to DCCDDEV or DCCDMDEV                                @L2C*/ 21300000
*/*                                                                  */ 21350000
*/********************************************************************/ 21400000
*DECLARE DCCDDDEL FIXED(8) CONSTANT(01), /* Delete device            */ 21450000
*        DCCDDADD FIXED(8) CONSTANT(02), /* Add device               */ 21500000
*/********************************************************************/ 21507100
*/*                                                                  */ 21514200
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 21521300
*/*  equal to DCCDDEV                                            @L2A*/ 21528400
*/*                                                                  */ 21535500
*/********************************************************************/ 21542600
*        DCCDDDC FIXED(8) CONSTANT(03),  /* Modify to remove CHPID(s)*/ 21550000
*        DCCDDAC FIXED(8) CONSTANT(04),  /* Modify to add CHPID(s)   */ 21600000
*        DCCDDDP FIXED(8) CONSTANT(05),  /* Modify to remove CU(s)   */ 21650000
*        DCCDDAP FIXED(8) CONSTANT(06),  /* Modify to add CU(s)      */ 21700000
*        DCCDDMSC FIXED(8) CONSTANT(07), /* Modify subchannel           21750000
*                                           characteristics (illegal    21800000
*                                           status detection, and       21850000
*                                           interface timeout)       */ 21900000
*        DCCDDMPP FIXED(8) CONSTANT(08); /* Modify preferred path       21925000
*                                                                @P2C*/ 21950000
*                                        /*                     2@P2D*/ 21975000
*/********************************************************************/ 22000000
*/*                                                                  */ 22050000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 22100000
*/*  equal to DCCDPCU or DCCDMP                                  @L2C*/ 22150000
*/*                                                                  */ 22200000
*/********************************************************************/ 22250000
*DECLARE DCCDPDEL FIXED(8) CONSTANT(01), /* Delete control unit      */ 22300000
*        DCCDPADD FIXED(8) CONSTANT(02), /* Add control unit         */ 22350000
*        DCCDPDC FIXED(8) CONSTANT(03),  /* Modify to delete CHPID(s)*/ 22400000
*        DCCDPAC FIXED(8) CONSTANT(04),  /* Modify to add CHPID(s)   */ 22450000
*                                                                       22453000
*/********************************************************************/ 22457100
*/*                                                                  */ 22464200
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 22471300
*/*  equal to DCCDPCU.                                           @L2A*/ 22478400
*/*                                                                  */ 22485500
*/********************************************************************/ 22492600
*        DCCDPMDU FIXED(8) CONSTANT(05), /* Modify to delete unit       22500000
*                                           address range            */ 22550000
*        DCCDPMAU FIXED(8) CONSTANT(06), /* Modify to add unit address  22606990
*                                           range                @01C*/ 22613980
*        DCCDPMNF FIXED(8) CONSTANT(07), /* Modify to change the        22620970
*                                           number of managed           22627960
*                                           CHPIDs               @01A*/ 22634950
*        DCCDPMDF FIXED(8) CONSTANT(08), /* Modify to delete a          22641940
*                                           managed CHPID        @01A*/ 22648930
*        DCCDPMAF FIXED(8) CONSTANT(09); /* Modify to delete a          22655920
*                                           managed CHPID with the      22662910
*                                           intent to add a static      22669900
*                                           CHPID                @01A*/ 22676890
*                                                                       22683880
*/********************************************************************/ 22700000
*/*                                                                  */ 22750000
*/*  The following constants define DCCDEREQ when DCCDETYP is        */ 22800000
*/*  equal to DCCDCHP.                                               */ 22850000
*/*                                                                  */ 22900000
*/********************************************************************/ 22950000
*DECLARE DCCDCDEL  FIXED(8) CONSTANT(01), /* Delete CHPID            */ 23000000
*        DCCDCADD  FIXED(8) CONSTANT(02), /* Add CHPID           @L1C*/ 23050000
*        DCCDCDI   FIXED(8) CONSTANT(03), /* Modify to delete logical   23100000
*                                            partition(s) from the      23150000
*                                            CHPID candidate list       23200000
*                                                                @L1A*/ 23450000
*        DCCDCAI   FIXED(8) CONSTANT(04); /* Modify to add logical      23500000
*                                            partition(s) to the        23550000
*                                            CHPID candidate list       23600000
*                                                                @L1A*/ 23650000
