*                                                                       00100000
* %DCL IOSDDEVI_INCLUDED CHAR EXT;                                      00150000
* %DEACTIVATE IOSDDEVI_INCLUDED;                                        00200000
* %IF IOSDDEVI_INCLUDED = '' %THEN                                      00250000
* %DO;                                                                  00300000
*/* Macro made bi-lingual on 97305. CBGEN compile date 97252         */ 00350000
*% /*                                                                   00450000
         MACRO                                                          00500000
         IOSDDEVI &DSECT=YES,&LIST=YES,&TITLE=YES,&DEVI=YES             00550000
         GBLC  &IOSDDEVI_INCLUDED                                       00600000
         GBLC  &ZCBPRINT                                                00650000
&IOSDDEVI_INCLUDED SETC 'YES'                                           00700000
         AIF   ('&LIST' EQ 'NONE').P0                                   00716600
         AIF   ('&TITLE' EQ 'NO').P5                                    00733200
 TITLE   'IOSDDEVI  - Device information mapping                      '*00750000
                                                                        00800000
.P5      ANOP                                                           00825000
**/ IOSDDEVI_1:;                                                        00850000
*/****START OF SPECIFICATIONS*****************************************  00900000
*                                                                       00950000
*01* MACRO-NAME: IOSDDEVI                                               01000000
*                                                                       01050000
*01* DESCRIPTIVE-NAME: Device information mapping                       01100000
*                                                                       01150000
*02*   ACRONYM: DEVI                                                    01200000
*                                                                       01250000
*01*   DSECT-NAME: DEVI                                                 01300000
*                                                                       01350000
*                                                                    */ 01400000
*/*01* PROPRIETARY STATEMENT=                                        */ 01450000
*/***PROPRIETARY_STATEMENT********************************************/ 01500000
*/*                                                                  */ 01550000
*/*                                                                  */ 01600000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01650000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01700000
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1994                            */ 01750000
*/*                                                                  */ 01850000
*/* STATUS= HBB5520                                                  */ 01900000
*/*                                                                  */ 01950000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 02000000
*/*                                                                     02050000
*                                                                       02100000
*01* COMPONENT: IOS (SC1C3)                                             02150000
*                                                                       02200000
*01* EYE-CATCHER: none                                                  02250000
*02*   OFFSET: N/A                                                      02300000
*02*   LENGTH: N/A                                                      02350000
*                                                                       02400000
*01* STORAGE ATTRIBUTES:                                                02450000
*02*   SUBPOOL:  caller-provided                                        02500000
*02*   KEY:  caller-provided                                            02550000
*02*   RESIDENCY: caller-provided                                       02600000
*                                                                       02650000
*01* METHOD OF ACCESS:                                                  02700000
*                                                                       02750000
*02*   ASM: IOSDDEVI                                                    02800000
*             ,DSECT=YES|NO to specify if the macro should be           02850000
*                           defined as a DSECT.                         02900000
*             ,LIST=YES|NO to control whether or not the macro will     02950000
*                          appear in the assembler listing.             03000000
*             ,DEVI=YES|NO to control whether or not the DEVI mapping   03050000
*                          is expanded.                                 03100000
*                                                                       03150000
*02*   PL/AS: %INCLUDE SYSLIB(IOSDDEVI)                                 03200000
*                                                                       03250000
*      Printing of the macro expansion can be controlled by the         03300000
*      IOSDDEVI_LIST global macro variable.                             03350000
*      Any value other than 'NO' will result in                         03400000
*      the  macro  expansion being printed.  The default is 'YES'.      03450000
*      The following examples illustrate how the                        03500000
*      IOSDDEVI_LIST variable should be set.                            03550000
*                                                                       03600000
*            PLAS:  %IOSDDEVI_LIST='YES'     %IOSDDEVI_LIST='NO'        03650000
*                                                                       03700000
*01* FUNCTION =                                                         03750000
* Maps the input/output area for the DEVIAREA keyword                   03800000
* associated with UCBINFO DEVINFO.                                      03850000
*                                                                       03900000
*01* CREATED BY = issuer of UCBINFO DEVINFO                             03950000
*                                                                       04000000
*01* DELETED BY =  issuer of UCBINFO DEVINFO                            04050000
*                                                                       04100000
*01* POINTED TO BY:                                                     04150000
*      N/A                                                              04200000
*                                                                       04250000
*01* SIZE:                                                              04300000
*          DEVI -- X'0100' bytes                                        04350000
*                                                                       04400000
*01* STORAGE ESTIMATE =                                                 04450000
*   One per issuance of UCBINFO DEVINFO                                 04500000
*                                                                       04550000
*01* SERIALIZATION = N/A                                                04600000
*                                                                       04650000
* EXTERNAL CLASSIFICATION: GUPI                                       * 04700000
* END OF EXTERNAL CLASSIFICATION                                      * 04750000
*                                                                     * 04800000
*01* NOTES =                                                            04850000
*                                                                       04900000
*      1.  Printing of the macro expansion is controlled by the         04950000
*          ZCBPRINT global macro variable.  Any value other than 'NO'   05000000
*          will result in the macro expansion being printed.  The       05050000
*          default is 'YES'.  The following examples illustrate how the 05100000
*          ZCBPRINT variable should be set.                             05150000
*                                                                       05200000
*               ASM:  GBLC &ZCBPRINT                                    05250000
*                     &ZCBPRINT SETC 'YES'  or   &ZCBPRINT SETC 'NO'    05300000
*              PLAS:  %DCL ZCBPRINT CHAR EXT                            05350000
*                     %ZCBPRINT='YES'       or   %ZCBPRINT='NO'         05400000
*                                                                       05450000
*     2.  A  global  variable IOSDDEVI_INCLUDED is set to YES the first 05500000
*          time the macro is invoked.                                   05550000
*               ASM:  This variable can be checked by the caller, to    05600000
*                     determine if the macro has already been invoked.  05650000
*              PLAS:  This variable is checked in the macro code to     05700000
*                     determine if the control block should be          05750000
*                     included.                                         05800000
*                                                                       05850000
*01* CHANGE ACTIVITY =                                                  05900000
*        $L0=DCR097  ,HBB5510,930520,PDLU:  UCBINFO DEVINFO Service     05950000
*                                                                @L0A   06000000
*        $L1=PAVS    ,HBB5520,940210,PDLP:  PAVS, add count of alias    06012500
*                                           for a multiple exposure     06025000
*                                           device               @L1A   06037500
*                                                                       06040000
*        $P1=PN71322 ,HBB5520 940912,PDLP:  Re-run CBGEN to clean up    06042500
*                                           all hand-modified errors    06045000
*                                                                @P1A   06047500
*        $P2=PWA0208 ,JBB6607 980630,PDNO:  Remove obsolete copyright   06048300
*                                           statement            @P2A   06049100
*                                                                       06050000
*        $02=OW25260 ,HBB4430,970331,PDNO:  3590 support for OS/390     06062500
*                                           R3                   @02A   06075000
*        $03=OW37980 ,HBB6603,990531,PDLZ:  Dynamic PAV support  @03A   06081200
*        $04=OW43831 ,HBB6603,000915,PDNO:  Comment changes to          06083200
*                                           clarify fields       @04A   06085200
*                                                                       06087500
*****END OF SPECIFICATIONS********************************************/ 06100000
*% /*                                                                   06150000
.P0      ANOP                                                           06175000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 06200000
         AIF   ('&LIST' EQ 'YES').P2                                    06250000
.P1      ANOP                                                           06300000
         PUSH  PRINT                                                    06350000
         PRINT OFF                                                      06400000
.P2      ANOP                                                           06450000
         AIF   ('&DEVI' EQ 'NO').L0002                                  06500000
         AIF   ('&DSECT' EQ 'YES').L0003                                06550000
         AIF   ('&DEVI' NE 'YES').L0002                                 06600000
DEVI     DS    0F        DEVI information mapping                       06650000
         AGO   .L0004                                                   06700000
.L0003   ANOP                                                           06750000
DEVI     DSECT           DEVI information mapping                       06800000
.L0004   ANOP                                                           06850000
DEVIFCTN DS    0BL2      Indicates which device information areas will *06900000
                         be filled in.                                  06950000
DEVIOFSA EQU   X'80'     Indicates that the device offline reasons     *07000000
                         area is filled in.                             07050000
DEVIALVA EQU   X'40'     Indicates that the PAV info is filled in  @03C 07087500
         DS    1BL.014   Reserved.                                      07125000
         ORG   DEVIFCTN+X'00000002'                                     07150000
DEVIOFRS DS    0BL2      Device offline reasons. Reasons why device is *07200000
                         being held in the offline state.               07250000
DEVIORSN EQU   X'80'     Offline for operator reasons.                  07300000
DEVIHRSN EQU   X'40'     Offline for hierarchy reasons.                 07350000
DEVIALOC EQU   X'20'     Allocated offline because in use by a system  *07400000
                         component.                                     07450000
DEVILRSN EQU   X'10'     Offline for tape library reasons.              07500000
DEVICRSN EQU   X'08'     Offline for configuration manager reasons.     07550000
DEVICUIR EQU   X'04'     Offline for conditional CUIR reasons.     @02C 07587500
DEVIUCUI EQU   X'02'     Offline for unconditional CUIR reasons.   @02A 07625000
         DS    1BL.009   Reserved.                                 @02C 07662500
         ORG   DEVIOFRS+X'00000002'                                     07700000
DEVIPAVI DS    0CL0008   Parallel Access Volume Information        @03C 07708300
         DS    1FL2      Reserved                                  @03C 07716600
DEVIPAVT DS    1FL2      If DEVIPAVB is on indicating the input device *07726890
                         is an active PAV-base, then this field        *07728880
                         contains the current total number of PAV      *07730870
                         devices associated with the input device      *07732860
                         (i.e., the count of bound PAV-alias devices   *07734850
                         plus 1 for the PAV-base).  Otherwise, this    *07736840
                         field is set to zero.                     @04C 07738830
DEVIPAVF DS    0CL0002   PAV flags                                 @03A 07741500
DEVIPAVC EQU   X'80'     PAV-base capability                       @03A 07749800
DEVIPAVB EQU   X'40'     Indicates that the input device is an active  *07759090
                         PAV-base.  This implies the PAV-base has one  *07760080
                         or more bound PAV-alias devices associated    *07761070
                         with it.                                  @04C 07762060
         DS    1BL.014   Reserved                                  @03A 07766400
         ORG   DEVIPAVF+X'00000002'                                @03A 07774700
         DS    1CL0002   Reserved                                  @03A 07783000
         DS    1CL0244   Reserved                                  @03C 07791300
DEVI_LEN EQU   *-DEVI                                                   07800000
.L0002   ANOP                                                           07850000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 07900000
         AIF   ('&LIST' EQ 'YES').P4                                    07950000
.P3      ANOP                                                           08000000
         POP   PRINT                                                    08050000
.P4      ANOP                                                           08100000
.P_EXIT  ANOP                                                           08150000
         MEND                                                           08200000
**/ IOSDDEVI_2:;                                                        08250000
* %IOSDDEVI_INCLUDED = 'YES';                                           08300000
* %DCL ZCBPRINT CHAR EXT;                                               08350000
* %DEACTIVATE ZCBPRINT;                                                 08400000
* %DCL IOSDDEVI_LIST CHAR EXT;                                          08450000
* %DEACTIVATE IOSDDEVI_LIST;                                            08500000
* %IF IOSDDEVI_LIST ^= 'NO' &                                           08550000
*    ZCBPRINT ^= 'NO' %THEN                                             08600000
*   %GOTO IOSDDEVI_3;                                                   08650000
*   @LIST PUSH NOECHO;                                                  08700000
*   @LIST NOASSEMBLE NOECHO;                                            08750000
*   @LIST OFF C NOECHO;                                                 08800000
* %IOSDDEVI_3:;                                                         08850000
*/* Start of PL/X Source                                             */ 08900000
*DCL 1  DEVI CHAR(256) BDY(WORD) BASED, /* DEVI information mapping  */ 08950000
*       3 DEVIFCTN BIT(16),   /* Indicates which device information     09000000
*                                areas will be filled in.            */ 09050000
*         5 DEVIOFSA BIT(1),  /* Indicates that the device offline      09100000
*                                reasons area is filled in.          */ 09150000
*         5 DEVIALVA BIT(1),  /* Indicates that the PAV info is         09176600
*                                filled in                       @03C*/ 09203200
*         5 * BIT(14),        /* Reserved.                      @L1C */ 09230000
*       3 DEVIOFRS BIT(16),   /* Device offline reasons.  Reasons why   09250000
*                                device is being held in the            09300000
*                                offline state.                      */ 09350000
*         5 DEVIORSN BIT(1),  /* Offline for operator reasons.       */ 09400000
*         5 DEVIHRSN BIT(1),  /* Offline for hierarchy reasons.      */ 09450000
*         5 DEVIALOC BIT(1),  /* Allocated offline because in use       09500000
*                                by a system component.              */ 09550000
*         5 DEVILRSN BIT(1),  /* Offline for tape library reasons.   */ 09600000
*         5 DEVICRSN BIT(1),  /* Offline for configuration manager      09650000
*                                reasons.                            */ 09700000
*         5 DEVICUIR BIT(1),  /* Offline for conditional CUIR           09719000
*                                reasons                         @02C*/ 09738000
*         5 DEVIUCUI BIT(1),  /* Offline for unconditional CUIR         09757000
*                                reasons                         @02A*/ 09776000
*         5 * BIT(9),         /* Reserved.                       @02C*/ 09795000
*       3 DEVIPAVI CHAR(8) BDY(WORD), /*                                09803100
*                                Parallel Access Volume Info     @03C*/ 09811200
*         5 *        FIXED(16),/* Reserved                       @03C*/ 09819300
*         5 DEVIPAVT FIXED(16),/* If DEVIPAVB is on indicating the      09828390
*                                input device is an active PAV-base,    09829380
*                                then this field contains the current   09830370
*                                total number of PAV devices associated 09831360
*                                with the input device (i.e., the count 09832350
*                                of bound PAV-alias devices plus 1 for  09833340
*                                the PAV-base).  Otherwise, this field  09834330
*                                is set to zero                  @04C*/ 09835320
*         5 DEVIPAVF CHAR(2), /* PAV flags                       @03A*/ 09843600
*           7 DEVIPAVC BIT(1),/* PAV-base capability             @03A*/ 09851700
*           7 DEVIPAVB BIT(1),/* Indicates that the input device is     09860790
*                                an active PAV-base.  This implies the  09861780
*                                PAV-base has one or more bound         09862770
*                                PAV-alias devices associated with      09863760
*                                it.                             @04C*/ 09864750
*           7 *       BIT(14),/* Reserved                        @03A*/ 09867900
*         5 *        CHAR(2), /* Reserved                        @03A*/ 09876000
*       3 * CHAR(244);        /* Reserved                        @03C*/ 09884100
*/* End of PL/X Source                                               */ 09892600
* %IF IOSDDEVI_LIST ^= 'NO' &                                           09900000
*    ZCBPRINT ^= 'NO' %THEN                                             09950000
*   %GOTO IOSDDEVI_4;                                                   10000000
*   @LIST POP NOECHO;                                                   10050000
* %IOSDDEVI_4:;                                                         10100000
* %END;                                                                 10150000
