*                                                                       00050000
* %DCL IOSDPATH_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IOSDPATH_INCLUDED;                                        00150000
* %IF IOSDPATH_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 94286. CBGEN compile date 94237         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IOSDPATH &DSECT=YES,&LIST=YES,&PATH=YES                        00450000
         GBLC  &IOSDPATH_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IOSDPATH_INCLUDED SETC 'YES'                                           00600000
 TITLE   'IOSDPATH  - Path information mapping                        '*00650000
                                                                        00700000
**/ IOSDPATH_1:;                                                        00750000
*/****START OF SPECIFICATIONS*****************************************  00800000
*                                                                       00850000
*01* MACRO-NAME: IOSDPATH                                               00900000
*                                                                       00950000
*01* DESCRIPTIVE-NAME: Path information mapping                         01000000
*                                                                       01050000
*02*   ACRONYM: PATH                                                    01100000
*                                                                       01150000
*01*   DSECT-NAME: PATH                                                 01200000
*                                                                       01250000
*                                                                    */ 01300000
*/*01* PROPRIETARY STATEMENT=                                        */ 01350000
*/***PROPRIETARY_STATEMENT********************************************/ 01400000
*/*                                                                  */ 01450000
*/*                                                                  */ 01500000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01550000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01600000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1992, 2000                  @P4C*/ 01650000
*/*                                                              @P5D*/ 01700000
*/* STATUS= HBB7703                                              @P4C*/ 01800000
*/*                                                                  */ 01850000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01900000
*/*                                                                     01950000
*                                                                       02000000
*01* COMPONENT: IOS (SC1C3)                                             02050000
*                                                                       02100000
*01* EYE-CATCHER: none                                                  02150000
*02*   OFFSET: N/A                                                      02200000
*02*   LENGTH: N/A                                                      02250000
*                                                                       02300000
*01* STORAGE ATTRIBUTES:                                                02350000
*02*   SUBPOOL:  caller-provided                                        02400000
*02*   KEY:  caller-provided                                            02450000
*02*   RESIDENCY: caller-provided                                       02500000
*                                                                       02550000
*01* METHOD OF ACCESS:                                                  02600000
*                                                                       02650000
*02*   ASM: IOSDPATH                                                    02700000
*             ,DSECT=YES|NO                                             02750000
*             ,LIST=YES|NO                                              02800000
*                                                                       02850000
*02*   PL/AS: %INCLUDE SYSLIB(IOSDPATH)                                 02900000
*                                                                       02950000
*      Printing of the macro expansion can be controlled by the         03000000
*      IOSDPATH_LIST global macro variable.                             03050000
*      Any value other than 'NO' will result in                         03100000
*      the  macro  expansion being printed.  The default is 'YES'.  The 03150000
*      following examples illustrate how the                            03200000
*      IOSDPATH_LIST variable should be set.                            03250000
*                                                                       03300000
*            PLAS:  %IOSDPATH_LIST='YES'     %IOSDPATH_LIST='NO'        03350000
*                                                                       03400000
*01* FUNCTION =                                                         03450000
* Maps the input to and output from UCBINFO PATHINFO                    03500000
*                                                                       03550000
*01* CREATED BY = issuer of UCBINFO PATHINFO                            03600000
*                                                                       03650000
*01* DELETED BY =  issuer of UCBINFO PATHINFO                           03700000
*                                                                       03750000
*01* POINTED TO BY:                                                     03800000
*      N/A                                                              03850000
*                                                                       03900000
*01* SIZE:                                                              03950000
*          PATH -- X'0100' bytes                                        04000000
*                                                                       04050000
*01* STORAGE ESTIMATE =                                                 04100000
*   One per issuance of UCBINFO PATHINFO                                04150000
*                                                                       04200000
*01* SERIALIZATION = N/A                                                04250000
*                                                                       04300000
*01* EXTERNAL CLASSIFICATION: GUPI                                 @P2C 04312500
*01* END OF EXTERNAL CLASSIFICATION                                     04325000
*                                                                       04337500
*01* NOTES =                                                            04350000
*                                                                       04400000
*      1.  Printing of the macro expansion is controlled by the         04450000
*          ZCBPRINT global macro variable.  Any value other than 'NO'   04500000
*          will result in the macro expansion being printed.  The       04550000
*          default is 'YES'.  The following examples illustrate how the 04600000
*          ZCBPRINT variable should be set.                             04650000
*                                                                       04700000
*               ASM:  GBLC &ZCBPRINT                                    04750000
*                     &ZCBPRINT SETC 'YES'  or   &ZCBPRINT SETC 'NO'    04800000
*              PLAS:  %DCL ZCBPRINT CHAR EXT                            04850000
*                     %ZCBPRINT='YES'       or   %ZCBPRINT='NO'         04900000
*                                                                       04950000
*     2.  A  global  variable IOSDPATH_INCLUDED is set to YES the first 05000000
*          time the macro is invoked.                                   05050000
*               ASM:  This variable can be checked by the caller, to    05100000
*                     determine if the macro has already been invoked.  05150000
*              PLAS:  This variable is checked in the macro code to     05200000
*                     determine if the control block should be          05250000
*                     included.                                         05300000
*                                                                       05350000
*     3.  When making changes to IOSDPATH, IOSDMAP should be looked     05362500
*         at for possible parallel changes.                        @P1A 05375000
*                                                                       05387500
*01* CHANGE ACTIVITY =                                                  05400000
*        $L0=SAMST   ,HBB4430,920318,PDXB:  PathInfo mapping            05412500
*        $L1=HERC    ,HBB6605,970423,PDHC:  Hercules support       @L1A 05417100
*                                                                       05421800
*        $P1=PKB2086 ,HBB4430,920429,PDKB:  Change the comments on      05425000
*                                           the channel path type       05437500
*                                           information. Also add a     05450000
*                                           note to check IOSDMAP       05462500
*                                           when making changes to      05475000
*                                           IOSDPATH.              @P1A 05487500
*        $P2=PN71995 ,HBB5520,941201,PDLC:  Fix CDPI classification     05488300
*                                                                  @P2A 05489100
*        $P3=PUX0381 ,HBB6605,970819,PDHC:  Remove Hercules supp.  @P3A 05489500
*                                                                       05490000
*        $P4=PXD1122 ,HBB7703,000229,PDMM:  Add DCMVSW bit         @P4A 05490800
*                                                                       05491600
*        $P5=PXD1562 ,HBB7703,000330,PDPS:  Update Copyright            05492090
*                                           Information            @P5A 05492280
*        $01=OW07560 ,HBB4430,940920,PDLZ:  Byte Pacer and Open         05492500
*                                           Systems Adapter support.    05495000
*                                                                  @01A 05497500
*        $02=OW23935 ,HBB4430,961201,PDMC:  ISD (Internal System        05498300
*                                           Device) Support        @02A 05499100
*        $03=OW28556 ,HBB6603,980630,PDHC:  ISC (Integrated Cluster     05499300
*                                           Bus) and IISC (Internal     05499500
*                                           ISC) support           @03A 05499700
*        $04=OW38541 ,HBB6603,990430,PDLE:  FICON Support          @04A 05499800
*        $05=OW34336 ,HBB6606,990601,PDMB:  OSA Express            @05A 05509800
*        $06=OW39508 ,HBB6603,990915,PDIU:  Addition of two new CHPID   05519800
*                                           types (DSD & EIO).     @06A 05529800
*        $07=OW46429 ,HBB7703,001110,PDNO:  Correct problems with       05532800
*                                           macro assembly.        @07A 05535800
*        $08=OW43541 ,HBB6606,000930,PDHC:  Add Peer CHP types:         05541790
*                                           CBP, CFP, and ICP      @08A 05543780
*        $09=OW47845 ,HBB6608,010928,PDPS:  Native FICON support        05544080
*                                           Return indicator if the     05544380
*                                           device is attached to a     05544680
*                                           FICON channel          @09A 05544980
*                                                                       05545770
*****END OF SPECIFICATIONS********************************************/ 05550000
*% /*                                                                   05600000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05650000
         AIF   ('&LIST' EQ 'YES').P2                                    05700000
.P1      ANOP                                                           05750000
         PUSH  PRINT                                                    05800000
         PRINT OFF                                                      05850000
.P2      ANOP                                                           05900000
         AIF   ('&PATH' EQ 'NO').L0002                                  05950000
         AIF   ('&DSECT' EQ 'YES').L0003                                06000000
         AIF   ('&PATH' NE 'YES').L0002                                 06050000
PATH     DS    0D        Path information mapping                       06100000
         AGO   .L0004                                                   06150000
.L0003   ANOP                                                           06200000
PATH     DSECT           Path information mapping                       06250000
.L0004   ANOP                                                           06300000
PATH#CHPIDS DS 1FL4      Number of valid installed Channel Paths to    *06350000
                         the specific device.                           06400000
PATHFLAGS DS   0CL0001   Flags mapped like MapFlgs in IOSDMAP           06450000
PATHVALPH EQU  X'80'     If on, path validation has not been done.     *06500000
                         Reflects setting of UCBVALPH.                  06550000
         ORG   PATHFLAGS+X'00000001'                                    06600000
PATHFLAGS1 DS  0CL0001   More Flags                                     06650000
PATHINTTYPENOTAVAILABLE EQU X'80' If on, no interface type information *06700000
                         was available.                                 06750000
PATHUAVALID EQU X'40'    If on, the PathUa field contains the device   *06766600
                         unit address                              @05A 06783200
PATHFC  EQU X'20'        If on, the device is connected to at least    *06786200
                         one FICON channel (i.e., channel type is      *06789200
                         FICON POINT TO POINT, FICON SWITCHED, or      *06792200
                         FICON INCOMPLETE)                         @09A 06795200
         ORG   PATHFLAGS1+X'00000001'                                   06800000
PATHLPUM DS    1BL1      Last Path used mask (LPUM)                     06850000
PATHUA   DS    1BL2      Device unit address                       @05A 06883300
         DS    1CL0023   Reserved                                  @05C 06926590
PATHCHPIDARRAY DS 0CL0028 Array of up to 8 entries of path             *06950000
                         information. The last entry filled in is the  *07000000
                         entry corresponding to Path#Chpids. Note that *07050000
                         Path#Chpids could be 0, in which case no      *07100000
                         entries are filled in.                         07150000
PATHCHPID DS   1FL2      Channel Path ID number                         07200000
PATHMASK DS    1BL1      This mask corresponds to the bit setting in   *07250000
                         the PIM for this channel path.                 07300000
PATHBITS DS    0BL1      Mapped like MapBit in IOSDMAP                  07350000
PATHDCMVSW EQU X'40'     Dynamic Chpid Management mask. If on,         *07362500
                         indicates that path is offline due to a       *07380990
                         Vary Switch or Config member(xx) request. @P4A 07387500
PATHCMM  EQU   X'20'     Configuration management mask. If on,         *07400000
                         indicates that path is offline due to ESCM.    07450000
PATHOPM  EQU   X'10'     Operator path mask. If on, indicates that     *07550000
                         path is offline due to the operator.           07600000
PATHCPM  EQU   X'08'     Control unit recovery process path mask. If   *07637500
                         on, indicates that the path is offline due to *07675000
                         control unit recovery process                  07712500
PATHLPM  EQU   X'04'     Logically Available Mask: 1 = Available, 0 =  *07750000
                         Not available                                  07800000
PATHPAM  EQU   X'02'     Physically Available Mask: 1 = Available, 0 = *07850000
                         Not available                                  07900000
PATHVARY EQU   X'01'     If On, vary OFFLINE in progress                07950000
         ORG   PATHBITS+X'00000001'                                     08000000
PATHINTTYPE DS 1FL1      Interface type entry. Constants defining the  *08050000
                         possible values are below and begin with      *08100000
                         PathIntType_                                   08150000
         DS    1CL0023   Reserved                                       08200000
         ORG   PATHCHPIDARRAY+X'000000E0'                               08250000
PATHINTTYPE_UNKNOWN EQU 0 Channel path description not known            08300000
PATHINTTYPE_BLOCK_MTPX EQU 1 Parallel block multiplexer channel path    08350000
PATHINTTYPE_BYTE_MTPX EQU 2 Parallel byte multiplexer channel path      08400000
PATHINTTYPE_ESCON_PT_TO_PT EQU 3 ESCON point to point channel path      08450000
PATHINTTYPE_ESCON_UNKNOWN EQU 4 ESCON channel path                      08500000
PATHINTTYPE_ESCON_SWITCH EQU 5 ESCON switch point to point channel     *08550000
                         path                                           08600000
PATHINTTYPE_ESCON_CONVERT EQU 6 Fiber extended channel path             08650000
PATHINTTYPE_ESCON_NATIVE EQU 7 Native Interface                         08750000
PATHINTTYPE_CTC_PT_TO_PT EQU 8 CTC adapter point to point               08800000
PATHINTTYPE_CTC_SW_PT_TO_PT EQU 9 CTC adapter switched point to point   08850000
PATHINTTYPE_CTC_UNKNOWN EQU 10 CTC adapter                              08900000
PATHINTTYPE_ESCON_BYTE_CONVERT EQU 15 ESCON Byte Pacer channel path     08933300
PATHINTTYPE_OSA_EXPRESS EQU 16 OSA Express channel path            @05A 08938800
PATHINTTYPE_OSA_DIRECT_EXPRESS EQU 17 OSA Direct Express channel       *08944300
                                      path                         @05A 08949800
PATHINTTYPE_OSA                EQU 18 Open Systems Adapter         @01A 08955500
PATHINTTYPE_ISD                EQU 19 Internal System Device       @02A 08977700
PATHINTTYPE_ICB_SENDER         EQU 22 Integrated Cluster Bus Send  @03A 08982100
PATHINTTYPE_ICB_RECEIVER       EQU 23 Integrated Cluster Bus Recv  @03A 08986500
PATHINTTYPE_IISC_SENDER        EQU 24 Internal ISC Sender          @03A 08990900
PATHINTTYPE_IISC_RECEIVER      EQU 25 Internal ISC Receiver        @03A 08995300
PATHINTTYPE_FICON_NATIVE       EQU 26 Native FICON                 @04A 08996000
PATHINTTYPE_FICON_SWITCHED     EQU 27 FICON switched               @04A 08996700
PATHINTTYPE_FICON_TO_BRIDGE    EQU 28 FICON Bridge                 @04A 08997400
PATHINTTYPE_FICON_INCOMPLETE   EQU 29 FICON (Incomplete                *08998100
                                      Description)                 @04A 08998800
PATHINTTYPE_DSD                EQU 30 Direct System Device CHPID   @06A 08999200
PATHINTTYPE_EIO                EQU 31 Emulated I/O CHPID           @06A 08999600
PATHINTTYPE_CBP                EQU 33 Integrated Cluster Bus Peer  @08A 08999700
PATHINTTYPE_CFP                EQU 34 Coupling Facility Peer       @08A 08999800
PATHINTTYPE_ICP                EQU 35 Internal Coupling Peer       @08A 08999900
PATH_LEN EQU   *-PATH                                                   09000000
.L0002   ANOP                                                           09050000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 09100000
         AIF   ('&LIST' EQ 'YES').P4                                    09150000
.P3      ANOP                                                           09200000
         POP   PRINT                                                    09250000
.P4      ANOP                                                           09300000
.P_EXIT  ANOP                                                           09350000
         MEND                                                           09400000
**/ IOSDPATH_2:;                                                        09450000
* %IOSDPATH_INCLUDED = 'YES';                                           09500000
* %DCL ZCBPRINT CHAR EXT;                                               09550000
* %DEACTIVATE ZCBPRINT;                                                 09600000
* %DCL IOSDPATH_LIST CHAR EXT;                                          09650000
* %DEACTIVATE IOSDPATH_LIST;                                            09700000
* %IF IOSDPATH_LIST ^= 'NO' &                                           09750000
*    ZCBPRINT ^= 'NO' %THEN                                             09800000
*   %GOTO IOSDPATH_3;                                                   09850000
*   @LIST PUSH NOECHO;                                                  09900000
*   @LIST NOASSEMBLE NOECHO;                                            09950000
*   @LIST OFF C NOECHO;                                                 10000000
* %IOSDPATH_3:;                                                         10050000
*/* Start of PL/X Source                                             */ 10100000
*DCL 1  PATH BASED,           /* Path information mapping            */ 10150000
*      3 Path#CHPIDs FIXED(31), /* Number of valid installed Channel    10200000
*                                  Paths to the specific device.     */ 10250000
*      3 PathFlags Char(1),   /* Flags mapped like MapFlgs in IOSDMAP   10300000
*                                                                    */ 10350000
*        5 PathValph Bit(1),  /* If on, path validation has not been    10400000
*                    done. Reflects setting of UCBVALPH.             */ 10450000
*      3 PathFlags1 Char(1),  /* More Flags                          */ 10500000
*        5 PathIntTypeNotAvailable Bit(1), /* If on, no interface type  10550000
*                    information was available.                      */ 10600000
*        5 PathUaValid Bit(1), /* If on, the PathUa field contains      10616600
*                                 the device unit address        @05A*/ 10633200
*        5 PathFC   BIT(1),   /* If on, the device is connected to      10635200
*                                at least one FICON channel (i.e.,      10637200
*                                channel type is FICON POINT TO         10639200
*                                POINT, FICON SWITCHED, or FICON        10641200
*                                INCOMPLETE)                     @09A*/ 10643200
*        5 *        BIT(5),   /* Reserved                        @09A*/ 10645200
*      3 PathLPUM BIT(8),       /* Last Path used mask (LPUM)        */ 10650000
*      3 PathUa   BIT(16),    /* Device unit address             @05A*/ 10683300
*      3 * CHAR(23),          /* Reserved                        @05C*/ 10726590
*      3 PathChpidArray(1:8),     /* Array of up to 8 entries of        10750000
*                    path information. The last entry filled in is      10800000
*                    the entry corresponding to Path#Chpids. Note       10850000
*                    that Path#Chpids could be 0, in which case no      10900000
*                    entries are filled in.                          */ 10950000
*        5 PathChpid Fixed(16),        /* Channel Path ID number     */ 11000000
*        5 PathMask BIT(8),            /* This mask corresponds to the  11050000
*                    bit setting in the PIM for this channel path.   */ 11100000
*        5 PathBits BIT(8),            /* Mapped like MapBit in         11150000
*                                         IOSDMAP                    */ 11200000
*          7 * Bit(1),                 /* Reserved               @P4C*/ 11216600
*          7 PATHDCMVSW Bit(1),     /* Dynamic Chpid Management mask.   11233200
*                                      If on,iindicates that path is    11249800
*                                      offline due to a Vary Switch or  11266400
*                                     Config member(xx) request. @P4A*/ 11283000
*          7 PathCMM Bit(1),           /* Configuration management      11300000
*                    mask. If on, indicates that path is offline due    11350000
*                    to ESCM.                                        */ 11400000
*          7 PathOPM Bit(1),           /* Operator path mask. If on,    11450000
*                    indicates that path is offline due                 11500000
*                    to the operator.                                */ 11550000
*          7 PathCPM Bit(1),           /* Control unit recovery         11600000
*                    process path mask. If on, indicates that the path  11650000
*                    is offline due to control unit recovery process */ 11700000
*          7 PathLPM Bit(1),           /* Logically Available Mask:     11750000
*                    1 = Available, 0 = Not available                */ 11800000
*          7 PathPAM Bit(1),           /* Physically Available Mask:    11850000
*                    1 = Available, 0 = Not available                */ 11900000
*          7 PathVARY Bit(1),          /* If On, vary OFFLINE in        11950000
*                    progress                                        */ 12000000
*        5 PathIntType Fixed(8),       /* Interface type entry.         12050000
*                    Constants defining the possible values are below   12100000
*                    and begin with PathIntType_                     */ 12150000
*        5 * Char(23),                 /* Reserved                   */ 12200000
*      3 * CHAR(0) BDY(DWORD);   /*                                  */ 12250000
*DCL PathIntType_Unknown Fixed(8) Constant(0);  /* Channel path         12292800
*                                  description not known         @P1C*/ 12335600
*DCL PathIntType_Block_Mtpx Fixed(8) Constant(1);   /* Parallel block   12378400
*                                  multiplexer channel path      @P1C*/ 12421200
*DCL PathIntType_Byte_Mtpx Fixed(8) Constant(2);   /* Parallel byte     12464000
*                                  multiplexer channel path      @P1C*/ 12506800
*DCL PathIntType_Escon_PT_To_Pt Fixed(8) Constant(3);   /* ESCON        12550000
*                                  point to point channel path   @P1C*/ 12600000
*DCL PathIntType_Escon_Unknown Fixed(8) Constant(4);   /* ESCON channel 12650000
*                                  path                          @P1C*/ 12700000
*DCL PathIntType_Escon_Switch Fixed(8) Constant(5);   /* ESCON switch   12750000
*                                  point to point channel path   @P1C*/ 12800000
*DCL PathIntType_Escon_Convert Fixed(8) Constant(6); /* Fiber extended  12850000
*                                  channel path                  @P1C*/ 12900000
*DCL PathIntType_Escon_Native Fixed(8) Constant(7);   /* Native         13050000
*                                  Interface                         */ 13100000
*DCL PathIntType_Ctc_Pt_To_Pt Fixed(8) Constant(8);   /* CTC adapter    13150000
*                                  point to point                @P1C*/ 13200000
*DCL PathIntType_Ctc_Sw_Pt_To_Pt Fixed(8) Constant(9); /* CTC adapter   13250000
*                                  switched point to point       @P1C*/ 13300000
*DCL PathIntType_Ctc_Unknown Fixed(8) Constant(10);   /* CTC adapter    13350000
*                                                                @P1C*/ 13400000
*DCL PathIntType_Escon_Byte_Convert Fixed(8) Constant(15); /* ESCON     13425000
*                                  Byte Pacer channel path       @01A*/ 13450000
*DCL PathIntType_OSA_Express Fixed(8) Constant(16); /* OSA Express      13455000
*                                  channel path                  @05A*/ 13460000
*DCL PathIntType_OSA_Direct_Express Fixed(8) Constant(17); /* OSA       13465000
*                                  Direct Express channel path   @05A*/ 13470000
*DCL PathIntType_OSA Fixed(8) Constant(18); /* Open Systems             13475000
*                                  Adapter                       @01A*/ 13500000
*DCL PathIntType_ISD Fixed(8) Constant(19); /* Internal System          13508300
*                                  Device                        @03C*/ 13509900
*DCL PathIntType_ICB_Sender     Fixed(8) Constant(22); /* Integrated    13511500
*                                  Cluster Bus Sender            @03A*/ 13513100
*DCL PathIntType_ICB_Receiver   Fixed(8) Constant(23); /* Integrated    13514700
*                                  Cluster Bus Receiver          @03A*/ 13516300
*DCL PathIntType_IISC_Sender    Fixed(8) Constant(24); /* Internal      13517900
*                                  ISC Sender                    @03A*/ 13519500
*DCL PathIntType_IISC_Receiver  Fixed(8) Constant(25); /* Internal      13521100
*                                  ISC Receiver                  @03A*/ 13522700
*DCL PathIntType_FICON_native   Fixed(8) Constant(26); /* Native        13522900
*                                  FICON                         @04A*/ 13523100
*DCL PathIntType_FICON_switched Fixed(8) Constant(27); /* FICON         13523300
*                                  switched                      @04A*/ 13523500
*DCL PathIntType_FICON_To_Bridge Fixed(8) Constant(28); /*              13523700
*                                  FICON Bridge                  @04A*/ 13523900
*DCL PathIntType_FICON_incomplete Fixed(8) Constant(29); /* FICON       13524100
*                                  (Incomplete Description)      @04A*/ 13524300
*DCL PathIntType_DSD     Fixed(8) Constant(30);  /* Direct System       13524400
*                                                   Device (DSD) @06A*/ 13524500
*DCL PathIntType_EIO     Fixed(8) Constant(31);  /* Emulated I/O        13524600
*                                                   (EIO)        @06A*/ 13524700
*DCL PathIntType_CBP     Fixed(8) Constant(33);  /* Integrated Cluster  13524740
*                                                   Bus Peer     @08A*/ 13524780
*DCL PathIntType_CFP     Fixed(8) Constant(34);  /* Coupling Facility   13524820
*                                                   Peer         @08A*/ 13524860
*DCL PathIntType_ICP     Fixed(8) Constant(35);  /* Internal Coupling   13524900
*                                                   Peer         @08A*/ 13524940
*/* End of PL/X Source                                               */ 13525000
* %IF IOSDPATH_LIST ^= 'NO' &                                           13550000
*    ZCBPRINT ^= 'NO' %THEN                                             13600000
*   %GOTO IOSDPATH_4;                                                   13650000
*   @LIST POP NOECHO;                                                   13700000
* %IOSDPATH_4:;                                                         13750000
* %END;                                                                 13800000
