* %      GOTO SMF22P1;             /* BILINGUAL MAPPING                 00050000
         MACRO                                                          00100000
         IOSDSMFR                                                       00150000
.*                                                                   */ 00200000
*%SMF22P1 : ;                                                           00250000
*/*START OF SPECIFICATIONS ******************************************** 00300000
*                                                                       00350000
* MACRO-NAME: IOSDSMFR                                                  00400000
*                                                                       00450000
* DESCRIPTIVE-NAME: SMF Record Type 22 I/O Configuration Change Element 00500000
*                                                                       00550000
* COMPONENT:  IOS (SC1C3)                                               00600000
*                                                                       00650000
* PROPRIETARY STATEMENT =                                               00700000
*                                                                       00750000
*       LICENSED MATERIALS - PROPERTY OF IBM                            00950000
*       THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                     00962500
*       5655-068 (C) COPYRIGHT IBM CORP. 1992, 1993                     00975000
*       SEE COPYRIGHT INSTRUCTIONS                                      00987500
*                                                                       01000000
* STATUS: HBB5510                                                @L2C   01050000
*                                                                       01100000
* FUNCTION:  IOSDSMFR maps the I/O Configuration Change Element         01150000
*            (subtype 9) contained within SMF record type 22            01200000
*                                                                       01250000
.*                                                                   */ 01300000
*%GOTO SMF22P2;                                                         01350000
         AGO   .SMF22A2                                                 01400000
*%SMF22P2 : ;                                                           01450000
*/*                                                                     01500000
* EYE-CATCHER: NONE                                                     01550000
*                                                                       01600000
*  ACRONYM: SMF22IOS                                                    01650000
*                                                                       01700000
* DSECT NAME:                                                           01750000
*                                                                       01800000
*   SMF22IOC                                                            01850000
*   SMF22ARY                                                            01900000
*   SMF22EDV                                                            01950000
*   SMF22EPC                                                            02000000
*   SMF22ECH                                                            02050000
*                                                                       02100000
* METHOD-OF-ACCESS:                                                     02150000
*                                                                       02200000
*   PLAS: %INCLUDE SYSLIB(IOSDSMFR)                                     02250000
*                                                                       02300000
*   ASSEMBLER: IOSDSMFR                                                 02350000
*                                                                       02400000
*   NOTES:                                                              02450000
*               PL/AS - INCLUDED by IFASMFR2                            02500000
*               BAL   - CALLED from IFASMFR2                            02550000
*                                                                       02600000
*                                                                       02650000
* CREATED-BY: The IOS Configuration Change Manager.                     02700000
*                                                                       02750000
* DELETED-BY: The IOS Configuration Change Manager                      02800000
*                                                                       02850000
* STORAGE-ATTRIBUTES:                                                   02900000
*                                                                       02950000
*   ALLOCATION-METHOD: GETMAIN                                          03000000
*                                                                       03050000
*   SUBPOOL: ANY                                                        03100000
*                                                                       03150000
* POINTED-TO-BY: SMF22IOC BASED(SMF22PTR+LENGTH(SMFRCD22))              03200000
*                                                                       03250000
* SIZE: VARIABLE                                                        03300000
*                                                                       03350000
* SERIALIZATION: None                                                   03400000
*                                                                       03450000
* DEPENDENCIES: None                                                    03500000
*                                                                       03550000
* CHANGE-ACTIVITY:                                                      03600000
*                                                                       03650000
*   $L0=PRSMM,HBB4430,920211,PDLQ: Transfer I/O Configuration Change    03700000
*                                  element of SMF Record Type 22 to     03750000
*                                  SC1C3                                03800000
*   $L1=PRSMM,HBB4430,920211,PDLQ: Constants defined for new Modify     03850000
*                                  requests to add or delete device     03900000
*                                  or CHPID access.              @L1A   03950000
*                                  Also, SMF22FRC was removed (unused). 04000000
*                                                                @L1D   04050000
*   $L2=SYSLK   HBB5510 930325 PDLS: Dynamic XES support         @L2A   04055500
*                                                                       04061000
*   $D1=DIG0108 HBB5510 930520 PDLS: Name changes                @D1A   04062800
*                                                                       04064600
*   $P1=PKB3748 HBB4430 920729 PDLS: DCCD and SMF record changes for    04066600
*                                  activating partition indicator @P1A  04083200
*                                                                       04100000
*END OF SPECIFICATIONS ***********************************************/ 04150000
* %      GOTO SMF22P3;             /* BILINGUAL MAPPING                 04200000
.SMF22A2 ANOP                                                           04250000
         SPACE 1                                                        04300000
*********************************************************************** 04350000
*                                                                     * 04400000
*    The following structure maps the I/O configuration change        * 04450000
*    element which applies to SMF22IND=9. The I/O configuration       * 04500000
*    change element consists of a header section mapped by SMF22IOC,  * 04550000
*    followed by an array containing a variable number of entries     * 04600000
*    mapped by SMF22ARY. Each entry identifies an I/O device,         * 04640000
*    I/O control unit, message device, message processor,             * 04680000
*    or CHPID that has been added, deleted, or modified.              * 04720000
*    If the space required for all entries exceeds the                * 04760000
*    maximum length of SMF record type 22, subsequent SMF type 22     * 04800000
*    records are written containing the remaining entries. The SMF    * 04850000
*    type 22 record header (SMFRCD22) and the I/O configuration       * 04900000
*    change element header (SMF22IOC) is replicated for each record.  * 04950000
*                                                                     * 05000000
*********************************************************************** 05050000
SMF22IOC ORG   SMF22RSC                                                 05100000
         DS    BL1                 Reserved                             05150000
SMF22OID DS    BL1                 I/O configuration change             05200000
*                                  element ID (x'0B')                   05250000
SMF22R#  DS    BL1                 Record number of this record         05300000
SMF22TR  DS    BL1                 Total number of records for this     05350000
*                                  I/O configuration change. For        05400000
*                                  example, if there are 3 records      05450000
*                                  total, and this record is the first, 05500000
*                                  SMF22R# would contain 1, and SMF22TR 05550000
*                                  would contain 3, indicating record   05600000
*                                  1 of 3.                              05650000
SMF22OFF DS    BL2                 Offset of first entry in this        05700000
*                                  record                               05750000
SMF22ELN DS    BL2                 Length of each entry                 05800000
SMF22T#E DS    F                   Total number of entries for this     05850000
*                                  I/O configuration change             05900000
SMF22#E  DS    F                   Number of entries in this            05950000
*                                  record                               06000000
SMF22FLS DS    B                   Flags                                06050000
SMF22SFT EQU   X'80'               Indicates that requestor of the      06100000
*                                  ACTIVATE specified the SOFT option   06150000
*                                  indicating that only software        06200000
*                                  configuration changes are to         06250000
*                                  be made.                             06300000
*                                                                @L1D   06350000
*        EQU   X'7F'               Reserved                      @L1C   06400000
         DS    B                   Reserved                             06450000
SMF22IOD DS    0CL48               IODF dataset which contains the      06500000
*                                  new I/O configuration                06550000
SMF22IDN DS    CL44                IODF dataset name                    06600000
         DS    CL4                 Reserved                             06650000
SMF22EDT DS    CL2                 ID of new EDT                        06700000
SMF22CFI DS    CL8                 Operating system configuration ID    06750000
*                                  for new configuration                06800000
SMF22HCT DS    CL64                Hardware configuration token that    06850000
*                                  represents the new I/O               06900000
*                                  configuration                        06950000
SMF22#UA DS    F                   Number of UCBs added for this        07000000
*                                  I/O configuration change             07050000
SMF22#UD DS    F                   Number of UCBs deleted for this      07100000
*                                  I/O configuration change             07150000
SMF22FNC DS    FL1                 Activate function requested          07200000
*                                  (activate or recover)                07250000
         DS    CL3                 Reserved                             07300000
*********************************************************************** 07350000
*                                                                     * 07400000
*    The following structure maps the entry array in the I/O          * 07450000
*    configuration change element.                                    * 07500000
*                                                                     * 07550000
*********************************************************************** 07600000
SMF22ARY DSECT                     Entry array                          07650000
SMF22ENT DS    0XL32               Entry                                07700000
SMF22EHD DS    0F                  Entry header                         07750000
SMF22ETY DS    XL1                 Entry type                           07800000
SMF22ERQ DS    XL1                 Entry request                        07850000
SMF22EFL DS    B                   Entry flags                          07900000
SMF22EHW EQU   X'80'               Hardware change                      07950000
SMF22ESW EQU   X'40'               Software change                      08000000
SMF22EST EQU   X'20'               Indicates that this entry was        08050000
*                                  created because a static device is   08100000
*                                  being changed to a dynamic device.   08150000
*                                  This entry represents the delete     08200000
*                                  request (SMF22ERQ=SMF22DD). There    08250000
*                                  will be another entry which          08300000
*                                  represents the add request           08350000
SMF22ECN EQU   X'10'               Indicates whether the UCB for the    08400000
*                                  device is connected to a subchannel. 08450000
*                                  Valid only when SMF22ETY=SMF22DEV    08500000
*                                  and SMF22ERQ=SMF22DA.                08550000
*        EQU   X'0C'               Reserved                      @P1C   08554100
SMF22EAP EQU   X'02'               The activating partition will lose   08558200
*                                  access to the device because either  08562300
*                                  the device is deleted from the       08566400
*                                  configuration, or the activating     08570500
*                                  partition is being removed from the  08574600
*                                  candidate list of the device.        08578700
*                                  Valid when:                          08582800
*                                  SMF22ETY=SMF22DEV and                08586900
*                                    SMF22ERQ=SMF22DDD           @P1A   08591000
SMF22ECC EQU   X'01'               Indicates that this entry was        08595100
*                                  created because the candidate        08599200
*                                  list of the device was changed.      08603300
*                                  When SMF22ETY=SMF22DEV,              08607400
*                                  SMF22ERQ=SMF22DDD and SMF22ECC       08611500
*                                  is on, partition(s)                  08615600
*                                  were deleted from the device         08619700
*                                  candidate list.                      08623800
*                                  When SMF22ETY=SMF22DEV,              08627900
*                                  SMF22ERQ=SMF22DAD and SMF22ECC       08632000
*                                  is on, partition(s)                  08636100
*                                  were added to the device             08640200
*                                  candidate list.               @P1A   08644300
         DS    B                   Entry flags                          08650000
SMF22ESI DS    0XL28               Entry type specific information      08700000
*                                  described below                      08750000
*********************************************************************** 08800000
*                                                                     * 08850000
*    The following structure maps SMF22ESI for device                 * 08900000
*    entries (SMF22ETY = SMF22DEV or SMF22MDEV).                  @L2A* 08950000
*                                                                     * 09000000
*********************************************************************** 09050000
SMF22EDV ORG   SMF22ESI            Device entry                         09100000
SMF22DVN DS    FL2                 Device number                        09150000
SMF22DCM DS    BL1                 Mask of CHPIDs contained in SMF22DCH 09200000
*                                  that were added to or deleted        09250000
*                                  from this device. Valid only when    09300000
*                                  SMF22ERQ = SMF22DAH OR SMF22DDH.     09350000
*                                  Otherwise, zero.                     09400000
SMF22DPM DS    BL1                 Mask of physical control unit        09450000
*                                  numbers in SMF22DPC that were        09500000
*                                  added to or deleted from this        09550000
*                                  device. Valid only when              09600000
*                                  SMF22ERQ = SMF22DAP or SMF22DDP.     09650000
*                                  Otherwise, zero.                     09700000
SMF22DCH DS    8FL1                Array of CHPIDs that were            09750000
*                                  added to or deleted from this        09800000
*                                  device. Valid only when              09850000
*                                  SMF22ERQ = SMF22DAH OR SMF22DDH.     09900000
*                                  Otherwise, zero.                     09950000
SMF22DPC DS    8FL2                Array of physical control unit       10000000
*                                  numbers that were added to or        10050000
*                                  deleted from this device. Valid only 10100000
*                                  when SMF22ERQ = SMF22DAP or          10150000
*                                  SMF22DDP. Otherwise, zero.           10200000
*********************************************************************** 10250000
*                                                                     * 10300000
*    The following structure maps SMF22ESI for control unit           * 10350000
*    entries (SMF22ETY = SMF22PCU or SMF22MP).                    @L2A* 10400000
*                                                                     * 10450000
*********************************************************************** 10500000
SMF22EPC ORG   SMF22ESI            Physical control unit entry          10550000
SMF22PCN DS    FL2                 Physical control unit number         10600000
         DS    CL1                 Reserved                             10650000
SMF22PCM DS    BL1                 Mask of channel path IDs in          10700000
*                                  SMF22PCH that were added to or       10750000
*                                  deleted from this control unit.      10800000
*                                  Valid only when SMF22ERQ = SMF22PAH  10850000
*                                  or SMF22PDH. Otherwise, zero.        10900000
SMF22PCH DS    8FL1                Array of CHPIDs that were added to   10950000
*                                  or deleted from this control unit.   11000000
*                                  Valid only when SMF22ERQ = SMF22PAH  11050000
*                                  or SMF22PDH. Otherwise, zero.        11100000
SMF22PUA DS    0F                  Range of unit addresses that were    11150000
*                                  added to or deleted from this        11200000
*                                  control unit. Valid only when        11250000
*                                  SMF22ERQ = SMF22PMA or SMF22PMD.     11300000
*                                  Otherwise, zero.                     11350000
         DS    CL1                 Reserved                             11400000
SMF22PUC DS    XL1                 Count of unit addresses              11450000
         DS    CL1                 Reserved                             11500000
SMF22PSU DS    XL1                 Starting unit address                11550000
*********************************************************************** 11600000
*                                                                     * 11650000
*    The following structure maps SMF22ESI for CHPID                  * 11700000
*    entries (SMF22ETY = SMF22CH).                                    * 11750000
*                                                                     * 11800000
*********************************************************************** 11850000
SMF22ECH ORG   SMF22ESI            CHPID entry                          11900000
SMF22CCH DS    XL1                 Channel path ID                      11950000
         DS    CL3                 Reserved                             12000000
*********************************************************************** 12050000
*                                                                     * 12100000
*    The following constants are used to identify the function in     * 12150000
*    SMF22FNC.                                                        * 12200000
*                                                                     * 12250000
*********************************************************************** 12300000
SMF22ACT EQU   X'01'               Activate function                    12350000
SMF22REC EQU   X'05'               Recover function                     12400000
*********************************************************************** 12450000
*                                                                     * 12500000
*    The following constants identify the entry type in SMF22ETY.     * 12550000
*                                                                     * 12600000
*********************************************************************** 12650000
SMF22DEV EQU   X'01'               Device entry                         12700000
SMF22PCU EQU   X'02'               Control unit entry                   12750000
SMF22CH  EQU   X'03'               CHPID entry                          12800000
SMF22MDEV EQU   X'04'              coupling facility device entry  @D1C 12816600
SMF22MP   EQU   X'05'              coupling facility CU entry      @D1C 12833200
*********************************************************************** 12850000
*                                                                     * 12900000
*    The following constants define SMF22ERQ when SMF22ETY is         * 12950000
*    SMF22DEV or SMF22MDEV                                        @L2C* 13000000
*                                                                     * 13050000
*********************************************************************** 13100000
SMF22DDD EQU   X'01'               Delete device                        13150000
SMF22DAD EQU   X'02'               Add device                           13200000
*********************************************************************** 13207100
*                                                                     * 13214200
*    The following constants define SMF22ERQ when SMF22ETY is         * 13221300
*    SMF22DEV.                                                    @L2A* 13228400
*                                                                     * 13235500
*********************************************************************** 13242600
SMF22DDH EQU   X'03'               Modify to remove CHPID(s)            13250000
SMF22DAH EQU   X'04'               Modify to add CHPID(s)               13300000
SMF22DDP EQU   X'05'               Modify to remove CU(s)               13350000
SMF22DAP EQU   X'06'               Modify to add CU(s)                  13400000
SMF22DMC EQU   X'07'               Modify subchannel characteristics    13450000
*                                  (illegal status detection, and/or    13500000
*                                  interface timeout)                   13550000
SMF22DMP EQU   X'08'               Modify preferred path                13600000
*                                                               2@P1D   13650000
*********************************************************************** 13950000
*                                                                     * 14000000
*    The following constants define SMF22ERQ when SMF22ETY is         * 14050000
*    SMF22PCU or SMF22MP.                                         @L2C* 14100000
*                                                                     * 14150000
*********************************************************************** 14200000
SMF22PDP EQU   X'01'               Delete control unit                  14250000
SMF22PAP EQU   X'02'               Add control unit                     14300000
SMF22PDH EQU   X'03'               Modify to delete CHPID(s)            14350000
SMF22PAH EQU   X'04'               Modify to add CHPID(s)               14400000
*********************************************************************** 14407100
*                                                                     * 14414200
*    The following constants define SMF22ERQ when SMF22ETY is         * 14421300
*    SMF22PCU.                                                    @L2A* 14428400
*                                                                     * 14435500
*********************************************************************** 14442600
SMF22PDU EQU   X'05'               Modify to delete unit address        14450000
*                                  range                                14500000
SMF22PAU EQU   X'06'               Modify to add unit address           14550000
*                                  range                                14600000
*********************************************************************** 14650000
*                                                                     * 14700000
*    The following constants define SMF22ERQ when SMF22ETY is         * 14750000
*    SMF22CH.                                                         * 14800000
*                                                                     * 14850000
*********************************************************************** 14900000
SMF22CDH EQU   X'01'               Delete CHPID                         14950000
SMF22CAH EQU   X'02'               Add CHPID                            15000000
SMF22CDI EQU   X'03'               Modify to delete logical             15050000
*                                  partition(s) from the                15100000
*                                  CHPID candidate list          @L1A   15150000
SMF22CAI EQU   X'04'               Modify to add logical                15200000
*                                  partitions to the                    15250000
*                                  CHPID candidate list          @L1A   15300000
         MEXIT                                                          15350000
         MEND       */                                                  15400000
*                                                                       15450000
*%SMF22P3: ;                                                            15500000
*/********************************************************************/ 15550000
*/*                                                                  */ 15600000
*/*  The following structure maps the I/O configuration change       */ 15650000
*/*  element which applies to SMF22IND=9. The I/O configuration      */ 15700000
*/*  change element consists of a header section mapped by SMF22IOC, */ 15750000
*/*  followed by an array containing a variable number of entries    */ 15800000
*/*  mapped by SMF22ARY. Each entry identifies an I/O device,    @L2C*/ 15840000
*/*  I/O contorl unit, coupling facility device,                 @D1C*/ 15866600
*/*  coupling facility CU or                                     @D1A*/ 15893200
*/*  CHPID that has been added, deleted, or modified.            @L2C*/ 15920000
*/*  If the space required for all entries exceeds the           @L2C*/ 15960000
*/*  maximum length of SMF record type 22, subsequent SMF type 22    */ 16000000
*/*  records are written containing the remaining entries. The SMF   */ 16050000
*/*  type 22 record header (SMFRCD22) and the I/O configuration      */ 16100000
*/*  change element header (SMF22IOC) is replicated for each record. */ 16150000
*/*                                                                  */ 16200000
*/********************************************************************/ 16250000
* DECLARE                                                               16300000
* 1 SMF22IOC BASED BDY(WORD),     /* I/O configuration change           16350000
*                                    element                        */  16400000
*   3 * CHAR(1),                  /* Reserved                       */  16450000
*   3 SMF22OID FIXED(8),          /* Element ID, x'0B' for I/O          16500000
*                                    configuration change           */  16550000
*   3 SMF22R#  FIXED(8),          /* Record number of this record       16600000
*                                                                   */  16650000
*   3 SMF22TR  FIXED(8),          /* Total number of records for this   16700000
*                                    I/O configuration change. For      16750000
*                                    example, if there are 3 records    16800000
*                                    total, and this record is the      16850000
*                                    first, SMF22R# would contain 1,    16900000
*                                    and SMF22TR would contain 3,       16950000
*                                    indicating record 1 of 3.      */  17000000
*   3 SMF22OFF  FIXED(16),        /* Offset of first entry in this      17050000
*                                    record                         */  17100000
*   3 SMF22ELN  FIXED(16),        /* Length of each entry           */  17150000
*   3 SMF22T#E  FIXED(32),        /* Total number of entries for this   17200000
*                                    I/O configuration change       */  17250000
*   3 SMF22#E   FIXED(32),        /* Number of entries in this record   17300000
*                                                                   */  17350000
*   3 SMF22FLS BIT(8),            /* Flags                          */  17400000
*     5 SMF22SFT BIT(1),          /* Indicates that software only       17450000
*                                    configuration changes              17500000
*                                    are to be made             @L1D*/  17550000
*     5 *        BIT(7),          /* Reserved                   @L1C*/  17600000
*   3 * BIT(8),                   /* Reserved                       */  17650000
*   3 SMF22IOD  CHAR(48),         /* IODF dataset which contains the    17700000
*                                    new I/O configuration          */  17750000
*     5 SMF22IDN CHAR(44),        /* IODF dataset name              */  17800000
*     5 * CHAR(4),                /* Reserved                       */  17850000
*   3 SMF22EDT  CHAR(2),          /* ID of new EDT                  */  17900000
*   3 SMF22CFI  CHAR(8),          /* Operating system configuration     17950000
*                                    ID for new configuration       */  18000000
*   3 SMF22HCT  CHAR(64),         /* Hardware configuration token that  18050000
*                                    represents the new I/O             18100000
*                                    configuration                  */  18150000
*   3 SMF22#UA  FIXED(32),        /* Number of UCBs added for this I/O  18200000
*                                    configuration change           */  18250000
*   3 SMF22#UD  FIXED(32),        /* Number of UCBs deleted for this    18300000
*                                    I/O configuration change       */  18350000
*   3 SMF22FNC  FIXED(8),         /* Activate function requested        18400000
*                                    (activate or recover)          */  18450000
*   3 * CHAR(3);                  /* Reserved                       */  18500000
*/********************************************************************/ 18550000
*/*                                                                  */ 18600000
*/*  The following structure maps the entry array in the I/O         */ 18650000
*/*  configuration change element.                                   */ 18700000
*/*                                                                  */ 18750000
*/********************************************************************/ 18800000
* DECLARE                                                               18850000
* 1 SMF22ARY BASED(ADDR(SMFRCD22)+SMF22OFF) BDY(WORD), /* Entry         18900000
*                                    array                          */  18950000
*   3 SMF22ENT(*) BDY(WORD),      /* Entry                          */  19000000
*     5 SMF22EHD,                 /* Entry header                   */  19050000
*       7 SMF22ETY FIXED(8),      /* Entry type                     */  19100000
*       7 SMF22ERQ FIXED(8),      /* Entry request                  */  19150000
*       7 SMF22EFL BIT(8),        /* Entry flags                    */  19200000
*         9 SMF22EHW BIT(1),      /* Hardware change                */  19250000
*         9 SMF22ESW BIT(1),      /* Software change                */  19300000
*         9 SMF22EST BIT(1),      /* Indicates that this entry was      19350000
*                                  created because a static device      19400000
*                                  is being changed to a dynamic        19450000
*                                  device. This entry represents the    19500000
*                                  delete request (SMF22ERQ=SMF22DD).   19550000
*                                  There will be another entry which    19600000
*                                  represents the add request.      */  19650000
*         9 SMF22ECN BIT(1),      /* Indicates whether UCB for device   19700000
*                                  is connected to a subchannel. Valid  19750000
*                                  only when SMF22ETY=SMF22DEV and      19800000
*                                  SMF22ERQ=SMF22DA.                */  19850000
*         9 * BIT(2),             /* Reserved                   @P1C*/  19854100
*         9 SMF22EAP BIT(1),      /* The activating partition will lose 19858200
*                                  access to the device because either  19862300
*                                  the device is deleted from the       19866400
*                                  configuration, or the activating     19870500
*                                  partition is being removed from the  19874600
*                                  candidate list of the device.        19878700
*                                  Valid when:                          19882800
*                                  SMF22ETY=SMF22DEV and                19886900
*                                    SMF22ERQ=SMF22DDD          @P1A*/  19891000
*         9 SMF22ECC BIT(1),      /* Indicates that this entry was      19895100
*                                  created because the candidate        19899200
*                                  list of the device was changed.      19903300
*                                  When SMF22ETY=SMF22DEV,              19907400
*                                  SMF22ERQ=SMF22DDD and SMF22ECC       19911500
*                                  is on, partition(s)                  19915600
*                                  were deleted from the device         19919700
*                                  candidate list.                      19923800
*                                  When SMF22ETY=SMF22DEV,              19927900
*                                  SMF22ERQ=SMF22DAD and SMF22ECC       19932000
*                                  is on, partition(s)                  19936100
*                                  were added to the device             19940200
*                                  candidate list.              @P1A*/  19944300
*       7 * BIT(8),               /* Reserved                       */  19950000
*     5 SMF22ESI CHAR(28) BDY(WORD); /* Entry type specific information 20000000
*                                    described below                */  20050000
*/********************************************************************/ 20100000
*/*                                                                  */ 20150000
*/*  The following structure maps SMF22ESI for device                */ 20200000
*/*  entries (SMF22ETY = SMF22DEV or SMF22MDEV).                 @L2C*/ 20250000
*/*                                                                  */ 20300000
*/********************************************************************/ 20350000
* DECLARE                                                               20400000
* 1 SMF22EDV BASED CHAR(LENGTH(SMF22ESI)) BDY(WORD), /* Device          20450000
*                                    entry                          */  20500000
*   3 SMF22DVN FIXED(16),         /* Device number                  */  20550000
*   3 SMF22DCM BIT(8),            /* Mask of CHPIDs contained in        20600000
*                                    SMF22DCH that were added to or     20650000
*                                    deleted from this device. Valid    20700000
*                                    only when SMF22ERQ = SMF22DAH or   20750000
*                                    SMF22DDH. Otherwise, zero.     */  20800000
*   3 SMF22DPM BIT(8),            /* Mask of physical control unit      20850000
*                                    numbers in SMF22DPC that were      20900000
*                                    added to or deleted from this      20950000
*                                    device. Valid only when SMF22ERQ = 21000000
*                                    SMF22DAP or SMF22DDP. Otherwise,   21050000
*                                    zero.                          */  21100000
*   3 SMF22DCH(8) CHAR(1),        /* Array of CHPIDs that were added    21150000
*                                    to or deleted from this device.    21200000
*                                    Valid only when SMF22ERQ =         21250000
*                                    SMF22DAH or SMF22DDH.              21300000
*                                    Otherwise, zero.               */  21350000
*   3 SMF22DPC(8) CHAR(2);        /* Array of physical control unit     21400000
*                                    numbers that were added to or      21450000
*                                    deleted from this device. Valid    21500000
*                                    only when SMF22ERQ = SMF22DAP or   21550000
*                                    SMF22DDP. Otherwise, zero.     */  21600000
*/********************************************************************/ 21650000
*/*                                                                  */ 21700000
*/*  The following structure maps SMF22ESI for control unit          */ 21750000
*/*  entries (SMF22ETY = SMF22PCU or SMF22MP).                   @L2C*/ 21800000
*/*                                                                  */ 21850000
*/********************************************************************/ 21900000
* DECLARE                                                               21950000
* 1 SMF22EPC BASED CHAR(LENGTH(SMF22ESI)) BDY(WORD), /* Physical        22000000
*                                    control unit entry             */  22050000
*   3 SMF22PCN FIXED(16),         /* Physical control unit number       22100000
*                                                                   */  22150000
*   3 *        CHAR(1),           /* Reserved                       */  22200000
*   3 SMF22PCM BIT(8),            /* Mask of channel path IDs in        22250000
*                                    SMF22PCH that were                 22300000
*                                    added or deleted from this         22350000
*                                    control unit. Valid only when      22400000
*                                    SMF22ERQ = SMF22PAH or SMF22PDH.   22450000
*                                    Otherwise, zero.               */  22500000
*   3 SMF22PCH(8) CHAR(1),        /* Array of CHPIDs that were added to 22550000
*                                    or deleted from this control unit. 22600000
*                                    Valid only when SMF22ERQ =         22650000
*                                    SMF22PAH or SMF22PDH. Otherwise,   22700000
*                                    zero.                          */  22750000
*   3 SMF22PUA CHAR(4),           /* Range of unit addresses that were  22800000
*                                    added to or deleted from the       22850000
*                                    control unit. Valid only when      22900000
*                                    SMF22ERQ = SMF22PMA or SMF22PMD.   22950000
*                                    Otherwise, zero.               */  23000000
*     5 * CHAR(1),                /* Reserved                       */  23050000
*     5 SMF22PUC FIXED(8),        /* Count of unit addresses        */  23100000
*     5 * CHAR(1),                /* Reserved                       */  23150000
*     5 SMF22PSU FIXED(8);        /* Starting unit address          */  23200000
*/********************************************************************/ 23250000
*/*                                                                  */ 23300000
*/*  The following structure maps SMF22ESI for CHPID                 */ 23350000
*/*  entries (SMF22ETY = SMF22CH).                                   */ 23400000
*/*                                                                  */ 23450000
*/********************************************************************/ 23500000
* DECLARE                                                               23550000
* 1 SMF22ECH BASED CHAR(LENGTH(SMF22ESI)) BDY(WORD), /* CHPID           23600000
*                                    entry                          */  23650000
*   3 SMF22CCH FIXED(8),          /* Channel path ID                */  23700000
*   3 *        CHAR(3);           /* Reserved                       */  23750000
*/********************************************************************/ 23800000
*/*                                                                  */ 23850000
*/*  The following constants are used to identify the function in    */ 23900000
*/*  SMF22FNC.                                                       */ 23950000
*/*                                                                  */ 24000000
*/********************************************************************/ 24050000
*DECLARE SMF22ACT FIXED(8) CONSTANT(1);   /* Activate function       */ 24100000
*DECLARE SMF22REC FIXED(8) CONSTANT(5);   /* Recover function        */ 24150000
*/********************************************************************/ 24200000
*/*                                                                  */ 24250000
*/*  The following constants identify the entry type in SMF22ETY.    */ 24300000
*/*                                                                  */ 24350000
*/********************************************************************/ 24400000
*DECLARE SMF22DEV FIXED(8) CONSTANT(1);   /* Device entry            */ 24450000
*DECLARE SMF22PCU FIXED(8) CONSTANT(2);   /* Control unit entry      */ 24500000
*DECLARE SMF22CH  FIXED(8) CONSTANT(3);   /* CHPID entry             */ 24550000
*DECLARE SMF22MDEV FIXED(8) CONSTANT(4);  /* coupling facility          24560000
*                                            device entry        @D1C*/ 24570000
*DECLARE SMF22MP   FIXED(8) CONSTANT(5);  /* coupling facility control  24580000
*                                            unit entry          @D1C*/ 24590000
*/********************************************************************/ 24600000
*/*                                                                  */ 24650000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 24700000
*/*  SMF22DEV or SMF22MDEV.                                      @L2C*/ 24750000
*/*                                                                  */ 24800000
*/********************************************************************/ 24850000
*DECLARE SMF22DDD FIXED(8) CONSTANT(01), /* Delete device            */ 24900000
*        SMF22DAD FIXED(8) CONSTANT(02), /* Add device               */ 24950000
*/********************************************************************/ 24957100
*/*                                                                  */ 24964200
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 24971300
*/*  SMF22DEV.                                                   @L2A*/ 24978400
*/*                                                                  */ 24985500
*/********************************************************************/ 24992600
*        SMF22DDH FIXED(8) CONSTANT(03), /* Modify to remove CHPID(s)*/ 25000000
*        SMF22DAH FIXED(8) CONSTANT(04), /* Modify to add CHPID(s)   */ 25050000
*        SMF22DDP FIXED(8) CONSTANT(05), /* Modify to remove CU(s)   */ 25100000
*        SMF22DAP FIXED(8) CONSTANT(06), /* Modify to add CU(s)      */ 25150000
*        SMF22DMC FIXED(8) CONSTANT(07), /* Modify subchannel           25200000
*                                           characteristics (illegal    25250000
*                                           status detection, and       25300000
*                                           interface timeout)       */ 25350000
*        SMF22DMP FIXED(8) CONSTANT(08); /* Modify preferred path       25400000
*                                                                @P1C*/ 25450000
*                                        /*                     2@P1D*/ 25500000
*/********************************************************************/ 25950000
*/*                                                                  */ 26000000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 26050000
*/*  SMF22PCU or SMF22MP.                                        @L2C*/ 26100000
*/*                                                                  */ 26150000
*/********************************************************************/ 26200000
*DECLARE SMF22PDP FIXED(8) CONSTANT(01), /* Delete control unit      */ 26250000
*        SMF22PAP FIXED(8) CONSTANT(02), /* Add control unit         */ 26300000
*        SMF22PDH FIXED(8) CONSTANT(03), /* Modify to delete CHPID(s)*/ 26350000
*        SMF22PAH FIXED(8) CONSTANT(04), /* Modify to add CHPID(s)   */ 26400000
*/********************************************************************/ 26407100
*/*                                                                  */ 26414200
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 26421300
*/*  SMF22PCU.                                                   @L2A*/ 26428400
*/*                                                                  */ 26435500
*/********************************************************************/ 26442600
*        SMF22PDU FIXED(8) CONSTANT(05), /* Modify to delete unit       26450000
*                                           address range            */ 26500000
*        SMF22PAU FIXED(8) CONSTANT(06); /* Modify to add unit address  26550000
*                                           range                    */ 26600000
*/********************************************************************/ 26650000
*/*                                                                  */ 26700000
*/*  The following constants define SMF22ERQ when SMF22ETY is        */ 26750000
*/*  SMF22CH.                                                        */ 26800000
*/*                                                                  */ 26850000
*/********************************************************************/ 26900000
*DECLARE SMF22CDH  FIXED(8) CONSTANT(01), /* Delete CHPID            */ 26950000
*        SMF22CAH  FIXED(8) CONSTANT(02), /* Add CHPID           @L1C*/ 27000000
*        SMF22CDI  FIXED(8) CONSTANT(03), /* Modify to delete logical   27050000
*                                            partition(s) from the      27100000
*                                            CHPID candidate list       27150000
*                                                                @L1A*/ 27250000
*        SMF22CAI  FIXED(8) CONSTANT(04); /* Modify to add logical      27300000
*                                            partition(s) to the        27350000
*                                            CHPID candidate list       27400000
*                                                                @L1A*/ 27450000
