*                                                                       00050000
* %DCL IRABQS_INCLUDED CHAR EXT;                                        00100000
* %DEACTIVATE IRABQS_INCLUDED;                                          00150000
* %IF IRABQS_INCLUDED = '' %THEN                                        00200000
* %DO;                                                                  00250000
*%/* Start of PL/X PreProlog Code */;                                   00300000
*                                                                       00350000
*%/* End of PL/X PreProlog Code */;                                     00400000
*/* Macro made bi-lingual on 97043. CBGEN compile date 96059         */ 00450000
*% /*                                                                   00500000
         MACRO                                                          00550000
         IRABQS &DSECT=YES,&LIST=YES,&TITLE=YES,&BQS_MAP=YES,          *00600000
               &BQSINT=COND,&BQSSC_MATRIX_MAP=COND,                    *00650000
               &BQSSC_ELEMENT_MAP=COND,&BQSRC_MATRIX_MAP=COND,         *00700000
               &BQSRC_ELEMENT_MAP=COND                                  00750000
         GBLC  &IRABQS_INCLUDED                                         00800000
         GBLC  &ZCBPRINT                                                00850000
&IRABQS_INCLUDED SETC 'YES'                                             00900000
         AIF   ('&LIST' EQ 'NONE').P0                                   00950000
         AIF   ('&TITLE' EQ 'NO').P5                                    01000000
 TITLE   'IRABQS  - Batch Queue Samples                           '     01050000
.P5      ANOP                                                           01100000
**/ IRABQS_1:;                                                          01150000
*/* Start of Specifications ******************************************  01200000
**                                                                      01250000
**01* EXTERNAL CLASSIFICATION: None                                     01300000
**01* END OF EXTERNAL CLASSIFICATION:                                   01350000
**                                                                      01400000
***** PROPRIETARY_STATEMENT ******************************************* 01450000
**01* PROPRIETARY STATEMENT=                                            01500000
**   LICENSED MATERIALS - PROPERTY OF IBM                               01550000
**   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                        01600000
**   5645-001 (C) COPYRIGHT IBM CORP. 1993, 1997                        01650000
**   SEE COPYRIGHT INSTRUCTIONS                                         01700000
**                                                                      01750000
**   STATUS= JBB6604                                                    01800000
**                                                                      01850000
***** END_OF_PROPRIETARY_STATEMENT ************************************ 01900000
**                                                                      01950000
**01* Descriptive Name:  Batch Queue Samples                            02000000
**                                                                      02050000
**02* Acronym:      BQS                                                 02100000
**                                                                      02150000
**01* Macro Name:   IRABQS                                              02200000
**                                                                      02250000
**01* DSECT Name:   BQS_MAP                                             02300000
**                                                                      02350000
**01* Component:  SYSTEMS RESOURCE MANAGER (SC1CX)                      02400000
**                                                                      02450000
**01* Eye-Catcher:  BQS                                                 02500000
**02*  Offset:      0                                                   02550000
**02*  Length:      3                                                   02600000
**                                                                      02650000
**01* Storage Attributes:                                               02700000
**02*  Subpool:              245 for accumulator BQS                    02714200
**                           205 for cycle BQS                          02728400
**                           245 for cycle BQS when recreated           02742600
**                            during recovery. This is done because     02756800
**                            subpool 205 cannot be obtained while      02771000
**                            under the WLM queue lock.                 02785200
**02*  Key:                  2                                          02800000
**02*  Residency:            Above 16M line                             02850000
**02*  Main Storage:         ESQA for Accumulator BQS                   02875000
**                           PRIVATE for Cycle BQS except when          02900000
**                            recovery has occurred then ESQA           02925000
**02*  Auxiliary Storage:                                               02950000
**02*  Virtual Storage:                                                 03000000
**                                                                      03050000
**01* Size:                                                             03066600
**           BQS_MAP x'178' bytes                                       03083200
**           BQSINT x'178' bytes                                        03099800
**           BQSSC_MATRIX_MAP x'1C48' bytes                             03116400
**           BQSRC_MATRIX_MAP x'1C48' bytes                             03133000
**                                                                      03150000
**           For one subsystem JES2 requires                            03157600
**             BQSINT x'158' bytes                                      03165200
**             BQSSC_MATRIX_MAP x'1C48' bytes                           03172800
**             BQSRC_MATRIX_MAP x'4E54' bytes                           03180400
**                                                                      03188000
**           For one subsystem WLM requires 2 of the following          03195600
**             BQS_MAP x'158' bytes                                     03203200
**             BQSSC_MATRIX_MAP x'1C48' bytes                           03210800
**             BQSRC_MATRIX_MAP x'4E54' bytes                           03218400
**                                                                      03226000
**                                                                      03233600
**01* Created by:    IWME2REG module that is invoked by IWMBREG         03241200
**                                                                      03250000
**01* Pointed to by:                                                    03300000
**                   - SMC_FIRST_BQS_PTR when on the cycle list         03333300
**                   - SMC_FIRST_ABQS_PTR when on the accumulator list  03366600
**                                                                      03400000
**01* Serialization: WLM Queue spin lock on creation of the SRM blocks. 03450000
**                                                                      03500000
**01* Function:  The IRABQS contains information that                   03550000
**               counts the delays for each batch service class.        03600000
**               This is a table where each entry represents a          03650000
**               service class representing batch work. The JES         03700000
**               creates this block on each checkpoint cycle.           03750000
**               The delays for each service class are tallied by       03800000
**               JES and then passed to SRM where the table is          03850000
**               copied to SRM storage. There is a list of the          03900000
**               BQS control block set to allow for multiple job        03950000
**               entry subsystems.                                      04000000
**                                                                      04050000
**                                                                      04100000
**                                                                      04150000
**01* Method of Access:                                                 04200000
**              THE ADDRESS OF IRABQS CB IS CONTAINED IN                04250000
**              THE - SMC_FIRST_BQS_PTR or THE                          04287500
**              SMC_FIRST_ABQS_PTR - which are                          04325000
**              fields of the Sample Monitoring Control block.          04362500
**                                                                      04400000
**02*  PL/X:                                                            04450000
**            IRABQS must be included to use this mapping.              04500000
**                                                                      04550000
**01* Change Activity:                                                  04600000
**    $L0=WLMCBAT,   JBB6604 961115 PD00PC: Bill Michiels               04650000
**                                          Workload Manager Sysplex    04700000
**                                          batch                       04750000
**    $L0=WLMCBAT1,  JBB6604 961206 PD00PC: Bill Michiels               04762500
**                                          Workload Manager Sysplex    04775000
**                                          batch                       04787500
**                                                                      04800000
**                                                                      04850000
**** End of Specifications *******************************************/ 04900000
*% /*                                                                   04950000
.P0      ANOP                                                           05000000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05050000
         AIF   ('&LIST' EQ 'YES').P2                                    05100000
.P1      ANOP                                                           05150000
         PUSH  PRINT                                                    05200000
         PRINT OFF                                                      05250000
.P2      ANOP                                                           05300000
*                                                                       05350000
*    *****************************************************************  05400000
*    *                                                               *  05450000
*    * IRABQS.671: Respecifies for based definitions.                *  05500000
*    *                                                               *  05550000
*    *****************************************************************  05600000
*                                                                       05650000
*                                                                       05700000
         AIF   ('&BQS_MAP' EQ 'NO').L0002                               05750000
         AIF   ('&DSECT' EQ 'YES').L0003                                05800000
         AIF   ('&BQS_MAP' NE 'YES').L0002                              05850000
BQS_MAP  DS    0D                                                       05900000
         AGO   .L0004                                                   05950000
.L0003   ANOP                                                           06000000
BQS_MAP  DSECT                                                          06050000
.L0004   ANOP                                                           06100000
BQS_ID   DS    0CL0020   IRABQS.32: identification data                 06150000
BQS_HDR  DS    1CL0008   IRABQS.38: BQS identifier                      06200000
BQS_VER  DS    1CL0001   IRABQS.44: Version                             06250000
BQS_COMPONENT DS 1CL0005 IRABQS.50: Component id                        06300000
BQS_SUBPOOL DS 1FL1      IRABQS.56: BQS subpool                         06333300
         DS    1CL0001   IRABQS.798: Reserved                           06366600
BQS_LENGTH DS  1FL4      IRABQS.62: control block length                06400000
BQS_BATCH_SAMPLES DS 0CL0264 IRABQS.872: sample data from the          *06450000
                         subsystem                                      06500000
BQS_SUBSYSNM DS 1CL0008  IRABQS.316: Subsystem name specified on       *06533300
                         Connect service.                               06566600
BQS_SUBSYS_TYPE DS 1CL0004 IRABQS.555: Subsystem type specified on     *06599900
                         Connect service.                               06633200
         DS    1CL0068   IRABQS.519: reserved                           06666500
BQS_SC   DS    0CL0068   IRABQS.790: Service class delay samples       *06700000
                         matrix information                             06750000
BQSSC_HIGH_INDEX DS 1FL4 IRABQS.1090: index of the highest service     *06800000
                         class index for which there was a sample.      06850000
BQSSC_MATRIX_CB_PTR DS 1AL4 IRABQS.1097: Pointer to the                *06882000
                         bqssc_MATRIX_MAP. Points to start of header   *06914000
                         in control block that contains the header and *06946000
                         the table.                                     06978000
BQSSC_MATRIX_CB_SIZE DS 1FL4 IRABQS.988: size of the storage required  *07010000
                         for the service class queue delay matrix and  *07050000
                         its header.                                    07100000
BQSSC_MATRIX_PTR DS 1AL4 IRABQS.742: Pointer to the bqssc_MATRIX. The  *07150000
                         field exists for use in pointer notation.      07200000
BQSSC_SERVICE_TOTAL DS 1FL4 IRABQS.458: total number of server class   *07250000
                         queue delay elements. Total is currently 100  *07350000
                         but is being set to 256 to match the maximum  *07400000
                         size that the index will allow                 07450000
         DS    1CL0048   IRABQS.681: reserved                           07500000
BQS_RC   DS    0CL0068   IRABQS.426: Report class delay samples matrix *07550000
                         information                                    07600000
BQSRC_HIGH_INDEX DS 1FL4 IRABQS.768: index of the highest report class *07650000
                         for which there was a sample.                  07700000
BQSRC_MATRIX_CB_PTR DS 1AL4 IRABQS.1104: Pointer to the                *07725000
                         bqsrc_MATRIX_MAP. This points to the header   *07750000
                         that precedes the bqsrc_matrix.                07775000
BQSRC_MATRIX_CB_SIZE DS 1FL4 IRABQS.1110: size of the storage required *07800000
                         for the report class queue delay matrix and   *07850000
                         its header.                                    07900000
BQSRC_MATRIX_PTR DS 1AL4 IRABQS.1116: Pointer to the bqsrc_matrix. The *07937500
                         field exists for use in pointer notation.     *07975000
                         This field points to the table itself.         08012500
BQSRC_REPORT_TOTAL DS 1FL4 IRABQS.1122: total number of report class   *08050000
                         queue delay elements.                          08100000
         DS    1CL0048   IRABQS.1128: reserved                          08250000
         DS    1CL0048   IRABQS.518: reserved                           08300000
BQS_NEXT DS    1AL4      IRABQS.149: address of next bqs in cycle list  08350000
BQS_PREV DS    1AL4      IRABQS.155: address of prev bqs in cycle list  08400000
BQS_FLAGS DS   0BL4      IRABQS.1012: flags related to state of the    *08450000
                         subsystem samples on wlm or srm side.          08500000
BQS_FLAGS_INUSE EQU X'80' IRABQS.1009: if flag is set the entry is     *08550000
                         currently in use. If the flag is off the      *08600000
                         entry does not currently represent subsystem  *08650000
                         data. This flag is not set until the cb has   *08700000
                         been initialized by iwmbreg. This is set off  *08750000
                         when the subsystem that occupies the entry    *08800000
                         has terminated.                                08850000
         ORG   BQS_FLAGS+X'00000004'                                    08900000
BQS_ACCUM_NEXT DS 1AL4   IRABQS.168: address of next bqs in            *08912500
                         accumulator list                               08925000
BQS_ACCUM_PREV DS 1AL4   IRABQS.433: address of prev bqs in            *08937500
                         accumulator list                               08946100
BQS_CYCLE_PTR DS 1AL4    IRABQS.1073: Cycle ptr in the accumulator bqs  08954700
BQS_SVDEF DS   0CL0032   IRABQS.1008: The service definition id        *08963300
                         provided in the IWMBSMP macro invocation.      08971900
SVDIDNAM DS    1CL0008   IWMSVDID.44: Name of the service definition   *08980700
                         from which the service policy was extracted    08982600
SVDIDTDI DS    1BL8      IWMSVDID.50: Time/date (STCK format) that the *08984500
                         service definition was installed               08986400
SVDIDUSE DS    1CL0008   IWMSVDID.56: Userid of the service            *08988300
                         administrator that installed the service      *08990200
                         definition                                     08992100
SVDIDSYS DS    1CL0008   IWMSVDID.62: Name of the system on which the  *08994000
                         service definition was installed               08995900
BQS_ACCUM_PTR DS 1AL4    IRABQS.844: Accumulator ptr in the cycle bqs. *08996300
                         Update is not serialized at creation of the   *08996700
                         cycle bqs. It is updated at the creation of   *08997100
                         the accumulator bqs under the wlmqueue lock.  *08997500
                         This field is only used in recovery. The      *08997900
                         value is not filled in until the accumulator  *08998300
                         BQS is built                                   08998700
         DS    1CL0032   IRABQS.810: reserved                           08999100
BQS_MAP_LEN EQU *-BQS_MAP                                               09000000
.L0002   ANOP                                                           09050000
*                                                                       09100000
*    *****************************************************************  09150000
*    *                                                               *  09200000
*    * IRABQS.207: This map contains the interface information for   *  09250000
*    * the batch queues service and report class matricies. The      *  09300000
*    * bloick is used by the jes to pass the matrices to srm via a   *  09350000
*    * sysevent.                                                     *  09400000
*    *                                                               *  09450000
*    *****************************************************************  09500000
*                                                                       09550000
*                                                                       09600000
         AIF   ('&BQSINT' EQ 'NO').L0005                                09650000
         AIF   ('&DSECT' EQ 'YES').L0006                                09700000
         AIF   ('&BQSINT' NE 'YES').L0005                               09750000
BQSINT   DS    0D                                                       09800000
         AGO   .L0007                                                   09850000
.L0006   ANOP                                                           09900000
BQSINT   DSECT                                                          09950000
.L0007   ANOP                                                           10000000
BQSINT_ID DS   0CL0020   IRABQS.653: identification data                10050000
BQSINT_HDR DS  1CL0008   IRABQS.659: BQS identifier                     10100000
BQSINT_VER DS  1CL0001   IRABQS.641: Version                            10150000
BQSINT_COMPONENT DS 1CL0005 IRABQS.227: Component id                    10200000
         DS    1CL0002   IRABQS.565: Reserved                           10250000
BQSINT_LENGTH DS 1FL4    IRABQS.568: control block length               10300000
BQSINT_BATCH_SAMPLES DS 0CL0264 IRABQS.436: sample data sent to        *10350000
                         srm/wlm                                        10400000
BQS_SUBSYSNM DS 1CL0008  IRABQS.316: Subsystem name specified on       *10433300
                         Connect service.                               10466600
BQS_SUBSYS_TYPE DS 1CL0004 IRABQS.555: Subsystem type specified on     *10499900
                         Connect service.                               10533200
         DS    1CL0068   IRABQS.519: reserved                           10566500
BQS_SC   DS    0CL0068   IRABQS.790: Service class delay samples       *10600000
                         matrix information                             10650000
BQSSC_HIGH_INDEX DS 1FL4 IRABQS.1090: index of the highest service     *10700000
                         class index for which there was a sample.      10750000
BQSSC_MATRIX_CB_PTR DS 1AL4 IRABQS.1097: Pointer to the                *10782000
                         bqssc_MATRIX_MAP. Points to start of header   *10814000
                         in control block that contains the header and *10846000
                         the table.                                     10878000
BQSSC_MATRIX_CB_SIZE DS 1FL4 IRABQS.988: size of the storage required  *10910000
                         for the service class queue delay matrix and  *10950000
                         its header.                                    11000000
BQSSC_MATRIX_PTR DS 1AL4 IRABQS.742: Pointer to the bqssc_MATRIX. The  *11050000
                         field exists for use in pointer notation.      11100000
BQSSC_SERVICE_TOTAL DS 1FL4 IRABQS.458: total number of server class   *11150000
                         queue delay elements. Total is currently 100  *11250000
                         but is being set to 256 to match the maximum  *11300000
                         size that the index will allow                 11350000
         DS    1CL0048   IRABQS.681: reserved                           11400000
BQS_RC   DS    0CL0068   IRABQS.426: Report class delay samples matrix *11450000
                         information                                    11500000
BQSRC_HIGH_INDEX DS 1FL4 IRABQS.768: index of the highest report class *11550000
                         for which there was a sample.                  11600000
BQSRC_MATRIX_CB_PTR DS 1AL4 IRABQS.1104: Pointer to the                *11625000
                         bqsrc_MATRIX_MAP. This points to the header   *11650000
                         that precedes the bqsrc_matrix.                11675000
BQSRC_MATRIX_CB_SIZE DS 1FL4 IRABQS.1110: size of the storage required *11700000
                         for the report class queue delay matrix and   *11750000
                         its header.                                    11800000
BQSRC_MATRIX_PTR DS 1AL4 IRABQS.1116: Pointer to the bqsrc_matrix. The *11837500
                         field exists for use in pointer notation.     *11875000
                         This field points to the table itself.         11912500
BQSRC_REPORT_TOTAL DS 1FL4 IRABQS.1122: total number of report class   *11950000
                         queue delay elements.                          12000000
         DS    1CL0048   IRABQS.1128: reserved                          12150000
         DS    1CL0048   IRABQS.518: reserved                           12200000
         DS    1CL0048   IRABQS.694: reserved                           12250000
BQSINT_LEN EQU *-BQSINT                                                 12328400
.L0005   ANOP                                                           12350000
*                                                                       12400000
*    *****************************************************************  12450000
*    *                                                               *  12500000
*    * IRABQS.604: service class queue delay matrix                  *  12550000
*    *                                                               *  12600000
*    *****************************************************************  12650000
*                                                                       12700000
*                                                                       12750000
         AIF   ('&BQSSC_MATRIX_MAP' EQ 'NO').L0008                      12800000
         AIF   ('&DSECT' EQ 'YES').L0009                                12850000
         AIF   ('&BQSSC_MATRIX_MAP' NE 'YES').L0008                     12900000
BQSSC_MATRIX_MAP DS 0D                                                  12950000
         AGO   .L000A                                                   13000000
.L0009   ANOP                                                           13050000
BQSSC_MATRIX_MAP DSECT                                                  13100000
.L000A   ANOP                                                           13150000
BQSSC_MAT_ID DS 0CL0024  IRABQS.345: identification data                13200000
BQSSC_MAT_HDR DS 1CL0008 IRABQS.351: bqssc_MAT identifier               13250000
BQSSC_MAT_VER DS 1CL0001 IRABQS.357: Version                            13300000
BQSSC_MAT_COMPONENT DS 1CL0005 IRABQS.363: Component id                 13350000
         DS    1CL0002   IRABQS.369: Reserved Table contents            13400000
BQSSC_MAT_LENGTH DS 1FL4 IRABQS.375: control block length               13450000
         DS    1AL4      IRABQS.381: reserved                           13500000
         DS    1CL0048   IRABQS.669: reserved                           13550000
BQSSC_MATRIX DS 0CL0028  IRABQS.387: Matrix of service classes with    *13600000
                         their related delays.                          13650000
BQSSC_SYS_QUEUE DS 1FL4  IRABQS.408: Sysplex queue delay. Jobs         *13700000
                         eligible to be initiated somewhere in the     *13750000
                         sysplex.                                       13800000
BQSSC_SYS_INELIGIBLE DS 1FL4 IRABQS.849: Sysplex ineligible. Jobs not  *13850000
                         eligible to be initiated on any system in the *13900000
                         sysplex. This includes operator held jobs,    *13950000
                         jobs held because of duplicate name, jobs     *14000000
                         busy on a jes transmitter (offload and keep).  14050000
BQSSC_SYS_LIMITED DS 1FL4 IRABQS.852: Sysplex limited. Jobs are not    *14150000
                         eligible because the jes job queue or queues  *14200000
                         that are related to these jobs have reached   *14250000
                         their limit of executing jobs. See limit on   *14300000
                         the JES class initialization statement.        14350000
BQSSC_LOCAL_QUEUE DS 1FL4 IRABQS.255: Local queue delay. Jobs eligible *14400000
                         to be initiated on this system.                14450000
BQSSC_LOCAL_INELIGIBLE DS 1FL4 IRABQS.261: Local ineligible. Jobs not  *14500000
                         eligible to be initiated on this system. This *14550000
                         includes operator held jobs, jobs held        *14600000
                         because of duplicate name, jobs busy on a jes *14650000
                         transmitter (offload and keep).                14700000
         DS    1CL0008   IRABQS.670: reserved                           14750000
         ORG   BQSSC_MATRIX_MAP+X'00001C48'                             14783300
BQSSC_MATRIX_MAP_LEN EQU *-BQSSC_MATRIX_MAP                             14816600
.L0008   ANOP                                                           14850000
*                                                                       14900000
*    *****************************************************************  14950000
*    *                                                               *  15000000
*    * IRABQS.616: block comment - bqssc_ELEMENT_MAP                 *  15050000
*    *                                                               *  15100000
*    *****************************************************************  15150000
*                                                                       15200000
* ********************************************************************  15250000
* *                                                                  *  15300000
* *    The bqssc_ELEMENT_MAP maps an element of the service          *  15350000
* *    class queue delays table. An element represents the           *  15400000
* *    delays encountered by jobs in wlm service class in a job      *  15450000
* *    entry subsystem.                                              *  15500000
* *                                                                  *  15550000
* ********************************************************************  15600000
*                                                                       15650000
*    *****************************************************************  15700000
*    *                                                               *  15750000
*    * IRABQS.633: This entry maps a service class queue delays in   *  15800000
*    * the bqssc_matrix_map.                                         *  15850000
*    *                                                               *  15900000
*    *****************************************************************  15950000
*                                                                       16000000
*                                                                       16050000
         AIF   ('&BQSSC_ELEMENT_MAP' EQ 'NO').L000B                     16100000
         AIF   ('&DSECT' EQ 'YES').L000C                                16150000
         AIF   ('&BQSSC_ELEMENT_MAP' NE 'YES').L000B                    16200000
BQSSC_ELEMENT_MAP DS 0F                                                 16250000
         AGO   .L000D                                                   16300000
.L000C   ANOP                                                           16350000
BQSSC_ELEMENT_MAP DSECT                                                 16400000
.L000D   ANOP                                                           16450000
BQSSC_SYS_QUEUE DS 1FL4  IRABQS.408: Sysplex queue delay. Jobs         *16500000
                         eligible to be initiated somewhere in the     *16550000
                         sysplex.                                       16600000
BQSSC_SYS_INELIGIBLE DS 1FL4 IRABQS.849: Sysplex ineligible. Jobs not  *16650000
                         eligible to be initiated on any system in the *16700000
                         sysplex. This includes operator held jobs,    *16750000
                         jobs held because of duplicate name, jobs     *16800000
                         busy on a jes transmitter (offload and keep).  16850000
BQSSC_SYS_LIMITED DS 1FL4 IRABQS.852: Sysplex limited. Jobs are not    *16950000
                         eligible because the jes job queue or queues  *17000000
                         that are related to these jobs have reached   *17050000
                         their limit of executing jobs. See limit on   *17100000
                         the JES class initialization statement.        17150000
BQSSC_LOCAL_QUEUE DS 1FL4 IRABQS.255: Local queue delay. Jobs eligible *17200000
                         to be initiated on this system.                17250000
BQSSC_LOCAL_INELIGIBLE DS 1FL4 IRABQS.261: Local ineligible. Jobs not  *17300000
                         eligible to be initiated on this system. This *17350000
                         includes operator held jobs, jobs held        *17400000
                         because of duplicate name, jobs busy on a jes *17450000
                         transmitter (offload and keep).                17500000
         DS    1CL0008   IRABQS.670: reserved                           17550000
BQSSC_ELEMENT_MAP_LEN EQU *-BQSSC_ELEMENT_MAP                           17600000
.L000B   ANOP                                                           17650000
*                                                                       17700000
*    *****************************************************************  17750000
*    *                                                               *  17800000
*    * IRABQS.903: report class queue delay matrix                   *  17850000
*    *                                                               *  17900000
*    *****************************************************************  17950000
*                                                                       18000000
*                                                                       18050000
         AIF   ('&BQSRC_MATRIX_MAP' EQ 'NO').L000E                      18100000
         AIF   ('&DSECT' EQ 'YES').L000F                                18150000
         AIF   ('&BQSRC_MATRIX_MAP' NE 'YES').L000E                     18200000
BQSRC_MATRIX_MAP DS 0D                                                  18250000
         AGO   .L0010                                                   18300000
.L000F   ANOP                                                           18350000
BQSRC_MATRIX_MAP DSECT                                                  18400000
.L0010   ANOP                                                           18450000
BQSRC_MAT_ID DS 0CL0024  IRABQS.88: identification data                 18500000
BQSRC_MAT_HDR DS 1CL0008 IRABQS.94: bqsrc_MAT identifier                18550000
BQSRC_MAT_VER DS 1CL0001 IRABQS.100: Version                            18600000
BQSRC_MAT_COMPONENT DS 1CL0005 IRABQS.106: Component id                 18650000
         DS    1CL0002   IRABQS.112: Reserved Table contents            18700000
BQSRC_MAT_LENGTH DS 1FL4 IRABQS.118: control block length               18750000
         DS    1AL4      IRABQS.131: reserved                           18800000
         DS    1CL0048   IRABQS.969: reserved                           18850000
BQSRC_MATRIX DS 0CL0020  IRABQS.137: Matrix of service classes with    *18900000
                         their related delays.                          18950000
BQSRC_SYS_QUEUE DS 1FL4  IRABQS.279: Sysplex queue delay. Jobs         *19000000
                         eligible to be initiated somewhere in the     *19050000
                         sysplex.                                       19100000
BQSRC_SYS_INELIGIBLE DS 1FL4 IRABQS.285: Sysplex ineligible. Jobs not  *19150000
                         eligible to be initiated on any system in the *19200000
                         sysplex. This includes operator held jobs,    *19250000
                         jobs held because of duplicate name, jobs     *19300000
                         busy on a jes transmitter (offload and keep).  19350000
BQSRC_SYS_LIMITED DS 1FL4 IRABQS.291: Sysplex limited. Jobs are not    *19450000
                         eligible because the jes job queue or queues  *19500000
                         that are related to these jobs have reached   *19550000
                         their limit of executing jobs. See limit on   *19600000
                         the JES class initialization statement.        19650000
         DS    1CL0008   IRABQS.820: reserved                           19700000
         ORG   BQSRC_MATRIX_MAP+X'00004E54'                             19733300
BQSRC_MATRIX_MAP_LEN EQU *-BQSRC_MATRIX_MAP                             19766600
.L000E   ANOP                                                           19800000
*                                                                       19850000
*    *****************************************************************  19900000
*    *                                                               *  19950000
*    * IRABQS.917: block comment - bqsrc_ELEMENT_MAP                 *  20000000
*    *                                                               *  20050000
*    *****************************************************************  20100000
*                                                                       20150000
* ********************************************************************  20200000
* *                                                                  *  20250000
* *    The bqsrc_ELEMENT_MAP maps an element of the report           *  20300000
* *    class queue delays table. An element represents the           *  20350000
* *    delays encountered by jobs in wlm report class in a job       *  20400000
* *    entry subsystem.                                              *  20450000
* *                                                                  *  20500000
* ********************************************************************  20550000
*                                                                       20600000
*    *****************************************************************  20650000
*    *                                                               *  20700000
*    * IRABQS.906: This entry maps a report class queue delays in the*  20750000
*    * bqsrc_matrix_map.                                             *  20800000
*    *                                                               *  20850000
*    *****************************************************************  20900000
*                                                                       20950000
*                                                                       21000000
         AIF   ('&BQSRC_ELEMENT_MAP' EQ 'NO').L0011                     21050000
         AIF   ('&DSECT' EQ 'YES').L0012                                21100000
         AIF   ('&BQSRC_ELEMENT_MAP' NE 'YES').L0011                    21150000
BQSRC_ELEMENT_MAP DS 0F                                                 21200000
         AGO   .L0013                                                   21250000
.L0012   ANOP                                                           21300000
BQSRC_ELEMENT_MAP DSECT                                                 21350000
.L0013   ANOP                                                           21400000
BQSRC_SYS_QUEUE DS 1FL4  IRABQS.279: Sysplex queue delay. Jobs         *21450000
                         eligible to be initiated somewhere in the     *21500000
                         sysplex.                                       21550000
BQSRC_SYS_INELIGIBLE DS 1FL4 IRABQS.285: Sysplex ineligible. Jobs not  *21600000
                         eligible to be initiated on any system in the *21650000
                         sysplex. This includes operator held jobs,    *21700000
                         jobs held because of duplicate name, jobs     *21750000
                         busy on a jes transmitter (offload and keep).  21800000
BQSRC_SYS_LIMITED DS 1FL4 IRABQS.291: Sysplex limited. Jobs are not    *21900000
                         eligible because the jes job queue or queues  *21950000
                         that are related to these jobs have reached   *22000000
                         their limit of executing jobs. See limit on   *22050000
                         the JES class initialization statement.        22100000
         DS    1CL0008   IRABQS.820: reserved                           22150000
*                                                                       22155000
*    *****************************************************************  22160000
*    *                                                               *  22165000
*    * IRABQS.1045: maximum number of service classes ever. There is *  22167000
*    * currently a limit of 100. 256 is being specified to allow     *  22169000
*    * future expansion. A high water mark in the BQS will prevent   *  22171000
*    * looking at the unused portion.                                *  22173000
*    *                                                               *  22175000
*    *****************************************************************  22180000
*                                                                       22185000
*                                                                       22190000
BQS_MAX_SERVICE_CLASSES EQU 256                                         22195000
*                                                                       22200000
*    *****************************************************************  22205000
*    *                                                               *  22210000
*    * IRABQS.1057: maximum number of report classes.                *  22215000
*    *                                                               *  22220000
*    *****************************************************************  22225000
*                                                                       22230000
*                                                                       22235000
BQS_MAX_REPORT_CLASSES EQU 999                                          22240000
BQSRC_ELEMENT_MAP_LEN EQU *-BQSRC_ELEMENT_MAP                           22245000
.L0011   ANOP                                                           22250000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 22300000
         AIF   ('&LIST' EQ 'YES').P4                                    22350000
.P3      ANOP                                                           22400000
         POP   PRINT                                                    22450000
.P4      ANOP                                                           22500000
.P_EXIT  ANOP                                                           22550000
         MEND                                                           22600000
**/ IRABQS_2:;                                                          22650000
* %IRABQS_INCLUDED = 'YES';                                             22700000
* %DCL ZCBPRINT CHAR EXT;                                               22750000
* %DEACTIVATE ZCBPRINT;                                                 22800000
* %DCL IRABQS_LIST CHAR EXT;                                            22850000
* %DEACTIVATE IRABQS_LIST;                                              22900000
* %IF IRABQS_LIST ^= 'NO' &                                             22950000
*    ZCBPRINT ^= 'NO' %THEN                                             23000000
*   %GOTO IRABQS_3;                                                     23050000
*   @LIST PUSH NOECHO;                                                  23100000
*   @LIST NOASSEMBLE NOECHO;                                            23150000
*   @LIST OFF C NOECHO;                                                 23200000
* %IRABQS_3:;                                                           23250000
*/* Start of PL/X Source                                             */ 23300000
*                                                                       23350000
*   /*****************************************************************/ 23400000
*   /*                                                               */ 23450000
*   /* IRABQS.671: Respecifies for based definitions.                */ 23500000
*   /*                                                               */ 23550000
*   /*****************************************************************/ 23600000
*                                                                       23650000
*   RESPECIFY                                                           23700000
*     BQS_MAP BASED(SMC_FIRST_BQS_PTR); /* Base the BQS_MAP          */ 23750000
*   RESPECIFY                                                           23800000
*     bqssc_MATRIX_MAP BASED(bqssc_MATRIX_CB_PTR);                      23850000
*   RESPECIFY                                                           23900000
*     bqsrc_MATRIX_MAP BASED(bqsrc_MATRIX_CB_PTR);                      23950000
*                                                                       24000000
*   /*****************************************************************/ 24050000
*   /*                                                               */ 24100000
*   /* IRABQS.598: This map contains the header information for the  */ 24150000
*   /* batch queues service and report class matricies.              */ 24200000
*   /*                                                               */ 24250000
*   /*****************************************************************/ 24300000
*                                                                       24350000
*   DECLARE                                                             24400000
*     1    BQS_MAP  BASED(*) BDY(DWORD),                                24450000
*      2    BQS_ID   BDY(WORD),     /* IRABQS.32: identification data*/ 24500000
*       3    BQS_HDR  CHAR(8),      /* IRABQS.38: BQS identifier     */ 24550000
*       3    BQS_VER  CHAR(1),      /* IRABQS.44: Version            */ 24600000
*       3    BQS_COMPONENT CHAR(5), /* IRABQS.50: Component id       */ 24650000
*       3    BQS_SUBPOOL FIXED(8),  /* IRABQS.56: BQS subpool        */ 24683300
*       3    *        CHAR(1),      /* IRABQS.798: Reserved          */ 24716600
*       3    BQS_LENGTH FIXED(31),  /* IRABQS.62: control block         24750000
*                                      length                        */ 24800000
*      2    BQS_BATCH_SAMPLES BDY(WORD), /* IRABQS.872: sample data     24850000
*                                      from the subsystem            */ 24900000
*       3    BQS_SUBSYSNM CHAR(8),  /* IRABQS.316: Subsystem name       24933300
*                                      specified on Connect service. */ 24966600
*       3    BQS_SUBSYS_TYPE CHAR(4), /* IRABQS.555: Subsystem type     24999900
*                                      specified on Connect service. */ 25033200
*       3    *        CHAR(68),     /* IRABQS.519: reserved          */ 25066500
*       3    BQS_SC   BDY(WORD),    /* IRABQS.790: Service class        25100000
*                                      delay samples matrix             25150000
*                                      information                   */ 25200000
*        4    BQSSC_HIGH_INDEX FIXED(31), /* IRABQS.1090: index of      25250000
*                                      the highest service class        25300000
*                                      index for which there was a      25350000
*                                      sample.                       */ 25400000
*        4    BQSSC_MATRIX_CB_PTR POINTER(31), /* IRABQS.1097:          25428500
*                                      Pointer to the                   25452200
*                                      bqssc_MATRIX_MAP. Points to      25475900
*                                      start of header in control       25499600
*                                      block that contains the header   25523300
*                                      and the table.                */ 25547000
*        4    BQSSC_MATRIX_CB_SIZE FIXED(32), /* IRABQS.988: size of    25571000
*                                      the storage required for the     25600000
*                                      service class queue delay        25650000
*                                      matrix and its header.        */ 25700000
*        4    BQSSC_MATRIX_PTR POINTER(31), /* IRABQS.742: Pointer to   25750000
*                                      the bqssc_MATRIX. The field      25800000
*                                      exists for use in pointer        25850000
*                                      notation.                     */ 25900000
*        4    BQSSC_SERVICE_TOTAL FIXED(32), /* IRABQS.458: total       25950000
*                                      number of server class queue     26050000
*                                      delay elements. Total is         26100000
*                                      currently 100 but is being set   26150000
*                                      to 256 to match the maximum      26200000
*                                      size that the index will allow*/ 26250000
*        4    *        CHAR(48),    /* IRABQS.681: reserved          */ 26300000
*       3    BQS_RC   BDY(WORD),    /* IRABQS.426: Report class delay   26350000
*                                      samples matrix information    */ 26400000
*        4    BQSRC_HIGH_INDEX FIXED(31), /* IRABQS.768: index of the   26450000
*                                      highest report class for which   26500000
*                                      there was a sample.           */ 26550000
*        4    BQSRC_MATRIX_CB_PTR POINTER(31), /* IRABQS.1104:          26600000
*                                      Pointer to the                   26620000
*                                      bqsrc_MATRIX_MAP. This points    26640000
*                                      to the header that precedes      26660000
*                                      the bqsrc_matrix.             */ 26680000
*        4    BQSRC_MATRIX_CB_SIZE FIXED(32), /* IRABQS.1110: size of   26700000
*                                      the storage required for the     26750000
*                                      report class queue delay         26800000
*                                      matrix and its header.        */ 26850000
*        4    BQSRC_MATRIX_PTR POINTER(31), /* IRABQS.1116: Pointer     26900000
*                                      to the bqsrc_matrix. The field   26940000
*                                      exists for use in pointer        26980000
*                                      notation. This field points to   27020000
*                                      the table itself.             */ 27060000
*        4    BQSRC_REPORT_TOTAL FIXED(32), /* IRABQS.1122: total       27100000
*                                      number of report class queue     27200000
*                                      delay elements.               */ 27250000
*        4    *        CHAR(48),    /* IRABQS.1128: reserved         */ 27300000
*       3    *        CHAR(48),     /* IRABQS.518: reserved          */ 27350000
*      2    BQS_NEXT POINTER(31),   /* IRABQS.149: address of next      27400000
*                                      bqs in cycle list             */ 27450000
*      2    BQS_PREV POINTER(31),   /* IRABQS.155: address of prev      27500000
*                                      bqs in cycle list             */ 27550000
*      2    BQS_FLAGS BIT(32) ABNORMAL, /* IRABQS.1012: flags related   27600000
*                                      to state of the subsystem        27650000
*                                      samples on wlm or srm side.   */ 27700000
*       3    BQS_FLAGS_INUSE BIT(1), /* IRABQS.1009: if flag is set     27750000
*                                      the entry is currently in use.   27800000
*                                      If the flag is off the entry     27850000
*                                      does not currently represent     27900000
*                                      subsystem data. This flag is     27950000
*                                      not set until the cb has been    28000000
*                                      initialized by iwmbreg. This     28050000
*                                      is set off when the subsystem    28100000
*                                      that occupies the entry has      28150000
*                                      terminated.                   */ 28200000
*      2    BQS_ACCUM_NEXT POINTER(31), /* IRABQS.168: address of       28212500
*                                      next bqs in accumulator list  */ 28225000
*      2    BQS_ACCUM_PREV POINTER(31), /* IRABQS.433: address of       28237500
*                                      prev bqs in accumulator list  */ 28250000
*      2    BQS_CYCLE_PTR POINTER(31), /* IRABQS.1073: Cycle ptr in     28262500
*                                      the accumulator bqs           */ 28265700
*      2    BQS_SVDEF,              /* IRABQS.1008: The service         28268900
*                                      definition id provided in the    28272100
*                                      IWMBSMP macro invocation.     */ 28275300
*       3    SVDIDNAM CHAR(8),      /* IWMSVDID.44: Name of the         28278900
*                                      service definition from which    28280200
*                                      the service policy was           28281500
*                                      extracted                     */ 28282800
*       3    SVDIDTDI BIT(64),      /* IWMSVDID.50: Time/date (STCK     28284100
*                                      format) that the service         28285400
*                                      definition was installed      */ 28286700
*       3    SVDIDUSE CHAR(8),      /* IWMSVDID.56: Userid of the       28288000
*                                      service administrator that       28289300
*                                      installed the service            28290600
*                                      definition                    */ 28291900
*       3    SVDIDSYS CHAR(8),      /* IWMSVDID.62: Name of the         28293200
*                                      system on which the service      28294500
*                                      definition was installed      */ 28295800
*      2    BQS_ACCUM_PTR POINTER(31), /* IRABQS.844: Accumulator ptr   28296100
*                                      in the cycle bqs. Update is      28296400
*                                      not serialized at creation of    28296700
*                                      the cycle bqs. It is updated     28297000
*                                      at the creation of the           28297300
*                                      accumulator bqs under the        28297600
*                                      wlmqueue lock. This field is     28297900
*                                      only used in recovery. The       28298200
*                                      value is not filled in until     28298500
*                                      the accumulator BQS is built  */ 28298800
*      2    *        CHAR(32);      /* IRABQS.810: reserved          */ 28299100
*                                                                       28300000
*   /*****************************************************************/ 28350000
*   /*                                                               */ 28400000
*   /* IRABQS.207: This map contains the interface information for   */ 28450000
*   /* the batch queues service and report class matricies. The      */ 28500000
*   /* bloick is used by the jes to pass the matrices to srm via a   */ 28550000
*   /* sysevent.                                                     */ 28600000
*   /*                                                               */ 28650000
*   /*****************************************************************/ 28700000
*                                                                       28750000
*   DECLARE                                                             28800000
*     1    BQSINT   BASED(*) BDY(DWORD),                                28850000
*      2    BQSINT_ID BDY(WORD),    /* IRABQS.653: identification       28900000
*                                      data                          */ 28950000
*       3    BQSINT_HDR CHAR(8),    /* IRABQS.659: BQS identifier    */ 29000000
*       3    BQSINT_VER CHAR(1),    /* IRABQS.641: Version           */ 29050000
*       3    BQSINT_COMPONENT CHAR(5), /* IRABQS.227: Component id   */ 29100000
*       3    *        CHAR(2),      /* IRABQS.565: Reserved          */ 29150000
*       3    BQSINT_LENGTH FIXED(31), /* IRABQS.568: control block      29200000
*                                      length                        */ 29250000
*      2    BQSINT_BATCH_SAMPLES BDY(WORD), /* IRABQS.436: sample       29300000
*                                      data sent to srm/wlm          */ 29350000
*       3    BQS_SUBSYSNM CHAR(8),  /* IRABQS.316: Subsystem name       29383300
*                                      specified on Connect service. */ 29416600
*       3    BQS_SUBSYS_TYPE CHAR(4), /* IRABQS.555: Subsystem type     29449900
*                                      specified on Connect service. */ 29483200
*       3    *        CHAR(68),     /* IRABQS.519: reserved          */ 29516500
*       3    BQS_SC   BDY(WORD),    /* IRABQS.790: Service class        29550000
*                                      delay samples matrix             29600000
*                                      information                   */ 29650000
*        4    BQSSC_HIGH_INDEX FIXED(31), /* IRABQS.1090: index of      29700000
*                                      the highest service class        29750000
*                                      index for which there was a      29800000
*                                      sample.                       */ 29850000
*        4    BQSSC_MATRIX_CB_PTR POINTER(31), /* IRABQS.1097:          29878500
*                                      Pointer to the                   29902200
*                                      bqssc_MATRIX_MAP. Points to      29925900
*                                      start of header in control       29949600
*                                      block that contains the header   29973300
*                                      and the table.                */ 29997000
*        4    BQSSC_MATRIX_CB_SIZE FIXED(32), /* IRABQS.988: size of    30021000
*                                      the storage required for the     30050000
*                                      service class queue delay        30100000
*                                      matrix and its header.        */ 30150000
*        4    BQSSC_MATRIX_PTR POINTER(31), /* IRABQS.742: Pointer to   30200000
*                                      the bqssc_MATRIX. The field      30250000
*                                      exists for use in pointer        30300000
*                                      notation.                     */ 30350000
*        4    BQSSC_SERVICE_TOTAL FIXED(32), /* IRABQS.458: total       30400000
*                                      number of server class queue     30500000
*                                      delay elements. Total is         30550000
*                                      currently 100 but is being set   30600000
*                                      to 256 to match the maximum      30650000
*                                      size that the index will allow*/ 30700000
*        4    *        CHAR(48),    /* IRABQS.681: reserved          */ 30750000
*       3    BQS_RC   BDY(WORD),    /* IRABQS.426: Report class delay   30800000
*                                      samples matrix information    */ 30850000
*        4    BQSRC_HIGH_INDEX FIXED(31), /* IRABQS.768: index of the   30900000
*                                      highest report class for which   30950000
*                                      there was a sample.           */ 31000000
*        4    BQSRC_MATRIX_CB_PTR POINTER(31), /* IRABQS.1104:          31050000
*                                      Pointer to the                   31070000
*                                      bqsrc_MATRIX_MAP. This points    31090000
*                                      to the header that precedes      31110000
*                                      the bqsrc_matrix.             */ 31130000
*        4    BQSRC_MATRIX_CB_SIZE FIXED(32), /* IRABQS.1110: size of   31150000
*                                      the storage required for the     31200000
*                                      report class queue delay         31250000
*                                      matrix and its header.        */ 31300000
*        4    BQSRC_MATRIX_PTR POINTER(31), /* IRABQS.1116: Pointer     31350000
*                                      to the bqsrc_matrix. The field   31390000
*                                      exists for use in pointer        31430000
*                                      notation. This field points to   31470000
*                                      the table itself.             */ 31510000
*        4    BQSRC_REPORT_TOTAL FIXED(32), /* IRABQS.1122: total       31550000
*                                      number of report class queue     31650000
*                                      delay elements.               */ 31700000
*        4    *        CHAR(48),    /* IRABQS.1128: reserved         */ 31750000
*       3    *        CHAR(48),     /* IRABQS.518: reserved          */ 31800000
*      2    *        CHAR(48);      /* IRABQS.694: reserved          */ 31850000
*                                                                       31900000
*   /*****************************************************************/ 31950000
*   /*                                                               */ 32000000
*   /* IRABQS.604: service class queue delay matrix                  */ 32050000
*   /*                                                               */ 32100000
*   /*****************************************************************/ 32150000
*                                                                       32200000
*   DECLARE                                                             32250000
*     1    BQSSC_MATRIX_MAP BASED(*) BDY(DWORD),                        32300000
*      2    BQSSC_MAT_ID BDY(WORD), /* IRABQS.345: identification       32350000
*                                      data                          */ 32400000
*       3    BQSSC_MAT_HDR CHAR(8), /* IRABQS.351: bqssc_MAT            32450000
*                                      identifier                    */ 32500000
*       3    BQSSC_MAT_VER CHAR(1), /* IRABQS.357: Version           */ 32550000
*       3    BQSSC_MAT_COMPONENT CHAR(5), /* IRABQS.363: Component id*/ 32600000
*       3    *        CHAR(2),      /* IRABQS.369: Reserved Table       32700000
*                                      contents                      */ 32750000
*       3    BQSSC_MAT_LENGTH FIXED(31), /* IRABQS.375: control block   32800000
*                                      length                        */ 32850000
*       3    *        POINTER(31),  /* IRABQS.381: reserved          */ 32900000
*      2    *        CHAR(48),      /* IRABQS.669: reserved          */ 32950000
*      2    BQSSC_MATRIX(256) BDY(WORD), /* IRABQS.387: Matrix of       33000000
*                                      service classes with their       33050000
*                                      related delays.               */ 33100000
*       3    BQSSC_SYS_QUEUE FIXED(32), /* IRABQS.408: Sysplex queue    33150000
*                                      delay. Jobs eligible to be       33200000
*                                      initiated somewhere in the       33250000
*                                      sysplex.                      */ 33300000
*       3    BQSSC_SYS_INELIGIBLE FIXED(32), /* IRABQS.849: Sysplex     33350000
*                                      ineligible. Jobs not eligible    33400000
*                                      to be initiated on any system    33450000
*                                      in the sysplex. This includes    33500000
*                                      operator held jobs, jobs held    33550000
*                                      because of duplicate name,       33600000
*                                      jobs busy on a jes transmitter   33650000
*                                      (offload and keep).           */ 33700000
*       3    BQSSC_SYS_LIMITED FIXED(32), /* IRABQS.852: Sysplex        33800000
*                                      limited. Jobs are not eligible   33850000
*                                      because the jes job queue or     33900000
*                                      queues that are related to       33950000
*                                      these jobs have reached their    34000000
*                                      limit of executing jobs. See     34050000
*                                      limit on the JES class           34100000
*                                      initialization statement.     */ 34150000
*       3    BQSSC_LOCAL_QUEUE FIXED(32), /* IRABQS.255: Local queue    34200000
*                                      delay. Jobs eligible to be       34250000
*                                      initiated on this system.     */ 34300000
*       3    BQSSC_LOCAL_INELIGIBLE FIXED(32), /* IRABQS.261: Local     34350000
*                                      ineligible. Jobs not eligible    34400000
*                                      to be initiated on this          34450000
*                                      system. This includes operator   34500000
*                                      held jobs, jobs held because     34550000
*                                      of duplicate name, jobs busy     34600000
*                                      on a jes transmitter (offload    34650000
*                                      and keep).                    */ 34700000
*       3    *        CHAR(8);      /* IRABQS.670: reserved          */ 34750000
*                                                                       34800000
*   /*****************************************************************/ 34850000
*   /*                                                               */ 34900000
*   /* IRABQS.616: block comment - bqssc_ELEMENT_MAP                 */ 34950000
*   /*                                                               */ 35000000
*   /*****************************************************************/ 35050000
*                                                                       35100000
*/********************************************************************/ 35150000
*/*                                                                  */ 35200000
*/*    The bqssc_ELEMENT_MAP maps an element of the service          */ 35250000
*/*    class queue delays table. An element represents the           */ 35300000
*/*    delays encountered by jobs in wlm service class in a job      */ 35350000
*/*    entry subsystem.                                              */ 35400000
*/*                                                                  */ 35450000
*/********************************************************************/ 35500000
*                                                                       35550000
*   /*****************************************************************/ 35600000
*   /*                                                               */ 35650000
*   /* IRABQS.633: This entry maps a service class queue delays in   */ 35700000
*   /* the bqssc_matrix_map.                                         */ 35750000
*   /*                                                               */ 35800000
*   /*****************************************************************/ 35850000
*                                                                       35900000
*   DECLARE                                                             35950000
*     1    BQSSC_ELEMENT_MAP BASED(*) BDY(WORD),                        36000000
*      2    BQSSC_SYS_QUEUE FIXED(32), /* IRABQS.408: Sysplex queue     36050000
*                                      delay. Jobs eligible to be       36100000
*                                      initiated somewhere in the       36150000
*                                      sysplex.                      */ 36200000
*      2    BQSSC_SYS_INELIGIBLE FIXED(32), /* IRABQS.849: Sysplex      36250000
*                                      ineligible. Jobs not eligible    36300000
*                                      to be initiated on any system    36350000
*                                      in the sysplex. This includes    36400000
*                                      operator held jobs, jobs held    36450000
*                                      because of duplicate name,       36500000
*                                      jobs busy on a jes transmitter   36550000
*                                      (offload and keep).           */ 36600000
*      2    BQSSC_SYS_LIMITED FIXED(32), /* IRABQS.852: Sysplex         36700000
*                                      limited. Jobs are not eligible   36750000
*                                      because the jes job queue or     36800000
*                                      queues that are related to       36850000
*                                      these jobs have reached their    36900000
*                                      limit of executing jobs. See     36950000
*                                      limit on the JES class           37000000
*                                      initialization statement.     */ 37050000
*      2    BQSSC_LOCAL_QUEUE FIXED(32), /* IRABQS.255: Local queue     37100000
*                                      delay. Jobs eligible to be       37150000
*                                      initiated on this system.     */ 37200000
*      2    BQSSC_LOCAL_INELIGIBLE FIXED(32), /* IRABQS.261: Local      37250000
*                                      ineligible. Jobs not eligible    37300000
*                                      to be initiated on this          37350000
*                                      system. This includes operator   37400000
*                                      held jobs, jobs held because     37450000
*                                      of duplicate name, jobs busy     37500000
*                                      on a jes transmitter (offload    37550000
*                                      and keep).                    */ 37600000
*      2    *        CHAR(8);       /* IRABQS.670: reserved          */ 37650000
*                                                                       37700000
*   /*****************************************************************/ 37750000
*   /*                                                               */ 37800000
*   /* IRABQS.903: report class queue delay matrix                   */ 37850000
*   /*                                                               */ 37900000
*   /*****************************************************************/ 37950000
*                                                                       38000000
*   DECLARE                                                             38050000
*     1    BQSRC_MATRIX_MAP BASED(*) BDY(DWORD),                        38100000
*      2    BQSRC_MAT_ID BDY(WORD), /* IRABQS.88: identification data*/ 38150000
*       3    BQSRC_MAT_HDR CHAR(8), /* IRABQS.94: bqsrc_MAT             38200000
*                                      identifier                    */ 38300000
*       3    BQSRC_MAT_VER CHAR(1), /* IRABQS.100: Version           */ 38350000
*       3    BQSRC_MAT_COMPONENT CHAR(5), /* IRABQS.106: Component id*/ 38400000
*       3    *        CHAR(2),      /* IRABQS.112: Reserved Table       38500000
*                                      contents                      */ 38550000
*       3    BQSRC_MAT_LENGTH FIXED(31), /* IRABQS.118: control block   38600000
*                                      length                        */ 38650000
*       3    *        POINTER(31),  /* IRABQS.131: reserved          */ 38700000
*      2    *        CHAR(48),      /* IRABQS.969: reserved          */ 38750000
*      2    BQSRC_MATRIX(999) BDY(WORD), /* IRABQS.137: Matrix of       38800000
*                                      service classes with their       38850000
*                                      related delays.               */ 38900000
*       3    BQSRC_SYS_QUEUE FIXED(32), /* IRABQS.279: Sysplex queue    38950000
*                                      delay. Jobs eligible to be       39000000
*                                      initiated somewhere in the       39050000
*                                      sysplex.                      */ 39100000
*       3    BQSRC_SYS_INELIGIBLE FIXED(32), /* IRABQS.285: Sysplex     39150000
*                                      ineligible. Jobs not eligible    39200000
*                                      to be initiated on any system    39250000
*                                      in the sysplex. This includes    39300000
*                                      operator held jobs, jobs held    39350000
*                                      because of duplicate name,       39400000
*                                      jobs busy on a jes transmitter   39450000
*                                      (offload and keep).           */ 39500000
*       3    BQSRC_SYS_LIMITED FIXED(32), /* IRABQS.291: Sysplex        39600000
*                                      limited. Jobs are not eligible   39650000
*                                      because the jes job queue or     39700000
*                                      queues that are related to       39750000
*                                      these jobs have reached their    39800000
*                                      limit of executing jobs. See     39850000
*                                      limit on the JES class           39900000
*                                      initialization statement.     */ 39950000
*       3    *        CHAR(8);      /* IRABQS.820: reserved          */ 40000000
*                                                                       40050000
*   /*****************************************************************/ 40100000
*   /*                                                               */ 40150000
*   /* IRABQS.917: block comment - bqsrc_ELEMENT_MAP                 */ 40200000
*   /*                                                               */ 40250000
*   /*****************************************************************/ 40300000
*                                                                       40350000
*/********************************************************************/ 40400000
*/*                                                                  */ 40450000
*/*    The bqsrc_ELEMENT_MAP maps an element of the report           */ 40500000
*/*    class queue delays table. An element represents the           */ 40550000
*/*    delays encountered by jobs in wlm report class in a job       */ 40600000
*/*    entry subsystem.                                              */ 40650000
*/*                                                                  */ 40700000
*/********************************************************************/ 40750000
*                                                                       40800000
*   /*****************************************************************/ 40850000
*   /*                                                               */ 40900000
*   /* IRABQS.906: This entry maps a report class queue delays in the*/ 40950000
*   /* bqsrc_matrix_map.                                             */ 41000000
*   /*                                                               */ 41050000
*   /*****************************************************************/ 41100000
*                                                                       41150000
*   DECLARE                                                             41200000
*     1    BQSRC_ELEMENT_MAP BASED(*) BDY(WORD),                        41250000
*      2    BQSRC_SYS_QUEUE FIXED(32), /* IRABQS.279: Sysplex queue     41300000
*                                      delay. Jobs eligible to be       41350000
*                                      initiated somewhere in the       41400000
*                                      sysplex.                      */ 41450000
*      2    BQSRC_SYS_INELIGIBLE FIXED(32), /* IRABQS.285: Sysplex      41500000
*                                      ineligible. Jobs not eligible    41550000
*                                      to be initiated on any system    41600000
*                                      in the sysplex. This includes    41650000
*                                      operator held jobs, jobs held    41700000
*                                      because of duplicate name,       41750000
*                                      jobs busy on a jes transmitter   41800000
*                                      (offload and keep).           */ 41850000
*      2    BQSRC_SYS_LIMITED FIXED(32), /* IRABQS.291: Sysplex         41950000
*                                      limited. Jobs are not eligible   42000000
*                                      because the jes job queue or     42050000
*                                      queues that are related to       42100000
*                                      these jobs have reached their    42150000
*                                      limit of executing jobs. See     42200000
*                                      limit on the JES class           42250000
*                                      initialization statement.     */ 42300000
*      2    *        CHAR(8);       /* IRABQS.820: reserved          */ 42350000
*                                                                       42352600
*   /*****************************************************************/ 42355200
*   /*                                                               */ 42357800
*   /* IRABQS.1045: maximum number of service classes ever. There is */ 42358800
*   /* currently a limit of 100. 256 is being specified to allow     */ 42359800
*   /* future expansion. A high water mark in the BQS will prevent   */ 42360800
*   /* looking at the unused portion.                                */ 42361800
*   /*                                                               */ 42363000
*   /*****************************************************************/ 42365600
*                                                                       42368200
*   DECLARE                                                             42370800
*     BQS_MAX_SERVICE_CLASSES FIXED(31) CONSTANT(256);                  42373400
*                                                                       42376000
*   /*****************************************************************/ 42378600
*   /*                                                               */ 42381200
*   /* IRABQS.1057: maximum number of report classes.                */ 42383800
*   /*                                                               */ 42386400
*   /*****************************************************************/ 42389000
*                                                                       42391600
*   DECLARE                                                             42394200
*     BQS_MAX_REPORT_CLASSES FIXED(31) CONSTANT(999);                   42397100
*/* End of PL/X Source                                               */ 42400000
* %IF IRABQS_LIST ^= 'NO' &                                             42450000
*    ZCBPRINT ^= 'NO' %THEN                                             42500000
*   %GOTO IRABQS_4;                                                     42550000
*   @LIST POP NOECHO;                                                   42600000
* %IRABQS_4:;                                                           42650000
* %END;                                                                 42700000
