*                                                                       00050000
* %DCL IRAENF55_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IRAENF55_INCLUDED;                                        00150000
* %IF IRAENF55_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 95144. CBGEN compile date 94304         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IRAENF55 &DSECT=YES,&LIST=YES,&ENF55=YES                       00450000
         GBLC  &IRAENF55_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IRAENF55_INCLUDED SETC 'YES'                                           00600000
 TITLE   'IRAENF55  - ENF signal 55 parameters                    '     00650000
**/ IRAENF55_1:;                                                        00700000
*/****START OF SPECIFICATIONS*****************************************/ 00750000
*/*                                                                  */ 00800000
*/*01* Proprietary statement:                                        */ 00850000
*/*                                                                  */ 00900000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00950000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 01000000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1997,2000                  */ 01050000
*/*                                                                  */ 01150000
*/*                                                                  */ 01200000
*/*01* External classification: PSPI                                 */ 01250000
*/*01* End of External classification                                */ 01300000
*/*                                                                  */ 01350000
*/*01* Status: HBB7703                                               */ 01400000
*/*                                                                  */ 01450000
*/*01* Descriptive Name: ENF signal 55 parameters                    */ 01500000
*/*                                                                  */ 01550000
*/*01* Macro Name: IRAENF55                                          */ 01600000
*/*                                                                  */ 01650000
*/*01* DSECT Name: ENF55                                             */ 01700000
*/*                                                                  */ 01750000
*/*01* Component: SRM (SC1CX)                                        */ 01800000
*/*                                                                  */ 01850000
*/*01* Eye-Catcher: 'IRAENF55'                                       */ 01900000
*/*02*  offset: 0                                                    */ 01916600
*/*02*  length: 8                                                    */ 01933200
*/*                                                                  */ 01950000
*/*01* Storage Attributes:                                           */ 02000000
*/*02*  Subpool: 245                                                 */ 02050000
*/*02*  Residency: Above 16M line                                    */ 02100000
*/*                                                                  */ 02150000
*/*01* Size: 20 bytes                                                */ 02200000
*/*                                                                  */ 02250000
*/*01* Created by: IRARMST2                                          */ 02300000
*/*                                                                  */ 02350000
*/*01* Serialization: SRM LOCK                                       */ 02400000
*/*                                                                  */ 02450000
*/*01* Function: Contains parameters for ENF signal 55               */ 02500000
*/*                                                                  */ 02550000
*/*01* Restrictions: N/A                                             */ 02600000
*/*                                                                  */ 02650000
*/*01* Pointed to by: N/A                                            */ 02666600
*/*                                                                  */ 02683200
*/*01* Method of Access:                                             */ 02700000
*/*                                                                  */ 02750000
*/*02*  ASM:                                                         */ 02800000
*/*          Specify: IRAENF55                                       */ 02850000
*/*                                                                  */ 02900000
*/*02*  PLX:                                                         */ 02950000
*/*                                                                  */ 03000000
*/*          %INCLUDE SYSLIB(IRAENF55)                               */ 03050000
*/*                                                                  */ 03100000
*/*01* Change Activity:                                              */ 03150000
*/*    $WLMPENH  HBB6603 950504 PD88WB: WLMPENH - William Byrne      */ 03183300
*/*                                     Enhancements - ENF 55 signal */ 03216600
*/*                                     for storage shortages        */ 03250000
*/*                                                         @WLMPENH */ 03300000
*/*    $64BITSRM HBB7703 990630 PD88RK: Rich Ko                      */ 03310000
*/*                                     Define a new ENF55TYP value  */ 03320000
*/*                                     (4) for pageable frames in   */ 03330000
*/*                                     between the 16M and 2G lines */ 03340000
*/*                                                                  */ 03350000
*/****END OF SPECIFICATIONS*******************************************/ 03400000
*% /*                                                                   03450000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03500000
         AIF   ('&LIST' EQ 'YES').P2                                    03550000
.P1      ANOP                                                           03600000
         PUSH  PRINT                                                    03650000
         PRINT OFF                                                      03700000
.P2      ANOP                                                           03750000
         AIF   ('&ENF55' EQ 'NO').L0002                                 03800000
         AIF   ('&DSECT' EQ 'YES').L0003                                03850000
         AIF   ('&ENF55' NE 'YES').L0002                                03900000
ENF55    DS    0H        ENF signal 55 parameters                       03950000
         AGO   .L0004                                                   04000000
.L0003   ANOP                                                           04050000
ENF55    DSECT           ENF signal 55 parameters                       04100000
.L0004   ANOP                                                           04150000
ENF55ID  DS    1CL0008   Control Block ID - "IRAENF55"                  04200000
ENF55LEN DS    1FL2      Parameter List Length                          04250000
ENF55VER DS    1FL1      Parameter List Version                         04300000
ENF55TYP DS    1FL1      Type of frame needed to end shortage          *04350000
                         situation (for qualifier x'80000000')         *04387500
                         4 = Pageable frames in betwen the 16M and     *04425000
                             2G lines                                  *04462500
                         3 = Pageable frames below the 16M line        *04500000
                         2 = Pageable frames in real storage           *04537500
                         1 = PTA frames (DREF + fixed pages)           *04575000
                             in process storage               @64BITSRM 04612500
ENF55QLF DS    1BL4      Qualifier Code                                 04650000
ENF55FRM DS    1FL2      Number of frames needed to end shortage       *04700000
                         situation (valid for qualifier code           *04750000
                         x'80000000')                                   04800000
ENF55RSV DS    1CL0002   Reserved                                       04850000
ENF55QLF_SHORTAGE_RECOGNIZED EQU X'80000000' Storage Shortage. Too     *04900000
                         many fixed frames - start signal               04950000
ENF55QLF_SHORTAGE_RELIEVED EQU X'40000000' Storage due to fixed        *05000000
                         storage - relieved                             05050000
ENF55_VERSION1 EQU 1     Version 1 constant                             05100000
ENF55_LATEST_VERSION EQU 1 Latest version constant                      05150000
ENF55_LEN EQU  *-ENF55                                                  05200000
.L0002   ANOP                                                           05250000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 05300000
         AIF   ('&LIST' EQ 'YES').P4                                    05350000
.P3      ANOP                                                           05400000
         POP   PRINT                                                    05450000
.P4      ANOP                                                           05500000
.P_EXIT  ANOP                                                           05550000
         MEND                                                           05600000
**/ IRAENF55_2:;                                                        05650000
* %IRAENF55_INCLUDED = 'YES';                                           05700000
* %DCL ZCBPRINT CHAR EXT;                                               05750000
* %DEACTIVATE ZCBPRINT;                                                 05800000
* %DCL IRAENF55_LIST CHAR EXT;                                          05850000
* %DEACTIVATE IRAENF55_LIST;                                            05900000
* %IF IRAENF55_LIST ^= 'NO' &                                           05950000
*    ZCBPRINT ^= 'NO' %THEN                                             06000000
*   %GOTO IRAENF55_3;                                                   06050000
*   @LIST PUSH NOECHO;                                                  06100000
*   @LIST NOASSEMBLE NOECHO;                                            06150000
*   @LIST OFF C NOECHO;                                                 06200000
* %IRAENF55_3:;                                                         06250000
*/* Start of PL/X Source                                             */ 06300000
* DECLARE                                                               06350000
*  1 ENF55 BASED,                   /* ENF signal 55 parameters      */ 06400000
*    3 ENF55ID  CHAR(8),            /* Control Block ID - "IRAENF55" */ 06450000
*    3 ENF55LEN FIXED(16),          /* Parameter List Length         */ 06500000
*    3 ENF55VER FIXED(8),           /* Parameter List Version        */ 06550000
*    3 ENF55TYP FIXED(8),           /* Type of frame needed to end      06600000
*                                      shortage situation               06650000
*                                      (for qualifier x'80000000')      06700000
*                                      4 = Pageable frames in between   06730000
*                                          the 16M and 2G lines         06760000
*                                      3 = Pageable frames below 16M    06790000
*                                          line                         06820000
*                                      2 = Pageable frames in           06850000
*                                          real storage                 06900000
*                                      1 = PTA frames (DREF + fixed     06950000
*                                          pages) in processor          06983300
*                                          storage          @64BITSRM*/ 07016600
*    3 ENF55QLF BIT(32),            /* Qualifier Code                */ 07050000
*    3 ENF55FRM FIXED(16),          /* Number of frames needed to end   07100000
*                                      shortage situation (valid for    07150000
*                                      qualifier code x'80000000')   */ 07200000
*    3 ENF55RSV CHAR(2);            /* Reserved                      */ 07250000
* DECLARE                                                               07300000
*   ENF55QLF_SHORTAGE_RECOGNIZED  BIT(32) CONSTANT('80000000'X),        07350000
*                                   /* Storage Shortage. Too many fixed 07400000
*                                      frames - start signal         */ 07450000
*   ENF55QLF_SHORTAGE_RELIEVED    BIT(32) CONSTANT('40000000'X),        07500000
*                                   /* Storage due to fixed storage -   07550000
*                                      relieved                      */ 07600000
*   ENF55_VERSION1                FIXED(32) CONSTANT(1),                07650000
*                                   /* Version 1 constant            */ 07700000
*   ENF55_LATEST_VERSION          FIXED(32) CONSTANT(ENF55_VERSION1),   07750000
*                                   /* Latest version constant       */ 07800000
*   ENF55_EYECATCHER              CHAR(8) CONSTANT('IRAENF55');         07850000
*                                   /* Storage due to fixed storage -   07900000
*                                      relieved                      */ 07950000
*/* End of PL/X Source                                               */ 08000000
* %IF IRAENF55_LIST ^= 'NO' &                                           08050000
*    ZCBPRINT ^= 'NO' %THEN                                             08100000
*   %GOTO IRAENF55_4;                                                   08150000
*   @LIST POP NOECHO;                                                   08200000
* %IRAENF55_4:;                                                         08250000
* %END;                                                                 08300000
