*        %GOTO RMCTPLS1; /*                                             00050000
         MACRO                                                          00100000
         IRARMCT &DSECT=YES                                             00150000
         IEZBITS                                                     */ 00200000
*%RMCTPLS1:  ;                                                          00250000
*/********************************************************************/ 00300000
*/********************************************************************/ 00350000
*/* START OF SPECIFICATIONS ******************************************/ 00400000
*/*01* PROPRIETARY STATEMENT=                                        */ 00450000
* /*                                                                 */ 00500000
* /*               LICENSED MATERIALS - PROPERTY OF IBM              */ 00550000
* /*               THIS MACRO IS "RESTRICTED MATERIALS OF IBM"       */ 00600000
* /*               5647-A01 (C) COPYRIGHT IBM CORP. 1977, 2000       */ 00650000
*/*                                                                  */ 00750000
*/**** END_OF_PROPRIETARY_STATEMENT **********************************/ 00800000
*/*                                                                  */ 00850000
*/*01* STATUS:  HBB7703                                              */ 00900000
*/*                                                                  */ 00950000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 01000000
*/*02* DMTI:      BASE                                               */ 01050000
*/*02* GUPI:      FIELDS RMCTCMCT                                    */ 01100000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01150000
*/*                                                                  */ 01200000
*/*01* DESCRIPTIVE NAME:  SYSTEM RESOURCES MANAGER CONTROL TABLE     */ 01250000
*/*02*  ACRONYM:  RMCT                                               */ 01300000
*/*                                                                  */ 01350000
*/*01* MACRO NAME: IRARMCT                                           */ 01400000
*/*                                                                  */ 01450000
*/*01* DSECT NAME: RMCT                                              */ 01500000
*/*                                                                  */ 01550000
*/*01* COMPONENT:  System Resources Manager (SC1CX)                  */ 01600000
*/*                                                                  */ 01650000
*/*01* EYE-CATCHER:  RMCT                                            */ 01700000
*/*02*  OFFSET:  0                                                   */ 01750000
*/*02*  LENGTH:  4                                                   */ 01800000
*/*                                                                  */ 01850000
*/*01* STORAGE ATTRIBUTES:                                           */ 01900000
*/*02*  SUBPOOL:  NUCLEUS                                            */ 01950000
*/*02*  KEY:  key 0                                                  */ 02000000
*/*                                                                  */ 02050000
*/*02*  RESIDENCY: (Residence - above 16M)                           */ 02100000
*/*02*  MAIN STORAGE:  YES                                           */ 02150000
*/*                                                                  */ 02200000
*/*02*  AUXILIARY STORAGE:  NO                                       */ 02250000
*/*02*  VIRTUAL STORAGE:  YES                                        */ 02300000
*/*                                                                  */ 02350000
*/*02*  DATA SPACE: NO                                               */ 02400000
*/*                                                                  */ 02450000
*/*01* SIZE: 744  bytes                                              */ 02500000
*/*                                                                  */ 02550000
*/*01* CREATED BY:  Assembled into nucleus module, IRARMCNS          */ 02600000
*/*                                                                  */ 02650000
*/*                                                                  */ 02700000
*/*01* POINTED TO BY: CVTOPCTP field of the CVT data area            */ 02750000
*/*                                                                  */ 02800000
*/*01* SERIALIZATION: SRM lock                                       */ 02850000
*/*                   (some fields are compare and swap serialized,  */ 02900000
*/*                    as noted on field descriptions)               */ 02950000
*/*                                                                  */ 03000000
*/*01* FUNCTION:                                                     */ 03050000
*/*         THE RMCT SERVES AS THE ORIGIN TO LOCATE SYSTEM       @P2C*/ 03100000
*/*         RESOURCES MANAGER TABLES AND ENTRY POINTS.  THE RMCT @P2C*/ 03150000
*/*         LOCATES THE SCHEDULING / ROUTING INFORMATION USED TO @P2C*/ 03200000
*/*         INVOKE THE REQUIRED PROCESSING FOR THE VARIOUS SYSTEM    */ 03250000
*/*         RESOURCES MANAGER FUNCTIONS.                         @P2C*/ 03300000
*/*                                                                  */ 03350000
*/*01* METHOD OF ACCESS:                                             */ 03400000
* /*         THE ADDRESS OF THE RMCT IS CONTAINED IN                 */ 03450000
* /*         THE -CVTOPCTP- FIELD OF THE CVT.                        */ 03500000
* /*                                                                 */ 03550000
* /*         BY CONVENTION WITHIN THE SYSTEM RESOURCES MANAGER       */ 03600000
* /*         ROUTINES, REGISTER 2 IS ALWAYS RESERVED TO CONTAIN      */ 03650000
* /*         THE ADDRESS OF THE RMCT.                                */ 03700000
*/*                                                                  */ 03750000
*/*01* DELETED BY: List of modules/macros that remove the data area  */ 03800000
*/*                from storage. (Could be user code)                */ 03850000
*/*                                                                  */ 03900000
*/*01* DEPENDENCIES:                                                 */ 03950000
*/*                                                                  */ 04000000
*/*01* DISTRIBUTION LIBRARY: Library into which this data area       */ 04050000
*/*                           transmits                              */ 04100000
*/*                                                                  */ 04150000
*/*01* CHANGE ACTIVITY: List of changes for this data area           */ 04200000
*/*                                                                  */ 04250000
*/* END OF SPECIFICATIONS ********************************************/ 04300000
* /*                                                                 */ 04350000
* /*                                                                 */ 04400000
* /*                                                                 */ 04450000
* /* *************************************************************** */ 04500000
*        %GOTO RMCTPLS2; /*                                             04550000
         AGO   .RMCTAL1                                              */ 04600000
* /* *************************************************************** */ 04650000
* /*                                                                 */ 04700000
* /*   INVOCATION PARAMETERS AND/OR KEYWORDS =                       */ 04750000
* /*                                                                 */ 04800000
* /*                                                                 */ 04850000
* /*     BAL - DSECT=YES   IF DSECT FOR JUST THE RMCT IS DESIRED     */ 04900000
* /*                                                                 */ 04950000
* /*           NOTE - MACRO IEAZBITS IS USED BY IRARMCT.             */ 05000000
* /*                  IEAZBITS IS LOCATED IN SYS1.MODGEN             */ 05050000
* /*                                                         @YA66862*/ 05100000
* /*                                                                 */ 05150000
* /*     BAL - DSECT=NO IF DSECT IS NOT TO BE PRODUCED.              */ 05200000
* /*                                                                 */ 05250000
* /*           NOTE - THE BAL FORM OF THE MACRO IS CODED WITH        */ 05300000
* /*           'DC' INSTRUCTIONS, SO THAT THE MACRO MAY BE USED      */ 05350000
* /*           TO ASSEMBLE THE INITIAL FIELD VALUES FOR THE          */ 05400000
* /*           IRARMCNS MODULE, WHICH CONTAINS THE RMCT.             */ 05450000
* /*                                                                 */ 05500000
* /*         USING ON RMCT GIVES ADDRESSABILITY TO ALL SYMBOLS.      */ 05550000
* /*                                                                 */ 05600000
* /*     PLS - %RMCTLEVL='USERLEVL' IF THE RMCT MAPPING IS TO BE     */ 05650000
* /*           CONCATENATED WITH A PREVIOUS DECLARATION, WITH THE    */ 05700000
* /*           RMCT BEING ASSIGNED THE INDICATED STRUCTURE LEVEL.    */ 05750000
* /*         - %RMCT9999=',' IF THE STRUCTURE SHOULD NOT BE CLOSED.  */ 05800000
* /*                                                                 */ 05850000
* /*           NOTE - INASMUCH AS THE RMCT TABLE APPEARS AT THE      */ 05900000
* /*           VERY BEGINNING OF THE -IRARMCNS- MODULE, ONLY A       */ 05950000
* /*           STRUCTURE LEVEL OF '1' (ONE) SHOULD BE USED FOR       */ 06000000
* /*           THE RMCT.                                             */ 06050000
* /*                                                                 */ 06100000
* /*         TO ACCESS THE RMCT AS A DECLARED STRUCTURE,             */ 06150000
* /*         DCL RMCTPTR PTR.                                        */ 06200000
* /*                                                                 */ 06250000
* /*   CHANGE ACTIVITY = @ZM43085,@G741PGS,@G743PGS,@G743PSS,        */ 06300000
* /*                     @ZM49684,@G860PJC,@G860P26,@ZA67352,        */ 06350000
* /*                     @ZA75498,@ZA78879,@ZA80427                  */ 06400000
* /*                                                                 */ 06450000
* /*   OY08710 -- Add VCON for the TCB/SRB Timer SPE 871008  @YA08710*/ 06500000
* /*  OY08835 -- 11/23/87 - SUPPORT FOR VIO TO EXPANDED STORAGE      */ 06550000
* /*                                                         @YA08835*/ 06600000
* /*  OY66862 -- 07/25/94 - macro logic added in order to avoid      */ 06650000
* /*                        acon undefined symbols for DSECT=YES     */ 06700000
* /*                                                         @YA66862*/ 06750000
* /*                                                                 */ 06800000
* /* $H2=ADVPROC2 JBB2133 821202 PD3419: AXP                         */ 06850000
* /* $H4=ES       JBB2133 830201 PDF6  : EXTENDED STORE              */ 06900000
* /* $L4=SRMTQE   JBB2110 820721 PD26  : PROTECT SRM TQE  SP2.1.1    */ 06950000
* /* $H5=ES       JBB2133 830525 PD26  : EXTENDED STORAGE            */ 07000000
* /* $L1=TRQ      JBB2217 850314 PD16R1: TRUE READY QUEUE            */ 07050000
* /* $P1=PCI0003  JBB2217 850517 PD16R1: Remove RMCTFL1R             */ 07100000
* /* $LS=SRMSTKS  JBB2220 840627 PDF6  : SRM STACKS                  */ 07150000
* /* $LX=SRMICS   JBB2220 840822 PDF6  : ICS MASKING OF NAMES        */ 07200000
* /* $DA=DCR0044  HBB3310 870123 PD88AA: Constraint Relief Item -    */ 07250000
* /*                                     Swap Analysis Support       */ 07300000
* /* $L5=WSMGT    HBB4420 900716 PD88BH: Support for Working Set     */ 07350000
* /*                                     Management              @L5A*/ 07400000
* /* $DB=DH30154  HBB4420 901022 PD88BP: Support use of CPU related  */ 07450000
* /*                                     stacks for all entries to   */ 07500000
* /*                                     SRM - make RMCTRMSA         */ 07550000
* /*                                     reserved.               @DBA*/ 07600000
* /* $L6=WLMI     HBB5510 921231 PD004U: Workload Manager I          */ 07650000
* /* $P2=PNT1263  HBB5510 940202 PD88IK: OW01261 - Showhdr fix   @P2A*/ 07700000
* /* $L7=ENCLV    HBB5520 940210 PD88AK: Add reserved space      @L7A*/ 07750000
* /* $L8=ARM      HBB5520 940310 PD00V1: Add RSD List anchor     @L8A*/ 07800000
* /* $L9=ENCLV    HBB5520 940415 PD00DD: Add SRRU anchor         @L9A*/ 07850000
* /* $P3=PN70460  HBB5520 940418 PD00DD: Define SRNG bit as EQU  @P3A*/ 07900000
* /* $DC=DN70069  HBB5520 940701 PD00CF: VTAM Generic Resource   @DCA*/ 07950000
* /*                                                                    08000000
*    $WLMPTSO     HBB6603 950501 PD88RK: WLMTSO - Rich Ko               08050000
*                                        Add RmctSwmb, RmctRcts,        08100000
*                                        and RmctIpat        @WLMPTSO   08150000
*                                                                       08200000
*    $WLMPENH     HBB6603 950504 PD88WB: WLMENH - William Byrne         08250000
*                                        Enhancements - ENF 55 signal   08300000
*                                        for storage shortages          08350000
*                                                            @WLMPENH   08400000
*                                                                       08450000
*    $WLMPESM     HBB6603 950512 PD88BB: John Arwe                      08500000
*                                        Change RMSB initialization     08550000
*                                        from a(rmsb) to v(irarmsbs),   08600000
*                                        add RMCTX1, define RMCT15f     08650000
*                                                            @WLMPESM   08700000
*                                                                       08750000
*    $PQC0950     HBB6603 960327 PD88GD: Greg Dritschler                08800000
*                                        Define RMCTSQMR     @PQC0950   08850000
*                                                                       08900000
*    $WLMPLPM     HBB7703 991122 PDCO:   Hiren Shah                     08950000
*                                        Create RMCT Extention 2        09000000
*    COMPONENT = SC1CX (SYSTEM RESOURCE MANAGER )                       09050000
*                                                                       09100000
******************************************************************** */ 09150000
* /*                                                                    09200000
.RMCTAL1 ANOP                                                           09250000
         SPACE 1                                                        09300000
         AIF   ('&DSECT' EQ 'NO').RMCTAL2                               09350000
RMCT     DSECT                                                          09400000
         AGO   .RMCTAL3                                                 09450000
.RMCTAL2 ANOP                                                           09500000
         DS    0D                                                       09550000
RMCT     EQU   *                                                        09600000
.RMCTAL3 ANOP                                                           09650000
         SPACE 1                                                        09700000
RMCTNAME DC    C'RMCT' -           BLOCK IDENTIFICATION                 09750000
         AIF   ('&DSECT' EQ 'YES').RMCTAL4             @YA66862         09800000
RMCTCCT  DC    A(CCT) -            CPU MANAGEMENT CONTROL TABLE         09850000
RMCTICT  DC    A(ICT) -            I/O MANAGEMENT CONTROL TABLE         09900000
RMCTMCT  DC    A(MCT) -            STORAGE MANAGEMENT CONTROL TABLE     09950000
RMCTRMPT DC    A(RMPT) -           CTL ALGORITHM PARAMETER TABLE        10000000
RMCTRMCA DC    A(RMCA) -           CTL ALGORITHM CONTROL AREA           10050000
         AGO   .RMCTAL5                                @YA66862         10100000
.RMCTAL4 ANOP                                          @YA66862         10150000
RMCTCCT  DC    A(0)   -            CPU MANAGEMENT CONTROL TABLE         10200000
RMCTICT  DC    A(0)   -            I/O MANAGEMENT CONTROL TABLE         10250000
RMCTMCT  DC    A(0)   -            STORAGE MANAGEMENT CONTROL TABLE     10300000
RMCTRMPT DC    A(0)    -           CTL ALGORITHM PARAMETER TABLE        10350000
RMCTRMCA DC    A(0)    -           CTL ALGORITHM CONTROL AREA           10400000
.RMCTAL5 ANOP                                          @YA66862         10450000
RMCTWMST DC    A(0) -              ADDR OF WLM SPECIFICATION TABLE      10500000
RMCTSRBC DC    V(IRARSRBT) -       TCB/SRB CODE IN INT         @YA08710 10550000
RMCTWMCT DC    A(0) -              WLM mode control table          @L6C 10600000
RMCTRMPD DC    A(0) -              ADDR OF RESOURCES MANAGER PERF DATA  10650000
         AIF   ('&DSECT' EQ 'YES').RMCTAL6             @YA66862         10700000
RMCTRMEX DC    A(RMEX) -           ROUTINE EXITING VECTOR TABLE         10750000
RMCTRMSB DC    V(IRARMSBS)     SUBROUTINE CALLING VECTOR TABLE @WLMPESM 10800000
RMCTEPPA DC    A(IRAEPPA) -        PRTL ANALYSIS ENTRY TABLE            10850000
RMCTEPDT DC    A(EPDTSCN) -        USER ACTION ENTRY TABLE              10900000
RMCTEPAT DC    A(EPATSCN) -        ALGORITHM ENTRY TABLE                10950000
RMCTLSCT DC    A(LSCT) -           LOGICAL SWAP CONTROL TABLE  @G50IPJH 11000000
         AGO   .RMCTAL7                                @YA66862         11050000
.RMCTAL6 ANOP                                          @YA66862         11100000
RMCTRMEX DC    A(0)    -           ROUTINE EXITING VECTOR TABLE         11150000
RMCTRMSB DC    A(0)    -           SUBROUTINE CALLING VECTOR TABLE      11200000
RMCTEPPA DC    A(0)       -        PRTL ANALYSIS ENTRY TABLE            11250000
RMCTEPDT DC    A(0)       -        USER ACTION ENTRY TABLE              11300000
RMCTEPAT DC    A(0)       -        ALGORITHM ENTRY TABLE                11350000
RMCTLSCT DC    A(0)    -           LOGICAL SWAP CONTROL TABLE  @G50IPJH 11400000
.RMCTAL7 ANOP                                          @YA66862         11450000
RMCTADJC DC    F'0' -              ADJUSTMENT FACTOR FOR CPU RATE       11500000
RMCTITT  DC    V(IRASECHT) -       INTFC EVENT CHARACTERISTICS TABLE    11550000
RMCTEPET DC    V(IRAPRCSR) -       EVENT ROUTING VECTOR TABLE           11600000
RMCTLTT  DC    A(0)                lock trace table address        @L6C 11650000
         AIF   ('&DSECT' EQ 'YES').RMCTAL8             @YA66862         11700000
RMCTEPPR DC    A(IRAEPPR) -        PROCESS RATE DEPENDENT ENTRY TABLE   11750000
         AGO   .RMCTAL9                                @YA66862         11800000
.RMCTAL8 ANOP                                          @YA66862         11850000
RMCTEPPR DC    A(0)       -        PROCESS RATE DEPENDENT ENTRY TABLE   11900000
.RMCTAL9 ANOP                                          @YA66862         11950000
RMCTWAST DC    A(0) -              ADDR OF WMST FOR SET IPS    @G741PGM 12000000
RMCT15F  DC    V(IRARMI10)         Address of 15F abend        @WLMPESM 12050000
         AIF   ('&DSECT' EQ 'YES').RMCTALA             @YA66862         12100000
RMCTTMQE DC    A(IRACTMQE) -       SCHEDULED RTNE QUEUE HEADER ADDR     12150000
         AGO   .RMCTALB                                @YA66862         12200000
.RMCTALA ANOP                                          @YA66862         12250000
RMCTTMQE DC    A(0)        -       SCHEDULED RTNE QUEUE HEADER ADDR     12300000
.RMCTALB ANOP                                          @YA66862         12350000
RMCTAQCT DC    F'0' -              ACTION QUEUE MEMBER COUNT            12400000
         AIF   ('&DSECT' EQ 'YES').RMCTALC             @YA66862         12450000
RMCTAQHD DC    A(IRAOUCB) -        ACTION QUEUE FORWARD POINTER         12500000
RMCTWTQE DC    A(IRAWTQE) -        WAIT - QUEUE HEADER BLOCK ADDRESS    12550000
RMCTLSQE DC    A(IRALSQE) -        LOG SWAP WAIT QUEUE HEADER ADDR @H5A 12600000
RMCTOTQE DC    A(IRAOTQE) -        OUT - QUEUE HEADER BLOCK ADDRESS     12650000
RMCTINQE DC    A(IRAINQE) -        IN - QUEUE HEADER BLOCK ADDRESS      12700000
         AGO   .RMCTALD                                @YA66862         12750000
.RMCTALC ANOP                                          @YA66862         12800000
RMCTAQHD DC    A(0)       -        ACTION QUEUE FORWARD POINTER         12850000
RMCTWTQE DC    A(0)       -        WAIT - QUEUE HEADER BLOCK ADDRESS    12900000
RMCTLSQE DC    A(0)       -        LOG SWAP WAIT QUEUE HEADER ADDR @H5A 12950000
RMCTOTQE DC    A(0)       -        OUT - QUEUE HEADER BLOCK ADDRESS     13000000
RMCTINQE DC    A(0)       -        IN - QUEUE HEADER BLOCK ADDRESS      13050000
.RMCTALD ANOP                                          @YA66862         13100000
RMCTTBS  DC    F'0' -              STARTING TIME BASE FOR TIME OF DAY   13150000
RMCTTOD  DC    F'0' -              TIME OF DAY - SYST RSRC MGR INVOKE   13200000
RMCTTOC  DC    D'0' -              TIME OF CENTURY - 64BIT BINARY NMB   13250000
RMCTALA  DC    4B'00000000' -      ALGORITHM REQUEST ACCUMULATOR FIELD  13300000
RMCTALR  DC    4B'00000000' -      IMMEDIATE ALGORITHM REQUEST FIELD    13350000
         AIF   ('&DSECT' EQ 'YES').RMCTALE             @YA66862         13400000
RMCTRQSV DC    A(RQSV) -           ADDR OF REQ SRV DATA AREA   @Z40BPCH 13450000
         AGO   .RMCTALF                                @YA66862         13500000
.RMCTALE ANOP                                          @YA66862         13550000
RMCTRQSV DC    A(0)    -           ADDR OF REQ SRV DATA AREA   @Z40BPCH 13600000
.RMCTALF ANOP                                          @YA66862         13650000
RMCTFLGS DC    1B'00000000' -      PROCESSING CONTROL FLAGS             13700000
RMCTMFA  EQU   BIT0 -              MEASUREMENT FACILITY ACTIVE          13750000
RMCTCPS1 EQU   BIT1                CAP SWITCH                  @Z40BPSS 13800000
RMCTICS  EQU   BIT2                CONTROL MEMBER DEFINED      @G742PJC 13850000
RMCTINIT EQU   BIT3 -              SRM INITIALIZATION WAS PERFORMED     13900000
RMCTREPT EQU   BIT4 -              NON-TSO REPORTING ACTIVE   @G741PJC  13950000
RMCTSTW  EQU   BIT5 -              SET HAS STOPPED WAR COLLECTION       14000000
RMCTTSAC EQU   BIT6 -              TIME SLICE ALG ACTIVE      @G50IPSS  14050000
RMCTWLM  EQU   BIT7 -              WLM mode active                @L6A  14100000
         DC    1B'00000000' -      OVERRIDE CONDITION FLAGS             14150000
RMCTREP1 EQU   BIT0 -              Reactivation of the in storage       14200000
*                                  policy in progress, first pass @L6A  14250000
RMCTMFS  EQU   BIT1 -              RMF ACTIVE,SET  RCVD       @G742PGM  14300000
RMCTCNSW EQU   BIT2 -            COUNT NON-SWAPPABLES IN CMPL @G742PGM  14350000
RMCTCLST EQU   BIT3 -           COUNT EACH COMMAND IN A CLIST @G743PGM  14400000
RMCTRTSO EQU   BIT4 -           TSO TRXNAME REPORTING ACTIVE  @G744PGS  14450000
RMCTDMTI EQU   BIT5 -              Set to reinitialize the domain       14500000
*                                  table in Swap Analysis (CAP)   @DAA  14550000
RMCTOKCP EQU   BIT6 -              This bit is set so that next time    14600000
*                                  Sysevent 24 is issued, CAP will      14650000
*                                  be scheduled.                  @DAA  14700000
RMCTREP2 EQU   BIT7 -              Reactivation of the in storage       14750000
*                                  policy in progress, 2nd pass   @L6A  14800000
RMCTTAPE DC    1B'00000000' (OPT PARM) TAPE SELECTION:        @G741PGS  14850000
RMCTSLTN EQU   BIT0 -              NEXT HIGHEST               @G741PGS  14900000
RMCTSLTR EQU   BIT1 -              RANDOM                     @G741PGS  14950000
RMCTSLTL EQU   BIT2 -              LOWEST ADDRESS             @G741PGS  15000000
RMCTSLTF EQU   BIT3 -              FIRST DEVICE IN LIST       @G741PGS  15050000
RMCTFLG2 DC    1B'00000000' -      PROCESSING FLAGS           @G744PJC  15100000
RMCTOVFL EQU   BIT1 -              OVERFLOW OCCURED           @ZA45676  15150000
RMCTUNTR EQU   BIT2 -              Real time period durations are       15200000
*                                  in effect.                     @DAA  15250000
RMCTSRNG EQU   BIT3 -              Send empty SRRU to systems     @P3C  15300000
RMCTSQMR EQU   BIT4 -              Schedule queue manager               15350000
*                                  recovery                    @PQC0950 15400000
RMCTTELM DC    V(IEATSELM) -       RESOURCES MANAGER TIMING ELEMENT     15450000
RMCTCPID DC    F'0' -              RES MANAGER CELL POOL ID    @G860PJC 15500000
RMCTTOCI DC    D'0' -              CLOCK READ AREA - 64BIT BINARY NMB   15550000
         AIF   ('&DSECT' EQ 'YES').RMCTALG             @YA66862         15600000
RMCTOUCB DC    A(IRAOUCB) -        PREASSEMBLED MODEL OUCB              15650000
RMCTOUXB DC    A(IRAOUXB) -        INTERPOSED DUMMY OUXB                15700000
RMCTSRBT DC    A(IRASRBT) -        RESOURCES MANAGER SRB TABLE          15750000
         AGO   .RMCTALH                                @YA66862         15800000
.RMCTALG ANOP                                          @YA66862         15850000
RMCTOUCB DC    A(0)       -        PREASSEMBLED MODEL OUCB              15900000
RMCTOUXB DC    A(0)       -        INTERPOSED DUMMY OUXB                15950000
RMCTSRBT DC    A(0)       -        RESOURCES MANAGER SRB TABLE          16000000
.RMCTALH ANOP                                          @YA66862         16050000
RMCTDMDT DC    A(0) -              ADDR OF DOMAIN TABLE        @Z40BPCH 16100000
RMCTDMDE DC    A(0) -              ADDR OF LAST DMN TAB ENTRY  @Z40BPCH 16150000
RMCTDMNC DC    H'0' -              NUMBER OF DOMAINS           @Z40BPCH 16200000
RMCTRSV2 DS    H                   Reserved                    @L6C     16250000
RMCTTSPT DC    A(0) -              FIRST TS PATTERN ENTRY      @G50IPSS 16300000
RMCTTSPE DC    A(0) -              LAST TS PATTERN ENTRY       @G50IPSS 16350000
RMCTTSGT DC    A(0) -              FIRST TSGRP TABLE ENTRY     @G50IPSS 16400000
RMCTTSGE DC    A(0) -              LAST TSGRP TABLE ENTRY      @G50IPSS 16450000
RMCTCPU  DC    F'0' -              CPU service coefficient         @L6C 16500000
RMCTMSO  DC    F'0' -              MSO service coefficient         @L6C 16550000
RMCTIOC  DC    F'0' -              IOC service coefficient         @L6C 16600000
RMCTICST DC    A(0) -              ICSC TABLE ADDR             @G742PSS 16650000
RMCTCPMP DC    F'0' -              CPU ADJUSTING FACTOR - IF THIS       16700000
*                                  PROCESSOR MODEL HAS RELATED CPUS,    16750000
*                                  THIS ADJUSTMENT FACTOR IS FOR THE    16800000
*                                  FASTER CPU                      @H2C 16850000
         AIF   ('&DSECT' EQ 'YES').RMCTALI             @YA66862         16900000
RMCTRCT  DC    A(RCT) -            ADDRESS OF RCT              @G742PGM 16950000
         AGO   .RMCTALJ                                @YA66862         17000000
.RMCTALI ANOP                                          @YA66862         17050000
RMCTRCT  DC    A(0)   -            ADDRESS OF RCT              @G742PGM 17100000
.RMCTALJ ANOP                                          @YA66862         17150000
RMCTBRQE DC    D'0' -              BASIC REPORTING QUEUE       @G742PJC 17200000
RMCTBRQH EQU   RMCTBRQE+0          HEADER                      @G742PJC 17250000
RMCTBRQC EQU   RMCTBRQE+4          USE COUNT                   @G742PJC 17300000
RMCTERQE DC    D'0' -              EXTENDED REPORTING QUEUE    @G742PJC 17350000
RMCTERQH EQU   RMCTERQE+0          HEADER                      @G742PJC 17400000
RMCTERQC EQU   RMCTERQE+4          USE COUNT                   @G742PJC 17450000
RMCTUPDQ DC    D'0' -              UPDATE QUEUE                @G742PJC 17500000
RMCTUPQH EQU   RMCTUPDQ+0          HEADER                      @G742PJC 17550000
RMCTUPQC EQU   RMCTUPDQ+4          USE COUNT                   @G742PJC 17600000
RMCTTRAD DC    A(0) -              XACN RPTING Q 1ST PAGE PTR  @G742PJC 17650000
RMCTTRPC DC    F'0' -              XACN RPTING PAGE COUNT      @G742PJC 17700000
         AIF   ('&DSECT' EQ 'YES').RMCTALK             @YA66862         17750000
RMCTICSP DC    A(ICSP) -           XACN DESCRIPTION TABLE      @G743PSS 17800000
RMCTRSPL DC    A(RSPL) -           RSPL ADDRESS                @G743PSS 17850000
         AGO   .RMCTALL                                @YA66862         17900000
.RMCTALK ANOP                                          @YA66862         17950000
RMCTICSP DC    A(0)    -           XACN DESCRIPTION TABLE      @G743PSS 18000000
RMCTRSPL DC    A(0)    -           RSPL ADDRESS                @G743PSS 18050000
.RMCTALL ANOP                                          @YA66862         18100000
RMCTCSB  DC    1B'00000000' -      RMCT COMPARE/SWAP BIT       @ZA70182 18150000
RMCTUTQE EQU   BIT0    -           SRM TQE IS PAST DUE         @ZA70182 18200000
RMCTSIMT EQU   BIT1 -              PASSAGE OF TIME HAS BEEN SIMULATED   18250000
*                                  DUE TO TOD CLOCK FAILURE        @H5C 18300000
RMCTNOBQ EQU   BIT2 -              NO BASIC RPTING Q ELEMNTS       @H5C 18350000
RMCTNOEQ EQU   BIT3 -              NO EXTND RPTING Q ELEMNTS       @H5C 18400000
RMCTTPP  EQU   BIT4 -              SRM TIMER POP PENDING       @ZA78879 18450000
RMCTSTGF EQU   BIT5 -              VIO journaling dataset failure       18500000
*                                                              @YA08835 18550000
RMCTWSMF EQU   BIT6 -              Write SMF 99 records            @L6A 18600000
RMCTSSMF EQU   BIT7 -              SRB to write SMF99 records has       18650000
*                                  been scheduled                  @L6A 18700000
RMCTRSVB DC    1B'00000000' -      RESERVED                    @ZA70182 18750000
RMCTSHDL DC    H'16'   -           LENGTH OF SRM STACK HEADER (MUST     18800000
*                                  BE A MULTIPLE OF 8 TO INSURE A DWORD 18850000
*                                  BDY FOR EACH STACK FRAME)       @L5C 18900000
RMCTPTCH DC    V(IRARMPAT) -       PATCH AREA ADRESS           @G81OPJC 18950000
         AIF   ('&DSECT' EQ 'YES').RMCTALM             @YA66862         19000000
RMCTCMCT DC    A(CMCT)             CHANNEL MEAS CNTL TABLE     @G860P26 19050000
RMCTESCT DC    A(ESCT)             EXT STORE CRITERIA TABLE        @H4C 19100000
RMCTEPBG DC    A(EPAT) -           EPAT BEGINNING             @G50IPSS  19150000
         AGO   .RMCTALN                                @YA66862         19200000
.RMCTALM ANOP                                          @YA66862         19250000
RMCTCMCT DC    A(0)                CHANNEL MEAS CNTL TABLE     @G860P26 19300000
RMCTESCT DC    A(0)                EXT STORE CRITERIA TABLE        @H4C 19350000
RMCTEPBG DC    A(0)    -           EPAT BEGINNING             @G50IPSS  19400000
.RMCTALN ANOP                                          @YA66862         19450000
RMCTHDID DC    CL4'SRM '           SRM STACK HEADER ID             @LSC 19500000
RMCTPAGP DC    A(0) -              SYSTEM PAGING BLOCK POINTER     @L5A 19550000
RMCTELET DC    F'2000'             Executed long enough threshold for   19600000
*                                  determing if an address space has    19650000
*                                  executed long enough to be analyzed  19700000
*                                  for monitoring.  Value is 2 SRM      19750000
*                                  seconds                         @L5A 19800000
RMCTSRB  DC    F'0' -              SRB service coefficient         @L6A 19850000
RMCTITER DC    F'28'               iteration number                @L6A 19900000
RMCTSMC  DC    F'0'                sample monitoring control block      19950000
*                                  pointer                         @L6A 20000000
RMCTDFQF DC    F'0'                address of first oucb on deferred    20050000
*                                  freemain queue                  @L6A 20100000
RMCTDFQL DC    F'0'                address of last oucb on deferred     20150000
*                                  freemain queue                  @L6A 20200000
RMCTSMFB DC    F'0'                Pointer to SMF99 Buffer         @L6A 20250000
         AIF   ('&DSECT' EQ 'YES').RMCTALO             @YA66862         20300000
RMCTEPDB DC    A(EPDT)             First RMEP on EPDT              @L6C 20350000
         AGO   .RMCTALP                                @YA66862         20400000
.RMCTALO ANOP                                          @YA66862         20450000
RMCTEPDB DC    A(0)                First RMEP on EPDT              @L6C 20500000
.RMCTALP ANOP                                          @YA66862         20550000
RMCTSMFS DC    F'0'                Address of last SMF99 SRB       @L6A 20600000
RMCTRSDA DC    F'0'                Address of RSD List             @L8A 20650000
RMCTENCH DC    F'0'                System Encb Queue header        @L7A 20700000
RMCTENCL DC    F'0'                System Encb Queue trailer       @L7A 20750000
RMCTSRRU DC    F'0'                Address of Sysplex Router Registered 20800000
*                                  User block                      @L9A 20850000
RMCTDSFC DC    F'0'                Number of times sending sysplex      20900000
*                                  data failed on this system. Moved    20950000
*                                  from WMCT_DM_SEND_FAILED_CNT         21000000
*                                  so it can be referenced in compat    21050000
*                                  mode                            @L9A 21100000
RMCTGRSS DC    F'0'                Address of Generic Resource Selected 21150000
*                                  Systems                         @DCA 21200000
RMCTLE55 DC    F'0' -              Last saved for ENF 55       @WLMPENH 21250000
RMCTSWMB DC    F'0'                Address of Subsystem Work            21300000
*                                  Measurement Block           @WLMPTSO 21350000
RMCTRCTS DC    F'0'                Timestamp (time of day in 1.048576   21400000
*                                  second units, the leftmost 32 bits   21450000
*                                  of the clock) of when                21500000
*                                  resource constraints were last       21550000
*                                  detected - may be 0 if no such       21600000
*                                  problem has been seen       @WLMPTSO 21650000
RMCTIPAT DC    F'0'                Internal policy activation           21700000
*                                  timestamp (time of day in 1.048576   21750000
*                                  second units, the leftmost 32 bits   21800000
*                                  of the clock). This                  21850000
*                                  timestamp is set to when             21900000
*                                  reactivation of the in storage       21950000
*                                  policy was initiated (by IRARMER3)   22000000
*                                  + 1 minute elapse time to account    22050000
*                                  for policy activation delays and     22100000
*                                  to allow the system to re-           22150000
*                                  accumulate meaningful statistics.    22200000
*                                  It denotes when it is ok to          22250000
*                                  enable this system for TSO           22300000
*                                  generic resource selection. A        22350000
*                                  value of 0 indicates either there    22400000
*                                  is no rebuild policy action or       22450000
*                                  the elapse time has expired          22500000
*                                                              @WLMPTSO 22550000
*  When defining any NEW doubleword fields, MAKE SURE that you define   22600000
*  the new fields on doubleword boundaries so the assembler does not    22650000
*  helpfully skip bytes to properly align the data.                     22700000
*                                                              @WLMPENH 22750000
RMCTR01  DC   1F'0' -              Reserved                    @WLMPTSO 22800000
RMCTX2   DC    F'0'                Address of RMCT Extention 2          22850000
*                                  Mapped by IRARMCTY          @WLMPLPM 22900000
         DS    0D                                              @WLMPESM 22950000
RMCTX1   DC  90F'0' -              Mapped by IRARMCTX          @WLMPESM 23000000
RMCTEND  DS    0D -                END OF RMCT                          23050000
RMCTLEN  EQU   RMCTEND-RMCT -      LENGTH OF RMCT                       23100000
         MEND                                                           23150000
*                                                                    */ 23200000
*%RMCTPLS2:  ;                                                          23250000
*        %IF RMCTLEVL ^= ''         /* IS STRUCTURE CONCATENATED     */ 23300000
*            %THEN %GOTO RMCTPLS3;  /* YES, OMIT DECLARE STATEMENT   */ 23350000
*   DCL                                                                 23400000
*     1 RMCT BASED(RMCTPTR) BDY(DWORD),                                 23450000
*            %GOTO RMCTPLS4;        /* SKIP USER-GIVEN LEVEL         */ 23500000
*%RMCTPLS3:  RMCTDUM = RMCTLEVL||' RMCT';  /* PICK UP GIVEN LEVEL    */ 23550000
*     RMCTDUM BDY(DWORD),                                               23600000
*%RMCTPLS4:  ;                                                          23650000
*       10 RMCTNAME CHAR(4),        /* BLOCK IDENTIFICATION - 'RMCT' */ 23700000
*       10 RMCTCCT  PTR(31),        /* CPU MGMT CONTROL TABLE        */ 23750000
*       10 RMCTICT  PTR(31),        /* I/O MGMT CONTROL TABLE        */ 23800000
*       10 RMCTMCT  PTR(31),        /* STORAGE MGMT CONTROL TABLE    */ 23850000
*       10 RMCTRMPT PTR(31),        /* CTL ALGORITHM PARAMETER TBL   */ 23900000
*       10 RMCTRMCA PTR(31),        /* CTL ALGORITHM CONTROL AREA    */ 23950000
*       10 RMCTWMST PTR(31),        /* WLM SPECIFICATION TABLE       */ 24000000
*       10 RMCTSRBC PTR(31),        /* TCB/SRB CODE IN INT   @YA08710*/ 24050000
*       10 RMCTWMCT PTR(31),        /* WLM mode control table    @L6C*/ 24100000
*       10 RMCTRMPD PTR(31),        /* RESOURCES MANAGER PERF DATA   */ 24150000
*       10 RMCTRMEX PTR(31),        /* ROUTINE EXITING VECTOR TABLE  */ 24200000
*       10 RMCTRMSB PTR(31),        /* SUBRTNE CALLING VECTOR TABLE  */ 24250000
*       10 RMCTEPPA PTR(31),        /* PRTL ANALYSIS ENTRY TABLE     */ 24300000
*       10 RMCTEPDT PTR(31),        /* USER ACTION ENTRY TABLE       */ 24350000
*       10 RMCTEPAT PTR(31),        /* ALGORITHM ENTRY TABLE         */ 24400000
*       10 RMCTLSCT PTR(31),        /* LOGICAL SWAP TABLE    @G50IPJH*/ 24450000
*       10 RMCTADJC FIXED,          /* CPU RATE ADJUSTMENT           */ 24500000
*       10 RMCTITT  PTR(31),        /* EVENT CHARACTERISTICS TABLE   */ 24550000
*       10 RMCTEPET PTR(31),        /* EVENT ROUTING VECTOR TABLE    */ 24600000
*       10 RMCTLTT  PTR(31),        /* lock trace table address  @L6C*/ 24650000
*       10 RMCTEPPR PTR(31),        /* PROCESS RATE DEPENDENT TABLE  */ 24700000
*       10 RMCTWAST PTR(31),        /* WMST FOR SET IPS      @G741PGM*/ 24750000
*       10 RMCT15F  PTR(31),        /* Abend 15F routine     @WLMPESM*/ 24800000
*       10 RMCTTMQE PTR(31),        /* SCHED RTNE QUEUE HEAD ADDR    */ 24850000
*       10 RMCTAQCT FIXED BDY(DWORD), /* ACTION QUEUE MEMBER COUNT   */ 24900000
*       10 RMCTAQHD PTR(31),        /* ACTION QUEUE FORWARD POINTER  */ 24950000
*       10 RMCTWTQE PTR(31),        /* WAIT - QUEUE HEADER ADDRESS   */ 25000000
*       10 RMCTLSQE PTR(31),        /* LOG SWAP WAIT QUEUE HDR   @H5A*/ 25050000
*       10 RMCTOTQE PTR(31),        /* OUT - QUEUE HEADER ADDRESS    */ 25100000
*       10 RMCTINQE PTR(31),        /* IN - QUEUE HEADER ADDRESS     */ 25150000
*       10 RMCTTBS  FIXED(32) UNSIGNED, /* SRM TIME OF DAY BASE      */ 25200000
*       10 RMCTTOD  FIXED(32) UNSIGNED, /* CURRENT TIME OF DAY       */ 25250000
*       10 RMCTTOC  BIT(64) BDY(DWORD), /* CURR TIME OF CENTURY      */ 25300000
*       10 RMCTALA  BIT(32) BDY(WORD), /* ALG REQUEST ACCUMULATOR       25350000
*                                        See comment in IRAEPNMP @L6C*/ 25400000
*       10 RMCTALR  BIT(32) BDY(WORD), /* IMMED ALG REQUEST ACCUMUL     25450000
*                                        See comment in IRAEPNMP @L6C*/ 25500000
*       10 RMCTRQSV PTR(31),        /* REQ SERVICE WORK AREA @Z40BPCH*/ 25550000
*       10 RMCTFLGS BIT(32) BDY(WORD), /* FLAGS                      */ 25600000
*       12 RMCTFLG1 BIT(16),        /* PROCESSING CONTROL    @G741PGS*/ 25650000
*         14 RMCTMFA  BIT(1),       /* MEASUREMENT FACILITY ACTIVE      25700000
*                                                                    */ 25750000
*         14 RMCTCPS1 BIT(1),       /* CAP SWITCH                    */ 25800000
*         14 RMCTICS  BIT(1),     /* CONTROL MEMBER DEFINED  @G744PJC*/ 25850000
*         14 RMCTINIT BIT(1),       /* SRM INITIALIZATION DONE          25900000
*                                                                    */ 25950000
*         14 RMCTREPT BIT(1),       /* NON-TSO REPORTING ACTIVE         26000000
*                                                            @G743PGS*/ 26050000
*         14 RMCTSTW  BIT(1),       /* SET STOPPED WAR COLLECTION       26100000
*                                                                    */ 26150000
*         14 RMCTTSAC BIT(1),       /* TIME SLICE ALG ACTIVE         */ 26200000
*         14 RMCTWLM BIT(1),        /* WLM mode active           @L6C*/ 26250000
*         14 RMCTREP1 BIT(1),       /* Reactivation of the in storage   26300000
*                                      policy in progress, timeout      26350000
*                                      interval 1 pending.       @L6A*/ 26400000
*         14 RMCTMFS  BIT(1),       /* RMF ACT.,SET  RCVD    @G742PGM*/ 26450000
*         14 RMCTCNSW BIT(1),  /* COUNT NON-SWAPPABLE USERS IN CMPL     26500000
*                                                            @G741PGM*/ 26550000
*         14 RMCTCLST BIT(1),       /* COUNT EACH COMMAND IN            26600000
*                                      A CLIST               @G743PGM*/ 26650000
*         14 RMCTRTSO BIT(1),       /* TSO TRXNAME REPORTING ACTIVE     26700000
*                                                            @G744PGS*/ 26750000
*         14 RMCTDMTI BIT(1),       /* Set to reinitialize the domain   26800000
*                                      table in Swap Analysis    @DAA*/ 26850000
*         14 RMCTOKCP BIT(1),       /* This bit is set so that next     26900000
*                                      Sysevent 24 is issued, CAP will  26950000
*                                      be scheduled.             @DAA*/ 27000000
*         14 RMCTREP2 BIT(1),       /* Reactivation of the in storage   27050000
*                                      policy in progress, timeout      27100000
*                                      interval 2 pending.       @L6A*/ 27150000
*       12 RMCTTAPE BIT(8),         /* TAPE SELECTION:       @G741PGS*/ 27200000
*         14 RMCTSLTN BIT(1),       /* NEXT HIGHEST          @G741PGS*/ 27250000
*         14 RMCTSLTR BIT(1),       /* RANDOM                @G741PGS*/ 27300000
*         14 RMCTSLTL BIT(1),       /* LOWEST ADDRESS        @G741PGS*/ 27350000
*         14 RMCTSLTF BIT(1),       /* FIRST DEVICE IN LIST  @G741PGS*/ 27400000
*         14 RMCTF10  BIT(4),       /* RESERVED              @G741PGS*/ 27450000
*       12 RMCTFLG2 BIT(8),         /* PROCESSING FLAGS      @G744PGS*/ 27500000
*         14 RMCTF12  BIT(1),       /* RESERVED                  @LXC*/ 27550000
*         14 RMCTOVFL BIT(1),       /* OVERFLOW OCCURRED     @ZA45676*/ 27600000
*         14 RMCTUNTR BIT(1),       /* Real time period durations       27650000
*                                      are in effect             @DAA*/ 27700000
*         14 RMCTSRNG BIT(1),       /* Send empty SRRU to systems       27750000
*                                                                @L9A*/ 27800000
*         14 RMCTSQMR BIT(1),       /* Schedule queue manager           27850000
*                                      recovery              @PQC0950*/ 27900000
*         14 RMCTF11 BIT(3),        /* RESERVED              @PQC0950*/ 27950000
*       10 RMCTTELM PTR(31),        /* RSRC MANAGER TIMING ELEMENT   */ 28000000
*       10 RMCTCPID PTR(31),        /* SRM CELL POOL ID      @G860PJC*/ 28050000
*       10 RMCTTOCI BIT(64) BDY(DWORD), /* TOD CLOCK READ AREA       */ 28100000
*       10 RMCTOUCB PTR(31),        /* PREASSEMBLED MODEL OUCB       */ 28150000
*       10 RMCTOUXB PTR(31),        /* INTERPOSED DUMMY OUXB         */ 28200000
*       10 RMCTSRBT PTR(31),        /* PREBUILT SRB TABLE            */ 28250000
*       10 RMCTDMDT PTR(31),        /* ADDR OF DOMAIN TABLE  @Z40BPCH*/ 28300000
*       10 RMCTDMDE PTR(31),        /* ADDR OF LAST DMDT ENT @Z40BPCH*/ 28350000
*       10 RMCTDMNC FIXED(15),      /* NUMBER OF DOMAINS     @Z40BPCH*/ 28400000
*       10 RMCTRSV2 FIXED(15),      /* Reserved                  @L6C*/ 28450000
*       10 RMCTTSPT PTR(31),        /* FIRST TS PATTERN ENT  @G50IPSS*/ 28500000
*       10 RMCTTSPE PTR(31),        /* LAST TS PATTERN ENTRY @G50IPSS*/ 28550000
*       10 RMCTTSGT PTR(31),        /* FIRST TSGRP TBL ENTRY @G50IPSS*/ 28600000
*       10 RMCTTSGE PTR(31),        /* LAST TSGRP TBL ENTRY  @G50IPSS*/ 28650000
*       10 RMCTCPU FIXED(31),       /* CPU service coefficient   @L6C*/ 28700000
*       10 RMCTMSO FIXED(31),       /* MSO service coefficient   @L6C*/ 28750000
*       10 RMCTIOC FIXED(31),       /* IOC service coefficient   @L6C*/ 28800000
*       10 RMCTICST PTR(31),        /* ICSC TABLE ADDR       @G742PJC*/ 28850000
*       10 RMCTCPMP FIXED(31),      /* CPU ADJUSTING FACTOR - IF        28900000
*                                      THIS PROCESSOR MODEL HAS         28950000
*                                      RELATED CPUS, THIS ADJUSTMENT    29000000
*                                      FACTOR IS FOR THE FASTER         29050000
*                                      CPU                       @H2C*/ 29100000
*       10 RMCTRCT  PTR(31),        /* ADDRESS OF RCT        @G742PGM*/ 29150000
*       10 RMCTBRQE BDY(DWORD),  /* BASIC REPORTING AVAIL. Q @G742PJC*/ 29200000
*         14 RMCTBRQH PTR(31),      /* HEADER                @G742PJC*/ 29250000
*         14 RMCTBRQC FIXED(31),    /* USE COUNT             @G742PJC*/ 29300000
*       10 RMCTERQE BDY(DWORD), /* EXTENDED REPORTING AVAILQ @G742PJC*/ 29350000
*         14 RMCTERQH PTR(31),      /* HEADER                @G742PJC*/ 29400000
*         14 RMCTERQC FIXED(31),    /* USE COUNT             @G742PJC*/ 29450000
*       10 RMCTUPDQ BDY(DWORD),     /* REPORTING UPDATE QUE  @G742PJC*/ 29500000
*         14 RMCTUPQH PTR(31),      /* HEADER                @G742PJC*/ 29550000
*         14 RMCTUPQC FIXED(31),    /* USE COUNT             @G742PJC*/ 29600000
*       10 RMCTTRAD PTR(31),        /* XACN REPORTING QUEUE FIRST PAGE  29650000
*                                      PTR                   @G742PJC*/ 29700000
*       10 RMCTTRPC FIXED(31),      /* XACN RPTG Q PAGE CNT  @G741PEB*/ 29750000
*       10 RMCTICSP PTR(31),      /* XACN DESCRIPTION TABLE  @G743PSS*/ 29800000
*       10 RMCTRSPL PTR(31),        /* RSPL ADDRESS          @G743PSS*/ 29850000
*       10 RMCTCSB BIT(8) ABNL,     /* RMCT COMPARE/SWAP BIT @ZA70182*/ 29900000
*         12 RMCTUTQE BIT(1),       /* SRM TQE PAST DUE      @ZA70182*/ 29950000
*         12 RMCTSIMT BIT(1),     /* PASSAGE OF TIME HAS BEEN SIMULATED 30000000
*                                    DUE TO TOD CLOCK FAILUR     @H5C*/ 30050000
*         12 RMCTNOBQ BIT(1),       /* NO BASIC REPORTING Q ELEMENTS    30100000
*                                                                @H5C*/ 30150000
*         12 RMCTNOEQ BIT(1),       /* NO EXTND REPORTING Q ELEMENTS    30200000
*                                                                @H5C*/ 30250000
*         12 RMCTTPP  BIT(1),       /* SRM TIMER POP PENDING @ZA78879*/ 30300000
*         12 RMCTSTGF BIT(1),       /* VIO journaling dataset failure   30350000
*                                                            @YA08835*/ 30400000
*         12 RMCTWSMF BIT(1),       /* Write SMF99 records       @L6A*/ 30450000
*         12 RMCTSSMF BIT(1),       /* SRB to write SMF99 records       30500000
*                                      has been scheduled        @L6A*/ 30550000
*       10 RMCTRSVB BIT(8) ABNL,    /* RESERVED              @ZA70182*/ 30600000
*       10 RMCTSHDL FIXED(15),      /* LENGTH OF SRM STACK HDR (MUST    30650000
*                                      BE A MULTIPLE OF 8 TO INSURE     30700000
*                                      A DWORD BDY FOR EACH STACK       30750000
*                                      FRAME)                    @L5C*/ 30800000
*       10 RMCTPTCH PTR(31),        /* PATCH AREA ADDRESS    @G81OPJC*/ 30850000
*       10 RMCTCMCT PTR(31),      /* CHAN MEAS CONTROL TABLE @G860P26*/ 30900000
*       10 RMCTESCT PTR(31),      /* EXT STORE CRITERIA TABLE    @H4C*/ 30950000
*       10 RMCTEPBG PTR(31),           /* EPAT ADDRESS       @G50IPSS*/ 31000000
*       10 RMCTHDID CHAR(4),        /* SRM STACK HEADER ID       @LSC*/ 31050000
*       10 RMCTPAGP PTR(31),      /* SYSTEM PAGING BLOCK POINTER        31100000
*                                                                @L5A*/ 31150000
*       10 RMCTELET FIXED(32),    /* Executed long enough threshold for 31200000
*                                  determing if an address space has    31250000
*                                  executed long enough to be analyzed  31300000
*                                  for monitoring.  Value is 2 SRM      31350000
*                                  seconds                       @L5A*/ 31400000
*       10 RMCTSRB FIXED(31),     /* SRB service coefficient     @L6A*/ 31450000
*       10 RMCTITER FIXED(31),    /* iteration number            @L6A*/ 31500000
*       10 RMCTSMC PTR(31),       /* sample monitoring control block    31550000
*                                                                @L6A*/ 31600000
*       10 RMCTDFQF PTR(31),      /* address of first oucb on deferred  31650000
*                                    freemain queue              @L6A*/ 31700000
*       10 RMCTDFQL PTR(31),      /* address of last oucb on deferred   31750000
*                                    freemain queue              @L6A*/ 31800000
*       10 RMCTSMFB PTR(31),      /* Pointer to SMF99 Buffer     @L6A*/ 31850000
*       10 RMCTEPDB PTR(31),      /* First RMEP on EPDT          @L6A*/ 31900000
*       10 RMCTSMFS FIXED(31),    /* Address of last SMF99 SRB   @L6A*/ 31950000
*       10 RMCTRSDA PTR(31),      /* Address of RSD List         @L8A*/ 32000000
*       10 RMCTENCH PTR(31),      /* System Encb Queue header    @L7A*/ 32050000
*       10 RMCTENCL PTR(31),      /* System Encb Queue trailer   @L7A*/ 32100000
*       10 RMCTSRRU PTR(31),      /* Address of Sysplex Router          32150000
*                                    Registered User block       @L9A*/ 32200000
*       10 RMCTDSFC FIXED(32),    /* Number of times sending sysplex    32250000
*                                    data failed on this system. Moved  32300000
*                                    from WMCT_DM_SEND_FAILED_CNT       32350000
*                                    so it can be referenced in compat  32400000
*                                    mode                        @L9A*/ 32450000
*       10 RMCTGRSS PTR(31),      /* Address of Generic Resource        32500000
*                                    Selected Systems            @DCA*/ 32550000
*       10 RMCTLE55 FIXED(31),    /* Last TOD for ENF 55     @WLMPENH*/ 32600000
*       10 RMCTSWMB PTR(31),      /* Address of Subsystem Work          32650000
*                                    Measurement Block       @WLMPTSO*/ 32700000
*       10 RMCTRCTS BIT(32),      /* Timestamp (time of day in 1.048576 32750000
*                                    second units, the leftmost 32 bits 32800000
*                                    of the clock) of when              32850000
*                                    resource constraints were          32900000
*                                    last detected - may be 0 if        32950000
*                                    no such problem has been seen      33000000
*                                                            @WLMPTSO*/ 33050000
*       10 RMCTIPAT BIT(32),      /* Internal policy activation         33100000
*                                    timestamp (time of day in 1.048576 33150000
*                                    second units, the leftmost 32 bits 33200000
*                                    of the clock). This                33250000
*                                    timestamp is set to when           33300000
*                                    reactivation of the in storage     33350000
*                                    policy was initiated (by IRARMER3) 33400000
*                                    + 1 minute elapsed time to account 33450000
*                                    for policy activation delays and   33500000
*                                    to allow the system to re-         33550000
*                                    accumulate meaningful statistics.  33600000
*                                    It denotes when it is ok to        33650000
*                                    enable this system for TSO         33700000
*                                    generic resource selection. A      33750000
*                                    value of 0 indicates either there  33800000
*                                    is no rebuild policy action or     33850000
*                                    the elapsed time has expired       33900000
*                                                            @WLMPTSO*/ 33950000
*       10 RMCTR01(1) FIXED(31),  /* Reserved                @WLMPTSO*/ 34000000
*       10 RMCTX2 PTR(31),        /* Address of the RMCT extention 2    34050000
*                                    Mapped by IRARMCTY      @WLMPLPM*/ 34100000
*       10 RMCTX1 BDY(DWORD) CHAR(360),  /*                             34150000
*                                    Mapped by IRARMCTX      @WLMPESM*/ 34200000
*       10 RMCTEND  CHAR(0) BDY(DWORD)   /* END OF RMCT              */ 34250000
*                                                              /*@L6A*/ 34300000
* %IF RMCT9999 =',' %THEN %GOTO RMCT999C; /* Continue structure  @L6A*/ 34350000
*                ;                  /* End of this block         @L6A*/ 34400000
*     %GOTO RMCT999E ;                                         /*@L6A*/ 34450000
* %RMCT999C:;                                                 /* @L6A*/ 34500000
*                ,                  /* Continue structure        @L6A*/ 34550000
* %RMCT999E:;                       /* Endif                     @L6A*/ 34600000
*                                                              /*@L6A*/ 34650000
*/*                                                              @L6D*/ 34700000
*   %RMCTLEN = 'LENGTH(RMCT)';      /* SYMBOLIC FOR LENGTH OF RMCT   */ 34750000
