         MACRO                                                          00500003
&NAME    IREC  &MP11=,&MP12=,&MP13=,&MP14=,&MP15=,&MP16=,&MP21=,       X01100003
               &MP22=,&MP23=,&MP24=,&MP25=,&MP26=,&MP31=,&MP32=,       X01700003
               &MP33=,&MP34=,&MP35=,&MP36=,&MP41=,&MP42=,&MP43=,       X02300003
               &MP44=,&MP45=,&MP46=,&MP51=,&MP52=,&MP53=,&MP54=,       X02900003
               &FLD1=,&FLD2=,&FLD3=,&FLD4=,&FLD5=,&FLD6=,&FLD7=,       X03500003
               &FLD8=,&RPNO=,&KPNO=,&ENDRS=,&MCF=,&VSYMB=,&ITNO=,      X04100003
               &HOZ=,&OPT=,                                            X04700003
               &MP55=,&MP56=,&MP61=,&MP62=,&MP63=,&MP64=,&MP65=,&MP66=  05300003
         GBLA  &C(7),&DE(7),&L(8),&SUM                                  06500003
         GBLB  &FT(7),&D(7),&IP(7),&FRP,&FR(7),&IMP,&M                  07100003
         GBLB  &CT(36),&K(36)                                           07700003
         LCLA  &RCT,&KCT,&F1,&PP1,&PP2,&PP4,&RL,&POS,&IHOS,&MHOS        08300002
.*                                                             @YM00641 08350002
         LCLB  &CS,&RIP,&MCFS,&US,&BUG,&RJ,&RP,&MBM            @ZA04499 09200003
         LCLB  &I1,&I2,&I3,&I4                                          10100003
&IHOS    SETA  4                       ITNO DEFAULT SEGMENT LENGTH      10330002
.*                                                             @YM00641 10340002
&MHOS    SETA  4                       MCF DEFAULT SEGMENT LENGTH       10360002
.*                                                             @YM00641 10370002
&I3      SETB  0                       NON - USED FEATURE               10400003
         FIELD &FLD1,&FLD2,&FLD3,&FLD4,&FLD5,&FLD6,&FLD7,&FLD8          10700003
.P1      PCKT  &MP11,&MP12,&MP13,&MP14,&MP15,&MP16,&MP21,&MP22,&MP23,  X11300003
               &MP24,&MP25,&MP26,&MP31,&MP32,&MP33,&MP34,&MP35,&MP36,  X11900003
               &MP41,&MP42,&MP43,&MP44,&MP45,&MP46,&MP51,&MP52,&MP53,  X12500003
               &MP54,&MP55,&MP56,&MP61,&MP62,&MP63,&MP64,&MP65,&MP66,  X13100003
               &RPNO,&KPNO                                              16100003
.PN1     AIF   ('&RPNO' EQ '').PN2      SET NUMBERS FOR POCKET COUNTERS 22100003
         AIF   (T'&RPNO NE 'N').ERROR                                   22400003
&RCT     SETA  &RPNO                    SET REHANDLE COUNTER            22700003
         AIF   (&RCT LE 4095).PN2                                       22900003
         MNOTE 4,'***  IHB408  RPNO OR KPNO EXCEEDS 4095'               23100003
.PN2     AIF   ('&KPNO' EQ '').SF1                                      23300003
         AIF   (T'&KPNO NE 'N').ERROR                                   23600003
&KCT     SETA  &KPNO                    SET KILL COUNTER                23900003
         AIF   (&KCT LE 4095).SF1                                       24100003
         MNOTE 4,'***  IHB408  RPNO OR KPNO EXCEEDS 4095'               24300003
         AGO   .SF1                                                     24360003
.ERROR   MNOTE 12,'***  IHB417 INVALID RPNO OR KPNO NUMBER'             24420003
.SF1     AIF   ('&ITNO' EQ '').SF3      DEFINE SPECIAL FEATURES         24500003
&I1      SETB  1                        ITEM NUMBERING                  25100003
         AIF   ('&ITNO(1)' EQ '').SF2                                   25700003
&F1      SETA  &ITNO(1)                 INITIAL VALUE                   26300003
.SF2     AIF   ('&ITNO(2)' EQ '').SF25                         @YM00641 26900002
&PP1     SETA  &ITNO(2)                 PRINT POSITION                  27500003
         AIF   (&PP1 GE 0 AND &PP1 LE 3).SF25                  @ZA04480 27700003
         MNOTE 4,'***  IHB410  ITEM NUMBERING PRINT POSITION NOT 1-3'   27800003
&PP1     SETA  1                        DEFAULT PRINT POSITIONS         27900003
.SF25    AIF   ('&ITNO(3)' EQ '').SF3                          @YM00641 27930002
&IHOS    SETA  &ITNO(3)                HIGH ORDER SEGMENT LENGTH        27960002
.*                                                             @YM00641 27970002
         AIF   (&IHOS GE 0 AND &IHOS LE 5).SF3                 @YM00641 27990002
         MNOTE 4,'*** IHB422 ITNO HIGH ORDER SEGMENT NOT 0-5'  @YM00641 28020002
&IHOS    SETA  4                       DEFAULT HIGH ORDER SEGMENT LEN   28050002
.*                                                             @YM00641 28060002
.SF3   AIF     ('&ENDRS' EQ '').MC1     ENDORSE                         28100003
&I2      SETB  1                                                        28700003
&PP2     SETA  &ENDRS                   PRINT POSITION                  29000003
         AIF   (&PP2 GE 0 AND &PP2 LE 3).MC1                   @ZA04480 29300003
         MNOTE 4,'***  IHB409  ENDORSE PRINT POSITION NOT 1-3'          29600003
&PP2     SETA  1                        DEFAULT PRINT POSITION          29700003
.MC1     AIF   ('&MCF' EQ '').OPT        MICROFILM                      29900003
&I4      SETB  1                                                        30500003
         AIF   ('&MCF(2)' EQ '').MC3    MICROFILM FRONT AND BACK        31100003
         AIF   ('&MCF(2)' EQ 'F').MC2                                   31160003
         MNOTE 4,'***  IHB418  INVALID MCF OPERAND-FACE ONLY ASSUMED'   31220003
.MC2     ANOP                                                           31280003
&MCFS    SETB  1                        MICROFILM FACE ONLY             31340003
.MC3     ANOP                                                           31370003
         AIF   ('&MCF(3)' EQ '').MC4                           @YM00641 31374002
&MHOS    SETA  &MCF(3)                 HIGH ORDER SEGMENT LENGTH        31378002
.*                                                             @YM00641 31380002
         AIF   (&MHOS GE 0 AND &MHOS LE 5).MC4                 @YM00641 31382002
         MNOTE 4,'*** IHB423 MCF HIGH ORDER SEGMENT NOT 0-5'   @YM00641 31386002
&MHOS    SETA  4                       DEFAULT SEGMENT LENGTH  @YM00641 31390002
.MC4     ANOP                                                  @YM00641 31394002
&PP4     SETA  &MCF(1)                  FRAME NUMBER                    31400003
.OPT     ANOP                                                           31700003
&POS     SETA  &POS+1                                                   32000003
&MBM     SETB  ('&OPT(&POS)' EQ 'MBM' OR &MBM) MRGE BEFOR MAIN @ZA04499 32050003
&RIP     SETB  ('&OPT(&POS)' EQ 'PBF' OR &RIP)  PRIME BUFFERS           32300003
&BUG     SETB  ('&OPT(&POS)' EQ 'DBG' OR &BUG)   DEBUG MODE             32600003
&RJ      SETB  ('&OPT(&POS)' EQ 'BPO' OR &RJ)  BLK PHYSICAL OPERATION   32900003
.*                                                             @ZA00770 32950003
&US      SETB  ('&OPT(&POS)' EQ 'RUS' OR &US) RESET USER STATS          33200003
&RP      SETB  ('&OPT(&POS)' EQ 'RPC' OR &RP) RESET POCKET CTRS         33500003
         AIF   (&POS LT 6).OPT          CHECK FOR 6 VARIABLES  @ZA04499 33800003
         AIF   (&BUG NE 1).OPT1                                         34100003
         AIF   (&IMP EQ 1).OPT1                                         34400003
         MNOTE 4,'***  IHB406  DEBUG MODE SPEC. WHEN NOT I.P.; DEFAULT=X34700003
                OFF'                                                    35000003
&BUG     SETB  0                                                        35300003
.OPT1    ANOP                                                           35600003
         AIF   (&RIP NE 1).VS                                           35900003
         AIF   (&IMP EQ 1).VS                                           36200003
         MNOTE 4,'***  IHB419 PRIME BUFFERS SPEC. WHEN NOT I.P.; DEFAULX36500003
               T=OFF'                                                   36800003
&RIP     SETB  0                                                        37100003
.VS      AIF   ('&VSYMB' EQ '').FR      VALID CLOSING SYMBOL-FIELD 3    37400003
         AIF   ('&VSYMB' NE 'Y').VS2                                    39500003
&CS      SETB  1                        ONLY SYMBOL 4 VALID             40100003
         AGO   .FR                                                      40700003
.VS2     ANOP                                                           41300003
&CS      SETB  0                        SYMBOLS 4 OR 5 VALID            41900003
.FR      AIF   ('&HOZ' EQ '').TAB       FIELD REPAIR                    42500003
         AIF   ('&HOZ' LE '15').SE1                                     43100003
         MNOTE 8,'***  IHB365  ONLY 0-15 DIGITS CAN BE SPECIFIED  FOR  X43700003
               HOZ; 1 ASSUMED'                                          44000003
&RL      SETA  1                                                        44300003
         AGO   .TAB                                                     44900003
.SE1     ANOP                                                           45500003
&RL      SETA  &HOZ                                                     46100003
*************************    128 BYTE INITIALIZATION TABLE **********   46170003
.TAB     DS    0F             TABLE STARTS ON FULLWORD BOUNDRY          46240003
*                            DEFINE FEATURE STATUS                      46310003
*        BYTE 0 SPECIFIES WHICH FEATURES ARE ACTIVATED                * 46380003
*        BIT 0-ITEM NO.; BIT1-ENDORSE                                 * 46450003
*        BIT 3-MICROFILM; BIT 4-RESET POCKET CTRS                     * 46520003
*        BIT 5-RESET USER STATS; BIT 6-PRIME IMAGE BUFFER             * 46590003
&NAME    DC    AL.1(&I1),AL.1(&I2),AL.1(&I3),AL.1(&I4),AL.1(&RP),AL.1(&X47300003
               US),AL.1(&RIP),AL.1(0)                                   47900003
         DC    BL.1'0',AL.3(&IHOS),BL.2'00',AL.2(&PP1),XL4'&F1'         48200002
*                                      ITEM NO-SEG;PP;VALUE/*@YM00641*/ 48300002
         DC    XL.6'0',AL.2(&PP2),XL4'0'  ENDORSE- PRINT POSITION       48500003
         DC    XL5'0'                   FEATURE 3-RESERVED              48800003
         DC    BL.1'0',AL.3(&MHOS),BL.2'00',BL.1'&I4',BL.1'&MCFS',XL4'&X49100002
               PP4'                    MICROFILM               @YM00641 49200002
*        BYTE 21 SPECIFIES ADDITIONAL OPTIONS                         * 49400003
*        BIT0 - MERGE BEFORE MAIN FEED                         @ZA04499 49450003
*        BIT1 - MERGE DOCUMENTS; BIT2 - IMAGE PROCESS                 * 49700003
*        BIT6 - BLOCK PHYSICAL OPERATION (FRJ);                       * 49800003
*        BIT7 - DEBUG MODE                                            * 50000003
         DC    AL.1(&MBM),AL.1(&M),AL.1(&IMP),AL.3(0),AL.1(&RJ),AL.1(&BX50900003
               UG)                                             @ZA04499 50950003
*                            DEFINE FIELDS 1-8 & ATTRIBUTES             51200003
*        BYTE 1: BIT 0 - ON=FIXED OR OFF=VARIABLE LENGTH FIELD        * 51240003
*        BIT 1 - DASH TRANSMISSION                                    * 51280003
*        BIT 2 - IMAGE PROCESS                                        * 51320003
*        BIT 3-8 NUMBER OF DIGITS                                     * 51360003
*        BYTE 2: BIT 0-3 - NUMBER OF ALLOWED DIGIT ERRORS             * 51400003
*        BIT 4-7 - NUMBER OF BYTES                                    * 51440003
         DC    AL.1(&FT(1)),AL.1(&D(1)),AL.1(&IP(1)),AL.5(&C(1))        51500003
         DC    AL.4(&DE(1)),AL.4(&L(1))                                 52100003
         DC    AL.1(&FT(2)),AL.1(&D(2)),AL.1(&IP(2)),AL.5(&C(2))        52700003
         DC    AL.4(&DE(2)),AL.4(&L(2))                                 53300003
         DC    AL.1(&FT(3)),AL.1(&D(3)),AL.1(&IP(3)),AL.5(&C(3))        53900003
         DC    AL.4(&DE(3)),AL.4(&L(3))                                 54500003
         DC    AL.1(&FT(4)),AL.1(&D(4)),AL.1(&IP(4)),AL.5(&C(4))        55100003
         DC    AL.4(&DE(4)),AL.4(&L(4))                                 55700003
         DC    AL.1(&FT(5)),AL.1(&D(5)),AL.1(&IP(5)),AL.5(&C(5))        56300003
         DC    AL.4(&DE(5)),AL.4(&L(5))                                 56900003
         DC    AL.1(&FT(6)),AL.1(&D(6)),AL.1(&IP(6)),AL.5(&C(6))        57500003
         DC    AL.4(&DE(6)),AL.4(&L(6))                                 58100003
         DC    AL.1(&FT(7)),AL.1(&D(7)),AL.1(&IP(7)),AL.5(&C(7))        58700003
         DC    AL.4(&DE(7)),AL.4(&L(7))                                 59300003
         DC    AL1(&L(8))               BYTE LENGTH - FIELD 8           59900003
*                            DEFINE 1-36 POCKETS FOR DOC. SELECTION     60200003
*        1ST  4 BITS - DEFINES ODD # POCKETS                          * 60270003
*        2ND 4 BITS - DEFINES EVEN # POCKETS                          * 60340003
*        BIT 2 & 6 - COUNT DOC.; BIT 3 & 7 -KILL OR REHANDLE POCKET     60410003
         DC    AL.2(0),AL.1(&CT(1)),AL.1(&K(1)),AL.2(0),AL.1(&CT(2)),ALX60500003
               .1(&K(2))                                                61100003
         DC    AL.2(0),AL.1(&CT(3)),AL.1(&K(3)),AL.2(0),AL.1(&CT(4)),ALX61700003
               .1(&K(4))                                                62300003
         DC    AL.2(0),AL.1(&CT(5)),AL.1(&K(5)),AL.2(0),AL.1(&CT(6)),ALX62900003
               .1(&K(6))                                                63500003
         DC    AL.2(0),AL.1(&CT(7)),AL.1(&K(7)),AL.2(0),AL.1(&CT(8)),ALX64100003
               .1(&K(8))                                                64700003
         DC    AL.2(0),AL.1(&CT(9)),AL.1(&K(9)),AL.2(0),AL.1(&CT(10)),AX65300003
               L.1(&K(10))                                              65900003
         DC    AL.2(0),AL.1(&CT(11)),AL.1(&K(11)),AL.2(0),AL.1(&CT(12))X66500003
               ,AL.1(&K(12))                                            67100003
         DC    AL.2(0),AL.1(&CT(13)),AL.1(&K(13)),AL.2(0),AL.1(&CT(14))X67700003
               ,AL.1(&K(14))                                            68300003
         DC    AL.2(0),AL.1(&CT(15)),AL.1(&K(15)),AL.2(0),AL.1(&CT(16))X68900003
               ,AL.1(&K(16))                                            69500003
         DC    AL.2(0),AL.1(&CT(17)),AL.1(&K(17)),AL.2(0),AL.1(&CT(18))X70100003
               ,AL.1(&K(18))                                            70700003
         DC    AL.2(0),AL.1(&CT(19)),AL.1(&K(19)),AL.2(0),AL.1(&CT(20))X71300003
               ,AL.1(&K(20))                                            71900003
         DC    AL.2(0),AL.1(&CT(21)),AL.1(&K(21)),AL.2(0),AL.1(&CT(22))X72500003
               ,AL.1(&K(22))                                            73100003
         DC    AL.2(0),AL.1(&CT(23)),AL.1(&K(23)),AL.2(0),AL.1(&CT(24))X73700003
               ,AL.1(&K(24))                                            74300003
         DC    AL.2(0),AL.1(&CT(25)),AL.1(&K(25)),AL.2(0),AL.1(&CT(26))X74900003
               ,AL.1(&K(26))                                            75500003
         DC    AL.2(0),AL.1(&CT(27)),AL.1(&K(27)),AL.2(0),AL.1(&CT(28))X76100003
               ,AL.1(&K(28))                                            76700003
         DC    AL.2(0),AL.1(&CT(29)),AL.1(&K(29)),AL.2(0),AL.1(&CT(30))X77300003
               ,AL.1(&K(30))                                            77900003
         DC    AL.2(0),AL.1(&CT(31)),AL.1(&K(31)),AL.2(0),AL.1(&CT(32))X78500003
               ,AL.1(&K(32))                                            79100003
         DC    AL.2(0),AL.1(&CT(33)),AL.1(&K(33)),AL.2(0),AL.1(&CT(34))X79700003
               ,AL.1(&K(34))                                            80300003
         DC    AL.2(0),AL.1(&CT(35)),AL.1(&K(35)),AL.2(0),AL.1(&CT(36))X80900003
               ,AL.1(&K(36))                                            81500003
*                            DEFINE SYMBOL ERROR CORRECTION             81800003
*        BIT 0 - ON= SYMBOL ERROR CORRECTION WILL BE PERFORMED        X 81900003
*        BITS 1-7 OFF- CORRESPOND TO FIELDS 1-7 TO BE CORRECTED       X 82000003
         DC    AL.1(&FRP),AL.1(&FR(1)),AL.1(&FR(2)),AL.1(&FR(3)),AL.1(&X82100003
               FR(4)),AL.1(&FR(5)),AL.1(&FR(6)),AL.1(&FR(7))  SEC       82700003
         DC    AL.4(0),AL.12(&RCT)      # OF DOC TO REHANDLE POCKETS    83300003
         DC    AL.4(0),AL.12(&KCT)      # OF DOCS TO KILL POCKETS       83900003
         DC    AL.4(0),AL.4(&RL)        HOZ LIMIT                       84500003
         DC    XL3'0'                   RESERVED                        85100003
         DC    AL.1(&CS),AL.7(0)        FIELD 3 CLOSING SYMBOL          85500003
         DC    XL63'0'                  RESERVED                        86300003
         DC    AL2(&SUM)   SUM OF FIELD LENGTHS-NOT LOADED INTO 3890    86900003
.END     MEND                                                           87500003
