*        %GOTO IISPPRO  ;         /* Bilingual header                   00000100
         MACRO                                                          00000200
         IRRPIISP                                                       00000300
*                                  */                                   00000400
*%IISPPRO : ;                                                           00000500
*/********************************************************************/ 00000600
*/*                                                                  */ 00000700
*/*   $MAC(IRRPIISP) COMP(SC1BN) PROD(SAF):                          */ 00000800
*/*                                                                  */ 00000900
*/*   DESCRIPTIVE NAME =  IPC Security Packet                        */ 00001000
*/*                                                                  */ 00001100
*/*01* PROPRIETARY STATEMENT=                                        */ 00001200
*/***PROPRIETARY_STATEMENT********************************************/ 00001300
*/*                                                                  */ 00001400
*/*                                                                  */ 00001500
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00001600
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00001700
*/* 5655-068 (C) COPYRIGHT IBM CORP. 1995                            */ 00001800
*/* SEE COPYRIGHT INSTRUCTIONS                                       */ 00001900
*/*                                                                  */ 00002000
*/* STATUS= JBB5522                                                  */ 00002100
*/*                                                                  */ 00002200
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00002300
*/*                                                                  */ 00002400
*/*   FUNCTION = Holds Security information for an IPC entity.       */ 00002500
*/*                                                                  */ 00002600
*/*                                                                  */ 00002700
*/*   METHOD OF ACCESS =                                             */ 00002800
*/*                                                                  */ 00002900
*/*                    - %INCLUDE SYSLIB(IRRPIISP) for PL/X          */ 00003000
*/*                                                                  */ 00003100
*/*                      For VIA support, specify %IHAVIA = 'YES'    */ 00003200
*/*                      semicolon.                                  */ 00003300
*/*                      The ALET IISP_ALET will be declared as      */ 00003400
*/*                      FIXED(32).                                  */ 00003500
*/*                                                                  */ 00003600
*/*                      If %IISPBASE is not set, IISP_PTR will be   */ 00003700
*/*                      declared as PTR(31) and the IISP based on   */ 00003800
*/*                      it. If you want a different pointer used,   */ 00003900
*/*                      declare it yourself and specify %IISPBASE = */ 00004000
*/*                      'BASED(yourptr)'semicolon. Then IISP_PTR    */ 00004100
*/*                      will not be declared and the IISP will be   */ 00004200
*/*                      based on 'yourptr'.                         */ 00004300
*/*                                                                  */ 00004400
*/*                      If either %IHAVIA or %IISPBASE are          */ 00004500
*/*                      specified, they must be specified prior to  */ 00004600
*/*                      the %INCLUDE for IRRPIISP.                  */ 00004700
*/*                                                                  */ 00004800
*/*                    - Issue the IRRPIISP macro for BAL            */ 00004900
*/*                                                                  */ 00005000
*/*                                                                  */ 00005100
*/*   CREATED BY = Make_ISP Callable Service                         */ 00005200
*/*                                                                  */ 00005300
*/*01* CHANGE ACTIVITY:                                              */ 00005400
*/*                                                                  */ 00005500
*/* $L0= XPG4SAF  JBB5522 940421 PDBRW1:  Original XPG4 support  @L0A*/ 00005600
*/*                                                                  */ 00005700
*/*01* CHANGE DESCRIPTIONS:                                          */ 00005800
*/*                                                                  */ 00005900
*/* A000000-999999                                               @L0A*/ 00006000
*/*                                                                  */ 00006100
*/********************************************************************/ 00006200
*                                                               @EJECT; 00006300
*        %GOTO IISPPLS  ;         /* Bilingual header                   00006400
IISP     DSECT ,                  IRRPIISP                              00006500
         DS    0F                                                       00006600
*                                                                       00006700
IISP_ID              DS CL4       LITERAL ID 'IISP'                     00006800
IISP_VERS            DS CL1       Version Number for ISP                00006900
                     DS CL1       Reserved                              00007000
IISP_LEN             DS H         Length of the ISP                     00007100
IISP_IPCP_ALET       DS F         ALET of IPCP                          00007200
IISP_IPCP_PTR        DS F         Address of IPCP mapped by BPXYIPCP    00007300
IISP_IPCKEY          DS F         IPC Key                               00007400
IISP_IPCID           DS F         IPC ID                                00007500
                     DS CL8       Reserved (for SECLABEL)               00007600
                     DS CL32      Reserved                              00007700
IISP#LEN             EQU *-IISP   Length of the IISP                    00007800
*  Equates for IISP_ID                                                  00007900
IISP_IDC             EQU C'IISP'  Control Block Acronym                 00008000
*  Equates for IISP_VERS                                                00008100
IISP_CV01            EQU 1        Version 1 of ISP                      00008200
IISP_CVER            EQU 1        Current Version of ISP                00008300
*                                                                       00008400
         MEND                                                           00008500
  Terminating PL/X comment                                          */  00008600
 %IISPPLS : ;                                                           00008700
                                                                        00008800
                                                                        00008900
 %IF IISPBASE='' %THEN                                                  00009000
   %DO;                                                                 00009100
     %IISPBASE='BASED(IISP_PTR)';                                       00009200
   %END;                                                                00009300
  %IF IISPBASE='BASED(IISP_PTR)' %THEN                                  00009400
    %DO;                                                                00009500
      DCL IISP_PTR PTR(31);          /* Pointer to the ISP          */  00009600
    %END;                                                               00009700
 %IF IHAVIA = 'YES' %THEN                                               00009800
     %IHAALET = 'VIA(IISP_ALET)';                                       00009900
 %ELSE                                                                  00010000
     %IHAALET = ' ';                                                    00010100
  %IF IHAALET='VIA(IISP_ALET)' %THEN                                    00010200
    %DO;                                                                00010300
      DCL IISP_ALET FIXED(32);       /* ALET to the  ISP             */ 00010400
    %END;                                                               00010500
                                                                        00010600
  DCL 1 IISP IISPBASE IHAALET BDY(WORD),                                00010700
        3 IISP_ID      CHAR(4),     /* LITERAL ID 'IISP'             */ 00010800
        3 IISP_VERS    FIXED(8),    /* Version Number for ISP        */ 00010900
        3 *            FIXED(8),    /* Reserved                      */ 00011000
        3 IISP_LEN     FIXED(16),   /* Length of the ISP             */ 00011100
        3 IISP_IPCP_ALET FIXED(32), /* ALET of IPCP                  */ 00011200
        3 IISP_IPCP_PTR  POINTER(31), /* Address of IPCP mapped by      00011300
                                          BPXYIPCP                   */ 00011400
        3 IISP_IPCKEY  FIXED(32),   /* IPC Key                       */ 00011500
        3 IISP_IPCID   FIXED(32),   /* IPC ID                        */ 00011600
        3 *                    CHAR(8), /* Reserved (for SECLABEL)   */ 00011700
        3 *                    CHAR(32); /*Reserved                  */ 00011800
 DCL                                                                    00011900
  IISP_IDC   CHAR(4)     CONSTANT('IISP'), /*  ISP ID Constant       */ 00012000
  IISP_CV01  FIXED(8)    CONSTANT(01), /* Version 1 of ISP           */ 00012100
  IISP_CVER  FIXED(8)    CONSTANT(01), /* Current version of ISP     */ 00012200
  IISP#LEN   FIXED(16)   CONSTANT(LENGTH(IISP)); /* Length           */ 00012300
