*        %GOTO IFSPPRO  ;         /* Bilingual header                   00050000
         MACRO                                                          00100000
         IRRPIFSP                                                       00150000
*                                  */                                   00200000
*%IFSPPRO : ;                                                           00250000
*/********************************************************************/ 00300000
*/*                                                                  */ 00350000
*/*   $MAC(IRRPIFSP) COMP(SC1BN) PROD(RACF):                         */ 00400000
*/*                                                                  */ 00450000
*/*   DESCRIPTIVE NAME =  File Security Packet                       */ 00500000
*/*                                                                  */ 00550000
*/*   SECURITY:                                                      */ 00600000
*/*                                                                  */ 00650000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00700000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 00750000
*/*      5655-068 (C) COPYRIGHT IBM CORP. 1992                   @P1C*/ 00800000
*/*      SEE COPYRIGHT INSTRUCTIONS                                  */ 00850000
*/*                                                                  */ 00900000
*/*                                                                  */ 00950000
*/*   STATUS = HBB5510                                           @P1C*/ 01000000
*/*                                                                  */ 01050000
*/*   FUNCTION = Holds Security information for an HFS file.         */ 01100000
*/*                                                                  */ 01150000
*/*                                                                  */ 01200000
*/*   METHOD OF ACCESS =                                             */ 01250000
*/*                                                                  */ 01300000
*/*                    - %INCLUDE SYSLIB(IRRPIFSP) for PL/X          */ 01350000
*/*                                                                  */ 01400000
*/*                      For VIA support, specify %IHAVIA = 'YES'    */ 01450000
*/*                      semicolon.                                  */ 01500000
*/*                      The ALET IFSP_ALET will be declared as      */ 01550000
*/*                      FIXED(32).                                  */ 01600000
*/*                                                                  */ 01650000
*/*                      If %IFSPBASE is not set, IFSP_PTR will be   */ 01700000
*/*                      declared as PTR(31) and the IFSP based on   */ 01750000
*/*                      it. If you want a different pointer used,   */ 01800000
*/*                      declare it yourself and specify %IFSPBASE = */ 01850000
*/*                      'BASED(yourptr)'semicolon. Then IFSP_PTR    */ 01900000
*/*                      will not be declared and the IFSP will be   */ 01950000
*/*                      based on 'yourptr'.                         */ 02000000
*/*                                                                  */ 02050000
*/*                      If either %IHAVIA or %IFSPBASE are          */ 02100000
*/*                      specified, they must be specified prior to  */ 02150000
*/*                      the %INCLUDE for IRRPIFSP.                  */ 02200000
*/*                                                                  */ 02250000
*/*                    - Issue the IRRPIFSP macro for BAL            */ 02300000
*/*                                                                  */ 02350000
*/*                                                                  */ 02400000
*/*   CREATED BY = Make_Root_FSP and Make_FSP Callable Services      */ 02450000
*/*                                                                  */ 02500000
*/* CHANGE ACTIVITY =                                                */ 02550000
*/*   $L0= OMVSRACF HRF2210 920130 PDHR:   OMVS  RACF Support        */ 02600000
*/*   $D1= DCR0002  HRF2210 921105 PDNU: Support the S_ISVTX bit     */ 02650000
*/*   $P1= PIG2993  HBB5510 930915 PDCCM1: PTM PIG2993           @P1A*/ 02700000
*/*   $01= OW50655  HBB7703 010503 PDAWS1: APAR OW50655          @01A*/ 02720000
*/*                                                                  */ 02750000
*/* CHANGE DESCRIPTIONS :                                            */ 02800000
*/* A 000000-999999                                              @P1C*/ 02850000
*/* A - Rewrite the former RACF macro as a bilingual SC1BN macro @P1A*/ 02900000
*/* A - HFS ACL Compatibility Support                            @01A*/ 02920000
*/*                                                                  */ 02950000
*/********************************************************************/ 03000000
*/*                                                                  */ 03050000
*                                                               @EJECT; 03100000
*        %GOTO IFSPPLS  ;         /* Bilingual header                   03150000
IFSP     DSECT ,                  IRRPIFSP                              03200000
         DS    0F                                                       03250000
*                                                                       03300000
IFSP_ID              DS CL4       LITERAL ID 'IFSP'                     03350000
IFSP_VERS            DS CL1       Version Number for FSP                03400000
                     DS CL1       Reserved                              03450000
IFSP_LEN             DS CL2       Length of the FSP                     03500000
IFSP_OWN_UID         DS F         OWNING UID                            03550000
IFSP_OWN_GID         DS F         OWNING GID                            03600000
IFSP_PERMISSION      DS 0CL4      Permission bits                       03650000
IFSP_OWNER_8         DS 0CL1      Owner permission bits                 03700000
IFSP_OWNER           DS CL1       Owner permission bits                 03750000
IFSP_GROUP_8         DS 0CL1      Group permission bits                 03800000
IFSP_GROUP           DS CL1       Group permission bits                 03850000
IFSP_OTHER_8         DS 0CL1      Other permission bits                 03900000
IFSP_OTHER           DS CL1       Other permission bits                 03950000
IFSP_FLAG2           DS CL1       Additional FSP flags              @01A04019990
IFSP_FLAG            DS CL4       File flags                            04050000
IFSP_USER_AUDIT_OPTS DS 0CL4      User Audit Options                    04100000
IFSP_USER_AUDIT_READ DS CL1       Read Access Options                   04150000
IFSP_USER_AUDIT_WRITE DS CL1      Write Access Options                  04200000
IFSP_USER_AUDIT_EXEC_SCH DS CL1   Execute/Search Access Options         04250000
                     DS CL1       Reserved                              04300000
IFSP_ADTR_AUDIT_OPTS DS 0CL4      Auditor Audit Options                 04350000
IFSP_ADTR_AUDIT_READ DS CL1       Read Access Options                   04400000
IFSP_ADTR_AUDIT_WRITE DS CL1      Write Access Options                  04450000
IFSP_ADTR_AUDIT_EXEC_SCH DS CL1   Execute/Search Access Options         04500000
                     DS CL1       Reserved                              04550000
IFSP_SECLABEL        DS CL8       Reserved for SECLABEL             @01A04619990
                     DS CL24      Reserved                              04650000
*  Equates for IFSP_ID                                                  04700000
IFSP_IDC             EQU C'IFSP'  Control Block Acronym                 04750000
*  Equates for IFSP_VERS                                                04800000
IFSP_CV01            EQU 1        Version 1 of FSP                      04850000
IFSP_CVER            EQU 1        Current Version of FSP                04900000
*  Equates for IFSP_OWNER 1-byte fields                                 04950000
IFSP_OWNER_READ      EQU X'04'    Owner read permission                 05000000
IFSP_OWNER_WRITE     EQU X'02'    Owner write permission                05050000
IFSP_OWNER_EXECUTE   EQU X'01'    Owner execute/search permission       05100000
*  Equates for IFSP_GROUP 1-byte fields                                 05150000
IFSP_GROUP_READ      EQU X'04'    Group read permission                 05200000
IFSP_GROUP_WRITE     EQU X'02'    Group write permission                05250000
IFSP_GROUP_EXECUTE   EQU X'01'    Group execute/search permission       05300000
*  Equates for IFSP_OTHER 1-byte fields                                 05350000
IFSP_OTHER_READ      EQU X'04'    Other read permission                 05400000
IFSP_OTHER_WRITE     EQU X'02'    Other write permission                05450000
IFSP_OTHER_EXECUTE   EQU X'01'    Other execute/search permission       05500000
*  Equates for IFSP_FLAG2                                           @01A05510000
IFSP_ACCESS_ACL      EQU X'80'    An access ACL exists              @01A05520000
IFSP_FILE_MODEL_ACL  EQU X'40'    A file model ACL exists           @01A05530000
IFSP_DIR_MODEL_ACL   EQU X'20'    A directory model ACL exists      @01A05540000
*  Equates for IFSP_FLAG                                                05550000
IFSP_DIRECTORY       EQU X'80000000' File is a directory                05600000
IFSP_S_ISVTX         EQU X'00000004' S_ISVTX                            05650000
IFSP_S_ISUID         EQU X'00000002' S_ISUID                            05700000
IFSP_S_ISGID         EQU X'00000001' S_ISGID                            05750000
*  Equates for AUDIT_OPTS 1-byte fields                                 05800000
IFSP_AUD_NONE        EQU X'00'    Do not audit any access attempts      05850000
IFSP_AUD_SUCC        EQU X'01'    Audit successful access               05900000
IFSP_AUD_FAIL        EQU X'02'    Audit failed access attempts          05950000
*                                                                       06000000
         MEND                                                           06050000
  Terminating PL/X comment                                          */  06100000
 %IFSPPLS : ;                                                           06150000
                                                                        06200000
                                                                        06250000
 %IF IFSPBASE='' %THEN                                                  06300000
   %DO;                                                                 06350000
     %IFSPBASE='BASED(IFSP_PTR)';                                       06400000
   %END;                                                                06450000
  %IF IFSPBASE='BASED(IFSP_PTR)' %THEN                                  06500000
    %DO;                                                                06550000
      DCL IFSP_PTR PTR(31);          /* Pointer to the FSP          */  06600000
    %END;                                                               06650000
 %IF IHAVIA = 'YES' %THEN                                               06700000
     %IHAALET = 'VIA(IFSP_ALET)';                                       06750000
 %ELSE                                                                  06800000
     %IHAALET = ' ';                                                    06850000
  %IF IHAALET='VIA(IFSP_ALET)' %THEN                                    06900000
    %DO;                                                                06950000
      DCL IFSP_ALET FIXED(32);       /* ALET to the  FSP             */ 07000000
    %END;                                                               07050000
                                                                        07100000
  DCL 1 IFSP IFSPBASE IHAALET BDY(WORD),                                07150000
        3 IFSP_ID      CHAR(4),     /* LITERAL ID 'IFSP'             */ 07200000
        3 IFSP_VERS    FIXED(8),    /* Version Number for FSP        */ 07250000
        3 *            FIXED(8),    /* Reserved                      */ 07300000
        3 IFSP_LEN     FIXED(16),   /* Length of the FSP             */ 07350000
        3 IFSP_OWN_UID FIXED(31), /* OWNING UserId (UID)             */ 07400000
        3 IFSP_OWN_GID FIXED(31), /* OWNING GroupId (GID)            */ 07450000
        3 IFSP_PERMISSION      BIT(32), /* Permission Bits           */ 07500000
          5 IFSP_OWNER_8       BIT(8), /* Owner perm byte size bits  */ 07550000
            7 *                BIT(5), /* Reserved                   */ 07600000
            7 IFSP_OWNER       BIT(3), /* Owner perm bits            */ 07650000
              9 IFSP_OWNER_READ BIT(1), /* Owner read perm bit       */ 07700000
              9 IFSP_OWNER_WRITE BIT(1), /* Owner Write perm bit     */ 07750000
              9 IFSP_OWNER_EXECUTE BIT(1), /* Owner exececute perm bit  07800000
                                                                     */ 07850000
          5 IFSP_GROUP_8       BIT(8), /* Group perm byte size bits  */ 07900000
            7 *                BIT(5), /* Reserved                   */ 07950000
            7 IFSP_GROUP       BIT(3), /* Group perm bits            */ 08000000
              9 IFSP_GROUP_READ BIT(1), /* Group read perm bit       */ 08050000
              9 IFSP_GROUP_WRITE BIT(1), /* Group Write perm bit     */ 08100000
              9 IFSP_GROUP_EXECUTE BIT(1), /* Group exececute perm bit  08150000
                                                                     */ 08200000
          5 IFSP_OTHER_8       BIT(8), /* Other perm byte size bits  */ 08250000
            7 *                BIT(5), /* Reserved                   */ 08300000
            7 IFSP_OTHER       BIT(3), /* Other perm bits            */ 08350000
              9 IFSP_OTHER_READ BIT(1), /* Other read perm bit       */ 08400000
              9 IFSP_OTHER_WRITE BIT(1), /* Other Write perm bit     */ 08450000
              9 IFSP_OTHER_EXECUTE BIT(1), /* Other exececute perm bit  08500000
                                                                     */ 08550000
          5 IFSP_FLAG2         BIT(8), /* Additional FSP flags   @01A*/ 08605990
            7 IFSP_ACCESS_ACL  BIT(1), /* An access ACL exists   @01A*/ 08611980
            7 IFSP_FILE_MODEL_ACL BIT(1), /* A file model ACL exists    08617970
                                                                 @01A*/ 08623960
            7 IFSP_DIR_MODEL_ACL  BIT(1), /* A directory model ACL      08629950
                                          exists                 @01A*/ 08635940
            7 *                BIT(5), /* Reserved               @01A*/ 08641930
        3 IFSP_FLAG            BIT(32), /* File Flags                */ 08650000
          5 IFSP_DIRECTORY     BIT(1), /* File is Directory          */ 08700000
          5 *                  BIT(28), /* Reserved              @D1C*/ 08750000
          5 IFSP_S_ISVTX       BIT(1), /* S_ISVTX                @D1A*/ 08800000
          5 IFSP_S_ISUID       BIT(1), /* S_ISUID - setuid file      */ 08850000
          5 IFSP_S_ISGID       BIT(1), /* S_ISGID - setgid file      */ 08900000
        3 IFSP_USER_AUDIT_OPTS BIT(32), /* User Audit Options        */ 08950000
          5 IFSP_USER_AUDIT_READ BIT(8), /* Read Access Options      */ 09000000
          5 IFSP_USER_AUDIT_WRITE BIT(8), /* Write Access Options    */ 09050000
          5 IFSP_USER_AUDIT_EXEC_SCH BIT(8), /* Execute/Search Access   09100000
                                        Options                      */ 09150000
          5 *                  BIT(8), /* Reserved                   */ 09200000
        3 IFSP_ADTR_AUDIT_OPTS BIT(32), /* Auditor Audit Options     */ 09250000
          5 IFSP_ADTR_AUDIT_READ BIT(8), /* Read Access Options      */ 09300000
          5 IFSP_ADTR_AUDIT_WRITE BIT(8), /* Write Access Options    */ 09350000
          5 IFSP_ADTR_AUDIT_EXEC_SCH BIT(8), /* Execute/Search Access   09400000
                                        Options                      */ 09450000
          5 *                  BIT(8), /* Reserved                   */ 09500000
        3 IFSP_SECLABEL        CHAR(8), /* Reserved for SECLABEL @01A*/ 09569990
        3 *                    CHAR(24); /*Reserved                  */ 09600000
 DCL                                                                    09650000
  IFSP_IDC   CHAR(4)     CONSTANT('IFSP'), /*  FSP ID Constant       */ 09700000
  IFSP_CV01  FIXED(8)    CONSTANT(01), /* Version 1 of FSP           */ 09750000
  IFSP_CVER  FIXED(8)    CONSTANT(01), /* Current version of FSP     */ 09800000
  IFSP_AUD_NONE BIT(8)   CONSTANT('00'x), /* Do not Audit any access    09850000
                                             attempts                */ 09900000
  IFSP_AUD_SUCC BIT(8)   CONSTANT('01'x), /* Audit successful access */ 09950000
  IFSP_AUD_FAIL BIT(8)   CONSTANT('02'x); /* Audit failed access        10000000
                                             attempts                */ 10050000
