*                                                                       00013100
* %DCL ISGE51RN_INCLUDED CHAR EXT;                                      00026200
* %DEACTIVATE ISGE51RN_INCLUDED;                                        00039300
* %IF ISGE51RN_INCLUDED = '' %THEN                                      00052400
* %DO;                                                                  00065500
*/* Macro made bi-lingual on 96046. CBGEN compile date 96046         */ 00078600
*% /*                                                                   00091700
         MACRO                                                          00104800
         ISGE51RN &DSECT=YES,&LIST=YES,&TITLE=YES,&ENF51R=YES,         *00117900
               &ENF51R_RESOURCE_NAME=COND                               00131000
         GBLC  &ISGE51RN_INCLUDED                                       00144100
         GBLC  &ZCBPRINT                                                00157200
&ISGE51RN_INCLUDED SETC 'YES'                                           00170300
         AIF   ('&LIST' EQ 'NONE').P0                                   00183400
         AIF   ('&TITLE' EQ 'NO').P5                                    00196500
 TITLE   'ISGE51RN  - Job Suspension/Resumption due to RNL       '      00209600
.P5      ANOP                                                           00222700
**/ ISGE51RN_1:;                                                        00235800
*/* START OF SPECIFICATIONS ******************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* MACRO NAME: ISGE51RN                                          */ 00350000
*/*                                                                  */ 00400000
*/*01* DESCRIPTIVE NAME:  Job Suspension/Resumption due to RNL       */ 00450000
*/*                       Change (ENF Event Code 51)                 */ 00500000
*/*                                                                  */ 00550000
*/*02*  ACRONYM:  ISGE51RN                                           */ 00600000
*/*                                                                  */ 00650000
*/*01* PROPRIETARY STATEMENT=                                        */ 00700000
*/***PROPRIETARY_STATEMENT********************************************/ 00750000
*/*                                                                  */ 00800000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00850000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00900000
*/* 5645-001 (C) COPYRIGHT IBM CORP. 1996                            */ 00950000
*/*                                                                  */ 01000000
*/* STATUS= JBB6602                                                  */ 01050000
*/*                                                                  */ 01100000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01150000
*/*                                                                  */ 01200000
*/*01* FUNCTION:  Describes a resource request that causes a job     */ 01250000
*/*               to be suspended because an RNL change is in        */ 01300000
*/*               progress or resumed following the RNL change       */ 01350000
*/*               (ENF event code 51).                               */ 01400000
*/*                                                                  */ 01450000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 01500000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01550000
*/*                                                                  */ 01600000
*/*01* DSECT NAME:  ENF51R - Job suspension due to RNL change        */ 01650000
*/*                 ENF51R_RESOURCE_NAME                             */ 01675000
*/*                                                                  */ 01700000
*/*01* COMPONENT:  Global Resource Serialization (SCSDS)             */ 01750000
*/*                                                                  */ 01800000
*/*01* EYE-CATCHER:  ENF51R                                          */ 01850000
*/*02*  OFFSET:  0                                                   */ 01900000
*/*02*  LENGTH:  6 bytes                                             */ 01950000
*/*                                                                  */ 02000000
*/*01* STORAGE ATTRIBUTES:                                           */ 02050000
*/*02*  SUBPOOL:  241                                                */ 02100000
*/*02*  KEY:  0                                                      */ 02150000
*/*02*  RESIDENCY:  ANY                                              */ 02200000
*/*02*  MAIN STORAGE:  No                                            */ 02250000
*/*02*  AUXILIARY STORAGE:  Yes                                      */ 02300000
*/*02*  VIRTUAL STORAGE:  Yes                                        */ 02350000
*/*02*  DATA SPACE:  No                                              */ 02400000
*/*                                                                  */ 02450000
*/*01* SIZE:                                                         */ 02470000
*/*          ENF51R               -- X'0020' bytes                   */ 02490000
*/*          ENF51R_RESOURCE_NAME -- X'0008' bytes                   */ 02510000
*/*                    + length of RNAME                             */ 02530000
*/*                                                                  */ 02550000
*/*01* CREATED BY:  GRS or ENF                                       */ 02600000
*/*                                                                  */ 02650000
*/*01* POINTED TO BY:                                                */ 02700000
*/*    First word of the address list pointed to by register 1 on    */ 02750000
*/*      entry to an ENF listen exit                                 */ 02800000
*/*                                                                  */ 02850000
*/*01* SERIALIZATION:  None                                          */ 02900000
*/*                                                                  */ 02950000
*/**INVOCATION********************************************************/ 03000000
*/*                                                                  */ 03050000
*/*01* METHOD OF ACCESS:                                             */ 03100000
*/*                                                                  */ 03150000
*/*02*  ASM:                                                         */ 03161500
*/*      ISGE51RN                                                    */ 03173000
*/*           DSECT=YES|NO  -- Request DSECT definition              */ 03184500
*/*           ENF51R=YES|NO|COND -- Request record mapping           */ 03196000
*/*                            USING on ENF51R                       */ 03207500
*/*           ENF51R_RESOURCE_NAME=YES|NO|COND -- Request resource   */ 03219000
*/*                            name mapping                          */ 03230500
*/*                            USING on ENF51R_RESOURCE_NAME         */ 03242000
*/*     Default: DSECT=YES,ENF51R=YES,ENF51R_RESOURCE_NAME=COND      */ 03253500
*/*     Notes: name=YES  => expand                                   */ 03265000
*/*            name=NO   => do not expand                            */ 03276500
*/*            name=COND => expand only if DSECT=YES                 */ 03288000
*/*                                                                  */ 03300000
*/*02*   PL/X:                                                       */ 03350000
*/*        %DCL E51RNATTR CHAR EXT                                   */ 03400000
*/*        %E51RNATTR='BASED' or 'BDY(WORD)' (defaults to 'BASED')   */ 03450000
*/*        %DCL E51RNRATTR CHAR EXT                                  */ 03500000
*/*        %E51RNRATTR='your attributes' (defaults to                */ 03550000
*/*          'BASED(ADDR(ENF51R)+ENF51R_RES_OFFSET)')                */ 03600000
*/*        %INCLUDE SYSLIB(ISGE51RN)                                 */ 03650000
*/*                                                                  */ 03700000
*/********************************************************************/ 03750000
*/*01* DELETED BY:  ENF                                              */ 03800000
*/*                                                                  */ 03850000
*/*01* NOTES:  None                                                  */ 03900000
*/*                                                                  */ 03950000
*/*02*   RESTRICTIONS:  None                                         */ 04000000
*/*                                                                  */ 04050000
*/*02*   DEPENDENCIES:  None                                         */ 04100000
*/*                                                                  */ 04150000
*/*01* DISTRIBUTION LIBRARY:  AMACLIB                                */ 04200000
*/*                                                                  */ 04250000
*/*01* CHANGE ACTIVITY:                                              */ 04300000
*/*                                                                  */ 04350000
*/*  $L0=GRS32CBG JBB6602 951026 PDBN:  GRS star - CBGEN             */ 04383300
*/*  $L1=GRS32    JBB6602 951026 PDBN:  GRS star                     */ 04416600
*/*                                                                  */ 04450000
*/*                                                                  */ 04550000
*/* A - Created for GRS star mode support.                           */ 04600000
*/*                                                                  */ 04634600
*/* END OF SPECIFICATIONS ********************************************/ 04669200
*% /*                                                                   04703800
.P0      ANOP                                                           04738400
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04773000
         AIF   ('&LIST' EQ 'YES').P2                                    04807600
.P1      ANOP                                                           04842200
         PUSH  PRINT                                                    04876800
         PRINT OFF                                                      04911400
.P2      ANOP                                                           04946000
         AIF   ('&ENF51R' EQ 'NO').L0002                                04980600
         AIF   ('&DSECT' EQ 'YES').L0003                                05015200
         AIF   ('&ENF51R' NE 'YES').L0002                               05049800
ENF51R   DS    0H        RNL job suspension/resumption data             05084400
         AGO   .L0004                                                   05119000
.L0003   ANOP                                                           05153600
ENF51R   DSECT           RNL job suspension/resumption data             05188200
.L0004   ANOP                                                           05222800
ENF51R_HEADER DS 1CL0016 Header information                             05257400
         ORG   ENF51R_HEADER                                            05292000
ENF51RID DS    1CL0006   Control block identifier 'ENF51R'              05326600
ENF51RVERS DS  1FL2      Version number. Current version is            *05361200
                         ENF51RCVER.                                    05395800
ENF51RLEN DS   1FL2      Length of ENF51R control block (including     *05430400
                         ENF51R_RESOURCE_DATA)                          05465000
ENF51R_RES_OFFSET DS 1FL2 Offset to the resource name (mapped by       *05499600
                         ENF51R_RESOURCE_DATA)                          05534200
         DS    1CL0004   Reserved                                       05568800
ENF51R_DATA DS 1CL0016   Data pertaining to job and resource            05603400
         ORG   ENF51R_DATA                                              05638000
ENF51R_ASID DS 1FL2      ASID of address space in which job was        *05672600
                         running                                        05707200
ENF51R_JOB_FLAGS DS 1BL1 Job-related flags                              05741800
         ORG   ENF51R_JOB_FLAGS                                         05776400
ENF51R_JOB_SUSPENDED EQU X'80' On if job has been suspended, off if    *05811000
                         job has resumed                                05845600
         ORG   ENF51R_JOB_FLAGS+X'00000001'                             05880200
ENF51R_RESOURCE_FLAGS DS 1BL1 Resource description                      05914800
         ORG   ENF51R_RESOURCE_FLAGS                                    05949400
ENF51R_SYSTEM_SCOPE EQU X'80' Resource scope was SYSTEM                 05984000
ENF51R_SYSTEMS_SCOPE EQU X'40' Resource scope was SYSTEMS               06018600
ENF51R_SHARED EQU X'20'  On if requesting shared ownership, off if     *06053200
                         requesting exclusive ownership                 06087800
         ORG   ENF51R_RESOURCE_FLAGS+X'00000001'                        06122400
ENF51R_RNAME_LEN DS 1FL1 Length of resource RNAME                       06157000
         DS    1CL0003   Reserved                                       06191600
ENF51R_TIMESTAMP DS 1CL0008 Time at which job was suspended             06226200
ENF51R_END DS  0C        End of base part of ENF51R parameter list      06260800
*                                                                       06300000
* ********************************************************************  06337500
* * Constant values                                                  *  06375000
* ********************************************************************  06412500
*                                                                       06450000
*                                                                       06900000
ENF51RVER1 EQU 1         First version of ENF51R                        06908800
ENF51RCVER EQU 1         Current version of ENF51R                      06917600
ENF51R_KSUBPOOL EQU 241  Storage subpool for parameter list             06926400
ENF51R_ALL_RNL EQU X'02000000' ENFREQ qualifier value requesting all   *06935200
                         RNL data                                       06944000
ENF51R_SUSPEND EQU X'02000001' ENFREQ qualifier value requesting job   *06952800
                         suspension data                                06961600
ENF51R_RESUME EQU X'02000002' ENFREQ qualifier value requesting job    *06970400
                         resumption data                                06979200
ENF51R_LEN EQU *-ENF51R                                                 06988000
.L0002   ANOP                                                           06996800
         AIF   ('&ENF51R_RESOURCE_NAME' EQ 'NO').L0005                  07005600
         AIF   ('&DSECT' EQ 'YES').L0006                                07014400
         AIF   ('&ENF51R_RESOURCE_NAME' NE 'YES').L0005                 07023200
ENF51R_RESOURCE_NAME DS 0X                                              07032000
         AGO   .L0007                                                   07040800
.L0006   ANOP                                                           07049600
ENF51R_RESOURCE_NAME DSECT                                              07058400
.L0007   ANOP                                                           07067200
*                                                                       07076000
*                                      Resource requested when job      07084800
*                                      was suspended                    07093600
*                                                                       07102400
ENF51R_QNAME DS 1CL0008  Resource QNAME                                 07111200
ENF51R_RNAME DS 0C       Beginning of RNAME                             07120000
ENF51R_RESOURCE_NAME_LEN EQU *-ENF51R_RESOURCE_NAME                     07128800
.L0005   ANOP                                                           07137600
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 07146400
         AIF   ('&LIST' EQ 'YES').P4                                    07155200
.P3      ANOP                                                           07164000
         POP   PRINT                                                    07172800
.P4      ANOP                                                           07181600
.P_EXIT  ANOP                                                           07190400
         MEND                                                           07200000
**/ ISGE51RN_2:;                                                        07213300
* %ISGE51RN_INCLUDED = 'YES';                                           07226600
* %DCL ZCBPRINT CHAR EXT;                                               07239900
* %DEACTIVATE ZCBPRINT;                                                 07253200
* %DCL ISGE51RN_LIST CHAR EXT;                                          07266500
* %DEACTIVATE ISGE51RN_LIST;                                            07279800
* %IF ISGE51RN_LIST ^= 'NO' &                                           07293100
*    ZCBPRINT ^= 'NO' %THEN                                             07306400
*   %GOTO ISGE51RN_3;                                                   07319700
*   @LIST PUSH NOECHO;                                                  07333000
*   @LIST NOASSEMBLE NOECHO;                                            07346300
*   @LIST OFF C NOECHO;                                                 07359600
* %ISGE51RN_3:;                                                         07372900
*/* Start of PL/X Source                                             */ 07386200
*%IF E51RNATTR='' %THEN                                                 07400000
*  %E51RNATTR='BASED';                                                  07450000
*                                                                       07500000
*DCL 1 ENF51R E51RNATTR,            /* RNL job suspension/resumption    07550000
*                                      data                      @L1A*/ 07600000
*      3 ENF51R_HEADER,             /* Header information        @L1A*/ 07650000
*        5 ENF51RID CHAR(6),        /* Control block identifier         07700000
*                                      'ENF51R'                  @L1A*/ 07750000
*        5 ENF51RVERS FIXED(16),    /* Version number.  Current         07800000
*                                      version is ENF51RCVER.    @L1A*/ 07850000
*        5 ENF51RLEN FIXED(16),     /* Length of ENF51R control         07900000
*                                      block (including                 07950000
*                                      ENF51R_RESOURCE_DATA)     @L1A*/ 08000000
*        5 ENF51R_RES_OFFSET FIXED(16), /* Offset to the resource       08050000
*                                      name (mapped by                  08100000
*                                      ENF51R_RESOURCE_DATA)     @L1A*/ 08150000
*        5 * CHAR(4),               /* Reserved                  @L1A*/ 08200000
*      3 ENF51R_DATA,               /* Data pertaining to job and       08250000
*                                      resource                  @L1A*/ 08300000
*        5 ENF51R_ASID FIXED(16),   /* ASID of address space in         08350000
*                                      which job was running     @L1A*/ 08400000
*        5 ENF51R_JOB_FLAGS BIT(8), /* Job-related flags         @L1A*/ 08450000
*          7 ENF51R_JOB_SUSPENDED BIT(1),  /* On if job has been        08500000
*                                      suspended, off if job has        08550000
*                                      resumed                   @L1A*/ 08590000
*          7 * BIT(7),              /* Reserved                  @L1A*/ 08630000
*        5 ENF51R_RESOURCE_FLAGS BIT(8),  /* Resource description       08670000
*                                                                @L1A*/ 08710000
*          7 ENF51R_SYSTEM_SCOPE BIT(1),  /* Resource scope was         08750000
*                                      SYSTEM                    @L1A*/ 08800000
*          7 ENF51R_SYSTEMS_SCOPE BIT(1), /* Resource scope was         08850000
*                                      SYSTEMS                   @L1A*/ 08900000
*          7 ENF51R_SHARED BIT(1),  /* On if requesting shared          08950000
*                                      ownership, off if requesting     09000000
*                                      exclusive ownership       @L1A*/ 09050000
*          7 * BIT(5),              /* Reserved                  @L1A*/ 09100000
*        5 ENF51R_RNAME_LEN FIXED(8),  /* Length of resource RNAME   */ 09150000
*        5 * CHAR(3),               /* Reserved                  @L1A*/ 09200000
*        5 ENF51R_TIMESTAMP CHAR(8),  /* Time at which job was          09250000
*                                      suspended                 @L1A*/ 09300000
*      3 ENF51R_END CHAR(0);        /* End of base part of ENF51R       09350000
*                                      parameter list            @L1A*/ 09400000
*                                                               @space; 09450000
*/********************************************************************/ 09900000
*/* Constant values                                                  */ 09950000
*/********************************************************************/ 10000000
*DCL ENF51RCID CHAR(6) CONSTANT('ENF51R'); /* Control block ID value */ 10050000
*                                                                       10100000
*DCL ENF51RVER1 FIXED(16) CONSTANT(1); /* First version of ENF51R       10133300
*                                                                @L1A*/ 10166600
*                                                                       10200000
*DCL ENF51RCVER FIXED(16) CONSTANT(ENF51RVER1);  /* Current version     10250000
*                                      of ENF51R                 @L1A*/ 10300000
*                                                                       10350000
*DCL ENF51R_KSUBPOOL FIXED(8) CONSTANT(241); /* Storage subpool for     10400000
*                                      parameter list            @L1A*/ 10450000
*                                                                       10500000
*DCL ENF51R_ALL_RNL BIT(32) CONSTANT('02000000'X);  /* ENFREQ           10550000
*                                      qualifier value requesting       10600000
*                                      all RNL data              @L1A*/ 10650000
*                                                                       10700000
*DCL ENF51R_SUSPEND BIT(32) CONSTANT('02000001'X);  /* ENFREQ           10750000
*                                      qualifier value requesting       10800000
*                                      job suspension data       @L1A*/ 10850000
*                                                                       10900000
*DCL ENF51R_RESUME  BIT(32) CONSTANT('02000002'X);  /* ENFREQ           10950000
*                                      qualifier value requesting       11000000
*                                      job resumption data       @L1A*/ 11050000
*%IF E51RNRATTR='' %THEN                                                11100000
*  %E51RNRATTR='BASED(ADDR(ENF51R)+ENF51R_RES_OFFSET)';                 11150000
*                                                                       11200000
*DCL 1 ENF51R_RESOURCE_NAME E51RNRATTR, /* Resource requested when job  11250000
*                                      was suspended             @L1A*/ 11300000
*      3 ENF51R_QNAME CHAR(8),      /* Resource QNAME            @L1A*/ 11350000
*      3 ENF51R_RNAME CHAR(*);      /* Beginning of RNAME        @L1A*/ 11400000
*                                                                       11450000
*@LOGIC;                                                                11500000
*#PRAGMA TOOL=CBGEN.                                                    11550000
*#USEORG.                                                               11600000
*#DELETE.ENF51RCID                                                      11650000
*#EPRAGMA.                                                              11700000
*@ENDLOGIC;                                                             11750000
*/* End of PL/X Source                                               */ 11800000
* %IF ISGE51RN_LIST ^= 'NO' &                                           11850000
*    ZCBPRINT ^= 'NO' %THEN                                             11900000
*   %GOTO ISGE51RN_4;                                                   11950000
*   @LIST POP NOECHO;                                                   12000000
* %ISGE51RN_4:;                                                         12050000
* %END;                                                                 12100000
