*                                                                       00000491
* %DCL ISGYNQXP_INCLUDED CHAR EXT;                                      00000981
* %DEACTIVATE ISGYNQXP_INCLUDED;                                        00001471
* %IF ISGYNQXP_INCLUDED = '' %THEN                                      00001961
* %DO;                                                                  00002451
*/* Macro made bi-lingual on 00340. CBGEN compile date 00290         */ 00002941
*% /*                                                                   00003431
         MACRO                                                          00003921
         ISGYNQXP &DSECT=YES,&LIST=YES,&TITLE=YES,&NQXP=YES             00004411
         GBLC  &ISGYNQXP_INCLUDED                                       00004901
         GBLC  &ZCBPRINT                                                00005391
&ISGYNQXP_INCLUDED SETC 'YES'                                           00005881
         AIF   ('&LIST' EQ 'NONE').P0                                   00006371
         AIF   ('&TITLE' EQ 'NO').P5                                    00006861
 TITLE   'ISGYNQXP  - ENQ Exit Parameter List                        '  00007351
.P5      ANOP                                                           00007841
**/ ISGYNQXP_1:;                                                        00008331
*/* START OF SPECIFICATIONS ******************************************* 00008821
*                                                                       00009311
*01* DESCRIPTIVE NAME:  ENQ Exit Parameter List                         00009801
*02*  ACRONYM:  NQXP                                                    00010291
*                                                                       00010781
*01*  PROPRIETARY STATEMENT =                                           00011271
*                                                                       00011761
*    LICENSED MATERIALS - PROPERTY OF IBM                               00012251
*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                        00012741
*    5647-A01 (C) COPYRIGHT IBM CORP. 2001                              00013231
*                                                                       00013721
*01* STATUS = HBB6608                                                   00014211
*                                                                       00014701
*01* EXTERNAL CLASSIFICATION: GUPI                                      00015191
*01* END OF EXTERNAL CLASSIFICATION:                                    00015681
*                                                                       00016171
*01* MACRO NAME: ISGYNQXP                                               00016661
*                                                                       00017151
*01* MACRO DATE: 11/03/2000                                             00017641
*                                                                       00018131
*01* DSECT NAME: NQXP                                                   00018621
*                                                                       00019111
*01* COMPONENT:  Global Resource Serialization (SCSDS)                  00019601
*                                                                       00020091
*01* EYE-CATCHER:  NQXP                                                 00020581
*02*  OFFSET:  0                                                        00021071
*02*  LENGTH:  4                                                        00021561
*                                                                       00022051
*01* STORAGE ATTRIBUTES:                                                00022541
*02*  SUBPOOL:  229                                                     00023031
*02*  KEY:  0                                                           00023521
*02*  RESIDENCY:  Above the 16M line                                    00024011
*                                                                       00024501
*01* SIZE:  LENGTH(NQXP)                                                00024991
*            NQXP -- X'0070' bytes                                      00025481
*                                                                       00025971
*01* FREQUENCY:  1 per active ENQ/DEQ request                           00026461
*                                                                       00026951
*01* CREATED BY: ISGGRX                                                 00027441
*                                                                       00027931
*01* POINTED TO BY: R1 points to the NQXP on entry to the exit routine  00028421
*                                                                       00028911
*01* SERIALIZATION: N/A                                                 00029401
*                                                                       00029891
*01* FUNCTION: The RNL Exit Parameter List provides an installation     00030381
*              provided exit (installed at the ISGGNQXT exit point)     00030871
*              the ability to modify attributes of an ENQ, RESERVE or   00031361
*              DEQ request.                                             00031851
*                                                                       00032341
*              The exit routine may change any of the following         00032831
*              values in the NQXP.  Appropriate changes will be made    00033321
*              to the request.                                          00033811
*                                                                       00034301
*                          Value                      Flag              00034791
*              ------------------------------- --------------------     00035281
*              Nqxp_CP_QName                   Nqxp_RF1_ChangeQName     00035771
*              Nqxp_CP_RName, Nqxp_CP_RNameLen Nqxp_RF1_ChangeRName (1) 00036261
*              Nqxp_CP_Scope                   Nqxp_RF1_ChangeScope     00036751
*              Nqxp_CP_UCB@                    Nqxp_RF1_ChangeUCB@      00037241
*              (to bypass RNL processing)      Nqxp_RF1_BypassRNLs      00037731
*                                                                       00038221
*              (1) When changing the RName, do not alter                00038711
*                  Nqxp_RName@, alter the storage specified by the      00039201
*                  address.  The routine calling the exit provides      00039691
*                  enough storage to save a 255 byte RName at that      00040181
*                  address.                                             00040671
*                                                                       00041161
*01* METHOD OF ACCESS: DECLARE NQXPPTR PTR(31)                          00041651
*                      %INCLUDE SYSLIB(ISGYNQXP)                        00042141
*                                                                       00042631
*01* DELETED BY: ISGGRX                                                 00043121
*                                                                       00043611
*01* NOTES: None                                                        00044101
*                                                                       00044591
*02*  DEPENDENCIES:                                                     00045081
*                                                                       00045571
*01* DISTRIBUTION LIBRARY: AMACLIB                                      00046061
*                                                                       00046551
*01* CHANGE ACTIVITY:                                                   00047041
*                                                                       00047531
*     Lineitems:                                                        00048021
*        $00=OW49779 ,HBB6608,001103,PDBD: GRS Wildcard                 00048511
*                                                                       00049001
**** END OF SPECIFICATIONS *******************************************/ 00049491
*% /*                                                                   00049981
.P0      ANOP                                                           00050471
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00050961
         AIF   ('&LIST' EQ 'YES').P2                                    00051451
.P1      ANOP                                                           00051941
         PUSH  PRINT                                                    00052431
         PRINT OFF                                                      00052921
.P2      ANOP                                                           00053411
*                                                                       00053901
*   Change summary **************************************************** 00054391
* Create exit macro interface                                           00054881
**********************************************************************  00055371
*                                                                       00055861
*                                                                       00056351
         AIF   ('&NQXP' EQ 'NO').L0002                                  00056841
         AIF   ('&DSECT' EQ 'YES').L0003                                00057331
         AIF   ('&NQXP' NE 'YES').L0002                                 00057821
NQXP     DS    0D                                                       00058311
         AGO   .L0004                                                   00058801
.L0003   ANOP                                                           00059291
NQXP     DSECT                                                          00059781
.L0004   ANOP                                                           00060271
NQXP_ID  DS    1CL0004   Eyecatcher                                     00060761
         DS    1CL0004   Reserved                                       00061251
NQXP_REQUESTDATA DS 1CL0040 ENQ/DEQ request state information, these   *00061741
                         values cannot be changed                       00062231
         ORG   NQXP_REQUESTDATA                                         00062721
NQXP_RD_ASCB@ DS 1AL4    Pointer to requester's ASCB                    00063211
NQXP_RD_TCB@ DS 1AL4     Pointer to requester's TCB or directed TCB if *00063701
                         TCB= was specified                             00064191
NQXP_RD_VOLSER DS 1CL0006 VOLSER of requested UCB, see Nqxp_OP_Ucb      00064681
NQXP_RD_MASID DS 1FL2    Request MASID value                            00065171
NQXP_RD_MTCB DS 1AL4     Request MTCB value                             00065661
NQXP_RD_RET DS 1FL1      Request RET value, see Nqxp_kRET values        00066151
         ORG   NQXP_RD_RET                                              00066641
NQXP_RD_RET1 EQU X'04'   Maps to PELRET1                                00067131
NQXP_RD_RET2 EQU X'02'   Maps to PELRET2                                00067621
NQXP_RD_RET3 EQU X'01'   Maps to PELRET3                                00068111
         ORG   NQXP_RD_RET+X'00000001'                                  00068601
         DS    1CL0003   Reserved                                       00069091
NQXP_RD_JOBNAME DS 1CL0008 Requester's Jobname                          00069581
NQXP_RD_SYSNAME DS 1CL0008 Requester's Sysname                          00070071
NQXP_STATEFLAGS DS 1CL0008 ENQ/DEQ request state flags, these values   *00070561
                         cannot be changed                              00071051
         ORG   NQXP_STATEFLAGS                                          00071541
NQXP_STATEFLAGS1 DS 1BL1 First byte of state flags                      00072031
         ORG   NQXP_STATEFLAGS1                                         00072521
NQXP_SF1_ENQ EQU X'80'   When 1, request is ENQ/RESERVE, when 0,       *00073011
                         request is DEQ                                 00073501
NQXP_SF1_RNLEQNO EQU X'40' RNL=NO was specified on the request: a      *00073991
                         change to the scope by the exit will not be   *00074481
                         honored                                        00074971
NQXP_SF1_AUTHORIZED EQU X'20' Caller is authorized                      00075461
NQXP_SF1_SHARE EQU X'10' For ENQ/RESERVE requests, when 1 request is   *00075951
                         for shared access, when 0, request is for     *00076441
                         exclusive access                               00076931
NQXP_SF1_MATCHTASK EQU X'08' When 1, request specified MASID/MTCB       00077421
NQXP_SF1_STEPMUSTCOMPLETE EQU X'04' When 1, ENQ request specified      *00077911
                         SMC=YES                                        00078401
NQXP_SF1_RESETMUSTCOMPLETE EQU X'04' When 1, DEQ request specified     *00078891
                         RMC=YES                                        00079381
         ORG   NQXP_STATEFLAGS1+X'00000001'                             00079871
         DS    1CL0007   Reserved                                       00080361
NQXP_ORIGINALPARAMETERS DS 1CL0020 Original parameters specified on    *00080851
                         the request                                    00081341
         ORG   NQXP_ORIGINALPARAMETERS                                  00081831
NQXP_OP_QNAME DS 1CL0008 Original request QNAME                         00082321
NQXP_OP_RNAME@ DS 1AL4   Pointer to original request RNAME              00082811
NQXP_OP_RNAMELEN DS 1FL1 Length of original request RNAME               00083301
NQXP_OP_SCOPE DS 1FL1    Original request scope, see Nqxp_kScope       *00083791
                         values                                         00084281
         DS    1CL0002   Reserved                                       00084771
NQXP_OP_UCB@ DS 1AL4     Pointer to original request UCB (set for      *00085261
                         RESERVE or DEQ with UCB requests)              00085751
NQXP_REQUESTFLAGS DS 1CL0004 Request flags                              00086241
         ORG   NQXP_REQUESTFLAGS                                        00086731
NQXP_FLAGS1 DS 1BL1      First byte of state flags                      00087221
         ORG   NQXP_FLAGS1                                              00087711
NQXP_RF1_BYPASSRNLS EQU X'80' When 1, request that RNL processing is   *00088201
                         to be bypassed                                 00088691
NQXP_RF1_CHANGEQNAME EQU X'40' When 1, request that the QNAME be       *00089181
                         changed                                        00089671
NQXP_RF1_CHANGERNAME EQU X'20' When 1, request that the RNAME be       *00090161
                         changed                                        00090651
NQXP_RF1_CHANGESCOPE EQU X'10' When 1, request that the Scope be       *00091141
                         changed                                        00091631
NQXP_RF1_CHANGEUCB@ EQU X'08' When 1, request that the UCB address be  *00092121
                         changed                                        00092611
         ORG   NQXP_FLAGS1+X'00000001'                                  00093101
         DS    1CL0003   Reserved                                       00093591
         DS    1CL0004   Reserved                                       00094081
NQXP_CURRENTPARAMETERS DS 1CL0020 Parameters as changed by the exit    *00094571
                         routines                                       00095061
         ORG   NQXP_CURRENTPARAMETERS                                   00095551
NQXP_CP_QNAME DS 1CL0008 Current request QNAME                          00096041
NQXP_CP_RNAME@ DS 1AL4   Pointer to current request RNAME               00096531
NQXP_CP_RNAMELEN DS 1FL1 Length of current request RNAME                00097021
NQXP_CP_SCOPE DS 1FL1    Current request scope, Nqxp_kScope values      00097511
         DS    1CL0002   Reserved                                       00098001
NQXP_CP_UCB@ DS 1AL4     Current request UCB address                    00098491
         DS    1CL0008   Reserved                                       00098981
NQXP_END DS    0C        End of NQXP                                    00099471
*                                                                       00099961
*   ******************************************************************  00100451
*                                                                       00100941
*                          NQXP Constants                               00101431
*                                                                       00101921
*   ******************************************************************  00102411
*                                                                       00102901
*                                                                       00103391
NQXP_KID EQU   C'NQXP'   Used to identify control block                 00103881
NQXP_KSCOPESYSTEM EQU 1  Scope=System                                   00104371
NQXP_KSCOPESYSTEMS EQU 2 Scope=Systems                                  00104861
NQXP_KRETNONE EQU 0      Ret=None                                       00105351
NQXP_KRETHAVE EQU 1      Ret=Have                                       00105841
NQXP_KRETCHNG EQU 2      Ret=Chng                                       00106331
NQXP_KRETUSE EQU 3       Ret=Use                                        00106821
NQXP_KECB EQU  4         ECB specified                                  00107311
NQXP_KRETTEST EQU 7      Ret=Test                                       00107801
NQXP_KRNAMELEN EQU 256   Maximum RName length                           00108291
NQXP_KLENGTH EQU 624     Maximum length Nqxp, parameter list and 2     *00108781
                         RNames                                         00109271
NQXP_LEN EQU   *-NQXP                                                   00109761
.L0002   ANOP                                                           00110251
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00110741
         AIF   ('&LIST' EQ 'YES').P4                                    00111231
.P3      ANOP                                                           00111721
         POP   PRINT                                                    00112211
.P4      ANOP                                                           00112701
.P_EXIT  ANOP                                                           00113191
         MEND                                                           00113681
**/ ISGYNQXP_2:;                                                        00114171
* %ISGYNQXP_INCLUDED = 'YES';                                           00114661
* %DCL ZCBPRINT CHAR EXT;                                               00115151
* %DEACTIVATE ZCBPRINT;                                                 00115641
* %DCL ISGYNQXP_LIST CHAR EXT;                                          00116131
* %DEACTIVATE ISGYNQXP_LIST;                                            00116621
* %IF ISGYNQXP_LIST ^= 'NO' &                                           00117111
*    ZCBPRINT ^= 'NO' %THEN                                             00117601
*   %GOTO ISGYNQXP_3;                                                   00118091
*   @LIST PUSH NOECHO;                                                  00118581
*   @LIST NOASSEMBLE NOECHO;                                            00119071
*   @LIST OFF C NOECHO;                                                 00119561
* %ISGYNQXP_3:;                                                         00120051
*/* Start of PL/X Source                                             */ 00120541
*@list push noecho;                                                     00121031
*@list off noecho;                                                      00121521
*/* Change summary **************************************************** 00122011
* Create exit macro interface                                           00122501
**********************************************************************/ 00122991
*@list pop noecho;                                                      00123481
*%if NqxpAttr = '' %then                                                00123971
*  %NqxpAttr = 'based(NqxpPtr) bdy(dword)';                             00124461
*dcl                                                                    00124951
*   1 NQXP NqxpAttr                                                     00125441
*  ,  3 Nqxp_Id char(4)             /* Eyecatcher                    */ 00125931
*  ,  3 * char(4)                   /* Reserved                      */ 00126421
*  ,  3 Nqxp_RequestData            /* ENQ/DEQ request state            00126911
*                                      information, these values        00127401
*                                      cannot be changed             */ 00127891
*  ,    5 Nqxp_RD_Ascb@ ptr(31)     /* Pointer to requester's ASCB   */ 00128381
*  ,    5 Nqxp_RD_Tcb@ ptr(31)      /* Pointer to requester's TCB or    00128871
*                                      directed TCB if TCB= was         00129361
*                                      specified                     */ 00129851
*  ,    5 Nqxp_RD_VolSer char(6)    /* VOLSER of requested UCB, see     00130341
*                                      Nqxp_OP_Ucb@                  */ 00130831
*  ,    5 Nqxp_RD_MAsid fixed(15)   /* Request MASID value           */ 00131321
*  ,    5 Nqxp_RD_MTcb ptr(31)      /* Request MTCB value            */ 00131811
*  ,    5 Nqxp_RD_Ret fixed(8)      /* Request RET value, see           00132301
*                                      Nqxp_kRET values              */ 00132791
*  ,      7 * bit(5)                /* Unused                        */ 00133281
*  ,      7 Nqxp_RD_Ret1 bit(1)     /* Maps to PELRET1               */ 00133771
*  ,      7 Nqxp_RD_Ret2 bit(1)     /* Maps to PELRET2               */ 00134261
*  ,      7 Nqxp_RD_Ret3 bit(1)     /* Maps to PELRET3               */ 00134751
*  ,    5 * char(3)                 /* Reserved                      */ 00135241
*  ,    5 Nqxp_RD_Jobname char(8)   /* Requester's Jobname           */ 00135731
*  ,    5 Nqxp_RD_Sysname char(8)   /* Requester's Sysname           */ 00136221
*  ,  3 Nqxp_StateFlags             /* ENQ/DEQ request state flags,     00136711
*                                      these values cannot be changed   00137201
*                                                                    */ 00137691
*  ,    5 Nqxp_StateFlags1 bit(8)   /* First byte of state flags     */ 00138181
*  ,      7 Nqxp_SF1_ENQ bit(1)     /* When 1, request is ENQ/RESERVE,  00138671
*                                      when 0, request is DEQ        */ 00139161
*  ,      7 Nqxp_SF1_RnlEqNo bit(1) /* RNL=NO was specified on the      00139651
*                                      request:  a change to the scope  00140141
*                                      by the exit will not be          00140631
*                                      honored                       */ 00141121
*  ,      7 Nqxp_SF1_Authorized bit(1) /* Caller is authorized       */ 00141611
*  ,      7 Nqxp_SF1_Share bit(1)   /* For ENQ/RESERVE requests, when   00142101
*                                      1 request is for shared access,  00142591
*                                      when 0, request is for           00143081
*                                      exclusive access              */ 00143571
*  ,      7 Nqxp_SF1_MatchTask bit(1) /* When 1, request specified      00144061
*                                      MASID/MTCB                    */ 00144551
*  ,      7 Nqxp_SF1_StepMustComplete bit(1) /* When 1, ENQ request     00145041
*                                      specified SMC=YES             */ 00145531
*  ,        9 Nqxp_SF1_ResetMustComplete bit(1) /* When 1, DEQ request  00146021
*                                      specified RMC=YES             */ 00146511
*  ,      7 * bit(1)                /* Reserved                      */ 00147001
*  ,    5 * char(7)                 /* Reserved                      */ 00147491
*  ,  3 Nqxp_OriginalParameters     /* Original parameters specified    00147981
*                                      on the request                */ 00148471
*  ,    5 Nqxp_OP_QName char(8)     /* Original request QNAME        */ 00148961
*  ,    5 Nqxp_OP_RName@ ptr(31)    /* Pointer to original request      00149451
*                                      RNAME                         */ 00149941
*  ,    5 Nqxp_OP_RNameLen fixed(8) /* Length of original request       00150431
*                                      RNAME                         */ 00150921
*  ,    5 Nqxp_OP_Scope fixed(8)    /* Original request scope, see      00151411
*                                      Nqxp_kScope values            */ 00151901
*  ,    5 * char(2)                 /* Reserved                      */ 00152391
*  ,    5 Nqxp_OP_Ucb@ ptr(31)      /* Pointer to original request UCB  00152881
*                                      (set for RESERVE or DEQ with     00153371
*                                      UCB requests)                 */ 00153861
*  ,  3 Nqxp_RequestFlags           /* Request flags                 */ 00154351
*  ,    5 Nqxp_Flags1 bit(8)        /* First byte of state flags     */ 00154841
*  ,      7 Nqxp_RF1_BypassRNLs bit(1) /* When 1, request that RNL      00155331
*                                      processing is to be bypassed  */ 00155821
*  ,      7 Nqxp_RF1_ChangeQName bit(1) /* When 1, request that the     00156311
*                                      QNAME be changed              */ 00156801
*  ,      7 Nqxp_RF1_ChangeRName bit(1) /* When 1, request that the     00157291
*                                      RNAME be changed              */ 00157781
*  ,      7 Nqxp_RF1_ChangeScope bit(1) /* When 1, request that the     00158271
*                                      Scope be changed              */ 00158761
*  ,      7 Nqxp_RF1_ChangeUCB@ bit(1) /* When 1, request that the UCB  00159251
*                                      address be changed            */ 00159741
*  ,      7 * bit(3)                /* Reserved                      */ 00160231
*  ,    5 * char(3)                 /* Reserved                      */ 00160721
*  ,  3 * char(4)                   /* Reserved                      */ 00161211
*  ,  3 Nqxp_CurrentParameters      /* Parameters as changed by the     00161701
*                                      exit routines                 */ 00162191
*  ,    5 Nqxp_CP_QName char(8)     /* Current request QNAME         */ 00162681
*  ,    5 Nqxp_CP_RName@ ptr(31)    /* Pointer to current request       00163171
*                                      RNAME                         */ 00163661
*  ,    5 Nqxp_CP_RNameLen fixed(8) /* Length of current request        00164151
*                                      RNAME                         */ 00164641
*  ,    5 Nqxp_CP_Scope fixed(8)    /* Current request scope,           00165131
*                                      Nqxp_kScope values            */ 00165621
*  ,    5 * char(2)                 /* Reserved                      */ 00166111
*  ,    5 Nqxp_CP_Ucb@ ptr(31)      /* Current request UCB address   */ 00166601
*  ,  3 * char(8)                   /* Reserved                      */ 00167091
*  ,  3 Nqxp_End char(0)            /* End of NQXP                   */ 00167581
*  ;                                                                    00168071
*dcl                                                                    00168561
*   Nqxp_OP_Rname char(Nqxp_kRnameLen) based(Nqxp_OP_Rname@)            00169051
*                 varying(Nqxp_OP_RnameLen) /* Original request RNAME   00169541
*                                                                    */ 00170031
*  ,Nqxp_CP_Rname char(Nqxp_kRnameLen) based(Nqxp_CP_Rname@)            00170521
*                 varying(Nqxp_CP_RnameLen) /* Current request RNAME */ 00171011
*  ;                                                                    00171501
* /*******************************************************************/ 00171991
* /*                                                                 */ 00172481
* /*                       NQXP Constants                            */ 00172971
* /*                                                                 */ 00173461
* /*******************************************************************/ 00173951
* dcl                                                                   00174441
*    Nqxp_kId char(4) constant('NQXP') /* Used to identify control      00174931
*                                      block                         */ 00175421
*   ,Nqxp_kScopeSystem constant(1)  /* Scope=System                  */ 00175911
*   ,Nqxp_kScopeSystems constant(2) /* Scope=Systems                 */ 00176401
*   ,Nqxp_kRetNone constant('00000000'b) /* Ret=None                 */ 00176891
*   ,Nqxp_kRetHave constant('00000001'b) /* Ret=Have                 */ 00177381
*   ,Nqxp_kRetChng constant('00000010'b) /* Ret=Chng                 */ 00177871
*   ,Nqxp_kRetUse constant('00000011'b) /* Ret=Use                   */ 00178361
*   ,Nqxp_kECB constant('00000100'b) /* ECB specified                */ 00178851
*   ,Nqxp_kRetTest constant('00000111'b) /* Ret=Test                 */ 00179341
*   ,Nqxp_kRnameLen constant(256)   /* Maximum RName length          */ 00179831
*   ,Nqxp_kLength constant(length(Nqxp)+2*Nqxp_kRNameLen) /* Maximum    00180321
*                                      length Nqxp, parameter list and  00180811
*                                      2 RNames                      */ 00181301
*   ;                                                                   00181791
*/* End of PL/X Source                                               */ 00182281
* %IF ISGYNQXP_LIST ^= 'NO' &                                           00182771
*    ZCBPRINT ^= 'NO' %THEN                                             00183261
*   %GOTO ISGYNQXP_4;                                                   00183751
*   @LIST POP NOECHO;                                                   00184241
* %ISGYNQXP_4:;                                                         00184731
* %END;                                                                 00185221
