*/********************* START OF SPECIFICATIONS **********************/ 00050000
*/*                                                                  */ 00100000
*/* MAPPING NAME: ISTAPCVL                                           */ 00150000
*/*                                                                  */ 00200000
*/* DESCRIPTIVE NAME:  APPCCMD VectorList Maps                       */ 00250000
*/*                                                                  */ 00300000
*/*                                                                  */ 00350000
*/* COPYRIGHT = LICENSED MATERIALS - PROPERTY OF IBM                 */ 00400000
*/*                                                                  */ 00450000
*/*             THIS PRODUCT CONTAINS                                */ 00500000
*/*             "RESTRICTED MATERIALS OF IBM"                        */ 00550000
*/*                                                                  */ 00600000
*/*             5655-127 (C) COPYRIGHT IBM CORP.                 @D3C*/ 00650000
*/*             1996.  ALL RIGHTS RESERVED.                      @D3C*/ 00700000
*/*                                                                  */ 00750000
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */ 00800000
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED            */ 00850000
*/*             BY GSA ADP SCHEDULE CONTRACT WITH IBM CORP.          */ 00900000
*/*                                                                  */ 00950000
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */ 01000000
*/*                                                                  */ 01050000
*/*                                                                  */ 01100000
*/* MAPPING USER'S GUIDE:                                            */ 01150000
*/*                                                                  */ 01200000
*/*    FUNCTION:                                                     */ 01250000
*/*       ISTAPCVL contains a collection of mappings which map the   */ 01300000
*/*       area where vectors are returned to and received from an    */ 01350000
*/*       LU 6.2 application.                                        */ 01400000
*/*                                                                  */ 01450000
*/*                                                                  */ 01500000
*/*    METHOD OF INCLUSION:                                          */ 01550000
*/*       By invocation as a mapping macro in assembler programs.    */ 01600000
*/*       By %INCLUDE or ATBUILD in PL/X programs.                   */ 01650000
*/*                                                                  */ 01700000
*/*                                                                  */ 01750000
*/*    RESTRICTIONS / DEPENDENCIES:  None                            */ 01800000
*/*                                                                  */ 01850000
*/*                                                                  */ 01900000
*/*    NOTES:                                                        */ 01950000
*/*       The ISTAPCVL mapping macro contains multiple mappings:     */ 02000000
*/*                                                                  */ 02050000
*/*         ISTAPCVA maps APPCCMD vectorlist areas. For APPL-to-VTAM */ 02071400
*/*         vectors, it maps the area (pointed to by RPL6VAOA) which */ 02092800
*/*         holds application vectors passed to VTAM when an APPCCMD */ 02114200
*/*         macro is issued.  For VTAM-to-APPL vectors it maps the   */ 02135600
*/*         the vector area (pointed to by RPL6VAIA) where VTAM will */ 02157000
*/*         place vectors when an APPCCMD macro completes.       @D1C*/ 02178400
*/*                                                                  */ 02200000
*/*         ISTAPCVT maps any vector in the vector list. It can be   */ 02250000
*/*         used to parse a vector list.                         @L1A*/ 02300000
*/*                                                                  */ 02350000
*/*         VTAM-to-Application vectors (on APPCCMD completion):     */ 02380000
*/*                                                                  */ 02410000
*/*           ISTAPC10 maps the VTAM-to-APPL required information    */ 02440000
*/*           vector.                                            @L4A*/ 02470000
*/*                                                                  */ 02470600
*/*           ISTAPC12 maps the Partner's DCE Capability         @D3A*/ 02471200
*/*           vector.                                            @D3A*/ 02471800
*/*                                                                  */ 02472700
*/*           ISTAPC13 maps the LOCAL NONCE vector.              @D2A*/ 02475400
*/*                                                                  */ 02478100
*/*           ISTAPC14 maps the PARTNER'S NONCE vector.          @D2A*/ 02480800
*/*                                                                  */ 02483500
*/*           ISTAPC15 maps the SEND FMH_5 SEQUENCE NUMBER           */ 02486200
*/*                    vector.                                   @D2A*/ 02488900
*/*                                                                  */ 02491600
*/*           ISTAPC16 maps the RECEIVE FMH_5 SEQUENCE NUMBER        */ 02494300
*/*                    vector.                                   @D2A*/ 02497000
*/*                                                                  */ 02500000
*/*           ISTAPC17 maps the PCID vector.                         */ 02550000
*/*                                                                  */ 02600000
*/*           ISTAPC18 maps the NAME CHANGE vector.                  */ 02650000
*/*                                                                  */ 02700000
*/*           ISTAPC19 maps the Session Information Vector.      @D1A*/ 02703300
*/*                                                                  */ 02704100
*/*           ISTAPC1A maps the Partner Application                  */ 02704900
*/*                    Capabilities vector.                      @D2A*/ 02705700
*/*                                                                  */ 02706600
*/*         Application-to-VTAM vectors (on APPCCMD issuance):       */ 02710000
*/*                                                                  */ 02720000
*/*           ISTAPC82 maps the XBUFLST RECEIVE vector.          @D1A*/ 02730000
*/*                                                                  */ 02740000
*/*                                                                  */ 02750000
*/* EXTERNAL REFERENCES:  None.                                      */ 02800000
*/*                                                                  */ 02850000
*/*                                                                  */ 02900000
*/* CHANGE ACTIVITY:                                                 */ 02950000
*/*                                                                  */ 03000000
*/* $MAC(ISTAPCVL),COMP(API),PROD(VTAM): APPCCMD VECTORLIST MAPS     */ 03050000
*/*                                                                  */ 03100000
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */ 03150000
*/* ---- -------- ------- ------ ------  --------------------------- */ 03200000
*/* $L0= KN@@@MST NAMEMIS 930625 143576: Name Mismatch Detection     */ 03250000
*/* $L1= KA@@@PLD APPCRR  930721 576146: DCE Security Services       */ 03300000
*/* $L2= KA@DR001 APPCRR  940322 576146: DCE Security Services       */ 03350000
*/* $Y1= P115208  FREEDOM 940706 879315: Remove use of %GOTO         */ 03400000
*/* $L3= KA@DR005 APPCRR  940707 576146: DCE Security Services       */ 03450000
*/* $L4= KA@DR006 APPCRR  940715 578000: APPCCMD VectorList In       */ 03500000
*/* $Y2= P116683  APPCRR  940927 879315: Commentary changes          */ 03550000
*/* $D1= ID@@@MST FPAPI   941118 143576: HPDT API for APPC           */ 03568700
*/* $D2= IB@@@MST PWSUB   950511 941213: Password substitution       */ 03587500
*/* $D3= IE@@@MST V44DCE  951110 349121: DCE Security Services       */ 03593700
*/* $S1= P123772  LUOWN   960803 879315: Partner location status     */ 03596800
*/*                                                                  */ 03600000
*/********************** END OF SPECIFICATIONS ***********************/ 03650000
*@LISTPUSH;                         /*                           @Y1A*/ 03700000
*@LISTOFF;                          /*                           @Y1C*/ 03750000
*                                   /* BILINGUAL HEADER                 03800000
*                                                                       03850000
         MACRO                                                          03900000
         ISTAPCVL                                                       03950000
***     MAPPING FOR VECTORLIST HEADER (LENGTH FIELD)                 ** 03975000
ISTAPCVA DSECT                      VECTOR LIST                         04000000
*                                                                       04050000
APCVALEN DS    HL2                  LENGTH OF VECTOR LIST               04100000
*                                   (INCLUDES LENGTH FIELD & VECTORS)   04150000
APCVADTA DS    0X                   VECTORS                             04200000
*                                                                       04250000
*********************************************************************** 04258300
***  GENERALIZED MAPPING FOR EXAMINING OR BUILDING COMMON FIELDS IN  ** 04266600
***  ALL APPCCMD VECTORS IN THE VECTOR LISTS POINTED TO BY RPL6VAOA  ** 04274900
***  AND RPL6VAIA                                                    ** 04283200
*********************************************************************** 04291500
ISTAPCVT DSECT                      VECTOR TEMPLATE                @L1A 04300000
APCVTLEN DS    HL2                  VECTOR LENGTH                  @L1A 04350000
APCVTKEY DS    X                    VECTOR KEY                     @L1A 04400000
APCVTDTA DS    0X                   VECTOR DATA                    @L4C 04450000
*                                                                       04454500
*                                                                       04459000
*********************************************************************** 04463500
***                                                                  ** 04468000
*** VECTORS PASSED FROM VTAM TO APPLICATION AT APPCCMD COMPLETION    ** 04472500
***                                                                  ** 04477000
*** Note: Highorder bit in vector key is off for all vectors sent    ** 04481500
***       from VTAM to application.                                  ** 04486000
***                                                                  ** 04490500
*********************************************************************** 04495000
*                                                                       04500000
*********************************************************************** 04550000
*** ISTAPC10 - maps the VTAM-to-APPL Required INFORMATION vector.    ** 04600000
***          - Returned on all APPCCMD macros if a vector area is    ** 04650000
***            provided.                                             ** 04700000
***          - Indicates whether VTAM was able to return vector      ** 04750000
***            information successfully and length needed.           ** 04800000
***          - NOTE: Application-provided vector area must be large  ** 04850000
***            enough to accept at least this vector.                ** 04900000
*********************************************************************** 04950000
ISTAPC10 DSECT                      INFORMATION VECTOR             @L4A 05000000
*                                                                       05050000
APC10LEN DS    HL2                  VECTOR LENGTH                  @L4A 05100000
APC10KEY DS    X                    VECTOR KEY                     @L4A 05150000
APC10KYC EQU   X'10'                VECTOR KEY X'10'               @L4A 05200000
APC10DTA DS    0X                   VECTOR DATA FIELDS             @L4A 05250000
APC10FLG DS    X                    FLAGS                          @L4C 05300000
APC10IVL EQU   X'80'                INSUFFICIENT VECTOR AREA LENGTH@L4C 05350000
         DS    X                    RESERVED                       @L4A 05400000
         DS    X                    RESERVED                       @L4A 05450000
APC10VLN DS    HL2                  VECTOR AREA LENGTH NEEDED      @L4C 05500000
*                                                                       05550000
*                                                                       05600000
*********************************************************************** 05650000
*** ISTAPC12 - Maps the Partner's DCE Capability vector.             ** 05650100
***          - Returned on these APPCCMD completions if DCE is       ** 05650200
***            active:                                               ** 05650300
***               APPCCMD CONTROL=PREALLOC                           ** 05650400
***               APPCCMD CONTROL=RCVFMH5                            ** 05650500
***               APPCCMD CONTROL=OPRCNTL QUALIFY=CNOS               ** 05650600
***               APPCCMD CONTROL=OPRCNTL QUALIFY=DISPLAY            ** 05650700
***          - Also returned on ATTN(CNOS) if DCE is active.         ** 05650800
***          - Contains the Security Mechanisms Data subfield        ** 05650900
***            exchanged during BIND processing if DCE is active.    ** 05651000
*****************************************************************@D3A** 05651100
ISTAPC12 DSECT                      PARTNER'S DCE CAPABILITY VECTOR     05651200
*                                   MAPPING                        @D3A 05651300
APC12LEN DS    HL2                  LENGTH OF VECTOR (INCLUDING         05651400
*                                   LENGTH OF THIS FIELD)          @D3A 05651500
APC12KEY DS    X                    VECTOR KEY                     @D3A 05651600
APC12KYC EQU   X'12'                VECTOR KEY X'12'               @D3A 05651700
APC12DTA DS    0X                   SECURITY MECHANISMS DATA       @D3A 05651800
APC12DCE EQU   X'01'                DCE AUTHENTICATION             @D3A 05651900
APC12KRY EQU   X'02'                KRYPTOKNIGHT                   @D3A 05652000
APC12KER EQU   X'03'                KERBEROS V5                    @D3A 05652100
APC12DCP EQU   X'04'                DCE PERFORMANCE MECHANISM      @D3A 05652200
*                                                                       05652300
*                                                                       05652400
*********************************************************************** 05652500
*** ISTAPC13 - maps the LOCAL NONCE vector.                          ** 05652600
***          - Returned for these APPCCMD completions if         @D3C** 05652700
***            password substitution is supported on session:    @D3A** 05652800
***               APPCCMD CONTROL=PREALLOC                           ** 05652900
***               APPCCMD CONTROL=RCVFMH5                            ** 05653000
***          - Contains random data used for password                ** 05653100
***            substitution.                                     @D2A** 05653200
*********************************************************************** 05653600
ISTAPC13 DSECT                      MAPPING FOR LOCAL NONCE VECTOR @D2A 05654200
APC13LEN DS    HL2                  LENGTH OF VECTOR               @D2A 05654800
APC13KEY DS    X                    VECTOR KEY                     @D2A 05655400
APC13KYC EQU   X'13'                KEY IS X'13'                   @D2A 05656000
APC13DTA DS    0X                   NONCE DATA                     @D2A 05656600
         DS    XL1                  RESERVED                       @D2A 05657200
APC13NOF DS    CL8                  NONCE FIELD                    @D2A 05657800
*                                                                       05658400
*                                                                       05659000
*********************************************************************** 05659600
*** ISTAPC14 - maps the PARTNER'S NONCE vector.                      ** 05660200
***          - Returned for these APPCCMD completions if         @D3C** 05660600
***            password substitution is supported on session:    @D3A** 05661000
***               APPCCMD CONTROL=PREALLOC                           ** 05661400
***               APPCCMD CONTROL=RCVFMH5                            ** 05661700
***          - Contains random data used for password                ** 05662000
***            substitution.                                     @D2A** 05662600
*********************************************************************** 05663200
ISTAPC14 DSECT                      MAPPING FOR PARTNER NONCE      @D2A 05663800
APC14LEN DS    HL2                  LENGTH OF VECTOR               @D2A 05664400
APC14KEY DS    X                    VECTOR KEY                     @D2A 05665000
APC14KYC EQU   X'14'                KEY IS X'14'                   @D2A 05665600
APC14DTA DS    0X                   NONCE DATA                     @D2A 05666200
         DS    XL1                  RESERVED                       @D2A 05666800
APC14NOF DS    CL8                  NONCE FIELD                    @D2A 05667400
*                                                                       05668000
*                                                                       05668600
*********************************************************************** 05669200
*** ISTAPC15 - maps the SEND FMH_5 SEQUENCE NUMBER vector.           ** 05669800
***          - Returned for these APPCCMD completions if         @D3C** 05670200
***            password substitution is supported on session:    @D3A** 05670600
***               APPCCMD CONTROL=PREALLOC                           ** 05671000
***          - Contains the number of FMH_5s which have flowed on    ** 05671600
***            this session from the partner LU.                 @D2A** 05672200
*********************************************************************** 05672800
ISTAPC15 DSECT                      MAPPING FOR SEND FMH_5              05673400
*                                     SEQUENCE NUMBER VECTOR       @D2A 05674000
APC15LEN DS    HL2                  LENGTH OF VECTOR               @D2A 05674600
APC15KEY DS    X                    VECTOR KEY                     @D2A 05675200
APC15KYC EQU   X'15'                KEY IS X'15'                   @D2A 05675800
         DS    XL1                  RESERVED                       @D2A 05676400
APC15SNF DS    0X                   SEQUENCE NUMBER FIELD          @D2A 05677000
APC15SNH DS    XL4                  SEQUENCE NUMBER FIELD -             05677600
*                                     HIGH-ORDER BITS              @D2A 05678200
APC15SNL DS    XL4                  SEQUENCE NUMBER FIELD -             05678800
*                                     LOW-ORDER BITS               @D2A 05679400
*                                                                       05680000
*                                                                       05680600
*********************************************************************** 05681200
*** ISTAPC16 - maps the RECEIVE FMH_5 SEQUENCE NUMBER vector.        ** 05681800
***          - Returned for these APPCCMD completions if         @D3C** 05682200
***            password substitution is supported on session:    @D3A** 05682600
***               APPCCMD CONTROL=RCVFMH5                            ** 05683000
***          - Contains the number of FMH_5s which have flowed on    ** 05683600
***            this session from the partner LU.                 @D2A** 05684200
*********************************************************************** 05684800
ISTAPC16 DSECT                      MAPPING FOR RECEIVE FMH_5           05685400
*                                     SEQUENCE NUMBER VECTOR       @D2A 05686000
APC16LEN DS    HL2                  LENGTH OF VECTOR               @D2A 05686600
APC16KEY DS    X                    VECTOR KEY                     @D2A 05687200
APC16KYC EQU   X'16'                KEY IS X'16'                   @D2A 05687800
         DS    XL1                  RESERVED                       @D2A 05688400
APC16SNF DS    0X                   SEQUENCE NUMBER FIELD          @D2A 05689000
APC16SNH DS    XL4                  SEQUENCE NUMBER FIELD -             05689600
*                                     HIGH-ORDER BITS              @D2A 05690200
APC16SNL DS    XL4                  SEQUENCE NUMBER FIELD -             05690800
*                                     LOW-ORDER BITS               @D2A 05691400
*                                                                       05692000
*********************************************************************** 05692600
*** ISTAPC17 - maps the PCID vector.                                 ** 05700000
***          - Returned for these APPCCMD completions:               ** 05750000
***               APPCCMD CONTROL=ALLOC                              ** 05800000
***               APPCCMD CONTROL=PREALLOC                           ** 05850000
***               APPCCMD CONTROL=RCVFMH5                            ** 05900000
***          - Contains the PCID for the session being used by the   ** 05950000
***            conversation.                                     @L1C** 06000000
*********************************************************************** 06050000
ISTAPC17 DSECT                      MAPPING FOR PCID VECTOR             06100000
APC17LEN DS    HL2                  LENGTH OF VECTOR                    06150000
APC17KEY DS    X                    VECTOR KEY                          06200000
APC17KYC EQU   X'17'                KEY IS X'17'                        06250000
APC17DTA DS    0X                   VECTOR DATA FIELDS                  06275000
APC17PCF DS    CL8                  SESSION PCID FIELD                  06300000
*                                                                       06325000
*                                                                       06350000
*                                                                       06375000
*********************************************************************** 06400000
*** ISTAPC18 - maps the NAME CHANGE vector.                          ** 06450000
***          - Returned for these APPCCMD completions and exits:     ** 06500000
***               APPCCMD CONTROL=ALLOC                              ** 06550000
***               APPCCMD CONTROL=OPRCNTL,QUALIFY=CNOS               ** 06600000
***               APPCCMD CONTROL=PREALLOC                           ** 06650000
***               ATTN(CNOS) exit                                    ** 06700000
***            ...when a RCVD_NAME LU entry has been changed to      ** 06750000
***            a VARIANT_NAME LU entry in the LU-Mode Table.         ** 06800000
*********************************************************************** 06850000
ISTAPC18 DSECT                      MAPPING FOR NAME CHANGE VECTOR      06900000
APC18LEN DS    HL2                  LENGTH OF VECTOR                    06950000
APC18KEY DS    X                    VECTOR KEY                          07000000
APC18KYC EQU   X'18'                KEY IS X'18'                        07050000
APC18DTA DS    0X                   VECTOR DATA FIELDS                  07100000
APC18NET DS    CL8                  NETWORK IDENTIFIER OF THE LU        07150000
APC18RCV DS    CL8                  LUNAME IN RCVD_NAME LU ENTRY        07200000
APC18SUP DS    CL8                  LUNAME IN SUPPLIED_NAME ENTRY       07250000
*                                                                       07300000
*                                                                       07300900
*********************************************************************** 07301900
*** ISTAPC19 - maps the Session Information vector.                  ** 07302000
***          - Returned for these APPCCMD completions:               ** 07302100
***               APPCCMD CONTROL=ALLOC                              ** 07302200
***               APPCCMD CONTROL=PREALLOC                           ** 07302300
***               APPCCMD CONTROL=RCVFMH5                            ** 07302400
***            ...to provide session characteristics information     ** 07302500
***            for the conversation.                            @D1A ** 07302600
*********************************************************************** 07302700
ISTAPC19 DSECT                      MAPPING FOR SESSION INFORMATION     07302800
*                                     VECTOR                       @D1A 07302900
APC19LEN DS    HL2                  LENGTH OF VECTOR               @D1A 07303000
APC19KEY DS    X                    VECTOR KEY                     @D1A 07303100
APC19KYC EQU   X'19'                KEY IS X'19'                   @D1A 07303200
APC19DTA DS    0X                   VECTOR DATA FIELDS             @D1A 07303300
APC19CSU DS    X                    COMMUNICATION STORAGE USAGE         07303400
*                                   INDICATORS                     @D1A 07303500
APC19NOF EQU   X'80'                NOT AN HPDT-ENABLED SESSION.        07303600
*                                     CSM STORAGE USERS, DUE TO         07303700
*                                     PERFORMANCE CONSTRAINTS, SHOULD   07303800
*                                     EITHER USE CSM PAGEELIG DATA      07303900
*                                     SPACE OR NON_CSM STORAGE     @D1A 07304000
APC19SMB EQU   X'40'                SMALLER BUFFERS RECOMMENDED FOR     07304100
*                                     CSM STORAGE USERS BECAUSE OF      07304200
*                                     RU SIZE LIMITATIONS.         @D1A 07304300
APC19PGP EQU   X'20'                PAGEELIG BUFFERS RECOMMENDED.  HPDT 07304400
*                                     ENABLED FOR THIS SESSION.         07304500
*                                     NO ADDITIONAL PERFORMANCE CAN BE  07304600
*                                     GAINED USING FIXED BUFFERS.  @D1A 07304700
APC19FXP EQU   X'10'                FIXED BUFFERS RECOMMENDED.  HPDT    07304800
*                                     ENABLED FOR THIS SESSION.         07304900
*                                     ADDITIONAL PERFORMANCE CAN BE     07305000
*                                     GAINED USING FIXED BUFFERS.  @D1A 07305100
         DS    XL2                  RESERVED                       @D1A 07305200
APC19RUO DS    FL4                  MAXIMUM RU SIZE OUTBOUND       @D1A 07305300
APC19RUI DS    FL4                  MAXIMUM RU SIZE INBOUND        @D1A 07305400
*                                                                       07305500
*                                                                       07305600
*********************************************************************** 07305700
*** ISTAPC1A - maps the Partner Application Capabilities vector      ** 07305800
***          - Returned for these APPCCMD completions:               ** 07305900
***               APPCCMD CONTROL=ALLOC                              ** 07306000
***               APPCCMD CONTROL=OPRCNTL, QUALIFY=CNOS              ** 07306100
***               APPCCMD CONTROL=OPRCNTL, QUALIFY=DISPLAY           ** 07306200
***               APPCCMD CONTROL=PREALLOC                           ** 07306300
***               APPCCMD CONTROL=RCVFMH5                            ** 07306400
***          - Returned for this exit:                               ** 07306500
***               ATTN(CNOS)                                         ** 07306600
***                                                                  ** 07306700
***            ...to provide partner capabilities information        ** 07306800
***            for the conversation.                            @D2A ** 07306900
*********************************************************************** 07307000
ISTAPC1A DSECT                      MAPPING FOR PARTNER APPLICATION     07307100
*                                     CAPABILITIES VECTOR          @D2A 07307200
APC1ALEN DS    HL2                  LENGTH OF VECTOR               @D2A 07307300
APC1AKEY DS    X                    VECTOR KEY                     @D2A 07307400
APC1AKYC EQU   X'1A'                KEY IS X'1A'                   @D2A 07307500
APC1ADTA DS    0X                   VECTOR DATA FIELDS             @D2A 07307600
APC1AFL1 DS    X                    PARTNER APPLICATION CAPABILITY      07307700
*                                     INDICATORS                   @D2A 07307800
APC1APAR EQU   X'C0'                NEGOTIATED PARALLEL SESSION         07308100
*                                     CAPABILITY                   @D2A 07308400
APC1ASSC EQU   X'00'                SINGLE SESSION CAPABLE         @D2A 07308500
APC1ASSP EQU   X'40'                PENDING SINGLE STATE           @D2A 07308600
APC1APSP EQU   X'80'                PENDING PARALLEL STATE         @D2A 07308700
APC1APSC EQU   X'C0'                PARALLEL SESSION CAPABLE       @D2A 07308800
APC1APWS EQU   X'30'                NEGOTIATED LEVEL OF                 07308900
*                                     PASSWORD SUBSTITUTION        @D2A 07309000
APC1APSS EQU   X'20'                PASSWORD SUBSTITUTION               07309100
*                                     SUPPORTED                    @D2A 07309200
APC1APSN EQU   X'10'                PASSWORD SUBSTITUTION               07309300
*                                     NOT SUPPORTED                @D2A 07309400
APC1APSU EQU   X'00'                PASSWORD SUBSTITUTION               07309500
*                                     LEVEL NOT SET                @D2A 07309600
APC1AESS EQU   X'0C'                PARTNER SUPPORT FOR                 07309700
*                                     EXTENDED SECURITY SENSE           07309800
*                                     CODES                        @D2A 07309900
APC1ASSS EQU   X'08'                EXTENDED SECURITY SENSE CODES       07310000
*                                      SUPPORTED                   @D2A 07310100
APC1ASSN EQU   X'04'                EXTENDED SECURITY SENSE CODES       07310200
*                                      NOT SUPPORTED               @D2A 07310300
APC1ASSU EQU   X'00'                EXTENDED SECURITY SENSE CODE        07310400
*                                      LEVEL NOT SET               @D2A 07310500
APC1AFDX EQU   X'03'                NEGOTIATED FDX/EXPD                 07310600
*                                     CAPABILITY                   @D2A 07310700
APC1AFXS EQU   X'02'                FDX OR HDX CONVERSATIONS AND        07310800
*                                     EXPEDITED DATA ALLOWED       @D2A 07310900
APC1AFXN EQU   X'01'                HDX CONVERSATIONS ONLY         @D2A 07311000
APC1AFXU EQU   X'00'                CAPABILITY IS UNKNOWN          @D2A 07311100
APC1AFL2 DS    X                    PARTNER APPLICATION CAPABILITY      07311200
*                                     INDICATORS                   @D2A 07311300
APC1ACON EQU   X'C0'                NEGOTIATED LEVEL OF                 07311400
*                                     SYNCHRONIZATION              @D2A 07311500
APC1ACNS EQU   X'80'                CONFIRM, SYNC POINT AND             07311600
*                                     BACKOUT SUPPORTED            @D2A 07311700
APC1ACNN EQU   X'40'                CONFIRM SUPPORTED              @D2A 07311800
APC1ACNU EQU   X'00'                SYNCHRONIZATION LEVEL NOT           07311900
*                                     SET                          @D2A 07312000
APC1ASEC EQU   X'20'                PARTNER ACCEPTS SECURITY            07312100
*                                     SUBFIELDS ON FMH             @D2A 07312200
APC1AALV EQU   X'10'                PARTNER ACCEPTS REQUEST FOR         07312300
*                                     ALREADY VERIFIED             @D2A 07312400
APC1APRV EQU   X'08'                PARTNER ACCEPTS REQUEST FOR         07312500
*                                     PERSISTENT VERIFICATION      @D2A 07312600
*        EQU   X'07'                RESERVED                       @D2A 07312700
APC1AFL3 DS    X                    PARTNER CHARACTERISTICS        @S1C 07312800
APC1ALOC EQU   X'E0'                PARTNER LOCALITY STATUS        @S1A 07312900
APC1AUNL EQU   X'00'                LOCALITY OF PARTNER UNKNOWN    @S1A 07313000
APC1ARMT EQU   X'80'                PARTNER NOT ON SAME HOST       @S1A 07313100
APC1ALCL EQU   X'40'                PARTNER IS ON SAME HOST SYSTEM @S1A 07313200
APC1ALUO EQU   X'20'                PARTNER LU SAME AS APPLICATION LU   07313300
*                                    (LU=OWN)                      @S1A 07313400
*                                                                       07313500
*                                                                       07313600
*********************************************************************** 07313700
***                                                                  ** 07313800
*** VECTORS PASSED FROM APPLICATION TO VTAM AT APPCCMD ISSUANCE      ** 07313900
***                                                                  ** 07314000
*** Note: Highorder bit in vector key is on for all vectors sent     ** 07314100
***       from application to VTAM.                                  ** 07314200
***                                                                  ** 07314300
*********************************************************************** 07314400
*                                                                       07314500
*********************************************************************** 07314600
*** ISTAPC82 - maps the XBUFLST RECEIVE vector.                      ** 07314700
***          - This vector is passed to VTAM on an APPCCMD           ** 07314800
***            CONTROL=RECEIVE when OPTCD specifies XBUFLST.     @D1A** 07314900
*********************************************************************** 07315000
ISTAPC82 DSECT                      MAPPING FOR XBUFLST RECEIVE VECTOR  07315100
APC82LEN DS    HL2                  LENGTH OF VECTOR               @D1A 07315200
APC82KEY DS    X                    VECTOR KEY                     @D1A 07315300
APC82KYC EQU   X'82'                KEY IS X'82'                   @D1A 07317100
APC82DTA DS    0X                   VECTOR DATA FIELDS             @D1A 07318000
APC82SFL DS    X                    STORAGE TYPE FLAG BYTE:        @D1A 07319000
*                                    ONE OR MORE OF THE FOLLOWING  @D1A 07320900
*                                    IS REQUIRED:                  @D1A 07322800
APC82ECS EQU   X'80'                ECSA STORAGE REQUESTED         @D1A 07324900
APC82CDS EQU   X'40'                DATA SPACE STORAGE REQUESTED   @D1A 07327000
APC82XBL DS    FL4                  BUFFER LENGTH (REQUIRED WHEN   @D1A 07329100
*                                    IN FILL=BUFF MODE) OR ZEROS   @D1A 07331600
*                                                                       07334200
APC82MXD DS    FL4                  MAXIMUM DATA TO BE RECEIVED    @D1A 07336100
*                                    (OPTIONAL) OR ZEROS           @D1A 07338000
*                                                                       07339900
APC82TSK DS    AL4                  TASK TCB ADDRESS FOR CSM       @D1A 07341800
*                                    STORAGE ASSOCIATION           @D1A 07343700
*                                    (OPTIONAL) OR ZEROS           @D1A 07345600
*                                                                       07347500
         MEND                                                        */ 07350000
*                                                                       07400000
*@LISTPOP;                          /* BEGIN PL/X MAPPING        @Y1C*/ 07450000
*                                                                       07500000
*                                                                       07550000
*/*     MAPPING FOR VECTORLIST HEADER (LENGTH FIELD)                 */ 07575000
*  DCL                                                                  07600000
*    1 ISTAPCVA  BDY(BYTE) BASED,   /* VECTOR LIST                   */ 07650000
*      2 APCVALEN FIXED(15) BDY(BYTE), /* LENGTH OF VECTOR LIST         07700000
*                                      (Size includes length field      07750000
*                                      and vectors)                  */ 07800000
*      2 APCVADTA CHAR(0) ;         /* VECTORS                       */ 07850000
*                                                                       07900000
*/********************************************************************/ 07908300
*/*  GENERALIZED MAPPING FOR EXAMINING OR BUILDING COMMON FIELDS IN  */ 07916600
*/*  ALL APPCCMD VECTORS IN THE VECTOR LISTS POINTED TO BY RPL6VAOA  */ 07924900
*/*  AND RPL6VAIA                                                    */ 07933200
*/********************************************************************/ 07941500
*  DCL                                                                  07950000
*    1 ISTAPCVT BDY(BYTE) BASED,    /* VECTOR TEMPLATE           @L1A*/ 08000000
*      2 APCVTLEN       FIXED(15) BDY(BYTE), /* VECTOR LENGTH    @L1A*/ 08050000
*      2 APCVTKEY       CHAR(1),    /* VECTOR KEY                @L1A*/ 08100000
*      2 APCVTDTA       CHAR(0);    /* VECTOR DATA               @L4C*/ 08150000
*                                                                       08154500
*                                                                       08159000
*/********************************************************************/ 08163500
*/*                                                                  */ 08168000
*/* VECTORS PASSED FROM VTAM TO APPLICATION AT APPCCMD COMPLETION    */ 08172500
*/*                                                                  */ 08177000
*/* Note: Highorder bit in vector key is off for all vectors sent    */ 08181500
*/*       from VTAM to application.                                  */ 08186000
*/*                                                                  */ 08190500
*/********************************************************************/ 08195000
*                                                                       08200000
*/********************************************************************/ 08250000
*/* ISTAPC10 - maps the VTAM-to-APPL Required Information vector.    */ 08300000
*/*          - Returned on all APPCCMD macros if a vector area is    */ 08350000
*/*            provided.                                         @L4A*/ 08400000
*/*          - Indicates whether VTAM was able to return vector      */ 08450000
*/*            information successfully and length needed.           */ 08500000
*/*          - NOTE: Application-provided vector area must be large  */ 08550000
*/*            enough to accept at least this vector.                */ 08600000
*/********************************************************************/ 08650000
*  DCL                                                                  08700000
*    1 ISTAPC10  BDY(BYTE) BASED,   /* INFORMATION VECTOR        @L4A*/ 08750000
*      2 APC10LEN       FIXED(15) BDY(BYTE), /* VECTOR LENGTH    @L4A*/ 08800000
*      2 APC10KEY       CHAR(1),    /* VECTOR KEY X'10'          @L4A*/ 08850000
*      2 APC10DTA,                  /* VECTOR DATA FIELDS        @L4A*/ 08900000
*        3 APC10FLG     BIT(8),     /* FLAGS                     @L4C*/ 08950000
*          4 APC10IVL   BIT(1),     /* INSUFFICIENT VECTOR AREA  @L4C*/ 09000000
*          4 *          BIT(7),     /* RESERVED                  @L4A*/ 09050000
*        3 *            CHAR(1),    /* RESERVED                  @L4A*/ 09091600
*        3 *            CHAR(1),    /* RESERVED                  @L4A*/ 09133200
*        3 APC10VLN     FIXED(15) BDY(BYTE), /* VECTOR AREA LENGTH      09174800
*                                      NEEDED                    @L4C*/ 09216400
*      2 APC10END       CHAR(0);    /*                           @L4A*/ 09258000
*                                                                       09300000
*  DCL                                                                  09350000
*    APC10KYC BIT(8) CONSTANT('10'X); /* APC10KEY - X'10'        @L4A*/ 09400000
*                                                                       09400500
*                                                                       09401000
*/********************************************************************/ 09401500
*/* ISTAPC12 - Maps the Partner's DCE Capability vector.             */ 09401600
*/*          - Returned on these APPCCMD completions if DCE is       */ 09401700
*/*            active:                                               */ 09401800
*/*               APPCCMD CONTROL=PREALLOC                           */ 09401900
*/*               APPCCMD CONTROL=RCVFMH5                            */ 09402000
*/*               APPCCMD CONTROL=OPRCNTL QUALIFY=CNOS               */ 09402100
*/*               APPCCMD CONTROL=OPRCNTL QUALIFY=DISPLAY            */ 09402200
*/*          - Also returned on ATTN(CNOS) if DCE is active.         */ 09402300
*/*          - Contains the Security Mechanisms Data subfield        */ 09402400
*/*            exchanged during BIND processing if DCE is active.    */ 09402500
*/***************************************************************@D3A*/ 09402600
*  DCL                              /*                           @D3A*/ 09402700
*    1 ISTAPC12 BDY(BYTE) BASED,    /* PARTNER'S DCE CAPABILITY         09402800
*                                      VECTOR MAPPING            @D3A*/ 09402900
*      2 APC12LEN       FIXED(15) BDY(BYTE), /* LENGTH OF VECTOR        09403000
*                                      (INCLUDING LENGTH OF THIS        09403100
*                                      FIELD)                    @D3A*/ 09403200
*      2 APC12KEY       CHAR(1),    /* VECTOR KEY X'12'          @D3A*/ 09403300
*      2 APC12DTA       CHAR(*);    /* Security Mechanisms Data  @D3A*/ 09403400
*                                                                       09403500
*  DCL APC12KYC BIT(8) CONSTANT('12'X); /* APC12KEY - X'12'      @D3A*/ 09403600
*                                                                       09403700
*/********************************************************************/ 09403800
*/*         Constants for Partner's DCE Capability data          @D3A*/ 09403900
*/********************************************************************/ 09404000
*                                                                       09404100
*  DCL APC12DCE BIT(8) CONSTANT('01'X); /* DCE AUTHENTICATION    @D3A*/ 09404200
*  DCL APC12KRY BIT(8) CONSTANT('02'X); /* KRYPTOKNIGHT          @D3A*/ 09404300
*  DCL APC12KER BIT(8) CONSTANT('03'X); /* KERBEROS V5           @D3A*/ 09404400
*  DCL APC12DCP BIT(8) CONSTANT('04'X); /* DCE PERFORMANCE MECHANISM    09404500
*                                                                @D3A*/ 09404600
*                                                                       09404700
*/********************************************************************/ 09404800
*/* Constants for calculating the size of ISTAPC12.              @D3A*/ 09404900
*/********************************************************************/ 09405000
*                                                                       09405100
*  DCL APC12MSL FIXED(8) CONSTANT(4); /* MAXIMUM SECURITY POLICY        09405200
*                                      INFORMATION BYTES         @D3A*/ 09405300
*  DCL APC12MML FIXED(8) CONSTANT(8); /* MAXIMUM SECURITY MECHANISMS    09405400
*                                      LIST SIZE                 @D3A*/ 09405500
*                                                                       09405600
*                                                                       09405700
*/********************************************************************/ 09405800
*/* ISTAPC13 - maps the LOCAL NONCE vector.                          */ 09405900
*/*          - Returned for these APPCCMD completions if         @D3C*/ 09406000
*/*            Password Substition is active on the session:     @D3A*/ 09406100
*/*               APPCCMD CONTROL=PREALLOC                           */ 09406200
*/*               APPCCMD CONTROL=RCVFMH5                            */ 09406300
*/*          - Contains random data used for password                */ 09406400
*/*            substitution.                                     @D2A*/ 09406500
*/********************************************************************/ 09406600
*  DCL                                                                  09406700
*    1 ISTAPC13 BDY(BYTE) BASED,    /* MAPPING FOR LOCAL NONCE VECTOR   09406800
*                                                                @D2A*/ 09406900
*      2 APC13LEN  FIXED(15) BDY(BYTE),  /* LENGTH OF VECTOR     @D2A*/ 09407000
*      2 APC13KEY  CHAR(1),         /* VECTOR KEY X'13'          @D2A*/ 09407100
*      2 APC13DTA,                  /* NONCE DATA                @D2A*/ 09407500
*        3 *           CHAR(1),     /* RESERVED                  @D2A*/ 09408000
*        3 APC13NOF    CHAR(8);     /* NONCE FIELD               @D2A*/ 09408500
*                                                                       09409000
*  DCL                                                                  09409500
*    APC13KYC BIT(8)  CONSTANT('13'X); /* APC13KEY - X'13'       @D2A*/ 09410000
*                                                                       09410500
*                                                                       09411000
*/********************************************************************/ 09411500
*/* ISTAPC14 - maps the PARTNER'S NONCE vector.                      */ 09412000
*/*          - Returned for these APPCCMD completions if         @D3C*/ 09412300
*/*            Password Substition is active on the session:     @D3A*/ 09412600
*/*               APPCCMD CONTROL=PREALLOC                           */ 09413000
*/*               APPCCMD CONTROL=RCVFMH5                            */ 09413200
*/*          - Contains random data used for password                */ 09413500
*/*            substitution.                                     @D2A*/ 09414000
*/********************************************************************/ 09414500
*  DCL                                                                  09415000
*    1 ISTAPC14 BDY(BYTE) BASED,    /* MAPPING FOR PARTNER NONCE        09415500
*                                      VECTOR                    @D2A*/ 09416000
*      2 APC14LEN  FIXED(15) BDY(BYTE), /* LENGTH OF VECTOR      @D2A*/ 09416500
*      2 APC14KEY  CHAR(1),         /* VECTOR KEY X'14'          @D2A*/ 09417000
*      2 APC14DTA,                  /* NONCE DATA                @D2A*/ 09417500
*        3 *           CHAR(1),     /* RESERVED                  @D2A*/ 09418000
*        3 APC14NOF    CHAR(8);     /* NONCE FIELD               @D2A*/ 09418500
*                                                                       09419000
*  DCL                                                                  09419500
*    APC14KYC BIT(8) CONSTANT('14'X); /* APC14KEY - X'14'        @D2A*/ 09420000
*                                                                       09420500
*                                                                       09421000
*/********************************************************************/ 09421500
*/* ISTAPC15 - maps the SEND FMH_5 SEQUENCE NUMBER vector.           */ 09422000
*/*          - Returned for these APPCCMD completions if         @D3C*/ 09422300
*/*            Password Substition is active on the session:     @D3A*/ 09422600
*/*               APPCCMD CONTROL=PREALLOC                           */ 09423000
*/*          - Contains the number of FMH_5s which have flowed on    */ 09423500
*/*            this session from the partner LU.                 @D2A*/ 09424000
*/********************************************************************/ 09424500
*  DCL                                                                  09425000
*    1 ISTAPC15 BDY(BYTE) BASED,    /* MAP FOR SEND FMH_5 SEQUENCE      09425500
*                                      NUMBER VECTOR             @D2A*/ 09426000
*      2 APC15LEN  FIXED(15) BDY(BYTE), /* LENGTH OF VECTOR      @D2A*/ 09426500
*      2 APC15KEY  CHAR(1),         /* VECTOR KEY X'15'          @D2A*/ 09427000
*      2 *         CHAR(1),         /* RESERVED                  @D2A*/ 09427500
*      2 APC15SNF,                  /* SEQUENCE NUMBER FIELD     @D2A*/ 09428000
*        3 APC15SNH  BIT(32) BDY(BYTE), /* SEQUENCE NUMBER FIELD -      09428500
*                                          HIGH-ORDER BITS       @D2A*/ 09429000
*        3 APC15SNL  BIT(32) BDY(BYTE); /* SEQUENCE NUMBER FIELD -      09429500
*                                          LOW-ORDER BITS        @D2A*/ 09430000
*                                                                       09430500
*  DCL                                                                  09431000
*    APC15KYC BIT(8) CONSTANT('15'X); /* APC15KEY - X'15'        @D2A*/ 09431500
*                                                                       09432000
*                                                                       09432500
*/********************************************************************/ 09433000
*/* ISTAPC16 - maps the RECEIVE FMH_5 SEQUENCE NUMBER vector.        */ 09433500
*/*          - Returned for these APPCCMD completions if         @D3C*/ 09433800
*/*            Password Substition is active on the session:     @D3A*/ 09434100
*/*               APPCCMD CONTROL=RCVFMH5                            */ 09434500
*/*          - Contains the number of FMH_5s which have flowed on    */ 09435000
*/*            this session from the partner LU.                 @D2A*/ 09435500
*/********************************************************************/ 09436000
*  DCL                                                                  09436500
*    1 ISTAPC16 BDY(BYTE) BASED,    /* MAP FOR RECEIVE FMH_5 SEQUENCE   09437000
*                                      NUMBER VECTOR             @D2A*/ 09437500
*      2 APC16LEN   FIXED(15) BDY(BYTE),  /* LENGTH OF VECTOR    @D2A*/ 09438000
*      2 APC16KEY   CHAR(1),        /* VECTOR KEY X'16'          @D2A*/ 09438500
*      2 *          CHAR(1),        /* RESERVED                  @D2A*/ 09439000
*      2 APC16SNF,                  /* SEQUENCE NUMBER FIELD     @D2A*/ 09439500
*        3 APC16SNH  BIT(32) BDY(BYTE), /* SEQUENCE NUMBER FIELD -      09440000
*                                          HIGH-ORDER BITS       @D2A*/ 09440500
*        3 APC16SNL  BIT(32) BDY(BYTE); /* SEQUENCE NUMBER FIELD -      09441000
*                                          LOW-ORDER BITS        @D2A*/ 09441500
*                                                                       09442000
*  DCL                                                                  09442500
*    APC16KYC BIT(8) CONSTANT('16'X); /* APC16KEY - X'16'        @D2A*/ 09443000
*                                                                       09450000
*                                                                       09500000
*/********************************************************************/ 09550000
*/* ISTAPC17 - maps the PCID vector.                                 */ 09600000
*/*          - Returned for these APPCCMD completions:               */ 09650000
*/*               APPCCMD CONTROL=ALLOC                              */ 09700000
*/*               APPCCMD CONTROL=PREALLOC                           */ 09750000
*/*               APPCCMD CONTROL=RCVFMH5                            */ 09800000
*/*          - Contains the PCID for the session being used by the   */ 09850000
*/*            conversation.                                     @L1C*/ 09900000
*/********************************************************************/ 09950000
*  DCL                                                                  10000000
*    1 ISTAPC17 BDY(BYTE) BASED,    /* MAPPING FOR PCID VECTOR       */ 10050000
*      2 APC17LEN  FIXED(15) BDY(BYTE), /* LENGTH OF VECTOR          */ 10100000
*      2 APC17KEY  CHAR(1),         /* VECTOR KEY X'17'              */ 10150000
*      2 APC17DTA,                  /* VECTOR DATA FIELDS            */ 10183300
*        3 APC17PCF  CHAR(8);       /* SESSION PCID FIELD            */ 10216600
*                                                                       10250000
*  DCL                                                                  10300000
*    APC17KYC BIT(8) CONSTANT('17'X); /* APC17KEY - X'17'            */ 10350000
*                                                                       10400000
*                                                                       10450000
*/********************************************************************/ 10500000
*/* ISTAPC18 - maps the NAME CHANGE vector.                          */ 10550000
*/*          - Returned for these APPCCMD completions and exits:     */ 10600000
*/*               APPCCMD CONTROL=ALLOC                              */ 10650000
*/*               APPCCMD CONTROL=OPRCNTL,QUALIFY=CNOS               */ 10700000
*/*               APPCCMD CONTROL=PREALLOC                           */ 10750000
*/*               ATTN(CNOS) exit                                    */ 10800000
*/*            ...when a RCVD_NAME LU entry has been changed to      */ 10850000
*/*            a VARIANT_NAME LU entry in the LU-Mode Table.         */ 10900000
*/********************************************************************/ 10950000
*  DCL                                                                  11000000
*    1 ISTAPC18 BDY(BYTE) BASED,    /* MAPPING FOR NAME CHANGE VECTOR*/ 11050000
*      2 APC18LEN  FIXED(15) BDY(BYTE), /* LENGTH OF VECTOR          */ 11100000
*      2 APC18KEY  CHAR(1),         /* VECTOR KEY X'18'              */ 11150000
*      2 APC18DTA,                  /* VECTOR DATA FIELDS            */ 11200000
*        3 APC18NET   CHAR(8),      /* NETWORK IDENTIFIER OF THE LU  */ 11250000
*        3 APC18RCV   CHAR(8),      /* LUNAME IN RCVD_NAME LU ENTRY  */ 11300000
*        3 APC18SUP   CHAR(8);      /* LUNAME IN SUPPLIED_NAME ENTRY */ 11350000
*                                                                       11400000
*  DCL                                                                  11450000
*    APC18KYC BIT(8) CONSTANT('18'X); /* APC18KEY - X'18'            */ 11500000
*                                                                       11550000
*                                                                       11575000
*/********************************************************************/ 11600000
*/* ISTAPC19 - maps the Session Information Vector                   */ 11600100
*/*          - Returned for these APPCCMD completions:               */ 11600200
*/*               APPCCMD CONTROL=ALLOC                              */ 11600300
*/*               APPCCMD CONTROL=PREALLOC                           */ 11600400
*/*               APPCCMD CONTROL=RCVFMH5                            */ 11600500
*/*            ...to provide session characteristics information     */ 11600600
*/*            for the conversation.                             @D1A*/ 11600700
*/********************************************************************/ 11600800
*  DCL                                                                  11600900
*    1 ISTAPC19 BDY(BYTE) BASED,    /* MAPPING FOR SESSION INFORMATION  11601000
*                                      VECTOR                    @D1A*/ 11601100
*      2 APC19LEN  FIXED(15) BDY(BYTE), /* LENGTH OF VECTOR      @D1A*/ 11601200
*      2 APC19KEY  CHAR(1),         /* VECTOR KEY X'19'          @D1A*/ 11601300
*      2 APC19DTA,                  /* VECTOR DATA FIELDS        @D1A*/ 11601400
*        3 APC19CSU   BIT(8),       /* COMMUNICATION STORAGE USAGE      11601500
*                                      INDICATORS                @D1A*/ 11601600
*          4 APC19NOF BIT(1),       /* NOT AN HPDT-ENABLED SESSION.     11601700
*                                      CSM STORAGE USERS, DUE TO        11601800
*                                      PERFORMANCE CONSTRAINTS, SHOULD  11601900
*                                      EITHER USE CSM PAGEELIG DATA     11602000
*                                      SPACE OR NON_CSM STORAGE  @D1A*/ 11602100
*          4 APC19SMB BIT(1),       /* SMALLER BUFFERS RECOMMENDED FOR  11602200
*                                      CSM STORAGE USERS BECAUSE OF RU  11602300
*                                      SIZE LIMITATIONS.         @D1A*/ 11602400
*          4 APC19PGP BIT(1),       /* PAGEELIG BUFFERS RECOMMENDED.    11602500
*                                      HPDT ENABLED FOR THIS            11602600
*                                      SESSION. NO ADDITIONAL           11602700
*                                      PERFORMANCE CAN BE GAINED        11602800
*                                      USING FIXED BUFFERS       @D1A*/ 11602900
*          4 APC19FXP BIT(1),       /* FIXED BUFFERS RECOMMENDED.       11603000
*                                      HPDT ENABLED FOR THIS            11603100
*                                      SESSION. ADDITIONAL PERFORMANCE  11603200
*                                      CAN BE GAINED USING FIXED        11603300
*                                      BUFFERS                   @D1A*/ 11603400
*          4 *  BIT(4),             /* RESERVED                  @D1A*/ 11603500
*        3 *  CHAR(2) BDY(BYTE),    /* RESERVED                  @D1A*/ 11603600
*        3 APC19RUO FIXED(31) BDY(BYTE), /* MAXIMUM RU SIZE OUTBOUND    11603700
*                                                                @D1A*/ 11603800
*        3 APC19RUI FIXED(31) BDY(BYTE); /* MAXIMUM RU SIZE INBOUND     11603900
*                                                                @D1A*/ 11604000
*                                                                       11604100
*  DCL                                                                  11604200
*    APC19KYC BIT(8) CONSTANT('19'X); /* APC19KEY - X'19'        @D1A*/ 11604300
*                                                                       11604400
*                                                                       11604500
*/********************************************************************/ 11604600
*/* ISTAPC1A - maps the Partner Application Capabilities vector      */ 11604700
*/*          - Returned for these APPCCMD completions:               */ 11604800
*/*               APPCCMD CONTROL=ALLOC                              */ 11604900
*/*               APPCCMD CONTROL=OPRCNTL, QUALIFY=CNOS              */ 11605000
*/*               APPCCMD CONTROL=OPRCNTL, QUALIFY=DISPLAY           */ 11605100
*/*               APPCCMD CONTROL=PREALLOC                           */ 11605200
*/*               APPCCMD CONTROL=RCVFMH5                            */ 11605300
*/*          - Returned for this exit:                               */ 11605400
*/*               ATTN(CNOS)                                         */ 11605500
*/*                                                                  */ 11605600
*/*            ...to provide partner capabilities information        */ 11605700
*/*            for the conversation.                             @D2A*/ 11605800
*/********************************************************************/ 11605900
*  DCL                                                                  11606000
*    1 ISTAPC1A BDY(BYTE) BASED,    /* MAPPING FOR PARTNER APPLICATION  11606100
*                                      CAPABILITIES VECTOR       @D2A*/ 11606200
*      2 APC1ALEN  FIXED(15) BDY(BYTE), /* LENGTH OF VECTOR      @D2A*/ 11606300
*      2 APC1AKEY  CHAR(1),         /* VECTOR KEY X'1A'          @D2A*/ 11606400
*      2 APC1ADTA,                  /* VECTOR DATA FIELDS        @D2A*/ 11606500
*        3 APC1AFL1   BIT(8),       /* PARTNER APPLICATION CAPABILITY   11606600
*                                      INDICATORS                @D2A*/ 11606700
*          4 APC1APAR BIT(2),       /* NEGOTIATED PARALLEL SESSION      11606900
*                                      CAPABILITY                @D2A*/ 11607300
*          4 APC1APWS BIT(2),       /* NEGOTIATED LEVEL OF              11607400
*                                      PASSWORD SUBSTITUTION     @D2A*/ 11607500
*          4 APC1AESS BIT(2),       /* PARTNER SUPPORT FOR              11607600
*                                      EXTENDED SECURITY SENSE          11607700
*                                      CODES                     @D2A*/ 11607800
*          4 APC1AFDX BIT(2),       /* NEGOTIATED FDX/EXPD              11607900
*                                      CAPABILITY                @D2A*/ 11608000
*        3 APC1AFL2   BIT(8),       /* PARTNER APPLICATION CAPABILITY   11608100
*                                      INDICATORS                @D2A*/ 11608200
*          4 APC1ACON BIT(2),       /* NEGOTIATED LEVEL OF              11608300
*                                      SYNCHRONIZATION           @D2A*/ 11608400
*          4 APC1ASEC BIT(1),       /* PARTNER ACCEPTS SECURITY         11608500
*                                      SUBFIELDS ON FMH          @D2A*/ 11608600
*          4 APC1AALV BIT(1),       /* PARTNER ACCEPTS REQUEST FOR      11608700
*                                      ALREADY VERIFIED          @D2A*/ 11608800
*          4 APC1APRV BIT(1),       /* PARTNER ACCEPTS REQUEST FOR      11608900
*                                      PERSISTENT VERIFICATION   @D2A*/ 11609000
*          4 *  BIT(3),             /* RESERVED                  @D2A*/ 11609100
*        3 APC1AFL3   BIT(8),       /* PARTNER CHARACTERISTICS   @S1C*/ 11609200
*          4 APC1ALOC BIT(3),       /* PARTNER LOCALITY STATUS   @S1A*/ 11609300
*            5 APC1ARMT BIT(1),     /* PARTNER NOT ON SAME HOST  @S1A*/ 11609400
*            5 APC1ALCL BIT(1),     /* PARTNER IS ON SAME HOST SYSTEM   11609500
*                                      AS APPLICATION            @S1A*/ 11609600
*            5 APC1ALUO BIT(1),     /* PARTNER LU SAME AS APPLICATION   11609700
*                                      (LU=OWN)                  @S1A*/ 11609800
*          4 *  BIT(5);             /* RESERVED                  @S1A*/ 11609900
*                                                                       11610000
*  DCL                                                                  11610100
*    APC1AKYC BIT(8) CONSTANT('1A'X); /* APC1AKEY - X'1A'        @D2A*/ 11610200
*                                                                       11610300
*/********************************************************************/ 11610400
*/* Values for APC1APAR                                              */ 11610500
*/********************************************************************/ 11610600
*DCL APC1ASSC BIT(2) CONSTANT('00'B); /* Single session capable  @D3M*/ 11610700
*DCL APC1ASSP BIT(2) CONSTANT('01'B); /* Pending single state    @D3M*/ 11610800
*DCL APC1APSP BIT(2) CONSTANT('10'B); /* Pending parallel state  @D3M*/ 11610900
*DCL APC1APSC BIT(2) CONSTANT('11'B); /* Parallel session capable       11611000
*                                                                @D3M*/ 11611100
*/********************************************************************/ 11611200
*/* Values for APC1AFDX                                          @D3M*/ 11611300
*/********************************************************************/ 11611400
*DCL APC1AFXU BIT(2) CONSTANT('00'B); /* Capability is unknown   @D3M*/ 11611500
*DCL APC1AFXN BIT(2) CONSTANT('01'B); /* HDX conversations only  @D3M*/ 11611600
*DCL APC1AFXS BIT(2) CONSTANT('10'B); /* FDX or HDX conversations and   11611700
*                                        expedited data allowed  @D3M*/ 11611800
*/********************************************************************/ 11611900
*/* Values for APC1ACON                                              */ 11612000
*/********************************************************************/ 11612100
*DCL APC1ACNU BIT(2) CONSTANT('00'B); /* Synchronization level not      11612200
*                                        set                     @D3M*/ 11612300
*DCL APC1ACNN BIT(2) CONSTANT('01'B); /* Confirm supported       @D3M*/ 11612400
*DCL APC1ACNS BIT(2) CONSTANT('10'B); /* Confirm, sync point and        11612500
*                                        backout supported       @D3M*/ 11612600
*/********************************************************************/ 11612700
*/* Values for APC1APWS                                              */ 11612800
*/********************************************************************/ 11612900
*DCL APC1APSU BIT(2) CONSTANT('00'B); /* Password substitution          11613000
*                                        level not set           @D3M*/ 11613100
*DCL APC1APSN BIT(2) CONSTANT('01'B); /* Password substitution          11613200
*                                        not supported           @D3M*/ 11613300
*DCL APC1APSS BIT(2) CONSTANT('10'B); /* Password substitution          11613400
*                                        supported               @D3M*/ 11613500
*/********************************************************************/ 11613600
*/* Values for APC1AESS                                              */ 11613700
*/********************************************************************/ 11613900
*DCL APC1ASSU BIT(2) CONSTANT('00'B); /* Extended security sense code   11614000
*                                        level not set           @D3M*/ 11614100
*DCL APC1ASSN BIT(2) CONSTANT('01'B); /* Extended security sense codes  11614200
*                                        not supported           @D3M*/ 11614300
*DCL APC1ASSS BIT(2) CONSTANT('10'B); /* Extended security sense codes  11614400
*                                        supported               @D3M*/ 11614500
*                                                                       11614600
*                                                                       11614700
*/********************************************************************/ 11614800
*/*                                                                  */ 11614900
*/* VECTORS PASSED FROM APPLICATION TO VTAM AT APPCCMD ISSUANCE      */ 11615000
*/*                                                                  */ 11615100
*/* Note: Highorder bit in vector key is on for all vectors sent     */ 11615200
*/*       from application to VTAM.                                  */ 11615300
*/*                                                                  */ 11615400
*/********************************************************************/ 11615500
*                                                                       11615600
*/********************************************************************/ 11615700
*/* ISTAPC82 - maps the XBUFLST Receive vector.                      */ 11615800
*/*          - Specifed on an APPCCMD CONTROL=RECEIVE, OPTCD=XBUFLST */ 11615900
*/*            macroinstruction.                                 @D1A*/ 11616000
*/********************************************************************/ 11616100
*  DCL                                                                  11616200
*    1 ISTAPC82 BDY(BYTE) BASED,    /* MAPPING FOR XBUFLST RECEIVE      11616300
*                                      VECTOR                    @D1A*/ 11616400
*      2 APC82LEN  FIXED(15) BDY(BYTE), /* LENGTH OF VECTOR      @D1A*/ 11616500
*      2 APC82KEY  CHAR(1),         /* VECTOR KEY X'82'          @D1A*/ 11616600
*      2 APC82DTA,                  /* VECTOR DATA FIELDS            */ 11616700
*        3 APC82SFL  BIT(8),        /* STORAGE TYPE:  ONE OR MORE OF    11617500
*                                      THE FOLLOWING IS REQUIRED @D1A*/ 11618700
*          4 APC82ECS  BIT(1),      /* ECSA STORAGE REQUESTED    @D1A*/ 11619900
*          4 APC82CDS  BIT(1),      /* DATA SPACE STORAGE REQUESTED     11621100
*                                                                @D1A*/ 11622300
*          4 *         BIT(6),      /* RESERVED                  @D1A*/ 11623800
*        3 APC82XBL  FIXED(32) BDY(BYTE), /* BUFFER LENGTH (REQUIRED    11625500
*                                      FOR FILL=BUFF MODE) OR ZEROS     11627200
*                                                                @D1A*/ 11628900
*        3 APC82MXD  FIXED(32) BDY(BYTE), /* MAXIMUM DATA TO BE         11630300
*                                      RECEIVED (OPTIONAL) OR ZEROS     11631700
*                                                                @D1A*/ 11633100
*        3 APC82TSK  PTR BDY(BYTE); /* TASK TCB ADDRESS FOR CSM         11634500
*                                      STORAGE ASSOCIATION (OPTIONAL)   11635900
*                                      OR ZEROS                  @D1A*/ 11637300
*                                                                       11639100
*  DCL                                                                  11640800
*    APC82KYC BIT(8) CONSTANT('82'X); /* APC82KEY - X'82'        @D1A*/ 11642500
*                                                                       11644200
*/********************************************************************/ 11645900
*/*                      VALUE for ISTAPCVA                          */ 11650000
*/********************************************************************/ 11700000
*/* Absolute minimum APPCCMD vector area length. Value is the        */ 11750000
*/* length of the vectorlist length field and required vectors.      */ 11800000
*/********************************************************************/ 11850000
*  DCL                                                                  11900000
*    APCAMNVL FIXED(32) CONSTANT(LENGTH(APCVALEN) +                     11950000
*                                LENGTH(ISTAPC10)); /*      @L4C @L3A*/ 12000000
