*/********************* START OF SPECIFICATIONS **********************/ 00050000
*/*                                                                  */ 00100000
*/* MAPPING NAME: ISTAMSVL                                           */ 00150000
*/*                                                                  */ 00200000
*/* DESCRIPTIVE NAME:  Access Method Support Vector List             */ 00250000
*/*                                                                  */ 00300000
*/*                                                                  */ 00350000
*/* COPYRIGHT = LICENSED MATERIALS - PROPERTY OF IBM                 */ 00400000
*/*                                                                  */ 00450000
*/*             THIS PRODUCT CONTAINS                                */ 00500000
*/*             "RESTRICTED MATERIALS OF IBM"                        */ 00550000
*/*                                                                  */ 00600000
*/*             5695-117 (C) COPYRIGHT IBM CORP. 1996, 1997.         */ 00650000
*/*             ALL RIGHTS RESERVED.                                 */ 00700000
*/*                                                                  */ 00750000
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */ 00800000
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED            */ 00850000
*/*             BY GSA ADP SCHEDULE CONTRACT WITH IBM CORP.          */ 00900000
*/*                                                                  */ 00950000
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */ 01000000
*/*                                                                  */ 01050000
*/*                                                                  */ 01100000
*/* MAPPING USER'S GUIDE:                                            */ 01150000
*/*                                                                  */ 01200000
*/*    FUNCTION:                                                     */ 01250000
*/*       ISTAMSVL contains mappings for a collection of vectors     */ 01300000
*/*       provided by VTAM to the application in the Access Method   */ 01350000
*/*       Support Vector List.                                       */ 01400000
*/*                                                                  */ 01450000
*/*       Vectors are addressible via ACBAMSVL after OPEN for        */ 01500000
*/*       the ACB has completed.                                     */ 01550000
*/*                                                                  */ 01600000
*/*    METHOD OF INCLUSION:                                          */ 01650000
*/*       By invocation as a mapping macro in assembler programs.    */ 01700000
*/*       By ATBUILD or %INCLUDE in PL/X programs.                   */ 01750000
*/*                                                                  */ 01800000
*/*                                                                  */ 01850000
*/*    RESTRICTIONS / DEPENDENCIES: None.                            */ 01900000
*/*                                                                  */ 01950000
*/*    NOTES:  None                                                  */ 02000000
*/*                                                                  */ 02050000
*/* EXTERNAL REFERENCES:  None.                                      */ 02100000
*/*                                                                  */ 02150000
*/*                                                                  */ 02200000
*/* CHANGE ACTIVITY:                                                 */ 02250000
*/*                                                                  */ 02300000
*/* $MAC(ISTAMSVL),COMP(O/C),PROD(VTAM): ACCESS METHOD SUPPORT VECTOR*/ 02350000
*/*                                     LIST                         */ 02400000
*/*                                                                  */ 02450000
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */ 02500000
*/* ---- -------- ------- ------ ------  --------------------------- */ 02550000
*/* $W0= P116769  VMAPPN  941010 879315: Create AMSVL mapping        */ 02600000
*/* $D1= IA@@@MST V51APPC 941102 941213: APPCCMD enhancements        */ 02612500
*/* $D2= IT@@@MST TSOGR   941118 062811: TSO-Generic Resource        */ 02625000
*/* $D3= ID@@@MST FPAPI   941128 510689: Fast Path API for APPC      */ 02634300
*/* $D4= IL@@@MST LUOWN   950124 941213: LU = OWN                    */ 02643700
*/* $D5= IB@@@MST PWSUB   950508 941213: Password substitution       */ 02646800
*/* $S1= P119332  VMAPPN  950706 879315: Fix DISTLIB (UNIMOD change) */ 02648400
*/* $D6= IE@@@MST V44DCE  951110 349121: DCE Security Services       */ 02649200
*/* $N1= P126308  POLARIS 970918 879315: EXITFRR= on ACB PARMS       */ 02649600
*/*                                                                  */ 02650000
*/********************** END OF SPECIFICATIONS ***********************/ 02700000
*@LISTPUSH;                                                             02750000
*@LISTOFF;                                                              02800000
*                                   /* BILINGUAL HEADER                 02850000
*                                                                       02900000
         MACRO                                                          02950000
         ISTAMSVL                                                       03000000
ISTAMSVL DSECT                      MAPPING FOR RESOURCE INFORMATION    03050000
*                                   VECTOR LIST POINTED TO BY ACVAMSVL  03100000
AMSLLEN  DS    HL2                  TOTAL LENGTH OF VECTORS             03150000
AMSLDATA DS    0X                   VECTOR DATA                         03200000
*                                                                       03250000
*********************************************************************** 03300000
***  GENERALIZED MAPPING FOR EXAMINING COMMON FIELDS IN ALL ACB      ** 03350000
***  VECTORS IN THE VECTOR LIST POINTED TO BY ACBAMSVL               ** 03400000
*********************************************************************** 03450000
ISTAMSVT DSECT                      VECTOR FIELDS                       03500000
AMSVTLEN DS    X                    VECTOR LENGTH                       03550000
AMSVTKEY DS    X                    VECTOR KEY                          03600000
AMSVTDAT DS    0X                   VECTOR DATA                         03650000
*                                                                       03700000
*                                                                       03750000
*********************************************************************** 03800000
*** ISTAMS01 - maps the RELEASE LEVEL vector.                        ** 03850000
***          - Contains identification codes for the access method   ** 03900000
***            product and its version, release, and modification    ** 03950000
***            level.                                                ** 04000000
*********************************************************************** 04050000
ISTAMS01 DSECT                      RELEASE LEVEL VECTOR                04100000
AMS01LEN DS    X                    VECTOR LENGTH                       04150000
AMS01KEY DS    X                    VECTOR KEY                          04200000
AMS01KYC EQU   X'01'                KEY IS X'01'                        04250000
AMS01DTA DS    0CL4                 VECTOR DATA                         04300000
AMS01PRD DS    CL1                  PRODUCT CODE                        04350000
AMS01VTM EQU   C'0'                 VTAM PRODUCT CODE                   04400000
AMS01VER DS    CL1                  VERSION CODE                        04450000
AMS01REL DS    CL1                  RELEASE CODE                        04500000
AMS01MDF DS    CL1                  MODIFICATION CODE                   04550000
*                                                                       04600000
*********************************************************************** 04650000
*** ISTAMS04 - maps the COMPONENT IDENTIFICATION vector.             ** 04700000
***          - This vector may be repeated.                          ** 04750000
***          - Each component identification vector contains product ** 04800000
***            identification information about a major component or ** 04850000
***            feature of the VTAM licensed program.  When multiple  ** 04900000
***            component identification vectors are present, the     ** 04950000
***            first one designates the base VTAM product and later  ** 05000000
***            vectors are features or other major VTAM components.  ** 05050000
***          - The vector data is in the form: C'xxxx-xxxxx-xxx'.    ** 05100000
*********************************************************************** 05150000
ISTAMS04 DSECT                      COMPONENT IDENTIFICATION VECTOR     05200000
AMS04LEN DS    X                    VECTOR LENGTH                       05250000
AMS04KEY DS    X                    VECTOR KEY                          05300000
AMS04KYC EQU   X'04'                KEY IS X'04'                        05350000
AMS04DTA DS    CL14                 VECTOR DATA                         05400000
*                                                                       05450000
*********************************************************************** 05500000
*** ISTAMS05 - maps the FUNCTION LIST vector.                        ** 05550000
***          - The vector data is a variable-length bit string, in   ** 05600000
***            which each bit corresponds to a particular VTAM       ** 05650000
***            function.  If a bit is on, the corresponding function ** 05700000
***            is present in the executing release of VTAM.  If a    ** 05750000
***            bit is off, the function is not available.  If the    ** 05800000
***            vector is not present or if the bit string is shorter ** 05850000
***            than expected, you may assume that the missing bits   ** 05900000
***            are zero and their corresponding functions are not    ** 05950000
***            available.                                            ** 06000000
***          - These indicator bits correspond to the compile-time   ** 06050000
***            global indicator bits in the ISTGLBAL macro.          ** 06100000
*********************************************************************** 06150000
ISTAMS05 DSECT                      FUNCTION LIST VECTOR                06200000
AMS05LEN DS    X                    VECTOR LENGTH                       06250000
AMS05KEY DS    X                    VECTOR KEY                          06300000
AMS05KYC EQU   X'05'                KEY IS X'05'                        06350000
AMS05DTA DS    0X                   VECTOR DATA                         06400000
AMS05DT0 DS    X                    BYTE 0 OF INDICATORS                06450000
AMS05B00 EQU   X'80'                NIB ENCR AND RPL CRYPT              06500000
*                                   (CRYPTOGRAPHY)                      06550000
AMS05B01 EQU   X'40'                ACB PARMS=NIB (COMMUNICATION        06600000
*                                   NETWORK MANAGEMENT INTERFACE)       06650000
AMS05B02 EQU   X'20'                MULTIPLE-ADDRESS-SPACE              06700000
*                                   APPLICATIONS PROGRAMS               06750000
AMS05B03 EQU   X'10'                AUTHORIZED PATH FOR                 06800000
*                                   COMMUNICATIONS MACROS               06850000
AMS05B04 EQU   X'08'                AUTHORIZED PATH FOR ALL             06900000
*                                   RPL-BASED MACROS                    06950000
AMS05B05 EQU   X'04'                SRBEXIT (ON APPL DEFINITION         07000000
*                                   STATEMENT)                          07050000
AMS05B06 EQU   X'02'                SONSCIP (ON APPL DEFINITION         07100000
*                                   STATEMENT)                          07150000
AMS05B07 EQU   X'01'                VTAMFRR (ON APPL DEFINITION         07200000
*                                   STATEMENT)                          07250000
*                                                                       07300000
AMS05DT1 DS    X                    BYTE 1 OF INDICATORS                07350000
AMS05B10 EQU   X'80'                SSCP TRACKING OF DEVICE-LU          07400000
*                                   SESSION CAPABILITY VIA NOTIFY       07450000
*                                   (ENABLED/DISABLED/INHIBITED)        07500000
AMS05B11 EQU   X'40'                RPL OPTCD=LMPEO                     07550000
AMS05B12 EQU   X'20'                RPL OPTCD=BUFFLST                   07600000
AMS05B13 EQU   X'10'                RPL OPTCD=USERRH                    07650000
AMS05B14 EQU   X'08'                ACB PARMS=USERFLD                   07700000
AMS05B15 EQU   X'04'                RPL BRACKET=CEB                     07750000
AMS05B16 EQU   X'02'                APPLICATION PROGRAM ASSIGNMENT OF   07800000
*                                   SEQUENCE NUMBERS FOR EXPEDITED DFC  07850000
AMS05B17 EQU   X'01'                RESOURCE-IDENTIFICATION VECTOR LIST 07900000
*                                                                       07950000
AMS05DT2 DS    X                    BYTE 2 OF INDICATORS                08000000
AMS05B20 EQU   X'80'                ACCESS-METHOD-SUPPORT VECTOR LIST   08050000
AMS05B21 EQU   X'40'                RETURN OF SYSTEM RESPONSE BYTE AND  08100000
*                                   EXTENDED RESPONSE BYTE FOR BSC 3270 08150000
*                                   TERMINALS ATTACHED TO ACF/NCP       08200000
AMS05B22 EQU   X'20'                INTRPRET                            08250000
AMS05B23 EQU   X'10'                VTAM API IS XRF CAPABLE             08300000
AMS05B24 EQU   X'08'                SENSE ON -RSP(CINIT). CLSDST        08350000
*                                   OPTCD=(RELEASE,SENSE)               08400000
AMS05B25 EQU   X'04'                UNBIND SON CODE AND SENSE.          08450000
*                                   CLSDST OPTCD=(RELEASE,SONCODE),     08500000
*                                   TERMSESS OPTCD=(UNBIND,SONCODE)     08550000
AMS05B26 EQU   X'02'                HOLD/RELEASE LOGON/SCIP EXIT FOR    08600000
*                                   SESSION SETUP.                      08650000
*                                   SETLOGON OPTCD=(START|HOLD)         08700000
AMS05B27 EQU   X'01'                CINIT - NETWORK ADDRESSES IN        08750000
*                                   VECTOR KEY X'15'                    08800000
*                                                                       08850000
AMS05DT3 DS    X                    BYTE 3 OF INDICATORS                08900000
AMS05B30 EQU   X'80'                31-BIT API                          08950000
AMS05B31 EQU   X'40'                NOTIFICATION OF QUEUED RESPONSES    09000000
*                                   SUPPORTED.  SEND OPTCD=(RSPQUED)    09050000
AMS05B32 EQU   X'20'                APPC IS SUPPORTED                   09100000
AMS05B33 EQU   X'10'                ADD SUPPORT FOR USERVAR             09150000
AMS05B34 EQU   X'08'                VCNS API SUPPORT FOR X.25           09200000
AMS05B35 EQU   X'04'                VCNS API SUPPORT FOR TOKEN BUS,     09250000
*                                   TOKEN RING,                         09300000
AMS05B36 EQU   X'02'                CROSS-MEMORY API IS SUPPORTED       09350000
AMS05B37 EQU   X'01'                KEEPFRR SUPPORT (ON ACB STATEMENT)  09400000
*                                                                       09450000
AMS05DT4 DS    X                    BYTE 4 OF INDICATORS                09500000
AMS05B40 EQU   X'80'                SRBEXIT SUPPORT (ON ACB STATEMENT)  09550000
AMS05B41 EQU   X'40'                PERSISTENT LU-LU SESSIONS           09600000
AMS05B42 EQU   X'20'                V.25BIS SUPPORT                     09650000
AMS05B43 EQU   X'10'                VTAM/NPM INTERFACE SUPPORT          09700000
AMS05B44 EQU   X'08'                LU6 PLUS TRACKING SUPPORTED         09750000
AMS05B45 EQU   X'04'                EXITFRR SUPPORT (ON ACB STATEMENT)  09783300
*                                                                  @N1C 09816600
AMS05B46 EQU   X'02'                BYTE 4, BIT 6: RESERVED             09850000
AMS05B47 EQU   X'01'                NETWORK QUALIFIED NAMES SUPPORTED   09900000
*                                                                       09950000
AMS05DT5 DS    X                    BYTE 5 OF INDICATORS                10000000
AMS05B50 EQU   X'80'                MS TRANSPORT SUPPORTED              10050000
AMS05B51 EQU   X'40'                PERFORMANCE MONITOR INTERFACE       10100000
*                                   SUPPORTED                           10150000
AMS05B52 EQU   X'20'                QUEUED SESSION TERMINATION          10200000
*                                   SUPPPORTED                          10250000
AMS05B53 EQU   X'10'                VTAM AGENT SUPPORTED                10300000
AMS05B54 EQU   X'08'                GENERIC RESOURCES SUPPORTED         10350000
AMS05B55 EQU   X'04'                OPTCD=KEEPSRB FOR SYNC SRB          10400000
*                                   SUSPEND/RESUME                      10450000
AMS05B56 EQU   X'02'                APPLICATION VECTORS SUPPORTED ON    10500000
*                                   ACB MACRO                           10550000
AMS05B57 EQU   X'01'                SETLOGON GNAMESUB SUPPORTED    @D2C 10600000
*                                                                       10650000
AMS05DT6 DS    X                    BYTE 6 OF INDICATORS                10700000
AMS05B60 EQU   X'80'                BYTE 6, BIT 0: RESERVED             10750000
AMS05B61 EQU   X'40'                BYTE 6, BIT 1: RESERVED             10800000
AMS05B62 EQU   X'20'                BYTE 6, BIT 2: RESERVED             10850000
AMS05B63 EQU   X'10'                BYTE 6, BIT 3: RESERVED             10900000
AMS05B64 EQU   X'08'                BYTE 6, BIT 4: RESERVED             10950000
AMS05B65 EQU   X'04'                BYTE 6, BIT 5: RESERVED             11000000
AMS05B66 EQU   X'02'                BYTE 6, BIT 6: RESERVED             11050000
AMS05B67 EQU   X'01'                BYTE 6, BIT 7: RESERVED             11100000
*                                                                       11150000
AMS05DT7 DS    X                    BYTE 7 OF INDICATORS                11200000
AMS05B70 EQU   X'80'                BYTE 7, BIT 0: RESERVED             11250000
AMS05B71 EQU   X'40'                BYTE 7, BIT 1: RESERVED             11300000
AMS05B72 EQU   X'20'                BYTE 7, BIT 2: RESERVED             11350000
AMS05B73 EQU   X'10'                BYTE 7, BIT 3: RESERVED             11400000
AMS05B74 EQU   X'08'                BYTE 7, BIT 4: RESERVED             11450000
AMS05B75 EQU   X'04'                BYTE 7, BIT 5: RESERVED             11500000
AMS05B76 EQU   X'02'                BYTE 7, BIT 6: RESERVED             11550000
AMS05B77 EQU   X'01'                BYTE 7, BIT 7: RESERVED             11600000
*                                                                       11650000
*********************************************************************** 11700000
*** ISTAMS06 - maps the LU6.2 SUPPORT FUNCTION LIST vector.          ** 11750000
***          - The vector data is a variable-length string of byte   ** 11800000
***            indicators, each byte corresponding to a particular   ** 11850000
***            LU6.2 function.  Each byte will have a value showing  ** 11900000
***            that its corresponding function is either supported,  ** 11950000
***            not supported, or supported on a "pass-through" basis.** 12000000
***            (Pass-through functions are those which VTAM does not ** 12050000
***            directly provide but provides the ability for the     ** 12100000
***            application to create the support itself.)            ** 12150000
***            If the vector is not present or if the byte string    ** 12200000
***            is shorter than expected, you may assume that the     ** 12250000
***            missing bytes are zero and their corresponding        ** 12300000
***            functions are not supported.                          ** 12350000
***          - These indicator bytes correspond to the compile-time  ** 12400000
***            global indicators in the ISTGAPPC macro.              ** 12450000
*********************************************************************** 12500000
ISTAMS06 DSECT                      LU6.2 SUPPORT FUNCTION LIST VECTOR  12550000
AMS06LEN DS    X                    VECTOR LENGTH                       12600000
AMS06KEY DS    X                    VECTOR KEY                          12650000
AMS06KYC EQU   X'06'                KEY IS X'06'                        12700000
AMS06DTA DS    0X                   VECTOR DATA                         12750000
AMS06D01 DS    X                    01. CONVERSATIONS BETWEEN TPS       12800000
*                                       AT SAME LU                      12850000
AMS06D02 DS    X                    02. DELAYED SESSION                 12900000
*                                       ALLOCATION                      12950000
AMS06D03 DS    X                    03. IMMEDIATE SESSION               13000000
*                                       ALLOCATION                      13050000
AMS06D04 DS    X                    04. SYNC POINT SERVICES             13100000
AMS06D05 DS    X                    05. PROGRAM RECONNECT               13150000
AMS06D06 DS    X                    06. RESERVED                        13200000
AMS06D07 DS    X                    07. SESSION-LEVEL LU-LU             13250000
*                                       VERIFICATION                    13300000
AMS06D08 DS    X                    08. USERID VERIFICATION             13350000
AMS06D09 DS    X                    09. PROGRAM SUPPLIED USERID         13400000
*                                       AND PASSWORD                    13450000
AMS06D10 DS    X                    10. USERID AUTHORIZATION            13500000
AMS06D11 DS    X                    11. PROFILE VERIFICATION AND        13550000
*                                       AUTHORIZATION                   13600000
AMS06D12 DS    X                    12. RESERVED                        13650000
AMS06D13 DS    X                    13. PROFILE PASSTHROUGH             13700000
AMS06D14 DS    X                    14. PROGRAM-SUPPLIED PROFILE        13750000
AMS06D15 DS    X                    15. SEND PERSISTENT                 13800000
*                                       VERIFICATION                    13850000
AMS06D16 DS    X                    16. RECEIVE PERSISTENT              13900000
*                                       VERIFICATION                    13950000
AMS06D17 DS    X                    17. PIP DATA                        14000000
AMS06D18 DS    X                    18. LOGGING OF DATA IN SYSTEM       14050000
*                                       LOG                             14100000
AMS06D19 DS    X                    19. FLUSH LU SEND BUFFER            14150000
AMS06D20 DS    X                    20. LUW IDENTIFIER                  14200000
AMS06D21 DS    X                    21. PREPARE TO RECEIVE              14250000
AMS06D22 DS    X                    22. LONG LOCKS                      14300000
AMS06D23 DS    X                    23. POST ON RECEIPT WITH WAIT       14350000
AMS06D24 DS    X                    24. POST ON RECEIPT WITH TEST       14400000
*                                       FOR POSTING                     14450000
AMS06D25 DS    X                    25. RECEIVE-IMMEDIATE               14500000
AMS06D26 DS    X                    26. TEST FOR REQUEST-TO-SEND        14550000
*                                       RECEIVED                        14600000
AMS06D27 DS    X                    27. DATA MAPPING                    14650000
AMS06D28 DS    X                    28. FMH APPLICATION-DATA            14700000
AMS06D29 DS    X                    29. GET ATTRIBUTES                  14750000
AMS06D30 DS    X                    30. GET CONVERSATION-TYPE           14800000
AMS06D31 DS    X                    31. MAPPED CONVERSATION LU          14850000
*                                       SERVICES COMPONENT              14900000
AMS06D32 DS    X                    32. CHANGE_SESSION_LIMIT VERB       14950000
AMS06D33 DS    X                    33. MIN_CONWINNERS_TARGET           15000000
*                                       PARAMETER                       15050000
AMS06D34 DS    X                    34. RESPONSIBLE(TARGET)             15100000
*                                       PARAMETER                       15150000
AMS06D35 DS    X                    35. DRAIN_TARGET(NO) PARAMETER      15200000
AMS06D36 DS    X                    36. FORCE PARAMETER                 15250000
AMS06D37 DS    X                    37. ACTIVATE_SESSION VERB           15300000
AMS06D38 DS    X                    38. DEACTIVATE_SESSION VERB         15350000
AMS06D39 DS    X                    39. LU-PARAMETER VERBS              15400000
AMS06D40 DS    X                    40. LU-LU SESSION LIMIT             15450000
AMS06D41 DS    X                    41. LOCALLY-KNOWN LU NAMES          15500000
AMS06D42 DS    X                    42. UNINTERPRETED LU NAMES          15550000
AMS06D43 DS    X                    43. SINGLE-SESSION                  15600000
*                                       RE-INITIATION                   15650000
AMS06D44 DS    X                    44. ALTERNATE CODE PROCESSING       15700000
AMS06D45 DS    X                    45. MAXIMUM RU SIZE BOUNDS          15750000
AMS06D46 DS    X                    46. SESSION-LEVEL MANDATORY         15800000
*                                       CRYPTOGRAPHY                    15850000
AMS06D47 DS    X                    47. CONTENTION WINNER               15900000
*                                       AUTOMATIC ACTIVATION LIMIT      15950000
AMS06D48 DS    X                    48. CONWINNER SESSION               16000000
*                                       ALLOCATION                      16050000
AMS06D49 DS    X                    49. ENHANCED SECURITY (SAME)        16100000
AMS06D50 DS    X                    50. SESSION-LEVEL SELECTIVE         16150000
*                                       CRYPTOGRAPHY                    16200000
AMS06D51 DS    X                    51. CONVERSATION GROUP SUPPORT      16250000
AMS06D52 DS    X                    52. ALLOCATE WHEN SESSION FREE      16300000
AMS06D53 DS    X                    53. FULL-DUPLEX                     16350000
AMS06D54 DS    X                    54. APPCCMD VECTOR LISTS            16400000
AMS06D55 DS    X                    55. QUEUED RCVFMH5             @D1A 16410000
AMS06D56 DS    X                    56. HIGH PERFORMANCE DATA           16416600
*                                       TRANSFER                   @D3A 16423200
AMS06D57 DS    X                    57. APPCCMD SENDRCV            @D1A 16430000
AMS06D58 DS    X                    58. INTRA-LU CONVERSATIONS     @D4A 16440000
AMS06D59 DS    X                    59. PASSWORD SUBSTITUTION      @D5A 16443300
AMS06D60 DS    X                    60. EXTENDED SECURITY SENSE    @D5A 16446600
AMS06D61 DS    X                    61. DCE SECURITY SERVICES      @D6A 16448300
*                                                                       16450000
         MEND                                                        */ 16500000
*                                                                       16550000
*@LISTPOP;                          /* Begin PL/X mapping            */ 16600000
*/********************************************************************/ 16650000
*/* ISTAMSVL - maps the Resource Information Vector List header.     */ 16700000
*/*            The vector list contains information about the        */ 16750000
*/*            application program that opened an ACB at execution   */ 16800000
*/*            time.                                                 */ 16850000
*/********************************************************************/ 16900000
*  DCL                                                                  16950000
*    1 ISTAMSVL  BDY(BYTE) BASED,   /* RESOURCE INFORMATION VECTOR      17000000
*                                      LIST                          */ 17050000
*      2 AMSLLEN  FIXED(16) BDY(BYTE), /* TOTAL LENGTH OF VECTORS    */ 17100000
*      2 AMSLDATA CHAR(0);          /* VECTOR DATA                   */ 17150000
*                                                                       17200000
*/********************************************************************/ 17250000
*/*  GENERALIZED MAPPING FOR EXAMINING COMMON FIELDS IN ALL ACB      */ 17300000
*/*  VECTORS IN THE VECTOR LIST POINTED TO BY ACBAMSVL               */ 17350000
*/********************************************************************/ 17400000
*  DCL                                                                  17450000
*    1 ISTAMSVT  BDY(BYTE) BASED,   /* VECTOR FIELDS                 */ 17500000
*      2 AMSVTLEN       FIXED(8) BDY(BYTE), /* VECTOR LENGTH         */ 17550000
*      2 AMSVTKEY       CHAR(1),    /* VECTOR KEY                    */ 17600000
*      2 AMSVTDAT       CHAR(0);    /* VECTOR DATA                   */ 17650000
*                                                                       17700000
*                                                                       17750000
*/********************************************************************/ 17800000
*/* ISTAMS01 - maps the RELEASE LEVEL vector.                        */ 17850000
*/*          - Contains identification codes for the access method   */ 17900000
*/*            product and its version, release, and modification    */ 17950000
*/*            level.                                                */ 18000000
*/********************************************************************/ 18050000
*  DCL                                                                  18100000
*    1 ISTAMS01 BDY(BYTE) BASED,    /* RELEASE LEVEL VECTOR          */ 18150000
*      2 AMS01LEN FIXED(8),         /* VECTOR LENGTH                 */ 18200000
*      2 AMS01KEY BIT(8),           /* VECTOR KEY X'02'              */ 18250000
*      2 AMS01DTA CHAR(4),          /* VECTOR DATA                   */ 18300000
*        3 AMS01PRD CHAR(1),        /* PRODUCT CODE                  */ 18350000
*        3 AMS01VER CHAR(1),        /* VERSION CODE                  */ 18400000
*        3 AMS01REL CHAR(1),        /* RELEASE CODE                  */ 18450000
*        3 AMS01MDF CHAR(1);        /* MODIFICATION CODE             */ 18500000
*  DCL                                                                  18550000
*    AMS01KYC BIT(8) CONSTANT('01'X); /* AMS01KEY - X'01'            */ 18600000
*  DCL                                                                  18650000
*    AMS01VTM CHAR(1) CONSTANT('0');  /* VTAM PRODUCT CODE           */ 18700000
*                                                                       18750000
*/********************************************************************/ 18800000
*/* ISTAMS04 - maps the COMPONENT IDENTIFICATION vector.             */ 18850000
*/*          - This vector may be repeated.                          */ 18900000
*/*          - Each component identification vector contains product */ 18950000
*/*            identification information about a major component or */ 19000000
*/*            feature of the VTAM licensed program.  When multiple  */ 19050000
*/*            component identification vectors are present, the     */ 19100000
*/*            first one designates the base VTAM product and later  */ 19150000
*/*            vectors are features or other major VTAM components.  */ 19200000
*/*          - The vector data is in the form: C'xxxx-xxxxx-xxx'.    */ 19250000
*/********************************************************************/ 19300000
*  DCL                                                                  19350000
*    1 ISTAMS04 BDY(BYTE) BASED,    /* COMPONENT IDENTIFICATION         19400000
*                                      VECTOR                        */ 19450000
*      2 AMS04LEN FIXED(8),         /* VECTOR LENGTH                 */ 19500000
*      2 AMS04KEY BIT(8),           /* VECTOR KEY X'04'              */ 19550000
*      2 AMS04DTA CHAR(14);         /* VECTOR DATA                   */ 19600000
*  DCL                                                                  19650000
*    AMS04KYC BIT(8) CONSTANT('04'X); /* AMS01KEY - X'04'            */ 19700000
*                                                                       19750000
*/********************************************************************/ 19800000
*/* ISTAMS05 - maps the FUNCTION LIST vector.                        */ 19850000
*/*          - The vector data is a variable-length bit string, in   */ 19900000
*/*            which each bit corresponds to a particular VTAM       */ 19950000
*/*            function.  If a bit is on, the corresponding function */ 20000000
*/*            is present in the executing release of VTAM.  If a    */ 20050000
*/*            bit is off, the function is not available.  If the    */ 20100000
*/*            vector is not present or if the bit string is shorter */ 20150000
*/*            than expected, you may assume that the missing bits   */ 20200000
*/*            are zero and their corresponding functions are not    */ 20250000
*/*            available.                                            */ 20300000
*/*          - These indicator bits correspond to the compile-time   */ 20350000
*/*            global indicator bits in the ISTGLBAL macro.          */ 20400000
*/********************************************************************/ 20450000
*  DCL                                                                  20500000
*    1 ISTAMS05 BDY(BYTE) BASED,    /* FUNCTION LIST VECTOR          */ 20550000
*      2 AMS05LEN FIXED(8),         /* VECTOR LENGTH                 */ 20600000
*      2 AMS05KEY BIT(8),           /* VECTOR KEY X'05'              */ 20650000
*      2 AMS05DTA,                  /* VECTOR DATA                   */ 20700000
*        3 AMS05DT0 BIT(8),         /* INDICATOR BYTE 0              */ 20750000
*          4 AMS05B00 BIT(1),       /* NIB ENCR AND RPL CRYPT           20800000
*                                      (CRYPTOGRAPHY)                */ 20850000
*          4 AMS05B01 BIT(1),       /* ACB PARMS=NIB (COMMUNICATION     20900000
*                                      NETWORK                       */ 20950000
*          4 AMS05B02 BIT(1),       /* MULTIPLE-ADDRESS-SPACE           21000000
*                                      APPLICATIONS PROGRAMS         */ 21050000
*          4 AMS05B03 BIT(1),       /* AUTHORIZED PATH FOR              21100000
*                                      COMMUNICATIONS MACROS         */ 21150000
*          4 AMS05B04 BIT(1),       /* AUTHORIZED PATH FOR ALL          21200000
*                                      RPL-BASED MACROS              */ 21250000
*          4 AMS05B05 BIT(1),       /* SRBEXIT (ON APPL DEFINITION      21300000
*                                      STATEMENT)                    */ 21350000
*          4 AMS05B06 BIT(1),       /* SONSCIP (ON APPL DEFINITION      21400000
*                                      STATEMENT)                    */ 21450000
*          4 AMS05B07 BIT(1),       /* VTAMFRR (ON APPL DEFINITION      21500000
*                                      STATEMENT)                    */ 21550000
*        3 AMS05DT1 BIT(8),         /* INDICATOR BYTE 1              */ 21600000
*          4 AMS05B10 BIT(1),       /* SSCP TRACKING OF DEVICE-LU       21650000
*                                      SESSION CAPABILITY            */ 21700000
*          4 AMS05B11 BIT(1),       /* RPL OPTCD=LMPEO               */ 21750000
*          4 AMS05B12 BIT(1),       /* RPL OPTCD=BUFFLST             */ 21800000
*          4 AMS05B13 BIT(1),       /* RPL OPTCD=USERRH              */ 21850000
*          4 AMS05B14 BIT(1),       /* ACB PARMS=USERFLD             */ 21900000
*          4 AMS05B15 BIT(1),       /* RPL BRACKET=CEB               */ 21950000
*          4 AMS05B16 BIT(1),       /* APPLICATION PROGRAM ASSIGNMENT   22000000
*                                      OF SEQUENCE                   */ 22050000
*          4 AMS05B17 BIT(1),       /* RESOURCE-IDENTIFICATION VECTOR   22100000
*                                      LIST                          */ 22150000
*        3 AMS05DT2 BIT(8),         /* INDICATOR BYTE 2              */ 22200000
*          4 AMS05B20 BIT(1),       /* ACCESS-METHOD-SUPPORT VECTOR     22250000
*                                      LIST                          */ 22300000
*          4 AMS05B21 BIT(1),       /* RETURN OF SYSTEM RESPONSE BYTE   22350000
*                                      AND EXTENDED                  */ 22400000
*          4 AMS05B22 BIT(1),       /* INTRPRET                      */ 22450000
*          4 AMS05B23 BIT(1),       /* VTAM API IS XRF CAPABLE       */ 22500000
*          4 AMS05B24 BIT(1),       /* SENSE ON -RSP(CINIT). CLSDST  */ 22550000
*          4 AMS05B25 BIT(1),       /* UNBIND SON CODE AND SENSE.    */ 22600000
*          4 AMS05B26 BIT(1),       /* HOLD/RELEASE LOGON/SCIP EXIT     22650000
*                                      FOR SESSION                   */ 22700000
*          4 AMS05B27 BIT(1),       /* CINIT - NETWORK ADDRESSES IN     22750000
*                                      VECTOR KEY X'15'              */ 22800000
*        3 AMS05DT3 BIT(8),         /* INDICATOR BYTE 3              */ 22850000
*          4 AMS05B30 BIT(1),       /* 31-BIT API                    */ 22900000
*          4 AMS05B31 BIT(1),       /* NOTIFICATION OF QUEUED           22950000
*                                      RESPONSES IS SUPPORTED        */ 23000000
*          4 AMS05B32 BIT(1),       /* APPC IS SUPPORTED             */ 23050000
*          4 AMS05B33 BIT(1),       /* ADD SUPPORT FOR USERVAR       */ 23100000
*          4 AMS05B34 BIT(1),       /* VCNS API SUPPORT FOR X.25     */ 23150000
*          4 AMS05B35 BIT(1),       /* VCNS API SUPPORT FOR TOKEN       23200000
*                                      BUS, TOKEN RING,              */ 23250000
*          4 AMS05B36 BIT(1),       /* CROSS-MEMORY API IS SUPPORTED */ 23300000
*          4 AMS05B37 BIT(1),       /* KEEPFRR SUPPORT                  23350000
*                                      (ON ACB STATEMENT)            */ 23400000
*        3 AMS05DT4 BIT(8),         /* INDICATOR BYTE 4              */ 23450000
*          4 AMS05B40 BIT(1),       /* SRBEXIT SUPPORT                  23500000
*                                      (ON ACB STATEMENT)            */ 23550000
*          4 AMS05B41 BIT(1),       /* PERSISTENT LU-LU SESSIONS     */ 23600000
*          4 AMS05B42 BIT(1),       /* V.25BIS SUPPORT               */ 23650000
*          4 AMS05B43 BIT(1),       /* VTAM/NPM INTERFACE SUPPORT    */ 23700000
*          4 AMS05B44 BIT(1),       /* LU6 PLUS TRACKING SUPPORTED   */ 23750000
*          4 AMS05B45 BIT(1),       /* EXITFRR SUPPORT                  23783300
*                                      (ON ACB STATEMENT)        @N1C*/ 23816600
*          4 AMS05B46 BIT(1),       /* BYTE 4, BIT 6: RESERVED       */ 23850000
*          4 AMS05B47 BIT(1),       /* NETWORK QUALIFIED NAMES          23900000
*                                      SUPPORTED                     */ 23950000
*        3 AMS05DT5 BIT(8),         /* INDICATOR BYTE 5              */ 24000000
*          4 AMS05B50 BIT(1),       /* MS TRANSPORT SUPPORTED        */ 24050000
*          4 AMS05B51 BIT(1),       /* PERFORMANCE MONITOR INTERFACE    24100000
*                                      SUPPORTED                     */ 24150000
*          4 AMS05B52 BIT(1),       /* QUEUED SESSION TERMINATION       24200000
*                                      SUPPPORTED                    */ 24250000
*          4 AMS05B53 BIT(1),       /* VTAM AGENT SUPPORTED          */ 24300000
*          4 AMS05B54 BIT(1),       /* GENERIC RESOURCES SUPPORTED   */ 24350000
*          4 AMS05B55 BIT(1),       /* OPTCD=KEEPSRB FOR SYNC SRB       24400000
*                                      SUSPEND/RESUME                */ 24450000
*          4 AMS05B56 BIT(1),       /* APPLICATION VECTORS SUPPORTED    24500000
*                                      ON ACB MACRO                  */ 24550000
*          4 AMS05B57 BIT(1),       /* SETLOGON GNAMESUB SUPPORTED      24583300
*                                                                @D2C*/ 24616600
*        3 AMS05DT6 BIT(8),         /* INDICATOR BYTE 6              */ 24650000
*          4 AMS05B60 BIT(1),       /* BYTE 6, BIT 0: RESERVED       */ 24700000
*          4 AMS05B61 BIT(1),       /* BYTE 6, BIT 1: RESERVED       */ 24750000
*          4 AMS05B62 BIT(1),       /* BYTE 6, BIT 2: RESERVED       */ 24800000
*          4 AMS05B63 BIT(1),       /* BYTE 6, BIT 3: RESERVED       */ 24850000
*          4 AMS05B64 BIT(1),       /* BYTE 6, BIT 4: RESERVED       */ 24900000
*          4 AMS05B65 BIT(1),       /* BYTE 6, BIT 5: RESERVED       */ 24950000
*          4 AMS05B66 BIT(1),       /* BYTE 6, BIT 6: RESERVED       */ 25000000
*          4 AMS05B67 BIT(1),       /* BYTE 6, BIT 7: RESERVED       */ 25050000
*        3 AMS05DT7 BIT(8),         /* INDICATOR BYTE 7              */ 25100000
*          4 AMS05B70 BIT(1),       /* BYTE 7, BIT 0: RESERVED       */ 25150000
*          4 AMS05B71 BIT(1),       /* BYTE 7, BIT 1: RESERVED       */ 25200000
*          4 AMS05B72 BIT(1),       /* BYTE 7, BIT 2: RESERVED       */ 25250000
*          4 AMS05B73 BIT(1),       /* BYTE 7, BIT 3: RESERVED       */ 25300000
*          4 AMS05B74 BIT(1),       /* BYTE 7, BIT 4: RESERVED       */ 25350000
*          4 AMS05B75 BIT(1),       /* BYTE 7, BIT 5: RESERVED       */ 25400000
*          4 AMS05B76 BIT(1),       /* BYTE 7, BIT 6: RESERVED       */ 25450000
*          4 AMS05B77 BIT(1),       /* BYTE 7, BIT 7: RESERVED       */ 25500000
*      2 *        CHAR(0);          /* End of function list vector   */ 25550000
*  DCL                                                                  25600000
*    AMS05KYC BIT(8) CONSTANT('05'X); /* AMS05KEY - X'05'            */ 25650000
*                                                                       25700000
*/********************************************************************/ 25750000
*/* ISTAMS06 - maps the LU6.2 SUPPORT FUNCTION LIST vector.          */ 25800000
*/*          - The vector data is a variable-length string of byte   */ 25850000
*/*            indicators, each byte corresponding to a particular   */ 25900000
*/*            LU6.2 function.  Each byte will have a value showing  */ 25950000
*/*            that its corresponding function is either supported,  */ 26000000
*/*            not supported, or supported on a "pass-through" basis.*/ 26050000
*/*            (Pass-through functions are those which VTAM does not */ 26100000
*/*            directly provide but provides the ability for the     */ 26150000
*/*            application to create the support itself.)            */ 26200000
*/*            If the vector is not present or if the byte string    */ 26250000
*/*            is shorter than expected, you may assume that the     */ 26300000
*/*            missing bytes are zero and their corresponding        */ 26350000
*/*            functions are not supported.                          */ 26400000
*/*          - These indicator bytes correspond to the compile-time  */ 26450000
*/*            global indicators in the ISTGAPPC macro.              */ 26500000
*/********************************************************************/ 26550000
*  DCL                                                                  26600000
*    1 ISTAMS06 BDY(BYTE) BASED,    /* LU6.2 SUPPORT FUNCTION LIST      26650000
*                                      VECTOR                        */ 26700000
*      2 AMS06LEN FIXED(8),         /* VECTOR LENGTH                 */ 26750000
*      2 AMS06KEY BIT(8),           /* VECTOR KEY X'06'              */ 26800000
*      2 AMS06DTA,                  /* VECTOR DATA                   */ 26850000
*        3 AMS06D01 FIXED(8),       /* 01. CONVERSATIONS BETWEEN TPS    26900000
*                                          AT SAME LU                */ 26950000
*        3 AMS06D02 FIXED(8),       /* 02. DELAYED SESSION              27000000
*                                          ALLOCATION                */ 27050000
*        3 AMS06D03 FIXED(8),       /* 03. IMMEDIATE SESSION            27100000
*                                          ALLOCATION                */ 27150000
*        3 AMS06D04 FIXED(8),       /* 04. SYNC POINT SERVICES       */ 27200000
*        3 AMS06D05 FIXED(8),       /* 05. PROGRAM RECONNECT         */ 27250000
*        3 AMS06D06 FIXED(8),       /* 06. RESERVED                  */ 27300000
*        3 AMS06D07 FIXED(8),       /* 07. SESSION-LEVEL LU-LU          27350000
*                                          VERIFICATION              */ 27400000
*        3 AMS06D08 FIXED(8),       /* 08. USERID VERIFICATION       */ 27450000
*        3 AMS06D09 FIXED(8),       /* 09. PROGRAM SUPPLIED USERID      27500000
*                                          AND PASSWORD              */ 27550000
*        3 AMS06D10 FIXED(8),       /* 10. USERID AUTHORIZATION      */ 27600000
*        3 AMS06D11 FIXED(8),       /* 11. PROFILE VERIFICATION AND     27650000
*                                          AUTHORIZATION             */ 27700000
*        3 AMS06D12 FIXED(8),       /* 12. RESERVED                  */ 27750000
*        3 AMS06D13 FIXED(8),       /* 13. PROFILE PASSTHROUGH       */ 27800000
*        3 AMS06D14 FIXED(8),       /* 14. PROGRAM-SUPPLIED PROFILE  */ 27850000
*        3 AMS06D15 FIXED(8),       /* 15. SEND PERSISTENT              27900000
*                                          VERIFICATION              */ 27950000
*        3 AMS06D16 FIXED(8),       /* 16. RECEIVE PERSISTENT           28000000
*                                          VERIFICATION              */ 28050000
*        3 AMS06D17 FIXED(8),       /* 17. PIP DATA                  */ 28100000
*        3 AMS06D18 FIXED(8),       /* 18. LOGGING OF DATA IN SYSTEM    28150000
*                                          LOG                       */ 28200000
*        3 AMS06D19 FIXED(8),       /* 19. FLUSH LU SEND BUFFER      */ 28250000
*        3 AMS06D20 FIXED(8),       /* 20. LUW IDENTIFIER            */ 28300000
*        3 AMS06D21 FIXED(8),       /* 21. PREPARE TO RECEIVE        */ 28350000
*        3 AMS06D22 FIXED(8),       /* 22. LONG LOCKS                */ 28400000
*        3 AMS06D23 FIXED(8),       /* 23. POST ON RECEIPT WITH WAIT */ 28450000
*        3 AMS06D24 FIXED(8),       /* 24. POST ON RECEIPT WITH TEST    28500000
*                                          FOR POSTING               */ 28550000
*        3 AMS06D25 FIXED(8),       /* 25. RECEIVE-IMMEDIATE         */ 28600000
*        3 AMS06D26 FIXED(8),       /* 26. TEST FOR REQUEST-TO-SEND     28650000
*                                          RECEIVED                  */ 28700000
*        3 AMS06D27 FIXED(8),       /* 27. DATA MAPPING              */ 28750000
*        3 AMS06D28 FIXED(8),       /* 28. FMH APPLICATION-DATA      */ 28800000
*        3 AMS06D29 FIXED(8),       /* 29. GET ATTRIBUTES            */ 28850000
*        3 AMS06D30 FIXED(8),       /* 30. GET CONVERSATION-TYPE     */ 28900000
*        3 AMS06D31 FIXED(8),       /* 31. MAPPED CONVERSATION LU       28950000
*                                          SERVICES COMPONENT        */ 29000000
*        3 AMS06D32 FIXED(8),       /* 32. CHANGE_SESSION_LIMIT VERB */ 29050000
*        3 AMS06D33 FIXED(8),       /* 33. MIN_CONWINNERS_TARGET        29100000
*                                          PARAMETER                 */ 29150000
*        3 AMS06D34 FIXED(8),       /* 34. RESPONSIBLE(TARGET)          29200000
*                                          PARAMETER                 */ 29250000
*        3 AMS06D35 FIXED(8),       /* 35. DRAIN_TARGET(NO) PARAMETER*/ 29300000
*        3 AMS06D36 FIXED(8),       /* 36. FORCE PARAMETER           */ 29350000
*        3 AMS06D37 FIXED(8),       /* 37. ACTIVATE_SESSION VERB     */ 29400000
*        3 AMS06D38 FIXED(8),       /* 38. DEACTIVATE_SESSION VERB   */ 29450000
*        3 AMS06D39 FIXED(8),       /* 39. LU-PARAMETER VERBS        */ 29500000
*        3 AMS06D40 FIXED(8),       /* 40. LU-LU SESSION LIMIT       */ 29550000
*        3 AMS06D41 FIXED(8),       /* 41. LOCALLY-KNOWN LU NAMES    */ 29600000
*        3 AMS06D42 FIXED(8),       /* 42. UNINTERPRETED LU NAMES    */ 29650000
*        3 AMS06D43 FIXED(8),       /* 43. SINGLE-SESSION               29700000
*                                          RE-INITIATION             */ 29750000
*        3 AMS06D44 FIXED(8),       /* 44. ALTERNATE CODE PROCESSING */ 29800000
*        3 AMS06D45 FIXED(8),       /* 45. MAXIMUM RU SIZE BOUNDS    */ 29850000
*        3 AMS06D46 FIXED(8),       /* 46. SESSION-LEVEL MANDATORY      29900000
*                                          CRYPTOGRAPHY              */ 29950000
*        3 AMS06D47 FIXED(8),       /* 47. CONTENTION WINNER            30000000
*                                          AUTOMATIC ACTIVATION LIMIT*/ 30050000
*        3 AMS06D48 FIXED(8),       /* 48. CONWINNER SESSION            30100000
*                                          ALLOCATION                */ 30150000
*        3 AMS06D49 FIXED(8),       /* 49. ENHANCED SECURITY (SAME)  */ 30200000
*        3 AMS06D50 FIXED(8),       /* 50. SESSION-LEVEL SELECTIVE      30250000
*                                          CRYPTOGRAPHY              */ 30300000
*        3 AMS06D51 FIXED(8),       /* 51. CONVERSATION GROUP SUPPORT*/ 30350000
*        3 AMS06D52 FIXED(8),       /* 52. ALLOCATE WHEN SESSION FREE*/ 30400000
*        3 AMS06D53 FIXED(8),       /* 53. FULL-DUPLEX               */ 30450000
*        3 AMS06D54 FIXED(8),       /* 54. APPCCMD VECTOR LISTS      */ 30500000
*        3 AMS06D55 FIXED(8),       /* 55. QUEUED RCVFMH5        @D1A*/ 30512500
*        3 AMS06D56 FIXED(8),       /* 56. HIGH PERFORMANCE DATA        30519700
*                                          TRANSFER              @D3A*/ 30526900
*        3 AMS06D57 FIXED(8),       /* 57. APPCCMD SENDRCV       @D1A*/ 30534300
*        3 AMS06D58 FIXED(8),       /* 58. INTRA-LU CONVERSATIONS       30539500
                                                                 @D4A*/ 30544700
*        3 AMS06D59 FIXED(8),       /* 59. PASSWORD SUBSTITUTION @D5A*/ 30546000
*        3 AMS06D60 FIXED(8),       /* 60. EXTENDED SECURITY            30547300
                                           SENSE                 @D5A*/ 30548600
*        3 AMS06D61 FIXED(8),       /* 61. DCE SECURITY SERVICES @D6A*/ 30549300
*      2 *        CHAR(0);          /* End of function list vector   */ 30550000
*  DCL                                                                  30600000
*    AMS06KYC BIT(8) CONSTANT('06'X); /* AMS06KEY - X'06'            */ 30650000
*                                                                       30700000
*  /* Support level constants used with each function indicator byte */ 30750000
*  DCL                                                                  30800000
*    AMS06NSP FIXED(8) CONSTANT(0), /* FUNCTION IS NOT SUPPORTED     */ 30850000
*    AMS06SPT FIXED(8) CONSTANT(1), /* FUNCTION IS SUPPORTED         */ 30900000
*    AMS06PTH FIXED(8) CONSTANT(2); /* FUNCTION SUPPORTED AS A          30950000
*                                      PASS-THROUGH FUNCTION         */ 31000000
