         MACRO                                                          00050000
         ISTDPOHD                                                       00100000
*        COPYRIGHT = LICENSED MATERIALS - PROPERTY OF IBM               00101100
*                                                                       00102200
*                    "RESTRICTED MATERIALS OF IBM"                      00103300
*                                                                       00104400
*                    5695-117                                           00105500
*                                                                       00106600
*                    (C) COPYRIGHT IBM CORP. 1979                       00107700
*                                                                       00108800
*   PROGRAM OPERATOR MESSAGE HEADER                                     00110000
*                                                                       00114000
ISTDPOHD DSECT                                                          00130000
POHRSVD  DS    CL1                 RESERVED                             00150000
POHSTAT  DS    CL1                 HEADER STATUS BITS                   00200000
POHEND   EQU   X'80'               END LINE 1=YES                       00210000
POHDATA  EQU   X'40'               DATA LINE 1=YES                      00220000
POHLBL   EQU   X'20'               LABEL LINE 1=YES                     00230000
POHCNTRL EQU   X'10'               CONTROL LINE 1=YES                   00240000
POHPPSOL EQU   X'08'               MESSAGE CONTAINS COPY OF VTAM        00240300
*                                  SOLICITED, UNSUPPRESSED MESSAGE      00240600
*                                  THAT HAD BEEN SENT TO THE SYSTEM     00240900
*                                  CONSOLE                              00241200
POHPPCMD EQU   X'04'               MESSAGE CONTAINS COPY OF VTAM        00241500
*                                  OPERATOR COMMAND THAT HAD BEEN       00241800
*                                  ENTERED FROM THE SYSTEM CONSOLE      00242100
POHPPSUP EQU   X'0C'               MESSAGE CONTAINS COPY OF VTAM        00242400
*                                  SOLICITED, SUPPRESSED MESSAGE        00242700
*                                  THAT HAD BEEN SENT TO THE SYSTEM     00243000
*                                  CONSOLE                              00243300
POHRREQ  EQU   X'02'               REPLY REQUESTED 1=YES                00244000
POHGEN   EQU   X'01'               ID ORIGIN  0=GENERATED BY VTAM       00246000
*                                             1=GENERATED BY POA        00248000
POHID    DS    CL2                 MESSAGE IDENTIFIER                   00250000
         MEND                                                           00300000
