         MACRO                                                          00050000
         ISTDBIND                                                       00100000
.* /******************************************************************/ 00150000
.* /*  START OF SPECIFICATIONS                                       */ 00200000
.* /******************************************************************/ 00250000
.* /*                                                                */ 00300000
.* /*  MACRO-NAME: ISTDBIND                                          */ 00350000
.* /*                                                                */ 00400000
.* /*  MACRO-DESCRIPTIVE-NAME: VTAM BIND RU SESSION PARAMETERS       */ 00450000
.* /*                          AND/OR DATA AREA MAPPING MACRO        */ 00500000
.* /*                                                                */ 00550000
.* /*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM               */ 00600000
.* /*                                                                */ 00650000
.* /*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"*/ 00700000
.* /*                                                                */ 00750000
.* /*             5655-127 (C) COPYRIGHT IBM CORP. 1989, 1996.   @D2C*/ 00800000
.* /*             ALL RIGHTS RESERVED.                               */ 00850000
.* /*                                                                */ 00900000
.* /*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -          */ 00950000
.* /*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY       */ 01000000
.* /*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.           */ 01050000
.* /*                                                                */ 01100000
.* /*             SEE COPYRIGHT INSTRUCTIONS.                        */ 01150000
.* /*                                                                */ 01200000
.* /*  MACRO-FUNCTION: TO PROVIDE A VTAM BAL MAPPING FOR THE         */ 01350000
.* /*                  VTAM BIND RU SESSION PARAMETERS AND/OR        */ 01400000
.* /*                  DATA AREA                                     */ 01450000
.* /*                                                                */ 01500000
.* /*  MACRO-FORMAT: AS FOLLOWS                                      */ 01550000
.* /*                                                                */ 01600000
.* /*        ISTDBIND                                                */ 01650000
.* /*                                                                */ 01700000
.* /*  MACRO-NOTES: (1) FOR EXTERNAL USE                             */ 01750000
.* /*               (2) NO PARAMETERS, EITHER POSITIONAL OR          */ 01800000
.* /*                   KEYWORD, ARE REQUIRED                        */ 01850000
.* /*                                                                */ 01900000
.* /*    REQUIRED-INNER-MACROS: NONE                                 */ 01950000
.* /*                                                                */ 02000000
.* /*    REQUIRED-INNER-MAPS: NONE                                   */ 02050000
.* /*                                                                */ 02100000
.* /*  MACRO-RESTRICTIONS: NONE                                      */ 02150000
.* /*                                                                */ 02200000
.* /*  MACRO-DEPENDENCIES: NONE                                      */ 02250000
.* /*                                                                */ 02300000
.* /*  MACRO-TYPE: EXTERNAL                                          */ 02350000
.* /*                                                                */ 02400000
.* /*    SOURCE-LANGUAGE: BAL                                        */ 02450000
.* /*                                                                */ 02500000
.* /*  MACRO-INPUT:                                                  */ 02550000
.* /*                                                                */ 02600000
.* /*    MACRO-GENERATION-TIME: SEE MACRO FORMAT                     */ 02650000
.* /*                                                                */ 02700000
.* /*    CODE-EXECUTION-TIME: NOT APPLICABLE                         */ 02750000
.* /*                                                                */ 02800000
.* /*  MACRO-OUTPUT:                                                 */ 02850000
.* /*                                                                */ 02900000
.* /*    MACRO-GENERATION-TIME: A DSECT DESCRIBING THE BIND RU       */ 02950000
.* /*                           SESSION PARAMETERS AND/OR DATA       */ 03000000
.* /*                           AREA                                 */ 03050000
.* /*                                                                */ 03100000
.* /*    CODE-EXECUTION-TIME: NOT APPLICABLE                         */ 03150000
.* /*                                                                */ 03200000
.* /*  MACRO-EXTERNAL-REFERENCES: NONE                               */ 03250000
.* /*                                                                */ 03300000
.* /*  MACRO-MESSAGES-ISSUED: NONE                                   */ 03350000
.* /*                                                                */ 03400000
.* /*  MACRO-TABLES: NONE                                            */ 03450000
.* /*                                                                */ 03500000
.* /*  MACRO-DATE-CREATED: NOTKNOWN                                  */ 03550000
.* /*                                                                */ 03600000
.* /*  MACRO-LAST-CHANGED: AS FOLLOWS                                */ 03650000
.* /*        01 - 10/12/77 - SNA4 FOR D4490.02               @D14AKBL*/ 03700000
.* /*        02 - 10/21/77 - ADDED SUPPORT FOR BINFMS2C      @DM30817*/ 03750000
.* /*        03 - 11/03/77 - ADDED LU TYPE-4 SUPPORT                 */ 03800000
.* /*                              FOR D4495.00              @G35AKMP*/ 03850000
.* /*        04 - 01/15/78 - ADDED NEGOTIABLE BIND SUPPORT           */ 03900000
.* /*                              FOR D4491.00              @D14AKMP*/ 03950000
.* /*        05 - 03/07/78 - ADDED 2-STAGE PACING SUPPORT            */ 04000000
.* /*                              FOR D4502.05              @D14AKMC*/ 04050000
.* /*        06 - 07/27/78 - D4574.00                        @D14AKMC*/ 04100000
.* /*        07 - 04/25/80 - APAR OZ45868                    @ZA45868*/ 04150000
.* /*        08 - 07/06/81 - DCR 4820.01                     @R482001*/ 04200000
.* /*        09 - 02/17/83 - CONTROL VECTOR SUPPORT          @R489301*/ 04250000
.* /*        10 - 07/03/85 - DCR 5000.02 LEN                 @R500002*/ 04300000
.* /*        11 - 06/19/85 - DCR 4963.08 DATA AREA REWORK    @R496308*/ 04350000
.* /*        12 - 12/09/85 - PTM P027136                     @P027136*/ 04400000
.* /*        13 - 11/25/85 - DCR 5000.11 LEN                 @R500011*/ 04450000
.* /*        14 - 06/25/86 - VM/VTAM 3.2                     @R505701*/ 04500000
.* /*        15 - 06/04/87 - PTM P047462                     @P047462*/ 04550000
.* /*        16 - 08/28/87 - PTM P047746                     @P047746*/ 04600000
.* /*        17 - 09/08/87 - PTM P050200                     @P050200*/ 04650000
.* /*        18 - 12/09/87 - PTM P052442                     @P052442*/ 04700000
.* /*        19 - 01/05/88 - PTM P052802                     @P052802*/ 04750000
.* /*                                                                */ 04800000
.* /* $MAC(ISTDBIND),COMP(API),PROD(VTAM): USER COPY OF VTAM BIND    */ 04850000
.* /*                                                                */ 04900000
.* /* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS          */ 04950000
.* /* ---- -------- ------- ------ ------  ------------------------- */ 05000000
.* /* $F1= FB3@@CLD HVT3303 880321 013298: PARTNER LU VERIFICATION   */ 05050000
.* /* $F2= FS1@@CLD HVT3303 880714 255471: SYNCPOINT SUPPORT         */ 05100000
.* /* $B1= AV@@@AMS HVT3401 890421 577378: PERSISTENT VERIFICATION   */ 05150000
.* /* $BB= ACC@@AMS HVT3401 891025 615520: PL/AS CONVERSION          */ 05200000
.* /* $B2= A4@@@CLD HVT3401 900419 617408: LU6.2 LIMITED RESOURCE    */ 05250000
.* /* $V2= P087615  HVT3401 900914 879315: DELETE BLANK LINES        */ 05300000
.* /* $X1= P095217  HVT3411 910402 797350: DATA COMPRESSION          */ 05350000
.* /* $KF= SZSDR001 BINDSEC 920414 577408: BIND SECURITY ENHANCEMENT */ 05400000
.* /* $L1= KA@@@PLD APPCRR  930922 576146: DCE Security Services     */ 05450000
.* /* $21= OW03255  EMERALD 940610 631036: SNS1001, RH ONLY SENT     */ 05500000
.* /*                                      WHEN MAXRU IS 64K         */ 05550000
.* /* $D1= IB@@@MST PWSUB   950509 941213: Password substitution     */ 05575000
.* /* $D2= IE@@@MST V44DCE  951110 349121: DCE Security Services     */ 05587500
.* /*                                                                */ 05600000
.* /******************************************************************/ 05650000
.* /*  END OF SPECIFICATIONS                                         */ 05700000
.* /******************************************************************/ 05750000
.* /*                                                                */ 05800000
.* /*A-000000-999999                                         @D14AKBL*/ 05850000
.* /*                                                                */ 05900000
* VTAM - ISTDBIND - ACF VTAM VERSION 4 RELEASE 1                        05950000
*                                                                       06000000
ISTDBIND DSECT                                                          06050000
BINFMTY  DS    C                   BIND FORMAT AND TYPE                 06100000
BINFMT   EQU   X'F0'               BIND FORMAT                          06150000
*    VALUES FOR BINFMT (FORMAT)                              @G35AKMP   06200000
BINFMT0  EQU   X'00'               FORMAT 0                  @G35AKMP   06250000
BINTYPE  EQU   X'0F'               BIND TYPE                            06300000
*    VALUES FOR BINTYPE (TYPE)                               @G35AKMP   06350000
BINNEGO  EQU   X'00'               NEGOTIABLE                @G35AKNL   06400000
BINONEGO EQU   X'01'               NON NEGOTIABLE            @G35AKNL   06450000
BINCOLD  EQU   X'01'               NON NEGOTIABLE            @G35AKMP   06500000
BINFM    DS    C                   FUNCTION MANAGEMENT                  06550000
*                                  PROFILE                              06600000
*    VALUES FOR BINFM - FUNCTION MANAGEMENT PROFILE                     06650000
BINFM19  EQU   X'13'               FM PROFILE 19             @R500011   06700000
BINTS    DS    C                   TRANSMISSION SERVICES                06750000
*                                  PROFILE                              06800000
*    VALUES FOR BINTS (TRANSMISSION SERVICES PROFILE)        @G35AKMP   06850000
BINTS7   EQU   X'07'               SEQ NOS - NO RESET STATE  @G35AKMP   06900000
BINTS4   EQU   X'04'               SEQ NOS - RESET STATE     @G35AKMP   06950000
BINTS3   EQU   X'03'               SEQ NOS - RESET STATE     @G35AKMP   07000000
BINTS2   EQU   X'02'               SEQ NOS - NO RESET STATE  @G35AKMP   07050000
BINTS1   EQU   X'01'               NOT VALID ON LU-LU SESSION           07100000
BINTS0   EQU   X'00'               NOT VALID ON LU-LU SESSION           07150000
BINPRIP  DS    C                   PRIMARY LU PROTOCOLS FOR             07200000
*                                  SENDING FM DATA           @G35AKNL   07250000
BINPCHN  EQU   X'80'               1 = MULTIPLE RU CHAINS               07300000
*                                  0 = SINGLE RU CHAINS                 07350000
BINPMCH  EQU   X'40'               1 = MULTIPLE OUTSTANDING             07400000
*                                      CHAINS (DELAYED                  07450000
*                                      REQUEST MODE)                    07500000
*                                  0 = SINGLE OUTSTANDING               07550000
*                                      CHAIN (IMMEDIATE                 07600000
*                                      REQUEST MODE)                    07650000
BINPCHNR EQU   X'30'               CHAIN RESPONSE PROTOCOL(SEE          07700000
*                                  BINSCHNR BELOW FOR VALUES)           07750000
BINRSV01 EQU   X'0C'               RESERVED                             07800000
BINPCMP  EQU   X'02'               1 = COMPRESSION MAY BE               07850000
*                                      USED                             07900000
*                                  0 = COMPRESSION MUST NOT             07950000
*                                      BE USED                          08000000
BINPSEB  EQU   X'01'               1 = PRIMARY MAY SEND EB              08050000
*                                  0 = PRIMARY WILL NOT                 08100000
*                                      SEND EB                          08150000
BINSECP  DS    C                   SECONDARY LU PROTOCOLS FOR           08200000
*                                  SENDING FM DATA                      08250000
BINSCHN  EQU   X'80'               1 = MULTIPLE RU CHAINS               08300000
*                                  0 = SINGLE RU CHAIN                  08350000
BINSMCH  EQU   X'40'               1 = MULTIPLE OUTSTANDING             08400000
*                                      CHAINS (DELAYED                  08450000
*                                      REQUEST MODE)                    08500000
*                                  0 = SINGLE OUTSTANDING               08550000
*                                      CHAIN (IMMEDIATE                 08600000
*                                      REQUEST MODE)                    08650000
BINSCHNR EQU   X'30'               CHAIN RESPONSE PROTOCOLS             08700000
*********************************************************************   08750000
*    VALUES FOR BINPCHNR/BINSCHNR (TYPE OF RESPONSES ASKED   @G35AKNL   08800000
*    FOR BY REQUESTS FROM PRIMARY/SECONDARY)                 @G35AKNL   08850000
*********************************************************************   08900000
BINNYRSP EQU   X'30'               DEFINITE OR EXCEPTION                08950000
*                                  RESPONSE                  @G35AKMP   09000000
BINDFRSP EQU   X'20'               DEFINITE RESPONSE         @G35AKMP   09050000
BINEXRSP EQU   X'10'               EXCEPTION RESPONSE        @G35AKMP   09100000
BINNORSP EQU   X'00'               NO RESPONSE               @G35AKMP   09150000
BINRSV02 EQU   X'0C'               RESERVED                  @G35AKMP   09200000
BINSCMP  EQU   X'02'               1 = COMPRESSION MAY BE               09250000
*                                      USED                             09300000
*                                  0 = COMPRESSION MUST NOT             09350000
*                                      BE USED               @G35AKMP   09400000
BINSSEB  EQU   X'01'               1 = SECONDARY MAY SEND EB            09450000
*                                  0 = SECONDARY WILL NOT               09500000
*                                      SEND EB               @G35AKMP   09550000
BINCMNP  DS    C                   COMMON LU PROTOCOLS                  09600000
BINWBREQ EQU   X'80'               WHOLE-BINS-REQUIRED INDICATOR        09650000
*                                                            @R500002   09700000
BINFMHD  EQU   X'40'               1 = FM HEADERS MAY                   09750000
*                                      BE USED                          09800000
*                                  0 = FM HEADERS MUST NOT              09850000
*                                      BE USED                          09900000
BINBRAK  EQU   X'20'               1 = BRACKETS WILL BE USED            09950000
*                                      AND RESET STATE IS               10000000
*                                      BETWEEN-BRACKETS      @G35AKNL   10050000
*                                  0 = BRACKETS WILL NOT                10100000
*                                      BE USED OR,IF USED,              10150000
*                                      RESET STATE IS IN-               10200000
*                                      BRACKETS              @G35AKNL   10250000
BINBKTR  EQU   X'10'               1 = CONDITIONAL BRACKETS             10300000
*                                      TERMINATION                      10350000
*                                  0 = UNCONDITIONAL BRACKETS           10400000
*                                      TERMINATION                      10450000
BINALT   EQU   X'08'               1 = ALTERNATE CODE MAY               10500000
*                                      BE USED                          10550000
*                                  0 = ALTERNATE CODE MUST              10600000
*                                      NOT BE USED                      10650000
BINRSV04 EQU   X'06'               RESERVED                  @R500002   10700000
BINQUE   EQU   X'01'               BIND-QUEUEING INDICATOR   @R500002   10750000
BINCMNP2 DS    C                   COMMON LU PROTOCOLS                  10800000
BINFMTRM EQU   X'C0'               SEND/RECEIVE MODE                    10850000
*    VALUES FOR BINFMTRM                                     @G35AKMP   10900000
BINMSTSL EQU   X'C0'               RESERVED                  @G35AKNL   10950000
BINHDXFF EQU   X'80'               HDX FLIP FLOP             @G35AKMP   11000000
BINHDXC  EQU   X'40'               HDX CONTENTION            @G35AKMP   11050000
BINFLDPX EQU   X'00'               FULL DUPLEX               @G35AKMP   11100000
BINRCVR  EQU   X'20'               1 = SYMMETRIC                        11150000
*                                      RESPONSIBILITY FOR               11200000
*                                      RECOVERY              @G35AKNL   11250000
*                                  0 = CONTENTION LOSER (SEE            11300000
*                                      BINBKFS BELOW)        @G35AKNL   11350000
*                                      RESPONSIBLE FOR       @G35AKNL   11400000
*                                      RECOVERY              @G35AKNL   11450000
BINBKFS  EQU   X'10'               1 = PRIMARY IS BRACKETS              11500000
*                                      FIRST SPEAKER AND CONTENTION     11550000
*                                      WINNER; SECONDARY IS BRACKETS    11600000
*                                      BIDDER AND CONTENTION LOSER      11650000
*                                  0 = SECONDARY IS BRACKETS            11700000
*                                      FIRST SPEAKER AND CONTENTION     11750000
*                                      WINNER; PRIMARY IS BRACKETS      11800000
*                                      BIDDER AND CONTENTION LOSER      11850000
BINASCC  EQU   X'0C'               ALTERNATE CODE PROCESSING IDENTIFIER 11900000
*                                                              @R482001 11950000
*                                  00=ASCII7                   @R482001 12000000
*                                  01=ASCII8                   @R482001 12050000
BINCTLV  EQU   X'02'               CONTROL VECTORS ARE INCLUDED         12100000
*                                  AFTER THE SLU NAME          @R489301 12150000
BINCONR  EQU   X'01'               RESET STATE FOR HDX FLIP-FLOP        12200000
*                                  (E.G. AT START OF SESSION)           12250000
*                                  1 = PRIMARY SENDS FIRST              12300000
*                                      WHEN DATA TRAFFIC                12350000
*                                      RESET STATE IS LEFT              12400000
*                                  0 = SECONDARY SENDS FIRST @G35AKNL   12450000
BINTSU   DS    CL6                 TS USAGE                             12500000
BINPRSVC DS    CL12                PRESENTATION SERVICES                12550000
BINCRCTL DS    CL1                 CRYPTOGRAPHY CONTROL BYTE            12600000
*              VALUES FOR BINCRCTL                                      12650000
BINNOCRY EQU   X'00'               NO CRYPTOGRAPHY                      12700000
BINCRYCA EQU   X'09'               CAPABLE OF CRYPTOGRAPHY              12750000
BINCRYSL EQU   X'19'               SELECTIVE CRYPTOGRAPHY               12800000
BINCRYRQ EQU   X'39'               REQUIRED CRYPTOGRAPHY                12850000
*                                                                       12900000
BINCEUMP EQU   X'C0'               EU/PRIVATE CRYPTOGRAPHY FLAGS        12950000
*              VALUES FOR BINCEUMP                                      13000000
BINCEUPS EQU   X'80'               SYSTEM KEY, PRIVATE PROTOCOL         13050000
BINCEUPP EQU   X'40'               PRIVATE KEY, PRIVATE PROTOCOL        13100000
BINCEUNP EQU   X'00'               NO PRIVATE/EU PROTOCOL               13150000
*                                                                       13200000
BINCSESS EQU   X'30'               SESSION LEVEL CRYPTOGRAPHY FLAGS     13250000
*              VALUES FOR BINCSESS                                      13300000
BINCSENP EQU   X'00'               NO CRYPTOGRAPHY                      13350000
BINCSESP EQU   X'10'               SELECTIVE CRYPTOGRAPHY               13400000
BINCSESR EQU   X'30'               REQUIRED CRYPTOGRAPHY                13450000
*                                                                       13500000
BINCLEN  EQU   X'0F'               LENGTH OF CRYPTOGRAPHY FIELD         13550000
*                                                                       13600000
*                                                                       13650000
BINPRIML DS    C                   PRIMARY LU NAME LENGTH               13700000
BINPRIMN DS    CL8                 PRIMARY LU NAME           @G35AKMP   13750000
*                                                            @G35AKMP   13800000
*  INCLUDE FOR COMPATIBILITY                                 @G35AKMP   13850000
*                                                            @G35AKMP   13900000
         ORG   BINPRIMN                                      @G35AKMP   13950000
BINPRIM  DS    8C                  PRIMARY LU NAME                      14000000
*                                                            @G35AKMP   14050000
BINUSEL  DS    C                   USER DATA LENGTH                     14100000
BINUSE   EQU   *                   USER DATA                            14150000
BINUSERD EQU   X'00'               USER DATA LENGTH DEFAULT             14200000
*                                                                       14250000
*  OVERLAY FOR 'BINTSU' (TS USAGE)                                      14300000
         ORG   BINTSU                                                   14350000
BINAPACE DS    C                   SLU SEND PACING                      14400000
BINSP2ST EQU   X'80'               NUMBER OF PACING STAGES FROM         14450000
*                                  SLU TO PLU ( NOTE-REVERSE OF         14500000
*                                  BINPS1ST)                 @G35AKNL   14550000
*                                  1 = TWO STAGES                       14600000
*                                  0 = ONE STAGE                        14650000
BINRSV43 EQU   X'40'               RESERVED                             14700000
BINAPACM EQU   X'3F'               SLU SEND PACING COUNT                14750000
BINRPACE DS    C                   SLU RECEIVE PACING                   14800000
BINASPI  EQU   X'80'               ADAPTIVE SESSION PACING INDICATOR    14850000
*                                                            @P027136   14900000
BINRSV07 EQU   X'40'               RESERVED                  @P027136   14950000
BINRPACM EQU   X'3F'               SLU RECEIVE PACING COUNT             15000000
BINRUSZ  DS    0CL2                RU SIZES                             15050000
BINSRUSZ DS    C                   SLU MAXIMUM SEND RU SIZE             15100000
BINSRUSS EQU   X'80'               RU SIZE IS SPECIFIED      @P050200   15150000
BINPRUSZ DS    C                   PLU MAXIMUM SEND RU SIZE             15200000
BINPRUSS EQU   X'80'               RU SIZE IS SPECIFIED      @P050200   15250000
*  VALUES FOR BINSRUSZ AND BINPRUSZ (RU SIZES) EXCEPT RU SIZE           15300000
*  SPECIFIED                                                 @P050200   15350000
BINRU256 EQU   X'85'               256 BYTE RU (8*2**5)                 15400000
BINR4096 EQU   X'89'               4096 BYTE RU (8*2**9)         @21A   15450000
BIN61440 EQU   X'FC'               61440 BYTE RU (15*2**12)      @21A   15500000
BINRU1K  EQU   X'87'               1024 BYTE RU (8*2**7)                15550000
BINRUSZM EQU   X'F0'               MANTISSA (M)              @G35AKMP   15600000
BINRUSZE EQU   X'0F'               EXPONENT (E)  SIZE=M*2**E @G35AKMP   15650000
BINSPACE DS    C                   PLU SEND PACING                      15700000
BINPS1ST EQU   X'80'               NUMBER OF PACING STAGES FROM         15750000
*                                  PLU TO SLU (NOTE-REVERSE OF          15800000
*                                  BINSP2ST)                 @G35AKNL   15850000
*                                  1 = ONE STAGE                        15900000
*                                  0 = TWO STAGE                        15950000
BINRSV44 EQU   X'40'               RESERVED                  @G35AKNL   16000000
BINSPACM EQU   X'3F'               PLU SEND PACING COUNT                16050000
BINBPACE DS    C                   PLU RECEIVE PACING        @G35AKMP   16100000
BINRSV10 EQU   X'C0'               RESERVED                  @P027136   16150000
BINBPACM EQU   X'3F'               PLU RECEIVE PACING COUNT             16200000
*                                                                       16250000
*********************************************************************   16300000
*  OVERLAY FOR 'BINPRSVC' (PRESENTATION SERVICES)                       16350000
*********************************************************************   16400000
         ORG   BINPRSVC                                                 16450000
BINLUP   DS    C                   PS PROFILE                           16500000
*  VALUES FOR BINLUP (PS PROFILE)                            @G35AKMP   16550000
BINPSFMT EQU   X'80'               PS USAGE FIELD FORMAT     @R500011   16600000
BINLUTYP EQU   X'7F'               LU TYPE                   @G35AKMP   16650000
BINLUP6C EQU   X'06'               LU TYPE 6                 @R500011   16700000
BINLUP4C EQU   X'04'               LU TYPE 4                 @G35AKMP   16750000
BINLUP3C EQU   X'03'               LU TYPE 3                 @G35AKMP   16800000
BINLUP2C EQU   X'02'               LU TYPE 2                 @G35AKMP   16850000
BINLUP1C EQU   X'01'               LU TYPE 1                 @G35AKMP   16900000
BINLUP0C EQU   X'00'               LU TYPE 0                 @G35AKMP   16950000
*                                                            @G35AKMP   17000000
BINPSCHR DS    CL11                PS PROFILE DEPENDENT                 17050000
*                                  PRESENTATION SERVICES                17100000
*                                                                       17150000
*********************************************************************   17200000
*  OVERLAY FOR 'BINPSCHR' (PRESENTATION SERVICES CHARACTERISTICS        17250000
*                          FOR PS PROFILE 1)                            17300000
*********************************************************************   17350000
         ORG   BINPSCHR                                                 17400000
BINLUP1  DS    X                   PS PROFILE 1 FMHS AND DSP            17450000
BINFMHS1 EQU   X'F0'               FM HEADER SUBSET                     17500000
*  VALUES FOR BINFMHS1                                                  17550000
BINFMS3C EQU   X'30'               DATA MANAGEMENT SUBSET    @DM30817   17600000
BINFMS2C EQU   X'20'               TYPE 1 HEADERS            @DM30817   17650000
BINFMS1C EQU   X'10'               TYPE 1 HEADERS WITH                  17700000
*                                  RESTRICTIONS                         17750000
BINFMS0C EQU   X'00'               NO FM HEADERS ALLOWED                17800000
BINDSP1  EQU   X'0F'               DATA STREAM PROFILE                  17850000
*  VALUES FOR BINDSP1 (DATA STREAM PROFILE)                             17900000
BINDSP1C EQU   X'01'               BASIC CONTROLS, CARDS MAY            17950000
*                                  SPAN RUS                  @G35AKMP   18000000
BINDSP0C EQU   X'00'               BASIC CONTROLS            @G35AKMP   18050000
BINPLUS1 DS    0XL5                PLU USAGE                            18100000
BINPFMF1 DS    0XL2                FMH SUBSET DEPENDENT                 18150000
*                                  FLAGS                                18200000
BINPFMB1 DS    X                   FIRST BYTE                           18250000
BINPFMB2 DS    X                   SECOND BYTE                          18300000
BINPDSP1 DS    0XL2                DATA STREAM FLAGS FOR                18350000
*                                  DSP0 AND DSP1                        18400000
BINPDSB1 DS    X                   FIRST BYTE                           18450000
BINPDSB2 DS    X                   SECOND BYTE                          18500000
BINPMED1 DS    X                   MEDIA FLAGS                          18550000
BINSLUS1 DS    0XL5                SLU USAGE                            18600000
BINSFMF1 DS    0XL2                FMH SUBSET DEPENDENT                 18650000
*                                  FLAGS                                18700000
BINSFMB1 DS    X                   FIRST BYTE                           18750000
BINSFMB2 DS    X                   SECOND BYTE                          18800000
BINSDSP1 DS    0XL2                DATA STREAM FLAGS FOR                18850000
*                                  DSP0 AND DSP1                        18900000
BINSDSB1 DS    X                   FIRST BYTE                           18950000
BINSDSB2 DS    X                   SECOND BYTE (RESERVED)               19000000
BINSMED1 DS    X                   MEDIA FLAGS                          19050000
*                                                                       19100000
*  FLAGS FOR LU PROFILE 1                                               19150000
*                                                                       19200000
*  FLAGS FOR BINPFMB1 AND BINSFMB1 (FIRST BYTE OF FM                    19250000
*                                   HEADER FLAGS)                       19300000
BINDESTS EQU   X'80'               0 = TWO DESTINATIONS MAY             19350000
*                                      BE OUTSTANDING                   19400000
*                                  1 = THREE DESTINATIONS MAY           19450000
*                                      BE OUTSTANDING                   19500000
BINCMPCT EQU   X'40'               0 = WILL NOT SEND COMPACTION         19550000
*                                      TABLE/WILL NOT BE QUERIED        19600000
*                                      FOR COMPACTION TABLES            19650000
*                                  1 = MAY SEND COMPACTION              19700000
*                                      TABLE/MAY BE QUERIED FOR         19750000
*                                      COMPACTION TABLES                19800000
BINPDIR  EQU   X'20'               0 = PDIR WILL NOT BE SENT            19850000
*                                  1 = PDIR MAY BE SENT                 19900000
BINRSV09 EQU   X'1F'               RESERVED FOR FMHS1                   19950000
*  ADDITIONAL FLAGS FOR FMHS3                                           20000000
BINKDDSI EQU   X'10'               0 = KEYED DIRECT DATA SET            20050000
*                                      WILL NOT BE SENT                 20100000
*                                  1 = KEYED DIRECT DATA SET            20150000
*                                      MAY BE SENT                      20200000
BINSDSI  EQU   X'08'               0 = SEQUENTIAL DATA SETS             20250000
*                                      WILL NOT BE SENT                 20300000
*                                  1 = SEQUENTIAL DATA SETS             20350000
*                                      MAY BE SENT                      20400000
BINSAI   EQU   X'04'               0 = SEQUENTIAL ACCESS TO             20450000
*                                      ADDRESSED DIRECT DATA            20500000
*                                      SET WILL NOT BE SENT             20550000
*                                  1 = SEQUENTIAL ACCESS TO             20600000
*                                      ADDRESSED DIRECT DATA            20650000
*                                      SET MAY BE SENT                  20700000
BINSIDS  EQU   X'02'               0 = SERIES ID NOT                    20750000
*                                      SUPPORTED (WITH STATUS           20800000
*                                      IN REPLY)                        20850000
*                                  1 = SERIES ID SUPPORTED              20900000
*                                      (WITH STATUS IN REPLY)           20950000
BINARRR  EQU   X'01'               0 = ADD REPLICATE,                   21000000
*                                      REPLACE REPLICATE NOT            21050000
*                                      SUPPORTED                        21100000
*                                  1 = ADD REPLICATE,                   21150000
*                                      REPLACE REPLICATE                21200000
*                                      SUPPORTED                        21250000
*  FLAGS FOR BINPFMB2 AND BINSFMB2 (SECOND BYTE OF FM HEADER FLAGS)     21300000
BINRSV17 EQU   X'FF'               RESERVED FOR FMHS1                   21350000
*  ADDITIONAL FLAGS FOR FMHS3                                           21400000
BINRSV16 EQU   X'80'               RESERVED                             21450000
BINQDSI  EQU   X'40'               0 = QUERY FOR DESTINATION            21500000
*                                      SELECTION NOT SUPPORTED          21550000
*                                  1 = QUERY FOR DESTINATION            21600000
*                                      SELECTION SUPPORTED              21650000
BINCSDS  EQU   X'20'               0 = CREATE / SCRATCH /               21700000
*                                      SCRATCH ALL DATA                 21750000
*                                      SET NOT ALLOWED                  21800000
*                                  1 = CREATE / SCRATCH /               21850000
*                                      SCRATCH ALL DATA                 21900000
*                                      SET NOT ALLOWED                  21950000
BINXFPD  EQU   X'10'               0 = EXECUTE PROGRAM OFFLINE          22000000
*                                      NOT ALLOWED                      22050000
*                                  1 = EXECUTE PROGRAM OFFLINE          22100000
*                                      ALLOWED                          22150000
BINRSV11 EQU   X'0F'               RESERVED FOR FMHS3                   22200000
*                                                                       22250000
*  FLAGS FOR 'BINPDSB1 AND BINSDSB1' (PLU/SLU DATA STREAM               22300000
*                                     FLAGS FOR DSP0 AND DSP1)          22350000
*  NL AND FF MAY BE SENT IN ANY SUBSET. EACH SUBSET BELOW CONTAINS      22400000
*  EVERY PRECEDING SUBSET (E.G. IF AN LU CAN SEND THE HORIZONTAL        22450000
*  FORMAT SUBSET, IT CAN ALSO SEND THE FULL BASE SET)                   22500000
BININTR  EQU   X'80'               0 = FULL BASE SET DATA               22550000
*                                      STREAM (BS,CR,LF,ENP,            22600000
*                                      INP,HT,VT) WILL NOT              22650000
*                                      BE SENT                          22700000
*                                  1 = FULL BASE SET DATA               22750000
*                                      STREAM (BS,CR,LF,ENP,            22800000
*                                      INP,HT,VT) MAY BE                22850000
*                                      SENT                             22900000
BINHFDS  EQU   X'40'               0 = HORIZONTAL FORMAT,               22950000
*                                      DATA STREAM(SHF) WILL            23000000
*                                      NOT BE SENT                      23050000
*                                  1 = HORIZONTAL FORMAT,               23100000
*                                      DATA STREAM(SHF) MAY             23150000
*                                      BE SENT                          23200000
BINVTDS  EQU   X'20'               0 = VERTICAL FORMAT                  23250000
*                                      DATA STREAM (SVF)                23300000
*                                      WILL NOT BE SENT                 23350000
*                                  1 = VERTICAL FORMAT                  23400000
*                                      DATA STREAM (SVF)                23450000
*                                      MAY BE SENT                      23500000
BINVSDS  EQU   X'10'               0 = VERTICAL CHANNEL DATA            23550000
*                                      STREAM (SVF(CHANNELS),SCF,       23600000
*                                      SEL) WILL NOT BE                 23650000
*                                      SENT                             23700000
*                                  1 = VERTICAL CHANNEL DATA            23750000
*                                      STREAM (SVF(CHANNELS),SCF,       23800000
*                                      SEL) MAY BE SENT                 23850000
BINSLD   EQU   X'08'               0 = SLD WILL NOT BE SENT             23900000
*                                  1 = SLD MAY BE SENT                  23950000
BINRSV40 EQU   X'06'               RESERVED                             24000000
BINTRNDS EQU   X'01'               0 = TRANSPARENCY DATA                24050000
*                                      STREAM (TRN,IRS) WILL            24100000
*                                      NOT BE SENT                      24150000
*                                  1 = TRANSPARENCY DATA                24200000
*                                      STREAM (TRN,IRS)                 24250000
*                                      MAY BE SENT                      24300000
*  FLAGS FOR BINPDSB2                                                   24350000
*                                                                       24400000
BINUAINT EQU   X'80'               0 = SLU WILL INITIATE                24450000
*                                      ATTENDED                         24500000
*                                  1 = SLU WILL INITIATE                24550000
*                                      UNATTENDED                       24600000
BINUAALT EQU   X'40'               0 = DURING SESSION SLU               24650000
*                                      WILL NOT ALTERNATE               24700000
*                                      BETWEEN ATTENDED AND             24750000
*                                      UNATTENDED                       24800000
*                                  1 = DURING SESSION SLU               24850000
*                                      WILL ALTERNATE                   24900000
*                                      BETWEEN ATTENDED AND             24950000
*                                      UNATTENDED                       25000000
BINRSV41 EQU   X'3F'               RESERVED                             25050000
*                                                                       25100000
*  FLAGS FOR BINPMED1 AND BINSMED1 (PLU/SLU MEDIA FLAGS)                25150000
BINDOCMT EQU   X'80'               0 = DOCUMENT FORMAT WILL             25200000
*                                      NOT BE SENT                      25250000
*                                  1 = DOCUMENT FORMAT                  25300000
*                                      MAY BE SENT                      25350000
BINCARD  EQU   X'40'               0 = CARD FORMAT WILL NOT             25400000
*                                      BE SENT                          25450000
*                                  1 = CARD FORMAT MAY BE               25500000
*                                      SENT                             25550000
BINXCHNG EQU   X'20'               0 = EXCHANGE MEDIA FORMAT            25600000
*                                      WILL NOT BE SENT                 25650000
*                                  1 = EXCHANGE MEDIA FORMAT            25700000
*                                      MAY BE SENT                      25750000
BINDISK  EQU   X'10'               0 = DISK FORMAT WILL NOT             25800000
*                                      BE SENT                          25850000
*                                  1 = DISK FORMAT MAY BE               25900000
*                                      SENT                             25950000
BINXCDF  EQU   X'08'               0 = EXTENDED CARD FORMAT             26000000
*                                      WILL NOT BE SENT                 26050000
*                                  1 = EXTENDED CARD FORMAT             26100000
*                                      MAY BE SENT                      26150000
BINXDOCF EQU   X'04'               0 = EXTENDED DOCUMENT                26200000
*                                      FORMAT WILL NOT BE               26250000
*                                      SENT                             26300000
*                                  1 = EXTENDED DOCUMENT                26350000
*                                      FORMAT MAY BE SENT               26400000
BINCDEDS EQU   X'02'               0 = SLU MAY SEND CD                  26450000
*                                      EVERY EDS                        26500000
*                                  1 = SLU MUST SEND CD                 26550000
*                                      EVERY EDS                        26600000
*                                      (THIS FLAG APPLIES               26650000
*                                       TO BINPMED1)                    26700000
BIN1CMP1 EQU   X'02'               APPLIES ONLY to BINSMED1        @X1A 26750000
*                                  (SEE BINCMP1 AND BINCMP2)       @X1A 26800000
BIN1CMP2 EQU   X'01'               (SEE BINCMP1 AND BINCMP2)       @X1C 26850000
*                                                                       26900000
*********************************************************************   26950000
*  OVERLAY FOR 'BINPSCHR' (PRESENTATION SERVICES CHARACTERISTICS        27000000
*                          FOR PS PROFILE 2)                            27050000
*********************************************************************   27100000
         ORG   BINPSCHR                                                 27150000
BINDFLAG DS    XL1                 DEVICE FLAG               @D14AKMC   27200000
BINSEDS  EQU   X'80'               EXTENDED 3270 DATA STREAM @D14AKMC   27250000
BINRSV14 DS    XL4                 RESERVED                  @D14AKMC   27300000
BINSCRSZ DS    0XL5                PRESENTATION SPACE SIZE   @ZA45868   27350000
BINSPRIR DS    FL1                 PRIMARY (DEFAULT) NUMBER             27400000
*                                  OF ROWS                              27450000
BINSPRIC DS    FL1                 PRIMARY (DEFAULT) NUMBER             27500000
*                                  OF COLUMNS                           27550000
BINSALTR DS    FL1                 ALTERNATE NUMBER OF ROWS             27600000
BINSALTC DS    FL1                 ALTERNATE NUMBER OF COLUMNS          27650000
BINPRESZ DS    FL1                 PRESENTATION SPACE SIZE   @ZA45868   27700000
*  VALUES FOR BINPRESZ (PRESENTATION SPACE SIZE)                        27750000
BINPSZRC EQU   X'7F'               PRESENTATION SPACE HAS               27800000
*                                  DEFAULT AND ALTERNATE                27850000
*                                  SIZES AS DEFINED IN                  27900000
*                                  DEFAULT, ALTERNATE                   27950000
*                                  ROW/COL FIELDS                       28000000
BINPSFX  EQU   X'7E'               PRESENTATION SPACE IS                28050000
*                                  FIXED SIZE AS DEFINED BY             28100000
*                                  ROW/COL VALUES IN                    28150000
*                                  DEFAULT ROW/COL FIELDS               28200000
BINPSZ3  EQU   X'03'               24X80 DEFAULT UNDEFINED ALTERNATE    28250000
*                                  DO WRITE STRUCTURED FIELD QUERY      28300000
*                                  TO IDENTIFY ALTERNATE     @R505701   28350000
BINPSZ2  EQU   X'02'               24X80 ROW X COLUMN                   28400000
BINPSZ1  EQU   X'01'               12X40 ROW X COLUMN                   28450000
BINPSZ0  EQU   X'00'               UNDEFINED ROW X COLUMN               28500000
BIN2COMP DS    X                   COMPRESSION FLAGS               @X1C 28550000
BIN2CMP1 EQU   X'02'               APPLIES ONLY to BINSMED1        @X1A 28600000
*                                  (SEE BINCMP1 AND BINCMP2)       @X1A 28650000
BIN2CMP2 EQU   X'01'               (SEE BINCMP1 AND BINCMP2)       @X1C 28700000
*                                                                       28750000
*********************************************************************   28800000
*  OVERLAY FOR 'BINPSCHR' (PRESENTATION SERVICES CHARACTERISTICS        28850000
*                          FOR PS PROFILE 3)                            28900000
*********************************************************************   28950000
         ORG   BINPSCHR                                                 29000000
BINRSV26 DS    XL5                 RESERVED                             29050000
BINBFRSZ DS    0XL4                PRESENTATION SPACE SIZE              29100000
BINBFRDR DS    FL1                 PRIMARY (DEFAULT) NUMBER OF ROWS     29150000
BINBFRDC DS    FL1                 PRIMARY (DEFAULT) NUMBER OF          29200000
*                                  COLUMNS                              29250000
BINBFRAR DS    FL1                 ALTERNATE NUMBER OF ROWS             29300000
BINBFRAC DS    FL1                 ALTERNATE NUMBER OF COLUMNS          29350000
BINBDESC DS    FL1                 PRESENTATION SPACE                   29400000
*                                  SIZE SPECIFICATION:                  29450000
*                                       0 = MAXIMUM                     29500000
*                                       1 = 480 CHAR                    29550000
*                                       2 = 1920 CHAR                   29600000
*                                  X'7E' = FIXED SIZE(SEE               29650000
*                                          BINBFRDR AND                 29700000
*                                          BINBFRDC)                    29750000
*                                  X'7F' = VARIABLE SIZE AS             29800000
*                                          DEFINED BY                   29850000
*                                          BINBFRSZ                     29900000
BINBFSIZ EQU   X'7F'               SEE ABOVE                            29950000
BINBFSZF EQU   X'7E'               SEE ABOVE                            30000000
BIN3COMP DS    X                   COMPRESSION FLAGS               @X1C 30050000
BIN3CMP1 EQU   X'02'               APPLIES ONLY to BINSMED1        @X1A 30100000
*                                  (SEE BINCMP1 AND BINCMP2)       @X1A 30150000
BIN3CMP2 EQU   X'01'               (SEE BINCMP1 AND BINCMP2)       @X1A 30200000
*                                                                       30250000
*********************************************************************   30300000
*  OVERLAY FOR 'BINPSCHR' (PRESENTATION SERVICES CHARACTERISTICS        30350000
*                          FOR PS PROFILE 4)                            30400000
*********************************************************************   30450000
         ORG   BINPSCHR                                                 30500000
BINPSNDO DS    0XL4                PLU SEND CAPABILITY       @G35AKMP   30550000
BINPDSPP DS    X                   PRINTER DATA STREAM                  30600000
*                                  PROFILE                   @G35AKNL   30650000
BINPBDSP EQU   X'80'               BASE DATA STREAM PROFILE  @G35AKNL   30700000
*                                  0 = NOT SUPPORTED         @G35AKNL   30750000
*                                  1 = SUPPORTED             @G35AKNL   30800000
BINRSV46 EQU   X'40'               RESERVED                  @G35AKNL   30850000
BINPJOB  EQU   X'20'               JOB SCS SUBSET            @G35AKNL   30900000
*                                  0 = NOT SUPPORTED         @G35AKNL   30950000
*                                  1 = SUPPORTED             @G35AKNL   31000000
BINRSV47 EQU   X'10'               RESERVED                  @G35AKNL   31050000
BINWPRAW EQU   X'08'               WORD PROCESSING RAW FORM  @G35AKNL   31100000
*                                  0 = NOT SUPPORTED         @G35AKNL   31150000
*                                  1 = SUPPORTED             @G35AKNL   31200000
BINRSV48 EQU   X'07'               RESERVED                  @G35AKNL   31250000
BINADSPP DS    X                   ADDITIONAL DATA STREAM               31300000
*                                  PROFILE                   @G35AKMP   31350000
BINRSV49 EQU   X'80'               RESERVED                  @G35AKNL   31400000
BINADSCD EQU   X'40'               0 = CARD NOT SUPPORTED               31450000
*                                  1 = CARD SUPPORTED        @G35AKMP   31500000
BINRSV29 EQU   X'3F'               RESERVED                  @G35AKNL   31550000
BINCSLP  DS    X                   CONSOLE                   @G35AKMP   31600000
BINCBDSP EQU   X'80'               BASE DATA STREAM PROFILE  @G35AKNL   31650000
*                                  0 = NOT SUPPORTED         @G35AKNL   31700000
*                                  1 = SUPPORTED             @G35AKNL   31750000
BINRSV50 EQU   X'40'               RESERVED                  @G35AKNL   31800000
BINCJOB  EQU   X'20'               JOB SCS SUBSET            @G35AKNL   31850000
*                                  0 = NOT SUPPORTED         @G35AKNL   31900000
*                                  1 = SUPPORTED             @G35AKNL   31950000
BINRSV51 EQU   X'1F'               RESERVED                  @G35AKNL   32000000
BINFMHUP DS    X                   FM/FMH USAGE              @G35AKMP   32050000
BINSSDAT EQU   X'80'               RESERVED                  @G35AKNL   32100000
BINDSSTO EQU   X'60'               00= 1 LEVEL DESTINATION              32150000
*                                      SELECTION SUSPENSION             32200000
*                                      STACK                            32250000
*                                  01= 2 LEVEL DESTINATION              32300000
*                                      SELECTION SUSPENSION             32350000
*                                      STACK                            32400000
*                                  10= RESERVED                         32450000
*                                  11= 3 LEVEL DESTINATION              32500000
*                                      SELECTION SUSPENSION             32550000
*                                      STACK                 @G35AKMP   32600000
BINRSV52 EQU   X'1E'               RESERVED                  @G35AKNL   32650000
BINKIXS  EQU   X'01'               0 = SLU NEED NOT RECEIVE             32700000
*                                      CD ON EVERY EDS                  32750000
*                                  1 = SLU MUST RECEIVE CD              32800000
*                                      ON EVERY EDS          @G35AKMP   32850000
BINSSNDO DS    0XL4                SLU SEND CAPABILITY       @G35AKMP   32900000
BINPDSPS DS    X                   PRINTER DATA STREAM                  32950000
*                                  PROFILE (SEE BINPDSPP)    @G35AKMP   33000000
BINADSPS DS    X                   ADDITIONAL DATA STREAM               33050000
*                                  PROFILE (SEE BINADSPP)    @G35AKMP   33100000
BINCSLS  DS    X                   CONSOLE (SEE BINCSLP)     @G35AKMP   33150000
BINFMHUS DS    X                   FM/FMH USAGE (SEE                    33200000
*                                  BINFMHUP; MEANING FOR                33250000
*                                  BINKIXS IS: 0 = PLU NEED             33300000
*                                  NOT RECEIVE CD ON EVERY              33350000
*                                  EDS, 1 = PLU MUST RECEIVE            33400000
*                                  CD ON EVERY EDS)          @G35AKMP   33450000
BINCSO   DS    X                   CODE SELECTION            @G35AKMP   33500000
BINCSOR  EQU   X'F0'               REPERTOIRE                @G35AKMP   33550000
BINCSOE  EQU   X'80'               EBCDIC                    @G35AKMP   33600000
BINCSOAI EQU   X'40'               ASCII / ISCII / ITA#5     @G35AKMP   33650000
BINRSV30 EQU   X'20'               RESERVED                  @G35AKMP   33700000
BINRSV31 EQU   X'10'               RESERVED                  @G35AKMP   33750000
BINCSOC1 EQU   X'0C'               00= CODE 0 (MAIN CODE)               33800000
*                                      SELECTION IS EBCDIC              33850000
*                                  01= CODE 0 (MAIN CODE)               33900000
*                                      SELECTION IS ASCII /             33950000
*                                      ISCII / ITA#5         @G35AKMP   34000000
BINCSOC2 EQU   X'03'               00= CODE 1 (ALTERNATE                34050000
*                                      CODE SELECTION IS                34100000
*                                      EBCDIC                           34150000
*                                  01= CODE 1 (ALTERNATE                34200000
*                                      CODE SELECTION IS                34250000
*                                      ASCII / ISCII /                  34300000
*                                      ITA#5                 @G35AKMP   34350000
BINGENCO DS    X                   GENERAL CHARACTERISTICS   @G35AKMP   34400000
BINRSV32 EQU   X'C0'               RESERVED                  @G35AKMP   34450000
BINWSDF  EQU   X'20'               0 = PLU MAY SEND DATA                34500000
*                                      FIRST                            34550000
*                                  1 = SLU MUST SEND DATA               34600000
*                                      FIRST                 @G35AKMP   34650000
BINRSV33 EQU   X'10'               RESERVED                  @G35AKMP   34700000
BINIAO   EQU   X'08'               0 = SLU WILL INITIATE                34750000
*                                      ATTENDED                         34800000
*                                  1 = SLU WILL INITIATE                34850000
*                                      UNATTENDED            @G35AKMP   34900000
BINAAO   EQU   X'04'               0 = SLU WILL NOT                     34950000
*                                      ALTERNATE BETWEEN                35000000
*                                      ATTENDED AND                     35050000
*                                      UNATTENDED                       35100000
*                                  1 = SLU MAY ALTERNATE                35150000
*                                      BETWEEN ATTENDED AND             35200000
*                                      UNATTENDED            @G35AKMP   35250000
BINRSV34 EQU   X'03'               RESERVED                  @G35AKMP   35300000
BINRSV35 DS    X                   RESERVED                  @G35AKMP   35350000
*                                                                       35400000
*********************************************************************   35450000
*  OVERLAY FOR 'BINPSCHR' (PRESENTATION SERVICES CHARACTERISTICS        35500000
*                          FOR PS PROFILE 6)                            35550000
*********************************************************************   35600000
         ORG   BINPSCHR                                                 35650000
BINLULEV DS    X                   LU-6 LEVEL                @R500011   35700000
BINLV02  EQU   X'02'               LEVEL 2                   @R500011   35750000
BINRSV36 DS    XL6                 RESERVED                      @L1C   35800000
BINFLG0  DS    X                   FLAGS                         @L1A   35850000
BINDSSSP EQU   X'80'               DISTRIBUTED SYSTEMS SECURITY         35900000
*                                    SUPPORTED                          35909300
*                                  0=EXTENDED SECURITY MECHANISMS       35918600
*                                    ARE NOT SUPPORTED                  35927900
*                                  1=AT LEAST ONE SECURITY              35937200
*                                    MECHANISM IS SUPPORTED      @D2C   35946500
BINDESS  EQU   X'40'               Extended Security Sense Codes        35956200
*                                  0= Extended security sense           35962400
*                                     codes will not be accepted on     35968600
*                                     incoming FMH-7s                   35974800
*                                  1= Extended security sense           35981000
*                                     codes will be accepted on         35987200
*                                     incoming FMH-7s            @D1A   35993400
BINFLG1  DS    X                   LU 6.2 FLAGS              @R500011   36000000
BINCLSS  EQU   X'10'               ACCESS SECURITY SUBFIELD SUPPORT:    36050000
*                                  0= ACCESS SECURITY INFORMATION       36100000
*                                     FIELD WILL NOT BE ACCEPTED ON     36150000
*                                     INCOMING FMH-5S                   36200000
*                                  1= ACCESS SECURITY INFORMATION       36250000
*                                     FIELD WILL BE ACCEPTED ON         36300000
*                                     INCOMING FMH-5S        @P052802   36350000
*                                                                       36400000
BINSLAPS EQU   X'08'               SESSION LEVEL SECURITY PROTOCOL      36450000
*                                                                @KFA   36500000
*                                                                       36505500
BINDPWS  EQU   X'04'               Password Substitution Support:       36511000
*                                  0= Substituted passwords will        36516500
*                                     not be accepted on incoming       36522000
*                                     FMH-5s                            36527500
*                                  1= Substituted passwords will        36533000
*                                     be accepted on incoming           36538500
*                                     FMH-5s                     @D1A   36544000
*                                                                       36550000
BINAVFS  EQU   X'02'               ALREADY - VERIFIED FUNCTION          36600000
*                                  SUPPORT                              36650000
*                                  0= ALREADY - VERIFIED FUNCTION       36700000
*                                     WILL NOT BE ACCEPTED ON           36750000
*                                     INCOMING FMH_5                    36800000
*                                  1= ALREADY - VERIFIED FUNCTION       36850000
*                                     WILL BE ACCEPTED ON INCOMING      36900000
*                                     FMH_5                      @F1A   36950000
BINPV    EQU   X'01'               PERSISTENT VERIFICATION FUNCTION     37000000
*                                  SUPPORT                              37050000
*                                  0= PERSISTENT VERIFICATION           37100000
*                                     FUNCTION WILL NOT BE ACCEPTED     37150000
*                                     ON INCOMING FMH_5                 37200000
*                                  1= PERSISTENT VERIFICATION           37250000
*                                     FUNCTION WILL BE ACCEPTED ON      37300000
*                                     INCOMING FMH_5             @B1A   37350000
BINFLG2  DS    X                   MORE LU 6.2 FLAGS         @R500011   37400000
BINSYNCH EQU   X'60'               SYNCHRONIZATION LEVEL:    @R500011   37450000
*    VALUES FOR BINSYNCH                                                37500000
BINCONF  EQU   X'20'               CONFIRM SUPPORTED         @R500011   37550000
BINCSBK  EQU   X'40'               CONFIRM, SYNC POINT, AND             37600000
*                                  BACKOUT SUPPORTED         @R500011   37650000
BINRS    EQU   X'10'               RECONNECT SUPPORT:                   37700000
*                                  0= RECONNECT NOT SUPPORTED           37750000
*                                  1= RECONNECT SUPPORTED    @R500011   37800000
BINRSR   EQU   X'0C'               RESPONSIBILITY FOR SESSION           37850000
*                                  REINITIATION:             @R500011   37900000
* NOTE: BINRSR IS RESERVED WHEN PARALLEL SESSIONS ARE SUPPORTED         37950000
*       (I.E. WHEN BINPSS IS SET)                            @P047746   38000000
*    VALUES FOR BINRSR                                                  38050000
BINOPRC  EQU   X'00'               OPERATOR CONTROLLED       @R500011   38100000
BINPRIMH EQU   X'04'               PRIMARY WILL REINITIATE   @R500011   38150000
BINSECNH EQU   X'08'               SECONDARY WILL REINITIATE @R500011   38200000
BINETHR  EQU   X'0C'               EITHER MAY REINITIATE     @R500011   38250000
*                                                                       38300000
BINPSS   EQU   X'02'               PARALLEL SESSION SUPPORT FOR         38350000
*                                  LU-LU PAIR:                          38400000
*                                  0= PSS NOT SUPPORTED                 38450000
*                                  1= PSS SUPPORTED          @R500011   38500000
BINGDSVF EQU   X'01'               CHANGE NUMBER OF SESSIONS GDS        38550000
*                                  VARIABLE FLOW SUPPORT:               38600000
*                                  0= NOT SUPPORTED                     38650000
*                                  1= SUPPORTED              @R500011   38700000
BINFLG3  DS    X                                                 @F2C   38750000
BINRSV37 EQU   X'80'               RESERVED                      @B2A   38800000
BINLTDRC EQU   X'40'               1= LIMITED RESOURCE EXISTS    @B2A   38850000
BINRSV38 EQU   X'3C'               RESERVED                      @X1C   38900000
BIN6CMP1 EQU   X'02'               APPLIES ONLY to BINSMED1      @X1A   38950000
*                                  (SEE BINCMP1 AND BINCMP2)     @X1A   39000000
BIN6CMP2 EQU   X'01'               (SEE BINCMP1 AND BINCMP2)     @X1A   39050000
*********************************************************************   39100000
*  OVERLAY FOR 'BINPSCHR' (GENERIC OVERLAY FOR COMPRESSION)             39150000
*********************************************************************   39200000
         ORG   BINPSCHR                                          @X1A   39250000
BINRSV53 DS    XL10                UNCHANGED BY COMPRESSION      @X1A   39300000
*                                  REFER TO SPECIFIC PROFILE     @X1A   39350000
BINCOMP  DS    XL1                 COMPRESSION FLAG BYTE         @X1A   39400000
BINCMP1  EQU   X'02'               COMPRESSION BIT 1             @X1A   39450000
BINCMP2  EQU   X'01'               COMPRESSION BIT 2             @X1A   39500000
*                                  THE COMBINATIONS:             @X1A   39550000
*                                      BIND REQUEST:             @X1A   39600000
*                                      00 - NO COMPRESSION       @X1A   39650000
*                                      01 - COMPRESSION BID      @X1A   39700000
*                                      10 - UNUSED               @X1A   39750000
*                                      11 - COMPRESSION REQUIRED @X1A   39800000
*                                      BIND RESPONSE:            @X1A   39850000
*                                      10 - COMPRESSION USED     @X1A   39900000
*                                      XX - REMAINING - UNUSED   @X1A   39950000
         ORG   ,                   END OF OVERLAYS           @P047462   40000000
         MEND                                                           40050000
