*%GOTO   EXLEXTPL;                          /* SKIP THE COMMENTS    */  00050000
* /*                                                                */  00055500
* /*     COPYRIGHT = LICENSED MATERIALS - PROPERTY OF IBM           */  00061000
* /*                                                                */  00066500
* /*                 "RESTRICTED MATERIALS OF IBM"                  */  00072000
* /*                                                                */  00077500
* /*                 5695-117                                       */  00083000
* /*                                                                */  00088500
* /*                 (C) COPYRIGHT IBM CORP. 1979                   */  00094000
* /*                                                                */  00100000
* /*     CHANGE LEVEL = 0                                   @ZA34940*/  00150000
* /*     DATE OF LAST CHANGE = 13  NOV   78 ( 78*317 )      @ZA34940*/  00200000
* /*                                                                */  00250000
* /******************************************************************/  00300000
* /*                                                                */  00350000
* /*     EXTL VTAM EXTENSION                                        */  00400000
* /*                                                                */  00450000
* /*     THE EXTENSION DESCRIBES CONTROL DATA THAT ONLY VTAM USES.  */  00500000
* /*     THE EXTENSION IS CALLED BY THE VSAM EXTENSION      @ZA34940*/  00550000
* /*     (IFGEXLVS) UNDER THE FOLLOWING CONDITIONS:         @ZA34940*/  00600000
* /*                                                                */  00650000
* /*        PLS:  THE MODULE CONTAINING AN INCLUDE FOR IFGEXLST     */  00700000
* /*              SETS THE MACRO VARIABLE 'ACBRPLXL' TO 'VTAM'      */  00750000
* /*              PRIOR TO ISSUING THE INCLUDE.                     */  00800000
* /*        BAL:  THE AM=VTAM PARAMETER IS CODED ON THE IFGEXLST    */  00850000
* /*              MACRO CALL                                        */  00900000
* /*                                                                */  00950000
* /* CHANGE ACTIVITY                                                */  01000000
* /*    01 - 11/13/78 CBMM SPLIT SUPPORT                    @ZA34940*/  01050000
* /*    02 - 01/22/79 SSE CHANGES (DCR 4651.01)             @G98AKNL*/  01060000
* /*                                                                */  01100000
* /******************************************************************/  01150000
* /*                                                                */  01200000
*%EXLEXTPL: ;                                                           01250000
*             2 EXLVTEXT,                   /* START OF EXTENSION   */  01300000
*              3 EXLNLGNF    BIT(8),        /* LOSTERM ENTRY            01450000
*                                              DESCRIPTION    X03004*/  01500000
*                4 EXLNLGNS  BIT(1),        /* EXIT SPECIFIED X03004*/  01550000
*                4 EXLNLGNA  BIT(1),        /* EXIT ACTIVE    X03004*/  01600000
*                4 EXLNLGNK  BIT(1),        /* RESERVED - NOT           01630000
*                                              AVAILABLE      X03004*/  01660000
*                4 *         BIT(2),        /* RESERVED - NOT           01690000
*                                              AVAILABLE      X03004*/  01720000
*              3 EXLNLGNP    PTR(31) BDY(BYTE), /* POINTER TO LOSTERM   01750000
*                                              EXIT           X03004*/  01800000
*              3 EXLRLRQF    BIT(8),        /* RELREQ ENTRY             01850000
*                                              DESCRIPTION    X03004*/  01900000
*                4 EXLRLRQS  BIT(1),        /* EXIT SPECIFIED X03004*/  01950000
*                4 EXLRLRQA  BIT(1),        /* EXIT ACTIVE    X03004*/  02000000
*                4 EXLRLRQK  BIT(1),        /* RESERVED - NOT           02030000
*                                              AVAILABLE      X03004*/  02060000
*                4 *         BIT(2),        /* RESERVED - NOT           02090000
*                                              AVAILABLE      X03004*/  02120000
*              3 EXLRLRQP    PTR(31) BDY(BYTE), /* POINTER TO RELREQ    02150000
*                                              EXIT           X03004*/  02187500
*              3 *           CHAR(5),       /* RESERVED - NOT           02225000
*                                              AVAILABLE    @X50BHUC*/  02262500
*              3 EXLATTNF    BIT(8),        /* ATTN ENTRY               02300000
*                                              DESCRIPTION    X03004*/  02350000
*                4 EXLATTNS  BIT(1),        /* EXIT SPECIFIED X03004*/  02400000
*                4 EXLATTNA  BIT(1),        /* EXIT ACTIVE    X03004*/  02450000
*                4 EXLATTNK  BIT(1),        /* RESERVED - NOT           02485700
*                                              AVAILABLE      X03004*/  02521400
*                4 *         BIT(2),        /* RESERVED - NOT           02557100
*                                              AVAILABLE      X03004*/  02592800
*              3 EXLATTNP    PTR(31) BDY(BYTE), /* POINTER TO           02628500
*                                              ATTN EXIT      X03004*/  02664200
*              3 EXLTPNDF    BIT(8),        /* TPEND ENTRY              02700000
*                                              DESCRIPTION    X03004*/  02750000
*                4 EXLTPNDS  BIT(1),        /* EXIT SPECIFIED X03004*/  02800000
*                4 EXLTPNDA  BIT(1),        /* EXIT ACTIVE    X03004*/  02850000
*                4 EXLTPNDK  BIT(1),        /* RESERVED - NOT           02880000
*                                              AVAILABLE      X03004*/  02910000
*                4 *         BIT(2),        /* RESERVED - NOT           02940000
*                                              AVAILABLE      X03004*/  02970000
*              3 EXLTPNDP    PTR(31) BDY(BYTE), /* POINTER TO TPEND     03000000
*                                              EXIT          G40AKCM*/  03050000
*              3 EXLTNSEF    BIT(8),        /* NSEXIT ENTRY             03100000
*                                              DESCRIPTION   G40AKCM*/  03150000
*                4 EXLTNSES  BIT(1),       /* EXIT SPECIFIED G40AKCM*/  03200000
*                4 EXLTNSEA  BIT(1),       /* EXIT ACTIVE    G40AKCM*/  03250000
*                4 EXLTNSEK  BIT(1),        /* RESERVED - NOT           03280000
*                                              AVAILABLE     G40AKCM*/  03310000
*                4 *         BIT(2),        /* RESERVED - NOT           03340000
*                                              AVAILABLE     G40AKCM*/  03370000
*              3 EXLTNSEP    PTR(31) BDY(BYTE); /* POINTER TO NSEXIT    03400000
*                                              EXIT          G40AKCM*/  03450000
*     DCL  1 EXLDFAS BASED(ADDR(EXLJRNF)),  /* BASE AT JRNAD X3004BH*/  03500000
*            2 EXLDFASF    BIT(8),          /* DFASY ENTRY              03550000
*                                              DESCRIPTION   X3004BH*/  03600000
*              3 EXLDFASS  BIT(1),          /* EXIT SPECIFIEDX3004BH*/  03650000
*              3 EXLDFASA  BIT(1),          /* EXIT ACTIVE   X3004BH*/  03700000
*              3 EXLDFASK  BIT(1),          /* RESERVED - NOT           03730000
*                                              AVAILABLE     X3004BH*/  03760000
*              3 *         BIT(2),          /* RESERVED - NOT           03790000
*                                              AVAILABLE     X3004BH*/  03820000
*            2 EXLDFASP    PTR(31) BDY(BYTE); /* POINTER TO DFASY       03850000
*                                              EXIT          X3004BH*/  03900000
*     DCL  1 EXLRESP BASED(ADDR(EXLOPNF)),  /* BASE AT OPENADX3004BH*/  03950000
*            2 EXLRESPF    BIT(8),          /* RESP ENTRY               04000000
*                                              DESCRIPTION   X3004BH*/  04050000
*              3 EXLRESPS  BIT(1),          /* EXIT SPECIFIEDX3004BH*/  04100000
*              3 EXLRESPA  BIT(1),          /* EXIT ACTIVE   X3004BH*/  04150000
*              3 EXLRESPK  BIT(1),          /* RESERVED - NOT           04180000
*                                              AVAILABLE     X3004BH*/  04210000
*              3 *         BIT(2),          /* RESERVED - NOT           04240000
*                                              AVAILABLE     X3004BH*/  04270000
*            2 EXLRESPP    PTR(31) BDY(BYTE); /* POINTER TO RESP        04300000
*                                              EXIT          X3004BH*/  04350000
*%GOTO EXLEND;                              /* SKIP TO THE END OF       04400000
*                                              MACRO                */  04450000
* /*                                                                    04500000
*                    ASSEMBLER DSECT FOR EXTL VTAM EXTENSION        *   04550000
*                                                                   *   04600000
         MACRO                                                          04650000
         ISTEXLEX                                                       04700000
EXLNLGNF DS    XL1                          LOSTERM ENTRY               04800000
*                                           DESCRIPTION          X03004 04850000
EXLNLGNS EQU   X'80'                        LOSTERM EXIT PRESENT X03004 04900000
EXLNLGNA EQU   X'40'                        LOSTERM EXIT ACTIVE  X03004 04950000
EXLNLGNK EQU   X'20'                        RESERVED             X03004 05000000
EXLNLGNP DS    AL4                          LOSTERM EXIT ADDRESS X03004 05050000
EXLNLGNL EQU   45                           LENGTH OF LIST TO HERE -    05100000
*                                           45 BYTES (EQUATED VALUE;    05150000
*                                           NO BITS ACTUALLY SET)X03004 05200000
EXLRLRQF DS    XL1                          RELREQ ENTRY                05250000
*                                           DESCRIPTION          X03004 05300000
EXLRLRQS EQU   X'80'                        RELREQ EXIT PRESENT  X03004 05350000
EXLRLRQA EQU   X'40'                        RELREQ EXIT ACTIVE   X03004 05400000
EXLRLRQK EQU   X'20'                        RESERVED             X03004 05450000
EXLRLRQP DS    AL4                          RELREQ EXIT ADDRESS  X03004 05500000
EXLRLRQL EQU   50                           LENGTH OF LIST TO HERE -    05550000
*                                           50 BYTES (EQUATED VALUE;    05600000
*                                           NO BITS ACTUALLY SET)X03004 05650000
         DS    XL5                          RESERVED           @X50BHUC 05700000
EXLUNSPL EQU   55                           LENGTH OF LIST TO HERE -    05750000
*                                           55 BYTES (EQUATED VALUE;    05800000
*                                           NO BITS ACTUALLY SET)X03004 05850000
EXLATTNF DS    XL1                          ATTN ENTRY                  05900000
*                                           DESCRIPTION          X03004 05950000
EXLATTNS EQU   X'80'                        ATTN EXIT PRESENT    X03004 06000000
EXLATTNA EQU   X'40'                        ATTN EXIT ACTIVE     X03004 06050000
EXLATTNK EQU   X'20'                        RESERVED             X03004 06100000
EXLATTNP DS    AL4                          ATTN EXIT ADDRESS    X03004 06150000
EXLATTNL EQU   60                           LENGTH OF LIST TO HERE -    06200000
*                                           60 BYTES (EQUATED VALUE;    06250000
*                                           NO BITS ACTUALLY SET)X03004 06300000
EXLTPNDF DS    XL1                          TPEND ENTRY                 06350000
*                                           DESCRIPTION          X03004 06400000
EXLTPNDS EQU   X'80'                        TPEND EXIT PRESENT   X03004 06450000
EXLTPNDA EQU   X'40'                        TPEND EXIT ACTIVE    X03004 06500000
EXLTPNDK EQU   X'20'                        RESERVED             X03004 06550000
EXLTPNDP DS    AL4                          TPEND EXIT ADDRESS   X03004 06600000
EXLTPNDL EQU   65                           LENGTH OF LIST TO HERE -    06650000
*                                           65 BYTES (EQUATED VALUE;    06700000
*                                           NO BITS ACTUALLY SET)X03004 06750000
EXLTNSEF DS    XL1                          TPEND ENTRY                 06800000
*                                           DESCRIPTION         G40AKCM 06850000
EXLTNSES EQU   X'80'                        TPEND EXIT PRESENT  G40AKCM 06900000
EXLTNSEA EQU   X'40'                        TPEND EXIT ACTIVE   G40AKCM 06950000
EXLTNSEK EQU   X'20'                        RESERVED            G40AKCM 07000000
EXLTNSEP DS    AL4                         NSEXIT EXIT ADDRESS  G40AKCM 07050000
EXLTNSEL EQU   70                           LENGTH OF LIST TO HERE -    07100000
*                                           70 BYTES (EQUATED VALUE NO  07150000
*                                           BITS ACTUALLY SET)  G40AKCM 07200000
         ORG   EXLJRNF                      BASE AT JRNAD       X3004BH 07250000
EXLDFASF DS    XL1                          DFASY ENTRY         X3004BH 07300000
*                                           DESCRIPTION         X3004BH 07350000
EXLDFASS EQU   X'80'                        DFASY EXIT PRESENT  X3004BH 07400000
EXLDFASA EQU   X'40'                        DFASY EXIT ACTIVE   X3004BH 07450000
EXLDFASK EQU   X'20'                        RESERVED            X3004BH 07500000
EXLDFASP DS    AL4                          DFASY EXIT ADDRESS  X3004BH 07550000
EXLDFASL EQU   35                           LENGTH OF LIST TO HERE -    07600000
*                                           35 BYTES (EQUATED VALUE; NO 07650000
*                                           BITS ACTUALLY SET)  X3004BH 07700000
         ORG   EXLOPNF                      BASE AT OPENAD      X3004BH 07750000
EXLRESPF DS    XL1                          RESP ENTRY                  07800000
*                                           DESCRIPTION         X3004BH 07850000
EXLRESPS EQU   X'80'                        RESP EXIT PRESENT   X3004BH 07900000
EXLRESPA EQU   X'40'                        RESP EXIT ACTIVE    X3004BH 07950000
EXLRESPK EQU   X'20'                        RESERVED            X3004BH 08000000
EXLRESPP DS    AL4                          RESP EXIT ADDRESS   X3004BH 08050000
EXLRESPL EQU   40                           LENGTH OF LIST TO HERE -    08100000
*                                           40 BYTES (EQUATED VALUE; NO 08150000
*                                           BITS ACTUALLY SET)  X3004BH 08200000
         MEND                                                           08250000
*        END OF EXTL VTAM EXTENSION                                 */  08300000
*%EXLEND: ;                                                             08350000
