*%GOTO   RPLEXTPL;  /*                                                  00050000
         MACRO                                                 @R495808 00100000
         ISTRPLEX &GENEQU=                                     @R495808 00150000
         LCLC  &CHKASM                                             @N1A 00200000
         AIF   ('&GENEQU' EQ 'YES').EQU                        @R495808 00250000
         AGO   .RPLXBAL                                        @R495808 00300000
* ********************************************************************/ 00350000
* /*                                                                 */ 00400000
* /*     RPL VTAM EXTENSION                                          */ 00450000
* /*                                                                 */ 00500000
* /*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                */ 00550000
* /*                                                                 */ 00600000
* /*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM" */ 00650000
* /*                                                                 */ 00700000
* /*             5695-117 (C) COPYRIGHT IBM CORP. 1987, 1998.        */ 00750000
* /*             ALL RIGHTS RESERVED.                                */ 00800000
* /*                                                                 */ 00850000
* /*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -           */ 00900000
* /*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY        */ 00950000
* /*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.            */ 01000000
* /*                                                                 */ 01050000
* /*             SEE COPYRIGHT INSTRUCTIONS.                         */ 01100000
* /*                                                                 */ 01150000
* /*     ISTRPLEX is VTAM's mapping of the Request Parameter         */ 01200000
* /*     List (RPL), IFGRPL, which is passed to VTAM by the          */ 01250000
* /*     application.  The RPL is used by application programs       */ 01300000
* /*     as a parameter list to pass requests to VTAM.               */ 01350000
* /*                                                                 */ 01400000
* /*     It is called by the VSAM extension macro (IFGRPLVS)         */ 01450000
* /*     under the following conditions:                             */ 01500000
* /*                                                                 */ 01550000
* /*      PL/AS:  THE MODULE CONTAINING AN INCLUDE FOR IFGRPL SETS   */ 01600000
* /*              THE MACRO VARIABLE 'ACBRPLXL' TO 'VTAM' PRIOR      */ 01650000
* /*              TO ISSUING THE INCLUDE.                            */ 01700000
* /*        BAL:  THE AM=VTAM PARAMETER IS CODED ON THE MACRO        */ 01750000
* /*              CALL.                                              */ 01800000
* /*                                                                 */ 01850000
* /*     CHANGE ACTIVITY                                             */ 01900000
* /*     A87886,87986,104886                                 @ZM31226*/ 01950000
* /*     CBMM SPLIT SUPPORT                                  @ZA34940*/ 02000000
* /*             11/16/78  SNA4 SUPPORT                      @G69AKJP*/ 02050000
* /*             10/10/80  APAR OZ48668                      @AZ48668*/ 02100000
* /*             12/22/80  DCR  4747.00                      @D5B4747*/ 02150000
* /*             12/10/80  DCR  4747.02                      @D5B4747*/ 02200000
* /*             01/29/81  DCR  4790.00                      @D5P4790*/ 02250000
* /*             02/19/81  DCR  4792.00                      @D5K4792*/ 02300000
* /*             06/16/82  PTM  P011080                      @P011080*/ 02350000
* /*             01/21/83  DCR  4879.13                      @R487913*/ 02400000
* /*             04/12/83  PTM  P012727                      @P012727*/ 02450000
* /*             03/09/83  XRF  SUPPORT                      @R489301*/ 02500000
* /*             10/24/83  PTM  P014080                      @P014080*/ 02550000
* /*             09/08/83  XRF  SUPPORT                      @R489306*/ 02600000
* /*             11/04/83  APAR OZ66848                      @AZ66848*/ 02650000
* /*             11/16/83  DCR 4911.00                       @R491100*/ 02700000
* /*             01/09/84  DCR 4911.01                       @R491101*/ 02750000
* /*             06/11/84  DCR 4893.20                       @R489320*/ 02800000
* /*             11/01/85  DCR 5048.00                       @R504800*/ 02850000
* /*             12/29/85  DCR 4958.08                       @R495808*/ 02900000
* /*             10/20/86  ADD RPLCNTRU BIT FOR INQUIRE, CURRNTRU    */ 02950000
* /*                                                         @P041786*/ 03000000
* /*     02/04/87 - RESTORE RPL DSECT AFTER RPL6X            @P042186*/ 03050000
* /*     11/12/87 - RESUME DSECT NAME SET BY CALLER WHEN DSECT=NO,   */ 03100000
* /*                NOT ALWAYS IFGRPL                        @P051653*/ 03150000
* /*                                                                 */ 03200000
* /* $MAC(ISTRPLEX),COMP(API),PROD(VTAM): VTAM RPL EXTENSION         */ 03250000
* /*                                                                 */ 03300000
* /* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS           */ 03350000
* /* ---- -------- ------- ------ ------- -------------------------- */ 03400000
* /* $F1= FM8@@CLD HVT3302 890112 109772: MODEL TERMINAL SUPPORT     */ 03450000
* /* $D1= OSI00000 VM330   880318 737401: VCNS MACROS CREATION       */ 03500000
* /* $01= VM36562  HVT3303 891103 947688: IFGRPL NOT ALWAYS CALLED   */ 03550000
* /*                                      DSECT=YES                  */ 03600000
* /* $B1= AP@@@CLD HVT3401 890315 496698: PERSISTENT LU-LU SESSIONS  */ 03650000
* /* $B2= AA@@@MST HVT3401 891021 042845: CROSS-MEMORY API SUPPORT   */ 03700000
* /* $V1= P097154  HVT3401 910718 590029: DELETED AL X03004?? FLAGS  */ 03750000
* /* $KF= JN@@@CLD NQNAME1 910318 410106: ENHANCED NQN SUPPORT       */ 03800000
* /* $02= OY36649  VM340   911014 349122: QUEUED SESSION TERMINATION */ 03850000
* /*                                      SUPPORT (CLSDST & TERMSESS)*/ 03900000
* /* $N1= P100612  VM341   920225 086881: ALLOW RPL TO BE ADDED TO   */ 03950000
* /*                                      EXISTING DSECT OR CSECT    */ 04000000
* /* $KG= P105521  HATAPPN 921103 460208: RPLCHREQ TO RESERVED BIT   */ 04050000
* /* $I1= FG@@@MST GENRES  921109 879315: Generic Resource           */ 04100000
* /* $T1= P106969  HATAPPN 930121 379299: Replace RPLCHREQ bit       */ 04150000
* /* $U2= P110087  GENRES  930818 879315: Downward compatibility     */ 04200000
* /* $03= OY65532  EMERALD 930824 358168: IEV038 RECEIVED WHEN       */ 04250000
* /*                                      ASSEMBLING MODULE INVOKING */ 04300000
* /*                                      IFGRPL                     */ 04350000
* /* $U3= P109285  KEEPFRR 931104 879315: Implement FZKDR001, allow  */ 04400000
* /*                                      OPTCD=KEEPSRB/NKEEPSRB     */ 04450000
* /* $04= OY67066  EMERALD 940201 358168: Add support for INQUIRE    */ 04500000
* /*                                      OPTCD=STATUS (AE fix for   */ 04550000
* /*                                      OY63087)                   */ 04600000
* /* $D2= ID@@@MST FPAPI   941005 143576: HPDT API for APPC          */ 04625000
* /* $W1= P117054  VMVSCS  941028 947688: Add conditional CS         */ 04650000
* /* $D3= IT@@@MST TSOGR   941026 062811: TSO-Generic Resource       */ 04675000
* /* $F2= TNRAPI   CSV2R6  970815 MUELLERA: Add RPLTHRDC             */ 04687500
* /*******************************************************************/ 04700000
* /*                                                                 */ 04750000
*%RPLEXTPL: ;                                                           04800000
*             2 RPLVTEXT,                   /* START OF EXTENSION    */ 04850000
*              3 RPLAAREA    PTR(31),       /* ALTERNATE AREA ADDR      04900000
*                                                                    */ 04950000
*              3 RPLAARLN    PTR(31),       /* ALTERNATE AREA LENGTH    05000000
*                                                                    */ 05050000
*              3 RPLARCLN    PTR(31),       /* ALTERNATE RECORD         05100000
*                                              LENGTH                */ 05150000
*              3 RPLFDBK2    BIT(32) BDY(WORD), /* FEED BACK WORD 2     05200000
*                                                                    */ 05250000
*                  5 RPLSSNSI  BIT(16),     /* SYSTEM SENSE             05300000
*                                              INPUT                 */ 05350000
*                    6 RPLDSB  BIT(16),     /* DEVICE STATUS BYTES      05400000
*                                                                    */ 05450000
*                      7 RPLDSB1   BIT(8),  /* DEVICE STATUS BYTE 1     05500000
*                                                                    */ 05550000
*                        8 RPLSSEI BIT(8),  /* SYSTEM SENSE ERROR       05600000
*                                              CODES                 */ 05650000
*                          9 RPLPATHI BIT(1),/* SSENSEI PATH         */ 05700000
*                          9 RPLCPMI  BIT(1),/* SSENSEI CPM          */ 05750000
*                          9 RPLSTATI BIT(1),/* SSENSEI STATE        */ 05800000
*                          9 RPLFII   BIT(1),/* SSENSEI FI           */ 05850000
*                          9 RPLRRI   BIT(1),/* SSENSEI RR           */ 05900000
*                          9 *        BIT(3),/* RESERVED             */ 05950000
*                      7 RPLDSB2   BIT(8),  /* DEVICE STATUS BYTE 2     06000000
*                                                                    */ 06050000
*                        8 RPLSSMI PTR(8),  /* SYSTEM SENSE MODIFIER    06100000
*                                              INPUT                 */ 06150000
*                  5 RPLUSNSI  PTR(16),     /* USER SENSE               06200000
*                                              INPUT                 */ 06250000
*                    6 RPLESR1 BIT(8),      /* EXTENDED SYSTEM          06300000
*                                              RESPONSE 1            */ 06350000
*                    6 RPLESR2 BIT(8),      /* EXTENDED SYSTEM          06400000
*                                              RESPONSE 2            */ 06450000
*              3 RPLUSFLD    BIT(32),       /* USER FIELD            */ 06500000
*              3 RPLOPTC3    BIT(32),       /* VTAM OPTIONS          */ 06550000
*                4 RPLOPT9   BIT(8),        /* OPTION BYTE 9         */ 06600000
*                  5 RPLLOGON BIT(1),       /* INQ LOGON MESSAGE        06650000
*                                                                    */ 06700000
*                  5 RPLDEVCH BIT(1),       /* INQ DEVICE CHAR       */ 06750000
*                  5 RPLTERMS BIT(1),       /* INQ TERMS             */ 06800000
*                  5 RPLCOUNT BIT(1),       /* INQ COUNTS            */ 06850000
*                  5 RPLAPPST BIT(1),       /* INQ APPSTAT           */ 06900000
*                  5 RPLINQST BIT(1),       /* INQ STATUS        @04A*/ 06950000
*                  5 RPLCIDE  BIT(1),       /* INQ CIDXLATE          */ 07000000
*                  5 RPLTOPL  BIT(1),       /* INQ TOP LOGON         */ 07050000
*                4 RPLOPT10  BIT(8),        /* OPTION BYTE 10        */ 07100000
*                  5 RPLBSCID BIT(1),       /* INQ BSC ID            */ 07150000
*                  5 RPLDSPLY BIT(1),       /* INQ DISPLAY           */ 07200000
*                  5 RPLSPARM BIT(1),       /* INQ SESSPARM  @Z40BHUC*/ 07250000
*                  5 RPLTSKY  BIT(1),       /* INQ SESSKEY   @G40AKSL*/ 07300000
*                  5 RPLUSVAR BIT(1),       /* OPTCD = USERVAR          07350000
*                                                            @R489306*/ 07400000
*                  5 RPLUNBND BIT(1),       /* UNBIND (TERMSESS OPTION) 07450000
*                                                            @R491100*/ 07500000
*                  5 RPLSONOP BIT(1),       /* OPTCD=NSONCODE|SONCODE   07550000
*                                              0 = NSONCODE             07600000
*                                              1 = SONCODE   @R491100*/ 07650000
*                  5 RPLSENOP BIT(1),       /* OPTCD=NSENSE|SENSE       07700000
*                                              0 = NSENSE               07750000
*                                              1 = SENSE     @R491100*/ 07800000
*                4 RPLOPT11  BIT(8),        /* OPTION BYTE 11        */ 07850000
*                  5 RPLQUIES BIT(1),       /* SETLOGON QUIESCE         07900000
*                                                                    */ 07950000
*                  5 RPLSTART BIT(1),       /* SETLOGON START        */ 08000000
*                  5 RPLSTOP  BIT(1),       /* SETLOGON STOP         */ 08050000
*                  5 RPLHOLD  BIT(1),       /* HOLD (SETLOGON OPTION)   08100000
*                                                            @R491100*/ 08150000
*                  5 RPLCNTRU BIT(1),       /* INQUIRE - CURRENT RU     08200000
*                                                            @P041786*/ 08250000
*                  5 RPLMTS   BIT(1),       /* OPTCD = MTS       @F1C*/ 08300000
*                  5 RPLTERMQ BIT(1),       /* OPTCD = TERMQ     @02C*/ 08350000
*                  5 RPLKPSRB BIT(1),       /* OPTCD=KEEPSRB     @U3C*/ 08400000
*                    6 RPLFORCE BIT(0),     /* No longer supported,     08450000
*                                              ignored           @U3C*/ 08500000
*                4 RPLOPT12  BIT(8),        /* OPTION BYTE 12        */ 08550000
*                  5 RPLRSPQD BIT(1),       /* OPTCD=RSPQUED|NRSPQUED   08600000
*                                              0=NRSPQUED/1=RSPQUED     08650000
*                                                            @R491101*/ 08700000
*                  5 RPLKEEP  BIT(1),       /* RECEIVE KEEP          */ 08750000
*                  5 RPLTRUNC BIT(1),       /* RECEIVE TRUNC         */ 08800000
*                  5 RPLNIBTK BIT(1),       /* RECEIVE NIBTK         */ 08850000
*                  5 RPLQSESS BIT(1),       /* SMLG QSESSLIM @R504800*/ 08900000
*                  5 RPLQNOTE BIT(1),       /* SMLG QNOTENAB @R504800*/ 08950000
*                  5 RPLQALL  BIT(1),       /* SMLG QALL     @R504800*/ 09000000
*                  5 RPLFMHDR BIT(1),       /* 0=NFMHDR/1=FMHDR         09050000
*                                                                    */ 09100000
*              3 RPLOSENS    BIT(32) BDY(WORD), /* SENSE OUTPUT         09150000
*                                              DATA                  */ 09200000
*                4 RPLSSNSO  BIT(16),       /* SYSTEM SENSE             09250000
*                                              OUTPUT                */ 09300000
*                  5 RPLSSEO   BIT(8),      /* SYSTEM SENSE ERROR CODES 09350000
*                                                                    */ 09400000
*                    6 *        BIT(1),     /* RESERVED              */ 09450000
*                    6 RPLCPMO  BIT(1),     /* SSENSEO CPM           */ 09500000
*                    6 RPLSTATO BIT(1),     /* SSENSEO STATE         */ 09550000
*                    6 RPLFIO   BIT(1),     /* SSENSEO FI            */ 09600000
*                    6 RPLRRO   BIT(1),     /* SSENSEO RR            */ 09650000
*                    6 *        BIT(3),     /* RESERVED              */ 09700000
*                  5 RPLSSMO  PTR(8),       /* SYSTEM SENSE MODIFIER    09750000
*                                              OUTPUT                */ 09800000
*                4 RPLUSNSO  PTR(16),       /* USER SENSE               09850000
*                                              OUTPUT        @Y30ASHS*/ 09900000
*              3 RPLSAV13 PTR(31),          /* SAVE AREA FOR VTAM       09950000
*                                              FAST PATH     @Y30ASHS*/ 10000000
*              3 RPLSIGDA  PTR(31);         /* SIGNAL DATA FIELD        10050000
*                                                            @Z40BHUC*/ 10100000
*     DCL  1 *       BASED(ADDR(RPLECB)),   /* RPL EXIT ADDRESS FIELD   10150000
*                                                            @R487913*/ 10200000
*            2 RPLAMOD2 BIT(1);             /* SET BY VTAM--WHEN RPLECB 10250000
*                                              IS A ROUTINE POINTER,    10300000
*                                              COPY OF RPLAMODE         10350000
*                                                            @P012727*/ 10400000
*     DCL  1 RPLOF16 BASED(ADDR(RPLKEYLE)), /* BASE AT OFFSET           10450000
*                                              16                    */ 10500000
*            2 RPLRH3        BIT(8),        /* THIRD RH BYTE         */ 10550000
*              3 RPLBB       BIT(1),        /* BRACKET -                10600000
*                                              0=NBB 1=BB            */ 10650000
*              3 RPLEB       BIT(1),        /* BRACKET -                10700000
*                                              0=NEB 1=EB            */ 10750000
*              3 RPLCMD      BIT(1),        /* CHNGDIR -                10800000
*                                              0=NCMD 1=CMD          */ 10850000
*              3 RPLCHREQ    BIT(1),        /* Not used by VTAM, but    10900000
*                                              must be left in for      10950000
*                                              other products who may   11000000
*                                              clear this bit           11050000
*                                              explicitly   @KGC @T1C*/ 11100000
*              3 RPLCSI      BIT(1),        /* 0=STANDARD  -  CODESEL   11150000
*                                              1=ALT         @Z40BHUC*/ 11200000
*              3 *           BIT(2),        /* RESERVED      @D5P4790*/ 11250000
*              3 RPLCEB      BIT(1),        /* BRACKET-CONDITIONAL END  11300000
*                                              0=NCEB 1=CEB  @D5P4790*/ 11350000
*            2 RPLSRTYP      BIT(8),        /* SEND OR RECEIVE          11400000
*                                              TYPE                  */ 11450000
*              3 RPLSTYPE    BIT(4),        /* SEND TYPE             */ 11500000
*                4 RPLSRESP  BIT(1),        /* STYPE -                  11550000
*                                              0=REQ 1=RESP          */ 11600000
*                4 *         BIT(3),        /* RESERVED              */ 11650000
*              3 RPLRTYPE    BIT(4),        /* RECEIVE TYPE          */ 11700000
*                4 RPLRRESP  BIT(1),        /* RTYPE -                  11750000
*                                              1=RESP 0=NRESP        */ 11800000
*                4 RPLNFSYN  BIT(1),        /* RTYPE - 0=DFSYN          11850000
*                                              1=NDFSYN              */ 11900000
*                4 RPLDFASY  BIT(1),        /* RTYPE - 0=NDFASY         11950000
*                                              1=DFASY               */ 12000000
*                4 *         BIT(1),        /* RESERVED      @Z40BHUC*/ 12050000
*            2 RPLCHN        BIT(8),        /* POSITION IN RU CHAIN     12100000
*                                              AND APPC FLAGS        */ 12150000
*              3 RPLFIRST    BIT(1),        /* CHAIN FIRST           */ 12200000
*              3 RPLMIDLE    BIT(1),        /* CHAIN MIDDLE          */ 12250000
*              3 RPLLAST     BIT(1),        /* CHAIN LAST            */ 12300000
*              3 RPLONLY     BIT(1),        /* CHAIN ONLY            */ 12350000
*              3 RPLVACS     BIT(1),        /* 1=VTAM APPC CONTROLLED   12400000
*                                              SESSION (APPCCMD SHOULD  12450000
*                                              BE ISSUED)    @R495808*/ 12500000
*              3 RPLAPPC     BIT(1),        /* APPC FLAG                12550000
*                                              0=APPLICATION IS THE     12600000
*                                              REQUEST ORIGINATOR       12650000
*                                              1=APPC/VTAM IS THE       12700000
*                                              REQUEST ORIGINATOR       12750000
*                                                            @R495808*/ 12800000
*              3 *           BIT(2),        /* RESERVED              */ 12850000
*            2 RPLVTFL1      BIT(8),        /* VTAM FLAGS            */ 12900000
*              3 RPLXMEM     BIT(1),        /* 1=CROSS-MEMORY API MODE  12950000
*                                              REQUEST, 0=NOT A CROSS   13000000
*                                              MEMORY API MODE REQUEST  13050000
*                                                                @B2C*/ 13100000
*              3 RPLVTUSE    BIT(1),        /* 0=APPL 1=SYSTEM          13150000
*                                                                    */ 13200000
*              3 RPLAUTUS    BIT(1),        /* AUTHORIZED PROGRAM       13250000
*                                                            @AZ66848*/ 13300000
*              3 RPLTNDSP    BIT(1),        /* DOMAIN REQ    @G40AKCM*/ 13350000
*              3 RPLTLGAC    BIT(1),        /* LOGON ACCOMPLISHED       13400000
*                                                            @G40AKCM*/ 13450000
*              3 RPLAMODE    BIT(1),        /* SET BY VTAM--ADDRESSING  13500000
*                                              MODE IN WHICH RPL EXIT   13550000
*                                              WILL BE INVOKED. 1 MEANS 13600000
*                                              31-BIT MODE.  @P012727*/ 13650000
*              3 RPLRSPNM    BIT(1),        /* AT LEAST ONE RESPONSE    13700000
*                                              ON NORMAL FLOW INBOUND   13750000
*                                              RESPONSE QUEUE           13800000
*                                                            @R491101*/ 13850000
*              3 RPLRSPQR    BIT(1),        /* AT LEAST ONE QRI         13900000
*                                              RESPONSE ON NORMAL FLOW  13950000
*                                              INBOUND DATA QUEUE       14000000
*                                                            @R491101*/ 14050000
*            2 RPLVTFL2      BIT(8),        /* POST/RESPOND             14100000
*                                              FLAGS                 */ 14150000
*              3 RPLPOSTV    BIT(4),        /* POST FLAGS            */ 14200000
*                4 RPLSCHED  BIT(1),        /* POST -                   14250000
*                                              0=RESP 1=SCHED        */ 14300000
*                4 *         BIT(3),        /* RESERVED              */ 14350000
*              3 RPLRESP     BIT(4),        /* RESPOND FLAGS         */ 14400000
*                4 RPLQRI    BIT(1),        /* RESPOND -                14450000
*                                             0=NQREQ 1=QREQ @G40AKSL*/ 14500000
*                4 RPLEX     BIT(1),        /* RESPOND -                14550000
*                                              0=NEX 1=EX            */ 14600000
*                4 RPLNFME   BIT(1),        /* RESPOND -                14650000
*                                              0=FME 1=NFME          */ 14700000
*                4 RPLRRN    BIT(1),        /* RESPOND -                14750000
*                                              0=NRRN 1=RRN          */ 14800000
*            2 RPLCNTRL      CHAR(3),       /* RU CONTROL               14850000
*                                              CODES                 */ 14900000
*              3 RPLCNTDF    BIT(8),        /* DATA FLOW CONTROL        14950000
*                                              CODES                 */ 15000000
*                4 RPLDATA   BIT(1),        /* CONTROL DATA          */ 15050000
*                4 RPLCNCEL  BIT(1),        /* CONTROL CANCEL        */ 15100000
*                4 RPLQC     BIT(1),        /* CONTROL QC            */ 15150000
*                4 RPLQEC    BIT(1),        /* CONTROL QEC           */ 15200000
*                4 RPLCHASE  BIT(1),        /* CONTROL CHASE         */ 15250000
*                4 RPLRELQ   BIT(1),        /* CONTROL RELQ          */ 15300000
*                4 RPLQI     BIT(1),        /* RESERVED              */ 15350000
*                4 *         BIT(1),        /* RESERVED              */ 15400000
*              3 RPLCNTDC    BIT(8),        /* DATA FLOW CONTROL CTD    15450000
*                                                                    */ 15500000
*                4 RPLBID    BIT(1),        /* CONTROL BID           */ 15550000
*                4 RPLRTR    BIT(1),        /* CONTROL RTR           */ 15600000
*                4 RPLLUS    BIT(1),        /* CONTROL LUS           */ 15650000
*                4 RPLSIGNL  BIT(1),        /* CONTROL SIGNAL        */ 15700000
*                4 RPLTBIND  BIT(1),        /* CONTROL BIND  @G40AKSL*/ 15750000
*                4 RPLTUNBD  BIT(1),        /* CONTROL UNBIND           15800000
*                                                            @G40AKSL*/ 15850000
*                4 RPLSBI    BIT(1),        /* CONTROL SBI   @G40AKSL*/ 15900000
*                4 RPLBIS    BIT(1),        /* CONTROL BIS   @G40AKSL*/ 15950000
*              3 RPLCNTSC    BIT(8),        /* SESSION CONTROL          16000000
*                                              CODES                 */ 16050000
*                4 RPLSDT    BIT(1),        /* CONTROL SDT           */ 16100000
*                4 RPLCLEAR  BIT(1),        /* CONTROL CLEAR         */ 16150000
*                4 RPLSTSN   BIT(1),        /* CONTROL STSN          */ 16200000
*                4 RPLSHUTD  BIT(1),        /* CONTROL SHUTD         */ 16250000
*                4 RPLSHUTC  BIT(1),        /* CONTROL SHUTC         */ 16300000
*                4 RPLRQR    BIT(1),        /* CONTROL RQR           */ 16350000
*                4 RPLRSHUT  BIT(1),        /* CONTROL RSHUTD        */ 16400000
*                4 RPLSWTCH  BIT(1);        /* CONTROL=SWITCH           16450000
*                                                            @R489301*/ 16500000
*                                                                       16550000
*     DCL  1 RPLOF28 BASED(ADDR(RPLTCBPT)), /* BASE ON RPLTCBPT         16600000
*                                                            @D5B4747*/ 16650000
*            2 RPLUSERH CHAR(4),     /* USER RH              @D5B4747*/ 16700000
*              3 RPLURH   CHAR(3),   /* USER RH              @D5B4747*/ 16750000
*              3 RPLSONCD CHAR(1);   /* SON CODE (UNBIND TYPE CODE)     16800000
*                                                            @R491100*/ 16850000
*     DCL  1 RPLOF4  BASED(ADDR(RPLOPT4)),/* BASE ON RPLOPT4     @B1A*/ 16900000
*            2 RPLO4 BIT(8),         /* VTAM OPTION BYTE 4       @B1A*/ 16950000
*              3 RPLOPT4X BIT(8),    /* Extended OPTCD value     @I1A*/ 17000000
*                                                                       17050000
*              /* NOTE: The following RPLO4 indicators are defined for  17100000
*                 migration reference.  THE SEVEN INDICATORS BELOW ONLY 17150000
*                 HAVE MEANING WHEN RPLEXTOP IS SET OFF!!  If the       17200000
*                 RPLEXTOP indicator is on, the value of the byte is    17250000
*                 significant, not individual bit values.        @U2C*/ 17300000
*                                                                       17350000
*                4 RPLPERS  BIT(1),  /* SETLOGON PERSIST         @B1A*/ 17400000
*                4 RPLNPERS BIT(1),  /* SETLOGON NPERSIST        @B1A*/ 17450000
*                4 RPLINQPS BIT(1),  /* INQUIRE PERSESS          @B1A*/ 17500000
*                4 RPLOPRES BIT(1),  /* OPNDST RESTORE           @B1A*/ 17550000
*                4 RPLSLTMR BIT(1),  /* PSTIMER SPECIFIED ON THE        17600000
*                                       SETLOGON PERSIST MACRO   @B1A*/ 17650000
*                4 RPLNQN   BIT(1),  /* INQUIRE OPTCD=NQN        @KFC*/ 17700000
*                4 *        BIT(1),  /* RESERVED                 @I1C*/ 17750000
*                                                                       17800000
*              /* The following bit determines extended or non-extended 17850000
*                 use of the OPT4 byte.                          @I1A*/ 17900000
*                                                                       17950000
*                4 RPLEXTOP BIT(1);  /* 1=OPT4X contains an extended    18000000
*                                       OPTCD value, individual bit     18050000
*                                       indicators are not meaningful   18100000
*                                       0=individual bit indicators     18150000
*                                       in RPLO4 are meaningful  @I1A*/ 18200000
*                                                                       18250000
*     DCL  1 RPLOF56 BASED(ADDR(RPLOPT5)),/* BASE ON RPLOPT5 @G69AKJP*/ 18300000
*            2 RPLO5 BIT(8),         /* VTAM OPTION BYTE 5   @G69AKJP*/ 18350000
*              3 *   BIT(1),         /* RESERVED             @G96AKJP*/ 18400000
*              3 RPLTNFY BIT(1),     /* THIRD PARTY NOTIFY   @G69AKJP*/ 18450000
*              3 *   BIT(2),         /* RESERVED                 @F2A*/ 18475000
*              3 RPLTHRDC BIT(1),    /* CS/390 RESERVED          @F2A*/ 18500000
*              3 *   BIT(2),         /* RESERVED                 @F2C*/ 18525000
*              3 RPLCNDCS BIT(1);    /* Conditional CS (with RPLDLGIN): 18550000
*                                       RPLDLGIN=1 & RPLCNDCS=1 means   18600000
*                                       conditional CS mode,            18650000
*                                       RPLDLGIN=1 & RPLCNDCS=0 means   18700000
*                                       normal CS mode           @W1A*/ 18750000
*                                                                       18800000
*     DCL  1 RPLOF57 BASED(ADDR(RPLOPT6)),  /* BASE ON RPLOPT6          18850000
*                                                            @D5B4747*/ 18900000
*            2 RPLO6    BIT(8),      /* VTAM OPTION BYTE 6   @D5B4747*/ 18950000
*              3 *   BIT(5),         /* RESERVED                 @D2C*/ 18975000
*              3 RPLXBFL  BIT(1),    /* Extended Buffer List being      19000000
*                                       used                     @D2A*/ 19025000
*              3 RPLBUFFL BIT(1),    /* BUFFER LIST BEING USED          19050000
*                                                            @D5B4747*/ 19100000
*              3 RPLCONTC BIT(1),    /* CONTINUE CHAIN IF NEGATIVE      19150000
*                                       RESPONSE IS RECEIVED @D5B4747*/ 19200000
*            2 RPLO7    BIT(8),      /* VTAM OPTION BYTE 7   @D5B4747*/ 19250000
*              3 *   BIT(2),         /* RESERVED             @D5B4747*/ 19300000
*              3 RPLBCKUP  BIT(1),   /* OPTCD = BACKUP       @R489306*/ 19350000
*              3 *   BIT(4),         /* RESERVED             @D5B4747*/ 19400000
*              3 RPLLMPEO BIT(1),    /* VTAM IS TO ENFORCE MAXIMUM      19450000
*                                       RU SIZE              @D5B4747*/ 19500000
*            2 RPLO8    BIT(8),      /* VTAM OPTION BYTE 8   @D5B4747*/ 19550000
*              3 *   BIT(4),         /* RESERVED        @D5B4747 @D3C*/ 19570000
*              3 RPLMAXSP BIT(1),    /* MAXSESS SPECIFIED ON THE        19590000
*                                       SETLOGON GNAMEADD MACRO  @D3A*/ 19610000
*              3 *   BIT(2),         /* RESERVED                 @D3A*/ 19630000
*              3 RPLUSRRH BIT(1);    /* 1=OPTCD=USERRH SPECIFIED        19650000
*                                       0=OPTCD=NUSERRH SPECIFIED       19700000
*                                                            @D5B4747*/ 19750000
*                                                                       19800000
*     DCL  1 RPLOF60 BASED(ADDR(RPLRBAR)),  /* BASE AT OFFSET           19850000
*                                              60                    */ 19900000
*            2 RPLOBSQV      FIXED(16),     /* STSN OUTBOUND SEQ. NO.   19950000
*                                              SEQUENCE NUMBER OF       20000000
*                                              LAST RU OF A LARGE       20050000
*                                              MESSAGE SEND  @D5B4747*/ 20100000
*            2 RPLIBSQV      FIXED(16),     /* STSN INBOUND             20150000
*                                              SEQ. NO.              */ 20200000
*            2 RPLOBSQ       BIT(8),        /* STSN OUTBOUND ACTION     20250000
*                                              CODES                 */ 20300000
*              3 RPLOSET     BIT(1),        /* OBSQAC SET            */ 20350000
*              3 RPLOTST     BIT(1),        /* OBSQAC TESTSET        */ 20400000
*              3 RPLORSET    BIT(1),        /* OBSQAC RESET          */ 20450000
*              3 RPLOIGN     BIT(1),        /* OBSQAC IGNORE         */ 20500000
*              3 RPLOPOS     BIT(1),        /* OBSQAC TESTPOS        */ 20550000
*              3 RPLONEG     BIT(1),        /* OBSQAC TESTNEG        */ 20600000
*              3 RPLOINV     BIT(1),        /* OBSQAC INVALID        */ 20650000
*              3 *           BIT(1),        /* RESERVED              */ 20700000
*            2 RPLIBSQ       BIT(8),        /* STSN INBOUND ACTION      20750000
*                                              CODES                 */ 20800000
*              3 RPLISET     BIT(1),        /* IBSQAC SET            */ 20850000
*              3 RPLITST     BIT(1),        /* IBSQAC TESTSET        */ 20900000
*              3 RPLIRSET    BIT(1),        /* IBSQAC RESET          */ 20950000
*              3 RPLIIGN     BIT(1),        /* IBSQAC IGNORE         */ 21000000
*              3 RPLIPOS     BIT(1),        /* IBSQAC TESTPOS        */ 21050000
*              3 RPLINEG     BIT(1),        /* IBSQAC TESTNEG        */ 21100000
*              3 RPLIINV     BIT(1),        /* IBSQAC INVALID        */ 21150000
*              3 *           BIT(1),        /* RESERVED              */ 21200000
*            2 RPLSEQNO      FIXED(16);     /* SEQUENCE NUMBER       */ 21250000
*                                                                       21258300
*     DCL  1 RPLOF68 BASED(ADDR(RPLEXTDS)), /* BASE AT OFFSET 68 @D2A*/ 21266600
*            2 *             BIT(7),  /* See RPLEXTDS            @D2A*/ 21274900
*            2 RPLXSRV       BIT(1);  /* Entire XBUFLST accepted        21283200
*                                        by VTAM                 @D2A*/ 21291600
*     DCL      ISTRPL BASED (ADDR(IFGRPL))  /* ISTRPL LENGTH         */ 21300000
*                            CHAR(LENGTH(IFGRPL));                      21350000
*        %INCLUDE SYSLIB(ISTRPLFB)  ;       /* INCLUDE FEEDBACK CODES*/ 21400000
*                                           /* MACRO                 */ 21450000
*        %INCLUDE SYSLIB(ISTGLBAL)  ;       /* INCLUDE AMSI GLOBALS  */ 21500000
*                                           /* MACRO         @D5K4792*/ 21550000
*        %INCLUDE SYSLIB(ISTRPL6X)  ;       /* INCLUDE LU 6.2        */ 21600000
*                                           /* EXTENSION TO THE RPL  */ 21650000
*                                           /*               @R495808*/ 21700000
*                                                                       21750000
*/********************************************************************/ 21800000
*/* CONSTANT VALUES FOR "RPLOPT4X"                                   */ 21850000
*/********************************************************************/ 21900000
*/* The following constant values are allowed for Extended OPTCD     */ 21950000
*/* values in RPLOPT4X.  (NOTE:  All extended OPTCD values must have */ 22000000
*/* the low-order bit (RPLEXTOP) set on, to indicate that the byte   */ 22050000
*/* value of option byte 4 is significant rather than individual bit */ 22100000
*/* settings. This allows reuse of bits in other combinations to     */ 22150000
*/* give more possible OPTCDs.                                   @U2C*/ 22200000
*/********************************************************************/ 22250000
*   DCL RPLSTGNA BIT(8) CONSTANT('01'X);  /* SETLOGON GNAMEADD   @I1A*/ 22300000
*   DCL RPLSTGND BIT(8) CONSTANT('03'X);  /* SETLOGON GNAMEDEL   @I1A*/ 22350000
*   DCL RPLSTGNS BIT(8) CONSTANT('05'X);  /* SETLOGON GNAMESUB   @D3A*/ 22375000
*                                                                       22400000
*   DCL RPLIQSNM BIT(8) CONSTANT('21'X);  /* INQUIRE SESSNAME    @I1A*/ 22450000
*                                                                       22500000
*   DCL RPLCGEAF BIT(8) CONSTANT('41'X);  /* CHANGE ENDAFFIN     @I1A*/ 22550000
*                                                                       22600000
*/********************************************************************/ 22650000
*/*                                                                  */ 22700000
*/* THE FOLLOWING CONSTANT VALUES ARE THOSE ALLOWED TO BE RECORDED   */ 22750000
*/* IN "RPLREQ" AND/OR REGISTER 0 WHEN AN APPCCMD MACRO IS ISSUED.   */ 22800000
*/*                                                          @R495808*/ 22850000
*/********************************************************************/ 22900000
*     DCL  RPL6APPC BIT(8) CONSTANT ('62'X); /* RPLREQ VALUE            22950000
*                                          WHEN APPCCMD ISSUED          23000000
*                                          EXCEPT CONTROL=CHECK         23050000
*                                                            @R495808*/ 23100000
*     DCL  RPL6CHEK BIT(8) CONSTANT ('6C'X); /* RPLREQ VALUE            23150000
*                                          WHEN APPCCMD CONTROL=        23200000
*                                          CHECK IS ISSUED   @R495808*/ 23250000
*/********************************************************************/ 23300000
*/*                                                                  */ 23350000
*/* THE FOLLOWING CONSTANT VALUES ARE THOSE ALLOWED TO BE RECORDED   */ 23400000
*/* IN "RPLREQ" AND/OR REGISTER 0 WHEN A VCNSCMD MACRO IS ISSUED.    */ 23450000
*/*                                                              @D1A*/ 23500000
*/********************************************************************/ 23550000
*     DCL  RPL3VCNS BIT(8) CONSTANT ('32'X); /* REGISTER 0 AND          23600000
*                                          RPLREQ VALUE WHEN            23650000
*                                          A VCNSCMD IS ISSUED          23700000
*                                          EXCEPT CONTROL=CHECK         23750000
*                                                                @D1A*/ 23800000
*     DCL  RPL3CHEK BIT(8) CONSTANT ('3C'X); /* REGISTER 0 VALUE        23850000
*                                          WHEN A VCNSCMD CONTROL=      23900000
*                                          CHECK IS ISSUED              23950000
*                                                                @D1A*/ 24000000
*   GEN      (ISTRPLEX GENEQU=YES);          /*              @R495808*/ 24050000
*%GOTO   RPLEND;                                                        24100000
* /*                                                                    24150000
*                   ASSEMBLER DSECT FOR RPL VTAM EXTENSION          *   24200000
*                                                                   *   24250000
.RPLXBAL ANOP                                                  @R495808 24300000
RPLAAREA DS    A                               POINTER TO THE ALTERNATE 24350000
*                                              DATA AREA(VTAM) - INPUT  24400000
*                                              AREA FOR DATA RECEIVED   24450000
*                                              IN CONVERSATIONAL        24500000
*                                              MODE                     24550000
RPLAARLN DS    F                               ALTERNATE AREA           24600000
*                                              LENGTH(VTAM)             24650000
RPLARCLN DS    F                               ALTERNATE RECORD         24700000
*                                              LENGTH(VTAM)             24750000
RPLFDBK2 DS    0XL4                            FEEDBACK WORD TWO(VTAM)  24800000
*                                                                       24850000
RPLSSNSI DS    0XL2                            SYSTEM SENSE INPUT       24900000
*                                                                       24950000
RPLDSB   DS    0XL2                            DEVICE STATUS BYTE(VTAM) 25000000
*                                                                       25050000
RPLDSB1  DS    0XL1                            DEVICE STATUS BYTE 1     25100000
*                                                                       25150000
RPLSSEI  DS    XL1                             SYSTEM SENSE ERROR CODES 25200000
*                                                                       25250000
RPLPATHI EQU   X'80'                           PATH ERROR               25300000
RPLCPMI  EQU   X'40'                           CONNECTION POINT         25350000
*                                              MANAGER ERROR            25400000
RPLSTATI EQU   X'20'                           STATE ERROR              25450000
RPLFII   EQU   X'10'                           FUNCTION INTERPRETER     25500000
*                                              ERROR                    25550000
RPLRRI   EQU   X'08'                           REQUEST REJECT           25600000
RPLDSB2  DS    0XL1                            DEVICE STATUS BYTE 2     25650000
*                                                                       25700000
RPLSSMI  DS    XL1                             SYSTEM SENSE MODIFIER    25750000
*                                              INPUT                    25800000
RPLUSNSI DS    0XL2                            USER SENSE INPUT         25850000
RPLESR1  DS    XL1                             RESPONSE 1 FROM 3270     25900000
*                                              CONTROL UNIT             25950000
RPLESR2  DS    XL1                             RESPONSE 2 FROM 3270     26000000
*                                              CONTROL UNIT             26050000
RPLUSFLD DS    XL4                             USER FIELD(VTAM) - AT    26100000
*                                              OPNDST TIME THE CONTENTS 26150000
*                                              ARE SAVED FOR EACH       26200000
*                                              TERMINAL AND RETURNED    26250000
*                                              TO THE RPL ON COMPLETION 26300000
*                                              OF ANY REQUEST FOR OR BY 26350000
*                                              THAT TERMINAL            26400000
RPLOPTC3 DS    0XL4                            VTAM OPTIONS             26450000
RPLOPT9  DS    XL1                             OPTION BYTE 9            26500000
RPLLOGON EQU   X'80'                           PASS THE LOGON MESSAGE   26550000
*                                              TO THE APPLICATION       26600000
RPLDEVCH EQU   X'40'                           PASS THE DEVICE          26650000
*                                              CHARACTERISTICS TO THE   26700000
*                                              APPLICATION              26750000
RPLTERMS EQU   X'20'                           PASS THE SYMBOLIC NAME   26800000
*                                              OF THE TERMINAL AND ITS  26850000
*                                              CHARACTERISTICS TO       26900000
*                                              THE APPLICATION          26950000
RPLCOUNT EQU   X'10'                           PASS THE NUMBER OF       27000000
*                                              ACTIVE CONNECTIONS AND   27050000
*                                              QUEUED LOGON REQUESTS    27100000
*                                              TO THE APPLICATION       27150000
RPLAPPST EQU   X'08'                           INDICATE THE APPLICATION 27200000
*                                              STATUS                   27250000
RPLRNNM  EQU   X'00'                           RETIRED SYMBOL-FUNCTION  27300000
*                                              NO LONGER SUPPORTED      27350000
*                                                                  @04C 27400000
RPLINQST EQU   X'04'                           INQUIRE OPTCD=STATUS     27450000
*                                                                  @04A 27500000
RPLCIDE  EQU   X'02'                           INDICATE THE SYMBOLIC    27550000
*                                              NAME CORRESPONDING TO    27600000
*                                              THE COMMUNICATION        27650000
*                                              IDENTIFIER               27700000
RPLTOPL  EQU   X'01'                           PASS THE SYMBOLIC NAME   27750000
*                                              OF THE FIRST TERMINAL    27800000
*                                              ON THE LOGON QUEUE       27850000
RPLOPT10 DS    XL1                             OPTION BYTE 10           27900000
RPLBSCID EQU   X'80'                           PASS THE HARDWARE        27950000
*                                              IDENTIFIER OF A BINARY   28000000
*                                              SYNCHRONOUS TERMINAL     28050000
*                                                                       28100000
RPLDSPLY EQU   X'40'                           DISPLAY INFORMATION FROM 28150000
*                                              THE NETWORK OPERATOR     28200000
*                                              CONTROL                  28250000
RPLSPARM EQU   X'20'                           SESSPARM        @Z40BHUC 28300000
RPLTSKY  EQU   X'10'                           SESSKEY         @G40AKSL 28350000
RPLUSVAR EQU   X'08'                           OPTCD = USERVAR @R489306 28400000
RPLUNBND EQU   X'04'                           OPTCD = UNBIND  @R491100 28450000
RPLSONOP EQU   X'02'                           OPTCD = SONCODE @R491100 28500000
RPLSENOP EQU   X'01'                           OPTCD = SENSE   @R491100 28550000
RPLOPT11 DS    XL1                             OPTION BYTE 11           28600000
RPLQUIES EQU   X'80'                           STOP ACCEPTING LOGONS    28650000
*                                              AS THE APPLICATION IS    28700000
*                                              PREPARING TO SHUTDOWN    28750000
*                                              (USED WITH SETLOGON)     28800000
*                                                                       28850000
RPLSTART EQU   X'40'                           START ACCEPTING LOGONS   28900000
*                                              WHICH WERE TEMPORARILY   28950000
*                                              STOPPED                  29000000
RPLSTOP  EQU   X'20'                           STOP ACCEPTING LOGONS    29050000
*                                              TEMPORARILY (USED WITH   29100000
*                                              SETLOGON)                29150000
RPLHOLD  EQU   X'10'                           HOLD LOGONS (USED WITH   29200000
*                                              SETLOGON)       @R491100 29250000
RPLCNTRU EQU   X'08'                           INQUIRE - CURRENT RU     29300000
*                                                              @P041786 29350000
RPLMTS   EQU   X'04'                           OPTCD = MTS         @F1A 29400000
RPLTERMQ EQU   X'02'                           OPTCD = TERMQ       @02A 29450000
RPLKPSRB EQU   X'01'                           OPTCD=KEEPSRB       @U2C 29500000
RPLFORCE EQU   X'00'                           NO LONGER SUPPORTED,     29550000
*                                              IGNORED             @U2C 29600000
RPLOPT12 DS    XL1                             OPTION BYTE 12           29650000
RPLRSPQD EQU   X'80'                           OPTCD=RSPQUED|NRSPQUED   29700000
*                                              0=NRSPQUED/1=RSPQUED     29750000
*                                                              @R491101 29800000
RPLKEEP  EQU   X'40'                           KEEP OVERLENGTH DATA ON  29850000
*                                              INPUT QUEUE              29900000
RPLTRUNC EQU   X'20'                           TRUNCATE OVERLENGTH      29950000
*                                              DATA                     30000000
RPLNIBTK EQU   X'10'                           USE KEEP OR TRUNCATE     30050000
*                                              OPTION SET IN NIB AT     30100000
*                                              OPENDST                  30150000
RPLQSESS EQU   X'08'                           QUEUE SIMLOGONS FOR      30200000
*                                              LU AT SESSION LIMIT      30250000
*                                                              @R504800 30300000
RPLQNOTE EQU   X'04'                           QUEUE SIMLOGONS FOR      30350000
*                                              LU NOT ENABLED           30400000
*                                                              @R504800 30450000
RPLQALL  EQU   X'02'                           QUEUE SIMLOGONS FOR      30500000
*                                              ALL CASES                30550000
*                                                              @R504800 30600000
RPLFMHDR EQU   X'01'                           1=FUNCTION MANAGEMENT    30650000
*                                              HEADER INCLUDED IN DATA  30700000
*                                              STREAM                   30750000
RPLOSENS DS    0XL4                            SENSE OUTPUT DATA        30800000
RPLSSNSO DS    0XL2                            SYSTEM SENSE OUTPUT      30850000
*                                                                       30900000
RPLSSEO  DS    XL1                             SYSTEM SENSE ERROR       30950000
*                                              CODES                    31000000
RPLCPMO  EQU   X'40'                           CONNECTION POINT MANAGER 31050000
*                                              ERROR                    31100000
RPLSTATO EQU   X'20'                           STATE ERROR              31150000
RPLFIO   EQU   X'10'                           FUNCTION INTERPRETER     31200000
*                                              ERROR                    31250000
RPLRRO   EQU   X'08'                           REQUEST REJECT           31300000
RPLSSMO  DS    XL1                             SYSTEM SENSE MODIFIER    31350000
*                                              CODES                    31400000
RPLUSNSO DS    XL2                             USER SENSE OUTPUT        31450000
RPLSAV13 DS    XL4                             SAVE AREA FOR VTAM       31500000
*                                              FAST PATH       @ZM31226 31550000
RPLSIGDA DS    XL4                             SIGNAL DATA FLD @Z40BHUC 31600000
*              END OF VTAM EXTENSION                           @Z40BHUC 31650000
         ORG   RPLECB                                          @R487913 31700000
RPLAMOD2 EQU   X'80'                   SET BY VTAM--WHEN RPLECB IS A    31750000
*                                      ROUTINE POINTER, COPY OF         31800000
*                                      RPLAMODE                @P014080 31850000
         ORG   ,                       RESTORE LOCATION CTR.   @R487913 31900000
         ORG   RPLKEYLE                                                 31950000
RPLRH3   DS    XL1                     THIRD REQUEST HEADER BYTE        32000000
RPLBB    EQU   X'80'                   BEGIN BRACKET                    32050000
RPLEB    EQU   X'40'                   END BRACKET                      32100000
RPLCMD   EQU   X'20'                   CHANGE DIRECTION FROM SEND       32150000
*                                      TO RECEIVE IMMEDIATELY           32200000
RPLCHREQ EQU   X'10'                   NOT USED BY VTAM - MIGRATION     32250000
*                                      ONLY                        @T1A 32300000
RPLCSI   EQU   X'08'                   0=STANDARD - CODESEL    @Z40BHUC 32350000
*                                      1=ALTERNATE             @Z40BHUC 32400000
RPLCEB   EQU   X'01'                   BRACKET - CONDITIONAL END        32450000
*                                      0 = NCEB/1 = CEB        @D5P4790 32500000
RPLSRTYP DS    XL1                     SEND OR RECEIVE TYPE             32550000
RPLSRESP EQU   X'80'                   A RESPONSE IS BEING SENT; IF 0,  32600000
*                                      A NEW REQUEST IS BEING SENT      32650000
*                                                                       32700000
RPLRRESP EQU   X'08'                   RECEIVE THE FIRST RESPONSE FROM  32750000
*                                      THE RESPONSE QUEUE               32800000
RPLNFSYN EQU   X'04'                   IF 0, RECEIVE THE FIRST UNIT     32850000
*                                      FROM THE DATA FLOW SYNCHRONOUS   32900000
*                                      QUEUE                            32950000
RPLDFASY EQU   X'02'                   RECEIVE THE FIRST UNIT FROM THE  33000000
*                                      DATA FLOW ASYNCHRONOUS QUEUE     33050000
*                                                                       33100000
RPLCHN   DS    XL1                     POSITION IN REQUEST UNIT CHAIN   33150000
*                                      AND APPC FLAGS                   33200000
RPLFIRST EQU   X'80'                   FIRST IN RU CHAIN                33250000
RPLMIDLE EQU   X'40'                   AN INTERMEDIATE RU               33300000
RPLLAST  EQU   X'20'                   LAST IN RU CHAIN                 33350000
RPLONLY  EQU   X'10'                   ONLY ONE RU IN CHAIN             33400000
RPLVACS  EQU   X'08'                   APPC/NON-APPC LOGON OR SCIP EXIT 33450000
*                                      0=NON-APPC, 1=APPC      @R495808 33500000
RPLAPPC  EQU   X'04'                   APPC FLAG                        33550000
*                                      0=APPLICATION IS THE REQUEST     33600000
*                                      ORIGINATOR, 1=APPC/VTAM IS THE   33650000
*                                      REQUEST ORIGINATOR      @R495808 33700000
RPLVTFL1 DS    XL1                     VTAM FLAGS                       33750000
RPLXMEM  EQU   X'80'                   CROSS-MEMORY API MODE INDICATOR  33800000
*                                      1=CROSS-MEMORY MODE RPL, 0=NOT A 33850000
*                                      CROSS-MEMORY MODE RPL       @B2C 33900000
RPLVTUSE EQU   X'40'                   THIS IS A VTAM SYSTEM RPL; IF 0, 33950000
*                                      THIS IS A USER RPL               34000000
RPLAUTUS EQU   X'20'                   VTAM FAST PATH          @ZM31226 34050000
RPLTNDSP EQU   X'10'                   1=DOMAIN REQUEST        @G40AKCM 34100000
RPLTLGAC EQU   X'08'                   1=LOGON ACCOMPLISHED    @G40AKCM 34150000
RPLAMODE EQU   X'04'                   SET BY VTAM--ADDRESSING MODE     34200000
*                                      IN WHICH RPL EXIT WILL BE        34250000
*                                      INVOKED. 1 MEANS 31-BIT MODE     34300000
*                                                              @P014080 34350000
RPLRSPNM EQU   X'02'                   AT LEAST ONE RESPONSE ON NORMAL  34400000
*                                      FLOW INBOUND RESPONSE QUEUE      34450000
*                                                              @R491101 34500000
RPLRSPQR EQU   X'01'                   AT LEAST ONE QRI RESPONSE ON     34550000
*                                      NORMAL FLOW INBOUND DATA         34600000
*                                      QUEUE                   @R491101 34650000
RPLVTFL2 DS    XL1                     POST/RESPOND FLAGS               34700000
RPLSCHED EQU   X'80'                   POST THE RPL WHEN THE REQUEST    34750000
*                                      HAS BEEN SCHEDULED; IF 0, POST   34800000
*                                      THE RPL WHEN THE RESPONSE        34850000
*                                      HAS ARRIVED                      34900000
RPLQRI   EQU   X'08'                   IF ON THEN QUEUE AL RESPONSES    34950000
*                                      IF OFF DONT QUEUE       @G40AKSL 35000000
RPLEX    EQU   X'04'                   RETURN ONLY EXCEPTION RESPONSES  35050000
*                                      (WITH SEND) OR THIS IS AN        35100000
*                                      EXCEPTION RESPONSE (WITH         35150000
*                                      RECEIVE); IF 0, RETURN ALL       35200000
*                                      RESPONSES                        35250000
RPLNFME  EQU   X'02'                   IF 0, RETURN A FUNCTIONAL        35300000
*                                      MANAGEMENT END RESPONSE (WITH    35350000
*                                      SEND) OR THIS IS A FUNCTIONAL    35400000
*                                      MANAGEMENT END RESPONSE (WITH    35450000
*                                      RECEIVE)                         35500000
RPLRRN   EQU   X'01'                   RETURN A REACHED RECOVERY        35550000
*                                      NODE RESPONSE (WITH SEND)        35600000
*                                      OR THIS IS A REACHED RECOVERY    35650000
*                                      NODE RESPONSE (WITH              35700000
*                                      RECEIVE)                         35750000
RPLCNTRL DS    0XL3                    REQUEST UNIT CONTROL CODES       35800000
*                                                                       35850000
RPLCNTDF DS    XL1                     DATA FLOW CONTROL CODES          35900000
RPLDATA  EQU   X'80'                   DATA REQUEST, NOT A CONTROL      35950000
*                                      CODE                             36000000
RPLCNCEL EQU   X'40'                   CANCEL REQUEST UNIT CHAIN        36050000
RPLQC    EQU   X'20'                   THE QUIESCE IS COMPLETE(FOLLOWS  36100000
*                                      QEC)                             36150000
RPLQEC   EQU   X'10'                   QUIESCE AT THE END OF THE        36200000
*                                      CURRENT REQUEST UNIT CHAIN       36250000
*                                                                       36300000
RPLCHASE EQU   X'08'                   SEND ALL OUTSTANDING RESPONSES   36350000
*                                      FOLLOWED BY THE CHASE RESPONSE   36400000
*                                                                       36450000
RPLRELQ  EQU   X'04'                   QUIESCE IS RELEASED              36500000
RPLQI    EQU   X'02'                   RESERVED                         36550000
RPLCNTDC DS    XL1                     DATA FLOW CONTROL CODES          36600000
RPLBID   EQU   X'80'                   REQUEST PERMISSION TO BEGIN      36650000
*                                      BRACKET                          36700000
RPLRTR   EQU   X'40'                   READY TO RECEIVE                 36750000
RPLLUS   EQU   X'20'                   LOGICAL UNIT STATUS              36800000
RPLSIGNL EQU   X'10'                   SIGNAL DATA AVAILABLE            36850000
RPLTBIND EQU   X'08'                   BIND                    @G40AKCM 36900000
RPLTUNBD EQU   X'04'                   UNBIND                  @G40AKCM 36950000
RPLSBI   EQU   X'02'                   SBI                     @G40AKCM 37000000
RPLBIS   EQU   X'01'                   BIS                     @G40AKCM 37050000
RPLCNTSC DS    XL1                     SESSION CONTROL CODES            37100000
RPLSDT   EQU   X'80'                   START DATA TRAFFIC               37150000
RPLCLEAR EQU   X'40'                   CLEAR ALL DATA TRAFFIC FOR       37200000
*                                      THIS SESSION                     37250000
RPLSTSN  EQU   X'20'                   SET AND TEST SEQUENCE            37300000
*                                      NUMBERS                          37350000
RPLSHUTD EQU   X'10'                   SHUTDOWN IS REQUESTED            37400000
RPLSHUTC EQU   X'08'                   SHUTDOWN IS COMPLETE             37450000
RPLRQR   EQU   X'04'                   REQUEST RECOVERY OF SESSION      37500000
*                                                                       37550000
RPLRSHUT EQU   X'02'                   REQUEST SHUTDOWN                 37600000
*                                                              @G69AKJP 37650000
RPLSWTCH EQU   X'01'                   CONTROL=SWITCH          @R489301 37700000
         ORG   RPLTCBPT                                        @D5B4747 37750000
RPLURH   DS    XL3                     USER RH                 @D5B4747 37800000
RPLSONCD DS    XL1                     SON CODE (UNBIND TYPE CODE)      37850000
*                                                              @R491100 37900000
         ORG   RPLOPT4                                             @B1A 37950000
RPLO4    DS    0XL1                     VTAM OPTION BYTE 4         @I1C 38000000
*                                                                  @B1A 38050000
*********************************************************************** 38100000
** NOTE:  THE FOLLOWING RPLO4 INDICATORS ARE DEFINED FOR MIGRATION    * 38150000
** REFERENCE.  THE SEVEN BIT INDICATORS BELOW ONLY HAVE MEANING WHEN  * 38200000
** RPLEXTOP IS SET OFF!!  IF THE RPLEXTOP INDICATOR IS ON, THE VALUE  * 38250000
** OF THE ENTIRE BYTE IS SIGNIFICANT, NOT THE INDIVIDUAL BIT VALUES.  * 38300000
**                                                                 @U2C 38350000
*********************************************************************** 38400000
* The following OPTCD indicators can be set/reset with OI and NI      * 38450000
* Example:  (Setup RPL for INQUIRE OPTCD=NQN)                         * 38500000
*          NI   RPLO4,X'FF'-RPLEXTOP     RESET RPLEXTOP               * 38550000
*          OI   RPLOP4,RPLNQN            SETUP RPL FOR OPTCD=NQN      * 38600000
*********************************************************************** 38650000
RPLPERS  EQU   X'80'                    SETLOGON PERSIST           @B1A 38700000
RPLNPERS EQU   X'40'                    SETLOGON NPERSIST          @B1A 38750000
RPLINQPS EQU   X'20'                    INQUIRE PERSESS            @B1A 38800000
RPLOPRES EQU   X'10'                    OPNDST RESTORE             @B1A 38850000
RPLSLTMR EQU   X'08'                    PSTIMER ON SETLOGON PERSIST@B1A 38900000
RPLNQN   EQU   X'04'                    INQUIRE OPTCD=NQN          @KFA 38950000
*        EQU   X'02'                    RESERVED                   @U2A 39000000
*                                                                       39050000
** THE FOLLOWING BIT DETERMINES OPT4 EXTENDED OR NON-EXTENDED USE  @I1A 39100000
RPLEXTOP EQU   X'01'                    1=AN EXTENDED OPTCD VALUE IS    39150000
*                                       IN RPLOPT4X, INDIVIDUAL RPLO4   39200000
*                                       BITS ARE NOT MEANINGFUL    @U2C 39250000
*                                       0=INDIVIDUAL BITS IN RPLO4 ARE  39300000
*                                       MEANINGFUL IN NON-EXTENDED      39350000
*                                       OPTCD COMBINATIONS         @U2C 39400000
*                                                                       39450000
RPLOPT4X DS    XL1                      EXTENDED OPTCD VALUE BYTE  @I1A 39500000
*                                                                       39550000
*********************************************************************** 39600000
* Extended OPTCDs are byte values which are set in RPLOPT4X.  The low * 39650000
* order bit must be on in all extended OPTCD values to distinguish    * 39700000
* them from RPLO4 bit indicators.                                     * 39750000
* The following defined values can be set in RPLOPT4X with MVI instr. * 39800000
* Example:   MVI RPLOPT4X,RPLSTGNA     SETUP RPL FOR SETLOGON GENADD  * 39850000
*********************************************************************** 39900000
** SETLOGON EXTENDED OPTCD VALUES                                  @I1A 39950000
RPLSTGNA EQU   X'01'                    SETLOGON OPTCD=GNAMEADD    @U2C 40000000
RPLSTGND EQU   X'03'                    SETLOGON OPTCD=GNAMEDEL    @U2C 40050000
RPLSTGNS EQU   X'05'                    SETLOGON OPTCD=GNAMESUB    @D3A 40075000
*                                                                       40100000
** INQUIRE  EXTENDED OPTCD VALUES                                  @I1A 40150000
RPLIQSNM EQU   X'21'                    INQUIRE OPTCD=SESSNAME     @U2C 40200000
*                                                                       40250000
** CHANGE   EXTENDED OPTCD VALUES                                  @I1A 40300000
RPLCGEAF EQU   X'41'                    CHANGE OPTCD=ENDAFFIN      @U2C 40350000
*********************************************************************** 40400000
*                                                                  @B1A 40450000
         ORG   RPLOPT5                                         @G69AKJP 40500000
RPLO5    DS    XL1                      VTAM OPTION BYTE 5     @G69AKJP 40550000
*                                                              @G69AKJP 40600000
RPLTNFY  EQU   X'40'                    THIRD PARTY NOTIFY     @G69AKJP 40650000
RPLTHRDC EQU   X'08'                    CS/390 INTERNAL USE ONLY   @F2A 40675000
RPLCNDCS EQU   X'01'                    CONDITIONAL CS MODE        @W1A 40700000
*                                       (USED ALONG WITH RPLDLGIN:      40750000
*                                        RPLDLGIN=1 & RPLCNDCS=1        40800000
*                                        means conditional CS mode,     40850000
*                                        RPLDLGIN=1 & RPLCNDCS=0        40900000
*                                        means normal CS mode)     @W1A 40950000
         ORG   RPLOPT6                                         @D5B4747 41000000
RPLO6    DS    XL1                      VTAM OPTION BYTE 6     @D5B4747 41050000
*                                                              @G69AKJP 41100000
RPLXBFL  EQU   X'04'                    1=Extended buffer list     @D2A 41116600
*                                       being used                 @D2A 41133200
RPLBUFFL EQU   X'02'                    1=BUFFER LIST BEING             41150000
*                                       USED                   @D5B4747 41200000
RPLCONTC EQU   X'01'                    1=CONTINUE CHAIN IF NEGATIVE    41250000
*                                       REPONSE IS RECEIVED    @D5B4747 41300000
         ORG   RPLOPT7                                         @D5B4747 41350000
RPLO7    DS    XL1                      VTAM OPTION BYTE 7     @D5B4747 41400000
*                                                              @D5B4747 41450000
RPLBCKUP EQU   X'20'                    OPTCD = BACKUP         @R489306 41500000
RPLLMPEO EQU   X'01'                    1=VTAM IS TO ENFORCE MAXIMUM    41550000
*                                       RU SIZE                @D5B4747 41600000
         ORG   RPLOPT8                                         @D5B4747 41650000
RPLO8    DS    XL1                      VTAM OPTION BYTE 8     @D5B4747 41700000
*                                                              @D5B4747 41750000
RPLMAXSP EQU   X'08'                    1=MAXSESS SPECIFIED ON THE      41766600
*                                       SETLOGON GNAMEADD MACRO    @D3A 41783200
RPLUSRRH EQU   X'01'                    1=OPTCD=USERRH SPECIFIED        41800000
*                                       0=OPTCD=NUSERRH SPECIFIED       41850000
*                                                              @D5B4747 41900000
         ORG   RPLRBAR                                                  41950000
RPLOBSQV DS    AL2                     STSN OUTBOUND SEQUENCE           42000000
*                                      SEQUENCE NUMBER OF LAST RU OFA   42050000
*                                      LARGE MESSAGE SEND      @D5B4747 42100000
RPLIBSQV DS    AL2                     STSN INBOUND SEQUENCE            42150000
*                                      NUMBER                           42200000
RPLOBSQ  DS    XL1                     STSN OUTBOUND ACTION CODES       42250000
*                                                                       42300000
RPLOSET  EQU   X'80'                   SET THE OUTBOUND SEQUENCE        42350000
*                                      NUMBER                           42400000
RPLOTST  EQU   X'40'                   SET THE OUTBOUND SEQUENCE        42450000
*                                      NUMBER UNCONDITIONALLY AND       42500000
*                                      INDICATE IF ACCEPTABLE           42550000
RPLORSET EQU   X'20'                   RESET THE OUTBOUND SEQUENCE      42600000
*                                      TO THE DEFAULT VALUE(0)          42650000
RPLOIGN  EQU   X'10'                   IGNORE THE OUTBOUND SEQUENCE     42700000
*                                      NUMBER                           42750000
RPLOPOS  EQU   X'08'                   THE OUTBOUND SEQUENCE NUMBER     42800000
*                                      IS ACCEPTABLE (FOLLOWS TESTSET)  42850000
*                                                                       42900000
RPLONEG  EQU   X'04'                   THE OUTBOUND SEQUENCE NUMBER     42950000
*                                      IS NOT ACCEPTABLE (FOLLOWS       43000000
*                                      TESTSET)                         43050000
RPLOINV  EQU   X'02'                   THE OUTBOUND SEQUENCE NUMBER     43100000
*                                      IS INVALID                       43150000
RPLIBSQ  DS    XL1                     STSN INBOUND ACTION CODES        43200000
*                                                                       43250000
RPLISET  EQU   X'80'                   SET THE INBOUND SEQUENCE         43300000
*                                      NUMBER                           43350000
RPLITST  EQU   X'40'                   SET THE INBOUND SEQUENCE         43400000
*                                      NUMBER UNCONDITIONALLY AND       43450000
*                                      INDICATE IF ACCEPTABLE           43500000
RPLIRSET EQU   X'20'                   RESET THE INBOUND SEQUENCE       43550000
*                                      TO THE DEFAULT VALUE(0)          43600000
RPLIIGN  EQU   X'10'                   IGNORE THE INBOUND SEQUENCE      43650000
*                                      NUMBER                           43700000
RPLIPOS  EQU   X'08'                   THE INBOUND SEQUENCE NUMBER      43750000
*                                      IS ACCEPTABLE (FOLLOWS TESTSET)  43800000
*                                                                       43850000
RPLINEG  EQU   X'04'                   THE INBOUND SEQUENCE NUMBER      43900000
*                                      IS NOT ACCEPTABLE (FOLLOWS       43950000
*                                      TESTSET)                         44000000
RPLIINV  EQU   X'02'                   THE INBOUND SEQUENCE NUMBER      44050000
*                                      IS INVALID                       44100000
RPLSEQNO DS    AL2                     RESPONSE SEQUENCE NUMBER         44150000
*                                      IDENTIFIER                       44200000
         ORG   RPLEXTDS                Overlay for RPLEXTDS        @D2A 44210000
RPLOF68  DS    XL1                                                 @D2A 44220000
RPLXSRV  EQU   X'01'                   Entire XBUFLST accepted     @D2A 44230000
*                                      by VTAM                     @D2A 44240000
         ORG ,                                                 @AZ48668 44250000
         ISTRPLFB ,                    INCLUDE FEEDBACK CODES           44300000
         ISTGLBAL ,                    INCLUDE AMSI GLOBALS    @D5K4792 44350000
         ISTRPL6X ,    INCLUDE LU 6.2 NON-CONTIGUOUS EXTENSION @R495808 44400000
         AIF (T'&CHKASM EQ 'O').GOTASMH  CHECK ASSEMBLER LEVEL     @N1A 44450000
&SYSECT  DSECT                     RETURN TO DSECT OF THE RPL  @P051653 44500000
         AGO   .ORGSEC                                             @N1A 44550000
.GOTASMH ANOP                      ASSEMBLER H LEVEL               @N1A 44600000
         AIF ('&SYSECT' NE 'IFGRPL').GOTOH CHECK SYSECT VALUE      @03A 44650000
&SYSECT  DSECT                     RETURN TO IFGRPL DSECT          @03A 44700000
         AGO   .ORGSEC                                             @03A 44750000
.GOTOH   ANOP                   ASSEMBLER H LEVEL & NOT IFGRPL     @03A 44800000
&SYSECT  LOCTR                     RETURN TO PREVIOUS SECTION      @N1A 44850000
.ORGSEC  ANOP                      BACK TO ORGINAL SECTION         @N1A 44900000
.EQU     ANOP                                                           44950000
*********************************************************************** 45000000
*                                                                     * 45050000
*   THE FOLLOWING CONSTANT VALUES ARE THOSE ALLOWED TO BE RECORDED    * 45100000
*   IN "RPLREQ" AND/OR REGISTER 0 WHEN AN APPCCMD MACRO IS ISSUED.    * 45150000
*                                                             @R495808* 45200000
*********************************************************************** 45250000
RPL6APPC EQU   X'62'               A "RPLREQ" VALUE IN THE RPL THAT     45300000
*                                  INDICATES THIS IS AN APPCCMD         45350000
*                                  (EXCEPT CONTROL=CHECK)               45400000
*                                  AND AAREA CONTAINS APPC PARAMETERS   45450000
*                                                              @R495808 45500000
RPL6CHEK EQU   X'6C'               A VALUE IN THE REGISTER 0 ON AN      45550000
*                                  API CROSSING THAT INDICATES THAT     45600000
*                                  THIS IS A CONTROL=CHECK     @R495808 45650000
*********************************************************************** 45700000
*                                                                     * 45750000
*   THE FOLLOWING CONSTANT VALUES ARE THOSE ALLOWED TO BE RECORDED    * 45800000
*   IN "RPLREQ" AND/OR REGISTER 0 WHEN A VCNSCMD MACRO IS ISSUED.     * 45850000
*                                                                 @D1A* 45900000
*********************************************************************** 45950000
RPL3VCNS EQU   X'32'               REGISTER 0 AND RPLREQ VALUE          46000000
*                                  WHEN A VCNSCMD IS ISSUED             46050000
*                                  (EXCEPT CONTROL=CHECK)               46100000
*                                                                  @D1A 46150000
RPL3CHEK EQU   X'3C'               REGISTER 0 VALUE WHEN A VCNSCMD      46200000
*                                  CONTROL=CHECK IS ISSUED              46250000
*                                                                  @D1A 46300000
         MEND                                                           46350000
*        END OF RPL VTAM EXTENSION                                   */ 46400000
*%RPLEND: ;                                                             46450000
