*@LIST PUSH;                        /* ASSEMBLER SOURCE              */ 00050000
*@LIST OFF;                         /* ASSEMBLER SOURCE              */ 00100000
*                                   /* ASSEMBLER SOURCE                 00150000
         MACRO ,                                                        00200000
         ISTRH ,                                                        00250000
*********************************************************************** 00300000
**                                                                   ** 00350000
** MACRO-NAME:                                                       ** 00400000
**       ISTRH                                                       ** 00450000
**                                                                   ** 00500000
** COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                   ** 00550000
**                                                                   ** 00600000
**            THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"    ** 00650000
**                                                                   ** 00700000
**            5685-085 (C) COPYRIGHT IBM CORP. 1981, 1992.           ** 00750000
**            ALL RIGHTS RESERVED.                                   ** 00800000
**                                                                   ** 00850000
**            U.S. GOVERNMENT USERS RESTRICTED RIGHTS -              ** 00900000
**            USE, DUPLICATION OR DISCLOSURE RESTRICTED BY           ** 00950000
**            GSA ADP SCHEDULE CONTRACT WITH IBM CORP.               ** 01000000
**                                                                   ** 01050000
**            SEE COPYRIGHT INSTRUCTIONS.                            ** 01100000
**                                                                   ** 01150000
** MACRO-DESCRIPTIVE-NAME:                                           ** 01200000
**       SNA REQUEST/RESPONSE HEADER MAPPING MACRO                   ** 01250000
**                                                                   ** 01300000
** MACRO-NOTES:                                                      ** 01350000
**       (Q) MEANS APPLICABLE TO A REQUEST HEADER                    ** 01400000
**       (S) MEANS APPLICABLE TO A RESPONSE HEADER                   ** 01450000
**       (B) MEANS APPLICABLE TO A REQUEST OR RESPONSE HEADER        ** 01500000
**                                                                   ** 01550000
**  $MAC(ISTRH),COMP(FUNCTION),PROD(VTAM): VTAM REQUEST/RESPONSE     ** 01600000
**                                         HEADER                    ** 01650000
**                                                                   ** 01700000
**  FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            ** 01750000
**  ---- -------- ------- ------ ------  ---------------------       ** 01800000
**  $BB= ACC@@AMS HVT3410 891025 615520: PL/AS CONVERSION            ** 01850000
**  $J1= XD@@@CLD HVT3411 900809 607388: DATA COMPRESSION            ** 01900000
**  $KG= P105521  HATAPPN 921103 460208: RHRCDI TO RHF2B3            ** 01950000
**  $KH= P106154  HATAPPN 921202 460208: COMMENT TO RHF2B3           ** 02000000
**  $D1= IM@@@MST CRYPMAC 950712 293010: CRYPTO/MAC SUPPORT          ** 02025000
**  Flag Reason   Release  Date   Origin    Description              ** 02031200
**  ---- -------- -------- ------ --------  ------------------------ ** 02037400
**  $A1= OW37550  CSV2R8   990218 WAMORAN : Add RHIPM constant       ** 02043600
*********************************************************************** 02050000
ISTRH    DSECT ,                       REQUEST OR RESPONSE HEADER       02100000
RH       DS    0XL3                    REQUEST OR RESPONSE HEADER       02150000
         SPACE 1                                                        02200000
RHF0     DS    X                       RH BYTE 0                        02250000
RHQS     EQU   B'10000000'             RH TYPE INDICATOR:               02300000
*                                      (Q) 0=REQUEST                    02350000
*                                      (S) 1=RESPONSE                   02400000
         SPACE 1                                                        02450000
RHQSREQ  EQU   B'00000000'             REQUEST UNIT                     02500000
RHQSRSP  EQU   B'10000000'             RESPONSE UNIT                    02550000
         SPACE 1                                                        02600000
RHRUCAT  EQU   B'01100000'             RU CATEGORY INDICATOR:           02650000
*                                      (B) 00=FM DATA                   02700000
*                                      (B) 01=NETWORK CONTROL           02750000
*                                      (B) 10=DATA FLOW CONTROL         02800000
*                                      (B) 11=SESSION CONTROL           02850000
         SPACE 1                                                        02900000
RHFMD    EQU   B'00000000'             FUNCTION MANAGEMENT DATA RU      02950000
RHNC     EQU   B'00100000'             NETWORK CONTROL RU               03000000
RHDFC    EQU   B'01000000'             DATA FLOW CONTROL RU             03050000
RHSC     EQU   B'01100000'             SESSION CONTROL RU               03100000
         SPACE 1                                                        03150000
RHF0B3   EQU   B'00010000'             (B) RESERVED: NOT ARCHITECTED    03200000
RHFI     EQU   B'00001000'             FORMAT INDICATOR:                03250000
*                                      (B) 0=NO FM HEADER, OR           03300000
*                                            CHARACTER CODED NETWORK    03350000
*                                            SERVICES RU                03400000
*                                      (B) 1=FM HEADER INCLUDED, OR     03450000
*                                            FIELD FORMATTED NETWORK    03500000
*                                            SERVICES RU                03550000
RHSDI    EQU   B'00000100'             SENSE DATA INCLUDED INDICATOR:   03600000
*                                      (B) 0=SENSE DATA NOT INCLUDED    03650000
*                                      (B) 1=SENSE DATA INCLUDED        03700000
RHBCI    EQU   B'00000010'             BEGIN CHAIN INDICATOR:           03750000
*                                      (Q) 0=NOT BEGINNING OF CHAIN     03800000
*                                      (B) 1=BEGINNING OF CHAIN         03850000
RHECI    EQU   B'00000001'             END CHAIN INDICATOR:             03900000
*                                      (Q) 0=NOT END OF CHAIN           03950000
*                                      (B) 1=END OF CHAIN               04000000
         SPACE 1                                                        04050000
RHF1     DS    X                       RH BYTE 1                        04100000
RHDR1    EQU   B'10000000'             DEFINITE RESPONSE 1 INDICATOR:   04150000
*                                      (Q) 0=DEFINITE RESPONSE 1 NOT    04200000
*                                            REQUIRED                   04250000
*                                      (Q) 1=DEFINITE RESPONSE 1        04300000
*                                            REQUIRED                   04350000
*                                      (S) 0=NOT DEFINITE RESPONSE 1    04400000
*                                      (S) 1=DEFINITE RESPONSE 1        04450000
RHDM     EQU   B'01000000'             DATA MANIPULATION INDICATOR      04462500
*                                        0=DATA MANIPULATION NOT USED   04475000
*                                        1=DATA MANIPULATION USED @D1A  04487500
RHCI     EQU   B'01000000'             COMPRESSION INDICATOR:  @J1C     04500000
*                                        0=COMPRESSION NOT USED         04550000
*                                        1=COMPRESSION USED             04600000
RHDR2    EQU   B'00100000'             DEFINITE RESPONSE 2 INDICATOR:   04650000
*                                      (Q) 0=DEFINITE RESPONSE 2 NOT    04700000
*                                            REQUIRED                   04750000
*                                      (Q) 1=DEFINITE RESPONSE 2        04800000
*                                            REQUIRED                   04850000
*                                      (S) 0=NOT DEFINITE RESPONSE 2    04900000
*                                      (S) 1=DEFINITE RESPONSE 2        04950000
RHERI    EQU   B'00010000'             EXCEPTION RESPONSE INDICATOR:    05000000
*                                      (Q) 0=DEFINITE OR NO RESPONSE    05050000
*                                            REQUIRED                   05100000
*                                      (Q) 1=EXCEPTION RESPONSE         05150000
*                                            REQUIRED                   05200000
RHRTI    EQU   B'00010000'             (S) 0=POSITIVE RESPONSE          05250000
*                                      (S) 1=NEGATIVE RESPONSE          05300000
RHF1B4   EQU   B'00001000'             (B) RESERVED: NOT ARCHITECTED    05350000
RHRLWS   EQU   B'00000100'             REQUEST LARGER WINDOW SIZE       05400000
*                                      INDICATOR                        05450000
RHQRI    EQU   B'00000010'             QUEUED RESPONSE INDICATOR:       05500000
*                                      (B) 0=THE RESPONSE MAY FLOW      05550000
*                                            AHEAD OF REQUESTS          05600000
*                                      (B) 1=THE RESPONSE MAY NOT       05650000
*                                            FLOW AHEAD OF REQUESTS     05700000
*                                      NOTE: THE VALUE OF THIS FIELD    05750000
*                                            IS SET ON A REQUEST AND    05800000
*                                            CHECKED ON THE ASSOCIATED  05850000
*                                            RESPONSE.                  05900000
RHPI     EQU   B'00000001'             PACING INDICATOR:                05950000
*                                      (B) (RESERVED FOR VTAM USE)      06000000
         SPACE 1                                                        06050000
RHF2     DS    X                       RH BYTE 2                        06100000
RHBBI    EQU   B'10000000'             BEGIN BRACKET INDICATOR:         06150000
*                                      (Q) 0=NOT BEGIN BRACKET          06200000
*                                      (Q) 1=BEGIN BRACKET              06250000
*                                      (S) RESERVED: NOT ARCHITECTED    06300000
RHEBI    EQU   B'01000000'             END BRACKET INDICATOR:           06350000
*                                      (Q) 0=NOT END BRACKET            06400000
*                                      (Q) 1=END BRACKET                06450000
*                                      (S) RESERVED: NOT ARCHITECTED    06500000
RHCDI    EQU   B'00100000'             CHANGE DIRECTION INDICATOR:      06550000
*                                      (Q) 0=DO NOT CHANGE DIRECTION    06600000
*                                      (Q) 1=CHANGE DIRECTION           06650000
*                                      (S) RESERVED: NOT ARCHITECTED    06700000
RHF2B3   EQU   B'00010000'             (B) RESERVED: NOT ARCHITECTED    06750000
*                                                          @KHC         06800000
RHCSI    EQU   B'00001000'             CODE SELECTION INDICATOR:        06850000
*                                      (Q) 0=CODE 0                     06900000
*                                      (Q) 1=CODE 1                     06950000
*                                      (S) RESERVED: NOT ARCHITECTED    07000000
RHEDI    EQU   B'00000100'             ENCIPHERED DATA INDICATOR:       07050000
*                                      (Q) 0=DATA IS NOT ENCIPHERED     07100000
*                                      (Q) 1=DATA IS ENCIPHERED         07150000
*                                      (S) RESERVED: NOT ARCHITECTED    07200000
RHPDI    EQU   B'00000010'             PADDED DATA INDICATOR:           07250000
*                                      (B) (RESERVED FOR VTAM USE)      07300000
RHCEBI   EQU   B'00000001'             CONDITIONAL END BRACKET          07350000
*                                      INDICATOR:                       07400000
*                                      (Q) 0=NOT CONDITIONAL END        07450000
*                                            BRACKET                    07500000
*                                      (Q) 1=CONDITIONAL END BRACKET    07550000
*                                      (S) RESERVED: NOT ARCHITECTED    07600000
         MEND  ,                                                     */ 07650000
*@LIST POP;                         /* ASSEMBLER SOURCE              */ 07700000
*/********************************************************************/ 07750000
*/*                                                                  */ 07800000
*/*  MACRO-NAME: ISTRH                                               */ 07850000
*/*                                                                  */ 07900000
*/*  MACRO-DESCRIPTIVE-NAME:                                         */ 07950000
*/*      SNA REQUEST/RESPONSE HEADER MAPPING MACRO                   */ 08000000
*/*                                                                  */ 08050000
*/*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                 */ 08100000
*/*                                                                  */ 08150000
*/*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"  */ 08200000
*/*                                                                  */ 08250000
*/*             5685-085 (C) COPYRIGHT IBM CORP. 1981, 1992.         */ 08300000
*/*             ALL RIGHTS RESERVED.                                 */ 08350000
*/*                                                                  */ 08400000
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */ 08450000
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY         */ 08500000
*/*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.             */ 08550000
*/*                                                                  */ 08600000
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */ 08650000
*/*                                                                  */ 08700000
*/*  MACRO-FUNCTION:                                                 */ 08850000
*/*      PROVIDE A VTAM PL/S MAPPING FOR THE                         */ 08900000
*/*      SNA REQUEST/RESPONSE HEADER MAPPING MACRO                   */ 08950000
*/*                                                                  */ 09000000
*/*  MACRO-NOTES:                                                    */ 09050000
*/*      (Q) MEANS APPLICABLE TO A REQUEST HEADER                    */ 09100000
*/*      (S) MEANS APPLICABLE TO A RESPONSE HEADER                   */ 09150000
*/*      (B) MEANS APPLICABLE TO A REQUEST OR RESPONSE HEADER        */ 09200000
*/*                                                                  */ 09250000
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */ 09300000
*/*                                                                  */ 09350000
*/*    REQUIRED-INNER-MAPS: NONE                                     */ 09400000
*/*                                                                  */ 09450000
*/*    REQUIRED-BY:                                                  */ 09500000
*/*      ISTBTU  , ISTRUPE , ISTTSCB                                 */ 09550000
*/*                                                                  */ 09600000
*/*  MACRO-DATE-CREATED:                                             */ 09650000
*/*      00 - NOTKNOWN                                       @UNKNOWN*/ 09700000
*/*                                                                  */ 09750000
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */ 09800000
*/*      00 - 08/25/80 - FOR ACF/VTAM V2R1 (REWRITTEN)       @D5H4758*/ 09850000
*/*      01 - 06/17/85 - DATA AREA REWORK                    @R496308*/ 09900000
*/*      02 - 06/28/85 - V3R2 LEN DCR                        @R500002*/ 09950000
*/*                                                                  */ 10000000
*/********************************************************************/ 10050000
*/*                                                                  */ 10100000
*/*A-000000-999999                                           @D5H4758*/ 10150000
*   DCL                                                                 10200000
*     1 ISTRH CHAR(3) BDY(BYTE) BASED, /* REQUEST/RESPONSE HEADER    */ 10250000
*                                                                       10300000
*      2 RHF0 BIT(8),               /* RH BYTE 0                     */ 10350000
*       3 RHQS BIT(1),              /* RH TYPE INDICATOR:               10400000
*                                      (Q) 0=REQUEST                    10450000
*                                      (S) 1=RESPONSE                */ 10500000
*       3 RHRUCAT BIT(2),           /* RU CATEGORY INDICATOR:           10550000
*                                      (B) 00=FM DATA                   10600000
*                                      (B) 01=NETWORK CONTROL           10650000
*                                      (B) 10=DATA FLOW CONTROL         10700000
*                                      (B) 11=SESSION CONTROL        */ 10750000
*        4 * BIT(1),                /* (B) 0=FM DATA OR NETWORK         10800000
*                                            CONTROL                    10850000
*                                      (B) 1=DATA FLOW CONTROL OR       10900000
*                                            SESSION CONTROL         */ 10950000
*        4 RHSCI BIT(1),            /* SUBSYSTEM CONTROL INDICATOR:     11000000
*                                      (B) 0=FM DATA OR DATA FLOW       11050000
*                                            CONTROL                    11100000
*                                      (B) 1=NETWORK CONTROL OR         11150000
*                                            SESSION CONTROL         */ 11200000
*       3 RHF0B3 BIT(1),            /* (B) RESERVED                  */ 11250000
*       3 RHFI BIT(1),              /* FORMAT INDICATOR:                11300000
*                                      (B) 0=NO FM HEADER, OR           11350000
*                                            CHARACTER CODED NETWORK    11400000
*                                            SERVICES RU                11450000
*                                      (B) 1=FM HEADER INCLUDED, OR     11500000
*                                            FIELD FORMATTED NETWORK    11550000
*                                            SERVICES RU             */ 11600000
*       3 RHSDI BIT(1),             /* SENSE DATA INCLUDED INDICATOR:   11650000
*                                      (B) 0=SENSE DATA NOT INCLUDED    11700000
*                                      (B) 1=SENSE DATA INCLUDED     */ 11750000
*       3 RHBCI BIT(1),             /* BEGIN CHAIN INDICATOR:           11800000
*                                      (Q) 0=NOT BEGINNING OF CHAIN     11850000
*                                      (B) 1=BEGINNING OF CHAIN      */ 11900000
*       3 RHECI BIT(1),             /* END CHAIN INDICATOR:             11950000
*                                      (Q) 0=NOT END OF CHAIN           12000000
*                                      (B) 1=END OF CHAIN            */ 12050000
*      2 RHF1 BIT(8),               /* RH BYTE 1                     */ 12100000
*       3 RHDR1 BIT(1),             /* DEFINITE RESPONSE 1 INDICATOR:   12150000
*                                      (Q) 0=DEFINITE RESPONSE 1 NOT    12200000
*                                            REQUIRED                   12250000
*                                      (Q) 1=DEFINITE RESPONSE 1        12300000
*                                            REQUIRED                   12350000
*                                      (S) 0=NOT DEFINITE RESPONSE 1    12400000
*                                      (S) 1=DEFINITE RESPONSE 1     */ 12450000
*       3 RHDM  BIT(1),             /* DATA MANIPULATION INDICATOR      12470000
*                                      0= DATA MANIPULATION NOT USED    12490000
*                                      1= DATA MANIPULATION USED @D1A*/ 12510000
*         4 RHCI BIT(1),            /* COMPRESSION INDICATOR:           12530000
*                                      0 = COMPRESSION NOT USED         12550000
*                                      1 = COMPRESSION USED @J1C @D1C*/ 12600000
*       3 RHDR2 BIT(1),             /* DEFINITE RESPONSE 2 INDICATOR:   12650000
*                                      (Q) 0=DEFINITE RESPONSE 2 NOT    12700000
*                                            REQUIRED                   12750000
*                                      (Q) 1=DEFINITE RESPONSE 2        12800000
*                                            REQUIRED                   12850000
*                                      (S) 0=NOT DEFINITE RESPONSE 2    12900000
*                                      (S) 1=DEFINITE RESPONSE 2     */ 12950000
*       3 RHERI BIT(1),             /* EXCEPTION RESPONSE INDICATOR:    13000000
*                                      (Q) 0=DEFINITE OR NO RESPONSE    13050000
*                                            REQUIRED                   13100000
*                                      (Q) 1=EXCEPTION RESPONSE         13150000
*                                            REQUIRED                */ 13200000
*        4 RHRTI BIT(1),            /* (S) 0=POSITIVE RESPONSE          13250000
*                                      (S) 1=NEGATIVE RESPONSE       */ 13300000
*       3 RHF1B4 BIT(1),            /* (B) RESERVED                  */ 13350000
*       3 RHRLWS BIT(1),            /* REQUEST LARGER WINDOW SIZE       13400000
*                                      INDICATOR             @R500002*/ 13450000
*       3 RHQRI BIT(1),             /* QUEUED RESPONSE INDICATOR:       13500000
*                                      (B) 0=THE RESPONSE MAY FLOW      13550000
*                                            AHEAD OF REQUESTS          13600000
*                                      (B) 1=THE RESPONSE MAY NOT       13650000
*                                            FLOW AHEAD OF REQUESTS     13700000
*                                      NOTE: THE VALUE OF THIS FIELD    13750000
*                                            IS SET ON A REQUEST AND    13800000
*                                            CHECKED ON THE ASSOCIATED  13850000
*                                            RESPONSE.               */ 13900000
*       3 RHPI BIT(1),              /* PACING INDICATOR:                13950000
*                                      (Q) 0=PACING RESPONSE NOT        14000000
*                                            REQUIRED                   14050000
*                                      (Q) 1=PACING RESPONSE REQUIRED   14100000
*                                      (S) 0=NOT PACING RESPONSE        14150000
*                                      (S) 1=PACING RESPONSE         */ 14200000
*      2 RHF2 BIT(8),               /* RH BYTE 2                     */ 14250000
*       3 RHBBI BIT(1),             /* BEGIN BRACKET INDICATOR:         14300000
*                                      (Q) 0=NOT BEGIN BRACKET          14350000
*                                      (Q) 1=BEGIN BRACKET              14400000
*                                      (S) RESERVED                  */ 14450000
*       3 RHEBI BIT(1),             /* END BRACKET INDICATOR:           14500000
*                                      (Q) 0=NOT END BRACKET            14550000
*                                      (Q) 1=END BRACKET                14600000
*                                      (S) RESERVED                  */ 14650000
*       3 RHCDI BIT(1),             /* CHANGE DIRECTION INDICATOR:      14700000
*                                      (Q) 0=DO NOT CHANGE DIRECTION    14750000
*                                      (Q) 1=CHANGE DIRECTION           14800000
*                                      (S) RESERVED                  */ 14850000
*       3 RHF2B3 BIT(1),            /* (B) RESERVED                  */ 14900000
*       3 RHCSI BIT(1),             /* CODE SELECTION INDICATOR:        14950000
*                                      (Q) 0=CODE 0                     15000000
*                                      (Q) 1=CODE 1                     15050000
*                                      (S) RESERVED                  */ 15100000
*       3 RHEDI BIT(1),             /* ENCIPHERED DATA INDICATOR:       15150000
*                                      (Q) 0=DATA IS NOT ENCIPHERED     15200000
*                                      (Q) 1=DATA IS ENCIPHERED         15250000
*                                      (S) RESERVED                  */ 15300000
*       3 RHPDI BIT(1),             /* PADDED DATA INDICATOR:           15350000
*                                      (Q) 0=DATA IS NOT PADDED         15400000
*                                      (Q) 1=DATA IS PADDED             15450000
*                                      (S) RESERVED                  */ 15500000
*       3 RHCEBI BIT(1);            /* CONDITIONAL END BRACKET          15550000
*                                      INDICATOR:                       15600000
*                                      (Q) 0=NOT CONDITIONAL END        15650000
*                                            BRACKET                    15700000
*                                      (Q) 1=CONDITIONAL END BRACKET    15750000
*                                      (S) RESERVED                  */ 15800000
*@SPACE;                                                                15850000
*/********************************************************************/ 15900000
*/* MASK FOR INVALID USER DEFINED RH                                 */ 15950000
*/********************************************************************/ 16000000
*   DCL                                                                 16050000
*     RHINVURH BIT(24) CONSTANT('104D02'X); /* MASK FOR INVALID USER RH 16100000
*                                      NOTE A USER DEFINED RH IS        16150000
*                                      INVALID IF THE PACING BIT, THE   16200000
*                                      PADDED BEFORE ENCIPHERMENT OR    16250000
*                                      ANY OF THE RESERVED BITS ARE     16300000
*                                      ON                    @P5B8825*/ 16350000
*@SPACE;                                                                16400000
*/********************************************************************/ 16450000
*/* VALUES FOR REQUEST/RESPONSE INDICATOR (RHQS)                     */ 16500000
*/********************************************************************/ 16550000
*   DCL                                                                 16600000
*     RHQSREQ BIT(1) CONSTANT('0'B), /* REQUEST UNIT                 */ 16650000
*     RHQSRSP BIT(1) CONSTANT('1'B); /* RESPONSE UNIT                */ 16700000
*@SPACE;                                                                16750000
*/********************************************************************/ 16800000
*/* MASKS FOR SETTING AND TESTING RU CATEGORY (RHRUCAT)              */ 16850000
*/********************************************************************/ 16900000
*   DCL                                                                 16950000
*     RHFMD BIT(2) CONSTANT('00'B), /* FUNCTION MANAGEMENT DATA RU   */ 17000000
*     RHNC BIT(2) CONSTANT('01'B),  /* NETWORK CONTROL RU            */ 17050000
*     RHDFC BIT(2) CONSTANT('10'B), /* DATA FLOW CONTROL RU          */ 17100000
*     RHSC BIT(2) CONSTANT('11'B);  /* SESSION CONTROL RU            */ 17150000
*@SPACE;                                                                17200000
*/********************************************************************/ 17250000
*/* MISCELLANEOUS MASKS FOR SETTING AND TESTING ISTRH                */ 17300000
*/********************************************************************/ 17350000
*   DCL                                                                 17400000
*     RHREQ BIT(24) CONSTANT('030000'X), /* FID0 REQUEST             */ 17450000
*     RHRESP BIT(24) CONSTANT('938000'X), /* FID0 RESPONSE           */ 17500000
*     RHIPM  BIT(24) CONSTANT('830100'X), /* IPM                 @A1A*/ 17525000
*     RHNORSP BIT(24) CONSTANT('0B0000'X), /* REQUEST WITH NO RESPONSE  17550000
*                                             REQUIRED               */ 17600000
*     RHDEFRSP BIT(24) CONSTANT('0B8000'X); /* REQUEST WITH DEFINITE    17650000
*                                              RESPONSE REQUIRED     */ 17700000
