*/********************* START OF SPECIFICATIONS **********************/ 00050000
*/*                                                                  */ 00100000
*/* MAPPING NAME: ISTRIVL                                            */ 00150000
*/*                                                                  */ 00200000
*/* DESCRIPTIVE NAME:  Resource Information Vector List              */ 00250000
*/*                                                                  */ 00300000
*/*                                                                  */ 00350000
*/* COPYRIGHT = LICENSED MATERIALS - PROPERTY OF IBM                 */ 00400000
*/*                                                                  */ 00450000
*/*             THIS PRODUCT CONTAINS                                */ 00500000
*/*             "RESTRICTED MATERIALS OF IBM"                        */ 00550000
*/*                                                                  */ 00600000
*/*             5695-117 (C) COPYRIGHT IBM CORP. 1994, 1997.         */ 00650000
*/*             ALL RIGHTS RESERVED.                                 */ 00700000
*/*                                                                  */ 00750000
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */ 00800000
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED            */ 00850000
*/*             BY GSA ADP SCHEDULE CONTRACT WITH IBM CORP.          */ 00900000
*/*                                                                  */ 00950000
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */ 01000000
*/*                                                                  */ 01050000
*/*                                                                  */ 01100000
*/* MAPPING USER'S GUIDE:                                            */ 01150000
*/*                                                                  */ 01200000
*/*    FUNCTION:                                                     */ 01250000
*/*       ISTRIVL contains mappings for a collection of vectors and  */ 01300000
*/*       data fields provided by VTAM to the application in the     */ 01350000
*/*       Resource Information Vector List.                          */ 01400000
*/*                                                                  */ 01450000
*/*       Vectors are addressible via ACBRIVL after OPEN for the     */ 01500000
*/*       ACB has completed.                                         */ 01550000
*/*                                                                  */ 01600000
*/*       The highorder bit in the vector key is off for all         */ 01650000
*/*       vectors sent from VTAM to the application.                 */ 01700000
*/*                                                                  */ 01750000
*/*    METHOD OF INCLUSION:                                          */ 01800000
*/*       By invocation as a mapping macro in assembler programs.    */ 01850000
*/*       By ATBUILD or %INCLUDE in PL/X programs.                   */ 01900000
*/*                                                                  */ 01950000
*/*                                                                  */ 02000000
*/*    RESTRICTIONS / DEPENDENCIES: None.                            */ 02050000
*/*                                                                  */ 02100000
*/*    NOTES:  None                                                  */ 02150000
*/*                                                                  */ 02200000
*/* EXTERNAL REFERENCES:  None.                                      */ 02250000
*/*                                                                  */ 02300000
*/*                                                                  */ 02350000
*/* CHANGE ACTIVITY:                                                 */ 02400000
*/*                                                                  */ 02450000
*/* $MAC(ISTRIVL),COMP(O/C),PROD(VTAM): RESOURCE INFORMATION VECTOR  */ 02500000
*/*                                     LIST                         */ 02550000
*/*                                                                  */ 02600000
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */ 02650000
*/* ---- -------- ------- ------ ------  --------------------------- */ 02700000
*/* $L0= KA@@@PLD APPCRR  931030 576146: DCE Security Services       */ 02750000
*/* $L1= KP@DR009 PMIII   940228 043006: Support Level Recognition   */ 02800000
*/* $L2= KP@DR008 PMIII   940520 043006: VRBLK PIU count expansion   */ 02850000
*/* $L3= KA@DR005 APPCRR  940708 576146: DCE Security Services       */ 02900000
*/* $Y1= P115000  VTAGENT 940920 792173: Add Address Fields to vector*/ 02950000
*/* $Y2= P116683  APPCRR  940927 879315: Remove internal-use vector  */ 03000000
*/* $Y3= P116769  FREEDOM 941010 879315: Updated user mappings       */ 03050000
*/* $Y4= P117800  FREEDOM 950208 879315: Correct length field size   */ 03075000
*/* $Y5= P118309  FREEDOM 950331 879315: Remove character equates    */ 03087500
*/* $N1= P126308  POLARIS 970918 879315: Appl definition info vector */ 03093700
*/*                                                                  */ 03100000
*/********************** END OF SPECIFICATIONS ***********************/ 03150000
*@LISTPUSH;                         /*                           @Y1A*/ 03200000
*@LISTOFF;                          /*                           @Y1A*/ 03250000
*                                   /* BILINGUAL HEADER                 03300000
*                                                                       03350000
         MACRO                                                          03400000
         ISTRIVL                                                        03450000
ISTRIVL  DSECT                      MAPPING FOR RESOURCE INFORMATION    03500000
*                                   VECTOR LIST POINTED TO BY ACBRIVL   03550000
RIVLLEN  DS    HL2                  TOTAL LENGTH OF VECTORS             03600000
RIVLDATA DS    0X                   VECTOR DATA                         03650000
*                                                                       03700000
*********************************************************************** 03750000
***  GENERALIZED MAPPING FOR EXAMINING COMMON FIELDS IN ALL ACB      ** 03800000
***  VECTORS IN THE VECTOR LIST POINTED TO BY ACBRIVL                ** 03850000
*********************************************************************** 03900000
ISTRIVVT DSECT                      VECTOR TEMPLATE                @Y3A 03950000
RIVVTLEN DS    X                    VECTOR LENGTH                  @Y3A 04000000
RIVVTKEY DS    X                    VECTOR KEY                     @Y3A 04050000
RIVVTDAT DS    0X                   VECTOR DATA                    @Y3A 04100000
*                                                                       04150000
*                                                                       04200000
*********************************************************************** 04250000
*** ISTRIV02 - maps the application's network name vector.           ** 04300000
***          - The name is specified by the name field of the        ** 04350000
***            application definition statement.                     ** 04400000
***          - This is obtained from the NAME ON APPL STATEMENT.     ** 04450000
*********************************************************************** 04500000
ISTRIV02 DSECT                      APPLICATION NETWORK NAME VECTOR     04550000
*                                   (FROM NAME ON APPL STATEMENT)       04600000
RIV02LEN DS    X                    VECTOR LENGTH                       04650000
RIV02KEY DS    X                    VECTOR KEY                          04700000
RIV02KYC EQU   X'02'                KEY IS X'02'                        04750000
RIV02DTA DS    CL8                  VECTOR DATA                         04800000
*                                                                       04850000
*********************************************************************** 04900000
*** ISTRIV03 - maps the application's ACB name vector.               ** 04950000
***          - This is supplied by the APPLID operand on the ACB     ** 05000000
***            statement or can be supplied by the operating         ** 05050000
***            system.  During OPEN ACB, VTAM will search for the    ** 05100000
***            application's characteristics by matching the ACB     ** 05150000
***            APPLID value to an RDTE with the application's        ** 05200000
***            ACBNAME.  If ACBNAME was not coded for the            ** 05250000
***            application, VTAM will search for a match with an     ** 05300000
***            RDTE containing the application's network name.       ** 05350000
***          - This is obtained from the APPLID on ACB MACRO.        ** 05400000
*********************************************************************** 05450000
ISTRIV03 DSECT                      APPLICATION ACB NAME VECTOR         05500000
*                                   (FROM APPLID ON ACB MACRO)          05550000
RIV03LEN DS    X                    VECTOR LENGTH                       05600000
RIV03KEY DS    X                    VECTOR KEY                          05650000
RIV03KYC EQU   X'03'                KEY IS X'03'                        05700000
RIV03DTA DS    CL8                  VECTOR DATA                         05750000
*                                                                       05800000
*********************************************************************** 05850000
*** ISTRIV06 - maps the network name in which the host resides.      ** 05900000
***          - This is obtained from the NETID START OPTION.         ** 05950000
***            If NETID start option is not specified, this value    ** 06000000
***            will be blanks.                                       ** 06050000
*********************************************************************** 06100000
ISTRIV06 DSECT                      NETWORK NAME VECTOR                 06150000
*                                   (FROM NETID START OPTION)           06200000
RIV06LEN DS    X                    VECTOR LENGTH                       06250000
RIV06KEY DS    X                    VECTOR KEY                          06300000
RIV06KYC EQU   X'06'                KEY IS X'06'                        06350000
RIV06DTA DS    CL8                  VECTOR DATA                         06400000
*                                                                       06450000
*********************************************************************** 06500000
*** ISTRIV07 - maps the SSCP Name vector.                            ** 06550000
***          - This is obtained from the SSCPNAME START OPTION       ** 06600000
*********************************************************************** 06650000
ISTRIV07 DSECT                      SSCP NAME VECTOR                    06700000
*                                   (FROM SSCPNAME START OPTON)         06750000
RIV07LEN DS    X                    VECTOR LENGTH                       06800000
RIV07KEY DS    X                    VECTOR KEY                          06850000
RIV07KYC EQU   X'07'                KEY IS X'07'                        06900000
RIV07DTA DS    CL8                  VECTOR DATA                         06950000
*                                   (DEFAULT IS 'VTAM')                 07000000
*                                                                       07050000
*********************************************************************** 07100000
*** ISTRIV08 - maps the Host Subarea PU Network Name vector.         ** 07150000
***          - This is obtained from the HOSTPU START OPTION         ** 07200000
***            If HOSTPU start option is not specified, the name     ** 07250000
***            will default to 'ISTPUS  '.                           ** 07300000
*********************************************************************** 07350000
ISTRIV08 DSECT                      HOST SUBAREA PU NETWORK NAME VECTOR 07400000
*                                   (FROM HOSTPU START OPTION)          07450000
RIV08LEN DS    X                    VECTOR LENGTH                       07500000
RIV08KEY DS    X                    VECTOR KEY                          07550000
RIV08KYC EQU   X'08'                KEY IS X'08'                        07600000
RIV08DTA DS    CL8                  VECTOR DATA                         07650000
*                                   (DEFAULT IS 'ISTPUS')               07700000
*                                                                       07750000
*********************************************************************** 07800000
*** ISTRIV09 - maps the Host Subarea PU network address vector.      ** 07850000
***          - It contains the network address of the host           ** 07900000
***            subarea PU.                                           ** 07950000
*********************************************************************** 08000000
ISTRIV09 DSECT                      HOST SUBAREA PU NETWORK ADDRESS     08050000
*                                                                       08100000
RIV09LEN DS    X                    VECTOR LENGTH                       08150000
RIV09KEY DS    X                    VECTOR KEY                          08200000
RIV09KYC EQU   X'09'                KEY IS X'09'                        08250000
RIV09DTA DS    XL6                  VECTOR DATA                         08300000
*                                                                       08350000
*********************************************************************** 08400000
*** ISTRIV0A - maps the maximum subarea vector.                      ** 08450000
***          - Contains the maximum subarea number that is valid     ** 08500000
***            for the host's domain.                                ** 08550000
***          - This is obtained from the MAXSUBA START OPTION        ** 08600000
*********************************************************************** 08650000
ISTRIV0A DSECT                      MAXIMUM SUBAREA NUMBER VECTOR       08700000
*                                   (FROM MAXSUBA START OPTION)         08750000
RIV0ALEN DS    X                    VECTOR LENGTH                       08800000
RIV0AKEY DS    X                    VECTOR KEY                          08850000
RIV0AKYC EQU   X'0A'                KEY IS X'0A'                        08900000
RIV0ADTA DS    X                    VECTOR DATA                         08950000
*                                                                       09000000
*********************************************************************** 09050000
*** ISTRIV0B - maps the LU 6.2 application definition vector.        ** 09100000
***            After the LU 6.2 application program has issued an    ** 09150000
***            open ACB, the LU 6.2 application program may use      ** 09200000
***            this vector to determine the values coded on the      ** 09250000
***            APPL definition statement.                            ** 09300000
***          - This is obtained from the APPL STATEMENT PARAMETERS   ** 09350000
*********************************************************************** 09400000
ISTRIV0B DSECT                      LU 6.2 APPL DEFINITION VECTOR       09450000
*                                   (FROM APPL STATEMENT PARAMETERS)    09500000
RIV0BLEN DS    X                    VECTOR LENGTH                       09550000
RIV0BKEY DS    X                    VECTOR KEY                          09600000
RIV0BKYC EQU   X'0B'                KEY IS X'0B'                        09650000
RIV0BDTA DS    0X                   VECTOR DATA                         09700000
         DS    X                    RESERVED                            09750000
RIV0BSLV EQU   X'C0'                SESSION-LEVEL LU-LU VERIFICATION    09800000
*                                   BIT MASK                            09850000
RIV0BSLR EQU   X'80'                REQUIRED                            09900000
RIV0BSLO EQU   X'40'                OPTIONAL                            09950000
RIV0BSLN EQU   X'00'                NONE                                10000000
RIV0BCLS DS    X                    CONVERSATION SECURITY ACCEPTANCE    10050000
RIV0BCLN EQU   X'01'                NONE                                10100000
RIV0BCLC EQU   X'02'                CONV                                10150000
RIV0BCLA EQU   X'03'                ALREADYV                            10200000
RIV0BCLP EQU   X'04'                PERSISTV                            10250000
RIV0BCLV EQU   X'05'                AVPV                                10300000
RIV0BFLG DS    X                    MISCELLANEOUS FLAGS                 10350000
RIV0BDDL EQU   X'80'                DDRAINL=ALLOW                       10400000
RIV0BDRL EQU   X'40'                DRESPL=ALLOW                        10450000
RIV0BATA EQU   X'20'                ATNLOSS=ALL                         10500000
RIV0BSYP EQU   X'10'                SYNCLVL=SYNCPT                      10550000
RIV0BOPC EQU   X'08'                OPERCNOS=ALLOW                      10600000
         DS    X                    RESERVED                            10650000
RIV0BDSL DS    HL2                  DSESLIM VALUE                       10700000
RIV0BDML DS    HL2                  DMINWNL VALUE                       10750000
RIV0BDMR DS    HL2                  DMINWNR VALUE                       10800000
RIV0BAUT DS    HL2                  AUTOSES VALUE                       10850000
*                                                                       10850900
*********************************************************************** 10851800
*** ISTRIV0C - maps the common application definition vector.        ** 10852700
***            After the application program has issued an open for  ** 10853600
***            its ACB, the application may examine this vector to   ** 10854500
***            determine the values coded on the APPL definition     ** 10855400
***            statement for common application defination keywords. ** 10856300
***          - This is obtained from the APPL STATEMENT PARAMETERS   ** 10857200
*********************************************************************** 10858100
ISTRIV0C DSECT                      APPLICATION DEFINITION VECTOR       10859000
*                                   FOR ALL APPLICATION PROGRAMS   @N1A 10859900
*                                   (FROM APPL STATEMENT PARAMETERS)    10860800
RIV0CLEN DS    X                    VECTOR LENGTH                  @N1A 10861700
RIV0CKEY DS    X                    VECTOR KEY                     @N1A 10862600
RIV0CKYC EQU   X'0C'                KEY IS X'0C'                   @N1A 10863500
RIV0CDTA DS    0X                   VECTOR DATA                    @N1A 10864400
RIV0CAUT DS    X                    AUTHORIZATION SETTINGS         @N1A 10865300
RIV0CACQ EQU   X'80'                AUTH=ACQ                       @N1A 10866200
RIV0CASD EQU   X'40'                AUTH=ASDP                      @N1A 10867100
RIV0CCNM EQU   X'20'                AUTH=CNM                       @N1A 10868000
RIV0CPAS EQU   X'10'                AUTH=PASS                      @N1A 10868900
RIV0CPPO EQU   X'08'                AUTH=PPO                       @N1A 10869800
RIV0CSPO EQU   X'04'                AUTH=SPO                       @N1A 10870700
RIV0CTSO EQU   X'02'                AUTH=TSO                       @N1A 10871600
RIV0CVPA EQU   X'01'                AUTH=VPACE                     @N1A 10872500
RIV0CFL1 DS    X                    MISCELLANEOUS FLAGS 1          @N1A 10873400
RIV0CAPC EQU   X'80'                APPC=YES                       @N1A 10874300
RIV0CAUX EQU   X'40'                AUTHEXIT=YES                   @N1A 10875200
RIV0CCER EQU   X'20'                CERTIFY=YES                    @N1A 10876100
RIV0CDSW EQU   X'10'                DSPLYWLD=YES                   @N1A 10877000
RIV0CFSP EQU   X'08'                FASTPASS=YES                   @N1A 10877900
RIV0CHAV EQU   X'04'                HAVAIL=YES                     @N1A 10878800
RIV0CPAR EQU   X'02'                PARSESS=YES                    @N1A 10879700
RIV0CPRS EQU   X'01'                PERSIST=MULTI                  @N1A 10880600
RIV0CFL2 DS    X                    MISCELLANEOUS FLAGS 2          @N1A 10881500
RIV0CSSL EQU   X'80'                SESSLIM=YES                    @N1A 10882400
RIV0CSON EQU   X'40'                SONSCIP=YES                    @N1A 10883300
RIV0CSRX EQU   X'20'                SRBEXIT=YES                    @N1A 10884200
RIV0CVCN EQU   X'10'                VCNS=YES                       @N1A 10885100
RIV0CVFR EQU   X'08'                VTAMFRR=YES                    @N1A 10886000
RIV0CLTM DS    X                    LOSTERM SETTING                @N1A 10886900
RIV0CLTN EQU   X'00'                LOSTERM=NORMAL                 @N1A 10887800
RIV0CLTI EQU   X'01'                LOSTERM=IMMED                  @N1A 10888700
RIV0CLTS EQU   X'02'                LOSTERM=SECOND                 @N1A 10889600
RIV0CCMI DS    X                    CMPAPPLI VALUE                 @N1A 10890500
RIV0CCMO DS    X                    CMPAPPLO VALUE                 @N1A 10891400
RIV0CENC DS    X                    ENCR VALUE                     @N1A 10892300
RIV0CECN EQU   X'00'                ENCR=NONE                      @N1A 10893200
RIV0CECO EQU   X'01'                ENCR=OPT                       @N1A 10894100
RIV0CECC EQU   X'02'                ENCR=COND                      @N1A 10895000
RIV0CECS EQU   X'03'                ENCR=SEL                       @N1A 10895900
RIV0CECR EQU   X'04'                ENCR=REQD                      @N1A 10896800
RIV0CVPC DS    X                    VPACING VALUE                  @N1A 10897700
         DS    XL4                  RESERVED                       @N1A 10898600
*                                                                       10900000
*********************************************************************** 10950000
*** ISTRIV11 - maps the APPCCMD vector area length vector.           ** 11000000
***          - It contains the absolute minimum length and the       ** 11050000
***            recommended minimum length for full use of the        ** 11100000
***            APPCCMD vector area.                                  ** 11150000
*********************************************************************** 11200000
ISTRIV11 DSECT                      APPCCMD VECTOR AREA LENGTH VECTOR   11250000
*                                                                @L3C   11300000
RIV11LEN DS    X                    VECTOR LENGTH                       11350000
RIV11KEY DS    X                    VECTOR KEY                          11400000
RIV11KYC EQU   X'11'                KEY IS X'11'                        11450000
RIV11AML DS    XL4                  ABSOLUTE MINIMUM APPCCMD VECTOR     11500000
*                                   AREA LENGTH                  @L3A   11550000
RIV11RML DS    XL4                  RECOMMENDED MINIMUM APPCCMD         11600000
*                                   VECTOR AREA LENGTH           @L3C   11650000
*                                                                       11700000
*********************************************************************** 11750000
*** ISTRIV12 - maps the application to VTAM vector keys vector.      ** 11800000
***          - It contains a list of all ACB vector keys that        ** 11850000
***            VTAM will process. Constants for the ACB vectors are  ** 11900000
***            located in ISTVACBV.                                  ** 11950000
*********************************************************************** 12000000
ISTRIV12 DSECT                      APPLICATION TO VTAM VECTOR KEYS     12050000
*                                   FOR ACB MACRO                       12100000
RIV12LEN DS    X                    VECTOR LENGTH                       12150000
RIV12KEY DS    X                    VECTOR KEY                          12200000
RIV12KYC EQU   X'12'                KEY IS X'12'                        12250000
RIV12DTA DS    0CL1                 VECTOR DATA                         12300000
*                                                                       12350000
*********************************************************************** 12400000
*** ISTRIV13 - maps the Performance Monitor vector.                  ** 12437500
***            Identifies a table of Performance Data vector fields  ** 12475000
***            (within ISTXPL) that have been retired by the         ** 12512500
***            Performance Monitor Interface since its inception.    ** 12550000
*********************************************************************** 12600000
ISTRIV13 DSECT                      PERFORMANCE MONITOR VECTOR   @L1A   12650000
*                                                                       12700000
RIV13LEN DS    X                    VECTOR LENGTH                @L1A   12750000
RIV13KEY DS    X                    VECTOR KEY                   @L1A   12800000
RIV13KYC EQU   X'13'                KEY IS X'13'                 @L1A   12850000
RIV13ENT DS    HL2                  NUMBER OF ENTRIES IN TABLE   @L2A   12900000
*                                   (ZERO IF NONE RETIRED)              12925000
RIV13RFT DS    AL4                  RETIRED FIELDS TABLE ADDRESS @L2A   12950000
*                                   (ZERO IF NONE RETIRED)              12975000
RIV13ELN DS    HL2                  LENGTH OF EACH ENTRY         @L2A   13000000
*                                                                       13050000
RIV13TBL DSECT                      RETIRED FIELDS TABLE ENTRY   @L1A   13075000
*                                   (MAPS ENTRIES IN TABLE ADDRESSED    13100000
*                                   BY RIV13RFT)                        13125000
RIV13VID DS    0CL6                 ID OF AFFECTED VECTOR        @L1A   13150000
RIV13MAJ DS    CL2                  MAJOR CATEGORY               @L1A   13200000
RIV13SUB DS    CL2                  SUBCATEGORY                  @L1A   13250000
RIV13REC DS    CL2                  RECORD TYPE                  @L1A   13300000
RIV13FLD DS    0CL4                 FIELD POSITION WITHIN VECTOR @L1A   13350000
RIV13OFF DS    HL2                  FIELD OFFSET                 @L1A   13400000
RIV13FLG DS    BL1                  FLAG BYTE                    @L1A   13450000
RIV13BIT EQU   X'01'                DATA TYPE INDICATOR                 13500000
*                                   (1= BITSTRING, 0= OTHER)     @L1A   13550000
RIV13LNG DS    XL1                  FIELD LENGTH IF NOT BITSTRING,      13600000
*                                   MASK FOR BITS RETIRED WITHIN BYTE   13650000
*                                   FOR BITSTRING FIELD                 13700000
*                                                                       13750000
         MEND                                                        */ 13800000
*                                                                       13850000
*@LISTPOP;                          /* Begin PL/X mapping        @Y1C*/ 13900000
*/********************************************************************/ 13950000
*/* ISTRIVL  - maps the Resource Information Vector List header.     */ 14000000
*/*            The vector list contains information about the        */ 14050000
*/*            application program that opened an ACB at execution   */ 14100000
*/*            time.                                                 */ 14150000
*/********************************************************************/ 14200000
*  DCL                                                                  14250000
*    1 ISTRIVL   BDY(BYTE) BASED,   /* RESOURCE INFORMATION VECTOR      14300000
*                                      LIST                          */ 14350000
*      2 RIVLLEN  FIXED(16) BDY(BYTE), /* TOTAL LENGTH OF VECTORS    */ 14400000
*      2 RIVLDATA CHAR(0);          /* VECTOR DATA               @Y3C*/ 14450000
*                                                                       14500000
*/********************************************************************/ 14550000
*/*  GENERALIZED MAPPING FOR EXAMINING COMMON FIELDS IN ALL ACB      */ 14600000
*/*  VECTORS IN THE VECTOR LIST POINTED TO BY ACBRIVL                */ 14650000
*/********************************************************************/ 14700000
*  DCL                                                                  14750000
*    1 ISTRIVVT  BDY(BYTE) BASED,   /* VECTOR FIELDS             @Y3A*/ 14800000
*      2 RIVVTLEN       FIXED(8),   /* VECTOR LENGTH             @Y4C*/ 14850000
*      2 RIVVTKEY       CHAR(1),    /* VECTOR KEY                @Y3A*/ 14900000
*      2 RIVVTDAT       CHAR(0);    /* VECTOR DATA               @Y3A*/ 14950000
*                                                                       15000000
*                                                                       15050000
*/********************************************************************/ 15100000
*/* ISTRIV02 - maps the application's network name vector.           */ 15150000
*/*          - The name is specified by the name field of the        */ 15200000
*/*            application definition statement.                     */ 15250000
*/*          - This is obtained from the NAME ON APPL STATEMENT.     */ 15300000
*/********************************************************************/ 15350000
*  DCL                                                                  15400000
*    1 ISTRIV02 BDY(BYTE) BASED,    /* APPLICATION NETWORK NAME      */ 15450000
*      2 RIV02LEN FIXED(8),         /* VECTOR LENGTH                 */ 15500000
*      2 RIV02KEY CHAR(1),          /* VECTOR KEY X'02'              */ 15550000
*      2 RIV02DTA CHAR(8);          /* VECTOR DATA                   */ 15600000
*                                                                       15650000
*  DCL                                                                  15700000
*    RIV02KYC BIT(8) CONSTANT('02'X); /* RIV02KEY - X'02'            */ 15750000
*                                                                       15800000
*/********************************************************************/ 15850000
*/* ISTRIV03 - maps the application's ACB name vector.               */ 15900000
*/*          - This is supplied by the APPLID operand on the ACB     */ 15950000
*/*            statement or can be supplied by the operating         */ 16000000
*/*            system.  During OPEN ACB, VTAM will search for the    */ 16050000
*/*            application's characteristics by matching the ACB     */ 16100000
*/*            APPLID value to an RDTE with the application's        */ 16150000
*/*            ACBNAME.  If ACBNAME was not coded for the            */ 16200000
*/*            application, VTAM will search for a match with an     */ 16250000
*/*            RDTE containing the application's network name.       */ 16300000
*/*          - This is obtained from the APPLID on ACB MACRO.        */ 16350000
*/********************************************************************/ 16400000
*  DCL                                                                  16450000
*    1 ISTRIV03  BDY(BYTE) BASED,   /* APPLICATION ACB NAME VECTOR   */ 16500000
*      2 RIV03LEN FIXED(8),         /* VECTOR LENGTH                 */ 16550000
*      2 RIV03KEY CHAR(1),          /* VECTOR KEY X'03'              */ 16600000
*      2 RIV03DTA CHAR(8);          /* VECTOR DATA                   */ 16650000
*                                                                       16700000
*  DCL                                                                  16750000
*    RIV03KYC BIT(8) CONSTANT('03'X); /* RIV03KEY - X'03'            */ 16800000
*                                                                       16850000
*/********************************************************************/ 16900000
*/* ISTRIV06 - maps the network name in which the host resides.      */ 16950000
*/*          - This is obtained from the NETID START OPTION          */ 17000000
*/*            If NETID start option is not specified, this value    */ 17050000
*/*            will be blanks.                                       */ 17100000
*/********************************************************************/ 17150000
*  DCL                                                                  17200000
*    1 ISTRIV06  BDY(BYTE) BASED,   /* NETWORK NAME VECTOR           */ 17250000
*      2 RIV06LEN FIXED(8),         /* VECTOR LENGTH                 */ 17300000
*      2 RIV06KEY CHAR(1),          /* VECTOR KEY X'06'              */ 17350000
*      2 RIV06DTA CHAR(8);          /* VECTOR DATA                   */ 17400000
*                                                                       17450000
*  DCL                                                                  17500000
*    RIV06KYC BIT(8) CONSTANT('06'X); /* RIV06KEY - X'06'            */ 17550000
*                                                                       17600000
*/********************************************************************/ 17650000
*/* ISTRIV07 - maps the SSCP Name vector.                            */ 17700000
*/*          - This is obtained from the SSCPNAME START OPTION       */ 17750000
*/********************************************************************/ 17800000
*  DCL                                                                  17850000
*    1 ISTRIV07  BDY(BYTE) BASED,   /* SSCP NAME VECTOR              */ 17900000
*      2 RIV07LEN FIXED(8),         /* VECTOR LENGTH                 */ 17950000
*      2 RIV07KEY CHAR(1),          /* VECTOR KEY X'07'              */ 18000000
*      2 RIV07DTA CHAR(8);          /* VECTOR DATA                   */ 18050000
*                                                                       18100000
*  DCL                                                                  18150000
*    RIV07KYC BIT(8) CONSTANT('07'X); /* RIV07KEY - X'07'            */ 18200000
*                                                                       18250000
*  DCL                                                                  18300000
*    RIV07DTD CHAR(8) CONSTANT('VTAM    '); /* RIV07DTA - DEFAULT    */ 18350000
*                                                                       18400000
*/********************************************************************/ 18450000
*/* ISTRIV08 - maps the Host Subarea PU Network Name vector.         */ 18500000
*/*          - This is obtained from the HOSTPU START OPTION         */ 18550000
*/*            If HOSTPU start option is not specified, the name     */ 18600000
*/*            will default to 'ISTPUS  '.                           */ 18650000
*/********************************************************************/ 18700000
*  DCL                                                                  18750000
*    1 ISTRIV08  BDY(BYTE) BASED,   /* HOST SUBAREA PU NETWORK NAME  */ 18800000
*      2 RIV08LEN FIXED(8),         /* VECTOR LENGTH                 */ 18850000
*      2 RIV08KEY CHAR(1),          /* VECTOR KEY X'08'              */ 18900000
*      2 RIV08DTA CHAR(8);          /* VECTOR DATA                   */ 18950000
*                                                                       19000000
*  DCL                                                                  19050000
*    RIV08KYC BIT(8) CONSTANT('08'X); /* RIV08KEY - X'08'            */ 19100000
*                                                                       19150000
*  DCL                                                                  19200000
*    RIV08DTD CHAR(8) CONSTANT('ISTPUS  '); /* RIV08DTA - DEFAULT    */ 19250000
*                                                                       19300000
*/********************************************************************/ 19350000
*/* ISTRIV09 - maps the Host Subarea PU network address vector.      */ 19400000
*/*          - It contains the network address of the host           */ 19450000
*/*            subarea PU.                                           */ 19500000
*/********************************************************************/ 19550000
*  DCL                                                                  19600000
*    1 ISTRIV09  BDY(BYTE) BASED,   /* HOST SUBAREA PU NETWORK ADDRESS  19650000
*                                      VECTOR                        */ 19700000
*      2 RIV09LEN FIXED(8),         /* VECTOR LENGTH                 */ 19750000
*      2 RIV09KEY CHAR(1),          /* VECTOR KEY X'09'              */ 19800000
*      2 RIV09DTA CHAR(6);          /* VECTOR DATA                   */ 19850000
*                                                                       19900000
*  DCL                                                                  19950000
*    RIV09KYC BIT(8) CONSTANT('09'X); /* RIV09KEY - X'09'            */ 20000000
*                                                                       20050000
*/********************************************************************/ 20100000
*/* ISTRIV0A - maps the maximum subarea vector.                      */ 20150000
*/*          - Contains the maximum subarea number that is valid     */ 20200000
*/*            for the host's domain.                                */ 20250000
*/*          - This is obtained from the MAXSUBA START OPTION        */ 20300000
*/********************************************************************/ 20350000
*  DCL                                                                  20400000
*    1 ISTRIV0A  BDY(BYTE) BASED,   /* MAXIMUM SUBAREA NUMBER VECTOR */ 20450000
*      2 RIV0ALEN FIXED(8),         /* VECTOR LENGTH                 */ 20500000
*      2 RIV0AKEY CHAR(1),          /* VECTOR KEY X'0A'              */ 20550000
*      2 RIV0ADTA FIXED(8);         /* VECTOR DATA                   */ 20600000
*                                                                       20650000
*  DCL                                                                  20700000
*    RIV0AKYC BIT(8) CONSTANT('0A'X); /* RIV0AKEY - X'0A'            */ 20750000
*                                                                       20800000
*/********************************************************************/ 20850000
*/* ISTRIV0B - maps the LU 6.2 application definition vector.        */ 20900000
*/*            After the LU 6.2 application program has issued an    */ 20950000
*/*            open ACB, the LU 6.2 application program may use      */ 21000000
*/*            this vector to determine the values coded on the      */ 21050000
*/*            APPL definition statement.                            */ 21100000
*/*          - This is obtained from the APPL STATEMENT PARAMETERS   */ 21150000
*/********************************************************************/ 21200000
*  DCL                                                                  21250000
*    1 ISTRIV0B  BDY(BYTE) BASED,   /* LU 6.2 APPL DEFINITION VECTOR */ 21300000
*      2 RIV0BLEN FIXED(8),         /* VECTOR LENGTH                 */ 21350000
*      2 RIV0BKEY CHAR(1),          /* VECTOR KEY X'0B'              */ 21400000
*      2 RIV0BDTA,                  /* VECTOR DATA                   */ 21450000
*        3 *        BIT(8),         /* RESERVED                      */ 21500000
*          4 RIV0BSLV BIT(2),       /* SESSION-LEVEL LU-LU              21550000
*                                      VERIFICATION MASK             */ 21600000
*          4 *        BIT(6),       /* RESERVED                      */ 21650000
*        3 RIV0BCLS CHAR(1),        /* CONVERSATION SECURITY            21700000
*                                      ACCEPTANCE                    */ 21750000
*        3 RIV0BFLG CHAR(1),        /* MISCELLANEOUS FLAGS           */ 21800000
*          4 RIV0BDDL BIT(1),       /* DDRAINL=ALLOW                 */ 21850000
*          4 RIV0BDRL BIT(1),       /* DRESPL=ALLOW                  */ 21900000
*          4 RIV0BATA BIT(1),       /* ATNLOSS=ALL                   */ 21950000
*          4 RIV0BSYP BIT(1),       /* SYNCLVL=SYNCPT                */ 22000000
*          4 RIV0BOPC BIT(1),       /* OPERCNOS=ALLOW                */ 22050000
*          4 *        BIT(3),       /* RESERVED                      */ 22100000
*        3 *        CHAR(1),        /* RESERVED                      */ 22150000
*        3 RIV0BDSL FIXED(16) BDY(BYTE), /* DSESLIM VALUE            */ 22200000
*        3 RIV0BDML FIXED(16) BDY(BYTE), /* DMINWNL VALUE            */ 22250000
*        3 RIV0BDMR FIXED(16) BDY(BYTE), /* DMINWNR VALUE            */ 22300000
*        3 RIV0BAUT FIXED(16) BDY(BYTE); /* AUTOSES VALUE            */ 22350000
*                                                                       22400000
*  DCL                                                                  22450000
*    RIV0BKYC BIT(8) CONSTANT('0B'X); /* RIV0BKEY - X'0B'            */ 22500000
*                                                                       22550000
*  DCL                                                                  22600000
*    RIV0BSLN BIT(2) CONSTANT('00'B), /* RIV0BSLV - NONE             */ 22650000
*    RIV0BSLO BIT(2) CONSTANT('01'B), /* RIV0BSLV - OPTIONAL         */ 22700000
*    RIV0BSLR BIT(2) CONSTANT('10'B); /* RIV0BSLV - REQUIRED         */ 22750000
*                                                                       22800000
*  DCL                                                                  22850000
*    RIV0BCLN BIT(8) CONSTANT('01'X), /* RIV0BCLS - NONE             */ 22900000
*    RIV0BCLC BIT(8) CONSTANT('02'X), /* RIV0BCLS - CONV             */ 22950000
*    RIV0BCLA BIT(8) CONSTANT('03'X), /* RIV0BCLS - ALREADYV         */ 23000000
*    RIV0BCLP BIT(8) CONSTANT('04'X), /* RIV0BCLS - PERSISTV         */ 23050000
*    RIV0BCLV BIT(8) CONSTANT('05'X); /* RIV0BCLS - AVPV             */ 23100000
*                                                                       23150000
*/********************************************************************/ 23200000
*/* ISTRIV0C - maps the common application definition vector.        */ 23200700
*/*            After the application program has issued an open for  */ 23201400
*/*            its ACB, the application may examine this vector to   */ 23202100
*/*            determine the values coded on the APPL definition     */ 23202800
*/*            statement for common application defination keywords. */ 23203500
*/*          - This is obtained from the APPL STATEMENT PARAMETERS   */ 23204200
*/********************************************************************/ 23204900
*  DCL                                                                  23205600
*    1 ISTRIV0C  BDY(BYTE) BASED,   /* APPLICATION DEFINITION VECTOR    23206300
*                                      FOR ALL APPLICATION PROGRAMS     23207000
*                                      (FROM APPL STATEMENT PARAMETERS) 23207700
*                                                                @N1A*/ 23208400
*      2 RIV0CLEN FIXED(8),         /* VECTOR LENGTH             @N1A*/ 23209100
*      2 RIV0CKEY CHAR(1),          /* VECTOR KEY X'0C'          @N1A*/ 23209800
*      2 RIV0CDTA,                  /* VECTOR DATA               @N1A*/ 23210500
*        3 RIV0CAUT BIT(8),         /* AUTHORIZATION SETTINGS    @N1A*/ 23211200
*          4 RIV0CACQ BIT(1),       /* AUTH=ACQ                  @N1A*/ 23211900
*          4 RIV0CASD BIT(1),       /* AUTH=ASDP                 @N1A*/ 23212600
*          4 RIV0CCNM BIT(1),       /* AUTH=CNM                  @N1A*/ 23213300
*          4 RIV0CPAS BIT(1),       /* AUTH=PASS                 @N1A*/ 23214000
*          4 RIV0CPPO BIT(1),       /* AUTH=PPO                  @N1A*/ 23214700
*          4 RIV0CSPO BIT(1),       /* AUTH=SPO                  @N1A*/ 23215400
*          4 RIV0CTSO BIT(1),       /* AUTH=TSO                  @N1A*/ 23216100
*          4 RIV0CVPA BIT(1),       /* AUTH=VPACE                @N1A*/ 23216800
*        3 RIV0CFL1 BIT(8),         /* MISCELLANEOUS FLAGS 1     @N1A*/ 23217500
*          4 RIV0CAPC BIT(1),       /* APPC=YES                  @N1A*/ 23218200
*          4 RIV0CAUX BIT(1),       /* AUTHEXIT=YES              @N1A*/ 23218900
*          4 RIV0CCER BIT(1),       /* CERTIFY=YES               @N1A*/ 23219600
*          4 RIV0CDSW BIT(1),       /* DSPLYWLD=YES              @N1A*/ 23220300
*          4 RIV0CFSP BIT(1),       /* FASTPASS=YES              @N1A*/ 23221000
*          4 RIV0CHAV BIT(1),       /* HAVAIL=YES                @N1A*/ 23221700
*          4 RIV0CPAR BIT(1),       /* PARSESS=YES               @N1A*/ 23222400
*          4 RIV0CPRS BIT(1),       /* PERSIST=MULTI             @N1A*/ 23223100
*        3 RIV0CFL2 BIT(8),         /* MISCELLANEOUS FLAGS 2     @N1A*/ 23223800
*          4 RIV0CSSL BIT(1),       /* SESSLIM=YES               @N1A*/ 23224500
*          4 RIV0CSON BIT(1),       /* SONSCIP=YES               @N1A*/ 23225200
*          4 RIV0CSRX BIT(1),       /* SRBEXIT=YES               @N1A*/ 23225900
*          4 RIV0CVCN BIT(1),       /* VCNS=YES                  @N1A*/ 23226600
*          4 RIV0CVFR BIT(1),       /* VTAMFRR=YES               @N1A*/ 23227300
*          4 *        BIT(3),       /* RESERVED                  @N1A*/ 23228000
*        3 RIV0CLTM BIT(8),         /* LOSTERM SETTING           @N1A*/ 23228700
*        3 RIV0CCMI FIXED(8),       /* CMPAPPLI VALUE            @N1A*/ 23229400
*        3 RIV0CCMO FIXED(8),       /* CMPAPPLO VALUE            @N1A*/ 23230100
*        3 RIV0CENC BIT(8),         /* ENCR VALUE                @N1A*/ 23230800
*        3 RIV0CVPC FIXED(8),       /* VPACING VALUE             @N1A*/ 23231500
*        3 *        CHAR(4);        /* RESERVED                  @N1A*/ 23232200
*                                                                       23232900
*  DCL                                                                  23233600
*    RIV0CKYC BIT(8) CONSTANT('0C'X); /* RIV0CKEY - X'0C'        @N1A*/ 23234300
*                                                                       23235000
*  DCL                                                                  23235700
*    RIV0CLTN BIT(8) CONSTANT('00'X), /* LOSTERM=NORMAL          @N1A*/ 23236400
*    RIV0CLTI BIT(8) CONSTANT('01'X), /* LOSTERM=IMMED           @N1A*/ 23237100
*    RIV0CLTS BIT(8) CONSTANT('02'X); /* LOSTERM=SECOND          @N1A*/ 23237800
*                                                                       23238500
*  DCL                                                                  23239200
*    RIV0CECN BIT(8) CONSTANT('00'X), /* ENCR=NONE               @N1A*/ 23239900
*    RIV0CECO BIT(8) CONSTANT('01'X), /* ENCR=OPT                @N1A*/ 23240600
*    RIV0CECC BIT(8) CONSTANT('02'X), /* ENCR=COND               @N1A*/ 23241300
*    RIV0CECS BIT(8) CONSTANT('03'X), /* ENCR=SEL                @N1A*/ 23242000
*    RIV0CECR BIT(8) CONSTANT('04'X); /* ENCR=REQD               @N1A*/ 23242700
*                                                                       23243400
*/********************************************************************/ 23244100
*/* ISTRIV11 - maps the APPCCMD vector area length vector. It        */ 23250000
*/*          - It contains the absolute minimum length and the       */ 23300000
*/*            recommended minimum length for full use of the        */ 23350000
*/*            APPCCMD vector area.                                  */ 23400000
*/********************************************************************/ 23450000
*  DCL                                                                  23500000
*    1 ISTRIV11  BDY(BYTE) BASED,   /* APPCCMD VECTOR AREA LENGTH       23550000
*                                      VECTOR                    @L3C*/ 23600000
*      2 RIV11BAS,                                                      23650000
*        3 RIV11LEN FIXED(8),         /* VECTOR LENGTH               */ 23700000
*        3 RIV11KEY CHAR(1),          /* VECTOR KEY X'11'            */ 23750000
*      2 RIV11ADD,                                                      23800000
*        3 RIV11AML FIXED(32) BDY(BYTE), /* ABSOLUTE MINIMUM APPCCMD    23850000
*                                      VECTOR AREA LENGTH        @L3A*/ 23900000
*        3 RIV11RML FIXED(32) BDY(BYTE); /* RECOMMENDED MINIMUM APPCCMD 23950000
*                                      VECTOR AREA LENGTH        @L3C*/ 24000000
*                                                                       24050000
*  DCL                                                                  24100000
*    RIV11KYC BIT(8) CONSTANT('11'X); /* RIV11KEY - X'11'            */ 24150000
*                                                                       24200000
*/********************************************************************/ 24250000
*/* ISTRIV12 - maps the application to VTAM vector keys vector.      */ 24300000
*/*          - It contains a list of all ACB vector keys that        */ 24350000
*/*            VTAM will process. Constants for the ACB vectors are  */ 24400000
*/*            located in ISTVACBV.                                  */ 24450000
*/********************************************************************/ 24500000
*  DCL                                                                  24550000
*    1 ISTRIV12  BDY(BYTE) BASED,   /* APPLICATION TO VTAM VECTOR       24600000
*                                      KEYS FOR ACB MACRO            */ 24650000
*      2 RIV12BAS,                                                      24700000
*        3 RIV12LEN FIXED(8),       /* VECTOR LENGTH                 */ 24750000
*        3 RIV12KEY CHAR(1),        /* VECTOR KEY X'12'              */ 24800000
*      2 RIV12ADD  BDY(BYTE),                                           24850000
*        3 RIV12DTA CHAR(*);        /* VECTOR DATA                   */ 24900000
*                                                                       24950000
*  DCL                                                                  25000000
*    RIV12KYC BIT(8) CONSTANT('12'X); /* RIV12KEY - X'12'            */ 25050000
*                                                                       25100000
*/********************************************************************/ 25150000
*/* ISTRIV13 - maps the Performance Monitor vector.                  */ 25187500
*/*            Identifies a table of Performance Data vector fields  */ 25225000
*/*            (within ISTXPL) that have been retired by the         */ 25262500
*/*            Performance Monitor Interface since its inception.    */ 25300000
*/********************************************************************/ 25350000
*  DCL                                                                  25400000
*    1 ISTRIV13  BDY(BYTE) BASED,   /* PERFORMANCE MONITOR VECTOR       25433300
*                                                                @L1A*/ 25466600
*      2 RIV13LEN FIXED(8),         /* VECTOR LENGTH             @L1A*/ 25500000
*      2 RIV13KEY CHAR(1),          /* VECTOR KEY X'13'          @L1A*/ 25550000
*      2 RIV13ENT FIXED(16) BDY(BYTE), /* NUMBER OF ENTRIES IN TABLE    25600000
*                                      (ZERO IF NONE RETIRED)    @L2A*/ 25650000
*      2 RIV13RFT PTR(31) BDY(BYTE), /* RETIRED FIELDS TABLE ADDRESS    25700000
*                                      (ZERO IF NONE RETIRED)    @L2A*/ 25750000
*      2 RIV13ELN FIXED(16) BDY(BYTE); /* LENGTH OF EACH ENTRY   @L2A*/ 25800000
*                                                                       25850000
*  DCL                                                                  25900000
*    1 RIV13TBL(*) CHAR(10) BASED(RIV13RFT), /* RETIRED FIELDS TABLE    25950000
*                                      ENTRY (MAPS ENTRIES IN TABLE     25983300
*                                      ADDRESSED BY RIV13RFT)    @L2C*/ 26016600
*      3 RIV13VID CHAR(6),          /* ID OF AFFECTED VECTOR     @L1A*/ 26050000
*        4 RIV13MAJ CHAR(2),        /* MAJOR CATEGORY            @L1A*/ 26100000
*        4 RIV13SUB CHAR(2),        /* SUBCATEGORY               @L1A*/ 26150000
*        4 RIV13REC CHAR(2),        /* RECORD TYPE               @L1A*/ 26200000
*      3 RIV13FLD CHAR(4),          /* FIELD POSITION WITHIN VECTOR     26250000
*                                                                @L1A*/ 26300000
*        4 RIV13OFF FIXED(16) BDY(BYTE), /* FIELD OFFSET         @L1A*/ 26350000
*        4 RIV13FLG BIT(8),         /* FLAG BYTE                 @L1A*/ 26400000
*          5 *          BIT(7),     /* RESERVED                  @L1A*/ 26450000
*          5 RIV13BIT BIT(1),       /* DATA TYPE INDICATOR              26500000
*                                      (1= BITSTRING, 0= OTHER)  @L1A*/ 26550000
*        4 RIV13LNG FIXED(8);       /* FIELD LENGTH IF NOT BITSTRING,   26587500
*                                      MASK FOR BITS RETIRED WITHIN     26625000
*                                      BYTE FOR BITSTRING FIELD  @L1A*/ 26662500
*                                                                       26700000
*  DCL                                                                  26750000
*    RIV13KYC BIT(8) CONSTANT('13'X); /* RIV13KEY - X'13'        @L1A*/ 26800000
