*/*A-000000-999999                                           @R495808*/ 00050000
*%GOTO   RPLRPL6;                                                       00100000
* /*                                                                    00150000
         MACRO                                                          00200000
         ISTRPL6X &GENEQU=                                              00250000
         AIF   ('&GENEQU' EQ 'YES').EQU                                 00300000
********* START OF SPECIFICATIONS ************************************  00350000
*                                                                    *  00400000
*      MACRO NAME: ISTRPL6X                                          *  00450000
*                                                                    *  00500000
*      DESCRIPTIVE NAME:                                             *  00550000
*         RPL APPC/VTAM EXTENSION                                    *  00600000
*                                                                    *  00650000
*      COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM               *  00700000
*                                                                    *  00750000
*                 THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"*  00800000
*                                                                    *  00850000
*                 5695-117 (C) COPYRIGHT IBM CORP. 1987, 1993.       *  00900000
*                 ALL RIGHTS RESERVED.                               *  00950000
*                                                                    *  01000000
*                 U.S. GOVERNMENT USERS RESTRICTED RIGHTS -          *  01050000
*                 USE, DUPLICATION OR DISCLOSURE RESTRICTED BY       *  01100000
*                 GSA ADP SCHEDULE CONTRACT WITH IBM CORP.           *  01150000
*                                                                    *  01200000
*                 SEE COPYRIGHT INSTRUCTIONS.                        *  01250000
*                                                                    *  01300000
*      FUNCTION:                                                     *  01400000
*        THE EXTENSION(RPL6) DESCRIBES MOST OF THE APPC REQUESTS     *  01450000
*        AND ERROR FEEDBACK INFORMATION THAT ONLY APPC USES.         *  01500000
*        IT IS CALLED BY THE RPL VTAM EXTENSION MACRO(ISTRPLEX)      *  01550000
*        UNDER THE FOLLOWING:                                        *  01600000
*                                                                    *  01650000
*        PLS: THE MODULE CONTAINING AN INCLUDE FOR IFGRPL SETS       *  01700000
*        THE MACRO VARIABLE 'ACBRPLXL' TO 'VTAM' PRIOR TO ISSUING    *  01750000
*        THE INCLUDE.                                                *  01800000
*                                                                    *  01850000
*        BAL: THE AM=VTAM PARAMETER IS CODED ON THE MACRO CALL       *  01900000
*             ( IFGRPL AM=VTAM )                                     *  01950000
*                                                                    *  02000000
*      NOTES:                                                        *  02050000
*                                                                    *  02100000
*                                                                    *  02150000
*      PROCESSOR: ASSEMBLER OR PL/AS                                 *  02200000
*                                                                    *  02250000
*      CREATED BY:                                                   *  02300000
*                                                                    *  02350000
*      INTERNAL MACROS: NONE                                         *  02400000
*                                                                    *  02450000
*      EXTERNAL REFERENCES: NONE                                     *  02500000
*                                                                    *  02550000
*      CHANGE ACTIVITY:                                              *  02600000
*         5/27/86 - ADD RPL6NQUA FOR UNDEFINED QUALIFY       @P030472*  02650000
*        12/08/86 - ADD RPL6STBF & RPL6STDS FOR STG SHORTAGE @P043961*  02700000
*        04/24/87 - ADD RPL6DEB FOR DOS777 BECAUSE THERE IS NO CRPL6 *  02750000
*                   IN DOS.                                  @R507001*  02800000
*        04/29/87 - CONVERSATION LEVEL SECURITY              @R507300*  02850000
*        10/30/87 - ADD WHAT RECEIVED FIELD FOR LOG DATA     @P051251*  02900000
*        12/10/87 - CORRECT RESERVED FIELDS                  @P052442*  02950000
*        01/05/88 - CHANGE FIELD DESCRIPTIONS                @P052802*  03000000
*        07/11/88 - CHANGES FOR VM/APPC CONSISTENCY          @P058398*  03050000
*                                                                    *  03100000
* $MAC(ISTRPL6X),COMP(API),PROD(VTAM): RPL APPC/VTAM EXTENSION       *  03150000
*                                                                    *  03200000
* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS              *  03250000
* ---- -------- ------- ------ ------  ----------------------------  *  03300000
* $F1= FC2@@CLD HVT3303 880315 013298: APPC CONWINNER SUPPORT        *  03350000
* $F2= FB3@@CLD HVT3303 880318 013298: PARTNER LU VERIFICATION       *  03400000
* $F3= FS1@@CLD HVT3303 880418 255471: SYNCPOINT SUPPORT             *  03450000
* $F4= RCR0004  HVT3303 880907 255471: SYNCPOINT RCR SUPPORT         *  03500000
* $Q1= P063278  HVT3303 881116 255471: IMPLEMENT SESSION DEACTIVATION*  03550000
*                                      DELAYED FUNCTION              *  03600000
* $Q2= P064622  HVT3303 890118 460025: REMOVE RESYNC PRIORITY        *  03650000
* $B1= AE@@@AMS HVT3401 890322 460025: SELECTION DATA ENCRYPTION     *  03700000
* $B2= AP@@@CLD HVT3401 890323 496698: PERSISTENT LU-LU SESSIONS     *  03750000
* $Q3= P073492  HVT3303 890331 255471: DELETE AN UNUSED FIELD        *  03800000
* $B3= AV@@@AMS HVT3401 890421 577378: PERSISTENT VERIFICATION       *  03850000
* $Q4= P070114  HVT3303 890615 255471: FIX RPL6DERC CONSTANTS        *  03900000
* $BB= ACC@@AMS HVT3401 891025 615520: PL/AS CONVERSION              *  03950000
* $V1= P082013  HVT3401 900827 474203: Syncpoint processing for      *  04000000
* $KF= S4N@@CLD HATAPPN 910326 692313: CP-CP sessions                *  04050000
* $KG= JN@@@CLD NQNAME2 910515 424266: Enhanced NQN support          *  04100000
* $V2= P096925  HVT3401 910701 051418: CHANGE COMMENTS FOR ISTSLCNS  *  04150000
* $KH= SZADR001 ALWFREE 910702 584390: APPC ALLOCATE Enhancement     *  04200000
* $I1= BD@@@MST APPCE03 911021 510689: APPC Deallocate queueing      *  04250000
* $I2= BR@@@MST APPCE01 911108 510689: APPC Receive Immediate        *  04300000
* $I3= FF@@@MST APPCFDX 920107 879315: APPC Full-Duplex support      *  04350000
* $I4= FT@@@MST APPCTST 920122 879315: APPC TESTSTAT command         *  04400000
* $L1= KA@@@PLD APPCRR  930709 576146: DCE Security Services         *  04450000
* $U2= P110887  GENRES  931024 879315: Generic resource name usage   *  04500000
* $U3= P111572  GENRES  931029 879315: Correct NAMU BAL constants    *  04550000
* $M1= STARTUP  VMAPPN  940708 879315: Reserve fields no longer used *  04600000
* $L2= KA@DR006 APPCRR  940715 578000: APPCCMD Vector List In        *  04650000
* $L3= KD@DR001 APPNV43 940823 051418: Reserve Vector List Out       *  04700000
* $D1= IA@@@MST V51APPC 941026 226653: APPCCMD enhancements          *  04716600
* $D2= ID@@@MST FPAPI   941117 143576: Fastpath API for APPC         *  04733200
* $21= VM59818  INDY    951107 970691: ADD RPL6BISC BIT              *  04741600
*                                                                    *  04750000
********* END OF SPECIFICATIONS **************************************  04800000
*                                                                    */ 04850000
*%RPLRPL6: ;                                                            04900000
*/*                                                                  */ 04950000
*/*   COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                */ 05000000
*/*                                                                  */ 05050000
*/*              THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM" */ 05100000
*/*                                                                  */ 05150000
*/*              5695-117 (C) COPYRIGHT IBM CORP. 1987, 1993.        */ 05200000
*/*              ALL RIGHTS RESERVED.                                */ 05250000
*/*                                                                  */ 05300000
*/*              U.S. GOVERNMENT USERS RESTRICTED RIGHTS -           */ 05350000
*/*              USE, DUPLICATION OR DISCLOSURE RESTRICTED BY        */ 05400000
*/*              GSA ADP SCHEDULE CONTRACT WITH IBM CORP.            */ 05450000
*/*                                                                  */ 05500000
*/*              SEE COPYRIGHT INSTRUCTIONS.                         */ 05550000
*/*                                                                  */ 05600000
*%GOTO   RPL6DCL;           /*                                          05650000
         AGO   .RPL6BAL         */                                      05700000
*%RPL6DCL: ;                                                            05750000
*DCL  1 ISTRPL6X BASED,                  /* START OF APPC               05800000
*                                           EXTENSION                */ 05850000
*         2 RPL6AREA,                                                   05900000
*                                                                       05950000
*             3 RPL6CBID    CHAR(4),     /* CONTROL BLOCK IDENTIFIER */ 06000000
*             3 RPL6REQ     BIT(8),      /* CONTROL VALUE OF APPCCMD */ 06050000
*             3 RPL6QUAL    BIT(8),      /* QUALIFY VALUE OF APPCCMD */ 06100000
*             3 *           CHAR(2),     /* NOT USED                 */ 06150000
*             3 RPL6CNVD    FIXED(32),   /* CONVERSATION ID          */ 06200000
*             3 RPL6USR     BIT(32),     /* USER FIELD               */ 06250000
*             3 RPL6SNSO    BIT(32),     /* SENSE DATA SPECIFIED        06300000
*                                           ON APPCCMD               */ 06350000
*             3 RPL6SNSI    BIT(32),     /* SENSE DATA RETURNED         06400000
*                                           BY APPCCMD               */ 06450000
*             3 RPL6SGNL    BIT(32),     /* SIGNAL DATA RETURNED ON ALL 06500000
*                                           APPCCMDS IF SIGRCV=YES,     06550000
*                                           RESERVED IF SIGRCV = NO  */ 06600000
*             3 RPL6SIDL    FIXED(8),    /* LENGTH OF SESSION ID     */ 06650000
*             3 *           BIT(24),     /* NOT USED                 */ 06700000
*             3 RPL6SSID    BIT(64),     /* SESSION IDENTIFICATION   */ 06750000
*             3 RPL6RC,                  /* RPL6 RETURN CODES        */ 06800000
*               4 RPL6RCPR  BIT(16),     /* PRIMARY RETURN CODE      */ 06850000
*               4 RPL6RCSC  BIT(16),     /* SECONDARY RETURN CODE    */ 06900000
*             3 RPL6FLGS      BIT(32),   /* ALL INDICATORS SPECIFIC     06950000
*                                           TO VTAM'S APPCCMD MACRO  */ 07000000
*               4 RPL6FLG1    BIT(8),    /* FIRST INDICATORS BYTE    */ 07050000
*                 5 RPL6FILL  BIT(1),    /* FILL INDICATOR              07100000
*                                           '0'B = "FILL=BUFF"          07150000
*                                           '1'B = "FILL=LL"         */ 07200000
*                 5 RPL6CD    BIT(1),    /* CD INDICATOR                07250000
*                                           '0'B ="CD=IMMED"            07300000
*                                           '1'B ="CD=DEFER" @P058398*/ 07350000
*                 5 *         BIT(1),    /* NOT USED             @Q2C*/ 07400000
*                 5 RPL6SLS   BIT(1),    /* PARTNER LU VERIFIED         07450000
*                                           '1'B = "VERIFIED"           07500000
*                                           '0'B = "NOT VERIFIED"       07550000
*                                                                @F2A*/ 07600000
*                 5 RPL6CFTX  BIT(1),    /* CONFTXT INDICATOR           07650000
*                                           '1'B = "CONFTXT=YES"        07700000
*                                           '0'B = "CONFTXT=NO"      */ 07750000
*                 5 RPL6LIST  BIT(2),    /* SCOPE OF INFORMATION TO BE  07800000
*                                           RETURNED IN THE RESTORE     07850000
*                                           COMMAND              @B2A*/ 07900000
*                 5 *         BIT(1),    /* NOT USED             @B2C*/ 07950000
*               4 RPL6FLG2    BIT(8),    /* SECOND INDICATORS BYTE   */ 08000000
*                 5 RPL6BISC  BIT(1),    /* Bis Exchange completed      08033300
*                                                                @21A*/ 08066600
*                 5 RPL6RTSX  BIT(1),    /* RTS_RCVD RETURN INDICATOR   08100000
*                                           '0'B = RTSRTRN=BOTH         08150000
*                                           '1'B = RTSRTRN=EXPD  @I3A*/ 08200000
*                 5 RPL6CXMD  BIT(2),    /* CONVERSATION EXPEDITED      08250000
*                                           DATA MODE (CONXMOD)  @I3A*/ 08300000
*                 5 RPL6TYPE  BIT(2),    /* TYPE INDICATOR           */ 08350000
*                 5 RPL6NAMU  BIT(2),    /* NAME USE REQUESTED WHEN     08400000
*                                           APPLICATION IS ACTING AS    08450000
*                                           A GENERIC RESOURCE   @U2C*/ 08500000
*               4 RPL6FLG3    BIT(8),    /* THIRD INDICATORS BYTE    */ 08550000
*                 5 RPL6LOCK  BIT(1),    /* LOCKS INDICATOR             08600000
*                                           '0'B = "LOCKS=LONG"         08650000
*                                           '1'B = "LOCKS=SHORT"     */ 08700000
*                 5 RPL6DERC  BIT(2),    /* SESSION DEACTIVATION        08750000
*                                           REASON CODE          @Q1A*/ 08800000
*                 5 RPL6EXDR  BIT(1),    /* EXPEDITED DATA RECEIVED     08850000
*                                                                @I3C*/ 08900000
*                 5 RPL6CMOD  BIT(2),    /* CONMODE INDICATOR        */ 08950000
*                 5 RPL6LAST  BIT(2),    /* LAST INDICATOR              09000000
*                                           FOR ATTN LOSS EXIT   @F4A*/ 09050000
*               4 RPL6FLG4    BIT(8),    /* FOURTH INDICATORS BYTE   */ 09100000
*                 5 *         BIT(8),    /* NOT USED             @Q3C*/ 09150000
*             3 RPL6LU      CHAR(8),     /* NAME OF LU               */ 09200000
*             3 RPL6MODE    CHAR(8),     /* MODE NAME TO BE USED     */ 09250000
*             3 RPL6WHAT    BIT(16),     /* "WHAT RECEIVED" INDICATOR   09300000
*                                           RETURNED AT COMPLETION OF   09350000
*                                           APPCCMD RECEIVE COMMAND  */ 09400000
*               4 RPL6RCV1    BIT(8),                                   09450000
*                 5 RPL6WDAT  BIT(1),    /* WHATRCV=DATA             */ 09500000
*                 5 RPL6WDAC  BIT(1),    /* WHATRCV=DATA_COMPLETE    */ 09550000
*                 5 RPL6WDAI  BIT(1),    /* WHATRCV=DATA_INCOMPLETE  */ 09600000
*                 5 RPL6WSND  BIT(1),    /* WHATRCV=SEND             */ 09650000
*                 5 RPL6WCFM  BIT(1),    /* WHATRCV=CONFIRM          */ 09700000
*                 5 RPL6WDAL  BIT(1),    /* WHATRCV=DEALLOCATE       */ 09750000
*                 5 RPL6WLOG  BIT(1),    /* WHATRCV=LOG_DATA @P051251*/ 09800000
*                 5 RPL6WPSH  BIT(1),    /* WHATRCV=PS_HEADER    @F3A*/ 09850000
*               4 RPL6RCV2   BIT(8),                                    09900000
*                 5 RPL6WPSI  BIT(1),    /* WHATRCV=PARTIAL_PS_HEADER   09950000
*                                                                @F3A*/ 10000000
*                 5 *         BIT(7),    /* NOT USED             @F3C*/ 10050000
*             3 RPL6RTUN    BIT(8),      /* RETURNED INDICATORS AS      10100000
*                                           A RESULT OF APPCCMD      */ 10150000
*                 5 RPL6RMH5  BIT(1),    /* FMH5RCV INDICATOR        */ 10200000
*                 5 RPL6RLOG  BIT(1),    /* LOGRCV INDICATOR         */ 10250000
*                 5 RPL6RSIG  BIT(1),    /* SIGRCV INDICATOR         */ 10300000
*                 5 RPL6SECL  BIT(3),    /* LU SECURITY      @R507300*/ 10350000
*                   6 RPL6CLSA BIT(1),   /* PARTNER LU ACCEPTS SECURITY 10400000
*                                           SUBFIELDS ON FMH5           10450000
*                                                            @P052802*/ 10500000
*                   6 RPL6AVFA BIT(1),   /* PARTNER LU ACCEPTS REQUESTS 10550000
*                                           FOR ALREADY VERIFIED        10600000
*                                                            @P052442*/ 10650000
*                   6 RPL6PV   BIT(1),   /* PARTNER LU ACCEPTS REQUESTS 10700000
*                                           FOR PERSISTENT VERIFICATION 10750000
*                                                                @B3C*/ 10800000
*                 5 RPL6CRYP  BIT(2),    /* ENCRYPTION LEVEL     @B1C*/ 10850000
*             3 RPL6MH5L      FIXED(8),  /* LENGTH OF THE FMH5          10900000
*                                           RECEIVED                 */ 10950000
*             3 RPL6CCST      FIXED(8),  /* CURRENT CONVERSATION        11000000
*                                           STATE                @F3A*/ 11050000
*             3 RPL6ACTV      BIT(8),    /* RPL6 ACTIVE INDICATOR       11100000
*                                           X'FF'=ACTIVE                11150000
*                                           X'00'=INACTIVE           */ 11200000
*             3 RPL6DETP      BIT(8),    /* SESSION DEACTIVATION        11250000
*                                           TYPE CODE            @Q1A*/ 11300000
*             3 RPL6EXDL      FIXED(8),  /* LENGTH OF EXPEDITED DATA    11350000
*                                           RECEIVED             @I3A*/ 11400000
*             3 RPL6TID       PTR,       /* TASK ID                     11450000
*                                           (THE SUBLEVEL NAMES ARE     11500000
*                                           REFERENCED BY VM SYSTEM) */ 11550000
*                 5 RPL6MID   FIXED(15), /* MACHINE ID               */ 11600000
*                 5 RPL6TIX   FIXED(15), /* TASK INDEX OF CURRENTLY     11650000
*                                           EXECUTING TASK           */ 11700000
*             3 RPL6RPL     PTR(31),     /* POINTER BACK TO THE RPL  */ 11750000
*             3 RPL6STBF    PTR(31),     /* POINTER TO CURRENT BUFFER   11800000
*                                           AT STORAGE SHORTAGE         11850000
*                                                            @P043961*/ 11900000
*             3 RPL6STDS    PTR(31),     /* CURRENT DISPLACEMENT IN     11950000
*                                           BUFFER AT STORAGE SHORTAGE  12000000
*                                                            @P043961*/ 12050000
*             3 RPL6VAOL    FIXED(15),   /* APPL-to-VTAM vectorlist     12083300
*                                           area length          @D2C*/ 12116600
*             3 RPL6VAIL    FIXED(15),   /* VTAM-to-APPL vectorlist     12150000
*                                           area length          @L2C*/ 12200000
*             3 RPL6NET     CHAR(8),     /* NQN Netid            @KGA*/ 12250000
*             3 RPL6CGID    FIXED(32),   /* Conversation Group ID       12300000
*                                                                @KFA*/ 12350000
*             3 RPL6VAOA    PTR(31),     /* APPL-to-VTAM vectorlist     12383300
*                                           area                 @D2C*/ 12416600
*             3 RPL6VAIA    PTR(31),     /* VTAM-to-APPL vectorlist     12450000
*                                           area                 @L2C*/ 12500000
*             3 RPL6END     CHAR(0);     /* END OF RPL6              */ 12550000
*/********************************************************************/ 12600000
*/*                                                                  */ 12650000
*/* THE FOLLOWING CONSTANT VALUES ARE THOSE SPECIFIED IN THE         */ 12700000
*/* EXPEDITED DATA FLOW CONTROL RU "SIGNAL".                         */ 12750000
*/*                                                                  */ 12800000
*/********************************************************************/ 12850000
*DCL  RPL6SIG1 BIT(32) CONSTANT ('00010001'X); /*                       12900000
*                                             SIGNAL DATA RETURNED      12950000
*                                             TO APPLICATION         */ 13000000
*/********************************************************************/ 13050000
*/*                                                                  */ 13100000
*/* THE FOLLOWING CONSTANT IS DEFINED AS A SYMBOLIC REFERENCE        */ 13150000
*/* TO THE APPC CONTROL BLOCK ID (RPL6).                             */ 13200000
*/*                                                                  */ 13250000
*/********************************************************************/ 13300000
*DCL  RPL6ID   CHAR(4) CONSTANT ('APPC');  /* APPC CONTROL BLOCK ID  */ 13350000
*/********************************************************************/ 13400000
*/*                                                                  */ 13450000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6REQ.       */ 13500000
*/* THEY REPRESENT THE "CONTROL=" VALUE.                             */ 13550000
*/*                                                                  */ 13600000
*/********************************************************************/ 13650000
*DCL  RPL6ALLC BIT(8) CONSTANT ('10'X); /* ALLOC                     */ 13700000
*DCL  RPL6PLOC BIT(8) CONSTANT ('11'X); /* PREALLOC              @L1A*/ 13750000
*DCL  RPL6SFM5 BIT(8) CONSTANT ('12'X); /* SENDFMH5              @L1A*/ 13800000
*DCL  RPL6RSRV BIT(8) CONSTANT ('20'X); /* RESETRCV                  */ 13850000
*DCL  RPL6DEAL BIT(8) CONSTANT ('30'X); /* DEALLOC                   */ 13900000
*DCL  RPL6DEAQ BIT(8) CONSTANT ('31'X); /* DEALLOCQ              @I1A*/ 13950000
*DCL  RPL6OPER BIT(8) CONSTANT ('40'X); /* OPRCNTL                   */ 14000000
*DCL  RPL6PREC BIT(8) CONSTANT ('50'X); /* PREPRCV                   */ 14050000
*DCL  RPL6RFH5 BIT(8) CONSTANT ('60'X); /* RCVFMH5                   */ 14100000
*DCL  RPL6RCV  BIT(8) CONSTANT ('70'X); /* RECEIVE                   */ 14150000
*DCL  RPL6RCVX BIT(8) CONSTANT ('71'X); /* RCVEXPD               @I3A*/ 14200000
*DCL  RPL6RJCT BIT(8) CONSTANT ('80'X); /* REJECT                    */ 14250000
*DCL  RPL6SEND BIT(8) CONSTANT ('90'X); /* SEND                      */ 14300000
*DCL  RPL6SNDX BIT(8) CONSTANT ('91'X); /* SENDEXPD              @I3A*/ 14350000
*DCL  RPL6SNRC BIT(8) CONSTANT ('92'X); /* SENDRCV               @D1A*/ 14375000
*DCL  RPL6SETS BIT(8) CONSTANT ('A0'X); /* SETSESS               @F4A*/ 14400000
*DCL  RPL6TSTS BIT(8) CONSTANT ('B0'X); /* TESTSTAT              @I4A*/ 14450000
*/********************************************************************/ 14500000
*/*                                                                  */ 14550000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6QUAL.      */ 14600000
*/* THEY REPRESENT THE "QUALIFY=" VALUE.                             */ 14650000
*/*                                                                  */ 14700000
*/********************************************************************/ 14750000
*DCL  RPL6NQUA BIT(8) CONSTANT ('00'X); /* NULL QUALIFIER        @L1C*/ 14800000
*DCL  RPL6APRG BIT(8) CONSTANT ('01'X); /* ABNDPROG                  */ 14850000
*DCL  RPL6ASRV BIT(8) CONSTANT ('02'X); /* ABNDSERV                  */ 14900000
*DCL  RPL6ATIM BIT(8) CONSTANT ('03'X); /* ABNDTIME                  */ 14950000
*DCL  RPL6AUSR BIT(8) CONSTANT ('04'X); /* ABNDUSER                  */ 15000000
*DCL  RPL6ANY  BIT(8) CONSTANT ('05'X); /* ANY                       */ 15050000
*DCL  RPL6CNOS BIT(8) CONSTANT ('06'X); /* CNOS                      */ 15100000
*DCL  RPL6CFRM BIT(8) CONSTANT ('07'X); /* CONFIRM                   */ 15150000
*DCL  RPL6CFMD BIT(8) CONSTANT ('08'X); /* CONFRMD                   */ 15200000
*DCL  RPL6DATA BIT(8) CONSTANT ('09'X); /* DATA                      */ 15250000
*DCL  RPL6DCON BIT(8) CONSTANT ('0A'X); /* DATACON                   */ 15300000
*DCL  RPL6DFLU BIT(8) CONSTANT ('0B'X); /* DATAFLU                   */ 15350000
*DCL  RPL6DFIN BIT(8) CONSTANT ('0C'X); /* DEFINE                    */ 15400000
*DCL  RPL6DSPY BIT(8) CONSTANT ('0D'X); /* DISPLAY                   */ 15450000
*DCL  RPL6ERR  BIT(8) CONSTANT ('0E'X); /* ERROR                     */ 15500000
*DCL  RPL6FLSH BIT(8) CONSTANT ('0F'X); /* FLUSH                     */ 15550000
*DCL  RPL6RQSD BIT(8) CONSTANT ('10'X); /* RQSEND                    */ 15600000
*DCL  RPL6SPEC BIT(8) CONSTANT ('11'X); /* SPEC                      */ 15650000
*DCL  RPL6ACT  BIT(8) CONSTANT ('12'X); /* ACTSESS                   */ 15700000
*DCL  RPL6DACT BIT(8) CONSTANT ('13'X); /* DACTSESS                  */ 15750000
*DCL  RPL6ALCD BIT(8) CONSTANT ('14'X); /* ALLOCD                    */ 15800000
*DCL  RPL6IMED BIT(8) CONSTANT ('15'X); /* IMMED                     */ 15850000
*DCL  RPL6CWIN BIT(8) CONSTANT ('16'X); /* CONWIN                @F1A*/ 15900000
*DCL  RPL6SESN BIT(8) CONSTANT ('17'X); /* SESSION               @F3A*/ 15950000
*DCL  RPL6CONV BIT(8) CONSTANT ('18'X); /* CONV                  @F3A*/ 16000000
*DCL  RPL6SUSP BIT(8) CONSTANT ('19'X); /* SUSPEND               @F4A*/ 16050000
*DCL  RPL6RESM BIT(8) CONSTANT ('1A'X); /* RESUME                @F4A*/ 16100000
*DCL  RPL6REST BIT(8) CONSTANT ('1B'X); /* RESTORE               @B2A*/ 16150000
*DCL  RPL6SYNB BIT(8) CONSTANT ('1C'X); /* SYNCBEG               @V1A*/ 16200000
*DCL  RPL6SYNE BIT(8) CONSTANT ('1D'X); /* SYNCEND               @V1A*/ 16250000
*DCL  RPL6CNGP BIT(8) CONSTANT ('1E'X); /* CONVGRP               @KFA*/ 16300000
*DCL  RPL6SESF BIT(8) CONSTANT ('1F'X); /* WHENFREE              @KHA*/ 16350000
*DCL  RPL6IANY BIT(8) CONSTANT ('20'X); /* IANY                  @I2A*/ 16400000
*DCL  RPL6ISPC BIT(8) CONSTANT ('21'X); /* ISPEC                 @I2A*/ 16450000
*DCL  RPL6QALL BIT(8) CONSTANT ('22'X); /* ALL                   @I4A*/ 16500000
*DCL  RPL6IALL BIT(8) CONSTANT ('23'X); /* IALL                  @I4A*/ 16550000
*DCL  RPL6QUE  BIT(8) CONSTANT ('24'X); /* QUEUE                 @D1A*/ 16566600
*DCL  RPL6DQUE BIT(8) CONSTANT ('25'X); /* DATAQUE               @D1A*/ 16583200
*/********************************************************************/ 16600000
*/*                                                                  */ 16650000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6FILL.      */ 16700000
*/* THEY REPRESENT THE "FILL=" VALUE.                                */ 16750000
*/*                                                                  */ 16800000
*/********************************************************************/ 16850000
*DCL  RPL6BUFF BIT(1) CONSTANT ('0'B);  /* BUFF                      */ 16900000
*DCL  RPL6LL   BIT(1) CONSTANT ('1'B);  /* LL                        */ 16950000
*/********************************************************************/ 17000000
*/*                                                          @P058398*/ 17050000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CD @P058398*/ 17100000
*/* THEY REPRESENT THE "CD=" VALUE                           @P058398*/ 17150000
*/*                                                          @P058398*/ 17200000
*/********************************************************************/ 17250000
*DCL RPL6CDIM BIT(1) CONSTANT('0'B); /* "CD=IMMED"           @P058398*/ 17300000
*DCL RPL6CDDE BIT(1) CONSTANT('1'B); /* "CD=DEFER"           @P058398*/ 17350000
*/********************************************************************/ 17400000
*/*                                                                  */ 17450000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CFTX.      */ 17500000
*/* THEY REPRESENT THE "CONFTXT=" VALUE.                             */ 17550000
*/*                                                                  */ 17600000
*/********************************************************************/ 17650000
*DCL  RPL6CFT  BIT(1) CONSTANT ('1'B);  /* YES                       */ 17700000
*DCL  RPL6NCFT BIT(1) CONSTANT ('0'B);  /* NO                        */ 17750000
*/********************************************************************/ 17800000
*/*                                                                  */ 17850000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6TYPE.      */ 17900000
*/* THEY REPRESENT THE "TYPE=" VALUE.                                */ 17950000
*/*                                                                  */ 18000000
*/********************************************************************/ 18050000
*DCL  RPL6USER BIT(2) CONSTANT ('11'B); /* USER                      */ 18100000
*DCL  RPL6PRGM BIT(2) CONSTANT ('01'B); /* PROGRAM                   */ 18150000
*DCL  RPL6SVC  BIT(2) CONSTANT ('10'B); /* SERVICE                   */ 18200000
*/********************************************************************/ 18250000
*/*                                                                  */ 18300000
*/*  THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6NAMU.     */ 18350000
*/*  THEY REPRESENT THE "NAMEUSE=" VALUE.                            */ 18400000
*/*                                                                  */ 18450000
*/********************************************************************/ 18500000
*DCL RPL6NUNS BIT(2) CONSTANT('00'B);  /* NAME USAGE IS NOT SPECIFIED   18550000
*                                                                @U2A*/ 18600000
*DCL RPL6ANAM BIT(2) CONSTANT('01'B);  /* WHEN APPLICATION IS ACTING    18650000
*                                      AS A GENERIC RESOURCE, SESSIONS  18700000
*                                      STARTED WITH PARTNER LU SHOULD   18750000
*                                      USE THE APPLICATION NETWORK      18800000
*                                      NAME                      @U2A*/ 18850000
*DCL RPL6GNAM BIT(2) CONSTANT('10'B);  /* WHEN APPLICATION IS ACTING    18900000
*                                      AS A GENERIC RESOURCE, SESSIONS  18950000
*                                      STARTED WITH PARTNER LU SHOULD   19000000
*                                      USE THE GENERIC NAME OF THE      19050000
*                                      APPLICATION               @U2A*/ 19100000
*/********************************************************************/ 19150000
*/*                                                                  */ 19200000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6LOCK.      */ 19250000
*/* THEY REPRESENT THE "LOCKS=" VALUE.                               */ 19300000
*/*                                                                  */ 19350000
*/********************************************************************/ 19400000
*DCL  RPL6LONG BIT(1) CONSTANT ('0'B);  /* LONG                      */ 19450000
*DCL  RPL6SHRT BIT(1) CONSTANT ('1'B);  /* SHORT                     */ 19500000
*/********************************************************************/ 19550000
*/*                                                                  */ 19600000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6DERC.      */ 19650000
*/*                                                                  */ 19700000
*/********************************************************************/ 19750000
*DCL  RPL6RNRM BIT(2) CONSTANT ('00'B); /* NORMAL                @Q1A*/ 19800000
*DCL  RPL6RABN BIT(2) CONSTANT ('10'B); /* ABNORMAL              @Q1A*/ 19850000
*DCL  RPL6RANR BIT(2) CONSTANT ('11'B); /* ABNORMAL, NO RETRY    @Q1A*/ 19900000
*/********************************************************************/ 19950000
*/*                                                                  */ 20000000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CMOD.      */ 20050000
*/* THEY REPRESENT THE "CONMODE=" VALUE.                             */ 20100000
*/*                                                                  */ 20150000
*/********************************************************************/ 20200000
*DCL  RPL6LLCA BIT(2) CONSTANT ('00'B); /* LLCA                      */ 20250000
*DCL  RPL6BFCA BIT(2) CONSTANT ('01'B); /* BUFFCA                    */ 20300000
*DCL  RPL6CS   BIT(2) CONSTANT ('10'B); /* CS                        */ 20350000
*DCL  RPL6SAME BIT(2) CONSTANT ('11'B); /* SAME                      */ 20400000
*/********************************************************************/ 20450000
*/*                                                                  */ 20500000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CXMD.      */ 20550000
*/* THEY REPRESENT THE "CONXMOD=" VALUE.                             */ 20600000
*/*                                                                  */ 20650000
*/********************************************************************/ 20700000
*DCL  RPL6CSCX BIT(2) CONSTANT ('00'B); /* CS                    @I3A*/ 20750000
*DCL  RPL6CACX BIT(2) CONSTANT ('01'B); /* CA                    @I3A*/ 20800000
*DCL  RPL6SAMX BIT(2) CONSTANT ('11'B); /* SAME                  @I3A*/ 20850000
*/********************************************************************/ 20900000
*/*                                                                  */ 20950000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6LAST.      */ 21000000
*/*                                                                  */ 21050000
*/********************************************************************/ 21100000
*DCL  RPL6NLST BIT(2) CONSTANT ('00'B); /* SESSIONS EXIST FOR THE       21150000
*                                          SPECIFIED MODE        @F4A*/ 21200000
*DCL  RPL6LMOD BIT(2) CONSTANT ('01'B); /* LAST SESSION DEACTIVATED     21250000
*                                          FOR THE SPECIFIED MODE       21300000
*                                                                @F4A*/ 21350000
*DCL  RPL6NCTL BIT(2) CONSTANT ('10'B); /* LAST SESSION DEACTIVATED     21400000
*                                          FOR NON-CONTROL MODES @F4A*/ 21450000
*DCL  RPL6ALL  BIT(2) CONSTANT ('11'B); /* ALL SESSIONS FOR THIS LU     21500000
*                                          HAVE BEEN DEACTIVATED @F4A*/ 21550000
*/********************************************************************/ 21600000
*/*                                                                  */ 21650000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6LIST       */ 21700000
*/*                                                                  */ 21750000
*/********************************************************************/ 21800000
*DCL  RPL6LINO BIT(2) CONSTANT ('00'B); /* NO INFORMATION RETURNED      21850000
*                                                                @B2A*/ 21900000
*DCL  RPL6LINS BIT(2) CONSTANT ('01'B); /* LU NAME, MODE NAME, AND LM   21950000
*                                          TABLE INFORMATION RETURNED   22000000
*                                                                @B2A*/ 22050000
*DCL  RPL6LIAL BIT(2) CONSTANT ('10'B); /* ALL INFORMATION IN RESTORE   22100000
*                                          STRUCTURE RETURNED    @B2A*/ 22150000
*/********************************************************************/ 22200000
*/*                                                                  */ 22250000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CCST.      */ 22300000
*/* THEY REPRESENT THE CURRENT CONVERSATION STATE.                   */ 22350000
*/*                                                                  */ 22400000
*/********************************************************************/ 22450000
*DCL  RPL6RSET FIXED(8) CONSTANT(0); /* RESET  (INITIAL STATE)   @F3A*/ 22500000
*/*    ** HALF-DUPLEX CONVERSATION STATES **                         */ 22550000
*DCL  RPL6SND  FIXED(8) CONSTANT(1); /* SEND                     @F3A*/ 22600000
*DCL  RPL6RECV FIXED(8) CONSTANT(2); /* RECEIVE                  @F3A*/ 22650000
*DCL  RPL6RVCF FIXED(8) CONSTANT(3); /* RECEIVE CONFIRM          @F3A*/ 22700000
*DCL  RPL6RVCS FIXED(8) CONSTANT(4); /* RECEIVE CONFIRM SEND     @F3A*/ 22750000
*DCL  RPL6RVCD FIXED(8) CONSTANT(5); /* RECEIVE CONFIRM DEALLOCATE      22800000
*                                                                @F3A*/ 22850000
*DCL  RPL6PNDD FIXED(8) CONSTANT(6); /* PEND DEALLOCATE          @F3A*/ 22900000
*DCL  RPL6PECL FIXED(8) CONSTANT(7); /* PEND END CONVERSATION LOG       22933300
*                                                                @F3A*/ 22966600
*DCL  RPL6ENDC FIXED(8) CONSTANT(8); /* END CONVERSATION (FINAL) @F3A*/ 23000000
*DCL  RPL6PNDS FIXED(8) CONSTANT(9); /* PENDING SEND             @F3A*/ 23050000
*DCL  RPL6PRVL FIXED(8) CONSTANT(10);/* PENDING RCV LOG          @F3A*/ 23100000
*/*    ** FULL-DUPLEX CONVERSATION STATES **                         */ 23150000
*DCL  RPL6FDRS FIXED(8) CONSTANT(128); /* FDX RESET (FINAL)'80'X @I3A*/ 23200000
*DCL  RPL6FDSR FIXED(8) CONSTANT(129); /* SEND/RECEIVE     '81'X @I3A*/ 23250000
*DCL  RPL6FDSO FIXED(8) CONSTANT(130); /* SEND-ONLY        '82'X @I3A*/ 23300000
*DCL  RPL6FDRO FIXED(8) CONSTANT(131); /* RECEIVE-ONLY     '83'X @I3A*/ 23350000
*DCL  RPL6FSRL FIXED(8) CONSTANT(132); /* PEND SEND/RCV LOG '84'X       23400000
*                                                                @I3A*/ 23450000
*DCL  RPL6FROL FIXED(8) CONSTANT(133); /* PEND RCV-ONLY LOG '85'X       23500000
*                                                                @I3A*/ 23550000
*DCL  RPL6FRSL FIXED(8) CONSTANT(134); /* PEND RESET LOG   '86'X @I3A*/ 23600000
*                                                                       23650000
*/*    ** PENDING CONVERSATION ALLOCATION **                         */ 23700000
*DCL  RPL6PALC FIXED(8) CONSTANT(255); /* Pending Allocate 'FF'X @L1A*/ 23750000
*/********************************************************************/ 23800000
*/*                                                                  */ 23850000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6DETP.      */ 23900000
*/* THEY REPRESENT THE "DEACTYP=" VALUE.                             */ 23950000
*/*                                                                  */ 24000000
*/********************************************************************/ 24050000
*DCL  RPL6TCLP BIT(8) CONSTANT ('0F'X); /* CLEANUP               @Q1A*/ 24100000
*DCL  RPL6TPVL BIT(8) CONSTANT ('FE'X); /* PROTOCOL VIOLATION    @Q1A*/ 24150000
*/********************************************************************/ 24200000
*/*                                                                  */ 24250000
*/* THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CRYP.      */ 24300000
*/* THEY REPRESENT THE ENCRYPTION LEVEL.                             */ 24350000
*/*                                                                  */ 24400000
*/********************************************************************/ 24450000
*DCL  RPL6CNON BIT(2) CONSTANT ('00'B); /* NONE                  @B1A*/ 24500000
*DCL  RPL6CSEL BIT(2) CONSTANT ('01'B); /* SELECTIVE ENCRYPTION  @B1A*/ 24550000
*DCL  RPL6CMAN BIT(2) CONSTANT ('11'B); /* MANDATORY ENCRYPTION  @B1A*/ 24600000
*                                                                       24650000
*GEN CODE (ISTRPL6X GENEQU=YES);                                        24700000
*                                                                       24750000
*%GOTO   RPL6END1;                                                      24800000
* /*                                                                    24850000
*                   ASSEMBLER DSECT FOR VTAM APPC EXTENSION             24900000
*                   WHICH OVERLAYS THE FIELD POINTED TO BY RPLAAREA     24950000
*                   (RPLAAREA CONTAINS THE ADDRESS THAT IS SPECIFIED    25000000
*                   BY RPL6 IN APPCCMD)                                 25050000
*                                                                       25100000
.RPL6BAL ANOP                                                           25150000
ISTRPL6X DSECT                                                          25200000
RPL6AREA DS    0CL112              START OF APPC EXTENSION              25250000
RPL6CBID DS    CL4                 CONTROL BLOCK IDENTIFIER             25300000
RPL6REQ  DS    XL1                 TYPE OF APPCCMD                      25350000
RPL6QUAL DS    XL1                 SUBTYPE OF APPCCMD                   25400000
         DS    XL2                 RESERVED                             25450000
RPL6CNVD DS    XL4                 CONVERSATION ID                      25500000
RPL6USR  DS    XL4                 USER FIELD                           25550000
RPL6SNSO DS    XL4                 SENSE DATA SPECIFIED ON APPCCMD      25600000
RPL6SNSI DS    XL4                 SENSE DATA RETURNED BY APPCCMD       25650000
RPL6SGNL DS    XL4                 SIGNAL DATA RETURNED                 25700000
RPL6SIDL DS    XL1                 LENGTH OF SESSION ID                 25750000
         DS    XL3                 RESERVED                             25800000
RPL6SSID DS    XL8                 SESSION IDENTIFICATION               25850000
RPL6RC   DS    0XL4                RPL6 RETURN CODE                     25900000
RPL6RCPR DS    XL2                 PRIMARY RETURN CODE                  25950000
RPL6RCSC DS    XL2                 SECONDARY RETURN CODE                26000000
RPL6FLGS DS    0XL4                INDICATORS SPECIFIC TO VTAM'S        26050000
*                                  APPCCMD MACRO                        26100000
RPL6FLG1 DS    XL1                 FIRST INDICATORS BYTE                26150000
RPL6FILL EQU   X'80'               FILL INDICATOR                       26200000
RPL6CD   EQU   X'40'               CD KEYWORD INDICATION     @P058398   26250000
*        EQU   X'20'               RESERVED                        @Q2C 26300000
RPL6SLS  EQU   X'10'               PARTNER LU VERIFICATION              26350000
*                                  INDICATOR                     @F2A   26400000
RPL6CFTX EQU   X'08'               CONFTXT INDICATOR                    26450000
RPL6LIST EQU   X'06'               SCOPE OF INFORMATION TO BE           26500000
*                                  RETURNED IN THE RESTORE COMMAND @B2A 26550000
*        EQU   X'01'               RESERVED                        @B2C 26600000
RPL6FLG2 DS    XL1                 SECOND INDICATORS BYTE               26650000
RPL6BISC EQU   X'80'               Bis Exchange completed          @21A 26700000
RPL6RTSX EQU   X'40'               RTS_RCVD RETURN  1=EXPD,0=BOTH  @I3A 26750000
RPL6CXMD EQU   X'30'               CONXMOD INDICATORS              @I3A 26800000
RPL6TYPE EQU   X'0C'               TYPE INDICATOR                       26850000
RPL6NAMU EQU   X'03'               NAME USE REQUESTED WHEN APPLICATION  26900000
*                                  IS ACTING AS A GENERIC RESOURCE @U2C 26950000
RPL6FLG3 DS    XL1                 THIRD INDICATORS BYTE                27000000
RPL6LOCK EQU   X'80'               LOCKS INDICATOR                      27050000
RPL6DERC EQU   X'60'               DEACTIVATION REASON CODE        @Q1A 27100000
RPL6EXDR EQU   X'10'               EXPEDITED DATA RECEIVED         @I3C 27150000
RPL6CMOD EQU   X'0C'               CONMODE INDICATOR                    27200000
RPL6LAST EQU   X'03'               LAST INDICATOR                  @F4A 27250000
RPL6FLG4 DS    XL1                 FOURTH INDICATORS BYTE               27300000
*        EQU   X'FF'               RESERVED                             27350000
RPL6LU   DS    CL8                 NAME OF LU                           27400000
RPL6MODE DS    CL8                 MODE NAME                            27450000
RPL6WHAT DS    0XL2                                                     27500000
RPL6RCV1 DS    XL1                 WHAT RECEIVED INDICATOR              27550000
RPL6WDAT EQU   X'80'               WHATRCV=DATA                         27600000
RPL6WDAC EQU   X'40'               WHATRCV=DATA_COMPLETE                27650000
RPL6WDAI EQU   X'20'               WHATRCV=DATA_INCOMPLETE              27700000
RPL6WSND EQU   X'10'               WHATRCV=SEND                         27750000
RPL6WCFM EQU   X'08'               WHATRCV=CONFIRM                      27800000
RPL6WDAL EQU   X'04'               WHATRCV=DEALLOCATE                   27850000
RPL6WLOG EQU   X'02'               WHATRCV=LOG_DATA           @P051251  27900000
RPL6WPSH EQU   X'01'               WHATRCV=PS_HEADER             @F3A   27950000
RPL6RCV2 DS    XL1                 RESERVED FOR BIT MASK FOR THE        28000000
RPL6WPSI EQU   X'80'               WHATRCV=PARTIAL_PS_HEADER     @F3A   28050000
*        EQU   X'7F'               NOT USED                      @F3C   28100000
RPL6RTUN DS    XL1                 RETURNED INDICATORS AS               28150000
*                                  A RESULT OF APPCCMD                  28200000
RPL6RMH5 EQU   X'80'               FMH5RCV INDICATOR                    28250000
RPL6RLOG EQU   X'40'               LOGRCV INDICATOR                     28300000
RPL6RSIG EQU   X'20'               SIGRCV INDICATOR                     28350000
RPL6CLSA EQU   X'10'               PARTNER LU ACCEPTS SECURITY          28400000
*                                  SUBFIELDS ON FMH5           @P052802 28450000
RPL6AVFA EQU   X'08'               PARTNER LU ACCEPTS REQUESTS FOR      28500000
*                                  ALREADY VERIFIED                @F1A 28550000
RPL6PV   EQU   X'04'               PARTNER LU ACCEPTS REQUESTS FOR      28600000
*                                  PERSISTENT VERIFICATION         @B3C 28650000
RPL6CRYP EQU   X'03'               ENCRYPTION LEVEL                @B1A 28700000
RPL6MH5L DS    XL1                 LENGTH OF THE FMH 5 RECEIVED         28750000
RPL6CCST DS    XL1                 CURRENT CONVERSATION STATE      @F3A 28800000
RPL6ACTV DS    XL1                 RPL6 ACTIVE INDICATOR                28850000
*                                  FF=ACTIVE / 00=INACTIVE              28900000
RPL6DETP DS    XL1                 DEACTIVATION TYPE CODE          @Q1A 28950000
RPL6EXDL DS    XL1                 LENGTH OF EXPEDITED DATA        @I3C 29000000
RPL6TID  DS    0A                  TASK ID                              29050000
RPL6MID  DS    XL2                 MACHINE ID                           29100000
RPL6TIX  DS    XL2                 TASK INDEX OF CURRENTLY              29150000
*                                  EXECUTING TASK                       29200000
RPL6RPL  DS    A                   POINTER BACK TO THE RPL              29250000
RPL6STBF DS    A                   POINTER TO CURRENT BUFFER   @P043961 29300000
*                                  AT STORAGE SHORTAGE         @P043961 29350000
RPL6STDS DS    A                   DISPLACEMENT IN CURRENT     @P043961 29400000
*                                  BUFFER AT STORAGE SHORTAGE  @P043961 29450000
RPL6VAOL DS    XL2                 APPL-to-VTAM vectorlist area length  29483300
*                                                                  @D2C 29516600
RPL6VAIL DS    XL2                 VTAM-to-APPL vectorlist area length  29550000
*                                                                  @L2C 29600000
RPL6NET  DS    CL8                 NQN Netid                       @KGA 29650000
RPL6CGID DS    XL4                 Conversation Group ID           @KFA 29700000
RPL6VAOA DS    A                   APPL-to-VTAM vectorlist area    @D2C 29750000
RPL6VAIA DS    A                   VTAM-to-APPL vectorlist area    @L2C 29800000
RPL6END  EQU   *                   END OF RPL6                          29850000
.EQU     ANOP                                                           29900000
*********************************************************************** 29950000
*                                                                     * 30000000
*   THE FOLLOWING CONSTANT VALUES ARE THOSE SPECIFIED IN THE          * 30050000
*   EXPEDITED DATA FLOW CONTROL RU "SIGNAL".                          * 30100000
*                                                                     * 30150000
*********************************************************************** 30200000
RPL6SIG1 EQU   X'00010001'         SIGNAL DATA RETURNED TO APPLICATION  30250000
**********************************************************************  30300000
*                                                                    *  30350000
*   THE FOLLOWING CONSTANT IS DEFINED AS A SYMBOLIC REFERENCE        *  30400000
*   TO THE APPC CONTROL BLOCK ID (RPL6).                             *  30450000
*                                                                    *  30500000
**********************************************************************  30550000
RPL6ID   EQU   C'APPC'             APPC CONTROL BLOCK ID                30600000
*                                                                       30650000
*********************************************************************** 30700000
*                                                                     * 30750000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6REQ.        * 30800000
*   THEY REPRESENT THE "CONTROL=" VALUE.                              * 30850000
*                                                                     * 30900000
*********************************************************************** 30950000
RPL6ALLC EQU   X'10'               ALLOC                                31000000
RPL6PLOC EQU   X'11'               PREALLOC                        @L1A 31050000
RPL6SFM5 EQU   X'12'               SENDFMH5                        @L1A 31100000
RPL6RSRV EQU   X'20'               RESETRCV                             31150000
RPL6DEAL EQU   X'30'               DEALLOC                              31200000
RPL6DEAQ EQU   X'31'               DEALLOCQ                        @I1A 31250000
RPL6OPER EQU   X'40'               OPRCNTL                              31300000
RPL6PREC EQU   X'50'               PREPRCV                              31350000
RPL6RFH5 EQU   X'60'               RCVFMH5                              31400000
RPL6RCV  EQU   X'70'               RECEIVE                              31450000
RPL6RCVX EQU   X'71'               RCVEXPD                         @I3A 31500000
RPL6RJCT EQU   X'80'               REJECT                               31550000
RPL6SEND EQU   X'90'               SEND                                 31600000
RPL6SNDX EQU   X'91'               SENDEXPD                        @I3A 31650000
RPL6SNRC EQU   X'92'               SENDRCV                         @D1A 31675000
RPL6SETS EQU   X'A0'               SETSESS                         @F4A 31700000
RPL6TSTS EQU   X'B0'               TESTSTAT                        @I4A 31750000
*********************************************************************** 31800000
*                                                                     * 31850000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6QUAL.       * 31900000
*   THEY REPRESENT THE "QUALIFY=" VALUE.                              * 31950000
*                                                                     * 32000000
*********************************************************************** 32050000
RPL6NQUA EQU   X'00'               NULL QUALIFER                   @L1C 32100000
RPL6APRG EQU   X'01'               ABNDPROG                             32150000
RPL6ASRV EQU   X'02'               ABNDSERV                             32200000
RPL6ATIM EQU   X'03'               ABNDTIME                             32250000
RPL6AUSR EQU   X'04'               ABNDUSER                             32300000
RPL6ANY  EQU   X'05'               ANY                                  32350000
RPL6CNOS EQU   X'06'               CNOS                                 32400000
RPL6CFRM EQU   X'07'               CONFIRM                              32450000
RPL6CFMD EQU   X'08'               CONFRMD                              32500000
RPL6DATA EQU   X'09'               DATA                                 32550000
RPL6DCON EQU   X'0A'               DATACON                              32600000
RPL6DFLU EQU   X'0B'               DATAFLU                              32650000
RPL6DFIN EQU   X'0C'               DEFINE                               32700000
RPL6DSPY EQU   X'0D'               DISPLAY                              32750000
RPL6ERR  EQU   X'0E'               ERROR                                32800000
RPL6FLSH EQU   X'0F'               FLUSH                                32850000
RPL6RQSD EQU   X'10'               RQSEND                               32900000
RPL6SPEC EQU   X'11'               SPEC                                 32950000
RPL6ACT  EQU   X'12'               ACTSESS                              33000000
RPL6DACT EQU   X'13'               DACTSESS                             33050000
RPL6ALCD EQU   X'14'               ALLOCD                               33100000
RPL6IMED EQU   X'15'               IMMED                                33150000
RPL6CWIN EQU   X'16'               CONWIN                          @F1A 33200000
RPL6SESN EQU   X'17'               SESSION                         @F3A 33250000
RPL6CONV EQU   X'18'               CONV                            @F3A 33300000
RPL6SUSP EQU   X'19'               SUSPEND                         @F4A 33350000
RPL6RESM EQU   X'1A'               RESUME                          @F4A 33400000
RPL6REST EQU   X'1B'               RESTORE                         @B2A 33450000
RPL6SYNB EQU   X'1C'               SYNCBEG                         @V1A 33500000
RPL6SYNE EQU   X'1D'               SYNCEND                         @V1A 33550000
RPL6CNGP EQU   X'1E'               CONVGRP                         @KFA 33600000
RPL6SESF EQU   X'1F'               WHENFREE                        @KHA 33650000
RPL6IANY EQU   X'20'               IANY                            @I2A 33700000
RPL6ISPC EQU   X'21'               ISPEC                           @I2A 33750000
RPL6QALL EQU   X'22'               ALL                             @I4A 33800000
RPL6IALL EQU   X'23'               IALL                            @I4A 33850000
RPL6QUE  EQU   X'24'               QUEUE                           @D1A 33866600
RPL6DQUE EQU   X'25'               DATAQUE                         @D1A 33883200
*********************************************************************** 33900000
*                                                                     * 33950000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6FILL.       * 34000000
*   THEY REPRESENT THE "FILL=" VALUE.                                 * 34050000
*                                                                     * 34100000
*********************************************************************** 34150000
RPL6BUFF EQU   X'00'               BUFF                                 34200000
RPL6LL   EQU   X'80'               LL                                   34250000
*********************************************************************** 34300000
*                                                            @P058398 * 34350000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CD @P058398 * 34400000
*   THEY REPRESENT THE "CD=" VALUE                           @P058398 * 34450000
*                                                            @P058398 * 34500000
*********************************************************************** 34550000
RPL6CDIM EQU   X'00'               "CD=IMMED"                @P058398   34600000
RPL6CDDE EQU   X'40'               "CD=DEFER"                @P058398   34650000
*********************************************************************** 34700000
*                                                                     * 34750000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CFTX.       * 34800000
*   THEY REPRESENT THE "CONFTXT=" VALUE.                              * 34850000
*                                                                     * 34900000
*********************************************************************** 34950000
RPL6CFT  EQU   X'08'               YES                                  35000000
RPL6NCFT EQU   X'00'               NO                                   35050000
*********************************************************************** 35100000
*                                                                     * 35150000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6TYPE.       * 35200000
*   THEY REPRESENT THE "TYPE=" VALUE.                                 * 35250000
*                                                                     * 35300000
*********************************************************************** 35350000
RPL6TBIT EQU   X'0C'               TYPE BITS POSITION                   35400000
RPL6USER EQU   X'0C'               USER                                 35450000
RPL6PRGM EQU   X'04'               PROGRAM                              35500000
RPL6SVC  EQU   X'08'               SERVICE                              35550000
*********************************************************************** 35600000
*                                                                     * 35650000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6NAMU.       * 35700000
*   THEY REPRESENT THE "NAMEUSE=" VALUE.                              * 35750000
*                                                                     * 35800000
*********************************************************************** 35850000
RPL6NUNS EQU   X'00'               NAME USAGE NOT SPECIFIED        @U2A 35900000
RPL6ANAM EQU   X'01'               WHEN APPLICATION IS ACTING AS A      35950000
*                                  GENERIC RESOURCE, SESSIONS STARTED   36000000
*                                  WITH PARTNER LU SHOULD USE THE       36050000
*                                  APPLICATION NETWORK NAME        @U3C 36100000
RPL6GNAM EQU   X'02'               WHEN APPLICATION IS ACTING AS A      36150000
*                                  GENERIC RESOURCE, SESSIONS STARTED   36200000
*                                  WITH PARTNER LU SHOULD USE GENERIC   36250000
*                                  NAME OF THE APPLICATION         @U3C 36300000
*********************************************************************** 36350000
*                                                                     * 36400000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6LOCK.       * 36450000
*   THEY REPRESENT THE "LOCKS=" VALUE.                                * 36500000
*                                                                     * 36550000
*********************************************************************** 36600000
RPL6LONG EQU   X'00'               LONG                                 36650000
RPL6SHRT EQU   X'80'               SHORT                                36700000
*********************************************************************** 36750000
*                                                                     * 36800000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6DERC.       * 36850000
*                                                                     * 36900000
*********************************************************************** 36950000
RPL6RNRM EQU   X'00'               NORMAL                        @Q4C   37000000
RPL6RABN EQU   X'40'               ABNORMAL                      @Q4C   37050000
RPL6RANR EQU   X'60'               ABNORMAL, NORETRY             @Q4C   37100000
*********************************************************************** 37150000
*                                                                     * 37200000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CMOD.       * 37250000
*   THEY REPRESENT THE "CONMODE=" VALUE.                              * 37300000
*                                                                     * 37350000
*********************************************************************** 37400000
RPL6CBIT EQU   X'0C'               CONMODE BITS POSITION                37450000
RPL6LLCA EQU   X'00'               LLCA                                 37500000
RPL6BFCA EQU   X'04'               BUFFCA                               37550000
RPL6CS   EQU   X'08'               CS                                   37600000
RPL6SAME EQU   X'0C'               SAME                                 37650000
*********************************************************************** 37700000
*                                                                     * 37750000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CXMD.       * 37800000
*   THEY REPRESENT THE "CONXMOD=" VALUE.                              * 37850000
*                                                                     * 37900000
*********************************************************************** 37950000
RPL6CXBT EQU   X'30'               CONXMOD BIT POSITIONS           @I3A 38000000
RPL6CSCX EQU   X'00'               CS                              @I3A 38050000
RPL6CACX EQU   X'10'               CA                              @I3A 38100000
RPL6SAMX EQU   X'30'               SAME                            @I3A 38150000
*********************************************************************** 38200000
*                                                                     * 38250000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6LAST.       * 38300000
*                                                                     * 38350000
*********************************************************************** 38400000
RPL6NLST EQU   X'00'               SESSIONS EXIST FOR THE               38450000
*                                  SPECIFIED MODE                @F4A   38500000
RPL6LMOD EQU   X'01'               LAST SESSION DEACTIVATED             38550000
*                                  FOR THE SPECIFIED MODE        @F4A   38600000
RPL6NCTL EQU   X'02'               LAST SESSION DEACTIVATED             38650000
*                                  FOR NON-CONTROL MODES         @F4A   38700000
RPL6ALL  EQU   X'03'               ALL SESSIONS FOR THIS LU             38750000
*                                  HAVE BEEN DEACTIVATED         @F4A   38800000
*********************************************************************** 38850000
*                                                                     * 38900000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6LIST.       * 38950000
*                                                                     * 39000000
*********************************************************************** 39050000
RPL6LINO EQU   X'00'               NO INFORMATION RETURNED       @B2A   39100000
RPL6LINS EQU   X'02'               LU NAME, MODE NAME, AND LM           39150000
*                                  TABLE INFORMATION RETURNED    @B2A   39200000
RPL6LIAL EQU   X'04'               ALL INFORMATION IN RESTORE           39250000
*                                  STRUCTURE RETURNED            @B2A   39300000
*********************************************************************** 39350000
*                                                                     * 39400000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CCSL.       * 39450000
*   THEY REPRESENT THE CURRENT CONVERSATION STATE.                    * 39500000
*                                                                     * 39550000
*********************************************************************** 39600000
RPL6RSET EQU   X'00'               RESET  (INITIAL STATE)        @F3A   39650000
*   ** HALF-DUPLEX CONVERSATION STATES **                               39700000
RPL6SND  EQU   X'01'               SEND                          @F3A   39750000
RPL6RECV EQU   X'02'               RECEIVE                       @F3A   39800000
RPL6RVCF EQU   X'03'               RECEIVE CONFIRM               @F3A   39850000
RPL6RVCS EQU   X'04'               RECEIVE CONFIRM SEND          @F3A   39900000
RPL6RVCD EQU   X'05'               RECEIVE CONFIRM DEALLOCATE    @F3A   39950000
RPL6PNDD EQU   X'06'               PEND DEALLOCATE               @F3A   40000000
RPL6PECL EQU   X'07'               PEND END CONVESATION LOG      @F3A   40050000
RPL6ENDC EQU   X'08'               END CONVERSATION  (FINAL)     @F3A   40100000
RPL6PNDS EQU   X'09'               PENDING SEND                  @F3A   40150000
RPL6PRVL EQU   X'0A'               PENDING RCV LOG               @F3A   40200000
*   ** FULL-DUPLEX CONVERSATION STATES **                               40250000
RPL6FDRS EQU   X'80'               FDX RESET  (FINAL)              @I3A 40300000
RPL6FDSR EQU   X'81'               FDX SEND/RECEIVE                @I3A 40350000
RPL6FDSO EQU   X'82'               FDX SEND-ONLY                   @I3A 40400000
RPL6FDRO EQU   X'83'               FDX RECEIVE-ONLY                @I3A 40450000
RPL6FSRL EQU   X'84'               FDX PENDING SEND/RCV LOG        @I3A 40500000
RPL6FROL EQU   X'85'               FDX PENDING RCV-ONLY LOG        @I3A 40550000
RPL6FRSL EQU   X'86'               FDX PENDING RESET LOG           @I3A 40600000
*    ** PENDING CONVERSATION ALLOCATION **                              40650000
RPL6PALC EQU   X'FF'               PENDING ALLOCATE              @L1A   40700000
*********************************************************************** 40750000
*                                                                     * 40800000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6DETP.       * 40850000
*   THEY REPRESENT THE "DEACTYP=" VALUE.                              * 40900000
*                                                                     * 40950000
*********************************************************************** 41000000
RPL6TCLP EQU   X'0F'               CLEANUP                       @Q1A   41050000
RPL6TPVL EQU   X'FE'               PROTOCOL VIOLATION            @Q1A   41100000
*********************************************************************** 41150000
*                                                                     * 41200000
*   THE FOLLOWING CONSTANT VALUES WILL BE RECORDED IN RPL6CRYP.       * 41250000
*   THEY REPRESENT THE ENCRYPTION LEVEL.                              * 41300000
*                                                                     * 41350000
*********************************************************************** 41400000
RPL6CNON EQU   X'00'               NONE                          @B1A   41450000
RPL6CSEL EQU   X'01'               SELECTIVE DATA ENCRYPTION     @B1A   41500000
RPL6CMAN EQU   X'03'               MANDATORY DATA ENCRYPTION     @B1A   41550000
         MEND                                                           41600000
*        END OF VTAM EXTENSION FOR THE APPC PARAMETER LIST           */ 41650000
*%RPL6END1: ;                                                           41700000
