*/********************************************************************/ 00050000
*/*                                                                  */ 00100000
*/*  MACRO-NAME: ISTSLCNS                                            */ 00150000
*/*                                                                  */ 00200000
*/*  MACRO-ACRONYM: SLC                                              */ 00250000
*/*                                                                  */ 00300000
*/*  MACRO-DESCRIPTIVE-NAME: SESSION LIMITS FOR CNOS                 */ 00350000
*/*                                                                  */ 00400000
*/*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                 */ 00450000
*/*                                                                  */ 00500000
*/*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"  */ 00504100
*/*                                                                  */ 00508200
*/*             5695-117 (C) COPYRIGHT IBM CORP. 1987, 1991, 1992.   */ 00512300
*/*             ALL RIGHTS RESERVED.                                 */ 00516400
*/*                                                                  */ 00520500
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */ 00524600
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY         */ 00528700
*/*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.             */ 00532800
*/*                                                                  */ 00536900
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */ 00541000
*/*                                                                  */ 00545100
*/*  MACRO-FUNCTION: THIS STRUCTURE IS SPECIFIED BY THE APPLICATION  */ 00650000
*/*                  PROGRAM WHEN IT ISSUES THE APPCCMD CNOS.  IT    */ 00700000
*/*                  PROVIDES VTAM WITH THE CNOS SESSION LIMITS AND  */ 00750000
*/*                  OTHER PARAMETERS WHICH ARE NOT IN THE RPL OR    */ 00800000
*/*                  RPL6.                                           */ 00850000
*/*                                                                  */ 00900000
*/*  MACRO-BOUNDARY: HWORD                                           */ 00950000
*/*                                                                  */ 01000000
*/*  MACRO-CREATED-BY: THE USER                                      */ 01050000
*/*                                                                  */ 01100000
*/*  MACRO-LOCATION: USER'S STORAGE                                  */ 01150000
*/*                                                                  */ 01200000
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */ 01250000
*/*                                                                  */ 01300000
*/*    REQUIRED-INNER-MAPS: NONE                                     */ 01350000
*/*                                                                  */ 01400000
*/*    REQUIRED-BY: NONE                                             */ 01450000
*/*                                                                  */ 01500000
*/*  MACRO-LAST-CHANGED: AS FOLLOWS                                  */ 01550000
*/*   01/08/86 - CREATED FOR APPC SUPPORT                    @R495808*/ 01600000
*/*   10/21/86 - ADVANCE SESSION CAPABILITY KNOWLEDGE ADDED  @P041930*/ 01625000
*/*   04/29/87 - CONVERSATION LEVEL SECURITY                 @R507300*/ 01637500
*/*   01/05/88 - CHANGE FIELD DESCRIPTIONS                   @P052802*/ 01643700
*/*                                                                  */ 01650000
*/* $MAC(ISTSLCNS),COMP(COPR),PROD(VTAM): SESSION LIMITS FOR CNOS    */ 01657100
*/*                                                                  */ 01664200
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */ 01671300
*/* ---- -------- ------- ------ ------  --------------------------- */ 01678400
*/* $F1= FB3@@CLD HVT3303 880321 013298: PARTNER LU VERIFICATION     */ 01685500
*/* $B1= AG@@@MST HVT3401 890425 692313: APPC OPERATOR COMMANDS      */ 01687800
*/* $B2= AV@@@AMS HVT3401 890426 577378: PERSISTENT VERIFICATION     */ 01690100
*/* $Y1= P115208  FREEDOM 940706 879315: Remove use of %GOTO         */ 01720000
*/*                                                                  */ 01750000
*/********************************************************************/ 01800000
*                                                                       01850000
*/*A-000000-999999                                           @R495808*/ 01900000
*@LISTPUSH;                         /*                           @Y1A*/ 01925000
*@LISTOFF;                          /*                           @Y1C*/ 01950000
*                                   /* BILINGUAL HEADER                 01975000
*                                                                       02000000
         MACRO                                                          02050000
         ISTSLCNS                                                       02100000
ISTSLCNS DSECT                      SESSION LIMITS FOR CNOS             02150000
SLCSESSL DS    H                    SESSION LIMIT                       02200000
SLCMCWL  DS    H                    MINIMUM NUMBER OF CONTENTION WINNER 02250000
*                                   SESSIONS - LOCAL LU                 02300000
SLCMCWP  DS    H                    MIMIMUM NUMBER OF CONTENTION WINNER 02350000
*                                   SESSIONS - PARTNER LU               02400000
SLCPARMS DS    XL1                  CNOS PARAMETERS                     02450000
SLCDRAL  EQU   X'80'                DRAINING OF LOCAL LU REQUESTED      02500000
SLCDRAP  EQU   X'40'                DRAINING OF PARTNER LU REQUESTED    02550000
SLCPRSPL EQU   X'20'                RESPONSIBLE FOR DEACTIVATION        02600000
*                                   IF SET, PARTNER LU IS RESPONSIBLE   02650000
*                                   IF NOT SET, LOCAL LU IS RESPONSIBLE 02700000
SLCALL   EQU   X'10'                INDICATES IF CNOS IS FOR ONE MODE   02733300
*                                   OR ALL MODES                        02766600
*                                   IF SET, CNOS IS FOR ALL MODES       02800000
*                                   IF NOT SET, CNOS IS FOR ONE MODE    02850000
SLCSSLU  EQU   X'08'                INDICATE IF THE PARTNER LU IS ONLY  02875000
*                                   SINGLE SESSION CAPABLE     @P041930 02900000
*                                                                       02906200
SLCLCLSI EQU   X'07'                LOCAL LU SECURITY SUBFIELD          02912400
*                                   ACCEPTANCE INFORMATION     @P052802 02918600
SLCLNONE EQU   X'00'                NONE ACCEPTED              @R507300 02924800
SLCLCONV EQU   X'04'                SECURITY SUBFIELDS ACCEPTED         02931000
*                                   ON FMH5                    @P052802 02937200
SLCLAVFA EQU   X'02'                ALREADY VERIFIED REQUESTS ACCEPTED  02940400
*                                                                  @F1A 02943600
SLCLPV   EQU   X'01'                PERSISTENT VERIFICATION REQUESTS    02943800
*                                   ACCEPTED                       @B2C 02944000
         DS    XL1                  RESERVED                       @B1A 02944200
SLCDSESL DS    H                    DEFINED SESSION LIMIT          @B1A 02944400
SLCDMCWL DS    H                    DEFINED MINIMUM NUMBER OF           02944600
*                                   CONTENTION WINNER SESSIONS          02944800
*                                   - LOCAL LU                     @B1A 02945000
SLCDMCWP DS    H                    DEFINED MINUMUM NUMBER OF           02945200
*                                   CONTENTION WINNER SESSIONS          02945400
*                                   - PARTNER LU                   @B1A 02945600
SLCPARM2 DS    XL1                  INDICATORS                     @B1A 02945800
SLCDDRAL EQU   X'80'                DEFINED DRAINING OF LOCAL LU   @B1A 02946000
SLCDRSPL EQU   X'40'                DEFINED ACCEPTANCE DEACTIVATION     02946200
*                                   RESPONSIBILITY OF LOCAL LU     @B1A 02946400
SLCDEFND EQU   X'20'                ON-ATTN CNOS DRIVEN DUE TO MODIFY   02946600
*                                   DEFINE. OFF- ATTN CNOS DRIVEN DUE   02946800
*                                   TO CNOS PROCESSED ON TARGET SIDE.   02947000
*        EQU   X'10'-X'01'          RESERVED                       @B1A 02947700
         DS    XL1                  RESERVED                       @B1A 02948400
*                                                                       02948500
SLCEND   DS    0X                   END OF ISTSLCNS                     02948600
         MEND                                                        */ 02950000
*                                                                       03000000
*@LISTPOP;                          /* BEGIN PL/X MAPPING        @Y1C*/ 03050000
*                                                                       03100000
*DCL                                                                    03150000
*  1 ISTSLCNS BDY(HWORD) BASED,     /* SESSION LIMITS FOR CNOS       */ 03200000
*    3 SLCSESSL FIXED(15),          /* SESSION LIMIT                 */ 03250000
*    3 SLCMCWL  FIXED(15),          /* MINIMUM NUMBER OF CONTENTION     03300000
*                                      WINNER SESSIONS - LOCAL LU    */ 03350000
*    3 SLCMCWP  FIXED(15),          /* MINIMUM NUMBER OF CONTENTION     03400000
*                                      WINNER SESSION - PARTNER LU   */ 03450000
*    3 SLCPARMS BIT(8),             /* CNOS PARAMETERS               */ 03500000
*      5 SLCDRAL  BIT(1),           /* DRAINING OF LOCAL LU:            03550000
*                                      B'0' - NO DRAINING REQUESTED,    03600000
*                                      B'1' - DRAINING REQUESTED     */ 03650000
*      5 SLCDRAP  BIT(1),           /* DRAINING OF PARTNER LU:          03700000
*                                      B'0' - NO DRAINING REQUESTED,    03750000
*                                      B'1' - DRAINING REQUESTED     */ 03800000
*      5 SLCPRSPL BIT(1),           /* RESPONSIBLE FOR DEACTIVATION:    03850000
*                                      B'0' - LOCAL LU RESPONSIBLE,     03900000
*                                      B'1' - PARTNER LU RESPONSIBLE */ 03950000
*      5 SLCALL   BIT(1),           /* INDICATES IF CNOS IS FOR ONE     03983300
*                                      MODE OR ALL MODES:               04016600
*                                      B'0' - ONE MODE,                 04050000
*                                      B'1' - ALL MODES              */ 04100000
*      5 SLCSSLU  BIT(1),           /* INDICATES IF THE PARTNER LU IS   04150000
*                                      ONLY SINGLE SESSION CAPABLE      04200000
*                                      B'0' - SINGLE SESSION CAPABILITY 04250000
*                                             IS UNKNOWN                04300000
*                                      B'1' - SINGLE SESSION CAPABILITY 04350000
*                                             IS KNOWN       @P041930*/ 04400000
*      5 SLCLCLSI BIT(3),           /* LOCAL LU SECURITY SUBFIELD       04450000
*                                      ACCEPTANCE INDICATORS @P052802*/ 04500000
*        6 SLCLCONV BIT(1),         /* LOCAL LU ACCEPTS SECURITY        04550000
*                                      SUBFIELDS ON FMH5     @P052802*/ 04600000
*        6 SLCLAVFA BIT(1),         /* LOCAL LU ACCEPTS REQUESTS FOR    04637500
*                                      ALREADY VERIFIED          @F1A*/ 04675000
*        6 SLCLPV   BIT(1),         /* LOCAL LU ACCEPTS REQUESTS FOR    04678500
*                                      PERSISTENT VERIFICATION   @B2C*/ 04682000
*    3 * CHAR(1),                   /* RESERVED                  @B1A*/ 04685500
*    3 SLCDSESL FIXED(15),          /* DEFINED SESSION LIMIT     @B1A*/ 04689000
*    3 SLCDMCWL FIXED(15),          /* DEFINED MINIMUM NUMBER OF        04692500
*                                      CONTENTION WINNER SESSIONS       04696000
*                                      - LOCAL LU                @B1A*/ 04699500
*    3 SLCDMCWP FIXED(15),          /* DEFINED MINIMUM NUMBER OF        04703000
*                                      CONTENTION WINNER SESSIONS       04706500
*                                      - PARTNER LU              @B1A*/ 04710000
*    3 SLCPARM2 BIT(8),             /* INDICATOR                 @B1A*/ 04713500
*      5 SLCDDRAL BIT(1),           /* DEFINED DRAINING OF LOCAL LU     04717000
*                                                                @B1A*/ 04720500
*      5 SLCDRSPL BIT(1),           /* DEFINED ACCEPTANCE OF            04724000
*                                      DEACTIVATION RESPONSIBILITY      04727500
*                                      OF LOCAL LU               @B1A*/ 04731000
*      5 SLCDEFND BIT(1),           /* ON- ATTN CNOS EXIT WAS DRIVEN    04734500
*                                      DUE TO APPCCMD DEFINE. OFF ATTN  04738000
*                                      CNOS EXIT DRIVEN DUE TO A APPC-  04741500
*                                      CMD CNOS.                     */ 04745000
*      5 *        BIT(5),           /* RESERVED                  @B1A*/ 04748500
*    3 *          CHAR(1),          /* RESERVED                  @B1A*/ 04752000
*    3 SLCEND     CHAR(0);          /* END OF CONTROL BLOCK      @B1A*/ 04755500
*                                                                       04759000
*/********************************************************************/ 04762500
*/*                                                                  */ 04766000
*/*    CONSTANT FOR LENGTH OF MIGRATION LEVEL OF ISTSLCNS            */ 04769500
*/*                                                                  */ 04773000
*/********************************************************************/ 04776500
*DCL                                                                    04780000
*    SLCMLEN FIXED(8) CONSTANT(7);  /* LENGTH OF MIGRATION LEVEL @B1A*/ 04783500
*                                                                       04787000
