*/*                                                                     00050000
         MACRO                                                          00100000
         ISTXPL &DSECT=YES,&LIST=YES,&ISTXPL=YES,&XPLVEC=COND           00150000
 TITLE   'ISTXPL  - PERFORMANCE EXIT PARAMETER  LIST                '   00200000
**/                                                                     00250000
*/* START OF SPECIFICATIONS ******************************************  00300000
*01* DESCRIPTIVE NAME: PERFORMANCE EXIT PARAMETER  LIST                 00350000
*01* MACRO NAME:  ISTXPL                                                00400000
* END OF SPECIFICATIONS **********************************************/ 00450000
*/*                                                                     00500000
* ********************************************************************  00550000
* *                                                                  *  00600000
* * MACRO-NAME: ISTXPL                                               *  00650000
* *                                                                  *  00700000
* * MACRO-ACRONYM: XPL                                               *  00750000
* *                                                                  *  00800000
* * MACRO-DESCRIPTIVE-NAME: EXIT PARAMETER LIST                      *  00850000
* *                                                                  *  00900000
* *  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                 *  00950000
* *                                                                  *  01000000
* *             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"  *  01050000
* *                                                                  *  01100000
* *             5647-A01 (C) COPYRIGHT IBM CORP. 1994, 1998          *  01150000
* *             ALL RIGHTS RESERVED.                                 *  01200000
* *                                                                  *  01250000
* *             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            *  01300000
* *             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY         *  01350000
* *             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.             *  01400000
* *                                                                  *  01450000
* *             SEE COPYRIGHT INSTRUCTIONS.                          *  01500000
* *                                                                  *  01550000
* *  MACRO-FUNCTION:                                                 *  01700000
* *                                                                  *  01750000
* *       ISTXPL is a Management Services Control Block containing   *  01800000
* *       the information passed back to the Performance Monitor via *  01850000
* *       the VTAM Inline Exit Facility.                             *  01900000
* *                                                                  *  01950000
* *                                                                  *  02000000
* *  MACRO-BOUNDARY: DWORD                                           *  02050000
* *                                                                  *  02100000
* *  MACRO-CREATED-BY: THE USER                                      *  02150000
* *                                                                  *  02200000
* *  MACRO-LOCATION: NA                                              *  02250000
* *                                                                  *  02300000
* *  MACRO-DEPENDENCIES: AS FOLLOW                                   *  02350000
* *                                                                  *  02354500
* *       CHANGES to the XPL MUST follow the conventions set by the  *  02359000
* *       original desing of PMI.  They are as follows:              *  02363500
* *            1)  Reserved fields SHOULD NOT become defined from    *  02368000
* *                one release of VTAM to the next.  Within a release*  02372500
* *                development cycle, flag bits and other fields not *  02377000
* *                allocated may be used or redefined, otherwise     *  02381500
* *                THEY SHOULD BE LEFT ALONE!                        *  02386000
* *            2)  A new fields may be appended to the vector from   *  02390500
* *                relase to release                             @D3A*  02395000
* *                                                                  *  02400000
* *    REQUIRED-INNER-MAPS:  NONE                                    *  02450000
* *                                                                  *  02500000
* *    REQUIRED-BY: NONE                                             *  02550000
* *                                                                  *  02600000
* * MACRO-NOTES:                                                     *  02650000
* *                                                                  *  02700000
* *                                                                  *  02750000
* * MACRO_LAST-CHANGED:                                              *  02800000
* *                                                                  *  02850000
* * $MAC(ISTXPL),COMP(MGMTSVC),PROD(VTAM): Monitor Exit Parm List    *  02900000
* *                                                                  *  02950000
* * FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            *  03000000
* * ---- -------- ------- ------ ------  --------------------------- *  03050000
* * $L0= FO@@@MST PERFMON 920511 043006: Performance Monitor         *  03100000
* *                                      Interface                   *  03150000
* * $L1= FO@DR001 PERFMON 930325 595229: BN and DLS enhancements     *  03200000
* * $L2= KP@@@MST PMIII   930524 595229: Multiple Monitors           *  03250000
* * $L3= KP@DR003 PMIII   930914 595229: SMF Enhancements            *  03300000
* * $L4= KP@DR009 PMIII   940228 043006: Support Level Recognition   *  03350000
* * $Y1= P112751  PERFMON 940325 043006: VR counts in error          *  03400000
* * $L5= KP@DR008 PMIII   940520 043006: Add DIRSIZE start option    *  03450000
* * $Y2= P118118  PMIII   950315 043006: Adjust XPLGSBV_XPANO length *  03475000
* * $D1= ID@@@MST FPAPI   950324 658994: Fast Path API for APPC      *  03487500
* * $D2= IP@@@MST MNPS    950714 421970: MNPS                        *  03493700
* * $D3= IY@@@MST HPRNW   950614 595229: HPR Network Management - PMI*  03496800
* * $D4= IY@DR004 HPRNW   960424 792173: Add RTP PU name to PMI      *  03498400
* * $S1= P123204  MNPS    960708 421970: Strengthen boundary value   *  03499200
* * $S2= P123209  MNPS    960724 658994: Add vector GETSTOR data     *  03499400
* * $S3= P123839  MNPS    960828 226653: Remove GETSTOR vector       *  03499600
* * $S4= P125018  FPAPI   961114 143576: Corrected mapping of CSM    *  03499700
* *                                      vectors                     *  03499800
* * $91= OW31324  CSV2R7  980526 714761: Corrected mapping of CSM    *  03512300
* *                                      vectors in assembler portion*  03524800
* *                                                                  *  03526800
* * Flag Reason   Release  Date   Origin    Description              *  03528800
* *----- -------- -------- ------ --------  ------------------------ *  03530800
* * $A1= OW33528  CSV2R8   990212 WAMORAN : SME HPR Pipe             *  03532800
* *                                         authorization            *  03534800
* * $  = OW39301  CSV3R10  990528 WAMORAN : Update OW33528 change    *  03535400
* *                                         activity to prevent      *  03536000
* *                                         compiler messages        *  03536600
* *                                                                  *  03537300
* ********************************************************************  03550000
* ********************************************************************  03600000
* *             Parameter List Header                                *  03650000
* ********************************************************************  03700000
*                                                                       03750000
*                                                                       03800000
         AIF   ('&ISTXPL' EQ 'NO').L0002                                03850000
         AIF   ('&DSECT' EQ 'YES').L0003                                03900000
         AIF   ('&ISTXPL' NE 'YES').L0002                               03950000
ISTXPL   DS    0X        Monitor Exit Parameter List                    04000000
         AGO   .L0004                                                   04050000
.L0003   ANOP                                                           04100000
ISTXPL   DSECT           Monitor Exit Parameter List                    04150000
.L0004   ANOP                                                           04200000
XPLHEAD  DS    0CL0024   Control Block Header                           04250000
XPLHEAD_LEN DS 1FL2      Entire XPL length in bytes - includes this    *04300000
                         field, header, and vectors                     04350000
XPLHEAD_HLEN DS 1FL2     XPL header length in bytes                     04400000
XPLHEAD_TRANS DS 1FL1    Reason for transmission                        04450000
XPLHEAD_CORR DS 1CL0002  Correlator, PRID from CNMRU, Zero if          *04500000
                         Unsolicited                                    04550000
XPLHEAD_MONACBN DS 1CL0008 Requesting monitor ACB name,                *04600000
                         Blanks if unsolcted                            04650000
XPLHEAD_FLAGS DS 0BL1    Flag byte                                      04700000
XPLHEAD_GEN EQU X'FC'    General Use                                    04750000
XPLHEAD_SMFIM EQU X'04'  SMF Interval Missed                            04800000
XPLHEAD_SEG EQU X'03'    Segmenting indicator                           04850000
XPLHEAD_FIRST EQU X'02'  First Segment indicator                        04900000
XPLHEAD_LAST EQU X'01'   Last Segment indicator                         04950000
         ORG   XPLHEAD_FLAGS+X'00000001'                                05000000
XPLHEAD_TIME DS 1CL0008  SMF interval time stamp for SMF data           05050000
XPLHEAD_END DS 0C        Begin First Vector                             05100000
ISTXPL_LEN EQU *-ISTXPL                                                 05150000
.L0002   ANOP                                                           05200000
*                                                                       05250000
* ********************************************************************  05300000
* *                    Vector Format                                 *  05350000
* ********************************************************************  05400000
*                                                                       05450000
*                                                                       05500000
         AIF   ('&XPLVEC' EQ 'NO').L0005                                05550000
         AIF   ('&DSECT' EQ 'YES').L0006                                05600000
         AIF   ('&XPLVEC' NE 'YES').L0005                               05650000
XPLVEC   DS    0X        Vector Format                                  05700000
         AGO   .L0007                                                   05750000
.L0006   ANOP                                                           05800000
XPLVEC   DSECT           Vector Format                                  05850000
.L0007   ANOP                                                           05900000
XPLVEC_COM DS  0CL0008   Common Vector Format                           05950000
XPLVEC_LEN DS  1FL2      Length of vector including this length field   06000000
XPLVEC_CAT DS  0CL0006   Data Type/Category                             06050000
XPLVEC_MAJ DS  1CL0002   Major Category: Global, VR,...                 06100000
XPLVEC_SUB DS  1CL0002   Data Subcategory                               06150000
XPLVEC_REC DS  1CL0002   Record Type Subcategory                        06200000
XPLVEC_DAT DS  0C        Vector data                                    06250000
XPLV_LEN   EQU *-XPLVEC                                                 06300000
*                                                                       06350000
* ********************************************************************  06400000
* ********************************************************************  06450000
* **********            GLOBAL DATA VECTORS                 **********  06500000
* ********************************************************************  06550000
* ********************************************************************  06600000
* ********************************************************************  06650000
* *             Global Environment Vector                            *  06700000
* ********************************************************************  06750000
*                                                                       06800000
         ORG   XPLVEC_DAT                                               06900000
XPLGENV  DS    0X                                                       06950000
XPLGENV_TASK DS 0CL0004  VTAM Task Id                                   07000000
XPLGENV_ASCB DS 0CL0004  ASCB Address (MVS/ESA)                         07050000
XPLGENV_ID DS  0CL0004   Machine/Task ID (VM/ESA)                       07100000
XPLGENV_PCB DS 1CL0004   PCB Address (VSE/ESA)                          07150000
XPLGENV_SLN DS 1CL0008   VTAM Start List Name                           07200000
XPLGENV_CFN DS 1CL0008   VTAM Configuration File Name                   07250000
XPLGENV_CRFN DS 1CL0008  VTAM Configuration Restart File Name           07300000
XPLGENV_DLR DS 1CL0004   Current number D/L/R requests                  07350000
XPLGENV_MDLR DS 1CL0004  Max number D/L/R requests since last COLLECT  *07400000
                         CNM RU                                         07450000
XPLGENV_MDLRE DS 1CL0004 Max number D/L/R requests ever used            07500000
XPLGENV_SMEAO DS 0BL2    Session Manager Exit active options            07550000
XPLGENV_SMEB1 DS 0BL1    SME Bits 1                                     07600000
XPLGENV_IAUTH EQU X'80'  Initial Authorized will be processed           07650000
XPLGENV_SAUTH EQU X'40'  Secondary Authorized will be processed         07700000
XPLGENV_IFAF EQU X'20'   Init and Final Accounting Functions will be   *07750000
                         processed                                      07800000
XPLGENV_GWPS EQU X'10'   Gateway Path selection will be processed       07850000
XPLGENV_EF EQU X'08'     End Function will be processed                 07900000
XPLGENV_STA EQU X'04'    Session takeover accounting will be processed  07950000
XPLGENV_SSCPS EQU X'02'  SSCP Selection Function will be processed      08000000
XPLGENV_ASSCP EQU X'01'  Adjacent SSCP Selection for DSRLST will be    *08050000
                         processed                                      08100000
         ORG   XPLGENV_SMEB1+X'00000001'                                08150000
XPLGENV_SMEB2 DS 0BL1    SME Bits 2                                     08200000
XPLGENV_ELUST EQU X'80'  Exit Functions allowed for LU session         *08250000
                         takeover                                       08300000
XPLGENV_IAAIO EQU X'40'  Init Authorization allowed for Init Other CD   08350000
XPLGENV_ALIAS EQU X'20'  Alias selection will be processed              08400000
XPLGENV_ALS EQU X'10'    ALS selection will be processed                08450000
XPLGENV_DSSIB EQU X'08'  ALS Selection processed for DSSIB requests     08500000
XPLGENV_CDRSC EQU X'04'  ALS Selection processed for CDRSC requests     08550000
XPLGENV_SMEMR EQU X'02'  SME supports MODIFY REPLACE                    08600000
XPLGENV_VR EQU X'01'     VR selection will be processed                 08650000
         ORG   XPLGENV_SMEAO+X'00000002'                                08700000
XPLGENV_GEFGS DS 0BL1    Global Environment Flags                       08750000
XPLGENV_SSCPG EQU X'80'  SSCP Gateway capability                        08800000
XPLGENV_ANN EQU X'40'    APPN Network Node capability                   08850000
XPLGENV_AEN EQU X'20'    APPN End Node capability                       08900000
XPLGENV_ADS EQU X'10'    APPN DS Capability                             08950000
XPLGENV_AIN EQU X'08'    APPN Interchange Node capability               09000000
XPLGENV_AMDH EQU X'04'   APPN Migration data Host capability            09050000
XPLGENV_BNC EQU X'02'    Border Node capability                         09100000
         ORG   XPLGENV_GEFGS+X'00000001'                                09150000
XPLGENV_DSMEAO DS 0CL0002 Directory Services Manager Exit active       *09200000
                         options                                        09250000
XPLGENV_DSMEB1 DS 0BL1   DSME Bits 1                                    09300000
XPLGENV_DIAUTH EQU X'80' Initial Authorized will be processed           09350000
XPLGENV_BNSO EQU X'10'   Border Node Selection Option Supported         09400000
XPLGENV_DEF EQU X'08'    End function will be processed                 09450000
         ORG   XPLGENV_DSMEB1+X'00000001'                               09500000
XPLGENV_DSMEB2 DS 0BL1   DSME Bits 2                                    09550000
XPLGENV_DSMMR EQU X'02'  DSME supports MODIFY REPLACE                   09600000
         ORG   XPLGENV_DSMEAO+X'00000002'                               09650000
XPLGENV_TMINV DS 1CL0002 Tuning Statistics Timing interval              09700000
XPLGENV_FLGS2 DS 0BL1    Environment flags                              09750000
XPLGENV_TUNAC EQU X'80'  Tuning stat is active                          09800000
XPLGENV_TUNRQ EQU X'40'  TNSTAT task attatched                          09850000
XPLGENV_TUNCL EQU X'20'  Display TUNSTAT RECORD at Console              09900000
         ORG   XPLGENV_FLGS2+X'00000001'                                09950000
XPLGENV_DIRSZ DS 1CL0004 DIRSIZE start option value                     10000000
XPLGENV_SMEAO2 DS 0BL2   Session Manager Exit active options part II    10008600
XPLGENV_SMEB3 DS 0BL1    SME Bits 3                                     10017200
XPLGENV_MNPS  EQU X'80'  MNPS Recovery calls will be processed          10025800
XPLGENV_HPRVR EQU X'40'  HPR VR Selection                               10027500
XPLGENV_HPROLU EQU X'20' HPR RTP OLU Pipe Authorization                 10029200
XPLGENV_HPRANR EQU X'10' HPR RTP ANR Pipe Authorization                 10030900
XPLGENV_HPRDLU EQU X'08' HPR RTP DLU Pipe Authorization                 10032600
         ORG   XPLGENV_SMEAO2+X'00000002'                               10034400
XPLGENV_LCL_NETID DS 1CL0008 Local Net ID                               10043300
XPLGENV_LCL_CPNAME DS 1CL0008 Local CP Name                             10045200
XPLGENV_FLGS3 DS 0BL1    Environment flags 3                            10047200
XPLGENV_MNPSCAP EQU X'80' MNPS capability                               10047800
XPLGENV_HPRCP EQU X'60'  HPR Support/Capability                         10048400
         ORG   XPLGENV_FLGS3+X'00000001'                                10049200
XPLGENV_LEN EQU *-XPLGENV                                               10050000
         ORG   ,                                                        10100000
*                                                                       10150000
* ********************************************************************  10200000
* *             Global Inline Exit Vector                            *  10250000
* ********************************************************************  10300000
*                                                                       10350000
         ORG   XPLVEC_DAT                                               10450000
XPLGIEV  DS    0X                                                       10500000
XPLGIEV_ENM DS 1CL0008   Exit Name                                      10550000
XPLGIEV_EMNM DS 1CL0008  Exit Module Name                               10600000
XPLGIEV_EL DS  1CL0004   Exit Level                                     10650000
XPLGIEV_ESTAT DS 1FL1    Exit status                                    10700000
XPLGIEV_LEN EQU *-XPLGIEV                                               10750000
         ORG   ,                                                        10800000
*                                                                       10850000
* ********************************************************************  10900000
* *             Global Storage Buffer Pool Vector                    *  10950000
* ********************************************************************  11000000
*                                                                       11050000
         ORG   XPLVEC_DAT                                               11150000
XPLGSBV  DS    0X                                                       11200000
XPLGSBV_BPID DS 1CL0004  Buffer pool ID(name)                           11250000
XPLGSBV_SIZE DS 1CL0002  Size of each Buffer in Pool                    11300000
XPLGSBV_BASNM DS 1CL0004 Base Num Buffers defined at VTAM              *11350000
                         Initialization                                 11400000
XPLGSBV_CURNM DS 1CL0004 Current num buffers defined                    11450000
XPLGSBV_TOTAV DS 1CL0004 Total num buffer available                     11500000
XPLGSBV_STATA DS 1CL0004 Num static buffer available                    11550000
XPLGSBV_MXUSE DS 1CL0004 Maximum num buffers in use since last COLLECT *11600000
                         CNM RU                                         11650000
XPLGSBV_XSZBU DS 1CL0002 Expansion size (buffers), same as number      *11700000
                         buffers per extent                             11750000
XPLGSBV_XSZBY DS 1CL0004 Expansion size (bytes)                         11800000
XPLGSBV_XTHRE DS 1CL0002 Expansion Threshold                            11850000
XPLGSBV_XLIM DS 1CL0004  Expansion limit                                11900000
XPLGSBV_CTHRE DS 1CL0002 Contraction Threshold                          11950000
XPLGSBV_NMEXP DS 1CL0004 Number of Expansions                           12000000
XPLGSBV_SDTHR DS 1CL0004 Slow Down Threshold                            12050000
XPLGSBV_NUMQR DS 1CL0004 Num of queued requests (RPH)                   12100000
XPLGSBV_NMBNQ DS 1CL0004 Num buffers needed to satisfy queued requests  12150000
XPLGSBV_MXNQR DS 1CL0004 Maximum num of queued requests since last     *12200000
                         COLLECT CNM RU                                 12250000
XPLGSBV_MXNAL DS 1CL0004 Maximum number of bytes allocated since last  *12300000
                         COLLECT CNM RU                                 12350000
XPLGSBV_ATTFL DS 0BL2    Pool attribute flags                           12400000
XPLGSBV_ATTR1 DS 0BL1    Pool attribute flags                           12450000
XPLGSBV_FIXST EQU X'40'  1=Fixed - 0=Pageable storage                   12500000
XPLGSBV_FTCH EQU X'20'   Pool resides in fetch protected storage        12550000
XPLGSBV_BEL24 EQU X'08'  Storage allocated below 24 bit line            12600000
         ORG   XPLGSBV_ATTFL+X'00000001'                                12650000
XPLGSBV_ATTR2 DS 0BL1    Pool attribute flags                           12700000
XPLGSBV_USRFX EQU X'80'  User request fixed buffer                      12750000
         ORG   XPLGSBV_ATTFL+X'00000002'                                12800000
XPLGSBV_SPNUM DS 1CL0002 Subpool Number                                 12850000
XPLGSBV_BSENO DS 1CL0002 User specified BASENO                          12900000
XPLGSBV_XPANO DS 1CL0002 User specified xpand buff                      12950000
XPLGSBV_NPXB DS 1CL0004  Number of Active Extents                       13000000
XPLGSBV_NABIE DS 1CL0004 Number of available buffers in all extents     13050000
XPLGSBV_LEN EQU *-XPLGSBV                                               13100000
         ORG   ,                                                        13150000
*                                                                       13200000
* ********************************************************************  13250000
* *             Global Storage Private Storage Vector                *  13300000
* ********************************************************************  13350000
*                                                                       13400000
         ORG   XPLVEC_DAT                                               13500000
XPLGSPV  DS    0X                                                       13550000
XPLGSPV_CURR DS 1CL0004  Current private storage alloc                  13600000
XPLGSPV_MAX DS 1CL0004   Max private storage allocated                  13650000
XPLGSPV_LEN EQU *-XPLGSPV                                               13700000
         ORG   ,                                                        13750000
*                                                                       13800000
* ********************************************************************  13850000
* *             Global Storage CSA Vector                            *  13900000
* ********************************************************************  13950000
*                                                                       14000000
         ORG   XPLVEC_DAT                                               14100000
XPLGSCV  DS    0X                                                       14150000
XPLGSCV_MXCSA DS 1CL0004 Maximum size CSA allowed                       14200000
XPLGSCV_MXC24 DS 1CL0004 Max size CSA allowed below 16M line            14250000
XPLGSCV_CUCSA DS 1CL0004 Current CSA allocated for VTAM                 14300000
XPLGSCV_TOTHW DS 1CL0004 Total CSA high-water mark since last COLLECT  *14350000
                         CNM RU                                         14400000
XPLGSCV_TOTHT DS 1CL0008 Timestamp for high-water mark for Total CSA   *14450000
                         allocated                                      14500000
XPLGSCV_TOTLW DS 1CL0004 Total CSA low-water mark since last COLLECT   *14550000
                         CNM RU                                         14600000
XPLGSCV_TOTLT DS 1CL0008 Timestamp for low-water mark for Total CSA    *14650000
                         allocated                                      14700000
XPLGSCV_MTOTC DS 1CL0004 Max Total CSA ever used                        14750000
XPLGSCV_CUC24 DS 1CL0004 Current CSA allocated below 16M line           14800000
XPLGSCV_C24MX DS 1CL0004 Max CSA 24 ever used                           14850000
XPLGSCV_C24HW DS 1CL0004 CSA 24 high-water mark since last COLLECT CNM *14900000
                         RU                                             14950000
XPLGSCV_C24HT DS 1CL0008 Timestamp for high-water mark for TCSA 24     *15000000
                         allocated                                      15050000
XPLGSCV_C24LW DS 1CL0004 CSA 24 low-water mark since last COLLECT CNM  *15100000
                         RU                                             15150000
XPLGSCV_C24LT DS 1CL0008 Timestamp for low-water mark for CSA 24       *15200000
                         allocated                                      15250000
XPLGSCV_LEN EQU *-XPLGSCV                                               15300000
         ORG   ,                                                        15350000
*                                                                       15400000
* ********************************************************************  15450000
* *             Global Storage GETBLK Vector                         *  15500000
* ********************************************************************  15550000
*                                                                       15600000
         ORG   XPLVEC_DAT                                               15700000
XPLGSGV  DS    0X                                                       15750000
XPLGSGV_NAME DS 1CL0008  Pool Name                                      15800000
XPLGSGV_BLEN DS 1CL0004  Subpool buffer length                          15850000
XPLGSGV_BPPAG DS 1CL0002 Number buffers per page                        15900000
XPLGSGV_PGSIZ DS 1CL0004 Page size                                      15950000
XPLGSGV_BYTEU DS 1CL0004 Number of bytes in use                         16000000
XPLGSGV_BUHW DS 1CL0004  Number of bytes in use high- water mark since *16050000
                         last COLLECT CNM RU processed                  16100000
XPLGSGV_BUHT DS 1CL0008  Timestamp for number of bytes in use          *16150000
                         high-water mark since last COLLECT CNM RU      16200000
XPLGSGV_BYTEA DS 1CL0004 Number of bytes allocated                      16250000
XPLGSGV_BAHW DS 1CL0004  Number of bytes allocated high- water mark    *16300000
                         since last COLLECT CNM RU processed            16350000
XPLGSGV_BAHT DS 1CL0008  Timestamp for number of bytes allocated       *16400000
                         high-water mark since last COLLECT CNM RU      16450000
XPLGSGV_LEN EQU *-XPLGSGV                                               16500000
         ORG   ,                                                        16550000
*                                                                       16600000
* ********************************************************************  16650000
* *             Global Session Vector                                *  16700000
* ********************************************************************  16750000
*                                                                       16800000
         ORG   XPLVEC_DAT                                               16900000
XPLGSEV  DS    0X                                                       16950000
XPLGSEV_STTAK DS 1CL0004 Number successful LU-LU session starts and    *17000000
                         takeovers                                      17050000
XPLGSEV_STOP DS 1CL0004  Number LU-LU session stops                     17100000
XPLGSEV_FAIL DS 1CL0004  Number LU-LU session set-up failures           17150000
XPLGSEV_ACTHW DS 1CL0004 Number of active LU-LU sessions high-water    *17200000
                         mark since last COLLECT CNM RU processed       17250000
XPLGSEV_ACTHT DS 1CL0008 Timestamp for number of active LU-LU sessions *17300000
                         high-water mark since last COLLECT CNM RU      17350000
XPLGSEV_ACTLW DS 1CL0004 Number of active LU-LU sessions low-water     *17400000
                         mark since last COLLECT CNM RU processed       17450000
XPLGSEV_ACTLT DS 1CL0008 Timestamp for number of active LU-LU sessions *17500000
                         low-water mark since last COLLECT CNM RU       17550000
XPLGSEV_QINIT DS 1CL0004 Number of LU-LU sessions in Queued Initiate   *17600000
                         status                                         17650000
XPLGSEV_PENDR DS 1CL0004 Number of LU-LU sessions in Pending           *17700000
                         Reallocation status                            17750000
XPLGSEV_PENDA DS 1CL0004 Number of LU-LU sessions in Pending Active    *17800000
                         status                                         17850000
XPLGSEV_ACT DS 1CL0004   Number active LU-LU sessions                   17900000
XPLGSEV_PENDT DS 1CL0004 Number of LU-LU sessions in Pending           *17950000
                         Termination status                             18000000
XPLGSEV_DAPLU DS 1CL0004 Number defined APPL LUs                        18050000
XPLGSEV_DDELU DS 1CL0004 Number defined non-appl dependent LUs          18100000
XPLGSEV_DCDRS DS 1CL0004 Number defined CDRSCs                          18150000
XPLGSEV_DPU DS 1CL0004   Number defined PUs                             18200000
XPLGSEV_AAPLU DS 1CL0004 Number active APPLU LUs                        18250000
XPLGSEV_ADELU DS 1CL0004 Number active non-appl dependent LUs           18300000
XPLGSEV_ACDRS DS 1CL0004 Number active CDRSCs                           18350000
XPLGSEV_APU DS 1CL0004   Number active PUs                              18400000
XPLGSEV_RCPF DS 1CL0004  Number retriable CP-CP session failures        18450000
XPLGSEV_NRCPF DS 1CL0004 Number non-retriable CP-CP session failures    18500000
XPLGSEV_SCPIN DS 1CL0004 Number successful CP-CP session initiations    18550000
XPLGSEV_DLREN DS 1CL0004 Number of DLR end nodes                        18600000
XPLGSEV_DLRNN DS 1CL0004 Number of DLR network nodes                    18650000
XPLGSEV_DLRPU DS 1CL0004 Number of DLR served PUs                       18700000
XPLGSEV_DLRLU DS 1CL0004 Number of DLR served LUs                       18750000
XPLGSEV_AILUS DS 1CL0004 Number active ILUs                             18800000
XPLGSEV_SRVEN DS 1CL0004 Number of ENs served by this NN (i.e. CP-CP   *18850000
                         session active) INVALID when we are EN         18900000
XPLGSEV_CPSNN DS 1CL0004 Number NN with which this NN has CP-CP        *18950000
                         sessions, INVALID when we are EN               19000000
XPLGSEV_LEN EQU *-XPLGSEV                                               19050000
         ORG   ,                                                        19100000
*                                                                       19150000
* ********************************************************************  19200000
* *             Global APPN Directory Services Vector                *  19250000
* ********************************************************************  19300000
*                                                                       19350000
         ORG   XPLVEC_DAT                                               19450000
XPLGADV  DS    0X                                                       19500000
XPLGADV_NRFLD DS 1CL0004 Number resources found in local database       19550000
XPLGADV_NRFDS DS 1CL0004 Number resources found from Directory Server   19600000
XPLGADV_NRFDB DS 1CL0004 Number resources found via domain broadcast    19650000
XPLGADV_NRFNB DS 1CL0004 Number resources found via network broadcast   19700000
XPLGADV_FSRCH DS 1CL0004 Number of failed searches (receive negative   *19750000
                         reply)                                         19800000
XPLGADV_NBNCE DS 1CL0004 Number of times network broadcast not         *19850000
                         performed due to negative cache entry          19900000
XPLGADV_ESRRF DS 1CL0004 Number of external search requests - resource *19950000
                         found                                          20000000
XPLGADV_ESRNF DS 1CL0004 Number of external search requests - resource *20050000
                         ^ found                                        20100000
XPLGADV_DSNRR DS 1CL0004 Number referrals received                      20150000
XPLGADV_DSPRR DS 1CL0004 Number positive replies received from an      *20200000
                         Alternate Directory Server                     20250000
XPLGADV_DSNNR DS 1CL0004 Number negative replies received from an      *20300000
                         Alternate Directory Server                     20350000
XPLGADV_RRCGC DS 1CL0004 Number of resources removed from cache due to *20400000
                         garbage collection                             20450000
XPLGADV_ADJDS DS 1CL0004 Number of adjacent nodes in a different       *20500000
                         subnet                                         20550000
XPLGADV_ROBCH DS 1CL0004 Number of times a CHACHE entry is discarded   *20600000
                         due to DIRSIZE max being reached               20650000
XPLGADV_REGRS DS 1CL0004 Number of registered resources at a Cesntral  *20700000
                         Directory Server or at an NN                   20750000
XPLGADV_CACHE DS 1CL0004 Number of entries in the CACHE                 20800000
XPLGADV_LEN EQU *-XPLGADV                                               20850000
         ORG   ,                                                        20900000
*                                                                       20950000
* ********************************************************************  21000000
* *         Global APPN Directory Services Border Node Vector           21050000
* ********************************************************************  21100000
*                                                                       21150000
         ORG   XPLVEC_DAT                                               21250000
XPLGBNV  DS    0X                                                       21300000
XPLGBNV_CPNME DS 0CL0016 Network qualified CPNAME                       21350000
XPLGBNV_NETID DS 1CL0008 Adjacent Node Network ID                       21400000
XPLGBNV_NAME DS 1CL0008  Adjacent Node Name                             21450000
XPLGBNV_SSRCH DS 1CL0004 Number of subnet searches sent to adjacent    *21500000
                         Node                                           21550000
XPLGBNV_RSRCH DS 1CL0004 Number of subnet searches received from ADJ   *21600000
                         node                                           21650000
XPLGBNV_LEN EQU *-XPLGBNV                                               21700000
         ORG   ,                                                        21750000
*                                                                       21800000
* ********************************************************************  21850000
* *             Global APPN Topology Data Vector                     *  21900000
* ********************************************************************  21950000
*                                                                       22000000
         ORG   XPLVEC_DAT                                               22100000
XPLGATV  DS    0X                                                       22150000
XPLGATV_NRTET DS 1CL0004 Number of routes - using existing tree         22200000
XPLGATV_NRTMT DS 1CL0004 Number of routes - using modified tree         22250000
XPLGATV_NRTNT DS 1CL0004 Number of routes - using new tree              22300000
XPLGATV_TDUON DS 1CL0004 Number of TDUs originated by this node         22350000
XPLGATV_TDUPN DS 1CL0004 Number of TDUs propagated by this node         22400000
XPLGATV_TDUDU DS 1CL0004 Number of TDUs received by this node          *22450000
                         resulting in topology database update          22500000
XPLGATV_TDUDN DS 1CL0004 Number of TDUs received by this node and      *22550000
                         discarded for normal reasons                   22600000
XPLGATV_TDUDR DS 1CL0004 Number of TDUs received by this node and      *22650000
                         discarded because is a RSN ^ OK (rebroadcast)  22700000
XPLGATV_TDUDI DS 1CL0004 Number of TDUs received by this node and      *22750000
                         discarded because of data inconsistency       *22800000
                         (rebroadcast)                                  22850000
XPLGATV_NNTD DS 1CL0004  Number of network nodes in topology database   22900000
XPLGATV_ENTD DS 1CL0004  Number of end nodes in topology database       22950000
XPLGATV_TGTD DS 1CL0004  Number of TGs in topology database             23000000
XPLGATV_TGFL DS 1CL0004  Number of TG failures                          23050000
XPLGATV_DPUAL DS 1CL0004 Num of dynamic PU allocations                  23100000
XPLGATV_DTCF DS 1CL0004  Number of trees discarded due to Cache being  *23150000
                         full                                           23200000
XPLGATV_NMTRE DS 1CL0004 Number of trees                                23250000
XPLGATV_VNTD DS 1CL0004  Number of Virtual nodes in the topology       *23300000
                         database                                       23350000
XPLGATV_CDSTD DS 1CL0004 Number Central Directory Servers in topology  *23400000
                         database                                       23450000
XPLGATV_ICNCN DS 1CL0004 Number of IC Nodes in the topology database    23500000
XPLGATV_ENCON DS 1CL0004 Number of ENs connected to this node           23550000
XPLGATV_NNCON DS 1CL0004 Number of NNs connected to this node           23600000
XPLGATV_VNCON DS 1CL0004 Number of VNs connected to this node           23650000
XPLGATV_LEN EQU *-XPLGATV                                               23700000
         ORG   ,                                                        23701100
*                                                                       23702200
* ********************************************************************  23703300
* *             Global CSM Buffer Pool Vector                        *  23704400
* ********************************************************************  23705500
*                                                                       23706600
         ORG   XPLVEC_DAT                                               23708800
XPLGCBV  DS    0X                                                       23709900
XPLGCBV_SIZE DS 1CL0004  Buffer size                                    23711000
XPLGCBV_SRCE DS 0BL1     Buffer source                                  23712100
XPLGCBV_ECSA EQU X'80'   Buffer source is ECSA                          23713200
XPLGCBV_DS   EQU X'40'   Buffer source is Data Space (DS)               23714300
         ORG   XPLGCBV_SRCE+X'00000004'                          @91C   23715500
XPLGCBV_INUSE DS 1CL0004 Number of buffers in pool that are in use      23716800
XPLGCBV_FREE DS 1CL0004  Number of available buffers in pool            23718200
XPLGCBV_LEN EQU *-XPLGCBV                                               23719800
         ORG   ,                                                        23720900
*                                                                       23722000
* ********************************************************************  23724200
* *             Global CSM Storage Usage Vector                      *  23725300
* ********************************************************************  23726400
*                                                                       23727500
         ORG   XPLVEC_DAT                                               23729700
XPLGCSV   DS 0X           Global CSM Storage Usage Vector               23732600
XPLGCSV_MAXFIXED DS 1CL0004  Installation maximum fixed storage         23735500
XPLGCSV_CURFIXED DS 1CL0004  Current fixed storage usage                23738400
XPLGCSV_MAXECSA DS 1CL0004  Installation maximum ECSA storage           23741300
XPLGCSV_CURECSA DS 1CL0004  Current ECSA storage usage                  23744200
XPLGCSV_LEN EQU *-XPLGCSV                                               23747100
         ORG   ,                                                        23750000
*                                                                       23800000
* ********************************************************************  23850000
* ********************************************************************  23948000
* **********        VIRTUAL ROUTE DATA VECTORS              **********  23950000
* ********************************************************************  24000000
* ********************************************************************  24050000
* ********************************************************************  24100000
* *                 Basic Route Data Vector                          *  24150000
* ********************************************************************  24200000
*                                                                       24250000
         ORG   XPLVEC_DAT                                               24350000
XPLVBRV  DS    0X                                                       24400000
XPLVBRV_DSTSA DS 1CL0004 Destination Subarea                            24450000
XPLVBRV_TPRIO DS 1FL1    Transmission Priority                          24500000
XPLVBRV_VRNUM DS 1FL1    Virtual Route number                           24550000
XPLVBRV_ADJSA DS 1CL0004 Adjacent Subarea                               24600000
XPLVBRV_ERTNM DS 0BL1    Explicit Route number                          24650000
XPLVBRV_IERNM EQU X'F0'  Initial Explicit Route number                  24700000
XPLVBRV_AERNM EQU X'0F'  Actual Explicit Route number                   24750000
         ORG   XPLVBRV_ERTNM+X'00000001'                                24800000
XPLVBRV_RERNM DS 1FL1    Reverse Explicit Route number                  24850000
XPLVBRV_SESVR DS 1CL0002 Number of sessions on VR                       24900000
XPLVBRV_MINWS DS 1FL1    Current minimum window size                    24950000
XPLVBRV_MAXWS DS 1FL1    Current maximum window size                    25000000
XPLVBRV_DEFWS DS 1FL1    Default window size                            25050000
XPLVBRV_DFMWS DS 1FL1    Default maximum window size                    25100000
XPLVBRV_WSRES DS 1CL0004 Number of time window size reset to the       *25150000
                         minimum                                        25200000
XPLVBRV_PIUWS DS 1CL0004 Number of PIUs on the VR waiting to be sent    25250000
XPLVBRV_VRST DS 1FL1     Virtual Route state                            25300000
XPLVBRV_FCDATA DS 0CL0073 Flow Control state data                       25350000
XPLVBRV_FCST DS 0BL1     Flow Control state                             25400000
XPLVBRV_ROUTE EQU X'03'  Route status - 00 = blocked 01 = held 10 =    *25450000
                         open                                           25500000
         ORG   XPLVBRV_FCST+X'00000001'                                 25550000
XPLVBRV_NTHLD DS 1CL0004 Num times route in held state                  25600000
XPLVBRV_THLDC DS 1CL0008 Time VR has been in held state if currently   *25650000
                         held                                           25700000
XPLVBRV_THLDT DS 1CL0008 Time VR has been in held state (Total not     *25750000
                         including current held time)                   25800000
XPLVBRV_THLDM DS 1CL0008 Time VR has been in held state (Maximum time  *25850000
                         held for any given instance)                   25900000
XPLVBRV_TMHLD DS 1CL0008 Timestamp for Time VR has been in held state  *25950000
                         (Maximum time held for any given instance)     26000000
XPLVBRV_NTBLK DS 1CL0004 Number of times VR blocked                     26050000
XPLVBRV_TBLKC DS 1CL0008 Time VR has been in blocked state if          *26100000
                         currently blocked                              26150000
XPLVBRV_TBLKT DS 1CL0008 Time VR has been in blocked state (Total not  *26200000
                         including current blocked time)                26250000
XPLVBRV_TBLKM DS 1CL0008 Time VR has been in blocked state (Maximum    *26300000
                         time blocked for any given instance)           26350000
XPLVBRV_TMBLK DS 1CL0008 Timestamp for Time VR has been in blocked     *26400000
                         state (Maximum time blocked held for any      *26450000
                         given instance                                 26500000
XPLVBRV_LUSCT DS 1CL0002 Total number of LU-LU sessions on the VR       26550000
XPLVBRV_CPRSC DS 1CL0002 Current pacing request send count              26600000
XPLVBRV_CPWSZ DS 1CL0001 Current pacing window size                     26650000
XPLVBRV_OPIUC DS 1CL0004 Outbound PIU count over VR                     26700000
XPLVBRV_IPIUC DS 1CL0004 Inbound PIU count over VR                      26750000
XPLVBRV_LEN EQU *-XPLVBRV                                               26800000
         ORG   ,                                                        26850000
*                                                                       26900000
* ********************************************************************  26950000
* ********************************************************************  26964200
* **********        Rapid Transport Protocol Vectors        **********  26978400
* ********************************************************************  26992600
* ********************************************************************  27006800
* ********************************************************************  27021000
* *                   Basic RTP Data Vector                          *  27035200
* ********************************************************************  27050000
*                                                                       27100000
         ORG   XPLVEC_DAT                                               27100700
XPLRTPV  DS    0X                                                       27101400
XPLRTPV_FLAGS DS 0BL2    RTP Flag Bytes                                 27102100
XPLRTPV_PATHSWITCH EQU X'80' Path Switch occured                        27102800
XPLRTPV_CLOSEOUT EQU X'40' RTP deleted OR Name changed and not         *27103200
                         monitored                                      27103600
XPLRTPV_PSW_NAME EQU X'20' Path Switch occured with name change         27103800
         ORG   XPLRTPV_FLAGS+X'00000002'                                27104000
XPLRTPV_LCL_NCE DS 0BL8 Local NCE                                       27104300
         ORG   XPLRTPV_LCL_NCE+X'00000008'                              27104600
XPLRTPV_LCL_TCID DS 0BL8 Local TCID                                     27104900
         ORG   XPLRTPV_LCL_TCID+X'00000008'                             27105200
XPLRTPV_RTP_PU DS 1CL0008 RTP PU Name                                   27105400
XPLRTPV_RMT_NETID DS 1CL0008 Remote Net ID                              27105600
XPLRTPV_RMT_CPNAME DS 1CL0008 Remote CP Name                            27106000
XPLRTPV_RMT_PSW_NETID DS 1CL0008 Remote Net ID after Path Switch        27106500
XPLRTPV_RMT_PSW_CPNAME DS 1CL0008 Remote CP Name after Path Switch      27106800
XPLRTPV_RMT_NCE DS 0BL8 Remote NCE                                      27107100
         ORG   XPLRTPV_RMT_NCE+X'00000008'                              27107400
XPLRTPV_RMT_TCID DS 0BL8 Remote TCID                                    27107700
         ORG   XPLRTPV_RMT_TCID+X'00000008'                             27108000
XPLRTPV_RTP_STATE DS 1FL1 RTP State                                     27108400
XPLRTPV_PSW_TIMER DS 1FL4 Path Switch Timer                             27109100
XPLRTPV_RTRP_DLAY DS 1FL4 Round Trip Delay                              27109800
XPLRTPV_STATS_1 DS 0CL0054 Data segment                                 27110100
XPLRTPV_BYTES_SNT DS 1FL4 Number bytes sent over RTP                    27110500
XPLRTPV_BYTES_RCVV DS 1FL4 Number bytes received over RTP               27111200
XPLRTPV_PIUS_FRST DS 1FL4 Number 1st in segment PIUs sent over RTP      27111900
XPLRTPV_PIUS_MIDL DS 1FL4 Number middle in segmnt PIUs sent over RTP    27112600
XPLRTPV_PIUS_LAST DS 1FL4 Number last in segmnt PIUs sent over RTP      27113300
XPLRTPV_PIUS_WHOL DS 1FL4 Number unsegmented PIUs sent over RTP         27114000
XPLRTPV_PIUR_FRST DS 1FL4 Num 1st in segment PIUs received over RTP     27114700
XPLRTPV_PIUR_MIDL DS 1FL4 Num middle in segmnt PIUs received over RTP   27115400
XPLRTPV_PIUR_LAST DS 1FL4 Num last in segmnt PIUs received over RTP     27116100
XPLRTPV_PIUR_WHOL DS 1FL4 Number unsegmented PIUs received over RTP     27116800
XPLRTPV_SNDR_CHNG DS 1FL4 Number times allowed send rate changed        27117500
XPLRTPV_EPINI_PSW DS 1FL2 Total Path Switch Attempts initiated by RTP  *27117900
                         endpoint                                       27118300
XPLRTPV_VTAMI_PSW DS 1FL2 Total Path Switch Attempts initiated by      *27118700
                         this VTAM                                      27119100
XPLRTPV_OPCMD_PSW DS 1FL2 Path Switch Attempts due to Operator or VTAM *27119500
                         Command                                        27119900
XPLRTPV_UNSUC_PSV DS 1FL2 Total unsuccessful Path Switch attempts      *27120300
                         initiated by this VTAM                         27120700
XPLRTPV_UNSUC_PSO DS 1FL2 Unsuccessful Path Switch due to Operator     *27121700
                         Command                                        27122400
XPLRTPV_LULU_SESS_COUNT DS 1FL4 Count of active LU-LU sessions using   *27122800
                         this RTP                                       27123200
XPLRTPV_TOT_BKPTM DS 1FL4 Time in milliseconds back pressure has been  *27123800
                         been applied                                   27124500
XPLRTPV_TOT_BACKP DS 1FL2 Total number of times back pressure has been *27124700
                         applied                                        27124900
XPLRTPV_PSW_BACKP DS 1FL2 Number of times back pressure applied due to *27125200
                         path switch                                    27125900
XPLRTPV_QDP_BACKP DS 1FL2 Number of times back pressure applied due to *27126600
                         queue depth exceeded                           27127300
XPLRTPV_RESNT_NLP DS 1FL4 Number retransmitted NLPs                     27129400
XPLRTPV_UNAK_BUFS DS 1FL4 Current number of unacknowledge buffers       27130100
XPLRTPV_LEN EQU *-XPLRTPV                                               27130800
         ORG   ,                                                        27131500
*                                                                       27132200
* ********************************************************************  27132900
* *                          RTP RSCV Vector                         *  27133600
* ********************************************************************  27134300
*                                                                       27135000
         ORG   XPLVEC_DAT                                               27135700
XPLRSCV  DS    0X                                                       27136400
XPLRSCV_DATA DS  0C      Actual Data for CV2B                           27137100
XPLRSCV_LEN EQU *-XPLRSCV                                               27137800
         ORG   ,                                                        27138500
*                                                                       27139200
* ********************************************************************  27139900
* *                       RTP COS/TPF Vector                         *  27140600
* ********************************************************************  27141300
*                                                                       27142000
         ORG   XPLVEC_DAT                                               27142700
XPLCOSV  DS    0X                                                       27143400
XPLCOSV_DATA DS  0C      Actual Data for CV2C                           27144100
XPLCOSV_LEN EQU *-XPLCOSV                                               27144800
         ORG   ,                                                        27145500
*                                                                       27146200
* ********************************************************************  27146900
* ********************************************************************  27147800
* **********          Application Data Vectors              **********  27148700
* ********************************************************************  27149600
* ********************************************************************  27150500
* ********************************************************************  27151400
* *                MNPS Application Recovery Data                    *  27152300
* ********************************************************************  27153200
*                                                                       27154100
         ORG   XPLVEC_DAT                                               27155000
XPLMRCV  DS    0X                                                       27155900
XPLMRCV_NAME   DS 1CL0008 Application Name                              27156800
XPLMRCV_SESSOK DS 1CL0004 Number of sessions successfully recovered     27157700
XPLMRCV_SESSAT DS 1CL0004 Number of session recoveries attempted        27158600
XPLMRCV_PIPEOK DS 1CL0004 Number of HPR pipes successfully recovered    27159500
XPLMRCV_PIPEAT DS 1CL0004 Number of HPR pipe recoveries attempted       27160400
XPLMRCV_RECTIM DS 1CL0008 Total recovery time                           27161300
XPLMRCV_LEN EQU *-XPLMRCV                                               27162200
         ORG   ,                                                        27163100
*                                                                       27164000
* ********************************************************************  27164900
* *                   MNPS Application Data                          *  27165800
* ********************************************************************  27166700
*                                                                       27167600
         ORG   XPLVEC_DAT                                               27168500
XPLMDTV  DS    0X                                                       27169400
XPLMDTV_NAME   DS 1CL0008 Application Name                              27170300
XPLMDTV_STRUCT DS 1CL0016 CFS structure name containing appl data       27171200
XPLMDTV_NRWRIT DS 1CL0004 Number of CFS Writes for this application     27172100
XPLMDTV_NRBYTE DS 1CL0004 Number of Bytes written to CFS                27173000
XPLMDTV_LEN EQU *-XPLMDTV                                               27173900
         ORG   ,                                                        27174800
*                                                                       27175700
* ********************************************************************  27176600
* ********************************************************************  27177500
* **********     Coupling Facility Data Vectors             **********  27178400
* ********************************************************************  27179300
* ********************************************************************  27180200
* ********************************************************************  27181100
* *                    MNPS Structure Vector                         *  27182000
* ********************************************************************  27182900
*                                                                       27183800
*                                                                       27184700
         ORG   XPLVEC_DAT                                               27185600
XPLCFMV  DS    0X                                                       27186500
XPLCFMV_NAME   DS 1CL0016 Structure Name                                27187400
XPLCFMV_SIZE   DS 1CL0004 Size, in 1K blocks, of the structure          27188300
XPLCFMV_PERCNT DS 1CL0001 Percentage of 1K blocks in use                27189200
XPLCFMV_LEN EQU *-XPLCFMV                                               27190100
         ORG   ,                                                        27191000
*                                                                       27191900
* ********************************************************************  27192800
* *             Constants for Reason For Transmission                *  27193700
* ********************************************************************  27194600
*                                                                       27195500
XPLTRAN_COLRQ EQU X'00'  Monitor requested COLLECT                      27200000
XPLTRAN_UNSOL EQU X'01'  Unsolicited notification                       27250000
XPLTRAN_SMFID EQU X'02'  SMF Interval Data                              27300000
XPLTRAN_SMFER EQU X'03'  SMF Related Errors                             27350000
*                                                                       27400000
* ********************************************************************  27450000
* *             Constants for GLOBAL Data Vectors                    *  27500000
* ********************************************************************  27550000
*                                                                       27600000
XPLMAJ_GLOBAL EQU X'0001' Global Data                                   27700000
*                                                                       27750000
* ********************************************************************  27800000
* *             Constants for Virtual Route Data                     *  27850000
* ********************************************************************  27900000
*                                                                       27950000
XPLMAJ_VR EQU  X'0002'   Virtual Route Data                             28050000
*                                                                       28057100
* ********************************************************************  28064200
* *             Constants for RTP Data                               *  28071300
* ********************************************************************  28078400
XPLMAJ_RTP EQU X'0003'   RTP Data                                       28085500
*                                                                       28086000
*                                                                       28086500
* ********************************************************************  28087000
* *             Constants for Application Data                       *  28087500
* ********************************************************************  28088000
XPLMAJ_APP EQU X'0004'   Application Data                               28088500
*                                                                       28089000
*                                                                       28089500
* ********************************************************************  28090000
* *             Constants for Coupling Facility Data                 *  28090500
* ********************************************************************  28091000
XPLMAJ_CFS EQU X'0005'   Coupling Facility Data                         28091500
*                                                                       28092600
.L0005   ANOP                                                           28100000
.P_EXIT  ANOP                                                           28150000
         MEND                                                           28200000
**/                                                                     28250000
*/* Start of PL/X Source                                             */ 28300000
*@SPACE;                                                                28350000
*/********************************************************************/ 28400000
*/*                                                                  */ 28450000
*/* MACRO-NAME: ISTXPL                                               */ 28500000
*/*                                                                  */ 28550000
*/* MACRO-ACRONYM: XPL                                               */ 28600000
*/*                                                                  */ 28650000
*/* MACRO-DESCRIPTIVE-NAME: EXIT PARAMETER LIST                      */ 28700000
*/*                                                                  */ 28750000
*/*  COPYRIGHT: LICENSED MATERIALS - PROPERTY OF IBM                 */ 28800000
*/*                                                                  */ 28850000
*/*             THIS PRODUCT CONTAINS "RESTRICTED MATERIALS OF IBM"  */ 28900000
*/*                                                                  */ 28950000
*/*             5695-117 (C) COPYRIGHT IBM CORP. 1994, 1996          */ 29000000
*/*             ALL RIGHTS RESERVED.                                 */ 29050000
*/*                                                                  */ 29100000
*/*             U.S. GOVERNMENT USERS RESTRICTED RIGHTS -            */ 29150000
*/*             USE, DUPLICATION OR DISCLOSURE RESTRICTED BY         */ 29200000
*/*             GSA ADP SCHEDULE CONTRACT WITH IBM CORP.             */ 29250000
*/*                                                                  */ 29300000
*/*             SEE COPYRIGHT INSTRUCTIONS.                          */ 29350000
*/*                                                                  */ 29400000
*/*  MACRO-FUNCTION:                                                 */ 29550000
*/*                                                                  */ 29600000
*/*       ISTXPL is a Management Services Control Block containing   */ 29650000
*/*       the information passed back to the Performance Monitor via */ 29700000
*/*       the VTAM Inline Exit Facility.                             */ 29750000
*/*                                                                  */ 29800000
*/*                                                                  */ 29850000
*/*  MACRO-BOUNDARY: DWORD                                           */ 29900000
*/*                                                                  */ 29950000
*/*  MACRO-CREATED-BY: THE USER                                      */ 30000000
*/*                                                                  */ 30050000
*/*  MACRO-LOCATION: NA                                              */ 30100000
*/*                                                                  */ 30150000
*/*  MACRO-DEPENDENCIES: AS FOLLOW                                   */ 30200000
*/*                                                                  */ 30204500
*/*       CHANGES to the XPL MUST follow the conventions set by the  */ 30209000
*/*       original desing of PMI.  They are as follows:              */ 30213500
*/*            1)  Reserved fields SHOULD NOT become defined from    */ 30218000
*/*                one release of VTAM to the next.  Within a release*/ 30222500
*/*                development cycle, flag bits and other fields not */ 30227000
*/*                allocated may be used or redefined, otherwise     */ 30231500
*/*                THEY SHOULD BE LEFT ALONE!                        */ 30236000
*/*            2)  A new fields may be appended to the vector from   */ 30240500
*/*                relase to release                             @D3A*/ 30245000
*/*                                                                  */ 30250000
*/*    REQUIRED-INNER-MAPS:  NONE                                    */ 30300000
*/*                                                                  */ 30350000
*/*    REQUIRED-BY: NONE                                             */ 30400000
*/*                                                                  */ 30450000
*/* MACRO-NOTES:                                                     */ 30500000
*/*                                                                  */ 30550000
*/*                                                                  */ 30600000
*/* MACRO_LAST-CHANGED:                                              */ 30650000
*/*                                                                  */ 30700000
*/* $MAC(ISTXPL),COMP(MGMTSVC),PROD(VTAM): Monitor Exit Parm List    */ 30750000
*/*                                                                  */ 30800000
*/* FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS            */ 30850000
*/* ---- -------- ------- ------ ------  --------------------------- */ 30900000
*/* $L0= FO@@@MST PERFMON 920511 043006: Performance Monitor         */ 30950000
*/*                                      Interface                   */ 31000000
*/* $L1= FO@DR001 PERFMON 930325 595229: BN and DLS enhancements     */ 31050000
*/* $L2= KP@@@MST PMIII   930524 595229: Multiple Monitors           */ 31100000
*/* $L3= KP@DR003 PMIII   930914 595229: SMF Enhancements            */ 31150000
*/* $L4= KP@DR009 PMIII   940228 043006: Support Level Recognition   */ 31200000
*/* $Y1= P112751  PERFMON 940325 043006: VR counts in error          */ 31250000
*/* $L5= KP@DR008 PMIII   940520 043006: Equate data field lengths   */ 31300000
*/*                                      with their source           */ 31350000
*/* $Y2= P118118  PMIII   950315 043006: Adjust XPLGSBV_XPANO length */ 31375000
*/* $D1= ID@@@MST FPAPI   950324 658994: Fast Path API for APPC      */ 31387500
*/* $D2= IP@@@MST MNPS    950714 421970: MNPS                        */ 31393700
*/* $D3= IY@@@MST HPRNW   950614 595229: HPR Network Management - PMI*/ 31396800
*/* $D4= IY@DR004 HPRNW   960424 792173: Add RTP PU name to PMI      */ 31397800
*/* $S1= P123204  MNPS    960708 421970: Strengthen boundary value   */ 31398800
*/* $S2= P123209  MNPS    960724 658994: Add vector GETSTOR data     */ 31399200
*/* $S3= P123839  MNPS    960828 226653: Remove GETSTOR vector       */ 31399600
*/*                                                                  */ 31404000
*/* Flag Reason   Release  Date   Origin    Description              */ 31408400
*/*----- -------- -------- ------ --------  ------------------------ */ 31412800
*/* $A1= OW33528  CSV2R8   990212 WAMORAN : SME HPR Pipe             */ 31417200
*/*                                         authorization            */ 31421600
*/* $  = OW39301  CSV3R10  990528 WAMORAN : Update OW33528 change    */ 31426000
*/*                                         activity to prevent      */ 31430400
*/*                                         compiler messages        */ 31434800
*/*                                                                  */ 31439200
*/*                                                                  */ 31443700
*/********************************************************************/ 31450000
*/********************************************************************/ 31500000
*/*             Parameter List Header                                */ 31550000
*/********************************************************************/ 31600000
*                                                                       31650000
*DCL                                                                    31700000
*  1 ISTXPL   BASED,                /* Monitor Exit Parameter List   */ 31750000
*    2 XPLHEAD,                     /* Control Block Header          */ 31800000
*      3 XPLHEAD_LEN   FIXED(16) BDY(BYTE), /* Entire XPL length in     31850000
*                                      bytes - includes this field,     31900000
*                                      header, and vectors           */ 31950000
*      3 XPLHEAD_HLEN  FIXED(16) BDY(BYTE), /* XPL header length in     32000000
*                                      bytes                     @L4A*/ 32050000
*      3 XPLHEAD_TRANS FIXED(8),    /* Reason for transmission   @L3C*/ 32100000
*      3 XPLHEAD_CORR  CHAR(2),     /* Correlator, PRID from CNMRU,     32150000
*                                      Zero if Unsolicited           */ 32200000
*      3 XPLHEAD_MONACBN CHAR(8),   /* Requesting monitor ACB name,     32250000
*                                      Blanks if unsolcted  @L2A @L3C*/ 32300000
*      3 XPLHEAD_FLAGS BIT(8),      /* Flag byte                 @L3A*/ 32350000
*        4 XPLHEAD_GEN   BIT(6),    /* General Use               @L3A*/ 32400000
*          5 *             BIT(5),  /* Reserved                  @L3A*/ 32450000
*          5 XPLHEAD_SMFIM BIT(1),  /* SMF Interval Missed       @L3A*/ 32500000
*        4 XPLHEAD_SEG   BIT(2),    /* Segmenting indicator      @L3A*/ 32550000
*          5 XPLHEAD_FIRST BIT(1),  /* First Segment indicator   @L3A*/ 32600000
*          5 XPLHEAD_LAST  BIT(1),  /* Last Segment indicator    @L3A*/ 32650000
*      3 XPLHEAD_TIME  CHAR(8),     /* SMF interval time stamp, ZERO    32700000
*                                      if SMFID is off           @L3A*/ 32750000
*    2 XPLHEAD_END     CHAR(0);     /* Begin First Vector            */ 32800000
*                                                                       32850000
*/********************************************************************/ 32900000
*/*                    Vector Format                                 */ 32950000
*/********************************************************************/ 33000000
*                                                                       33050000
*DCL                                                                    33100000
*  1 XPLVEC  BASED BDY(WORD),       /* Vector Format             @S1C*/ 33150000
*    2 XPLVEC_COM    CHAR(8),       /* Common Vector Format          */ 33200000
*      3 XPLVEC_LEN    FIXED(16) BDY(BYTE), /* Length of vector         33250000
*                                      including this length field   */ 33300000
*      3 XPLVEC_CAT    CHAR(6),     /* Data Type/Category            */ 33350000
*        4 XPLVEC_MAJ    CHAR(2),   /* Major Category: Global, VR,...*/ 33400000
*        4 XPLVEC_SUB    CHAR(2),   /* Data Subcategory              */ 33450000
*        4 XPLVEC_REC    CHAR(2),   /* Record Type Subcategory       */ 33500000
*    2 XPLVEC_DAT    CHAR(*);       /* Vector data                   */ 33550000
*                                                                       33600000
*                                                                       33650000
*/********************************************************************/ 33700000
*/********************************************************************/ 33750000
*/**********            GLOBAL DATA VECTORS                 **********/ 33800000
*/********************************************************************/ 33850000
*/********************************************************************/ 33900000
*                                                                       33950000
*/********************************************************************/ 34050000
*/*             Global Environment Vector                            */ 34100000
*/********************************************************************/ 34150000
*                                                                       34200000
*DCL                                                                    34250000
*  1 XPLGENV   DEFINED(XPLVEC_DAT), /* Global Environment Vector     */ 34300000
*    2 XPLGENV_TASK  CHAR(4),       /* VTAM Task Id                  */ 34350000
*      3 XPLGENV_ASCB  CHAR(4),     /* ASCB Address (MVS/ESA)        */ 34400000
*        4 XPLGENV_ID    CHAR(4),   /* Machine/Task ID (VM/ESA)      */ 34450000
*          5 XPLGENV_PCB   CHAR(4), /* PCB Address (VSE/ESA)         */ 34500000
*    2 XPLGENV_SLN   CHAR(8),       /* VTAM Start List Name          */ 34550000
*    2 XPLGENV_CFN   CHAR(8),       /* VTAM Configuration File Name  */ 34600000
*    2 XPLGENV_CRFN  CHAR(8),       /* VTAM Configuration Restart       34650000
*                                        File Name                   */ 34700000
*    2 XPLGENV_DLR   CHAR(4),       /* Current number D/L/R requests */ 34750000
*    2 XPLGENV_MDLR  CHAR(4),       /* Max number D/L/R requests since  34800000
*                                        last COLLECT CNM RU         */ 34850000
*    2 XPLGENV_MDLRE CHAR(4),       /* Max number D/L/R requests ever   34900000
*                                        used                        */ 34950000
*    2 XPLGENV_SMEAO BIT(16),       /* Session Manager Exit active      35000000
*                                        options                     */ 35050000
*      3 XPLGENV_SMEB1 BIT(8),      /* SME Bits 1                    */ 35100000
*        4 XPLGENV_IAUTH BIT(1),    /* Initial Authorized will be       35150000
*                                        processed                   */ 35200000
*        4 XPLGENV_SAUTH BIT(1),    /* Secondary Authorized will be     35250000
*                                        processed                   */ 35300000
*        4 XPLGENV_IFAF  BIT(1),    /* Init and Final Accounting        35350000
*                                        Functions will be processed */ 35400000
*        4 XPLGENV_GWPS  BIT(1),    /* Gateway Path selection will be   35450000
*                                        processed                   */ 35500000
*        4 XPLGENV_EF    BIT(1),    /* End Function will be             35550000
*                                        processed                   */ 35600000
*        4 XPLGENV_STA   BIT(1),    /* Session takeover accounting      35650000
*                                        will be processed           */ 35700000
*        4 XPLGENV_SSCPS BIT(1),    /* SSCP Selection Function will be  35750000
*                                        processed                   */ 35800000
*        4 XPLGENV_ASSCP BIT(1),    /* Adjacent SSCP Selection for      35850000
*                                        DSRLST will be processed    */ 35900000
*      3 XPLGENV_SMEB2 BIT(8),      /* SME Bits 2                    */ 35950000
*        4 XPLGENV_ELUST BIT(1),    /* Exit Functions allowed for LU    36000000
*                                        session takeover            */ 36050000
*        4 XPLGENV_IAAIO BIT(1),    /* Init Authorization allowed for   36100000
*                                        Init Other CD               */ 36150000
*        4 XPLGENV_ALIAS BIT(1),    /* Alias selection will be          36200000
*                                        processed                   */ 36250000
*        4 XPLGENV_ALS   BIT(1),    /* ALS selection will be            36300000
*                                        processed                   */ 36350000
*        4 XPLGENV_DSSIB BIT(1),    /* ALS Selection processed for      36400000
*                                        DSSIB requests              */ 36450000
*        4 XPLGENV_CDRSC BIT(1),    /* ALS Selection processed for      36500000
*                                        CDRSC requests              */ 36550000
*        4 XPLGENV_SMEMR BIT(1),    /* SME supports MODIFY REPLACE   */ 36600000
*        4 XPLGENV_VR    BIT(1),    /* VR selection will be processed*/ 36650000
*    2 XPLGENV_GEFGS BIT(8),        /* Global Environment Flags      */ 36700000
*      3 XPLGENV_SSCPG BIT(1),      /* SSCP Gateway capability       */ 36750000
*      3 XPLGENV_ANN   BIT(1),      /* APPN Network Node capability  */ 36800000
*      3 XPLGENV_AEN   BIT(1),      /* APPN End Node capability      */ 36850000
*      3 XPLGENV_ADS   BIT(1),      /* APPN DS Capability            */ 36900000
*      3 XPLGENV_AIN   BIT(1),      /* APPN Interchange Node            36950000
*                                        capability                  */ 37000000
*      3 XPLGENV_AMDH  BIT(1),      /* APPN Migration data Host         37050000
*                                        capability                  */ 37100000
*      3 XPLGENV_BNC   BIT(1),      /* Border Node capability    @L1A*/ 37150000
*      3 *             BIT(1),      /* Reserved                  @L1C*/ 37200000
*    2 XPLGENV_DSMEAO CHAR(2),      /* Directory Services Manager Exit  37250000
*                                        active options          @L1A*/ 37300000
*      3 XPLGENV_DSMEB1 BIT(8),     /* DSME Bits 1               @L1A*/ 37350000
*        4 XPLGENV_DIAUTH BIT(1),   /* Initial Authorized will be       37400000
*                                        processed               @L1A*/ 37450000
*        4 *             BIT(2),    /* Reserved                  @L1A*/ 37500000
*        4 XPLGENV_BNSO  BIT(1),    /* Border Node Selection Option     37550000
*                                        Supported               @L1A*/ 37600000
*        4 XPLGENV_DEF   BIT(1),    /* End function will be processed   37650000
*                                                                @L1A*/ 37700000
*        4 *             BIT(3),    /* Reserved                  @L1A*/ 37750000
*      3 XPLGENV_DSMEB2 BIT(8),     /* DSME Bits 2               @L1A*/ 37800000
*        4 *             BIT(6),    /* Reserved                  @L1A*/ 37850000
*        4 XPLGENV_DSMMR BIT(1),    /* DSME supports MODIFY REPLACE     37900000
*                                                                @L1A*/ 37950000
*        4 *             BIT(1),    /* Reserved             @L1A @L2C*/ 38000000
*    2 XPLGENV_TMINV  CHAR(2),      /* Tuning Statistics Timing         38050000
*                                      interval                  @L2A*/ 38100000
*    2 XPLGENV_FLGS2 BIT(8),        /* Environment flags 2       @L2A*/ 38150000
*      3 XPLGENV_TUNAC BIT(1),      /* Tuning stat is active     @L2A*/ 38200000
*      3 XPLGENV_TUNRQ BIT(1),      /* TNSTAT task attatched     @L2A*/ 38250000
*      3 XPLGENV_TUNCL BIT(1),      /* Display TUNSTAT RECORD at        38300000
*                                      Console                   @L2A*/ 38350000
*      3 *             BIT(5),      /* Reserved                  @L5C*/ 38351000
*    2 XPLGENV_DIRSZ  CHAR(4),      /* DIRSIZE start option value       38352000
*                                                           @L5A @D2C*/ 38353000
*    2 XPLGENV_SMEAO2 BIT(16),      /* Session Manager Exit active      38354000
*                                        options part II         @D2A*/ 38355000
*      3 XPLGENV_SMEB3 BIT(8),      /* SME Bits 3                @D2A*/ 38356000
*        4 XPLGENV_MNPS BIT(1),     /* MNPS Recovery calls will be      38357000
*                                      processed                 @D2A*/ 38358000
*        4 XPLGENV_HPRVR BIT(1),    /* SME supports HPR VR selection    38358200
*                                                                @A1A*/ 38358400
*        4 XPLGENV_HPROLU BIT(1),   /* SME supports HPR OLU Pipe        38358600
*                                      authorization             @A1A*/ 38358800
*        4 XPLGENV_HPRANR BIT(1),   /* SME supports HPR ANR Pipe        38359000
*                                      authorization             @A1A*/ 38359200
*        4 XPLGENV_HPRDLU BIT(1),   /* SME supports HPR DLU Pipe        38359400
*                                      authorization             @A1A*/ 38359600
*        4 *          BIT(3),       /* Reserved for SME usage    @D2A*/ 38359800
*      3 *            BIT(8),       /* Reserved for SME usage    @D2A*/ 38360000
*    2 XPLGENV_LCL_NETID   CHAR(8), /* Local Net ID              @D3A*/ 38361000
*    2 XPLGENV_LCL_CPNAME  CHAR(8), /* Local CP Name             @D3A*/ 38362000
*    2 XPLGENV_FLGS3 BIT(8),        /* Environment flags 3       @D3A*/ 38363000
*      3 XPLGENV_MNPSCAP BIT(1),    /* MNPS Capability           @D2A*/ 38364000
*      3 XPLGENV_HPRCP BIT(2),      /* HPR Support/Capability           38365200
*                                      00  HPR Not supported            38380400
*                                      01  HPR Base  support            38395600
*                                      10  HPR Tower support     @D3A*/ 38410800
*      3 *             BIT(5);      /* Reserved - to be used only at    38457200
*                                      V4R4 time!                @D3A*/ 38503600
*                                                                       38550000
*/********************************************************************/ 38600000
*/*             Global Inline Exit Vector                            */ 38650000
*/********************************************************************/ 38700000
*                                                                       38750000
*DCL                                                                    38800000
*  1 XPLGIEV   DEFINED(XPLVEC_DAT), /* Global Inline Exit Vector     */ 38850000
*    2 XPLGIEV_ENM   CHAR(8),       /* Exit Name                     */ 38900000
*    2 XPLGIEV_EMNM  CHAR(8),       /* Exit Module Name              */ 38950000
*    2 XPLGIEV_EL    CHAR(4),       /* Exit Level                    */ 39000000
*    2 XPLGIEV_ESTAT FIXED(8);      /* Exit status                   */ 39050000
*                                                                       39100000
*/********************************************************************/ 39150000
*/*             Global Storage Buffer Pool Vector                    */ 39200000
*/********************************************************************/ 39250000
*                                                                       39300000
*DCL                                                                    39350000
*  1 XPLGSBV   DEFINED(XPLVEC_DAT), /* Global Storage Buffer Pool       39400000
*                                        Vector                      */ 39450000
*    2 XPLGSBV_BPID  CHAR(4),       /* Buffer pool ID(name)          */ 39500000
*    2 XPLGSBV_SIZE  CHAR(2),       /* Size of each Buffer in Pool   */ 39550000
*    2 XPLGSBV_BASNM CHAR(4),       /* Base Num Buffers defined at      39600000
*                                        VTAM Initialization         */ 39650000
*    2 XPLGSBV_CURNM CHAR(4),       /* Current num buffers defined   */ 39700000
*    2 XPLGSBV_TOTAV CHAR(4),       /* Total num buffer available    */ 39750000
*    2 XPLGSBV_STATA CHAR(4),       /* Num static buffer available   */ 39800000
*    2 XPLGSBV_MXUSE CHAR(4),       /* Maximum num buffers in use       39850000
*                                        since last COLLECT CNM RU   */ 39900000
*    2 XPLGSBV_XSZBU CHAR(2),       /* Expansion size (buffers), same   39950000
*                                      as number buffers per extent  */ 40000000
*    2 XPLGSBV_XSZBY CHAR(4),       /* Expansion size (bytes)        */ 40050000
*    2 XPLGSBV_XTHRE CHAR(2),       /* Expansion Threshold           */ 40100000
*    2 XPLGSBV_XLIM  CHAR(4),       /* Expansion limit               */ 40150000
*    2 XPLGSBV_CTHRE CHAR(2),       /* Contraction Threshold         */ 40200000
*    2 XPLGSBV_NMEXP CHAR(4),       /* Number of Expansions          */ 40250000
*    2 XPLGSBV_SDTHR CHAR(4),       /* Slow Down Threshold           */ 40300000
*    2 XPLGSBV_NUMQR CHAR(4),       /* Num of queued requests (RPH)  */ 40350000
*    2 XPLGSBV_NMBNQ CHAR(4),       /* Num buffers needed to satisfy    40400000
*                                        queued requests             */ 40450000
*    2 XPLGSBV_MXNQR CHAR(4),       /* Maximum num of queued requests   40500000
*                                        since last COLLECT CNM RU   */ 40550000
*    2 XPLGSBV_MXNAL CHAR(4),       /* Maximum number of bytes          40600000
*                                      allocated  since last            40650000
*                                      COLLECT CNM RU                */ 40700000
*    2 XPLGSBV_ATTFL BIT(16),       /* Pool attribute flags          */ 40750000
*      3 XPLGSBV_ATTR1 BIT(8),      /* Pool attributes - Byte 1  @L4A*/ 40800000
*        4 *             BIT(1),    /* Reserved                      */ 40850000
*        4 XPLGSBV_FIXST BIT(1),    /* 1=Fixed - 0=Pageable storage  */ 40900000
*        4 XPLGSBV_FTCH  BIT(1),    /* Pool resides in fetch            40950000
*                                        protected storage           */ 41000000
*        4 *             BIT(1),    /* Reserved                      */ 41050000
*        4 XPLGSBV_BEL24 BIT(1),    /* Storage allocated below 24 bit   41100000
*                                        line                        */ 41150000
*        4 *             BIT(3),    /* Reserved                      */ 41200000
*      3 XPLGSBV_ATTR2 BIT(8),      /* Pool attributes - Byte 1  @L4A*/ 41250000
*        4 XPLGSBV_USRFX BIT(1),    /* User request fixed buffer     */ 41300000
*        4 *             BIT(7),    /* Reserved - Not Available      */ 41350000
*    2 XPLGSBV_SPNUM CHAR(2),       /* Subpool Number            @L2A*/ 41400000
*    2 XPLGSBV_BSENO CHAR(2),       /* User specified BASENO     @L2A   41430000
*                                                                @Y2C*/ 41460000
*    2 XPLGSBV_XPANO CHAR(2),       /* User specified xpand buff @L2A   41490000
*                                                                @Y2C*/ 41520000
*    2 XPLGSBV_NPXB  CHAR(4),       /* Number of Active Extents  @L2A*/ 41550000
*    2 XPLGSBV_NABIE CHAR(4);       /* Number of available buffers in   41600000
*                                        all extents             @L2A*/ 41650000
*                                                                       41700000
*/********************************************************************/ 41800000
*/*             Global Storage Private Storage Vector                */ 41850000
*/********************************************************************/ 41900000
*                                                                       41950000
*DCL                                                                    42000000
*  1 XPLGSPV   DEFINED(XPLVEC_DAT), /* Global Storage Private Storage   42050000
*                                        Vector                      */ 42100000
*    2 XPLGSPV_CURR  CHAR(4),       /* Current private storage alloc */ 42150000
*    2 XPLGSPV_MAX   CHAR(4);       /* Max private storage allocated */ 42200000
*                                                                       42250000
*/********************************************************************/ 42350000
*/*             Global Storage CSA Vector                            */ 42400000
*/********************************************************************/ 42450000
*                                                                       42500000
*DCL                                                                    42550000
*  1 XPLGSCV   DEFINED(XPLVEC_DAT), /* Global Storage CSA Vector     */ 42600000
*    2 XPLGSCV_MXCSA CHAR(4),       /* Maximum size CSA allowed      */ 42650000
*    2 XPLGSCV_MXC24 CHAR(4),       /* Max size CSA allowed below       42700000
*                                        16M line                    */ 42750000
*    2 XPLGSCV_CUCSA CHAR(4),       /* Current CSA allocated for VTAM*/ 42800000
*    2 XPLGSCV_TOTHW CHAR(4),       /* Total CSA high-water mark since  42850000
*                                        last COLLECT CNM RU         */ 42900000
*    2 XPLGSCV_TOTHT CHAR(8),       /* Timestamp for high-water mark    42950000
*                                        for Total CSA allocated     */ 43000000
*    2 XPLGSCV_TOTLW CHAR(4),       /* Total CSA low-water mark since   43050000
*                                        last COLLECT CNM RU         */ 43100000
*    2 XPLGSCV_TOTLT CHAR(8),       /* Timestamp for low-water mark     43150000
*                                        for Total CSA allocated     */ 43200000
*    2 XPLGSCV_MTOTC CHAR(4),       /* Max Total CSA ever used       */ 43250000
*    2 XPLGSCV_CUC24 CHAR(4),       /* Current CSA allocated below      43300000
*                                        16M line                    */ 43350000
*    2 XPLGSCV_C24MX CHAR(4),       /* Max CSA 24 ever used          */ 43400000
*    2 XPLGSCV_C24HW CHAR(4),       /* CSA 24 high-water mark since     43450000
*                                        last COLLECT CNM RU         */ 43500000
*    2 XPLGSCV_C24HT CHAR(8),       /* Timestamp for high-water mark    43550000
*                                        for TCSA 24 allocated       */ 43600000
*    2 XPLGSCV_C24LW CHAR(4),       /* CSA 24 low-water mark since      43650000
*                                        last COLLECT CNM RU         */ 43700000
*    2 XPLGSCV_C24LT CHAR(8);       /* Timestamp for low-water mark     43750000
*                                        for CSA 24 allocated        */ 43800000
*                                                                       43850000
*/********************************************************************/ 43950000
*/*             Global Storage GETBLK Vector                         */ 44000000
*/********************************************************************/ 44050000
*                                                                       44100000
*DCL                                                                    44150000
*  1 XPLGSGV   DEFINED(XPLVEC_DAT), /* Global Storage GETBLK Vector  */ 44200000
*    2 XPLGSGV_NAME  CHAR(8),       /* Pool Name                     */ 44250000
*    2 XPLGSGV_BLEN  CHAR(4),       /* Subpool buffer length         */ 44300000
*    2 XPLGSGV_BPPAG CHAR(2),       /* Number buffers per page       */ 44350000
*    2 XPLGSGV_PGSIZ CHAR(4),       /* Page size                     */ 44400000
*    2 XPLGSGV_BYTEU CHAR(4),       /* Number of bytes in use        */ 44450000
*    2 XPLGSGV_BUHW  CHAR(4),       /* Number of bytes in use high-     44500000
*                                        water mark since last COLLECT  44550000
*                                        CNM RU processed            */ 44600000
*    2 XPLGSGV_BUHT  CHAR(8),       /* Timestamp for number of bytes    44650000
*                                        in use high-water mark         44700000
*                                        since last COLLECT CNM RU   */ 44750000
*    2 XPLGSGV_BYTEA CHAR(4),       /* Number of bytes allocated     */ 44800000
*    2 XPLGSGV_BAHW  CHAR(4),       /* Number of bytes allocated high-  44850000
*                                        water mark since last COLLECT  44900000
*                                        CNM RU processed            */ 44950000
*    2 XPLGSGV_BAHT  CHAR(8);       /* Timestamp for number of bytes    45000000
*                                        allocated high-water mark      45050000
*                                        since last COLLECT CNM RU   */ 45100000
*                                                                       45150000
*                                                                       45293200
*/********************************************************************/ 45295900
*/*             Global Session Vector                                */ 45300000
*/********************************************************************/ 45350000
*                                                                       45400000
*DCL                                                                    45450000
*  1 XPLGSEV   DEFINED(XPLVEC_DAT), /* Global Session Vector         */ 45500000
*    2 XPLGSEV_STTAK CHAR(4),       /* Number successful LU-LU session  45550000
*                                        starts and takeovers        */ 45600000
*    2 XPLGSEV_STOP  CHAR(4),       /* Number LU-LU session stops    */ 45650000
*    2 XPLGSEV_FAIL  CHAR(4),       /* Number LU-LU session set-up      45700000
*                                        failures                    */ 45750000
*    2 XPLGSEV_ACTHW CHAR(4),       /* Number of active LU-LU sessions  45800000
*                                        high-water mark since last     45850000
*                                        COLLECT CNM RU processed    */ 45900000
*    2 XPLGSEV_ACTHT CHAR(8),       /* Timestamp for number of active   45950000
*                                        LU-LU sessions high-water mark 46000000
*                                        since last COLLECT CNM RU   */ 46050000
*    2 XPLGSEV_ACTLW CHAR(4),       /* Number of active LU-LU sessions  46100000
*                                        low-water mark since last      46150000
*                                        COLLECT CNM RU processed    */ 46200000
*    2 XPLGSEV_ACTLT CHAR(8),       /* Timestamp for number of active   46250000
*                                        LU-LU sessions low-water mark  46300000
*                                        since last COLLECT CNM RU   */ 46350000
*    2 XPLGSEV_QINIT CHAR(4),       /* Number of LU-LU sessions in      46400000
*                                        Queued Initiate status      */ 46450000
*    2 XPLGSEV_PENDR CHAR(4),       /* Number of LU-LU sessions in      46500000
*                                        Pending Reallocation status */ 46550000
*    2 XPLGSEV_PENDA CHAR(4),       /* Number of LU-LU sessions in      46600000
*                                        Pending Active status       */ 46650000
*    2 XPLGSEV_ACT   CHAR(4),       /* Number active LU-LU sessions  */ 46700000
*    2 XPLGSEV_PENDT CHAR(4),       /* Number of LU-LU sessions in      46750000
*                                        Pending Termination status  */ 46800000
*    2 XPLGSEV_DAPLU CHAR(4),       /* Number defined APPL LUs       */ 46850000
*    2 XPLGSEV_DDELU CHAR(4),       /* Number defined non-appl          46900000
*                                        dependent LUs               */ 46950000
*    2 XPLGSEV_DCDRS CHAR(4),       /* Number defined CDRSCs         */ 47000000
*    2 XPLGSEV_DPU   CHAR(4),       /* Number defined PUs            */ 47050000
*    2 XPLGSEV_AAPLU CHAR(4),       /* Number active APPLU LUs       */ 47100000
*    2 XPLGSEV_ADELU CHAR(4),       /* Number active non-appl           47150000
*                                        dependent LUs               */ 47200000
*    2 XPLGSEV_ACDRS CHAR(4),       /* Number active CDRSCs          */ 47250000
*    2 XPLGSEV_APU   CHAR(4),       /* Number active PUs             */ 47300000
*    2 XPLGSEV_RCPF  CHAR(4),       /* Number retriable CP-CP session   47350000
*                                        failures                    */ 47400000
*    2 XPLGSEV_NRCPF CHAR(4),       /* Number non-retriable CP-CP       47450000
*                                        session failures            */ 47500000
*    2 XPLGSEV_SCPIN CHAR(4),       /* Number successful CP-CP session  47550000
*                                         initiations            @L1C*/ 47600000
*    2 XPLGSEV_DLREN CHAR(4),       /* Number of DLR end nodes   @L1A*/ 47650000
*    2 XPLGSEV_DLRNN CHAR(4),       /* Number of DLR network nodes      47700000
*                                                                @L1A*/ 47750000
*    2 XPLGSEV_DLRPU CHAR(4),       /* Number of DLR served PUs  @L1A*/ 47800000
*    2 XPLGSEV_DLRLU CHAR(4),       /* Number of DLR served LUs  @L1A   47850000
*                                                                @L2C*/ 47900000
*    2 XPLGSEV_AILUS CHAR(4),       /* Number active ILUs        @L2A*/ 47950000
*    2 XPLGSEV_SRVEN CHAR(4),       /* Number of ENs served by this NN  48000000
*                                      (i.e. CP-CP session active)      48050000
*                                      INVALID when we are EN    @L2A*/ 48100000
*    2 XPLGSEV_CPSNN CHAR(4);       /* Number NN with which this NN has 48150000
*                                      CP-CP sessions, INVALID when we  48200000
*                                      are EN                    @L2A*/ 48250000
*                                                                       48300000
*/********************************************************************/ 48350000
*/*             Global APPN Directory Services Vector                */ 48400000
*/********************************************************************/ 48450000
*                                                                       48500000
*DCL                                                                    48550000
*  1 XPLGADV   DEFINED(XPLVEC_DAT), /* Global APPN Directory Services   48600000
*                                        Vector                      */ 48650000
*    2 XPLGADV_NRFLD CHAR(4),       /* Number resources found in        48700000
*                                        local database              */ 48750000
*    2 XPLGADV_NRFDS CHAR(4),       /* Number resources found from      48800000
*                                        Directory Server            */ 48850000
*    2 XPLGADV_NRFDB CHAR(4),       /* Number resources found via       48900000
*                                        domain broadcast            */ 48950000
*    2 XPLGADV_NRFNB CHAR(4),       /* Number resources found via       49000000
*                                        network broadcast           */ 49050000
*    2 XPLGADV_FSRCH CHAR(4),       /* Number of failed searches        49100000
*                                        (receive negative reply)    */ 49150000
*    2 XPLGADV_NBNCE CHAR(4),       /* Number of times network          49200000
*                                        broadcast not performed due    49250000
*                                        to negative cache entry     */ 49300000
*    2 XPLGADV_ESRRF CHAR(4),       /* Number of external search        49350000
*                                        requests - resource found   */ 49400000
*    2 XPLGADV_ESRNF CHAR(4),       /* Number of external search        49450000
*                                        requests - resource ^ found */ 49500000
*    2 XPLGADV_DSNRR CHAR(4),       /* Number referrals received     */ 49550000
*    2 XPLGADV_DSPRR CHAR(4),       /* Number positive replies received 49600000
*                                        from an Alternate Directory    49650000
*                                        Server                      */ 49700000
*    2 XPLGADV_DSNNR CHAR(4),       /* Number negative replies received 49750000
*                                        from an Alternate Directory    49800000
*                                        Server                      */ 49850000
*    2 XPLGADV_RRCGC CHAR(4),       /* Number of resources removed      49900000
*                                        from cache due to garbage      49950000
*                                        collection              @L1C*/ 50000000
*    2 XPLGADV_ADJDS CHAR(4),       /* Number of adjacent nodes in a    50050000
*                                        different subnet   @L1A @L2C*/ 50100000
*    2 XPLGADV_ROBCH CHAR(4),       /* Number of times a CHACHE entry   50150000
*                                        is discarded due to DIRSIZE    50200000
*                                        max being reached       @L2A*/ 50250000
*    2 XPLGADV_REGRS CHAR(4),       /* Number of registered resources   50300000
*                                        at a Cesntral Directory Server 50350000
*                                        or at an NN             @L2A*/ 50400000
*    2 XPLGADV_CACHE CHAR(4);       /* Number of entries in the CACHE   50450000
*                                                                @L2A*/ 50500000
*                                                                       50550000
*/********************************************************************/ 50600000
*/*         Global APPN Directory Services Border Node Vector    @L1A*/ 50650000
*/********************************************************************/ 50700000
*                                                                       50750000
*DCL                                                                    50800000
*  1 XPLGBNV   DEFINED(XPLVEC_DAT), /* Global APPN Directory Services   50850000
*                                        Border Node Vector          */ 50900000
*    2 XPLGBNV_CPNME CHAR(16),      /* Network qualified CPNAME  @L1A*/ 50950000
*      3 XPLGBNV_NETID CHAR(8),     /* Adjacent Node Network ID  @L1A*/ 51000000
*      3 XPLGBNV_NAME  CHAR(8),     /* Adjacent Node Name        @L1A*/ 51050000
*    2 XPLGBNV_SSRCH CHAR(4),       /* Number of subnet searches sent   51100000
*                                        to adjacent Node        @L1A*/ 51150000
*    2 XPLGBNV_RSRCH CHAR(4);       /* Number of subnet searches        51200000
*                                        received from ADJ node  @L1A*/ 51250000
*                                                                       51300000
*/********************************************************************/ 51350000
*/*             Global APPN Topology Data Vector                     */ 51400000
*/********************************************************************/ 51450000
*                                                                       51500000
*DCL                                                                    51550000
*  1 XPLGATV   DEFINED(XPLVEC_DAT), /* Global APPN Topology data        51600000
*                                        Vector                      */ 51650000
*    2 XPLGATV_NRTET CHAR(4),       /* Number of routes - using         51700000
*                                        existing tree               */ 51750000
*    2 XPLGATV_NRTMT CHAR(4),       /* Number of routes - using         51800000
*                                        modified tree               */ 51850000
*    2 XPLGATV_NRTNT CHAR(4),       /* Number of routes - using         51900000
*                                        new tree                    */ 51950000
*    2 XPLGATV_TDUON CHAR(4),       /* Number of TDUs originated by     52000000
*                                        this node                   */ 52050000
*    2 XPLGATV_TDUPN CHAR(4),       /* Number of TDUs propagated by     52100000
*                                        this node                   */ 52150000
*    2 XPLGATV_TDUDU CHAR(4),       /* Number of TDUs received by this  52200000
*                                        node resulting in topology     52250000
*                                        database update             */ 52300000
*    2 XPLGATV_TDUDN CHAR(4),       /* Number of TDUs received by this  52350000
*                                        node and discarded for normal  52400000
*                                        reasons                     */ 52450000
*    2 XPLGATV_TDUDR CHAR(4),       /* Number of TDUs received by this  52500000
*                                        node and discarded because is  52550000
*                                        a RSN ^ OK (rebroadcast)    */ 52600000
*    2 XPLGATV_TDUDI CHAR(4),       /* Number of TDUs received by this  52650000
*                                        node and discarded because of  52700000
*                                        data inconsistency             52750000
*                                        (rebroadcast)               */ 52800000
*    2 XPLGATV_NNTD  CHAR(4),       /* Number of network nodes in       52850000
*                                        topology database           */ 52900000
*    2 XPLGATV_ENTD  CHAR(4),       /* Number of end nodes in           52950000
*                                        topology database           */ 53000000
*    2 XPLGATV_TGTD  CHAR(4),       /* Number of TGs in topology        53050000
*                                        database                    */ 53100000
*    2 XPLGATV_TGFL  CHAR(4),       /* Number of TG failures         */ 53150000
*    2 XPLGATV_DPUAL CHAR(4),       /* Num of dynamic PU allocations */ 53200000
*    2 XPLGATV_DTCF  CHAR(4),       /* Number of trees discarded        53250000
*                                      due to Cache being full       */ 53300000
*    2 XPLGATV_NMTRE CHAR(4),       /* Number of trees           @L2C*/ 53350000
*    2 XPLGATV_VNTD  CHAR(4),       /* Number of Virtual nodes in the   53400000
*                                        topology database       @L2A*/ 53450000
*    2 XPLGATV_CDSTD CHAR(4),       /* Number Central Directory Servers 53500000
*                                        in topology database    @L2A*/ 53550000
*    2 XPLGATV_ICNCN CHAR(4),       /* Number of IC Nodes in the        53600000
*                                        topology database       @L2A*/ 53650000
*    2 XPLGATV_ENCON CHAR(4),       /* Number of ENs connected to this  53700000
*                                        node                    @L2A*/ 53750000
*    2 XPLGATV_NNCON CHAR(4),       /* Number of NNs connected to this  53800000
*                                        node                    @L2A*/ 53850000
*    2 XPLGATV_VNCON CHAR(4);       /* Number of VNs connected to this  53900000
*                                        node               @L2A @L4C*/ 53950000
*                                                                       54000000
*/********************************************************************/ 54100000
*/*             Global CSM Buffer Pool Vector                        */ 54125000
*/********************************************************************/ 54150000
*                                                                       54151000
* DCL                                                                   54153000
*  1 XPLGCBV   DEFINED(XPLVEC_DAT),  /* Global CSM Buffer Pool          54154000
*                                        Vector                  @D1A*/ 54155000
*    2 XPLGCBV_SIZE FIXED(31) BDY(BYTE), /* Buffer size                 54156000
*                                                                @D1A*/ 54157000
*    2 XPLGCBV_SRCE  FIXED(8),       /* Buffer source Flag       @S4C*/ 54158800
*    2 *             CHAR(3),        /* Not used - Available     @S4C*/ 54160600
*    2 XPLGCBV_INUSE FIXED(31) BDY(BYTE),/* Number of buffers in        54162400
*                                           pool that are inuse. @D1A*/ 54163800
*    2 XPLGCBV_FREE  FIXED(31) BDY(BYTE);/* Number of available         54165200
*                                           buffers in pool.     @D1A*/ 54166600
*                                                                       54168000
*/********************************************************************/ 54170000
*/*             Global CSM Storage Usage Vector                      */ 54171000
*/********************************************************************/ 54172000
*                                                                       54173000
* DCL                                                                   54175000
*  1 XPLGCSV   DEFINED(XPLVEC_DAT),         /* Global CSM Storage       54176000
*                                              Usage Vector      @D1C*/ 54177000
*    2 XPLGCSV_MAXFIXED FIXED(32) BDY(BYTE),/* Installation maximum     54178000
*                                              Fixed storage     @S4C*/ 54179000
*    2 XPLGCSV_CURFIXED FIXED(32) BDY(BYTE),/* Current fixed storage    54180000
*                                              in use.           @S4C*/ 54181000
*    2 XPLGCSV_MAXECSA FIXED(32) BDY(BYTE), /* Installation maximum     54182000
*                                              ECSA storage      @S4C*/ 54183000
*    2 XPLGCSV_CURECSA FIXED(32)BDY(BYTE);  /* Current ECSA storage     54184000
*                                              in use.           @S4C*/ 54185000
*                                                                       54186800
*/********************************************************************/ 54186900
*/********************************************************************/ 54195000
*/**********        VIRTUAL ROUTE DATA VECTORS              **********/ 54200000
*/********************************************************************/ 54250000
*/********************************************************************/ 54300000
*                                                                       54350000
*/********************************************************************/ 54450000
*/*                 Basic Route Data Vector                          */ 54500000
*/********************************************************************/ 54550000
*                                                                       54600000
*DCL                                                                    54650000
*  1 XPLVBRV   DEFINED(XPLVEC_DAT), /* Virtual Basic Route Data         54700000
*                                        Vector                      */ 54750000
*    2 XPLVBRV_DSTSA CHAR(4),       /* Destination Subarea           */ 54800000
*    2 XPLVBRV_TPRIO FIXED(8),      /* Transmission Priority         */ 54850000
*    2 XPLVBRV_VRNUM FIXED(8),      /* Virtual Route number          */ 54900000
*    2 XPLVBRV_ADJSA CHAR(4),       /* Adjacent Subarea              */ 54950000
*    2 XPLVBRV_ERTNM BIT(8),        /* Explicit Route number     @L5C*/ 55000000
*      3 XPLVBRV_IERNM BIT(4),      /* Initial ER number         @L5A*/ 55050000
*      3 XPLVBRV_AERNM BIT(4),      /* Actual ER number          @L5A*/ 55100000
*    2 XPLVBRV_RERNM FIXED(8),      /* Reverse Explicit Route number */ 55150000
*    2 XPLVBRV_SESVR CHAR(2),       /* Number of sessions on VR      */ 55200000
*    2 XPLVBRV_MINWS FIXED(8),      /* Current minimum window size   */ 55250000
*    2 XPLVBRV_MAXWS FIXED(8),      /* Current maximum window size   */ 55300000
*    2 XPLVBRV_DEFWS FIXED(8),      /* Default window size           */ 55350000
*    2 XPLVBRV_DFMWS FIXED(8),      /* Default maximum window size   */ 55400000
*    2 XPLVBRV_WSRES CHAR(4),       /* Number of time window size       55450000
*                                        reset to the minimum        */ 55500000
*    2 XPLVBRV_PIUWS CHAR(4),       /* Number of PIUs on the VR         55550000
*                                        waiting to be sent          */ 55600000
*    2 XPLVBRV_VRST  FIXED(8),      /* Virtual Route state       @L4C*/ 55650000
*    2 XPLVBRV_FCDATA,              /* Flow Control state data       */ 55700000
*      3 XPLVBRV_FCST  BIT(8),      /* Flow Control state        @L4C*/ 55750000
*        4 *           BIT(6),      /* Reserved                  @L4C*/ 55800000
*        4 XPLVBRV_ROUTE BIT(2),    /* Route status - 00 = blocked   */ 55850000
*                                   /*                01 = held      */ 55900000
*                                   /*                10 = open      */ 55950000
*      3 XPLVBRV_NTHLD CHAR(4),     /* Num times route in held state */ 56000000
*      3 XPLVBRV_THLDC CHAR(8),     /* Time VR has been in held state   56050000
*                                        if currently held           */ 56100000
*      3 XPLVBRV_THLDT CHAR(8),     /* Time VR has been in held state   56150000
*                                        (Total not including current   56200000
*                                         held time)                 */ 56250000
*      3 XPLVBRV_THLDM CHAR(8),     /* Time VR has been in held state   56300000
*                                        (Maximum time held for any     56350000
*                                         given instance)            */ 56400000
*      3 XPLVBRV_TMHLD CHAR(8),     /* Timestamp for Time VR has been   56450000
*                                        in held state (Maximum time    56500000
*                                        held for any given instance)*/ 56550000
*      3 XPLVBRV_NTBLK CHAR(4),     /* Number of times VR blocked    */ 56600000
*      3 XPLVBRV_TBLKC CHAR(8),     /* Time VR has been in blocked      56650000
*                                        state if currently blocked  */ 56700000
*      3 XPLVBRV_TBLKT CHAR(8),     /* Time VR has been in blocked      56750000
*                                        state (Total not including     56800000
*                                         current blocked time)      */ 56850000
*      3 XPLVBRV_TBLKM CHAR(8),     /* Time VR has been in blocked      56900000
*                                        state (Maximum time blocked    56950000
*                                        for any given instance)     */ 57000000
*      3 XPLVBRV_TMBLK CHAR(8),     /* Timestamp for Time VR has been   57050000
*                                        in blocked state (Maximum time 57100000
*                                        blocked held for any given     57150000
*                                        instance                @L2C*/ 57200000
*    2 XPLVBRV_LUSCT FIXED(15) BDY(BYTE), /* Total number of LU-LU      57250000
*                                        sessions on the VR      @L5C*/ 57300000
*    2 XPLVBRV_CPRSC FIXED(15) BDY(BYTE), /* Current pacing request     57350000
*                                        send count              @L5C*/ 57400000
*    2 XPLVBRV_CPWSZ FIXED(8),      /* Current pacing window            57450000
*                                        size                    @L5C*/ 57500000
*    2 XPLVBRV_OPIUC FIXED(32) BDY(BYTE), /* Outbound PIU count over    57550000
*                                        VR                      @Y1C*/ 57600000
*    2 XPLVBRV_IPIUC FIXED(32) BDY(BYTE); /* Inbound PIU count over     57650000
*                                        VR                      @Y1C*/ 57700000
*                                                                       57750000
*/********************************************************************/ 57758300
*/********************************************************************/ 57766600
*/**********        Rapid Transport Protocol Vectors        *****@D3A*/ 57774900
*/********************************************************************/ 57783200
*/********************************************************************/ 57791500
*                                                                       57800000
*/********************************************************************/ 57800500
*/*                   Basic RTP Data Vector                      @D3A*/ 57801000
*/* WARNING:  XPLRTPV_STATS_1 must match exactly with RPDCB_STATS_1  */ 57801200
*/********************************************************************/ 57801500
*                                                                       57802000
*DCL                                                                    57802500
*  1 XPLRTPV  DEFINED(XPLVEC_DAT),  /* Rapid Transport Protocol         57803000
*                                        Data Vector             @D3A*/ 57803500
*    2 XPLRTPV_FLAGS    BIT(16),    /* RTP Flag Bytes            @D3A*/ 57804000
*      3 XPLRTPV_PATHSWTCH BIT(1),  /* Path Switch occured       @D3A*/ 57804500
*      3 XPLRTPV_CLOSEOUT  BIT(1),  /* RTP deleted/Closeout info @D3A*/ 57805000
*      3 XPLRTPV_PSW_NAME  BIT(1),  /* Path Switch - Name CHange @D3A*/ 57805300
*      3 *                 BIT(13), /* Reserved                  @D3A*/ 57805600
*    2 XPLRTPV_LCL_NCE     BIT(64) BDY(BYTE), /* Local NCE  @D3A @D4C*/ 57805900
*    2 XPLRTPV_LCL_TCID    BIT(64) BDY(BYTE), /* Local TCID      @D3A*/ 57806500
*    2 XPLRTPV_RTP_PU      CHAR(8),           /* RTP PU Name     @D4A*/ 57806700
*    2 XPLRTPV_RMT_NETID   CHAR(8),           /* Remote Net ID   @D3A*/ 57807000
*    2 XPLRTPV_RMT_CPNAME  CHAR(8),           /* Remote CP Name  @D3A*/ 57807300
*    2 XPLRTPV_RMT_PSW_NETID   CHAR(8),       /* Remote Net ID after    57807600
*                                                Path Switch     @D3A*/ 57807700
*    2 XPLRTPV_RMT_PSW_CPNAME  CHAR(8),       /* Remote CP Name after   57807800
*                                                Path Switch     @D3A*/ 57807900
*    2 XPLRTPV_RMT_NCE     BIT(64) BDY(BYTE), /* Remote NCE @D3A @D4C*/ 57808200
*    2 XPLRTPV_RMT_TCID    BIT(64) BDY(BYTE), /* Remote TCID     @D3A*/ 57808500
*    2 XPLRTPV_RTP_STATE  FIXED(8) BDY(BYTE), /* RTP State       @D3A*/ 57809000
*    2 XPLRTPV_PSW_TIMER FIXED(32) BDY(BYTE), /* Path Switch Timer      57809500
*                                                                @D3A*/ 57810000
*    2 XPLRTPV_RTRP_DLAY FIXED(32) BDY(BYTE), /* Round Trip Delay       57810500
*                                                                @D3A*/ 57811000
*    2 XPLRTPV_STATS_1,                       /* Data segment    @D3A*/ 57811400
*      3 XPLRTPV_BYTES_SNT FIXED(32) BDY(BYTE), /* Number bytes sent    57811800
*                                                  over RTP      @D3A*/ 57812200
*      3 XPLRTPV_BYTES_RCVV FIXED(32) BDY(BYTE), /* Num. bytes received 57812600
*                                                  over RTP      @D3A*/ 57813000
*      3 XPLRTPV_PIUS_FRST FIXED(32) BDY(BYTE), /* Number 1st in segmnt 57813400
*                                                  PIUs sent     @D3A*/ 57813800
*      3 XPLRTPV_PIUS_MIDL FIXED(32) BDY(BYTE), /* Num middle in segmnt 57814200
*                                                  PIUs sent     @D3A*/ 57814600
*      3 XPLRTPV_PIUS_LAST FIXED(32) BDY(BYTE), /* Num last in segmnt   57815000
*                                                  PIUs sent     @D3A*/ 57815400
*      3 XPLRTPV_PIUS_WHOL FIXED(32) BDY(BYTE), /* Number unsegmented   57815800
*                                                  PIUs sent     @D3A*/ 57816200
*      3 XPLRTPV_PIUR_FRST FIXED(32) BDY(BYTE), /* Number 1st in segmnt 57816600
*                                                  PIUs received @D3A*/ 57817000
*      3 XPLRTPV_PIUR_MIDL FIXED(32) BDY(BYTE), /* Num middle in segmnt 57817400
*                                                  PIUs recved   @D3A*/ 57817800
*      3 XPLRTPV_PIUR_LAST FIXED(32) BDY(BYTE), /* Num last in segmnt   57818200
*                                                  PIUs received @D3A*/ 57818600
*      3 XPLRTPV_PIUR_WHOL FIXED(32) BDY(BYTE), /* Num unsegmented PIUs 57819000
*                                                  received      @D3A*/ 57819400
*      3 XPLRTPV_SNDR_CHNG FIXED(32) BDY(BYTE), /* Number times allowed 57819800
*                                                send rate chngd @D3A*/ 57822000
*      3 XPLRTPV_EPINI_PSW FIXED(16) BDY(BYTE), /* Path Switch Attempts 57822400
*                                                  Initiated by RTP     57822800
*                                                  end point     @D3A*/ 57823200
*      3 XPLRTPV_VTAMI_PSW FIXED(16) BDY(BYTE), /* Total path switch    57823600
*                                                  attempts initiated   57824000
*                                                  by this VTAM  @D3A*/ 57824400
*      3 XPLRTPV_OPCMD_PSW FIXED(16) BDY(BYTE), /* Path Switch Attempts 57824800
*                                                  due to Operator      57825200
*                                                  Command       @D3A*/ 57825600
*      3 XPLRTPV_UNSUC_PSV FIXED(16) BDY(BYTE), /* Total Unsuccessful   57826000
*                                                  Path Switch attempts 57826400
*                                                                @D3A*/ 57826800
*      3 XPLRTPV_UNSUC_PSO FIXED(16) BDY(BYTE), /* Unsuccessful Path    57827200
*                                                  Switch due to Op.    57827600
*                                                  Command       @D3A*/ 57828000
*    2 XPLRTPV_LULU_SESS_COUNT FIXED(32) BDY(BYTE), /* Count of active  57828400
*                                                  LU-LU sessions       57828800
*                                                  using the RTP @D3A*/ 57829200
*    2 XPLRTPV_TOT_BKPTM FIXED(32) BDY(BYTE), /* Time in milliseconds   57830000
*                                                back pressure has      57830500
*                                                been applied    @D3A*/ 57831000
*    2 XPLRTPV_TOT_BACKP FIXED(16) BDY(BYTE), /* Total number of times  57831100
*                                                back pressure has been 57831200
*                                                applied         @D3A*/ 57831300
*    2 XPLRTPV_PSW_BACKP FIXED(16) BDY(BYTE), /* Number of times back   57831500
*                                                pressure applied due   57832000
*                                                to path switch  @D3A*/ 57832500
*    2 XPLRTPV_QDP_BACKP FIXED(16) BDY(BYTE), /* Number of times back   57833000
*                                                pressure applied due   57833500
*                                                to queue depth         57834000
*                                                exceeded        @D3A*/ 57834500
*    2 XPLRTPV_RESNT_NLP FIXED(32) BDY(BYTE), /* Number retransmitted   57837000
*                                                NLPs            @D3A*/ 57837500
*    2 XPLRTPV_UNAK_BUFS FIXED(32) BDY(BYTE); /* Current num of unac-   57838000
*                                                knowledge buffs @D3A*/ 57838500
*/********************************************************************/ 57839000
*/*                          RTP RSCV Vector                     @D3A*/ 57839500
*/********************************************************************/ 57840000
*                                                                       57840500
*DCL                                                                    57841000
*  1 XPLRSCV  DEFINED(XPLVEC_DAT),  /* RTP RSCV Vector (see CV 2B)      57841500
*                                                                @D3A*/ 57842000
*    2 XPLRSCV_DATA      CHAR(*);   /* Actual Data for CV2B      @D3A*/ 57842500
*                                                                       57843000
*/********************************************************************/ 57843500
*/*                       RTP COS/TPF Vector                     @D3A*/ 57844000
*/********************************************************************/ 57844500
*                                                                       57845000
*DCL                                                                    57845500
*  1 XPLCOSV  DEFINED(XPLVEC_DAT),  /* RTP COS/TPF Vector  (see CV 2C)  57846000
*                                                                @D3A*/ 57846500
*    2 XPLCOSV_DATA      CHAR(*);   /* Actual Data for CV2C      @D3A*/ 57847000
*                                                                       57850000
*/********************************************************************/ 57900000
*/********************************************************************/ 57900800
*/**********           Application Data Vectors             *****@D2A*/ 57901600
*/********************************************************************/ 57902400
*/********************************************************************/ 57903200
*                                                                       57904000
*/********************************************************************/ 57904800
*/*                  MNPS Application Recovery Data              @D2A*/ 57905600
*/********************************************************************/ 57906400
*                                                                       57907200
*DCL                                                                    57908000
*  1 XPLMRCV   DEFINED(XPLVEC_DAT), /* MNPS Application Recovery        57908800
*                                      Data                      @D2A*/ 57909600
*    2 XPLMRCV_NAME   CHAR(8),      /* Application Name          @D2A*/ 57910400
*    2 XPLMRCV_SESSOK CHAR(4),      /* Number of sessions successfully  57911200
*                                      recovered                 @D2A*/ 57912000
*    2 XPLMRCV_SESSAT CHAR(4),      /* Number of session recoveries     57912800
*                                      attempted                 @D2A*/ 57913600
*    2 XPLMRCV_PIPEOK CHAR(4),      /* Number of HPR pipes successfully 57914400
*                                      recovered                 @D2A*/ 57915200
*    2 XPLMRCV_PIPEAT CHAR(4),      /* Number of HPR pipe recoveries    57916000
*                                      attempted                 @D2A*/ 57916800
*    2 XPLMRCV_RECTIM CHAR(8);      /* Total recovery time for          57917600
*                                      switching all the sessions and   57918400
*                                      pipes                     @D2A*/ 57919200
*                                                                       57920000
*/********************************************************************/ 57920800
*/*                    MNPS Application Data Vector                  */ 57921600
*/********************************************************************/ 57922400
*                                                                       57923200
*DCL                                                                    57924000
*  1 XPLMDTV   DEFINED(XPLVEC_DAT), /* MNPS Application Data     @D2A*/ 57924800
*    2 XPLMDTV_NAME   CHAR(8),      /* Application Name          @D2A*/ 57925600
*    2 XPLMDTV_STRUCT CHAR(16),     /* CFS structure name containing    57926400
*                                      this application's data   @D2A*/ 57927200
*    2 XPLMDTV_NRWRIT CHAR(4) BDY(WORD), /* Number of CFS Writes for    57928000
*                                      this application     @D2A @S1C*/ 57928800
*    2 XPLMDTV_NRBYTE CHAR(4);      /* Number of Bytes written to       57929600
*                                      CFS for this application  @D2A*/ 57930400
*                                                                       57931200
*/********************************************************************/ 57932000
*/********************************************************************/ 57932800
*/**********       Coupling Facility Data Vectors           *****@D2A*/ 57933600
*/********************************************************************/ 57934400
*/********************************************************************/ 57935200
*                                                                       57936000
*/********************************************************************/ 57936800
*/*                MNPS Coupling Facility Vector                     */ 57937600
*/********************************************************************/ 57938400
*                                                                       57939200
*DCL                                                                    57940000
*  1 XPLCFMV   DEFINED(XPLVEC_DAT), /* MNPS Coupling Facility Data      57940800
*                                                                @D2A*/ 57941600
*    2 XPLCFMV_NAME   CHAR(16),     /* Structure Name            @D2A*/ 57942400
*    2 XPLCFMV_SIZE   CHAR(4),      /* Size, in 1K blocks, of the       57943200
*                                      structure                 @D2A*/ 57944000
*    2 XPLCFMV_PERCNT CHAR(1);      /* Percentage of 1K blocks in       57944800
*                                      use                       @D2A*/ 57945600
*                                                                       57946400
*/********************************************************************/ 57947200
*/*             Constants for Reason For Transmission            @L3A*/ 57950000
*/********************************************************************/ 58000000
*                                                                       58050000
*DCL XPLTRAN_COLRQ BIT(8) CONSTANT('00'X), /* Monitor requested COLLECT 58100000
*                                                                @L3A*/ 58150000
*    XPLTRAN_UNSOL BIT(8) CONSTANT('01'X), /* Unsolicited notification  58200000
*                                                                @L3A*/ 58250000
*    XPLTRAN_SMFID BIT(8) CONSTANT('02'X), /* SMF Interval Data  @L3A*/ 58300000
*    XPLTRAN_SMFER BIT(8) CONSTANT('03'X); /* SMF Related Errors @L3A*/ 58350000
*                                                                       58400000
*/********************************************************************/ 58450000
*/*             Constants for GLOBAL Data Vectors                    */ 58500000
*/********************************************************************/ 58550000
*                                                                       58600000
*DCL XPLMAJ_GLOBAL BIT(16) CONSTANT('0001'X), /* Global Data         */ 58650000
*                                                                       58700000
*    XPLGENVID BIT(48) CONSTANT('000100010001'X), /* Global             58750000
*                                        Environment Vector          */ 58800000
*    XPLGIEXID BIT(48) CONSTANT('000100020001'X), /* Global Inline      58850000
*                                        Exit Vector                 */ 58900000
*    XPLGSBFID BIT(48) CONSTANT('000100030001'X), /* Global Storage     58950000
*                                        Buffer Pool Vector          */ 59000000
*    XPLGSPSID BIT(48) CONSTANT('000100030002'X), /* Global Storage     59050000
*                                        Private Storage Vector      */ 59100000
*    XPLGCSAID BIT(48) CONSTANT('000100030003'X), /* Global Storage     59150000
*                                        CSA Vector                  */ 59200000
*    XPLGGBLID BIT(48) CONSTANT('000100030004'X), /* Global Storage     59250000
*                                        GETBLK Vector               */ 59300000
*    XPLGSESID BIT(48) CONSTANT('000100040001'X), /* Global Session     59350000
*                                        Vector                      */ 59400000
*    XPLGADSID BIT(48) CONSTANT('000100050001'X), /* Global APPN        59450000
*                                        Directory Services Vector   */ 59500000
*    XPLGABNID BIT(48) CONSTANT('000100050002'X), /* Global APPN        59550000
*                                        Directory Services Border Node 59600000
*                                        Vector                  @L1A*/ 59650000
*    XPLGATPID BIT(48) CONSTANT('000100060001'X), /* Global APPN        59700000
*                                        Topology Data vector        */ 59750000
*    XPLGCBFID BIT(48) CONSTANT('000100070001'X), /* Global CSM         59807100
*                                        Buffer Pool Vector      @D1A*/ 59817500
*    XPLGCSSID BIT(48) CONSTANT('000100070002'X); /* Global CSM         59827900
*                                        Storage Usage Vector    @D1C*/ 59838300
*                                                                       59848800
*/********************************************************************/ 59850000
*/*             Constants for Virtual Route Data                     */ 59900000
*/********************************************************************/ 59950000
*                                                                       60000000
*DCL XPLMAJ_VR BIT(16) CONSTANT('0002'X); /* Virtual Route Data      */ 60050000
*DCL XPLVBASID BIT(48) CONSTANT('000200010001'X); /* Basic Route     */ 60100000
*                                                                       60104500
*/********************************************************************/ 60109000
*/*             Constants for RTP Data                           @D3A*/ 60113500
*/********************************************************************/ 60118000
*                                                                       60122500
*DCL XPLMAJ_RTP BIT(16) CONSTANT('0003'X); /* RTP Data           @D3A*/ 60127000
*DCL XPL_RTP_BAS BIT(48) CONSTANT('000300010001'X); /* RTP Nums  @D3A*/ 60131500
*DCL XPL_RTP_RSC BIT(48) CONSTANT('000300010002'X); /* RTP RSCV  @D3A*/ 60136000
*DCL XPL_RTP_COS BIT(48) CONSTANT('000300010003'X); /* RTP COS   @D3A*/ 60140500
*                                                                       60145000
*/********************************************************************/ 60145200
*/*             Constants for Application Data                   @D2A*/ 60145400
*/********************************************************************/ 60145600
*                                                                       60145800
*DCL XPLMAJ_APP BIT(16) CONSTANT('0004'X); /* Application Data   @D2A*/ 60146000
*DCL XPL_APP_MRCID BIT(48) CONSTANT('000400010001'X); /* MNPS appl      60146200
*                                        recovery data           @D2A*/ 60146400
*DCL XPL_APP_MDTID BIT(48) CONSTANT('000400010002'X); /* MNPS appl      60146600
*                                        data                    @D2A*/ 60146800
*                                                                       60147000
*/********************************************************************/ 60147200
*/*             Constants for Coupling Factility Data            @D2A*/ 60147400
*/********************************************************************/ 60147600
*                                                                       60147800
*DCL XPLMAJ_CFS BIT(16) CONSTANT('0005'X); /* Coupling Facility Data    60148000
*                                                                @D2A*/ 60148200
*DCL XPL_CFS_CFMID BIT(48) CONSTANT('000500010001'X); /* MNPS coupling  60148400
*                                        facility data           @D2A*/ 60148600
*                                                                       60148800
*/* End of PL/X Source                                               */ 60150000
