*        %GOTO CTEPLS1;             /* PLS modules use PLS version      00007100
         MACRO                                                          00014200
         ITTCTE                                                         00021300
         AGO    .CTE1                                                */ 00028400
*%CTEPLS1: ;                        /*                                  00035500
.CTE1    ANOP                                                        */ 00042600
*/* START OF SPECIFICATIONS ******************************************* 00050000
*                                                                       00100000
*01* MACRO-NAME:  ITTCTE                           MACDATE(87/09/09)<0> 00150000
*                                                                       00200000
*01* DESCRIPTIVE-NAME:  Component Trace Element                         00233300
*02*   ACRONYM:         CTE                                             00266600
*                                                                       00300000
*01* DSECT NAME:     CTE                                                00325000
*01* COMPONENT NAME: Component Trace (SCTRC)                            00350000
*01* EYE CATCHER:    None                                               00375000
*                                                                       00400000
*01* PROPRIETARY STATEMENT:                                             00450000
*                                                                       00500000
*   LICENSED MATERIALS - PROPERTY OF IBM                                00550000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                         00600000
*   5695-047 (C) COPYRIGHT IBM CORP. 1988, 1990                         00650000
*   SEE COPYRIGHT INSTRUCTIONS                                          00700000
*                                                                       00750000
*01* STATUS: HBB4420                                                    00800000
*                                                                       00850000
*01* FUNCTION:                                                          00900000
*       'CTE's are created by individual component traces and           00950000
*       contain component specific trace information in                 01000000
*       key-length-data format.                                         01050000
*                                                                       01150000
*                                                                       01154100
*01* POINTED TO BY:    User components' component trace base            01158200
*                                                                       01162300
*01* CREATED BY:       User component traces                            01166400
*01* INITIALIZED BY:   User component traces                            01170500
*01* DELETED BY:       User component traces                            01174600
*                                                                       01178700
*                                                                       01182800
*01* STORAGE ATTRIBUTES:                                                01186900
*                                                                       01191000
*02*   FREQUENCY:      One for each trace entry                         01195100
*02*   SUBPOOL:        Determined by the user component                 01199200
*02*   KEY:            Determined by the user component                 01203300
*02*   RESIDENCY:      Determined by the user component                 01207400
*02*   SIZE:           Variable < 64K bytes on a halfword boundry.      01211500
*                                                                       01215600
*             WARNING: The size of the CTEVDATA area should not         01219700
*                      exceed 60K bytes. This is to allow for future    01223800
*                      expansions of the fixed portions of the CTE.     01227900
*                                                                       01232000
*01* SERIALIZATION  : determined by the user component                  01236100
*                                                                       01240200
*01* METHOD OF ACCESS:                                                  01244300
*       BAL         : ITTCTE                                            01250000
*       PL/X        : %Include ITTCTE                                   01300000
*                                                                       01350000
*                                                                       02000000
*01* CHANGE ACTIVITY:                                                   02050000
*       $L0=DATASPAC,HBB3310,870227,PDAC: Component Trace               02333300
*       $01=OY16008 ,HBB4410,900402,PD34EW: change distlib - no code    02366600
*       $L1=CTWTR016,HBB4420,900813,PD34G1: CTrace Writer Support       02383300
*       $P1=PH32058 ,HBB4420,910104,PD34EY: SHOWHDR format complete     02391600
*                                                                       02400000
*** END OF SPECIFICATIONS ********************************************/ 02450000
*        %GOTO CTEPLS2;             /*                                  02500000
CTE      DSECT                                                          02550000
CTEFDATA DS    CL16                  * Fixed length portion             02600000
         ORG   CTEFDATA                                                 02650000
CTEPROG  DS    CL4                   * Prologue                         02700000
         ORG   CTEPROG                                                  02750000
CTELENP  DS    H                     * CTE length in bytes              02800000
CTEOFF   DS    H                     * Offset to CTEVDATA from CTE      02850000
CTECDATA DS    CL12                  * Common portion of CTE            02900000
         ORG   CTECDATA                                                 02950000
CTEFMTID DS    XL4                   * Format id key                    03000000
CTETIME  DS    XL8                   * Time stamp                       03050000
CTEVDATA DS    0H                    * Variable portion, 64k byte limit 03100000
         SPACE                                                          03150000
CTEEPLG  DSECT                                                          03200000
CTELENE  DS    H                     * CTE epilog used to place the     03250000
*                                      halword length at the end of     03300000
*                                      the CTE                          03350000
         MEND                                                      , */ 03400000
*%CTEPLS2: ;                                                            03450000
*   DECLARE                                                             03500000
*     1    CTE      BDY(HWORD) BASED, /* component trace element     */ 03550000
*       3    CTEFDATA,              /* fixed length portion          */ 03600000
*         5    CTEPROG,             /* prologue                      */ 03650000
*           7    CTELENP  FIXED(16), /* 'CTE' length in bytes        */ 03700000
*           7    CTEOFF   FIXED(16), /* offset to 'CTEVDATA' from       03750000
*                                      beginning of 'CTE'            */ 03800000
*         5    CTECDATA,            /* common portion of 'CTE'       */ 03850000
*           7    CTEFMTID BIT(32),  /* format id key                 */ 03900000
*           7    CTETIME  BIT(64),  /* time stamp                    */ 03950000
*       3    CTEVDATA CHAR(*);      /* variable portion, 64K byte       04000000
*                                      limit                         */ 04050000
*   DECLARE                                                             04100000
*     1    CTEEPLG  BDY(HWORD) BASED, /* 'CTE' epilog used to place     04150000
*                                      the halfword length at at the    04200000
*                                      end of the 'CTE'. This           04250000
*                                      structure should be based on     04300000
*                                      ADDR(CTE)+CTELENP                04350000
*                                      -LENGTH(CTEEPLG) after CTELENP   04400000
*                                      has been determined           */ 04450000
*       3    CTELENE  FIXED(16);    /* 'CTE' length in bytes         */ 04500000
