*                                                                       00050000
*        %GOTO TBWCL1;  /*                                              00100000
         MACRO                                                          00150000
         ITTTBWC &DSECT=YES,&LIST=NO                                    00200000
**/                                                                     00250000
*%TBWCL1 : ;                                                            00300000
*/* START OF SPECIFICATIONS ******************************************* 00350000
*                                                                       00400000
*01* MACRO NAME: ITTTBWC                          MACDATE(90/07/12)<1>  00450000
*                                                                       00500000
*01* DESCRIPTIVE-NAME: CTRACE Trace Buffer Writer Control area          00550000
*                                                                       00600000
*02*   DSECT NAME:  TBWC                                                00650000
*02*   ACRONYM:     TBWC                                                00700000
*02*   EYE CATCHER: None                                                00750000
*                                                                       00800000
*01* PROPRIETARY STATEMENT:                                             00850000
*                                                                       00900000
*      LICENSED MATERIALS - PROPERTY OF IBM                             00950000
*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      01000000
*      5695-047 (C) COPYRIGHT IBM CORPORATION  1991                     01050000
*      SEE COPYRIGHT INSTRUCTIONS.                                      01100000
*                                                                       01150000
*01* STATUS: HBB4420                                                    01200000
*                                                                       01250000
*01* FUNCTION:                                                          01300000
*      The TBWC is used as the communication area between the           01350000
*      exploiting component and CTrace.  This area indicates the        01400000
*      status of a particular trace buffer.                             01450000
*                                                                       01500000
*01* POINTED TO BY: Private pointer (or data register), in containing   01550000
*                   module.                                             01600000
*                                                                       01650000
*01* CREATED BY:    The TBWC is created by the component that is using  01700000
*                   the CTRACE writer services.                         01750000
*                                                                       01800000
*01* FREED BY:      The TBWC is freed by the same component, after      01850000
*                   the component disconnects from the CTRACE writer.   01900000
*                                                                       01950000
*01* STORAGE ATTRIBUTES:                                                02000000
*02*   FREQUENCY:   One per trace buffer                                02050000
*02*   SUBPOOL:     Determined by component                             02100000
*02*   KEY:         Determined by component                             02150000
*02*   RESIDENCY:   Determined by component                             02200000
*02*   SIZE:        8 bytes                                             02250000
*                                                                       02300000
*01* SERIALIZATION: None                                                02350000
*                                                                       02400000
*01* INVOCATION:   PL/AS ---> %INCLUDE SYSLIB(ITTTBWC)                  02450000
*                  BAL   ---> ITTTBWC                                   02500000
*                                                                       02550000
*01* METHOD OF ACCESS:                                                  02600000
*                                                                       02650000
*      PL/AS - TBWC is declared as based on TBWCPTR.                    02700000
*      PL/AS listing - specify %IHALIST='YES' before %INCLUDE.          02750000
*                                                                       02800000
*      BAL   - Using on TBWC gives addressability for all symbols.      02850000
*      BAL listing   - specify LIST=YES on macro invocation.            02900000
*                                                                       02950000
*01* MODULE TYPE:  Bilingual macro                                      03000000
*                                                                       03050000
*02*   PROCESSOR:  PL/AS or ASSEMH                                      03100000
*                                                                       03150000
*01* COMPONENT NAME:  CTRACE (SCTRC)                                    03200000
*                                                                       03250000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      03300000
*                                                                       03350000
*** END OF SPECIFICATIONS ********************************************/ 03400000
*%GOTO TBWCL2;  /*                                                      03450000
.*                                                                      03500000
.*********************************************************************  03550000
.*                                                                      03600000
.*01* CHANGE ACTIVITY:                                                  03650000
.*      $L0=CTWTR015,HBB4420,900712,PD34G1: CTrace Writer Support       03700000
.*                                                                      03750000
.*********************************************************************  03800000
.*                                                                      03850000
         PUSH  PRINT                                                    03900000
         AIF   ('&LIST' EQ 'YES').TBWCLST                               03950000
         PRINT OFF                                                      04000000
.TBWCLST ANOP                                                           04050000
         SPACE 1                                                        04100000
         AIF ('&DSECT' EQ 'NO').TBWC10                                  04150000
TBWC     DSECT ,                       Ctrace trace buffer writer       04200000
*                                        control area                   04250000
         AGO .TBWC20                                                    04300000
.TBWC10  ANOP                                                           04350000
         DS    0D                                                       04400000
TBWC     EQU   *                       Ctrace trace buffer writer       04450000
*                                        control area                   04500000
.TBWC20  ANOP                                                           04550000
TBWCUSRF DS    XL1                     Flags set by the user of         04600000
*                                        CTRACEWR                       04650000
TBWCUTRC EQU   X'80'                   =1 Component is tracing in the   04700000
*                                        trace buffer                   04750000
TBWCUFUL EQU   X'40'                   =1 Trace buffer is full          04800000
TBWCCTRF DS    XL1                     Flags set by CTRACEWR and        04850000
*                                        cleared by the user            04900000
TBWCCCAP EQU   X'80'                   =1 CTRACEWR is in the process    04950000
*                                        of capturing the trace buffer  05000000
TBWCCAVL EQU   X'40'                   =1 The trace buffer has been     05050000
*                                        captured and is now available  05100000
*                                        to be filled again             05150000
TBWCRSN  DS    XL2                     Reason code.  Non-zero when      05200000
*                                        CTRACE determines that the     05250000
*                                        buffer is being reused before  05300000
*                                        it is captured.                05350000
TBWCSEQ  DS    F                       This sequence number is          05400000
*                                        incremented each time the      05450000
*                                        component starts to fill the   05500000
*                                        trace buffer                   05550000
TBWCEND  DS    0D -                    End of TBWC                      05600000
         POP   PRINT                                                    05650000
         MEND  , -    */                                                05700000
*%TBWCL2 : ;                                                            05750000
*                                                                       05800000
*  @LISTPUSH;                                                           05850000
*  %IF IHALIST='YES' %THEN                                              05900000
*     %GOTO TBWCLST;                                                    05950000
*  @LISTOFF;                                                            06000000
*  %TBWCLST:;                                                           06050000
*                                                                       06100000
*   DECLARE                                                             06150000
*     1    TBWC   BASED BDY(DWORD), /* Ctrace trace buffer writer       06200000
*                                      control area                  */ 06250000
*       3    TBWCUSRF BIT(8),       /* Flags set by the user of         06300000
*                                      CTRACEWR                      */ 06350000
*         5    TBWCUTRC BIT(1),     /* =1 Component is tracing in the   06400000
*                                      trace buffer                  */ 06450000
*         5    TBWCUFUL BIT(1),     /* =1 Trace buffer is full       */ 06500000
*       3    TBWCCTRF BIT(8),       /* Flags set by CTRACEWR and        06550000
*                                      cleared by the user           */ 06600000
*         5    TBWCCCAP BIT(1),     /* =1 CTRACEWR is in the process    06650000
*                                      of capturing the trace buffer */ 06700000
*         5    TBWCCAVL BIT(1),     /* =1 The trace buffer has been     06750000
*                                      captured and is now available    06800000
*                                      to be filled again            */ 06850000
*       3    TBWCRSN  CHAR(2),      /* Reason code.  Non-zero when      06900000
*                                      CTRACE determines that the       06950000
*                                      buffer is being reused before    07000000
*                                      it is captured.               */ 07050000
*       3    TBWCSEQ  FIXED(32),    /* This sequence number is          07100000
*                                      incremented each time the        07150000
*                                      component starts to fill the     07200000
*                                      trace buffer                  */ 07250000
*       3    TBWCEND CHAR(0) BDY(DWORD); /* End of TBWC              */ 07300000
*                                                                       07350000
*  @LISTPOP;                                                            07400000
