*/********************************************************************/ 00050000
*/*                                                                  */ 00100000
*/*  MACRO-NAME: IVTSTATA                                            */ 00150000
*/*                                                                  */ 00200000
*/*  MACRO-DESCRIPTIVE-NAME: CSM RESOURCE STATUS AREA MAPPING        */ 00250000
*/*                                                                  */ 00300000
*/*  COPYRIGHT = LICENSED MATERIALS - PROPERTY OF IBM                */ 00350000
*/*                                                                  */ 00400000
*/*              THIS PRODUCT CONTAINS                               */ 00433300
*/*              "RESTRICTED MATERIALS OF IBM"                       */ 00466600
*/*                                                                  */ 00500000
*/*              5685-085 (C) COPYRIGHT IBM CORP.                    */ 00550000
*/*              1996. ALL RIGHTS RESERVED.                          */ 00600000
*/*                                                                  */ 00650000
*/*              U.S. GOVERNMENT USERS RESTRICTED RIGHTS -           */ 00700000
*/*              USE, DUPLICATION OR DISCLOSURE RESTRICTED           */ 00750000
*/*              BY GSA ADP SCHEDULE CONTRACT WITH IBM CORP.         */ 00800000
*/*                                                                  */ 00850000
*/*              SEE COPYRIGHT INSTRUCTIONS.                         */ 00900000
*/*                                                                  */ 00950000
*/*  MACRO-FUNCTION: TO PROVIDE A MAPPING FOR THE AREA POINTED TO    */ 01000000
*/*                  BY THE STATAREA PARAMETER ON AN IVTCSM          */ 01050000
*/*                  RESOURCE_STATS REQUEST.                         */ 01100000
*/*                                                                  */ 01150000
*/*  MACRO-NOTES:  NONE                                              */ 01200000
*/*                                                                  */ 01250000
*/*  $MAC(IVTSTATA),COMP(CSM),PROD(VTAM): CSM RESOURCE STATUS AREA   */ 01300000
*/*                                                                  */ 01350000
*/*  FLAG REASON   RELEASE DATE   ORIGIN  FLAG DESCRIPTORS           */ 01400000
*/*  ---- -------- ------- ------ ------  ---------------------      */ 01450000
*/*  $D0= ID@@@MST FPAPI   950206 143576: Fastpath API for APPC      */ 01500000
*/*  $S1= P119992  FPAPI   951213 143576: Add eyecatcher             */ 01550000
*/*  $S2= P120325  FPAPI   951215 984146: Storage constraint DR      */ 01575000
*/********************************************************************/ 01600000
*@LISTPUSH;                         /*                               */ 01650000
*@LISTOFF;                          /*                               */ 01700000
*                                   /* Bilingual header                 01750000
         MACRO                                                          01800000
         IVTSTATA                                                       01850000
IVTSTATA DSECT                         CSM resource status area         01884200
STATA_ACRO  DS    CL4                  Eyecatcher 'STAT'         @S1A   01901300
STATA_LEN   DS    XL2                  Number of bytes of resource      01918400
*                                        statistics                     01952600
STATA_FLAG  DS    X                    Status flag                      01986800
STATA_ESTAT EQU   X'C0'                ECSA storage status              02021000
STATA_ECRIT EQU   X'80'                ECSA storage critical            02055200
STATA_ECONS EQU   X'40'                ECSA storage constrained         02089400
*                                                                       02123600
STATA_DSTAT EQU   X'30'                Data space storage status        02157800
STATA_DCRIT EQU   X'20'                Data space storage               02192000
*                                      critical                         02226200
STATA_DCONS EQU   X'10'                Data space storage               02260400
*                                      constrained                      02294600
*                                                                       02328800
STATA_FSTAT EQU   X'0C'                Fixed storage status             02363000
STATA_FCRIT EQU   X'08'                Fixed storage critical           02397200
STATA_FCONS EQU   X'04'                Fixed storage constrained        02431400
            DS    X                    Reserved                         02465600
         MEND                                                        */ 02500000
*@LISTPOP;                          /* Begin PL/X mapping            */ 02550000
*                                                                       02600000
*   DCL                                                                 02650000
*     1 IVTSTATA BDY(WORD) BASED,   /* CSM resource status area      */ 02700000
*      2 STATA_ACRO CHAR(4),        /* Eyecatcher 'STAT'         @S1A*/ 02725000
*      2 STATA_LEN FIXED(15),       /* Number of bytes of resource      02750000
*                                      statistics                    */ 02800000
*      2 STATA_FLAG  BIT(8),        /* Status flag                   */ 02850000
*        3 STATA_ESTAT BIT(2),      /* ECSA storage status           */ 02900000
*          4 STATA_ECRIT BIT(1) ABNL,/* ECSA storage critical    @S2C*/ 02950000
*          4 STATA_ECONS BIT(1) ABNL,/* ECSA storage constrained @S2C*/ 03000000
*        3 STATA_DSTAT BIT(2),      /* Data space storage status     */ 03050000
*          4 STATA_DCRIT BIT(1),    /* Data space storage critical      03100000
*                                                                    */ 03150000
*          4 STATA_DCONS BIT(1),    /* Data space storage constrained   03200000
*                                                                    */ 03250000
*        3 STATA_FSTAT BIT(2),      /* Fixed storage status          */ 03300000
*          4 STATA_FCRIT BIT(1) ABNL, /* Fixed storage critical  @S2C*/ 03337500
*          4 STATA_FCONS BIT(1) ABNL, /* Fixed storage constrained      03375000
*                                                                @S2C*/ 03412500
*        3 *           BIT(2),      /* Reserved                      */ 03450000
*      2 *        CHAR(1);          /* Reserved                      */ 03500000
