*                                                                       00050000
*        %              /*                                              00100000
         MACRO                                                          00150000
         IWMPB    ,        */                                           00200000
* IWMPB10 : ;                                                           00250000
*/* START OF SPECIFICATIONS ******************************************* 00300000
*                                                                       00350000
* ***PROPRIETARY_STATEMENT********************************************* 00400000
***01* PROPRIETARY STATEMENT=                                         * 00450000
*                                                                     * 00500000
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00600000
*   "RESTRICTED MATERIALS OF IBM"                                     * 00650000
*   5647-A01 (C) COPYRIGHT IBM CORP. 1993, 2000                       * 00700000
*                                                                     * 00800000
*   STATUS= JBB6609                                                   * 00850000
*                                                                     * 00900000
*  **END_OF_PROPRIETARY_STATEMENT*************************************/ 00950000
*/*                                                                     01000000
* EXTERNAL CLASSIFICATION:                                              01050000
* DMTI: BASE                                                            01100000
* GUPI: INCLUDE                                                         01150000
* END OF EXTERNAL CLASSIFICATION:                                       01200000
*                                                                       01250000
* MACRO NAME: IWMPB                                                     01300000
*                                                                       01350000
* DESCRIPTIVE NAME: Performance Block for IWM Work Manager and          01400000
*                   Delay Monitoring Services                           01450000
*                                                                       01500000
* DSECT NAME: PB                                                        01650000
*                                                                       01700000
* COMPONENT: Workload Manager (SCWLM)                                   01750000
*                                                                       01800000
* FUNCTION: Provides a mapping of the data area for users of IWM        01950000
*           services and exits.                                         02000000
*                                                                       02050000
* METHOD-OF-ACCESS:                                                     02100000
*                                                                       02150000
*   PLAS: %INCLUDE SYSLIB(IWMPB)                                        02200000
*   ASM:  IWMPB                                                         02250000
*                                                                       02300000
* POINTED-TO-BY: PBDE_PBPTR                                             02350000
*                                                                       02400000
* CREATED-BY: IWMMCREA service routine                                  02450000
*                                                                       02500000
* DELETED-BY: IWMMDELE service routine                                  02550000
*                                                                       02600000
* SIZE: 224 bytes                                            @WLMPBPM   02650000
*                                                                       02700000
* EYE-CATCHER: PB  (padded on the right with two blanks)                02750000
*  OFFSET:   0                                                          02800000
*  LENGTH:   4                                                          02850000
*                                                                       02900000
* STORAGE-ATTRIBUTES:                                                   02950000
*                                                                       03000000
*   ALLOCATION-METHOD: STORAGE OBTAIN                                   03050000
*                                                                       03100000
*   SUBPOOL/DATASPACE: Subpool 228 when key 0-7                         03150000
*                      Subpool 230 when key 8-F (and page-fixed)        03200000
*                                                                       03250000
*   KEY: Specified on IWMMCREA                                          03300000
*                                                                       03350000
*   FREQUENCY: One per successful invocation of IWMMCREA                03400000
*                                                                       03450000
* SERIALIZATION: Responsibility of the user of the monitoring token     03500000
*                returned by IWMMCREA                                   03550000
*                                                                       03600000
* DEPENDENCIES: SRM sampling code uses an instruction which can only    03650000
*               address 256 bytes.                                      03700000
*               If the performance block grows larger than 256 bytes,   03750000
*               IRASASRV will need to be recoded.                       03800000
*                                                                       03850000
* NOTES: If the length of PB_CLEAR changes, then the macros IWMMRELA    03866600
*        and IWMMINIT may need to change. The generated code for        03883200
*        clearing out PB_CLEAR does not handle lengths greater than     03899800
*        256 bytes. When adding code in IWMMRELA to clear out           03916400
*        PB_CLEAR, ensure that IWMX2REL's dynamic area is not used.     03933000
*                                                                       03950000
*---------------------------------------------------------------------- 03966600
*                                                                       03983200
* CHANGE-ACTIVITY:                                                      04000000
*                                                                       04025000
*   $L0=WLMI     HBB5510  920309  PD16:  Workload Manager I             04050000
*   $P1=PIG7002  HBB5510  920420  PD16:  SourceLU                       04100000
*   $P2=PIG7009  HBB5510  921102  PD16:  PB_CLEAR length                04150000
*   $L1=WLMI     HBB5510  930503  PDD0:  Workload Manager I             04200000
*   $T1=PIG5048  HBB5510  940117  PDD0:  OW01260 Fix Prolog             04225000
*   $WLMPBPM     HBB6603  950213  PD16:  New waiting states and         04230000
*                                        size change 200 -> 224         04235000
*   $WLMPENH     HBB6603  951201  PD16:  New Latch waiting state        04240000
*   OW26040      HBB6603  970403  PDSN:  Add length field in header     04242500
*   $PWA0230     JBB6607  980619  PDKN:  Add warning in Notes section   04243300
*                                        of prolog                      04244100
*   $TTRACE      JBB6609  980904  PDDA:  Tak Chin                       04244400
*                                        Transaction Trace              04244700
*                                                                       04245000
*END OF SPECIFICATIONS ***********************************************/ 04250000
*%      /*                                                              04300000
*                                                                       04350000
PB       DSECT                                                          04400000
         DS    0D                                                       04450000
PB_CREATE     DS   CL32     Space reserved for Create attributes        04500000
         ORG PB_CREATE                                                  04550000
PB_ID_VERSION DS   CL5      Space for id and version information        04600000
         ORG PB_ID_VERSION                                              04650000
PB_ID         DS   CL4      Space for id                                04700000
PB_ID_CONST   EQU  C'PB  '  Performance block eye catcher constant      04750000
PB_VERSION    DS   BL1      Space for version information               04800000
PB_VERSION1   EQU  1        Performance block version 1. 1=HBB5510,     04816600
*                           HBB5520                            @WLMPBPM 04833200
PB_VERSION2   EQU  2        Performance block version 2. 2=HBB6603.     04849800
*                                                              @WLMPBPM 04866400
PB_VERSION3   EQU  3        Performance block version 3. 2=JBB6609.     04876100
*                                                              @TTRACE  04885800
PB_CURRENT_VERSION EQU  3   Performance block current version  @TTRACE  04895500
PB_RSVD0005   DS   CL1      Reserved space                     @OW26040 04905300
PB_NEW_LENGTH DS   BL2      Length of PB_CLEAR. See Notes section in    04916400
*                           prolog if you are changing the length of    04927500
*                           PB_CLEAR                           @PWA0230 04938600
PB_SUBSYS_TYPE DS   CL4     Subsystem type                              04950000
PB_SUBSYSNM   DS   CL8      Subsystem name                              05000000
PB_MIRROR_PTR DS   AL4      PB Mirror pointer                      @L1A 05050000
         ORG PB_MIRROR_PTR                                         @L1A 05100000
PB_MIRROR_TKN DS   BL4      Token for control information               05150000
PB_RSVD0018   DS   CL8      Reserved space                              05200000
PB_CLEAR_FLD  DS   0CL1     Origin of area to be cleared for reuse @P2A 05250000
         ORG PB_CLEAR_FLD                                               05300000
PB_OWNER_DATA DS   BL4      Data specified by user/owner                05350000
PB_OWNER_TKN  DS   BL4      Token specified by user/owner               05400000
              DS   0D       PB_ARRTIME should be on a dwd boundary      05450000
PB_ARRTIME    DS   BL8      Arrival time for work request               05500000
              DS   0D       PB_EXSTARTTIME should be on a dwd boundary  05550000
PB_EXSTARTTIME    DS   BL8      Execution start time for work request   05600000
PB_DU_ASCB    DS   AL4      Address of ASCB associated with the         05650000
*                           dispatchable unit serving the work request  05700000
PB_DU         DS   AL4      Address of TCB associated with the          05750000
*                           dispatchable unit serving the work request  05800000
*                           or 1 signifying an SRB                      05850000
PB_DU_SRB        EQU 1      DU is associated with an SRB                05900000
PB_SRB_SAMEDU_NO EQU 1      DU is associated with an SRB distinct from  05950000
*                           the parent                                  06000000
PB_SRB_SAMEDU_YES EQU 3     DU is associated with same SRB as parent    06050000
*                                                                       06100000
PB_RSVD0040   DS   CL1      Reserved space                              06150000
PB_STATE      DS   BL1      State of the work request                   06200000
PB_STATE_FREE    EQU  X'00' State is free - PB not associated with a    06250000
*                           work request                                06300000
PB_STATE_ACTIVE  EQU  X'01' State is active - work request associated   06350000
*                           with the PB is active (running on a CP)     06400000
PB_STATE_READY   EQU  X'02' State is ready - work request associated    06450000
*                           with the PB is ready (could run on a CP     06500000
*                           if another program were not running)        06550000
PB_STATE_IDLE    EQU  X'03' State is idle - no work request is          06600000
*                           available to the work manager that it is    06650000
*                           allowed to run                              06700000
PB_STATE_WAITING_BUFFER_POOL_IO EQU  X'F1'                  @WLMPBPM    06703800
*                           State is waiting on an IO due to a          06707600
*                           buffer pool miss                            06711400
PB_STATE_WAITING_BUFFER_POOL_CF EQU  X'F2'                  @WLMPBPM    06715200
*                           State is waiting on an CF access due to a   06719000
*                           buffer pool miss                            06722800
PB_STATE_WAITING_BUFFER_POOL_CF_IO EQU  X'F3'               @WLMPBPM    06726600
*                           State is waiting on an IO due to a          06730400
*                           buffer pool miss and a CF miss              06734200
PB_STATE_WAITING_CF_IO EQU  X'F4'                          @WLMPBPM     06738000
*                           State is waiting on an IO due to a          06741800
*                           CF miss                                     06745600
PB_STATE_WAITING_DISTRIB   EQU  X'F5'                                   06750000
*                           State is waiting on a distributed request   06800000
PB_STATE_WAITING_TIMER     EQU  X'F6'                                   06850000
*                           State is waiting on a timer                 06900000
PB_STATE_WAITING_LATCH     EQU  X'F7'                                   06950000
*                           State is waiting on a latch     @WLMPENH    07000000
PB_STATE_WAITING_CONV      EQU  X'F8'                                   07050000
*                           State is waiting on a conversation          07100000
PB_STATE_WAITING_SESS_LOCALMVS EQU     X'F9'                            07150000
*                           State is waiting to establish a session     07200000
*                           somewhere in the same MVS image             07250000
PB_STATE_WAITING_SESS_SYSPLEX EQU     X'FA'                             07300000
*                           State is waiting to establish a session     07350000
*                           somewhere in the sysplex                    07400000
PB_STATE_WAITING_SESS_NETWORK EQU     X'FB'                             07450000
*                           State is waiting to establish a session     07500000
*                           somewhere in the network                    07550000
PB_STATE_WAITING_OTHER_PRODUCT EQU  X'FC'                               07600000
*                           State is waiting on another product         07650000
PB_STATE_WAITING_MISC EQU  X'FD' State is waiting on some unidentified  07700000
*                           resource, possibly one of the other defined 07750000
*                           waiting conditions                          07800000
PB_STATE_WAITING_LOCK EQU  X'FE' State is waiting on one or more locks  07850000
PB_STATE_WAITING_IO EQU  X'FF' State is waiting on I/O or some          07900000
*                           activity associated with an I/O request     07950000
PB_WORKDEF    DS   BL1      Flags associated with the work request      08000000
PB_INIT          EQU  B'10000000'  Initialize used for work environment 08050000
PB_FROM_LOCALMVS EQU  B'01000000'  CONTINUATION(YES) FROM(LOCALMVS)     08100000
PB_FROM_SYSPLEX  EQU  B'00100000'  CONTINUATION(YES) FROM(SYSPLEX)      08150000
PB_FROM_NETWORK  EQU  B'00010000'  CONTINUATION(YES) FROM(NETWORK)      08200000
PB_FROM_NONE     EQU  B'00001000'  CONTINUATION(YES) FROM(NONE)         08250000
PB_SCOPE_SHARED  EQU  B'00000100'  Initialize SCOPE(SHARED) work rqst   08300000
*                                                                       08350000
*                EQU  B'00000010'  RESERVED                             08400000
*                                                                       08450000
PB_RELATE        EQU  B'00000001'  Relate used for work environment     08500000
*                                                                       08550000
PB_SWITCH_INFO     DS   BL1          Switch Continuation Information    08600000
PB_SWITCH_LOCALMVS EQU  X'01'        Switch WHERE(LOCALMVS)             08650000
PB_SWITCH_SYSPLEX  EQU  X'02'        Switch WHERE(SYSPLEX)              08700000
PB_SWITCH_NETWORK  EQU  X'03'        Switch WHERE(NETWORK)              08750000
*                                                                       08800000
PB_MONENV_INFO     DS   BL1          Information about the mon. env.    08850000
PB_DURATION         EQU  PB_DURATION_EXECUTION+PB_DURATION_BEGIN_TO_END 08900000
*                        Mask for all duration options.                 08950000
*********************************************************************** 09000000
*                                                                       09050000
*                        WARNING: PB_DURATION must be updated           09100000
*                          whenever a new duration value is added.      09150000
*                                                                       09200000
*********************************************************************** 09250000
PB_DURATION_BEGIN_TO_END EQU  B'10000000' DURATION(BEGIN_TO_END)        09300000
PB_DURATION_EXECUTION    EQU  B'01000000' DURATION(EXECUTION)           09350000
*                                                                       09400000
PB_RSVD0045   DS   CL3      Reserved space                              09450000
*                                                                       09500000
PB_PARENT_MONTKN  DS   BL4  Token for the parent monitoring environment 09550000
PB_PARENT_MONTKN_HIBIT EQU X'80000000'  Hi order bit of token     @L1A  09600000
         ORG PB_PARENT_MONTKN+2                                         09650000
PB_PARENT_HOME_ASID  DS   H        ASID for Parent when parent is an    09700000
*                                  address space                        09750000
PB_PARENT_MIRROR_PTR DS   AL4      PB Parent mirror token pointer @L1A  09800000
         ORG PB_PARENT_MIRROR_PTR                                 @L1A  09850000
PB_PARENT_MIRROR_TKN DS   BL4      Token for parent control information 09900000
*                                                                       09950000
                  AGO .PB0050                                           10000000
* Offset is hex 50 here                                                 10050000
.PB0050           ANOP                                                  10100000
PB_DEP_MONTKN     DS   BL4  Token for the dependent monitoring          10150000
*                           environment related to this environment     10200000
PB_DEP_MONTKN_HIBIT EQU X'80000000'  Hi Order bit of token        @L1A  10250000
PB_DEP_MIRROR_PTR DS   AL4      PB Dependent mirror token pointer @L1A  10300000
         ORG PB_DEP_MIRROR_PTR                                    @L1A  10350000
PB_DEP_MIRROR_TKN DS   BL4      Token for dependent environment control 10400000
*                               information                             10450000
PB_SC_TKN     DS       BL4  Service class token for the work request    10500000
PB_ABNORMAL_FLAGS  DS  BL4  Abnormal flags                   @L1C       10550000
PB_ABNORMAL_LOCALMVS EQU X'00000001'  Abnormality only affects current  10600000
*                                     MVS image              @L1A       10650000
PB_ABNORMAL_SYSPLEX  EQU X'00000002'  Abnormality affects all MVS       10700000
*                                     images in the sysplex  @L1A       10750000
                  AGO .PB0060                                           10800000
* Offset is hex 60 here                                                 10850000
.PB0060           ANOP                                                  10900000
PB_WORK_ATTRIBUTES DS  CL52 Attributes associated with the work request 10950000
         ORG PB_WORK_ATTRIBUTES                                         11000000
PB_USERID     DS       CL8  Userid associated with the work request     11050000
         ORG PB_WORK_ATTRIBUTES+8                                       11100000
PB_TRXNAME    DS       CL8  Transaction name associated with the work   11150000
*                           request                                     11200000
                  AGO .PB0070                                           11250000
* Offset is hex 70 here                                                 11300000
.PB0070           ANOP                                                  11350000
         ORG PB_WORK_ATTRIBUTES+16                                      11400000
PB_TRXCLASS   DS       CL8  Transaction class associated with the work  11450000
*                           request                                     11500000
         ORG PB_WORK_ATTRIBUTES+24                                      11550000
PB_RSVD0078   DS       CL8  Reserved space                              11600000
                  AGO .PB0080                                           11650000
* Offset is hex 80 here                                                 11700000
.PB0080           ANOP                                                  11750000
         ORG PB_WORK_ATTRIBUTES+32                                      11800000
PB_SOURCELU   DS       CL17 Source LU name associated with the work     11850000
*                           request                                @P1C 11900000
                  AGO .PB0091                                           11950000
* Offset is hex 91 here                                                 12000000
.PB0091           ANOP                                                  12050000
         ORG PB_WORK_ATTRIBUTES+49                                      12100000
PB_RSVD0091   DS       BL3  Reserved space                              12150000
                  AGO .PB0094                                           12200000
* Offset is hex 94 here                                                 12250000
.PB0094           ANOP                                                  12300000
PB_LU62TKN_FMT DS       BL1  Format of the LU62 token                   12350000
PB_LU62FMT_LU_NO_CC_27 EQU X'01'                                        12400000
*                              The LU6.2 token associated with the      12450000
*                              work request is a fixed length token of  12500000
*                              27 bytes with no conversation correlator 12550000
*                              (not even its length byte).  The LU name 12600000
*                              may be 1-17 bytes.  Bytes at the end of  12650000
*                              the token are padded with hexadecimal    12700000
*                              zeros, if necessary, to form a full 27   12750000
*                              bytes.                                   12800000
PB_LU62FMT_FULL_LU_NO_CC_27 EQU X'02'                                   12850000
*                              The LU6.2 token associated with the      12900000
*                              work request is a fully qualified LU     12950000
*                              name (17 bytes), but no conversation     13000000
*                              correlator (not even its length byte) is 13050000
*                              provided.  This format is architected to 13100000
*                              be 27 bytes long.                        13150000
PB_LU62FMT_FULL_LU_0_CC_28  EQU X'03'                                   13200000
*                              The LU6.2 token associated with the      13250000
*                              work request is a fully qualified LU     13300000
*                              name (17 bytes), and the conversation    13350000
*                              correlator length byte is present and    13400000
*                              has the value 0.  This format is         13450000
*                              architected to be 28 bytes long.         13500000
PB_LU62FMT_FULL_LU_CC_36 EQU X'04'                                      13550000
*                              The LU6.2 token associated with the      13600000
*                              work request is a fully qualified LU     13650000
*                              name (17 bytes), and the conversation    13700000
*                              correlator is provided with a length of  13750000
*                              8 (maximum allowed).   This format is    13800000
*                              architected to be 36 bytes long.         13850000
PB_LU62FMT_OTHER             EQU X'00'                                  13900000
*                              The LU6.2 token associated with the      13950000
*                              work request contains self-defining      14000000
*                              length fields.                           14050000
PB_MAX_LU62TKN_LEN           EQU 36                                     14100000
*                              Maximum length of an                     14150000
*                              LU6.2 token (in decimal).                14200000
PB_RSVD0095   DS       BL3  Reserved space                              14250000
                  AGO .PB0098                                           14300000
* Offset is hex 98 here                                                 14350000
.PB0098           ANOP                                                  14400000
PB_LU62TKN    DS       CL36 LU 6.2 token associated with the work       14450000
*                           request                                     14500000
PB_RSVD00BC   DS       BL4  Reserved space                              14550000
                  AGO .PB00C0                                           14600000
* Offset is hex C0 here                                                 14650000
.PB00C0           ANOP                                                  14700000
*                                                                       14750000
PB_RSVD00C0   DS       CL8  Reserved space                              14800000
                  AGO .PB00C8                                           14850000
* Offset is hex C8 here (next byte past the PB, so length is C8 hex)    14900000
.PB00C8           ANOP                                                  14950000
*                                                                       15000000
PB_BP_RESTKN  DS       CL8  Buffer Pool resouce token                   15003100
*                           associated with the work                    15006200
*                           request                          @WLMPBPM   15009300
PB_CF_RESTKN  DS       CL8  Coupling Facility Structure                 15012400
*                           resouce token associated                    15015500
*                           with the work request            @WLMPBPM   15018600
                  AGO .PB00D8                                           15021700
* Offset is hex D8 here                                                 15024800
.PB00D8           ANOP                                                  15027900
*                                                                       15031000
PB_TRANS_TTOKEN DS     CL32 Transaction Trace Token          @TTRACE    15032500
                  AGO .PB00F8                                           15034000
* Offset is hex F8 here                                                 15035500
.PB00F8           ANOP                                                  15037000
*                                                                       15038500
PB_RSVD00F8   DS       CL8  Reserved space                   @WLMPBPM   15040000
                  AGO .PB0100                                           15041500
* Offset is hex 100 here (next byte past the PB, so length is 100 hex)  15043000
.PB0100           ANOP                                                  15044500
*                                                                       15046500
* PB_CLEAR_LEN EQU   *-PB_CLEAR_FLD - Length of section cleared   @P2A  15084800
*          ORG PB_CLEAR_FLD                                             15123100
* PB_CLEAR      DS   CL(PB_CLEAR_LEN) Area to be cleared for reuse      15161400
*                                                                       15200000
*********************************************************************** 15250000
*                                                                       15300000
*  Any fields added prior to PB_CLEAR_LEN (and after PB_CLEAR_FLD)      15350000
*  will be cleared by Initialize/Relate, while fields added after       15400000
*  PB_CLEAR_LEN will NOT be cleared. If you are changing the length     15433300
*  of PB_CLEAR, then read the Notes section in the prolog.  @PWA0230    15466600
*                                                                       15500000
*********************************************************************** 15550000
*                                                                       15600000
            MEND                                                        15650000
* */ IWMPB20: ;                                                         15700000
*                                                                       15750000
*                                                                       15800000
*   DECLARE                                                             15850000
*     1    PB BASED BDY(DWORD),     /* Performance block             */ 15900000
*      2    PB_CREATE CHAR(32) BDY(DWORD), /* space reserved for        15950000
*                                      create                    @L1C*/ 16000000
*       3    PB_ID_VERSION CHAR(5), /* Space for id and version info */ 16050000
*           5   PB_ID CHAR(4),      /* Space for id                     16058800
*                                      ++VERIFY                         16067600
*                                      SEVERITY(VerifyRc_Bad)           16076400
*                                      VALID((LIST,Pb_Id_Const))        16085200
*                                      ERRCODE(BadPbID)                 16094000
*                                      TYPE(IPCSEVR)                    16102800
*                                      DESIGN('Verify the PB ID Tag')   16111600
*                                                                    */ 16120400
*           5   PB_VERSION BIT(8),  /* Space for version information    16129200
*                                      ++VERIFY                         16138000
*                                      SEVERITY(VerifyRc_Bad)           16146800
*                                      VALID((RANGE,1,*))               16155600
*                                      ERRCODE(BadPb_Version)           16164400
*                                      TYPE(IPCSEVR)                    16173200
*                                      DESIGN('Verify the PB version    16182000
*                                      number')                      */ 16190800
*       3    PB_RSVD0005 CHAR(1),   /* Reserved space        @OW24060*/ 16210500
*       3    PB_NEW_LENGTH FIXED(15), /* Length of PB_CLEAR  @OW26040*/ 16230200
*       3    PB_SUBSYS_TYPE CHAR(4),/* Subsystem type                */ 16250000
*       3    PB_SUBSYSNM CHAR(8),   /* Subsystem name                */ 16300000
*       3    PB_MIRROR_PTR PTR(31) BDY(WORD), /*                 @L1A*/ 16350000
*           5   PB_MIRROR_TKN BIT(32), /* Token for control             16400000
*                                         information            @L1C*/ 16450000
*       3    PB_RSVD0018 CHAR(8),   /* Reserved space                 */16500000
*      2    PB_CLEAR,               /* Area to be cleared for reuse.    16520000
*                                      If the length of PB_CLEAR is     16540000
*                                      changing, read the Notes section 16560000
*                                      in the prolog.        @PWA0230*/ 16580000
*       3    PB_OWNER_DATA BIT(32),  /* Data specified by owner/user */ 16600000
*       3    PB_OWNER_TKN BIT(32),  /* Token specified by owner/user */ 16650000
*       3    PB_ARRTIME BIT(64) BDY(DWORD), /* Arrival time for         16700000
*                                      work request */                  16750000
*       3    PB_EXSTARTTIME BIT(64) BDY(DWORD), /* Execution start      16800000
*                                      time for work request.         */16850000
*       3    PB_DU_ASCB PTR(31),  /* Address of ASCB associated with    16900000
*                                    the dispatchable unit serving the  16950000
*                                    work request attributes.        */ 17000000
*       3    PB_DU     PTR(31),   /* Address of TCB associated with     17050000
*                                    the dispatchable unit serving the  17100000
*                                    work request attributes or         17150000
*                                    1 signifying an SRB             */ 17200000
*       3    PB_RSVD0040 BIT(8),  /* Reserved space                  */ 17250000
*       3    PB_STATE BIT(8),     /* State of the work request       */ 17300000
*       3    PB_WORKDEF BIT(8),         /* Work definition flags    */  17350000
*           5   PB_INIT BIT(1),         /* Initialize used for work     17400000
*                                          environment               */ 17450000
*           5   PB_FROM_LOCALMVS BIT(1), /* INITIALIZE CONTINUATION(YES)17500000
*                                           FROM(LOCALMVS) specified */ 17550000
*           5   PB_FROM_SYSPLEX  BIT(1), /* INITIALIZE CONTINUATION(YES)17600000
*                                           FROM(SYSPLEX) specified */  17650000
*           5   PB_FROM_NETWORK  BIT(1), /* INITIALIZE CONTINUATION(YES)17700000
*                                           FROM(NETWORK) specified */  17750000
*           5   PB_FROM_NONE    BIT(1), /* INITIALIZE CONTINUATION(YES) 17800000
*                                           FROM(NONE)    specified */  17850000
*           5   PB_SCOPE_SHARED BIT(1), /* SCOPE(SHARED) work request*/ 17900000
*           5   *               BIT(1), /* Reserved                  */ 17950000
*           5   PB_RELATE BIT(1),       /* Relate used for work         18000000
*                                          environment               */ 18050000
*       3    PB_SWITCH_INFO BIT(8),   /* Switch Continuation Info */    18100000
*       3    PB_MONENV_INFO BIT(8),   /* Information about the          18150000
*                                        monitoring environment.     */ 18200000
*           5 PB_DURATION,            /* Collection of Duration options 18250000
*                                        specified on INITIALIZE.     */18300000
*               7 PB_DURATION_BEGIN_TO_END BIT(1), /* INITIALIZE        18350000
*                                        DURATION(BEGIN_TO_END)         18400000
*                                        specified                   */ 18450000
*               7 PB_DURATION_EXECUTION BIT(1), /* INITIALIZE           18500000
*                                        DURATION(EXECUTION) specified*/18550000
*       3    PB_RSVD0045 CHAR(3), /* Reserved space                  */ 18600000
*       3    PB_PARENT_MONTKN BIT(32), /* Token for the parent          18650000
*                                         monitoring environment     */ 18700000
*           5   *         BIT(16),                                      18750000
*             7  PB_PARENT_MONTKN_HIBIT BIT(1), /*               @L1A*/ 18800000
*           5   PB_PARENT_HOME_ASID BIT(16), /* ASID for parent when    18850000
*                                         parent is an address space */ 18900000
*       3    PB_PARENT_MIRROR_PTR PTR(31), /*                    @L1A*/ 18950000
*           5   PB_PARENT_MIRROR_TKN BIT(32), /* Token for parent       19000000
*                                            control information @L1C*/ 19050000
*       3    PB_DEP_MONTKN BIT(32), /* Token for the dependent          19100000
*                                      monitoring environment related   19150000
*                                      to this environment           */ 19200000
*           5   PB_DEP_MONTKN_HIBIT BIT(1),  /*                  @L1A*/ 19250000
*       3    PB_DEP_MIRROR_PTR PTR(31), /*                       @L1A*/ 19300000
*           5   PB_DEP_MIRROR_TKN BIT(32), /* Token for dependent       19350000
*                                environment control information @L1C*/ 19400000
*       3    PB_SC_TKN BIT(32),        /* Service class token for the   19450000
*                                         work request               */ 19500000
*       3    PB_ABNORMAL_FLAGS BIT(32), /* Abnormal condition flags     19550000
*                                                                @L1C*/ 19600000
*           5   *   BIT(30),            /* Reserved bits         @L1C*/ 19650000
*           5   PB_ABNORMAL_SYSPLEX  BIT(1),  /* abnormality affects all19700000
*                                         MVS images in sysplex  @L1A*/ 19750000
*           5   PB_ABNORMAL_LOCALMVS BIT(1),  /* abnormality restricted 19800000
*                                         to current MVS image   @L1A*/ 19850000
*       3    PB_WORK_ATTRIBUTES,       /* Attributes associated with    19900000
*                                         the work request. These must  19950000
*                                         be character (EBCDIC).     */ 20000000
*           5   PB_USERID CHAR(8),       /* Userid associated with the  20050000
*                                         work request               */ 20100000
*           5   PB_TRXNAME CHAR(8),     /* Transaction name associated  20150000
*                                         with the work request      */ 20200000
*           5   PB_TRXCLASS CHAR(8),    /* Transaction class associated 20250000
*                                         with the work request      */ 20300000
*           5   PB_RSVD0078 CHAR(8),    /* Reserved                  */ 20350000
*           5   PB_SOURCELU CHAR(17),   /* Source LU name associated    20400000
*                                         with the work request  @P1C*/ 20450000
*           5   PB_RSVD0091 CHAR(3),     /* Reserved space        */    20500000
*       3    PB_LU62TKN_FMT BIT(8),    /* Format of the LU6.2 token  */ 20550000
*       3    PB_RSVD0095 CHAR(3),      /* Reserved space             */ 20600000
*       3    PB_LU62TKN CHAR(36),      /* LU 6.2 token associated       20650000
*                                         with the work request      */ 20700000
*       3    PB_RSVD00BC CHAR(4),      /* Reserved space             */ 20750000
*       3    PB_RSVD00C0 CHAR(8),      /* Reserved space             */ 20760000
*       3    PB_BP_RESTKN CHAR(8),     /* Buffer Pool resouce token     20770000
*                                         associated with the work      20780000
*                                         request            @WLMPBPM*/ 20790000
*       3    PB_CF_RESTKN CHAR(8),     /* Coupling Facility Structure   20800000
*                                         resouce token associated      20810000
*                                         with the work request         20820000
*                                                            @WLMPBPM*/ 20830000
*       3    PB_TRANS_TTOKEN CHAR(32), /* Transaction Trace Token       20835000
*                                                             @TTRACE*/ 20840000
*       3    PB_RSVD00F8 CHAR(8);      /* Reserved space     @WLMPBPM*/ 20845000
*                                                                       20850000
*                                                                       20900000
*         /* Constants associated with PB_ID_VERSION */                 20950000
*                                                                       21000000
* DCL PB_ID_CONST                                                       21050000
*   CHAR(4) CONSTANT('PB  ');       /* Performance block eye catcher */ 21100000
*                                                                       21150000
* DCL PB_VERSION1                                                       21200000
*   FIXED(8) CONSTANT(1);           /* Performance block version 1.     21250000
*                                      1=HBB5510, HBB5520    @WLMPBPM*/ 21261100
* DCL PB_VERSION2                                                       21272200
*   FIXED(8) CONSTANT(2);           /* Performance block version 2.     21283300
*                                      2=HBB6603.            @WLMPBPM*/ 21294400
* DCL PB_VERSION3                                                       21297100
*   FIXED(8) CONSTANT(3);           /* Performance block version 3.     21299800
*                                      2=JBB6609.             @TTRACE*/ 21302500
*                                                                       21305500
* DCL PB_CURRENT_VERSION                                                21316600
*   FIXED(8) CONSTANT(PB_VERSION3); /* Performance block current        21327700
*                                      version                @TTRACE*/ 21338800
*                                                                       21350000
*                                                                       21400000
*         /* Constants associated with PB_DU           */               21450000
*                                                                       21500000
* DCL PB_DU_SRB                                                         21550000
*   BIT(32) CONSTANT('00000001'X); /* The DU associated with the work   21600000
*                                     request is an SRB              */ 21650000
* DCL PB_SRB_SAMEDU_NO                                                  21700000
*   BIT(32) CONSTANT('00000001'X); /* The DU associated with the work   21750000
*                                     request is an SRB distinct from   21800000
*                                     the parent environment.        */ 21850000
* DCL PB_SRB_SAMEDU_YES                                                 21900000
*   BIT(32) CONSTANT('00000003'X); /* The DU associated with the work   21950000
*                                     request is the same SRB as        22000000
*                                     the parent environment.        */ 22050000
*                                                                       22100000
*         /* Constants associated with PB_STATE        */               22150000
*                                                                       22200000
* DCL PB_STATE_FREE                                                     22250000
*   BIT(8) CONSTANT('00'X); /* State is free - PB not associated with   22300000
*                           a work request                           */ 22350000
* DCL PB_STATE_ACTIVE                                                   22400000
*   BIT(8) CONSTANT('01'X); /* State is active - work request           22450000
*                           associated                               */ 22500000
                                                                        22550000
* DCL PB_STATE_READY                                                    22600000
*   BIT(8) CONSTANT('02'X); /* State is ready - work request            22650000
*                           associated with the PB is ready (could run  22700000
*                           on a CP if another program were not         22750000
*                           running)                                 */ 22800000
* DCL PB_STATE_IDLE                                                     22850000
*   BIT(8) CONSTANT('03'X); /* State is idle - no work request is       22900000
*                           available to the work manager that it is    22950000
*                           allowed to run                           */ 23000000
* DCL PB_STATE_WAITING_BUFFER_POOL_IO                                   23003800
*   BIT(8) CONSTANT('F1'X); /* State is waiting on an IO due to a       23007600
*                             buffer pool miss              @WLMPBPM */ 23011400
* DCL PB_STATE_WAITING_BUFFER_POOL_CF                                   23015200
*   BIT(8) CONSTANT('F2'X); /* State is waiting on an CF access due to a23019000
*                             buffer pool miss              @WLMPBPM */ 23022800
* DCL PB_STATE_WAITING_BUFFER_POOL_CF_IO                                23026600
*   BIT(8) CONSTANT('F3'X); /* State is waiting on an IO due to a       23030400
*                           buffer pool miss and a CF miss  @WLMPBPM */ 23034200
* DCL PB_STATE_WAITING_CF_IO                                            23038000
*   BIT(8) CONSTANT('F4'X); /* State is waiting on an IO due to a       23041800
*                              CF miss                      @WLMPBPM */ 23045600
* DCL PB_STATE_WAITING_DISTRIB                                          23050000
*   BIT(8) CONSTANT('F5'X); /* State is waiting on a                    23100000
*                           distributed request                      */ 23150000
* DCL PB_STATE_WAITING_TIMER                                            23200000
*   BIT(8) CONSTANT('F6'X); /* State is waiting on a timer           */ 23250000
* DCL PB_STATE_WAITING_LATCH                                            23300000
*   BIT(8) CONSTANT('F7'X); /* State is waiting on a latch.  @WLMPENH*/ 23350000
*                                                                       23400000
* DCL PB_STATE_WAITING_CONV                                             23450000
*   BIT(8) CONSTANT('F8'X); /* State is waiting on a conversation */    23500000
*                                                                       23550000
* DCL PB_STATE_WAITING_SESS_LOCALMVS                                    23600000
*   BIT(8) CONSTANT('F9'X); /* State is waiting to establish a   session23650000
*                           somewhere in the same MVS image          */ 23700000
*                                                                       23750000
* DCL PB_STATE_WAITING_SESS_SYSPLEX                                     23800000
*   BIT(8) CONSTANT('FA'X); /* State is waiting to establish a   session23850000
*                           somewhere in the sysplex                 */ 23900000
*                                                                       23950000
* DCL PB_STATE_WAITING_SESS_NETWORK                                     24000000
*   BIT(8) CONSTANT('FB'X); /* State is waiting to establish a   session24050000
*                           somewhere in the network                 */ 24100000
*                                                                       24150000
* DCL PB_STATE_WAITING_OTHER_PRODUCT                                    24200000
*   BIT(8) CONSTANT('FC'X); /* State is waiting on another product */   24250000
*                                                                       24300000
* DCL PB_STATE_WAITING_MISC                                             24350000
*   BIT(8) CONSTANT('FD'X); /* State is waiting on some unidentified    24400000
*                           resource, possibly one of the other defined 24450000
*                           waiting conditions                       */ 24500000
* DCL PB_STATE_WAITING_LOCK                                             24550000
*   BIT(8) CONSTANT('FE'X); /* State is waiting on one or more   locks*/24600000
*                                                                       24650000
* DCL PB_STATE_WAITING_IO                                               24700000
*   BIT(8) CONSTANT('FF'X); /* State is waiting on I/O or some          24750000
*                           activity associated with an I/O request  */ 24800000
*                                                                       24850000
*         /* Constants associated with PB_SWITCH_INFO  */               24900000
*                                                                       24950000
* DCL PB_SWITCH_LOCALMVS                                                25000000
*   BIT(8) CONSTANT('01'X);         /*  Switch WHERE(LOCALMVS)        */25050000
* DCL PB_SWITCH_SYSPLEX                                                 25100000
*   BIT(8) CONSTANT('02'X);         /*  Switch WHERE(SYSPLEX)         */25150000
* DCL PB_SWITCH_NETWORK                                                 25200000
*   BIT(8) CONSTANT('03'X);         /*  Switch WHERE(NETWORK)         */25250000
*                                                                       25300000
*         /* Constants associated with PB_LU62TKN_FMT  */               25350000
*                                                                       25400000
* DCL PB_LU62FMT_LU_NO_CC_27                                            25450000
*   BIT(8) CONSTANT('01'X); /* The LU6.2 token associated with the      25500000
*                              work request is a fixed length token of  25550000
*                              27 bytes with no conversation correlator 25600000
*                              (not even its length byte).  The LU name 25650000
*                              may be 1-17 bytes.  Bytes at the end of  25700000
*                              the token are padded with hexadecimal    25750000
*                              zeros, if necessary, to form a full 27   25800000
*                              bytes.                                */ 25850000
* DCL PB_LU62FMT_FULL_LU_NO_CC_27                                       25900000
*   BIT(8) CONSTANT('02'X); /* The LU6.2 token associated with the      25950000
*                              work request is a fully qualified LU name26000000
*                              (17 bytes), but no conversation          26050000
*                              correlator (not even its length byte) is 26100000
*                              provided.  This format is architected to 26150000
*                              be 27 bytes long.                     */ 26200000
* DCL PB_LU62FMT_FULL_LU_0_CC_28                                        26250000
*   BIT(8) CONSTANT('03'X); /* The LU6.2 token associated with the      26300000
*                              work request is a fully qualified LU name26350000
*                              (17 bytes), and the conversation         26400000
*                              correlator length byte is present and has26450000
*                              the value 0.  This format is architected 26500000
*                              to be 28 bytes long.                 */  26550000
* DCL PB_LU62FMT_FULL_LU_CC_36                                          26600000
*   BIT(8) CONSTANT('04'X); /* The LU6.2 token associated with the      26650000
*                              work request is a fully qualified LU     26700000
*                              name (17 bytes), and the conversation    26750000
*                              correlator is provided with a length of  26800000
*                              8 (maximum allowed).   This format is    26850000
*                              architected to be 36 bytes long.       */26900000
* DCL PB_LU62FMT_OTHER                                                  26950000
*   BIT(8) CONSTANT('00'X); /* The LU6.2 token associated with the      27000000
*                              work request contains self-defining      27050000
*                              length fields.                       */  27100000
*                                                                       27150000
*         /* Constants associated with PB_LU62TKN      */               27200000
*                                                                       27250000
* DCL PB_MAX_LU62TKN_LEN                                                27300000
*   FIXED(8) CONSTANT(36); /*  Maximum length byte of an                27350000
*                              LU6.2 token (in decimal).            */  27400000
*/********************************************************************  27450000
*   Savage constants for Recovery Element Verifiers (EVR) and IPCS      27500000
*   scan routine reason codes.  See the IPCS Scan routine IWMZ2VPB      27550000
*   for explanations.                                                   27600000
*********************************************************************/  27650000
* DCL                                                                   27700000
*   BadPbId                 Fixed(32)  Constant(1),                     27750000
*   BadPb_Version           Fixed(32)  Constant(2);                     27800000
