*                                                                       00050000
* %DCL IWMSET_INCLUDED CHAR EXT;                                        00100000
* %DEACTIVATE IWMSET_INCLUDED;                                          00150000
* %IF IWMSET_INCLUDED = '' %THEN                                        00200000
* %DO;                                                                  00250000
*%/* Start of PL/X PreProlog Code */;                                   00300000
*                                                                       00350000
*%/* End of PL/X PreProlog Code */;                                     00400000
*/* Macro made bi-lingual on 97052. CBGEN compile date 96059         */ 00450000
*% /*                                                                   00500000
         MACRO                                                          00550000
         IWMSET &DSECT=YES,&LIST=YES,&TITLE=YES,&SETHDR=YES,           *00600000
               &SETSE=COND,&SETSR=COND,&SETRE=COND,&SETSYS=COND,       *00650000
               &SETSYH=COND,&SETSES=COND,&SETRES=COND                   00700000
         GBLC  &IWMSET_INCLUDED                                         00750000
         GBLC  &ZCBPRINT                                                00800000
&IWMSET_INCLUDED SETC 'YES'                                             00850000
         AIF   ('&LIST' EQ 'NONE').P0                                   00900000
         AIF   ('&TITLE' EQ 'NO').P5                                    00950000
 TITLE   'IWMSET  - WLM Scheduling Environments Table          '        01000000
.P5      ANOP                                                           01050000
**/ IWMSET_1:;                                                          01100000
*/* START OF SPECIFICATIONS **************************************** */ 01150000
*/*                                                                  */ 01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01250000
*/*                                                                  */ 01300000
*/*          LICENSED MATERIALS - PROPERTY OF IBM                    */ 01350000
*/*          THIS MACRO IS "RESTRICTED MATERIALS OF IBM"             */ 01400000
*/*          5645-001(C) COPYRIGHT IBM CORP. 1997                    */ 01450000
*/*                                                                  */ 01550000
*/*01* EXTERNAL CLASSIFICATION:                                      */ 01570000
*/*02* GUPI: BASE                                                    */ 01590000
*/*02* DMTI: FIELDS SET_SES_FLAG2                                    */ 01610000
*/*                 SET_RES_FLAG1                                    */ 01630000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01650000
*/*                                                                  */ 01700000
*/*01* STATUS = JBB6604                                              */ 01750000
*/*                                                                  */ 01800000
*/**** END_OF_PROPRIETARY_STATEMENT ******************************** */ 01850000
*/*                                                                  */ 01900000
*/*01* Descriptive Name:  WLM Scheduling Environments Table          */ 01950000
*/*                                                                  */ 02000000
*/*02*  Acronym:  SET                                                */ 02050000
*/*                                                                  */ 02100000
*/*01* Macro Name:  IWMSET                                           */ 02150000
*/*                                                                  */ 02200000
*/*01* DSECT Name: SET                                               */ 02205000
*/*                SETSE                                             */ 02210000
*/*                SETSR                                             */ 02215000
*/*                SETRE                                             */ 02220000
*/*                SETSYS                                            */ 02225000
*/*                SETSYH                                            */ 02230000
*/*                SETSES                                            */ 02235000
*/*                SETRES                                            */ 02240000
*/*                                                                  */ 02245000
*/*01* Component:   Workload Manager (SCWLM)                         */ 02250000
*/*                                                                  */ 02300000
*/*01* Eye-Catcher:  IWMSET                                          */ 02350000
*/*02*  Offset:      0                                               */ 02400000
*/*02*  Length:      8                                               */ 02450000
*/*                                                                  */ 02500000
*/*01* Storage Attributes:                                           */ 02550000
*/*02*  Subpool:    Any                                              */ 02600000
*/*02*  Key:        Any                                              */ 02650000
*/*02*  Residency:  Anywhere                                         */ 02700000
*/*                                                                  */ 02750000
*/*01* Size:  Determined at run time                                 */ 02800000
*/*                                                                  */ 02850000
*/*01* Created by:  Caller of the IWMSEQRY service                   */ 02900000
*/*                                                                  */ 02950000
*/*01* Pointed to by: ANSAREA parameter of the IWMSEQRY service      */ 03000000
*/*                                                                  */ 03050000
*/*01* Serialization:  None                                          */ 03100000
*/*                                                                  */ 03150000
*/*01* Function: Describes scheduling environments, resources,       */ 03200000
*/*              and their status on each system in a sysplex.       */ 03250000
*/*                                                                  */ 03300000
*/*01* Method of Access:                                             */ 03350000
*/*                                                                  */ 03400000
*/*02*  ASM:                                                         */ 03450000
*/*          IWMSET                                                  */ 03500000
*/*                                                                  */ 03550000
*/*02*  PL/X:                                                        */ 03600000
*/*                                                                  */ 03650000
*/*          %INCLUDE SYSLIB(IWMSET)                                 */ 03700000
*/*                                                                  */ 03750000
*/*          The scheduling environment table consists of a          */ 03800000
*/*          definition area and one or more system status areas.    */ 03850000
*/*                                                                  */ 03900000
*/*          The definition area consists of a header and            */ 03925000
*/*          additional sections.  A USING on SETHDR establishes     */ 03950000
*/*          addressability to the header.  Subsequent USINGs        */ 03975000
*/*          must be done to establish addressability to the         */ 04000000
*/*          additional sections (DSECTs) as follows:                */ 04025000
*/*                                                                  */ 04050000
*/*          DSECT    BASE ADDRESS                                   */ 04100000
*/*          -----    ------------                                   */ 04150000
*/*          SETSE    A(SETHDR) + SET_OFFSET_SE                      */ 04200000
*/*          SETSR    A(SETHDR) + SET_OFFSET_SR                      */ 04250000
*/*          SETRE    A(SETHDR) + SET_OFFSET_RE                      */ 04300000
*/*          SETSYS   A(SETHDR) + SET_OFFSET_SYS                     */ 04350000
*/*                                                                  */ 04400000
*/*          The SETSYS section contains the addresses of the        */ 04423000
*/*          system status areas.  Each system status area           */ 04446000
*/*          consists of a header and additional sections.  A        */ 04469000
*/*          USING on SETSYH establishes addressability to the       */ 04492000
*/*          header.  Subsequent USINGs must be done to establish    */ 04515000
*/*          addressability to the additional sections (DSECTs)      */ 04538000
*/*          as follows:                                             */ 04561000
*/*                                                                  */ 04584000
*/*          DSECT    BASE ADDRESS                                   */ 04607000
*/*          -----    ------------                                   */ 04630000
*/*          SETSES   A(SETSYH) + SET_OFFSET_SES                     */ 04653000
*/*          SETRES   A(SETSYH) + SET_OFFSET_RES                     */ 04676000
*/*                                                                  */ 04700000
*/*          Subsequent elements of a section can be found           */ 04750000
*/*          by adding the size of one element as indicated          */ 04800000
*/*          in the appropriate header.                              */ 04850000
*/*                                                                  */ 04900000
*/*----------------------------------------------------------------- */ 04950000
*/*                                                                  */ 05000000
*/*01* Change Activity:                                              */ 05050000
*/*                                                                  */ 05100000
*/*    $L0=WLMCSTP JBB6604  961225 PDB9DB: WLMRES Dave Bostjancic    */ 05150000
*/*                                        Scheduling environments   */ 05200000
*/*                                                                  */ 05250000
*/*  END OF SPECIFICATIONS ***************************************** */ 05300000
*% /*                                                                   05350000
.P0      ANOP                                                           05400000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05450000
         AIF   ('&LIST' EQ 'YES').P2                                    05500000
.P1      ANOP                                                           05550000
         PUSH  PRINT                                                    05600000
         PRINT OFF                                                      05650000
.P2      ANOP                                                           05700000
*                                                                       05750000
*    *****************************************************************  05800000
*    *                                                               *  05850000
*    * IWMSET.708: SET header                                        *  05900000
*    *                                                               *  05950000
*    *****************************************************************  06000000
*                                                                       06050000
*                                                                       06100000
         AIF   ('&SETHDR' EQ 'NO').L0002                                06150000
         AIF   ('&DSECT' EQ 'YES').L0003                                06200000
         AIF   ('&SETHDR' NE 'YES').L0002                               06250000
SETHDR   DS    0F                                                       06300000
         AGO   .L0004                                                   06350000
.L0003   ANOP                                                           06400000
SETHDR   DSECT                                                          06450000
.L0004   ANOP                                                           06500000
SET_HDR_EYECATCHER DS 1CL0008 IWMSET.29: Eye catcher                    06550000
SET_HDR_WLM_VERSION_NUMBER DS 1FL1 IWMSET.41: Version number of SET     06600000
SET_HDR_RESERVED1 DS 1FL1 IWMSET.1180: Reserved                         06650000
SET_HDR_SIZE_OF_HEADER DS 1FL2 IWMSET.75: Size of this header section   06700000
SET_HDR_SIZE_OF_WHOLE_SET DS 1FL4 IWMSET.63: Size of the whole         *06750000
                         scheduling environment table, not including   *06783300
                         any system status areas                        06816600
SET_HDR_TOD_VALUE DS 1BL8 IWMSET.67: Time/date (STCK format) that the  *06850000
                         service definition was installed. The value   *06900000
                         matches field SVPOLTDI in IWMSVPOL.            06950000
SET_HDR_SIZE_OF_A_SYS_STATUS_AREA DS 1FL4 IWMSET.54: Size of each      *06970000
                         system status area                             06990000
SET_HDR_RESERVED DS 1FL4 IWMSET.176: Reserved                           07010000
         ORG   SET_HDR_RESERVED+X'00000020'                             07030000
SET_HDR_OFFSETS DS 0CL0040 IWMSET.61: SET section offsets area          07050000
SET_HDR_SE_SECTION DS 0CL0008 IWMSET.48: Scheduling environment        *07100000
                         section                                        07150000
SET_OFFSET_SE DS 1FL4    IWMSET.38: Offset of scheduling environment   *07200000
                         section (SETSE)                                07216600
SET_NUMBER_SE DS 1FL2    IWMSET.892: Number of scheduling environment  *07233200
                         entries                                        07250000
SET_SIZE_SE DS 1FL2      IWMSET.898: Size of a scheduling environment  *07350000
                         entry                                          07400000
SET_HDR_SR_SECTION DS 0CL0008 IWMSET.904: Scheduling environment-      *07450000
                         /resource relationships section                07500000
SET_OFFSET_SR DS 1FL4    IWMSET.907: Offset of scheduling environment- *07550000
                         /resource relationship section (SETSR)         07600000
SET_NUMBER_SR DS 1FL2    IWMSET.913: Number of scheduling environment- *07650000
                         /resource relationship entries                 07700000
SET_SIZE_SR DS 1FL2      IWMSET.919: Size of a scheduling environment- *07750000
                         /resource relationship entry                   07800000
SET_HDR_RE_SECTION DS 0CL0008 IWMSET.925: Resource section              07850000
SET_OFFSET_RE DS 1FL4    IWMSET.928: Offset of resource section        *07887500
                         (SETRE)                                        07925000
SET_NUMBER_RE DS 1FL2    IWMSET.934: Number of resource entries         07962500
SET_SIZE_RE DS 1FL2      IWMSET.940: Size of a resource entry           08000000
SET_HDR_SYS_SECTION DS 0CL0008 IWMSET.947: System section               08050000
SET_OFFSET_SYS DS 1FL4   IWMSET.950: Offset of system section (SETSYS)  08100000
SET_NUMBER_SYS DS 1FL2   IWMSET.956: Number of system entries           08150000
SET_SIZE_SYS DS 1FL2     IWMSET.962: Size of a system entry             08200000
SET_HDR_RESERVED_SECTION DS 0CL0008 IWMSET.969: Reserved slots          08250000
SET_OFFSET_RESERVED DS 1FL4 IWMSET.972: Reserved offset                 08300000
SET_NUMBER_RESERVED DS 1FL2 IWMSET.978: Reserved number                 08350000
SET_SIZE_RESERVED DS 1FL2 IWMSET.984: Reserved size                     08400000
SETHDR_LEN EQU *-SETHDR                                                 08450000
.L0002   ANOP                                                           08500000
*                                                                       08550000
*    *****************************************************************  08600000
*    *                                                               *  08650000
*    * IWMSET.1212: SET SE - Scheduling environment entry            *  08700000
*    *                                                               *  08750000
*    *****************************************************************  08800000
*                                                                       08850000
*                                                                       08900000
         AIF   ('&SETSE' EQ 'NO').L0005                                 08950000
         AIF   ('&DSECT' EQ 'YES').L0006                                09000000
         AIF   ('&SETSE' NE 'YES').L0005                                09050000
SETSE    DS    0F                                                       09100000
         AGO   .L0007                                                   09150000
.L0006   ANOP                                                           09200000
SETSE    DSECT                                                          09250000
.L0007   ANOP                                                           09300000
SET_SE_DEFINITION DS 0CL0056 IWMSET.332: SE definition                  09350000
SET_SE_SCHENV_NAME DS 1CL0016 IWMSET.336: Scheduling environment name   09400000
SET_SE_DESCRIPTION DS 1CL0032 IWMSET.288: Scheduling environment       *09450000
                         description                                    09500000
SET_SE_RESERVED_DEFINITION DS 1CL0008 IWMSET.354: Reserved              09550000
SET_SE_OFFSETS DS 0CL0016 IWMSET.365: SE offsets                        09600000
SET_SE_SR_OFFSET DS 1FL4 IWMSET.372: Offset of the first scheduling    *09650000
                         environment- /resource relationship entry for *09700000
                         this scheduling environment from the          *09750000
                         beginning of the SET                           09800000
SET_SE_SR_COUNT DS 1FL4  IWMSET.378: Number of scheduling environment- *09850000
                         /resource relationship entries for this       *09900000
                         scheduling environment                         09950000
SET_SE_OFFSETS_RESERVED DS 1FL4 IWMSET.1143: SE reserved offsets        10000000
         ORG   SETSE+X'00000048'                                        10050000
SETSE_LEN EQU  *-SETSE                                                  10100000
.L0005   ANOP                                                           10150000
*                                                                       10200000
*    *****************************************************************  10250000
*    *                                                               *  10300000
*    * IWMSET.723: SET SR - Scheduling environment/resource          *  10350000
*    * relationship entry                                            *  10400000
*    *                                                               *  10450000
*    *****************************************************************  10500000
*                                                                       10550000
*                                                                       10600000
         AIF   ('&SETSR' EQ 'NO').L0008                                 10650000
         AIF   ('&DSECT' EQ 'YES').L0009                                10700000
         AIF   ('&SETSR' NE 'YES').L0008                                10750000
SETSR    DS    0F                                                       10800000
         AGO   .L000A                                                   10850000
.L0009   ANOP                                                           10900000
SETSR    DSECT                                                          10950000
.L000A   ANOP                                                           11000000
SET_SR_DEFINITION DS 0CL0020 IWMSET.401: Definition section             11050000
SET_SR_SE_INDEX DS 1FL4  IWMSET.807: Index of the scheduling           *11100000
                         environment entry within the SET SE section    11150000
SET_SR_SE_OFFSET DS 1FL4 IWMSET.396: Offset of the scheduling          *11250000
                         environment entry from the beginning of the   *11300000
                         SET                                            11350000
SET_SR_FLAG1 DS 0BL1     IWMSET.313: Flags                              11400000
SET_SR_LAST_ONE_FOR_SE EQU X'80' IWMSET.319: Indicates this is the     *11450000
                         last SR entry for a scheduling environment     11500000
         ORG   SET_SR_FLAG1+X'00000001'                                 11550000
SET_SR_RESOURCE_STATE DS 1FL1 IWMSET.840: Required state of the        *11600000
                         resource for the scheduling environment to be *11650000
                         available                                      11700000
SET_SR_RESERVED_DEFINITION1 DS 1CL0001 IWMSET.408: SR section reserved  11750000
         ORG   SET_SR_RESERVED_DEFINITION1+X'00000002'                  11800000
SET_SR_RESERVED_DEFINITION2 DS 1CL0008 IWMSET.1240: Reserved            11850000
SET_SR_OFFSETS DS 0CL0016 IWMSET.427: SR offsets section                11950000
SET_SR_RE_INDEX DS 1FL4  IWMSET.885: Index of the resource entry       *12000000
                         within the SETRE section                       12050000
SET_SR_RE_OFFSET DS 1FL4 IWMSET.435: Offset of the resource entry from *12100000
                         the beginning of the SET                       12150000
SET_SR_OFFSETS_RESERVED DS 1FL4 IWMSET.442: SR reserved offsets         12200000
         ORG   SETSR+X'00000024'                                        12250000
SETSR_LEN EQU  *-SETSR                                                  12300000
.L0008   ANOP                                                           12350000
*                                                                       12400000
*    *****************************************************************  12450000
*    *                                                               *  12500000
*    * IWMSET.1072: SET RE - Resource entry                          *  12550000
*    *                                                               *  12600000
*    *****************************************************************  12650000
*                                                                       12700000
*                                                                       12750000
         AIF   ('&SETRE' EQ 'NO').L000B                                 12800000
         AIF   ('&DSECT' EQ 'YES').L000C                                12850000
         AIF   ('&SETRE' NE 'YES').L000B                                12900000
SETRE    DS    0X                                                       12950000
         AGO   .L000D                                                   13000000
.L000C   ANOP                                                           13050000
SETRE    DSECT                                                          13100000
.L000D   ANOP                                                           13150000
SET_RE_DEFINITION DS 0CL0056 IWMSET.476: RE definition                  13200000
SET_RE_RESOURCE_NAME DS 1CL0016 IWMSET.484: Resource name               13250000
SET_RE_RESOURCE_DESCRIPTION DS 1CL0032 IWMSET.490: Resource            *13300000
                         description                                    13350000
SET_RE_RESERVED_DEFINITION DS 1CL0008 IWMSET.502: Reserved              13400000
SETRE_LEN EQU  *-SETRE                                                  13450000
.L000B   ANOP                                                           13500000
*                                                                       13550000
*    *****************************************************************  13600000
*    *                                                               *  13650000
*    * IWMSET.800: SET SYS - System entry                            *  13700000
*    *                                                               *  13750000
*    *****************************************************************  13800000
*                                                                       13850000
*                                                                       13900000
         AIF   ('&SETSYS' EQ 'NO').L000E                                13950000
         AIF   ('&DSECT' EQ 'YES').L000F                                14000000
         AIF   ('&SETSYS' NE 'YES').L000E                               14050000
SETSYS   DS    0F                                                       14100000
         AGO   .L0010                                                   14150000
.L000F   ANOP                                                           14200000
SETSYS   DSECT                                                          14250000
.L0010   ANOP                                                           14300000
SET_SYS_DEFINITION DS 0CL0016 IWMSET.536: SYS definition                14350000
SET_SYS_NAME DS 1CL0008  IWMSET.544: System name. If this field        *14375000
                         contains binary zeroes, this is an unused     *14400000
                         entry that contains no status information.     14425000
SET_SYS_RESERVED_DEFINITION DS 1CL0008 IWMSET.550: Reserved             14450000
SET_SYS_STATUS_PTR DS 1AL4 IWMSET.568: Address of the system status    *14500000
                         header (SETSYH) for this system, if there is  *14533300
                         a system name in the SET_SYS_NAME field        14566600
SETSYS_LEN EQU *-SETSYS                                                 14600000
.L000E   ANOP                                                           14650000
*                                                                       14700000
*    *****************************************************************  14750000
*    *                                                               *  14800000
*    * IWMSET.804: SET SYS HDR - System status header                *  14850000
*    *                                                               *  14900000
*    *****************************************************************  14950000
*                                                                       15000000
*                                                                       15050000
         AIF   ('&SETSYH' EQ 'NO').L0011                                15100000
         AIF   ('&DSECT' EQ 'YES').L0012                                15150000
         AIF   ('&SETSYH' NE 'YES').L0011                               15200000
SETSYH   DS    0F                                                       15250000
         AGO   .L0013                                                   15300000
.L0012   ANOP                                                           15350000
SETSYH   DSECT                                                          15400000
.L0013   ANOP                                                           15450000
SET_SYS_HDR_EYECATCHER DS 1CL0008 IWMSET.846: Eye catcher               15500000
SET_SYS_HDR_CONTROL DS 0CL0032 IWMSET.611: System status header        *15550000
                         control information                            15600000
SET_SYS_HDR_TOD_VALUE DS 1BL8 IWMSET.234: Time stamp of when the       *15650000
                         service number definition was installed. This *15700000
                         is a copy of the SET_HDR_TOD_VALUE             15750000
SET_SYS_HDR_MODIFIED DS 1BL8 IWMSET.1165: A time stamp for the most    *15800000
                         recent modification to status information in  *15850000
                         a SETSES or SETRES entry                       15900000
SET_SYS_HDR_WLM_VERSION_NUMBER DS 1FL1 IWMSET.318: Version number of   *15950000
                         system status header                           16000000
SET_SYS_HDR_CONTROL_RESERVED DS 1FL1 IWMSET.1171: Reserved              16050000
SET_SYS_HDR_SIZE_OF_HEADER DS 1FL2 IWMSET.242: Size of the system      *16100000
                         status header                                  16150000
SET_SYS_HDR_WHOLE_SIZE DS 1FL4 IWMSET.292: Size of the system status   *16200000
                         area including this header, all SETSES        *16250000
                         entries and all SETRES entries                 16300000
SET_SYS_HDR_CONTROL_RESERVED2 DS 1FL4 IWMSET.619: Reserved              16350000
         ORG   SET_SYS_HDR_CONTROL+X'00000020'                          16450000
SET_SYS_HDR_OFFSETS_AREA DS 0CL0024 IWMSET.629: System status header   *16500000
                         offsets area                                   16550000
SET_SYS_HDR_SES_SECTION DS 0CL0008 IWMSET.637: Scheduling environment  *16600000
                         status section                                 16650000
SET_OFFSET_SES DS 1FL4   IWMSET.640: Offset of the scheduling          *16700000
                         environment status section (SETSES)            16750000
SET_NUMBER_SES DS 1FL2   IWMSET.646: Number of scheduling environment  *16800000
                         status entries                                 16850000
SET_SIZE_SES DS 1FL2     IWMSET.652: Size of a scheduling environment  *16900000
                         status entry                                   16950000
SET_SYS_HDR_RES_SECTION DS 0CL0008 IWMSET.658: Resource status section  17000000
SET_OFFSET_RES DS 1FL4   IWMSET.661: Offset of the resource status     *17033300
                         entries (SETRES)                               17066600
SET_NUMBER_RES DS 1FL2   IWMSET.667: Number of resource status entries  17100000
SET_SIZE_RES DS 1FL2     IWMSET.673: Size of a resource status entry    17150000
SET_SYS_HDR_RESERVED_SECTION DS 0CL0008 IWMSET.680: Reserved slots      17200000
SET_OFFSET_RESERVED1 DS 1FL4 IWMSET.683: Reserved offset                17250000
SET_NUMBER_RESERVED1 DS 1FL2 IWMSET.689: Reserved number                17300000
SET_SIZE_RESERVED1 DS 1FL2 IWMSET.695: Reserved size                    17350000
SET_SYS_HDR_RESERVED DS 1FL4 IWMSET.1044: Reserved                      17400000
         ORG   SETSYH+X'00000050'                                       17450000
SETSYH_LEN EQU *-SETSYH                                                 17500000
.L0011   ANOP                                                           17550000
*                                                                       17600000
*    *****************************************************************  17650000
*    *                                                               *  17700000
*    * IWMSET.870: SET SES - Scheduling environment system status    *  17750000
*    *                                                               *  17800000
*    *****************************************************************  17850000
*                                                                       17900000
*                                                                       17950000
         AIF   ('&SETSES' EQ 'NO').L0014                                18000000
         AIF   ('&DSECT' EQ 'YES').L0015                                18050000
         AIF   ('&SETSES' NE 'YES').L0014                               18100000
SETSES   DS    0F                                                       18150000
         AGO   .L0016                                                   18200000
.L0015   ANOP                                                           18250000
SETSES   DSECT                                                          18300000
.L0016   ANOP                                                           18350000
SET_SES_DEFINITION DS 0CL0004 IWMSET.745: SES definition                18400000
SET_SES_SE_INDEX DS 1FL4 IWMSET.753: Index of the scheduling           *18450000
                         environment entry within the SETSE section of *18466600
                         the definition area. SETSES entries           *18483200
                         correspond positionally to SETSE entries (for *18499800
                         example the third SETSES entry corresponds to *18516400
                         the third SETSE entry). The index is here     *18533000
                         primarily as a debugging aid, such as to      *18549600
                         detect an overlay.                             18566200
SET_SES_STATUS DS 0CL0012 IWMSET.1241: SES status                       18582800
SET_SES_FLAG1 DS 0BL1    IWMSET.759: Flag 1                             18600000
SET_SES_AVAILABLE EQU X'80' IWMSET.765: Indicates the scheduling       *18650000
                         environment is available                       18700000
         ORG   SET_SES_FLAG1+X'00000001'                                18750000
SET_SES_FLAG2 DS 0BL1    IWMSET.350: Flag 2                             18800000
SET_SES_REQUIRES_ENF EQU X'80' IWMSET.1270: The scheduling environment *18850000
                         has had its status changed (either            *18900000
                         SET_SES_AVAILABLE was set or reset) and we    *18950000
                         must notify any users interested in           *19000000
                         scheduling environments via ENF 57             19050000
SET_SES_REQUIRES_REC_ENF EQU X'40' IWMSET.730: The scheduling          *19100000
                         environment has had its status changed.       *19150000
                         Similar to SET_SES_REQ- UIRES_ENF but set in  *19200000
                         WLM recovery paths.                            19250000
         ORG   SET_SES_FLAG2+X'00000001'                                19300000
SET_SES_RESERVED DS 1BL2 IWMSET.771: Reserved                           19350000
SET_SES_RESERVED_DEFINITION DS 1CL0008 IWMSET.780: Reserved             19400000
SETSES_LEN EQU *-SETSES                                                 19450000
.L0014   ANOP                                                           19500000
*                                                                       19550000
*    *****************************************************************  19600000
*    *                                                               *  19650000
*    * IWMSET.883: SET RES - Resource system status                  *  19700000
*    *                                                               *  19750000
*    *****************************************************************  19800000
*                                                                       19850000
*                                                                       19900000
         AIF   ('&SETRES' EQ 'NO').L0017                                19950000
         AIF   ('&DSECT' EQ 'YES').L0018                                20000000
         AIF   ('&SETRES' NE 'YES').L0017                               20050000
SETRES   DS    0F                                                       20100000
         AGO   .L0019                                                   20150000
.L0018   ANOP                                                           20200000
SETRES   DSECT                                                          20250000
.L0019   ANOP                                                           20300000
SET_RES_DEFINITION DS 0CL0004 IWMSET.815: RES definition                20350000
SET_RES_RE_INDEX DS 1FL4 IWMSET.823: Index of the resource entry       *20400000
                         within the SETRE section of the definition    *20426600
                         area. SETRES entries correspond positionally  *20453200
                         to SETRE entries (for example the fourth      *20479800
                         SETRES entry corresponds to the fourth SETRE  *20506400
                         entry). The index is here primarily as a      *20533000
                         debugging aid, such as to detect an overlay.   20559600
SET_RES_STATUS DS 0CL0012 IWMSET.415: RES status                        20586200
SET_RES_STATE DS 1FL1    IWMSET.829: Current state of the resource      20612800
SET_RES_FLAG1 DS 0BL1    IWMSET.853: Flag 1                             20639400
SET_RES_MODIFICATION_IN_PROGRESS EQU X'80' IWMSET.1351: Indicates that *20666000
                         a F WLM,RESOURCE or IWMSESET request is in    *20692600
                         progress                                       20719200
         ORG   SET_RES_FLAG1+X'00000001'                                20745800
SET_RES_RESERVED DS 1BL2 IWMSET.1005: Reserved                          20772400
SET_RES_RESERVED_DEFINITION DS 1CL0008 IWMSET.862: Reserved             20800000
*                                                                       20850000
*    *****************************************************************  20900000
*    *                                                               *  20950000
*    * IWMSET.102: SET eyecatcher - 'IWMSET'                         *  21000000
*    *                                                               *  21050000
*    *****************************************************************  21100000
*                                                                       21150000
*                                                                       21200000
IWMSET_LEVEL004 EQU 4                                                   21250000
*                                                                       21300000
*    *****************************************************************  21350000
*    *                                                               *  21400000
*    * IWMSET.120: WLM JBB6604 version                               *  21450000
*    *                                                               *  21500000
*    *****************************************************************  21550000
*                                                                       21600000
*                                                                       21650000
IWMSET_VER604 EQU 4                                                     21700000
*                                                                       21750000
*    *****************************************************************  21800000
*    *                                                               *  21850000
*    * IWMSET.129: Current version level used when checking          *  21900000
*    * functionality within WLM product                              *  21950000
*    *                                                               *  22000000
*    *****************************************************************  22050000
*                                                                       22100000
*                                                                       22150000
IWMSET_CURRENT_VER EQU 4                                                22200000
*                                                                       22200800
*    *****************************************************************  22201600
*    *                                                               *  22202400
*    * IWMSET.601: SET_SR_RESOURCE_STATE that indicates resource is  *  22203200
*    * desired to be ON                                              *  22204000
*    *                                                               *  22204800
*    *****************************************************************  22205600
*                                                                       22206400
*                                                                       22207200
SET_SR_ON EQU  4                                                        22208000
*                                                                       22208800
*    *****************************************************************  22209600
*    *                                                               *  22210400
*    * IWMSET.1394: SET_RES_STATE that indicates resource is ON      *  22211200
*    *                                                               *  22212000
*    *****************************************************************  22212800
*                                                                       22213600
*                                                                       22214400
SET_RES_ON EQU 4                                                        22215200
*                                                                       22216000
*    *****************************************************************  22216800
*    *                                                               *  22217600
*    * IWMSET.1371: SET_SR_RESOURCE_STATE that indicates resource is *  22218400
*    * desired to be OFF                                             *  22219200
*    *                                                               *  22220000
*    *****************************************************************  22220800
*                                                                       22221600
*                                                                       22222400
SET_SR_OFF EQU 8                                                        22223200
*                                                                       22224000
*    *****************************************************************  22224800
*    *                                                               *  22225600
*    * IWMSET.1403: SET_RES_STATE that indicates resource is OFF     *  22226400
*    *                                                               *  22227200
*    *****************************************************************  22228000
*                                                                       22228800
*                                                                       22229600
SET_RES_OFF EQU 8                                                       22230400
*                                                                       22231200
*    *****************************************************************  22232000
*    *                                                               *  22232800
*    * IWMSET.1390: SET_SR_RESOURCE_STATE that is reserved           *  22233600
*    *                                                               *  22234400
*    *****************************************************************  22235200
*                                                                       22236000
*                                                                       22236800
SET_SR_RESERVED EQU 12                                                  22237600
*                                                                       22238400
*    *****************************************************************  22239200
*    *                                                               *  22240000
*    * IWMSET.1357: SET_RES_STATE that indicates resource is RESET   *  22240800
*    *                                                               *  22241600
*    *****************************************************************  22242400
*                                                                       22243200
*                                                                       22244000
SET_RES_RESET EQU 12                                                    22244800
SETRES_LEN EQU *-SETRES                                                 25850000
.L0017   ANOP                                                           25900000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 25950000
         AIF   ('&LIST' EQ 'YES').P4                                    26000000
.P3      ANOP                                                           26050000
         POP   PRINT                                                    26100000
.P4      ANOP                                                           26150000
.P_EXIT  ANOP                                                           26200000
         MEND                                                           26250000
**/ IWMSET_2:;                                                          26300000
* %IWMSET_INCLUDED = 'YES';                                             26350000
* %DCL ZCBPRINT CHAR EXT;                                               26400000
* %DEACTIVATE ZCBPRINT;                                                 26450000
* %DCL IWMSET_LIST CHAR EXT;                                            26500000
* %DEACTIVATE IWMSET_LIST;                                              26550000
* %IF IWMSET_LIST ^= 'NO' &                                             26600000
*    ZCBPRINT ^= 'NO' %THEN                                             26650000
*   %GOTO IWMSET_3;                                                     26700000
*   @LIST PUSH NOECHO;                                                  26750000
*   @LIST NOASSEMBLE NOECHO;                                            26800000
*   @LIST OFF C NOECHO;                                                 26850000
* %IWMSET_3:;                                                           26900000
*/* Start of PL/X Source                                             */ 26950000
*                                                                       27000000
*   /*****************************************************************/ 27050000
*   /*                                                               */ 27100000
*   /* IWMSET.708: SET header                                        */ 27150000
*   /*                                                               */ 27200000
*   /*****************************************************************/ 27250000
*                                                                       27300000
*   DECLARE                                                             27350000
*     1    SETHDR   BASED(*) BDY(WORD),                                 27400000
*      2    SET_HDR_EYECATCHER CHAR(8), /* IWMSET.29: Eye catcher    */ 27450000
*      2    SET_HDR_WLM_VERSION_NUMBER FIXED(8), /* IWMSET.41:          27500000
*                                      Version number of SET         */ 27550000
*      2    SET_HDR_RESERVED1 FIXED(8), /* IWMSET.1180: Reserved     */ 27600000
*      2    SET_HDR_SIZE_OF_HEADER FIXED(16), /* IWMSET.75: Size of     27650000
*                                      this header section           */ 27700000
*      2    SET_HDR_SIZE_OF_WHOLE_SET FIXED(32), /* IWMSET.63: Size     27750000
*                                      of the whole scheduling          27800000
*                                      environment table, not           27825000
*                                      including any system status      27850000
*                                      areas                         */ 27875000
*      2    SET_HDR_TOD_VALUE BIT(64), /* IWMSET.67: Time/date (STCK    27900000
*                                      format) that the service         27950000
*                                      definition was installed. The    28000000
*                                      value matches field SVPOLTDI     28050000
*                                      in IWMSVPOL.                  */ 28100000
*      2    SET_HDR_SIZE_OF_A_SYS_STATUS_AREA /* IWMSET.54: Size of     28120000
*                                      each system status area       */ 28140000
*               FIXED(32),                                              28160000
*      2    SET_HDR_RESERVED(8) FIXED(32), /* IWMSET.176: Reserved   */ 28180000
*      2    SET_HDR_OFFSETS,        /* IWMSET.61: SET section offsets   28200000
*                                      area                          */ 28250000
*       3    SET_HDR_SE_SECTION,    /* IWMSET.48: Scheduling            28300000
*                                      environment section           */ 28350000
*        4    SET_OFFSET_SE FIXED(32), /* IWMSET.38: Offset of          28400000
*                                      scheduling environment section   28433300
*                                      (SETSE)                       */ 28466600
*        4    SET_NUMBER_SE FIXED(16), /* IWMSET.892: Number of         28500000
*                                      scheduling environment entries*/ 28550000
*        4    SET_SIZE_SE FIXED(16), /* IWMSET.898: Size of a           28600000
*                                      scheduling environment entry  */ 28650000
*       3    SET_HDR_SR_SECTION,    /* IWMSET.904: Scheduling           28700000
*                                      environment- /resource           28750000
*                                      relationships section         */ 28800000
*        4    SET_OFFSET_SR FIXED(32), /* IWMSET.907: Offset of         28850000
*                                      scheduling environment-          28900000
*                                      /resource relationship section   28933300
*                                      (SETSR)                       */ 28966600
*        4    SET_NUMBER_SR FIXED(16), /* IWMSET.913: Number of         29000000
*                                      scheduling environment-          29050000
*                                      /resource relationship entries*/ 29100000
*        4    SET_SIZE_SR FIXED(16), /* IWMSET.919: Size of a           29150000
*                                      scheduling environment-          29200000
*                                      /resource relationship entry  */ 29250000
*       3    SET_HDR_RE_SECTION,    /* IWMSET.925: Resource section  */ 29300000
*        4    SET_OFFSET_RE FIXED(32), /* IWMSET.928: Offset of         29350000
*                                      resource section (SETRE)      */ 29400000
*        4    SET_NUMBER_RE FIXED(16), /* IWMSET.934: Number of         29450000
*                                      resource entries              */ 29500000
*        4    SET_SIZE_RE FIXED(16), /* IWMSET.940: Size of a           29550000
*                                      resource entry                */ 29600000
*       3    SET_HDR_SYS_SECTION,   /* IWMSET.947: System section    */ 29650000
*        4    SET_OFFSET_SYS FIXED(32), /* IWMSET.950: Offset of        29700000
*                                      system section (SETSYS)       */ 29750000
*        4    SET_NUMBER_SYS FIXED(16), /* IWMSET.956: Number of        29800000
*                                      system entries                */ 29850000
*        4    SET_SIZE_SYS FIXED(16), /* IWMSET.962: Size of a system   29900000
*                                      entry                         */ 29950000
*       3    SET_HDR_RESERVED_SECTION, /* IWMSET.969: Reserved slots */ 30000000
*        4    SET_OFFSET_RESERVED FIXED(32), /* IWMSET.972: Reserved    30050000
*                                      offset                        */ 30100000
*        4    SET_NUMBER_RESERVED FIXED(16), /* IWMSET.978: Reserved    30150000
*                                      number                        */ 30200000
*        4    SET_SIZE_RESERVED FIXED(16); /* IWMSET.984: Reserved      30250000
*                                      size                          */ 30300000
*                                                                       30350000
*   /*****************************************************************/ 30400000
*   /*                                                               */ 30450000
*   /* IWMSET.1212: SET SE - Scheduling environment entry            */ 30500000
*   /*                                                               */ 30550000
*   /*****************************************************************/ 30600000
*                                                                       30650000
*   DECLARE                                                             30700000
*     1    SETSE    BASED(*) BDY(WORD),                                 30750000
*      2    SET_SE_DEFINITION,      /* IWMSET.332: SE definition     */ 30800000
*       3    SET_SE_SCHENV_NAME CHAR(16), /* IWMSET.336: Scheduling     30850000
*                                      environment name              */ 30900000
*       3    SET_SE_DESCRIPTION CHAR(32), /* IWMSET.288: Scheduling     30950000
*                                      environment description       */ 31000000
*       3    SET_SE_RESERVED_DEFINITION CHAR(8), /* IWMSET.354:         31050000
*                                      Reserved                      */ 31100000
*      2    SET_SE_OFFSETS,         /* IWMSET.365: SE offsets        */ 31150000
*       3    SET_SE_SR_OFFSET FIXED(31), /* IWMSET.372: Offset of the   31200000
*                                      first scheduling environment-    31250000
*                                      /resource relationship entry     31300000
*                                      for this scheduling              31350000
*                                      environment from the beginning   31400000
*                                      of the SET                    */ 31450000
*       3    SET_SE_SR_COUNT FIXED(31), /* IWMSET.378: Number of        31500000
*                                      scheduling environment-          31550000
*                                      /resource relationship entries   31600000
*                                      for this scheduling              31650000
*                                      environment                   */ 31700000
*       3    SET_SE_OFFSETS_RESERVED(2) FIXED(31); /* IWMSET.1143: SE   31750000
*                                      reserved offsets              */ 31800000
*                                                                       31850000
*   /*****************************************************************/ 31900000
*   /*                                                               */ 31950000
*   /* IWMSET.723: SET SR - Scheduling environment/resource          */ 32000000
*   /* relationship entry                                            */ 32050000
*   /*                                                               */ 32100000
*   /*****************************************************************/ 32150000
*                                                                       32200000
*   DECLARE                                                             32250000
*     1    SETSR    BASED(*) BDY(WORD),                                 32300000
*      2    SET_SR_DEFINITION,      /* IWMSET.401: Definition section*/ 32350000
*       3    SET_SR_SE_INDEX FIXED(31), /* IWMSET.807: Index of the     32400000
*                                      scheduling environment entry     32450000
*                                      within the SET SE section     */ 32500000
*       3    SET_SR_SE_OFFSET FIXED(31), /* IWMSET.396: Offset of the   32600000
*                                      scheduling environment entry     32650000
*                                      from the beginning of the SET */ 32700000
*       3    SET_SR_FLAG1 BIT(8) BDY(BYTE), /* IWMSET.313: Flags     */ 32750000
*        4    SET_SR_LAST_ONE_FOR_SE BIT(1), /* IWMSET.319: Indicates   32800000
*                                      this is the last SR entry for    32850000
*                                      a scheduling environment      */ 32900000
*       3    SET_SR_RESOURCE_STATE FIXED(8), /* IWMSET.840: Required    32950000
*                                      state of the resource for the    33000000
*                                      scheduling environment to be     33050000
*                                      available                     */ 33100000
*       3    SET_SR_RESERVED_DEFINITION1(2) CHAR(1), /* IWMSET.408:     33150000
*                                      SR section reserved           */ 33200000
*       3    SET_SR_RESERVED_DEFINITION2 CHAR(8), /* IWMSET.1240:       33250000
*                                      Reserved                      */ 33400000
*      2    SET_SR_OFFSETS,         /* IWMSET.427: SR offsets section*/ 33450000
*       3    SET_SR_RE_INDEX FIXED(31), /* IWMSET.885: Index of the     33500000
*                                      resource entry within the        33550000
*                                      SETRE section                 */ 33600000
*       3    SET_SR_RE_OFFSET FIXED(31), /* IWMSET.435: Offset of the   33650000
*                                      resource entry from the          33700000
*                                      beginning of the SET          */ 33750000
*       3    SET_SR_OFFSETS_RESERVED(2) FIXED(31); /* IWMSET.442: SR    33800000
*                                      reserved offsets              */ 33850000
*                                                                       33900000
*   /*****************************************************************/ 33950000
*   /*                                                               */ 34000000
*   /* IWMSET.1072: SET RE - Resource entry                          */ 34050000
*   /*                                                               */ 34100000
*   /*****************************************************************/ 34150000
*                                                                       34200000
*   DECLARE                                                             34250000
*     1    SETRE    BASED(*) BDY(BYTE),                                 34300000
*      2    SET_RE_DEFINITION,      /* IWMSET.476: RE definition     */ 34350000
*       3    SET_RE_RESOURCE_NAME CHAR(16), /* IWMSET.484: Resource     34400000
*                                      name                          */ 34450000
*       3    SET_RE_RESOURCE_DESCRIPTION CHAR(32), /* IWMSET.490:       34500000
*                                      Resource description          */ 34550000
*       3    SET_RE_RESERVED_DEFINITION CHAR(8); /* IWMSET.502:         34600000
*                                      Reserved                      */ 34650000
*                                                                       34700000
*   /*****************************************************************/ 34750000
*   /*                                                               */ 34800000
*   /* IWMSET.800: SET SYS - System entry                            */ 34850000
*   /*                                                               */ 34900000
*   /*****************************************************************/ 34950000
*                                                                       35000000
*   DECLARE                                                             35050000
*     1    SETSYS   BASED(*) BDY(WORD),                                 35100000
*      2    SET_SYS_DEFINITION,     /* IWMSET.536: SYS definition    */ 35150000
*       3    SET_SYS_NAME CHAR(8),  /* IWMSET.544: System name. If      35166600
*                                      this field contains binary       35183200
*                                      zeroes, this is an unused        35199800
*                                      entry that contains no status    35216400
*                                      information.                  */ 35233000
*       3    SET_SYS_RESERVED_DEFINITION CHAR(8), /* IWMSET.550:        35250000
*                                      Reserved                      */ 35300000
*      2    SET_SYS_STATUS_PTR POINTER(31); /* IWMSET.568: Address of   35350000
*                                      the system status header         35380000
*                                      (SETSYH) for this system, if     35410000
*                                      there is a system name in the    35440000
*                                      SET_SYS_NAME field            */ 35470000
*                                                                       35500000
*   /*****************************************************************/ 35550000
*   /*                                                               */ 35600000
*   /* IWMSET.804: SET SYS HDR - System status header                */ 35650000
*   /*                                                               */ 35700000
*   /*****************************************************************/ 35750000
*                                                                       35800000
*   DECLARE                                                             35850000
*     1    SETSYH   BASED(*) BDY(WORD),                                 35900000
*      2    SET_SYS_HDR_EYECATCHER CHAR(8), /* IWMSET.846: Eye          35950000
*                                      catcher                       */ 36000000
*      2    SET_SYS_HDR_CONTROL,    /* IWMSET.611: System status        36050000
*                                      header control information    */ 36100000
*       3    SET_SYS_HDR_TOD_VALUE BIT(64), /* IWMSET.234: Time stamp   36150000
*                                      of when the service number       36200000
*                                      definition was installed. This   36250000
*                                      is a copy of the                 36300000
*                                      SET_HDR_TOD_VALUE             */ 36350000
*       3    SET_SYS_HDR_MODIFIED BIT(64), /* IWMSET.1165: A time       36400000
*                                      stamp for the most recent        36450000
*                                      modification to status           36500000
*                                      information in a SETSES or       36550000
*                                      SETRES entry                  */ 36600000
*       3    SET_SYS_HDR_WLM_VERSION_NUMBER FIXED(8), /* IWMSET.318:    36650000
*                                      Version number of system         36700000
*                                      status header                 */ 36750000
*       3    SET_SYS_HDR_CONTROL_RESERVED FIXED(8), /* IWMSET.1171:     36800000
*                                      Reserved                      */ 36850000
*       3    SET_SYS_HDR_SIZE_OF_HEADER FIXED(16), /* IWMSET.242:       36900000
*                                      Size of the system status        36950000
*                                      header                        */ 37000000
*       3    SET_SYS_HDR_WHOLE_SIZE FIXED(32), /* IWMSET.292: Size of   37050000
*                                      the system status area           37100000
*                                      including this header, all       37150000
*                                      SETSES entries and all SETRES    37200000
*                                      entries                       */ 37250000
*       3    SET_SYS_HDR_CONTROL_RESERVED2(2) /* IWMSET.619: Reserved*/ 37300000
*                FIXED(32),                                             37350000
*      2    SET_SYS_HDR_OFFSETS_AREA, /* IWMSET.629: System status      37400000
*                                      header offsets area           */ 37450000
*       3    SET_SYS_HDR_SES_SECTION, /* IWMSET.637: Scheduling         37500000
*                                      environment status section    */ 37550000
*        4    SET_OFFSET_SES FIXED(32), /* IWMSET.640: Offset of the    37600000
*                                      scheduling environment status    37650000
*                                      section (SETSES)              */ 37700000
*        4    SET_NUMBER_SES FIXED(16), /* IWMSET.646: Number of        37750000
*                                      scheduling environment status    37800000
*                                      entries                       */ 37850000
*        4    SET_SIZE_SES FIXED(16), /* IWMSET.652: Size of a          37900000
*                                      scheduling environment status    37950000
*                                      entry                         */ 38000000
*       3    SET_SYS_HDR_RES_SECTION, /* IWMSET.658: Resource status    38050000
*                                      section                       */ 38100000
*        4    SET_OFFSET_RES FIXED(32), /* IWMSET.661: Offset of the    38137500
*                                      resource status entries          38175000
*                                      (SETRES)                      */ 38212500
*        4    SET_NUMBER_RES FIXED(16), /* IWMSET.667: Number of        38250000
*                                      resource status entries       */ 38300000
*        4    SET_SIZE_RES FIXED(16), /* IWMSET.673: Size of a          38350000
*                                      resource status entry         */ 38400000
*       3    SET_SYS_HDR_RESERVED_SECTION, /* IWMSET.680: Reserved      38450000
*                                      slots                         */ 38500000
*        4    SET_OFFSET_RESERVED1 FIXED(32), /* IWMSET.683: Reserved   38550000
*                                      offset                        */ 38600000
*        4    SET_NUMBER_RESERVED1 FIXED(16), /* IWMSET.689: Reserved   38650000
*                                      number                        */ 38700000
*        4    SET_SIZE_RESERVED1 FIXED(16), /* IWMSET.695: Reserved     38750000
*                                      size                          */ 38800000
*      2    SET_SYS_HDR_RESERVED(4) FIXED(32); /* IWMSET.1044:          38850000
*                                      Reserved                      */ 38900000
*                                                                       38950000
*   /*****************************************************************/ 39000000
*   /*                                                               */ 39050000
*   /* IWMSET.870: SET SES - Scheduling environment system status    */ 39100000
*   /*                                                               */ 39150000
*   /*****************************************************************/ 39200000
*                                                                       39250000
*   DECLARE                                                             39300000
*     1    SETSES   BASED(*) BDY(WORD),                                 39350000
*      2    SET_SES_DEFINITION,     /* IWMSET.745: SES definition    */ 39400000
*       3    SET_SES_SE_INDEX FIXED(31), /* IWMSET.753: Index of the    39450000
*                                      scheduling environment entry     39500000
*                                      within the SETSE section of      39512500
*                                      the definition area. SETSES      39525000
*                                      entries correspond               39537500
*                                      positionally to SETSE entries    39550000
*                                      (for example the third SETSES    39562500
*                                      entry corresponds to the third   39575000
*                                      SETSE entry). The index is       39587500
*                                      here primarily as a debugging    39600000
*                                      aid, such as to detect an        39612500
*                                      overlay.                      */ 39625000
*      2    SET_SES_STATUS,         /* IWMSET.1241: SES status       */ 39637500
*       3    SET_SES_FLAG1 BIT(8) BDY(BYTE), /* IWMSET.759: Flag 1   */ 39650000
*        4    SET_SES_AVAILABLE BIT(1), /* IWMSET.765: Indicates the    39700000
*                                      scheduling environment is        39750000
*                                      available                     */ 39800000
*       3    SET_SES_FLAG2 BIT(8) BDY(BYTE), /* IWMSET.350: Flag 2   */ 39850000
*        4    SET_SES_REQUIRES_ENF BIT(1), /* IWMSET.1270: The          39900000
*                                      scheduling environment has had   39950000
*                                      its status changed (either       40000000
*                                      SET_SES_AVAILABLE was set or     40050000
*                                      reset) and we must notify any    40100000
*                                      users interested in scheduling   40150000
*                                      environments via ENF 57       */ 40200000
*        4    SET_SES_REQUIRES_REC_ENF BIT(1), /* IWMSET.730: The       40250000
*                                      scheduling environment has had   40300000
*                                      its status changed. Similar to   40350000
*                                      SET_SES_REQ- UIRES_ENF but set   40400000
*                                      in WLM recovery paths.        */ 40450000
*       3    SET_SES_RESERVED BIT(16), /* IWMSET.771: Reserved       */ 40500000
*       3    SET_SES_RESERVED_DEFINITION CHAR(8); /* IWMSET.780:        40550000
*                                      Reserved                      */ 40600000
*                                                                       40650000
*   /*****************************************************************/ 40700000
*   /*                                                               */ 40750000
*   /* IWMSET.883: SET RES - Resource system status                  */ 40800000
*   /*                                                               */ 40850000
*   /*****************************************************************/ 40900000
*                                                                       40950000
*   DECLARE                                                             41000000
*     1    SETRES   BASED(*) BDY(WORD),                                 41050000
*      2    SET_RES_DEFINITION,     /* IWMSET.815: RES definition    */ 41100000
*       3    SET_RES_RE_INDEX FIXED(31), /* IWMSET.823: Index of the    41150000
*                                      resource entry within the        41164200
*                                      SETRE section of the             41178400
*                                      definition area. SETRES          41192600
*                                      entries correspond               41206800
*                                      positionally to SETRE entries    41221000
*                                      (for example the fourth SETRES   41235200
*                                      entry corresponds to the         41249400
*                                      fourth SETRE entry). The index   41263600
*                                      is here primarily as a           41277800
*                                      debugging aid, such as to        41292000
*                                      detect an overlay.            */ 41306200
*      2    SET_RES_STATUS,         /* IWMSET.415: RES status        */ 41320400
*       3    SET_RES_STATE FIXED(8), /* IWMSET.829: Current state of    41334600
*                                      the resource                  */ 41350000
*       3    SET_RES_FLAG1 BIT(8) BDY(BYTE), /* IWMSET.853: Flag 1   */ 41400000
*        4    SET_RES_MODIFICATION_IN_PROGRESS BIT(1), /*               41450000
*                                      IWMSET.1351: Indicates that a    41500000
*                                      F WLM,RESOURCE or IWMSESET       41550000
*                                      request is in progress        */ 41600000
*       3    SET_RES_RESERVED BIT(16), /* IWMSET.1005: Reserved      */ 41650000
*       3    SET_RES_RESERVED_DEFINITION CHAR(8); /* IWMSET.862:        41750000
*                                      Reserved                      */ 41800000
*                                                                       41850000
*   /*****************************************************************/ 41900000
*   /*                                                               */ 41950000
*   /* IWMSET.102: SET eyecatcher - 'IWMSET'                         */ 42000000
*   /*                                                               */ 42050000
*   /*****************************************************************/ 42100000
*                                                                       42150000
*   DECLARE                                                             42200000
*     IWMSET_ID CHAR(8) CONSTANT('IWMSET  ');                           42250000
*                                                                       42300000
*   /*****************************************************************/ 42350000
*   /*                                                               */ 42400000
*   /* IWMSET.852: SET system status eyecatcher                      */ 42450000
*   /*                                                               */ 42500000
*   /*****************************************************************/ 42550000
*                                                                       42600000
*   DECLARE                                                             42650000
*     IWMSET_SYS_ID CHAR(8) CONSTANT('IWMSETSY');                       42700000
*                                                                       42750000
*   /*****************************************************************/ 42800000
*   /*                                                               */ 42850000
*   /* IWMSET.111: Functionality level introduced by WLM in JBB6604  */ 42900000
*   /*                                                               */ 42950000
*   /*****************************************************************/ 43000000
*                                                                       43050000
*   DECLARE                                                             43100000
*     IWMSET_LEVEL004 FIXED(8) CONSTANT(4);                             43150000
*                                                                       43200000
*   /*****************************************************************/ 43250000
*   /*                                                               */ 43300000
*   /* IWMSET.120: WLM JBB6604 version                               */ 43350000
*   /*                                                               */ 43400000
*   /*****************************************************************/ 43450000
*                                                                       43500000
*   DECLARE                                                             43550000
*     IWMSET_VER604 FIXED(8) CONSTANT(4);                               43600000
*                                                                       43650000
*   /*****************************************************************/ 43700000
*   /*                                                               */ 43750000
*   /* IWMSET.129: Current version level used when checking          */ 43800000
*   /* functionality within WLM product                              */ 43850000
*   /*                                                               */ 43900000
*   /*****************************************************************/ 43950000
*                                                                       44000000
*   DECLARE                                                             44050000
*     IWMSET_CURRENT_VER FIXED(8) CONSTANT(4);                          44100000
*                                                                       44100800
*   /*****************************************************************/ 44101600
*   /*                                                               */ 44102400
*   /* IWMSET.601: SET_SR_RESOURCE_STATE that indicates resource is  */ 44103200
*   /* desired to be ON                                              */ 44104000
*   /*                                                               */ 44104800
*   /*****************************************************************/ 44105600
*                                                                       44106400
*   DECLARE                                                             44107200
*     SET_SR_ON FIXED(8) CONSTANT(4);                                   44108000
*                                                                       44108800
*   /*****************************************************************/ 44109600
*   /*                                                               */ 44110400
*   /* IWMSET.1394: SET_RES_STATE that indicates resource is ON      */ 44111200
*   /*                                                               */ 44112000
*   /*****************************************************************/ 44112800
*                                                                       44113600
*   DECLARE                                                             44114400
*     SET_RES_ON FIXED(8) CONSTANT(4);                                  44115200
*                                                                       44116000
*   /*****************************************************************/ 44116800
*   /*                                                               */ 44117600
*   /* IWMSET.1371: SET_SR_RESOURCE_STATE that indicates resource is */ 44118400
*   /* desired to be OFF                                             */ 44119200
*   /*                                                               */ 44120000
*   /*****************************************************************/ 44120800
*                                                                       44121600
*   DECLARE                                                             44122400
*     SET_SR_OFF FIXED(8) CONSTANT(8);                                  44123200
*                                                                       44124000
*   /*****************************************************************/ 44124800
*   /*                                                               */ 44125600
*   /* IWMSET.1403: SET_RES_STATE that indicates resource is OFF     */ 44126400
*   /*                                                               */ 44127200
*   /*****************************************************************/ 44128000
*                                                                       44128800
*   DECLARE                                                             44129600
*     SET_RES_OFF FIXED(8) CONSTANT(8);                                 44130400
*                                                                       44131200
*   /*****************************************************************/ 44132000
*   /*                                                               */ 44132800
*   /* IWMSET.1390: SET_SR_RESOURCE_STATE that is reserved           */ 44133600
*   /*                                                               */ 44134400
*   /*****************************************************************/ 44135200
*                                                                       44136000
*   DECLARE                                                             44136800
*     SET_SR_RESERVED FIXED(8) CONSTANT(12);                            44137600
*                                                                       44138400
*   /*****************************************************************/ 44139200
*   /*                                                               */ 44140000
*   /* IWMSET.1357: SET_RES_STATE that indicates resource is RESET   */ 44140800
*   /*                                                               */ 44141600
*   /*****************************************************************/ 44142400
*                                                                       44143200
*   DECLARE                                                             44144000
*     SET_RES_RESET FIXED(8) CONSTANT(12);                              44144800
*                                                                       44150000
*   /*****************************************************************/ 44200000
*   /*                                                               */ 44250000
*   /* IWMSET.1221: CBGEN control statements                         */ 47900000
*   /*                                                               */ 47950000
*   /*****************************************************************/ 48000000
*                                                                       48050000
*@LOGIC;                                                                48100000
*#PRAGMA TOOL=CBGEN.                                                    48150000
*#DELETE.IWMSET_ID                                                      48200000
*#DELETE.IWMSET_SYS_ID                                                  48250000
*#EPRAGMA.                                                              48300000
*@ENDLOGIC;                                                             48350000
*/* End of PL/X Source                                               */ 48400000
* %IF IWMSET_LIST ^= 'NO' &                                             48450000
*    ZCBPRINT ^= 'NO' %THEN                                             48500000
*   %GOTO IWMSET_4;                                                     48550000
*   @LIST POP NOECHO;                                                   48600000
* %IWMSET_4:;                                                           48650000
* %END;                                                                 48700000
