*                                                                       00050000
* %DCL IWMSVDCR_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IWMSVDCR_INCLUDED;                                        00150000
* %IF IWMSVDCR_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*%/* Start of PL/X PreProlog Code */;                                   00262500
*                                                                       00275000
*%/* End of PL/X PreProlog Code */;                                     00287500
*/* Macro made bi-lingual on 00014. CBGEN compile date 00013         */ 00417490
*% /*                                                                   00500000
         MACRO                                                          00550000
         IWMSVDCR &DSECT=YES,&LIST=YES,&TITLE=YES,&SVDCRHDR=YES,       *00587500
               &SVDCRSST=COND,&SVDCRRUL=COND,&SVDCRGRP=COND,           *00625000
               &SVDCRGVS=COND,&SVDCREXT=COND                            00662500
         GBLC  &IWMSVDCR_INCLUDED                                       00700000
         GBLC  &ZCBPRINT                                                00750000
&IWMSVDCR_INCLUDED SETC 'YES'                                           00800000
         AIF   ('&LIST' EQ 'NONE').P0                                   00816600
         AIF   ('&TITLE' EQ 'NO').P5                                    00833200
 TITLE   'IWMSVDCR  - WLM Service Definition Classification       '     00850000
.P5      ANOP                                                           00875000
**/ IWMSVDCR_1:;                                                        00900000
*/***START OF SPECIFICATIONS******************************************/ 00950000
*/*                                                                  */ 01000000
*/*01* Proprietary statement:                                        */ 01050000
*/*                                                                  */ 01100000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 01150000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 01200000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1993, 2000                 */ 01250000
*/*                                                                  */ 01350000
*/*                                                                  */ 01400000
*/*01* External classification: GUPI                             @L2C*/ 01450000
*/*01* End of External classification                                */ 01500000
*/*                                                                  */ 01550000
*/*01* Status: HBB7703                                               */ 01600000
*/*                                                                  */ 01650000
*/*01* Descriptive Name: WLM Service Definition Classification       */ 01700000
*/*                      Rule mapping                                */ 01750000
*/*                                                                  */ 01800000
*/*02*  Acronym: SVDCR                                               */ 01850000
*/*                                                                  */ 01900000
*/*01* Macro Name: IWMSVDCR                                          */ 01950000
*/*                                                                  */ 02000000
*/*01* DSECT Name: SVDCRHDR                                      @P1C*/ 02050000
*/*                SVDCRSST                                      @P4A*/ 02058300
*/*                SVDCRRUL                                      @P4A*/ 02066600
*/*                SVDCRGRP                                      @P4A*/ 02074900
*/*                SVDCRGVS                                      @P4A*/ 02083200
*/*                SVDCREXT                                      @P4A*/ 02091500
*/*                                                                  */ 02100000
*/*01* Component: Workload Manager (SCWLM)                           */ 02150000
*/*                                                                  */ 02200000
*/*01* Eye-Catcher: SVDC                                             */ 02250000
*/*02*  Offset: 0                                                    */ 02300000
*/*02*  Length: CHAR(4)                                              */ 02350000
*/*                                                                  */ 02400000
*/*01* Storage Attributes:                                           */ 02450000
*/*02*  Subpool: Any                                                 */ 02500000
*/*02*  Key: Any                                                     */ 02550000
*/*02*  Residency: Above 16M line                                    */ 02600000
*/*                                                                  */ 02650000
*/*01* Size: Determined at run time                                  */ 02700000
*/*                                                                  */ 02750000
*/*01* Created by: Caller                                            */ 02800000
*/*                                                                  */ 02850000
*/*01* Pointed to by: offset within SERVD (IWMSERVD) mapping     @P1C*/ 02900000
*/*                                                                  */ 02950000
*/*01* Serialization: None                                           */ 03000000
*/*                                                                  */ 03050000
*/*01* Function: Contains service definition classification rule     */ 03100000
*/*              information returned by the IWMCQRY service         */ 03120000
*/*                                                                  */ 03140000
*/*              All timestamps are local time expressed in          */ 03160000
*/*              STCK format.                                        */ 03180000
*/*                                                                  */ 03200000
*/*01* Restrictions:                                                 */ 03250000
*/*              Some fields are not applicable for this structure   */ 03275000
*/*              when it is returned by the IWMCQRY service. Those   */ 03300000
*/*              fields are noted in the comments.                   */ 03325000
*/*                                                                  */ 03325800
*/*01* Method of Access:                                             */ 03400000
*/*                                                                  */ 03450000
*/*02*  ASM:                                                         */ 03500000
*/*          Specify: IWMSVDCR                                       */ 03550000
*/*                                                                  */ 03600000
*/*02*  PLX:                                                         */ 03650000
*/*                                                                  */ 03700000
*/*          %INCLUDE SYSLIB(IWMSVDCR)                               */ 03750000
*/*          Using on SVDCRHDR gives addressability to the header    */ 03800000
*/*          area of the service definition classification rule.     */ 03850000
*/*          Subsequent usings must be done to get addressability    */ 03900000
*/*          to the additional sections (DSECTs) as follows:         */ 03950000
*/*          DSECT    USING                                          */ 04000000
*/*          -----    -----                                          */ 04050000
*/*          SVDCRSST A(SVDCRHDR) + SVDCRSO   (multiple)             */ 04100000
*/*          SVDCRRUL A(SVDCRSST) + SVDCRSRO  (multiple)             */ 04150000
*/*          SVDCRGRP A(SVDCRHDR) + SVDCRGO   (multiple)         @L2C*/ 04200000
*/*          SVDCRGVS A(SVDCRGRP) + SVDCRGVO  (multiple)         @P1C*/ 04237500
*/*          SVDCREXT A(SVDCRHDR) + SVDCR_SST_EXT_OFF (multiple) @L2A*/ 04275000
*/*                                                                  */ 04300000
*/*          Subsequent elements of a section can be found           */ 04350000
*/*          by adding the size of one element as indicated          */ 04400000
*/*          in the header to the basing.                            */ 04450000
*/*                                                                  */ 04458100
*/*01* Notes:                                                    @P7A*/ 04466200
*/*                                                              @P7A*/ 04474300
*/*    To add extensions to the service definition               @P7A*/ 04482400
*/*      classification rules:                                   @P7A*/ 04490500
*/*                                                              @P7A*/ 04498600
*/*    The following fields must be updated:                     @P7A*/ 04506700
*/*                                                              @P7A*/ 04514800
*/*     1) SVDCR_EXT_DATA_OFF - the offset to the beginning of   @P7A*/ 04522900
*/*                             the extension data, from the     @P7A*/ 04531000
*/*                             beginning of IWMSVDCR.           @P7A*/ 04539100
*/*     2) SVDCR_EXT_DATA_LEN - the total length of the          @P7A*/ 04547200
*/*                             extension data, not including    @P7A*/ 04555300
*/*                             the length of the extension      @P7A*/ 04563400
*/*                             entries.                         @P7A*/ 04571500
*/*                                                              @P7A*/ 04579600
*/*    For each part of the service definition classification    @P7A*/ 04587700
*/*    rules with extensions, the appropriate fields in the      @P7A*/ 04595800
*/*    SVDCR must be updated with:                               @P7A*/ 04603900
*/*                                                              @P7A*/ 04612000
*/*     1) the offset to the extension entries from the          @P7A*/ 04620100
*/*        beginning of IWMSVDCR (i.e. SVDCR_SST_EXT_OFF).       @P7A*/ 04628200
*/*                                                              @P7A*/ 04636300
*/*     2) the number of extension entries                       @P7A*/ 04644400
*/*         (i.e. SVDCR_SST_EXT_NUM).                            @P7A*/ 04652500
*/*                                                              @P7A*/ 04660600
*/*     3) the length of an extension entry                      @P7A*/ 04668700
*/*         (i.e. SVDCR_SST_EXT_SIZ).                            @P7A*/ 04676800
*/*                                                              @P7A*/ 04684900
*/*    Each extension entry (mapped by DSECT SVDCREXT) must have @P7A*/ 04693000
*/*    the following fields filled in:                           @P7A*/ 04701100
*/*                                                              @P7A*/ 04709200
*/*     1) SVDCRID - identifier of the product adding the        @P7A*/ 04717300
*/*                  extension.                                  @P7A*/ 04725400
*/*                                                              @P7A*/ 04733500
*/*     2) SVDCRROB - Name of related object.                    @P7A*/ 04741600
*/*                                                              @P7A*/ 04749700
*/*     3) SVDCREDL - The length of the extension data.          @P7A*/ 04757800
*/*                                                              @P7A*/ 04765900
*/*     4) SVDCREDO - The offset to the extension data from the  @P7A*/ 04774000
*/*                   start of the extension data.               @P7A*/ 04782100
*/*                                                              @P7A*/ 04790200
*/*                                                                  */ 04800000
*/*01* Change Activity:                                              */ 04850000
*/*    $L0=WLMI    HBB5510  921231 PD88IK: Workload Manager I        */ 04900000
*/*    $T1=PIG5037 HBB5510  940202 PD88IK: OW01260: CDPI change  @T1A*/ 04912500
*/*    $L1=ENCLV   HBB5520  940210 PDD5  : Enclave Support           */ 04925000
*/*    $L2=WLMRM   HBB5520  940323 PDBV  : WLM RM                @L2A*/ 04937500
*/*    $P1=PN71296 HBB5520  940908 PDD5  : Correct DSECT info    @P1A*/ 04943700
*/*    $P2=PN71610 HBB5520  940915 PDDB  : Reserve future            */ 04944300
*/*                                        qualifier types       @P2A*/ 04944900
*/*    $P3=PN71618 HBB5520  940915 PDDB  : Reserve future            */ 04945500
*/*                                        group types           @P3A*/ 04946100
*/*    $P4=PN71675 HBB5520  941020 PDD0  : Correct DSECT info    @P4A*/ 04946700
*/*    $P5=PIG5510 HBB5510  940915 PD72DB: OW08866                   */ 04947300
*/*                                        Migration support     @P5A*/ 04947900
*/*    $P6=PIG5386 HBB5520  940915 PD72DB: OW08866                   */ 04948500
*/*                                        Migration support     @P6A*/ 04949100
*/*    $P7=PN72034 HBB5520  941201 PD88D0: Prolog updates        @P7A*/ 04949500
*/*    OW13309              950605 PD88DA: Add SVDCR_LEVEL000        */ 04949600
*/*                                                          @WA13309*/ 04949700
*/*    $WLMPSTP    HBB6603  950612 PD88DB: Stored SQL procedures     */ 04958000
*/*                                                          @WLMPSTP*/ 04966300
*/*    $WLMPENH    HBB6603  951101 PD88KN: Kin Ng- New classification*/ 04974600
*/*                                        attributes        @WLMPENH*/ 04982900
*/*    $WLMPBAT    JBB6604  960925 B9HAGD: Classify by priority      */ 04985600
*/*                                                          @WLMPBAT*/ 04988300
*/*    $WLMPSDC    HBB6606  970905 B9HAKP: Add description fields for*/ 04989200
*/*                                        Serv Def comments @WLMPSDC*/ 04990100
*/*    $PVT0380    HBB6606  970905 B9HADB: Description fields for    */ 04990300
*/*                                        Serv Def comments         */ 04990500
*/*                                        not for IWMCQRY   @WLMPSDC*/ 04990700
*/*    $WLMPMQS    JBB6607  980417 B9HARF: Process Name              */ 04990800
*/*                                                          @WLMPMQS*/ 04990900
*/*    $WLMPGMY    HBB7703  991027 B9HAPC: Patrick Chan              */ 04991600
*/*                                        - Add constant for        */ 04992300
*/*                                        funcationality level 11   */ 04993000
*/*                                        - Add constant for WLM R8,*/ 04993700
*/*                                        funcationality level 8    */ 04994400
*/*                                        - Add bit for System Name,*/ 04995100
*/*                                        Sysplex Name, Subsystem   */ 04995800
*/*                                        Collection, Scheduling    */ 04996500
*/*                                        Environment and system    */ 04997200
*/*                                        name group                */ 04997900
*/*                                                          @WLMPGMY*/ 04998600
*/*    $WLMPGMS    HBB7703  991222 B9HAPC: Patrick Chan              */ 04998670
*/*                                        - Add bit for Storage     */ 04998740
*/*                                        Protection                */ 04998810
*/*                                                          @WLMPGMS*/ 04998880
*/*    $WLMPGMT    HBB7703  991222 B9HAPC: Patrick Chan              */ 04998950
*/*                                        - Add bit for Transaction */ 04999020
*/*                                        Management Region         */ 04999090
*/*                                                          @WLMPGMT*/ 04999160
*/*                                                                  */ 04999300
*/***END OF SPECIFICATIONS********************************************/ 05000000
*% /*                                                                   05050000
.P0      ANOP                                                           05075000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05100000
         AIF   ('&LIST' EQ 'YES').P2                                    05150000
.P1      ANOP                                                           05200000
         PUSH  PRINT                                                    05250000
         PRINT OFF                                                      05300000
.P2      ANOP                                                           05350000
*                                                                       05400000
*    *****************************************************************  05450000
*    *                                                               *  05500000
*    * Service definition classification rule header section         *  05550000
*    *                                                               *  05600000
*    *****************************************************************  05650000
*                                                                       05700000
*                                                                       05750000
         AIF   ('&SVDCRHDR' EQ 'NO').L0002                              05800000
         AIF   ('&DSECT' EQ 'YES').L0003                                05850000
         AIF   ('&SVDCRHDR' NE 'YES').L0002                             05900000
SVDCRHDR DS    0D        Service definition classification rule header *05950000
                         section                                        06000000
         AGO   .L0004                                                   06050000
.L0003   ANOP                                                           06100000
SVDCRHDR DSECT           Service definition classification rule header *06150000
                         section                                        06200000
.L0004   ANOP                                                           06250000
SVDCRNAM DS    1CL0004   Eyecatcher                                     06300000
SVDCRLVL DS    1FL1      Functionality level of the SVDCR.              06308900
*                                                                       06317800
*      ***************************************************************  06326700
*      *                                                             *  06335600
*      * The functionality level defines                                06344500
*      * the highest level of WLM function                              06353400
*      * that exists in the SVDCR.                                      06362300
*      *                                                             *  06371200
*      ***************************************************************  06380100
*                                                                       06389000
*                                                                       06397900
SVDCRWVN DS    1FL1      WLM version number                             06406800
SVDCRDIL DS    1FL2      Size in bytes of header section                06416600
SVDCRSIZ DS    1FL4      Size in bytes of the whole classification     *06450000
                         rule definition                                06500000
SVDCRSO  DS    1FL4      Offset of subsystem type section if number of *06530000
                         subsystems is nonzero (otherwise this field   *06560000
                         is ignored)                                    06590000
SVDCRSN  DS    1FL2      Number of subsystem type entries               06620000
SVDCRSS  DS    1FL2      Size of a subsystem type entry                 06650000
SVDCRRO  DS    1FL4      Offset of classification rule section if      *06680000
                         number of classification rules is nonzero     *06710000
                         (otherwise this field is ignored)              06740000
SVDCRRN  DS    1FL2      Number of classification rule entries          06770000
SVDCRRS  DS    1FL2      Size of a classification rule entry            06800000
SVDCRGO  DS    1FL4      Offset of group section if number of groups   *06837500
                         is nonzero (othwerwise this field is ignored)  06875000
SVDCRGN  DS    1FL2      Number of group entries                        06912500
SVDCRGS  DS    1FL2      Size of a group entry                          06950000
SVDCRVO  DS    1FL4      Offset of group value section if the groups   *06987500
                         is nonzero (othwerwise this field is ignored   07025000
SVDCRVN  DS    1FL2      Number of group value entries                  07062500
SVDCRVS  DS    1FL2      Size of a group value entry                    07100000
SVDCRLN  DS    1FL2      Deepest allowed level of nesting of           *07133300
                         classification rules (cannot exceed 4)         07166600
         DS    1CL0002   Reserved                                       07200000
         DS    1CL0032   Reserved for additional triplets               07202700
SVDCR_EXT_DATA_OFF DS 1FL4 Offset of extended data - this field not    *07205400
                         applicable for the IWMCQRY interface           07208100
SVDCR_EXT_DATA_LEN DS 1FL4 Length of extended data - this field not    *07210800
                         applicable for the IWMCQRY interface           07213500
SVDCR_SST_EXT_OFF DS 1FL4 Offset of subsystem type extension section   *07216200
                         if number of subsystem type extensions is     *07218900
                         nonzero (otherwise this field is ignored) -   *07221600
                         this field not applicable for the IWMCQRY     *07224300
                         interface                                      07227000
SVDCR_SST_EXT_NUM DS 1FL2 Number of subsystem type extension entries - *07229700
                         this field not applicable for the IWMCQRY     *07232400
                         interface                                      07235100
SVDCR_SST_EXT_SIZ DS 1FL2 Length of each subsystem type extension      *07237800
                         entry - this field not applicable for the     *07240500
                         IWMCQRY interface                              07243200
         DS    1CL0032   Reserved for additional extension triplets     07245900
SVDCRHDR_LEN EQU *-SVDCRHDR                                             07250000
.L0002   ANOP                                                           07300000
*                                                                       07350000
*      ***************************************************************  07400000
*      *                                                             *  07450000
*      * Subsystem type section                                      *  07500000
*      *                                                             *  07550000
*      ***************************************************************  07600000
*                                                                       07650000
*                                                                       07700000
         AIF   ('&SVDCRSST' EQ 'NO').L0005                              07750000
         AIF   ('&DSECT' EQ 'YES').L0006                                07800000
         AIF   ('&SVDCRSST' NE 'YES').L0005                             07850000
SVDCRSST DS    0F        Subsystem type section                         07900000
         AGO   .L0007                                                   07950000
.L0006   ANOP                                                           08000000
SVDCRSST DSECT           Subsystem type section                         08050000
.L0007   ANOP                                                           08100000
SVDCRSNM DS    1CL0004   Subsystem type name                            08150000
SVDCRSDE DS    1CL0032   Subsystem type description (this field not    *08183300
                         provided for IWMCQRY)                          08216600
SVDCRSFL DS    0CL0001   Subsystem type flags                           08258300
SVDCRSCI EQU   X'80'     Default service class name specified           08300000
SVDCRSPI EQU   X'40'     Default report class name specified            08350000
         ORG   SVDCRSFL+X'00000001'                                     08400000
         DS    1CL0003   Reserved                                       08450000
SVDCRSCN DS    1CL0008   Service class name to which work for this     *08472700
                         subsystem type will be classified if not      *08495400
                         overridden by service class associated with a *08518100
                         particular rule. This field valid only if     *08540800
                         SVDCRSCI is on                                 08563500
SVDCRSPN DS    1CL0008   Report class name to which work for this      *08586200
                         subsystem type will be reported if not        *08608900
                         overridden by report class associated with a  *08631600
                         particular rule. This field valid only if     *08654300
                         SVDCRSPI is on                                 08677000
SVDCRSRO DS    1FL4      Offset to the first classification rule for   *08700000
                         this subsystem type from the beginning of     *08733300
                         this SVDCRSST entry                            08766600
SVDCRSRN DS    1FL2      Total number of classification rules for this *08800000
                         subsystem type                                 08850000
         DS    1CL0002   Reserved                                       08900000
SVDCRSIU DS    1CL0008   Userid of subsystem type creator (this field  *08927700
                         not provided for IWMCQRY)                      08955400
SVDCRSIT DS    1CL0008   Timestamp of initial creation (this field not *08983100
                         provided for IWMCQRY)                          09010800
SVDCRSRU DS    1CL0008   Userid of subsystem type last update (this    *09038500
                         field not provided for IWMCQRY)                09066200
SVDCRSRT DS    1CL0008   Timestamp of subsystem type last update (this *09093900
                         field not provided for IWMCQRY)                09121600
SVDCRSST_LEN EQU *-SVDCRSST                                             09150000
.L0005   ANOP                                                           09200000
*                                                                       09250000
*      ***************************************************************  09300000
*      *                                                             *  09350000
*      * Classification rule section                                 *  09400000
*      *                                                             *  09450000
*      ***************************************************************  09500000
*                                                                       09550000
*                                                                       09600000
         AIF   ('&SVDCRRUL' EQ 'NO').L0008                              09650000
         AIF   ('&DSECT' EQ 'YES').L0009                                09700000
         AIF   ('&SVDCRRUL' NE 'YES').L0008                             09750000
SVDCRRUL DS    0F        Classification rule entry                      09800000
         AGO   .L000A                                                   09850000
.L0009   ANOP                                                           09900000
SVDCRRUL DSECT           Classification rule entry                      09950000
.L000A   ANOP                                                           10000000
SVDCRRQT DS    0CL0004   Classification rule qualifier type to         *10021400
                         indicate the type of value in SVDCRRQV. Each  *10042800
                         qualifier type takes a character value with   *10064200
                         optional masking or wildcarding unless        *10085600
                         otherwise noted.                               10107000
SVDCRRQT_BYTE1 DS 0CL0001 First byte                                    10128400
SVDCRRTN EQU   X'80'     Transaction name                               10150000
SVDCRRTC EQU   X'40'     Transaction class                              10200000
SVDCRRUI EQU   X'20'     Userid                                         10250000
SVDCRRSN EQU   X'10'     Subsystem name                                 10300000
SVDCRRNI EQU   X'08'     Net id                                         10350000
SVDCRRLU EQU   X'04'     LU name                                        10400000
SVDCRRAC EQU   X'02'     Accounting information                         10450000
SVDCRRSP EQU   X'01'     Subsystem parameter                            10500000
         ORG   SVDCRRQT_BYTE1+X'00000001'                               10515000
SVDCRRQT_BYTE2 DS 0CL0001 Second byte                                   10530000
SVDCRRQT_COLL_NAME EQU X'80' Collection name                            10545000
SVDCRRQT_CORR_INFO EQU X'40' Correlation information                    10560000
SVDCRRQT_CONN_TYPE EQU X'20' Connection type                            10575000
SVDCRRQT_PACK_NAME EQU X'10' Package name                               10590000
SVDCRRQT_PLAN_NAME EQU X'08' Plan name                                  10605000
SVDCRRQT_PERFORM EQU X'04' Perform - although this is a number, it is  *10607000
                         treated as character data, i.e. masking and   *10609000
                         wildcarding can be used, relational operators *10611000
                         cannot be used                                 10613000
SVDCRRQT_PROC_NAME EQU X'02' Procedure Name                             10615000
SVDCRRQT_PRIORITY EQU X'01' Priority - qualifier value is a number     *10616600
                         optionally preceded by a relational operator   10618200
         ORG   SVDCRRQT_BYTE2+X'00000001'                               10619500
SVDCRRQT_BYTE3 DS 0CL0001 Third byte                                    10620900
SVDCRRQT_PROCESS_NAME EQU X'80' Process Name                            10621800
SVDCRRQT_SYSTEM_NAME EQU X'40' System Name                              10622100
SVDCRRQT_SYSPLEX_NAME EQU X'20' Sysplex Name                            10622400
SVDCRRQT_SUBSYSTEM_COLLECTION EQU X'10' Subsystem Collection            10622700
SVDCRRQT_SCHEDULING_ENVIRONMENT EQU X'08'                               10623000
*                                                                       10623300
*      ***************************************************************  10623600
*      *                                                             *  10623900
*      * Scheduling Environment                                         10624200
*      *                                                             *  10624500
*      ***************************************************************  10624800
*                                                                       10625100
*                                                                       10625400
SVDCRRQT_B3_RSV04 EQU X'04' Reserved for future type and must be zero   10626300
SVDCRRQT_B3_RSV02 EQU X'02' Reserved for future type and must be zero   10627200
SVDCRRQT_B3_RSV01 EQU X'01' Reserved for future type and must be zero   10628100
         ORG   SVDCRRQT_BYTE3+X'00000001'                               10629000
SVDCRRQT_BYTE4 DS 0CL0001 Reserved for future types                     10629900
SVDCRRQT_B4_RSV80 EQU X'80' Reserved for future type and must be zero   10630800
SVDCRRQT_B4_RSV40 EQU X'40' Reserved for future type and must be zero   10631700
SVDCRRQT_B4_RSV20 EQU X'20' Reserved for future type and must be zero   10632600
SVDCRRQT_B4_RSV10 EQU X'10' Reserved for future type and must be zero   10633500
SVDCRRQT_B4_RSV08 EQU X'08' Reserved for future type and must be zero   10634400
SVDCRRQT_B4_RSV04 EQU X'04' Reserved for future type and must be zero   10635300
SVDCRRQT_B4_RSV02 EQU X'02' Reserved for future type and must be zero   10636200
SVDCRRQT_B4_RSV01 EQU X'01' Reserved for future type and must be zero   10637100
*                                                                       10638100
*         Format of SVDCRRQV (rule qualifier value):                    10641200
*                                                                       10644300
*         If SVDCRRGI is off (indicating this qualifier value           10647400
*         does not refer to a group name) special characters            10650500
*         or operators can be used based on the data type of            10653600
*         the qualifier value.                                          10656700
*                                                                       10659800
*         For attributes that take character data (such as              10662900
*         transaction name) the following special characters            10666000
*         apply:                                                        10669100
*                                                                       10672200
*           - Asterisk (*) in the last non-blank character              10675300
*             position indicates wildcard (note: an asterisk            10678400
*             in any other position is treated simply as the            10681500
*             asterisk character)                                       10684600
*                                                                       10687700
*           - Mask character (%) in any position indicates              10690800
*             that position will match any value for that               10693900
*             character                                                 10697000
*                                                                       10700100
*         For attributes that take numeric data (such as                10703200
*         priority), the qualifier value consists of 1 to 8             10706300
*         EBCDIC digits, optionally preceded by one of the              10709400
*         operators shown below.  The operator must be in               10712500
*         position 1, and the digits must follow the operator           10715600
*         with no intervening blanks.  If no operator appears           10718700
*         (digits must begin in position 1), an equal                   10721800
*         comparison is performed.  Trailing blanks can appear          10724900
*         after the digits to pad the value to 8 characters.            10728000
*                                                                       10731100
*           - Less than (<)                                             10734200
*           - Greater than (>)                                          10737300
*           - Less than or equal (<=)                                   10740400
*           - Greater than or equal (>=)                                10743500
*           - Not equal (<>)                                            10746600
*                                                                       10749700
*         If SVDCRRGI is on (indicating this field contains             10752800
*         a group name), then no wildcard or mask characters            10755900
*         or relational operators may be specified.                     10759000
*                                                                       10762100
*                                                                       10765200
*                                                                       10768300
         ORG   SVDCRRQT+X'00000004'                                     10769800
SVDCRRQV DS    1CL0008   Classification rule qualifier value (see      *10771400
                         description of format above)                   10774500
SVDCRRSV DS    1FL2      Substring value index - starting position of  *10779200
                         substring. Ignored if SVDCRRSU is off.         10789500
         DS    1CL0002   Reserved                                       10800000
SVDCRRFL DS    0CL0001   Classification rule flags                      10850000
SVDCRRSU EQU   X'20'     Substringing used for qualifier value         *10900000
                         (mutually exclusive with SVDCRRGI, qualifier  *10933300
                         must take character data)                      10966600
SVDCRRCI EQU   X'08'     Service class name specified for this rule     11000000
SVDCRRPI EQU   X'04'     Report class name specified for this rule      11050000
SVDCRRGI EQU   X'02'     Qualifier value refers to a group              11100000
SVDCRSTR EQU   X'01'     Storage Protection                             11170000
         ORG   SVDCRRFL+X'00000001'                                     11250000
SVDCRRF2 DS    0CL0001   Classification rule flags                      11300990
         ORG   SVDCRRF2+X'00000001'                                     11301980
SVDCRRF3 DS    0CL0001   Classification rule flags byte 3. Currently,  *11302970
                         this byte contain bits that are going to be   *11303960
                         used in both SVPOL and SVDEF                   11304950
SVDCRTRM EQU   X'80'     Transaction or Region Management Option       *11305940
                         Transaction: SVDCRTRM = 0 Region : SVDCRTRM = *11306930
                         1                                              11307920
         ORG   SVDCRRF3+X'00000001'                                     11308910
         DS    1CL0001   Reserved                                       11309900
SVDCRRCN DS    1CL0008   Service class name this rule will assign if   *11320000
                         rule matches. Valid only if classification    *11340000
                         rule flag (SVDCRRCI) indicates that the       *11360000
                         service class name was specified.              11380000
SVDCRRPN DS    1CL0008   Report class name, if SVDCRRPI is ON           11400000
SVDCRRLV DS    1FL2      Nesting level of rule from 1 to 4              11450000
         DS    1CL0002   Reserved                                       11500000
         DS    1FL4      Reserved                                       11550000
SVDCRDES DS    1CL0032   Rule definition - this field not applicable   *11600000
                         for IWMCQRY                                    11650000
SVDCRRUL_LEN EQU *-SVDCRRUL                                             11700000
.L0008   ANOP                                                           11750000
*                                                                       11800000
*      ***************************************************************  11850000
*      *                                                             *  11900000
*      * Group section                                               *  11950000
*      *                                                             *  12000000
*      ***************************************************************  12050000
*                                                                       12100000
*                                                                       12150000
         AIF   ('&SVDCRGRP' EQ 'NO').L000B                              12200000
         AIF   ('&DSECT' EQ 'YES').L000C                                12250000
         AIF   ('&SVDCRGRP' NE 'YES').L000B                             12300000
SVDCRGRP DS    0F        Group section                                  12350000
         AGO   .L000D                                                   12400000
.L000C   ANOP                                                           12450000
SVDCRGRP DSECT           Group section                                  12500000
.L000D   ANOP                                                           12550000
SVDCRGRN DS    1CL0008   Name of group                                  12600000
SVDCRGDE DS    1CL0032   Group description (this field not provided    *12633300
                         for IWMCQRY)                                   12666600
SVDCRGTY DS    0CL0002   Qualifier type information for group describe *12708300
                         the type in the value list                     12750000
SVDCRGTY_BYTE1 DS 0CL0001 First byte                                    12775000
SVDCRGTN EQU   X'80'     Transaction name                               12800000
SVDCRGTC EQU   X'40'     Transaction class                              12850000
SVDCRGUI EQU   X'20'     Userid                                         12900000
SVDCRGSN EQU   X'10'     Subsystem name                                 12950000
SVDCRGNI EQU   X'08'     Net id                                         13000000
SVDCRGLU EQU   X'04'     LU name                                        13050000
SVDCRGTY_CONN_TYPE EQU X'02' Connection type                            13068700
SVDCRGTY_PACK_NAME EQU X'01' Package name                               13087400
         ORG   SVDCRGTY_BYTE1+X'00000001'                               13106100
SVDCRGTY_BYTE2 DS 0CL0001 Second byte                                   13124800
SVDCRGTY_PLAN_NAME EQU X'80' Plan name                                  13143500
SVDCRGTY_PERFORM EQU X'40' Perform                                      13152900
SVDCRGTY_SYSTEM_NAME EQU X'20' System Name Group                        13157600
         ORG   SVDCRGTY+X'00000002'                                     13162300
SVDCRGTY_BYTE3 DS 1CL0001 Reserved for future types                     13171700
SVDCRGTY_BYTE4 DS 1CL0001 Reserved for future types                     13185800
SVDCRGVO DS    1FL4      Offset to the first group value for this      *13200000
                         group from the beginning of this SVDCRGRP     *13233300
                         entry                                          13266600
SVDCRGVN DS    1FL2      Total number of values for this group          13300000
         DS    1CL0002   Reserved                                       13350000
SVDCRGIU DS    1CL0008   Userid of group creator (this field not       *13377700
                         provided for IWMCQRY)                          13405400
SVDCRGIT DS    1CL0008   Timestamp of initial creation (this field not *13433100
                         provided for IWMCQRY)                          13460800
SVDCRGRU DS    1CL0008   Userid of group last update (this field not   *13488500
                         provided for IWMCQRY)                          13516200
SVDCRGRT DS    1CL0008   Timestamp of group last update (this field    *13543900
                         not provided for IWMCQRY)                      13571600
SVDCRGRP_LEN EQU *-SVDCRGRP                                             13600000
.L000B   ANOP                                                           13650000
*                                                                       13700000
*      ***************************************************************  13750000
*      *                                                             *  13800000
*      * Group value section                                         *  13850000
*      *                                                             *  13900000
*      ***************************************************************  13950000
*                                                                       14000000
*                                                                       14050000
         AIF   ('&SVDCRGVS' EQ 'NO').L000E                              14100000
         AIF   ('&DSECT' EQ 'YES').L000F                                14150000
         AIF   ('&SVDCRGVS' NE 'YES').L000E                             14200000
SVDCRGVS DS    0H        Group member                                   14250000
         AGO   .L0010                                                   14300000
.L000F   ANOP                                                           14350000
SVDCRGVS DSECT           Group member                                   14400000
.L0010   ANOP                                                           14450000
SVDCRGVV DS    1CL0008   Group value                                    14500000
SVDCRGSV DS    1FL2      Reserved                                       14550000
SVDCRGFL DS    0CL0001   Group value flags                              14600000
SVDCRGSU EQU   X'80'     Reserved                                       14650000
         ORG   SVDCRGFL+X'00000001'                                     14700000
         DS    1CL0001   Reserved                                       14750000
SVDCRGDS DS    1CL0032   Group value definition, this field not        *14750500
                         applicable for IWMCQRY                         14751000
SVDCRGVS_LEN EQU *-SVDCRGVS                                             14751600
.L000E   ANOP                                                           14753200
*                                                                       14754800
*      ***************************************************************  14756400
*      *                                                             *  14758000
*      * Extension section NOTE: No extension data is returned on the*  14759600
*      * IWMCQRY interface                                           *  14761200
*      *                                                             *  14762800
*      ***************************************************************  14764400
*                                                                       14766000
*                                                                       14767600
         AIF   ('&SVDCREXT' EQ 'NO').L0011                              14769200
         AIF   ('&DSECT' EQ 'YES').L0012                                14770800
         AIF   ('&SVDCREXT' NE 'YES').L0011                             14772400
SVDCREXT DS    0F        Extension section entry                        14774000
         AGO   .L0013                                                   14775600
.L0012   ANOP                                                           14777200
SVDCREXT DSECT           Extension section entry                        14778800
.L0013   ANOP                                                           14780400
SVDCRVID DS    1CL0008   Unique vendor id that owns the entry           14782000
SVDCRROB DS    1CL0004   Related subsystem type name - name of         *14783600
                         subsystem which this extension entry extends   14785200
         DS    1CL0004   Reserved in case 8-character extension        *14786800
                         becomes necessary                              14788400
SVDCREDL DS    1FL2      Extended data length                           14790000
         DS    1CL0002   Reserved                                       14791600
SVDCREDO DS    1FL4      Offset to extended data - offset is from the  *14793200
                         beginning of the extended data whose offset   *14794800
                         is in SVDCR_EXT_DATA_OFF                       14796400
*                                                                       14800000
*    *****************************************************************  14850000
*    *                                                               *  14900000
*    * Constants                                                     *  14950000
*    *                                                               *  15000000
*    *****************************************************************  15050000
*                                                                       15100000
*                                                                       15150000
SVDCR_ID EQU   C'SVDC'   SVDCR identifier                               15200000
SVDCR_LEVEL000 EQU 0     Functionality level introduced by WLM in      *15203300
                         SP510 before migration coexistence             15206600
SVDCR_LEVEL001 EQU 1     Functionality level introduced by WLM in      *15216900
                         SP510.                                         15227200
SVDCR_SP510 EQU 1        WLM SP510 version                              15237500
SVDCR_LEVEL002 EQU 2     Functionality level introduced by WLM in      *15247800
                         SP520.                                         15258100
SVDCR_SP520 EQU 2        WLM SP520 version                              15268400
SVDCR_LEVEL003 EQU 3     Functionality level introduced by WLM in      *15278700
                         OS/390 V1R3.                                   15289000
SVDCR_SP530 EQU 3        WLM version number for OS/390 V1R3             15299300
SVDCR_LEVEL004 EQU 4     Functionality level introduced by WLM in      *15309600
                         OS/390 V2R4                                    15313700
SVDCR_SP604 EQU 4        WLM version number for OS/390 V2R4             15317800
SVDCR_LEVEL005 EQU 5     Functionality level introduced by WLM in      *15321900
                         OS/390 V2R5                                    15326000
SVDCR_SP605 EQU 5        WLM version number for OS/390 V2R5             15330100
SVDCR_LEVEL006 EQU 6     Functionality level introduced by WLM in      *15334200
                         OS/390 V2R6                                    15338300
SVDCR_SP606 EQU 6        WLM version number for OS/390 V2R6             15342400
SVDCR_LEVEL007 EQU 7     Functionality level introduced by WLM in      *15344000
                         OS/390 V2R7                                    15345600
SVDCR_SP607 EQU 7        WLM version number for OS/390 V2R7             15347200
SVDCR_LEVEL008 EQU 8     Functionality level reserved for WLM OS/390   *15347400
                         V2R7                                           15347600
SVDCR_SP608 EQU 8        WLM version number for OS/390 V2R7             15347800
SVDCR_LEVEL009 EQU 9     Functionality level reserved for WLM OS/390   *15348000
                         V2R8                                           15348200
SVDCR_RESERVED_R08 EQU 9 WLM version number reserved for OS/390 V2R8    15348400
SVDCR_LEVEL010 EQU 10    Functionality level reserved for WLM OS/390   *15348600
                         V2R9                                           15348800
SVDCR_RESERVED_R09 EQU 10 WLM version number reserved for OS/390 V2R9   15349000
SVDCR_LEVEL011 EQU 11    Functionality level introduced by WLM in      *15349200
                         OS/390 V2R10                                   15349400
SVDCR_SP703 EQU 11       WLM version number for OS/390 V2R10            15349600
SVDCR_CURRENT_VER EQU 11 Current version level used when checking      *15349800
                         functionality within WLM product               15350800
SVDCR_NLEVEL EQU 4       SVDCR deepest level of nesting allowed         15362400
SVDCREXT_LEN EQU *-SVDCREXT                                             15408200
.L0011   ANOP                                                           15454000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 15500000
         AIF   ('&LIST' EQ 'YES').P4                                    15550000
.P3      ANOP                                                           15600000
         POP   PRINT                                                    15650000
.P4      ANOP                                                           15700000
.P_EXIT  ANOP                                                           15750000
         MEND                                                           15800000
**/ IWMSVDCR_2:;                                                        15850000
* %IWMSVDCR_INCLUDED = 'YES';                                           15900000
* %DCL ZCBPRINT CHAR EXT;                                               15950000
* %DEACTIVATE ZCBPRINT;                                                 16000000
* %DCL IWMSVDCR_LIST CHAR EXT;                                          16050000
* %DEACTIVATE IWMSVDCR_LIST;                                            16100000
* %IF IWMSVDCR_LIST ^= 'NO' &                                           16150000
*    ZCBPRINT ^= 'NO' %THEN                                             16200000
*   %GOTO IWMSVDCR_3;                                                   16250000
*   @LIST PUSH NOECHO;                                                  16300000
*   @LIST NOASSEMBLE NOECHO;                                            16350000
*   @LIST OFF C NOECHO;                                                 16400000
* %IWMSVDCR_3:;                                                         16450000
*/* Start of PL/X Source                                             */ 16500000
*                                                                       16550000
*%SVDCRPL2: ;                                                           16600000
*                                                                       16650000
*   /*****************************************************************/ 17000000
*   /*                                                               */ 17050000
*   /* Service definition classification rule header section         */ 17100000
*   /*                                                               */ 17150000
*   /*****************************************************************/ 17200000
*                                                                       17250000
* DCL 1 SVDCRHDR BASED BDY(DWORD), /* Service definition                17300000
*                              classification rule header section    */ 17350000
*     3 SVDCRNAM CHAR(4),   /* Eyecatcher                            */ 17400000
*     3 SVDCRLVL FIXED(8),  /* Functionality level of the SVDCR. @P5C*/ 17416600
*                           /* The functionality level defines   @P5A*/ 17433200
*                           /* the highest level of WLM function @P5A*/ 17449800
*                           /* that exists in the SVDCR.         @P5A*/ 17466400
*     3 SVDCRWVN FIXED(8),  /* WLM version number                @P5C*/ 17491500
*     3 SVDCRDIL FIXED(16), /* Size in bytes of header section   @L2A*/ 17516600
*     3 SVDCRSIZ FIXED(32), /* Size in bytes of the whole               17550000
*                              classification rule definition        */ 17600000
*     3 SVDCRSO FIXED(32),  /* Offset of subsystem type section if      17630000
*                              number of subsystems is nonzero          17660000
*                              (otherwise this field is ignored)     */ 17690000
*     3 SVDCRSN FIXED(16),  /* Number of subsystem type entries      */ 17720000
*     3 SVDCRSS FIXED(16),  /* Size of a subsystem type entry        */ 17750000
*     3 SVDCRRO FIXED(32),  /* Offset of classification rule section    17775000
*                              if number of classification rules is     17800000
*                              nonzero (otherwise this field is         17825000
*                              ignored)                              */ 17850000
*     3 SVDCRRN FIXED(16),  /* Number of classification rule entries */ 17875000
*     3 SVDCRRS FIXED(16),  /* Size of a classification rule entry   */ 17900000
*     3 SVDCRGO FIXED(32),  /* Offset of group section if number of     17930000
*                              groups is nonzero (othwerwise this       17960000
*                              field is ignored)                     */ 17990000
*     3 SVDCRGN FIXED(16),  /* Number of group entries               */ 18020000
*     3 SVDCRGS FIXED(16),  /* Size of a group entry                 */ 18050000
*     3 SVDCRVO FIXED(32),  /* Offset of group value section if the     18080000
*                              groups is nonzero (othwerwise this       18110000
*                              field is ignored                      */ 18140000
*     3 SVDCRVN FIXED(16),  /* Number of group value entries         */ 18170000
*     3 SVDCRVS FIXED(16),  /* Size of a group value entry           */ 18200000
*     3 SVDCRLN FIXED(16),  /* Deepest allowed level of nesting of      18233300
*                              classification rules (cannot exceed 4)*/ 18266600
*     3 *       CHAR(2),    /* Reserved                              */ 18300000
*     3 *       CHAR(32),   /* Reserved for additional triplets  @L2A*/ 18302000
*     3 SVDCR_EXT_DATA_OFF FIXED(32), /* Offset of extended data -      18304000
*                              this field not applicable for the        18306000
*                              IWMCQRY interface                 @L2A*/ 18308000
*     3 SVDCR_EXT_DATA_LEN FIXED(32), /* Length of extended data -      18310000
*                              this field not applicable for the        18312000
*                              IWMCQRY interface                 @L2A*/ 18314000
*     3 SVDCR_SST_EXT_OFF FIXED(32), /* Offset of subsystem type        18316000
*                              extension section if number of subsystem 18318000
*                              type extensions is nonzero (otherwise    18320000
*                              this field is ignored) - this field not  18322000
*                              applicable for the IWMCQRY interface     18324000
*                                                                @L2A*/ 18326000
*     3 SVDCR_SST_EXT_NUM FIXED(16), /* Number of subsystem type        18328000
*                              extension entries - this field not       18330000
*                              applicable for the IWMCQRY interface     18332000
*                                                                @L2A*/ 18334000
*     3 SVDCR_SST_EXT_SIZ FIXED(16), /* Length of each subsystem        18336000
*                              type extension entry - this field not    18338000
*                              applicable for the IWMCQRY interface     18340000
*                                                                @L2A*/ 18342000
*     3 *       CHAR(32),   /* Reserved for additional extension        18344000
*                              triplets                          @L2A*/ 18346000
*                                                                       18350000
*   /*****************************************************************/ 18400000
*   /*                                                               */ 18450000
*   /* Subsystem type section                                        */ 18500000
*   /*                                                               */ 18550000
*   /*****************************************************************/ 18600000
*                                                                       18650000
*   1 SVDCRSST BASED(ADDR(SVDCRHDR) + SVDCRSO), /* Subsystem            18700000
*                              type section                          */ 18750000
*     3 SVDCRSNM CHAR(4),   /* Subsystem type name                   */ 18800000
*     3 SVDCRSDE CHAR(32),  /* Subsystem type description               18825000
*                              (this field not provided for IWMCQRY)    18850000
*                                                                @P1C*/ 18875000
*     3 SVDCRSFL CHAR(1),   /* Subsystem type flags                  */ 18900000
*       5 SVDCRSCI BIT(1),  /* Default service class name specified  */ 18950000
*       5 SVDCRSPI BIT(1),  /* Default report class name specified   */ 19000000
*     3 *       CHAR(3),    /* Reserved                              */ 19050000
*     3 SVDCRSCN CHAR(8),   /* Service class name to which work for     19072700
*                              this subsystem type will be classified   19095400
*                              if not overridden by service class       19118100
*                              associated with a particular rule. This  19140800
*                              field valid only if SVDCRSCI is on    */ 19163500
*     3 SVDCRSPN CHAR(8),   /* Report class name to which work for      19186200
*                              this subsystem type will be reported     19208900
*                              if not overridden by report class        19231600
*                              associated with a particular rule. This  19254300
*                              field valid only if SVDCRSPI is on    */ 19277000
*     3 SVDCRSRO FIXED(32), /* Offset to the first classification       19300000
*                              rule for this subsystem type from        19350000
*                              the beginning of this SVDCRSST entry  */ 19400000
*     3 SVDCRSRN FIXED(16), /* Total number of classification rules     19450000
*                              for this subsystem type               */ 19500000
*     3 *        CHAR(2),   /* Reserved                              */ 19550000
*     3 SVDCRSIU CHAR(8),   /* Userid of subsystem type creator         19578500
*                              (this field not provided for IWMCQRY) */ 19607000
*     3 SVDCRSIT CHAR(8),   /* Timestamp of initial creation            19635500
*                              (this field not provided for IWMCQRY) */ 19664000
*     3 SVDCRSRU CHAR(8),   /* Userid of subsystem type last update     19692500
*                              (this field not provided for IWMCQRY) */ 19721000
*     3 SVDCRSRT CHAR(8),   /* Timestamp of subsystem type last         19750000
*                              update                                   19783300
*                              (this field not provided for IWMCQRY) */ 19816600
*                                                                       19850000
*   /*****************************************************************/ 19900000
*   /*                                                               */ 19950000
*   /* Classification rule section                                   */ 20000000
*   /*                                                               */ 20050000
*   /*****************************************************************/ 20100000
*                                                                       20150000
*   1 SVDCRRUL BASED, /* Classification rule entry                   */ 20190000
*     3 SVDCRRQT CHAR(4),   /* Classification rule qualifier type to    20215400
*                              indicate the type of value in SVDCRRQV.  20240800
*                              Each qualifier type takes a character    20256600
*                              value with optional masking or           20272400
*                              wildcarding unless otherwise noted.      20288200
*                                                            @WLMPMQS*/ 20304100
*      4  SVDCRRQT_BYTE1 CHAR(1), /* First byte                  @L1A*/ 20320000
*       5 SVDCRRTN BIT(1),  /* Transaction name                      */ 20350000
*       5 SVDCRRTC BIT(1),  /* Transaction class                     */ 20400000
*       5 SVDCRRUI BIT(1),  /* Userid                                */ 20450000
*       5 SVDCRRSN BIT(1),  /* Subsystem name                        */ 20500000
*       5 SVDCRRNI BIT(1),  /* Net id                                */ 20550000
*       5 SVDCRRLU BIT(1),  /* LU name                               */ 20600000
*       5 SVDCRRAC BIT(1),  /* Accounting information                */ 20650000
*       5 SVDCRRSP BIT(1),  /* Subsystem parameter                   */ 20700000
*      4  SVDCRRQT_BYTE2 CHAR(1), /* Second byte                 @L1A*/ 20711100
*       5 SVDCRRQT_COLL_NAME BIT(1), /* Collection name          @L1A*/ 20722200
*       5 SVDCRRQT_CORR_INFO BIT(1), /* Correlation information  @L1A*/ 20733300
*       5 SVDCRRQT_CONN_TYPE BIT(1), /* Connection type          @L1A*/ 20744400
*       5 SVDCRRQT_PACK_NAME BIT(1), /* Package name             @L1A*/ 20755500
*       5 SVDCRRQT_PLAN_NAME BIT(1), /* Plan name                @L1A*/ 20766600
*       5 SVDCRRQT_PERFORM   BIT(1), /* Perform - although this         20768100
*                                  is a number, it is treated as        20769600
*                                  character data, i.e. masking         20771100
*                                  and wildcarding can be used,         20772600
*                                  relational operators cannot be used  20774100
*                                                            @WLMPBAT*/ 20775600
*       5 SVDCRRQT_PROC_NAME BIT(1), /* Procedure Name       @WLMPENH*/ 20777600
*       5 SVDCRRQT_PRIORITY  BIT(1), /* Priority - qualifier value      20779800
*                                  is a number optionally preceded      20782000
*                                  by a relational operator             20784200
*                                                            @WLMPBAT*/ 20786400
*      4 SVDCRRQT_BYTE3 CHAR(1), /* Third byte               @WLMPMQS*/ 20786700
*       5 SVDCRRQT_PROCESS_NAME BIT(1), /* Process Name      @WLMPMQS*/ 20787000
*       5 SVDCRRQT_SYSTEM_NAME  BIT(1), /* System Name       @WLMPGMY*/ 20787300
*       5 SVDCRRQT_SYSPLEX_NAME BIT(1), /* Sysplex Name      @WLMPGMY*/ 20787600
*       5 SVDCRRQT_SUBSYSTEM_COLLECTION BIT(1),                         20787900
*                                    /* Subsystem Collection @WLMPGMY*/ 20788200
*       5 SVDCRRQT_SCHEDULING_ENVIRONMENT BIT(1),                       20788500
*                                  /* Scheduling Environment @WLMPGMY*/ 20788800
*       5 SVDCRRQT_B3_RSV04 BIT(1), /* Reserved for future type and     20789700
*                                      must be zero          @WLMPMQS*/ 20790000
*       5 SVDCRRQT_B3_RSV02 BIT(1), /* Reserved for future type and     20790300
*                                      must be zero          @WLMPMQS*/ 20790600
*       5 SVDCRRQT_B3_RSV01 BIT(1), /* Reserved for future type and     20790900
*                                      must be zero          @WLMPMQS*/ 20791200
*      4 SVDCRRQT_BYTE4 CHAR(1),    /* Reserved for future types        20791500
*                                                            @WLMPMQS*/ 20791800
*       5 SVDCRRQT_B4_RSV80 BIT(1), /* Reserved for future type and     20792100
*                                      must be zero          @WLMPMQS*/ 20792400
*       5 SVDCRRQT_B4_RSV40 BIT(1), /* Reserved for future type and     20792700
*                                      must be zero          @WLMPMQS*/ 20793000
*       5 SVDCRRQT_B4_RSV20 BIT(1), /* Reserved for future type and     20793300
*                                      must be zero          @WLMPMQS*/ 20793600
*       5 SVDCRRQT_B4_RSV10 BIT(1), /* Reserved for future type and     20793900
*                                      must be zero          @WLMPMQS*/ 20794200
*       5 SVDCRRQT_B4_RSV08 BIT(1), /* Reserved for future type and     20794500
*                                      must be zero          @WLMPMQS*/ 20794800
*       5 SVDCRRQT_B4_RSV04 BIT(1), /* Reserved for future type and     20795100
*                                      must be zero          @WLMPMQS*/ 20795400
*       5 SVDCRRQT_B4_RSV02 BIT(1), /* Reserved for future type and     20795700
*                                      must be zero          @WLMPMQS*/ 20796000
*       5 SVDCRRQT_B4_RSV01 BIT(1), /* Reserved for future type and     20796300
*                                      must be zero          @WLMPMQS*/ 20796600
*                                                                       20797000
* /*      Format of SVDCRRQV (rule qualifier value):                    20799900
*                                                                       20802800
*         If SVDCRRGI is off (indicating this qualifier value           20805700
*         does not refer to a group name) special characters            20808600
*         or operators can be used based on the data type of            20811500
*         the qualifier value.                                          20814400
*                                                                       20817300
*         For attributes that take character data (such as              20820200
*         transaction name) the following special characters            20823100
*         apply:                                                        20826000
*                                                                       20828900
*           - Asterisk (*) in the last non-blank character              20831800
*             position indicates wildcard (note: an asterisk            20834700
*             in any other position is treated simply as the            20837600
*             asterisk character)                                       20840500
*                                                                       20843400
*           - Mask character (%) in any position indicates              20846300
*             that position will match any value for that               20849200
*             character                                                 20852100
*                                                                       20855000
*         For attributes that take numeric data (such as                20857900
*         priority), the qualifier value consists of 1 to 8             20860800
*         EBCDIC digits, optionally preceded by one of the              20863700
*         operators shown below.  The operator must be in               20866600
*         position 1, and the digits must follow the operator           20869500
*         with no intervening blanks.  If no operator appears           20872400
*         (digits must begin in position 1), an equal                   20875300
*         comparison is performed.  Trailing blanks can appear          20878200
*         after the digits to pad the value to 8 characters.            20881100
*                                                                       20884000
*           - Less than (<)                                             20886900
*           - Greater than (>)                                          20889800
*           - Less than or equal (<=)                                   20892700
*           - Greater than or equal (>=)                                20895600
*           - Not equal (<>)                                            20898500
*                                                                       20901400
*         If SVDCRRGI is on (indicating this field contains             20904300
*         a group name), then no wildcard or mask characters            20907200
*         or relational operators may be specified.                     20910100
*                                                            @WLMPBAT*/ 20913000
*                                                                       20915900
*     3 SVDCRRQV CHAR(8),   /* Classification rule qualifier value      20918800
*                              (see description of format above)        20921700
*                                                            @WLMPBAT*/ 20924600
*     3 SVDCRRSV FIXED(16), /* Substring value index - starting         20927500
*                              position of substring. Ignored if        20935000
*                              SVDCRRSU is off.                      */ 20942500
*     3 *        CHAR(2),   /* Reserved                              */ 20950000
*     3 SVDCRRFL CHAR(1),   /* Classification rule flags             */ 21000000
*       5 *        BIT(2),  /* Reserved (must not be used - to          21039200
*                              maintain compatibility with version      21078400
*                              5.1.0)                            @L2C*/ 21117600
*       5 SVDCRRSU BIT(1),  /* Substringing used for qualifier value    21156800
*                              (mutually exclusive with SVDCRRGI,       21176400
*                              qualifier must take character data)      21196000
*                                                            @WLMPBAT*/ 21215600
*       5 *        BIT(1),  /* Reserved (must not be used - to          21235200
*                              maintain compatibility with version      21274400
*                              5.1.0)                            @L2C*/ 21313600
*       5 SVDCRRCI BIT(1),  /* Service class name specified for this    21352800
*                              rule                                  */ 21392000
*       5 SVDCRRPI BIT(1),  /* Report class name specified for this     21431200
*                              rule                                  */ 21470400
*       5 SVDCRRGI BIT(1),  /* Qualifier value refers to a group     */ 21509600
*       5 SVDCRSTR BIT(1),  /* Storage Protection                       21552990
*                                                            @WLMPGMS*/ 21555980
*     3 SVDCRRF2 CHAR(1),   /* Classification rule flags     @WLMPGMT*/ 21558970
*       5 *        BIT(3),  /* Reserved, these bit are used in SVPCR    21561960
*                                                            @WLMPGMT*/ 21564950
*       5 *        BIT(5),  /* Reserved                                 21567940
*                                                            @WLMPGMT*/ 21570930
*     3 SVDCRRF3 CHAR(1),   /* Classification rule flags byte 3.        21573920
*                              Currently, this byte contain bits that   21576910
*                              are going to be used in both SVPOL and   21579900
*                              SVDEF                         @WLMPGMT*/ 21582890
*       5 SVDCRTRM BIT(1),  /* Transaction or Region Management Option  21585880
*                              Transaction: SVDCRTRM = 0                21588870
*                              Region     : SVDCRTRM = 1                21591860
*                                                            @WLMPGMT*/ 21594850
*       5 *        BIT(7),  /* Reserved                                 21597840
*                                                            @WLMPGMT*/ 21600830
*     3 *        CHAR(1),   /* Reserved                      @WLMPGMT*/ 21603820
*     3 SVDCRRCN CHAR(8),   /* Service class name this rule will assign 21616600
*                              if rule matches. Valid only if           21633200
*                              classification rule flag (SVDCRRCI)      21649800
*                              indicates that the service class name    21666400
*                              was specified.                        */ 21683000
*     3 SVDCRRPN CHAR(8),   /* Report class name, if SVDCRRPI is ON  */ 21700000
*     3 SVDCRRLV FIXED(16), /* Nesting level of rule from 1 to 4     */ 21750000
*     3 *        CHAR(2),   /* Reserved                              */ 21800000
*     3 *        FIXED(32), /* Reserved                              */ 21850000
*     3 SVDCRDES CHAR(32),  /* Rule definition - this field             21900000
*                              not applicable for IWMCQRY    @WLMPMQS*/ 21950000
*                                                                       22000000
*   /*****************************************************************/ 22050000
*   /*                                                               */ 22100000
*   /* Group section                                                 */ 22150000
*   /*                                                               */ 22200000
*   /*****************************************************************/ 22250000
*                                                                       22300000
*   1 SVDCRGRP BASED, /* Group section                               */ 22350000
*     3 SVDCRGRN CHAR(8),   /* Name of group                         */ 22400000
*     3 SVDCRGDE CHAR(32),  /* Group description                        22420000
*                              (this field not provided for IWMCQRY)    22440000
*                                                                @P1C*/ 22460000
*     3 SVDCRGTY CHAR(2),   /* Qualifier type information for group     22485000
*                              describe the type in the value list      22510000
*                                                                @L1C*/ 22540000
*      4  SVDCRGTY_BYTE1 CHAR(1), /* First byte                  @L1A*/ 22570000
*       5 SVDCRGTN BIT(1),  /* Transaction name                      */ 22600000
*       5 SVDCRGTC BIT(1),  /* Transaction class                     */ 22650000
*       5 SVDCRGUI BIT(1),  /* Userid                                */ 22700000
*       5 SVDCRGSN BIT(1),  /* Subsystem name                        */ 22750000
*       5 SVDCRGNI BIT(1),  /* Net id                                */ 22800000
*       5 SVDCRGLU BIT(1),  /* LU name                               */ 22850000
*       5 SVDCRGTY_CONN_TYPE BIT(1), /* Connection type          @L1A*/ 22871400
*       5 SVDCRGTY_PACK_NAME BIT(1), /* Package name             @L1A*/ 22892800
*      4  SVDCRGTY_BYTE2 CHAR(1), /* Second byte                 @L1A*/ 22914200
*       5 SVDCRGTY_PLAN_NAME BIT(1), /* Plan name                @L1A*/ 22935600
*       5 SVDCRGTY_PERFORM   BIT(1), /* Perform              @WLMPENH*/ 22948400
*       5 SVDCRGTY_SYSTEM_NAME BIT(1),  /* System Name Group @WLMPGMY*/ 22956900
*       5 *        BIT(5),  /* Reserved                      @WLMPGMY*/ 22965400
*     3  SVDCRGTY_BYTE3 CHAR(1), /* Reserved for future types    @P3C*/ 22974000
*     3  SVDCRGTY_BYTE4 CHAR(1), /* Reserved for future types    @P3A*/ 22986800
*     3 SVDCRGVO FIXED(32), /* Offset to the first group value for      23000000
*                              this group from the beginning of this    23033300
*                              SVDCRGRP entry                        */ 23066600
*     3 SVDCRGVN FIXED(16), /* Total number of values for this group */ 23100000
*     3 *        CHAR(2),   /* Reserved                              */ 23150000
*     3 SVDCRGIU CHAR(8),   /* Userid of group creator                  23177700
*                              (this field not provided for IWMCQRY) */ 23205400
*     3 SVDCRGIT CHAR(8),   /* Timestamp of initial creation            23233100
*                              (this field not provided for IWMCQRY) */ 23260800
*     3 SVDCRGRU CHAR(8),   /* Userid of group last update              23288500
*                              (this field not provided for IWMCQRY) */ 23316200
*     3 SVDCRGRT CHAR(8),   /* Timestamp of group last update           23343900
*                              (this field not provided for IWMCQRY) */ 23371600
*                                                                       23400000
*   /*****************************************************************/ 23450000
*   /*                                                               */ 23500000
*   /* Group value section                                           */ 23550000
*   /*                                                               */ 23600000
*   /*****************************************************************/ 23650000
*                                                                       23700000
*   1 SVDCRGVS BASED, /* Group member                                */ 23750000
*     3 SVDCRGVV CHAR(8),   /* Group value                           */ 23800000
*     3 SVDCRGSV FIXED(16), /* Reserved                              */ 23850000
*     3 SVDCRGFL CHAR(1),   /* Group value flags                     */ 23900000
*       5 SVDCRGSU BIT(1),  /* Reserved                              */ 23950000
*       5 *        BIT(7),  /* Reserved                              */ 24000000
*     3 *        CHAR(1),   /* Reserved                              */ 24004100
*     3 SVDCRGDS CHAR(32),  /* Group value definition, this             24005100
*                              field not applicable for IWMCQRY         24006100
*                                                            @WLMPMQS*/ 24007100
*                                                                       24008200
*   /*****************************************************************/ 24012300
*   /*                                                               */ 24016400
*   /* Extension section                                             */ 24020500
*   /*                                                               */ 24024600
*   /* NOTE: No extension data is returned on the IWMCQRY interface  */ 24028700
*   /*                                                               */ 24032800
*   /*****************************************************************/ 24036900
*                                                                       24041000
*   1 SVDCREXT BASED,       /* Extension section entry           @L2A*/ 24045100
*     3 SVDCRVID CHAR(8),   /* Unique vendor id that owns the entry     24049200
*                                                                @L2A*/ 24053300
*     3 SVDCRROB CHAR(4),   /* Related subsystem type name - name of    24057400
*                              subsystem which this extension entry     24061500
*                              extends                           @L2A*/ 24065600
*     3 * CHAR(4),          /* Reserved in case 8-character extension   24069700
*                              becomes necessary                 @L2A*/ 24073800
*     3 SVDCREDL FIXED(16), /* Extended data length              @L2A*/ 24077900
*     3 *        CHAR(2),   /* Reserved                          @L2A*/ 24082000
*     3 SVDCREDO FIXED(32); /* Offset to extended data - offset is from 24086100
*                              the beginning of the extended data whose 24090200
*                              offset is in SVDCR_EXT_DATA_OFF   @L2A*/ 24094300
*                                                                       24100000
*   /*****************************************************************/ 24150000
*   /*                                                               */ 24200000
*   /* Constants                                                     */ 24250000
*   /*                                                               */ 24300000
*   /*****************************************************************/ 24350000
*                                                                       24400000
* DECLARE                                                               24450000
*   SVDCR_ID CHAR(4) CONSTANT('SVDC'), /* SVDCR identifier           */ 24500000
*   SVDCR_LEVEL000 FIXED(8) CONSTANT(0),       /* Functionality level   24503800
*                                       introduced by WLM in SP510      24507600
*                                       before migration coexistence    24511400
*                                                            @WA13309*/ 24515200
*   SVDCR_LEVEL001 FIXED(8) CONSTANT(1), /*                             24524500
*                                Functionality level introduced by      24533800
*                                WLM in SP510.                   @P5C*/ 24543100
*   SVDCR_SP510 FIXED(8) CONSTANT(1), /*                                24552400
*                                WLM SP510 version               @P5C*/ 24561700
*   SVDCR_LEVEL002 FIXED(8) CONSTANT(2), /*                             24571000
*                                Functionality level introduced by      24580300
*                                WLM in SP520.                   @P5C*/ 24589600
*   SVDCR_SP520 FIXED(8) CONSTANT(2),  /*                               24598900
*                                WLM SP520 version               @P5C*/ 24608200
*   SVDCR_LEVEL003 FIXED(8) CONSTANT(3), /*                             24617500
*                                Functionality level introduced by      24626800
*                                WLM in OS/390 V1R3.         @WLMPSTP*/ 24636100
*   SVDCR_SP530 FIXED(8) CONSTANT(3), /* WLM version number for         24645400
*                                OS/390 V1R3                 @WLMPSTP*/ 24654700
*   SVDCR_LEVEL004 FIXED(8) CONSTANT(4), /*                             24664000
*                                Functionality level introduced by      24673300
*                                WLM in OS/390 V2R4          @WLMPBAT*/ 24682600
*   SVDCR_SP604 FIXED(8) CONSTANT(4), /* WLM version number for         24691900
*                                OS/390 V2R4                 @WLMPBAT*/ 24694000
*   SVDCR_LEVEL005 FIXED(8) CONSTANT(5), /*                             24696100
*                                Functionality level introduced by      24698200
*                                WLM in OS/390 V2R5          @WLMPSDC*/ 24700300
*   SVDCR_SP605 FIXED(8) CONSTANT(5), /* WLM version number for         24702400
*                                OS/390 V2R5                 @WLMPSDC*/ 24704500
*   SVDCR_LEVEL006 FIXED(8) CONSTANT(6), /*                             24706600
*                                Functionality level introduced by      24708700
*                                WLM in OS/390 V2R6          @WLMPSDC*/ 24710800
*   SVDCR_SP606 FIXED(8) CONSTANT(6), /* WLM version number for         24712900
*                                OS/390 V2R6                 @WLMPSDC*/ 24715000
*   SVDCR_LEVEL007 FIXED(8) CONSTANT(7), /*                             24715600
*                                Functionality level introduced by      24716200
*                                WLM in OS/390 V2R7          @WLMPMQS*/ 24716800
*   SVDCR_SP607 FIXED(8) CONSTANT(7), /* WLM version number for         24717400
*                                OS/390 V2R7                 @WLMPMQS*/ 24718000
*   SVDCR_LEVEL008 FIXED(8) CONSTANT(8), /*                             24718400
*                                Functionality level reserved for       24718800
*                                WLM OS/390 V2R7             @WLMPGMY*/ 24719200
*   SVDCR_SP608 FIXED(8) CONSTANT(8), /* WLM version number for         24719600
*                                OS/390 V2R7                 @WLMPGMY*/ 24720000
*   SVDCR_LEVEL009 FIXED(8) CONSTANT(9), /*                             24720400
*                                Functionality level reserved for       24720800
*                                WLM OS/390 V2R8             @WLMPGMY*/ 24721200
*   SVDCR_RESERVED_R08 FIXED(8) CONSTANT(9), /*                         24721600
*                                WLM version number reserved for        24722000
*                                OS/390 V2R8                 @WLMPGMY*/ 24722400
*   SVDCR_LEVEL010 FIXED(8) CONSTANT(10), /*                            24722800
*                                Functionality level reserved for       24723200
*                                WLM OS/390 V2R9             @WLMPGMY*/ 24723600
*   SVDCR_RESERVED_R09 FIXED(8) CONSTANT(10), /*                        24724000
*                                WLM version number reserved for        24724400
*                                OS/390 V2R9                 @WLMPGMY*/ 24724800
*   SVDCR_LEVEL011 FIXED(8) CONSTANT(11), /*                            24725200
*                                Functionality level introduced by      24725600
*                                WLM in OS/390 V2R10         @WLMPGMY*/ 24726000
*   SVDCR_SP703 FIXED(8) CONSTANT(11), /* WLM version number for        24726400
*                                OS/390 V2R10                @WLMPGMY*/ 24726800
*   SVDCR_CURRENT_VER FIXED(8) CONSTANT(SVDCR_LEVEL011),   /*           24727200
*                                Current version level used when        24727600
*                                checking functionality within WLM      24729100
*                                product                     @WLMPGMY*/ 24739500
*   SVDCR_NLEVEL FIXED(16) CONSTANT(4); /* SVDCR deepest level of       24750000
*                                      nesting allowed               */ 24800000
*/* End of PL/X Source                                               */ 24850000
* %IF IWMSVDCR_LIST ^= 'NO' &                                           24900000
*    ZCBPRINT ^= 'NO' %THEN                                             24950000
*   %GOTO IWMSVDCR_4;                                                   25000000
*   @LIST POP NOECHO;                                                   25050000
* %IWMSVDCR_4:;                                                         25100000
* %END;                                                                 25150000
