*                                                                       00050000
* %DCL IWMSVPOL_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IWMSVPOL_INCLUDED;                                        00150000
* %IF IWMSVPOL_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*%/* Start of PL/X PreProlog Code */;                                   00300000
*   %GOTO SVPOLPL1;                 /* MACRO IWMSVPOL                */ 00350000
*   MACRO                                                               00400000
*   IWMSVPOL                                                            00450000
*                                                                       00500000
*%SVPOLPL1:;                                                            00550000
*                                                                       00600000
*%/* End of PL/X PreProlog Code */;                                     00650000
*/* Macro made bi-lingual on 00171. CBGEN compile date 00013         */ 00739970
*% /*                                                                   00750000
         MACRO                                                          00800000
         IWMSVPOL &DSECT=YES,&LIST=YES,&TITLE=YES,&SVPOLHD=YES,        *00850000
               &SVPOLSP=COND,&SVPOLWD=COND,&SVPOLCD=COND,&SVPOLPD=COND,*00900000
               &SVPOLRG=COND,&SVPOLRD=COND                              00950000
         GBLC  &IWMSVPOL_INCLUDED                                       01000000
         GBLC  &ZCBPRINT                                                01050000
&IWMSVPOL_INCLUDED SETC 'YES'                                           01100000
         AIF   ('&LIST' EQ 'NONE').P0                                   01116600
         AIF   ('&TITLE' EQ 'NO').P5                                    01133200
 TITLE   'IWMSVPOL  - IWMPQRY Answer Area                         '     01150000
.P5      ANOP                                                           01175000
**/ IWMSVPOL_1:;                                                        01200000
*/***START OF SPECIFICATIONS******************************************/ 01250000
*/*                                                                  */ 01300000
*/*01* Proprietary statement:                                        */ 01350000
*/*                                                                  */ 01400000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 01450000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 01500000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1993, 2000                 */ 01550000
*/*                                                                  */ 01650000
*/*                                                                  */ 01700000
*/*01* External classification: GUPI                                 */ 01750000
*/*01* End of External classification                                */ 01800000
*/*                                                                  */ 01850000
*/*01* Status: HBB7703                                               */ 01900000
*/*                                                                  */ 01950000
*/*01* Descriptive Name: IWMPQRY Answer Area                         */ 02000000
*/*                                                                  */ 02050000
*/*02*  Acronym: SVPOL                                               */ 02100000
*/*                                                                  */ 02150000
*/*01* Macro Name: IWMSVPOL                                          */ 02200000
*/*                                                                  */ 02250000
*/*01* DSECT Name: SVPOLHD                                           */ 02300000
*/*                SVPOLSP                                       @T1A*/ 02307100
*/*                SVPOLWD                                       @T1A*/ 02314200
*/*                SVPOLCD                                       @T1A*/ 02321300
*/*                SVPOLPD                                       @T1A*/ 02328400
*/*                SVPOLRG                                       @T1A*/ 02335500
*/*                SVPOLRD                                       @T1A*/ 02342600
*/*                                                                  */ 02350000
*/*01* Component: Workload Manager (SCWLM)                           */ 02400000
*/*                                                                  */ 02450000
*/*01* Eye-Catcher: SVPO                                             */ 02500000
*/*02*  Offset: 0                                                    */ 02550000
*/*02*  Length: CHAR(4)                                              */ 02600000
*/*                                                                  */ 02650000
*/*01* Storage Attributes:                                           */ 02700000
*/*02*  Subpool: Any                                                 */ 02750000
*/*02*  Key: 0                                                       */ 02800000
*/*02*  Residency: Above 16M line                                    */ 02850000
*/*                                                                  */ 02900000
*/*01* Size: Determined at run time                                  */ 02950000
*/*                                                                  */ 03000000
*/*01* Created by: IWMPQRY service                                   */ 03050000
*/*                                                                  */ 03100000
*/*01* Pointed to by: IWMPQRY parameter list                         */ 03150000
*/*                                                                  */ 03200000
*/*01* Serialization: None                                           */ 03250000
*/*                                                                  */ 03300000
*/*01* Function: Contains service policy information                 */ 03350000
*/*                                                                  */ 03362500
*/*              All timestamps are local time expressed in  @PQC0795*/ 03375000
*/*              STCK format.                                @PQC0795*/ 03387500
*/*                                                                  */ 03400000
*/*01* Restrictions:                                                 */ 03450000
*/*              None                                                */ 03500000
*/*                                                                  */ 03550000
*/*01* Method of Access:                                             */ 03600000
*/*                                                                  */ 03650000
*/*02*  ASM:                                                         */ 03700000
*/*          Specify: IWMSVPOL                                       */ 03750000
*/*                                                                  */ 03800000
*/*02*  PLX:                                                         */ 03850000
*/*                                                                  */ 03900000
*/*          %INCLUDE SYSLIB(IWMSVPOL)                               */ 03950000
*/*          Using on SVPOLHD gives addressability to the query      */ 04000000
*/*          answer area.                                            */ 04050000
*/*          Subsequent usings must be done to get addressability    */ 04100000
*/*          to the additional sections (DSECTs) as follows:         */ 04150000
*/*          DSECT    USING                                          */ 04200000
*/*          -----    -----                                          */ 04250000
*/*          SVPOLSP  A(SVPOLHD) + SVPOLDPO                          */ 04300000
*/*          SVPOLWD  A(SVPOLHD) + SVPOLDWO   (multiple)             */ 04350000
*/*          SVPOLCD  A(SVPOLHD) + SVPOLDCO   (multiple)             */ 04400000
*/*          SVPOLRG  A(SVPOLHD) + SVPOLDGO   (multiple)             */ 04450000
*/*          SVPOLRD  A(SVPOLHD) + SVPOLDRO   (multiple)             */ 04500000
*/*                                                                  */ 04550000
*/*          In cases where there are multiple elements in a         */ 04600000
*/*          section, subsequent elements can be found by adding     */ 04650000
*/*          the size of one element to the basing.                  */ 04700000
*/*                                                                  */ 04750000
*/*02*  VIA ATTRIBUTE:                                               */ 04800000
*/*                                                                  */ 04850000
*/*          Specify %SVPOLVIA = 'YES'                               */ 04900000
*/*          prior to %INCLUDE statement.                            */ 04950000
*/*          For VIA(0) specify %GLOBALARMODE='YES'                  */ 05000000
*/*                                                                  */ 05050000
*/*01* Change Activity:                                              */ 05100000
*/*    $L0= WLMI,    HBB5510, 930315,PD00BV: WLM Stage I             */ 05150000
*/*    $T1= PIG5048, HBB5510, 940113,PD00BV: OW01260: CDPI garbage   */ 05175000
*/*    $P1= PIG5510, HBB5510, 940915,PD72DB: OW08866                 */ 05183300
*/*                                          Migration support   @P1A*/ 05191600
*/*    $WLMPSTP,     HBB6603, 950612,PD88DB: Stored SQL procedures   */ 05193000
*/*                                                          @WLMCSTP*/ 05194400
*/*    $PQC1647      HBB6603  960627 PDB9DB: Support option for      */ 05195800
*/*                                          I/O execution delay     */ 05197200
*/*                                          and velocity    @PQC1647*/ 05198600
*/*    $PQC0795      HBB6603  960820 PDB9DB: Time stamps in local    */ 05215700
*/*                                          time            @PQC0795*/ 05232800
*/*    $PQC2520      HBB6603  960917 PDB9DB: Fix defaults    @PQC2520*/ 05241400
*/*    $WLMPBAT      JBB6604  960926 B9HAGD: Classify by priority    */ 05243100
*/*                                                          @WLMPBAT*/ 05244800
*/*    $WLMPACT      JBB6604  961018 B9HADA: Less disruptive policy  */ 05246500
*/*                                          activation.     @WLMPACT*/ 05248200
*/*    $WLMPSDC      HBB6606  970807 B9HAKP: Service Defn comments   */ 05248800
*/*                                                          @WLMPSDC*/ 05249400
*/*    $WLMPMQS      JBB6607  980417 B9HARF: Process Name            */ 05249600
*/*                                                          @WLMPMQS*/ 05249800
*/*    $WLMPTAL      JBB6607  980501 B9HAMS: Dynamic alias tuning    */ 05262300
*/*                                                          @WLMPTAL*/ 05274800
*/*    $OW39854      JBB6607  990914 PDVA:   Victor Alonzo           */ 05276500
*/*                                          Changed comment for     */ 05278200
*/*                                          SVPOLDAM to ON means    */ 05279900
*/*                                          available       @OW39854*/ 05281600
*/*    $WLMPGMY      HBB7703  991027 B9HAPC: Add functionality       */ 05283300
*/*                                          level 11        @WLMPGMY*/ 05285000
*/*    $OW43587      HBB7703  990310 B9HAPC: Patrick Chan            */ 05285290
*/*                                          The following changes   */ 05285380
*/*                                          are flagged by @WLMCGMC:*/ 05285470
*/*                                          - Add bit for CPU       */ 05285560
*/*                                            CPU protection        */ 05285650
*/*                                                          @WLMCGMC*/ 05285740
*/*                                          The following changes   */ 05285830
*/*                                          are flagged by @WLMCGMS:*/ 05285920
*/*                                          - Add bit for implicit  */ 05286010
*/*                                            storage protection    */ 05286100
*/*                                                          @WLMCGMS*/ 05286190
*/*    $OW43718      HBB7703  000328 PDKM:   Kevin McIlvain          */ 05286310
*/*                                          Added SVPOLSQN as a     */ 05286370
*/*                                          field to the structure  */ 05286460
*/*                                          SVPOLSEQ                */ 05286550
*/*    $OW44749      HBB7703  000616 PDKM:   Kevin McIlvain          */ 05286650
*/*                                          Removed chnages added in*/ 05286750
*/*                                          OW43718                 */ 05286850
*/*                                                                  */ 05286950
*/***END OF SPECIFICATIONS********************************************/ 05287300
*% /*                                                                   05300000
.P0      ANOP                                                           05325000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05350000
         AIF   ('&LIST' EQ 'YES').P2                                    05400000
.P1      ANOP                                                           05450000
         PUSH  PRINT                                                    05500000
         PRINT OFF                                                      05550000
.P2      ANOP                                                           05600000
*                                                                       05650000
*      ***************************************************************  05700000
*      *                                                             *  05750000
*      * Service policy header information                           *  05800000
*      *                                                             *  05850000
*      ***************************************************************  05900000
*                                                                       05950000
*                                                                       06000000
         AIF   ('&SVPOLHD' EQ 'NO').L0002                               06050000
         AIF   ('&DSECT' EQ 'YES').L0003                                06100000
         AIF   ('&SVPOLHD' NE 'YES').L0002                              06150000
SVPOLHD  DS    0D        IWMPQRY Answer area                            06200000
         AGO   .L0004                                                   06250000
.L0003   ANOP                                                           06300000
SVPOLHD  DSECT           IWMPQRY Answer area                            06350000
.L0004   ANOP                                                           06400000
SVPOLNAM DS    1CL0004   Eyecatcher - SVPO                              06450000
SVPOLLVL DS    1FL1      Functionality level of the SVPOL. The         *06480000
                         functionality level defines the highest level *06510000
                         of the WLM function that exists in the SVPOL.  06540000
SVPOLWVN DS    1FL1      WLM version number                             06570000
SVPOLDIL DS    1FL2      Length of header section                       06600000
SVPOLDLE DS    1FL4      Total length of the active service policy     *06650000
                         data structure                                 06700000
SVPOLDPO DS    1FL4      Offset to the service policy definition       *06750000
                         section                                        06800000
SVPOLDPL DS    1FL2      Length of the policy entry in the policy      *06850000
                         section                                        06900000
SVPOLRS2 DS    1FL2      Reserved                                       06950000
SVPOLDWO DS    1FL4      Offset to the workload definition section      07000000
SVPOLDWC DS    1FL2      Number of workload entries in the workload    *07050000
                         definition section                             07100000
SVPOLDWL DS    1FL2      Length of each workload entry                  07150000
SVPOLDCO DS    1FL4      Offset to the service class definition        *07200000
                         section                                        07250000
SVPOLDCC DS    1FL2      Number of service class entries in the        *07300000
                         service class definition section               07350000
SVPOLDCL DS    1FL2      Length of each service class definition entry  07400000
SVPOLDZO DS    1FL4      Offset of service class period entries         07450000
SVPOLDZC DS    1FL2      Number of service class periods                07500000
SVPOLDZL DS    1FL2      Length of each service class period entry      07550000
SVPOLDRO DS    1FL4      Offset to the report class definition section  07600000
SVPOLDRC DS    1FL2      Number of report class entries in the report  *07650000
                         class definition section                       07700000
SVPOLDRL DS    1FL2      Length of each report class definition entry   07750000
SVPOLDGO DS    1FL4      Offset to the resource group definition       *07800000
                         section                                        07850000
SVPOLDGC DS    1FL2      Number of resource group entries in the       *07900000
                         resource group definition                      07950000
SVPOLDGL DS    1FL2      Length of each resource group definition      *08000000
                         entry                                          08050000
SVPOLRS3 DS    1FL4      Reserved                                       08100000
SVPOLHD_LEN EQU *-SVPOLHD                                               08150000
.L0002   ANOP                                                           08200000
*                                                                       08250000
*      ***************************************************************  08300000
*      *                                                             *  08350000
*      * Service policy information                                  *  08400000
*      *                                                             *  08450000
*      ***************************************************************  08500000
*                                                                       08550000
*                                                                       08600000
         AIF   ('&SVPOLSP' EQ 'NO').L0005                               08650000
         AIF   ('&DSECT' EQ 'YES').L0006                                08700000
         AIF   ('&SVPOLSP' NE 'YES').L0005                              08750000
SVPOLSP  DS    0D        Service policy section                         08800000
         AGO   .L0007                                                   08850000
.L0006   ANOP                                                           08900000
SVPOLSP  DSECT           Service policy section                         08950000
.L0007   ANOP                                                           09000000
SVPOLNSP DS    1CL0008   Service policy name                            09050000
SVPOLDSP DS    1CL0032   Service policy description                     09100000
SVPOLTPA DS    1CL0008   Time/date (STCK format) of policy activation   09150000
SVPOLIPU DS    1CL0008   Userid of the system operator or service      *09200000
                         administrator who activated the service       *09250000
                         policy                                         09300000
SVPOLSNA DS    1CL0008   Name of the system on which policy activation *09350000
                         was initiated                                  09400000
SVPOLSEQ DS    1FL4      Classification sequence number Removed        *09469980
                         svpolsqn added in OW43718.                     09479970
SVPOLASN DS    1FL4      Activation sequence number                     09500000
SVPOLSVD DS    0CL0032   SVDEF ID information (next 4 fields) of       *09550000
                         service definition from which this policy was *09600000
                         extracted                                      09650000
SVPOLIDN DS    1CL0008   Name of the service definition from which the *09700000
                         service policy was extracted                   09750000
SVPOLTDI DS    1CL0008   Time/date (STCK format) that the service      *09800000
                         definition was installed                       09850000
SVPOLIDU DS    1CL0008   Userid of the service administrator who       *09900000
                         installed the service definition               09950000
SVPOLIDS DS    1CL0008   Name of the system on which the service       *10000000
                         definition was installed                       10050000
SVPOLIDD DS    1CL0032   Description of service definition from which  *10100000
                         the service policy was extracted               10150000
SVPOLCPU DS    1FL4      CPU service coefficient *10000 - the number   *10200000
                         by which accumulated CPU service units will   *10250000
                         be multiplied (weighted)                       10300000
SVPOLIOC DS    1FL4      I/O service coefficient * 10000 - the number  *10350000
                         by which accumulated I/O service units will   *10400000
                         be multiplied (weighted)                       10450000
SVPOLMSO DS    1FL4      Storage service coefficient (MSO) * 10000 -   *10500000
                         the number by which accumulated storage       *10550000
                         service units will be multiplied (weighted)    10600000
SVPOLSRB DS    1FL4      SRB service coefficient * 10000 - the number  *10650000
                         by which accumulated SRB service units will   *10700000
                         be multiplied (weighted)                       10750000
SVPOLECP DS    1CL0004   EBCDIC representation of CPU service          *10800000
                         coefficient                                    10850000
SVPOLEIO DS    1CL0004   EBCDIC representation of I/O service          *10900000
                         coefficient                                    10950000
SVPOLEMS DS    1CL0008   EBCDIC representation of Storage service      *11000000
                         coefficient                                    11050000
SVPOLESR DS    1CL0004   EBCDIC representation of SRB service          *11100000
                         coefficient                                    11150000
SVPOLFL2 DS    0BL1      SVDEFFL2                                       11166600
SVPOLIOM EQU   X'80'     When set indicates that we should include the *11183200
                         I/O delays in the execution velocity           11199800
SVPOLDAM EQU   X'40'     When set indicates dynamic alias tuning       *11205300
                         available                                      11210800
         ORG   SVPOLFL2+X'00000001'                                     11216400
SVPOLRS5 DS    1CL0003   Reserved                                       11233000
SVPOLSP_LEN EQU *-SVPOLSP                                               11250000
.L0005   ANOP                                                           11300000
*                                                                       11350000
*      ***************************************************************  11400000
*      *                                                             *  11450000
*      * Workload information                                        *  11500000
*      *                                                             *  11550000
*      ***************************************************************  11600000
*                                                                       11650000
*                                                                       11700000
         AIF   ('&SVPOLWD' EQ 'NO').L0008                               11750000
         AIF   ('&DSECT' EQ 'YES').L0009                                11800000
         AIF   ('&SVPOLWD' NE 'YES').L0008                              11850000
SVPOLWD  DS    0X        Workload definition section                    11900000
         AGO   .L000A                                                   11950000
.L0009   ANOP                                                           12000000
SVPOLWD  DSECT           Workload definition section                    12050000
.L000A   ANOP                                                           12100000
SVPOLWNM DS    1CL0008   Workload name                                  12150000
SVPOLWDE DS    1CL0032   Workload description                           12200000
SVPOLWD_LEN EQU *-SVPOLWD                                               12250000
.L0008   ANOP                                                           12300000
*                                                                       12350000
*      ***************************************************************  12400000
*      *                                                             *  12450000
*      * Service class information                                   *  12500000
*      *                                                             *  12550000
*      ***************************************************************  12600000
*                                                                       12650000
*                                                                       12700000
         AIF   ('&SVPOLCD' EQ 'NO').L000B                               12750000
         AIF   ('&DSECT' EQ 'YES').L000C                                12800000
         AIF   ('&SVPOLCD' NE 'YES').L000B                              12850000
SVPOLCD  DS    0F        Service class definition section               12900000
         AGO   .L000D                                                   12950000
.L000C   ANOP                                                           13000000
SVPOLCD  DSECT           Service class definition section               13050000
.L000D   ANOP                                                           13100000
SVPOLCNM DS    1CL0008   Service class name                             13150000
SVPOLCDE DS    1CL0032   Service class description                      13200000
SVPOLCWN DS    1CL0008   Name of the workload this service class is    *13250000
                         associated with                                13300000
SVPOLCRN DS    1CL0008   Name of the resource group this service class *13350000
                         is associated with - blanks if no resource    *13400000
                         group association                              13450000
SVPOLCPO DS    1FL4      Offset of service class period entries for    *13500000
                         this service class                             13550000
SVPOLCPN DS    1FL2      Number of service class periods for this      *13600000
                         service class                                  13650000
SVPOLCFL DS    0BL2      Class flags                                    13675000
SVPOLCDH EQU   X'80'     Indicate class histories should be discarded   13680000
SVPOLCPC EQU   X'40'     Indicator for CPU critical                     13685000
SVPOLSTR EQU   X'20'     Indicator for Storage Protection               13690000
SVPOLTRA EQU   X'10'     Indicator for whether this service class is   *13695000
                         used in any transaction subsystem type         13700000
SVPOLADR EQU   X'08'     Indicator for whether this service class is   *13705000
                         used in any address space subsystem type       13710000
SVPOLENC EQU   X'04'     Indicator for whether this service class is   *13715000
                         used in any enclave subsystem type             13720000
         ORG   SVPOLCFL+X'00000002'                                     13725000
SVPOLCGI DS    1FL4      Resource group index - the index of the       *13750000
                         resource group entry in SVPOL of the resource *13800000
                         group to which this service class belongs      13850000
SVPOLCWI DS    1FL4      Workload index - the index of the workload    *13900000
                         entry in SVPOL of the workload to which this  *13950000
                         service class belongs                          14000000
SVPOLCD_LEN EQU *-SVPOLCD                                               14050000
.L000B   ANOP                                                           14100000
*                                                                       14150000
*      ***************************************************************  14200000
*      *                                                             *  14250000
*      * Service class period information                            *  14300000
*      *                                                             *  14350000
*      ***************************************************************  14400000
*                                                                       14450000
*                                                                       14500000
         AIF   ('&SVPOLPD' EQ 'NO').L000E                               14550000
         AIF   ('&DSECT' EQ 'YES').L000F                                14600000
         AIF   ('&SVPOLPD' NE 'YES').L000E                              14650000
SVPOLPD  DS    0F        Service class period definition information    14700000
         AGO   .L0010                                                   14750000
.L000F   ANOP                                                           14800000
SVPOLPD  DSECT           Service class period definition information    14850000
.L0010   ANOP                                                           14900000
SVPOLTYP DS    0BL4      Goal type indicators - mutually exclusive      14950000
SVPOLPRC EQU   X'80'     Percentile response time goal                  15000000
SVPOLAVG EQU   X'40'     Average response time goal                     15050000
SVPOLVEL EQU   X'20'     Velocity goal                                  15100000
SVPOLDSC EQU   X'10'     Discretionary goal                             15150000
SVPOLSTM EQU   X'08'     System goal                                    15200000
         ORG   SVPOLTYP+X'00000004'                                     15250000
SVPOLRS7 DS    1FL1      Reserved                                       15300000
SVPOLRTU DS    1FL1      Response time unit indicator indicating the   *15350000
                         units in which SVPOLVAL is expressed. See     *15400000
                         constants SVPOLRT* for values                  15450000
SVPOLPER DS    1FL2      Goal percentile value                          15500000
SVPOLIMP DS    1FL2      Importance level ranging from 1 to 5 where 1  *15550000
                         is most important                              15600000
SVPOLRS8 DS    1FL2      Reserved                                       15650000
SVPOLVAL DS    1FL4      Response time goal or velocity goal. Zero if  *15700000
                         discretionary or system goal or no goal       *15750000
                         defined.                                       15800000
SVPOLDUR DS    1FL4      Service class period duration in service      *15850000
                         units, or zero for last period                 15900000
SVPOLPD_LEN EQU *-SVPOLPD                                               15950000
.L000E   ANOP                                                           16000000
*                                                                       16050000
*      ***************************************************************  16100000
*      *                                                             *  16150000
*      * Resource group information                                  *  16200000
*      *                                                             *  16250000
*      ***************************************************************  16300000
*                                                                       16350000
*                                                                       16400000
         AIF   ('&SVPOLRG' EQ 'NO').L0011                               16450000
         AIF   ('&DSECT' EQ 'YES').L0012                                16500000
         AIF   ('&SVPOLRG' NE 'YES').L0011                              16550000
SVPOLRG  DS    0F        Resource group definition section              16600000
         AGO   .L0013                                                   16650000
.L0012   ANOP                                                           16700000
SVPOLRG  DSECT           Resource group definition section              16750000
.L0013   ANOP                                                           16800000
SVPOLGNM DS    1CL0008   Resource group name                            16850000
SVPOLGDE DS    1CL0032   Resource group description                     16900000
SVPOLGMN DS    1FL4      If SVPOLMNS = 1, this field contains the      *16950000
                         minimum capacity in unweighted CPU service    *17000000
                         units per second, otherwise this field is 0    17050000
SVPOLGMX DS    1FL4      If SVPOLMXS = 1, this field contains the      *17100000
                         maximum capacity in unweighted CPU service    *17150000
                         units per second, otherwise this field is 0    17200000
SVPOLGLT DS    0BL4      Indicators                                     17250000
SVPOLMXS EQU   X'80'     Maximum capacity was specified                 17300000
SVPOLMNS EQU   X'40'     Minimum capacity was specified                 17350000
SVPOLGSD EQU   X'20'                                                    17375000
         ORG   SVPOLRG+X'00000034'                                      17400000
SVPOLRG_LEN EQU *-SVPOLRG                                               17450000
.L0011   ANOP                                                           17500000
*                                                                       17550000
*      ***************************************************************  17600000
*      *                                                             *  17650000
*      * Report class information                                    *  17700000
*      *                                                             *  17750000
*      ***************************************************************  17800000
*                                                                       17850000
*                                                                       17900000
         AIF   ('&SVPOLRD' EQ 'NO').L0014                               17950000
         AIF   ('&DSECT' EQ 'YES').L0015                                18000000
         AIF   ('&SVPOLRD' NE 'YES').L0014                              18050000
SVPOLRD  DS    0X        report class definition section                18100000
         AGO   .L0016                                                   18150000
.L0015   ANOP                                                           18200000
SVPOLRD  DSECT           report class definition section                18250000
.L0016   ANOP                                                           18300000
SVPOLRNM DS    1CL0008   report class name                              18350000
SVPOLRDE DS    1CL0032   report class description                       18400000
*                                                                       18450000
*    *****************************************************************  18500000
*    *                                                               *  18550000
*    * Constants                                                     *  18600000
*    *                                                               *  18650000
*    *****************************************************************  18700000
*                                                                       18750000
*                                                                       18800000
SVPOL_RTU_MS EQU 1       SVPOLRTU value indicating that SVPOLVAL value *18850000
                         is expressed in milliseconds                   18900000
SVPOL_RTU_SECOND EQU 2   SVPOLRTU value indicating that SVPOLVAL value *18950000
                         is expressed in seconds                        19000000
SVPOL_RTU_MINUTE EQU 3   SVPOLRTU value indicating that SVPOLVAL value *19050000
                         is expressed in minutes                        19100000
SVPOL_RTU_HOUR EQU 4     SVPOLRTU value indicating that SVPOLVAL value *19150000
                         is expressed in hours                          19200000
SVPOL_NAME EQU C'SVPO'   'SVPO' acronym                                 19250000
SVPOL_LEVEL001 EQU 1     Functionality level introduced by WLM in      *19260000
                         SP510.                                         19270000
SVPOL_VER510 EQU 1       WLM SP510 version                              19280000
SVPOL_LEVEL002 EQU 2     Functionality level introduced by WLM in      *19290000
                         SP520.                                         19300000
SVPOL_VER520 EQU 2       WLM SP520 version                              19310000
SVPOL_LEVEL003 EQU 3     Functionality level introduced by WLM in      *19320000
                         OS/390 V1R3                                    19330000
SVPOL_VER530 EQU 3       WLM version number for OS/390 V1R3             19340000
SVPOL_LEVEL004 EQU 4     Functionality level introduced by WLM in      *19350000
                         OS/390 V2R4                                    19354000
SVPOL_VER604 EQU 4       WLM version number for OS/390 V2R4             19358000
SVPOL_LEVEL005 EQU 5     Functionality level introduced by WLM in      *19362000
                         OS/390 V2R5                                    19366000
SVPOL_VER605 EQU 5       WLM version number for OS/390 V2R5             19370000
SVPOL_LEVEL006 EQU 6     Functionality level introduced by WLM in      *19374000
                         OS/390 V2R6                                    19378000
SVPOL_VER606 EQU 6       WLM version number for OS/390 V2R6             19382000
SVPOL_LEVEL007 EQU 7     Functionality level introduced by WLM in      *19383600
                         OS/390 V2R7                                    19385200
SVPOL_VER607 EQU 7       WLM version number for OS/390 V2R7             19386800
SVPOL_LEVEL008 EQU 8     Functionality level introduced by WLM in      *19387400
                         OS/390 V2R7                                    19388000
SVPOL_VER608 EQU 8       WLM version number for OS/390 V2R7             19388600
SVPOL_LEVEL011 EQU 11    Functionality level introduced by WLM in      *19388800
                         OS/390 V2R10                                   19389000
SVPOL_VER703 EQU 11      WLM version number for OS/390 V2R10            19389200
SVPOL_CURRENT_VER EQU 11 Current functionality level used checking     *19389400
                         functionality within WLM product               19390000
SVPOLRD_LEN EQU *-SVPOLRD                                               19400000
.L0014   ANOP                                                           19450000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 19500000
         AIF   ('&LIST' EQ 'YES').P4                                    19550000
.P3      ANOP                                                           19600000
         POP   PRINT                                                    19650000
.P4      ANOP                                                           19700000
.P_EXIT  ANOP                                                           19750000
         MEND                                                           19800000
**/ IWMSVPOL_2:;                                                        19850000
* %IWMSVPOL_INCLUDED = 'YES';                                           19900000
* %DCL ZCBPRINT CHAR EXT;                                               19950000
* %DEACTIVATE ZCBPRINT;                                                 20000000
* %DCL IWMSVPOL_LIST CHAR EXT;                                          20050000
* %DEACTIVATE IWMSVPOL_LIST;                                            20100000
* %IF IWMSVPOL_LIST ^= 'NO' &                                           20150000
*    ZCBPRINT ^= 'NO' %THEN                                             20200000
*   %GOTO IWMSVPOL_3;                                                   20250000
*   @LIST PUSH NOECHO;                                                  20300000
*   @LIST NOASSEMBLE NOECHO;                                            20350000
*   @LIST OFF C NOECHO;                                                 20400000
* %IWMSVPOL_3:;                                                         20450000
*/* Start of PL/X Source                                             */ 20500000
*                                                                       20550000
*   %IF SVPOLVIA = 'YES' %THEN      /* If includer specified SVPOLVIA   20600000
*                                      YES                           */ 20650000
*     %SVPOLVIA = 'VIA';            /* Cause mapping to be VIA       */ 20700000
*   %ELSE                                                               20750000
*     %SVPOLVIA = '';               /* Otherwise do not use VIA      */ 20800000
*   DECLARE                                                             20850000
*                                                                       20900000
*     /***************************************************************/ 20950000
*     /*                                                             */ 21000000
*     /* Service policy header information                           */ 21050000
*     /*                                                             */ 21100000
*     /***************************************************************/ 21150000
*                                                                       21200000
*     1    SVPOLHD  SVPOLVIA BASED BDY(DWORD), /* IWMPQRY Answer area*/ 21250000
*           3    SVPOLNAM CHAR(4),  /* Eyecatcher - SVPO             */ 21300000
*           3    SVPOLLVL FIXED(8), /* Functionality level of    @P1C*/ 21314200
*                                   /* the SVPOL. The            @P1A*/ 21328400
*                                   /* functionality level       @P1A*/ 21342600
*                                   /* defines the highest level @P1A*/ 21356800
*                                   /* of the WLM function that  @P1A*/ 21371000
*                                   /* exists in the SVPOL.      @P1A*/ 21385200
*           3    SVPOLWVN FIXED(8), /* WLM version number        @P1C*/ 21417600
*           3    SVPOLDIL FIXED(16), /* Length of header section     */ 21450000
*           3    SVPOLDLE FIXED(32), /* Total length of the active      21500000
*                                      service policy data structure */ 21550000
*           3    SVPOLDPO FIXED(32), /* Offset to the service policy    21600000
*                                      definition section            */ 21650000
*           3    SVPOLDPL FIXED(16), /* Length of the policy entry in   21700000
*                                      the policy section            */ 21750000
*           3    SVPOLRS2 FIXED(16), /* Reserved                     */ 21800000
*           3    SVPOLDWO FIXED(32), /* Offset to the workload          21850000
*                                      definition section            */ 21900000
*           3    SVPOLDWC FIXED(16), /* Number of workload entries in   21950000
*                                      the workload definition          22000000
*                                      section                       */ 22050000
*           3    SVPOLDWL FIXED(16), /* Length of each workload entry*/ 22100000
*           3    SVPOLDCO FIXED(32), /* Offset to the service class     22150000
*                                      definition section            */ 22200000
*           3    SVPOLDCC FIXED(16), /* Number of service class         22250000
*                                      entries in the service class     22300000
*                                      definition section            */ 22350000
*           3    SVPOLDCL FIXED(16), /* Length of each service class    22400000
*                                      definition entry              */ 22450000
*           3    SVPOLDZO FIXED(32), /* Offset of service class         22500000
*                                      period entries                */ 22550000
*           3    SVPOLDZC FIXED(16), /* Number of service class         22600000
*                                      periods                       */ 22650000
*           3    SVPOLDZL FIXED(16), /* Length of each service class    22700000
*                                      period entry                  */ 22750000
*           3    SVPOLDRO FIXED(32), /* Offset to the report class      22800000
*                                      definition section            */ 22850000
*           3    SVPOLDRC FIXED(16), /* Number of report class          22900000
*                                      entries in the report class      22950000
*                                      definition section            */ 23000000
*           3    SVPOLDRL FIXED(16), /* Length of each report class     23050000
*                                      definition entry              */ 23100000
*           3    SVPOLDGO FIXED(32), /* Offset to the resource group    23150000
*                                      definition section            */ 23200000
*           3    SVPOLDGC FIXED(16), /* Number of resource group        23250000
*                                      entries in the resource group    23300000
*                                      definition                    */ 23350000
*           3    SVPOLDGL FIXED(16), /* Length of each resource group   23400000
*                                      definition entry              */ 23450000
*           3    SVPOLRS3 FIXED(32), /* Reserved                     */ 23500000
*                                                                       23550000
*     /***************************************************************/ 23600000
*     /*                                                             */ 23650000
*     /* Service policy information                                  */ 23700000
*     /*                                                             */ 23750000
*     /***************************************************************/ 23800000
*                                                                       23850000
*     1    SVPOLSP  SVPOLVIA BASED BDY(DWORD), /* Service policy        23900000
*                                      section                       */ 23950000
*           3    SVPOLNSP CHAR(8),  /* Service policy name           */ 24000000
*           3    SVPOLDSP CHAR(32), /* Service policy description    */ 24050000
*           3    SVPOLTPA CHAR(8) BDY(DWORD), /* Time/date (STCK        24100000
*                                      format) of policy activation  */ 24150000
*           3    SVPOLIPU CHAR(8),  /* Userid of the system operator    24200000
*                                      or service administrator who     24250000
*                                      activated the service policy  */ 24300000
*           3    SVPOLSNA CHAR(8),  /* Name of the system on which      24350000
*                                      policy activation was            24400000
*                                      initiated                     */ 24450000
*           3    SVPOLSEQ FIXED(32),/* Classification sequence number   24519980
*                                      Removed svpolsqn added in        24529970
*                                      OW43718.              @OW44749*/ 24539960
*           3    SVPOLASN FIXED(32) ABNORMAL, /* Activation             24583300
*                                      sequence number               */ 24616600
*           3    SVPOLSVD,          /* SVDEF ID information (next 4     24650000
*                                      fields) of service definition    24700000
*                                      from which this policy was       24750000
*                                      extracted                     */ 24800000
*             5    SVPOLIDN CHAR(8) BDY(DWORD), /* Name of the service  24850000
*                                      definition from which the        24900000
*                                      service policy was extracted  */ 24950000
*             5    SVPOLTDI CHAR(8), /* Time/date (STCK format) that    25000000
*                                      the service definition was       25050000
*                                      installed                     */ 25100000
*             5    SVPOLIDU CHAR(8), /* Userid of the service           25150000
*                                      administrator who installed      25200000
*                                      the service definition        */ 25250000
*             5    SVPOLIDS CHAR(8), /* Name of the system on which     25300000
*                                      the service definition was       25350000
*                                      installed                     */ 25400000
*           3    SVPOLIDD CHAR(32), /* Description of service           25450000
*                                      definition from which the        25500000
*                                      service policy was extracted  */ 25550000
*           3    SVPOLCPU FIXED(32), /* CPU service coefficient         25600000
*                                      *10000 - the number by which     25650000
*                                      accumulated CPU service units    25700000
*                                      will be multiplied (weighted) */ 25750000
*           3    SVPOLIOC FIXED(32), /* I/O service coefficient *       25800000
*                                      10000 - the number by which      25850000
*                                      accumulated I/O service units    25900000
*                                      will be multiplied (weighted) */ 25950000
*           3    SVPOLMSO FIXED(32), /* Storage service coefficient     26000000
*                                      (MSO) * 10000 - the number by    26050000
*                                      which accumulated storage        26100000
*                                      service units will be            26150000
*                                      multiplied (weighted)         */ 26200000
*           3    SVPOLSRB FIXED(32), /* SRB service coefficient *       26250000
*                                      10000 - the number by which      26300000
*                                      accumulated SRB service units    26350000
*                                      will be multiplied (weighted) */ 26400000
*           3    SVPOLECP CHAR(4),  /* EBCDIC representation of CPU     26450000
*                                      service coefficient           */ 26500000
*           3    SVPOLEIO CHAR(4),  /* EBCDIC representation of I/O     26550000
*                                      service coefficient           */ 26600000
*           3    SVPOLEMS CHAR(8),  /* EBCDIC representation of         26650000
*                                      Storage service coefficient   */ 26700000
*           3    SVPOLESR CHAR(4),  /* EBCDIC representation of SRB     26750000
*                                      service coefficient           */ 26800000
*           3    SVPOLFL2 BIT(8),   /* SVDEFFL2              @PQC1647*/ 26814200
*             5    SVPOLIOM BIT(1), /* When set indicates that we       26828400
*                                      should include the I/O           26842600
*                                      delays in the execution          26856800
*                                      velocity              @PQC2520*/ 26871000
*             5    SVPOLDAM BIT(1), /* When set indicates dynamic       26874500
*                                      alias tuning available           26878000
*                                                            @OW39854*/ 26881500
*           3    SVPOLRS5 CHAR(3),  /* Reserved              @PQC1647*/ 26885200
*                                                                       26900000
*     /***************************************************************/ 26950000
*     /*                                                             */ 27000000
*     /* Workload information                                        */ 27050000
*     /*                                                             */ 27100000
*     /***************************************************************/ 27150000
*                                                                       27200000
*     1    SVPOLWD  SVPOLVIA BASED, /* Workload definition section   */ 27250000
*           3    SVPOLWNM CHAR(8),  /* Workload name                 */ 27300000
*           3    SVPOLWDE CHAR(32), /* Workload description          */ 27350000
*                                                                       27400000
*     /***************************************************************/ 27450000
*     /*                                                             */ 27500000
*     /* Service class information                                   */ 27550000
*     /*                                                             */ 27600000
*     /***************************************************************/ 27650000
*                                                                       27700000
*     1    SVPOLCD  SVPOLVIA BASED, /* Service class definition         27750000
*                                      section                       */ 27800000
*           3    SVPOLCNM CHAR(8),  /* Service class name            */ 27850000
*           3    SVPOLCDE CHAR(32), /* Service class description     */ 27900000
*           3    SVPOLCWN CHAR(8),  /* Name of the workload this        27950000
*                                      service class is associated      28000000
*                                      with                          */ 28050000
*           3    SVPOLCRN CHAR(8),  /* Name of the resource group       28100000
*                                      this service class is            28150000
*                                      associated with - blanks if no   28200000
*                                      resource group association    */ 28250000
*           3    SVPOLCPO FIXED(32), /* Offset of service class         28300000
*                                      period entries for this          28350000
*                                      service class                 */ 28400000
*           3    SVPOLCPN FIXED(16), /* Number of service class         28450000
*                                      periods for this service class*/ 28500000
*           3    SVPOLCFL BIT(16),   /* Class flags          @WLMPACT*/ 28525000
*             5    SVPOLCDH BIT(1),  /* Indicate class histories should 28550000
*                                       be discarded         @WLMPACT*/ 28552700
*             5    SVPOLCPC BIT(1),  /* Indicator for CPU critical      28555400
*                                                            @WLMPGMC*/ 28558100
*             5    SVPOLSTR BIT(1),  /* Indicator for Storage           28560800
*                                       Protection           @WLMPGMS*/ 28563500
*             5    SVPOLTRA BIT(1),  /* Indicator for whether this      28566200
*                                       service class is used in any    28568900
*                                       transaction subsystem type      28571600
*                                                            @WLMPGMS*/ 28574300
*             5    SVPOLADR BIT(1),  /* Indicator for whether this      28577000
*                                       service class is used in any    28579700
*                                       address space subsystem type    28582400
*                                                            @WLMPGMS*/ 28585100
*             5    SVPOLENC BIT(1),  /* Indicator for whether this      28587800
*                                       service class is used in any    28590500
*                                       enclave subsystem type          28593200
*                                                            @WLMPGMS*/ 28595900
*           3    SVPOLCGI FIXED(32), /* Resource group index - the      28600000
*                                      index of the resource group      28650000
*                                      entry in SVPOL of the resource   28700000
*                                      group to which this service      28750000
*                                      class belongs                 */ 28800000
*           3    SVPOLCWI FIXED(32), /* Workload index - the index of   28850000
*                                      the workload entry in SVPOL of   28900000
*                                      the workload to which this       28950000
*                                      service class belongs         */ 29000000
*                                                                       29050000
*     /***************************************************************/ 29100000
*     /*                                                             */ 29150000
*     /* Service class period information                            */ 29200000
*     /*                                                             */ 29250000
*     /***************************************************************/ 29300000
*                                                                       29350000
*     1    SVPOLPD  SVPOLVIA BASED, /* Service class period             29400000
*                                      definition information        */ 29450000
*           3    SVPOLTYP BIT(32),  /* Goal type indicators -           29500000
*                                      mutually exclusive            */ 29550000
*             5    SVPOLPRC BIT(1), /* Percentile response time goal */ 29600000
*             5    SVPOLAVG BIT(1), /* Average response time goal    */ 29650000
*             5    SVPOLVEL BIT(1), /* Velocity goal                 */ 29700000
*             5    SVPOLDSC BIT(1), /* Discretionary goal            */ 29750000
*             5    SVPOLSTM BIT(1), /* System goal                   */ 29800000
*           3    SVPOLRS7 FIXED(8), /* Reserved                      */ 29850000
*           3    SVPOLRTU FIXED(8), /* Response time unit indicator     29900000
*                                      indicating the units in which    29950000
*                                      SVPOLVAL is expressed. See       30000000
*                                      constants SVPOLRT* for values */ 30050000
*           3    SVPOLPER FIXED(16), /* Goal percentile value        */ 30100000
*           3    SVPOLIMP FIXED(16), /* Importance level ranging from   30150000
*                                      1 to 5 where 1 is most           30200000
*                                      important                     */ 30250000
*           3    SVPOLRS8 FIXED(16), /* Reserved                     */ 30300000
*           3    SVPOLVAL FIXED(32), /* Response time goal or           30350000
*                                      velocity goal. Zero if           30400000
*                                      discretionary or system goal     30450000
*                                      or no goal defined.           */ 30500000
*           3    SVPOLDUR FIXED(32), /* Service class period duration   30550000
*                                      in service units, or zero for    30600000
*                                      last period                   */ 30650000
*                                                                       30700000
*     /***************************************************************/ 30750000
*     /*                                                             */ 30800000
*     /* Resource group information                                  */ 30850000
*     /*                                                             */ 30900000
*     /***************************************************************/ 30950000
*                                                                       31000000
*     1    SVPOLRG  SVPOLVIA BASED, /* Resource group definition        31050000
*                                      section                       */ 31100000
*           3    SVPOLGNM CHAR(8),  /* Resource group name           */ 31150000
*           3    SVPOLGDE CHAR(32), /* Resource group description    */ 31200000
*           3    SVPOLGMN FIXED(32), /* If SVPOLMNS = 1, this field     31250000
*                                      contains the minimum capacity    31300000
*                                      in unweighted CPU service units  31350000
*                                      per second, otherwise this       31400000
*                                      field is 0                    */ 31450000
*           3    SVPOLGMX FIXED(32), /* If SVPOLMXS = 1, this field     31500000
*                                      contains the maximum capacity    31550000
*                                      in unweighted CPU service units  31600000
*                                      per second, otherwise this       31650000
*                                      field is 0                    */ 31700000
*           3    SVPOLGLT BIT(32),  /* Indicators                    */ 31750000
*             5    SVPOLMXS BIT(1), /* Maximum capacity was             31800000
*                                      specified                     */ 31850000
*             5    SVPOLMNS BIT(1), /* Minimum capacity was             31900000
*                                      specified                     */ 31950000
*             5    SVPOLGSD BIT(1), /*                                  31966600
*                                                            @WLMCACT*/ 31983200
*                                                                       32000000
*     /***************************************************************/ 32050000
*     /*                                                             */ 32100000
*     /* Report class information                                    */ 32150000
*     /*                                                             */ 32200000
*     /***************************************************************/ 32250000
*                                                                       32300000
*     1    SVPOLRD  SVPOLVIA BASED, /* report class definition          32350000
*                                      section                       */ 32400000
*           3    SVPOLRNM CHAR(8),  /* report class name             */ 32450000
*           3    SVPOLRDE CHAR(32); /* report class description      */ 32500000
*                                                                       32550000
*   /*****************************************************************/ 32600000
*   /*                                                               */ 32650000
*   /* Constants                                                     */ 32700000
*   /*                                                               */ 32750000
*   /*****************************************************************/ 32800000
*                                                                       32850000
*   DECLARE                                                             32900000
*     SVPOL_RTU_MS FIXED(8) CONSTANT(1), /* SVPOLRTU value indicating   32950000
*                                      that SVPOLVAL value is           33000000
*                                      expressed in milliseconds     */ 33050000
*     SVPOL_RTU_SECOND FIXED(8) CONSTANT(2), /* SVPOLRTU value          33100000
*                                      indicating that SVPOLVAL value   33150000
*                                      is expressed in seconds       */ 33200000
*     SVPOL_RTU_MINUTE FIXED(8) CONSTANT(3), /* SVPOLRTU value          33250000
*                                      indicating that SVPOLVAL value   33300000
*                                      is expressed in minutes       */ 33350000
*     SVPOL_RTU_HOUR FIXED(8) CONSTANT(4), /* SVPOLRTU value            33400000
*                                      indicating that SVPOLVAL value   33450000
*                                      is expressed in hours         */ 33500000
*                                                                       33550000
*     SVPOL_NAME CHAR(4) CONSTANT('SVPO'), /* 'SVPO' acronym         */ 33600000
*     SVPOL_LEVEL001 FIXED(8) CONSTANT(1), /*                           33609200
*                                  Functionality level introduced by    33618400
*                                  WLM in SP510.                 @P1C*/ 33627600
*     SVPOL_VER510 FIXED(8) CONSTANT(1), /*                             33636800
*                                  WLM SP510 version             @P1C*/ 33646000
*     SVPOL_LEVEL002 FIXED(8) CONSTANT(2), /*                           33655200
*                                  Functionality level introduced by    33664400
*                                  WLM in SP520.                 @P1C*/ 33673600
*     SVPOL_VER520 FIXED(8) CONSTANT(2), /*                             33682800
*                                  WLM SP520 version             @P1C*/ 33692000
*     SVPOL_LEVEL003 FIXED(8) CONSTANT(3), /*                           33701200
*                                  Functionality level introduced by    33710400
*                                  WLM in OS/390 V1R3        @WLMCSTP*/ 33719600
*     SVPOL_VER530 FIXED(8) CONSTANT(3), /*                             33728800
*                                  WLM version number for OS/390 V1R3   33738000
*                                                            @WLMCSTP*/ 33747200
*     SVPOL_LEVEL004 FIXED(8) CONSTANT(4), /*                           33756400
*                                  Functionality level introduced by    33765600
*                                  WLM in OS/390 V2R4        @WLMPBAT*/ 33774800
*     SVPOL_VER604 FIXED(8) CONSTANT(4), /*                             33784000
*                                  WLM version number for OS/390 V2R4   33793200
*                                                            @WLMPBAT*/ 33802400
*     SVPOL_LEVEL005 FIXED(8) CONSTANT(5), /*                           33803700
*                                  Functionality level introduced by    33805000
*                                  WLM in OS/390 V2R5        @WLMPSDC*/ 33806300
*     SVPOL_VER605 FIXED(8) CONSTANT(5), /*                             33807600
*                                  WLM version number for OS/390 V2R5   33808900
*                                                            @WLMPSDC*/ 33810200
*     SVPOL_LEVEL006 FIXED(8) CONSTANT(6), /*                           33811500
*                                  Functionality level introduced by    33812800
*                                  WLM in OS/390 V2R6        @WLMPSDC*/ 33814100
*     SVPOL_VER606 FIXED(8) CONSTANT(6), /*                             33815400
*                                  WLM version number for OS/390 V2R6   33816700
*                                                            @WLMPSDC*/ 33818000
*     SVPOL_LEVEL007 FIXED(8) CONSTANT(7), /*                           33818300
*                                  Functionality level introduced by    33818600
*                                  WLM in OS/390 V2R7        @WLMPMQS*/ 33818900
*     SVPOL_VER607 FIXED(8) CONSTANT(7), /*                             33819200
*                                  WLM version number for OS/390 V2R7   33819500
*                                                            @WLMPMQS*/ 33819800
*     SVPOL_LEVEL008 FIXED(8) CONSTANT(8), /*                           33819900
*                                  Functionality level introduced by    33820000
*                                  WLM in OS/390 V2R7        @WLMPTAL*/ 33820100
*     SVPOL_VER608 FIXED(8) CONSTANT(8), /*                             33820200
*                                  WLM version number for OS/390 V2R7   33820300
*                                                            @WLMPTAL*/ 33820400
*     SVPOL_LEVEL011 FIXED(8) CONSTANT(11), /*                          33821400
*                                  Functionality level introduced by    33822400
*                                  WLM in OS/390 V2R10       @WLMPGMY*/ 33823400
*     SVPOL_VER703 FIXED(8) CONSTANT(11), /*                            33824400
*                                  WLM version number for OS/390 V2R10  33825400
*                                                            @WLMPGMY*/ 33826400
*     SVPOL_CURRENT_VER FIXED(8) CONSTANT(SVPOL_LEVEL011); /*           33827400
*                                  Current functionality level used     33828400
*                                  checking functionality within WLM    33830000
*                                  product                   @WLMPGMY*/ 33840000
*/* End of PL/X Source                                               */ 33850000
* %IF IWMSVPOL_LIST ^= 'NO' &                                           33900000
*    ZCBPRINT ^= 'NO' %THEN                                             33950000
*   %GOTO IWMSVPOL_4;                                                   34000000
*   @LIST POP NOECHO;                                                   34050000
* %IWMSVPOL_4:;                                                         34100000
* %END;                                                                 34150000
