*                                                                       00050000
* %DCL IWMSVDEF_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IWMSVDEF_INCLUDED;                                        00150000
* %IF IWMSVDEF_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 00014. CBGEN compile date 00013         */ 00319990
*% /*                                                                   00350000
         MACRO                                                          00400000
         IWMSVDEF &DSECT=YES,&LIST=YES,&TITLE=YES,&SVDEFHDR=YES,       *00441600
               &SVDEFPOL=COND,&SVDEFWKL=COND,&SVDEFSCL=COND,           *00483200
               &SVDEFGRP=COND,&SVDEFRCL=COND,&SVDEFCLA=COND,           *00524800
               &SVDEFPDA=COND,&SVDEFRGA=COND,&SVDEFCON=COND,           *00566400
               &SVDEFEXT=COND                                           00608000
         GBLC  &IWMSVDEF_INCLUDED                                       00650000
         GBLC  &ZCBPRINT                                                00700000
&IWMSVDEF_INCLUDED SETC 'YES'                                           00750000
         AIF   ('&LIST' EQ 'NONE').P0                                   00766600
         AIF   ('&TITLE' EQ 'NO').P5                                    00783200
 TITLE   'IWMSVDEF  - WLM Service Definition mapping              '     00800000
.P5      ANOP                                                           00825000
**/ IWMSVDEF_1:;                                                        00850000
*/***START OF SPECIFICATIONS******************************************/ 00900000
*/*                                                                  */ 00950000
*/*01* Proprietary statement:                                        */ 01000000
*/*                                                                  */ 01050000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 01100000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 01150000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1993, 2000                 */ 01200000
*/*                                                                  */ 01300000
*/*                                                                  */ 01350000
*/*01* External classification: GUPI                             @L1C*/ 01400000
*/*01* End of External classification                                */ 01450000
*/*                                                                  */ 01500000
*/*01* Status: HBB7703                                               */ 01550000
*/*                                                                  */ 01600000
*/*01* Descriptive Name: WLM Service Definition mapping              */ 01650000
*/*                                                                  */ 01700000
*/*02*  Acronym: SVDEF                                               */ 01750000
*/*                                                                  */ 01800000
*/*01* Macro Name: IWMSVDEF                                          */ 01850000
*/*                                                                  */ 01900000
*/*01* DSECT Name: SVDEFHDR                                          */ 01950000
*/*                SVDEFPOL                                      @P3A*/ 01954500
*/*                SVDEFWKL                                      @P3A*/ 01959000
*/*                SVDEFSCL                                      @P3A*/ 01963500
*/*                SVDEFGRP                                      @P3A*/ 01968000
*/*                SVDEFRCL                                      @P3A*/ 01972500
*/*                SVDEFCLA                                      @P3A*/ 01977000
*/*                SVDEFPDA                                      @P3A*/ 01981500
*/*                SVDEFRGA                                      @P3A*/ 01986000
*/*                SVDEFCON                                      @P3A*/ 01990500
*/*                SVDEFEXT                                      @P3A*/ 01995000
*/*                                                                  */ 02000000
*/*01* Component: Workload Manager (SCWLM)                           */ 02050000
*/*                                                                  */ 02100000
*/*01* Eye-Catcher: SVDE                                             */ 02150000
*/*02*  Offset: 0                                                    */ 02200000
*/*02*  Length: CHAR(4)                                              */ 02250000
*/*                                                                  */ 02300000
*/*01* Storage Attributes:                                           */ 02350000
*/*02*  Subpool: Any                                                 */ 02400000
*/*02*  Key: Any                                                     */ 02450000
*/*02*  Residency: Above 16M line                                    */ 02500000
*/*                                                                  */ 02550000
*/*01* Size: Determined at run time                                  */ 02600000
*/*                                                                  */ 02650000
*/*01* Created by: Caller                                            */ 02700000
*/*                                                                  */ 02750000
*/*01* Pointed to by: offset into SERVD (IWMSERVD)                   */ 02800000
*/*                                                                  */ 02850000
*/*01* Serialization: None                                           */ 02900000
*/*                                                                  */ 02950000
*/*01* Function: Contains general service definition information     */ 02960000
*/*              including service policies, workloads, service      */ 02970000
*/*              classes, report classes, resource groups,           */ 02980000
*/*              base and override service classes (including the    */ 02990000
*/*              period information), base and override resource     */ 03000000
*/*              group values, and constant information.             */ 03010000
*/*                                                                  */ 03020000
*/*              All timestamps are local time expressed in          */ 03030000
*/*              STCK format.                                        */ 03040000
*/*                                                                  */ 03050000
*/*01* Restrictions:                                                 */ 03100000
*/*              None                                                */ 03150000
*/*                                                                  */ 03151600
*/*01* Method of Access:                                             */ 03250000
*/*                                                                  */ 03300000
*/*02*  ASM:                                                         */ 03350000
*/*          Specify: IWMSVDEF                                       */ 03400000
*/*                                                                  */ 03450000
*/*02*  PLX:                                                         */ 03500000
*/*                                                                  */ 03550000
*/*          %INCLUDE SYSLIB(IWMSVDEF)                               */ 03600000
*/*          Using on SVDEFHDR gives addressability to the SVDEF @P1C*/ 03650000
*/*          header section.                                         */ 03700000
*/*          Subsequent usings must be done to get addressability    */ 03750000
*/*          to the additional sections (DSECTs) as follows:         */ 03800000
*/*          DSECT    USING                                          */ 03850000
*/*          -----    -----                                          */ 03900000
*/*          SVDEFPOL A(SVDEFHDR) + SVDEFPO                      @P1C*/ 03950000
*/*          SVDEFWKL A(SVDEFHDR) + SVDEFWO                      @P1C*/ 04000000
*/*          SVDEFSCL A(SVDEFHDR) + SVDEFCO                      @P1C*/ 04050000
*/*          SVDEFGRP A(SVDEFHDR) + SVDEFGO                      @P1C*/ 04100000
*/*          SVDEFRCL A(SVDEFHDR) + SVDEFRO                      @P1C*/ 04150000
*/*          SVDEFCLA A(SVDEFHDR) + SVDEFCAO                         */ 04250000
*/*          SVDEFPDA A(SVDEFSCL) + SVDEFCAS                         */ 04300000
*/*          SVDEFRGA A(SVDEFHDR) + SVDEFGAO                         */ 04350000
*/*          SVDEFCON A(SVDEFHDR) + SVDEFCNO                         */ 04400000
*/*          SVDEFEXT A(SVDEFHDR) + SVDEF_EXT_OFF  or            @P1A*/ 04404100
*/*                   A(SVDEFHDR) + SVDEF_SP_EXT_OFF  or         @L1A*/ 04408200
*/*                   A(SVDEFHDR) + SVDEF_WD_EXT_OFF  or         @L1A*/ 04412400
*/*                   A(SVDEFHDR) + SVDEF_CD_EXT_OFF  or         @L1A*/ 04418600
*/*                   A(SVDEFHDR) + SVDEF_RG_EXT_OFF  or         @L1A*/ 04424800
*/*                   A(SVDEFHDR) + SVDEF_RD_EXT_OFF  or         @L1A*/ 04431000
*/*                   A(SVDEFHDR) + SVDEF_CLA_EXT_OFF or         @L1A*/ 04437200
*/*                   A(SVDEFHDR) + SVDEF_RGA_EXT_OFF            @P1C*/ 04443600
*/*                                                                  */ 04450000
*/*          In cases where there are multiple elements in a         */ 04500000
*/*          section, subsequent elements can be found by adding     */ 04550000
*/*          the size of one element (in the header section) to      */ 04600000
*/*          the element at hand.                                    */ 04650000
*/*                                                                  */ 04950000
*/*01* Notes:                                                    @P6A*/ 04951000
*/*                                                              @P6A*/ 04952000
*/*    To add extensions to the service definition:              @P6A*/ 04953000
*/*                                                              @P6A*/ 04954000
*/*    The following fields must be updated:                     @P6A*/ 04955000
*/*                                                              @P6A*/ 04956000
*/*     1) SVDEF_EXT_DATA_OFF - the offset to the beginning of   @P6A*/ 04957000
*/*                             the extension data, from the     @P6A*/ 04958000
*/*                             beginning of IWMSVDEF.           @P6A*/ 04959000
*/*     2) SVDEF_EXT_DATA_LEN - the total length of the          @P6A*/ 04960000
*/*                             extension data, not including    @P6A*/ 04961000
*/*                             the length of the extension      @P6A*/ 04962000
*/*                             entries.                         @P6A*/ 04963000
*/*                                                              @P6A*/ 04964000
*/*    For each part of the service definition with extensions,  @P6A*/ 04965000
*/*    the appropriate fields in the SVDEF must be updated with: @P6A*/ 04966000
*/*                                                              @P6A*/ 04967000
*/*     1) the offset to the extension entries from the          @P6A*/ 04968000
*/*        beginning of IWMSVDEF (i.e. SVDEF_EXT_OFF).           @P6A*/ 04969000
*/*                                                              @P6A*/ 04970000
*/*     2) the number of extension entries (i.e. SVDEF_EXT_NUM). @P6A*/ 04971000
*/*                                                              @P6A*/ 04972000
*/*     3) the length of an extension entry (i.e. SVDEF_EXT_SIZ).@P6A*/ 04973000
*/*                                                              @P6A*/ 04974000
*/*    Each extension entry (mapped by DSECT SVDEFEXT) must have @P6A*/ 04975000
*/*    the following fields filled in:                           @P6A*/ 04976000
*/*                                                              @P6A*/ 04977000
*/*     1) SVDEFID - identifier of the product adding the        @P6A*/ 04978000
*/*                  extension.                                  @P6A*/ 04979000
*/*                                                              @P6A*/ 04980000
*/*     2) SVDEFROB - The name of the related object. For        @P6A*/ 04981000
*/*                   example, if you are adding an extension    @P6A*/ 04982000
*/*                   to a service class, this field should      @P6A*/ 04983000
*/*                   contain the service class name.            @P6A*/ 04984000
*/*                                                              @P6A*/ 04985000
*/*     3) SVDEFEPN - Related policy name, if the extension is   @P6A*/ 04986000
*/*                   for a service class or resource group.     @P6A*/ 04987000
*/*                   Otherwise, leave blank.                    @P6A*/ 04988000
*/*                                                              @P6A*/ 04989000
*/*     4) SVDEFEDL - The length of the extension data.          @P6A*/ 04990000
*/*                                                              @P6A*/ 04991000
*/*     5) SVDEFEDO - The offset to the extension data from the  @P6A*/ 04992000
*/*                   start of the extension data.               @P6A*/ 04993000
*/*                                                              @P6A*/ 04994000
*/*                                                              @P6A*/ 04995000
*/*                                                                  */ 04996000
*/*01* Change Activity:                                              */ 05000000
*/*    $L0= WLMI,    HBB5510, 930315,PD00BV: WLM Stage I             */ 05033300
*/*    $T1= PIG5037, HBB5510, 940202,PD88IK: OW01260: CDPI change@T1A*/ 05058300
*/*    $L1= WLMRM,   HBB5510, 940117,PD00BV: WLM 5.2             @L1A*/ 05083300
*/*    $P1= PN71296  HBB5520, 940908,PD88D5: Correct DSECT info  @P1A*/ 05085600
*/*    $P2= PIG5510  HBB5510, 940915,PD72DB: OW08866                 */ 05087900
*/*                                          Migration support   @P2A*/ 05090200
*/*    $P3= PN71675  HBB5520  941020 PD88D0: Correct DSECT info  @P3A*/ 05092500
*/*    $P4= PIG5386  HBB5520  940915 PD72DB: OW08866                 */ 05094800
*/*                                          Migration support   @P4A*/ 05097100
*/*    $P5= PN71993  HBB5520  941122 PD88CG: OW08866                 */ 05097800
*/*                                          Migration support   @P5A*/ 05098500
*/*    $P6= PN72034  HBB5520  941201 PD88D0: Prolog updates      @P6A*/ 05099200
*/*    $WLMPSTP      HBB6603  950612 PD88DB: Stored SQL procedures   */ 05099300
*/*                                                          @WLMPSTP*/ 05099400
*/*         OW15413  HBB5520  950908 B9HACG: Correct assembler form  */ 05099500
*/*                                          of the macro.   @WA15413*/ 05099600
*/*    $PQC1647      HBB6603  960627 PDB9DB: Support option for      */ 05099700
*/*                                          I/O execution delay     */ 05099800
*/*                                          and velocity    @PQC1647*/ 05099900
*/*    $PQC2520      HBB6603  960917 PDB9DB: Fix defaults    @PQC2520*/ 05116600
*/*    $WLMPBAT      JBB6604  960926 B9HAGD: Classify by priority    */ 05122100
*/*                                                          @WLMPBAT*/ 05127600
*/*    $WLMPSDC      HBB6606  970807 B9HAKP: Service defn comments   */ 05129500
*/*                                                          @WLMPSDC*/ 05131400
*/*    $WLMPMQS      JBB6607  970417 B9HARF: Process Name            */ 05132000
*/*                                                          @WLMPMQS*/ 05132600
*/*    $WLMPTAL      JBB6607  980501 B9HAMS: Scott Monheimer         */ 05132700
*/*                                          Dynamic alias tuning    */ 05132800
*/*                                          Add SVDEFDAM    @WLMPTAL*/ 05132900
*/*    $OW39854      JBB6607  990914 PDVA:   Victor Alonzo           */ 05134400
*/*                                          Changed comment for     */ 05135900
*/*                                          SVDEFDAM to ON means    */ 05137400
*/*                                          available       @OW39854*/ 05138900
*/*                                                                  */ 05140400
*/*    $WLMPGMY      HBB7703  991027 B9HAPC: Patrick Chan            */ 05141900
*/*                                          Add constants for       */ 05143400
*/*                                          functionality level 11  */ 05144900
*/*                                                          @WLMPGMY*/ 05146400
*/*    $WLMPGMC      HBB7703  991222 B9HAPC: Patrick Chan            */ 05146600
*/*                                          Add indication for      */ 05146800
*/*                                          CPU Protection in       */ 05147000
*/*                                          Service Class           */ 05147200
*/*                                                          @WLMPGMC*/ 05147400
*/*                                                                  */ 05147900
*/***END OF SPECIFICATIONS********************************************/ 05150000
*% /*                                                                   05200000
.P0      ANOP                                                           05225000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05250000
         AIF   ('&LIST' EQ 'YES').P2                                    05300000
.P1      ANOP                                                           05350000
         PUSH  PRINT                                                    05400000
         PRINT OFF                                                      05450000
.P2      ANOP                                                           05500000
         AIF   ('&SVDEFHDR' EQ 'NO').L0002                              05550000
         AIF   ('&DSECT' EQ 'YES').L0003                                05600000
         AIF   ('&SVDEFHDR' NE 'YES').L0002                             05650000
SVDEFHDR DS    0D                                                       05700000
         AGO   .L0004                                                   05750000
.L0003   ANOP                                                           05800000
SVDEFHDR DSECT                                                          05850000
.L0004   ANOP                                                           05900000
SVDEFNAM DS    1CL0004   Eyecatcher (SVDE)                              05950000
SVDEFLVL DS    1FL1      Functionality level of the SVDEF.              05960200
*                                                                       05970400
*      ***************************************************************  05980600
*      *                                                             *  05990800
*      * The functionality level defines                                06001000
*      * the highest level of WLM function@P2A that exists in the    *  06011200
*      * SVDEF.                                                         06021400
*      *                                                             *  06031600
*      ***************************************************************  06041800
*                                                                       06052000
*                                                                       06062200
SVDEFWVN DS    1FL1      WLM version number                             06072400
SVDEFDIL DS    1FL2      Size of header section                         06083600
SVDEFDES DS    1CL0032   Service definition description                 06117200
SVDEFSIZ DS    1FL4      Size of SVDEF                                  06150800
SVDEFPO  DS    1FL4      Offset of policy section if the number of     *06184400
                         policies is nonzero (otherwise this field is  *06218000
                         ignored)                                       06251600
SVDEFPN  DS    1FL2      Number of policy entries                       06285200
SVDEFPS  DS    1FL2      Size of policy entry                           06318800
SVDEFWO  DS    1FL4      Offset of workload section if the number of   *06352400
                         workloads is nonzero (otherwise this field is *06386000
                         ignored)                                       06419600
SVDEFWN  DS    1FL2      Number of workload entries                     06453200
SVDEFWS  DS    1FL2      Size of workload entry                         06486800
SVDEFCO  DS    1FL4      Offset of service class section if number of  *06520400
                         service classes is nonzero (otherwise this    *06554000
                         field is ignored)                              06587600
SVDEFCN  DS    1FL2      Number of service class entries                06621200
SVDEFCS  DS    1FL2      Size of service class entry                    06654800
SVDEFGO  DS    1FL4      Offset of resource group section if number of *06688400
                         resource groups is nonzero (otherwise this    *06722000
                         field is ignored)                              06755600
SVDEFGN  DS    1FL2      Number of resource group entries               06789200
SVDEFGS  DS    1FL2      Size of resource group entry                   06822800
SVDEFRO  DS    1FL4      Offset of report class section if number of   *06856400
                         report classes is nonzero (otherwise this     *06890000
                         field is ignored)                              06923600
SVDEFRN  DS    1FL2      Number of report class entries                 06957200
SVDEFRS  DS    1FL2      Size of report class entry                     06990800
SVDEFCAO DS    1FL4      Offset of service class attribute section if  *07024400
                         number of service class attributes is nonzero *07058000
                         (otherwise this field is ignored)              07091600
SVDEFCAN DS    1FL2      Number of service class attribute entries      07125200
SVDEFCAS DS    1FL2      Size of service class attribute entry          07158800
SVDEFGAO DS    1FL4      Offset of resource group attribute section if *07192400
                         number of service class attributes is nonzero *07226000
                         (otherwise this field is ignored)              07259600
SVDEFGAN DS    1FL2      Number of resource group attribute entries     07293200
SVDEFGAS DS    1FL2      Size of resource group attribute entry         07326800
SVDEFCNO DS    1FL4      Offset of constant information section         07360400
SVDEFCNS DS    1FL2      Size of constant information entry             07394000
SVDEFCPS DS    1FL2      Size of each service class period entry        07427600
SVDEFID  DS    0CL0032   Service definition id starts here (can be     *07461200
                         mapped by SVIDSSVD in IWMSVIDS)                07494800
SVDEFIDN DS    1CL0008   Service definition name                        07528400
SVDEFTDI DS    1CL0008   Timestamp (STCK format) in local time the     *07562000
                         service definition was installed (on install  *07595600
                         processing (IWMDINST) this field is set by    *07629200
                         WLM)                                           07662800
SVDEFIDU DS    1CL0008   Userid of the service administrator that      *07700000
                         installed the service definition (on install  *07725000
                         processing (IWMDINST) this field is set by    *07750000
                         WLM)                                           07775000
SVDEFIDS DS    1CL0008   Name of the system on which the service       *07800000
                         definition was installed (on install          *07801600
                         processing (IWMDINST) this field is set by    *07803200
                         WLM)                                           07804800
         DS    1CL0032   Reserved for additional triplets               07806400
SVDEFPRO DS    1CL0032   ID of product which performed the             *07808000
                         installation (mapped by SVIDSPRD)              07809600
SVDEF_EXT_OFF DS 1FL4    Offset of service definition extension        *07811200
                         section if number of service definition       *07812800
                         extensions is nonzero (otherwise this field   *07814400
                         is ignored)                                    07816000
SVDEF_EXT_NUM DS 1FL2    Number of service definition extension        *07817600
                         entries                                        07819200
SVDEF_EXT_SIZ DS 1FL2    Size of service definition extension entry     07820800
SVDEF_SP_EXT_OFF DS 1FL4 Offset of policy extension section if number  *07822400
                         of policy extensions is nonzero (otherwise    *07824000
                         this field is ignored)                         07825600
SVDEF_SP_EXT_NUM DS 1FL2 Number of policy extension entries             07827200
SVDEF_SP_EXT_SIZ DS 1FL2 Size of policy extension entry                 07828800
SVDEF_WD_EXT_OFF DS 1FL4 Offset of workload extension section if       *07830400
                         number of workload extensions is nonzero      *07832000
                         (otherwise this field is ignored)              07833600
SVDEF_WD_EXT_NUM DS 1FL2 Number of workload extension entries           07835200
SVDEF_WD_EXT_SIZ DS 1FL2 Size of workload extension entry               07836800
SVDEF_CD_EXT_OFF DS 1FL4 Offset of service class extension section if  *07838400
                         number of service class extensions is nonzero *07840000
                         (otherwise this field is ignored)              07841600
SVDEF_CD_EXT_NUM DS 1FL2 Number of service class extension entries      07843200
SVDEF_CD_EXT_SIZ DS 1FL2 Size of service class extension entry          07844800
SVDEF_RG_EXT_OFF DS 1FL4 Offset of resource group extension section if *07846400
                         number of resource group extensions is        *07848000
                         nonzero (otherwise this field is ignored)      07849600
SVDEF_RG_EXT_NUM DS 1FL2 Number of resource group extension entries     07851200
SVDEF_RG_EXT_SIZ DS 1FL2 Size of resource group extension entry         07852800
SVDEF_RD_EXT_OFF DS 1FL4 Offset of report class extension section if   *07854400
                         number of report class extensions is nonzero  *07856000
                         (otherwise this field is ignored)              07857600
SVDEF_RD_EXT_NUM DS 1FL2 Number of report class extension entries       07859200
SVDEF_RD_EXT_SIZ DS 1FL2 Size of report class extension entry           07860800
SVDEF_CLA_EXT_OFF DS 1FL4 Offset of service class attribute extension  *07862400
                         section if number of service class attribute  *07864000
                         extensions is nonzero (otherwise this field   *07865600
                         is ignored)                                    07867200
SVDEF_CLA_EXT_NUM DS 1FL2 Number of service class attribute extension  *07868800
                         entries                                        07870400
SVDEF_CLA_EXT_SIZ DS 1FL2 Size of service class attribute extension    *07872000
                         entry                                          07873600
SVDEF_RGA_EXT_OFF DS 1FL4 Offset of resource group attribute extension *07875200
                         section if number of resource class attribute *07876800
                         extensions is nonzero (otherwise this field   *07878400
                         is ignored)                                    07880000
SVDEF_RGA_EXT_NUM DS 1FL2 Number of resource group attribute extension *07881600
                         entries                                        07883200
SVDEF_RGA_EXT_SIZ DS 1FL2 Size of resource group attribute extension   *07884800
                         entry                                          07886400
         DS    1CL0032   Reserved for additional extension triplets     07888000
SVDEF_EXT_DATA_OFF DS 1FL4 Offset of extended data (0 if no extended   *07889600
                         data exists)                                   07891200
SVDEF_EXT_DATA_LEN DS 1FL4 Length of extended data                      07892800
         DS    1CL0004   Reserved                                       07894400
SVDEFHDR_LEN EQU *-SVDEFHDR                                             07900000
.L0002   ANOP                                                           07950000
         AIF   ('&SVDEFPOL' EQ 'NO').L0005                              08000000
         AIF   ('&DSECT' EQ 'YES').L0006                                08050000
         AIF   ('&SVDEFPOL' NE 'YES').L0005                             08100000
SVDEFPOL DS    0D        Service policy section                         08150000
         AGO   .L0007                                                   08200000
.L0006   ANOP                                                           08250000
SVDEFPOL DSECT           Service policy section                         08300000
.L0007   ANOP                                                           08350000
SVDEFPNM DS    1CL0008   Policy name                                    08400000
SVDEFPDE DS    1CL0032   Policy description                             08450000
SVDEFPIU DS    1CL0008   Userid of policy creator                       08500000
SVDEFPIT DS    1CL0008   Timestamp of initial creation                  08550000
SVDEFPRU DS    1CL0008   Userid of policy last update                   08600000
SVDEFPRT DS    1CL0008   Timestamp of policy last update                08650000
SVDEFPOL_LEN EQU *-SVDEFPOL                                             08700000
.L0005   ANOP                                                           08750000
         AIF   ('&SVDEFWKL' EQ 'NO').L0008                              08800000
         AIF   ('&DSECT' EQ 'YES').L0009                                08850000
         AIF   ('&SVDEFWKL' NE 'YES').L0008                             08900000
SVDEFWKL DS    0D        Workload section                               08950000
         AGO   .L000A                                                   09000000
.L0009   ANOP                                                           09050000
SVDEFWKL DSECT           Workload section                               09100000
.L000A   ANOP                                                           09150000
SVDEFWNM DS    1CL0008   Workload name                                  09200000
SVDEFWDE DS    1CL0032   Workload description                           09250000
SVDEFWIU DS    1CL0008   Userid of workload creator                     09300000
SVDEFWIT DS    1CL0008   Timestamp of initial creation                  09350000
SVDEFWRU DS    1CL0008   Userid of workload last update                 09400000
SVDEFWRT DS    1CL0008   Timestamp of workload last update              09450000
SVDEFWKL_LEN EQU *-SVDEFWKL                                             09500000
.L0008   ANOP                                                           09550000
         AIF   ('&SVDEFSCL' EQ 'NO').L000B                              09600000
         AIF   ('&DSECT' EQ 'YES').L000C                                09650000
         AIF   ('&SVDEFSCL' NE 'YES').L000B                             09700000
SVDEFSCL DS    0D        Service class section                          09750000
         AGO   .L000D                                                   09800000
.L000C   ANOP                                                           09850000
SVDEFSCL DSECT           Service class section                          09900000
.L000D   ANOP                                                           09950000
SVDEFCNM DS    1CL0008   Service class name                             10000000
SVDEFCDE DS    1CL0032   Service class description                      10050000
SVDEFCWN DS    1CL0008   Name of associated workload                    10100000
SVDEFCIU DS    1CL0008   Userid of service class creator                10150000
SVDEFCIT DS    1CL0008   Timestamp of initial creation                  10200000
SVDEFCRU DS    1CL0008   Userid of service class last update            10250000
SVDEFCRT DS    1CL0008   Timestamp of service class last update         10300000
SVDEFSCL_LEN EQU *-SVDEFSCL                                             10350000
.L000B   ANOP                                                           10400000
         AIF   ('&SVDEFGRP' EQ 'NO').L000E                              10450000
         AIF   ('&DSECT' EQ 'YES').L000F                                10500000
         AIF   ('&SVDEFGRP' NE 'YES').L000E                             10550000
SVDEFGRP DS    0D        Resource group section                         10600000
         AGO   .L0010                                                   10650000
.L000F   ANOP                                                           10700000
SVDEFGRP DSECT           Resource group section                         10750000
.L0010   ANOP                                                           10800000
SVDEFGNM DS    1CL0008   Resource group name                            10850000
SVDEFGDE DS    1CL0032   Resource group description                     10900000
SVDEFGIU DS    1CL0008   Userid of resource group creator               10950000
SVDEFGIT DS    1CL0008   Timestamp of initial creation                  11000000
SVDEFGRU DS    1CL0008   Userid of resource group last update           11050000
SVDEFGRT DS    1CL0008   Timestamp of resource group last update        11100000
SVDEFGRP_LEN EQU *-SVDEFGRP                                             11150000
.L000E   ANOP                                                           11200000
         AIF   ('&SVDEFRCL' EQ 'NO').L0011                              11250000
         AIF   ('&DSECT' EQ 'YES').L0012                                11300000
         AIF   ('&SVDEFRCL' NE 'YES').L0011                             11350000
SVDEFRCL DS    0D        Report class section                           11400000
         AGO   .L0013                                                   11450000
.L0012   ANOP                                                           11500000
SVDEFRCL DSECT           Report class section                           11550000
.L0013   ANOP                                                           11600000
SVDEFRNM DS    1CL0008   Report class name                              11650000
SVDEFRDE DS    1CL0032   Report class description                       11700000
SVDEFRIU DS    1CL0008   Userid of report class creator                 11750000
SVDEFRIT DS    1CL0008   Timestamp of initial creation                  11800000
SVDEFRRU DS    1CL0008   Userid of report class last update             11850000
SVDEFRRT DS    1CL0008   Timestamp of report class recent update        11900000
SVDEFRCL_LEN EQU *-SVDEFRCL                                             11950000
.L0011   ANOP                                                           12000000
*                                                                       12001700
*      ***************************************************************  12003400
*      *                                                             *  12005100
*      * Each service class (SVDEFSCL) requires there be one service *  12006800
*      * class attribute entry (SVDEFCLA) which describes the base   *  12008500
*      * performance characteristics of that service class. In this  *  12010200
*      * "base" service class attribute entry, the SVDEFSPN field is *  12011900
*      * blanks. There may exist additional service class attribute  *  12013600
*      * entries for "overrides". That is, the performance           *  12015300
*      * characteristics of a service class (the "attributes") may be*  12017000
*      * overridden from policy to policy. To override the attributes*  12018700
*      * for a given service class for a specific service policy, an *  12020400
*      * additional SVDEFCLA entry must be provided in which the     *  12022100
*      * SVDEFSPN field contains the name of the policy to which the *  12023800
*      * service class attribute "override" pertains. If no override *  12025500
*      * service class attribute for a specific policy is found when *  12027200
*      * a policy is being activated from this service definition -  *  12028900
*      * in other words, if no SVDEFCLA entry is found for a         *  12030600
*      * particular service class (SVDEFSCL) in which the policy name*  12032300
*      * (SVDEFSPN) matches the name of the policy being activated - *  12034000
*      * then the base attribute entry will be used to express the   *  12035700
*      * performance characteristics of that service class in the    *  12037400
*      * policy being activated                                      *  12039100
*      *                                                             *  12040800
*      ***************************************************************  12042500
*                                                                       12044200
*                                                                       12045900
         AIF   ('&SVDEFCLA' EQ 'NO').L0014                              12050000
         AIF   ('&DSECT' EQ 'YES').L0015                                12100000
         AIF   ('&SVDEFCLA' NE 'YES').L0014                             12150000
SVDEFCLA DS    0D        Service class attributes section               12200000
         AGO   .L0016                                                   12250000
.L0015   ANOP                                                           12300000
SVDEFCLA DSECT           Service class attributes section               12350000
.L0016   ANOP                                                           12400000
SVDEFSCN DS    1CL0008   Service class name with which this attribute  *12433300
                         is associated                                  12466600
SVDEFSPN DS    1CL0008   Name of policy that service class attribute   *12500000
                         is associated with (this field will be blanks *12550000
                         if it is a base attribute)                     12600000
SVDEFCGN DS    1CL0008   Name of the resource group this service class *12650000
                         is associated with - blanks if no resource    *12700000
                         group association                              12750000
SVDEFCPN DS    1FL2      Number of service class periods for this      *12787500
                         service class attribute                        12825000
SVDEFFLG DS    0CL0001   Service Class Attribute                        12869490
SVDEFCPC EQU   X'80'     Service Class CPU protection attribute         12876480
         ORG   SVDEFFLG+X'00000001'                                     12883470
SVDEFCAT DS    1CL0005   Reserved (keep structure on dword boundary     12890460
SVDEFCLA_LEN EQU *-SVDEFCLA                                             12900000
.L0014   ANOP                                                           12950000
         AIF   ('&SVDEFPDA' EQ 'NO').L0017                              13000000
         AIF   ('&DSECT' EQ 'YES').L0018                                13050000
         AIF   ('&SVDEFPDA' NE 'YES').L0017                             13100000
SVDEFPDA DS    0D        Service class period data mapping              13150000
         AGO   .L0019                                                   13200000
.L0018   ANOP                                                           13250000
SVDEFPDA DSECT           Service class period data mapping              13300000
.L0019   ANOP                                                           13350000
SVDEFTYP DS    0BL1      Goal type indicators - mutually exclusive      13400000
SVDEFPRC EQU   X'80'     Percentile response time goal                  13450000
SVDEFAVG EQU   X'40'     Average response time goal                     13500000
SVDEFVEL EQU   X'20'     Velocity goal                                  13550000
SVDEFDSC EQU   X'10'     Discretionary goal                             13600000
         ORG   SVDEFTYP+X'00000001'                                     13650000
SVDEFRTU DS    1FL1      Response time unit indicator - indicates the  *13670000
                         units in which the SVDEFVAL field is          *13690000
                         expressed 1 => milliseconds, 2 => seconds 3   *13710000
                         => minutes, 4 => hours                         13730000
SVDEFPER DS    1FL2      Goal percentile value                          13750000
SVDEFIMP DS    1FL2      Importance level 1 (most important) to 5      *13775000
                         (least important). Must be specified for all  *13800000
                         goal types except discretionary (for          *13825000
                         discretionary, importance is ignored)          13850000
         DS    1FL2      Reserved                                       13875000
SVDEFVAL DS    1FL4      Response time goal or speed goal Zero if      *13900000
                         discretionary or if no goal defined            13950000
SVDEFDUR DS    1FL4      Service class period duration, in service     *14000000
                         units, or zero for last period                 14050000
SVDEFPDA_LEN EQU *-SVDEFPDA                                             14100000
.L0017   ANOP                                                           14150000
*                                                                       14151800
*      ***************************************************************  14153600
*      *                                                             *  14155400
*      * Each resource group (SVDEFGRP) requires there be one        *  14157200
*      * resource group attribute entry (SVDEFRGA) which describes   *  14159000
*      * the base service rates of that resource group. In this      *  14160800
*      * "base" resource group attribute entry, the SVDEFRPN field is*  14162600
*      * blanks. There may exist additional resource group attribute *  14164400
*      * entries for "overrides". That is, the service rates of a    *  14166200
*      * resource group (the "attributes") may be overridden from    *  14168000
*      * policy to policy. To override the attributes for a given    *  14169800
*      * resource group for a specific service policy, an additional *  14171600
*      * SVDEFRGA entry must be provided in which the SVDEFRPN field *  14173400
*      * contains the name of the policy to which the resource group *  14175200
*      * attribute "override" pertains. If no override resource group*  14177000
*      * attribute for a specific policy is found when a policy is   *  14178800
*      * being activated from this service definition - in other     *  14180600
*      * words, if no SVDEFRGA entry is found for a particular       *  14182400
*      * resource group (SVDEFGRP) in which the policy name          *  14183900
*      * (SVDEFRPN) matches the name of the policy being activated - *  14185400
*      * then the base attribute entry will be used to express the   *  14186900
*      * service rates of that resource group in the policy being    *  14188400
*      * activated.                                                  *  14189900
*      *                                                             *  14191400
*      ***************************************************************  14193200
*                                                                       14195000
*                                                                       14196800
         AIF   ('&SVDEFRGA' EQ 'NO').L001A                              14200000
         AIF   ('&DSECT' EQ 'YES').L001B                                14250000
         AIF   ('&SVDEFRGA' NE 'YES').L001A                             14300000
SVDEFRGA DS    0D        Resource group attributes section              14350000
         AGO   .L001C                                                   14400000
.L001B   ANOP                                                           14450000
SVDEFRGA DSECT           Resource group attributes section              14500000
.L001C   ANOP                                                           14550000
SVDEFRGN DS    1CL0008   Resource group name                            14600000
SVDEFRPN DS    1CL0008   Resource group attribute policy name           14650000
SVDEFGMN DS    1FL4      Minimum service rate, in raw CPU service      *14700000
                         units                                          14750000
SVDEFGMX DS    1FL4      Maximum service rate, in raw CPU service      *14800000
                         units                                          14850000
SVDEFGLT DS    0BL4      Indicators                                     14900000
SVDEFMXS EQU   X'80'     Maximum service rate was specified             14950000
SVDEFMNS EQU   X'40'     Minimum service rate was specified             15000000
         ORG   SVDEFGLT+X'00000004'                                     15033300
         DS    1CL0004   Reserved (keep structure on Dword boundary)    15066600
SVDEFRGA_LEN EQU *-SVDEFRGA                                             15100000
.L001A   ANOP                                                           15150000
         AIF   ('&SVDEFCON' EQ 'NO').L001D                              15200000
         AIF   ('&DSECT' EQ 'YES').L001E                                15250000
         AIF   ('&SVDEFCON' NE 'YES').L001D                             15300000
SVDEFCON DS    0D        Constants                                      15350000
         AGO   .L001F                                                   15400000
.L001E   ANOP                                                           15450000
SVDEFCON DSECT           Constants                                      15500000
.L001F   ANOP                                                           15550000
SVDEFFL1 DS    0BL1      Flag 1                                         15600000
SVDEFSCO EQU   X'80'     Service coefficients were specified            15650000
         ORG   SVDEFFL1+X'00000001'                                     15662500
SVDEFFL2 DS    0BL1      Flag 2                                         15675000
SVDEFIOM EQU   X'80'     When set indicates that we should include the *15687500
                         I/O delays in the execution velocity           15700000
SVDEFDAM EQU   X'40'     When set indicates dynamic alias tuning is    *15704100
                         available                                      15708300
         ORG   SVDEFFL2+X'00000001'                                     15712500
SVDEFFL3 DS    1BL1      Flag 3 - reserved                              15725000
SVDEFFL4 DS    1BL1      Flag 4 - reserved                              15737500
SVDEFCPU DS    1FL4      CPU service coefficient * 10000 - the number  *15750000
                         by which accumulated CPU service units will   *15800000
                         be multiplied (weighted)                       15850000
SVDEFIOC DS    1FL4      I/O service coefficient * 10000 - the number  *15900000
                         by which accumulated I/O service units will   *15950000
                         be multiplied (weighted)                       16000000
SVDEFMSO DS    1FL4      Storage service coefficient * 10000 - the     *16050000
                         number by which accumulated storage service   *16100000
                         units will be multiplied (weighted)            16150000
SVDEFSRB DS    1FL4      SRB service coefficient * 10000 - the number  *16200000
                         by which accumulated SRB service units will   *16250000
                         be multiplied (weighted)                       16300000
         DS    1CL0028   Reserved (keep structure on dword boundary)    16303800
SVDEFCON_LEN EQU *-SVDEFCON                                             16307600
.L001D   ANOP                                                           16311400
         AIF   ('&SVDEFEXT' EQ 'NO').L0020                              16315200
         AIF   ('&DSECT' EQ 'YES').L0021                                16319000
         AIF   ('&SVDEFEXT' NE 'YES').L0020                             16322800
SVDEFEXT DS    0F        Extension section entry                        16326600
         AGO   .L0022                                                   16330400
.L0021   ANOP                                                           16334200
SVDEFEXT DSECT           Extension section entry                        16338000
.L0022   ANOP                                                           16341800
SVDEFVID DS    1CL0008   Vendor/product id that owns the entry          16345600
SVDEFROB DS    1CL0008   Related object name - name of object (for     *16349400
                         example, service class name SVDEFCNM) which   *16353200
                         this extension entry extends                   16357000
SVDEFEPN DS    1CL0008   Related policy name - valid only if this      *16360800
                         entry extends a service class attribute or    *16364600
                         resource group attribute entry (otherwise     *16368400
                         this field is ignored). Note that a value of  *16372200
                         blanks indicates that the attribute which     *16376000
                         this entry extends is a base attribute         16379800
SVDEFEDL DS    1FL2      Extended data length                           16383600
         DS    1CL0002   Reserved                                       16387400
SVDEFEDO DS    1FL4      Offset to extended data - offset is from the  *16391200
                         beginning of the extended data whose offset   *16394100
                         is in SVDEF_EXT_DATA_OFF                       16397000
*                                                                       16400000
*    *****************************************************************  16450000
*    *                                                               *  16500000
*    * Constants                                                     *  16550000
*    *                                                               *  16600000
*    *****************************************************************  16650000
*                                                                       16700000
*                                                                       16750000
SVDEF_RTU_MS EQU 1       SVDEFRTU value indicating that SVDEFVAL value *16800000
                         is expressed in milliseconds                   16850000
SVDEF_RTU_SECOND EQU 2   SVDEFRTU value indicating that SVDEFVAL value *16900000
                         is expressed in seconds                        16950000
SVDEF_RTU_MINUTE EQU 3   SVDEFRTU value indicating that SVDEFVAL value *17000000
                         is expressed in minutes                        17050000
SVDEF_RTU_HOUR EQU 4     SVDEFRTU value indicating that SVDEFVAL value *17100000
                         is expressed in hours                          17150000
SVDEF_NAME EQU C'SVDE'   'SVDE' acronym                                 17200000
SVDEF_LEVEL001 EQU 1     Functionality level introduced by WLM in      *17211300
                         SP510.                                         17222600
SVDEF_SP510 EQU 1        WLM SP510 version                              17233900
SVDEF_LEVEL002 EQU 2     Functionality level introduced by WLM in      *17245200
                         SP520.                                         17256500
SVDEF_SP520 EQU 2        WLM SP520 version                              17267800
SVDEF_LEVEL003 EQU 3     Functionality level introduced by WLM in      *17279100
                         OS/390 V1R3                                    17290400
SVDEF_SP530 EQU 3        WLM version number for OS/390 V1R3             17301700
SVDEF_LEVEL004 EQU 4     Functionality level introduced by WLM in      *17313000
                         OS/390 V2R4                                    17317500
SVDEF_SP604 EQU 4        WLM version number for OS/390 V2R4             17322000
SVDEF_LEVEL005 EQU 5     Functionality level introduced by WLM in      *17326500
                         OS/390 V2R5                                    17331000
SVDEF_SP605 EQU 5        WLM version number for OS/390 V2R5             17335500
SVDEF_LEVEL006 EQU 6     Functionality level introduced by WLM in      *17340000
                         OS/390 V2R6                                    17344500
SVDEF_SP606 EQU 6        WLM version number for OS/390 V2R6             17349000
SVDEF_LEVEL007 EQU 7     Functionality level introduced by WLM in      *17350800
                         OS/390 V2R7                                    17352600
SVDEF_SP607 EQU 7        WLM version number for OS/390 V2R7             17354400
SVDEF_LEVEL008 EQU 8     Functionality level introduced by WLM in      *17355100
                         OS/390 V2R7                                    17355800
SVDEF_SP608 EQU 8        WLM version number for OS/390 V2R7             17356500
SVDEF_LEVEL009 EQU 9     Functionality level reserved for WLM OS/390   *17356600
                         V2R8                                           17356700
SVDEF_RESERVED_R08 EQU 9 WLM version number reserved for OS/390 V2R8    17356800
SVDEF_LEVEL010 EQU 10    Functionality level reserved for WLM OS/390   *17356900
                         V2R9                                           17357000
SVDEF_RESERVED_R09 EQU 10 WLM version number reserved for OS/390 V2R9   17357100
SVDEF_LEVEL011 EQU 11    Functionality level introduced by WLM in      *17357200
                         OS/390 V2R10                                   17357300
SVDEF_SP703 EQU 11       WLM version number for OS/390 V2R10            17357400
SVDEF_CURRENT_VER EQU 11 Current version level used when checking      *17357500
                         functionality within WLM product.              17358200
SVDEFEXT_LEN EQU *-SVDEFEXT                                             17370000
.L0020   ANOP                                                           17410000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 17450000
         AIF   ('&LIST' EQ 'YES').P4                                    17500000
.P3      ANOP                                                           17550000
         POP   PRINT                                                    17600000
.P4      ANOP                                                           17650000
.P_EXIT  ANOP                                                           17700000
         MEND                                                           17750000
**/ IWMSVDEF_2:;                                                        17800000
* %IWMSVDEF_INCLUDED = 'YES';                                           17850000
* %DCL ZCBPRINT CHAR EXT;                                               17900000
* %DEACTIVATE ZCBPRINT;                                                 17950000
* %DCL IWMSVDEF_LIST CHAR EXT;                                          18000000
* %DEACTIVATE IWMSVDEF_LIST;                                            18050000
* %IF IWMSVDEF_LIST ^= 'NO' &                                           18100000
*    ZCBPRINT ^= 'NO' %THEN                                             18150000
*   %GOTO IWMSVDEF_3;                                                   18200000
*   @LIST PUSH NOECHO;                                                  18250000
*   @LIST NOASSEMBLE NOECHO;                                            18300000
*   @LIST OFF C NOECHO;                                                 18350000
* %IWMSVDEF_3:;                                                         18400000
*/* Start of PL/X Source                                             */ 18450000
*                                                                       18475000
* DCL 1 SVDEFHDR BASED,                                                 18500000
*     3 SVDEFNAM CHAR(4),      /* Eyecatcher (SVDE)                  */ 18514100
*     3 SVDEFLVL FIXED(8),    /*Functionality level of the SVDEF.@P2C*/ 18519700
*                             /*The functionality level defines  @P2A*/ 18525300
*                             /*the highest level of WLM function@P2A*/ 18530900
*                             /*that exists in the SVDEF.        @P2A*/ 18536500
*     3 SVDEFWVN FIXED(8),     /* WLM version number                 */ 18546400
*     3 SVDEFDIL FIXED(16),    /* Size of header section             */ 18556400
*     3 SVDEFDES CHAR(32),     /* Service definition description     */ 18570500
*     3 SVDEFSIZ FIXED(32),    /* Size of SVDEF                      */ 18584600
*     3 SVDEFPO FIXED(32),     /* Offset of policy section if the       18598700
*                                 number of policies is nonzero         18612800
*                                 (otherwise this field is ignored)  */ 18626900
*     3 SVDEFPN FIXED(16),     /* Number of policy entries           */ 18641000
*     3 SVDEFPS FIXED(16),     /* Size of policy entry               */ 18655100
*     3 SVDEFWO FIXED(32),     /* Offset of workload section if the     18669200
*                                 number of workloads is nonzero        18683300
*                                 (otherwise this field is ignored)  */ 18697400
*     3 SVDEFWN FIXED(16),     /* Number of workload entries         */ 18711500
*     3 SVDEFWS FIXED(16),     /* Size of workload entry             */ 18725600
*     3 SVDEFCO FIXED(32),     /* Offset of service class section if    18739700
*                                 number of service classes is nonzero  18753800
*                                 (otherwise this field is ignored)  */ 18767900
*     3 SVDEFCN FIXED(16),     /* Number of service class entries    */ 18782000
*     3 SVDEFCS FIXED(16),     /* Size of service class entry        */ 18796100
*     3 SVDEFGO FIXED(32),     /* Offset of resource group section if   18810200
*                                 number of resource groups is nonzero  18824300
*                                 (otherwise this field is ignored)  */ 18838400
*     3 SVDEFGN FIXED(16),     /* Number of resource group entries   */ 18852500
*     3 SVDEFGS FIXED(16),     /* Size of resource group entry       */ 18866600
*     3 SVDEFRO FIXED(32),     /* Offset of report class section if     18880700
*                                 number of report classes is nonzero   18894800
*                                 (otherwise this field is ignored)  */ 18908900
*     3 SVDEFRN FIXED(16),     /* Number of report class entries     */ 18923000
*     3 SVDEFRS FIXED(16),     /* Size of report class entry         */ 18937100
*     3 SVDEFCAO FIXED(32),    /* Offset of service class attribute     18951200
*                                 section if number of service class    18965300
*                                 attributes is nonzero                 18979400
*                                 (otherwise this field is ignored)  */ 18993500
*     3 SVDEFCAN FIXED(16),    /* Number of service class attribute     19007600
*                                 entries                            */ 19021700
*     3 SVDEFCAS FIXED(16),    /* Size of service class attribute       19035800
*                                 entry                              */ 19049900
*     3 SVDEFGAO FIXED(32),    /* Offset of resource group attribute    19064000
*                                 section if number of service class    19078100
*                                 attributes is nonzero                 19092200
*                                 (otherwise this field is ignored)  */ 19106300
*     3 SVDEFGAN FIXED(16),    /* Number of resource group attribute    19120400
*                                 entries                            */ 19134500
*     3 SVDEFGAS FIXED(16),    /* Size of resource group attribute      19148600
*                                 entry                              */ 19162700
*     3 SVDEFCNO FIXED(32),    /* Offset of constant information        19176800
*                                 section                            */ 19190900
*     3 SVDEFCNS FIXED(16),    /* Size of constant information entry */ 19205000
*     3 SVDEFCPS FIXED(16),    /* Size of each service class period     19219100
*                                 entry                              */ 19233200
*     3 SVDEFID,               /* Service definition id starts here     19247300
*                                 (can be mapped by SVIDSSVD in         19261400
*                                 IWMSVIDS)                          */ 19275500
*       5 SVDEFIDN CHAR(8),    /* Service definition name            */ 19289600
*       5 SVDEFTDI CHAR(8),    /* Timestamp (STCK format) in local time 19303700
*                                 the service definition was installed  19317800
*                                 (on install processing (IWMDINST)     19331900
*                                 this field is set by WLM)          */ 19346000
*       5 SVDEFIDU CHAR(8),    /* Userid of the service administrator   19360100
*                                 that installed the service definition 19374200
*                                 (on install processing (IWMDINST)     19388300
*                                 this field is set by WLM)          */ 19402400
*       5 SVDEFIDS CHAR(8),    /* Name of the system on which the       19416500
*                                 service definition was installed      19430600
*                                 (on install processing (IWMDINST)     19444700
*                                 this field is set by WLM)          */ 19458800
*     3 *        CHAR(32),     /* Reserved for additional triplets      19472900
*                                                                @L1A*/ 19487000
*     3 SVDEFPRO CHAR(32),     /* ID of product which performed the     19501100
*                                 installation (mapped by SVIDSPRD)     19515200
*                                                                @L1A*/ 19529300
*     3 SVDEF_EXT_OFF FIXED(32), /* Offset of service definition        19543400
*                                 extension section if number of        19557500
*                                 service definition extensions         19571600
*                                 is nonzero (otherwise this field      19585700
*                                 is ignored)                    @L1A*/ 19599800
*     3 SVDEF_EXT_NUM FIXED(16), /* Number of service definition        19613900
*                                   extension entries            @L1A*/ 19628000
*     3 SVDEF_EXT_SIZ FIXED(16), /* Size of service definition          19642100
*                                   extension entry              @L1A*/ 19656200
*     3 SVDEF_SP_EXT_OFF FIXED(32), /* Offset of policy extension       19670300
*                                 section if number of policy           19684400
*                                 extensions is nonzero (otherwise      19698500
*                                 this field is ignored)         @L1A*/ 19712600
*     3 SVDEF_SP_EXT_NUM FIXED(16), /* Number of policy extension       19726700
*                                      entries                   @L1A*/ 19740800
*     3 SVDEF_SP_EXT_SIZ FIXED(16), /* Size of policy extension         19754900
*                                      entry                     @L1A*/ 19769000
*     3 SVDEF_WD_EXT_OFF FIXED(32), /* Offset of workload extension     19783100
*                                 section if number of workload         19797200
*                                 extensions is nonzero (otherwise      19811300
*                                 this field is ignored)         @L1A*/ 19825400
*     3 SVDEF_WD_EXT_NUM FIXED(16), /* Number of workload extension     19839500
*                                      entries                   @L1A*/ 19853600
*     3 SVDEF_WD_EXT_SIZ FIXED(16), /* Size of workload extension       19867700
*                                      entry                     @L1A*/ 19881800
*     3 SVDEF_CD_EXT_OFF FIXED(32), /* Offset of service class          19895900
*                                 extension section if number of        19910000
*                                 service class extensions is nonzero   19924100
*                                 (otherwise this field is ignored)     19938200
*                                                                @L1A*/ 19952300
*     3 SVDEF_CD_EXT_NUM FIXED(16), /* Number of service class          19966400
*                                      extension entries         @L1A*/ 19980500
*     3 SVDEF_CD_EXT_SIZ FIXED(16), /* Size of service class            19994600
*                                      extension entry           @L1A*/ 20008700
*     3 SVDEF_RG_EXT_OFF FIXED(32), /* Offset of resource group         20022800
*                                 extension section if number of        20036900
*                                 resource group extensions is nonzero  20051000
*                                 (otherwise this field is ignored)     20065100
*                                                                @L1A*/ 20079200
*     3 SVDEF_RG_EXT_NUM FIXED(16), /* Number of resource group         20093300
*                                      extension entries         @L1A*/ 20107400
*     3 SVDEF_RG_EXT_SIZ FIXED(16), /* Size of resource group           20121500
*                                      extension entry           @L1A*/ 20135600
*     3 SVDEF_RD_EXT_OFF FIXED(32), /* Offset of report class           20149700
*                                 extension section if number of        20163800
*                                 report class extensions is nonzero    20177900
*                                 (otherwise this field is ignored)     20192000
*                                                                @L1A*/ 20206100
*     3 SVDEF_RD_EXT_NUM FIXED(16), /* Number of report class           20220200
*                                      extension entries         @L1A*/ 20234300
*     3 SVDEF_RD_EXT_SIZ FIXED(16), /* Size of report class             20248400
*                                      extension entry           @L1A*/ 20262500
*     3 SVDEF_CLA_EXT_OFF FIXED(32), /* Offset of service class         20276600
*                                 attribute extension section if        20290700
*                                 number of service class attribute     20304800
*                                 extensions is nonzero (otherwise      20318900
*                                 this field is ignored)         @L1A*/ 20333000
*     3 SVDEF_CLA_EXT_NUM FIXED(16), /* Number of service class         20347100
*                                      attribute extension entries      20361200
*                                                                @L1A*/ 20375300
*     3 SVDEF_CLA_EXT_SIZ FIXED(16), /* Size of service class           20389400
*                                      attribute extension entry        20403500
*                                                                @L1A*/ 20417600
*     3 SVDEF_RGA_EXT_OFF FIXED(32), /* Offset of resource group        20431700
*                                 attribute extension section if        20445800
*                                 number of resource class attribute    20459900
*                                 extensions is nonzero (otherwise      20474000
*                                 this field is ignored)         @L1A*/ 20488100
*     3 SVDEF_RGA_EXT_NUM FIXED(16), /* Number of resource group        20502200
*                                      attribute extension entries      20516300
*                                                                @L1A*/ 20530400
*     3 SVDEF_RGA_EXT_SIZ FIXED(16), /* Size of resource group          20544500
*                                      attribute extension entry        20558600
*                                                                @L1A*/ 20572700
*     3 *        CHAR(32),  /* Reserved for additional extension        20586800
*                              triplets                          @L1A*/ 20600900
*     3 SVDEF_EXT_DATA_OFF FIXED(32), /* Offset of extended data        20615000
*                              (0 if no extended data exists)    @L1A*/ 20629100
*     3 SVDEF_EXT_DATA_LEN FIXED(32), /* Length of extended data @L1A*/ 20643200
*     3 *        CHAR(4),   /* Reserved                          @L1A*/ 20657300
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 20671400
*                                                                       20685500
*                                                                       20699600
*   1 SVDEFPOL BASED(ADDR(SVDEFHDR) + SVDEFPO), /* Service              20713700
*                              policy section                        */ 20727800
*     3 SVDEFPNM CHAR(8),   /* Policy name                           */ 20750000
*     3 SVDEFPDE CHAR(32),  /* Policy description                    */ 20800000
*     3 SVDEFPIU CHAR(8),   /* Userid of policy creator              */ 20850000
*     3 SVDEFPIT CHAR(8),   /* Timestamp of initial creation         */ 20900000
*     3 SVDEFPRU CHAR(8),   /* Userid of policy last update          */ 20950000
*     3 SVDEFPRT CHAR(8),   /* Timestamp of policy last update       */ 21000000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 21025000
*                                                                       21050000
*   1 SVDEFWKL BASED(ADDR(SVDEFHDR) + SVDEFWO), /* Workload             21100000
*                              section                               */ 21150000
*     3 SVDEFWNM CHAR(8),   /* Workload name                         */ 21200000
*     3 SVDEFWDE CHAR(32),  /* Workload description                  */ 21250000
*     3 SVDEFWIU CHAR(8),   /* Userid of workload creator            */ 21300000
*     3 SVDEFWIT CHAR(8),   /* Timestamp of initial creation         */ 21350000
*     3 SVDEFWRU CHAR(8),   /* Userid of workload last update        */ 21400000
*     3 SVDEFWRT CHAR(8),   /* Timestamp of workload last update     */ 21450000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 21475000
*                                                                       21500000
*   1 SVDEFSCL BASED(ADDR(SVDEFHDR) + SVDEFCO), /* Service              21550000
*                              class section                         */ 21600000
*     3 SVDEFCNM CHAR(8),   /* Service class name                    */ 21650000
*     3 SVDEFCDE CHAR(32),  /* Service class description             */ 21700000
*     3 SVDEFCWN CHAR(8),   /* Name of associated workload           */ 21750000
*     3 SVDEFCIU CHAR(8),   /* Userid of service class creator       */ 21800000
*     3 SVDEFCIT CHAR(8),   /* Timestamp of initial creation         */ 21850000
*     3 SVDEFCRU CHAR(8),   /* Userid of service class last update   */ 21900000
*     3 SVDEFCRT CHAR(8),   /* Timestamp of service class last          21950000
*                              update                                */ 22000000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 22025000
*                                                                       22050000
*   1 SVDEFGRP BASED(ADDR(SVDEFHDR) + SVDEFGO), /* Resource             22100000
*                              group section                         */ 22150000
*     3 SVDEFGNM CHAR(8),   /* Resource group name                   */ 22200000
*     3 SVDEFGDE CHAR(32),  /* Resource group description            */ 22250000
*     3 SVDEFGIU CHAR(8),   /* Userid of resource group creator      */ 22300000
*     3 SVDEFGIT CHAR(8),   /* Timestamp of initial creation         */ 22350000
*     3 SVDEFGRU CHAR(8),   /* Userid of resource group last update  */ 22400000
*     3 SVDEFGRT CHAR(8),   /* Timestamp of resource group last         22450000
*                              update                                */ 22500000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 22525000
*                                                                       22550000
*   1 SVDEFRCL BASED(ADDR(SVDEFHDR) + SVDEFRO), /* Report               22600000
*                              class section                         */ 22650000
*     3 SVDEFRNM CHAR(8),   /* Report class name                     */ 22700000
*     3 SVDEFRDE CHAR(32),  /* Report class description              */ 22750000
*     3 SVDEFRIU CHAR(8),   /* Userid of report class creator        */ 22800000
*     3 SVDEFRIT CHAR(8),   /* Timestamp of initial creation         */ 22850000
*     3 SVDEFRRU CHAR(8),   /* Userid of report class last              22900000
*                              update                                */ 22950000
*     3 SVDEFRRT CHAR(8),   /* Timestamp of report class                23000000
*                              recent update                         */ 23050000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 23075000
*                                                                       23100000
*   /* Each service class (SVDEFSCL) requires there be one service      23105500
*      class attribute entry (SVDEFCLA) which describes the base        23111000
*      performance characteristics of that service class. In this       23116500
*      "base" service class attribute entry, the SVDEFSPN field is      23122000
*      blanks.                                                          23127500
*                                                                       23133000
*      There may exist additional service class attribute entries for   23139600
*      "overrides". That is, the performance characteristics of a       23146200
*      service class (the "attributes") may be overridden from policy   23152800
*      to policy.                                                       23159400
*                                                                       23166000
*      To override the attributes for a given service class for a       23172600
*      specific service policy, an additional SVDEFCLA entry must       23179200
*      be provided in which the SVDEFSPN field contains the name of     23185800
*      the policy to which the service class attribute "override"       23192400
*      pertains.                                                        23199000
*                                                                       23205600
*      If no override service class attribute for a specific policy is  23212200
*      found when a policy is being activated from this service         23218800
*      definition - in other words, if no SVDEFCLA entry is found for   23225400
*      a particular service class (SVDEFSCL) in which the policy name   23232000
*      (SVDEFSPN) matches the name of the policy being activated -      23238600
*      then the base attribute entry will be used to express the        23245200
*      performance characteristics of that service class in the         23251800
*      policy being activated                                        */ 23258400
*                                                                       23265000
*   1 SVDEFCLA BASED(ADDR(SVDEFHDR) + SVDEFCAO), /* Service             23271600
*                              class attributes section              */ 23278200
*     3 SVDEFSCN CHAR(8),   /* Service class name with which this       23284800
*                              attribute is associated               */ 23291400
*     3 SVDEFSPN CHAR(8),   /* Name of policy that service class        23300000
*                              attribute is associated with (this       23350000
*                              field will be blanks if it is a base     23400000
*                              attribute)                            */ 23450000
*     3 SVDEFCGN CHAR(8),   /* Name of the resource group this service  23500000
*                              class is associated with - blanks if no  23550000
*                              resource group association            */ 23600000
*     3 SVDEFCPN FIXED(16), /* Number of service class periods for      23625000
*                              this service class attribute          */ 23650000
*     3 SVDEFFLG CHAR(1),   /* Service Class Attribute                  23677990
*                                                            @WLMPGMC*/ 23680980
*       5 SVDEFCPC BIT(1),  /* Service Class CPU protection attribute   23683970
*                                                            @WLMPGMC*/ 23686960
*       5 *        BIT(7),  /* Reserved bit for future releases         23689950
*                                                            @WLMPGMC*/ 23692940
*     3 SVDEFCAT CHAR(5),   /* Reserved (keep structure on dword        23695930
*                              boundary                          @L1C*/ 23700000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 23725000
*                                                                       23750000
*   1 SVDEFPDA BASED, /* Service class period                           23800000
*                              data mapping                          */ 23850000
*     3 SVDEFTYP BIT(8),    /* Goal type indicators - mutually          23900000
*                              exclusive                             */ 23950000
*       5 SVDEFPRC BIT(1),  /* Percentile response time goal         */ 24000000
*       5 SVDEFAVG BIT(1),  /* Average response time goal            */ 24050000
*       5 SVDEFVEL BIT(1),  /* Velocity goal                         */ 24100000
*       5 SVDEFDSC BIT(1),  /* Discretionary goal                    */ 24121400
*     3 SVDEFRTU FIXED(8),  /* Response time unit indicator - indicates 24142800
*                              the units in which the SVDEFVAL field is 24164200
*                              expressed                                24185600
*                              1 => milliseconds, 2 => seconds          24207000
*                              3 => minutes, 4 => hours              */ 24228400
*     3 SVDEFPER FIXED(16), /* Goal percentile value        */          24249800
*     3 SVDEFIMP FIXED(16), /* Importance level 1 (most important) to   24271200
*                              5 (least important). Must be specified   24292600
*                              for all goal types except discretionary  24314000
*                              (for discretionary, importance is        24335400
*                              ignored)                              */ 24356800
*     3 *        FIXED(16), /* Reserved                              */ 24378200
*     3 SVDEFVAL FIXED(32), /* Response time goal or speed goal         24400000
*                              Zero if discretionary or if no goal      24450000
*                              defined                               */ 24500000
*     3 SVDEFDUR FIXED(32), /* Service class period duration, in        24550000
*                              service units, or zero for last period*/ 24600000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 24625000
*                                                                       24650000
*   /* Each resource group (SVDEFGRP) requires there be one             24655500
*      resource group attribute entry (SVDEFRGA) which describes the    24661000
*      base service rates of that resource group. In this "base"        24666500
*      resource group attribute entry, the SVDEFRPN field is blanks.    24672000
*                                                                       24677500
*      There may exist additional resource group attribute entries for  24683000
*      "overrides". That is, the service rates of a resource group      24688500
*      (the "attributes") may be overridden from policy to policy.      24694000
*                                                                       24699500
*      To override the attributes for a given resource group for a      24705000
*      specific service policy, an additional SVDEFRGA entry must       24710500
*      be provided in which the SVDEFRPN field contains the name of     24716000
*      the policy to which the resource group attribute "override"      24721500
*      pertains.                                                        24727000
*                                                                       24732500
*      If no override resource group attribute for a specific policy is 24738000
*      found when a policy is being activated from this service         24743500
*      definition - in other words, if no SVDEFRGA entry is found for   24749000
*      a particular resource group (SVDEFGRP) in which the policy name  24754500
*      (SVDEFRPN) matches the name of the policy being activated -      24760000
*      then the base attribute entry will be used to express the        24765500
*      service rates of that resource group in the policy being         24771000
*      activated.                                                    */ 24776500
*                                                                       24782000
*   1 SVDEFRGA BASED(ADDR(SVDEFHDR) + SVDEFGAO), /* Resource            24787500
*                              group attributes section              */ 24793000
*     3 SVDEFRGN CHAR(8),   /* Resource group name                   */ 24800000
*     3 SVDEFRPN CHAR(8),   /* Resource group attribute policy name  */ 24850000
*     3 SVDEFGMN FIXED(32), /* Minimum service rate, in raw CPU         24900000
*                              service units                         */ 24950000
*     3 SVDEFGMX FIXED(32), /* Maximum service rate, in raw CPU         25000000
*                              service units                         */ 25050000
*     3 SVDEFGLT BIT(32),   /* Indicators                            */ 25100000
*       5 SVDEFMXS BIT(1),  /* Maximum service rate was specified    */ 25150000
*       5 SVDEFMNS BIT(1),  /* Minimum service rate was specified    */ 25200000
*     3 *        CHAR(4),   /* Reserved (keep structure on Dword        25212500
*                              boundary)                         @L1A*/ 25225000
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 25237500
*                                                                       25250000
*   1 SVDEFCON BASED(ADDR(SVDEFHDR) + SVDEFCNO), /* Constants           25283300
*                                                                    */ 25316600
*     3 SVDEFFL1 BIT(8),    /* Flag 1                        @PQC1647*/ 25358300
*       5 SVDEFSCO BIT(1),  /* Service coefficients were specified   */ 25400000
*     3 SVDEFFL2 BIT(8),    /* Flag 2                        @PQC1647*/ 25407100
*       5 SVDEFIOM BIT(1),  /* When set indicates that we    @PQC2520   25414200
*                              should include the I/O        @PQC2520   25421300
*                              delays in the execution velocity      */ 25428400
*       5 SVDEFDAM BIT(1),  /* When set indicates dynamic alias tuning  25430100
*                              is available                  @OW39854*/ 25432800
*     3 SVDEFFL3 BIT(8),    /* Flag 3 - reserved             @PQC1647*/ 25435500
*     3 SVDEFFL4 BIT(8),    /* Flag 4 - reserved             @PQC1647*/ 25442600
*     3 SVDEFCPU FIXED(32), /* CPU service coefficient * 10000 - the    25450000
*                              number by which accumulated CPU service  25500000
*                              units will be multiplied (weighted)   */ 25550000
*     3 SVDEFIOC FIXED(32), /* I/O service coefficient * 10000 - the    25600000
*                              number by which accumulated I/O service  25650000
*                              units will be multiplied (weighted)   */ 25700000
*     3 SVDEFMSO FIXED(32), /* Storage service coefficient * 10000 -    25750000
*                              the number by which accumulated storage  25800000
*                              service units will be multiplied         25850000
*                              (weighted)                            */ 25900000
*     3 SVDEFSRB FIXED(32), /* SRB service coefficient * 10000 - the    25950000
*                              number by which accumulated SRB service  26000000
*                              units will be multiplied (weighted)   */ 26050000
*     3 *        CHAR(28),  /* Reserved (keep structure on dword        26054300
*                              boundary)                         @L1C*/ 26058600
*     3 *        CHAR(0) BDY(DWORD), /*                          @L1A*/ 26062900
*                                                                       26067200
*   1 SVDEFEXT BASED,       /* Extension section entry           @L1A*/ 26071500
*     3 SVDEFVID CHAR(8),   /* Vendor/product id that owns the          26075800
*                              entry                             @L1A*/ 26080100
*     3 SVDEFROB CHAR(8),   /* Related object name - name of object     26084400
*                              (for example, service class name         26088700
*                              SVDEFCNM) which this extension entry     26093000
*                              extends                           @L1A*/ 26097300
*     3 SVDEFEPN CHAR(8),   /* Related policy name - valid only if      26101600
*                              this entry extends a service class       26105900
*                              attribute or resource group attribute    26110200
*                              entry (otherwise this field is           26114500
*                              ignored). Note that a value of blanks    26118800
*                              indicates that the attribute which this  26123100
*                              entry extends is a base attribute @L1A*/ 26127400
*     3 SVDEFEDL FIXED(16), /* Extended data length              @L1A*/ 26131700
*     3 *        CHAR(2),   /* Reserved                          @L1A*/ 26136000
*     3 SVDEFEDO FIXED(32); /* Offset to extended data - offset is from 26140300
*                              the beginning of the extended data whose 26143500
*                              offset is in SVDEF_EXT_DATA_OFF   @P1C*/ 26146700
*                                                                       26150000
*   /*****************************************************************/ 26200000
*   /*                                                               */ 26250000
*   /* Constants                                                     */ 26300000
*   /*                                                               */ 26350000
*   /*****************************************************************/ 26400000
*                                                                       26450000
*   DECLARE                                                             26500000
*     SVDEF_RTU_MS FIXED(8) CONSTANT(1), /* SVDEFRTU value indicating   26550000
*                                      that SVDEFVAL value is           26600000
*                                      expressed in milliseconds     */ 26650000
*     SVDEF_RTU_SECOND FIXED(8) CONSTANT(2), /* SVDEFRTU value          26700000
*                                      indicating that SVDEFVAL value   26750000
*                                      is expressed in seconds       */ 26800000
*     SVDEF_RTU_MINUTE FIXED(8) CONSTANT(3), /* SVDEFRTU value          26850000
*                                      indicating that SVDEFVAL value   26900000
*                                      is expressed in minutes       */ 26950000
*     SVDEF_RTU_HOUR FIXED(8) CONSTANT(4), /* SVDEFRTU value            27000000
*                                      indicating that SVDEFVAL value   27050000
*                                      is expressed in hours         */ 27100000
*                                                                       27150000
*     SVDEF_NAME CHAR(4) CONSTANT('SVDE'), /* 'SVDE' acronym         */ 27200000
*     SVDEF_LEVEL001_IN_CHAR                                   /*@P5A*/ 27203800
*                    CHAR(8)  CONSTANT('LEVEL001'),            /*@P5A*/ 27207600
*     SVDEF_LEVEL002_IN_CHAR                                   /*@P5A*/ 27211400
*                    CHAR(8)  CONSTANT('LEVEL002'),            /*@P5A*/ 27215200
*     SVDEF_LEVEL003_IN_CHAR                               /*@WLMPSTP*/ 27216500
*                    CHAR(8)  CONSTANT('LEVEL003'),        /*@WLMPSTP*/ 27217800
*     SVDEF_LEVEL004_IN_CHAR                               /*@WLMPBAT*/ 27223400
*                    CHAR(8)  CONSTANT('LEVEL004'),        /*@WLMPBAT*/ 27229000
*     SVDEF_LEVEL005_IN_CHAR                               /*@WLMPSDC*/ 27230100
*                    CHAR(8)  CONSTANT('LEVEL005'),        /*@WLMPSDC*/ 27231200
*     SVDEF_LEVEL006_IN_CHAR                               /*@WLMPSDC*/ 27232300
*                    CHAR(8)  CONSTANT('LEVEL006'),        /*@WLMPSDC*/ 27233400
*     SVDEF_LEVEL007_IN_CHAR                               /*@WLMPSDC*/ 27233800
*                    CHAR(8)  CONSTANT('LEVEL007'),        /*@WLMPMQS*/ 27234200
*     SVDEF_LEVEL008_IN_CHAR                               /*@WLMPTAL*/ 27234300
*                    CHAR(8)  CONSTANT('LEVEL008'),        /*@WLMPTAL*/ 27234400
*     SVDEF_LEVEL009_IN_CHAR                               /*@WLMPGMY*/ 27235100
*                    CHAR(8)  CONSTANT('LEVEL009'),        /*@WLMPGMY*/ 27235800
*     SVDEF_LEVEL010_IN_CHAR                               /*@WLMPGMY*/ 27236500
*                    CHAR(8)  CONSTANT('LEVEL010'),        /*@WLMPGMY*/ 27237200
*     SVDEF_LEVEL011_IN_CHAR                               /*@WLMPGMY*/ 27237900
*                    CHAR(8)  CONSTANT('LEVEL011'),        /*@WLMPGMY*/ 27238600
*     SVDEF_LEVEL001 FIXED(8) CONSTANT(1), /*                           27239300
*                                Functionality level introduced by      27240200
*                                WLM in SP510.                   @P2C*/ 27245800
*     SVDEF_SP510 FIXED(8) CONSTANT(1), /*                              27251400
*                                WLM SP510 version               @P2C*/ 27257000
*     SVDEF_LEVEL002 FIXED(8) CONSTANT(2), /*                           27262600
*                                Functionality level introduced by      27268200
*                                WLM in SP520.                   @P2C*/ 27273800
*     SVDEF_SP520 FIXED(8) CONSTANT(2), /*                              27279400
*                                WLM SP520 version               @P2C*/ 27285000
*     SVDEF_LEVEL003 FIXED(8) CONSTANT(3), /*                           27290600
*                                Functionality level introduced by      27296200
*                                WLM in OS/390 V1R3          @WLMPSTP*/ 27301800
*     SVDEF_SP530 FIXED(8) CONSTANT(3), /*                              27307400
*                                WLM version number for OS/390 V1R3     27313000
*                                                            @WLMPSTP*/ 27318600
*     SVDEF_LEVEL004 FIXED(8) CONSTANT(4), /*                           27324200
*                                Functionality level introduced by      27329800
*                                WLM in OS/390 V2R4          @WLMPBAT*/ 27335400
*     SVDEF_SP604 FIXED(8) CONSTANT(4), /*                              27341000
*                                WLM version number for OS/390 V2R4     27346600
*                                                            @WLMPBAT*/ 27352200
*     SVDEF_LEVEL005 FIXED(8) CONSTANT(5), /*                           27353000
*                                Functionality level introduced by      27353800
*                                WLM in OS/390 V2R5          @WLMPSDC*/ 27354600
*     SVDEF_SP605 FIXED(8) CONSTANT(5), /*                              27355400
*                                WLM version number for OS/390 V2R5     27356200
*                                                            @WLMPSDC*/ 27357000
*     SVDEF_LEVEL006 FIXED(8) CONSTANT(6), /*                           27357800
*                                Functionality level introduced by      27358600
*                                WLM in OS/390 V2R6          @WLMPSDC*/ 27359400
*     SVDEF_SP606 FIXED(8) CONSTANT(6), /*                              27360200
*                                WLM version number for OS/390 V2R6     27361000
*                                                            @WLMPSDC*/ 27361800
*     SVDEF_LEVEL007 FIXED(8) CONSTANT(7), /*                           27362000
*                                Functionality level introduced by      27362200
*                                WLM in OS/390 V2R7          @WLMPMQS*/ 27362400
*     SVDEF_SP607 FIXED(8) CONSTANT(7), /*                              27362600
*                                WLM version number for OS/390 V2R7     27362800
*                                                            @WLMPMQS*/ 27363000
*     SVDEF_LEVEL008 FIXED(8) CONSTANT(8), /*                           27363600
*                                Functionality level introduced by      27364200
*                                WLM in OS/390 V2R7          @WLMPTAL*/ 27364800
*     SVDEF_SP608 FIXED(8) CONSTANT(8), /*                              27365400
*                                WLM version number for OS/390 V2R7     27366000
*                                                            @WLMPTAL*/ 27366600
*     SVDEF_LEVEL009 FIXED(8) CONSTANT(9), /*                           27366700
*                                Functionality level reserved for       27366800
*                                WLM OS/390 V2R8             @WLMPGMY*/ 27366900
*     SVDEF_RESERVED_R08 FIXED(8) CONSTANT(9), /*                       27367000
*                                WLM version number reserved for        27367100
*                                OS/390 V2R8                            27367200
*                                                            @WLMPGMY*/ 27367300
*     SVDEF_LEVEL010 FIXED(8) CONSTANT(10), /*                          27367400
*                                Functionality level reserved for       27367500
*                                WLM OS/390 V2R9             @WLMPGMY*/ 27367600
*     SVDEF_RESERVED_R09 FIXED(8) CONSTANT(10), /*                      27367700
*                                WLM version number reserved for        27367800
*                                OS/390 V2R9                            27367900
*                                                            @WLMPGMY*/ 27368000
*     SVDEF_LEVEL011 FIXED(8) CONSTANT(11), /*                          27368100
*                                Functionality level introduced by      27368200
*                                WLM in OS/390 V2R10         @WLMPGMY*/ 27368300
*     SVDEF_SP703 FIXED(8) CONSTANT(11), /*                             27368400
*                                WLM version number for OS/390 V2R10    27368500
*                                                            @WLMPGMY*/ 27368600
*     SVDEF_CURRENT_VER FIXED(8) CONSTANT(SVDEF_LEVEL011); /*           27368700
*                                Current version level used when        27368800
*                                checking functionality within WLM      27369000
*                                product.                    @WLMPGMY*/ 27375700
* @LOGIC;                                                               27382400
* #PRAGMA TOOL=CBGEN.                                                   27392000
* #DELETE.SVDEF_LEVEL001_IN_CHAR                                        27401600
* #DELETE.SVDEF_LEVEL002_IN_CHAR                                        27411200
* #DELETE.SVDEF_LEVEL003_IN_CHAR                                        27420800
* #DELETE.SVDEF_LEVEL004_IN_CHAR                                        27425600
* #DELETE.SVDEF_LEVEL005_IN_CHAR                                        27427200
* #DELETE.SVDEF_LEVEL006_IN_CHAR                                        27428800
* #DELETE.SVDEF_LEVEL007_IN_CHAR                                        27429600
* #DELETE.SVDEF_LEVEL008_IN_CHAR                                        27430000
* #DELETE.SVDEF_LEVEL009_IN_CHAR                                        27430100
* #DELETE.SVDEF_LEVEL010_IN_CHAR                                        27430200
* #DELETE.SVDEF_LEVEL011_IN_CHAR                                        27430300
* #EPRAGMA.                                                             27430400
* @ENDLOGIC;                                                            27440000
*/* End of PL/X Source                                               */ 27450000
* %IF IWMSVDEF_LIST ^= 'NO' &                                           27500000
*    ZCBPRINT ^= 'NO' %THEN                                             27550000
*   %GOTO IWMSVDEF_4;                                                   27600000
*   @LIST POP NOECHO;                                                   27650000
* %IWMSVDEF_4:;                                                         27700000
* %END;                                                                 27750000
