*                                                                       00050000
* %DCL IWMSVIDS_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IWMSVIDS_INCLUDED;                                        00150000
* %IF IWMSVIDS_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 94250. CBGEN compile date 94237         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IWMSVIDS &DSECT=YES,&LIST=YES,&SVIDSSVP=YES,&SVIDSSVD=COND,   *00450000
               &SVIDSPRD=COND                                           00500000
         GBLC  &IWMSVIDS_INCLUDED                                       00550000
         GBLC  &ZCBPRINT                                                00600000
&IWMSVIDS_INCLUDED SETC 'YES'                                           00650000
 TITLE   'IWMSVIDS  - WLM Service Definition identifier mappings  '     00700000
**/ IWMSVIDS_1:;                                                        00750000
*/***START OF SPECIFICATIONS******************************************/ 00800000
*/*                                                                  */ 00850000
*/*01* Proprietary statement:                                        */ 00900000
*/*                                                                  */ 00950000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 01000000
*/*      THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                 */ 01050000
*/*      5655-068 (C) COPYRIGHT IBM CORP. 1994                       */ 01100000
*/*      SEE COPYRIGHT INSTRUCTIONS                                  */ 01150000
*/*                                                                  */ 01200000
*/*                                                                  */ 01250000
*/*01* External classification: GUPI                                 */ 01300000
*/*01* End of External classification                                */ 01350000
*/*                                                                  */ 01400000
*/*01* Status: HBB5520                                               */ 01450000
*/*                                                                  */ 01500000
*/*01* Descriptive Name: WLM Service Definition identifier mappings  */ 01550000
*/*                                                                  */ 01600000
*/*02*  Acronym: SVIDS                                               */ 01650000
*/*                                                                  */ 01700000
*/*01* Macro Name: IWMSVIDS                                          */ 01750000
*/*                                                                  */ 01800000
*/*01* DSECT Name:                                                   */ 01820000
*/*02*  SVIDSSVP (DSECT name of service policy id mapping)           */ 01840000
*/*02*  SVIDSSVD (DSECT name of service definition id mapping)       */ 01860000
*/*02*  SVIDSPRD (DSECT name of product id mapping)                  */ 01880000
*/*                                                                  */ 01900000
*/*01* Component: Workload Manager (SCWLM)                           */ 01950000
*/*                                                                  */ 02000000
*/*01* Eye-Catcher: None                                             */ 02050000
*/*02*  Offset: 0                                                    */ 02100000
*/*02*  Length: CHAR(4)                                              */ 02150000
*/*                                                                  */ 02200000
*/*01* Storage Attributes:                                           */ 02250000
*/*02*  Subpool: Any                                                 */ 02300000
*/*02*  Key: Any                                                     */ 02350000
*/*02*  Residency: Above 16M line                                    */ 02400000
*/*                                                                  */ 02450000
*/*01* Size: Determined at run time                                  */ 02500000
*/*                                                                  */ 02550000
*/*01* Created by: N/A                                               */ 02600000
*/*                                                                  */ 02650000
*/*01* Pointed to by: R1 and AR1                                     */ 02700000
*/*                                                                  */ 02750000
*/*01* Serialization: None                                           */ 02800000
*/*                                                                  */ 02850000
*/*01* Function: Contains mappings for data returned from the        */ 02855500
*/*              IWMCQRY and IWMDINST services.                      */ 02861000
*/*                                                                  */ 02866500
*/*      SVIDSSVP (DSECT name of service policy id mapping)          */ 02872000
*/*                                                                  */ 02877500
*/*        -This is used to map the output returned via the          */ 02883000
*/*         POLICY_ID keyword of the IWMCQRY service.                */ 02888500
*/*                                                                  */ 02894000
*/*      SVIDSSVD (DSECT name of service definition id mapping)      */ 02899500
*/*                                                                  */ 02905000
*/*        -This is used to map the output returned via the          */ 02910500
*/*         QRY_BASEID keyword on the IWMDINST service.              */ 02916000
*/*                                                                  */ 02921500
*/*      SVIDSPRD (DSECT name of product id mapping)                 */ 02927000
*/*                                                                  */ 02932500
*/*        -This is used to map the output returned via the          */ 02938000
*/*         PRODUCT_ID keyword on the IWMDINST service.              */ 02943500
*/*                                                                  */ 02945100
*/*      All timestamps are local time expressed in                  */ 02946700
*/*      STCK format.                                                */ 02948300
*/*                                                                  */ 02950000
*/*01* Restrictions:                                                 */ 03000000
*/*              None                                                */ 03050000
*/*                                                                  */ 03100000
*/*01* Method of Access:                                             */ 03150000
*/*                                                                  */ 03200000
*/*02*  ASM:                                                         */ 03250000
*/*          Specify: IWMSVIDS                                       */ 03300000
*/*                                                                  */ 03350000
*/*02*  PLX:                                                         */ 03400000
*/*                                                                  */ 03450000
*/*          %INCLUDE SYSLIB(IWMSVIDS)                               */ 03500000
*/*                                                                  */ 03550000
*/*02*  VIA ATTRIBUTE:                                               */ 03600000
*/*                                                                  */ 03650000
*/*          Specify %SVIDSVIA = 'YES'                               */ 03700000
*/*          prior to %INCLUDE statement.                            */ 03750000
*/*          For VIA(0) specify %GLOBALARMODE='YES'                  */ 03800000
*/*                                                                  */ 03850000
*/*------------------------------------------------------------------*/ 03866600
*/*                                                                  */ 03883200
*/*01* Change Activity:                                              */ 03900000
*/*    $L0= WLMRM,   HBB5520, 940407,PD00BV: WLM RM                  */ 03950000
*/*    $P1=PN71296 HBB5520  940908 PD88D5: Correct DSECT info    @P1A*/ 03975000
*/*    $P2=PN72034 HBB5520  941201 PD88D0: Added more info on the    */ 03981200
*/*                                        usage of the different    */ 03987400
*/*                                        DSECTs in the prolog  @P2A*/ 03993600
*/*    $PQC0795      HBB6603  960820 PDB9DB: Time stamps in local    */ 03995700
*/*                                          time            @PQC0795*/ 03997800
*/*    $PUX0238      HBB6605  970714 PDB9DB: Remove flags in         */ 03998500
*/*                                          prolog          @PUX0238*/ 03999200
*/*                                                                  */ 04000000
*/***END OF SPECIFICATIONS********************************************/ 04050000
*% /*                                                                   04100000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04150000
         AIF   ('&LIST' EQ 'YES').P2                                    04200000
.P1      ANOP                                                           04250000
         PUSH  PRINT                                                    04300000
         PRINT OFF                                                      04350000
.P2      ANOP                                                           04400000
         AIF   ('&SVIDSSVP' EQ 'NO').L0002                              04450000
         AIF   ('&DSECT' EQ 'YES').L0003                                04500000
         AIF   ('&SVIDSSVP' NE 'YES').L0002                             04550000
SVIDSSVP DS    0X        Service policy id mapping                      04600000
         AGO   .L0004                                                   04650000
.L0003   ANOP                                                           04700000
SVIDSSVP DSECT           Service policy id mapping                      04750000
.L0004   ANOP                                                           04800000
SVIDSSVP_NAME DS 1CL0008 Service policy name                            04850000
SVIDSSVP_TIMESTAMP DS 1CL0008 Activation timestamp                      04900000
SVIDSSVP_LEN EQU *-SVIDSSVP                                             04950000
.L0002   ANOP                                                           05000000
         AIF   ('&SVIDSSVD' EQ 'NO').L0005                              05050000
         AIF   ('&DSECT' EQ 'YES').L0006                                05100000
         AIF   ('&SVIDSSVD' NE 'YES').L0005                             05150000
SVIDSSVD DS    0X        Service definition id mapping                  05200000
         AGO   .L0007                                                   05250000
.L0006   ANOP                                                           05300000
SVIDSSVD DSECT           Service definition id mapping                  05350000
.L0007   ANOP                                                           05400000
SVIDSSVD_NAME DS 1CL0008 Service definition name                        05450000
SVIDSSVD_TIMESTAMP DS 1CL0008 Installation timestamp                    05500000
SVIDSSVD_USERID DS 1CL0008 Userid that installed the service           *05550000
                         definition                                     05600000
SVIDSSVD_SYSTEM_NAME DS 1CL0008 System on which the installation was   *05650000
                         done                                           05700000
SVIDSSVD_LEN EQU *-SVIDSSVD                                             05750000
.L0005   ANOP                                                           05800000
         AIF   ('&SVIDSPRD' EQ 'NO').L0008                              05850000
         AIF   ('&DSECT' EQ 'YES').L0009                                05900000
         AIF   ('&SVIDSPRD' NE 'YES').L0008                             05950000
SVIDSPRD DS    0X        Product id mapping                             06000000
         AGO   .L000A                                                   06050000
.L0009   ANOP                                                           06100000
SVIDSPRD DSECT           Product id mapping                             06150000
.L000A   ANOP                                                           06200000
SVIDSPRD_NAME DS 1CL0008 Product name                                   06250000
SVIDSPRD_VERSION DS 1CL0008 Version                                     06300000
SVIDSPRD_SANDBOX DS 1CL0016 Product sandbox                             06350000
SVIDSPRD_LEN EQU *-SVIDSPRD                                             06400000
.L0008   ANOP                                                           06450000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 06500000
         AIF   ('&LIST' EQ 'YES').P4                                    06550000
.P3      ANOP                                                           06600000
         POP   PRINT                                                    06650000
.P4      ANOP                                                           06700000
.P_EXIT  ANOP                                                           06750000
         MEND                                                           06800000
**/ IWMSVIDS_2:;                                                        06850000
* %IWMSVIDS_INCLUDED = 'YES';                                           06900000
* %DCL ZCBPRINT CHAR EXT;                                               06950000
* %DEACTIVATE ZCBPRINT;                                                 07000000
* %DCL IWMSVIDS_LIST CHAR EXT;                                          07050000
* %DEACTIVATE IWMSVIDS_LIST;                                            07100000
* %IF IWMSVIDS_LIST ^= 'NO' &                                           07150000
*    ZCBPRINT ^= 'NO' %THEN                                             07200000
*   %GOTO IWMSVIDS_3;                                                   07250000
*   @LIST PUSH NOECHO;                                                  07300000
*   @LIST NOASSEMBLE NOECHO;                                            07350000
*   @LIST OFF C NOECHO;                                                 07400000
* %IWMSVIDS_3:;                                                         07450000
*/* Start of PL/X Source                                             */ 07500000
*                                                                       07550000
* DCL 1 SVIDSSVP BASED,        /* Service policy id mapping          */ 07600000
*     3 SVIDSSVP_Name CHAR(8), /* Service policy name                */ 07650000
*     3 SVIDSSVP_Timestamp CHAR(8); /* Activation timestamp          */ 07700000
*                                                                       07750000
* DCL 1 SVIDSSVD BASED,        /* Service definition id mapping      */ 07800000
*     3 SVIDSSVD_Name CHAR(8), /* Service definition name            */ 07850000
*     3 SVIDSSVD_Timestamp CHAR(8), /* Installation timestamp        */ 07900000
*     3 SVIDSSVD_Userid CHAR(8), /* Userid that installed the service   07950000
*                                 definition                         */ 08000000
*     3 SVIDSSVD_System_name CHAR(8); /* System on which the            08050000
*                                 installation was done              */ 08100000
*                                                                       08150000
* DCL 1 SVIDSPRD BASED,        /* Product id mapping                 */ 08200000
*     3 SVIDSPRD_Name CHAR(8), /* Product name                       */ 08250000
*     3 SVIDSPRD_Version CHAR(8), /* Version                         */ 08300000
*     3 SVIDSPRD_Sandbox CHAR(16); /* Product sandbox                */ 08350000
*                                                                       08400000
*                                                                       08450000
*/* End of PL/X Source                                               */ 08500000
* %IF IWMSVIDS_LIST ^= 'NO' &                                           08550000
*    ZCBPRINT ^= 'NO' %THEN                                             08600000
*   %GOTO IWMSVIDS_4;                                                   08650000
*   @LIST POP NOECHO;                                                   08700000
* %IWMSVIDS_4:;                                                         08750000
* %END;                                                                 08800000
