*                                                                       00001000
* %DCL IWMSVPSE_INCLUDED CHAR EXT;                                      00002000
* %DEACTIVATE IWMSVPSE_INCLUDED;                                        00003000
* %IF IWMSVPSE_INCLUDED = '' %THEN                                      00004000
* %DO;                                                                  00005000
*%/* Start of PL/X PreProlog Code */;                                   00006000
*                                                                       00007000
*%/* End of PL/X PreProlog Code */;                                     00008000
*/* Macro made bi-lingual on 00326. CBGEN compile date 00290         */ 00009000
*% /*                                                                   00010000
         MACRO                                                          00011000
         IWMSVPSE &DSECT=YES,&LIST=YES,&TITLE=YES,&SVPSEHDR=YES,       *00012000
               &SVPSESE=COND,&SVPSESR=COND,&SVPSERE=COND                00013000
         GBLC  &IWMSVPSE_INCLUDED                                       00014000
         GBLC  &ZCBPRINT                                                00015000
&IWMSVPSE_INCLUDED SETC 'YES'                                           00016000
         AIF   ('&LIST' EQ 'NONE').P0                                   00017000
         AIF   ('&TITLE' EQ 'NO').P5                                    00018000
 TITLE   'IWMSVPSE  - WLM Service Policy Scheduling              '      00019000
.P5      ANOP                                                           00020000
**/ IWMSVPSE_1:;                                                        00021000
*/* START OF SPECIFICATIONS **************************************** */ 00022000
*/*                                                                  */ 00023000
*/*01* PROPRIETARY_STATEMENT *************************************** */ 00024000
*/*                                                                  */ 00025000
*/*    LICENSED MATERIALS - PROPERTY OF IBM                          */ 00026000
*/*    THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                   */ 00027000
*/*    5647-A01 (C) COPYRIGHT IBM CORP. 1998, 2000                   */ 00028000
*/*                                                                  */ 00029000
*/**** END_OF_PROPRIETARY_STATEMENT ******************************** */ 00030000
*/*                                                                  */ 00031000
*/*01* External classification: GUPI                                 */ 00032000
*/*01* End of External classification                                */ 00033000
*/*                                                                  */ 00034000
*/*01* Status = HBB7703                                              */ 00035000
*/*                                                                  */ 00036000
*/*01* Descriptive Name:  WLM Service Policy Scheduling              */ 00037000
*/*                       Environment mapping                        */ 00038000
*/*                                                                  */ 00039000
*/*02*  Acronym:  SVPSE                                              */ 00040000
*/*                                                                  */ 00041000
*/*01* Macro Name:  IWMSVPSE                                         */ 00042000
*/*                                                                  */ 00043000
*/*01* DSECT Name:  SVPSEHDR - SVPSE header                          */ 00044000
*/*                 SVPSESE  - scheduling environments               */ 00045000
*/*                 SVPSESR  - scheduling environments/resources     */ 00046000
*/*                 SVPSERE  - resources                             */ 00047000
*/*                                                                  */ 00048000
*/*01* Component:   Workload Manager (SCWLM)                         */ 00049000
*/*                                                                  */ 00050000
*/*01* Eye-Catcher:  SVPA                                            */ 00051000
*/*02*  Offset:      0                                               */ 00052000
*/*02*  Length:      CHAR(4)                                         */ 00053000
*/*                                                                  */ 00054000
*/*01* Storage Attributes:                                           */ 00055000
*/*02*  Subpool:    Any                                              */ 00056000
*/*02*  Key:        0                                                */ 00057000
*/*02*  Residency:  Above 16M line                                   */ 00058000
*/*                                                                  */ 00059000
*/*01* Size:  Determined at run time                                 */ 00060000
*/*                                                                  */ 00061000
*/*01* Created by:  Caller                                           */ 00062000
*/*                                                                  */ 00063000
*/*01* Pointed to by: R1 and AR1                                     */ 00064000
*/*                                                                  */ 00065000
*/*01* Serialization:  None                                          */ 00066000
*/*                                                                  */ 00067000
*/*01* Function: Contains service policy scheduling environments     */ 00068000
*/*              information.                                        */ 00069000
*/*                                                                  */ 00070000
*/*              Also used to map SMF 90 subtype 32 record.          */ 00071000
*/*                                                                  */ 00072000
*/*01* Method of Access:                                             */ 00073000
*/*                                                                  */ 00074000
*/*02*  ASM:                                                         */ 00075000
*/*          Specify: IWMSVPSE                                       */ 00076000
*/*                                                                  */ 00077000
*/*02*  PL/X:                                                        */ 00078000
*/*                                                                  */ 00079000
*/*          %INCLUDE SYSLIB(IWMSVPSE)                               */ 00080000
*/*                                                                  */ 00081000
*/*          Using on SVPSEHDR gives addressability to the header    */ 00082000
*/*          area of the service policy scheduling environment       */ 00083000
*/*          information.                                            */ 00084000
*/*                                                                  */ 00085000
*/*          Subsequent usings must be done to get addressability    */ 00086000
*/*          to the additional sections (DSECTs) as follows:         */ 00087000
*/*                                                                  */ 00088000
*/*          DSECT    USING                                          */ 00089000
*/*          -----    -----                                          */ 00090000
*/*          SVPSESE  A(SVPSEHDR) + SVPSE_OFFSET_SE  (multiple)      */ 00091000
*/*          SVPSESR  A(SVPSEHDR) + SVPSE_OFFSET_SR  (multiple)      */ 00092000
*/*          SVPSERE  A(SVPSEHDR) + SVPSE_OFFSET_RE  (multiple)      */ 00093000
*/*                                                                  */ 00094000
*/*          Subsequent elements of a section can be found           */ 00095000
*/*          by adding the size of one element as indicated          */ 00096000
*/*          in the header to the basing.                            */ 00097000
*/*                                                                  */ 00098000
*/****************************************************************** */ 00099000
*/*                                                                  */ 00100000
*/*01* Change Activity:                                              */ 00101000
*/*                                                                  */ 00102000
*/*    $L0=WLMCRES JBB6604  961030 PDB9DB: WLMRES                    */ 00103000
*/*                                        Scheduling Environments   */ 00104000
*/*    $L2=WLMCSDC HBB6606  970807 B9HAKP: WLMSDC                    */ 00105000
*/*                                        Service Definition        */ 00106000
*/*                                        Comments                  */ 00107000
*/*                                                                  */ 00108000
*/*    $L7=WLMCMQS JBB6607  980325 B9HARF: WLMCMQS                   */ 00109000
*/*                                        Rich Fine                 */ 00110000
*/*                                        Process Name     @WLMCMQS */ 00111000
*/*                                                                  */ 00112000
*/*    $L7=WLMCTAL JBB6607  980501 B9HAMS: Scott Monheimer           */ 00113000
*/*                                        Dynamic alias tuning      */ 00114000
*/*                                                         @WLMCTAL */ 00115000
*/*   $L10=WLMCGMY HBB7703  991027 B9HAPC: Patrick Chan              */ 00116000
*/*                                        Add constant for          */ 00117000
*/*                                        functionality level 11    */ 00118000
*/*                                                         @WLMCGMY */ 00119000
*/*       $OW43855 HBB7703  001103  B9HAPC: Patrick Chan             */ 00120000
*/*                                         Regen                    */ 00121000
*/*                                                         @OW43855 */ 00122000
*/*  END OF SPECIFICATIONS ***************************************** */ 00123000
*% /*                                                                   00124000
.P0      ANOP                                                           00125000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 00126000
         AIF   ('&LIST' EQ 'YES').P2                                    00127000
.P1      ANOP                                                           00128000
         PUSH  PRINT                                                    00129000
         PRINT OFF                                                      00130000
.P2      ANOP                                                           00131000
*                                                                       00132000
*    *****************************************************************  00133000
*    *                                                               *  00134000
*    * IWMSVPSE.879: SVPSE Header                                    *  00135000
*    *                                                               *  00136000
*    *****************************************************************  00137000
*                                                                       00138000
*                                                                       00139000
         AIF   ('&SVPSEHDR' EQ 'NO').L0002                              00140000
         AIF   ('&DSECT' EQ 'YES').L0003                                00141000
         AIF   ('&SVPSEHDR' NE 'YES').L0002                             00142000
SVPSEHDR DS    0F                                                       00143000
         AGO   .L0004                                                   00144000
.L0003   ANOP                                                           00145000
SVPSEHDR DSECT                                                          00146000
.L0004   ANOP                                                           00147000
SVPSE_EYECATCHER DS 1CL0004 IWMSVPSE.16: Eye catcher for SVPSE - SVPS   00148000
SVPSE_FUNCTIONALITY_LEVEL DS 1FL1 IWMSVPSE.22: Functionality level of  *00149000
                         the SVPSE. The functionality level defines    *00150000
                         the highest level of WLM function that exists *00151000
                         in the SVPSE                                   00152000
SVPSE_WLM_VERSION_NUMBER DS 1FL1 IWMSVPSE.28: WLM version number        00153000
SVPSE_SIZE_OF_HEADER DS 1FL2 IWMSVPSE.34: Size of header section        00154000
SVPSE_SIZE_OF_WHOLE_SVPSE DS 1FL4 IWMSVPSE.40: Size of the whole       *00155000
                         scheduling environment section                 00156000
SVPSE_SVPSESEQ DS 1FL4   IWMSVPSE.930: Policy activation sequence      *00157000
                         number - gets bumped for every policy         *00158000
                         activation when scheduling environment data   *00159000
                         changes                                        00160000
SVPSE_OFFSETS_AREA DS 1CL0056 IWMSVPSE.53: SVPSE section offsets area   00161000
         ORG   SVPSE_OFFSETS_AREA                                       00162000
SVPSE_OFFSET_SE DS 1FL4  IWMSVPSE.57: Offset of scheduling environment *00163000
                         section                                        00164000
SVPSE_NUMBER_SE DS 1FL2  IWMSVPSE.63: Number of scheduling             *00165000
                         environments                                   00166000
SVPSE_SIZE_SE DS 1FL2    IWMSVPSE.69: Size of an scheduling            *00167000
                         environment entry                              00168000
SVPSE_OFFSET_SR DS 1FL4  IWMSVPSE.76: Offset of scheduling             *00169000
                         environment- /resource section                 00170000
SVPSE_NUMBER_SR DS 1FL2  IWMSVPSE.82: Number of scheduling             *00171000
                         environment- /resource                         00172000
SVPSE_SIZE_SR DS 1FL2    IWMSVPSE.88: Size of an scheduling            *00173000
                         environment- /resource section                 00174000
SVPSE_OFFSET_RE DS 1FL4  IWMSVPSE.95: Offset of resource section        00175000
SVPSE_NUMBER_RE DS 1FL2  IWMSVPSE.101: Number of resources              00176000
SVPSE_SIZE_RE DS 1FL2    IWMSVPSE.107: Size of an resource entry        00177000
SVPSE_OFFSET_RESERVED1 DS 1FL4 IWMSVPSE.114: Reserved offset            00178000
SVPSE_NUMBER_RESERVED1 DS 1FL2 IWMSVPSE.120: Reserved number            00179000
SVPSE_SIZE_RESERVED1 DS 1FL2 IWMSVPSE.126: Reserved size                00180000
SVPSE_OFFSET_RESERVED2 DS 1FL4 IWMSVPSE.133: Reserved offset            00181000
SVPSE_NUMBER_RESERVED2 DS 1FL2 IWMSVPSE.139: Reserved number            00182000
SVPSE_SIZE_RESERVED2 DS 1FL2 IWMSVPSE.145: Reserved size                00183000
SVPSE_OFFSET_RESERVED3 DS 1FL4 IWMSVPSE.152: Reserved offset            00184000
SVPSE_NUMBER_RESERVED3 DS 1FL2 IWMSVPSE.158: Reserved number            00185000
SVPSE_SIZE_RESERVED3 DS 1FL2 IWMSVPSE.164: Reserved size                00186000
SVPSE_OFFSET_RESERVED4 DS 1FL4 IWMSVPSE.171: Reserved offset            00187000
SVPSE_NUMBER_RESERVED4 DS 1FL2 IWMSVPSE.177: Reserved number            00188000
SVPSE_SIZE_RESERVED4 DS 1FL2 IWMSVPSE.183: Reserved size                00189000
SVPSE_EXT_OFFSETS_AREA DS 1CL0048 IWMSVPSE.190: SVPSE extension        *00190000
                         offsets area                                   00191000
         ORG   SVPSE_EXT_OFFSETS_AREA                                   00192000
SVPSE_EXT_DATA_OFF DS 1FL4 IWMSVPSE.193: Offset of extended data (0 if *00193000
                         no extended data exists)                       00194000
SVPSE_EXT_DATA_LEN DS 1FL4 IWMSVPSE.199: Length of extended data        00195000
SVPSE_EXT_OFF_SE DS 1FL4 IWMSVPSE.205: Offset of scheduling            *00196000
                         environments extension section if number of   *00197000
                         scheduling environments extensions is nonzero *00198000
                         (otherwise this field is ignored)              00199000
SVPSE_EXT_NUM_SE DS 1FL2 IWMSVPSE.211: Number of scheduling            *00200000
                         environments extension entries                 00201000
SVPSE_EXT_SIZ_SE DS 1FL2 IWMSVPSE.217: Size of each scheduling         *00202000
                         environments extension entry                   00203000
SVPSE_EXT_OFF_RSV1 DS 1FL4 IWMSVPSE.223: Offset reserved                00204000
SVPSE_EXT_NUM_RSV1 DS 1FL2 IWMSVPSE.229: Number reserved                00205000
SVPSE_EXT_SIZ_RSV1 DS 1FL2 IWMSVPSE.235: Size reserved                  00206000
SVPSE_EXT_OFF_RSV2 DS 1FL4 IWMSVPSE.241: Offset reserved                00207000
SVPSE_EXT_NUM_RSV2 DS 1FL2 IWMSVPSE.247: Number reserved                00208000
SVPSE_EXT_SIZ_RSV2 DS 1FL2 IWMSVPSE.253: Size reserved                  00209000
SVPSE_EXT_OFF_RSV3 DS 1FL4 IWMSVPSE.259: Offset reserved                00210000
SVPSE_EXT_NUM_RSV3 DS 1FL2 IWMSVPSE.265: Number reserved                00211000
SVPSE_EXT_SIZ_RSV3 DS 1FL2 IWMSVPSE.271: Size reserved                  00212000
SVPSE_EXT_OFF_RSV4 DS 1FL4 IWMSVPSE.277: Offset reserved                00213000
SVPSE_EXT_NUM_RSV4 DS 1FL2 IWMSVPSE.283: Number reserved                00214000
SVPSE_EXT_SIZ_RSV4 DS 1FL2 IWMSVPSE.289: Size reserved                  00215000
SVPSE_RESERVED DS 1FL4   IWMSVPSE.295: Reserved                         00216000
         ORG   SVPSEHDR+X'000000A0'                                     00217000
SVPSEHDR_LEN EQU *-SVPSEHDR                                             00218000
.L0002   ANOP                                                           00219000
*                                                                       00220000
*    *****************************************************************  00221000
*    *                                                               *  00222000
*    * IWMSVPSE.888: SVPSE SE - Scheduling Environments Entry        *  00223000
*    *                                                               *  00224000
*    *****************************************************************  00225000
*                                                                       00226000
*                                                                       00227000
         AIF   ('&SVPSESE' EQ 'NO').L0005                               00228000
         AIF   ('&DSECT' EQ 'YES').L0006                                00229000
         AIF   ('&SVPSESE' NE 'YES').L0005                              00230000
SVPSESE  DS    0X                                                       00231000
         AGO   .L0007                                                   00232000
.L0006   ANOP                                                           00233000
SVPSESE  DSECT                                                          00234000
.L0007   ANOP                                                           00235000
SVPSE_SE_SCHENV_NAME DS 1CL0016 IWMSVPSE.315: Scheduling environment   *00236000
                         name                                           00237000
SVPSE_SE_DESCRIPTION DS 1CL0032 IWMSVPSE.321: Scheduling environment   *00238000
                         description                                    00239000
SVPSE_SE_RESERVED DS 1CL0008 IWMSVPSE.327: Reserved                     00240000
         ORG   SVPSESE+X'00000058'                                      00241000
SVPSESE_LEN EQU *-SVPSESE                                               00242000
.L0005   ANOP                                                           00243000
*                                                                       00244000
*    *****************************************************************  00245000
*    *                                                               *  00246000
*    * IWMSVPSE.897: SVPSE SR - Scheduling Environments/Resources    *  00247000
*    * Entry                                                         *  00248000
*    *                                                               *  00249000
*    *****************************************************************  00250000
*                                                                       00251000
*                                                                       00252000
         AIF   ('&SVPSESR' EQ 'NO').L0008                               00253000
         AIF   ('&DSECT' EQ 'YES').L0009                                00254000
         AIF   ('&SVPSESR' NE 'YES').L0008                              00255000
SVPSESR  DS    0X                                                       00256000
         AGO   .L000A                                                   00257000
.L0009   ANOP                                                           00258000
SVPSESR  DSECT                                                          00259000
.L000A   ANOP                                                           00260000
SVPSE_SR_SCHENV_NAME DS 1CL0016 IWMSVPSE.347: Scheduling environment   *00261000
                         name                                           00262000
SVPSE_SR_RESOURCE_NAME DS 1CL0016 IWMSVPSE.353: Resource name           00263000
SVPSE_SR_RESOURCE_STATE DS 1FL1 IWMSVPSE.359: Required resource state   00264000
SVPSE_SR_RESERVED1 DS 1CL0001 IWMSVPSE.383: Reserved                    00265000
         ORG   SVPSE_SR_RESERVED1+X'00000003'                           00266000
SVPSE_SR_RESERVED2 DS 1CL0008 IWMSVPSE.392: Reserved                    00267000
         ORG   SVPSESR+X'0000004C'                                      00268000
SVPSESR_LEN EQU *-SVPSESR                                               00269000
.L0008   ANOP                                                           00270000
*                                                                       00271000
*    *****************************************************************  00272000
*    *                                                               *  00273000
*    * IWMSVPSE.906: SVPSE RE - Scheduling Resources Entry           *  00274000
*    *                                                               *  00275000
*    *****************************************************************  00276000
*                                                                       00277000
*                                                                       00278000
         AIF   ('&SVPSERE' EQ 'NO').L000B                               00279000
         AIF   ('&DSECT' EQ 'YES').L000C                                00280000
         AIF   ('&SVPSERE' NE 'YES').L000B                              00281000
SVPSERE  DS    0X                                                       00282000
         AGO   .L000D                                                   00283000
.L000C   ANOP                                                           00284000
SVPSERE  DSECT                                                          00285000
.L000D   ANOP                                                           00286000
SVPSE_RE_RESOURCE_NAME DS 1CL0016 IWMSVPSE.412: Resource name           00287000
SVPSE_RE_DESCRIPTION DS 1CL0032 IWMSVPSE.418: Resource description      00288000
SVPSE_RE_RESERVED DS 1CL0008 IWMSVPSE.424: Reserved                     00289000
*                                                                       00290000
*    *****************************************************************  00291000
*    *                                                               *  00292000
*    * IWMSVPSE.566: SVPSE identifier                                *  00293000
*    *                                                               *  00294000
*    *****************************************************************  00295000
*                                                                       00296000
*                                                                       00297000
SVPSE_ID EQU   C'SVPS'                                                  00298000
*                                                                       00299000
*    *****************************************************************  00300000
*    *                                                               *  00301000
*    * IWMSVPSE.575: Functionality level introduced by WLM in SP510. *  00302000
*    * This is set by JBB6604 when no scheduling environments were   *  00303000
*    * defined.                                                      *  00304000
*    *                                                               *  00305000
*    *****************************************************************  00306000
*                                                                       00307000
*                                                                       00308000
SVPSE_LEVEL001 EQU 1                                                    00309000
*                                                                       00310000
*    *****************************************************************  00311000
*    *                                                               *  00312000
*    * IWMSVPSE.584: Functionality level introduced by WLM in OS/390 *  00313000
*    * R4                                                            *  00314000
*    *                                                               *  00315000
*    *****************************************************************  00316000
*                                                                       00317000
*                                                                       00318000
SVPSE_LEVEL004 EQU 4                                                    00319000
*                                                                       00320000
*    *****************************************************************  00321000
*    *                                                               *  00322000
*    * IWMSVPSE.593: WLM version number for OS/390 R4                *  00323000
*    *                                                               *  00324000
*    *****************************************************************  00325000
*                                                                       00326000
*                                                                       00327000
SVPSE_VER604 EQU 4                                                      00328000
*                                                                       00329000
*    *****************************************************************  00330000
*    *                                                               *  00331000
*    * IWMSVPSE.1111: Functionality level introduced by WLM in OS/390*  00332000
*    * R5                                                               00333000
*    *                                                               *  00334000
*    *****************************************************************  00335000
*                                                                       00336000
*                                                                       00337000
SVPSE_LEVEL005 EQU 5                                                    00338000
*                                                                       00339000
*    *****************************************************************  00340000
*    *                                                               *  00341000
*    * IWMSVPSE.1120: WLM version number for OS/390 R5                  00342000
*    *                                                               *  00343000
*    *****************************************************************  00344000
*                                                                       00345000
*                                                                       00346000
SVPSE_VER605 EQU 5                                                      00347000
*                                                                       00348000
*    *****************************************************************  00349000
*    *                                                               *  00350000
*    * IWMSVPSE.1129: Functionality level introduced by WLM in OS/390*  00351000
*    * R6                                                               00352000
*    *                                                               *  00353000
*    *****************************************************************  00354000
*                                                                       00355000
*                                                                       00356000
SVPSE_LEVEL006 EQU 6                                                    00357000
*                                                                       00358000
*    *****************************************************************  00359000
*    *                                                               *  00360000
*    * IWMSVPSE.1138: WLM version number for OS/390 R6                  00361000
*    *                                                               *  00362000
*    *****************************************************************  00363000
*                                                                       00364000
*                                                                       00365000
SVPSE_VER606 EQU 6                                                      00366000
*                                                                       00367000
*    *****************************************************************  00368000
*    *                                                               *  00369000
*    * IWMSVPSE.1147: Functionality level introduced by WLM in OS/390*  00370000
*    * R7                                                               00371000
*    *                                                               *  00372000
*    *****************************************************************  00373000
*                                                                       00374000
*                                                                       00375000
SVPSE_LEVEL007 EQU 7                                                    00376000
*                                                                       00377000
*    *****************************************************************  00378000
*    *                                                               *  00379000
*    * IWMSVPSE.1156: WLM version number for OS/390 R7                  00380000
*    *                                                               *  00381000
*    *****************************************************************  00382000
*                                                                       00383000
*                                                                       00384000
SVPSE_VER607 EQU 7                                                      00385000
*                                                                       00386000
*    *****************************************************************  00387000
*    *                                                               *  00388000
*    * IWMSVPSE.1158: Functionality level introduced by WLM in OS/390*  00389000
*    * R7                                                               00390000
*    *                                                               *  00391000
*    *****************************************************************  00392000
*                                                                       00393000
*                                                                       00394000
SVPSE_LEVEL008 EQU 8                                                    00395000
*                                                                       00396000
*    *****************************************************************  00397000
*    *                                                               *  00398000
*    * IWMSVPSE.1167: WLM version number for OS/390 R7                  00399000
*    *                                                               *  00400000
*    *****************************************************************  00401000
*                                                                       00402000
*                                                                       00403000
SVPSE_VER608 EQU 8                                                      00404000
*                                                                       00405000
*    *****************************************************************  00406000
*    *                                                               *  00407000
*    * IWMSVPSE.1213: Reserved functionality level                      00408000
*    *                                                               *  00409000
*    *****************************************************************  00410000
*                                                                       00411000
*                                                                       00412000
SVPSE_LEVEL009 EQU 9                                                    00413000
*                                                                       00414000
*    *****************************************************************  00415000
*    *                                                               *  00416000
*    * IWMSVPSE.1196: Reserved functionality level                      00417000
*    *                                                               *  00418000
*    *****************************************************************  00419000
*                                                                       00420000
*                                                                       00421000
SVPSE_LEVEL010 EQU 10                                                   00422000
*                                                                       00423000
*    *****************************************************************  00424000
*    *                                                               *  00425000
*    * IWMSVPSE.1222: Functionality level introduced by WLM in OS/390*  00426000
*    * R10                                                              00427000
*    *                                                               *  00428000
*    *****************************************************************  00429000
*                                                                       00430000
*                                                                       00431000
SVPSE_LEVEL011 EQU 11                                                   00432000
*                                                                       00433000
*    *****************************************************************  00434000
*    *                                                               *  00435000
*    * IWMSVPSE.1198: WLM version number for OS/390 R10                 00436000
*    *                                                               *  00437000
*    *****************************************************************  00438000
*                                                                       00439000
*                                                                       00440000
SVPSE_VER703 EQU 11                                                     00441000
*                                                                       00442000
*    *****************************************************************  00443000
*    *                                                               *  00444000
*    * IWMSVPSE.602: Current version level used when checking        *  00445000
*    * functionality within WLM product                                 00446000
*    *                                                               *  00447000
*    *****************************************************************  00448000
*                                                                       00449000
*                                                                       00450000
SVPSE_CURRENT_VER EQU 11                                                00451000
*                                                                       00452000
*    *****************************************************************  00453000
*    *                                                               *  00454000
*    * IWMSVPSE.976: SVPSE_SR_RESOURCE_STATE that indicates resource *  00455000
*    * is desired to be ON                                           *  00456000
*    *                                                               *  00457000
*    *****************************************************************  00458000
*                                                                       00459000
*                                                                       00460000
SVPSE_SR_ON EQU 4                                                       00461000
*                                                                       00462000
*    *****************************************************************  00463000
*    *                                                               *  00464000
*    * IWMSVPSE.982: SVPSE_SR_RESOURCE_STATE that indicates resource *  00465000
*    * is desired to be OFF                                          *  00466000
*    *                                                               *  00467000
*    *****************************************************************  00468000
*                                                                       00469000
*                                                                       00470000
SVPSE_SR_OFF EQU 8                                                      00471000
*                                                                       00472000
*    *****************************************************************  00473000
*    *                                                               *  00474000
*    * IWMSVPSE.1024: SVPSE_SR_RESOURCE_STATE that is reserved       *  00475000
*    *                                                               *  00476000
*    *****************************************************************  00477000
*                                                                       00478000
*                                                                       00479000
SVPSE_SR_RESERVED EQU 12                                                00480000
*                                                                       00481000
*    *****************************************************************  00482000
*    *                                                               *  00483000
*    * IWMSVPSE.625: SVPSE section symbolic constant                 *  00484000
*    *                                                               *  00485000
*    *****************************************************************  00486000
*                                                                       00487000
*                                                                       00488000
SVPSE_SECTION EQU 1                                                     00489000
*                                                                       00490000
*    *****************************************************************  00491000
*    *                                                               *  00492000
*    * IWMSVPSE.634: SVPSE header symbolic constant                  *  00493000
*    *                                                               *  00494000
*    *****************************************************************  00495000
*                                                                       00496000
*                                                                       00497000
SVPSE_HDR_SECTION EQU 2                                                 00498000
*                                                                       00499000
*    *****************************************************************  00500000
*    *                                                               *  00501000
*    * IWMSVPSE.643: SVPSE SE symbolic constant                      *  00502000
*    *                                                               *  00503000
*    *****************************************************************  00504000
*                                                                       00505000
*                                                                       00506000
SVPSE_SE_SECTION EQU 3                                                  00507000
*                                                                       00508000
*    *****************************************************************  00509000
*    *                                                               *  00510000
*    * IWMSVPSE.653: SVPSE SR symbolic constant                      *  00511000
*    *                                                               *  00512000
*    *****************************************************************  00513000
*                                                                       00514000
*                                                                       00515000
SVPSE_SR_SECTION EQU 4                                                  00516000
*                                                                       00517000
*    *****************************************************************  00518000
*    *                                                               *  00519000
*    * IWMSVPSE.663: SVPSE RE symbolic constant                      *  00520000
*    *                                                               *  00521000
*    *****************************************************************  00522000
*                                                                       00523000
*                                                                       00524000
SVPSE_RE_SECTION EQU 5                                                  00525000
         ORG   SVPSERE+X'00000058'                                      00526000
SVPSERE_LEN EQU *-SVPSERE                                               00527000
.L000B   ANOP                                                           00528000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 00529000
         AIF   ('&LIST' EQ 'YES').P4                                    00530000
.P3      ANOP                                                           00531000
         POP   PRINT                                                    00532000
.P4      ANOP                                                           00533000
.P_EXIT  ANOP                                                           00534000
         MEND                                                           00535000
**/ IWMSVPSE_2:;                                                        00536000
* %IWMSVPSE_INCLUDED = 'YES';                                           00537000
* %DCL ZCBPRINT CHAR EXT;                                               00538000
* %DEACTIVATE ZCBPRINT;                                                 00539000
* %DCL IWMSVPSE_LIST CHAR EXT;                                          00540000
* %DEACTIVATE IWMSVPSE_LIST;                                            00541000
* %IF IWMSVPSE_LIST ^= 'NO' &                                           00542000
*    ZCBPRINT ^= 'NO' %THEN                                             00543000
*   %GOTO IWMSVPSE_3;                                                   00544000
*   @LIST PUSH NOECHO;                                                  00545000
*   @LIST NOASSEMBLE NOECHO;                                            00546000
*   @LIST OFF C NOECHO;                                                 00547000
* %IWMSVPSE_3:;                                                         00548000
*/* Start of PL/X Source                                             */ 00549000
*                                                                       00550000
*   /*****************************************************************/ 00551000
*   /*                                                               */ 00552000
*   /* IWMSVPSE.879: SVPSE Header                                    */ 00553000
*   /*                                                               */ 00554000
*   /*****************************************************************/ 00555000
*                                                                       00556000
*   DECLARE                                                             00557000
*     1    SVPSEHDR BASED(*) BDY(WORD),                                 00558000
*      2    SVPSE_EYECATCHER CHAR(4), /* IWMSVPSE.16: Eye catcher for   00559000
*                                      SVPSE - SVPS                  */ 00560000
*      2    SVPSE_FUNCTIONALITY_LEVEL FIXED(8), /* IWMSVPSE.22:         00561000
*                                      Functionality level of the       00562000
*                                      SVPSE. The functionality level   00563000
*                                      defines the highest level of     00564000
*                                      WLM function that exists in      00565000
*                                      the SVPSE                     */ 00566000
*      2    SVPSE_WLM_VERSION_NUMBER FIXED(8), /* IWMSVPSE.28: WLM      00567000
*                                      version number                */ 00568000
*      2    SVPSE_SIZE_OF_HEADER FIXED(16), /* IWMSVPSE.34: Size of     00569000
*                                      header section                */ 00570000
*      2    SVPSE_SIZE_OF_WHOLE_SVPSE FIXED(32), /* IWMSVPSE.40: Size   00571000
*                                      of the whole scheduling          00572000
*                                      environment section           */ 00573000
*      2    SVPSE_SVPSESEQ FIXED(32) ABNORMAL, /* IWMSVPSE.930:         00574000
*                                      Policy activation sequence       00575000
*                                      number - gets bumped for every   00576000
*                                      policy activation when           00577000
*                                      scheduling environment data      00578000
*                                      changes                       */ 00579000
*      2    SVPSE_OFFSETS_AREA,     /* IWMSVPSE.53: SVPSE section       00580000
*                                      offsets area                  */ 00581000
*       3    SVPSE_OFFSET_SE FIXED(32), /* IWMSVPSE.57: Offset of       00582000
*                                      scheduling environment section*/ 00583000
*       3    SVPSE_NUMBER_SE FIXED(16), /* IWMSVPSE.63: Number of       00584000
*                                      scheduling environments       */ 00585000
*       3    SVPSE_SIZE_SE FIXED(16), /* IWMSVPSE.69: Size of an        00586000
*                                      scheduling environment entry  */ 00587000
*       3    SVPSE_OFFSET_SR FIXED(32), /* IWMSVPSE.76: Offset of       00588000
*                                      scheduling environment-          00589000
*                                      /resource section             */ 00590000
*       3    SVPSE_NUMBER_SR FIXED(16), /* IWMSVPSE.82: Number of       00591000
*                                      scheduling environment-          00592000
*                                      /resource                     */ 00593000
*       3    SVPSE_SIZE_SR FIXED(16), /* IWMSVPSE.88: Size of an        00594000
*                                      scheduling environment-          00595000
*                                      /resource section             */ 00596000
*       3    SVPSE_OFFSET_RE FIXED(32), /* IWMSVPSE.95: Offset of       00597000
*                                      resource section              */ 00598000
*       3    SVPSE_NUMBER_RE FIXED(16), /* IWMSVPSE.101: Number of      00599000
*                                      resources                     */ 00600000
*       3    SVPSE_SIZE_RE FIXED(16), /* IWMSVPSE.107: Size of an       00601000
*                                      resource entry                */ 00602000
*       3    SVPSE_OFFSET_RESERVED1 FIXED(32), /* IWMSVPSE.114:         00603000
*                                      Reserved offset               */ 00604000
*       3    SVPSE_NUMBER_RESERVED1 FIXED(16), /* IWMSVPSE.120:         00605000
*                                      Reserved number               */ 00606000
*       3    SVPSE_SIZE_RESERVED1 FIXED(16), /* IWMSVPSE.126:           00607000
*                                      Reserved size                 */ 00608000
*       3    SVPSE_OFFSET_RESERVED2 FIXED(32), /* IWMSVPSE.133:         00609000
*                                      Reserved offset               */ 00610000
*       3    SVPSE_NUMBER_RESERVED2 FIXED(16), /* IWMSVPSE.139:         00611000
*                                      Reserved number               */ 00612000
*       3    SVPSE_SIZE_RESERVED2 FIXED(16), /* IWMSVPSE.145:           00613000
*                                      Reserved size                 */ 00614000
*       3    SVPSE_OFFSET_RESERVED3 FIXED(32), /* IWMSVPSE.152:         00615000
*                                      Reserved offset               */ 00616000
*       3    SVPSE_NUMBER_RESERVED3 FIXED(16), /* IWMSVPSE.158:         00617000
*                                      Reserved number               */ 00618000
*       3    SVPSE_SIZE_RESERVED3 FIXED(16), /* IWMSVPSE.164:           00619000
*                                      Reserved size                 */ 00620000
*       3    SVPSE_OFFSET_RESERVED4 FIXED(32), /* IWMSVPSE.171:         00621000
*                                      Reserved offset               */ 00622000
*       3    SVPSE_NUMBER_RESERVED4 FIXED(16), /* IWMSVPSE.177:         00623000
*                                      Reserved number               */ 00624000
*       3    SVPSE_SIZE_RESERVED4 FIXED(16), /* IWMSVPSE.183:           00625000
*                                      Reserved size                 */ 00626000
*      2    SVPSE_EXT_OFFSETS_AREA, /* IWMSVPSE.190: SVPSE extension    00627000
*                                      offsets area                  */ 00628000
*       3    SVPSE_EXT_DATA_OFF FIXED(32), /* IWMSVPSE.193: Offset of   00629000
*                                      extended data (0 if no           00630000
*                                      extended data exists)         */ 00631000
*       3    SVPSE_EXT_DATA_LEN FIXED(32), /* IWMSVPSE.199: Length of   00632000
*                                      extended data                 */ 00633000
*       3    SVPSE_EXT_OFF_SE FIXED(32), /* IWMSVPSE.205: Offset of     00634000
*                                      scheduling environments          00635000
*                                      extension section if number of   00636000
*                                      scheduling environments          00637000
*                                      extensions is nonzero            00638000
*                                      (otherwise this field is         00639000
*                                      ignored)                      */ 00640000
*       3    SVPSE_EXT_NUM_SE FIXED(16), /* IWMSVPSE.211: Number of     00641000
*                                      scheduling environments          00642000
*                                      extension entries             */ 00643000
*       3    SVPSE_EXT_SIZ_SE FIXED(16), /* IWMSVPSE.217: Size of       00644000
*                                      each scheduling environments     00645000
*                                      extension entry               */ 00646000
*       3    SVPSE_EXT_OFF_RSV1 FIXED(32), /* IWMSVPSE.223: Offset      00647000
*                                      reserved                      */ 00648000
*       3    SVPSE_EXT_NUM_RSV1 FIXED(16), /* IWMSVPSE.229: Number      00649000
*                                      reserved                      */ 00650000
*       3    SVPSE_EXT_SIZ_RSV1 FIXED(16), /* IWMSVPSE.235: Size        00651000
*                                      reserved                      */ 00652000
*       3    SVPSE_EXT_OFF_RSV2 FIXED(32), /* IWMSVPSE.241: Offset      00653000
*                                      reserved                      */ 00654000
*       3    SVPSE_EXT_NUM_RSV2 FIXED(16), /* IWMSVPSE.247: Number      00655000
*                                      reserved                      */ 00656000
*       3    SVPSE_EXT_SIZ_RSV2 FIXED(16), /* IWMSVPSE.253: Size        00657000
*                                      reserved                      */ 00658000
*       3    SVPSE_EXT_OFF_RSV3 FIXED(32), /* IWMSVPSE.259: Offset      00659000
*                                      reserved                      */ 00660000
*       3    SVPSE_EXT_NUM_RSV3 FIXED(16), /* IWMSVPSE.265: Number      00661000
*                                      reserved                      */ 00662000
*       3    SVPSE_EXT_SIZ_RSV3 FIXED(16), /* IWMSVPSE.271: Size        00663000
*                                      reserved                      */ 00664000
*       3    SVPSE_EXT_OFF_RSV4 FIXED(32), /* IWMSVPSE.277: Offset      00665000
*                                      reserved                      */ 00666000
*       3    SVPSE_EXT_NUM_RSV4 FIXED(16), /* IWMSVPSE.283: Number      00667000
*                                      reserved                      */ 00668000
*       3    SVPSE_EXT_SIZ_RSV4 FIXED(16), /* IWMSVPSE.289: Size        00669000
*                                      reserved                      */ 00670000
*      2    SVPSE_RESERVED(10) FIXED(32); /* IWMSVPSE.295: Reserved  */ 00671000
*                                                                       00672000
*   /*****************************************************************/ 00673000
*   /*                                                               */ 00674000
*   /* IWMSVPSE.888: SVPSE SE - Scheduling Environments Entry        */ 00675000
*   /*                                                               */ 00676000
*   /*****************************************************************/ 00677000
*                                                                       00678000
*   DECLARE                                                             00679000
*     1    SVPSESE  BASED(*) BDY(BYTE),                                 00680000
*      2    SVPSE_SE_SCHENV_NAME CHAR(16), /* IWMSVPSE.315:             00681000
*                                      Scheduling environment name   */ 00682000
*      2    SVPSE_SE_DESCRIPTION CHAR(32), /* IWMSVPSE.321:             00683000
*                                      Scheduling environment           00684000
*                                      description                   */ 00685000
*      2    SVPSE_SE_RESERVED(5) CHAR(8); /* IWMSVPSE.327: Reserved  */ 00686000
*                                                                       00687000
*   /*****************************************************************/ 00688000
*   /*                                                               */ 00689000
*   /* IWMSVPSE.897: SVPSE SR - Scheduling Environments/Resources    */ 00690000
*   /* Entry                                                         */ 00691000
*   /*                                                               */ 00692000
*   /*****************************************************************/ 00693000
*                                                                       00694000
*   DECLARE                                                             00695000
*     1    SVPSESR  BASED(*) BDY(BYTE),                                 00696000
*      2    SVPSE_SR_SCHENV_NAME CHAR(16), /* IWMSVPSE.347:             00697000
*                                      Scheduling environment name   */ 00698000
*      2    SVPSE_SR_RESOURCE_NAME CHAR(16), /* IWMSVPSE.353:           00699000
*                                      Resource name                 */ 00700000
*      2    SVPSE_SR_RESOURCE_STATE FIXED(8), /* IWMSVPSE.359:          00701000
*                                      Required resource state       */ 00702000
*      2    SVPSE_SR_RESERVED1(3) CHAR(1), /* IWMSVPSE.383: Reserved */ 00703000
*      2    SVPSE_SR_RESERVED2(5) CHAR(8); /* IWMSVPSE.392: Reserved */ 00704000
*                                                                       00705000
*   /*****************************************************************/ 00706000
*   /*                                                               */ 00707000
*   /* IWMSVPSE.906: SVPSE RE - Scheduling Resources Entry           */ 00708000
*   /*                                                               */ 00709000
*   /*****************************************************************/ 00710000
*                                                                       00711000
*   DECLARE                                                             00712000
*     1    SVPSERE  BASED(*) BDY(BYTE),                                 00713000
*      2    SVPSE_RE_RESOURCE_NAME CHAR(16), /* IWMSVPSE.412:           00714000
*                                      Resource name                 */ 00715000
*      2    SVPSE_RE_DESCRIPTION CHAR(32), /* IWMSVPSE.418: Resource    00716000
*                                      description                   */ 00717000
*      2    SVPSE_RE_RESERVED(5) CHAR(8); /* IWMSVPSE.424: Reserved  */ 00718000
*                                                                       00719000
*   /*****************************************************************/ 00720000
*   /*                                                               */ 00721000
*   /* IWMSVPSE.566: SVPSE identifier                                */ 00722000
*   /*                                                               */ 00723000
*   /*****************************************************************/ 00724000
*                                                                       00725000
*   DECLARE                                                             00726000
*     SVPSE_ID CHAR(4) CONSTANT('SVPS');                                00727000
*                                                                       00728000
*   /*****************************************************************/ 00729000
*   /*                                                               */ 00730000
*   /* IWMSVPSE.575: Functionality level introduced by WLM in SP510. */ 00731000
*   /* This is set by JBB6604 when no scheduling environments were   */ 00732000
*   /* defined.                                                      */ 00733000
*   /*                                                               */ 00734000
*   /*****************************************************************/ 00735000
*                                                                       00736000
*   DECLARE                                                             00737000
*     SVPSE_LEVEL001 FIXED(8) CONSTANT(1);                              00738000
*                                                                       00739000
*   /*****************************************************************/ 00740000
*   /*                                                               */ 00741000
*   /* IWMSVPSE.584: Functionality level introduced by WLM in OS/390 */ 00742000
*   /* R4                                                            */ 00743000
*   /*                                                               */ 00744000
*   /*****************************************************************/ 00745000
*                                                                       00746000
*   DECLARE                                                             00747000
*     SVPSE_LEVEL004 FIXED(8) CONSTANT(4);                              00748000
*                                                                       00749000
*   /*****************************************************************/ 00750000
*   /*                                                               */ 00751000
*   /* IWMSVPSE.593: WLM version number for OS/390 R4                */ 00752000
*   /*                                                               */ 00753000
*   /*****************************************************************/ 00754000
*                                                                       00755000
*   DECLARE                                                             00756000
*     SVPSE_VER604 FIXED(8) CONSTANT(4);                                00757000
*                                                                       00758000
*   /*****************************************************************/ 00759000
*   /*                                                               */ 00760000
*   /* IWMSVPSE.1111: Functionality level introduced by WLM in OS/390*/ 00761000
*   /* R5                                                    @WLMCSDC*/ 00762000
*   /*                                                               */ 00763000
*   /*****************************************************************/ 00764000
*                                                                       00765000
*   DECLARE                                                             00766000
*     SVPSE_LEVEL005 FIXED(8) CONSTANT(5);                              00767000
*                                                                       00768000
*   /*****************************************************************/ 00769000
*   /*                                                               */ 00770000
*   /* IWMSVPSE.1120: WLM version number for OS/390 R5       @WLMCSDC*/ 00771000
*   /*                                                               */ 00772000
*   /*****************************************************************/ 00773000
*                                                                       00774000
*   DECLARE                                                             00775000
*     SVPSE_VER605 FIXED(8) CONSTANT(5);                                00776000
*                                                                       00777000
*   /*****************************************************************/ 00778000
*   /*                                                               */ 00779000
*   /* IWMSVPSE.1129: Functionality level introduced by WLM in OS/390*/ 00780000
*   /* R6                                                    @WLMCSDC*/ 00781000
*   /*                                                               */ 00782000
*   /*****************************************************************/ 00783000
*                                                                       00784000
*   DECLARE                                                             00785000
*     SVPSE_LEVEL006 FIXED(8) CONSTANT(6);                              00786000
*                                                                       00787000
*   /*****************************************************************/ 00788000
*   /*                                                               */ 00789000
*   /* IWMSVPSE.1138: WLM version number for OS/390 R6       @WLMCSDC*/ 00790000
*   /*                                                               */ 00791000
*   /*****************************************************************/ 00792000
*                                                                       00793000
*   DECLARE                                                             00794000
*     SVPSE_VER606 FIXED(8) CONSTANT(6);                                00795000
*                                                                       00796000
*   /*****************************************************************/ 00797000
*   /*                                                               */ 00798000
*   /* IWMSVPSE.1147: Functionality level introduced by WLM in OS/390*/ 00799000
*   /* R7                                                    @WLMCMQS*/ 00800000
*   /*                                                               */ 00801000
*   /*****************************************************************/ 00802000
*                                                                       00803000
*   DECLARE                                                             00804000
*     SVPSE_LEVEL007 FIXED(8) CONSTANT(7);                              00805000
*                                                                       00806000
*   /*****************************************************************/ 00807000
*   /*                                                               */ 00808000
*   /* IWMSVPSE.1156: WLM version number for OS/390 R7       @WLMCMQS*/ 00809000
*   /*                                                               */ 00810000
*   /*****************************************************************/ 00811000
*                                                                       00812000
*   DECLARE                                                             00813000
*     SVPSE_VER607 FIXED(8) CONSTANT(7);                                00814000
*                                                                       00815000
*   /*****************************************************************/ 00816000
*   /*                                                               */ 00817000
*   /* IWMSVPSE.1158: Functionality level introduced by WLM in OS/390*/ 00818000
*   /* R7                                                    @WLMCTAL*/ 00819000
*   /*                                                               */ 00820000
*   /*****************************************************************/ 00821000
*                                                                       00822000
*   DECLARE                                                             00823000
*     SVPSE_LEVEL008 FIXED(8) CONSTANT(8);                              00824000
*                                                                       00825000
*   /*****************************************************************/ 00826000
*   /*                                                               */ 00827000
*   /* IWMSVPSE.1167: WLM version number for OS/390 R7       @WLMCTAL*/ 00828000
*   /*                                                               */ 00829000
*   /*****************************************************************/ 00830000
*                                                                       00831000
*   DECLARE                                                             00832000
*     SVPSE_VER608 FIXED(8) CONSTANT(8);                                00833000
*                                                                       00834000
*   /*****************************************************************/ 00835000
*   /*                                                               */ 00836000
*   /* IWMSVPSE.1213: Reserved functionality level           @WLMCGMY*/ 00837000
*   /*                                                               */ 00838000
*   /*****************************************************************/ 00839000
*                                                                       00840000
*   DECLARE                                                             00841000
*     SVPSE_LEVEL009 FIXED(8) CONSTANT(9);                              00842000
*                                                                       00843000
*   /*****************************************************************/ 00844000
*   /*                                                               */ 00845000
*   /* IWMSVPSE.1196: Reserved functionality level           @WLMCGMY*/ 00846000
*   /*                                                               */ 00847000
*   /*****************************************************************/ 00848000
*                                                                       00849000
*   DECLARE                                                             00850000
*     SVPSE_LEVEL010 FIXED(8) CONSTANT(10);                             00851000
*                                                                       00852000
*   /*****************************************************************/ 00853000
*   /*                                                               */ 00854000
*   /* IWMSVPSE.1222: Functionality level introduced by WLM in OS/390*/ 00855000
*   /* R10                                                   @WLMCGMY*/ 00856000
*   /*                                                               */ 00857000
*   /*****************************************************************/ 00858000
*                                                                       00859000
*   DECLARE                                                             00860000
*     SVPSE_LEVEL011 FIXED(8) CONSTANT(11);                             00861000
*                                                                       00862000
*   /*****************************************************************/ 00863000
*   /*                                                               */ 00864000
*   /* IWMSVPSE.1198: WLM version number for OS/390 R10      @WLMCGMY*/ 00865000
*   /*                                                               */ 00866000
*   /*****************************************************************/ 00867000
*                                                                       00868000
*   DECLARE                                                             00869000
*     SVPSE_VER703 FIXED(8) CONSTANT(11);                               00870000
*                                                                       00871000
*   /*****************************************************************/ 00872000
*   /*                                                               */ 00873000
*   /* IWMSVPSE.602: Current version level used when checking        */ 00874000
*   /* functionality within WLM product                      @WLMCTAL*/ 00875000
*   /*                                                               */ 00876000
*   /*****************************************************************/ 00877000
*                                                                       00878000
*   DECLARE                                                             00879000
*     SVPSE_CURRENT_VER FIXED(8) CONSTANT(11);                          00880000
*                                                                       00881000
*   /*****************************************************************/ 00882000
*   /*                                                               */ 00883000
*   /* IWMSVPSE.976: SVPSE_SR_RESOURCE_STATE that indicates resource */ 00884000
*   /* is desired to be ON                                           */ 00885000
*   /*                                                               */ 00886000
*   /*****************************************************************/ 00887000
*                                                                       00888000
*   DECLARE                                                             00889000
*     SVPSE_SR_ON FIXED(8) CONSTANT(4);                                 00890000
*                                                                       00891000
*   /*****************************************************************/ 00892000
*   /*                                                               */ 00893000
*   /* IWMSVPSE.982: SVPSE_SR_RESOURCE_STATE that indicates resource */ 00894000
*   /* is desired to be OFF                                          */ 00895000
*   /*                                                               */ 00896000
*   /*****************************************************************/ 00897000
*                                                                       00898000
*   DECLARE                                                             00899000
*     SVPSE_SR_OFF FIXED(8) CONSTANT(8);                                00900000
*                                                                       00901000
*   /*****************************************************************/ 00902000
*   /*                                                               */ 00903000
*   /* IWMSVPSE.1024: SVPSE_SR_RESOURCE_STATE that is reserved       */ 00904000
*   /*                                                               */ 00905000
*   /*****************************************************************/ 00906000
*                                                                       00907000
*   DECLARE                                                             00908000
*     SVPSE_SR_RESERVED FIXED(8) CONSTANT(12);                          00909000
*                                                                       00910000
*   /*****************************************************************/ 00911000
*   /*                                                               */ 00912000
*   /* IWMSVPSE.625: SVPSE section symbolic constant                 */ 00913000
*   /*                                                               */ 00914000
*   /*****************************************************************/ 00915000
*                                                                       00916000
*   DECLARE                                                             00917000
*     SVPSE_SECTION FIXED(8) CONSTANT(1);                               00918000
*                                                                       00919000
*   /*****************************************************************/ 00920000
*   /*                                                               */ 00921000
*   /* IWMSVPSE.634: SVPSE header symbolic constant                  */ 00922000
*   /*                                                               */ 00923000
*   /*****************************************************************/ 00924000
*                                                                       00925000
*   DECLARE                                                             00926000
*     SVPSE_HDR_SECTION FIXED(8) CONSTANT(2);                           00927000
*                                                                       00928000
*   /*****************************************************************/ 00929000
*   /*                                                               */ 00930000
*   /* IWMSVPSE.643: SVPSE SE symbolic constant                      */ 00931000
*   /*                                                               */ 00932000
*   /*****************************************************************/ 00933000
*                                                                       00934000
*   DECLARE                                                             00935000
*     SVPSE_SE_SECTION FIXED(8) CONSTANT(3);                            00936000
*                                                                       00937000
*   /*****************************************************************/ 00938000
*   /*                                                               */ 00939000
*   /* IWMSVPSE.653: SVPSE SR symbolic constant                      */ 00940000
*   /*                                                               */ 00941000
*   /*****************************************************************/ 00942000
*                                                                       00943000
*   DECLARE                                                             00944000
*     SVPSE_SR_SECTION FIXED(8) CONSTANT(4);                            00945000
*                                                                       00946000
*   /*****************************************************************/ 00947000
*   /*                                                               */ 00948000
*   /* IWMSVPSE.663: SVPSE RE symbolic constant                      */ 00949000
*   /*                                                               */ 00950000
*   /*****************************************************************/ 00951000
*                                                                       00952000
*   DECLARE                                                             00953000
*     SVPSE_RE_SECTION FIXED(8) CONSTANT(5);                            00954000
*/* End of PL/X Source                                               */ 00955000
* %IF IWMSVPSE_LIST ^= 'NO' &                                           00956000
*    ZCBPRINT ^= 'NO' %THEN                                             00957000
*   %GOTO IWMSVPSE_4;                                                   00958000
*   @LIST POP NOECHO;                                                   00959000
* %IWMSVPSE_4:;                                                         00960000
* %END;                                                                 00961000
