*                                                                       00012500
* %DCL IWMWRCAA_INCLUDED CHAR EXT;                                      00025000
* %DEACTIVATE IWMWRCAA_INCLUDED;                                        00037500
* %IF IWMWRCAA_INCLUDED = '' %THEN                                      00050000
* %DO;                                                                  00062500
*/* Macro made bi-lingual on 98258. CBGEN compile date 98009         */ 00075000
*% /*                                                                   00087500
         MACRO                                                          00100000
         IWMWRCAA &DSECT=YES,&LIST=YES,&TITLE=YES,&RCAA=YES,           *00115000
               &RCAABMAP=COND,&RCAAICSS=COND,&RCAE=COND,&RCAESCLS=COND,*00130000
               &RCAEIHDR=COND,&RCAERESC=COND,&RCAERST=COND,            *00145000
               &RCAEDIST=COND,&RCAEDELA=COND,&RCAEEELA=COND             00160000
         GBLC  &IWMWRCAA_INCLUDED                                       00175000
         GBLC  &ZCBPRINT                                                00190000
&IWMWRCAA_INCLUDED SETC 'YES'                                           00205000
         AIF   ('&LIST' EQ 'NONE').P0                                   00210000
         AIF   ('&TITLE' EQ 'NO').P5                                    00215000
 TITLE   'IWMWRCAA  - IWMRCOLL Answer Area                        '     00220000
.P5      ANOP                                                           00227500
**/ IWMWRCAA_1:;                                                        00235000
*/****START OF SPECIFICATIONS*****************************************/ 00250000
*/*                                                                  */ 00300000
*/*01* Proprietary statement:                                        */ 00350000
*/*                                                                  */ 00400000
*/*      LICENSED MATERIALS - PROPERTY OF IBM                        */ 00450000
*/*      "RESTRICTED MATERIALS OF IBM"                               */ 00500000
*/*      5647-A01 (C) COPYRIGHT IBM CORP. 1993, 2000                 */ 00550000
*/*                                                                  */ 00700000
*/*01* External classification: PSPI                                 */ 00750000
*/*01* End of External classification                                */ 00800000
*/*                                                                  */ 00850000
*/*01* Status: JBB6600                                       @WLMPMES*/ 00900000
*/*                                                                  */ 00950000
*/*01* Descriptive Name: IWMRCOLL Answer Area                        */ 01000000
*/*                                                                  */ 01050000
*/*02*  Acronym: RCAA and RCAE                                       */ 01100000
*/*                                                                  */ 01150000
*/*01* Macro Name: IWMWRCAA                                          */ 01200000
*/*                                                                  */ 01250000
*/*01* DSECT Name: RCAA, RCAE and others                             */ 01300000
*/*                                                                  */ 01350000
*/*01* Component: Workload Manager (SCWLM)                           */ 01400000
*/*                                                                  */ 01450000
*/*01* Eye-Catcher: RCAA and RCAE                                    */ 01500000
*/*02*  Offset: 0                                                    */ 01550000
*/*02*  Length: CHAR(4)                                              */ 01600000
*/*                                                                  */ 01650000
*/*01* Storage Attributes:                                           */ 01700000
*/*02*  Subpool: Any                                                 */ 01750000
*/*02*  Key: 0                                                       */ 01800000
*/*02*  Residency: Above 16M line                                    */ 01850000
*/*                                                                  */ 01900000
*/*01* Size: Determined at run time                                  */ 01950000
*/*                                                                  */ 02000000
*/*01* Created by: Caller                                            */ 02050000
*/*                                                                  */ 02100000
*/*01* Pointed to by: Pointed to by the ANSAREA_ADDR field in the    */ 02133300
*/*     IWMRCOLL parameter list                                      */ 02166600
*/*                                                                  */ 02200000
*/*01* Serialization: None                                           */ 02250000
*/*                                                                  */ 02300000
*/*01* Function: Contains workload activity reporting information    */ 02350000
*/*                                                                  */ 02400000
*/*01* Restrictions:                                                 */ 02450000
*/*              When used as input to IWMRCOLL:                     */ 02500000
*/*              Storage for answer area must reside in caller's     */ 02550000
*/*              primary or in a dataspace accessible by the current */ 02600000
*/*              unit of work's dispatchable unit access list (DUal) */ 02650000
*/*                                                                  */ 02700000
*/*01* Method of Access:                                             */ 02750000
*/*                                                                  */ 02800000
*/*02*  ASM:                                                         */ 02850000
*/*          Specify: IWMWRCAA                                       */ 02900000
*/*                                                                  */ 02950000
*/*02*  PLX:                                                         */ 03000000
*/*                                                                  */ 03050000
*/*          Declare RCAAPTR                                         */ 03100000
*/*          %INCLUDE SYSLIB(IWMWRCAA)                               */ 03150000
*/*                                                                  */ 03200000
*/*02*  VIA ATTRIBUTE:                                               */ 03250000
*/*                                                                  */ 03300000
*/*          Specify %RCAAVIA = 'YES'                                */ 03350000
*/*          prior to %INCLUDE statement.                            */ 03400000
*/*          Declare RCAAALET.                                       */ 03450000
*/*          For VIA(0) specify %GLOBALARMODE='YES'                  */ 03500000
*/*                                                                  */ 03550000
*/*------------------------------------------------------------------*/ 03566600
*/*                                                                  */ 03583200
*/*01* Change Activity:                                              */ 03600000
*/*                                                                  */ 03625000
*/*    $MAC(IWMWRCAA), COMP(SCWLM): IWMRCOLL Answer Area             */ 03650000
*/*    $L0= WLMI,    HBB5510, 930315 PD88CR: WLM Stage I             */ 03700000
*/*    $P1= PIG3680, HBB5510, 931115 PD88CT: Update comments to      */ 03710000
*/*                                          indicate that response  */ 03720000
*/*                                          data sections may not   */ 03730000
*/*                                          always be present       */ 03740000
*/*    $P2= PIG3908, HBB5510, 931215 PD88CT: OW00691 TRSQ PTM -      */ 03742000
*/*                                          Delete comment line     */ 03744000
*/*                                          continuation characters */ 03746000
*/*                                          that caused ASM errors  */ 03748000
*/*    $P3= PIG5045, HBB5510, 940117 PD88DA: OW01260 - Change        */ 03748300
*/*                                          external classification */ 03748600
*/*                                          to PSPI.                */ 03748900
*/*    $P4= PIG5048, HBB5510, 940125 PD88DA: OW01260 - Clarify       */ 03749200
*/*                                          "pointed to" text.      */ 03749500
*/*    $P5= PIG5137, HBB5510, 940215 PD88CT: OW02199 - Clarify       */ 03756700
*/*                                          "pointed to" text.      */ 03763900
*/*    $P6= PIG5258, HBB5510, 940331 PD88CT: OW02792 - Clarify       */ 03771100
*/*                                          comments for RCAABMAP   */ 03778300
*/*                                          and RCAEPDEL            */ 03785500
*/*    $L1= CAPT2,   HBB5520, 940315 PD88BG: Captured storage        */ 03792700
*/*    OW11082       HBB5520  950206 PD88DA: Update RCAA and RCAE    */ 03795100
*/*                                          version numbers @WA11082*/ 03797500
*/*    $WLMPBPM      HBB6603, 950510 PD88DA: New Workload Reporting  */ 03797900
*/*                                          fields in support of    */ 03798300
*/*                                          HBB6603 line items.     */ 03798700
*/*                                                          @WLMPBPM*/ 03799100
*/*    $WLMPESM      HBB6603, 950510 PD88DA: New Workload Reporting  */ 03799500
*/*                                          fields in support of    */ 03799900
*/*                                          HBB6603 line items.     */ 03800300
*/*                                                          @WLMPESM*/ 03800700
*/*    $WLMPIOP      HBB6603, 950510 PD88DA: New Workload Reporting  */ 03801100
*/*                                          fields in support of    */ 03801500
*/*                                          HBB6603 line items.     */ 03801900
*/*                                                          @WLMPIOP*/ 03802300
*/*    $WLMPASM      HBB6603, 950510 PD88DA: New Workload Reporting  */ 03802700
*/*                                          fields in support of    */ 03803100
*/*                                          HBB6603 line items.     */ 03803500
*/*                                                          @WLMPASM*/ 03803900
*/*    $WLMPENH      HBB6603, 951207 PD88DA: Add new latch waiting   */ 03804300
*/*                                          state to the subsystem  */ 03804700
*/*                                          delay data      @WLMPENH*/ 03805100
*/*                                                                     03805500
*      $DQC0023      HBB6603  960605 PDBB:   John Arwe                  03805900
*                                            Dependent enclaves         03806300
*                                            Break I/O using time into  03806700
*                                            connect and disconnect,    03807100
*                                            resource data length       03807500
*                                            increased to accomodate it 03807900
*      $PQC1647      HBB6603  960627 PDDA:   Tak Chin:  Add RQAAOVEL    03808300
*                                            bit.  On = Pre-HBB6603     03808700
*                                            definition of velocity     03809100
*                                            is being used to manage    03809500
*                                            the system (I/O delay      03809900
*                                            not included in the        03810300
*                                            calculation of velocity)   03810700
*      $PQC2588      HBB6603  960920 PDBZ:   Peter Yocom: Add RCAETOTS  03810900
*                                                                       03811100
*      $WLMPBAT      JBB6604  961202 PDBZ:   Peter Yocom: Add fields    03811300
*                                            new for OS/390 R4          03811500
*      $WLMPBAT      JBB6604  970225 PDBZ:   Peter Yocom: Add           03811600
*                                            RCAETOTDQ                  03811700
*      $PSY0260      JBB6604  970331 PDBZ:   Peter Yocom: Correct       03811800
*                                            comments                   03811900
*      OW26823       JBB6604  970708 PDSN:   Reship to correct SMP      03812500
*                                            error with ow26609 and     03813100
*                                            ow26997                    03813700
*      $WLMPMES      JBB6600  981001 B9HACG: WLMMES - Stephen McGrath   03814300
*                                            Multisystem enclaves       03814900
******END OF SPECIFICATIONS*******************************************/ 03815500
*% /*                                                                   03816700
.P0      ANOP                                                           03818300
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03824400
         AIF   ('&LIST' EQ 'YES').P2                                    03836600
.P1      ANOP                                                           03848800
         PUSH  PRINT                                                    03861000
         PRINT OFF                                                      03873200
.P2      ANOP                                                           03885400
         AIF   ('&RCAA' EQ 'NO').L0002                                  03897600
         AIF   ('&DSECT' EQ 'YES').L0003                                03909800
         AIF   ('&RCAA' NE 'YES').L0002                                 03922000
RCAA     DS    0F        Workload Activity Collection Answer Area       03934200
         AGO   .L0004                                                   03946400
.L0003   ANOP                                                           03958600
RCAA     DSECT           Workload Activity Collection Answer Area       03970800
.L0004   ANOP                                                           03983000
RCAAACRO DS    1CL0004   Acronym                                        03995200
RCAASIZ  DS    1FL4      Size of RCAA and all of its subordinate parts  04007400
RCAAVERS DS    1FL1      Version                                        04019600
RCAAMODE DS    0BL1      System WLM mode                                04031800
RCAAGOAL EQU   X'80'     System is in goal mode                         04044000
RCAACOMP EQU   X'40'     System is in compatibility mode                04056200
RCAAOVEL EQU   X'20'     System is calculating velocity without using  *04062300
                         I/O delays.                                    04068400
RCAARSV  EQU   X'1F'     Reserved                                       04074500
         ORG   RCAAMODE+X'00000001'                                     04080600
RCAAOPT  DS    1CL0002   IEAOPTxx suffix                                04092800
RCAATMI  DS    1BL8      Local time reporting was last initialized     *04105000
                         (STCK format)                                  04117200
RCAATMR  DS    1BL8      Local time this RCAA data was collected (STCK *04129400
                         format)                                        04141600
RCAAGINF DS    0CL0032   Goal mode information                          04153800
RCAAPNAM DS    1CL0008   Policy name                                    04166000
RCAAPTM  DS    1BL8      Local time policy was activated (STCK format)  04178200
RCAAUID  DS    1CL0008   Userid of person who activated policy          04190400
RCAAPSYS DS    1CL0008   System that policy was activated on            04202600
RCAACINF DS    0CL0024   Compatibility mode information                 04214800
RCAAIPS  DS    1CL0002   IEAIPSxx suffix                                04227000
RCAAICS  DS    1CL0002   IEAICSxx suffix                                04239200
RCAASCO  DS    0CL0020   Service coefficients                           04251400
RCAAIPC  DS    1CL0004   CPU service coefficient                        04263600
RCAAIPI  DS    1CL0004   I/O service coefficient                        04275800
RCAAIPB  DS    1CL0004   SRB service coefficient                        04288000
RCAAIPM  DS    1CL0008   MSO service coefficient                        04300200
RCAANTVL DS    1FL4      Current sample interval (in milliseconds).    *04312400
                         This is the frequency with which WLM samples  *04324600
                         delays reported in the RCAA                    04336800
RCAANTV# DS    1FL4      Total number of times WLM sampling code ran.  *04349000
                         A monitor issuing successive calls to         *04361200
                         IWMRCOLL should not assume that WLM sampling  *04373400
                         code ran at the interval specified by         *04385600
                         RCAANTVL between its calls. This field can be *04397800
                         used to translate sampled state data into     *04410000
                         actual percentages of time.                    04422200
RCAABMPL DS    1FL2      Length of an entry in the response time       *04434400
                         distribution mapping array                     04446600
RCAABMP# DS    1FL2      Number of response time distribution buckets   04458800
RCAABMPO DS    1FL4      Offset from RCAA to response time             *04471000
                         distribution mapping array (RCAABMAP)          04483200
RCAASCAL DS    1FL2      Length of one RCAE workload activity entry in *04495400
                         the RCAASCOF array                             04507600
RCAASCA# DS    1FL2      Number of entries in RCAASCOF array. In       *04519800
                         compatibility mode this is one + the highest  *04532000
                         PGN, RPGN, or OPGN value. (The extra entry is *04544200
                         for PGN 0.) In goal mode, this is the number  *04556400
                         of service classes returned in IWMSVPOL by    *04568600
                         IWMPQRY.                                       04580800
RCAASCOF DS    1FL4      Offset from RCAA to array of RCAE entries. In *04593000
                         goal mode these entries represent service     *04605200
                         classes. In compatibility mode they represent *04617400
                         either PGNs or RPGNs.                          04629600
RCAARCAL DS    1FL2      Length of one RCAE workload activity entry in *04641800
                         the RCAARCOF array                             04654000
RCAARCA# DS    1FL2      Number of entries in RCAARCOF array. In       *04666200
                         compatibility mode this field is always zero. *04678400
                         In goal mode this field is the number of      *04690600
                         report classes returned in IWMSVPOL by        *04702800
                         IWMPQRY                                        04715000
RCAARCOF DS    1FL4      Offset from RCAA to array of RCAE entries.    *04727200
                         Only valid in goal mode.                       04739400
RCAA_LEN EQU   *-RCAA                                                   04751600
.L0002   ANOP                                                           04763800
         AIF   ('&RCAABMAP' EQ 'NO').L0005                              04776000
         AIF   ('&DSECT' EQ 'YES').L0006                                04788200
         AIF   ('&RCAABMAP' NE 'YES').L0005                             04800400
RCAABMAP DS    0F        RCAA response time distribution map array      04812600
         AGO   .L0007                                                   04824800
.L0006   ANOP                                                           04837000
RCAABMAP DSECT           RCAA response time distribution map array      04849200
.L0007   ANOP                                                           04861400
RCAABENT DS    1FL4      Response time distribution bucket mappings.   *04873600
                         Each word defines a maximum % of a goal (ie.  *04885800
                         50, 70, 100, etc.) When used in conjunction   *04898000
                         with an RCAEDENT, a monitor product can show  *04910200
                         the number of transactions that completed in  *04922400
                         a percentage of a goal. The last entry in the *04934600
                         array contains X'FFFFFFFF'. This indicates    *04946800
                         that this bucket includes all transactions    *04959000
                         that completed with longer response times     *04971200
                         than the previous bucket.                      04983400
RCAABMAP_LEN EQU *-RCAABMAP                                             04995600
.L0005   ANOP                                                           05007800
         AIF   ('&RCAAICSS' EQ 'NO').L0008                              05020000
         AIF   ('&DSECT' EQ 'YES').L0009                                05032200
         AIF   ('&RCAAICSS' NE 'YES').L0008                             05044400
RCAAICSS DS    0F        RCAA ICS information - provided in            *05056600
                         compatibility mode only                        05068800
         AGO   .L000A                                                   05081000
.L0009   ANOP                                                           05093200
RCAAICSS DSECT           RCAA ICS information - provided in            *05105400
                         compatibility mode only                        05117600
.L000A   ANOP                                                           05129800
RCAAICSX DS    1FL4      Offset from RCAAICSS to symbol table index    *05142000
                         array. Mapped by IRAICSM                       05154200
RCAAICSM DS    1FL4      Offset from RCAAICSS to symbol table. Mapped  *05166400
                         by IRAICSM                                     05178600
RCAAICSL DS    1FL4      Length of index array and symbol table         05190800
RCAAICSS_LEN EQU *-RCAAICSS                                             05203000
.L0008   ANOP                                                           05215200
         AIF   ('&RCAE' EQ 'NO').L000B                                  05227400
         AIF   ('&DSECT' EQ 'YES').L000C                                05239600
         AIF   ('&RCAE' NE 'YES').L000B                                 05251800
RCAE     DS    0D        Workload Activity Collection Entry (RCAE).    *05257900
                         Pointed to by RCAASCOF and RCAARCOF which are *05264000
                         within the RCAA.                               05270100
         AGO   .L000D                                                   05276200
.L000C   ANOP                                                           05288400
RCAE     DSECT           Workload Activity Collection Entry (RCAE).    *05294500
                         Pointed to by RCAASCOF and RCAARCOF which are *05300600
                         within the RCAA.                               05306700
.L000D   ANOP                                                           05312800
RCAEACRO DS    1CL0004   Acronym                                        05325000
RCAEVERS DS    1FL1      Version                                        05337200
RCAETYPE DS    0BL1      What this RCAE represents                      05349400
RCAEPGN  EQU   X'80'     Performance group                              05361600
RCAERPGN EQU   X'40'     Report performance group                       05373800
RCAESCL  EQU   X'20'     Service class                                  05386000
RCAERCL  EQU   X'10'     Report class                                   05398200
RCAENIU  EQU   X'08'     This RCAE is not in use. This indicator is    *05410400
                         set in compatibility mode for those entries   *05422600
                         that are not validly defined in either the    *05434800
                         IPS or ICS                                     05447000
RCAEHRS1 EQU   X'07'     Reserved                                       05459200
         ORG   RCAETYPE+X'00000001'                                     05471400
RCAECLX  DS    1FL2      RCAE index. In goal mode, this is the index   *05483600
                         into the service class or report class list   *05495800
                         returned by IWMPQRY. In compatibility mode,   *05508000
                         this is the PGN or RPGN number. Note 0 is a   *05520200
                         valid PGN number.                              05532400
RCAEHRS2 DS    1CL0002   Reserved                                       05544600
RCAEPER# DS    1FL2      Number of period data entries for this RCAE    05556800
RCAEPERL DS    1FL4      Length of all of the period data associated   *05569000
                         with this RCAE entry.                          05581200
RCAEPERO DS    1FL4      Offset from RCAE to first period's data. Zero *05593400
                         is only valid in compatibility mode and       *05605600
                         indicates that the PGN or RPGN was not        *05617800
                         defined in the IPS or ICS                      05630000
RCAESCL# DS    1FL2      Number of entries in the RCAESCLS array. That *05642200
                         is, the number of service classes being       *05654400
                         served by one or more address spaces in the   *05666600
                         service class specified by RCAECLX. Valid     *05678800
                         only in goal mode.                             05691000
RCAESCLL DS    1FL2      Length of a single entry (RCAESCLS) in the    *05703200
                         server data array.                             05715400
RCAESCLO DS    1FL4      Offset from RCAE to RCAESCLS array. Zero      *05727600
                         indicates there is no server data available   *05739800
                         for this service class                         05752000
RCAEHRS3 DS    1CL0004   Reserved                                       05764200
RCAE_LEN EQU   *-RCAE                                                   05776400
.L000B   ANOP                                                           05788600
         AIF   ('&RCAESCLS' EQ 'NO').L000E                              05800800
         AIF   ('&DSECT' EQ 'YES').L000F                                05813000
         AIF   ('&RCAESCLS' NE 'YES').L000E                             05825200
RCAESCLS DS    0D        RCAE - An entry in the service classes served *05837400
                         array                                          05849600
         AGO   .L0010                                                   05861800
.L000F   ANOP                                                           05874000
RCAESCLS DSECT           RCAE - An entry in the service classes served *05886200
                         array                                          05898400
.L0010   ANOP                                                           05910600
RCAESCSN DS    1FL2      Index of service class being served            05922800
RCAERS1  DS    1CL0002   Reserved                                       05935000
RCAESCS# DS    1FL4      Number of times an address space running with *05947200
                         this service class (RCAECLX) served service   *05959400
                         class (RCAESCSN).                              05971600
RCAESCLS_LEN EQU *-RCAESCLS                                             05983800
.L000E   ANOP                                                           05996000
         AIF   ('&RCAEIHDR' EQ 'NO').L0011                              06008200
         AIF   ('&DSECT' EQ 'YES').L0012                                06020400
         AIF   ('&RCAEIHDR' NE 'YES').L0011                             06032600
RCAEIHDR DS    0D        RCAE - period header                           06044800
         AGO   .L0013                                                   06057000
.L0012   ANOP                                                           06069200
RCAEIHDR DSECT           RCAE - period header                           06081400
.L0013   ANOP                                                           06093600
RCAEPERI DS    1FL1      Period number                                  06105800
RCAEIRSV DS    1CL0001   Reserved                                       06118000
RCAECOMP DS    0CL0002   Compatibility mode data                        06130200
RCAEDMN  DS    1FL1      Domain level                                   06142400
RCAETSGN DS    1FL1      Timeslice group number                         06154600
RCAEIRLN DS    1FL2      Length of resource data section (RCAERESC)     06166800
RCAEIRS1 DS    1CL0002   Reserved                                       06179000
RCAEIROF DS    1FL4      Offset from RCAEIHDR to resource data. Zero   *06191200
                         indicates there is no resource data for this  *06203400
                         period                                         06215600
RCAEIPLN DS    1FL2      Length of response time section (RCAERST)      06227800
RCAEIRS2 DS    1CL0002   Reserved                                       06240000
RCAEIPOF DS    1FL4      Offset from RCAEIHDR to response time data.   *06246100
                         Zero indicates that there is no response time *06252200
                         data available for this period                 06258300
RCAEIGLN DS    1FL2      Length of general execution delay section     *06264400
                         (RCAEDELA)                                     06276600
RCAEIRS3 DS    1CL0002   Reserved                                       06288800
RCAEIGOF DS    1FL4      Offset from RCAEIHDR to general execution     *06301000
                         delay data. Zero if no general execution      *06313200
                         delay data is available for this period        06325400
RCAEID#  DS    1FL2      Number of entries in the response time        *06337600
                         distribution section (RCAEDIST). Zero if      *06349800
                         there is no distribution for this period.      06362000
RCAEIDLN DS    1FL2      Length of response time distribution section  *06374200
                         (RCAEDIST)                                     06386400
RCAEIDOF DS    1FL4      Offset from RCAEIHDR to response time         *06398600
                         distribution data. Zero when in compatibility *06410800
                         mode. When in goal mode, this field will be   *06423000
                         zero for report classes, when there are no    *06430300
                         response time goals specified, or when no     *06437600
                         response time data is available for this      *06444900
                         period                                         06452200
RCAEIS#  DS    1FL2      Number of entries in the subsystem work       *06459600
                         manager delay section (RCAEEELA). Zero if     *06471800
                         there are no subsystem work manager delays    *06484000
                         for this period.                               06496200
RCAEISLN DS    1FL2      Length of subsystem work manager delay        *06508400
                         section (RCAEEELA)                             06520600
RCAEISOF DS    1FL4      Offset from RCAEIHDR to subsystem work        *06532800
                         manager delay data. Zero indicates there is   *06545000
                         no subsystem work manager delay data for this *06557200
                         period                                         06569400
RCAEINXP DS    1FL4      Offset from RCAEIHDR to next period's data or *06581600
                         zero if last period                            06593800
RCAEIHDR_LEN EQU *-RCAEIHDR                                             06606000
.L0011   ANOP                                                           06618200
         AIF   ('&RCAERESC' EQ 'NO').L0014                              06630400
         AIF   ('&DSECT' EQ 'YES').L0015                                06642600
         AIF   ('&RCAERESC' NE 'YES').L0014                             06654800
RCAERESC DS    0D        RCAE - resource data. All service units are   *06667000
                         weighted by the coefficients specified in     *06679200
                         RCAASCO for compatibility mode or the active  *06691400
                         policy in goal mode                            06703600
         AGO   .L0016                                                   06715800
.L0015   ANOP                                                           06728000
RCAERESC DSECT           RCAE - resource data. All service units are   *06740200
                         weighted by the coefficients specified in     *06752400
                         RCAASCO for compatibility mode or the active  *06764600
                         policy in goal mode                            06776800
.L0016   ANOP                                                           06789000
RCAESRV  DS    0CL0008   Total service units for period                 06801200
RCAESRV1 DS    1FL4      Total service units for period - word 1        06813400
RCAESRV2 DS    1FL4      Total service units for period - word 2        06825600
RCAECPU  DS    0CL0008   Total CPU service units                        06837800
RCAECPU1 DS    1FL4      Total CPU service units - word 1               06850000
RCAECPU2 DS    1FL4      Total CPU service units - word 2               06862200
RCAEIOC  DS    0CL0008   Total I/O service units                        06874400
RCAEIOC1 DS    1FL4      Total I/O service units - word 1               06886600
RCAEIOC2 DS    1FL4      Total I/O service units - word 2               06898800
RCAEMSO  DS    0CL0008   Total MSO service units                        06911000
RCAEMSO1 DS    1FL4      Total MSO service units - word 1               06923200
RCAEMSO2 DS    1FL4      Total MSO service units - word 2               06935400
RCAESRB  DS    0CL0008   Total SRB service units                        06947600
RCAESRB1 DS    1FL4      Total SRB service units - word 1               06959800
RCAESRB2 DS    1FL4      Total SRB service units - word 2               06972000
RCAEPIR  DS    0CL0008   Total page-ins count                           06984200
RCAEPIR1 DS    1FL4      Total page-ins count - word 1                  06996400
RCAEPIR2 DS    1FL4      Total page-ins count - word 2                  07008600
RCAEHSP  DS    0CL0008   Total hiperspace page-ins count - word 2       07020800
RCAEHSP1 DS    1FL4      Total hiperspace page-ins count - word 1       07033000
RCAEHSP2 DS    1FL4      Total hiperspace page-ins count - word 2       07045200
RCAEBPIR DS    0CL0008   Total block page-ins from aux                  07057400
RCAEBPI1 DS    1FL4      Total block page-ins from aux - word 1         07069600
RCAEBPI2 DS    1FL4      Total block page-ins from aux - word 2         07081800
RCAEPIE  DS    0CL0008   Total page-ins from expanded count             07094000
RCAEPIE1 DS    1FL4      Total page-ins from expanded count - word 1    07106200
RCAEPIE2 DS    1FL4      Total page-ins from expanded count - word 2    07118400
RCAEBPIE DS    0CL0008   Total block page-ins from expanded count       07130600
RCAEBPE1 DS    1FL4      Total block page-ins from expanded count -    *07142800
                         word 1                                         07155000
RCAEBPE2 DS    1FL4      Total block page-ins from expanded count -    *07167200
                         word 2                                         07179400
RCAEBKIA DS    0CL0008   Total aux blocks paged in                      07191600
RCAEBKA1 DS    1FL4      Total aux blocks paged in - word 1             07203800
RCAEBKA2 DS    1FL4      Total aux blocks paged in - word 2             07216000
RCAEBKIE DS    0CL0008   Total expanded blocks paged in                 07228200
RCAEBKE1 DS    1FL4      Total expanded blocks paged in - word 1        07240400
RCAEBKE2 DS    1FL4      Total expanded blocks paged in - word 2        07252600
RCAEPRS  DS    0CL0008   Total page residency time (in 1024            *07264800
                         microsecond units)                             07277000
RCAEPRS1 DS    1FL4      Total page residency time - word 1             07289200
RCAEPRS2 DS    1FL4      Total page residency time - word 2             07301400
RCAEERS  DS    0CL0008   Total expanded page residency time (in 1024   *07313600
                         microsecond units)                             07325800
RCAEERS1 DS    1FL4      Total expanded page residency time - word 1    07338000
RCAEERS2 DS    1FL4      Total expanded page residency time - word 2    07350200
RCAETRR  DS    0CL0008   Total in-storage residency time (in 1024      *07362400
                         microsecond units)                             07374600
RCAETRR1 DS    1FL4      Total in-storage residency time - word 1       07386800
RCAETRR2 DS    1FL4      Total in-storage residency time - word 2       07399000
RCAETAT  DS    0CL0008   Total transaction active time (in 1024        *07411200
                         microsecond units)                             07423400
RCAETAT1 DS    1FL4      Total transaction active time - word 1         07435600
RCAETAT2 DS    1FL4      Total transaction active time - word 2         07447800
RCAERCT  DS    1FL4      Total RCT time (in microsecond units)          07460000
RCAEIIT  DS    1FL4      Total I/O interupt time (in microsecond       *07472200
                         units)                                         07484400
RCAEHST  DS    1FL4      Total hiperspace service time (in microsecond *07496600
                         units)                                         07508800
RCAESWC  DS    1FL4      Total swap count                               07521000
RCAECRMS DS    1FL4      Total hiperspace eso read miss count           07533200
RCAESPPI DS    0CL0008   Total shared page-ins from aux count           07534100
RCAESPP1 DS    1FL4      Total shared page-ins from aux count - word 1  07535000
RCAESPP2 DS    1FL4      Total shared page-ins from aux count - word 2  07535900
RCAESPEI DS    0CL0008   Total shared page-ins from expanded count      07536800
RCAESPE1 DS    1FL4      Total shared page-ins from expanded count -   *07537700
                         word 1                                         07538600
RCAESPE2 DS    1FL4      Total shared page-ins from expanded count -   *07539500
                         word 2                                         07540400
RCAESPRS DS    0CL0008   Total shared page residency time (in 1024     *07541300
                         microsecond units)                             07542200
RCAESPRS1 DS   1FL4      Total shared page residency time - word 1      07543100
RCAESPRS2 DS   1FL4      Total shared page residency time - word 2      07544000
RCAEIOCT DS    0CL0008   Total DASD I/O connect time in 128            *07544600
                         microsecond units                              07545200
RCAEIOCT1 DS   1FL4      word 1                                         07545800
RCAEIOCT2 DS   1FL4      word 2                                         07546400
RCAEIOWT DS    0CL0008   Total DASD I/O wait time (Queue time +        *07547000
                         Pending time in 128 microsecond units) Note:  *07547600
                         Does not include IOS queue time.               07548200
RCAEIOWT1 DS   1FL4      word 1                                         07548800
RCAEIOWT2 DS   1FL4      word 2                                         07549400
RCAEIORC DS    1FL4      Total DASD I/O count. This can be used with   *07550000
                         fields RCAEIOCT, RCAEIODT, RCAEIOWT, RCAEIOST *07550600
                         to determine average DASD response time for   *07551200
                         the period.                                    07551800
RCAERRS1 DS    1CL0004   Reserved                                       07552400
RCAEIODT DS    0CL0008   Total DASD I/O disconnect time in 128         *07553000
                         microsecond units                              07553600
RCAEIODT1 DS   1FL4      word 1                                         07554200
RCAEIODT2 DS   1FL4      word 2                                         07554800
RCAEIOST DS    0CL0008   Total DASD IOS queue time in 128 microsecond  *07554900
                         units                                          07555000
RCAEIOST1 DS   1FL4      RCAEIOST word 1                                07555100
RCAEIOST2 DS   1FL4      RCAEIOST word 2                                07555200
         DS    1CL0008   Reserved                                       07555300
RCAEIEAT DS    0CL0008   Independent enclave total transaction active  *07555400
                         time (in 1024 microsecond units) for enclaves *07555500
                         that originated on this system.                07555600
RCAEIEA1 DS    1FL4      Independent enclave total transaction active  *07555700
                         time - word 1                                  07555800
RCAEIEA2 DS    1FL4      Independent enclave total transaction active  *07555900
                         time - word 2                                  07556000
RCAEXEAT DS    0CL0008   Exported enclave total transaction active     *07556100
                         time (in 1024 microsecond units).              07556200
RCAEXEA1 DS    1FL4      Exported enclave total transaction active     *07556300
                         time - word 1                                  07556400
RCAEXEA2 DS    1FL4      Exported enclave total transaction active     *07556500
                         time - word 2                                  07556600
RCAEFEAT DS    0CL0008   Foreign enclave total transaction active time *07556700
                         (in 1024 microsecond units).                   07556800
RCAEFEA1 DS    1FL4      Foreign enclave total transaction active time *07556900
                         - word 1                                       07557000
RCAEFEA2 DS    1FL4      Foreign enclave total transaction active time *07557100
                         - word 2                                       07557200
         DS    1CL0032   Reserved                                       07557300
RCAERESC_LEN EQU *-RCAERESC                                             07557400
.L0014   ANOP                                                           07557600
         AIF   ('&RCAERST' EQ 'NO').L0017                               07569800
         AIF   ('&DSECT' EQ 'YES').L0018                                07582000
         AIF   ('&RCAERST' NE 'YES').L0017                              07594200
RCAERST  DS    0D        RCAE - response time data                      07606400
         AGO   .L0019                                                   07618600
.L0018   ANOP                                                           07630800
RCAERST  DSECT           RCAE - response time data                      07643000
.L0019   ANOP                                                           07655200
RCAERCP  DS    1FL4      Count of transaction completions for this     *07667400
                         period. In compatibility mode this is the     *07679600
                         TSO, APPC, batch, etc. transactions. In goal  *07691800
                         mode, this field also includes transaction    *07704000
                         completions reported by subsystem work        *07716200
                         managers via the IWMRPT service                07728400
RCAEARCP DS    1FL4      Count of transactions that completed          *07740600
                         abnormally as reported by subsystem work      *07752800
                         managers. This value is not part of RCAERCP   *07765000
                         and should not be used for response time      *07777200
                         calculations.                                  07789400
RCAENCP  DS    1FL4      Count of times an execution phase has         *07801600
                         completed by the subsystem work managers via  *07813800
                         the IWMMNTFY service.                          07826000
RCAEANCP DS    1FL4      Count of transactions that completed their    *07838200
                         execution phase abnormally as reported by     *07850400
                         subsystem work manager. This value is not     *07862600
                         part of RCANCP and should not be used for     *07874800
                         execution response time calculations           07887000
RCAETET  DS    0CL0008   Total transaction elapsed time (in 1024       *07899200
                         microsecond units)                             07911400
RCAETET1 DS    1FL4      Total transaction elapsed time - word 1        07923600
RCAETET2 DS    1FL4      Total transaction elapsed time - word 2        07935800
RCAEXET  DS    0CL0008   Total transaction execution time - (in 1024   *07948000
                         microsecond units). Available in goal mode    *07960200
                         only                                           07972400
RCAEXET1 DS    1FL4      Total transaction execution time - word 1      07984600
RCAEXET2 DS    1FL4      Total transaction execution time - word 2      07996800
RCAESTT  DS    0CL0008   Total system time (in 1024 microsecond        *08009000
                         units). Available in compatibility mode only   08021200
RCAESTT1 DS    1FL4      Total system time - word 1                     08033400
RCAESTT2 DS    1FL4      Total system time - word 2                     08045600
RCAEETS  DS    0CL0008   Sum of transaction elapsed times squared      *08057800
                         (1024 microsec)                                08070000
RCAEETS1 DS    1FL4      Sum of transaction elapsed times squared -    *08082200
                         word 1                                         08094400
RCAEETS2 DS    1FL4      Sum of transaction elapsed times squared -    *08106600
                         word 2                                         08118800
RCAEQDT  DS    0CL0008   Total queue delay time. For batch jobs this   *08119100
                         is the time jobs spent on the job queue while *08119400
                         eligible to run on some system. In other      *08119700
                         words this is the time jobs spent waiting for *08120000
                         an initiator. For TSO users, this time can be *08120300
                         a portion of the LOGON process. For APPC this *08120600
                         is the time an APPC request spends on an APPC *08120900
                         queue. (1024 microsec)                         08121200
RCAEQDT1 DS    1FL4      RCAEQDT Word 1                                 08121500
RCAEQDT2 DS    1FL4      RCAEQDT Word 2                                 08121800
RCAEADT  DS    0CL0008   Total time batch jobs were ineligible to run  *08122100
                         because a resource the job had affinity to    *08122400
                         was unavailable. Only applies to batch work.  *08122700
                         Zero for other work types. (1024 microsec)     08123000
RCAEADT1 DS    1FL4      RCAEADT word 1                                 08123300
RCAEADT2 DS    1FL4      RCAEADT word 2                                 08123600
RCAECVT  DS    0CL0008   Total time batch jobs spent in JCL            *08123900
                         conversion. Only applies to batch work. Zero  *08124200
                         for other work types. (1024 microsec)          08124500
RCAECVT1 DS    1FL4      RCAECVT word 1                                 08124800
RCAECVT2 DS    1FL4      RCAECVT word 2                                 08125100
RCAEIQT  DS    0CL0008   Total time batch jobs spend on job queue      *08125400
                         (after JCL conversion) while ineligible to    *08125700
                         run on any system for reasons other than      *08126000
                         resource affinities. For example this time    *08126300
                         can include operator hold of a job, delays    *08126600
                         due to duplicate job names, delays due to job *08126900
                         class limits. Only applies to batch work.     *08127200
                         Zero for other work types. (1024 microsec)     08127500
RCAEIQT1 DS    1FL4      RCAEIQT word 1                                 08127800
RCAEIQT2 DS    1FL4      RCAEIQT word 2                                 08128100
         DS    1CL0008   Reserved                                       08128400
RCAERST_LEN EQU *-RCAERST                                               08131000
.L0017   ANOP                                                           08143200
         AIF   ('&RCAEDIST' EQ 'NO').L001A                              08155400
         AIF   ('&DSECT' EQ 'YES').L001B                                08167600
         AIF   ('&RCAEDIST' NE 'YES').L001A                             08179800
RCAEDIST DS    0F        RCAE - response time distribution array        08192000
         AGO   .L001C                                                   08204200
.L001B   ANOP                                                           08216400
RCAEDIST DSECT           RCAE - response time distribution array        08228600
.L001C   ANOP                                                           08240800
RCAEDENT DS    1FL4      An entry in the RCAE response time            *08253000
                         distribution array. Each entry in the array   *08265200
                         contains the number of transactions that      *08277400
                         completed in the time period represented by   *08289600
                         that entry. When used with the response time  *08301800
                         distribution bucket mapping (RCAABMAP),       *08314000
                         monitors can construct a distribution of      *08326200
                         completions verses goals specified.            08338400
RCAEDIST_LEN EQU *-RCAEDIST                                             08350600
.L001A   ANOP                                                           08362800
         AIF   ('&RCAEDELA' EQ 'NO').L001D                              08375000
         AIF   ('&DSECT' EQ 'YES').L001E                                08387200
         AIF   ('&RCAEDELA' NE 'YES').L001D                             08399400
RCAEDELA DS    0D        RCAE - general execution delay data            08411600
         AGO   .L001F                                                   08423800
.L001E   ANOP                                                           08436000
RCAEDELA DSECT           RCAE - general execution delay data            08448200
.L001F   ANOP                                                           08460400
RCAEVELC DS    0CL0008   Execution velocity data                        08472600
RCAECUSE DS    1FL4      CPU using samples                              08484800
RCAETOTD DS    1FL4      Total delay samples used in SRM's execution   *08497000
                         velocity calculation                           08509200
RCAEEDLA DS    0CL0048   General execution delays included in          *08521400
                         RCAETOTD. Each dispatchable unit of work      *08533600
                         sampled can increase one of the CPU or paging *08545800
                         delay samples                                  08558000
RCAECDEL DS    1FL4      CPU delay. A TCB or SRB is waiting to be      *08570200
                         dispatched (other than the first in-line      *08582400
                         behind sampler) or a TCB is waiting for local *08594600
                         lock.                                          08606800
RCAECCAP DS    1FL4      CPU capping delay. A TCB or SRB is marked     *08619000
                         non-dispatchable because a resource group     *08631200
                         maximum is being enforced. Note that RCAECCAP *08643400
                         is NOT a subset of RCAECDEL. Only valid in    *08655600
                         goal mode.                                     08667800
RCAESWIN DS    1FL4      Swap-in delay. Swap-in has started, but not   *08680000
                         completed                                      08692200
RCAEDMPL DS    1FL4      MPL delay. Ready, but swap-in has not started  08704400
RCAEAPRV DS    1FL4      Aux page from private                          08716600
RCAEACOM DS    1FL4      Aux page from common                           08728800
RCAEXM   DS    1FL4      Aux page from cross memory                     08741000
RCAEVIO  DS    1FL4      Aux page from vio                              08753200
RCAEHSPC DS    1FL4      Aux page from standard hiperspaces             08765400
RCAECHS  DS    1FL4      Aux page from eso hiperspaces. Valid in goal  *08777600
                         mode only.                                     08789800
RCAEASPD DS    1FL4      Shared paging from aux delay                   08797900
RCAEDRS1 DS    1CL0004   Reserved                                       08806000
RCAEUNKN DS    1FL4      Unknown. Dispatchable unit or address space   *08814200
                         is waiting, but none of the above reasons     *08826400
                         apply. These samples are not included in      *08838600
                         RCAETOTD                                       08850800
RCAEIDLE DS    1FL4      Idle. Work is in STIMER wait, TSO terminal    *08863000
                         wait, APPC wait, or is an initiator waiting   *08875200
                         for work. These samples are not included in   *08887400
                         RCAETOTD                                       08899600
RCAEPDEL DS    1FL4      Resource group capping delay. Group maximum   *08911800
                         is being enforced for work in this service    *08924000
                         class. This delay only accounts for address   *08930100
                         spaces in the service class that are          *08936200
                         currently swapped in. Only valid in goal      *08942300
                         mode. These samples are not included in       *08948400
                         RCAETOTD                                       08954500
RCAEPQUI DS    1FL4      Quiesce delay. Some work in this service      *08960600
                         class has been reset via the RESET            *08972800
                         xxx,QUIESCE command. Only valid in goal mode. *08985000
                         These samples are not included in RCAETOTD     08997200
RCAESAC  DS    1FL4      Sampled Address space count. Number of        *09009400
                         address spaces that contributed delay and     *09021600
                         using samples to this service class. These    *09033800
                         samples are not included in RCAETOTD. Also    *09037100
                         included are enclaves that contributed delay  *09040400
                         and using samples                              09043700
RCAETOTU DS    1FL4      Total usings. Velocity should be calculated   *09047200
                         as RCAETOTU/(RCAETOTD+RCAETOTU)                09048400
RCAEIOU  DS    1FL4      Total I/O usings. These are included in       *09049600
                         RCAETOTU. Only non-paging DASD I/O can        *09050800
                         contribute to I/O usings                       09052000
RCAEEDL2 DS    0CL0028   Second set of execution delays included in    *09053200
                         RCAETOTD.                                      09054400
RCAEIOD  DS    1FL4      DASD I/O delay samples                         09055600
RCAEQ    DS    1FL4      Queue delay samples. Work is waiting for a    *09056800
                         server.                                        09058000
RCAESPRV DS    1FL4      Server private area paging delay samples.      09059200
RCAESVIO DS    1FL4      Server space VIO paging delay samples.         09060400
RCAESHSP DS    1FL4      Server hiperspace paging delay samples.        09061600
RCAESMPL DS    1FL4      Server MPL delay samples                       09062800
RCAESSWI DS    1FL4      Server swap-in delay samples.                  09064000
RCAETOTS DS    0CL0008   Total execution samples. It is the sum of     *09064300
                         RCAETOTU, RCAETOTD, RCAEUNKN, RCAEIDLE. Also  *09064600
                         always includes I/O using/delay samples       *09064900
                         whether or not I/O samples are included in    *09065200
                         RCAETOTU/RCAETOTD                              09065500
RCAETOTS1 DS   1FL4      RCAETOTS Word 1                                09065800
RCAETOTS2 DS   1FL4      RCAETOTS Word 2                                09066100
RCAENDIO DS    1FL4      Non-DASD I/O using or delay samples.           09066400
RCAETOTDQ DS   1FL4      Total delay samples always including batch    *09066700
                         queue delay. For service classes that contain *09067000
                         batch jobs that were not run in WLM managed   *09067300
                         initiators the batch queue delay samples are  *09067600
                         derived from the measured batch queue delay   *09067900
                         time. For service classes that contain only   *09068100
                         jobs that ran in WLM managed initiators this  *09068300
                         value is the same as RCEATOTD. RCAETOTDQ can  *09068500
                         be used as a migration aid to determine what  *09068700
                         a batch service class period's velocity will   09068900
*                        be if all its jobs are run in WLM managed     *09069100
                         initators                                      09069300
RCAEDRS3 DS    1CL0012   Reserved                                       09070000
RCAEDELA_LEN EQU *-RCAEDELA                                             09070400
.L001D   ANOP                                                           09082600
         AIF   ('&RCAEEELA' EQ 'NO').L0020                              09094800
         AIF   ('&DSECT' EQ 'YES').L0021                                09107000
         AIF   ('&RCAEEELA' NE 'YES').L0020                             09119200
RCAEEELA DS    0D        RCAE - Subsystem work manager delays           09131400
         AGO   .L0022                                                   09143600
.L0021   ANOP                                                           09155800
RCAEEELA DSECT           RCAE - Subsystem work manager delays           09168000
.L0022   ANOP                                                           09180200
RCAEEENT DS    0CL0096   An entry in the subsystem work manager delay  *09192400
                         array                                          09204600
RCAESTYP DS    1CL0004   Subsystem type, as used in the classification *09216800
                         rules specified in the WLM administrative     *09229000
                         application. The subsystem's documentation    *09241200
                         should explain the meaning that the product   *09253400
                         attributes to the various states               09265600
RCAEEFLG DS    0BL1      Flags                                          09277800
RCAEDBE  EQU   X'80'     Represents states sampled in the begin to end *09290000
                         phase of a transaction                         09302200
RCAEEXEC EQU   X'40'     Represents states sampled in the execution    *09314400
                         phase of a transaction                         09326600
RCAESRS1 EQU   X'3F'     Reserved                                       09338800
         ORG   RCAEEFLG+X'00000001'                                     09351000
RCAESRS2 DS    1CL0003   Reserved                                       09363200
RCAEESS# DS    1FL4      Total number of transaction states sampled in *09375400
                         the work phase specified by RCAEEFLG           09387600
RCAEACTV DS    1FL4      Total number of active state samples. Active  *09399800
                         indicates that there is a program executing   *09412000
                         on behalf of the work request, from the       *09424200
                         perspective of the work manager. This does    *09436400
                         not mean that the program is active from the  *09448600
                         base control program's perspective             09460800
RCAERDY  DS    1FL4      Total number of ready state samples. Ready    *09473000
                         indicates that there is a program ready to    *09485200
                         execute on behalf of the work request         *09497400
                         described by the monitoring environment, but  *09509600
                         the work manager has given priority to        *09521800
                         another work request                           09534000
RCAEIDL  DS    1FL4      Total number of idle state samples. This      *09546200
                         indicates the number of times the work        *09558400
                         manager see a transaction as idle.             09570600
RCAEWLOK DS    1FL4      Total number of waiting for lock state        *09582800
                         samples.                                       09595000
RCAEWIO  DS    1FL4      Total number of waiting for I/O state         *09607200
                         samples. Waiting for I/O indicates that the   *09619400
                         work manager is waiting for an activity       *09631600
                         related to an I/O request. This may be an     *09643800
                         actual I/O operation or some other function   *09656000
                         associated with the I/O request                09668200
RCAEWCON DS    1FL4      Total number of waiting for conversation      *09680400
                         state samples. Waiting for conversation may   *09692600
                         have been used in conjunction with the WLM    *09704800
                         service IWMMSWCH to identify where the        *09717000
                         recipient of the conversation is located. In  *09729200
                         this case, only the switched state will be    *09741400
                         recorded.                                      09753600
RCAEWDST DS    1FL4      Total number of waiting for distributed       *09765800
                         request state samples. Waiting for            *09778000
                         distributed request indicates a high level    *09790200
                         that some function or data must be routed     *09802400
                         prior to resumption of the work request. This *09814600
                         is to be contrasted with waiting for          *09826800
                         conversation, which is a low level view of    *09839000
                         the precise resource that is needed. A        *09851200
                         distributed request could involve waiting on  *09863400
                         a conversation as part of its processing       09875600
RCAEWSL  DS    1FL4      Waiting for a session to be established       *09887800
                         locally. ie. on the current MVS image          09900000
RCAEWSN  DS    1FL4      Waiting for a session to be established       *09912200
                         somewhere in the network                       09924400
RCAEWSS  DS    1FL4      Waiting for a session to be established       *09936600
                         somewhere in the sysplex                       09948800
RCAEWTMR DS    1FL4      Waiting for a timer                            09961000
RCAEWO   DS    1FL4      Waiting for another product                    09973200
RCAEWMSC DS    1FL4      Waiting for unidentified resource, possibly   *09985400
                         among another more specific category, but     *09997600
                         which may not be readily determined            10009800
RCAESSL  DS    1FL4      State representing transactions for which     *10022000
                         there are logical continuations on this MVS   *10034200
                         image. Subsystem work managers might set this *10046400
                         state when they function ship a transaction   *10058600
                         to another component within the same MVS      *10070800
                         image                                          10083000
RCAESSS  DS    1FL4      State representing transactions for which     *10095200
                         there are logical continuations on another    *10107400
                         MVS image in the sysplex. Subsystem work      *10119600
                         managers might set this state when they       *10131800
                         function ship a transaction to another        *10144000
                         component on another MVS image within the     *10156200
                         sysplex                                        10168400
RCAESSN  DS    1FL4      State representing transactions for which     *10180600
                         there are logical continuations somewhere     *10192800
                         within the network. Subsystem work managers   *10205000
                         might set this state when they function ship  *10217200
                         a transaction to another component within the *10229400
                         network                                        10241600
RCAEBPMI DS    1FL4      Reserved                                       10245900
RCAEBPMC DS    1FL4      Reserved                                       10250200
RCAEBPCM DS    1FL4      Reserved                                       10254500
RCAECFMI DS    1FL4      Reserved                                       10258800
RCAEWNL  DS    1FL4      Waiting for new latch                          10263200
RCAANAME EQU   C'RCAA'   'RCAA' ACRONYM                                 10266000
*                                                                       10266800
* ********************************************************************  10267600
* *                                                                  *  10268400
* * The RCAAVRID and RCAEVRID must be changed if new fields are      *  10269200
* * added to any area in the RQAA ouput area (see APAR OW11082).     *  10270000
* * This is to keep vendor products aware of changes to the output   *  10270800
* * area.                                                            *  10271600
* *                                                                  *  10272400
* * RQAA_VERSION4 - RQAA_VERSION8 are reserved.                      *  10273200
* *                                                                     10274000
* ********************************************************************  10274800
*                                                                       10275600
*                                                                       10276400
RCAA_VERSION1 EQU 1      RCAA version 1. 1=HBB5510                      10278200
RCAA_VERSION2 EQU 2      RCAA version 2. 2=HBB5520                      10284300
RCAA_VERSION3 EQU 3      RCAA version 3. 3=HBB6603                      10290400
RCAA_VERSION4 EQU 4      RCAA version 4. 4=JBB6604                      10294400
RCAA_VERSION9 EQU 9      RCAA version 9. 9=JBB6600                      10297100
RCAAVRID EQU   9         Current version level                          10299800
RCAENAME EQU   C'RCAE'   'RCAE' ACRONYM                                 10302600
RCAE_VERSION1 EQU 1      RCAE version 1. 1=HBB5510                      10314800
RCAE_VERSION2 EQU 2      RCAE version 2. 2=HBB5520                      10322100
RCAE_VERSION3 EQU 3      RCAE version 3. 3=HBB6603                      10329400
RCAE_VERSION4 EQU 4      RCAE version 4. 4=JBB6604                      10334200
RCAE_VERSION9 EQU 9      RCAE version 9. 9=JBB6600                      10337400
RCAEVRID EQU   9         Current version level                          10340600
         ORG   RCAEEELA+X'000000C0'                                     10344000
RCAEEELA_LEN EQU *-RCAEEELA                                             10351400
.L0020   ANOP                                                           10363600
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 10375800
         AIF   ('&LIST' EQ 'YES').P4                                    10388000
.P3      ANOP                                                           10400200
         POP   PRINT                                                    10412400
.P4      ANOP                                                           10424600
.P_EXIT  ANOP                                                           10436800
         MEND                                                           10450000
**/ IWMWRCAA_2:;                                                        10460000
* %IWMWRCAA_INCLUDED = 'YES';                                           10470000
* %DCL ZCBPRINT CHAR EXT;                                               10480000
* %DEACTIVATE ZCBPRINT;                                                 10490000
* %DCL IWMWRCAA_LIST CHAR EXT;                                          10500000
* %DEACTIVATE IWMWRCAA_LIST;                                            10510000
* %IF IWMWRCAA_LIST ^= 'NO' &                                           10520000
*    ZCBPRINT ^= 'NO' %THEN                                             10530000
*   %GOTO IWMWRCAA_3;                                                   10540000
*   @LIST PUSH NOECHO;                                                  10550000
*   @LIST NOASSEMBLE NOECHO;                                            10560000
*   @LIST OFF C NOECHO;                                                 10570000
* %IWMWRCAA_3:;                                                         10580000
*/* Start of PL/X Source                                             */ 10590000
* %IF RCAAVIA = 'YES' %THEN          /* Check if RCAA ALET is           10600000
*                                       specified                    */ 10650000
*   %RCAAVIA = 'VIA(RCAAALET)';      /* Set VIA to specified value   */ 10700000
* %ELSE                                                                 10750000
*   %IF GLOBALARMODE = 'YES' %THEN   /* RCAA ALET not specified-check   10800000
*                                       if global default specified  */ 10850000
*     %RCAAVIA = 'VIA(0)';           /* If yes then set global       */ 10900000
*   %ELSE                                                               10950000
*     %RCAAVIA = '';                 /* If no then set to nulls      */ 11000000
*                                                                       11050000
* DECLARE                                                               11100000
*  1 RCAA RCAAVIA BASED(RCAAPTR),    /* Workload Activity Collection    11150000
*                                       Answer Area                  */ 11200000
*    3 RCAAACRO CHAR(4),             /* Acronym                      */ 11250000
*    3 RCAASIZ  FIXED(31),           /* Size of RCAA and all of its     11300000
*                                       subordinate parts            */ 11350000
*    3 RCAAVERS FIXED(8),            /* Version                      */ 11400000
*    3 RCAAMODE BIT(8),              /* System WLM mode              */ 11450000
*      5 RCAAGOAL BIT(1),            /* System is in goal mode       */ 11500000
*      5 RCAACOMP BIT(1),            /* System is in compatibility      11550000
*                                       mode                         */ 11600000
*      5 RCAAOVEL BIT(1),            /* System is calculating velocity  11616600
*                                       without using I/O delays.       11633200
*                                                            @PSY0260*/ 11658100
*      5 RCAARSV  BIT(5),            /* Reserved             @PQC1647*/ 11683000
*    3 RCAAOPT  CHAR(2),             /* IEAOPTxx suffix              */ 11700000
*    3 RCAATMI  BIT(64),             /* Local time reporting was last   11750000
*                                       initialized (STCK format)    */ 11800000
*    3 RCAATMR  BIT(64),             /* Local time this RCAA data was   11850000
*                                       collected (STCK format)      */ 11900000
*    3 RCAAGINF CHAR(32),            /* Goal mode information        */ 11950000
*      5 RCAAPNAM CHAR(8),           /* Policy name                  */ 12000000
*      5 RCAAPTM  BIT(64),           /* Local time policy was           12050000
*                                       activated (STCK format)      */ 12100000
*      5 RCAAUID  CHAR(8),           /* Userid of person who activated  12150000
*                                       policy                       */ 12200000
*      5 RCAAPSYS CHAR(8),           /* System that policy was          12250000
*                                       activated on                 */ 12300000
*    3 RCAACINF CHAR(24),            /* Compatibility mode              12350000
*                                       information                  */ 12400000
*      5 RCAAIPS CHAR(2),            /* IEAIPSxx suffix              */ 12450000
*      5 RCAAICS CHAR(2),            /* IEAICSxx suffix              */ 12500000
*      5 RCAASCO  CHAR(20),          /* Service coefficients         */ 12550000
*        7 RCAAIPC  CHAR(4),         /* CPU service coefficient      */ 12600000
*        7 RCAAIPI  CHAR(4),         /* I/O service coefficient      */ 12650000
*        7 RCAAIPB  CHAR(4),         /* SRB service coefficient      */ 12700000
*        7 RCAAIPM  CHAR(8),         /* MSO service coefficient      */ 12750000
*    3 RCAANTVL FIXED(32),           /* Current sample interval (in     12800000
*                                       milliseconds).  This is the     12850000
*                                       frequency with which WLM        12900000
*                                       samples delays reported in the  12950000
*                                       RCAA                         */ 13000000
*    3 RCAANTV# FIXED(32),           /* Total number of times WLM       13050000
*                                       sampling code ran.  A monitor   13100000
*                                       issuing successive calls to     13150000
*                                       IWMRCOLL should not assume that 13200000
*                                       WLM sampling code ran at the    13250000
*                                       interval specified by RCAANTVL  13300000
*                                       between its calls.  This field  13350000
*                                       can be used to translate        13400000
*                                       sampled state data into actual  13450000
*                                       percentages of time.         */ 13500000
*    3 RCAABMPL FIXED(16),           /* Length of an entry in the       13550000
*                                       response time distribution      13600000
*                                       mapping array                */ 13650000
*    3 RCAABMP# FIXED(16),           /* Number of response time         13700000
*                                       distribution buckets         */ 13750000
*    3 RCAABMPO FIXED(32),           /* Offset from RCAA to response    13800000
*                                       time distribution mapping array 13850000
*                                       (RCAABMAP)                   */ 13900000
*    3 RCAASCAL FIXED(16),           /* Length of one RCAE workload     13950000
*                                       activity entry in the RCAASCOF  14000000
*                                       array                        */ 14050000
*    3 RCAASCA# FIXED(16),           /* Number of entries in RCAASCOF   14100000
*                                       array.  In compatibility mode   14150000
*                                       this is one + the highest PGN,  14200000
*                                       RPGN, or OPGN value.  (The      14250000
*                                       extra entry is for PGN 0.)  In  14300000
*                                       goal mode, this is the number   14350000
*                                       of service classes returned in  14400000
*                                       IWMSVPOL by IWMPQRY.         */ 14450000
*    3 RCAASCOF FIXED(32),           /* Offset from RCAA to array of    14500000
*                                       RCAE entries.  In goal mode     14550000
*                                       these entries represent service 14600000
*                                       classes.  In compatibility      14650000
*                                       mode they represent either PGNs 14700000
*                                       or RPGNs.                    */ 14750000
*    3 RCAARCAL FIXED(16),           /* Length of one RCAE workload     14800000
*                                       activity entry in the RCAARCOF  14850000
*                                       array                        */ 14900000
*    3 RCAARCA# FIXED(16),           /* Number of entries in RCAARCOF   14950000
*                                       array.  In compatibility mode   15000000
*                                       this field is always zero.  In  15050000
*                                       goal mode this field is the     15100000
*                                       number of report classes        15150000
*                                       returned in IWMSVPOL by         15200000
*                                       IWMPQRY                      */ 15250000
*    3 RCAARCOF FIXED(32);           /* Offset from RCAA to array of    15300000
*                                       RCAE entries.  Only valid in    15350000
*                                       goal mode.                   */ 15400000
* DECLARE                                                               15450000
*  1 RCAABMAP RCAAVIA BASED,         /* RCAA response time distribution 15500000
*                                       map array                    */ 15550000
*    3 RCAABENT FIXED(31);           /* Response time distribution      15600000
*                                       bucket mappings.  Each word     15650000
*                                       defines a maximum % of a goal   15700000
*                                       (ie. 50, 70, 100, etc.)  When   15750000
*                                       used in conjunction with an     15800000
*                                       RCAEDENT, a monitor product     15850000
*                                       can show the number of          15900000
*                                       transactions that completed in  15950000
*                                       a percentage of a goal.  The    16000000
*                                       last entry in the array         16050000
*                                       contains X'FFFFFFFF'.  This     16100000
*                                       indicates that this bucket      16150000
*                                       includes all transactions that  16200000
*                                       completed with longer response  16250000
*                                       times than the previous         16300000
*                                       bucket.                 @P6C */ 16350000
* DECLARE                                                               16400000
*  1 RCAAICSS BASED,                 /* RCAA ICS information - provided 16450000
*                                       in compatibility mode only   */ 16500000
*    3 RCAAICSX FIXED(31),           /* Offset from RCAAICSS to symbol  16550000
*                                       table index array.  Mapped by   16600000
*                                       IRAICSM                      */ 16650000
*    3 RCAAICSM FIXED(31),           /* Offset from RCAAICSS to symbol  16700000
*                                       table.  Mapped by IRAICSM    */ 16750000
*    3 RCAAICSL FIXED(31);           /* Length of index array and       16800000
*                                       symbol table                 */ 16850000
* DECLARE                                                               16900000
*   RCAAICX CHAR(*) BASED;           /* Label to be used to address the 16950000
*                                       ICS symbol table index array -  17000000
*                                       to be used only in              17050000
*                                       compatibility mode           */ 17100000
* DECLARE                                                               17150000
*   RCAAICM CHAR(*) BASED;           /* Label to be used to address the 17200000
*                                       ICS symbol table - to be used   17250000
*                                       only in compatibility mode   */ 17300000
* DECLARE                                                               17300100
*  1 RCAE RCAAVIA BDY(DWORD) BASED,  /* Workload Activity Collection    17300200
*                                       Entry (RCAE).  Pointed to by    17300300
*                                       RCAASCOF and RCAARCOF which     17300400
*                                       are within the RCAA.         */ 17300500
*    3 RCAEACRO CHAR(4),             /* Acronym                      */ 17300600
*    3 RCAEVERS FIXED(8),            /* Version                      */ 17300700
*    3 RCAETYPE BIT(8),              /* What this RCAE represents    */ 17300800
*      5 RCAEPGN  BIT(1),            /* Performance group            */ 17300900
*      5 RCAERPGN BIT(1),            /* Report performance group     */ 17301000
*      5 RCAESCL  BIT(1),            /* Service class                */ 17301100
*      5 RCAERCL  BIT(1),            /* Report class                 */ 17301200
*      5 RCAENIU  BIT(1),            /* This RCAE is not in use.        17301300
*                                       This indicator is set in        17301400
*                                       compatibility mode for those    17301500
*                                       entries that are not validly    17301600
*                                       defined in either the IPS or    17301700
*                                       ICS                          */ 17301800
*      5 RCAEHRS1 BIT(3),            /* Reserved                     */ 17301900
*    3 RCAECLX  FIXED(16),           /* RCAE index.  In goal mode, this 17302000
*                                       is the index into the service   17302100
*                                       class or report class list      17302200
*                                       returned by IWMPQRY.            17302300
*                                       In compatibility mode, this is  17302400
*                                       the PGN or RPGN number.  Note   17302500
*                                       0 is a valid PGN number.     */ 17302600
*    3 RCAEHRS2 CHAR(2),             /* Reserved                     */ 17302700
*    3 RCAEPER# FIXED(16),           /* Number of period data entries   17302800
*                                       for this RCAE                */ 17302900
*    3 RCAEPERL FIXED(32),           /* Length of all of the period     17303000
*                                       data associated with this RCAE  17303100
*                                       entry.                       */ 17303200
*    3 RCAEPERO FIXED(32),           /* Offset from RCAE to first       17303300
*                                       period's data.  Zero is only    17303400
*                                       valid in compatibility mode and 17303500
*                                       indicates that the PGN or RPGN  17303600
*                                       was not defined in the IPS or   17303700
*                                       ICS                          */ 17303800
*    3 RCAESCL# FIXED(16),           /* Number of entries in the        17303900
*                                       RCAESCLS array.  That is, the   17304000
*                                       number of service classes       17304100
*                                       being served by one or more     17304200
*                                       address spaces in the service   17304300
*                                       class specified by RCAECLX.     17304400
*                                       Valid only in goal mode.     */ 17304500
*    3 RCAESCLL FIXED(16),           /* Length of a single entry        17304600
*                                      (RCAESCLS) in the server data    17304700
*                                      array.                    @P6C*/ 17304800
*    3 RCAESCLO FIXED(32),           /* Offset from RCAE to RCAESCLS    17304900
*                                       array.  Zero indicates there is 17305000
*                                       no server data available for    17305100
*                                       this service class           */ 17305200
*    3 RCAEHRS3 CHAR(4);             /* Reserved                     */ 17305300
* DECLARE                                                               17305400
*  1 RCAESCLS RCAAVIA BDY(DWORD) BASED,  /* RCAE - An entry in the      17305500
*                                       service classes served array*/  17305600
*    3 RCAESCSN FIXED(16),           /* Index of service class being    17305700
*                                       served                       */ 17305800
*    3 RCAERS1  CHAR(2),             /* Reserved                     */ 17305900
*    3 RCAESCS# FIXED(32);           /* Number of times an address      17306000
*                                       space running with this service 17306100
*                                       class (RCAECLX) served service  17306200
*                                       class (RCAESCSN).            */ 17306300
* DECLARE                                                               17306400
*  1 RCAEIHDR RCAAVIA BDY(DWORD) BASED,  /* RCAE - period header     */ 17306500
*    3 RCAEPERI FIXED(8),            /* Period number                */ 17306600
*    3 RCAEIRSV CHAR(1),             /* Reserved                     */ 17306700
*    3 RCAECOMP,                     /* Compatibility mode data      */ 17306800
*      5 RCAEDMN  FIXED(8),          /* Domain level                 */ 17306900
*      5 RCAETSGN FIXED(8),          /* Timeslice group number       */ 17307000
*    3 RCAEIRLN FIXED(16),           /* Length of resource data section 17307100
*                                       (RCAERESC)                   */ 17307200
*    3 RCAEIRS1 CHAR(2),             /* Reserved                     */ 17307300
*    3 RCAEIROF FIXED(32),           /* Offset from RCAEIHDR to         17307400
*                                       resource data.  Zero indicates  17307500
*                                       there is no resource data for   17307600
*                                       this period                  */ 17307700
*    3 RCAEIPLN FIXED(16),           /* Length of response time section 17307800
*                                       (RCAERST)                    */ 17307900
*    3 RCAEIRS2 CHAR(2),             /* Reserved                     */ 17308000
*    3 RCAEIPOF FIXED(32),           /* Offset from RCAEIHDR to         17308100
*                                       response time data.  Zero       17308200
*                                       indicates that there is no      17308300
*                                       response time data available    17308400
*                                       for this period          @P1C*/ 17308500
*    3 RCAEIGLN FIXED(16),           /* Length of general execution     17308600
*                                       delay section (RCAEDELA)     */ 17308700
*    3 RCAEIRS3 CHAR(2),             /* Reserved                     */ 17308800
*    3 RCAEIGOF FIXED(32),           /* Offset from RCAEIHDR to general 17308900
*                                       execution delay data.  Zero if  17309000
*                                       no general execution delay      17309100
*                                       data is available for this      17309200
*                                       period                       */ 17309300
*    3 RCAEID#  FIXED(16),           /* Number of entries in the        17309400
*                                       response time distribution      17309500
*                                       section (RCAEDIST).  Zero if    17309600
*                                       there is no distribution for    17309700
*                                       this period.                 */ 17309800
*    3 RCAEIDLN FIXED(16),           /* Length of response time         17309900
*                                       distribution section            17310000
*                                       (RCAEDIST)                   */ 17310100
*    3 RCAEIDOF FIXED(32),           /* Offset from RCAEIHDR to         17310200
*                                       response time distribution      17310300
*                                       data.  Zero when in             17310400
*                                       compatibility  mode.  When in   17310500
*                                       goal mode, this field will be   17310600
*                                       zero for report classes, when   17310700
*                                       there are no response time      17310800
*                                       goals specified, or when no     17310900
*                                       response time data is available 17311000
*                                       for this period          @P1C*/ 17311100
*    3 RCAEIS#  FIXED(16),           /* Number of entries in the        17311200
*                                       subsystem work manager delay    17311300
*                                       section (RCAEEELA).  Zero if    17311400
*                                       there are no subsystem work     17311500
*                                       manager delays for this         17311600
*                                       period.                      */ 17311700
*    3 RCAEISLN FIXED(16),           /* Length of subsystem work        17311800
*                                       manager delay section           17311900
*                                       (RCAEEELA)                   */ 17312000
*    3 RCAEISOF FIXED(32),           /* Offset from RCAEIHDR to         17312100
*                                       subsystem work manager delay    17312200
*                                       data.  Zero indicates there is  17312300
*                                       no subsystem work manager delay 17312400
*                                       data for this period         */ 17312500
*    3 RCAEINXP FIXED(32);           /* Offset from RCAEIHDR to next    17312600
*                                       period's data or zero if last   17312700
*                                       period                       */ 17312800
* DECLARE                                                               17312900
*  1 RCAERESC RCAAVIA BDY(DWORD) BASED,  /* RCAE - resource data.       17313000
*                                       All service                     17313100
*                                       units are weighted by the       17313200
*                                       coefficients specified in       17313300
*                                       RCAASCO for compatibility mode  17313400
*                                       or the active policy in goal    17313500
*                                       mode                         */ 17313600
*    3 RCAESRV,                      /* Total service units for         17313700
*                                       period                       */ 17313800
*      5 RCAESRV1 FIXED(32),         /* Total service units for period  17313900
*                                       - word 1                     */ 17314000
*      5 RCAESRV2 FIXED(32),         /* Total service units for period  17314100
*                                       - word 2                     */ 17314200
*    3 RCAECPU,                      /* Total CPU service units      */ 17314300
*      5 RCAECPU1 FIXED(32),         /* Total CPU service units         17314400
*                                       - word 1                     */ 17314500
*      5 RCAECPU2 FIXED(32),         /* Total CPU service units         17314600
*                                       - word 2                     */ 17314700
*    3 RCAEIOC,                      /* Total I/O service units      */ 17314800
*      5 RCAEIOC1 FIXED(32),         /* Total I/O service units         17314900
*                                       - word 1                     */ 17315000
*      5 RCAEIOC2 FIXED(32),         /* Total I/O service units         17315100
*                                       - word 2                     */ 17315200
*    3 RCAEMSO,                      /* Total MSO service units      */ 17315300
*      5 RCAEMSO1 FIXED(32),         /* Total MSO service units         17315400
*                                       - word 1                     */ 17315500
*      5 RCAEMSO2 FIXED(32),         /* Total MSO service units         17315600
*                                       - word 2                     */ 17315700
*    3 RCAESRB,                      /* Total SRB service units      */ 17315800
*      5 RCAESRB1 FIXED(32),         /* Total SRB service units         17315900
*                                       - word 1                     */ 17316000
*      5 RCAESRB2 FIXED(32),         /* Total SRB service units         17316100
*                                       - word 2                     */ 17316200
*    3 RCAEPIR,                      /* Total page-ins count         */ 17316300
*      5 RCAEPIR1 FIXED(32),         /* Total page-ins count            17316400
*                                       - word 1                     */ 17316500
*      5 RCAEPIR2 FIXED(32),         /* Total page-ins count            17316600
*                                       - word 2                     */ 17316700
*    3 RCAEHSP,                      /* Total hiperspace page-ins       17316800
*                                       count - word 2               */ 17316900
*      5 RCAEHSP1 FIXED(32),         /* Total hiperspace page-ins count 17317000
*                                       - word 1                     */ 17317100
*      5 RCAEHSP2 FIXED(32),         /* Total hiperspace page-ins count 17317200
*                                       - word 2                     */ 17317300
*    3 RCAEBPIR,                     /* Total block page-ins from       17317400
*                                       aux                          */ 17317500
*      5 RCAEBPI1 FIXED(32),         /* Total block page-ins from aux   17317600
*                                       - word 1                     */ 17317700
*      5 RCAEBPI2 FIXED(32),         /* Total block page-ins from aux   17317800
*                                       - word 2                     */ 17317900
*    3 RCAEPIE,                      /* Total page-ins from expanded    17318000
*                                       count                        */ 17318100
*      5 RCAEPIE1 FIXED(32),         /* Total page-ins from expanded    17318200
*                                       count - word 1               */ 17318300
*      5 RCAEPIE2 FIXED(32),         /* Total page-ins from expanded    17318400
*                                       count - word 2               */ 17318500
*    3 RCAEBPIE,                     /* Total block page-ins from       17318600
*                                       expanded count               */ 17318700
*      5 RCAEBPE1 FIXED(32),         /* Total block page-ins from       17318800
*                                       expanded count - word 1      */ 17318900
*      5 RCAEBPE2 FIXED(32),         /* Total block page-ins from       17319000
*                                       expanded count - word 2      */ 17319100
*    3 RCAEBKIA,                     /* Total aux blocks paged in    */ 17319200
*      5 RCAEBKA1 FIXED(32),         /* Total aux blocks paged in       17319300
*                                       - word 1                     */ 17319400
*      5 RCAEBKA2 FIXED(32),         /* Total aux blocks paged in       17319500
*                                       - word 2                     */ 17319600
*    3 RCAEBKIE,                     /* Total expanded blocks paged     17319700
*                                       in                           */ 17319800
*      5 RCAEBKE1 FIXED(32),         /* Total expanded blocks paged in  17319900
*                                       - word 1                     */ 17320000
*      5 RCAEBKE2 FIXED(32),         /* Total expanded blocks paged in  17320100
*                                       - word 2                     */ 17320200
*    3 RCAEPRS,                      /* Total page residency time (in   17320300
*                                       1024 microsecond units)      */ 17320400
*      5 RCAEPRS1 FIXED(32),         /* Total page residency time       17320500
*                                       - word 1                     */ 17320600
*      5 RCAEPRS2 FIXED(32),         /* Total page residency time       17320700
*                                       - word 2                     */ 17320800
*    3 RCAEERS,                      /* Total expanded page residency   17320900
*                                       time (in 1024 microsecond       17321000
*                                       units)                       */ 17321100
*      5 RCAEERS1 FIXED(32),         /* Total expanded page residency   17321200
*                                       time - word 1                */ 17321300
*      5 RCAEERS2 FIXED(32),         /* Total expanded page residency   17321400
*                                       time - word 2                */ 17321500
*    3 RCAETRR,                      /* Total in-storage residency time 17321600
*                                       (in 1024 microsecond units)  */ 17321700
*      5 RCAETRR1 FIXED(32),         /* Total in-storage residency time 17321800
*                                       - word 1                     */ 17321900
*      5 RCAETRR2 FIXED(32),         /* Total in-storage residency time 17322000
*                                       - word 2                     */ 17322100
*    3 RCAETAT,                      /* Total transaction active time   17322200
*                                       (in 1024 microsecond units)  */ 17322300
*      5 RCAETAT1 FIXED(32),         /* Total transaction active time   17322400
*                                       - word 1                     */ 17322500
*      5 RCAETAT2 FIXED(32),         /* Total transaction active time   17322600
*                                       - word 2                     */ 17322700
*    3 RCAERCT  FIXED(32),           /* Total RCT time (in microsecond  17322800
*                                       units)                       */ 17322900
*    3 RCAEIIT  FIXED(32),           /* Total I/O interupt time (in     17323000
*                                       microsecond units)           */ 17323100
*    3 RCAEHST  FIXED(32),           /* Total hiperspace service time   17323200
*                                       (in microsecond units)       */ 17323300
*    3 RCAESWC  FIXED(32),           /* Total swap count             */ 17323400
*    3 RCAECRMS FIXED(32),           /* Total hiperspace eso read       17323500
*                                       miss count                   */ 17323600
*    3 RCAESPPI,                     /* Total shared page-ins from      17323700
*                                       aux count                @L1A*/ 17323800
*      5 RCAESPP1 FIXED(32),         /* Total shared page-ins from      17323900
*                                       aux count - word 1       @L1A*/ 17324000
*      5 RCAESPP2 FIXED(32),         /* Total shared page-ins from      17324100
*                                       aux count - word 2       @L1A*/ 17324200
*    3 RCAESPEI,                     /* Total shared page-ins from      17324300
*                                       expanded count           @L1A*/ 17324400
*      5 RCAESPE1 FIXED(32),         /* Total shared page-ins from      17324500
*                                       expanded count - word 1  @L1A*/ 17324600
*      5 RCAESPE2 FIXED(32),         /* Total shared page-ins from      17324700
*                                       expanded count - word 2  @L1A*/ 17324800
*    3 RCAESPRS,                     /* Total shared page residency     17324900
*                                       time (in 1024 microsecond       17325000
*                                       units)                   @L1A*/ 17325100
*      5 RCAESPRS1 FIXED(32),        /* Total shared page residency     17325200
*                                       time - word 1            @L1A*/ 17325300
*      5 RCAESPRS2 FIXED(32),        /* Total shared page residency     17325400
*                                       time - word 2            @L1A*/ 17325500
*    3 RCAEIOCT,                     /* Total DASD I/O connect time     17325600
*                                       in 128 microsecond              17325700
*                                       units                @DQC0023*/ 17325800
*      5 RCAEIOCT1 FIXED(32),        /*                                 17325900
*                                       word 1               @DQC0023*/ 17326000
*      5 RCAEIOCT2 FIXED(32),        /*                                 17326100
*                                       word 2               @DQC0023*/ 17326200
*    3 RCAEIOWT,                     /* Total DASD I/O wait time        17326300
*                                       (Queue time + Pending time      17326400
*                                       in 128 microsecond units)       17326500
*                                       Note: Does not include IOS      17326600
*                                       queue time.          @WLMPIOP*/ 17326700
*      5 RCAEIOWT1 FIXED(32),        /*                                 17326800
*                                       word 1               @WLMPIOP*/ 17326900
*      5 RCAEIOWT2 FIXED(32),        /*                                 17327000
*                                       word 2               @WLMPIOP*/ 17327100
*    3 RCAEIORC FIXED(32),           /* Total DASD I/O count.  This     17327200
*                                       can be used with fields         17327300
*                                       RCAEIOCT, RCAEIODT, RCAEIOWT,   17327400
*                                       RCAEIOST to determine           17327500
*                                       average DASD response time      17327600
*                                       for the period.                 17327700
*                                                            @WLMPBAT*/ 17327800
*    3 RCAERRS1  CHAR(4),            /* Reserved             @WLMPIOP*/ 17327900
*    3 RCAEIODT,                     /* Total DASD I/O disconnect time  17328000
*                                       in 128 microsecond              17328100
*                                       units                @DQC0023*/ 17328200
*      5 RCAEIODT1 FIXED(32),        /*                                 17328300
*                                       word 1               @DQC0023*/ 17328400
*      5 RCAEIODT2 FIXED(32),        /*                                 17328500
*                                       word 2               @DQC0023*/ 17328600
*    3 RCAEIOST,                     /* Total DASD IOS queue time       17328700
*                                       in 128 microsecond units        17328800
*                                                            @WLMPBAT*/ 17328900
*      5 RCAEIOST1 FIXED(32),        /*                                 17329000
*                                       RCAEIOST word 1      @WLMPBAT*/ 17329100
*      5 RCAEIOST2 FIXED(32),        /*                                 17329200
*                                       RCAEIOST word 2      @WLMPBAT*/ 17329300
*    3 *  CHAR(8),                   /* Reserved             @WLMPMES*/ 17329400
*    3 RCAEIEAT,                     /* Independent enclave total       17329500
*                                       transaction active time (in     17329600
*                                       1024 microsecond units) for     17329700
*                                       enclaves that originated on     17329800
*                                       this system.         @WLMPMES*/ 17329900
*      5 RCAEIEA1 FIXED(32),         /* Independent enclave total       17330000
*                                       transaction active time         17330100
*                                       - word 1             @WLMPMES*/ 17330200
*      5 RCAEIEA2 FIXED(32),         /* Independent enclave total       17330300
*                                       transaction active time         17330400
*                                       - word 2             @WLMPMES*/ 17330500
*    3 RCAEXEAT,                     /* Exported enclave total          17330600
*                                       transaction active time (in     17330700
*                                       1024 microsecond units).        17330800
*                                                            @WLMPMES*/ 17330900
*      5 RCAEXEA1 FIXED(32),         /* Exported enclave total          17331000
*                                       transaction active time         17331100
*                                       - word 1             @WLMPMES*/ 17331200
*      5 RCAEXEA2 FIXED(32),         /* Exported enclave total          17331300
*                                       transaction active time         17331400
*                                       - word 2             @WLMPMES*/ 17331500
*    3 RCAEFEAT,                     /* Foreign enclave total           17331600
*                                       transaction active time (in     17331700
*                                       1024 microsecond units).        17331800
*                                                            @WLMPMES*/ 17331900
*      5 RCAEFEA1 FIXED(32),         /* Foreign enclave total           17332000
*                                       transaction active time         17332100
*                                       - word 1             @WLMPMES*/ 17332200
*      5 RCAEFEA2 FIXED(32),         /* Foreign enclave total           17332300
*                                       transaction active time         17332400
*                                       - word 2             @WLMPMES*/ 17332500
*    3 *  CHAR(32);                  /* Reserved             @WLMPMES*/ 17332600
* DECLARE                                                               17332700
*  1 RCAERST RCAAVIA BDY(DWORD) BASED,  /* RCAE - response time data */ 17332800
*    3 RCAERCP  FIXED(32),           /* Count of transaction            17332900
*                                       completions for this period.    17333000
*                                       In compatibility mode this is   17333100
*                                       the TSO, APPC, batch, etc.      17333200
*                                       transactions.  In goal mode,    17333300
*                                       this field also includes        17333400
*                                       transaction completions         17333500
*                                       reported by subsystem work      17333600
*                                       managers via the IWMRPT         17333700
*                                       service                      */ 17333800
*    3 RCAEARCP FIXED(32),           /* Count of transactions that      17333900
*                                       completed abnormally as         17334000
*                                       reported by subsystem work      17334100
*                                       managers.  This value is not    17334200
*                                       part of RCAERCP and should not  17334300
*                                       be used for response time       17334400
*                                       calculations.                */ 17334500
*    3 RCAENCP  FIXED(32),           /* Count of times an execution     17334600
*                                        phase has completed by the     17334700
*                                        subsystem work managers via    17334800
*                                        the IWMMNTFY service.       */ 17334900
*    3 RCAEANCP FIXED(32),           /* Count of transactions that      17335000
*                                       completed their execution       17335100
*                                       phase abnormally as reported    17335200
*                                       by subsystem work manager.      17335300
*                                       This value is not part of       17335400
*                                       RCANCP and should not be used   17335500
*                                       for execution response time     17335600
*                                       calculations                 */ 17335700
*    3 RCAETET,                      /* Total transaction elapsed time  17335800
*                                       (in 1024 microsecond units)  */ 17335900
*      5 RCAETET1 FIXED(32),         /* Total transaction elapsed time  17336000
*                                       - word 1                     */ 17336100
*      5 RCAETET2 FIXED(32),         /* Total transaction elapsed time  17336200
*                                       - word 2                     */ 17336300
*    3 RCAEXET,                      /* Total transaction execution     17336400
*                                       time - (in 1024 microsecond     17336500
*                                       units). Available in goal mode  17336600
*                                       only                         */ 17336700
*      5 RCAEXET1 FIXED(32),         /* Total transaction execution     17336800
*                                       time - word 1                */ 17336900
*      5 RCAEXET2 FIXED(32),         /* Total transaction execution     17337000
*                                       time - word 2                */ 17337100
*    3 RCAESTT,                      /* Total system time  (in 1024     17337200
*                                       microsecond units). Available   17337300
*                                       in compatibility mode only   */ 17337400
*      5 RCAESTT1 FIXED(32),         /* Total system time - word 1   */ 17337500
*      5 RCAESTT2 FIXED(32),         /* Total system time - word 2   */ 17337600
*    3 RCAEETS,                      /* Sum of transaction elapsed      17337700
*                                       times squared (1024 microsec)*/ 17337800
*      5 RCAEETS1 FIXED(32),         /* Sum of transaction elapsed      17337900
*                                       times squared - word 1       */ 17338000
*      5 RCAEETS2 FIXED(32),         /* Sum of transaction elapsed      17338100
*                                       times squared - word 2       */ 17338200
*    3 RCAEQDT,                      /* Total queue delay time. For     17338300
*                                       batch jobs this is the time     17338400
*                                       jobs spent on the job queue     17338500
*                                       while eligible to run on        17338600
*                                       some system. In other words     17338700
*                                       this is the time jobs spent     17338800
*                                       waiting for an initiator.       17338900
*                                       For TSO users, this time can    17339000
*                                       be a portion of the LOGON       17339100
*                                       process. For APPC this is the   17339200
*                                       time an APPC request spends     17339300
*                                       on an APPC queue.               17339400
*                                       (1024 microsec)     @WLMPBAT */ 17339500
*      5 RCAEQDT1 FIXED(32),         /* RCAEQDT Word 1      @WLMPBAT */ 17339600
*      5 RCAEQDT2 FIXED(32),         /* RCAEQDT Word 2      @WLMPBAT */ 17339700
*    3 RCAEADT,                      /* Total time batch jobs were      17339800
*                                       ineligible to run because       17339900
*                                       a resource the job had          17340000
*                                       affinity to was unavailable.    17340100
*                                       Only applies to batch           17340200
*                                       work. Zero for other            17340300
*                                       work types. (1024 microsec)     17340400
*                                                           @WLMPBAT */ 17340500
*      5 RCAEADT1 FIXED(32),         /* RCAEADT word 1      @WLMPBAT */ 17340600
*      5 RCAEADT2 FIXED(32),         /* RCAEADT word 2      @WLMPBAT */ 17340700
*    3 RCAECVT,                      /* Total time batch jobs spent     17340800
*                                       in JCL conversion. Only         17340900
*                                       applies to batch work. Zero     17341000
*                                       for other work types.           17341100
*                                       (1024  microsec)    @WLMPBAT */ 17341200
*      5 RCAECVT1 FIXED(32),         /* RCAECVT word 1      @WLMPBAT */ 17341300
*      5 RCAECVT2 FIXED(32),         /* RCAECVT word 2      @WLMPBAT */ 17341400
*    3 RCAEIQT,                      /* Total time batch jobs spend     17341500
*                                       on job queue (after JCL         17341600
*                                       conversion) while ineligible    17341700
*                                       to run on any system for        17341800
*                                       reasons other than              17341900
*                                       resource affinities. For        17342000
*                                       example this time can include   17342100
*                                       operator hold of a job, delays  17342200
*                                       due to duplicate job names,     17342300
*                                       delays due to job class limits. 17342400
*                                       Only applies to batch work.     17342500
*                                       Zero for other work types.      17342600
*                                       (1024  microsec)    @WLMPBAT */ 17342700
*      5 RCAEIQT1 FIXED(32),         /* RCAEIQT word 1      @WLMPBAT */ 17342800
*      5 RCAEIQT2 FIXED(32),         /* RCAEIQT word 2      @WLMPBAT */ 17342900
*    3 * CHAR(8);                    /* Reserved            @WLMPBAT */ 17343000
*                                                                       17343100
* DECLARE                                                               17343200
*   1 RCAEDIST RCAAVIA BASED,        /* RCAE - response time            17343300
*                                       distribution array           */ 17343400
*     3 RCAEDENT FIXED(32);          /* An entry in the RCAE response   17343500
*                                       time distribution array.  Each  17343600
*                                       entry in the array contains     17343700
*                                       the number of transactions that 17343800
*                                       completed in the time period    17343900
*                                       represented by that entry.      17344000
*                                       When used with the response     17344100
*                                       time distribution bucket        17344200
*                                       mapping (RCAABMAP), monitors    17344300
*                                       can construct a distribution    17344400
*                                       of completions verses goals     17344500
*                                       specified.                   */ 17344600
* DECLARE                                                               17344700
*   1 RCAEDELA RCAAVIA BDY(DWORD) BASED,  /* RCAE - general execution   17344800
*                                       delay data                   */ 17344900
*     3 RCAEVELC,                    /* Execution velocity data      */ 17345000
*       5 RCAECUSE FIXED(32),        /* CPU using samples            */ 17345100
*       5 RCAETOTD FIXED(32),        /* Total delay samples used in     17345200
*                                       SRM's execution velocity        17345300
*                                       calculation                  */ 17345400
*     3 RCAEEDLA,                    /* General execution delays        17345500
*                                       included in RCAETOTD.  Each     17345600
*                                       dispatchable unit of work       17345700
*                                       sampled can increase one of the 17345800
*                                       CPU or paging delay samples  */ 17345900
*       5 RCAECDEL FIXED(32),        /* CPU delay.  A TCB or SRB is     17346000
*                                       waiting to be dispatched (other 17346100
*                                       than the first in-line behind   17346200
*                                       sampler) or a TCB is waiting    17346300
*                                       for local lock.              */ 17346400
*       5 RCAECCAP FIXED(32),        /* CPU capping delay.  A TCB or    17346500
*                                       SRB is marked non-dispatchable  17346600
*                                       because a resource group        17346700
*                                       maximum is being enforced.      17346800
*                                       Note that RCAECCAP is NOT a     17346900
*                                       subset of RCAECDEL.             17347000
*                                       Only valid in goal mode. @JTG*/ 17347100
*       5 RCAESWIN FIXED(32),        /* Swap-in delay.  Swap-in has     17347200
*                                       started, but not completed   */ 17347300
*       5 RCAEDMPL FIXED(32),        /* MPL delay.  Ready, but swap-in  17347400
*                                       has not started              */ 17347500
*       5 RCAEAPRV FIXED(32),        /* Aux page from private        */ 17347600
*       5 RCAEACOM FIXED(32),        /* Aux page from common         */ 17347700
*       5 RCAEXM   FIXED(32),        /* Aux page from cross memory   */ 17347800
*       5 RCAEVIO  FIXED(32),        /* Aux page from vio            */ 17347900
*       5 RCAEHSPC FIXED(32),        /* Aux page from standard          17348000
*                                       hiperspaces                  */ 17348100
*       5 RCAECHS  FIXED(32),        /* Aux page from eso hiperspaces.  17348200
*                                       Valid in goal mode only.     */ 17348300
*       5 RCAEASPD FIXED(32),        /* Shared paging from aux          17348400
*                                       delay                    @L1A*/ 17348500
*       5 RCAEDRS1 CHAR(4),          /* Reserved                     */ 17348600
*     3 RCAEUNKN FIXED(32),          /* Unknown.  Dispatchable unit or  17348700
*                                       address space is waiting, but   17348800
*                                       none of the above reasons       17348900
*                                       apply.  These samples are not   17349000
*                                       included in RCAETOTD         */ 17349100
*     3 RCAEIDLE FIXED(32),          /* Idle.  Work is in STIMER wait,  17349200
*                                       TSO terminal wait, APPC wait,   17349300
*                                       or is an initiator waiting for  17349400
*                                       work.  These samples are not    17349500
*                                       included in RCAETOTD         */ 17349600
*     3 RCAEPDEL FIXED(32),          /* Resource group capping delay.   17349700
*                                      Group maximum is being           17349800
*                                      enforced for work in this        17349900
*                                      service class. This delay only   17350000
*                                      accounts for address spaces in   17350100
*                                      the service class that are       17350200
*                                      currently swapped in. Only       17350300
*                                      valid in goal mode. These        17350400
*                                      samples are not included in      17350500
*                                      RCAETOTD                  @P6C*/ 17350600
*     3 RCAEPQUI FIXED(32),          /* Quiesce delay.  Some work in    17350700
*                                       this service class has been     17350800
*                                       reset via the RESET xxx,QUIESCE 17350900
*                                       command.  Only valid in goal    17351000
*                                       mode.  These samples are not    17351100
*                                       included in RCAETOTD         */ 17351200
*     3 RCAESAC  FIXED(32),          /* Sampled Address space count.    17351300
*                                       Number of address spaces that   17351400
*                                       contributed delay and using     17351500
*                                       samples to this service class.  17351600
*                                       These samples are not           17351700
*                                       included in RCAETOTD. Also      17351800
*                                       included are enclaves that      17351900
*                                       contributed delay and using     17352000
*                                       samples              @PSY0260*/ 17352100
*     3 RCAETOTU FIXED(32),          /* Total usings.  Velocity should  17352200
*                                       be calculated as                17352300
*                                       RCAETOTU/(RCAETOTD+RCAETOTU)    17352400
*                                                            @WLMPIOP*/ 17352500
*     3 RCAEIOU  FIXED(32),          /* Total I/O usings.  These are    17352600
*                                       included in RCAETOTU.  Only     17352700
*                                       non-paging DASD I/O can         17352800
*                                       contribute to I/O usings        17352900
*                                                            @WLMPIOP*/ 17353000
*     3 RCAEEDL2,                    /* Second set of execution delays  17353100
*                                       included in RCAETOTD.           17353200
*                                                            @WLMPIOP*/ 17353300
*       5 RCAEIOD FIXED(32),         /* DASD I/O delay samples          17353400
*                                                            @WLMPIOP*/ 17353500
*       5 RCAEQ   FIXED(32),         /* Queue delay samples.  Work is   17353600
*                                       waiting for a server.@WLMPASM*/ 17353700
*       5 RCAESPRV FIXED(32),        /* Server private area paging      17353800
*                                       delay samples.       @WLMPESM*/ 17353900
*       5 RCAESVIO FIXED(32),        /* Server space VIO paging delay   17354000
*                                       samples.             @WLMPESM*/ 17354100
*       5 RCAESHSP FIXED(32),        /* Server hiperspace paging delay  17354200
*                                       samples.             @WLMPESM*/ 17354300
*       5 RCAESMPL FIXED(32),        /* Server MPL delay samples        17354400
*                                                            @WLMPESM*/ 17354500
*       5 RCAESSWI FIXED(32),        /* Server swap-in delay samples.   17354600
*                                                            @WLMPESM*/ 17354700
*     3 RCAETOTS,                    /* Total execution samples. It is  17354800
*                                       the sum of RCAETOTU, RCAETOTD,  17354900
*                                       RCAEUNKN, RCAEIDLE. Also        17355000
*                                       always includes I/O using/delay 17355100
*                                       samples whether or not I/O      17355200
*                                       samples are included in         17355300
*                                       RCAETOTU/RCAETOTD    @PQC2588*/ 17355400
*       5 RCAETOTS1 FIXED(32),       /* RCAETOTS Word 1      @PQC2588*/ 17355500
*       5 RCAETOTS2 FIXED(32),       /* RCAETOTS Word 2      @PQC2588*/ 17355600
*     3 RCAENDIO FIXED(32),          /* Non-DASD I/O using or delay     17355700
*                                       samples.             @WLMPIOP*/ 17355800
*     3 RCAETOTDQ FIXED(32),        /*  Total delay samples always      17355900
*                                       including batch queue delay.    17356000
*                                       For service classes that        17356100
*                                       contain batch jobs that were    17356200
*                                       not run in WLM managed          17356300
*                                       initiators the batch queue      17356400
*                                       delay samples are derived       17356500
*                                       from the measured batch queue   17356600
*                                       delay time. For service classes 17356700
*                                       that contain only jobs that ran 17356800
*                                       in WLM managed initiators this  17356900
*                                       value is the same as RCEATOTD.  17357000
*                                       RCAETOTDQ can be used as a      17357100
*                                       migration aid to determine      17357200
*                                       what a batch service class      17357300
*                                       period's velocity will be       17357400
*                                       if all its jobs are run in WLM  17357500
*                                       managed initators    @WLMCBAT*/ 17357600
*     3 RCAEDRS3 CHAR(12);           /* Reserved             @WLMCBAT*/ 17357700
* DECLARE                                                               17357800
*  1 RCAEEELA  RCAAVIA BDY(DWORD) BASED,  /* RCAE - Subsystem work      17357900
*                                       manager delays               */ 17358000
*    3 RCAEEENT (2),                 /* An entry in the subsystem work  17358100
*                                       manager delay array          */ 17358200
*      5 RCAESTYP CHAR(4),           /* Subsystem type, as used in the  17358300
*                                       classification rules specified  17358400
*                                       in the WLM administrative       17358500
*                                       application.  The subsystem's   17358600
*                                       documentation should explain    17358700
*                                       the meaning that the product    17358800
*                                       attributes to the various       17358900
*                                       states                       */ 17359000
*      5 RCAEEFLG BIT(8),            /* Flags                        */ 17359100
*        7 RCAEDBE  BIT(1),          /* Represents states sampled in    17359200
*                                       the begin to end phase of a     17359300
*                                       transaction                  */ 17359400
*        7 RCAEEXEC BIT(1),          /* Represents states sampled in    17359500
*                                       the execution phase of a        17359600
*                                       transaction                  */ 17359700
*        7 RCAESRS1 BIT(6),          /* Reserved                     */ 17359800
*      5 RCAESRS2 CHAR(3),           /* Reserved                     */ 17359900
*      5 RCAEESS# FIXED(32),         /* Total number of transaction     17360000
*                                       states sampled in the work      17360100
*                                       phase specified by RCAEEFLG  */ 17360200
*      5 RCAEACTV FIXED(32),         /* Total number of active state    17360300
*                                       samples.  Active indicates that 17360400
*                                       there is a program executing    17360500
*                                       on behalf of the work request,  17360600
*                                       from the perspective of the     17360700
*                                       work manager.  This does not    17360800
*                                       mean that the program is active 17360900
*                                       from the base control program's 17361000
*                                       perspective                  */ 17361100
*      5 RCAERDY  FIXED(32),         /* Total number of ready state     17361200
*                                       samples.  Ready indicates that  17361300
*                                       there is a program ready to     17361400
*                                       execute on behalf of the work   17361500
*                                       request described by the        17361600
*                                       monitoring environment, but the 17361700
*                                       work manager has given priority 17361800
*                                       to another work request      */ 17361900
*      5 RCAEIDL  FIXED(32),         /* Total number of idle state      17362000
*                                       samples.  This indicates the    17362100
*                                       number of times the work        17362200
*                                       manager see a transaction as    17362300
*                                       idle.                        */ 17362400
*      5 RCAEWLOK FIXED(32),         /* Total number of waiting for     17362500
*                                       lock state samples.          */ 17362600
*      5 RCAEWIO  FIXED(32),         /* Total number of waiting for     17362700
*                                       I/O state samples.  Waiting     17362800
*                                       for I/O indicates that the work 17362900
*                                       manager is waiting for an       17363000
*                                       activity related to an I/O      17363100
*                                       request.  This may be an        17363200
*                                       actual I/O operation or some    17363300
*                                       other function associated with  17363400
*                                       the I/O request              */ 17363500
*      5 RCAEWCON FIXED(32),         /* Total number of waiting for     17363600
*                                       conversation state samples.     17363700
*                                       Waiting for conversation may    17363800
*                                       have been used in conjunction   17363900
*                                       with the WLM service IWMMSWCH   17364000
*                                       to identify where the recipient 17364100
*                                       of the conversation is          17364200
*                                       located.  In this case, only    17364300
*                                       the switched state will be      17364400
*                                       recorded.                    */ 17364500
*      5 RCAEWDST FIXED(32),         /* Total number of waiting for     17364600
*                                       distributed request state       17364700
*                                       samples.  Waiting for           17364800
*                                       distributed request indicates a 17364900
*                                       high level that some function   17365000
*                                       or data must be routed prior to 17365100
*                                       resumption of the work request. 17365200
*                                       This is to be contrasted with   17365300
*                                       waiting for conversation, which 17365400
*                                       is a low level view of the      17365500
*                                       precise resource that is        17365600
*                                       needed.  A distributed request  17365700
*                                       could involve waiting on a      17365800
*                                       conversation as part of its     17365900
*                                       processing                   */ 17366000
*      5 RCAEWSL  FIXED(32),         /* Waiting for a session to be     17366100
*                                       established locally.  ie. on    17366200
*                                       the current MVS image        */ 17366300
*      5 RCAEWSN  FIXED(32),         /* Waiting for a session to be     17366400
*                                       established somewhere in the    17366500
*                                       network                      */ 17366600
*      5 RCAEWSS  FIXED(32),         /* Waiting for a session to be     17366700
*                                       established somewhere in the    17366800
*                                       sysplex                      */ 17366900
*      5 RCAEWTMR FIXED(32),         /* Waiting for a timer          */ 17367000
*      5 RCAEWO   FIXED(32),         /* Waiting for another product  */ 17367100
*      5 RCAEWMSC FIXED(32),         /* Waiting for unidentified        17367200
*                                       resource, possibly among        17367300
*                                       another more specific category, 17367400
*                                       but which may not be readily    17367500
*                                       determined                   */ 17367600
*      5 RCAESSL  FIXED(32),         /* State representing transactions 17367700
*                                       for which there are logical     17367800
*                                       continuations on this MVS       17367900
*                                       image.  Subsystem work managers 17368000
*                                       might set this state when they  17368100
*                                       function ship a transaction to  17368200
*                                       another component within the    17368300
*                                       same MVS image               */ 17368400
*      5 RCAESSS  FIXED(32),         /* State representing transactions 17368500
*                                       for which there are logical     17368600
*                                       continuations on another MVS    17368700
*                                       image in the sysplex.           17368800
*                                       Subsystem work managers might   17368900
*                                       set this state when they        17369000
*                                       function ship a transaction to  17369100
*                                       another component on another    17369200
*                                       MVS image within the sysplex */ 17369300
*      5 RCAESSN  FIXED(32),         /* State representing transactions 17369400
*                                       for which there are logical     17369500
*                                       continuations somewhere within  17369600
*                                       the network.  Subsystem work    17369700
*                                       managers might set this state   17369800
*                                       when they function ship a       17369900
*                                       transaction to another          17370000
*                                       component within the network */ 17370100
*      5 RCAEBPMI FIXED(32),         /* Reserved             @PQC2588*/ 17370200
*      5 RCAEBPMC FIXED(32),         /* Reserved             @PQC2588*/ 17370300
*      5 RCAEBPCM FIXED(32),         /* Reserved             @PQC2588*/ 17370400
*      5 RCAECFMI FIXED(32),         /* Reserved             @PQC2588*/ 17370500
*      5 RCAEWNL  FIXED(32);         /* Waiting for new latch           17370600
*                                                            @WLMPENH*/ 17370700
*DCL RCAANAME CHAR(4)  CONSTANT('RCAA');   /* 'RCAA' ACRONYM         */ 17370800
*/********************************************************************/ 17370900
*/*                                                                  */ 17371000
*/* The RCAAVRID and RCAEVRID must be changed if new fields are      */ 17371100
*/* added to any area in the RQAA ouput area (see APAR OW11082).     */ 17371200
*/* This is to keep vendor products aware of changes to the output   */ 17371300
*/* area.                                                            */ 17371400
*/*                                                                  */ 17371500
*/* RQAA_VERSION4 - RQAA_VERSION8 are reserved.                      */ 17371600
*/*                                                          @WLMPMES*/ 17371700
*/********************************************************************/ 17371800
*DCL RCAA_VERSION1 FIXED(8) CONSTANT(1);   /* RCAA version 1.           17380000
*                                       1=HBB5510                    */ 17410000
*DCL RCAA_VERSION2 FIXED(8) CONSTANT(2);   /* RCAA version 2.           17432000
*                                       2=HBB5520            @WA11082*/ 17454000
*DCL RCAA_VERSION3 FIXED(8) CONSTANT(3);   /* RCAA version 3.           17467200
*                                       3=HBB6603            @WLMPIOP*/ 17480400
*DCL RCAA_VERSION4 FIXED(8) CONSTANT(4);   /* RCAA version 4.           17488300
*                                       4=JBB6604            @WLMPBAT*/ 17496200
*DCL RCAA_VERSION9 FIXED(8) CONSTANT(9);   /* RCAA version 9.           17500900
*                                       9=JBB6600            @WLMPMES*/ 17505600
*DCL RCAAVRID FIXED(8) CONSTANT(RCAA_VERSION9);  /* Current version     17510300
*                                       level                @WLMPMES*/ 17515000
*DCL RCAENAME CHAR(4)  CONSTANT('RCAE');   /* 'RCAE' ACRONYM         */ 17520000
*DCL RCAE_VERSION1 FIXED(8) CONSTANT(1);   /* RCAE version 1.           17570000
*                                       1=HBB5510                    */ 17620000
*DCL RCAE_VERSION2 FIXED(8) CONSTANT(2);   /* RCAE version 2.           17650000
*                                       2=HBB5520            @WA11082*/ 17680000
*DCL RCAE_VERSION3 FIXED(8) CONSTANT(3);   /* RCAE version 3.           17698000
*                                       3=HBB6603            @WLMPIOP*/ 17716000
*DCL RCAE_VERSION4 FIXED(8) CONSTANT(4);   /* RCAE version 4.           17726800
*                                       4=JBB6604            @WLMPBAT*/ 17737600
*DCL RCAE_VERSION9 FIXED(8) CONSTANT(9);   /* RCAE version 9.           17744000
*                                       9=JBB6600            @WLMPMES*/ 17750400
*DCL RCAEVRID FIXED(8) CONSTANT(RCAE_VERSION9);  /* Current version     17756800
*                                       level                @WLMPMES*/ 17763200
*/* End of PL/X Source                                               */ 17770000
* %IF IWMWRCAA_LIST ^= 'NO' &                                           17820000
*    ZCBPRINT ^= 'NO' %THEN                                             17870000
*   %GOTO IWMWRCAA_4;                                                   17920000
*   @LIST POP NOECHO;                                                   17970000
* %IWMWRCAA_4:;                                                         18020000
* %END;                                                                 18070000
