*                                                                       00050000
* %DCL IXCYAMDA_INCLUDED CHAR EXT;                                      00064200
* %DEACTIVATE IXCYAMDA_INCLUDED;                                        00078400
* %IF IXCYAMDA_INCLUDED = '' %THEN                                      00092600
* %DO;                                                                  00106800
*/* Macro made bi-lingual on 01019. CBGEN compile date 00290         */ 00127990
*% /*                                                                   00135200
         MACRO                                                          00150000
         IXCYAMDA &DSECT=YES,&LIST=YES,&TITLE=YES,&AMDAREA=YES,        *00170000
               &AMDPATH=COND,&AMDPATH1=COND,&AMDMPEND=COND,            *00197990
               &AMDSYS=COND,&AMDSYS1=COND,&AMDSD=COND,&AMDMEM=COND,    *00205980
               &AMDMEMDI=COND,&AMCTCHDD=COND,&AMSTRHDD=COND,           *00213970
               &AMLSTHDD=COND                                           00221960
         GBLC  &IXCYAMDA_INCLUDED                                       00230000
         GBLC  &ZCBPRINT                                                00250000
&IXCYAMDA_INCLUDED SETC 'YES'                                           00270000
         AIF   ('&LIST' EQ 'NONE').P0                                   00280000
         AIF   ('&TITLE' EQ 'NO').P5                                    00290000
 TITLE   'IXCYAMDA  - XCF Accounting and Measurement Data Area       '  00300000
.P5      ANOP                                                           00315000
**/ IXCYAMDA_1:;                                                        00330000
*/* START OF SPECIFICATIONS ******************************************* 00350000
*                                                                       00400000
*01* PROPRIETARY STATEMENT =                                            00407600
*                                                                       00415200
*    LICENSED MATERIALS - PROPERTY OF IBM                               00422800
*    THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                       00430400
*    5645-001 (C) COPYRIGHT IBM CORP. 1990, 1997                        00438000
*                                                                       00445600
*01* STATUS = HBB6603                                                   00453200
*                                                                       00460800
*01* END OF PROPRIETARY STATEMENT                                       00468400
*                                                                       00476000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00483600
*01* END OF EXTERNAL CLASSIFICATION:                                    00491200
*                                                                       00500000
*01* DESCRIPTIVE NAME:  XCF Accounting and Measurement Data Area        00533300
*02*  ACRONYM:  AMDA                                                    00566600
*                                                                       00600000
*01* MACRO NAME:  IXCYAMDA                                              00650000
*                                                                       00900000
*01* DSECT NAME:                                                        00928500
*     AMDAREA                                                           00957000
*     AMDPATH                                                           00985500
*     AMDMPEND                                                          01014000
*     AMDSYS                                                            01042500
*     AMDSD                                                             01071000
*                                                                       01100000
*01* COMPONENT:  Cross System Coupling Facility (SCXCF)                 01118100
*                                                                       01136200
*01* EYE-CATCHER:  NONE                                                 01154300
*                                                                       01172400
*01* STORAGE ATTRIBUTES:                                                01190500
*02*  SUBPOOL:  User-supplied                                           01208600
*02*  KEY:  Key User-supplied                                           01226700
*02*  RESIDENCY:  User-supplied                                         01244800
*                                                                       01262900
*01* SIZE:  Variable                                                    01281000
*                AMDPATH1 -- X'00BC' bytes                         @03A 01283000
*                AMDSYS1  -- X'0080' bytes                         @03A 01285000
*                AMDMEM   -- X'014C' bytes                         @03A 01287000
*                AMDMEMDI -- X'0040' bytes                         @03A 01289000
*                AMDAREA  -- X'0040' bytes                              01291900
*                AMDPATH  -- X'0078' bytes                              01302800
*                AMDMPEND -- X'004C' bytes                              01313700
*                AMDSYS   -- X'004C' bytes                              01324600
*                AMDSD    -- X'0030' bytes                              01335500
*                AMCTCHDD -- X'0020' bytes                              01346400
*                AMSTRHDD -- X'0020' bytes                              01357300
*                AMLSTHDD -- X'0020' bytes                              01368200
*                                                                       01379100
****                                                                    01381200
*   Note that AMCTCHDD, AMSTRHDD, and AMLSTHDD map storage contained    01383300
*   within the AMDPATH and AMDMPEND data records.                       01385400
*                                                                       01387500
*                                                                       01389600
*01* CREATED BY:                                                        01407700
*     IXCA1MG                                                           01425800
*                                                                       01443900
*01* POINTED TO BY:                                                     01462000
*     DATAAREA_ADDR field in MG parameter list                          01480100
*                                                                       01498200
*01* SERIALIZATION:                                                     01516300
*     None required                                                     01534400
*                                                                       01552500
*01* FUNCTION:                                                          01570600
*02* IXCYAMDA maps the data returned by the                             01588700
*      XCF Measurement Gatherer Service (IXCMG).                        01606800
*                                                                       01638400
*01* METHOD OF ACCESS:                                                  01643000
*02*  ASM: IXCYAMDA                                                     01661100
*02*  PL/AS:                                                            01679200
*          DSECT=YES|NO  -- Request DSECT definition                    01697300
*          AREA=YES|NO --   Request AMDAREA record mapping              01715400
*                           USING on AMDAREA                            01733500
*          PATH=YES|NO --   Request path record mapping                 01751600
*                           USING on AMDPATH                            01769700
*          MPEND=YES|NO --  Request message pending record map          01787800
*                           USING on AMDMPEND                           01805900
*          SYSTEM=YES|NO -- Request system record mapping               01824000
*                           USING on AMDSYS                             01842100
*          SRCDST=YES|NO  -- Request source/dest record mapping         01860200
*                            USING on AMDSD                             01878300
*     Default: DSECT=YES,AREA=YES,PATH=YES,MPEND=YES,SYSTEM=YES,        01900000
*                        SRCDST=YES                                     01950000
*                                                                       02050000
*01* DELETED BY:  User                                                  02075000
*                                                                       02100000
*01* FREQUENCY:  Created for response to MG                             02150000
*                                                                       02200000
*01* DEPENDENCIES:  None.                                               02250000
*                                                                       02300000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     02350000
*                                                                       02400000
*01* CHANGE ACTIVITY:                                                   02450000
*   $L0=COUPLXAM,HBB4410,880308,PDXB: CROSS-SYSTEM COUPLING FACILITY    03775000
*   $D1=DCR0074 ,HBB4410,880725,PDBJ: Add System Name to MPEND, SD      03800000
*   $L1=TCLASS  ,HBB4410,881212,PDBJ: Transport Classes                 03825000
*   $D2=DCR129  ,HBB4410,890417,PDBJ: Add reset indicator AMDSYSGRS     03837500
*   $P1=PEO3840 ,HBB4410,900930,PDBJ: Missing comment delimiter         03843700
*                                     Fix for OY37303                   03846800
*   $01=OY42409 ,HBB4410,901203,PD00BJ: Serial CTC IPL Window           03847600
*   $P2=PKB2255 ,HBB4430,920617,PDEG: Maxmsg customer value display.    03847800
*   $P3=PKB2764 ,HBB4430,920617,PD00BJ: Clarify comments.               03848000
*   $L2=SYSLKTAM,HBB5510,910301,PD00BJ: XES Signalling                  03848400
*   $L3=SYSLKTAM,HBB5510,910901,PD00BJ: XES Signalling                  03849200
*   $L4=SYSLKTAM,HBB5510,930325,PD00BJ: XES Signalling                  03849600
*   $L5=SYSLKTRB,HBB5510,930725,PD00BJ: Additional path states          03849800
*   $L6=XCFBC   ,HBB6603,950707,PD00BJ: Add AMDMEM record               03849900
*   $P4=PQC1215 ,HBB6603,960516,PD002T: Fix prolog problem for showhdr  03866600
*   $D3=DQC028  ,JBB6603,960815,PD00DT: Delete MsgUseSummary record     03874900
*   $02=OW38138 ,HBB6603,990527,PD00BJ: Add I/O timing info             03879100
*   $03=OW37621 ,HBB6606,001215,PD00BJ: Add AMDMEM, AMDALEVEL 1 data    03881100
*                                                                       03883300
* END OF SPECIFICATIONS *********************************************/  03900000
*% /*                                                                   03943400
.P0      ANOP                                                           03965100
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03986800
         AIF   ('&LIST' EQ 'YES').P2                                    04030200
.P1      ANOP                                                           04073600
         PUSH  PRINT                                                    04117000
         PRINT OFF                                                      04160400
.P2      ANOP                                                           04203800
         AIF   ('&AMDAREA' EQ 'NO').L0002                               04247200
         AIF   ('&DSECT' EQ 'YES').L0003                                04290600
         AIF   ('&AMDAREA' NE 'YES').L0002                              04334000
AMDAREA  DS    0F        Data area returned to caller                   04377400
         AGO   .L0004                                                   04420800
.L0003   ANOP                                                           04464200
AMDAREA  DSECT           Data area returned to caller                   04507600
.L0004   ANOP                                                           04551000
AMDATLEN DS    1FL4      Total length of output data area needed to    *04594400
                         contain all the requested information. This   *04637800
                         length includes the area for the records that *04681200
                         were returned on this call.                    04724600
AMDA#PTH DS    1FL4      Number of path entries                         04768000
AMDALPTH DS    1FL4      Length of path data                            04811400
AMDAOPTH DS    1FL4      Offset to path entries                         04854800
AMDA#MPE DS    1FL4      Number of pending message entries              04898200
AMDALMPE DS    1FL4      Length of pending message data                 04941600
AMDAOMPE DS    1FL4      Offset to pending message entries              04985000
AMDA#SYS DS    1FL4      Number of system entries                       05028400
AMDALSYS DS    1FL4      Length of system data                          05071800
AMDAOSYS DS    1FL4      Offset to system entries                       05115200
AMDA#SD  DS    1FL4      Number of source/destination entries.          05158600
AMDALSD  DS    1FL4      Length of source/destination data entries      05202000
AMDAOSD  DS    1FL4      Offset to source/destination entries.          05245400
AMDA#MUS DS    1FL4      Number of member message use summary entries   05262700
AMDALMUS DS    1FL4      Length of member message space summary        *05280000
                         entries                                        05297300
AMDAOMUS DS    1FL4      Offset to member message use summary entries   05314600
AMDAREA_LEN EQU *-AMDAREA                                               05332200
.L0002   ANOP                                                           05375600
         AIF   ('&AMDPATH' EQ 'NO').L0005                               05419000
         AIF   ('&DSECT' EQ 'YES').L0006                                05462400
         AIF   ('&AMDPATH' NE 'YES').L0005                              05505800
AMDPATH  DS    0F        Path activity entry, placed in the data area  *05549200
                         first if requested                             05592600
         AGO   .L0007                                                   05636000
.L0006   ANOP                                                           05679400
AMDPATH  DSECT           Path activity entry, placed in the data area  *05722800
                         first if requested                             05766200
.L0007   ANOP                                                           05809600
AMDPTYPE DS    1BL1      Indication of type of data                     05862990
         ORG   AMDPTYPE                                                 05872980
AMDPTYPP EQU   X'01'     Indicates path data                            05900000
         ORG   AMDPTYPE+X'00000001'                                     05937500
         DS    1BL1      Reserved and set to 0                          05975000
AMDPLENT DS    1FL2      Length of a path entry                         06012500
AMDPNAME DS    1CL0008   System name                                    06050000
AMDPDEV  DS    1CL0004   Device number in EBCDIC of CTC device for     *06087500
                         signalling path. Blanks if not CTC device.     06125000
AMDPDIR  DS    1FL1      Direction of path                              06172490
         ORG   AMDPDIR                                                  06182480
AMDPINB  EQU   X'80'     Inbound path                                   06200000
AMDPOUTB EQU   X'40'     Outbound path                                  06250000
         ORG   AMDPDIR+X'00000001'                                      06293700
         DS    1CL0003   Reserved and set to 0                          06337400
AMDPONME DS    1CL0008   Name of system on other end if known,         *06381100
                         otherwise blanks.                              06424800
AMDPODEV DS    1CL0004   Device number in EBCDIC on the other end if   *06468500
                         known, otherwise blanks.                       06512200
AMDPFLAG DS    1CL0004   Flags                                          06543990
         ORG   AMDPFLAG                                                 06553980
AMDPSTAT DS    1FL1      Path status                                    06563970
         ORG   AMDPSTAT                                                 06573960
AMDPSTRT EQU   X'80'     Starting                                       06600000
AMDPREST EQU   X'40'     Restarting                                     06650000
AMDPWORK EQU   X'20'     Working                                        06700000
AMDPSTOP EQU   X'10'     Stopping                                       06731400
AMDPLINK EQU   X'08'     Waiting for completion of initial protocol    *06762800
                         used to establish communication link.          06794200
AMDPNOP  EQU   X'04'     Not operational. Path defined to XCF but not  *06825600
                         usable until hardware and/or definition       *06857000
                         problems are resolved                          06888400
AMDPFAIL EQU   X'02'     Stop failed.                                   06919800
AMDPRBLD EQU   X'01'     Rebuilding                                     06935500
         ORG   AMDPSTAT+X'00000001'                                     06951200
AMDPSTA2 DS    1FL1      More path status flags                         06964590
         ORG   AMDPSTA2                                                 06967580
AMDPQSCG EQU   X'80'     Quiescing                                      06972000
AMDPQSCD EQU   X'40'     Quiesced                                       06982400
         ORG   AMDPSTA2+X'00000001'                                     06992800
         DS    1CL0002   Reserved and set to 0                          07003200
AMDPMRET DS    1FL4      Path retry limit                               07014000
AMDP#RET DS    1FL4      Current path retry count                       07045400
AMDP#RST DS    1FL4      Cumulative number of restarts                  07076800
AMDPMXMS DS    1FL4      Path maximum message limit. This value is the *07081600
                         customer specified value for the number of 1K *07086400
                         byte blocks of message buffer space           *07091200
                         associated with this signalling path. For an  *07096000
                         inbound path, this is the maximum amount of   *07100800
                         buffer space that can be used by the path.    *07105600
                         For an outbound path, this is the amount of   *07110400
                         buffer space contributed by this path to the  *07115200
                         total buffer space available for sending      *07120000
                         messages to the system on the other end using  07124800
*                        the transport class to which this path is     *07129600
                         assigned.                                      07134400
AMDP#SIG DS    1FL4      For an outbound (inbound) path, the total     *07139600
                         number of signals sent (received) over the    *07171000
                         path. N/A for structure summary (Hardware     *07202400
                         type 2)                                        07233800
AMDP#ACT DS    1FL4      For an outbound path, the current number of   *07275190
                         signals pending transfer on the path. N/A for *07296600
                         structure summary (Hardware type 2)            07328000
         ORG   AMDP#ACT                                                 07338000
AMDP#IBR DS    1FL4      For an inbound path, the total number of      *07359400
                         times a request for a new message buffer was  *07390800
                         refused due to the maximum message limit for  *07422200
                         the path. N/A for structure summary (Hardware *07453600
                         type 2)                                        07485000
AMDP#SUS DS    1FL4      For an outbound path, the total number of     *07516400
                         signal requests satisfied by this path while  *07547800
                         not busy. For an inbound path, reserved and   *07579200
                         set to 0. N/A for structure summary (Hardware *07610600
                         type 2)                                        07642000
AMDP#APP DS    1FL4      For an outbound path, the total number of     *07683390
                         signal requests satisfied by this path while  *07704800
                         busy. N/A for structure summary (Hardware     *07716200
                         type 2)                                        07730590
         ORG   AMDP#APP                                                 07733580
AMDPIOXT DS    1FL4      For an inbound path, the average I/O transfer *07739000
                         time, expressed in microseconds, for the most *07750400
                         recently received signals. Zero if not        *07766790
                         available (no recent signals or sending       *07773200
                         system does not provide the necessary data).  *07784600
                         'FFFFFFFF'x if overflow (implies average      *07796000
                         exceeds approximately 35 minutes). N/A for    *07814390
                         structure summary (Hardware type 2)            07821380
AMDP#USE DS    1FL4      Count of the current number of 1K byte blocks *07830400
                         of message buffer space in use by this        *07861800
                         signalling path. N/A for structure summary    *07893200
                         (Hardware type 2)                              07924600
AMDPMGRS DS    1FL4      Measurement Gatherer Reset Data indicator,    *07935000
                         changes when counts for this path entry have  *07945400
                         been reset. Use this token to determine       *07955800
                         whether or not the data collected from two    *07966200
                         different invocations of the IXCMG service    *07976600
                         are comparable. If the token is the same for  *07987000
                         both sets of data, it makes sense to compare  *07997400
                         the data. If the token is different, the two  *08007800
                         sets of data are not comparable since they    *08018200
                         refer to two different instances of the        08028600
*                        indicated signalling path.                     08039000
AMDPTCN  DS    1CL0008   Transport Class Name. For an outbound path,   *08050200
                         the class to which the path is assigned.      *08081600
                         Blanks for an inbound path.                    08113000
AMDPPHDT DS    1FL4      Type of hardware being used as the transport  *08144400
                         mechanism for the signalling path. See        *08175800
                         AMHDTxxx constants.                            08207200
AMDPPHDD DS    1CL0032   Path hardware descriptor. See AMxxxHDD        *08238600
                         mappings below.                                08270000
AMDPATH_LEN EQU *-AMDPATH                                               08301400
.L0005   ANOP                                                           08332800
         AIF   ('&AMDPATH1' EQ 'NO').L0008                              08374190
         AIF   ('&DSECT' EQ 'YES').L0009                                08395600
         AIF   ('&AMDPATH1' NE 'YES').L0008                             08436990
AMDPATH1 DS    0F        Path activity entry, returned when            *08446980
                         AMDALEVEL=1 specified on IXCMG.                08456970
         AGO   .L000A                                                   08489800
.L0009   ANOP                                                           08521200
AMDPATH1 DSECT           Path activity entry, returned when            *08562590
                         AMDALEVEL=1 specified on IXCMG.                08572580
.L000A   ANOP                                                           08584000
         DS    1CL0120   Mapped by AMDPATH                              08616090
AMDPATH1_BUFFLEN DS 1FL4 Maximum number of bytes of message data that  *08616780
                         will fit into the signal buffers that are     *08617470
                         currently used by the signalling path. Zero   *08618160
                         if signal buffers are not relevant to the     *08618850
                         path. N/A for structure summary (Hardware     *08619540
                         type 2)                                        08620230
AMDPATH1_TRANSFERRATE DS 1FL4 For an outbound path, transfer rate      *08620920
                         value expressed in microseconds, that was     *08621610
                         last reported by the inbound side of the      *08622300
                         path. Zero if not available (no recent        *08622990
                         signals or sending system does not provide    *08623680
                         the necessary data or path is not relevant    *08624370
                         for signal transfers). 'FFFFFFFF'x if         *08625060
                         overflow (implies average exceeds             *08625750
                         approximately 35 minutes). N/A for inbound    *08626440
                         paths. N/A for structure summary (Hardware     08627130
*                        type 2)                                        08627820
AMDPATH1_#PENDINGDELIVERY DS 1FL4 For an inbound path, the number of   *08628510
                         signal buffers currently engaged in some      *08629200
                         phase of delivering a message that was        *08629890
                         received over the path. N/A for outbound      *08630580
                         paths. N/A for structure summary (Hardware    *08631270
                         type 2)                                        08631960
AMDPATH1_SIGNAL# DS 1FL4 For an outbound path, the signal number       *08632650
                         assigned to the most recent signal queued for *08633340
                         transfer over the path (contrast with         *08634030
                         AMDP#SIG which includes only user signals).   *08634720
                         For an inbound path, the signal number of the *08635410
                         signal that was most recently received. These *08636100
                         numbers are not necessarily ever increasing.  *08636790
                         N/A for structure summary (Hardware type 2)    08637480
         DS    1CL0052   Reserved for future use                        08638170
AMDPATH1_LEN EQU *-AMDPATH1                                             08638860
.L0008   ANOP                                                           08639550
         AIF   ('&AMDMPEND' EQ 'NO').L000B                              08640240
         AIF   ('&DSECT' EQ 'YES').L000C                                08640930
         AIF   ('&AMDMPEND' NE 'YES').L000B                             08641620
AMDMPEND DS    0F        Pending messages entry                         08642310
         AGO   .L000D                                                   08643000
.L000C   ANOP                                                           08643690
AMDMPEND DSECT           Pending messages entry                         08644380
.L000D   ANOP                                                           08645070
AMDMTYPE DS    1BL1      Indication of type of data                     08645760
         ORG   AMDMTYPE                                                 08646450
AMDMTYPM EQU   X'02'     Indicates pending message data                 08650000
         ORG   AMDMTYPE+X'00000001'                                     08670400
         DS    1BL1      Reserved and set to 0                          08690800
AMDMLENT DS    1FL2      Length of a pending message entry              08711200
AMDMDEVN DS    1CL0004   Device number (EBCDIC) of CTC device for      *08731600
                         signalling path on which message is pending.  *08752000
                         Blanks if not associated with any signalling  *08772400
                         path or not a CTC device.                      08792800
AMDMTOKN DS    1BL8      Member token of message sender                 08813200
AMDMASID DS    1FL2      ASID of member sending message                 08833600
AMDMHOME DS    1FL2      Home ASID that initiated message out request   08854000
AMDMTSNM DS    1CL0008   Name of system that is target of message       08874400
AMDMMSGL DS    1FL4      Length of message which is pending             08894800
AMDMTCN  DS    1CL0008   Name of transport class selected for          *08915200
                         transferring the message, blanks if class not *08935600
                         yet selected.                                  08956000
AMDMPHDT DS    1FL4      Type of hardware being used as the transport  *08976400
                         mechanism for the signalling path. Indicates  *08996800
                         not applicable if the message is not          *09017200
                         currently pending transfer over a particular  *09037600
                         signalling path.                               09058000
AMDMPHDD DS    1CL0032   Path hardware descriptor. Not applicable if   *09078400
                         message is not currently pending transfer     *09098800
                         over a particular signalling path. See        *09119200
                         AMxxxHDD mappings below.                       09139600
AMDMPEND_LEN EQU *-AMDMPEND                                             09160000
.L000B   ANOP                                                           09190390
         AIF   ('&AMDSYS' EQ 'NO').L000E                                09200380
         AIF   ('&DSECT' EQ 'YES').L000F                                09210370
         AIF   ('&AMDSYS' NE 'YES').L000E                               09220360
AMDSYS   DS    0F        System entry. There are two or more system    *09262000
                         entries per remote system (1 inbound entry    *09282400
                         plus 1 outbound entry per transport class).   *09302800
                         One entry per transport class for the local   *09323200
                         system.                                        09343600
         AGO   .L0010                                                   09373990
.L000F   ANOP                                                           09383980
AMDSYS   DSECT           System entry. There are two or more system    *09404800
                         entries per remote system (1 inbound entry    *09425200
                         plus 1 outbound entry per transport class).   *09445600
                         One entry per transport class for the local   *09466000
                         system.                                        09486400
.L0010   ANOP                                                           09516790
AMDSYTYP DS    1BL1      Indication of type of data                     09526780
         ORG   AMDSYTYP                                                 09536770
AMDSYTYE EQU   X'04'     Indicates system data                          09550000
         ORG   AMDSYTYP+X'00000001'                                     09591600
         DS    1BL1      Reserved and set to 0                          09633200
AMDSYLEN DS    1FL2      Length of system entry                         09674800
AMDSYNME DS    1CL0008   System name, blanks if not known               09716400
AMDSYDIR DS    1FL1      Direction                                      09767990
         ORG   AMDSYDIR                                                 09777980
AMDSYIN  EQU   X'80'     Inbound                                        09800000
AMDSYOUT EQU   X'40'     Outbound                                       09850000
AMDSYLCL EQU   X'20'     Local                                          09900000
         ORG   AMDSYDIR+X'00000001'                                     09915800
         DS    1CL0003   Reserved and set to 0                          09931600
AMDSYPTH DS    1FL4      Current number of paths in service. If local  *09947400
                         entry, set to 0. If outbound entry, count is  *09963200
                         for indicated transport class.                 09979000
AMDSYBSY DS    1FL4      Total number of times a no buffer condition   *09994800
                         occurred. Subject to wrapping. If local or    *10010600
                         outbound entry, count is for indicated        *10026400
                         transport class.                               10042200
AMDSYNOP DS    1FL4      Total number of times a no path condition     *10058000
                         occurred. Subject to wrapping. If local       *10073800
                         entry, set to 0. If outbound entry, count is  *10089600
                         for indicated transport class.                 10105400
AMDSYMXB DS    1FL4      Current maximum number of 1K byte blocks of   *10121200
                         message buffer space permitted for system. If *10137000
                         local or outbound entry, count is for         *10152800
                         indicated transport class.                     10168600
AMDSYUSE DS    1FL4      Current number of 1K byte blocks of message   *10184400
                         buffer space in use on system. If local or    *10200200
                         outbound system entry, count is for indicated *10216000
                         transport class.                               10231800
AMDSYNUM DS    1FL4      System Token. Changes when all counts for the *10236100
                         system named by AMDSYNME have been reset. Use *10240400
                         this token to determine whether or not the    *10244700
                         data collected from two different invocations *10249000
                         of the IXCMG service are comparable. If the   *10253300
                         token is the same for both sets of data, it   *10257600
                         makes sense to compare the data. If the token *10261900
                         is different, the two sets of data are not    *10266200
                         comparable since they refer to two different  *10270500
                         instances of the named system.                 10274800
AMDSYBIG DS    1FL4      Total number of messages sent whose length    *10279200
                         exceeded the buffer size that supports the    *10295000
                         defined transport class length. Zero if       *10310800
                         inbound entry. Subject to wrapping.            10326600
AMDSYFIT DS    1FL4      Total number of messages sent whose length    *10342400
                         fit the buffer size that supports the defined *10358200
                         transport class length. Zero if inbound       *10374000
                         entry. Subject to wrapping.                    10389800
AMDSYSML DS    1FL4      Total number of messages sent whose length    *10405600
                         was smaller than buffer size that supports    *10421400
                         the defined transport class length. Zero if   *10437200
                         inbound entry. Subject to wrapping.            10453000
AMDSYOVR DS    1FL4      Total number of messages sent whose length    *10468800
                         exceeded the buffer size for which the        *10484600
                         signalling service was optimized. Zero if     *10500400
                         inbound entry. Subject to wrapping.            10516200
AMDSYTCL DS    1FL4      Length of longest message that fits the       *10532000
                         buffer size that supports the defined         *10547800
                         transport class length. Zero if inbound       *10563600
                         entry.                                         10579400
AMDSYTCN DS    1CL0008   Transport Class Name to which the data        *10595200
                         applies. Blanks if inbound entry.              10611000
AMDSYGRS DS    1FL4      Measurement Gatherer Reset Data indicator,    *10616200
                         changes when counts for the transport class   *10621400
                         named by AMDSYTCN have been reset. Note that  *10626600
                         if AMDSYNUM field has changed, then counts    *10631800
                         have been reset even though AMDSYGRS may not  *10637000
                         have changed. Zero if inbound entry. Use this *10642200
                         token to determine whether or not the data    *10647400
                         collected from two different invocations of   *10652600
                         the IXCMG service are comparable. If the      *10657800
                         token is the same for both sets of data, it    10663000
*                        makes sense to compare the data. If the token *10668200
                         is different, the two sets of data are not    *10673400
                         comparable since they refer to two different  *10678600
                         instances of the indicated transport class    *10683800
                         definition                                     10689000
AMDSYSMX DS    1FL4      Customer defined maxmsg value. Default number *10694200
                         of 1K byte blocks of message buffer space. If *10699400
                         local or outbound entry, count is for         *10704600
                         transport class. This value can be modified   *10709800
                         via SETXCF command.                            10715000
AMDSYS_LEN EQU *-AMDSYS                                                 10721600
.L000E   ANOP                                                           10738390
         AIF   ('&AMDSYS1' EQ 'NO').L0011                               10739380
         AIF   ('&DSECT' EQ 'YES').L0012                                10740370
         AIF   ('&AMDSYS1' NE 'YES').L0011                              10741360
AMDSYS1  DS    0F        System entry. This is the mapping to use for  *10742350
                         system data when the IXCMG service is invoked *10743340
                         with AMDALEVEL >= 1. NOTE: These records are  *10744330
                         variable length. AMDSYLEN *must* be used to   *10745320
                         increment to the next AMDSYS1 entry.           10746310
         AGO   .L0013                                                   10747300
.L0012   ANOP                                                           10748290
AMDSYS1  DSECT           System entry. This is the mapping to use for  *10749280
                         system data when the IXCMG service is invoked *10750270
                         with AMDALEVEL >= 1. NOTE: These records are  *10751260
                         variable length. AMDSYLEN *must* be used to   *10752250
                         increment to the next AMDSYS1 entry.           10753240
.L0013   ANOP                                                           10754230
AMDSYS1F DS    1CL0112                                                  10755220
         ORG   AMDSYS1F                                                 10756210
         DS    1CL0076   This area is mapped by AMDSYS as usual.        10757200
         DS    1CL0032   Reserved.                                      10758190
AMDSYS1_#MSGSIZES DS 1FL4 Number of entries in the AMDSYS1_MsgSizes    *10759180
                         array. Could be zero.                          10760170
AMDSYS1V DS    0C                                                       10761160
AMDSYS1_MSGSIZES DS 1CL0016 Array of msg size data                      10762150
         ORG   AMDSYS1_MSGSIZES                                         10763140
AMDSYS1_BUFFLEN DS 1FL4  maximum number of bytes of message data that  *10764130
                         fit in the message buffer                      10765120
AMDSYS1_SIGNALCNT DS 1FL4 Number of signals that could have used a     *10766110
                         signal buffer of the indicated size. Subject  *10767100
                         to wrapping.                                   10768090
         DS    1CL0008   Reserved.                                      10769080
AMDSYS1_LEN EQU *-AMDSYS1                                               10770070
.L0011   ANOP                                                           10771060
         AIF   ('&AMDSD' EQ 'NO').L0014                                 10772050
         AIF   ('&DSECT' EQ 'YES').L0015                                10773040
         AIF   ('&AMDSD' NE 'YES').L0014                                10774030
AMDSD    DS    0F        Source/destination entry, one per member.      10800600
         AGO   .L0016                                                   10826390
.L0015   ANOP                                                           10836380
AMDSD    DSECT           Source/destination entry, one per member.      10848000
.L0016   ANOP                                                           10872790
AMDSTYPE DS    1BL1      Indication of type of data                     10881780
         ORG   AMDSTYPE                                                 10890770
AMDSTYPS EQU   X'08'     Indicates source/destination data              10900000
         ORG   AMDSTYPE+X'00000001'                                     10912200
         DS    1BL1      Reserved and set to 0                          10924400
AMDSLENT DS    1FL2      Length of a source/destination entry           10936600
AMDSGRP  DS    1CL0008   Eight byte group name                          10948800
AMDSMEM  DS    1CL0016   Member name                                    10961000
AMDSSCNT DS    1FL4      Total number of signals sent by the member     10973200
AMDSRCNT DS    1FL4      Total number of signals received by the       *10985400
                         member                                         10997600
AMDSMGRS DS    1FL4      Measurement Gatherer Reset Data indicator,    *11001600
                         changes when counts for this member entry     *11005600
                         have been reset. Use this token to determine  *11009600
                         whether or not the data collected from two    *11013600
                         different invocations of the IXCMG service    *11017600
                         are comparable. If the token is the same for  *11021600
                         both sets of data, it makes sense to compare  *11025600
                         the data. If the token is different, the two  *11029600
                         sets of data are not comparable since they    *11033600
                         refer to two different instances of the        11037600
*                        indicated member.                              11041600
AMDSSNAM DS    1CL0008   Name of system on which member resides         11046400
AMDSD_LEN EQU  *-AMDSD                                                  11046500
.L0014   ANOP                                                           11046600
         AIF   ('&AMDMEM' EQ 'NO').L0017                                11046700
         AIF   ('&DSECT' EQ 'YES').L0018                                11046800
         AIF   ('&AMDMEM' NE 'YES').L0017                               11046900
AMDMEM   DS    0F        Member data entry                              11047000
         AGO   .L0019                                                   11047100
.L0018   ANOP                                                           11047200
AMDMEM   DSECT           Member data entry                              11047300
.L0019   ANOP                                                           11047400
AMDMEM_HDR DS  1CL0268                                                  11047500
         ORG   AMDMEM_HDR                                               11047600
AMDMEM_TYPE DS 1BL1      Indicates type of data                         11047700
         ORG   AMDMEM_TYPE                                              11047800
AMDMEM_TYPEMEM EQU X'10' Indicates member data                          11047900
         ORG   AMDMEM_TYPE+X'00000001'                                  11048000
         DS    1BL1      Reserved and set to 0                          11048100
AMDMEM_LENGTH DS 1FL2    Number of bytes of data returned in this      *11048200
                         entry. CAUTION: records are variable length   *11048300
                         since a variable number of AMDMEMDI data      *11048400
                         items may be returned.                         11048500
AMDMEM_GROUPNAME DS 1CL0008 XCF group name                              11048600
AMDMEM_MEMBERNAME DS 1CL0016 XCF Member name                            11048700
AMDMEM_JOBNAME DS 1CL0008 Member's jobname                              11048800
AMDMEM_SYSNAME DS 1CL0008 Name of system on which member resides        11048900
AMDMEM_MEMBERTOKEN DS 1BL8 XCF member token for the indicated member.  *11049000
                         Use this token to determine whether or not    *11049100
                         the data collected from two different         *11049200
                         invocations of the IXCMG service are          *11049300
                         comparable. If the token is the same for both *11049400
                         sets of data, it makes sense to compare the   *11049500
                         data. If the token is different, the two sets *11049600
                         of data are not comparable since they refer   *11049700
                         to two different instances of the indicated   *11049800
                         member.                                        11049900
AMDMEM_SYSTOKEN DS 1FL4  XCF system token for the system where the     *11050000
                         member resides.                                11050100
         DS    1CL0002   reserved                                       11050200
AMDMEM_ASID DS 1FL2      Member's address space                         11050300
AMDMEM_MSGOACCEPTED DS 1FL4 Cumulative count of messages accepted for  *11050400
                         delivery by the IXCMSGO service. Subject to   *11050500
                         wrapping.                                      11050600
AMDMEM_MSGONOBUFFER DS 1FL4 Total number of messages rejected by the   *11050700
                         IXCMSGO service for lack of a message buffer. *11050800
                         Subject to wrapping.                           11050900
AMDMEM_MSGIRECEIVED DS 1FL4 Cumulative count of messages that were to  *11051000
                         be delivered to the member. Includes both     *11051100
                         local and remote messages. Subject to         *11051200
                         wrapping.                                      11051300
AMDMEM_MSGICURRWORKITEMS DS 1FL4 The number of signal work items       *11051400
                         currently queued for processing. Usually a    *11051500
                         work item represents a message that is to be  *11051600
                         delivered, but they could include internal    *11051700
                         XCF work that needs to be performed.           11051800
AMDMEM_MSGITRANSFERS DS 1FL4 Cumulative count of remote signals that   *11051900
                         were received on behalf of the member.        *11052000
                         Subject to wrapping.                           11052100
AMDMEM_MSGOTRANSFERTIME DS 1FL4 For inbound remote signals, the        *11052200
                         average message transfer time, expressed in   *11052300
                         microseconds, for the most recently received  *11052400
                         signals. Zero if not available (no recent     *11052500
                         signals or sending system does not provide    *11052600
                         the necessary data). 'FFFFFFFF'x if overflow  *11052700
                         (implies average exceeds approximately 35     *11052800
                         minutes). Message transfer is measured from   *11052900
                         the time that XCF accepts delivery of the     *11053000
                         message on the sending system to the time      11053100
*                        that (each signal for the) message arrives on *11053200
                         the target system and can be                  *11053300
                         scheduled/queued/collected for delivery to    *11053400
                         the target member.                             11053500
AMDMEM_GRPXRECEIVED DS 1FL4 Cumulative count of group events that were *11053600
                         to be delivered to the member. Subject to     *11053700
                         wrapping.                                      11053800
AMDMEM_GRPXCURRWORKITEMS DS 1FL4 The number of group work items        *11053900
                         currently queued for processing.               11054000
         DS    1CL0172   Reserved                                       11054100
AMDMEM_#DATAITEMS DS 1FL4 Number of data items in the following array   11054200
AMDMEM_DATAITEMS DS 1CL0064 Array of data items. Each entry is mapped  *11054300
                         by AMDMEMDI.                                   11054400
AMDMEM_LEN EQU *-AMDMEM                                                 11054500
.L0017   ANOP                                                           11054600
         AIF   ('&AMDMEMDI' EQ 'NO').L001A                              11054700
         AIF   ('&DSECT' EQ 'YES').L001B                                11054800
         AIF   ('&AMDMEMDI' NE 'YES').L001A                             11054900
AMDMEMDI DS    0F        Member data item                               11055000
         AGO   .L001C                                                   11055100
.L001B   ANOP                                                           11055200
AMDMEMDI DSECT           Member data item                               11055300
.L001C   ANOP                                                           11055400
AMDMEMDI_HDR DS 1CL0004                                                 11055500
         ORG   AMDMEMDI_HDR                                             11055600
AMDMEMDI_DATATYPE DS 1FL1 Indicates the format of AMDMEMDI_Data. Your  *11055700
                         program should skip data items whose type it  *11055800
                         does not recognize. New data types may be     *11055900
                         added at any time.                             11056000
AMDMEMDI_SUBJECT DS 1FL1 Subject of the data item                       11056100
AMDMEMDI_FLAGS DS 1BL1                                                  11056200
         ORG   AMDMEMDI_FLAGS                                           11056300
AMDMEMDI_STALLED EQU X'80' ON if data item could be related to a hang  *11056400
                         condition.                                     11056500
         ORG   AMDMEMDI_FLAGS+X'00000001'                               11056600
         DS    1CL0001   Reserved                                       11056700
AMDMEMDI_DATA DS 1CL0060                                                11056800
         ORG   AMDMEMDI_DATA                                            11056900
AMDMEMDI_EXITROUTINES DS 1CL0060 DataType 001: exits                    11057000
         ORG   AMDMEMDI_EXITROUTINES                                    11057100
AMDMEMDIXR_TOKEN DS 1AL4 exit routine token                             11057200
AMDMEMDIXR_FUNCTIONCODE DS 1CL0002 EBCDIC eyecatcher to indicate       *11057300
                         function to be performed.                      11057400
         DS    1CL0002   Reserved                                       11057500
AMDMEMDIXR_TODWHENCALLED DS 1CL0008 TOD when exit was called. Hex zero *11057600
                         if exit not yet called.                        11057700
AMDMEMDIXR_TODWHENRETURNED DS 1CL0008 TOD when exit returned. Hex zero *11057800
                         if exit not yet returned.                      11057900
AMDMEMDIXR_PROCESSSTAGE DS 1FL4 If exit not yet returned, identifies   *11058000
                         current stage of processing.                   11058100
         DS    1CL0032   reserved                                       11058200
         ORG   AMDMEMDI_DATA                                            11058300
AMDMEMDI_WORKITEM DS 1CL0060 DataType 002: work items                   11058400
         ORG   AMDMEMDI_WORKITEM                                        11058500
AMDMEMDIWI_TOKEN DS 1AL4 work item token                                11058600
AMDMEMDIWI_FUNCTIONCODE DS 1CL0002 EBCDIC eyecatcher to indicate       *11058700
                         function to be performed.                      11058800
         DS    1CL0002   Reserved                                       11058900
AMDMEMDIWI_TODWHENCREATED DS 1CL0008 TOD when work item was created.    11059000
AMDMEMDIWI_ITEM# DS 1FL4 work item number                               11059100
         DS    1CL0040   reserved                                       11059200
         ORG   AMDMEMDI_DATA                                            11059300
AMDMEMDI_MSGSIZES DS 1CL0040 DataType 003: msg sizes                    11059400
         ORG   AMDMEMDI_MSGSIZES                                        11059500
AMDMEMDIMS_BUFFLEN DS 1FL4 maximum number of bytes of message data     *11059600
                         that fit in the message buffer                 11059700
AMDMEMDIMS_MSGOREMOTESENT DS 1FL4 Number of remote signals sent that   *11059800
                         could have used a signal buffer of this size. *11059900
                         Subject to wrapping.                           11060000
AMDMEMDIMS_MSGOLOCALSENT DS 1FL4 Number of local signals sent that     *11060100
                         could have used a signal buffer of this size. *11060200
                         Subject to wrapping.                           11060300
         DS    1CL0028   reserved                                       11060400
         ORG   AMDMEMDI_DATA+X'0000003C'                                11060500
AMDMEMDI_XRDATATYPE EQU 1 exit routine                                  11060600
AMDMEMDI_WIDATATYPE EQU 2 work item                                     11060700
AMDMEMDI_MSDATATYPE EQU 3 message sizes                                 11060800
AMDMEMDI_NOSUBJECT EQU 0 global subject                                 11060900
AMDMEMDI_GPSUBJECT EQU 1 group services                                 11061000
AMDMEMDI_SISUBJECT EQU 2 signalling services                            11061100
AMDMEMDI_KNOSTAGE EQU 0  no stage identified                            11061200
AMDMEMDI_KPENDINGSTAGE EQU 1 Processing is pending. For example, SRB   *11061300
                         scheduled but not yet run.                     11061400
AMDMEMDI_KSETUPSTAGE EQU 2 Doing setup work to prepare to do the       *11061500
                         desired processing.                            11061600
AMDMEMDI_KRUNNINGSTAGE EQU 3 In midst of doing the desired processing.  11061700
*                                                                       11070600
* ********************************************************************* 11070800
**                                                                   ** 11083000
**             Constants for Hardware Descriptor Types               ** 11095200
**                                                                   ** 11107400
****************************************************************        11119600
*                                                                       11131800
*                                                                       11144000
AMHDTNA  EQU   0         Hardware type not applicable, ignore hardware *11156200
                         descriptor data.                               11168400
AMHDTCTC EQU   1         CTC device.                                    11180600
AMHDTSTR EQU   2         CF Structure (summary)                         11192800
AMHDTLST EQU   3         A list within a CF structure                   11205000
AMDMEMDI_LEN EQU *-AMDMEMDI                                             11225190
.L001A   ANOP                                                           11233180
*                                                                       11241600
* ********************************************************************* 11253800
**                                                                   ** 11266000
**               Mappings for Hardware Descriptor Data               ** 11278200
**                                                                   ** 11290400
****************************************************************        11302600
*                                                                       11314800
*                                                                       11327000
         AIF   ('&AMCTCHDD' EQ 'NO').L001D                              11348190
         AIF   ('&DSECT' EQ 'YES').L001E                                11357180
         AIF   ('&AMCTCHDD' NE 'YES').L001D                             11366170
AMCTCHDD DS    0F        Path hardware descriptor for CTC devices.      11375800
         AGO   .L001F                                                   11395990
.L001E   ANOP                                                           11403980
AMCTCHDD DSECT           Path hardware descriptor for CTC devices.      11412400
.L001F   ANOP                                                           11430590
AMCTCDEV DS    1CL0004   Device number (EBCDIC)                         11436800
         DS    1CL0028   Unused, set to zero.                           11449000
AMCTCHDD_LEN EQU *-AMCTCHDD                                             11461200
.L001D   ANOP                                                           11482390
         AIF   ('&AMSTRHDD' EQ 'NO').L0020                              11491380
         AIF   ('&DSECT' EQ 'YES').L0021                                11500370
         AIF   ('&AMSTRHDD' NE 'YES').L0020                             11509360
AMSTRHDD DS    0F        Path hardware descriptor for a CF List        *11522200
                         structure.                                     11534400
         AGO   .L0022                                                   11554590
.L0021   ANOP                                                           11562580
AMSTRHDD DSECT           Path hardware descriptor for a CF List        *11571000
                         structure.                                     11583200
.L0022   ANOP                                                           11601390
AMSTRNAM DS    1CL0016   Structure name (EBCDIC)                        11607600
AMSTR#AV DS    1FL4      Number of lists that remain available for use *11619800
                         (either as PATHIN or PATHOUT). Zero if list   *11627300
                         structure is considered inoperative.           11634800
AMSTR#OD DS    1FL4      Number of other systems connected to this     *11642300
                         structure that desire to establish signalling *11649800
                         paths in the opposite direction. This system  *11657300
                         is not included in the count. The count is    *11664800
                         zero if the list structure is considered      *11672300
                         inoperative.                                   11679800
AMSTR#LP DS    1FL4      Number of list signalling paths started by    *11687300
                         this system in the indicated direction for    *11694800
                         this list structure. The count includes       *11702300
                         inoperative list paths.                        11709800
         DS    1CL0004   Unused, set to zero.                           11717400
AMSTRHDD_LEN EQU *-AMSTRHDD                                             11729600
.L0020   ANOP                                                           11750790
         AIF   ('&AMLSTHDD' EQ 'NO').L0023                              11759780
         AIF   ('&DSECT' EQ 'YES').L0024                                11768770
         AIF   ('&AMLSTHDD' NE 'YES').L0023                             11777760
AMLSTHDD DS    0F        Path hardware descriptor for a particular     *11790600
                         list within a CF List structure                11802800
         AGO   .L0025                                                   11822990
.L0024   ANOP                                                           11830980
AMLSTHDD DSECT           Path hardware descriptor for a particular     *11839400
                         list within a CF List structure                11851600
.L0025   ANOP                                                           11869790
AMLSTSTR DS    1CL0016   Structure name (EBCDIC)                        11876000
AMLSTNUM DS    1FL4      List number                                    11888200
         DS    1CL0012   Unused, set to zero.                           11900400
AMLSTHDD_LEN EQU *-AMLSTHDD                                             11912600
.L0023   ANOP                                                           11930790
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 11937000
         AIF   ('&LIST' EQ 'YES').P4                                    11949200
.P3      ANOP                                                           11961400
         POP   PRINT                                                    11973600
.P4      ANOP                                                           11985800
.P_EXIT  ANOP                                                           11998000
         MEND                                                           12010200
**/ IXCYAMDA_2:;                                                        12022400
* %IXCYAMDA_INCLUDED = 'YES';                                           12034600
* %DCL ZCBPRINT CHAR EXT;                                               12046800
* %DEACTIVATE ZCBPRINT;                                                 12059000
* %DCL IXCYAMDA_LIST CHAR EXT;                                          12071200
* %DEACTIVATE IXCYAMDA_LIST;                                            12083400
* %IF IXCYAMDA_LIST ^= 'NO' &                                           12095600
*    ZCBPRINT ^= 'NO' %THEN                                             12107800
*   %GOTO IXCYAMDA_3;                                                   12120000
*   @LIST PUSH NOECHO;                                                  12132200
*   @LIST NOASSEMBLE NOECHO;                                            12144400
*   @LIST OFF C NOECHO;                                                 12156600
* %IXCYAMDA_3:;                                                         12168800
*/* Start of PL/X Source                                             */ 12181000
* %IF AMDA_ALET = '' %THEN                                              12200000
*   %AMDA_ALET = '0';                                                   12250000
* %AMDA_VIA='';                                                         12300000
* %IF AMDA_ALET^='0' %THEN                                              12350000
*  %AMDA_VIA='VIA(AMDA_ALET)';                                          12400000
*   DECLARE                                                             12450000
*     1    AMDAREA BASED AMDA_VIA, /* Data area returned to caller  */  12500000
*      2    AMDATLEN FIXED(32),     /* Total length of output data area 12550000
*                                      needed to contain all the        12600000
*                                      requested information.  This     12650000
*                                      length includes the area for     12700000
*                                      the records that were returned   12750000
*                                      on this call.                 */ 12800000
*      2    AMDA#PTH FIXED(32),     /* Number of path entries        */ 12850000
*      2    AMDALPTH FIXED(32),     /* Length of path data           */ 12900000
*      2    AMDAOPTH FIXED(32),     /* Offset to path entries        */ 12950000
*                                                                       13000000
*      2    AMDA#MPE FIXED(32),     /* Number of pending message        13050000
*                                      entries                       */ 13100000
*      2    AMDALMPE FIXED(32),     /* Length of pending message        13150000
*                                      data                          */ 13200000
*      2    AMDAOMPE FIXED(32),     /* Offset to pending message        13250000
*                                      entries                       */ 13300000
*                                                                       13350000
*      2    AMDA#SYS FIXED(32),     /* Number of system entries      */ 13400000
*      2    AMDALSYS FIXED(32),     /* Length of system data         */ 13450000
*      2    AMDAOSYS FIXED(32),     /* Offset to system entries      */ 13500000
*                                                                       13550000
*      2    AMDA#SD  FIXED(32),     /* Number of source/destination     13578500
*                                      entries.                      */ 13607000
*      2    AMDALSD  FIXED(32),     /* Length of source/destination     13635500
*                                      data entries                  */ 13664000
*      2    AMDAOSD  FIXED(32),     /* Offset to source/destination     13692500
*                                      entries.                      */ 13721000
*                                                                       13750000
*      2    AMDA#MUS FIXED(32),     /* Number of member message use     13775000
*                                      summary entries           @L6A*/ 13800000
*      2    AMDALMUS FIXED(32),     /* Length of member message space   13825000
*                                      summary entries           @L6A*/ 13850000
*      2    AMDAOMUS FIXED(32);     /* Offset to member message use     13875000
*                                      summary entries           @L6A*/ 13900000
*                                                                       13925000
*                                                                       13950000
*   DECLARE                                                             14100000
*     1    AMDPATH  BASED AMDA_VIA, /* Path activity entry, placed in   14150000
*                                      the data area first if           14200000
*                                      requested                     */ 14250000
*      3    AMDPTYPE BIT(8),        /* Indication of type of data    */ 14300000
*        5    *        BIT(7),      /* Reserved and set to 0         */ 14350000
*        5    AMDPTYPP BIT(1),      /* Indicates path data           */ 14400000
*      3    *        BIT(8),        /* Reserved and set to 0         */ 14450000
*      3    AMDPLENT FIXED(16),     /* Length of a path entry        */ 14500000
*                                                                       14550000
*      3    AMDPNAME CHAR(8),       /* System name                   */ 14600000
*      3    AMDPDEV  CHAR(4),       /* Device number in EBCDIC of CTC   14625000
*                                      device for signalling path.      14650000
*                                      Blanks if not CTC device. @L2C*/ 14675000
*      3    AMDPDIR  FIXED(8),      /* Direction of path             */ 14700000
*       5     AMDPINB  BIT(1),      /* Inbound path                  */ 14750000
*       5     AMDPOUTB BIT(1),      /* Outbound path                 */ 14800000
*       5     *        BIT(6),      /* Reserved and set to 0         */ 14850000
*      3    *        CHAR(3),       /* Reserved and set to 0         */ 14900000
*      3    AMDPONME CHAR(8),       /* Name of system on other end      14950000
*                                      if known, otherwise blanks.   */ 15000000
*      3    AMDPODEV CHAR(4),       /* Device number in EBCDIC on the   15050000
*                                      other end if known, otherwise    15100000
*                                      blanks.                       */ 15150000
*      3    AMDPFLAG CHAR(4),       /* Flags                     @L5A*/ 15183300
*      4    AMDPSTAT FIXED(8),      /* Path status               @L5C*/ 15216600
*       5     AMDPSTRT BIT(1),      /* Starting                      */ 15250000
*       5     AMDPREST BIT(1),      /* Restarting                    */ 15300000
*       5     AMDPWORK BIT(1),      /* Working                       */ 15350000
*       5     AMDPSTOP BIT(1),      /* Stopping                      */ 15400000
*       5     AMDPLINK BIT(1),      /* Waiting for completion of        15450000
*                                      initial protocol used to         15500000
*                                      establish communication link. */ 15550000
*       5     AMDPNOP  BIT(1),      /*                                  15566600
*                        Not operational.  Path defined to XCF but not  15583200
*                          usable until hardware and/or definition      15599800
*                          problems are resolved                 @01A*/ 15616400
*       5     AMDPFAIL BIT(1),      /* Stop failed.              @L2A*/ 15627600
*       5     AMDPRBLD BIT(1),      /* Rebuilding                @L5C*/ 15636600
*                                                                       15645600
*      4    AMDPSTA2 FIXED(8),      /* More path status flags    @L5A*/ 15654600
*       5     AMDPQSCG BIT(1),      /* Quiescing                 @L5A*/ 15663600
*       5     AMDPQSCD BIT(1),      /* Quiesced                  @L5A*/ 15672600
*       5     *        BIT(6),      /* Reserved and set to 0     @L5A*/ 15681600
*      4    *        CHAR(2),       /* Reserved and set to 0     @L5C*/ 15690600
*      3    AMDPMRET FIXED(32),     /* Path retry limit              */ 15700000
*      3    AMDP#RET FIXED(32),     /* Current path retry count      */ 15750000
*      3    AMDP#RST FIXED(32),     /* Cumulative number of restarts */ 15800000
*      3    AMDPMXMS FIXED(32),     /*                                  15807100
*                        Path maximum message limit.  This value is     15814200
*                          the customer specified value for the number  15821300
*                          of 1K byte blocks of message buffer space    15828400
*                          associated with this signalling path.  For   15835500
*                          an inbound path, this is the maximum amount  15842600
*                          of buffer space that can be used by the      15849700
*                          path.  For an outbound path, this is the     15856800
*                          amount of buffer space contributed by this   15863900
*                          path to the total buffer space available for 15871000
*                          sending messages to the system on the other  15878100
*                          end using the transport class to which       15885200
*                          this path is assigned.                @P3C*/ 15892300
*      3    AMDP#SIG FIXED(32),     /* For an outbound (inbound) path,  15900000
*                                      the total number of signals      15950000
*                                      sent (received) over the path.   15975000
*                                      N/A for structure summary        16000000
*                                      (Hardware type 2)         @L3C*/ 16025000
*      3    AMDP#ACT FIXED(32),     /* For an outbound path, the        16050000
*                                      current number                   16100000
*                                      of signals pending transfer on   16150000
*                                      the path.                        16175000
*                                      N/A for structure summary        16200000
*                                      (Hardware type 2)         @L3C*/ 16225000
*       5     AMDP#IBR FIXED(32),   /* For an inbound path, the         16250000
*                                      total number                     16300000
*                                      of times a request for a new     16350000
*                                      message buffer was refused due   16400000
*                                      to the maximum message limit for 16450000
*                                      the path.                        16475000
*                                      N/A for structure summary        16500000
*                                      (Hardware type 2)         @L3C*/ 16525000
*      3    AMDP#SUS FIXED(32),     /* For an outbound path, the        16550000
*                                      total number                     16600000
*                                      of signal requests satisfied     16650000
*                                      by this path while not busy.     16700000
*                                      For an inbound path, reserved    16750000
*                                      and set to 0.                    16775000
*                                      N/A for structure summary        16800000
*                                      (Hardware type 2)         @L3C*/ 16825000
*      3    AMDP#APP FIXED(32),     /* For an outbound path, the        16850000
*                                      total number                     16900000
*                                      of signal requests satisfied     16950000
*                                      by this path while busy.         17000000
*                                      N/A for structure summary        17087400
*                                      (Hardware type 2)         @02C*/ 17090000
*        5    AMDPIOXT FIXED(32),   /* For an inbound path, the average 17092600
*                                      I/O transfer time, expressed in  17095200
*                                      microseconds, for the most       17097800
*                                      recently received signals.  Zero 17100400
*                                      if not available (no recent      17103000
*                                      signals or sending system does   17105600
*                                      not provide the necessary data). 17108200
*                                      'FFFFFFFF'x if overflow (implies 17110800
*                                      average exceeds approximately 35 17113400
*                                      minutes).                        17116000
*                                      N/A for structure summary        17118600
*                                      (Hardware type 2)         @02A*/ 17121200
*      3    AMDP#USE FIXED(32),     /* Count of the current number of   17125000
*                                      1K byte blocks of                17145000
*                                      message buffer space in use by   17165000
*                                      this signalling path.            17175000
*                                      N/A for structure summary        17185000
*                                      (Hardware type 2)         @L3C*/ 17195000
*      3    AMDPMGRS FIXED(32),     /* Measurement Gatherer Reset Data  17205000
*                                      indicator, changes when counts   17225000
*                                      for this path entry have been    17250000
*                                      reset.                           17252100
*                          Use this token to determine whether or not   17254200
*                          the data collected from two different        17256300
*                          invocations of the IXCMG service are         17258400
*                          comparable.  If the token is the same for    17260500
*                          both sets of data, it makes sense to compare 17262600
*                          the data.  If the token is different, the    17264700
*                          two sets of data are not comparable since    17266800
*                          they refer to two different instances of the 17268900
*                          indicated signalling path.           @P3C*/  17271000
*      3    AMDPTCN  CHAR(8),       /* Transport Class Name.            17273200
*                          For an outbound path, the class to which     17285000
*                          the path is assigned.                        17290000
*                          Blanks for an inbound path.           @L2C*/ 17291100
*      3    AMDPPHDT FIXED(32),    /* Type of hardware being used as    17292200
*                                     the transport mechanism for the   17293300
*                                     signalling path.  See AMHDTxxx    17294400
*                                     constants.                 @L2A*/ 17295500
*      3    AMDPPHDD CHAR(32) BDY(WORD);  /* Path hardware              17296600
*                                      descriptor.   See AMxxxHDD       17297700
*                                      mappings below.           @L2A*/ 17298800
*   DECLARE                                                             17300000
*     1    AMDPATH1 BASED AMDA_VIA, /* Path activity entry, returned    17300900
*                                      when AMDALEVEL=1 specified on    17301800
*                                      IXCMG.                    @03A*/ 17302700
*       3 * CHAR( LENGTH( AMDPATH ) ), /* Mapped by AMDPATH      @03A*/ 17303600
*       3 AMDPATH1_BuffLen fixed,   /* Maximum number of bytes of       17304500
*                                      message data that will fit into  17305400
*                                      the signal buffers that are      17306300
*                                      currently used by the signalling 17307200
*                                      path.  Zero if signal buffers    17308100
*                                      are not relevant to the path.    17309000
*                                      N/A for structure summary        17309900
*                                      (Hardware type 2)         @03A*/ 17310800
*       3 AMDPATH1_TransferRate fixed, /* For an outbound path,         17311700
*                                      transfer rate value expressed in 17312600
*                                      microseconds, that was last      17313500
*                                      reported by the inbound side of  17314400
*                                      the path.  Zero if not available 17315300
*                                      (no recent signals or sending    17316200
*                                      system does not provide the      17317100
*                                      necessary data or path is not    17318000
*                                      relevant for signal transfers).  17318900
*                                      'FFFFFFFF'x if overflow (implies 17319800
*                                      average exceeds approximately 35 17320700
*                                      minutes).                        17321600
*                                                                       17322500
*                                      N/A for inbound paths.           17323400
*                                      N/A for structure summary        17324300
*                                      (Hardware type 2)         @03A*/ 17325200
*       3 AMDPATH1_#PendingDelivery fixed, /* For an inbound path,      17326100
*                                      the number of signal buffers     17327000
*                                      currently engaged in some phase  17327900
*                                      of delivering a message that     17328800
*                                      was received over the path.      17329700
*                                                                       17330600
*                                      N/A for outbound paths.          17331500
*                                      N/A for structure summary        17332400
*                                      (Hardware type 2)         @03A*/ 17333300
*       3 AMDPATH1_Signal# fixed(32), /* For an outbound path, the      17334200
*                                      signal number assigned to the    17335100
*                                      most recent signal queued for    17336000
*                                      transfer over the path (contrast 17336900
*                                      with AMDP#SIG which includes     17337800
*                                      only user signals).              17338700
*                                      For an inbound path, the signal  17339600
*                                      number of the signal that was    17340500
*                                      most recently received.          17341400
*                                      These numbers are not            17342300
*                                      necessarily ever increasing.     17343200
*                                      N/A for structure summary        17344100
*                                      (Hardware type 2)         @03A*/ 17345000
*       3 * CHAR(52);               /* Reserved for future use   @03A*/ 17345900
*                                                                       17346800
*   DECLARE                                                             17347700
*     1    AMDMPEND BASED AMDA_VIA, /* Pending messages entry        */ 17350000
*       3   AMDMTYPE BIT(8),        /* Indication of type of data    */ 17400000
*        5   *        BIT(6),       /* Reserved and set to 0         */ 17450000
*        5   AMDMTYPM BIT(1),       /* Indicates pending message data*/ 17500000
*        5   *        BIT(1),       /* Reserved and set to 0         */ 17550000
*       3    *        BIT(8),       /* Reserved and set to 0         */ 17600000
*       3   AMDMLENT FIXED(16),     /* Length of a pending message      17650000
*                                      entry                         */ 17700000
*       3    AMDMDEVN CHAR(4),      /* Device number (EBCDIC) of CTC    17721400
*                                      device for signalling path       17742800
*                                      on which message is pending.     17764200
*                                      Blanks if not associated         17785600
*                                      with any signalling path or not  17807000
*                                      a CTC device.             @L2C*/ 17828400
*       3    AMDMTOKN BIT(64),      /* Member token of message sender*/ 17850000
*       3    AMDMASID FIXED(15),    /* ASID of member sending message*/ 17900000
*       3    AMDMHOME FIXED(15),    /* Home ASID that initiated         17950000
*                                      message out request           */ 18000000
*       3    AMDMTSNM CHAR(8),      /* Name of system that is target    18016600
*                                      of message               @D1A */ 18033200
*       3    AMDMMSGL FIXED(32),    /*                                  18035600
*                     Length of message which is pending        @L1A */ 18038000
*       3    AMDMTCN  CHAR(8),      /*                                  18040400
*                       Name of transport class selected for            18042800
*                       transferring the message, blanks if class not   18045200
*                       yet selected.                            @L2C*/ 18045500
*       3    AMDMPHDT FIXED(32),    /* Type of hardware being used as   18045800
*                                      the transport mechanism for the  18046100
*                                      signalling path.  Indicates      18046400
*                                      not applicable if the message    18046700
*                                      is not currently pending         18047000
*                                      transfer over a particular       18047300
*                                      signalling path.          @L3C*/ 18047600
*       3    AMDMPHDD CHAR(32) BDY(WORD);     /* Path hardware          18047900
*                                      descriptor.   Not applicable if  18048200
*                                      message is not currently pending 18048500
*                                      transfer over a particular       18048800
*                                      signalling path.  See AMxxxHDD   18049100
*                                      mappings below.           @L3C*/ 18049400
*   DECLARE                                                             18050000
*     1    AMDSYS   BASED AMDA_VIA, /* System entry.  There are         18100000
*                                      two or more system entries per   18135700
*                                      remote system (1 inbound entry   18171400
*                                      plus 1 outbound entry per        18207100
*                                      transport class).                18242800
*                                      One entry per transport class    18278500
*                                      for the local system.    @L1C */ 18314200
*      3    AMDSYTYP BIT(8),        /* Indication of type of data    */ 18350000
*       5    *        BIT(5),       /* Reserved and set to 0         */ 18400000
*       5    AMDSYTYE BIT(1),       /* Indicates system data         */ 18450000
*       5    *        BIT(2),       /* Reserved and set to 0         */ 18500000
*      3    *        BIT(8),        /* Reserved and set to 0         */ 18550000
*                                                                       18600000
*      3    AMDSYLEN FIXED(16),     /* Length of system entry        */ 18650000
*      3    AMDSYNME CHAR(8),       /* System name, blanks if not       18700000
*                                      known                         */ 18750000
*      3    AMDSYDIR FIXED(8),      /* Direction                     */ 18800000
*         5    AMDSYIN  BIT(1),     /* Inbound                       */ 18850000
*         5    AMDSYOUT BIT(1),     /* Outbound                      */ 18900000
*         5    AMDSYLCL BIT(1),     /* Local                         */ 18950000
*         5    *        BIT(5),     /* Reserved and set to 0         */ 19000000
*      3    *        CHAR(3),       /* Reserved and set to 0         */ 19050000
*      3    AMDSYPTH FIXED(32),     /*                                  19059100
*                        Current number of paths in service.            19068200
*                          If local entry, set to 0.                    19077300
*                          If outbound entry, count                     19086400
*                          is for indicated transport class.     @L1C*/ 19095500
*      3    AMDSYBSY FIXED(32),     /*                                  19104600
*                        Total number of times a no buffer condition    19113700
*                          occurred.  Subject to wrapping.              19122800
*                          If local or outbound entry, count            19131900
*                          is for indicated transport class.    @L1C*/  19141000
*      3    AMDSYNOP FIXED(32),     /*                                  19150100
*                        Total number of times a no path condition      19159200
*                          occurred.  Subject to wrapping.              19168300
*                          If local entry, set to 0.                    19177400
*                          If outbound entry, count                     19186500
*                          is for indicated transport class.    @L1C*/  19195600
*      3    AMDSYMXB FIXED(32),     /*                                  19204700
*                        Current maximum number of 1K byte blocks of    19213800
*                          message buffer space permitted for system.   19222900
*                          If local or outbound entry, count            19232000
*                          is for indicated transport class.    @L1C*/  19241100
*      3    AMDSYUSE FIXED(32),     /*                                  19250200
*                        Current number of 1K byte blocks of            19259300
*                          message buffer space in use on system.       19268400
*                          If local or outbound system entry, count     19277500
*                          is for indicated transport class.    @L1C*/  19286600
*      3    AMDSYNUM FIXED(32),     /* System Token.                    19291100
*                          Changes when all counts for the system       19295600
*                          named by AMDSYNME have been reset.           19296400
*                          Use this token to determine whether or not   19297200
*                          the data collected from two different        19298000
*                          invocations of the IXCMG service are         19298800
*                          comparable.  If the token is the same for    19299600
*                          both sets of data, it makes sense to compare 19300400
*                          the data.  If the token is different, the    19301200
*                          two sets of data are not comparable since    19302000
*                          they refer to two different instances of the 19302800
*                          named system.                        @P3C*/  19303600
*      3    AMDSYBIG FIXED(32),     /*                                  19304800
*                        Total number of messages sent whose length     19313900
*                          exceeded the buffer size that supports       19323000
*                          the defined transport class length.          19332100
*                          Zero if inbound entry.                       19341200
*                          Subject to wrapping.                 @L1A*/  19350300
*      3    AMDSYFIT FIXED(32),     /*                                  19359400
*                        Total number of messages sent whose length     19368500
*                          fit the buffer size that supports            19377600
*                          the defined transport class length.          19386700
*                          Zero if inbound entry.                       19395800
*                          Subject to wrapping.                 @L1A*/  19404900
*      3    AMDSYSML FIXED(32),     /*                                  19414000
*                        Total number of messages sent whose length     19423100
*                          was smaller than buffer size that supports   19432200
*                          the defined transport class length.          19441300
*                          Zero if inbound entry.                       19450400
*                          Subject to wrapping.                 @L1A*/  19459500
*      3    AMDSYOVR FIXED(32),     /*                                  19468600
*                        Total number of messages sent whose length     19477700
*                          exceeded the buffer size for which the       19486800
*                          signalling service was optimized.            19495900
*                          Zero if inbound entry.                       19505000
*                          Subject to wrapping.                 @L1A*/  19514100
*      3    AMDSYTCL FIXED(32),     /*                                  19523200
*                        Length of longest message that fits the        19532300
*                          buffer size that supports                    19541400
*                          the defined transport class length.          19550500
*                          Zero if inbound entry.               @L1A*/  19559600
*      3    AMDSYTCN CHAR(8),       /*                                  19568700
*                        Transport Class Name to which the data         19577800
*                          applies.  Blanks if inbound entry.           19586900
*                                                               @D2C*/  19589200
*      3    AMDSYGRS FIXED(32), /*                                      19591500
*                        Measurement Gatherer Reset Data indicator,     19593800
*                          changes when counts for the transport        19596100
*                          class named by AMDSYTCN have been reset.     19598400
*                          Note that if AMDSYNUM field has changed,     19600700
*                          then counts have been reset even though      19603000
*                          AMDSYGRS may not have changed.               19605300
*                          Zero if inbound entry.                       19605500
*                          Use this token to determine whether or not   19605700
*                          the data collected from two different        19605900
*                          invocations of the IXCMG service are         19606100
*                          comparable.  If the token is the same for    19606300
*                          both sets of data, it makes sense to compare 19606500
*                          the data.  If the token is different, the    19606700
*                          two sets of data are not comparable since    19606900
*                          they refer to two different instances of the 19607100
*                          indicated transport class definition @P3C*/  19607300
*      3    AMDSYSMX FIXED(32);     /* Customer defined maxmsg value.   19607500
*                                     Default number of 1K byte blocks  19607700
*                                     of message buffer space. If local 19607900
*                                     or outbound entry, count is for   19608100
*                                     transport class. This value can   19608300
*                                     be modified via SETXCF command.   19608500
*                                                                @P2A*/ 19608700
*                                                                       19610000
*   DECLARE                                                             19640000
*     1    AMDSYS1  BASED AMDA_VIA, /* System entry.  This is the       19640600
*                                      mapping to use for system data   19641200
*                                      when the IXCMG service is        19641800
*                                      invoked with AMDALEVEL >= 1.     19642400
*                                      NOTE: These records are variable 19643000
*                                      length.  AMDSYLEN *must* be used 19643600
*                                      to increment to the next AMDSYS1 19644200
*                                      entry.                    @03A*/ 19644800
*     2 AMDSYS1F BDY(WORD),         /*                           @03A*/ 19645400
*      3 * CHAR( length(AMDSYS) ),  /* This area is mapped by AMDSYS    19646000
*                                      as usual.                 @03A*/ 19646600
*      3 * CHAR(32),                /* Reserved.                 @03A*/ 19647200
*      3 AMDSYS1_#MsgSizes fixed,   /* Number of entries in the         19647800
*                                      AMDSYS1_MsgSizes array.          19648400
*                                      Could be zero.            @03A*/ 19649000
*     2 AMDSYS1V BDY(WORD),         /*                           @03A*/ 19649600
*      3 AMDSYS1_MsgSizes(*),       /* Array of msg size data    @03A*/ 19650200
*        5 AMDSYS1_BuffLen fixed,   /* maximum number of                19650800
*                                      bytes of message data that fit   19651400
*                                      in the message buffer     @03A*/ 19652000
*        5 AMDSYS1_SignalCnt fixed(32), /* Number of signals that could 19652600
*                                      have used a signal buffer of     19653200
*                                      the indicated size.              19653800
*                                      Subject to wrapping.      @03A*/ 19654400
*        5 * char(8);               /* Reserved.                 @03A*/ 19655000
*                                                                       19655600
*                                                                       19656200
*   DECLARE                                                             19656800
*     1    AMDSD    BASED AMDA_VIA, /* Source/destination entry,        19660000
*                                      one per member.           @P1C*/ 19680000
*      3    AMDSTYPE BIT(8),        /* Indication of type of data    */ 19700000
*       5    *        BIT(4),       /* Reserved and set to 0         */ 19750000
*       5    AMDSTYPS BIT(1),       /* Indicates source/destination     19783300
*                                      data                          */ 19816600
*       5    *        BIT(3),       /* Reserved and set to 0         */ 19850000
*      3    *        BIT(8),        /* Reserved and set to 0         */ 19900000
*      3    AMDSLENT FIXED(16),     /* Length of a source/destination   19950000
*                                      entry                         */ 20000000
*      3    AMDSGRP  CHAR(8),       /* Eight byte group name         */ 20050000
*      3    AMDSMEM  CHAR(16),      /* Member name                   */ 20100000
*      3    AMDSSCNT  FIXED(32),     /* Total number of signals         20150000
*                                      sent by the member            */ 20200000
*      3    AMDSRCNT  FIXED(32),     /* Total number of signals         20250000
*                                      received by the member        */ 20300000
*      3    AMDSMGRS FIXED(32),     /* Measurement Gatherer Reset Data  20350000
*                                      indicator, changes when counts   20400000
*                                      for this member entry have been  20450000
*                                      reset.                           20459000
*                          Use this token to determine whether or not   20468000
*                          the data collected from two different        20477000
*                          invocations of the IXCMG service are         20486000
*                          comparable.  If the token is the same for    20495000
*                          both sets of data, it makes sense to compare 20504000
*                          the data.  If the token is different, the    20513000
*                          two sets of data are not comparable since    20522000
*                          they refer to two different instances of the 20531000
*                          indicated member.                    @P3C*/  20540000
*      3    AMDSSNAM CHAR(8);       /* Name of system on which member   20550000
*                                      resides                  @D1A */ 20600000
*                                                                       20600400
*                                   /*                           @D3D*/ 20625200
*   DECLARE                                                             20625300
*   1 AMDMEM    BASED AMDA_VIA, /* Member data entry        @03A*/      20625400
*     2 AMDMEM_HDR,                 /*                           @03A*/ 20625500
*      3    AMDMEM_TYPE BIT(8),     /* Indicates type of data    @03A*/ 20625600
*       5    *        BIT(3),       /* Reserved and set to 0     @03A*/ 20625700
*       5    AMDMEM_TypeMem BIT(1), /* Indicates member data     @03A*/ 20625800
*       5    *        BIT(4),       /* Reserved and set to 0     @03A*/ 20625900
*      3    *        BIT(8),        /* Reserved and set to 0     @03A*/ 20626000
*      3    AMDMEM_Length FIXED(16), /* Number of bytes of data         20626100
*                                      returned in this entry.          20626200
*                                      CAUTION: records are variable    20626300
*                                      length since a variable number   20626400
*                                      of AMDMEMDI data items may be    20626500
*                                      returned.                 @03A*/ 20626600
*      3    AMDMEM_GroupName CHAR(8), /* XCF group name          @03A*/ 20626700
*      3    AMDMEM_MemberName CHAR(16), /* XCF Member name       @03A*/ 20626800
*      3    AMDMEM_JobName char(8), /* Member's jobname          @03A*/ 20626900
*      3    AMDMEM_Sysname char(8), /* Name of system on which member   20627000
*                                      resides                   @03A*/ 20627100
*      3    AMDMEM_MemberToken BIT(64),  /* XCF member token for the    20627200
*                                      indicated member.                20627300
*                          Use this token to determine whether or not   20627400
*                          the data collected from two different        20627500
*                          invocations of the IXCMG service are         20627600
*                          comparable.  If the token is the same for    20627700
*                          both sets of data, it makes sense to compare 20627800
*                          the data.  If the token is different, the    20627900
*                          two sets of data are not comparable since    20628000
*                          they refer to two different instances of the 20628100
*                          indicated member.                     @03A*/ 20628200
*      3    AMDMEM_SysToken FIXED(32), /* XCF system token for the      20628300
*                                      system where the member          20628400
*                                      resides.                  @03A*/ 20628500
*      3    * CHAR(2),              /* reserved                  @03A*/ 20628600
*      3    AMDMEM_ASID fixed(16),  /* Member's address space    @03A*/ 20628700
*                                                                       20628800
*      3    AMDMEM_MsgoAccepted FIXED(32), /* Cumulative count of       20628900
*                                      messages accepted for delivery   20629000
*                                      by the IXCMSGO service.  Subject 20629100
*                                      to wrapping.              @03A*/ 20629200
*      3    AMDMEM_MsgoNoBuffer FIXED(32), /* Total number of messages  20629300
*                                      rejected by the IXCMSGO service  20629400
*                                      for lack of a message buffer.    20629500
*                                      Subject to wrapping.      @03A*/ 20629600
*                                                                       20629700
*      3    AMDMEM_MsgiReceived FIXED(32), /* Cumulative count of       20629800
*                                      messages that were to be         20629900
*                                      delivered to the member.         20630000
*                                      Includes both local and remote   20630100
*                                      messages.                        20630200
*                                      Subject to wrapping.      @03A*/ 20630300
*      3    AMDMEM_MsgiCurrWorkItems FIXED(32), /* The number of signal 20630400
*                                      work items currently queued for  20630500
*                                      processing.  Usually a work item 20630600
*                                      represents a message that is to  20630700
*                                      be delivered, but they could     20630800
*                                      include internal XCF work that   20630900
*                                      needs to be performed.    @03A*/ 20631000
*      3    AMDMEM_MsgiTransfers FIXED(32), /* Cumulative count of      20631100
*                                      remote signals that were         20631200
*                                      received on behalf of the        20631300
*                                      member.                          20631400
*                                      Subject to wrapping.      @03A*/ 20631500
*      3    AMDMEM_MsgoTransferTime FIXED(32), /* For inbound remote    20631600
*                                      signals, the average message     20631700
*                                      transfer time, expressed in      20631800
*                                      microseconds, for the most       20631900
*                                      recently received signals.  Zero 20632000
*                                      if not available (no recent      20632100
*                                      signals or sending system does   20632200
*                                      not provide the necessary data). 20632300
*                                      'FFFFFFFF'x if overflow (implies 20632400
*                                      average exceeds approximately 35 20632500
*                                      minutes).                        20632600
*                                                                       20632700
*                                      Message transfer is measured     20632800
*                                      from the time that XCF accepts   20632900
*                                      delivery of the message on the   20633000
*                                      sending system to the time that  20633100
*                                      (each signal for the) message    20633200
*                                      arrives on the target system and 20633300
*                                      can be                           20633400
*                                      scheduled/queued/collected for   20633500
*                                      delivery to the target member.   20633600
*                                                                @03A*/ 20633700
*      3    AMDMEM_GrpxReceived FIXED(32), /* Cumulative count of group 20633800
*                                      events that were to be delivered 20633900
*                                      to the member.  Subject to       20634000
*                                      wrapping.                 @03A*/ 20634100
*      3    AMDMEM_GrpxCurrWorkItems FIXED(32), /* The number of group  20634200
*                                      work items currently queued for  20634300
*                                      processing.               @03A*/ 20634400
*      3    * CHAR(172),            /* Reserved                  @03A*/ 20634500
*      3   AMDMEM_#DataItems fixed, /* Number of data items             20634600
*                                      in the following array    @03A*/ 20634700
*     2   AMDMEM_DataItems(*) char(length(AMDMEMDI)); /* Array of data  20634800
*                                      items.  Each entry is mapped by  20634900
*                                      AMDMEMDI.                 @03A*/ 20635000
*                                                                       20635100
*   DECLARE                                                             20635200
*     1 AMDMEMDI    BASED AMDA_VIA, /* Member data item          @03A*/ 20635300
*      2 AMDMEMDI_HDR,                                                  20635400
*       3 AMDMEMDI_DataType fixed(8), /* Indicates the format of        20635500
*                                      AMDMEMDI_Data.  Your program     20635600
*                                      should skip data items whose     20635700
*                                      type it does not recognize.      20635800
*                                      New data types may be added at   20635900
*                                      any time.                 @03A*/ 20636000
*       3 AMDMEMDI_Subject fixed(8), /* Subject of the data item @03A*/ 20636100
*       3 AMDMEMDI_Flags bit(8),    /*                           @03A*/ 20636200
*          5 AMDMEMDI_Stalled bit,  /* ON if data item could be related 20636300
*                                      to a hang condition.      @03A*/ 20636400
*          5 * bit(7),              /* Reserved                  @03A*/ 20636500
*       3 * CHAR(1),                /* Reserved                  @03A*/ 20636600
*                                                                       20636700
*      2 AMDMEMDI_Data UNION CHAR(60) BDY(WORD), /*              @03A*/ 20636800
*                                                                       20636900
*        3 AMDMEMDI_ExitRoutines,   /* DataType 001: exits       @03A*/ 20637000
*          5 AMDMEMDIxr_Token ptr,  /* exit routine token        @03A*/ 20637100
*          5 AMDMEMDIxr_FunctionCode CHAR(2), /* EBCDIC eyecatcher      20637200
*                                      to indicate function to be       20637300
*                                      performed.                @03A*/ 20637400
*          5 * CHAR(2),             /* Reserved                  @03A*/ 20637500
*          5 AMDMEMDIxr_TodWhenCalled char(8), /* TOD when exit was     20637600
*                                      called.  Hex zero if exit not    20637700
*                                      yet called.               @03A*/ 20637800
*          5 AMDMEMDIxr_TodWhenReturned char(8), /* TOD when exit       20637900
*                                      returned.  Hex zero if exit not  20638000
*                                      yet returned.             @03A*/ 20638100
*          5 AMDMEMDIxr_ProcessStage fixed, /* If exit not yet          20638200
*                                      returned, identifies current     20638300
*                                      stage of processing.      @03A*/ 20638400
*          5 * CHAR(8 * 4),         /* reserved                  @03A*/ 20638500
*                                                                       20638600
*        3 AMDMEMDI_WorkItem,       /* DataType 002: work items  @03A*/ 20638700
*          5 AMDMEMDIwi_Token ptr,  /* work item token           @03A*/ 20638800
*          5 AMDMEMDIwi_FunctionCode CHAR(2), /* EBCDIC eyecatcher      20638900
*                                      to indicate function to be       20639000
*                                      performed.                @03A*/ 20639100
*          5 * CHAR(2),             /* Reserved                  @03A*/ 20639200
*          5 AMDMEMDIwi_TodWhenCreated char(8), /* TOD when work item   20639300
*                                      was created.              @03A*/ 20639400
*          5 AMDMEMDIwi_Item# fixed(32), /* work item number     @03A*/ 20639500
*          5 * CHAR(10* 4),         /* reserved                  @03A*/ 20639600
*                                                                       20639700
*        3 AMDMEMDI_MsgSizes,       /* DataType 003: msg sizes   @03A*/ 20639800
*         5 AMDMEMDIms_BuffLen fixed, /* maximum number of              20639900
*                                      bytes of message data that fit   20640000
*                                      in the message buffer     @03A*/ 20640100
*         5 AMDMEMDIms_MsgoRemoteSent fixed, /* Number of remote        20640200
*                                      signals sent that could have     20640300
*                                      used a signal buffer of this     20640400
*                                      size.                            20640500
*                                      Subject to wrapping.      @03A*/ 20640600
*         5 AMDMEMDIms_MsgoLocalSent fixed, /* Number of local          20640700
*                                      signals sent that could have     20640800
*                                      used a signal buffer of this     20640900
*                                      size.                            20641000
*                                      Subject to wrapping.      @03A*/ 20641100
*          5 * CHAR( 7* 4),         /* reserved                  @03A*/ 20641200
*                                                                       20641300
*      2 * CHAR(0);                 /*                           @03A*/ 20641400
*                                                                       20641500
*   DECLARE                       /* AMDMEMDI_DataType constants @03A*/ 20641600
*     AMDMEMDI_xrDataType constant(1), /* exit routine           @03A*/ 20641700
*     AMDMEMDI_wiDataType constant(2), /* work item              @03A*/ 20641800
*     AMDMEMDI_msDataType constant(3); /* message sizes          @03A*/ 20641900
*                                                                       20642000
*   DECLARE                        /* AMDMEMDI_Subject constants @03A*/ 20642100
*     AMDMEMDI_noSubject constant(0), /* global subject          @03A*/ 20642200
*     AMDMEMDI_gpSubject constant(1), /* group services          @03A*/ 20642300
*     AMDMEMDI_siSubject constant(2); /* signalling services     @03A*/ 20642400
*                                                                       20642500
*   DECLARE                        /* AMDMEMDIxr_ProcessStage           20642600
*                                     constants                  @03A*/ 20642700
*     AMDMEMDI_kNoStage      constant(0), /* no stage identified @03A*/ 20642800
*     AMDMEMDI_kPendingStage constant(1), /* Processing is pending.     20642900
*                                      For example, SRB scheduled but   20643000
*                                      not yet run.              @03A*/ 20643100
*     AMDMEMDI_kSetupStage   constant(2), /* Doing setup work to        20643200
*                                      prepare to do the desired        20643300
*                                      processing.               @03A*/ 20643400
*     AMDMEMDI_kRunningStage constant(3); /* In midst of doing the      20643500
*                                      desired processing.       @03A*/ 20643600
*                                                                       20643700
*/********************************************************************* 20650000
**                                                                   ** 20700000
**             Constants for Hardware Descriptor Types               ** 20750000
**                                                                   ** 20800000
**************************************************************** @L2A*/ 20850000
*   DECLARE                                                             20900000
*     AMHDTNA  CONSTANT(0),        /* Hardware type not applicable,     20950000
*                                     ignore hardware descriptor        21000000
*                                     data.                      @L3A*/ 21050000
*     AMHDTCTC CONSTANT(1),        /* CTC device.                @L3C*/ 21100000
*     AMHDTSTR CONSTANT(2),        /* CF Structure (summary)     @L2A*/ 21150000
*     AMHDTLST CONSTANT(3);        /* A list within a CF structure      21200000
*                                                                @L2A*/ 21250000
*                                                                       21300000
*/********************************************************************* 21350000
**                                                                   ** 21400000
**               Mappings for Hardware Descriptor Data               ** 21450000
**                                                                   ** 21500000
**************************************************************** @L2A*/ 21550000
*   DECLARE                                                             21600000
*     1    AMCTCHDD BASED AMDA_VIA CHAR(32) BDY(WORD), /* Path hardware 21650000
*                                    descriptor for                     21700000
*                                    CTC devices.                @L2A*/ 21750000
*      3    AMCTCDEV CHAR(4),      /* Device number (EBCDIC)     @L2A*/ 21800000
*      3    *        CHAR(28);     /* Unused, set to zero.       @L2A*/ 21850000
*                                                                       21900000
*   DECLARE                                                             21950000
*     1    AMSTRHDD BASED AMDA_VIA CHAR(32) BDY(WORD), /* Path hardware 22000000
*                                    descriptor for a CF List           22050000
*                                    structure.                  @L2A*/ 22100000
*      3    AMSTRNAM CHAR(16),     /* Structure name (EBCDIC)    @L2A*/ 22150000
*      3    AMSTR#AV FIXED(32),    /* Number of lists that              22200000
*                                     remain available for use (either  22250000
*                                     as PATHIN or PATHOUT).  Zero if   22278900
*                                     list structure is considered      22307800
*                                      inoperative.              @L4C*/ 22336700
*      3    AMSTR#OD FIXED(32),    /*                                   22365600
*                        Number of other systems connected to this      22394500
*                        structure that desire to establish signalling  22423400
*                        paths in the opposite direction.  This system  22452300
*                        is not included in the count.  The count is    22481200
*                        zero if the list structure is considered       22510100
*                        inoperative.                                   22539000
*                                                                @L4C*/ 22567900
*      3    AMSTR#LP FIXED(32),    /*                                   22596800
*                           Number of list signalling paths started by  22625700
*                           this system in the indicated direction for  22654600
*                           this list structure.  The count includes    22683500
*                           inoperative list paths.                     22712400
*                                                                @L4C*/ 22741300
*      3    *        CHAR( 4);      /* Unused, set to zero.      @L3C*/ 22770200
*                                                                       22800000
*   DECLARE                                                             22850000
*     1    AMLSTHDD BASED AMDA_VIA CHAR(32) BDY(WORD), /* Path hardware 22900000
*                                    descriptor for a particular list   22950000
*                                    within a CF List structure @L2A*/  23000000
*      3    AMLSTSTR  CHAR(16),    /* Structure name (EBCDIC)    @L2A*/ 23050000
*      3    AMLSTNUM  Fixed(32),   /* List number                @L2A*/ 23100000
*      3    *        CHAR(12);     /* Unused, set to zero.       @L2A*/ 23150000
*/* End of PL/X Source                                               */ 23250000
* %IF IXCYAMDA_LIST ^= 'NO' &                                           23300000
*    ZCBPRINT ^= 'NO' %THEN                                             23350000
*   %GOTO IXCYAMDA_4;                                                   23400000
*   @LIST POP NOECHO;                                                   23450000
* %IXCYAMDA_4:;                                                         23500000
* %END;                                                                 23550000
