*                                                                       00050000
* %DCL IXCYMQAA_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IXCYMQAA_INCLUDED;                                        00150000
* %IF IXCYMQAA_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 96236. CBGEN compile date 96059         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IXCYMQAA &DSECT=YES,&LIST=YES,&TITLE=YES,&MQAHDR=YES,         *00437500
               &MQAENTRY=COND,&MQATARGONLYENTRY=COND,                  *00475000
               &MQATARGRESPENTRY=COND                                   00512500
         GBLC  &IXCYMQAA_INCLUDED                                       00550000
         GBLC  &ZCBPRINT                                                00600000
&IXCYMQAA_INCLUDED SETC 'YES'                                           00650000
         AIF   ('&LIST' EQ 'NONE').P0                                   00666600
         AIF   ('&TITLE' EQ 'NO').P5                                    00683200
 TITLE   'IXCYMQAA  - Message Control Query Answer Area               '*00700000
                                                                        00750000
.P5      ANOP                                                           00775000
**/ IXCYMQAA_1:;                                                        00800000
*/* START OF SPECIFICATIONS ******************************************* 00850000
*                                                                       00900000
*01* PROPRIETARY STATEMENT =                                            00950000
*                                                                       01000000
*    Licensed Materials - Property of IBM                               01040000
*    "Restricted Materials of IBM"                                      01080000
*    5647-A01                                                           01120000
*    (C) COPYRIGHT IBM CORP. 1996, 1999                                 01160000
*                                                                       01200000
*    US Government Users Restricted Rights - Use, duplication or        01216600
*    disclosure restricted by GSA ADP Schedule Contract with            01233200
*    IBM Corp.                                                          01249800
*                                                                       01266400
*01* STATUS = HBB6608                                                   01283000
*                                                                       01300000
*01* END OF PROPRIETARY STATEMENT                                       01350000
*01* EXTERNAL CLASSIFICATION: GUPI                                      01450000
*01* END OF EXTERNAL CLASSIFICATION:                                    01500000
*                                                                       01550000
*01* DESCRIPTIVE NAME: Message Control Query Answer Area                01600000
*02*  ACRONYM:  MQAA                                                    01650000
*                                                                       01700000
*01* MACRO NAME: IXCYMQAA                                               01750000
*                                                                       01800000
*01* DSECT NAME:                                                        01850000
*     MqaHdr                                                            01900000
*     MqaEntry                                                          01950000
*     MqaTargOnlyEntry                                                  02000000
*     MqaTargRespEntry                                                  02050000
*                                                                       02100000
*01* COMPONENT:  Cross System Coupling Facility (SCXCF)                 02150000
*                                                                       02200000
*01* EYE-CATCHER:  NONE                                                 02250000
*02*  OFFSET:  N/A                                                      02300000
*02*  LENGTH:  N/A                                                      02350000
*                                                                       02400000
*01* STORAGE ATTRIBUTES:                                                02450000
*02*  SUBPOOL: User-supplied                                            02500000
*02*  KEY: User-supplied                                                02550000
*02*  RESIDENCY: User-supplied                                          02600000
*                                                                       02650000
*01* SIZE: Variable                                                     02700000
*            MQAHDR           -- X'0010' bytes                          02750000
*            MQAENTRY         -- X'0010' bytes                          02800000
*            MQATARGONLYENTRY -- X'0010' bytes                          02850000
*            MQATARGRESPENTRY -- X'0014' bytes                          02900000
*                                                                       02950000
*                                                                       03000000
*01* CREATED BY: IXCS1MSC                                               03050000
*                                                                       03100000
*01* POINTED TO BY: ANSAREA_ADDR field in IXCMSGC parameter list        03150000
*                                                                       03200000
*01* SERIALIZATION:                                                     03250000
*     None required                                                     03300000
*                                                                       03350000
*01* FUNCTION:                                                          03400000
*02*  Maps information returned by the XCF Message-Control Service      03450000
*     (IXCMSGC) for REQUEST(QUERYMSG).                                  03500000
*                                                                       03550000
*                                                                       03600000
*01* METHOD OF ACCESS:                                                  03650000
*                                                                       03700000
*02*  ASM:        IXCYMQAA                                              03750000
*         DSECT=YES|NO  -- Request DSECT definition                     03800000
*         MqaHdr=YES|NO|COND -- Request Header record mapping           03850000
*                                    USING on MQAHDR                    03900000
*         MqaEntry =YES|NO|COND -- Request record mapping               03950000
*                                    USING on MQAEntry                  04000000
*         MqaTargOnlyEntry =YES|NO|COND -- Request record mapping       04050000
*                                    USING on MqaTargOnlyEntry          04100000
*         MqaTargRespEntry =YES|NO|COND -- Request record mapping       04150000
*                                    USING on MqaTargRespEntry          04200000
*                                                                       04250000
*     Default:                                                          04300000
*         DSECT=YES,MQAHDR=YES,MQAENTRY=COND,                           04350000
*                MQATARGONLYENTRY=COND,MQATARGRESPENTRY=COND            04400000
*                                                                       04450000
*02*  PL/AS: %INCLUDE SYSLIB(IXCYMQAA)                                  04500000
*                                                                       04550000
*01* DELETED BY: User                                                   04600000
*                                                                       04650000
*01* FREQUENCY: Created for response to IXCMSGC request QUERY           04700000
*                                                                       04750000
*01* DEPENDENCIES: None.                                                04800000
*                                                                       04850000
*01* NOTES:                                                             04900000
*                                                                       04950000
*      - To ensure compatibility with additional data provided in the   05000000
*        future, never hardcode the length of any of the records        05050000
*        defined by this mapping when iterating through the tables      05100000
*        and arrays that are returned by the IXCMSGC query service.     05150000
*        All such offsets and lengths are subject to change in the      05200000
*        future, and will be reflected in the data that is returned.    05250000
*        Always use the lengths and offsets that are returned in        05300000
*        records.                                                       05350000
*                                                                       05400000
*                                                                       05450000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     05500000
*                                                                       05550000
*01* CHANGE ACTIVITY:                                                   05600000
*   $L0= XCFBC   HBB6603 950417 PD00DT: XCFBC Initial Release           05625000
*   $P1= PQC1514 HBB6603 960630 PD00CJ: Make MqaModMsgCntl and          05650000
*                                       MqaMidCntl consistent           05675000
*   $D1= DCR0028 HBB6603 960815 PD00CJ: Remove USAGE support            05700000
*   $P2= PQC2136 HBB6603 950906 PD00CJ: Added DiscardPending flags      05725000
*   $L1=LSD      HBB6608 980901 PD00BJ: Add async_msgaccess             05733300
*                                                                       05741600
* END OF SPECIFICATIONS *********************************************/  05750000
*% /*                                                                   05800000
.P0      ANOP                                                           05825000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 05850000
         AIF   ('&LIST' EQ 'YES').P2                                    05900000
.P1      ANOP                                                           05950000
         PUSH  PRINT                                                    06000000
         PRINT OFF                                                      06050000
.P2      ANOP                                                           06100000
*                                                                       06150000
* ********************************************************************  06200000
* *                                                                  *  06250000
* *                            Header                                *  06300000
* *                                                                  *  06350000
* ********************************************************************  06400000
*                                                                       06450000
*                                                                       06500000
         AIF   ('&MQAHDR' EQ 'NO').L0002                                06550000
         AIF   ('&DSECT' EQ 'YES').L0003                                06600000
         AIF   ('&MQAHDR' NE 'YES').L0002                               06650000
MQAHDR   DS    0F        Header record returned on all queries.         06700000
         AGO   .L0004                                                   06750000
.L0003   ANOP                                                           06800000
MQAHDR   DSECT           Header record returned on all queries.         06850000
.L0004   ANOP                                                           06900000
MQAHDRLEN DS   1FL4      Length in bytes of MqaHeader                   06950000
MQAHDRTLEN DS  1FL4      Total length in bytes of data area needed to  *07000000
                         contain all the requested information This    *07050000
                         length includes the header as well as the     *07100000
                         entries that WERE returned on this call.       07150000
MQAHDR#ENTRIES DS 1FL4   Number of complete entries of all kinds that  *07200000
                         were returned on this call (does not include  *07250000
                         the header).                                   07300000
MQAHDRENTOFFSET DS 1FL4  Offset from MqaHeader at which first entry is *07350000
                         located.                                       07400000
MQAHDR_LEN EQU *-MQAHDR                                                 07450000
.L0002   ANOP                                                           07500000
*                                                                       07550000
* ********************************************************************  07600000
* *                                                                  *  07650000
* *                        Entries                                   *  07700000
* *                                                                  *  07750000
* *                                                                  *  07800000
* *  First entry is located as follows:                              *  07850000
* *     Entryptr = addr(MqaHeader) + MqaHdrEntOffset                 *  07900000
* *                                                                  *  07950000
* *  Subsequent entry is located as follows:                         *  08000000
* *     Entryptr = Entryptr + Entryptr-> MqaEntLen                   *  08050000
* *                                                                  *  08100000
* *                                                                  *  08150000
* * DO NOT HARD CODE THE LENGTH OF THE RECORDS.  USE THE LENGTH AND  *  08200000
* * OFFSETS PROVIDED IN EACH RECORD (to ensure compatibility with    *  08250000
* * additional data provided in the future).                         *  08300000
* *                                                                  *  08350000
* ********************************************************************  08400000
*                                                                       08450000
*                                                                       08500000
         AIF   ('&MQAENTRY' EQ 'NO').L0005                              08550000
         AIF   ('&DSECT' EQ 'YES').L0006                                08600000
         AIF   ('&MQAENTRY' NE 'YES').L0005                             08650000
MQAENTRY DS    0F        Data record                                    08700000
         AGO   .L0007                                                   08750000
.L0006   ANOP                                                           08800000
MQAENTRY DSECT           Data record                                    08850000
.L0007   ANOP                                                           08900000
MQAENTTYPE DS  1FL1      Type of data described in this entry.          08950000
         DS    1CL0003   Reserved                                       09000000
MQAENTLEN DS   1FL4      Number of bytes in this entry. Use this value *09050000
                         when iterating through records. DO NOT hard   *09100000
                         code length of the records.                    09150000
         DS    1CL0008   Reserved                                       09200000
MQAENTDATA DS  0C        Variable content of the record. Use           *09250000
                         MqaEntType to determine which of the mappings *09300000
                         below is applicable.                           09350000
*                                                                       09400000
*    *****************************************************************  09450000
*    *                                                               *  09500000
*    * MQAA Entry Types                                              *  09550000
*    *                                                               *  09600000
*    *****************************************************************  09650000
*                                                                       09700000
*                                                                       09750000
MQAKTYPEMOS EQU X'01'    Message-out Summary                            09800000
MQAKTYPEMIS EQU X'02'    Message-in Summary                             09850000
MQAKTYPEMOD EQU X'03'    Message-out Detail                             09900000
MQAKTYPEMID EQU X'04'    Message-in Detail                              09950000
MQAENTRY_LEN EQU *-MQAENTRY                                             10050000
*                                                                       10100000
*    *****************************************************************  10150000
*    *                                                               *  10200000
*    * Message Out Summary                                           *  10250000
*    *                                                               *  10300000
*    *****************************************************************  10350000
*                                                                       10400000
*                                                                       10450000
         ORG   MQAENTDATA                                               10500000
MQAMSGOUTSUMMARY DS 0X                                                  10550000
MQAMOSTOKEN DS 1CL0016   Token used to identify this message to the    *10800000
                         message-control service (IXCMSGC).             10850000
MQAMOSUSERDATA DS 1BL8   User data associated with the message.        *10900000
                         Contains a copy of the data specified for the *10950000
                         USERDATA keyword when the message-out service *11000000
                         (IXCMSGO) was invoked to send the message or  *11050000
                         as modified by the message control service    *11100000
                         (IXCMSGC) when message was saved or           *11150000
                         completed.                                     11200000
MQAMOSFLAGS DS 0BL4                                                     11250000
MQAMOSFLAGS0 DS 0BL1                                                    11300000
MQAMOSBROADCAST EQU X'80' Indicates that the sender specified          *11350000
                         SENDTO(GROUP) on the IXCMSGO invocation.       11400000
MQAMOSGETRESPONSE EQU X'40' Indicates whether the sender of this       *11450000
                         message requested XCF management of           *11500000
                         responses.                                     11550000
MQAMOSISARESPONSE EQU X'20' Indicates whether this message is a        *11600000
                         response being managed by XCF.                 11650000
MQAMOSSENDPENDING EQU X'10' Desired send(s) not initiated by the       *11700000
                         message-out service.                           11750000
MQAMOSRESPPENDING EQU X'08' Expected response(s) not received.          11800000
MQAMOSCOMPLETED EQU X'04' Indicates whether message considered to be   *11850000
                         complete. Note that this flag is not mutually *11900000
                         exclusive with the Send/RespPending flags     *11950000
                         since completion may have been forced or the  *12000000
                         message may have timed out.                    12050000
MQAMOSTIMEDOUT EQU X'02' '1'B if the message did not complete within   *12100000
                         the time-out period.                           12150000
MQAMOSCANCELLED EQU X'01' '1'B if the message did not complete before  *12200000
                         the message-out request was cancelled.         12250000
         ORG   MQAMOSFLAGS0+X'00000001'                                 12266600
MQAMOSFLAGS1 DS 0BL1                                                    12283200
MQAMOSNOTIFYBYEXIT EQU X'80' Sender requested notification by Exit     *12300000
                         when complete.                                 12350000
MQAMOSDISCARDPENDING EQU X'40' Indicates that the message was marked    12392500
*                        for discard but the discard has not            12435000
*                        yet completed.                          @P2A   12477500
MQAMOSSUCCESSFUL EQU X'20' Indicates whether the request completed     *12520000
                         successfully where no sends were rejected and *12540000
                         all responses were received for broadcast get *12560000
                         response requests or no sends were rejected   *12580000
                         for broadcast noresponse requests              12600000
MQAMOSSAVED EQU X'10'    Message was saved.                             12620000
MQAMOSASYNCMSGACCESS EQU X'08' Indicates whether XCF had to access     *12624000
                         user storage describing/containing the        *12628000
                         message even after the IXCMSGO service        *12632000
                         returned.                                 @L1A 12636000
         ORG   MQAMOSFLAGS1+X'00000001'                                 12640000
MQAMOSFLAGS2 DS 1BL1                                                    12660000
MQAMOSFLAGS3 DS 1BL1                                                    12680000
MQAMSGOUTSUMMARY_LEN EQU *-MQAMSGOUTSUMMARY                             12700000
         ORG   ,                                                        12700300
*                                                                       12700600
*    *****************************************************************  12700900
*    *                                                               *  12701200
*    * Message In Summary                                            *  12701500
*    *                                                               *  12701800
*    *****************************************************************  12702100
*                                                                       12702400
*                                                                       12702700
         ORG   MQAENTDATA                                               12703000
MQAMSGINSUMMARY DS 0X                                                   12703300
MQAMISTOKEN DS 1CL0016   Token used to identify this message to the    *12703600
                         message-control service (IXCMSGC).             12703900
MQAMISUSERDATA DS 1CL0008 User data associated with the message. This  *12704200
                         is the data specified for the USERDATA        *12704500
                         keyword when the IXCMSGC service was invoked  *12704800
                         to save the message.                           12705100
MQAMISSOURCE DS 1CL0008  Member token of the member that sent this     *12705400
                         message.                                       12705700
         DS    1FL1      Reserved.                                      12706000
MQAMISFLAGS DS 0BL3      Flags describing characteristics of the       *12706300
                         message or its delivery.                       12706600
MQAMISDISCARDPENDING EQU X'80' Indicates that the Message was saved by  12706700
*                        the IXCMSGC service and was later discarded    12706800
*                        but the discard has not yet completed     @P2A 12706900
MQAMISNEEDSRESPONSE EQU X'40' Indicates whether the sender requested   *12707000
                         that XCF manage the gathering of a response   *12707200
                         to this message: '1'B if XCF is managing the  *12707500
                         response, '0'B if not. If so, send a response *12707800
                         using the IXCMSGO service, specifying         *12708100
                         ORIGINATOR for the SENDTO keyword and         *12708400
                         supplying a RESPONSEID equal to the value     *12708700
                         provided in the MqaMidResponseID field below. *12709000
                         Note that this flag reflects a specification  *12709300
                         made by the sender when the message was       *12709600
                         originally sent, and cannot be used to        *12709900
                         determine whether the desired response was    *12710200
                         sent or received.                              12710500
MQAMISISARESPONSE EQU X'20' Indicates whether this message is a        *12710800
                         response that is being managed by XCF: '1'B   *12711100
                         if it is an XCF managed response, '0'B if     *12711400
                         not.                                           12712100
MQAMISDELIVERED EQU X'10' '1'B if some portion of the message was      *12712900
                         delivered by message-in service, '0'B if none *12713200
                         of the message was delivered                   12713500
MQAMISSAVED EQU X'08'    '1'B if the message was saved with the        *12713800
                         message control SAVEMSG service.               12714100
         DS    1BL.019   Reserved.                                      12714400
         ORG   MQAMISFLAGS+X'00000003'                                  12714700
MQAMSGINSUMMARY_LEN EQU *-MQAMSGINSUMMARY                               12715000
         ORG   ,                                                        12715300
*                                                                       12715600
*    *****************************************************************  12715900
*    *                                                               *  12716200
*    * Message In Detail                                             *  12716500
*    *                                                               *  12716800
*    *****************************************************************  12717100
*                                                                       12717400
*                                                                       12717700
         ORG   MQAENTDATA                                               12718000
MQAMSGINDETAIL DS 0X                                                    12718300
MQAMIDTOKEN DS 1CL0016   Token used to identify this message to the    *12718600
                         message-control service (IXCMSGC).             12718900
MQAMIDUSERDATA DS 1CL0008 User data associated with the message. This  *12719200
                         is the data specified for the USERDATA        *12719500
                         keyword when the IXCMSGC service was invoked  *12719800
                         to save the message.                           12720100
MQAMIDMLEN DS  1FL4      Total number of bytes of message data         *12720400
                         available (remaining) for delivery via the    *12720700
                         message-in service.                            12721000
MQAMIDSOURCE DS 1CL0008  Member token of the member that sent this     *12721300
                         message.                                       12721600
MQAMIDMSGCNTL DS 1CL0032 MSGCNTL value from originator of the signal    12721900
         DS    1FL1      Reserved.                                      12722200
MQAMIDFLAGS DS 0BL3      Flags describing characteristics of the       *12722500
                         message or its delivery.                       12722800
MQAMIDDISCARDPENDING EQU X'80' Indicates that the Message was saved by  12722900
*                        the IXCMSGC service and was later discarded    12723000
*                        but the discard has not yet completed     @P2A 12723100
MQAMIDNEEDSRESPONSE EQU X'40' Indicates whether the sender requested   *12723200
                         that XCF manage the gathering of a response   *12723400
                         to this message: '1'B if XCF is managing the  *12723700
                         response, '0'B if not. If so, send a response *12724000
                         using the IXCMSGO service, specifying         *12724300
                         ORIGINATOR for the SENDTO keyword and         *12724600
                         supplying a RESPONSEID equal to the value     *12724900
                         provided in the MqaMidResponseID field below. *12725200
                         Note that this flag reflects a specification  *12725500
                         made by the sender when the message was        12725800
*                        originally sent, and cannot be used to        *12726100
                         determine whether the desired response was    *12726400
                         sent or received.                              12726700
MQAMIDISARESPONSE EQU X'20' Indicates whether this message is a        *12727000
                         response that is being managed by XCF: '1'B   *12727300
                         if it is an XCF managed response, '0'B if     *12727600
                         not.                                           12728300
MQAMIDDELIVERED EQU X'10' '1'B if some portion of the message was      *12729100
                         delivered by message-in service, '0'B if none *12729400
                         of the message was delivered                   12729700
MQAMIDSAVED EQU X'08'    '1'B if the message was saved with the        *12730000
                         message control SAVEMSG service.               12730300
         DS    1BL.019   Reserved.                                      12730600
         ORG   MQAMIDFLAGS+X'00000003'                                  12730900
MQAMIDRESPONSEID DS 1CL0024 Message Response ID. Valid when the        *12731200
                         MqaMidNeedsResponse flag is '1'B, otherwise   *12731500
                         undefined. Specify this value for the         *12731800
                         RESPONSEID keyword when invoking the          *12732100
                         message-out service (IXCMSGO) to reply to     *12732400
                         this message.                                  12732700
MQAMSGINDETAIL_LEN EQU *-MQAMSGINDETAIL                                 12733000
         ORG   ,                                                        12733300
*                                                                       12766600
*                                                                       12800000
* ********************************************************************  12850000
* *                                                                  *  12900000
* *                        Message Out Detail                        *  12950000
* *                                                                  *  13000000
* *                                                                  *  13050000
* *  This record has variable length.  It is designed so that        *  13100000
* *  the user can set up a pointer to a table of target/response     *  13150000
* *  entries.  The entire table is contained within this one record. *  13200000
* *                                                                  *  13250000
* *  First target/response entry is found as follows:                *  13300000
* *    TblEntryptr = addr(MqaEntry) + MqaModTblOffset                *  13350000
* *                                                                  *  13400000
* *  Subsequent entries are located as follows:                      *  13450000
* *    TblEntryptr = TblEntryptr + MqaModEntLen                      *  13500000
* *                                                                  *  13550000
* ********************************************************************  13600000
*                                                                       13650000
*                                                                       13700000
         ORG   MQAENTDATA                                               13750000
MQAMSGOUTDETAIL DS 0X                                                   13800000
MQAMODTOKEN DS 1CL0016   Token used to identify this message and any   *14050000
                         associated responses to other XCF services    *14100000
                         (such as IXCMSGC).                             14150000
MQAMODUSERDATA DS 1BL8   User data associated with the message.        *14200000
                         Contains a copy of the data specified for the *14250000
                         USERDATA keyword when the message-out service *14300000
                         (IXCMSGO) was invoked to send the message or  *14350000
                         as modified by the message control service    *14400000
                         (IXCMSGC) when message was saved or           *14450000
                         completed.                                     14500000
MQAMODFLAGS DS 0BL4      Flags describing characteristics of the       *14550000
                         message                                        14600000
MQAMODFLAGS0 DS 0BL1                                                    14650000
MQAMODBROADCAST EQU X'80' Indicates that the sender specified          *14700000
                         SENDTO(GROUP) on the IXCMSGO invocation.       14750000
MQAMODGETRESPONSE EQU X'40' Indicates whether the sender of this       *14800000
                         message requested XCF management of           *14850000
                         responses.                                     14900000
MQAMODISARESPONSE EQU X'20' Indicates whether this message is a        *14950000
                         response being managed by XCF.                 15000000
MQAMODSENDPENDING EQU X'10' Desired send(s) not initiated by the       *15050000
                         message-out service.                           15100000
MQAMODRESPPENDING EQU X'08' Expected response(s) not received.          15150000
MQAMODCOMPLETED EQU X'04' Indicates whether message considered to be   *15200000
                         complete. Note that this flag is not mutually *15250000
                         exclusive with the Send/RespPending flags     *15300000
                         since completion may have been forced or the  *15350000
                         message may have timed out.                    15400000
MQAMODTIMEDOUT EQU X'02' '1'B if the message did not complete within   *15450000
                         the time-out period.                           15500000
MQAMODCANCELLED EQU X'01' '1'B if the message did not complete before  *15550000
                         the message-out request was cancelled.         15600000
         ORG   MQAMODFLAGS0+X'00000001'                                 15616600
MQAMODFLAGS1 DS 0BL1                                                    15633200
MQAMODNOTIFYBYEXIT EQU X'80' Sender requested notifcation by exit when *15650000
                         complete                                       15700000
MQAMODDISCARDPENDING EQU X'40' Indicates that the message was marked    15742500
*                        for discard but the discard has not            15785000
*                        yet completed.                          @P2A   15827500
MQAMODSUCCESSFUL EQU X'20' Indicates whether the request completed     *15870000
                         successfully where no sends were rejected and *15890000
                         all responses were received for broadcast get *15910000
                         response requests or no sends were rejected   *15930000
                         for broadcast noresponse requests              15950000
MQAMODSAVED EQU X'10'    Message was saved.                             15970000
MQAMODASYNCMSGACCESS EQU X'08' Indicates whether XCF had to access     *15974000
                         user storage describing/containing the        *15978000
                         message even after the IXCMSGO service        *15982000
                         returned.                                 @L1A 15986000
         ORG   MQAMODFLAGS1+X'00000001'                                 15990000
MQAMODFLAGS2 DS 1BL1                                                    16010000
MQAMODFLAGS3 DS 1BL1                                                    16030000
MQAMODMLEN DS  1FL4      Number of bytes of message data for           *16050000
                         message-out request                            16100000
MQAMODSOURCE DS 1BL8     Member token of the sending member.            16150000
MQAMODMSGCNTL DS 1CL0032 Message control data from the message out     *16200000
                         request                                        16250000
MQAMOD#TARGETS DS 1FL4   Number of targets for message (including      *16300000
                         skipped targets).                              16350000
         DS    1FL4      Reserved.                                      16400000
MQAMODTBLOFFSET DS 1FL4  Offset of table containing target/response    *16450000
                         information for this message. Offset is from  *16500000
                         the start of the MqaEntry that contains the   *16550000
                         MqaMsgoutDetail record. Entries in the table  *16600000
                         are mapped by one of the following:           *16650000
                         MqaTargOnlyEntry MqaTargRespEntry Use         *16700000
                         MqaModEntType to determine which mapping      *16750000
                         should be used.                                16800000
         DS    1CL0001   Reserved                                       16850000
MQAMODENTTYPE DS 1FL1    Code that identifies which mapping to use for *16900000
                         the entries in the table of target/response   *16950000
                         data                                           17000000
MQAMODENTLEN DS 1FL2     Length in bytes of an individual entry in the *17050000
                         table containing target/response information. *17100000
                         Use this value when iterating through         *17150000
                         records. DO NOT hard code length of the       *17200000
                         records.                                       17250000
MQAMODKENTTYPETARGONLY EQU 1 Use MqaTargOnlyEntry                       17300000
MQAMODKENTTYPETARGRESP EQU 2 Use MqaTargRespEntry                       17350000
MQAMSGOUTDETAIL_LEN EQU *-MQAMSGOUTDETAIL                               17400000
         ORG   ,                                                        17450000
.L0005   ANOP                                                           17500000
*                                                                       17550000
* ********************************************************************  17600000
* *                                                                  *  17650000
* *                   Target/Response Table Entries                  *  17700000
* *                                                                  *  17750000
* *                                                                  *  17800000
* *  Assuming addressability is established to the MqaEntry that is  *  17850000
* *  a MqaMsgoDetail record.  Then the first target/response table   *  17900000
* *  entry is located as follows:                                    *  17950000
* *     TblEntryptr = addr(MqaEntry) + MqaModTblOffset               *  18000000
* *                                                                  *  18050000
* *  Subsequent target/response table entry is located as follows:   *  18100000
* *     TblEntryptr = TblEntryptr + TblEntryptr-> MqaModEntLen       *  18150000
* *                                                                  *  18200000
* *                                                                  *  18250000
* * DO NOT HARD CODE THE LENGTH OF THE RECORDS.  USE THE LENGTH AND  *  18300000
* * OFFSETS PROVIDED IN EACH RECORD (to ensure compatibility with    *  18350000
* * additional data provided in the future).                         *  18400000
* *                                                                  *  18450000
* ********************************************************************  18500000
*                                                                       18550000
*                                                                       18600000
         AIF   ('&MQATARGONLYENTRY' EQ 'NO').L0008                      18650000
         AIF   ('&DSECT' EQ 'YES').L0009                                18700000
         AIF   ('&MQATARGONLYENTRY' NE 'YES').L0008                     18750000
MQATARGONLYENTRY DS 0F   Entry to describe result of send to one       *18800000
                         particular target member.                      18850000
         AGO   .L000A                                                   18900000
.L0009   ANOP                                                           18950000
MQATARGONLYENTRY DSECT   Entry to describe result of send to one       *19000000
                         particular target member.                      19050000
.L000A   ANOP                                                           19100000
MQATOTARGET DS 1BL8      Target member token.                           19150000
MQATOSENDSTATUS DS 0BL4  Status of the message send                     19200000
MQATOSENDFLAGS DS 0BL2                                                  19250000
MQATOSENDINITIATED EQU X'80' '1'B if XCF initiated the send to this    *19400000
                         target member. It is not necessarily the case *19450000
                         that the initiated send was successful.        19500000
MQATOSENDSKIPPED EQU X'40' '1'B if target member token is hexadecimal  *19550000
                         zero, indicating that sender wanted to skip   *19600000
                         an entry in a message-out target table.        19650000
MQATOSENDPENDING EQU X'20' '1'B if the send to this target member is   *19700000
                         pending. XCF has not initiated the send. The  *19750000
                         message is eligible to be sent.                19800000
MQATOSENDREJECTED EQU X'10' '1'B if the send to this target member is  *19850000
                         rejected. The message is not eligible to be   *19900000
                         sent.                                          19950000
MQATOSENDASYNCMSGACCESS EQU X'08' '1'B if an AsyncMsgAccess send to    *19975000
                         this target member was started            @L1A 20000000
         DS    1BL.011   Reserved.                                 @L1C 20025000
         ORG   MQATOSENDFLAGS+X'00000002'                               20050000
         DS    1FL1      Reserved.                                      20100000
MQATOSENDRETCODE DS 1FL1 Return code from message-out service          *20150000
                         (IXCMSGO) with respect to the send to this    *20200000
                         particular target.                             20250000
MQATOSENDRSNCODE DS 1FL4 Valid if MqaToSendRetcode is nonzero. If so,  *20300000
                         contains failing reason code from message-out *20350000
                         service.                                       20400000
MQATARGONLYENTRY_LEN EQU *-MQATARGONLYENTRY                             20450000
.L0008   ANOP                                                           20500000
         AIF   ('&MQATARGRESPENTRY' EQ 'NO').L000B                      20550000
         AIF   ('&DSECT' EQ 'YES').L000C                                20600000
         AIF   ('&MQATARGRESPENTRY' NE 'YES').L000B                     20650000
MQATARGRESPENTRY DS 0F   Entry to describe result of send to and       *20700000
                         response from one target member.               20750000
         AGO   .L000D                                                   20800000
.L000C   ANOP                                                           20850000
MQATARGRESPENTRY DSECT   Entry to describe result of send to and       *20900000
                         response from one target member.               20950000
.L000D   ANOP                                                           21000000
MQATRTARGET DS 1BL8      Target member token.                           21050000
MQATRSENDSTATUS DS 0BL4  Status of the message send                     21100000
MQATRSENDFLAGS DS 0BL2                                                  21150000
MQATRSENDINITIATED EQU X'80' '1'B if XCF initiated the send to this    *21300000
                         target member It is not necessarily the case  *21350000
                         that the initiated send was successful.        21400000
MQATRSENDSKIPPED EQU X'40' '1'B if target member token is hexadecimal  *21450000
                         zero, indicating that sender wanted to skip   *21500000
                         an entry in a message-out target table.        21550000
MQATRSENDPENDING EQU X'20' '1'B if the send to this target member is   *21600000
                         pending. XCF has not initiated the send. The  *21650000
                         message is still eligible to be sent.          21700000
MQATRSENDREJECTED EQU X'10' '1'B if the send to this target member is  *21750000
                         rejected. The message is not eligible to be   *21800000
                         sent.                                          21850000
MQATRSENDASYNCMSGACCESS EQU X'08' '1'B if an AsyncMsgAccess send to    *21875000
                         this target member was started            @L1A 21900000
         DS    1BL.011   Reserved.                                 @L1C 21925000
         ORG   MQATRSENDFLAGS+X'00000002'                               21950000
         DS    1FL1      Reserved.                                      22000000
MQATRSENDRETCODE DS 1FL1 Return code from message-out service          *22050000
                         (IXCMSGO) with respect to the send to this    *22100000
                         particular target.                             22150000
MQATRSENDRSNCODE DS 1FL4 Valid if MqaToSendRetcode is nonzero. If so,  *22200000
                         contains failing reason code from message-out *22250000
                         service.                                       22300000
MQATRRESPSTATUS DS 0BL4  Status of response message                     22350000
MQATRRESPFLAGS DS 0BL2   Status of response.                            22400000
MQATRRESPEXPECTED EQU X'80' '1'B if XCF expected the target member to  *22550000
                         respond, '0'B if not.                          22600000
MQATRRESPRECEIVED EQU X'40' '1'B if a response was received by XCF,    *22650000
                         '0'B if not.                                   22700000
MQATRRESPAVAILABLE EQU X'20' '1'B if the associated response is        *22750000
                         available, '0'B if not. If the response was   *22800000
                         received but the associated response is not   *22850000
                         available, the response was delivered, saved, *22900000
                         or discarded.                                  22950000
MQATRRESPDELIVERED EQU X'10' '1'B if some portion of the response was  *23000000
                         delivered by message-in service, '0'B if none *23050000
                         of the response was delivered                  23100000
MQATRRESPSAVED EQU X'08' '1'B if the response was saved with the       *23150000
                         message control SAVEMSG service.               23200000
MQATRRESPDISCARDED EQU X'04' '1'B if the response was discarded with   *23250000
                         the message control DISCARDMSG service.        23300000
         DS    1BL.010   Reserved.                                      23350000
         ORG   MQATRRESPFLAGS+X'00000002'                               23800000
         DS    1FL1      Reserved.                                      23850000
MQATRRESPCODE DS 1FL1    Code to explain why XCF believes the response *23900000
                         was not received. See MnplKRespCode constants *23950000
                         defined in IXCYMNPL macro. Valid when         *24000000
                         MnplTrRespReceived is '0'B.                    24050000
MQATARGRESPENTRY_LEN EQU *-MQATARGRESPENTRY                             24100000
.L000B   ANOP                                                           32500000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 32550000
         AIF   ('&LIST' EQ 'YES').P4                                    32600000
.P3      ANOP                                                           32650000
         POP   PRINT                                                    32700000
.P4      ANOP                                                           32750000
.P_EXIT  ANOP                                                           32800000
         MEND                                                           32850000
**/ IXCYMQAA_2:;                                                        32900000
* %IXCYMQAA_INCLUDED = 'YES';                                           32950000
* %DCL ZCBPRINT CHAR EXT;                                               33000000
* %DEACTIVATE ZCBPRINT;                                                 33050000
* %DCL IXCYMQAA_LIST CHAR EXT;                                          33100000
* %DEACTIVATE IXCYMQAA_LIST;                                            33150000
* %IF IXCYMQAA_LIST ^= 'NO' &                                           33200000
*    ZCBPRINT ^= 'NO' %THEN                                             33250000
*   %GOTO IXCYMQAA_3;                                                   33300000
*   @LIST PUSH NOECHO;                                                  33350000
*   @LIST NOASSEMBLE NOECHO;                                            33400000
*   @LIST OFF C NOECHO;                                                 33450000
* %IXCYMQAA_3:;                                                         33500000
*/* Start of PL/X Source                                             */ 33550000
*                                                                       33600000
*  %IF IXCYMQAA_ALET = '' %THEN                                         33650000
*     %IXCYMQAA_ALET = '0';                                             33700000
*  %IXCYMQAA_VIA = '';                                                  33750000
*  %IF IXCYMQAA_ALET ^= '0' %THEN                                       33800000
*     %IXCYMQAA_VIA = 'VIA(IXCYMQAA_ALET)';                             33850000
*                                                                       33900000
*/********************************************************************/ 33950000
*/*                                                                  */ 34000000
*/*                            Header                                */ 34050000
*/*                                                                  */ 34100000
*/********************************************************************/ 34150000
*                                                                       34200000
*   DECLARE                                                             34250000
*     1    MqaHdr  BASED IXCYMQAA_VIA, /* Header record returned on     34300000
*                                      all queries.                  */ 34350000
*       3    MqaHdrLen   FIXED(32), /* Length in bytes of MqaHeader  */ 34400000
*       3    MqaHdrTlen FIXED(32),  /* Total length in bytes of         34450000
*                                      data area needed to contain      34500000
*                                      all the requested information    34550000
*                                      This length includes the header  34600000
*                                      as well as the entries that      34650000
*                                      WERE returned on this call.   */ 34700000
*       3    MqaHdr#Entries FIXED(32), /* Number of complete entries    34750000
*                                      of all kinds that were returned  34800000
*                                      on this call (does not include   34850000
*                                      the header).                  */ 34900000
*       3    MqaHdrEntOffset FIXED(32); /* Offset from MqaHeader at     34950000
*                                      which first entry is located. */ 35000000
*                                                                       35050000
*/********************************************************************/ 35100000
*/*                                                                  */ 35150000
*/*                        Entries                                   */ 35200000
*/*                                                                  */ 35250000
*/*                                                                  */ 35300000
*/*  First entry is located as follows:                              */ 35350000
*/*     Entryptr = addr(MqaHeader) + MqaHdrEntOffset                 */ 35400000
*/*                                                                  */ 35450000
*/*  Subsequent entry is located as follows:                         */ 35500000
*/*     Entryptr = Entryptr + Entryptr-> MqaEntLen                   */ 35550000
*/*                                                                  */ 35600000
*/*                                                                  */ 35650000
*/* DO NOT HARD CODE THE LENGTH OF THE RECORDS.  USE THE LENGTH AND  */ 35700000
*/* OFFSETS PROVIDED IN EACH RECORD (to ensure compatibility with    */ 35750000
*/* additional data provided in the future).                         */ 35800000
*/*                                                                  */ 35850000
*/********************************************************************/ 35900000
*                                                                       35950000
* DCL 1 MqaEntry based IXCYMQAA_VIA, /* Data record                  */ 36000000
*      3 MqaEntType fixed(8),       /* Type of data described in this   36050000
*                                      entry.                        */ 36100000
*      3 *           char(3),       /* Reserved                      */ 36150000
*      3 MqaEntLen fixed unsigned, /*  Number of bytes in this entry.   36200000
*                                      Use this value when iterating    36250000
*                                      through records.  DO NOT hard    36300000
*                                      code length of the records.   */ 36350000
*      3 *           char(8),       /* Reserved                      */ 36400000
*      3 MqaEntData char(*);        /* Variable content of the record.  36450000
*                                      Use MqaEntType to determine      36500000
*                                      which of the mappings below is   36550000
*                                      applicable.                   */ 36600000
*                                                                       36650000
*                                                                       36700000
*   /*****************************************************************/ 36750000
*   /*                                                               */ 36800000
*   /*       MQAA Entry Types                                        */ 36850000
*   /*                                                               */ 36900000
*   /*****************************************************************/ 36950000
*                                                                       37000000
*   DECLARE                                                             37050000
*     MQAKTypeMOS    BIT(8) CONSTANT('01'X), /* Message-out Summary  */ 37100000
*     MQAKTypeMIS    BIT(8) CONSTANT('02'X), /* Message-in Summary   */ 37150000
*     MQAKTypeMOD    BIT(8) CONSTANT('03'X), /* Message-out Detail   */ 37200000
*     MQAKTypeMID    BIT(8) CONSTANT('04'X); /* Message-in Detail       37250000
*                                                                @D1C*/ 37300000
*                                                                       37400000
*   /*****************************************************************/ 37450000
*   /*                                                               */ 37500000
*   /*                     Message Out Summary                       */ 37550000
*   /*                                                               */ 37600000
*   /*****************************************************************/ 37650000
*                                                                       37700000
*   DECLARE                                                             37750000
*     1    MqaMsgOutSummary defined(MqaEntry.MqaEntData), /* Message    37800000
*                                      Out Summary entry           */   37850000
*       3    MqaMosToken CHAR(16), /* Token used to identify this       37950000
*                                      message to the message-control   38000000
*                                      service (IXCMSGC). */            38050000
*       3    MqaMosUserData bit(64), /* User data associated with the   38100000
*                                      message.  Contains a copy of the 38150000
*                                      data specified for the USERDATA  38200000
*                                      keyword when the message-out     38250000
*                                      service (IXCMSGO) was invoked to 38300000
*                                      send the message or as modified  38350000
*                                      by the message control service   38400000
*                                      (IXCMSGC) when message was       38450000
*                                      saved or completed.           */ 38500000
*       3 MqaMosFlags   bit(32),                                        38550000
*         5 MqaMosFlags0   bit(8),                                      38583300
*          7 MqaMosBroadcast BIT(1), /* Indicates that the sender       38616600
*                                      specified SENDTO(GROUP) on the   38650000
*                                      IXCMSGO invocation.           */ 38700000
*          7 MqaMosGetResponse bit(1), /* Indicates whether the sender  38750000
*                                      of this message requested        38800000
*                                      XCF management of responses.  */ 38850000
*          7 MqaMosIsaResponse bit(1), /* Indicates whether this        38900000
*                                      message is a response being      38950000
*                                      managed by XCF.               */ 39000000
*          7 MqaMosSendPending BIT(1), /* Desired send(s) not           39050000
*                                      initiated by the message-out     39100000
*                                      service.                      */ 39150000
*          7 MqaMosRespPending BIT(1), /* Expected response(s) not      39200000
*                                      received.                     */ 39250000
*          7 MqaMosCompleted bit(1), /* Indicates whether message       39300000
*                                      considered to be complete.       39350000
*                                      Note that this flag is not       39400000
*                                      mutually exclusive with the      39450000
*                                      Send/RespPending flags since     39500000
*                                      completion may have been forced  39550000
*                                      or the message may have timed    39600000
*                                      out.                          */ 39650000
*          7 MqaMosTimedOut    bit(1), /* '1'B if the message did not   39700000
*                                      complete within the time-out     39750000
*                                      period.                       */ 39800000
*          7 MqaMosCancelled bit(1), /* '1'B if the message did not     39850000
*                                      complete before the message-out  39900000
*                                      request was cancelled.        */ 39950000
*         5 MqaMosFlags1   bit(8),                                      39975000
*          7 MqaMosNotifyByExit BIT(1), /* Sender requested             40000000
*                                      notification                     40025000
*                                      by Exit when complete.        */ 40050000
*          7 MqaMosDiscardPending Bit(1),/* Indicates that the          40100000
*                                       message was marked for discard  40150000
*                                       but the discard has not yet     40200000
*                                       completed.               @P2A*/ 40250000
*          7 MqaMosSuccessful BIT(1), /* Indicates whether the request  40300600
*                                       completed successfully where no 40301200
*                                       sends were rejected and all     40301800
*                                       responses were received for     40302400
*                                       broadcast get response requests 40303000
*                                       or no sends were rejected for   40303600
*                                       broadcast noresponse requests   40304200
*                                                                    */ 40304800
*          7 MqaMosSaved BIT(1),     /* Message was saved.           */ 40305400
*          7 MqaMosAsyncMsgAccess BIT(1), /* Indicates whether XCF      40305500
*                                      had to access user storage       40305600
*                                      describing/containing the        40305700
*                                      message even after the IXCMSGO   40305800
*                                      service returned.         @L1A*/ 40305900
*         5 MqaMosFlags2   bit(8),                                      40306000
*         5 MqaMosFlags3   bit(8),                                      40306600
*       3 * char(0);                /* End of entry                  */ 40307200
*   /*****************************************************************/ 40307800
*   /*                                                               */ 40308400
*   /*                     Message In Summary                        */ 40309000
*   /*                                                               */ 40309600
*   /*****************************************************************/ 40310200
*                                                                       40310800
*   DECLARE                                                             40311400
*     1    MqaMsgInSummary defined(MqaEntry.MqaEntData), /* Message In  40312000
*                                      Summary entry                 */ 40312600
*       3    MqaMisToken CHAR(16), /* Token used to identify this       40313200
*                                      message to the message-control   40313800
*                                      service (IXCMSGC). */            40314400
*       3    MqaMisUserData CHAR(8), /* User data associated with the   40315000
*                                      message.  This is the data       40315600
*                                      specified for the USERDATA       40316200
*                                      keyword when the IXCMSGC service 40316800
*                                      was invoked to save the          40317400
*                                      message.                      */ 40318000
*       3    MqaMisSource char(8),  /* Member token of the member       40318600
*                                      that sent this message.       */ 40319200
*       3    *          FIXED(8),   /* Reserved.                     */ 40319800
*                                                                       40320400
*       3    MqaMisFlags BIT(24),                                       40321000
*                                   /* Flags describing characteristics 40321600
*                                      of the message or its            40322200
*                                      delivery.                     */ 40322800
*         5 MqaMisDiscardPending BIT(1),/* Indicates that the Msg was   40323000
*                                          saved by the IXCMSGC service 40323200
*                                          and was later discarded but  40323400
*                                          the discard has not yet      40323600
*                                          completed @P2A*/             40323800
*         5 MqaMisNeedsResponse BIT(1),                                 40324000
*                                   /* Indicates whether the sender     40324600
*                                      requested that XCF manage the    40325200
*                                      gathering of a response to this  40325800
*                                      message:  '1'B if XCF is         40326400
*                                      managing the response, '0'B if   40327000
*                                      not.  If so, send a response     40327600
*                                      using the IXCMSGO service,       40328200
*                                      specifying ORIGINATOR for the    40328800
*                                      SENDTO keyword and supplying a   40329400
*                                      RESPONSEID equal to the value    40330000
*                                      provided in the MqaMidResponseID 40330600
*                                      field below.                     40331200
*                                                                       40331800
*                                      Note that this flag reflects a   40332400
*                                      specification made by the sender 40333000
*                                      when the message was originally  40333600
*                                      sent, and cannot be used to      40334200
*                                      determine whether the desired    40334800
*                                      response was sent or received.   40335400
*                                                                    */ 40336000
*         5 MqaMisIsaResponse BIT(1),                                   40336600
*                                   /* Indicates whether this message   40337200
*                                      is a response that is being      40337800
*                                      managed by XCF: '1'B if it is an 40338400
*                                      XCF managed response, '0'B if    40339000
*                                      not.                         */  40341400
*         5 MqaMisDelivered bit(1),   /* '1'B if some portion of        40343800
*                                      the message was delivered by     40344400
*                                      message-in service, '0'B if none 40345000
*                                      of the message was delivered  */ 40345600
*         5 MqaMisSaved bit(1),       /* '1'B if the message was        40346200
*                                      saved with the message control   40346800
*                                      SAVEMSG service.              */ 40347400
*         5 * BIT(19),              /* Reserved.                     */ 40348000
*       3 * char(0);                /* End of entry                  */ 40348600
*                                                                       40349200
*   /*****************************************************************/ 40349800
*   /*                                                               */ 40350400
*   /*                     Message In Detail                         */ 40351000
*   /*                                                               */ 40351600
*   /*****************************************************************/ 40352200
*                                                                       40352800
*   DECLARE                                                             40353400
*     1    MqaMsgInDetail defined(MqaEntry.MqaEntData), /* Message In   40354000
*                                      Detail entry                  */ 40354600
*       3    MqaMidToken CHAR(16),  /* Token used to identify this      40355200
*                                      message to the message-control   40355800
*                                      service (IXCMSGC). */            40356400
*       3    MqaMidUserData CHAR(8), /* User data associated with the   40357000
*                                      message.  This is the data       40357600
*                                      specified for the USERDATA       40358200
*                                      keyword when the IXCMSGC service 40358800
*                                      was invoked to save the          40359400
*                                      message.                      */ 40360000
*       3    MqaMidMlen fixed(32),  /* Total number of bytes of message 40360600
*                                      data available (remaining) for   40361200
*                                      delivery via the message-in      40361800
*                                      service.                      */ 40362400
*       3    MqaMidSource char(8),  /* Member token of the member       40363000
*                                      that sent this message.       */ 40363600
*       3    MqaMidMsgCntl CHAR(32), /* MSGCNTL value from originator   40364200
*                                      of the signal             @P1C*/ 40364800
*       3    *          FIXED(8),   /* Reserved.                     */ 40365400
*                                                                       40366000
*       3    MqaMidFlags BIT(24),                                       40366600
*                                   /* Flags describing characteristics 40367200
*                                      of the message or its            40367800
*                                      delivery.                     */ 40368400
*         5 MqaMidDiscardPending BIT(1),/* Indicates that the Msg was   40368600
*                                          saved by the IXCMSGC service 40368800
*                                          and was later discarded but  40369000
*                                          the discard has not yet      40369200
*                                          completed @P2A*/             40369400
*         5 MqaMidNeedsResponse BIT(1),                                 40369600
*                                   /* Indicates whether the sender     40370200
*                                      requested that XCF manage the    40370800
*                                      gathering of a response to this  40371400
*                                      message:  '1'B if XCF is         40372000
*                                      managing the response, '0'B if   40372600
*                                      not.  If so, send a response     40373200
*                                      using the IXCMSGO service,       40373800
*                                      specifying ORIGINATOR for the    40374400
*                                      SENDTO keyword and supplying a   40375000
*                                      RESPONSEID equal to the value    40375600
*                                      provided in the MqaMidResponseID 40376200
*                                      field below.                     40376800
*                                                                       40377400
*                                      Note that this flag reflects a   40378000
*                                      specification made by the sender 40378600
*                                      when the message was originally  40379200
*                                      sent, and cannot be used to      40379800
*                                      determine whether the desired    40380400
*                                      response was sent or received.   40381000
*                                                                    */ 40381600
*         5 MqaMidIsaResponse BIT(1),                                   40382200
*                                   /* Indicates whether this message   40382800
*                                      is a response that is being      40383400
*                                      managed by XCF: '1'B if it is an 40384000
*                                      XCF managed response, '0'B if    40384600
*                                      not.                         */  40387000
*         5 MqaMidDelivered bit(1),   /* '1'B if some portion of        40389400
*                                      the message was delivered by     40390000
*                                      message-in service, '0'B if none 40390600
*                                      of the message was delivered  */ 40391200
*         5 MqaMidSaved bit(1),       /* '1'B if the message was        40391800
*                                      saved with the message control   40392400
*                                      SAVEMSG service.              */ 40393000
*         5 * BIT(19),              /* Reserved.                     */ 40393600
*       3 MqaMidResponseID CHAR(24),                                    40394200
*                                   /* Message Response ID.  Valid when 40394800
*                                      the MqaMidNeedsResponse flag is  40395400
*                                      '1'B, otherwise undefined.       40396000
*                                      Specify this value for the       40396600
*                                      RESPONSEID keyword when invoking 40397200
*                                      the message-out service          40397800
*                                      (IXCMSGO) to reply to this       40398400
*                                      message.                      */ 40399000
*       3 * char(0);                /* End of entry                  */ 40399600
*                                                                       40400200
*                                                                       40400800
*  /*                                                          56@D1D*/ 40450400
*                                                                       40500000
*/********************************************************************/ 40550000
*/*                                                                  */ 40600000
*/*                        Message Out Detail                        */ 40650000
*/*                                                                  */ 40700000
*/*                                                                  */ 40750000
*/*  This record has variable length.  It is designed so that        */ 40800000
*/*  the user can set up a pointer to a table of target/response     */ 40850000
*/*  entries.  The entire table is contained within this one record. */ 40900000
*/*                                                                  */ 40950000
*/*  First target/response entry is found as follows:                */ 41000000
*/*    TblEntryptr = addr(MqaEntry) + MqaModTblOffset                */ 41050000
*/*                                                                  */ 41100000
*/*  Subsequent entries are located as follows:                      */ 41150000
*/*    TblEntryptr = TblEntryptr + MqaModEntLen                      */ 41200000
*/*                                                                  */ 41250000
*/********************************************************************/ 41300000
*                                                                       41350000
*   DECLARE                                                             41400000
*     1 MqaMsgOutDetail defined(MqaEntry.MqaEntData), /* Message Out    41450000
*                                      Detail entry                  */ 41500000
*       3 MqaModToken CHAR(16),     /* Token used to identify           41600000
*                                      this message and any associated  41650000
*                                      responses to other XCF           41700000
*                                      services (such as IXCMSGC).   */ 41750000
*       3 MqaModUserData bit(64),   /* User data associated with the    41800000
*                                      message.  Contains a copy of the 41850000
*                                      data specified for the USERDATA  41900000
*                                      keyword when the message-out     41950000
*                                      service (IXCMSGO) was invoked to 42000000
*                                      send the message or as modified  42050000
*                                      by the message control service   42100000
*                                      (IXCMSGC) when message was       42150000
*                                      saved or completed.           */ 42200000
*       3 MqaModFlags bit(32),      /* Flags describing characteristics 42250000
*                                      of the message                */ 42300000
*        5 MqaModFlags0 bit(8),                                         42333300
*         7 MqaModBroadcast BIT(1), /* Indicates that the sender        42366600
*                                      specified SENDTO(GROUP) on the   42400000
*                                      IXCMSGO invocation.           */ 42450000
*         7 MqaModGetResponse bit(1), /* Indicates whether the sender   42500000
*                                      of this message requested        42550000
*                                      XCF management of responses.  */ 42600000
*         7 MqaModIsaResponse bit(1), /* Indicates whether this         42650000
*                                      message is a response being      42700000
*                                      managed by XCF.               */ 42750000
*         7 MqaModSendPending BIT(1), /* Desired send(s) not            42800000
*                                      initiated by the message-out     42850000
*                                      service.                      */ 42900000
*         7 MqaModRespPending BIT(1), /* Expected response(s) not       42950000
*                                      received.                     */ 43000000
*         7 MqaModCompleted bit(1), /* Indicates whether message        43050000
*                                      considered to be complete.       43100000
*                                      Note that this flag is not       43150000
*                                      mutually exclusive with the      43200000
*                                      Send/RespPending flags since     43250000
*                                      completion may have been forced  43300000
*                                      or the message may have timed    43350000
*                                      out.                          */ 43400000
*         7 MqaModTimedOut    bit(1), /* '1'B if the message did not    43450000
*                                      complete within the time-out     43500000
*                                      period.                       */ 43550000
*         7 MqaModCancelled bit(1), /* '1'B if the message did not      43600000
*                                      complete before the message-out  43650000
*                                      request was cancelled.        */ 43700000
*        5 MqaModFlags1 bit(8),                                         43733300
*         7 MqaModNotifyByExit BIT(1), /* Sender requested notifcation  43766600
*                                      by exit when complete         */ 43800000
*         7 MqaModDiscardPending Bit(1),/* Indicates that the           43845800
*                                       message was marked for discard  43891600
*                                       but the discard has not yet     43937400
*                                       completed.               @P2A*/ 43983200
*         7 MqaModSuccessful BIT(1), /* Indicates whether the request   44029000
*                                       completed successfully where no 44075000
*                                       sends were rejected and all     44087500
*                                       responses were received for     44100000
*                                       broadcast get response requests 44112500
*                                       or no sends were rejected for   44125000
*                                       broadcast noresponse requests   44137500
*                                                                    */ 44150000
*         7 MqaModSaved BIT(1),     /* Message was saved.            */ 44162500
*         7 MqaModAsyncMsgAccess BIT(1), /* Indicates whether XCF       44164500
*                                      had to access user storage       44166500
*                                      describing/containing the        44168500
*                                      message even after the IXCMSGO   44170500
*                                      service returned.         @L1A*/ 44172500
*        5 MqaModFlags2 bit(8),                                         44175000
*        5 MqaModFlags3 bit(8),                                         44187500
*       3 MqaModMLen fixed unsigned, /* Number of bytes of message      44200000
*                                      data for message-out request  */ 44250000
*       3 MqaModSource bit(64),     /* Member token of the sending      44300000
*                                      member.                       */ 44350000
*       3 MqaModMsgcntl CHAR(32),   /* Message control data from the    44400000
*                                      message out request           */ 44450000
*       3 MqaMod#Targets fixed unsigned, /* Number of targets for       44500000
*                                      message (including skipped       44550000
*                                      targets).                     */ 44600000
*       3 *              fixed(32), /* Reserved.                     */ 44650000
*       3 MqaModTblOffset fixed(31), /* Offset of table containing      44700000
*                                      target/response information for  44750000
*                                      this message.  Offset is from    44800000
*                                      the start of the MqaEntry that   44850000
*                                      contains the MqaMsgoutDetail     44900000
*                                      record.  Entries in the table    44937500
*                                      are mapped by one of the         44975000
*                                      following:                       45012500
*                                        MqaTargOnlyEntry               45050000
*                                        MqaTargRespEntry               45100000
*                                      Use MqaModEntType to             45150000
*                                      determine which mapping should   45200000
*                                      be used.                      */ 45250000
*       3 * char(1),                /* Reserved                      */ 45300000
*       3 MqaModEntType fixed(8),   /* Code that identifies which       45350000
*                                      mapping to use for the entries   45400000
*                                      in the table of target/response  45450000
*                                      data                          */ 45500000
*       3 MqaModEntLen fixed(16),   /* Length in bytes of an            45550000
*                                      individual entry in the table    45600000
*                                      containing target/response       45650000
*                                      information.                     45700000
*                                      Use this value when iterating    45750000
*                                      through records.  DO NOT hard    45800000
*                                      code length of the records.   */ 45850000
*       3 * char(0);                /*                               */ 45900000
*                                                                       45950000
* Declare                            /* Values for MqaModEntType     */ 46000000
*   MqaModKEntTypeTargOnly constant(1), /* Use MqaTargOnlyEntry      */ 46050000
*   MqaModKEntTypeTargResp constant(2); /* Use MqaTargRespEntry      */ 46100000
*                                                                       46150000
*/********************************************************************/ 46200000
*/*                                                                  */ 46250000
*/*                   Target/Response Table Entries                  */ 46300000
*/*                                                                  */ 46350000
*/*                                                                  */ 46400000
*/*  Assuming addressability is established to the MqaEntry that is  */ 46450000
*/*  a MqaMsgoDetail record.  Then the first target/response table   */ 46500000
*/*  entry is located as follows:                                    */ 46550000
*/*     TblEntryptr = addr(MqaEntry) + MqaModTblOffset               */ 46600000
*/*                                                                  */ 46650000
*/*  Subsequent target/response table entry is located as follows:   */ 46700000
*/*     TblEntryptr = TblEntryptr + TblEntryptr-> MqaModEntLen       */ 46750000
*/*                                                                  */ 46800000
*/*                                                                  */ 46850000
*/* DO NOT HARD CODE THE LENGTH OF THE RECORDS.  USE THE LENGTH AND  */ 46900000
*/* OFFSETS PROVIDED IN EACH RECORD (to ensure compatibility with    */ 46950000
*/* additional data provided in the future).                         */ 47000000
*/*                                                                  */ 47050000
*/********************************************************************/ 47100000
*                                                                       47150000
*   DECLARE                                                             47200000
*     1 MqaTargOnlyEntry based IXCYMQAA_VIA,  /* Entry                  47250000
*                                      to describe result of send       47300000
*                                      to one particular target         47350000
*                                      member.                       */ 47400000
*       3 MqaToTarget bit(64),      /* Target member token.          */ 47450000
*       3 MqaToSendStatus bit(32),  /* Status of the message send    */ 47500000
*         5 MqaToSendFlags bit(16),                                     47550000
*           7 MqaToSendInitiated bit(1), /* '1'B if XCF initiated the   47600000
*                                      send to this target member.      47650000
*                                      It is not necessarily the case   47700000
*                                      that the initiated send was      47750000
*                                      successful.                   */ 47800000
*           7 MqaToSendSkipped    bit(1), /* '1'B if target member      47850000
*                                      token is hexadecimal zero,       47900000
*                                      indicating that sender wanted to 47950000
*                                      skip an entry in a message-out   48000000
*                                      target table.                 */ 48050000
*           7 MqaToSendPending    bit(1), /* '1'B if the send to this   48100000
*                                      target member is pending.        48150000
*                                      XCF has not initiated the send.  48200000
*                                      The message is eligible          48250000
*                                      to be sent.                   */ 48300000
*           7 MqaToSendRejected   bit(1), /* '1'B if the send to this   48350000
*                                      target member is rejected.       48400000
*                                      The message is not eligible      48450000
*                                      to be sent.                   */ 48500000
*           7 MqaToSendAsyncMsgAccess bit(1), /* '1'B if an             48520000
*                                      AsyncMsgAccess send to this      48540000
*                                      target member was started @L1A*/ 48560000
*           7 * bit(11),            /* Reserved.                 @L1C*/ 48580000
*         5 * fixed(8),             /* Reserved.                     */ 48600000
*         5 MqaToSendRetcode fixed(8), /* Return code from message-out  48650000
*                                      service (IXCMSGO) with respect   48700000
*                                      to the send to this particular   48750000
*                                      target.                       */ 48800000
*       3 MqaToSendRsncode fixed(32), /* Valid if MqaToSendRetcode is   48850000
*                                      nonzero.                         48900000
*                                      If so, contains failing          48950000
*                                      reason code from message-out     49000000
*                                      service.                      */ 49050000
*       3 * char(0);                /*                               */ 49100000
*                                                                       49150000
* DECLARE                                                               49200000
*     1 MqaTargRespEntry based IXCYMQAA_VIA,  /* Entry                  49250000
*                                      to describe result of send       49300000
*                                      to and response from one target  49350000
*                                      member.                       */ 49400000
*       3 MqaTrTarget bit(64),      /* Target member token.          */ 49450000
*       3 MqaTrSendStatus bit(32),  /* Status of the message send    */ 49500000
*         5 MqaTrSendFlags bit(16),                                     49550000
*           7 MqaTrSendInitiated bit(1), /* '1'B if XCF initiated the   49600000
*                                      send to this target member       49650000
*                                      It is not necessarily the case   49700000
*                                      that the initiated send was      49750000
*                                      successful.                   */ 49800000
*           7 MqaTrSendSkipped    bit(1), /* '1'B if target member      49850000
*                                      token is hexadecimal zero,       49900000
*                                      indicating that sender wanted to 49950000
*                                      skip an entry in a message-out   50000000
*                                      target table.                 */ 50050000
*           7 MqaTrSendPending    bit(1), /* '1'B if the send to this   50100000
*                                      target member is pending.        50150000
*                                      XCF has not initiated the send.  50200000
*                                      The message is still eligible    50250000
*                                      to be sent.                   */ 50300000
*           7 MqaTrSendRejected   bit(1), /* '1'B if the send to this   50350000
*                                      target member is rejected.       50400000
*                                      The message is not eligible      50450000
*                                      to be sent.                   */ 50500000
*           7 MqaTrSendAsyncMsgAccess bit(1), /* '1'B if an             50520000
*                                      AsyncMsgAccess send to this      50540000
*                                      target member was started @L1A*/ 50560000
*           7 * bit(11),            /* Reserved.                 @L1C*/ 50580000
*         5 * fixed(8),             /* Reserved.                     */ 50600000
*         5 MqaTrSendRetcode fixed(8), /* Return code from message-out  50650000
*                                      service (IXCMSGO) with respect   50700000
*                                      to the send to this particular   50750000
*                                      target.                       */ 50800000
*       3 MqaTrSendRsncode fixed(32), /* Valid if MqaToSendRetcode is   50850000
*                                      nonzero.                         50900000
*                                      If so, contains failing          50950000
*                                      reason code from message-out     51000000
*                                      service.                      */ 51050000
*       3 MqaTrRespStatus bit(32),  /* Status of response message    */ 51100000
*         5 MqaTrRespFlags bit(16), /* Status of response.           */ 51150000
*           7 MqaTrRespExpected bit(1), /* '1'B if XCF expected         51200000
*                                      the target member to respond,    51250000
*                                      '0'B if not.                  */ 51300000
*           7 MqaTrRespReceived bit(1), /* '1'B if a response was       51350000
*                                      received by XCF, '0'B if not. */ 51400000
*           7 MqaTrRespAvailable bit(1), /* '1'B if the associated      51450000
*                                      response is available, '0'B if   51500000
*                                      not.  If the response was        51550000
*                                      received but the associated      51600000
*                                      response is not available, the   51650000
*                                      response was delivered, saved,   51700000
*                                      or discarded.                 */ 51750000
*           7 MqaTrRespDelivered bit(1), /* '1'B if some portion of     51800000
*                                      the response was delivered by    51850000
*                                      message-in service, '0'B if none 51900000
*                                      of the response was delivered */ 51950000
*           7 MqaTrRespSaved bit(1), /* '1'B if the response was        52000000
*                                      saved with the message control   52050000
*                                      SAVEMSG service.              */ 52100000
*           7 MqaTrRespDiscarded bit(1), /* '1'B if the response was    52150000
*                                      discarded with the message       52200000
*                                      control DISCARDMSG service.   */ 52250000
*           7 * bit(10),            /* Reserved.                     */ 52300000
*         5 * fixed(8),             /* Reserved.                     */ 53100000
*         5 MqaTrRespCode fixed(8), /* Code to explain why XCF          53150000
*                                      believes                         53200000
*                                      the response was not received.   53250000
*                                      See MnplKRespCode constants      53300000
*                                      defined in IXCYMNPL macro.       53350000
*                                      Valid when MnplTrRespReceived    53400000
*                                      is '0'B.                      */ 53450000
*       3 * char(0);                /*                               */ 53500000
*                                                                       53550000
*                                                                       53600000
*/* End of PL/X Source                                               */ 64650000
* %IF IXCYMQAA_LIST ^= 'NO' &                                           64700000
*    ZCBPRINT ^= 'NO' %THEN                                             64750000
*   %GOTO IXCYMQAA_4;                                                   64800000
*   @LIST POP NOECHO;                                                   64850000
* %IXCYMQAA_4:;                                                         64900000
* %END;                                                                 64950000
