*                                                                       00050000
* %DCL IXCYMSGC_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IXCYMSGC_INCLUDED;                                        00150000
* %IF IXCYMSGC_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 95282. CBGEN compile date 95240         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IXCYMSGC &DSECT=YES,&LIST=YES                                  00450000
         GBLC  &IXCYMSGC_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IXCYMSGC_INCLUDED SETC 'YES'                                           00600000
 TITLE   'IXCYMSGC  - Constants for users of the IXCMSGC service      '*00650000
                                                                        00700000
**/ IXCYMSGC_1:;                                                        00750000
*/* START OF SPECIFICATIONS ******************************************* 00800000
*                                                                       00850000
*01* PROPRIETARY STATEMENT =                                            00900000
*                                                                       00950000
*    LICENSED MATERIALS - PROPERTY OF IBM                               01000000
*    THIS MODULE IS RESTRICTED MATERIALS OF IBM                         01050000
*    5645-001 (C) COPYRIGHT IBM CORP. 1996, 1997                        01100000
*                                                                       01150000
*01* STATUS = HBB6603                                                   01200000
*                                                                       01250000
*01* END OF PROPRIETARY STATEMENT                                       01300000
*                                                                       01350000
*01* EXTERNAL CLASSIFICATION: GUPI                                      01400000
*01* END OF EXTERNAL CLASSIFICATION:                                    01450000
*                                                                       01500000
*02* NOTE:  THIS IS A SET OF CONSTANTS NOT AN ACTUAL DATA AREA          01550000
*           DATA AREA INFORMATION IS NOT APPLICABLE.                    01600000
*                                                                       01650000
*01* DESCRIPTIVE NAME: Constants for users of the IXCMSGC service       01700000
*                                                                       01750000
*02* ACRONYM:  N/A                                                      01800000
*                                                                       01850000
*01* MACRO NAME:  IXCYMSGC                                              01900000
*                                                                       01950000
*01* DSECT NAME: N/A                                                    02000000
*                                                                       02050000
*01* COMPONENT:  Cross System Coupling Services (SCXCF)                 02100000
*                                                                       02150000
*01* EYE CATCHER: None                                                  02200000
*02*   OFFSET:    N/A                                                   02250000
*02*   LENGTH:    N/A                                                   02300000
*                                                                       02350000
*01* STORAGE ATTRIBUTES:                                                02400000
*02*   MAIN STORAGE: N/A                                                02450000
*                                                                       02500000
*01* SIZE:   0 bytes                                                    02550000
*                                                                       02600000
*01* CREATED BY: N/A                                                    02650000
*                                                                       02700000
*01* POINTED TO BY: N/A                                                 02750000
*                                                                       02800000
*01* SERIALIZATION:  None                                               02850000
*                                                                       02900000
*01* FUNCTION:  Provides a list of constants for users of IXCMSGC       02950000
*                                                                       03000000
*01* METHOD OF ACCESS:                                                  03050000
*                                                                       03100000
*   PLAS: %INCLUDE SYSLIB(IXCYMSGC)                                     03150000
*   ASM:  IXCYMSGC                                                      03200000
*                                                                       03250000
* DELETED-BY: N/A                                                       03300000
*                                                                       03350000
* DEPENDENCIES: N/A                                                     03400000
*                                                                       03450000
* NOTES:                                                                03500000
*                                                                       03525000
* NOTE carefully that bits 0-15 of                                      03550000
* the reason code may contain component-diagnostic data and must not be 03600000
* assumed to be 0. The constant IXCMSGCRsnCodeMask is provided for      03650000
* masking off the component-diagnostic data.                            03700000
*                                                                       03750000
* CHANGE-ACTIVITY:                                                      03800000
*   $L0=XCFBC   ,JBB6602 951009 PD00CJ:  XCF Broadcast                  03830000
*   $L1=XCFBC   ,HBB6603 951009 PD00CJ:  XCF Broadcast                  03854000
*   $L2=XCFBC   ,HBB6603 951009 PD00CJ:  XCF Broadcast                  03878000
*   $L3=XCFBC   ,HBB6603 951213 PD00CJ:  XCF Broadcast                  03902000
*   $P1=PSD0657 ,JBB6602 960112 PD00CJ:  Changed                        03907300
*                               IXCMSGCRSNTokenForForceCompletion to    03912600
*                               IXCMSGCRSNTokenNOTForForceCompletion    03917900
*   $P2=PQC0695 ,HBB6603 960112 PD00CJ: Changed                         03923200
*                               IXCMSGCRSNTokenForSaveMsg to            03928500
*                               IXCMSGCRSNTokenNotForSaveMsg and        03933800
*                               IXCMSGCRSNTokenForDiscardMsg to         03939100
*                               IXCMSGCRSNTokenNotForDiscardMsg         03944400
*   $L4=XCFBC   ,HBB6603 960630 PD00CJ:  XCF Broadcast                  03947200
*   $L5=XCFBC   ,HBB6603 960630 PD00CJ:  XCF Broadcast                  03948600
*   $P3=PQC1878 ,HBB6603 960719 PD00CJ: Changed the description for     03948800
*                                     IXCMSGCRSNTokenForCallExitInvalid 03949000
*   $P4=PQC1795 ,HBB6603 960723 PD00CJ: Changed the description for     03949200
*                                     IXCMSGCRSNMessageUnavailable      03949400
*   $L6=XCFBC   ,HBB6603 960815 PD00CJ:  Check point DUAL               03949700
*  $P5=PQC1242 ,HBB6603 960830 PD00CJ: Added IXCMSGCRSNBadExitForCallEx 03958000
*  $P6=PQC2443 ,HBB6603 960915 PD00CJ: Fix ASM errors                   03966300
*  $P7=PQC2270 ,HBB6603 960906 PD00CJ: Added                            03974600
*                                   IXCMSGCRSNTaskModeCallExitWithFRR   03982900
*  $P8=PQC2914 ,HBB6603 912126 PD00DT: Added IXCMSGCRSNMessagePending   03985600
*                                                                       03988300
*END OF SPECIFICATIONS ***********************************************/ 03991200
*% /*                                                                   04000000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04050000
         AIF   ('&LIST' EQ 'YES').P2                                    04100000
.P1      ANOP                                                           04150000
         PUSH  PRINT                                                    04200000
         PRINT OFF                                                      04250000
.P2      ANOP                                                           04300000
*                                                                       04350000
*   IXCMSGC Return and Reason Code definitions                          04400000
*NOTE carefully that bits 0-15 of                                       04408300
*the reason code may contain component-diagnostic data and must not be  04416600
*assumed to be 0. The constant IXCMSGCRsnCodeMask is provided for       04424900
*masking off the component-diagnostic data.                             04433200
*                                                                       04441500
*                                                                       04450000
*                                                                       04500000
IXCMSGCRCSUCCESSFUL EQU X'00000000' Meaning: Successful completion     *04550000
                         Action: None                                   04600000
IXCMSGCRCWARNING EQU X'00000004' Meaning: Warning, reason code in R0   *04650000
                         Action: See reason code                        04700000
IXCMSGCRCINVALIDPARMS EQU X'00000008' Meaning: Invalid parameters,     *04750000
                         reason code in R0 Action: See reason code      04800000
IXCMSGCRCENVIRONMENTALERROR EQU X'0000000C' Meaning: The current       *04810000
                         environment cause the request to fail.        *04820000
                         Action: See reason code                        04830000
IXCMSGCRCSYSTEMERROR EQU X'00000010' Meaning: System error. XCF        *04840000
                         processing failure. Action: Save the reason   *04880000
                         code information, and contact the IBM support *04920000
                         center.                                        04960000
IXCMSGCRSNCODEMASK EQU X'0000FFFF' Use this mask to isolate the non    *05450000
                         component-diagnostic portion of the reason    *05500000
                         code.                                          05550000
IXCMSGCRSNANSAREATOOSMALL EQU X'00000004'                              *05552300
                     Meaning: The query request completed successfully.*05554600
                     The ANSAREA provided was large enough             *05556900
                     to contain the header information (MqaHeader),    *05559200
                     but was not large enough to contain all the       *05561500
                     data that was requested. The MqaHdrTlen field     *05563800
                     indicates the total length of the output          *05566100
                     answer area that would have been needed to        *05568400
                     contain all the requested information.            *05570700
                     It is possible that only the MqaHeader was        *05573000
                     provided in which case MqaHdr#Entries would       *05575300
                     be zero.                                          *05577600
                     Action:                                           *05579900
                     Retry the request with an ANSAREA whose length is *05582200
                     greater than or equal to the number of bytes      *05584500
                     indicated by MqaHdrTlen.  Note that the amount of *05586800
                     data to be returned can change dynamically, so    *05589100
                     that the length indicated by MqaHdrTlen may be    *05591400
                     too small for all the data when the request is    *05593700
                     tried again.                                 @L5A  05596000
IXCMSGCRSNMSGALREADYCOMPLETE EQU X'00000008' Meaning: Message already  *05600000
                         completed. Action: None, Message COMPLETION   *05650000
                         requested for a message that was already      *05700000
                         completed.                                     05750000
IXCMSGCRSNMSGDISCARDPENDING EQU X'00000018' Meaning: Message discard   *05757100
                         pending. An exit routine is currently         *05764200
                         processing the message. The message will be   *05771300
                         deleted as soon as the currently active       *05778400
                         message service (such as IXCMSGI) completes.  *05785500
                         Action: None, the message is not available     05792600
IXCMSGCRSNMEMBERNOTACTIVE EQU X'00000004' Meaning: Member token does   *05800000
                         not identify an active member associated with *05850000
                         the primary address space current when the    *05900000
                         Message-Control service was invoked. Action:  *05950000
                         Reissue the request with a correct member     *06000000
                         token.                                         06050000
IXCMSGCRSNINAPPROPEXITROUTINENAME EQU X'00000016'                       06054500
*                                                                       06059000
*                                      Meaning: Inappropriate exit      06063500
*                                      routine type. Action: The type   06068000
*                                      of exit specified for a          06072500
*                                      CALLEXIT request must            06077000
*                                      be appropriate for the type of   06081500
*                                      message to be processed.         06086000
*                                      Messages saved by a message      06090500
*                                      exit routine and responses       06095000
*                                      saved by a notify exit routine   06099500
*                                      must be processed by a message   06104000
*                                      exit routine. A completed        06108500
*                                      message-out request, or a        06113000
*                                      saved message/response entity    06117500
*                                      must be processed by a notify    06122000
*                                      exit routine. Retry the          06126500
*                                      request with the correct exit    06131000
*                                      routine.                         06135500
*                                                                       06140000
IXCMSGCRSNRESERVEDFIELDNOTNULL EQU X'00000040' Meaning: Program error  *06144500
                         A reserved field in                           *06150000
                         the control parameter list is not zero.       *06200000
                         Action: Check to see if your program          *06250000
                         inadvertently overlaid the parameter list     *06300000
                         storage, and that it was assembled with the   *06350000
                         correct macro library for the release of MVS  *06400000
                         your program is running on.              @L2C  06450000
IXCMSGCRSNBADPLISTALET EQU X'00000100' Meaning: Program error. Your    *06500000
                         program is not running in primary ASC mode,   *06550000
                         and the ALET that qualifies the address of    *06600000
                         the control parameter list is neither zero    *06650000
                         nor associated with a valid public entry on   *06700000
                         the DU-AL or in a common area data space      *06750000
                         Action: Ensure that:                          *06794400
                         Your program is not intended to run in        *06838800
                         primary ASC mode, You specified SYSSTATE      *06883200
                         ASCENV=AR before issuing the IXCMSGC          *06927600
                         macro, and the ALET for the parameter         *06972000
                         list is a valid public entry on the           *07016400
                         DU-AL ,is zero (primary address space         *07060800
                         ALET) or in a common area data space.          07105200
IXCMSGCRSNBADPLISTVERSION EQU X'00000104' Meaning: Parameter list not  *07150000
                         valid. Version number in parameter list is    *07200000
                         not valid. The release level of XCF on which  *07250000
                         the caller is running does not support this   *07300000
                         version of the message control service.       *07350000
                         Action: Retry the request with the correct    *07400000
                         version.                                       07450000
IXCMSGCRSNBADPLISTFUNCCODE EQU X'00000108' Meaning: Parameter list not *07500000
                         valid. Function code not valid. Action: Retry *07550000
                         the request                                    07600000
IXCMSGCRSNBADPLISTADDRESS EQU X'0000010C' Meaning: Parameter list not  *07650000
                         accessible. storage is not addressable.       *07700000
                         Action: Make sure the parameter list is       *07750000
                         accessible to XCF and retry the request.       07800000
IXCMSGCRSNNOTENABLED EQU X'0000011C' Meaning: The caller is not        *07850000
                         enabled. Action: Correct your program so that *07900000
                         it does not issue IXCMSGC while it is         *07950000
                         disabled.                                      08000000
IXCMSGCRSNLOCKSHELD EQU X'0000012C' Meaning: The caller is holding a   *08050000
                         lock. Action: Correct your program so that it *08100000
                         does not issue IXCMSGC while holding any      *08150000
                         locks.                                         08200000
IXCMSGCRSNANSAREASMALLERTHANHEADER EQU X'0000013C'                      08201200
*                                                                       08202400
*                                      Meaning: ANSAREA too small.      08203600
*                                      Action: The answer area must     08204800
*                                      be at least as long as the       08206000
*                                      header record (MqaHeader).       08207200
*                                      Retry the request with a         08208400
*                                      larger answer area.              08209600
*                                                                       08210800
IXCMSGCRSNANSAREABADALET EQU X'00000140' Meaning: ANSAREA not          *08212000
                         accessible. Action: The ALET of the ANSAREA   *08213200
                         is neither zero nor a valid entry on the      *08214400
                         Dispatchable Unit Access List (DU-AL), nor a  *08215600
                         valid entry for a common area data space.     *08216800
                         Retry the request with the correct ALET.       08218000
IXCMSGCRSNANSAREABADADDRESS EQU X'00000148' Meaning: Error accessing   *08219200
                         ANSAREA. Action: Make sure the ANSAREA is     *08220400
                         accessible to XCF, and reissue the request.    08221600
IXCMSGCRSNTOKENNOTFORSAVEMSG EQU X'00000200' Meaning: TOKEN not valid  *08222800
                         for SAVEMSG service. Action: Verify that      *08224000
                         the token specified is the MsgIToken provided *08225200
                         to the message exit or notify exit and retry  *08226400
                         the request with the correct Token.      @P2C  08227600
IXCMSGCRSNTOKENNOTFORDISCARDMSG EQU X'00000204' Meaning: TOKEN not     *08228800
                         valid for DISCARDMSG service. Action: Retry   *08230000
                         the request with the correct Token.      @P2C  08231200
IXCMSGCRSNTOKENFORCALLEXITINVALID EQU X'00000208'                       08232400
*                        Meaning: TOKEN not valid for CALLEXIT          08234600
*                        service.  CALLEXIT can be only be used for     08236800
*                        messages that were saved by a Notify or        08239000
*                        Message Exit via the SAVEMSG service.  The     08241200
*                        TOKEN must be a RETMSGTOKEN that was           08243400
*                        returned by the SAVEMSG service.               08245600
*                                                                       08248000
*                        Action: Insure that that the token is one      08248400
*                        that was returned by a successful              08248800
*                        invocation of the SAVEMSG service.             08249200
*                                                                @P3C   08249600
IXCMSGCRSNMESSAGEUNAVAILABLE EQU X'0000020C' Meaning: Message not      *08250000
                         available. Message indicated by TOKEN does    *08300000
                         not exist. Message was either completely      *08350000
                         delivered, discarded, or saved. Action:       *08381200
                         Verify the token, if mis-specified reissue    *08412400
                         the request with a new correct TOKEN. For a   *08435800
                         RETMSGOTOKEN or a saved token (RETMSGTOKEN),  *08459200
                         insure that the MEMTOKEN                      *08482600
                         identifies the member who was presented the   *08506000
                         token by XCF. If the message was saved,       *08517700
                         then a new message would be assigned and the  *08529400
                         RETMSGTOKEN returned by IXCMSGC would have to *08541100
                         be used. If the token is for a response and   *08552800
                         the associated message/response entity        *08564500
                         was saved or discarded, then the old response *08576200
                         tokens are invalidated.              @P4C      08587900
IXCMSGCRSNMESSAGETOKENINVALID EQU X'00000210' Meaning: TOKEN not       *08600000
                         valid. Action: Verify the token an retry the  *08650000
                         request with the correct Token.                08700000
IXCMSGCRSNTOKENNOTFORFORCECOMPLETION EQU X'00000220' MEANING: Message  *08750000
                         Token not valid for Force Completion. The     *08800000
                         Message Token must be a token that was        *08850000
                         returned by the IXCMSGO service via the       *08900000
                         RETMSGOTOKEN keyword. Action: Verify the token*08950000
                         and retry the request with the correct        *09000000
                         Token                                @L2A @P1C 09004400
IXCMSGCRSNBADRETMSGTOKENALET EQU X'00000308' Meaning: The ALET that    *09008800
                         qualifies the address of the RETMSGTOKEN is   *09013200
                         neither zero nor a valid entry on the         *09017600
                         Dispatchable Unit Access List (DU-AL), nor a  *09022000
                         valid entry for a common area data space.     *09026400
                         Action: Retry the request with the correct    *09030800
                         ALET                                           09035200
IXCMSGCRSNBADRETMSGTOKENADDRESS EQU X'00000309'                         09039600
*                        Meaning: RETMSGTOKEN not                       09044000
*                        accessible. The Message                        09048400
*                        Control Service was not able                   09052800
*                        to store a message token in                    09057200
*                        the storage area indicated by                  09061600
*                        RETMSGTOKEN.                                   09066000
*                        Action: The message would have already been    09070400
*                        saved and a new message token                  09074800
*                        assigned.  As such, the only way to get        09079200
*                        the new MESSAGE token is to do an              09083600
*                        IXCMSGC query looking for UDATA that           09088000
*                        matched the one specified.  @L3C               09092400
IXCMSGCRSNBADEXITFORCALLEXIT      EQU X'0000030A'                       09092700
*                        Meaning: For a CALLEXIT request, XCF           09093000
*                        attempted to call the exit but the message     09093300
*                        or notify exit abended. The exit address could 09093600
*                        be invalid or the exit may have done some      09093900
*                        processing. The specified message may          09094200
*                        have been processed by the exit routine        09094500
*                        before it abended. As such, the token          09094800
*                        may or may not specify a currently valid       09095100
*                        message.                                       09095400
*                        Action:  Verify the exit address and attempt   09095700
*                        the CallExit request again.            @P4A    09095800
IXCMSGCRSNTASKMODECALLEXITWITHFRR EQU X'0000030E'                       09095900
*                        Meaning: For a CALLEXIT request that was made  09096000
*                        in Task mode, the caller had an FRR            09096100
*                        established.                                   09096200
*                        Action: Correct your program so that it        09096300
*                        does not issue IXCMSGC Request(CALLEXIT)       09096400
*                        with FRRs established while in Task mode. @P6A 09096500
IXCMSGCRSNMSGNOTAVAILOTHEREXIT EQU X'00000C04' Meaning: Message not    *09096800
                         available. Action: Another exit routine is    *09101200
                         currently processing the message. Try again   *09105600
                         later.                                         09110000
IXCMSGCRSNNOUSERMSGSPACEAVAIL  EQU X'00000C08'                          09110800
*                        Meaning: No user message space                 09111600
*                        available.  All the message storage            09112400
*                        space managed by XCF on behalf of the          09113200
*                        member are full.                               09114000
*                        Action:  Use the Message Control               09114800
*                        DISCARDMSG Service to discard one or           09115600
*                        more messages in order to make more            09116400
*                        storage available.                     @L4A    09117200
IXCMSGCRSNDUALCANNOTBEEXPANDED EQU X'00000C0C'                          09118000
*                        Meaning: Unable to process a CALLEXIT,         09121100
*                        QUERYMSG, or COMPLETION request.  A STOKEN     09124200
*                        that is required to be added to the current    09127300
*                        DUAL (Dispatchable Unit Access List) could not 09130400
*                        be added due to the DUAL being full or not     09133500
*                        expandable.  Action: Try again later or remove 09136600
*                        an entry from the DUAL and try again.  @L6C    09139700
IXCMSGCRSNNOWORKINGSTORAGE     EQU X'00000C10'                          09143400
*                        Meaning: A IXCMSGC QUERY request could not     09144700
*                        be performed because XCF could not obtain      09146000
*                        working storage in the XCF address space.      09147300
*                        Action: Try again later                 @L4A   09148600
IXCMSGCRSNTOKENNOTFORQUERYMSG EQU X'00000C14' Meaning: TOKEN not        09148900
*                        valid for QUERYMSG service. Action: Retry      09149200
*                        the request with the correct Token.     @L5A   09149500
IXCMSGCRSNMESSAGEPENDING      EQU X'00000C18' Meaning: The message      09149600
*                        is not complete. Invoke the IXCMSGC CALLEXIT   09149700
*                        service after the message has completed @P8A   09149800
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 09150000
         AIF   ('&LIST' EQ 'YES').P4                                    09200000
.P3      ANOP                                                           09250000
         POP   PRINT                                                    09300000
.P4      ANOP                                                           09350000
.P_EXIT  ANOP                                                           09400000
         MEND                                                           09450000
**/ IXCYMSGC_2:;                                                        09500000
* %IXCYMSGC_INCLUDED = 'YES';                                           09550000
* %DCL ZCBPRINT CHAR EXT;                                               09600000
* %DEACTIVATE ZCBPRINT;                                                 09650000
* %DCL IXCYMSGC_LIST CHAR EXT;                                          09700000
* %DEACTIVATE IXCYMSGC_LIST;                                            09750000
* %IF IXCYMSGC_LIST ^= 'NO' &                                           09800000
*    ZCBPRINT ^= 'NO' %THEN                                             09850000
*   %GOTO IXCYMSGC_3;                                                   09900000
*   @LIST PUSH NOECHO;                                                  09950000
*   @LIST NOASSEMBLE NOECHO;                                            10000000
*   @LIST OFF C NOECHO;                                                 10050000
* %IXCYMSGC_3:;                                                         10100000
*/* Start of PL/X Source                                             */ 10150000
*/* IXCMSGC Return and Reason Code definitions                          10164200
*NOTE carefully that bits 0-15 of                                       10178400
*the reason code may contain component-diagnostic data and must not be  10192600
*assumed to be 0. The constant IXCMSGCRsnCodeMask is provided for       10206800
*masking off the component-diagnostic data.                             10221000
**/                                                                     10235200
*DCL IXCMSGCRcSuccessful BIT(32) Constant('00000000'X) ; /*             10250000
*                        Meaning: Successful completion                 10300000
*                        Action: None                                */ 10350000
*DCL IXCMSGCRcWarning BIT(32) Constant('00000004'X) ; /*                10400000
*                        Meaning: Warning, reason code in R0            10450000
*                        Action: See reason code                     */ 10500000
*DCL IXCMSGCRcInvalidParms BIT(32) Constant('00000008'X) ; /*           10550000
*                        Meaning: Invalid parameters, reason code in R0 10600000
*                        Action: See reason code                     */ 10650000
*DCL IXCMSGCRcEnvironmentalError BIT(32) Constant('0000000C'X) ; /*     10660000
*                        Meaning: The current environment cause the     10670000
*                        request to fail.                               10680000
*                        Action: See reason code                     */ 10690000
*DCL IXCMSGCRcSystemError  BIT(32) Constant('00000010'X) ; /*           10700000
*                        Meaning: System error. XCF processing failure. 10750000
*                        Action: Save the reason code information,      10800000
*                        and contact the IBM support center.        */  10850000
*Dcl IXCMSGCRsnCodeMask Bit(32) Constant('0000FFFF'X); /* Use this      11200000
*               mask to isolate the non component-diagnostic            11250000
*               portion of the reason code.                          */ 11300000
*DCL IXCMSGCRsnAnsAreaTooSmall BIT(32) Constant('00000004'X) ; /*       11305000
*                    Meaning: The query request completed successfully. 11307200
*                    The ANSAREA provided was large enough              11309400
*                    to contain the header information (MqaHeader),     11311600
*                    but was not large enough to contain all the        11313800
*                    data that was requested. The MqaHdrTlen field      11316000
*                    indicates the total length of the output           11318200
*                    answer area that would have been needed to         11320400
*                    contain all the requested information.             11322600
*                    It is possible that only the MqaHeader was         11324800
*                    provided in which case MqaHdr#Entries would        11327000
*                    be zero.                                           11329200
*                    Action:                                            11331400
*                    Retry the request with an ANSAREA whose length is  11333600
*                    greater than or equal to the number of bytes       11335800
*                    indicated by MqaHdrTlen.  Note that the amount of  11338000
*                    data to be returned can change dynamically, so     11340200
*                    that the length indicated by MqaHdrTlen may be     11342400
*                    too small for all the data when the request is     11344600
*                    tried again.                                @L5A*/ 11346800
*DCL IXCMSGCRsnMsgAlreadyComplete BIT(32) Constant('00000008'X) ; /*    11350000
*                        Meaning: Message already completed.            11400000
*                        Action: None, Message COMPLETION requested for 11450000
*                        a message that was already completed.       */ 11500000
*DCL IXCMSGCRsnMsgDiscardPending BIT(32) Constant('00000018'X) ; /*     11506200
*                        Meaning: Message discard pending. An exit      11512400
*                        routine is currently processing the message.   11518600
*                        The message will be deleted as soon as the     11524800
*                        currently active message service (such as      11531000
*                        IXCMSGI) completes.                            11537200
*                        Action: None, the message is not available  */ 11543400
*DCL IXCMSGCRsnMemberNotActive BIT(32) Constant('00000004'X) ; /*       11550000
*                        Meaning: Member token does not identify an     11600000
*                        active member associated with the primary      11650000
*                        address space current when the Message-Control 11700000
*                        service was invoked.                           11750000
*                        Action: Reissue the request with a correct     11800000
*                        member token.                               */ 11850000
*DCL IXCMSGCRSNInAppropExitRoutineName BIT(32) Constant('00000016'X)    11853500
*                        ; /*                                           11857000
*                        Meaning: Inappropriate exit routine type.      11860500
*                        Action: The type of exit specified for a       11864000
*                        CALLEXIT request must be appropriate           11867500
*                        for the type of message to be processed.       11871000
*                        Messages saved by a message exit routine and   11874500
*                        responses saved by a notify exit routine must  11878000
*                        be processed by a message exit routine. A      11881500
*                        completed message-out request, or a saved      11885000
*                        message/response entity must be processed by a 11888500
*                        notify exit routine. Retry the request with    11892000
*                        the correct exit routine.                   */ 11895500
*DCL IXCMSGCRSNReservedFieldNotNull BIT(32) Constant('00000040'X) ; /*  11900000
*                        Meaning: Program error.                        11950000
*                        A reserved field in the control parameter list 12000000
*                        is not zero.                                   12050000
*                        Action: Check to see if your program           12100000
*                        inadvertently overlaid the parameter list      12150000
*                        storage, and that it was assembled with the    12200000
*                        correct macro library for the release of MVS   12250000
*                        your program is running on.             @L2C*/ 12300000
*DCL IXCMSGCRSNBadPlistAlet BIT(32) Constant('00000100'X) ; /*          12350000
*                        Meaning: Program error. Your program is not    12400000
*                        running in primary ASC mode, and the ALET that 12450000
*                        qualifies the address of the control parameter 12500000
*                        list is neither zero nor associated with a     12550000
*                        valid public entry on the DU-AL or in a common 12600000
*                        area data space                                12650000
*                        Action: Ensure that:                           12694400
*                        Your program is not intended to run in         12738800
*                        primary ASC mode, You specified SYSSTATE       12783200
*                        ASCENV=AR before issuing the IXCMSGC           12827600
*                        macro, and the ALET for the parameter          12872000
*                        list is a valid public entry on the            12916400
*                        DU-AL ,is zero (primary address space          12960800
*                        ALET) or in a common area data space.       */ 13005200
*DCL IXCMSGCRSNBadPlistVersion BIT(32) Constant('00000104'X) ; /*       13050000
*                        Meaning: Parameter list not valid. Version     13100000
*                        number in parameter list is not valid. The     13150000
*                        release level of XCF on which the caller is    13200000
*                        running does not support this version of the   13250000
*                        message control service.                       13300000
*                        Action: Retry the request with the correct     13350000
*                        version.                                    */ 13400000
*DCL IXCMSGCRSNBadPListFuncCode BIT(32) Constant('00000108'X) ; /*      13450000
*                        Meaning: Parameter list not valid. Function    13500000
*                        code not valid.                                13550000
*                        Action: Retry the request                   */ 13600000
*DCL IXCMSGCRSNBadPlistAddress BIT(32) Constant('0000010C'X) ; /*       13650000
*                        Meaning: Parameter list not accessible.        13700000
*                        storage is not addressable.                    13750000
*                        Action: Make sure the parameter list is        13800000
*                        accessible to XCF and retry the request.    */ 13850000
*DCL IXCMSGCRSNNotEnabled BIT(32) Constant('0000011C'X) ; /*            13900000
*                        Meaning: The caller is not enabled.            13950000
*                        Action: Correct your program so that it does   14000000
*                        not issue IXCMSGC while it is disabled.     */ 14050000
*DCL IXCMSGCRSNLocksHeld BIT(32) Constant('0000012C'X) ; /*             14100000
*                        Meaning: The caller is holding a lock.         14150000
*                        Action: Correct your program so that it does   14200000
*                        not issue IXCMSGC while holding any locks.  */ 14250000
*DCL IXCMSGCRSNAnsAreaSmallerThanHeader Bit(32)                         14251100
*                        Constant('0000013C'X);/*                       14252200
*                        Meaning: ANSAREA too small.                    14253300
*                        Action: The answer area must be at least as    14254400
*                        long as the header record (MqaHeader). Retry   14255500
*                        the request with a larger answer area.      */ 14256600
*DCL IXCMSGCRSNAnsAreaBadAlet BIT(32) Constant('00000140'X) ; /*        14257700
*                        Meaning: ANSAREA not accessible.               14258800
*                        Action: The ALET of the ANSAREA is neither     14259900
*                        zero nor a valid entry on the Dispatchable     14261000
*                        Unit Access List (DU-AL), nor a valid entry    14262100
*                        for a common area data space. Retry the        14263200
*                        request with the correct ALET.              */ 14264300
*DCL IXCMSGCRSNAnsAreaBadAddress BIT(32) Constant('00000148'X) ; /*     14265400
*                        Meaning: Error accessing ANSAREA.              14266500
*                        Action: Make sure the ANSAREA is accessible to 14267600
*                        XCF, and reissue the request.               */ 14268700
*DCL IXCMSGCRSNTokenNotForSaveMsg BIT(32) Constant('00000200'X) ; /*    14269800
*                        Meaning: TOKEN not valid for SAVEMSG           14270900
*                        service.                                       14272000
*                        Action: Verify that the token specified is the 14273100
*                        MsgIToken provided to the message exit or      14274200
*                        notify exit and retry the request with the     14275300
*                        correct Token.                          @P2C*/ 14276400
*DCL IXCMSGCRSNTokenNotForDiscardMsg BIT(32) Constant('00000204'X) ; /* 14277500
*                        Meaning: TOKEN not valid for DISCARDMSG        14278600
*                        service.                                       14279700
*                        Action: Retry the request with the correct     14280800
*                        Token.                                  @P2C*/ 14281900
*DCL IXCMSGCRSNTokenForCallExitInvalid BIT(32) Constant('00000208'X)    14283000
*                        ; /*                                           14284100
*                        Meaning: TOKEN not valid for CALLEXIT          14285400
*                        service.  CALLEXIT can be only be used for     14286700
*                        messages that were saved by a Notify or        14288000
*                        Message Exit via the SAVEMSG service.  The     14289300
*                        TOKEN must be a RETMSGTOKEN that was           14290600
*                        returned by the SAVEMSG service.               14291900
*                                                                       14293200
*                        Action: Insure that that the token is one      14294500
*                        that was returned by a successful              14295800
*                        invocation of the SAVEMSG service.             14297100
*                                                              @P3C*/   14298400
*DCL IXCMSGCRSNMessageUnavailable BIT(32) Constant('0000020C'X) ; /*    14300000
*                        Meaning: Message not available.                14342400
*                        Message indicated by TOKEN does                14384800
*                        not exist. Message was either completely       14427200
*                        delivered, discarded, or saved. Action:        14469600
*                        Verify the token, if mis-specified reissue     14512400
*                        the request with a new correct TOKEN. For a    14535800
*                        RETMSGOTOKEN or a saved token (RETMSGTOKEN),   14559200
*                        insure that the MEMTOKEN                       14582600
*                        identifies the member who was presented the    14606000
*                        token by XCF. If the message was saved,        14616400
*                        then a new message would be assigned and the   14626800
*                        RETMSGTOKEN returned by IXCMSGC would have to  14637200
*                        be used. If the token is for a response and    14647600
*                        the associated message/response entity         14658000
*                        was saved or discarded, then the old response  14668400
*                        tokens are invalidated.                        14678800
*                        @P4C*/                                         14689200
*DCL IXCMSGCRSNMessageTokenInvalid BIT(32) Constant('00000210'X) ; /*   14700000
*                        Meaning: TOKEN not valid.                      14750000
*                        Action: Verify the token an retry the request  14800000
*                        with the correct Token.                     */ 14850000
*DCL IXCMSGCRSNTokenNOTForForceCompletion BIT(32) Constant('00000220'X) 14900000
*                    ;/* Meaning: Message TOKEN not valid for           14950000
*                        Force Completion.  The message token must be   15000000
*                        a token that was returned by the IXCMSGO       15050000
*                        service via the RETMSGOTOKEN keyword.          15100000
*                        Action: Verify the token and retry the         15150000
*                        request with the correct Token.    @L2A @P1C*/ 15156000
*DCL IXCMSGCRSNBadRetMsgTokenAlet BIT(32) Constant('00000308'X) ; /*    15162000
*                        Meaning: The ALET that qualifies the address   15168000
*                        of the RETMSGTOKEN is neither zero nor a valid 15174000
*                        entry on the Dispatchable Unit Access List     15180000
*                        (DU-AL), nor a valid entry for a common area   15186000
*                        data space.                                    15192000
*                        Action: Retry the request with the correct     15198000
*                        ALET                                        */ 15204000
*DCL IXCMSGCRSNBadRetMsgTokenAddress BIT(32) Constant('00000309'X) ; /* 15210000
*                        Meaning: RETMSGTOKEN not accessible. The       15216000
*                        Message Control Service was not able to store  15222000
*                        a message token in the storage area indicated  15228000
*                        by RETMSGTOKEN.                                15234000
*                        Action: The message would have already been    15240000
*                        saved and a new message token                  15246000
*                        assigned.  As such, the only way to get        15252000
*                        the new MESSAGE token is to do an              15258000
*                        IXCMSGC query looking for UDATA that           15264000
*                        matched the one specified.              @L3C*/ 15270000
*DCL IXCMSGCRSNBADEXITFORCALLEXIT BIT(32) CONSTANT('0000030A'X);/*      15270400
*                        Meaning: For a CALLEXIT request, XCF           15270800
*                        attempted to call the exit but the message     15271200
*                        or notify exit abended. The exit address could 15271600
*                        be invalid or the exit may have done some      15272000
*                        processing. The specified message may          15272400
*                        have been processed by the exit routine        15272800
*                        before it abended. As such, the token          15273200
*                        may or may not specify a currently valid       15273600
*                        message.                                       15274000
*                        Action:  Verify the exit address and attempt   15274400
*                        the CallExit request again.         @PxA*/     15274800
*DCL IXCMSGCRSNTASKMODECALLEXITWITHFRR BIT(32) CONSTANT('0000030E'X);/* 15274900
*                        Meaning: For a CALLEXIT request that was made  15275000
*                        in Task mode, the caller had an FRR            15275100
*                        established.                                   15275200
*                        Action: Correct your program so that it        15275300
*                        does not issue IXCMSGC Request(CALLEXIT) with  15275400
*                        FRRs established while in Task mode.    @P6A*/ 15275500
*DCL IXCMSGCRSNMsgNotAvailOtherExit BIT(32) Constant('00000C04'X) ; /*  15276000
*                        Meaning: Message not available.                15282000
*                        Action: Another exit routine is currently      15288000
*                        processing the message. Try again later.    */ 15294000
*DCL IXCMSGCRSNNoUserMsgSpaceAvail  BIT(32) Constant('00000C08'X) ; /*  15295000
*                        Meaning: No user message space                 15296000
*                        available.  All the message storage            15297000
*                        space managed by XCF on behalf of the          15298000
*                        member are full.                               15299000
*                        Action:  Use the Message Control               15300000
*                        DISCARDMSG Service to discard one or           15301000
*                        more messages in order to make more            15302000
*                        storage available.                     @L4A*/  15303000
*DCL IXCMSGCRSNDUALCanNotBeExpanded BIT(32) Constant('00000C0C'X) ; /*  15304000
*                        Meaning: Unable to process a CALLEXIT,         15308500
*                        QUERYMSG, or COMPLETION request.  A STOKEN     15313000
*                        that is required to be added to the current    15317500
*                        DUAL (Dispatchable Unit Access List) could not 15322000
*                        be added due to the DUAL being full or not     15326500
*                        expandable.  Action: Try again later or remove 15331000
*                        an entry from the DUAL and try again.  @L6C*/  15335500
*DCL IXCMSGCRsnNoWorkingStorage     BIT(32) Constant('00000C10'X) ; /*  15340000
*                        Meaning: A IXCMSGC QUERY request could not     15342000
*                        be performed because XCF could not obtain      15344000
*                        working storage in the XCF address space.      15346000
*                        Action: Try again later                 @L4A*/ 15348000
*DCL IXCMSGCRSNTOKENNOTFORQUERYMSG  BIT(32) Constant('00000C14'X) ; /*  15348400
*                        Meaning: TOKEN not valid for QUERYMSG          15348800
*                        Action: Retry the request with the correct     15349200
*                        Token.                                  @L5A*/ 15349600
*DCL IXCMSGCRSNMESSAGEPENDING BIT(32) Constant('00000C18'X); /*         15358000
*                        Meaning: The message is not complete. Invoke   15366400
*                        the IXCMSGC CALLEXIT service after the message 15374800
*                        is complete                             @P8A*/ 15383200
*/* End of IXCMSGC Return and Reason Code definitions                */ 15391600
*/* End of PL/X Source                                               */ 15400000
* %IF IXCYMSGC_LIST ^= 'NO' &                                           15450000
*    ZCBPRINT ^= 'NO' %THEN                                             15500000
*   %GOTO IXCYMSGC_4;                                                   15550000
*   @LIST POP NOECHO;                                                   15600000
* %IXCYMSGC_4:;                                                         15650000
* %END;                                                                 15700000
