*                                                                       00010000
*        %              /*                                              00020000
         MACRO                                                          00030000
         IXCYQUAA &DSECT=YES,&HEADER=YES,&GROUP=YES,&MEMBER=YES,       *00030100
               &SYSTEM=YES,                                            *00030200
               &CF=YES,&CFSC=YES,&CFSTR=YES,                           *00030300
               &STR=YES,&STRPL=YES,&STRXL=YES,                         *00030400
               &STRCF=YES,&STRUSER=YES,&ARMS=YES,&FEATURES=YES,        *00030500
               &STRSYS=YES                                       @PJC*/ 00030600
* IXCYQUAA10 : ;                                                        00030700
*/* START OF SPECIFICATIONS ******************************************* 00030800
*                                                                       00030900
*01* PROPRIETARY STATEMENT =                                            00031000
*                                                                       00032000
*    Licensed Materials - Property of IBM                               00033000
*    "Restricted Materials of IBM"                                      00034000
*    5647-A01                                                           00035000
*    (C) COPYRIGHT IBM CORP. 1990, 2000                                 00036000
*                                                                       00037000
*    US Government Users Restricted Rights - Use, duplication or        00038000
*    disclosure restricted by GSA ADP Schedule Contract with            00039000
*    IBM Corp.                                                          00040000
*                                                                       00050000
*01* STATUS = FMID HBB7703                                              00060000
*                                                                       00070000
*01* END OF PROPRIETARY STATEMENT                                       00080000
*                                                                       00090000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00100000
*01* END OF EXTERNAL CLASSIFICATION:                                    00110000
*                                                                       00120000
*01* DESCRIPTIVE NAME:  Query Answer Area                               00130000
*02*  ACRONYM:  QUAA                                                    00140000
*                                                                       00150000
*01* MACRO NAME:  IXCYQUAA                                              00160000
*                                                                       00170000
*01* DSECT NAME:                                                        00180000
*     QUAHDR                                                            00190000
*     QUASYS/QUASYS1                                                    00200000
*     QUAGRP                                                            00210000
*     QUAMEM                                                            00220000
*     QUACF/QUACF1                                                      00230000
*     QUACFSC/QUACFSC1                                                  00240000
*     QUACFSTR/QUACFSTR1                                                00250000
*     QUASTR/QUASTR1                                                    00260000
*     QUASTRPL/QUASTRPL1                                                00270000
*     QUASTRXL/QUASTRXL1                                                00280000
*     QUASTRCF/QUASTRCF1                                                00290000
*     QUASTRUSER/QUASTRUSER1                                            00300000
*     QUASTRSYS                                                    @LDA 00310000
*     QUAARMS                                                      @L4A 00320000
*     QUREQFEATURES                                                @03A 00330000
*                                                                       00340000
*01* COMPONENT:  Cross System Coupling Facility (SCXCF)                 00350000
*                                                                       00360000
*01* EYE-CATCHER:  NONE                                                 00370000
*                                                                       00380000
*01* STORAGE ATTRIBUTES:                                                00390000
*02*  SUBPOOL:  User-supplied                                           00400000
*02*  KEY:  User-supplied                                               00410000
*02*  RESIDENCY:  User-supplied                                         00420000
*                                                                       00430000
*01* SIZE:  Variable                                                    00440000
*           Header -- 16 bytes                                          00450000
*           For general or specific query of the system:                00451000
*              QUASYS     -- 40 bytes                                   00452000
*           For general or specific query of the system:                00453000
*           with QUAALEVEL=1 requested:                                 00454000
*              QUASYS1    -- 64 bytes                                   00455000
*           Group record -- 20 bytes                                    00456000
*           Member record -- 92 bytes + maximum of 32                   00457000
*                            for user state field                       00458000
*           For general or specific query of coupling facility:         00459000
*              QUACF record      -- x'00A0' bytes                       00460000
*              QUACFSC record    -- x'0010' bytes                       00470000
*              QUACFSTR record   -- x'0018' bytes                       00480000
*           For general or specific query of coupling facility          00490000
*           with QUAALEVEL=1 requested:                                 00500000
*              QUACF1 record      -- x'00E0' bytes                      00510000
*              QUACFSC1 record    -- x'0050' bytes                      00520000
*              QUACFSTR1 record   -- x'0098' bytes                      00530000
*           For general or specific query of structure:                 00540000
*              QUASTR record     -- x'0138' bytes                       00550000
*              QUASTRPL record   -- x'0010' bytes                       00560000
*              QUASTRXL record   -- x'0018' bytes                       00570000
*              QUASTRCF record   -- x'0048' bytes                       00580000
*              QUASTRUSER record -- x'0088' bytes                       00590000
*              QUASTRSYS record  -- x'0040' bytes                  @LDA 00600000
*           For general or specific query of structure                  00610000
*           with QUAALEVEL=1 requested:                                 00620000
*              QUASTR1 record     -- x'01B8' bytes                      00630000
*              QUASTRPL1 record   -- x'0030' bytes                      00640000
*              QUASTRXL1 record   -- x'0038' bytes                      00650000
*              QUASTRCF1 record   -- x'0088' bytes                      00660000
*              QUASTRUSER1 record -- x'0100' bytes                      00670000
*           For general or specific query of Automatic Restart Manager: 00680000
*              QUAARMS record    - 256 bytes                       @L4A 00690000
*           For query of installed Software Features                    00700000
*              QUREQFEATURES     -- 32 bytes                       @03A 00710000
*                                                                       00720000
*01* CREATED BY:                                                        00730000
*     Created by user and passed as parameter on ANSAREA keyword        00740000
*     for IXCQUERY, IXCCREAT or IXCJOIN macros. The                     00750000
*     IXCJOIN and IXCCREAT macros only return the QUAMEM record.        00760000
*                                                                       00770000
*     Created by user and passed as parameter on FEATAREA keyword       00780000
*     for IXCQUERY macro with REQINFO=FEATURES option                   00790000
*                                                                       00800000
*01* POINTED TO BY:                                                     00810000
*     ANSAREA_ADDR field in Query or Join/Create parameter list         00820000
*                                                                       00830000
*     QUREQFEATURES is not pointed to, outside of macro execution       00840000
*                                                                       00850000
*01* SERIALIZATION:                                                     00860000
*     None required                                                     00870000
*                                                                       00880000
*01* FUNCTION:                                                          00890000
*02* Maps the data returned by the IXCQUERY, IXCCREAT,                  00900000
*    or IXCJOIN macros.                                                 00910000
*    This data represents a snapshot of a point in time.                00920000
*    The IXCQUERY macro always returns the QUAHDR plus the              00930000
*    record mapping for the associated request.                         00940000
*    The IXCJOIN and IXCCREAT macros only return the QUAMEM record.     00950000
*                                                                       00960000
*01* METHOD OF ACCESS:                                                  00970000
*02*  ASM:                                                              00980000
*      IXCYQUAA                                                         00990000
*           DSECT=YES|NO    -- Request DSECT definition                 01000000
*           HEADER=YES|NO   -- Request Header record mapping            01010000
*                              USING on QUAHDR                          01020000
*           SYSTEM=YES|NO   -- Request system record mapping            01030000
*                              USING on QUASYS/QUASYS1                  01040000
*           GROUP=YES|NO    -- Request group record mapping             01050000
*                              USING on QUAGRP                          01060000
*           MEMBER=YES|NO   -- Request member record mapping            01070000
*                              USING on QUAMEM                          01080000
*           CF=YES|NO       -- Request record mapping for               01090000
*                              coupling facility                        01100000
*                              USING on QUACF/QUACF1                    01110000
*           CFSC=YES|NO     -- Request record mapping for               01120000
*                              Systems connected to specified           01130000
*                              coupling facility                        01140000
*                              USING on QUACFSC/QUACFSC1                01150000
*           CFSTR=YES|NO    -- Request record mapping for               01160000
*                              structures in specified                  01170000
*                              coupling facility                        01180000
*                              USING on QUACFSTR/QUACFSTR1              01190000
*           STR=YES|NO      -- Request record mapping for               01200000
*                              structures                               01210000
*                              USING on QUASTR/QUASTR1                  01220000
*           STRPL=YES|NO    -- Request record mapping for               01230000
*                              preference list for specified structure  01240000
*                              USING on QUASTRPL/QUASTRPL1              01250000
*           STRXL=YES|NO    -- Request record mapping for               01260000
*                              exclusion list for specified structure   01270000
*                              USING on QUASTRXL/QUASTRXL1              01280000
*           STRCF=YES|NO    -- Request record mapping for coupling      01290000
*                              facility of specified structure          01300000
*                              USING on QUASTRCF/QUASTRCF1              01310000
*           STRUSER=YES|NO  -- Request record mapping for               01320000
*                              connector data for specified structure   01330000
*                              USING on QUASTRUSER/QUASTRUSER1          01340000
*           STRSYS=YES|NO   -- Request record mapping for               01350000
*                              system data for specified structure      01360000
*                              USING on QUASTRSYS                  @LDA 01370000
*           ARMS=YES|NO     -- Request record mapping for ARM status    01380000
*                                                                  @L4A 01390000
*           FEATURES=YES|NO -- Request record mapping for               01400000
*                              installed Software Features         @03A 01410000
*                                                                       01420000
*     Default: DSECT=YES,HEADER=YES,SYSTEM=YES,GROUP=YES,MEMBER=YES,    01430000
*              CF=YES,CFSC=YES,CFSTR=YES,                               01440000
*              STR=YES,STRPL=YES,STRXL=YES,STRCF=YES,STRUSER=YES,       01450000
*              STRSYS=YES,ARMS=YES,FEATURES=YES                    @LDC 01460000
*                                                                       01470000
*02*  PL/AS:                                                            01480000
*      %INCLUDE SYSLIB(IXCYQUAA)                                        01490000
*                                                                       01500000
*01* DELETED BY:  User                                                  01510000
*                                                                       01520000
*01* FREQUENCY:  Created for response to Query, Join, Create            01530000
*                                                                       01540000
*01* DEPENDENCIES:  None                                                01550000
*                                                                       01560000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     01570000
*                                                                       01580000
*01* CHANGE ACTIVITY:                                                   01590000
*   $L0=COUPLXGP,HBB4410,870630,PDXB: Query Answer Area                 01600000
*   $D1=DCR0090 ,HBB4410,881024,PDCJ: Removed QUAMSNDS bit              01610000
*   $L1=XCFRAS  ,HBB4410,890201,PDXB: Return STOKEN for member          01620000
*   $D2=DEO0233 ,HBB4410,891030,PDCK: New QUASCLUP bit.                 01630000
*   $D3=DEO0333 ,HBB4410,900305,PDEO: Remove QUAMSPAU bit.              01640000
*   $P1=PEO3662 ,HBB4410,900305,PDCK: Remove QUAMSND constant           01650000
*   $L2=SYSLKXLO,HBB5510,900901,PD00XK: XLS Initial Release             01660000
*   $D4=DIG0015 ,HBB5510,920217,PD00XK: IXLREBLD support                01670000
*   $P2=PKB1869 ,HBB4430,920429,PDT8: Update description of QUAHSGOF    01680000
*   $P3=PKB2517 ,HBB4430,920429,PDCJ: Update description of QUAMUDAT    01690000
*   $D5=DIG0031 ,HBB5510,921105,PD00XK: IXCQUERY return/reason codes    01700000
*   $D6=DIG0015 ,HBB5510,921105,PD00XK: IXLREBLD support part 2         01710000
*   $L3=SYSLKXLO,HBB5510,921105,PD00XK: XLS Initial Release             01720000
*   $D7=DIG0046 ,HBB5510,930114,PD00XK: Node descriptor support         01730000
*   $D8=DIG0109 ,HBB5510,930328,PD00XK: IXLREBLD support                01740000
*   $D9=DIG0074 ,HBB5510,930328,PD00XK: IXLUSYNC support                01750000
*   $DA=DIG0110 ,HBB5510,930328,PD00XK: Reconcile connects support      01760000
*   $DB=DIG0071 ,HBB5510,930520,PD00XK: Add CONLEVEL                    01770000
*   $DC=DIG0109 ,HBB5510,930520,PD00XK: IXLREBLD support                01780000
*   $DD=DIG0139 ,HBB5510,930701,PD00XK: Structure access time           01790000
*   $DE=DIG0184 ,HBB5510,931104,PD00XK: DISCDATA support                01800000
*   $P4=PIG2851 ,HBB5510,931104,PD00XK: Add CF connectivity info        01810000
*   $P5=PIG3319 ,HBB5510,931104,PD00XK: Update QUASTRCFVERSION comment  01820000
*   $P6=PIG5126 ,HBB5510,940221,PD00XK: Change ALLOWREBLD, CFLEVEL      01830000
*   $P7=PIG5265 ,HBB5510,940314,PD00FR: Query system version            01840000
*   $P8=PIG5312 ,HBB5510,940404,PD00XK: LOSSCONN decision support       01850000
*   $L4=ARM     ,HBB5520,930106,PD00B7: Add area for ARM-status data    01860000
*   $L5=CLONING ,HBB5520,940331,PD00HB: Add fields for Clone ID and     01870000
*                                       clone uniqueness                01880000
*   $L6=DNXES   ,HBB5520,940414,PD00XK: XES dynamic reconfig            01890000
*                                                                       01900000
*   OY43990 - Do not return any information about a system that         01910000
*             is in ipling state.                              @YA43990 01920000
*   $P9=PN70501 ,HBB5520,940505,PD00B7: In QUAARMS record, correct      01930000
*             length of RestartGroup                                    01940000
*   $DF=DN70049 ,HBB5520,940505,PD00B7: In QUAARMS record, add the      01950000
*             number of registered elements and the maximum number      01960000
*             of elements allowed.                                      01970000
*   $PA=PIG5318 ,HBB5510,940430,PD00XK: LOSSCONN decision support       01980000
*   $PB=PIG5531 ,HBB5510,940923,PD00EA: New field when hit policy max   01990000
*   $DG=DN70101 ,HBB5520,941020,PD00EA: Logger enhancements             02000000
*   $DH=DN70100 ,HBB5520,941020,PD00HX: Display pending policy INITSIZE 02010000
*   $PD=PN71792  HBB5520 941121 PD00B7: Add Restart Pacing and Free CSA 02020000
*                                       values to QUAARMS               02030000
*   $PE=PN72124  HBB5520 941207 PD00B7: Fix comments so they are not    02040000
*                                       in the assembler continuation   02050000
*                                       column                          02060000
*   $PF=PN72314  HBB5520 950105 PD00CJ: Added support for additional    02070000
*                                       ARM restarting state info.      02080000
*   $L7=ARM     ,JBB6602,950411,PD00CJ: Added WARNINGS about using      02090000
*                                       the length fields               02100000
*   $L8=XCFBC   ,JBB6602,950707,PD00BJ: Added signalling protocols to   02110000
*                                       QUAMEM record                   02120000
*   $01=OW14258 ,HBB5510 950706 PD00FR: Return pending policy size      02130000
*   $L9=CFFP    ,JBB6602,950921,PD00HV: CF Failure Policy               02140000
*   $02=OW17228 ,HBB5510 960501 PD00EA: Return structure in cleanup     02150000
*   $03=OW21596 ,HBB5520 961212 PD00HV: Map features returned by        02160000
*                                       IXCQUERY REQINFO=FEATURES       02170000
*   $04=OW20824 ,HBB5520 961217 PD00FR: Usync/lossconn enhancements     02180000
*   $05=OW24532 ,HBB5520 960901 PD00HV: Alter EMC support               02190000
*   $LA=REBCF   ,HBB6606,971120,PD00HV: Rebuild for CF Maintenance      02200000
*   $06=OW28460 ,HBB6603 970801 PD00FR: User managed duplexing          02210000
*   $LB=MGENH   ,HBB6606,971121,PD00AC: HWSTATISTICS(CF) added to       02220000
*                                       IXLMG                           02230000
*   $PG=PVT0189  HBB6606 971205 PD00HV: Fix Assem definition of         02240000
*                                       QUASTRCFDUPALTERINPROGRESS      02250000
*   $PH=PVT0414  HBB6606 980115 PDXM: Change description for            02260000
*                                     QUASTRCFACT and QUACFSTRACT       02270000
*   $PI=PVT0473  HBB6606 980205 PDHV: Add QUASTRALTEROLD                02280000
*   $07=OW33342 ,HBB5520,980414,PD00FR: VSAM RT support                 02290000
*   $LC=AUTOR   ,HBB6608,980331,PDSL: AutoRebuild support               02300000
*   $LD=AUTOR   ,HBB6608,980622,PDSL: AutoRebuild support, con't.       02310000
*   $LE=AUTOR   ,HBB6608,980807,PDSL: AutoRebuild support, con't.       02320000
*   $PJ=PWK0164 ,HBB6608,980810 PDSL: Add &STRSYS definition            02330000
*   $LG=LSD     ,HBB6608,980901,PD00BJ: Add Large Delivery protocol     02340000
*   $LF=ARMTV   ,JBB6609,990126,PDRB: Add TERMTYPE=SYSTERM & ELEMBIND   02350000
*   $08=OW33615 ,HBB6603,990601,PD00BC: ICF Recovery enhancements       02360000
*   $LH=AUTOA   ,HBB7703,990802,PD002F: AutoAlter support               02370000
*   $LI=LPC     ,HBB7703,990815,PD00GW: LPAR Cluster Support            02380000
*   $PK=PXD0335 ,HBB7703,990815,PD00GW: LPAR Cluster Support            02390000
*   $PL=PXD0436 ,HBB7703,990927,PD002F: Add system-initiated bits       02391000
*                                       for alter                       02392000
*   $PM=PXD1384 ,HBB7703,000223,PD00GW: LPAR Cluster Support            02392100
*   $0A=OW41171 ,HBB6606,000420,PD00FR: RDATATYPE extensions            02392200
*   $0B=OW46615 ,HBB6608,001023,PD00FR: Correct assembler error         02392300
*   $0C=OW37621 ,HBB6606,001215,PD00BJ: Stalled member indicator        02392401
*   $0D=OW39892  HBB6608,010413,PD00BC: AutoR extension for CICS                
*   $0E=OW41614 ,JBB6609,000911,PD00FR: Buffer size requirements        02402000
*                                       for MOVE_ENTRYLIST and                  
*                                       DELETE_ENTRYLIST                        
*                                                                       02392500
* END OF SPECIFICATIONS *********************************************/  02392600
* %      /*                                                             02392700
               GBLB  &QUAARSN                                      @D5A 02392800
               AIF   ('&HEADER' EQ 'NO').IXCYQUAA96                     02392900
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA20                      02393000
QUAHDR         DSECT                                                    02393100
               AGO   .IXCYQUAA25                                        02393200
.IXCYQUAA20    ANOP                                                     02393300
QUAHDR         DS    0D       Header section                            02394000
.IXCYQUAA25    ANOP                                                     02395000
QUAH#REC       DS    F        Number of QUASYS, QUAGRP, QUAMEM, QUACF,  02396000
*                             QUASTR, or QUAARMS records which follow   02397000
*                             Note: this field is zero with             02398000
*                             zero return code, when the service        02399000
*                             could not find any records.               02400000
QUAH#REM       DS    F        Number of QUASYS, QUAGRP, QUAMEM, QUACF,  02401000
*                             QUASTR, or QUAARMS records which were not 02402000
*                             returned because of insufficient space    02403000
QUAHTLEN       DS    F        Total length of answer area needed to     02404000
*                             contain all the requested information.    02405000
*                             This includes the area for the records    02406000
*                             that were returned on this call.          02407000
QUAHSGOF       DS    F        Offset from QUAHDR to the first data      02408000
*                             record                               @P2C 02409000
QUAHLENG       EQU   *-QUAHDR                                           02410000
.IXCYQUAA96    ANOP                                                     02420000
               AIF   ('&SYSTEM' EQ 'NO').IXCYQUAA99                     02430000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA40                      02440000
QUASYS         DSECT                                                    02450000
               AGO   .IXCYQUAA45                                        02460000
.IXCYQUAA40    ANOP                                                     02470000
QUASYS         DS    0D       Sysplex record data format                02480000
.IXCYQUAA45    ANOP                                                     02490000
QUASTYPE       DS    X        X'02' sysplex record,                     02500000
*                             X'82' last sysplex record                 02510000
QUATYPSYS      EQU   2        Record type - Sysplex (QUASYS)       @L2A 02520000
QUATYPSYS_LAST EQU   130      Record type - Last Sysplex           @L2A 02530000
               DS    X        Reserved X'00'                            02540000
QUASLEN        DS    H        Length of sysplex record                  02550000
QUASNAME       DS    CL8      System name                               02560000
QUASINTV       DS    F        Monitor interval, in hundredths of        02570000
*                             seconds. This parameter is specified at   02580000
*                             IPL time.                                 02590000
QUASOPIN       DS    F        Operator interval, in hundredths of       02600000
*                             seconds. This parameter is specified at   02610000
*                             IPL time.                                 02620000
QUASSUTO       DS    XL8      Status-update TOD value                   02630000
QUASSTAT       DS    XL4      System Status                             02640000
*              EQU   X'80'    Reserved                         @YA43990 02650000
QUASACTV       EQU   X'40'    Active                                    02660000
QUASSUM        EQU   X'20'    Status-update missing detected            02670000
QUASSYPT       EQU   X'10'    In sysplex partitioning                   02680000
QUASLOCL       EQU   X'08'    Single system, no coupling dataset,       02690000
*                             sysplex                                   02700000
QUASCLUP       EQU   X'04'    System has completed Sysplex Partitioning 02710000
*                          but is still in the process of Cleanup  @D2A 02720000
QUASSID        DS    0XL4     System token                              02730000
QUASNUM        DS    XL1      System slot number                        02740000
               DS    XL3      Reserved - do not use                     02750000
QUASVER        DS    XL1      System version number                @P7A 02760000
QUASCLID       DS    CL2      System Clone ID                      @L5A 02770000
QUASCLST       DS    XL1      System Clone ID status               @L5A 02780000
QUASCLNU       EQU   X'80'    Clone ID uniqueness bit              @L5A 02790000
QUASLENG       EQU   *-QUASYS                                           02800000
.L0005   ANOP                                                      @LIA 02810000
         AIF   ('&DSECT' EQ 'YES').L0009                           @LIA 02820000
*                                                                  @PKD 02830000
QUASYS1  DS    0H        Sysplex record data format for QUAA level 1   *02840000
                                                                   @LIA 02850000
         AGO   .L000A                                              @LIA 02860000
.L0009   ANOP                                                      @LIA 02870000
QUASYS1  DSECT           Sysplex record data format for QUAA level 1   *02880000
                                                                   @LIA 02890000
.L000A   ANOP                                                      @LIA 02900000
         DS    1CL0040   Mapped by QuaSys                          @LIA 02910000
QUASFLAGS DS   0BL1      Flag bits                                 @LIA 02920000
QUASLPAR EQU   X'01'     1 = system is a LPAR PR/SM system and is not  *02930000
                         running under VM. QuaaLparNum contains valid  *02940000
                         data.                                         *02950000
                         0 = system is not a LPAR PR/SM system or is   *02960000
                         running under VM and any data in QuaaLparNum  *02970000
                         is not valid.                             @PMC 02971000
         ORG   QUASFLAGS+X'00000001'                               @LIA 02972000
QUASLPARNUM DS 1FL1      LPAR number of the system within the CPC.     *02973000
                         Only valid when QuasLpar is on            @LIA 02974000
QUASCPUID     DS 0CL4    CPUID of the CPC                          @LIA 02975000
QUASSERIALNUM DS 1CL2    Serial number of the CPC                  @LIA 02976000
QUASMODELNUM DS 1CL2     Model number of the CPC                   @LIA 02977000
         DS    1CL0018   Reserved                                  @LIA 02978000
QUASYS1_LEN EQU *-QUASYS1                                          @LIA 02979000
.L0008   ANOP                                                      @LIA 02979100
.IXCYQUAA99    ANOP                                                     02979200
               AIF   ('&GROUP' EQ 'NO').IXCYQUAA98                      02979300
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA60                      02979400
QUAGRP         DSECT                                                    02979500
               AGO   .IXCYQUAA65                                        02979600
.IXCYQUAA60    ANOP                                                     02979700
QUAGRP         DS    0D       Group record data format                  02979800
.IXCYQUAA65    ANOP                                                     02979900
QUAGTYPE       DS    X        X'00' group record,                       02980000
*                             X'80' last group record                   02980100
QUATYPGRP      EQU   0        Record type - Group (QUAGRP)         @L2A 02980200
QUATYPGRP_LAST EQU   128      Record type - Last Group             @L2A 02980300
               DS    X        Reserved X'00'                            02980400
QUAGLEN        DS    H        Length of group record                    02980500
QUAGNAME       DS    CL8      Group name                                02980600
QUAG#MEM       DS    F        Number of members in the group            02980700
QUAGFLAG1 DS   0CL0001                                             @0CA 02980801
QUAGSTALLED EQU X'80'    Indicates whether XCF considers any members    02980900
*                        of the group to be stalled with respect to     02981000
*                        the XCF processing that they perform. The      02981100
*                        condition is recognized only for members       02981200
*                        active on the system where the IXCQUERY is     02981300
*                        executed. Equals '0'B if no such member is     02981400
*                        considered stalled, '1'B if at least one such  02981500
*                        member is considered stalled. A member is      02981600
*                        considered stalled, for example, if its        02981700
*                        message exit routine does not return to XCF    02981800
*                        in a timely fashion.                           02981900
         ORG   QUAGFLAG1+X'00000001'                               @0CA 02982001
         DS    1CL0003   Reserved.                                 @0CC 02982101
QUAGLENG       EQU   *-QUAGRP                                           02982200
.IXCYQUAA98    ANOP                                                     02982300
               AIF   ('&MEMBER' EQ 'NO').IXCYQUAA97                     02982400
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA80                      02983000
QUAMEM         DSECT                                                    02984000
               AGO   .IXCYQUAA90                                        02985000
.IXCYQUAA80    ANOP                                                     02986000
QUAMEM         DS    0D       Member record data format                 02987000
.IXCYQUAA90    ANOP                                                     02988000
QUAMTYPE       DS    X        X'01' member record,                      02989000
*                             X'81' last member record                  02990000
QUATYPMEM      EQU   1        Record type - Member (QUAMEM)        @L2A 03000000
QUATYPMEM_LAST EQU   129      Record type - Last Member            @L2A 03010000
               DS    X        Reserved X'00'                            03020000
QUAMLEN        DS    H        Length of member record (includes         03030000
*                             User State Field length)                  03040000
QUAMNAME       DS    CL16     Member name                               03050000
QUAMTOKN       DS    XL8      Member token                              03060000
QUAMSTAT       DS    0XL4     Group services state                      03070000
QUAMSTA1       DS    X        Member State                              03080000
QUAMSCRE       EQU   2        Member State = CREATED                    03090000
QUAMSACT       EQU   3        Member State = ACTIVE                     03100000
QUAMSQUI       EQU   4        Member State = QUIESCED                   03110000
QUAMSFLD       EQU   5        Member State = FAILED                     03120000
QUAMSTA2       DS    X        Additional Status Information             03130000
QUAMSSSM       EQU   128      System Status Update Missing              03140000
QUAMSTRM       EQU   64       System Going - System termination started 03150000
QUAMSMSM       EQU   16       Member Stat Update Missing - Confirmed by 03160000
*                             Member Status Exit.  Check QUAMUDAT value 03170000
QUAMSMSD       EQU   8        Member Status Update Missing Detected -   03180000
*                             Member Status Exit never ran              03190000
*                             Reserved QUAMSPAU (was EQU 4)        @D3C 03200000
QUAMMREM       EQU   2        Monitoring has been removed for           03210000
*                             this member                               03220000
         ORG   QUAMSTA2+X'00000001'                                @0CA 03230001
QUAMSTA3 DS    0BL1      Additional status data                    @0CA 03231001
QUAMSTALLED EQU X'80'    Indicates whether XCF considers this group     03232000
*                        member to be stalled with respect to the XCF   03233000
*                        processing that it performs. The condition is  03234000
*                        recognized only for members active on the      03235000
*                        system where the IXCQUERY is executed. Equals  03236000
*                        '0'B if member is not considered stalled,      03237000
*                        '1'B if the member is considered stalled. A    03238000
*                        member is considered stalled, for example, if  03239000
*                        its message exit routine does not return to    03239100
*                        XCF in a timely fashion.                  @0CA 03239201
         ORG   QUAMSTA3+X'00000001'                                @0CA 03239301
         DS    1BL1      Reserved and set to 0                     @0CC 03239401
QUAMSYS        DS    CL8      System name that member was last          03240000
*                             active on                                 03250000
QUAMSID        DS    0XL4     System token for system on which          03260000
*                             member was last active                    03270000
QUAMSNUM       DS    XL1      System slot number                        03280000
               DS    XL3      Reserved - do not use                     03290000
QUAMJOB        DS    CL8      Job, STC, MOUNT, or LOGON name from the   03300000
*                             primary ASID current at JOIN time         03310000
QUAMTOD        DS    XL8      Time stamp of last change to member       03320000
*                             status                                    03330000
QUAMUSLN       DS    F        Length of User State Field, set by        03340000
*                             JOIN or CREATE                            03350000
QUAMUSOF       DS    F        Offset from QUAMEM of user state field.   03360000
*                             The user state field can                  03370000
*                             be addressed by ADDR(QUAMEM)+QUAMUSOF.    03380000
*                             For IXCQUERY, the area used by QUAMEM     03390000
*                             must allow for the maximum size of        03400000
*                             32-bytes of the user state field.         03410000
*                             For IXCJOIN or IXCCREAT, the area used by 03420000
*                             QUAMEM only needs to allow for the size   03430000
*                             of the user state field as specified on   03440000
*                             the IXCJOIN or IXCCREAT macro.            03450000
*                             QUAMUSLN contains the length of the user  03460000
*                             state field established by the IXCJOIN or 03470000
*                             IXCCREAT macro.                           03480000
QUAMINTV       DS    F        Interval specified by IXCJOIN. Could      03490000
*                             be changed through IXCMOD.                03500000
QUAMUDAT       DS    F        User data returned from member status     03510000
*                             exit.  Contains user data from Member     03520000
*                             Status Update Missing confirmation if     03530000
*                             QUAMSMSM is on.  Contains user data from  03540000
*                             Member Status Update Resumed confirmation 03550000
*                             if QUAMSMSM is off and user data is not   03560000
*                             zero.  If zero and QUAMSMSM is off, then  03570000
*                             it is unclear if the status exit          03580000
*                             returned a zero user data value. Invalid  03590000
*                             if QUAMMREM or QUAMSMSD is on.       @P3A 03600000
QUAMSTKN       DS    CL8      Member Stoken                        @L1A 03610000
QUAMPROTOCOLS DS 0BL4    Protocols that are supported for the member.  *03620000
                         Individual flags are '1'B if the protocol is  *03630000
                         supported, '0'B if not.                        03640000
QUAMPROCANRECEIVE EQU X'80' The member supplied a MSGEXIT routine when *03650000
                         it invoked IXCJOIN to join its group. The     *03660000
                         member is capable of receiving messages.       03670000
QUAMPROCANREPLY EQU X'40' The member specified YES for CANREPLY        *03680000
                         keyword when it invoked IXCJOIN to join its   *03690000
                         group. The member claims to be able to        *03700000
                         participate in the XCF managed response       *03710000
                         collection protocol.                           03720000
QUAMPRORESPONSECOLLECTION EQU X'20' The system on which the member     *03730000
                         resides supports XCF managed response         *03740000
                         collection.                                    03750000
QUAMPROORDEREDDELIVERY EQU X'10' The system on which the member        *03760000
                         resides supports ordered message delivery.     03770000
QUAMPROGT61KDELIVERY   EQU X'08' The system on which the member        *03780000
                         resides supports delivery of messages <= 128M *03790000
                         bytes in length                           @LGA 03800000
QUAMPROGT61KMSG        EQU X'04' The member specified YES for the      *03810000
                         GT61KMSG keyword when it invoked IXCJOIN to   *03820000
                         join its group.  The member claims to be able *03830000
                         to receive messages <= 128 megabytes in length 03840000
               DS    1BL.026   Reserved.                           @LGC 03850000
               ORG   QUAMPROTOCOLS+X'00000004'                          03860000
               DS    1CL0004   Reserved                                 03870000
QUAMLENG       EQU   *-QUAMEM                                           03880000
.IXCYQUAA97    ANOP                                                     03890000
               AIF   ('&CF' EQ 'NO').IXCYQUAA88                    @L2A 03900000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA01                 @L2A 03910000
QUACF          DSECT                                               @L2A 03920000
               AGO   .IXCYQUAA02                                   @L2A 03930000
.IXCYQUAA01    ANOP                                                @L2A 03940000
QUACF          DS    0D       QUAA data for coupling facility.          03950000
*                             QUAHSGOF points to this record            03960000
*                             when general or specific data for a       03970000
*                             coupling facility is requested.      @L2A 03980000
.IXCYQUAA02    ANOP                                                @L2A 03990000
QUACFTYP       DS    X        X'10' coupling facility record,           04000000
*                             X'90' Last coupling facility record  @L2A 04010000
QUATYPCF       EQU   16       Record type - coupling facility           04020000
*                             (QUACF)                              @L2A 04030000
QUATYPCF_LAST  EQU   144      Record type - Last coupling facility @L2A 04040000
               DS    X        Reserved X'00'                       @L2A 04050000
QUACFLEN       DS    H        Length of record                     @L2A 04060000
QUACFNAME      DS    CL8      Name of coupling facility            @L2A 04070000
QUACFND        DS    0CL32    Node descriptor of coupling facility      04080000
*                             IXLYNDE maps this field.             @D7C 04090000
               DS    XL4      See IXLYNDE                          @D7C 04100000
QUACFID        DS    CL26     EBCDIC portion of ND. See IXLYNDE    @D7C 04110000
               DS    XL2      See IXLYNDE                          @D7C 04120000
QUACFDUMPSIZE  DS    F        Size of dump space                        04130000
*                             as specified in CFRM active policy        04140000
*                             (number in multiple of 4K bytes)     @L2A 04150000
QUACFSTATE     DS    0XL4     State of coupling facility           @L2A 04160000
QUACFSTATE1    DS    X        1st byte of state indicators         @L2A 04170000
QUACFSTDPEND   EQU   X'80'    Policy change pending which will delete   04180000
*                             this coupling facility from the           04190000
*                             CFRM active policy                        04200000
*                             when all allocated structures are         04210000
*                             gone from this coupling facility     @L2A 04220000
QUACFSTATE2    DS    X        2nd byte of state indicators         @L2A 04230000
QUACFSTRECONCILE EQU   X'80'  The coupling facility to CFRM policy      04240000
*                             reconcile process is in progress.         04250000
*                             When this bit is on IXLCONNs to           04260000
*                             structures in this coupling facility      04270000
*                             are not permitted.                   @L2A 04280000
QUACFSTFAILED    EQU   X'40'  The coupling facility has failed.         04290000
*                             When this bit is on IXLCONNs to           04300000
*                             structures in this coupling facility      04310000
*                             are not permitted.                   @L3A 04320000
QUACFSTATE3    DS    X        3rd byte of state indicators         @L2A 04330000
QUACFSTPOPULATECFTARGET EQU  X'80'  A PopulateCF rebuild request is     04340000
*                             currently in progress for this facility.  04350000
*                                                                  @LAA 04360000
QUACFSTATE4    DS    X        4th byte of state indicators         @L2A 04370000
QUACFSTREXTRA  DS    F        Number of structures in this coupling     04380000
*                             facility which cannot be added            04390000
*                             to the policy                        @L2A 04400000
QUACFRSVD      DS    CL8      Reserved                             @L2A 04410000
QUACFSC#       DS    F        Number of records for systems connected   04420000
*                             to specified coupling facility            04430000
*                             (QUACFSC)                            @L2A 04440000
QUACFSCO       DS    F        Offset from QUACF to QUACFSC records @L2A 04450000
QUACFSTR#      DS    F        Number of records for structures in       04460000
*                             specified coupling facility               04470000
*                             (QUACFSTR)                           @L2A 04480000
QUACFSTRO      DS    F        Offset from QUACF to QUACFSTR records     04490000
*                                                                  @L2A 04500000
QUACFTEXT      DS    0CL40    CFRM active policy data              @L2A 04510000
QUACFPOLNAME   DS    CL8      Policy name.                              04520000
*                             If SETXCF STOP,POLICY,TYPE=CFRM has       04530000
*                             been issued then the name will be         04540000
*                             blanks.                              @L2A 04550000
QUACFUPDTIME   DS    CL8      Time policy was last updated by the       04560000
*                             installation prior to this policy         04570000
*                             being activated.                          04580000
*                             If SETXCF STOP,POLICY,TYPE=CFRM has       04590000
*                             been issued then the time will be         04600000
*                             the same time as QUACFSETTIME.       @L2A 04610000
QUACFSETTIME   DS    CL8      Time policy was activated via             04620000
*                             operator command.                    @L2A 04630000
QUACFREQ#STR   DS    F        If non-zero value, indicates              04640000
*                             that the policy is not formatted          04650000
*                             to contain the maximum number of          04660000
*                             structure records and is not large enough 04670000
*                             to contain all the structures that        04680000
*                             exist in facilities represented           04690000
*                             in the policy. Value should be used       04700000
*                             as input to format a couple data set      04710000
*                             for TYPE CFRM.                       @L2A 04720000
QUACFREQ#CONN  DS    H        If non-zero value indicates               04730000
*                             that the policy is not large enough       04740000
*                             to contain all the connections that       04750000
*                             exist for structures represented          04760000
*                             in the policy. Value should be used       04770000
*                             as input to format a couple data set      04780000
*                             for TYPE CFRM.                       @L2A 04790000
               DS    CL6      Reserved part of QUACFTEXT           @PBC 04800000
QUACFEXTRA#STR DS    F        If non-zero value, indicates              04810000
*                             that the policy is formatted              04820000
*                             with the maximum number of                04830000
*                             structure records (or a                   04840000
*                             recommendation was made to do             04850000
*                             so - if non-zero QuaCfReq#Str             04860000
*                             field) and                                04870000
*                             represents the number of                  04880000
*                             structures that must be removed           04890000
*                             from the policy to contain all            04900000
*                             the structures that exist in              04910000
*                             coupling facilities                       04920000
*                             represented in the policy.           @PBA 04930000
QUACFRSVD2     DS    CL40     Reserved                             @L2A 04940000
QUACFLENG      EQU   *-QUACF                                       @L2A 04950000
         AIF   ('&DSECT' EQ 'NO').L0012                                 04960000
QUACF1   DSECT                                                          04970000
         AGO   .L0013                                                   04980000
.L0012   ANOP                                                           04990000
QUACF1   DS    0D                                                       05000000
.L0013   ANOP                                                           05010000
         DS    1CL0160   Mapped by QUACF                                05020000
         DS    1CL0064   Reserved                                       05030000
QUACF1_LEN EQU *-QUACF1                                                 05040000
.IXCYQUAA88    ANOP                                                @L2A 05050000
               AIF   ('&CFSC' EQ 'NO').IXCYQUAA87                  @L2A 05060000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA03                 @L2A 05070000
QUACFSC        DSECT                                               @L2A 05080000
               AGO   .IXCYQUAA04                                   @L2A 05090000
.IXCYQUAA03    ANOP                                                @L2A 05100000
QUACFSC        DS    0D       QUAA data for Systems connected to        05110000
*                             specified coupling facility          @L2A 05120000
.IXCYQUAA04    ANOP                                                @L2A 05130000
QUACFSCTYP     DS    X        X'11' System connected to coupling        05140000
*                             facility record,                          05150000
*                             X'91' Last System connected to coupling   05160000
*                             facility record.                     @L2A 05170000
QUATYPCFSC     EQU   17       Record type - Systems connected to        05180000
*                             specified coupling facility               05190000
*                             (QUACFSC)                            @L2A 05200000
QUATYPCFSC_LAST EQU 145       Record type - Last system connected       05210000
*                             to specified coupling facility       @L2A 05220000
               DS    X        Reserved X'00'                       @L2A 05230000
QUACFSCLEN     DS    H        Length of record                     @L2A 05240000
QUACFSCNAME    DS    CL8      Name of System connected to specified     05250000
*                             coupling facility                    @L2A 05260000
QUACFSCRSVD    DS    CL4      Reserved                             @L2A 05270000
QUACFSCLENG    EQU   *-QUACFSC                                     @L2A 05280000
         AIF   ('&DSECT' EQ 'NO').L0022                                 05290000
QUACFSC1 DSECT                                                          05300000
         AGO   .L0023                                                   05310000
.L0022   ANOP                                                           05320000
QUACFSC1 DS    0D                                                       05330000
.L0023   ANOP                                                           05340000
         DS    1CL0016   Mapped by QUACFSC                              05350000
         DS    1CL0064   Reserved                                       05360000
QUACFSC1_LEN EQU *-QUACFSC1                                             05370000
.IXCYQUAA87    ANOP                                                @L2A 05380000
               AIF   ('&CFSTR' EQ 'NO').IXCYQUAA86                 @L2A 05390000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA05                 @L2A 05400000
QUACFSTR       DSECT                                               @L2A 05410000
               AGO   .IXCYQUAA06                                   @L2A 05420000
.IXCYQUAA05    ANOP                                                @L2A 05430000
QUACFSTR       DS    0D       QUAA data for structures in               05440000
*                             specified coupling facility          @L2A 05450000
.IXCYQUAA06    ANOP                                                @L2A 05460000
QUACFSTRTYP    DS    X        X'12' Structures in coupling              05470000
*                             facility record,                          05480000
*                             X'92' Last structure in coupling          05490000
*                             facility record.                     @L2A 05500000
QUATYPCFSTR    EQU   18       Record type - Structures in specified     05510000
*                             coupling facility (QUACFSTR)         @L2A 05520000
QUATYPCFSTR_LAST EQU 146      Record type - Last structure in           05530000
*                             specified coupling facility          @L2A 05540000
               DS    X        Reserved X'00'                       @L2A 05550000
QUACFSTRLEN    DS    H        Length of record                     @L2A 05560000
QUACFSTRNAME   DS    CL16     Name of structure                    @L2A 05570000
QUACFSTRFLG    DS    XL1      Structure allocation status          @L2A 05580000
QUACFSTRACT    EQU   X'80'    ON->Only 1 structure is allocated with    05590000
*                             this structure name.  Not part of a       05600000
*                             rebuild pair.  OFF->2 structures are      05610000
*                             allocated with this name.  See            05620000
*                             QuaCFStrRebldNew and QuaCFStrRebldOld     05630000
*                             to determine if this record represents    05640000
*                             either the rebuild new or rebuild old     05650000
*                             old structure.                       @PHC 05660000
QUACFSTRREBLDOLD EQU X'40'    Rebuild/old.                              05670000
*                             If structure rebuild (IXLREBLD) has       05680000
*                             been initiated the original               05690000
*                             structure is now the old structure.  @D4A 05700000
QUACFSTRREBLDNEW EQU X'20'    Rebuild/new.                              05710000
*                             If structure rebuild (IXLREBLD) has       05720000
*                             been initiated this structure is the      05730000
*                             new structure.                       @D4A 05740000
QUACFSTRTRAN   EQU   X'10'    Transitional state.                       05750000
*                             If structure is either being allocated    05760000
*                             in a coupling facility or deleted from    05770000
*                             a coupling facility, it is tracked        05780000
*                             in the policy.                       @D4A 05790000
QUACFSTRHOLD   EQU   X'08'    Holding state.                            05800000
*                             If structure was being deleted from the   05810000
*                             coupling facility but connectivity was    05820000
*                             lost, it is tracked in the policy.   @D4A 05830000
QUACFSTRDUMPTBL EQU  X'04'    Structure can not be deallocated          05840000
*                             since a dump table is associated          05850000
*                             with the structure.                  @D4A 05860000
QUACFSTRFLG2   DS    XL1      Structure state                      @L3A 05870000
QUACFSTRSTRFAIL EQU X'80'     Structure failure has been recognized     05880000
*                             for this version of the structure.   @L3A 05890000
QUACFSTRNOSYSCON EQU X'40'    No systems have connectivity              05900000
*                             to the facility in which the              05910000
*                             structure is allocated               @P4A 05920000
QUACFSTRDUPALTERDEFER EQU X'20'  The structure is duplexed and the      05930000
*                                alter of this structure instance       05940000
*                                is deferred, waiting for the           05950000
*                                alter of the other structure           05960000
*                                instance to complete.            @06A  05970000
QUACFSTRDUPALTERINPROGRESS EQU X'10' The structure is duplexed and the  05980000
*                                    alter of this structure instance   05990000
*                                    is in progress.            @06A    06000000
QUACFSTRPOPULATECFREBUILDPENDING EQU X'08'  The structre is in Pending  06010000
*                                      Rebuild state for the current    06020000
*                                      POPULATECF rebuild.        @LAA  06030000
QUACFSTRSTRDUMPID  DS H       Structure Dump ID.                        06040000
*                             Non zero value indicates dump table       06050000
*                             associated with structure. Valid only     06060000
*                             if structure is QUACFSTRACT,              06070000
*                             QUACFSTRREBLDNEW, QUACFSTRREBLDOLD, or    06080000
*                             QUACFSTRDUMPTBL.                     @D4A 06090000
QUACFSTRLENG   EQU   *-QUACFSTR                                    @L2A 06100000
         AIF   ('&DSECT' EQ 'NO').L0032                                 06110000
QUACFSTR1 DSECT                                                         06120000
         AGO   .L0033                                                   06130000
.L0032   ANOP                                                           06140000
QUACFSTR1 DS    0D                                                      06150000
.L0033   ANOP                                                           06160000
         DS    1CL0024   Mapped by QUACFSTR                             06170000
QUACFSTRPHYSICALVERSION DS 1BL8 Physical version for the structure.     06180000
*                              Changes when a new physical instance     06190000
*                              of the structure is allocated (e.g.,     06200000
*                              user- or system-managed rebuild), and    06210000
*                              there is at least one active connector   06220000
*                              to observe the allocation.          @LEC 06230000
QUACFSTRLOGICALVERSION DS 1BL8 Logical structure version number.        06240000
*                              Used in conjunction with the             06250000
*                              physical version number to identify      06260000
*                              an instance of a structure.  The         06270000
*                              value of this field is set equal to      06280000
*                              the physical version number when the     06290000
*                              structure is initially allocated.        06300000
*                              It changes when a process that           06310000
*                              allocates a new instance of the          06320000
*                              structure (e.g., rebuild) is user-       06330000
*                              managed, but not when it is system-      06340000
*                              managed.                            @LDC 06350000
         DS    1CL0112   Reserved                                  @LCC 06360000
QUACFSTR1_LEN EQU *-QUACFSTR1                                           06370000
.IXCYQUAA86    ANOP                                                @L2A 06380000
               AIF   ('&STR' EQ 'NO').IXCYQUAA85                   @L2A 06390000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA07                 @L2A 06400000
QUASTR         DSECT                                               @L2A 06410000
               AGO   .IXCYQUAA08                                   @L2A 06420000
.IXCYQUAA07    ANOP                                                @L2A 06430000
QUASTR         DS    0D       QUAA data for structures.                 06440000
*                             QUAHSGOF points to this record            06450000
*                             when general or specific data for a       06460000
*                             structure is requested.              @L2A 06470000
.IXCYQUAA08    ANOP                                                @L2A 06480000
QUASTRTYP      DS    X        X'20' Structure record,                   06490000
*                             X'A0' Last structure record.         @L2A 06500000
QUATYPSTR      EQU   32       Record type - Structure (QUASTR)          06510000
*                                                                  @L2A 06520000
QUATYPSTR_LAST EQU   160      Record type - Last structure         @L2A 06530000
               DS    X        Reserved X'00'                       @L2A 06540000
QUASTRLEN      DS    H        Length of record                     @L2A 06550000
QUASTRNAME     DS    CL16     Name of structure                    @L2A 06560000
QUASTRSIZE     DS    F        Size of structure as specified            06570000
*                             in CFRM active policy                     06580000
*                             (number in multiple of 4K bytes)     @L2A 06590000
QUASTRSTATE    DS    0XL4     State of structure                   @L2A 06600000
QUASTRSTATE1   DS    X        1st byte of state indicators         @L2A 06610000
QUASTRSTDPEND  EQU   X'80'    Change pending in CFRM policy for         06620000
*                             structure                            @L2A 06630000
QUASTRSTATE2   DS    X        2nd byte of state indicators         @L2A 06640000
QUASTRSTATE3   DS    X        3rd byte of state indicators         @L2A 06650000
QUASTRSTSDISP  EQU   X'80'    Allocated with STRDISP=KEEP          @L2A 06660000
QUASTRSTREBLD  EQU   X'20'    Structure rebuild in progress        @D4A 06670000
QUASTRSTREBLDSTOP EQU  X'10'  Structure rebuild stopped                 06680000
*                             QUASTRSTREBLD will also be on.       @D4A 06690000
QUASTRSTALTER  EQU   X'08'    Structure alter in progress          @L6A 06700000
QUASTRSTINCLEANUP EQU   X'04'    Structure cleanup in progress     @02A 06710000
QUASTRSTATE4   DS    X        4th byte of state indicators         @L2A 06720000
QUASTRSTINPOLDEF EQU X'80'    X'80' Structure is defined in policy @L2A 06730000
QUASTRINHDW    DS    X        Indicates structure in coupling           06740000
*                             facility                             @L2A 06750000
QUASTRINHDWON  EQU   X'80'    X'80' Allocated in coupling facility @L2A 06760000
               DS    X        Reserved X'00'                       @DBC 06770000
QUASTRCONNEXTRA DS   H        Highest connection identifier to this     06780000
*                             structure which can not be                06790000
*                             added to the policy.                 @L2A 06800000
QUASTRCONNEXTRA# DS H         Number of connections to this             06810000
*                             structure which can not be                06820000
*                             added to the policy.                 @DAA 06830000
QUASTRFLG DS   0BL1      Structure flags                                06840000
QUASTRDUPLEXALLOWED EQU X'80' DUPLEX(ALLOWED) was specified in the     *06850000
                         CFRM active policy for the structure           06860000
QUASTRDUPLEXENABLED EQU X'40' DUPLEX(ENABLED) was specified            *06870000
                         in the CFRM active policy for the structure    06880000
QUASTRPREFENFORCE EQU   X'20' ENFORCEORDER(YES) was specified      @08A 06890000
QUASTRALLOWAUTOALT EQU   X'10' ALLOWAUTOALT(YES) was specified     @LHA 06900000
         ORG   QUASTRFLG+X'00000001'                                    06910000
QUASTRREBUILDPERCENT DS FL1   REBUILDPERCENT for structure as           06920000
*                             specified in CFRM active policy.          06930000
*                             Value of zero implies not specified. @P8A 06940000
QUASTRINITSIZE DS    F        INITSIZE for structure as specified       06950000
*                             in CFRM active policy (number             06960000
*                             in multiple of 4K bytes)             @L6A 06970000
QUASTRPL#      DS    F        Number of records for preference list     06980000
*                             entries for specified structure           06990000
*                             (QUASTRPL)                           @L2A 07000000
QUASTRPLO      DS    F        Offset from QUASTR to QUASTRPL records    07010000
*                                                                  @L2A 07020000
QUASTRXL#      DS    F        Number of records for exclusion list      07030000
*                             entries for specified structure           07040000
*                             (QUASTRXL)                           @L2A 07050000
QUASTRXLO      DS    F        Offset from QUASTR to QUASTRXL records    07060000
*                                                                  @L2A 07070000
QUASTRCF#      DS    F        Number of records for coupling            07080000
*                             facilities containing specified           07090000
*                             structure (QUASTRCF)                 @L2A 07100000
QUASTRCFO      DS    F        Offset from QUASTR to QUASTRCF records    07110000
*                                                                  @L2A 07120000
QUASTRUSER#    DS    F        Number of records for connector to        07130000
*                             specified structure (QUASTRUSER)          07140000
*                                                                  @L2A 07150000
QUASTRUSERO    DS    F        Offset from QUASTR to QUASTRUSER records  07160000
*                                                                  @L2A 07170000
QUASTRTEXT     DS    0CL40    CFRM active policy data              @L2A 07180000
QUASTRPOLNAME  DS    CL8      Policy name                          @L2A 07190000
*                             If SETXCF STOP,POLICY,TYPE=CFRM has       07200000
*                             been issued then the name will be         07210000
*                             blanks.                              @L2A 07220000
QUASTRUPDTIME  DS    CL8      Time policy was last updated by the       07230000
*                             installation prior to this policy         07240000
*                             being activated.                          07250000
*                             If SETXCF STOP,POLICY,TYPE=CFRM has       07260000
*                             been issued then the time will be         07270000
*                             the same time as QUASTRSETTIME.      @L2A 07280000
QUASTRSETTIME  DS    CL8      Time policy was activated via             07290000
*                             operator command.                    @L2A 07300000
QUASTRREQ#STR  DS    F        If non-zero value, indicates              07310000
*                             that the policy is not formatted          07320000
*                             to contain the maximum number of          07330000
*                             structure records and is not large enough 07340000
*                             to contain all the structures that        07350000
*                             exist in coupling facilities represented  07360000
*                             in the policy. Value should be used       07370000
*                             as input to format a couple data set      07380000
*                             for TYPE CFRM.                       @L2A 07390000
QUASTRREQ#CONN DS    H        If non-zero value indicates               07400000
*                             that the policy is not large enough       07410000
*                             to contain all the connections that       07420000
*                             exist for structures represented          07430000
*                             in the policy. Value should be used       07440000
*                             as input to format a couple data set      07450000
*                             for TYPE CFRM.                       @L2A 07460000
               DS    CL6      Reserved part of QUASTRTEXT          @PBC 07470000
QUASTREXTRA#STR DS    F       If non-zero value, indicates              07480000
*                             that the policy is formatted              07490000
*                             with the maximum number of                07500000
*                             structure records (or a                   07510000
*                             recommendation was made to do             07520000
*                             so - if non-zero QuaStrReq#Str            07530000
*                             field) and                                07540000
*                             represents the number of                  07550000
*                             structures that must be removed           07560000
*                             from the policy to contain all            07570000
*                             the structures that exist in              07580000
*                             coupling facilities                       07590000
*                             represented in the policy.           @PBA 07600000
QUASTRREBLDINFO DS   0CL52    IXLREBLD related information         @D6C 07610000
*                                                                       07620000
QUASTRREBLDPHASE    DS 0XL4   Phase for the rebuild structure           07630000
*                             process.  Valid when QuaStrStRebld        07640000
*                             is on.  Note that not all phases          07650000
*                             are applicable to all rebuild types       07660000
*                             or methods.  Type (duplexed or not        07670000
*                             duplexed) is indicated by                 07680000
*                             QuastrRebldDuplex.  Method (user-         07690000
*                             or system-managed) is indicated by        07700000
*                             QuaStrProcessMethod.                 @0BC 07710000
QUASTRREBLDPHASE1   DS X      1st byte of phase indicators         @LCA 07720000
QUASTRREBLDQUIESCE  EQU X'80' QUIESCE - A structure rebuild has been    07730000
*                             initiated. Connections need to stop       07740000
*                             usage of the structure and confirm.       07750000
*                             This phase will be complete when          07760000
*                             all connections have issued IXLEERSP      07770000
*                             for the Rebuild Quiesce event.       @DCC 07780000
QUASTRREBLDCOMPLETE EQU X'40' COMPLETE - A structure rebuild is in      07790000
*                             progress. Connections can connect to      07800000
*                             new structure.                            07810000
*                             This phase will be complete when          07820000
*                             all connections have issued               07830000
*                             IXLREBLD REQUEST=COMPLETE.           @DCC 07840000
QUASTRREBLDCLEANUP  EQU X'20' CLEANUP - A structure rebuild is in       07850000
*                             progress. Connections have completed      07860000
*                             their part of the process and final       07870000
*                             cleanup is in progress.                   07880000
*                             This phase will be complete when          07890000
*                             all connections have issued IXLEERSP      07900000
*                             for the Rebuild Cleanup event.       @DCC 07910000
QUASTRREBLDSTOP     EQU X'10' STOP - Structure rebuild has been         07920000
*                             stopped.                             @D4A 07930000
QUASTRREBLDDUPLEXESTABLISHED EQU X'08' DUPLEX ESTABLISHED- Duplexing    07940000
*                        has been established and all users may         07950000
*                        proceed with duplexed structure operations.    07960000
*                        This phase will be complete when a switch to   07970000
*                        simplex mode using the new structure has been  07980000
*                        requested, and all users have issued IXLREBLD  07990000
*                        REQUEST=DUPLEXCOMPLETE                         08000000
QUASTRREBLDSTARTUP  EQU X'04' STARTUP - A system-managed process        08010000
*                             is in the startup phase.             @LDC 08020000
QUASTRREBLDALLOCATE EQU X'02' ALLOCATE - A system-managed process       08030000
*                             is in the allocate phase.  The            08040000
*                             system participating in the phase         08050000
*                             is described in the QUASTRSYS             08060000
*                             record.                              @LDC 08070000
QUASTRREBLDATTACH   EQU X'01' ATTACH - A system-managed process         08080000
*                             is in the attach phase.  The              08090000
*                             system(s) participating in the phase      08100000
*                             are described in the QUASTRSYS            08110000
*                             record.                              @LDC 08120000
QUASTRREBLDPHASE2   DS X      2nd byte of phase indicators         @LCA 08130000
QUASTRREBLDCOPY     EQU X'80' COPY - A system-managed process is        08140000
*                             in the copy phase.  The systems(s)        08150000
*                             participating in the phase are            08160000
*                             described in the QUASTRSYS record.   @LDC 08170000
QUASTRREBLDCOPYSTOP EQU X'40' COPY STOP - A system-managed process      08180000
*                             is in the copy stop phase.  The           08190000
*                             system(s) participating in the            08200000
*                             phase are described in the QUASTRSYS      08210000
*                             record.                              @LDC 08220000
QUASTRREBLDPHASE3   DS X      3rd byte of phase indicators         @LCA 08230000
QUASTRREBLDPHASE4   DS X      4th byte of phase indicators         @LCA 08240000
QUASTRREBLDSTARTRSN DS XL4    Rebuild start reason                 @D4A 08250000
QUASTRREBLDSTARTOPER      EQU X'80'  Operator                      @D4A 08260000
QUASTRREBLDSTARTCONN      EQU X'40'  Connector. See user code.          08270000
*                             (QUASTRREBLDSTARTUCODE)              @D4A 08280000
QUASTRREBLDSTARTLOSTCCF   EQU X'20'  Lost connectivity to coupling      08290000
*                             facility containing structure        @D4A 08300000
QUASTRREBLDSTARTSTRFAIL   EQU X'10'  Structure failed              @D4A 08310000
QUASTRREBLDSTARTPOLICY EQU X'08' Policy-initiated (DUPLEX(ENABLED)     *08320000
                         specified for the structure)                   08330000
QUASTRREBLDSTARTUCODE DS F    User code if rebuild start reason         08340000
*                             was connector (QUASTRREBLDSTARTCONN) @D4A 08350000
QUASTRREBLDSTOPRSN DS 0BL4 Rebuild stop reason                          08360000
QUASTRREBLDSTOPRSN1 DS 0BL1                                             08370000
QUASTRREBLDSTOPOPER EQU X'80' Operator                                  08380000
QUASTRREBLDSTOPCONN EQU X'40' Connector. See user code.                *08390000
                         (QUASTRREBLDSTOPUCODE)                         08400000
QUASTRREBLDSTOPINSUFFCONN EQU X'20' No coupling facility in the        *08410000
                         preference list provided better or equivalent *08420000
                         connectivity than the current facility. The   *08430000
                         rebuild was stopped to avoid a degradation in *08440000
                         connectivity for the application.              08450000
QUASTRREBLDSTOPNOBETTERCONN EQU X'10' No coupling facility in the      *08460000
                         preference list provided better connectivity  *08470000
                         than the current facility for this LOSSCONN   *08480000
                         rebuild. The rebuild was stopped to avoid     *08490000
                         further degradation in connectivity for the   *08500000
                         application.                                   08510000
QUASTRREBLDSTOPLOSTCCFNEW EQU X'08' Lost connectivity to coupling      *08520000
                         facility containing new structure              08530000
QUASTRREBLDSTOPLOSTCCFOLD EQU X'04' Lost connectvity to coupling       *08540000
                         facility containing old structure              08550000
QUASTRREBLDSTOPSTRFAILNEW EQU X'02' New structure failed.               08560000
QUASTRREBLDSTOPSTRFAILOLD EQU X'01' Old structure failed.               08570000
         ORG   QUASTRREBLDSTOPRSN1+X'00000001'                          08580000
QUASTRREBLDSTOPRSN2 DS 0BL1                                             08590000
QUASTRREBLDSTOPPOLICY EQU X'80' Policy-initiated (DUPLEX(DISABLED)     *08600000
                         specified for the structure)                   08610000
QUASTRREBLDSTOPSTRFAIL EQU X'40' Structure failure (for a duplexing    *08620000
                         rebuild)                                       08630000
QUASTRREBLDSTOPLOSSCONN EQU X'20' Loss of connectivity (for a          *08640000
                         duplexing rebuild)                             08650000
QUASTRREBLDSTOPINSUFFCONNCHGCON EQU X'10'  Insufficient connectivity   *08660000
                         due to a change in the set of structure       *08670000
                         connectors (for a duplexing rebuild)           08680000
QUASTRREBLDSTOPPOPCFNOTSUITABLE EQU X'08'  This structure was selected *08690000
                              as a candidate for a PopulateCF rebuild, *08700000
                              but the facility specified on the Start  *08710000
                              PopCF rebuild was not a suitable location*08720000
                              compared to its current location     @LAA 08730000
         ORG   QUASTRREBLDSTOPRSN+X'00000004'                           08740000
QUASTRREBLDSTOPUCODE DS F     User code if rebuild stop reason          08750000
*                             was connector (QUASTRREBLDSTOPCONN)  @D4A 08760000
QUASTRREBLDPHASECONFIRMSTNG DS CL32 Bit string representing active      08770000
*                             connections for this phase of rebuild.    08780000
*                             The bit position maps to the connection   08790000
*                             identifier. See QUASTRUSERCONID.     @D6A 08800000
QUASTRUSYNCINFO DS   0CL104   IXLUSYNC related information         @D9A 08810000
QUASTRUSYNCCONFIRMSTNG DS CL32 Bit string representing active           08820000
*                             connections needing to respond to         08830000
*                             User Sync Point event represented         08840000
*                             by QUASTRUSYNCNEXT.                       08850000
*                             The bit position maps to the connection   08860000
*                             identifier. See QUASTRUSERCONID.     @D9A 08870000
QUASTRUSYNCNEXT DS    F       Next User Sync Point event. This is       08880000
*                             the current event. In the event exit,     08890000
*                             the user receives this as the             08900000
*                             next event.                          @D9A 08910000
QUASTRUSYNCNEXTUSTATE DS CL32 Next User Sync Point user state           08920000
*                             information                          @D9A 08930000
QUASTRUSYNCCOMPLETED  DS F    Completed User Sync Point event.          08940000
*                             This is the previous event which has      08950000
*                             completed. In the event exit, the         08960000
*                             user receives this as the                 08970000
*                             completed event.                     @D9A 08980000
QUASTRUSYNCCOMPLETEDUSTATE DS CL32 Completed User Sync Point user       08990000
*                             state information                    @D9A 09000000
QUASTRPENDSIZE DS     F       Size of the structure in the pending      09010000
*                             policy,  in units of 4K bytes.  This      09020000
*                             field is valid only when it contains      09030000
*                             a nonzero value.  Note that this          09040000
*                             field is set to the pending policy        09050000
*                             INITSIZE (if specified) or to the         09060000
*                             pending policy SIZE (if INITSIZE is not   09070000
*                             specified).                          @01A 09080000
QUASTRREBLDFLAGS DS 0BL1 Rebuild flags                                  09090000
QUASTRREBLDDUPLEX EQU X'80' Indicates whether or not the in-progress   *09100000
                         rebuild is a duplexing rebuild                 09110000
QUASTRREBLDSWITCHINPROGRESS EQU X'40' Indicates whether or not a       *09120000
                         switch to simplex mode using the new          *09130000
                         structure has been initiated for a duplexing  *09140000
                         rebuild that was in the rebuild duplex        *09150000
                         established phase.                             09160000
QUASTRPROCESSMETHOD EQU X'01' ON=> the process in progress is           09170000
*                        system-managed. OFF=> the process in           09180000
*                        progress is user-managed.  The process         09190000
*                        type is identified by the QuaStrStRebld        09200000
*                        and QuaStrRebldDuplex flags.              @LDC 09210000
         ORG   QUASTRREBLDFLAGS+X'00000001'                             09220000
QUASTRRSVD     DS    CL2      Reserved                             @LHC 09230000
QUASTRFULLTHRESHOLD DS XL1    FULLTHRESHOLD for a structure specified   09240000
*                             or defaulted to in the CFRM policy   @LHA 09250000
QUASTRMINSIZE  DS   F         MINSIZE for a structure as specified or   09260000
*                             or defaulted to in the CFRM policy   @LHA 09270000
QUASTRALTER    DS   0CL15     Structure alter data.                     09280000
*                             Only has data if QUASTRSTALTER is on.     09290000
*                                                                  @L6A 09300000
QUASTRALTERFLG1 DS  XL1       Structure alter status flags         @L6A 09310000
QUASTRALTERSTOP EQU X'80'     Structure alter stopped              @L6A 09320000
QUASTRALTEROPSTART EQU X'40'  Structure alter started by SETXCF         09330000
*                             command                              @L6A 09340000
QUASTRALTEROPSTOP  EQU X'20'  Structure alter stopped by SETXCF         09350000
*                             command                              @L6A 09360000
QUASTRALTERPGMSTART EQU X'10' Structure alter started by IXLALTER       09370000
*                             interface                            @L6A 09380000
QUASTRALTERPGMSTOP  EQU X'08' Structure alter stopped by IXLALTER       09390000
*                             interface                            @L6A 09391000
QUASTRALTERREBLDSTOP EQU X'04' Structure alter stopped due to           09392000
*                             structure rebuild                    @L6A 09393000
QUASTRALTERSYSSTART EQU X'02' Structure alter started by system         09394000
*                             for AutoAlter                        @PLA 09395000
QUASTRALTERSYSSTOP EQU X'01'  Structure alter stopped by system         09396000
*                             for AutoAlter                        @PLA 09397000
QUASTRALTERFLG2 DS  XL1       Structure alter consensus from all        09398000
*                             connections and alter request data   @L6A 09399000
QUASTRALTERCHGSIZE EQU X'80'  Structure alter request specified         09400000
*                             size change                          @L6A 09410000
QUASTRALTERCHGRATIO EQU X'40' Structure alter request specified         09420000
*                             ratio change                         @L6A 09430000
QUASTRALTERCHGEMC   EQU X'20' Structure alter request specified         09440000
*                             EMC change                           @05A 09450000
QUASTRALTERNEW EQU X'10' Alter in progress against the new structure   *09460000
                         during a duplexing rebuild process             09470000
QUASTRALTEROLD EQU X'08' Alter in progress against the old structure   *09480000
                         during a duplexing rebuild process        @PIA 09490000
QUASTRALTERRATIO EQU X'01'    All connections permit change to          09500000
*                             ratio                                @L6A 09510000
QUASTRALTERMINENTRY   DS FL1  Maximum for all connections of the        09520000
*                             minimum percent of entries           @L6A 09530000
QUASTRALTERMINELEMENT DS FL1  Maximum for all connections of the        09540000
*                             minimum percent of elements          @L6A 09550000
QUASTRALTERTSIZE DS  F        Structure alter target size          @L6A 09560000
QUASTRALTERTENTRYRATIO DS FL2 Structure alter target entry part of      09570000
*                             entry-to-element ratio               @L6A 09580000
QUASTRALTERTELEMENTRATIO DS FL2 Structure alter target element part of  09590000
*                             entry-to-element ratio               @L6A 09600000
QUASTRALTERTEMCSTGPCT DS 1FL2    Structure alter target for Event      *09610000
                         Monitor Control Storage percent           @05A 09620000
QUASTRALTERMINEMC DS 1FL1        Maximum for all connections of the    *09630000
                         minimum percent of EMC storage            @05A 09640000
            DS X         Reserved                                  @LDA 09650000
QUASTRSYSNUMRECS DS F    Number of records for system-related           09660000
*                        information for specified structure            09670000
*                        (QUASTRSYS)                               @LDA 09680000
QUASTRSYSO  DS F         Offset from QUASTR to QUASTRSYS records   @LDA 09690000
QUASTRRSVD2 DS 1CL0008   Reserved                                  @LDC 09700000
QUASTRLENG     EQU   *-QUASTR                                      @L6C 09710000
         AIF   ('&DSECT' EQ 'NO').L0042                                 09720000
QUASTR1  DSECT                                                          09730000
         AGO   .L0043                                                   09740000
.L0042   ANOP                                                           09750000
QUASTR1  DS    0D                                                       09760000
.L0043   ANOP                                                           09770000
         DS    1CL0312   Mapped by QUASTR                               09780000
QUASTRUSYNCINFO2 DS 0CL0016 Additional USYNC info                       09790000
QUASTRUSYNCNEXTCOMPCODE DS 1FL4 Next completion code                    09800000
QUASTRUSYNCCOMPLETEDCOMPCODE DS 1FL4 Completed completion code          09810000
         DS    1CL0008   Reserved                                       09820000
QUASTRREBLDPCTLOSSCONN DS 1FL1 Percent loss of connectivity associated *09830000
                         with a structure rebuild that was initiated   *09840000
                         by MVS based on REBUILDPERCENT                 09850000
         DS    1CL0003   Reserved                                       09860000
QUASTRGRPNAME DS 1CL0008 XCF group name associated with this           *09870000
                         structure, if the structure is being used as  *09880000
                         a serialized structure. Otherwise, this field *09890000
                         contains binary zero                           09900000
QUASTRPOPCFNAME DS 1CL0008 Name of Coupling Facility for which this    *09910000
                         structure is a PopulateCF candidate, if the   *09920000
                         structure is a PopCF candidate.  Otherwise,   *09930000
                         this field contains binary zero           @LAA 09940000
QUASTRAUTOVERSION DS 1BL8 If a system-managed process affecting         09950000
*                        this structure is in progress,                 09960000
*                        (QUASTRPROCESSMETHOD = ON), this field         09970000
*                        contains a token that can be used to           09980000
*                        correlate events related to that process.      09990000
*                        If no system-managed process affecting         10000000
*                        this structure is in progress, this field      10010000
*                        contains zero.                            @LDA 10020000
         DS    1CL084    Reserved                                  @LDC 10030000
QUASTR1_LEN EQU *-QUASTR1                                               10040000
.IXCYQUAA85    ANOP                                                @L2A 10050000
               AIF   ('&STRPL' EQ 'NO').IXCYQUAA84                 @L2A 10060000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA09                 @L2A 10070000
QUASTRPL       DSECT                                               @L2A 10080000
               AGO   .IXCYQUAA10                                   @L2A 10090000
.IXCYQUAA09    ANOP                                                @L2A 10100000
QUASTRPL       DS    0D       QUAA data for specified structure         10110000
*                             preference list                      @L2A 10120000
.IXCYQUAA10    ANOP                                                @L2A 10130000
QUASTRPLTYP    DS    X        X'21' Structure preference list           10140000
*                             entry record,                             10150000
*                             X'A1' Last structure preference           10160000
*                             list entry record                    @L2A 10170000
QUATYPSTRPL    EQU   33       Record type - Structure preference        10180000
*                             list entry (QUASTRPL)                @L2A 10190000
QUATYPSTRPL_LAST EQU 161      Record type - Last structure              10200000
*                             preference list entry                @L2A 10210000
               DS    X        Reserved X'00'                       @L2A 10220000
QUASTRPLLEN    DS    H        Length of record                     @L2A 10230000
QUASTRPLRSVD   DS    CL4      Reserved                             @L2A 10240000
QUASTRPLNAME   DS    CL8      Coupling facility named in preference     10250000
*                             list entry                           @L2A 10260000
QUASTRPLLENG   EQU   *-QUASTRPL                                    @L2A 10270000
         AIF   ('&DSECT' EQ 'NO').L0052                                 10280000
QUASTRPL1  DSECT                                                        10290000
         AGO   .L0053                                                   10300000
.L0052   ANOP                                                           10310000
QUASTRPL1  DS    0D                                                     10320000
.L0053   ANOP                                                           10330000
         DS    1CL0016   Mapped by QUASTRPL                             10340000
         DS    1CL0032   Reserved                                       10350000
QUASTRPL1_LEN EQU *-QUASTRPL1                                           10360000
.IXCYQUAA84    ANOP                                                @L2A 10370000
               AIF   ('&STRXL' EQ 'NO').IXCYQUAA83                 @L2A 10380000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA11                 @L2A 10390000
QUASTRXL       DSECT                                               @L2A 10400000
               AGO   .IXCYQUAA12                                   @L2A 10410000
.IXCYQUAA11    ANOP                                                @L2A 10420000
QUASTRXL       DS    0D       QUAA data for specified structure         10430000
*                             exclusion list                       @L2A 10440000
.IXCYQUAA12    ANOP                                                @L2A 10450000
QUASTRXLTYP    DS    X        X'22' Structure exclusion list            10460000
*                             entry record,                             10470000
*                             X'A2' Last structure exclusion            10480000
*                             list entry record                    @L2A 10490000
QUATYPSTRXL    EQU   34       Record type - Structure exclusion         10500000
*                             list entry (QUASTRXL)                @L2A 10510000
QUATYPSTRXL_LAST EQU 162      Record type - Last structure              10520000
*                             exclusion list entry                 @L2A 10530000
               DS    X        Reserved X'00'                       @L2A 10540000
QUASTRXLLEN    DS    H        Length of record                     @L2A 10550000
QUASTRXLRSVD   DS    CL4      Reserved                             @L2A 10560000
QUASTRXLNAME   DS    CL16     Structure named in exclusion list         10570000
*                             entry                                @L2A 10580000
QUASTRXLLENG   EQU   *-QUASTRXL                                    @L2A 10590000
         AIF   ('&DSECT' EQ 'NO').L0062                                 10600000
QUASTRXL1  DSECT                                                        10610000
         AGO   .L0063                                                   10620000
.L0062   ANOP                                                           10630000
QUASTRXL1  DS    0D                                                     10640000
.L0063   ANOP                                                           10650000
         DS    1CL0024   Mapped by QUASTRXL                             10660000
         DS    1CL0032   Reserved                                       10670000
QUASTRXL1_LEN EQU *-QUASTRXL1                                           10680000
.IXCYQUAA83    ANOP                                                @L2A 10690000
               AIF   ('&STRCF' EQ 'NO').IXCYQUAA82                 @L2A 10700000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA13                 @L2A 10710000
QUASTRCF       DSECT                                               @L2A 10720000
               AGO   .IXCYQUAA14                                   @L2A 10730000
.IXCYQUAA13    ANOP                                                @L2A 10740000
QUASTRCF       DS    0D       QUAA data for coupling facility of        10750000
*                             specified structure                  @L2A 10760000
.IXCYQUAA14    ANOP                                                @L2A 10770000
QUASTRCFTYP    DS    X        X'23' Coupling facility of specified      10780000
*                             structure record,                         10790000
*                             X'A3' Last coupling facility of           10800000
*                             specified structure record.          @L2A 10810000
QUATYPSTRCF    EQU   35       Record type - Coupling facility for       10820000
*                             allocated structure (QUASTRCF)       @L2A 10830000
QUATYPSTRCF_LAST EQU 163      Record type - Last coupling facility for  10840000
*                             allocated structure                  @L2A 10850000
               DS    X        Reserved X'00'                       @L2A 10860000
QUASTRCFLEN    DS    H        Length of record                     @L2A 10870000
QUASTRCFNAME   DS    CL8      Name of coupling facility where           10880000
*                             structure is allocated               @L2A 10890000
QUASTRCFFLG    DS    XL1      Structure allocation status          @L2A 10900000
QUASTRCFACT    EQU   X'80'    ON->Only 1 structure is allocated with    10910000
*                             this structure name.  Not part of a       10920000
*                             rebuild pair.  OFF->2 structures are      10930000
*                             allocated with this name.  See            10940000
*                             QuaStrCFRebldNew and QuaStrCFRebldOld     10950000
*                             to determine if this record represents    10960000
*                             either the rebuild new or rebuild old     10970000
*                             old structure.                       @PHC 10980000
QUASTRCFREBLDOLD EQU X'40'    Rebuild/old.                              10990000
*                             If structure rebuild (IXLREBLD) has       11000000
*                             been initiated the original active        11010000
*                             structure is now the old structure.  @D4A 11020000
QUASTRCFREBLDNEW EQU X'20'    Rebuild/new.                              11030000
*                             If structure rebuild (IXLREBLD) has       11040000
*                             been initiated this structure is the      11050000
*                             new structure.                       @D4A 11060000
QUASTRCFTRAN   EQU   X'10'    Transitional state.                       11070000
*                             If structure is either being              11080000
*                             allocated in coupling facility or deleted 11090000
*                             from coupling facility, it is tracked     11100000
*                             in the policy.                       @D4A 11110000
QUASTRCFHOLD   EQU   X'08'    Holding state.                            11120000
*                             If structure was being deleted from the   11130000
*                             coupling facility but connectivity was    11140000
*                             lost, it is tracked in the policy.   @D4A 11150000
QUASTRCFDUMPTBL EQU  X'04'    Structure can not be deallocated          11160000
*                             since a dump table is associated          11170000
*                             with the structure.                  @D4A 11180000
QUASTRCFFLG2   DS    XL1      Structure state                      @L3A 11190000
QUASTRCFSTRFAIL EQU X'80'     Structure failure has been recognized     11200000
*                             for this version of the structure.   @L3A 11210000
QUASTRCFACCESSTIMENOLIMIT EQU X'40' Structure was allocated with        11220000
*                             IXLCONN ACCESSTIME(NOLIMIT).              11230000
*                             Valid only if structure is QUASTRCFACT,   11240000
*                             QUASTRCFREBLDNEW, or QUASTRCFREBLDOLD.    11250000
*                                                                  @DDA 11260000
QUASTRCFNOSYSCON EQU X'20'    No systems have connectivity              11270000
*                             to the facility in which the              11280000
*                             structure is allocated               @P4A 11290000
QUASTRCFDUPALTERDEFER EQU X'10' The structure is duplexed and the alter 11300000
*                             of this structure instance is deferred,   11310000
*                             waiting for the alter of the other        11320000
*                             structure instance to complete.      @06A 11330000
QUASTRCFDUPALTERINPROGRESS EQU X'08' The structure is duplexed and the  11340000
*                             alter of this structure instance is in    11350000
*                             progress.                            @PGC 11360000
QUASTRCFACCESSTIMEMAXIMUM DS H Access time for                          11370000
*                             IXLCONN ACCESSTIME(MAXIMUM).              11380000
*                             Valid only if structure is QUASTRCFACT,   11390000
*                             QUASTRCFREBLDNEW, or QUASTRCFREBLDOLD.    11400000
*                                                                  @DDA 11410000
QUASTRCFND     DS    0CL32    Node descriptor of coupling facility      11420000
*                             where structure is allocated.             11430000
*                             IXLYNDE maps this field.             @D7C 11440000
               DS    XL4      See IXLYNDE                          @D7C 11450000
QUASTRCFID     DS    CL26     EBCDIC portion of ND. See IXLYNDE    @D7C 11460000
               DS    XL2      See IXLYNDE                          @D7C 11470000
               DS    XL4      Reserved                             @D7C 11480000
QUASTRCFVERSION DS   0BL8     Structure version.                        11490000
*                             Time structure was allocated.        @LCC 11500000
QUASTRCFPHYSICALVERSION DS 1BL8 Physical version for the structure.     11510000
*                             Changes when a new physical instance      11520000
*                             of the structure is allocated (e.g.,      11530000
*                             user- or system-managed rebuild), and     11540000
*                             there is at least one active connector    11550000
*                             to observe the allocation.           @LEC 11560000
QUASTRCFMAXCONN DS   H        Maximum number of connections             11570000
*                             allowed when structure was                11580000
*                             allocated in coupling facility.           11590000
*                             Valid only if structure is                11600000
*                             QUASTRCFACT, QUASTRCFREBLDOLD,            11610000
*                             or QUASTRCFREBLDNEW.                 @D4A 11620000
QUASTRCFSTRDUMPID  DS H       Structure Dump ID.                        11630000
*                             Non zero value indicates dump table       11640000
*                             associated with structure. Valid only     11650000
*                             if structure is QUASTRCFACT,              11660000
*                             QUASTRCFREBLDNEW, QUASTRCFREBLDOLD, or    11670000
*                             QUASTRCFDUMPTBL.                     @D4A 11680000
               DS    CL8      Reserved                             @D4C 11690000
QUASTRCFLENG   EQU   *-QUASTRCF                                    @L2A 11700000
         AIF   ('&DSECT' EQ 'NO').L0072                                 11710000
QUASTRCF1  DSECT                                                        11720000
         AGO   .L0073                                                   11730000
.L0072   ANOP                                                           11740000
QUASTRCF1  DS    0D                                                     11750000
.L0073   ANOP                                                           11760000
         DS    1CL0072   Mapped by QUASTRCF                             11770000
QUASTRCFLOGICALVERSION DS 1BL8  Logical structure version number.       11780000
*                               Used in conjunction with the            11790000
*                               physical version number to identify     11800000
*                               an instance of a structure.  The        11810000
*                               value of this field is set equal to     11820000
*                               the physical version number when        11830000
*                               the structure is initially allocated.   11840000
*                               It changes when a process that          11850000
*                               allocates a new instance of the         11860000
*                               structure (e.g., rebuild) is user-      11870000
*                               managed, but not when it is             11880000
*                               system-managed.                    @LDC 11890000
         DS    1CL0056   Reserved                                  @LCC 11900000
QUASTRCF1_LEN EQU *-QUASTRCF1                                           11910000
.IXCYQUAA82    ANOP                                                @L2A 11920000
               AIF   ('&STRUSER' EQ 'NO').IXCYQUAA81               @L2A 11930000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA15                 @L2A 11940000
QUASTRUSER     DSECT                                               @L2A 11950000
               AGO   .IXCYQUAA16                                   @L2A 11960000
.IXCYQUAA15    ANOP                                                @L2A 11970000
QUASTRUSER     DS    0D       QUAA data for connector to specified      11980000
*                             structure                            @L2A 11990000
.IXCYQUAA16    ANOP                                                @L2A 12000000
QUASTRUSERTYP  DS    X        X'24' Connector to structure record,      12010000
*                             X'A4' Last connector to structure         12020000
*                             record.                              @L2A 12030000
QUATYPSTRU     EQU   36       Record type - Structure connector         12040000
*                             data (QUASTRUSER)                    @L2A 12050000
QUATYPSTRU_LAST EQU 164       Record type - Last structure              12060000
*                             connector data                       @L2A 12070000
               DS    X        Reserved X'00'                       @L2A 12080000
QUASTRUSERLEN  DS    H        Length of record                     @L2A 12090000
QUASTRUSERCONVERSION DS  CL4  Connection version                   @L2A 12100000
QUASTRUSERCDATA DS   CL8      Connect data                         @L2A 12110000
QUASTRUSERCNAME DS   CL16     Connect name                         @L2A 12120000
QUASTRUSERCLEVEL DS  CL8      Connect level                        @DBC 12130000
QUASTRUSERSID  DS    0XL4     System token for system on which          12140000
*                             connector was last active            @D5A 12150000
QUASTRUSERSNUM DS    XL1      System slot number                   @D5A 12160000
               DS    XL3      Reserved - do not use                @D5A 12170000
               DS    CL1      Reserved                             @DGC 12180000
QUASTRUSERINFOLEVEL DS   X    Indicates the level of                    12190000
*                             information returned for the              12200000
*                             connection.                          @DGA 12210000
QUASTRUSERINFOLEVEL1 EQU 1    Information level 1                  @DGA 12220000
QUASTRUSERASID DS    CL2      ASID of connector when last active   @D4A 12230000
QUASTRUSERDDATA DS   CL8      Disconnect data                      @DEA 12240000
QUASTRUSERCFLEVEL DS F        Connect CFLEVEL                      @P6C 12250000
               DS    CL4      Reserved                             @P6C 12260000
QUASTRUSERSYS  DS    CL8      System name for system on which           12270000
*                             connector was last active            @L2A 12280000
QUASTRUSERSTKN DS    CL8      Stoken when                               12290000
*                             connector was last active            @L2A 12300000
QUASTRUSERJOB  DS    CL8      Job name / Started task name              12310000
*                             when connector was last active       @L2A 12320000
QUASTRUSERFLG1 DS    XL1      Flags for state of connection        @L2A 12330000
QUASTRUSERACT  EQU   X'80'    Active state - connection established.    12340000
*                                                                  @L2A 12350000
QUASTRUSERFAIL EQU   X'40'    Failed Persistent state - connection      12360000
*                             with CONDISP=KEEP has failed and all      12370000
*                             of the event exit responses have          12380000
*                             been received with RELEASECONN=NO.   @L2A 12390000
QUASTRUSERTERM EQU   X'20'    Failing state - connection terminated     12400000
*                             abnormally and not all of the event       12410000
*                             exit responses have been received.   @L2A 12420000
QUASTRUSERDISC EQU   X'10'    Disconnecting state - connection          12430000
*                             disconnected and not all of the event     12440000
*                             exit responses have been received.   @L2A 12450000
QUASTRUSERDISP EQU   X'08'    Connected with CONDISP=KEEP          @L2A 12460000
QUASTRUSERDUAL EQU   X'04'    Connected to both structures during       12470000
*                             structure rebuild (IXLREBLD).             12480000
*                             If structure rebuild has been             12490000
*                             initiated and 2 structures exist          12500000
*                             (the original active structure            12510000
*                             is now the old structure and the          12520000
*                             2nd structure is the new structure)       12530000
*                             then the connector is currently           12540000
*                             connected to both.                   @D8A 12550000
QUASTRUSERALLOWREBLD EQU X'02' Connected with ALLOWREBLD=YES       @P6A 12560000
QUASTRUSERALLOWDUPREBLD EQU X'01' Connected with ALLOWDUPREBLD=YES,    *12570000
                         indicating that this user allows and supports *12580000
                         duplexing rebuild protocols for user-managed  *12590000
                         duplexing.                                     12600000
QUASTRUSERFLG2 DS    XL1      Flags for connectivity state of           12610000
*                             the connected user.                  @DEC 12620000
QUASTRUSERNCSTR EQU  X'80'    If QUASTRSTREBLD is off then              12630000
*                             the connected user lost connectivity      12640000
*                             to the active/in use structure.           12650000
*                             If QUASTRSTREBLD is on then               12660000
*                             use QUASTRUSERNCSTRNEW and/or             12670000
*                             QUASTRUSERNCSTROLD.                  @DEA 12680000
QUASTRUSERNCSTRNEW EQU X'40'  If QUASTRSTREBLD is on and                12690000
*                             QUASTRUSERDUAL is on then                 12700000
*                             the connected user lost connectivity      12710000
*                             to the new structure.                @DEA 12720000
QUASTRUSERNCSTROLD EQU X'20'  If QUASTRSTREBLD is on then               12730000
*                             the connected user lost connectivity      12740000
*                             to the old structure.                @DEA 12750000
QUASTRUSERCONID DS   FL1      Connection identifier.                    12760000
*                             The connection identifier is              12770000
*                             used for the bit position within          12780000
*                             confirm strings. These start              12790000
*                             with bit position zero. For example,      12800000
*                             if connections with connection            12810000
*                             identifiers 1, 4, and 6 are               12820000
*                             represented in a confirm string           12830000
*                             the 1st byte would be '4A'X               12840000
*                             with all remaining bytes '00'X.      @L2A 12850000
QUASTRUSERFLG3  DS    XL1     Flags for failure isolation               12860000
*                             information for a user.              @DGC 12870000
QUASTRUSERFAILISOLSTR  EQU X'80'  This information is only available    12880000
*                             if QUASTRUSERACT is on and                12890000
*                             QUASTRUSERINFOLEVEL is equal to or        12900000
*                             greater than QUASTRUSERINFOLEVEL1.        12910000
*                             If QUASTRSTREBLD is off,                  12920000
*                             the system from which the user            12930000
*                             has connected is failure isolated         12940000
*                             from the active/in use structure.         12950000
*                             If QUASTRSTREBLD is on then               12960000
*                             use QUASTRUSERFAILISOLSTRNEW and/or       12970000
*                             QUASTRUSERFAILISOLSTROLD.            @DGA 12980000
QUASTRUSERFAILISOLSTRNEW EQU X'40'  This information is only available  12990000
*                             if QUASTRUSERACT is on and                13000000
*                             QUASTRUSERINFOLEVEL is equal to or        13010000
*                             greater than QUASTRUSERINFOLEVEL1.        13020000
*                             If QUASTRSTREBLD is on                    13030000
*                             and QUASTRUSERDUAL is on then             13040000
*                             the system from which the user            13050000
*                             has connected is failure isolated         13060000
*                             from the new structure.              @DGA 13070000
QUASTRUSERFAILISOLSTROLD EQU X'20'  This information is only available  13080000
*                             if QUASTRUSERACT is on and                13090000
*                             QUASTRUSERINFOLEVEL is equal to or        13100000
*                             greater than QUASTRUSERINFOLEVEL1.        13110000
*                             If QUASTRSTREBLD is on,                   13120000
*                             the system from which the user            13130000
*                             has connected is failure isolated         13140000
*                             from the old structure.              @DGA 13150000
QUASTRUSERNONVOLREQ EQU X'10' When ON, the user specified IXLCONN       13160000
*                             NONVOLREQ=YES.  Valid only when           13170000
*                             QUASTRUSERACT is on.                 @LDA 13180000
QUASTRUSERFLG4  DS    XL1     Flags for rebuild information             13190000
*                             for a user.                          @LCA 13200000
QUASTRUSERALLOWAUTO EQU X'80' When ON, this field indicates that        13210000
*                             the user specified IXLCONN with           13220000
*                             ALLOWAUTO=YES.                       @LCA 13230000
QUASTRUSERSUSPEND EQU X'20'   When ON, the user specified               13240000
*                             IXLCONN ALLOWAUTO=YES SUSPEND=YES.        13250000
*                             See also QUASTRUSERSUSPENDFAIL.           13260000
*                             Valid only when QUASTRUSERALLOWAUTO       13270000
*                             is ON.  Applicable only when              13280000
*                             QUASTRUSERACT is ON.                 @0DC 13290000
QUASTRUSERSUSPENDFAIL EQU X'10'   When ON, the user specified           13300000
*                             IXLCONN with ALLOWAUTO=YES SUSPEND=               
*                             FAIL.  When both QUASTRUSERSUSPEND                
*                             and QUASTRUSERSUSPENDFAIL are OFF,                
*                             the user specified IXLCONN with                   
*                             SUSPEND=NO.  Valid only when                      
*                             QUASTRUSERALLOWAUTO is ON.                        
*                             Applicable only when QUASTRUSERACT                
*                             is ON.                               @0DA         
QUASTRUSERRSVD DS    CL11     Reserved                             @LCC 13310000
QUASTRUSERALTER DS   0CL4     Structure alter data as specified         13320000
*                             by connection via IXLCONN            @L6A 13330000
QUASTRUSERALTERFLG DS XL2     Structure alter flags                @L6A 13340000
QUASTRUSERALTERALLOWED EQU X'80' Structure alter allowed.               13350000
*                             IXLCONN specified with ALLOWALTER=YES     13360000
*                                                                  @L6A 13370000
QUASTRUSERALTERRATIO EQU X'40' Structure alter permits change to ratio. 13380000
*                             IXLCONN specified with RATIO=YES     @L6A 13390000
QUASTRUSERALTERMINENTRY DS FL1 Value specified on IXLCONN for           13400000
*                             MINENTRY                             @L6A 13410000
QUASTRUSERALTERMINELEMENT DS FL1 Value specified on IXLCONN for         13420000
*                             MINELEMENT                           @L6A 13430000
QUASTRUSERCONTOKEN  DS CL16   Contoken for the user.                    13440000
*                             This is always the original               13450000
*                             contoken returned on IXLCONN.             13460000
*                             The temporary contoken returned           13470000
*                             on IXLCONN REBUILD is not                 13480000
*                             returned.                            @DGA 13490000
QUASTRUSERALTER2 DS   0CL4    More structure alter data as specified    13500000
*                             by connection via IXLCONN            @05A 13510000
QUASTRUSERALTERMINEMC     DS 1FL1 Value specified on IXLCONN for        13520000
*                        MINEMC.                                   @05A 13530000
                DS    CL3     Reserved                                  13540000
QUASTRUSERRSVD2 DS 1CL008  Reserved                                     13550000
QUASTRUSERLENG EQU   *-QUASTRUSER                                  @L6C 13560000
         AIF   ('&DSECT' EQ 'NO').L0082                                 13570000
QUASTRUSER1  DSECT                                                      13580000
         AGO   .L0083                                                   13590000
.L0082   ANOP                                                           13600000
QUASTRUSER1  DS    0D                                                   13610000
.L0083   ANOP                                                           13620000
         DS    1CL0136   Mapped by QUASTRUSER                           13630000
QUASTRUSERDISCFAILEDCONFSTRING DS 1CL0032 User's current               *13640000
                         disconnect/failure confirm string. Valid only *13650000
                         for unserialized structures                    13660000
         DS    1CL0088   Reserved                                       13670000
QUASTRUSER1_LEN EQU *-QUASTRUSER1                                       13680000
.IXCYQUAA81    ANOP                                                @L2A 13690000
               AIF   ('&STRSYS' EQ 'NO').IXCYQUAA75                @LDA 13700000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA23                 @LDA 13710000
QUASTRSYS      DSECT                                               @LDA 13720000
               AGO   .IXCYQUAA24                                   @LDA 13730000
.IXCYQUAA23    ANOP                                                @LDA 13740000
QUASTRSYS      DS    0D       QUAA data for system-specific             13750000
*                             information for specified structure  @LDA 13760000
.IXCYQUAA24    ANOP                                                @LDA 13770000
QUASTRSYSTYP    DS    X       X'25' System-info structure record,       13780000
*                             X'A5' Last system-info structure          13790000
*                                   record.                        @LDA 13800000
QUATYPSTRSYS    EQU   37      Record Type System-info Structure    @LDA 13810000
QUATYPSTRSYS_LAST EQU 165     Record Type Last System-info Struct. @LDA 13820000
                DS    X       Reserved X'00'                       @LDA 13830000
QUASTRSYSLEN    DS    H       Length of record                     @LDA 13840000
QUASTRSYSNAME   DS    CL8     System name                          @LDA 13850000
QUASTRSYSSID    DS    0XL4    System token                         @LDA 13860000
QUASTRSYSNUM    DS    XL1     System slot number                   @LDA 13870000
                DS    XL3     Reserved - DO NOT USE                @LDA 13880000
QUASTRSYSFLAGS  DS   0BL4     System-related flags                 @LDA 13890000
QUASTRSYSFLAGS1 DS X          First byte of flags                  @LDA 13900000
QUASTRSYSALLOCATING EQU X'80' This system is in the process of          13910000
*                             allocating the new structure during       13920000
*                             the allocate phase of a system-           13930000
*                             managed process (e.g., rebuild)      @LDA 13940000
QUASTRSYSATTACHING EQU X'40'  This system is in the process of          13950000
*                             attaching connectors to the new           13960000
*                             structure during the attach phase         13970000
*                             of a system-managed process (e.g.,        13980000
*                             rebuild)                             @LDA 13990000
QUASTRSYSATTACHED EQU X'20'   This system has successfully              14000000
*                             attached connectors to the new            14010000
*                             structure during the attach phase         14020000
*                             of a system-managed process (e.g.,        14030000
*                             rebuild)                             @LDA 14040000
QUASTRSYSCOPYWORKING EQU X'10' This system is participating in          14050000
*                             the copy phase of a system-managed        14060000
*                             process (e.g., rebuild)              @LDA 14070000
QUASTRSYSCOPYFAILED EQU X'08' This system was participating in          14080000
*                             the copy phase of a system-managed        14090000
*                             process (e.g., rebuild), but has          14100000
*                             failed.                              @LDA 14110000
QUASTRSYSCOPYSTOPPING EQU X'04' This system is participating in         14120000
*                             the copy stop phase of a system-          14130000
*                             managed process (e.g., rebuild), and      14140000
*                             is stopping the copy process.        @LDA 14150000
QUASTRSYSCOPYSTOPPED EQU X'02' This system was participating in         14160000
*                             the copy stop phase of a system-          14170000
*                             managed process (e.g., rebuild), and      14180000
*                             has now stopped.                     @LDA 14190000
QUASTRSYSFLAGS2 DS X          Second byte of flags                 @LDA 14200000
QUASTRSYSFLAGS3 DS X          Third byte of flags                  @LDA 14210000
QUASTRSYSFLAGS4 DS X          Fourth byte of flags                 @LDA 14220000
         DS    1CL0044        Reserved                             @LDA 14230000
QUASTRSYS_LEN EQU *-QUASTRSYS                                      @LDA 14240000
.IXCYQUAA75    ANOP                                                @LDA 14250000
               AIF   ('&ARMS' EQ 'NO').IXCYQUAA79                  @L4A 14260000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA17                 @L4A 14270000
QUAARMS        DSECT                                               @L4A 14280000
               AGO   .IXCYQUAA18                                   @L4A 14290000
.IXCYQUAA17    ANOP                                                @L4A 14300000
QUAARMS        DS    0D       QUAA data for ARM element status     @L4A 14310000
.IXCYQUAA18    ANOP                                                @L4A 14320000
QUAARMSTYP      DS    X       X'30' ARM element status record,          14330000
*                             X'B0' Last ARM element status record @L4A 14340000
QUATYPARMS      EQU   48      Record Type ARM Element Status       @L4A 14350000
QUATYPARMS_LAST EQU   176     Record Type Last ARM Element Status  @L4A 14360000
                DS    X       Reserved X'00'                       @L4A 14370000
QUAARMSLEN      DS    H       Length of record                     @L4A 14380000
QUAARMSELEMENT  DS    CL16    Element name                         @L4A 14390000
QUAARMSINITSYS  DS    CL8     Name of system on which the element       14400000
*                             initially registered with ARM.  This      14410000
*                             will either be the first registration     14420000
*                             or the first registration after the       14430000
*                             element was deregistered (either          14440000
*                             explicitly or by ARM).               @L4A 14450000
QUAARMSCURRSYS      DS  CL8   Name of system on which the element       14460000
*                             is now running (or most recently ran if   14470000
*                             the element state is FAILED)              14480000
*                                                                  @L4A 14490000
QUAARMSINITCLONE    DS  CL2   Clone ID of system on which the element   14500000
*                             initially registered.                @L4A 14510000
                DS      CL2   Reserved                             @DFC 14520000
QUAARMSTOTELEMENTS  DS  F     The total number of Elements that are     14530000
*                             currently registered with ARM        @DFA 14540000
QUAARMSMAXELEMENTS  DS  F     The maximum number of Elements that are   14550000
*                             able to be registered with ARM       @DFA 14560000
                DS      CL32  Reserved                             @DFC 14570000
QUAARMSJESGROUP     DS  CL8   Name of JESGROUP to which this element    14580000
*                             belongs and under which this element runs 14590000
*                             Blank if element registered with          14600000
*                             ELEMBIND=CURSYS                      @LFC 14610000
QUAARMSRESTARTGROUP DS  CL16  Name of the restart group to which        14620000
*                             this element belongs based on the         14630000
*                             current policy                       @P9C 14640000
QUAARMSJOBNAME      DS  CL8   Name of the address space under which the 14650000
*                             element registered.                  @LFC 14660000
*                             Flags QUAARMSBATCHJOB and                 14670000
*                             QUAARMSSTARTEDTSK indicate whether this   14680000
*                             name is of a job or a started task.  @L4A 14690000
QUAARMSSTOKEN       DS  CL8   STOKEN for the address space under which  14700000
*                             the element last registered.         @LFC 14710000
QUAARMSASID         DS  H     ASID for the address space under which    14720000
*                             the element last registered.         @LFC 14730000
QUAARMSLEVEL        DS  H     Level number for this element, determined 14740000
*                             by ELEMTYPE on the register request       14750000
*                             and by LEVEL specified in the current     14760000
*                             policy.                              @L4A 14770000
QUAARMSELEMTYPE     DS  CL8   Element type specified on the register    14780000
*                             request (Will be blanks if type not       14790000
*                             specified on register request)       @L4A 14800000
QUAARMSFLAGS        DS  0XL4  Flags for ARM and element status     @L4A 14810000
QUAARMSSTATEFLAGS   DS  XL1   Flags for element status             @L4A 14820000
QUAARMSSTARTING     EQU X'80' Element is starting                  @L4A 14830000
QUAARMSAVAILABLE    EQU X'40' Element is available                 @L4A 14840000
QUAARMSFAILED       EQU X'20' Element is failed                    @L4A 14850000
QUAARMSRSTING       EQU X'10' Element is restarting                @L4A 14860000
QUAARMSRCVING       EQU X'08' Element is recovering                @L4A 14870000
QUAARMSGENFLAGS     DS  XL1   Flags for general ARM data           @L4A 14880000
QUAARMSENABLED      EQU X'80' ARM restarts are presently enabled in     14890000
*                             the sysplex.                         @L4A 14900000
QUAARMSFDSWARNING   EQU X'40' All ARM systems are not currently         14910000
*                             connected to the FDS.  Data may not       14920000
*                             be current.                          @L4A 14930000
QUAARMSFLAGS3       DS  XL1   Flags for element information        @L4A 14940000
QUAARMSBATCHJOB     EQU X'80' Element is a batch job               @L4A 14950000
QUAARMSSTARTEDTSK   EQU X'40' Element is a started task            @L4A 14960000
QUAARMSBACKING      EQU X'20' This element is backing up the element    14970000
*                             specified by QUAARMSASSOCELEMENT.  It is  14980000
*                             the issuer of an Associate request.  @L4A 14990000
QUAARMSBACKED       EQU X'10' This element is being backed up by the    15000000
*                             element specified by QUAARMSASSOCELEMENT. 15010000
*                             It is the target element of an Associate  15020000
*                             request.                             @L4A 15030000
QUAARMSOVERRIDEJCL  EQU X'08' This element has override JCL to be       15040000
*                             used for restarts.  The override JCL      15050000
*                             dataset name is specified in the          15060000
*                             current policy via RESTART_METHOD.   @L4A 15070000
QUAARMSOVERRIDESTART EQU X'04' This element has override command text   15080000
*                             to be used for restarts.  The override    15090000
*                             command text may be specified in the      15100000
*                             current policy via RESTART_METHOD or      15110000
*                             on a Register request via STARTTXT   @L4A 15120000
QUAARMSTIMEDOUT      EQU X'02' This element has become available due    15130000
*                             to a Ready Timeout.                  @DFA 15140000
QUAARMSTERMTYPEALLTERM EQU X'01' TERMTYPE=ALLTERM is in effect     @LFA 15150000
*                                                                  @LFA 15160000
QUAARMSFLAGS4       DS  XL1   Flags for more Element Information   @L4A 15170000
QUAARMSNORESTART    EQU X'80' Current policy prohibits an ARM restart   15180000
*                             of this element.  Restart_Attempts is     15190000
*                             zero.                                @L4A 15200000
QUAARMSNOSYSRESTART EQU X'40' Element is prohibited to restart on       15210000
*                             another system.  This is determined by    15220000
*                             the TERMTYPE values specified in the      15230000
*                             current policy and on the Register        15240000
*                             request.                             @L4A 15250000
QUAARMSTERMTYPEELEMTERM EQU X'40' TERMTYPE=ELEMTERM is in effect   @LFA 15260000
QUAARMSTERMTYPESYSTERM EQU X'20' TERMTYPE=SYSTERM is in effect     @LFA 15270000
*                              Value is determined from                 15280000
*                              TERMTYPE specification on the register   15290000
*                              request and TERMTYPE specification       15300000
*                              in the ARM policy.                       15310000
*                              On-> TERMTYPE specified is               15320000
*                              SYSTERM which prevents this              15330000
*                              element from being restarted on          15340000
*                              the system where it is                   15350000
*                              registered. This element will            15360000
*                              be restarted when the system it          15370000
*                              is registered on fails.                  15380000
*                              Off->Termination type does not           15390000
*                              prevent element from being restarted on  15400000
*                              the system where it is registered.  @LFA 15410000
QUAARMSELEMBINDCURSYS EQU X'10' On -> Element was registered with       15420000
*                               ELEMBIND=CURSYS.                        15430000
*                               Element has a minimum bind to the       15440000
*                               system on which it registered.  The     15450000
*                               job or started task in                  15460000
*                               QuaArmsJobName is not restarted when    15470000
*                               this element fails.                     15480000
*                               QuaArmsJobName only indicates the       15490000
*                               job or started task under which         15500000
*                               this element was registered, if any.    15510000
*                               Off -> Element does not have a          15520000
*                               minimum bind to the system on           15521000
*                               which it registered.               @LFA 15522000
QUAARMSRSTINGINFO EQU X'0F' QUAARMSRSTING qualifying information. These 15523000
*                        bits contain additional qualifying information 15524000
*                        for an element that is in a restarting state.  15525000
*                        NOTE: THIS INFORMATION IS ONLY PROVIDED ON     15526000
*                        THE SYSTEM WHERE THE ELEMENT IS BEING          15527000
*                        RESTARTED                                @PFA  15528000
QUAARMSRSTINGINERE EQU X'08' Element is in a restarting state.  The     15529000
*                          automatic restart manager has gotten to the  15529100
*                          point in restart processing where it calls   15529200
*                          the element restart exits(s).  No exits may  15529300
*                          have been called, an exit may be in          15529400
*                          control, or all exits may have returned.     15529500
*                          NOTE: THIS INFORMATION IS ONLY PROVIDED ON   15529600
*                          THE SYSTEM WHERE THE ELEMENT IS BEING        15529700
*                          RESTARTED @PFA                               15529800
QUAARMSRSTINGINEVE EQU X'04' Element is in a restarting state.  The     15529900
*                          element's event exit is currently in         15530000
*                          control or has returned control to ARM.      15530100
*                          NOTEs: 1) THIS INFORMATION IS ONLY PROVIDED  15530200
*                          ON THE SYSTEM WHERE THE ELEMENT IS BEING     15530300
*                          RESTARTED                                    15530400
*                          2) Unlike the QUAARMSRSTINGINERE bit, this   15530500
*                          bit is only set when the element has         15530600
*                          provided an Event Exit during                15530700
*                          registration.                      @PFA      15530800
QUAARMSRSTCOMMITED EQU X'02' Element is in a restarting state.  ARM has 15530900
*                          initiated the restart of the element by      15531000
*                          implementing the restart method.  NOTE:      15532000
*                          THIS INFORMATION IS ONLY PROVIDED ON THE     15533000
*                          SYSTEM WHERE THE ELEMENT IS BEING RESTARTED  15534000
*                          @PFA                                         15535000
QUAARMSREGTIME      DS  CL8   TOD Clock value when the element          15536000
*                             initially registered with ARM.  This      15537000
*                             will either be the first registration or  15538000
*                             the first registration after the          15539000
*                             element was deregistered (either          15540000
*                             explicitly or by ARM).               @L4A 15550000
QUAARMSFSTRSTRT     DS  CL8   TOD Clock value at the first restart,     15560000
*                             if this element has been restarted.  @L4A 15570000
QUAARMSLSTRSTRT     DS  CL8   TOD Clock value at most recent restart    15580000
*                             if this element has been restarted   @L4A 15590000
QUAARMSRESTARTCOUNTS DS 0CL12 Restart Count Fields                 @L4A 15600000
QUAARMSTOTALRESTARTS DS F     Total number of times the element has     15610000
*                             restarted since the element's initial     15620000
*                             registration                         @L4A 15630000
QUAARMSNUMRESTARTS  DS  H     Number of times the element has           15640000
*                             restarted in the past time interval       15650000
*                             specified in the current policy      @L4A 15660000
QUAARMSMAXRESTARTS  DS  H     Maximum number of restart attempts ARM    15670000
*                             will make in a given interval, as         15680000
*                             specified in the current policy      @L4A 15690000
QUAARMSRESTARTINT   DS  F     Interval (in seconds) over which the      15700000
*                             restarts are counted to determine if      15710000
*                             an element can be restarted, as           15720000
*                             specified in the current policy.     @L4A 15730000
QUAARMSEVENTEXITNAME DS CL8   Name of element's event exit routine.     15740000
*                             (Will be blanks if an element did not     15750000
*                             specify an event exit on the register     15760000
*                             request)                             @L4A 15770000
QUAARMSASSOCELEMENT DS  CL16  Name of the associated element, if one    15780000
*                             exists.  QUAARMSBACKING and QUAARMSBACKED 15790000
*                             flags can be used to determine if this    15800000
*                             element name is the primary element       15810000
*                             (target element on an Associate request)  15820000
*                             or the backup element (issuer of the      15830000
*                             Associate request).                  @L4A 15840000
QUAARMSASSOCSYSNAME DS  CL8   Name of system on which the associated    15850000
*                             element is running.                  @L4A 15860000
QUAARMSRESTARTTIMEOUT DS  F   Restart timeout interval used to          15870000
*                             determinte how long the Automatic Restart 15880000
*                             Manager should wait for the element to    15890000
*                             reregister after having been restarted    15900000
*                                                                  @PEC 15910000
QUAARMSREADYTIMEOUT  DS  F    Ready timeout interval used to determine  15920000
*                             how long the Automatic Restart Manager    15930000
*                             should wait for the element to become     15940000
*                             ready before automatically considering    15950000
*                             the element to be ready              @PDA 15960000
QUAARMSRESTARTPACING DS  F    Restart pacing interval used between the  15970000
*                             restart of each element in the restart    15980000
*                             group.  It is determined by the           15990000
*                             RESTART_PACING interval in the policy     16000000
*                                                                  @PDA 16010000
QUAARMSFREECSA       DS  F    The number of kilobytes of CSA that must  16020000
*                             available on the target system for this   16030000
*                             restart group to be restarted.       @PDA 16040000
QUAARMSFREEECSA      DS  F    The number of kilobytes of ECSA that must 16050000
*                             available on the target system for this   16060000
*                             restart group to be restarted.       @PDA 16070000
QUAARMSRMTOKEN      DS  CL16  RMtoken identifying this             @LFA 16080000
*                             registration. Same as                     16090000
*                             returned by the RMTOKEN keyword           16100000
*                             on the register request, if               16110000
*                             specified.                                16120000
QUAARMSRSVD         DS  CL16  Reserved                             @PDC 16130000
*                                                                       16140000
*                                                                       16150000
QUAARMSLENG    EQU   *-QUAARMS                                     @L4A 16160000
.IXCYQUAA79    ANOP                                                @L4C 16170000
               AIF   ('&FEATURES' EQ 'NO').IXCYQUAA77              @03A 16180000
               AIF   ('&DSECT' EQ 'NO').IXCYQUAA19                 @03A 16190000
QUREQFEATURES DSECT      Data for Query REQINFO=FEATURES           @03A 16200000
               AGO   .IXCYQUAA21                                   @03A 16210000
.IXCYQUAA19    ANOP                                                @03A 16220000
QUREQFEATURES  DS 0X     Data for Query REQINFO=FEATURES           @03A 16230000
.IXCYQUAA21    ANOP                                                @03A 16240000
QUREQFEATURES1 DS 1BL4   First word of Features flags              @0CC 16250004
         ORG   QUREQFEATURES1                                      @0CA 16251004
QUREQFEATURES1A DS 1BL1                                            @0CA 16252004
         ORG   QUREQFEATURES1A                                     @0CA 16253004
QUREQRFPROXYRESPONSE EQU X'80' ProxyResponse Feature is available for  *16260000
                         IXLUSYNC, IXLEERSP REQUEST=REBLDCOMPLETE and  *16270000
                         IXLEERSP REQUEST=REBLDSTOP                    *16280000
                                                                   @03A 16290000
QUREQRFUSYNCCOMPCODE EQU X'40' IXLUSYNC COMPCODE function is available *16300000
                         on this system                            @04A 16310000
QUREQRFREBUILDPCTLOSSCONN EQU X'40' Percent lossconn is available for  *16320000
                         rebuild events on this system             @04A 16330000
QUREQRFREBUILDDUPLEX EQU X'20' Duplexing rebuild support for           *16340000
                         user-managed duplexing is available on this   *16350000
                         system                                         16360000
QUREQRFIXLMGHWSTATCF EQU X'10' HWSTATISTICS(CF) for IXLMG is supported *16370000
                         on this system                            @LBA 16380000
QUREQRFIXLRTRDATATYPE EQU X'08' IXLRT RDATATYPE function is available  *16390000
                         on this system                            @07A 16400000
QUREQRFIXLCONNSUSPENDFAIL EQU X'04' IXLCONN SUSPEND(FAIL) is           *        
                         supported on this system                  @0DA         
QUREQRFRETURNRDATATYPE EQU X'02' IXLRT support to return the RDATATYPE *16410000
                         for record data entries that are read is      *16411000
                         available on this system                  @0AA 16412000
QUREQRFDEMEBUFFERSIZE EQU X'01' DELETE_ENTRYLIST and MOVE_ENTRYLIST    *        
                         buffer size requirements relaxation available *        
                         on this system                            @0EA         
         ORG   QUREQFEATURES1A+X'00000001'                         @0CA 16413004
QUREQFEATURES1B DS 1BL1                                            @0CA 16414004
         ORG   QUREQFEATURES1B                                     @0CA 16415004
QUREQRFDETAILEDXCFSTATUS EQU X'80' IXCMG TYPE=MEMBER and AMDALEVEL=1   *16416004
                         support is available on this system.      @0CA 16417004
         ORG   QUREQFEATURES1B+X'00000001'                         @0CA 16418004
QUREQFEATURES1C DS 1BL1  Reserved                                  @0CA 16419004
QUREQFEATURES1D DS 1BL1  Reserved                                  @0CA 16420004
         DS    1CL0028   Reserved                                  @03A 16430000
.IXCYQUAA77    ANOP                                                @L4C 16440000
               AIF   (&QUAARSN).IXCYQUAA89                         @D5A 16450000
&QUAARSN       SETB  1                                             @D5A 16460000
******************************************************************      16470000
*                                                                       16480000
*  Constants defining reason codes by return code                       16490000
*                                                                       16500000
******************************************************************      16510000
*  reason code for return code = X'04' (warning)                        16520000
******************************************************************      16530000
*                                                                       16540000
QUAARSNRECORDSREMAIN    EQU X'00000004' Reason code for                 16550000
*                             IXCQUERY completed successfully and       16560000
*                             provided some data, however, ANSAREA      16570000
*                             is too small to contain all the           16580000
*                             requested data                       @D5A 16590000
******************************************************************      16600000
*  reason code for return code = X'08' (invalid parameters)             16610000
******************************************************************      16620000
*                                                                       16630000
QUAARSNGROUPNOTFOUND    EQU X'00000004' Reason code for                 16640000
*                             the group name specified is not           16650000
*                             defined to XCF.                      @D5A 16660000
QUAARSNREQINFONOTVALID  EQU X'00000008' Reason code for                 16670000
*                             the REQINFO information is not valid.     16680000
*                                                                  @D5A 16690000
QUAARSNREQTYPEINCOR     EQU X'0000000C' Reason code for                 16700000
*                             the caller specified the REQTYPE          16710000
*                             control paramter incorrectly.        @D5A 16720000
QUAARSNMEMBERNOTFOUND   EQU X'00000010' Reason code for                 16730000
*                             the member name specified is not          16740000
*                             defined within the specified group.  @D5A 16750000
QUAARSNANSAREATOOSMALL  EQU X'00000014' Reason code for                 16760000
*                             the length the caller specified on        16770000
*                             ANSLEN is too small to contain even       16780000
*                             the header.                          @D5A 16790000
QUAARSNANSAREANOACCESS  EQU X'00000018' Reason code for                 16800000
*                             XCF cannot access ANSAREA.           @D5A 16810000
QUAARSNANSALETNOTVALID  EQU X'0000001C' Reason code for                 16820000
*                             the ALET that qualifies the address       16830000
*                             of the ANSAREA is neither zero nor        16840000
*                             is it associated with a valid public      16850000
*                             entry on the DU-AL.                  @D5A 16860000
QUAARSNCFNOTFOUND       EQU X'00000020' Reason code for                 16870000
*                             the coupling facility name                16880000
*                             specified is not                          16890000
*                             defined in CFRM active policy.       @D5A 16900000
QUAARSNSTRNOTFOUND      EQU X'00000024' Reason code for                 16910000
*                             the structure name specified is not       16920000
*                             defined in CFRM active policy.       @D5A 16930000
QUAARSNARMNAMENOTFOUND  EQU X'00000028' Reason code for                 16940000
*                             there are no elements with the specified  16950000
*                             element name, restart group name, or      16960000
*                             job name. Only returned if                16970000
*                             IXCQUERY request (REQINFO) is for         16980000
*                             ARMSTATUS.                           @L4A 16990000
QUAARSNAMODE24          EQU X'00000034' Reason code for the macro       17000000
*                             was issued in 24-bit addressing mode.     17010000
*                                                                  @L4A 17020000
QUAARSNBADPLISTRSVD     EQU X'00000040' Reason code for                 17030000
*                             a reserved field in the control           17040000
*                             parameter list is not zero. Your          17050000
*                             program might have inadvertently          17060000
*                             written over an area in the control       17070000
*                             parameter list.                      @D5A 17080000
QUAARSNINVR0            EQU X'000000A0' Reason code for register        17090000
*                             zero value is not valid.  Only returned   17100000
*                             if REQINFO is for ARMSTATUS or            17110000
*                             ARMS_ALLDATA.                        @L4A 17120000
QUAARSNR0TYPECONFL      EQU X'000000A4' reason code for register zero   17130000
*                             value is not correct for the requested    17140000
*                             function. Only returned if REQINFO is     17150000
*                             for ARMSTATUS or ARMS_ALLDATA        @L4A 17160000
QUAARSNPLISTALETNOTVALID EQU X'00000100' Reason code for                17170000
*                             the ALET that qualifies the address       17180000
*                             of the control parameter list is          17190000
*                             neither zero nor is it associated with    17200000
*                             a valid public entry on the DU-AL.   @D5A 17210000
QUAARSNVERSIONNOTVALID  EQU X'00000104' Reason code for                 17220000
*                             the version number in the control         17230000
*                             parameter list is not valid. Your         17240000
*                             program might have inadvertently written  17250000
*                             over an area in the control parameter     17260000
*                             list.                                @D5A 17270000
QUAARSNFUNCCODENOTVALID EQU X'00000108' Reason code for                 17280000
*                             the function code in the control          17290000
*                             parameter list is not valid. Your         17300000
*                             program might have inadvertently written  17310000
*                             over an area in the control parameter     17320000
*                             list.                                @D5A 17330000
QUAARSNPLISTNOACCESS    EQU X'0000010C' Reason code for                 17340000
*                             XCF could not access the control          17350000
*                             parameter list.                      @D5A 17360000
QUAARSNNOTTASKMODE      EQU X'00000118' Reason code for                 17370000
*                             the caller is not in task mode.      @D5A 17380000
QUAARSNNOTENABLED       EQU X'0000011C' Reason code for                 17390000
*                             the caller is not enabled.           @D5A 17400000
QUAARSNHASLOCK          EQU X'00000120' Reason code for the caller is   17410000
*                             holding a lock.                      @L4A 17420000
QUAARSNHASEUTFRR        EQU X'00000124' Reason code for the caller is   17430000
*                             running under an EUT FRR.            @L4A 17440000
QUAARSNQUAALEVELNOTVALID EQU X'00000128' Reason code for the caller     17450000
*                        has specified an invalid value for QUAALEVEL   17460000
******************************************************************      17470000
*  reason code for return code = X'0C' (environmental error)            17480000
******************************************************************      17490000
*                                                                       17500000
QUAARSNDSPSERVFAIL      EQU X'00000004' Reason code for                 17510000
*                             XCF could not create a data space for     17520000
*                             IXCQUERY request (REQINFO) CF,            17530000
*                             CF_ALLDATA, STR, or STR_ALLDATA.     @D5A 17540000
QUAARSNALESERVFAIL      EQU X'00000008' Reason code for                 17550000
*                             XCF could not associate the data space    17560000
*                             created for IXCQUERY request (REQINFO)    17570000
*                             CF, CF_ALLDATA, STR, or STR_ALLDATA       17580000
*                             with the XCF address space.          @D5A 17590000
QUAARSNTASKABENDED      EQU X'00000018' Reason code for                 17600000
*                             while the issuing task was suspended      17610000
*                             for XCF processing, the task was          17620000
*                             abended (ie. another unit of work         17630000
*                             attempted to abnormally terminate this    17640000
*                             task). No data was returned in the        17650000
*                             ANSAREA. This only applies to IXCQUERY    17660000
*                             requests REQINFO=GROUP,REQTYPE=DEFER.     17670000
*                                                                  @D5A 17680000
QUAARSNNOCFRMDSN        EQU X'00000144' Reason code for                 17690000
*                             the CFRM active policy could not be       17700000
*                             read because the couple data set          17710000
*                             supporting TYPE CFRM is not accessible    17720000
*                             to this system. Only returned if          17730000
*                             IXCQUERY request (REQINFO) is for CF,     17740000
*                             CF_ALLDATA, STR, or STR_ALLDATA.     @D5A 17750000
QUAARSNNOCFRMPOL        EQU X'00000154' Reason code for                 17760000
*                             a CFRM policy has not been activated.     17770000
*                             Only returned if IXCQUERY request         17780000
*                             (REQINFO) is for CF, CF_ALLDATA,          17790000
*                             STR, or STR_ALLDATA.                 @D5A 17800000
QUAARSNFAILCFRMREAD     EQU X'0000015C' Reason code for                 17810000
*                             the CFRM active policy could not be       17820000
*                             read because the couple data set          17830000
*                             supporting TYPE CFRM is in error. Only    17840000
*                             returned if IXCQUERY request (REQINFO)    17850000
*                             is for CF, CF_ALLDATA, STR, or            17860000
*                             STR_ALLDATA.                         @D5A 17870000
QUAARSNNOARMDSN         EQU X'00000160' Reason code for                 17880000
*                             the ARM data could not be read because    17890000
*                             the couple data set supporting            17900000
*                             TYPE ARM is not accessible to this        17910000
*                             system. Only returned if IXCQUERY         17920000
*                             request (REQINFO) is for ARMSTATUS or     17930000
*                             ARMS_ALLDATA.                        @L4A 17940000
QUAARSNFAILARMREAD      EQU X'00000164' Reason code for the ARM data    17950000
*                             could not be read because the couple      17960000
*                             data set supporting TYPE ARM is in        17970000
*                             error. Only returned if IXCQUERY          17980000
*                             request (REQINFO) is for ARMSTATUS or     17990000
*                             ARMS_ALLDATA.                        @L4A 18000000
.IXCYQUAA89    ANOP                                                @D5A 18010000
         MEND                                                           18020000
* */  IXCYQUAA20: ;                                                     18030000
*%IF QUAA_ALET = '' %THEN  /*                                        */ 18040000
*  %QUAA_ALET = '0';       /*                                        */ 18050000
*%QUAA_VIA='';                                                          18060000
*%IF QUAA_ALET^='0' %THEN                                               18070000
*  %QUAA_VIA='VIA(QUAA_ALET)';                                          18080000
*   DECLARE                                                             18090000
*     1    QUAHDR   BASED QUAA_VIA, /* Header section                */ 18100000
*      2    QUAH#REC FIXED(32),     /* Number of QUASYS, QUAGRP,        18110000
*                                      QUAMEM, QUACF, QUASTR, or        18120000
*                                      QUAARMS records which follow.    18130000
*                                      Note: this field is zero with    18140000
*                                      zero return code, when the       18150000
*                                      service could not find any       18160000
*                                      records.                      */ 18170000
*      2    QUAH#REM FIXED(32),     /* Number of QUASYS, QUAGRP,        18180000
*                                      QUAMEM, QUACF, QUASTR, or        18190000
*                                      QUAARMS records which were not   18200000
*                                      returned because of              18210000
*                                      insufficient space            */ 18220000
*      2    QUAHTLEN FIXED(32),     /* Total length of answer area      18230000
*                                      needed to contain all the        18240000
*                                      requested information. This      18250000
*                                      includes the area for the        18260000
*                                      records that were returned on    18270000
*                                      this call.                    */ 18280000
*      2    QUAHSGOF FIXED(32);     /* Offset from QUAHDR to the first  18290000
*                                      data record.              @P2C*/ 18300000
*                                                                       18310000
*   /*****************************************************************/ 18320000
*   /*                                                               */ 18330000
*   /* QUAA System Data                                              */ 18340000
*   /*                                                               */ 18350000
*   /* WARNING! You must use the QUASLEN to determine the size of    */ 18360000
*   /* QUASYS that is presented. This size can change at any time    */ 18370000
*   /* due to new XCF support or service.                        @L7A*/ 18380000
*   /*                                                               */ 18390000
*   /*****************************************************************/ 18400000
*                                                                       18410000
*   DECLARE                                                             18420000
*     1    QUASYS   BASED QUAA_VIA, /* SYSPLEX Record data format    */ 18430000
*      2    QUASTYPE BIT(8),        /* X'02' sysplex record, X'82'      18440000
*                                      last sysplex record           */ 18450000
*      2    *        BIT(8),        /* Reserved X'00'                */ 18460000
*      2    QUASLEN  FIXED(16),     /* Length of sysplex record      */ 18470000
*      2    QUASNAME CHAR(8),       /* System name                   */ 18480000
*      2    QUASINTV FIXED(32),     /* Monitor interval, in             18490000
*                                      hundredths of seconds. This      18500000
*                                      parameter is specified at IPL    18510000
*                                      time.                         */ 18520000
*      2    QUASOPIN FIXED(32),     /* Operator interval, in            18530000
*                                      hundredths of seconds. This      18540000
*                                      parameter is specified at IPL    18550000
*                                      time.                         */ 18560000
*      2    QUASSUTO BIT(64),       /* Status-update TOD value       */ 18570000
*      2    QUASSTAT BIT(32),       /* System Status                 */ 18580000
*       3    *        BIT(1),       /* Reserved              @YA43990*/ 18590000
*       3    QUASACTV BIT(1),       /* Active                        */ 18600000
*       3    QUASSUM  BIT(1),       /* Status-update missing detected*/ 18610000
*       3    QUASSYPT BIT(1),       /* In sysplex partitioning       */ 18620000
*       3    QUASLOCL BIT(1),       /* Single system, no coupling       18630000
*                                      dataset, sysplex              */ 18640000
*       3    QUASCLUP BIT(1),       /* System has completed sysplex     18650000
*                                      partitioning but is still in     18660000
*                                      the process of cleanup.   @D2A*/ 18670000
*      2    QUASSID  FIXED(32),     /* System token                  */ 18680000
*       3    QUASNUM  FIXED(8),     /* System slot number            */ 18690000
*       3    *        FIXED(24),    /* Reserved - do not use         */ 18700000
*      2    QUASVER  FIXED(8),      /* System version number     @P7A*/ 18710000
*      2    QUASCLID CHAR(2),       /* System Clone ID           @L5A*/ 18720000
*      2    QUASCLST BIT(8),        /* System Clone ID status    @L5A*/ 18730000
*       3   QUASCLNU BIT(1),        /* Clone ID uniqueness bit   @L5A*/ 18740000
*       3    *       BIT(7);        /* Reserved                  @L5A*/ 18750000
*                                                                       18760000
*   DECLARE                                                             18770000
*     1    QuaSys1  Based Quaa_Via,  /* Sysplex record data format for  18780000
*                                       QUAA level 1             @LIA*/ 18790000
*       3    * Char(Length(QuaSys)), /* Mapped by QuaSys         @LIA*/ 18800000
*       3    QuasFlags Bit(8),       /* Flag bits                @LIA*/ 18810000
*         5    *        Bit(7),      /* Reserved                 @LIA*/ 18820000
*         5    QuasLpar Bit(1),      /* 1 = system is a LPAR PR/SM      18830000
*                                       system and is not running under 18840000
*                                       VM. QuaaLparNum contains valid  18850000
*                                       data.                           18860000
*                                       0 = system is not a LPAR PR/SM  18870000
*                                       system or is running under VM   18880000
*                                       and any data in QuaaLparNum is  18890000
*                                       not valid.               @PMC*/ 18900000
*       3    QuasLparNum Fixed(8),   /* LPAR number of the system       18910000
*                                       within the CPC. Only valid when 18920000
*                                       QuasLpar is on           @LIA*/ 18930000
*       3    QuasCpuId     Char(4),  /* CPUID of the CPC         @LIA*/ 18931000
*         5    QuasSerialNum Char(2),   /* Serial number of the CPC     18932000
*                                                                @LIA*/ 18933000
*         5    QuasModelNum Char(2),   /* Model number of the CPC       18934000
*                                                                @LIA*/ 18935000
*       3    *            Char(18);  /* Reserved                 @LIA*/ 18936000
*                                                                       18937000
*   /*****************************************************************/ 18938000
*   /*                                                               */ 18939000
*   /* QUAA Group Data                                               */ 18939100
*   /*                                                               */ 18939200
*   /* WARNING! You must use the QUAGLEN to determine the size of    */ 18939300
*   /* QUAGRP that is presented. This size can change at any time    */ 18939400
*   /* due to new XCF support or service.                        @L7A*/ 18939500
*   /*                                                               */ 18939600
*   /*****************************************************************/ 18939700
*                                                                       18939800
*   DECLARE                                                             18939900
*     1    QUAGRP   BASED QUAA_VIA, /* Group record data format      */ 18940000
*      2    QUAGTYPE BIT(8),        /* X'00' group record, X'80' last   18950000
*                                      group record                  */ 18960000
*      2    *        BIT(8),        /* Reserved X'00'                */ 18970000
*      2    QUAGLEN  FIXED(16),     /* Length of group record        */ 18980000
*      2    QUAGNAME CHAR(8),       /* Group name                    */ 18990000
*      2    QUAG#MEM FIXED(31),     /* Number of members in the group*/ 19000000
*      2    QuagFlag1 CHAR(1),      /*                           @0CC*/ 19010001
*         3   QuagStalled bit,      /* Indicates whether XCF considers  19011000
*                                      any members of the group to be   19012000
*                                      stalled with respect to the XCF  19013000
*                                      processing that they perform.    19014000
*                                      The condition is recognized only 19015000
*                                      for members active on the system 19016000
*                                      where the IXCQUERY is executed.  19017000
*                                      Equals '0'B if no such member is 19018000
*                                      considered stalled, '1'B if at   19019000
*                                      least one such member is         19019100
*                                      considered stalled.  A member is 19019200
*                                      considered stalled, for example, 19019300
*                                      if its message exit routine does 19019400
*                                      not return to XCF in a timely    19019500
*                                      fashion.                  @0CA*/ 19019601
*         3   * bit(7),             /* Reserved.                 @0CA*/ 19019701
*      2    * char(3);              /* Reserved.                 @0CC*/ 19019801
*                                                                       19020000
*   /*****************************************************************/ 19030000
*   /*                                                               */ 19040000
*   /* QUAA Member Data                                              */ 19050000
*   /*                                                               */ 19060000
*   /* WARNING! You must use the QUAMLEN to determine the size of    */ 19070000
*   /* QUAMEM that is presented. This size can change at any time    */ 19080000
*   /* due to new XCF support or service.                        @L7A*/ 19090000
*   /*                                                               */ 19100000
*   /*****************************************************************/ 19110000
*                                                                       19120000
*   DECLARE                                                             19130000
*     1    QUAMEM   BASED QUAA_VIA, /* Member record data format     */ 19140000
*      2    QUAMTYPE BIT(8),        /* X'01' member record, X'81'       19150000
*                                      last member record            */ 19160000
*      2    *        BIT(8),        /* Reserved X'00'                */ 19170000
*      2    QUAMLEN  FIXED(16),     /* Length of member record          19180000
*                                      (includes User State Field       19190000
*                                      length)                       */ 19200000
*      2    QUAMNAME CHAR(16),      /* Member name                   */ 19210000
*      2    QUAMTOKN BIT(64),       /* Member token                  */ 19220000
*      2    QUAMSTAT BIT(32),       /* Group services state          */ 19230000
*       3    QUAMSTA1 BIT(8),       /* Member State -                   19240000
*                                      2=CREATED, 3=ACTIVE,             19250000
*                                      4=QUIESCED, 5=FAILED          */ 19260000
*       3    QUAMSTA2 BIT(8),       /* Additional Member Status         19270000
*                                      information                   */ 19280000
*        4    QUAMSSSM BIT(1),      /* System Status Update Missing  */ 19290000
*        4    QUAMSTRM BIT(1),      /* System Going - System            19300000
*                                      Termination Started           */ 19310000
*        4    *        BIT(1),      /* Reserved                      */ 19320000
*        4    QUAMSMSM BIT(1),      /* Member Status Update Missing -   19330000
*                                      confirmed by member status       19340000
*                                      exit. Check QUAMUDAT value.   */ 19350000
*        4    QUAMSMSD BIT(1),      /* Member Status Update Missing -   19360000
*                                      member's status exit never ran*/ 19370000
*        4    *        BIT(1),      /* Reserved                  @D3C*/ 19380000
*        4    QUAMMREM BIT(1),      /* Monitoring has been removed      19390000
*                                      for this member               */ 19400000
*       3   QUAMSTA3 bit(8),        /* Additional status data    @0CA*/ 19410001
*        4    QuamStalled bit,      /* Indicates whether XCF considers  19411000
*                                      this group member to be stalled  19412000
*                                      with respect to the XCF          19413000
*                                      processing that it performs.     19414000
*                                      The condition is recognized only 19415000
*                                      for members active on the system 19416000
*                                      where the IXCQUERY is executed.  19417000
*                                      Equals '0'B if member is not     19418000
*                                      considered stalled, '1'B if the  19419000
*                                      member is considered stalled.  A 19419100
*                                      member is considered stalled,    19419200
*                                      for example, if its message exit 19419300
*                                      routine does not return to XCF   19419400
*                                      in a timely fashion.      @0CA*/ 19419501
*        4    * bit(7),             /* Reserved.                 @0CA*/ 19419601
*       3    *        BIT(8),       /* Reserved and set to 0     @0CC*/ 19419701
*      2    QUAMSYS  CHAR(8),       /* System name on which the         19420000
*                                      member was last active        */ 19430000
*      2    QUAMSID  FIXED(32),     /* System token for system on       19440000
*                                      which member was last active  */ 19450000
*       3    QUAMSNUM FIXED(8),     /* System slot number            */ 19460000
*       3    *        FIXED(24),    /* Reserved - do not use         */ 19470000
*      2    QUAMJOB  CHAR(8),       /* JOB, STC, MOUNT, or LOGON name   19480000
*                                      from the primary ASID current    19490000
*                                      at JOIN time                  */ 19500000
*      2    QUAMTOD  BIT(64),       /* Time stamp of last change to     19510000
*                                      member status                 */ 19520000
*      2    QUAMUSLN FIXED(32),     /* Length of User State Field,      19530000
*                                      set by JOIN or CREATE         */ 19540000
*      2    QUAMUSOF FIXED(32),     /* Offset from QUAMEM of user       19550000
*                                      state field.  The user state     19560000
*                                      field can be addressed by        19570000
*                                      ADDR(QUAMEM)+QUAMUSOF.  For      19580000
*                                      IXCQUERY, the area used by       19590000
*                                      QUAMEM must allow for the        19600000
*                                      maximum size of 32-bytes of the  19610000
*                                      user state field.  For IXCJOIN   19620000
*                                      or IXCCREAT, the area used by    19630000
*                                      QUAMEM only needs to allow for   19640000
*                                      the size of the user state field 19650000
*                                      as specified on the IXCJOIN or   19660000
*                                      IXCCREAT macro.  QUAMUSLN        19670000
*                                      contains the length of the user  19680000
*                                      state field established by the   19690000
*                                      IXCJOIN or IXCCREAT macro.    */ 19700000
*      2    QUAMINTV FIXED(32),     /* Interval specified by IXCJOIN.   19710000
*                                      Could be changed through         19720000
*                                      IXCMOD.                       */ 19730000
*      2    QUAMUDAT CHAR(4),       /* User Data returned by member     19740000
*                                      status exit.  Contains user data 19750000
*                                      from Member Status Update        19760000
*                                      Missing confirmation if QUAMSMSM 19770000
*                                      is on.  Contains user data from  19780000
*                                      Member Status Update Resumed     19790000
*                                      confirmation if QUAMSMSM is off  19800000
*                                      and the user data is not zero.   19810000
*                                      If zero and QUAMSMSM is off,     19820000
*                                      then it is unclear if the status 19830000
*                                      exit returned a zero user data   19840000
*                                      value. Invalid if QUAMMREM or    19850000
*                                      QUAMSMSD is on.                  19860000
*                                                                @P3A*/ 19870000
*      2    QUAMSTKN CHAR(8),       /* Member STOKEN             @L1A*/ 19880000
*      2    QuamProtocols BIT(32),  /* Protocols that are supported for 19890000
*                                      the member.  Individual flags    19900000
*                                      are '1'B if the protocol is      19910000
*                                      supported, '0'B if not.   @L8A*/ 19920000
*       3     QuamProCanReceive bit(1), /* The member supplied a        19930000
*                                      MSGEXIT routine when it invoked  19940000
*                                      IXCJOIN to join its group.       19950000
*                                      The member is capable of         19960000
*                                      receiving messages.       @L8A*/ 19970000
*       3     QuamProCanReply bit(1), /* The member specified YES for   19980000
*                                      CANREPLY keyword when it invoked 19990000
*                                      IXCJOIN to join its group.       20000000
*                                      The member claims to be able to  20010000
*                                      participate in the XCF managed   20020000
*                                      response collection protocol.    20030000
*                                                                @L8A*/ 20040000
*       3     QuamProResponseCollection bit(1), /* The system on which  20050000
*                                      the member resides supports XCF  20060000
*                                      managed response collection.     20070000
*                                                                @L8A*/ 20080000
*       3     QuamProOrderedDelivery bit(1), /* The system on which the 20090000
*                                      member resides supports          20100000
*                                      ordered message delivery. @L8A*/ 20110000
*       3     QuamProGT61KDelivery    bit(1), /* The system on which    20120000
*                                      the member resides supports      20130000
*                                      delivery of messages <= 128M     20140000
*                                      bytes in length           @LGA*/ 20150000
*       3     QuamProGT61KMsg bit(1), /* The member specified           20160000
*                                      YES for the GT61KMSG keyword     20170000
*                                      when it invoked IXCJOIN to join  20180000
*                                      its group.  The member claims to 20190000
*                                      be able to receive messages <=   20200000
*                                      128 megabytes in length.  @LGA*/ 20210000
*       3     * bit(26),            /* Reserved.                 @LGC*/ 20220000
*      2    *        CHAR(4);       /* Reserved                  @L8C*/ 20230000
*   DECLARE                                                             20240000
*     QUAMUSTA CHAR(32) BASED QUAA_VIA; /* User State Field -           20250000
*                                      Addressed by ADDR(QUAMEM) +      20260000
*                                      QUAMUSOF. Length set by          20270000
*                                      CREATE/JOIN in QUAMUSLN.         20280000
*                                      Maximum length = 32.          */ 20290000
*                                                                       20300000
*   /*****************************************************************/ 20310000
*   /*                                                               */ 20320000
*   /* QUAA data for coupling facility                           @L2A*/ 20330000
*   /*                                                               */ 20340000
*   /* WARNING! You must use the QUACFLEN to determine the size of   */ 20350000
*   /* QUACF that is presented. This size can change at any time     */ 20351000
*   /* due to new XCF support or service.                        @L7A*/ 20352000
*   /*                                                               */ 20353000
*   /*****************************************************************/ 20354000
*                                                                       20355000
*   DECLARE                                                             20356000
*     1    QUACF    BASED,          /* QUAA data for coupling facility. 20357000
*                                      QUAHSGOF points to this record   20358000
*                                      when general or specific data    20359000
*                                      for a coupling facility          20360000
*                                      is requested.                    20370000
*                                                                @L2A*/ 20380000
*      2    QUACFTYP BIT(8),        /* X'10' Coupling facility record,  20390000
*                                      X'90' Last coupling facility     20400000
*                                      record                    @L2A*/ 20410000
*      2    *        CHAR(1),       /* Reserved X'00'            @L2A*/ 20420000
*      2    QUACFLEN FIXED(16),     /* Length of record          @L2A*/ 20430000
*      2    QUACFNAME CHAR(8),      /* Name of coupling facility @L2A*/ 20440000
*      2    QUACFND CHAR(32),       /* Node descriptor of               20450000
*                                      coupling facility                20460000
*                                      IXLYNDE maps this field.  @D7C*/ 20470000
*       3   *       CHAR(4),        /* See IXLYNDE               @D7C*/ 20480000
*       3   QUACFID CHAR(26),       /* EBCDIC portion of ND.            20490000
*                                      See IXLYNDE               @D7C*/ 20500000
*       3   *       CHAR(2),        /* See IXLYNDE               @D7C*/ 20510000
*      2    QUACFDUMPSIZE FIXED(32), /* Size of dump space              20520000
*                                      as specified in CFRM active      20530000
*                                      policy (number in                20540000
*                                      multiple of 4K bytes)     @L2A*/ 20550000
*      2    QUACFSTATE BIT(32),     /* State of coupling facility       20560000
*                                                                @L2A*/ 20570000
*       3    QUACFSTATE1   BIT(8),  /* 1st byte of state indicators     20580000
*                                                                @L2A*/ 20590000
*        4   QUACFSTDPEND BIT(1),   /* Policy change pending which      20600000
*                                      will delete this coupling        20610000
*                                      facility from the CFRM active    20620000
*                                      policy when all allocated        20630000
*                                      structures are gone from         20640000
*                                      this coupling facility    @L2A*/ 20650000
*       3    QUACFSTATE2   BIT(8),  /* 2nd byte of state indicators     20660000
*                                                                @L2A*/ 20670000
*        4   QUACFSTRECONCILE BIT(1), /* The coupling facility to CFRM  20680000
*                                      policy reconcile process is in   20690000
*                                      progress. When this bit is on    20700000
*                                      IXLCONNs to structures in this   20710000
*                                      coupling facility are not        20720000
*                                      permitted.                @L2A*/ 20730000
*        4   QUACFSTFAILED  BIT(1), /* The coupling facility has        20740000
*                                      failed. When this bit is on      20750000
*                                      IXLCONNs to structures in this   20760000
*                                      coupling facility are not        20770000
*                                      permitted.                @L3A*/ 20780000
*       3    QUACFSTATE3   BIT(8),  /* 3rd byte of state indicators     20790000
*                                                                @L2A*/ 20800000
*        4   QUACFSTPopulateCFTarget BIT(1), /* A PopulateCF rebuild    20810000
*                                      request is currently in progress 20820000
*                                      for this facility.        @LAA*/ 20830000
*       3    QUACFSTATE4   BIT(8),  /* 4th byte of state indicators     20840000
*                                                                @L2A*/ 20850000
*      2    QUACFSTREXTRA FIXED(31), /* Number of structures in this    20860000
*                                      coupling facility which cannot   20870000
*                                      be added to the policy    @L2A*/ 20880000
*      2    QUACFRSVD CHAR(8),      /* Reserved                         20890000
*                                                                @L2A*/ 20900000
*      2    QUACFSC# FIXED(31),     /* Number of records for systems    20910000
*                                      connected to specified coupling  20920000
*                                      facility (QUACFSC)               20930000
*                                                                @L2A*/ 20940000
*      2    QUACFSCO FIXED(32),     /* Offset from QUACF                20950000
*                                      to QUACFSC records        @L2A*/ 20960000
*      2    QUACFSTR# FIXED(31),    /* Number of records for            20970000
*                                      structures in specified          20980000
*                                      coupling facility (QUACFSTR)     20990000
*                                                                @L2A*/ 21000000
*      2    QUACFSTRO FIXED(32),    /* Offset from QUACF                21010000
*                                      to QUACFSTR records       @L2A*/ 21020000
*      2    QUACFTEXT,              /* CFRM active policy data   @L2A*/ 21030000
*       3   QUACFPOLNAME CHAR(8),   /* Policy name.                     21040000
*                                      If SETXCF STOP,POLICY,TYPE=CFRM  21050000
*                                      has been issued then the name    21060000
*                                      will be blanks.                  21070000
*                                                                @L2A*/ 21080000
*       3   QUACFUPDTIME CHAR(8),   /* Time policy was last updated by  21090000
*                                      the installation prior to this   21100000
*                                      policy being activated.          21110000
*                                      If SETXCF STOP,POLICY,TYPE=CFRM  21120000
*                                      has been issued then the time    21130000
*                                      will be the same time as         21140000
*                                      QUACFSETTIME.             @L2A*/ 21150000
*       3   QUACFSETTIME CHAR(8),   /* Time policy was activated via    21160000
*                                      operator command.         @L2A*/ 21170000
*       3   QUACFREQ#STR FIXED(31), /* If non-zero value, indicates     21180000
*                                      that the policy is not formatted 21190000
*                                      to contain the maximum number of 21200000
*                                      structure records and is not     21210000
*                                      large enough to contain all the  21220000
*                                      structures that exist in         21230000
*                                      coupling facilities              21240000
*                                      represented in the policy.       21250000
*                                      Value should be used as input    21260000
*                                      to format a couple data set      21270000
*                                      for TYPE CFRM.                   21280000
*                                                                @L2A*/ 21290000
*       3   QUACFREQ#CONN FIXED(15), /* If non-zero value indicates     21300000
*                                      that the policy is not large     21310000
*                                      enough to contain all the        21320000
*                                      connections that exist for       21330000
*                                      structures represented in        21340000
*                                      the policy.                      21350000
*                                      Value should be used as input    21360000
*                                      to format a couple data set      21370000
*                                      for TYPE CFRM.                   21380000
*                                                                @L2A*/ 21390000
*       3   * CHAR(6),               /* Reserved part of QUACFTEXT      21400000
*                                                                @PBC*/ 21410000
*       3   QUACFEXTRA#STR FIXED(31), /* If non-zero value, indicates   21420000
*                                        that the policy is formatted   21430000
*                                        with the maximum number of     21440000
*                                        structure records (or a        21450000
*                                        recommendation was made to do  21460000
*                                        so - if non-zero QuaCfReq#Str  21470000
*                                        field) and represents the      21480000
*                                        number of structures that      21490000
*                                        must be removed from the       21500000
*                                        policy to contain all the      21510000
*                                        structures that exist in       21520000
*                                        coupling facilities            21530000
*                                        represented in the policy.     21540000
*                                                                @PBA*/ 21550000
*      2    QUACFRSVD2 CHAR(40);    /* Reserved                         21560000
*                                                                @L2A*/ 21570000
*   DECLARE                                                             21580000
*     1    QUACF1  BASED,           /* CF record data format            21590000
*                                      for QUAA level 1          @04A*/ 21600000
*       3    * CHAR(LENGTH(QUACF)),  /* Mapped by QUACF          @04A*/ 21610000
*       3    * CHAR(64);            /* Reserved                  @04A*/ 21620000
*                                                                       21630000
*   /*****************************************************************/ 21640000
*   /*                                                               */ 21650000
*   /* QUAA data for systems connected to specified                  */ 21660000
*   /*                                    coupling facility      @L2A*/ 21670000
*   /*                                                               */ 21680000
*   /* WARNING! You must use the QUACFSCLEN to determine the size of */ 21690000
*   /* QUACFSC that is presented. This size can change at any time   */ 21700000
*   /* due to new XCF support or service.                        @L7A*/ 21710000
*   /*                                                               */ 21720000
*   /*****************************************************************/ 21730000
*                                                                       21740000
*   DECLARE                                                             21750000
*     1    QUACFSC BASED,           /* QUAA data for systems connected  21760000
*                                      to specified coupling facility   21770000
*                                                                @L2A*/ 21780000
*      2    QUACFSCTYP BIT(8),      /* X'11' System connected to        21790000
*                                      coupling facility record,        21800000
*                                      X'91' Last system connected to   21810000
*                                      coupling facility record.        21820000
*                                                                @L2A*/ 21830000
*      2    *        CHAR(1),       /* Reserved X'00'            @L2A*/ 21840000
*      2    QUACFSCLEN FIXED(16),   /* Length of record          @L2A*/ 21850000
*      2    QUACFSCNAME CHAR(8),    /* Name of system connected to      21860000
*                                      specified coupling facility      21870000
*                                                                @L2A*/ 21880000
*      2    QUACFSCRSVD CHAR(4);    /* Reserved                  @L2A*/ 21890000
*   DECLARE                                                             21900000
*     1    QUACFSC1  BASED,         /* CFSC record data format          21910000
*                                      for QUAA level 1          @04A*/ 21920000
*       3    * CHAR(LENGTH(QUACFSC)),  /* Mapped by QUACFSC      @04A*/ 21930000
*       3    * CHAR(64);            /* Reserved                  @04A*/ 21940000
*                                                                       21950000
*   /*****************************************************************/ 21960000
*   /*                                                               */ 21970000
*   /* QUAA data for structures in specified coupling facility   @L2A*/ 21980000
*   /*                                                               */ 21990000
*   /* WARNING! You must use the QUACFSTRLEN to determine the size of*/ 22000000
*   /* QUACFSTR  that is presented. This size can change at any time */ 22010000
*   /* due to new XCF support or service.                        @L7A*/ 22020000
*   /*                                                               */ 22030000
*   /*****************************************************************/ 22040000
*                                                                       22050000
*   DECLARE                                                             22060000
*     1    QUACFSTR BASED,          /* QUAA data for structures         22070000
*                                      in specified coupling facility   22080000
*                                                                @L2A*/ 22090000
*      2    QUACFSTRTYP BIT(8),     /* X'12' Structures in              22100000
*                                      coupling facility record,        22110000
*                                      X'92' Last structure in          22120000
*                                      coupling facility record.        22130000
*                                                                @L2A*/ 22140000
*      2    *        CHAR(1),       /* Reserved X'00'            @L2A*/ 22150000
*      2    QUACFSTRLEN FIXED(16),  /* Length of record          @L2A*/ 22160000
*      2    QUACFSTRNAME CHAR(16),  /* Name of Structure         @L2A*/ 22170000
*      2    QUACFSTRFLG BIT(8),     /* Structure allocation status      22180000
*                                                                @L2A*/ 22190000
*       3    QUACFSTRACT BIT(1),       /* ON->Only 1 structure is       22200000
*                                      allocated with this structure    22210000
*                                      name.  Not part of a rebuild     22220000
*                                      pair.  OFF->2 structures are     22230000
*                                      allocated with this name.  See   22240000
*                                      QuaCFSTRRebldNew and             22250000
*                                      QuaCFSTRRebldOld to determine    22260000
*                                      if this record represents        22270000
*                                      either the rebuild new or        22280000
*                                      rebuild old structure.    @PHC*/ 22290000
*       3    QUACFSTRREBLDOLD BIT(1),  /* Rebuild/old.                  22300000
*                                      If structure rebuild (IXLREBLD)  22310000
*                                      has been initiated the original  22320000
*                                      structure is now the             22330000
*                                      old structure.            @D4A*/ 22340000
*       3    QUACFSTRREBLDNEW BIT(1),  /* Rebuild/new.                  22350000
*                                      If structure rebuild (IXLREBLD)  22360000
*                                      has been initiated this          22370000
*                                      structure is the new             22380000
*                                      structure.                @D4A*/ 22390000
*       3    QUACFSTRTRAN BIT(1),   /* Transitional state.              22400000
*                                      The structure is either being    22410000
*                                      allocated in a coupling          22420000
*                                      facility or being deallocated    22430000
*                                      from a coupling facility.        22440000
*                                                                @D4A*/ 22450000
*       3    QUACFSTRHOLD BIT(1),   /* Holding state.                   22460000
*                                      If structure was being deleted   22470000
*                                      from the coupling facility but   22480000
*                                      connectivity was lost, it is     22490000
*                                      tracked in the policy.    @D4A*/ 22500000
*       3    QUACFSTRDUMPTBL BIT(1), /* Structure can not be            22510000
*                                      deallocated since a dump table   22520000
*                                      is associated with the           22530000
*                                      structure.                @D4A*/ 22540000
*       3    *       BIT(2),        /* Reserved                  @D4A*/ 22550000
*      2    QUACFSTRFLG2 BIT(8),    /* Structure state           @L3A*/ 22560000
*       3    QUACFSTRSTRFAIL BIT(1), /* Structure failure has been      22570000
*                                      recognized for this version of   22580000
*                                      the structure.            @L3A*/ 22590000
*       3    QUACFSTRNOSYSCON BIT(1), /* No systems have connectivity   22600000
*                                      to the facility in which the     22610000
*                                      structure is allocated.   @P4A*/ 22620000
*       3   QUACFSTRDUPALTERDEFER BIT(1), /* The structure is duplexed  22630000
*                                      and the alter of this structure  22640000
*                                      instance is deferred, waiting    22650000
*                                      for the alter of the other       22660000
*                                      structure instance to complete.  22670000
*                                                              @06A*/   22680000
*       3   QUACFSTRDUPALTERINPROGRESS BIT(1), /* The structure is      22690000
*                                      duplexed and the alter of this   22700000
*                                      structure instance is in         22710000
*                                      progress.               @06A*/   22720000
*       3   QUACFSTRPopulateCFRebuildPending BIT(1), /* The structure   22730000
*                                      is in Pending Rebuild state      22740000
*                                      for the current POPULATECF       22750000
*                                      rebuild.                  @LAA*/ 22760000
*      2     QUACFSTRSTRDUMPID FIXED(16); /* Structure Dump ID.         22770000
*                                      Non zero value indicates dump    22780000
*                                      table associated with structure. 22790000
*                                      Valid only if structure is       22800000
*                                      QUACFSTRACT,                     22810000
*                                      QUACFSTRREBLDNEW,                22820000
*                                      QUACFSTRREBLDOLD, or             22830000
*                                      QUACFSTRDUMPTBL.          @D4A*/ 22840000
*   DECLARE                                                             22850000
*     1    QUACFSTR1  BASED,        /* CFSTR record data format         22860000
*                                      for QUAA level 1          @04A*/ 22870000
*       3    * CHAR(LENGTH(QUACFSTR)),  /* Mapped by QUACFSTR    @04A*/ 22880000
*       3    QUACFSTRPHYSICALVERSION BIT(64), /* Physical version for   22890000
*                                      the structure.  Changes          22900000
*                                      when a new physical instance     22910000
*                                      of the structure is allocated    22920000
*                                      (e.g., user- or system-managed   22930000
*                                      rebuild), and there is at least  22940000
*                                      one active connector to observe  22950000
*                                      the allocation.           @LEC*/ 22960000
*       3    QUACFSTRLOGICALVERSION BIT(64), /* Logical structure       22970000
*                                      version number.  Used in         22980000
*                                      conjunction with the physical    22990000
*                                      version number to identify       23000000
*                                      an instance of a structure.      23010000
*                                      The value of this field is       23020000
*                                      set equal to the physical        23030000
*                                      version number when the          23040000
*                                      structure is initially           23050000
*                                      allocated.  It changes when      23060000
*                                      a process that allocates a       23070000
*                                      new instance of the structure    23080000
*                                      (e.g., rebuild) is               23090000
*                                      user-managed, but not when       23100000
*                                      it is system-managed.     @LDC*/ 23110000
*       3    * CHAR(112);           /* Reserved                  @LCC*/ 23120000
*                                                                       23130000
*   /*****************************************************************/ 23140000
*   /*                                                               */ 23150000
*   /* QUAA data for structures                                  @L2A*/ 23160000
*   /*                                                               */ 23170000
*   /* WARNING! You must use the QUASTRLEN to determine the size of  */ 23180000
*   /* QUASTR that is presented. This size can change at any time    */ 23190000
*   /* due to new XCF support or service.                        @L7A*/ 23200000
*   /*                                                               */ 23210000
*   /*****************************************************************/ 23220000
*                                                                       23230000
*   DECLARE                                                             23240000
*     1    QUASTR   BASED,          /* QUAA data for structures.        23250000
*                                      QUAHSGOF points to this record   23260000
*                                      when general or specific data    23270000
*                                      for a structure is requested.    23280000
*                                                                @L2A*/ 23290000
*      2    QUASTRTYP BIT(8),       /* X'20' Structure record,          23300000
*                                      X'A0' Last structure record.     23310000
*                                                                @L2A*/ 23320000
*      2    *        CHAR(1),       /* Reserved X'00'            @L2A*/ 23330000
*      2    QUASTRLEN FIXED(16),    /* Length of record          @L2A*/ 23340000
*      2    QUASTRNAME CHAR(16),    /* Name of structure         @L2A*/ 23350000
*      2    QUASTRSIZE FIXED(32),   /* Size of structure                23360000
*                                      as specified in CFRM active      23370000
*                                      policy (number                   23380000
*                                      in multiple of 4K bytes)  @L2A*/ 23390000
*      2    QUASTRSTATE BIT(32),    /* State of structure        @L2A*/ 23400000
*       3    QUASTRSTATE1   BIT(8), /* 1st byte of state indicators     23410000
*                                                                @L2A*/ 23420000
*        4   QUASTRSTDPEND BIT(1),  /* Change pending in structure      23430000
*                                      policy                    @L2A*/ 23440000
*       3    QUASTRSTATE2   BIT(8), /* 2nd byte of state indicators     23450000
*                                                                @L2A*/ 23460000
*       3    QUASTRSTATE3   BIT(8), /* 3rd byte of state indicators     23470000
*                                                                @L2A*/ 23480000
*        4   QUASTRSTSDISP BIT(1),  /* Allocated with STRDISP=KEEP      23490000
*                                                                @L2A*/ 23500000
*        4   * BIT(1),              /* Reserved                  @L2C*/ 23510000
*        4   QUASTRSTREBLD BIT(1),  /* Structure rebuild in progress    23520000
*                                                                @D4A*/ 23530000
*        4   QUASTRSTREBLDSTOP BIT(1),  /* Structure rebuild stopped    23540000
*                                      QUASTRSTREBLD will also be on.   23550000
*                                                                @D4A*/ 23560000
*        4   QUASTRSTALTER BIT(1),  /* Structure alter in progress      23570000
*                                                                @L6A*/ 23580000
*        4   QUASTRSTINCLEANUP BIT(1), /* Structure cleanup in progress 23590000
*                                                                @01A*/ 23600000
*        4   * BIT(2),              /* Reserved                  @01A*/ 23610000
*       3    QUASTRSTATE4   BIT(8), /* 4th byte of state indicators     23620000
*                                                                @L2A*/ 23630000
*        4  QUASTRSTINPOLDEF  BIT(1), /* X'80' Structure is defined     23640000
*                                      in policy                 @L2A*/ 23650000
*      2    QUASTRINHDW BIT(8),     /* Indicates structure in           23660000
*                                      coupling facility         @L2A*/ 23670000
*       3    QUASTRINHDWON BIT(1),  /* X'80' Allocated in               23680000
*                                      coupling facility         @L2A*/ 23690000
*      2    *         CHAR(1),      /* Reserved                  @DBC*/ 23700000
*      2    QUASTRCONNEXTRA FIXED(15), /* Highest connection            23710000
*                                      identifier to this               23720000
*                                      structure which can not          23730000
*                                      be added to the policy.   @L2A*/ 23740000
*      2    QUASTRCONNEXTRA# FIXED(15), /* Number of connections        23750000
*                                      to this                          23760000
*                                      structure which can not          23770000
*                                      be added to the policy.   @DAA*/ 23780000
*      2    QUASTRFLG BIT(8),       /* Structure flags           @06C*/ 23790000
*        4    QuaStrDuplexAllowed BIT(1),  /* DUPLEX(ALLOWED) was       23800000
*                                      specified in the CFRM active     23810000
*                                      policy for the structure  @06A*/ 23820000
*        4    QuaStrDuplexEnabled BIT(1), /* DUPLEX(ENABLED)            23830000
*                                      was specified in the CFRM        23840000
*                                      active policy for the structure  23850000
*                                                                @06A*/ 23860000
*        4    QuaStrPrefEnforce BIT(1),/* ENFORCEORDER(YES)      @08A*/ 23870000
*        4    QuaStrAllowAutoAlt BIT(1),/* ALLOWAUTOALT(YES)     @LHA*/ 23880000
*        4    * BIT(4),                 /* RESERVED              @LHC*/ 23890000
*      2    QUASTRREBUILDPERCENT FIXED(8), /* REBUILDPERCENT for        23900000
*                                      structure as specified           23910000
*                                      in CFRM active policy. Value of  23920000
*                                      zero implies not specified.      23930000
*                                                                @P8A*/ 23940000
*      2    QUASTRINITSIZE FIXED(32), /* INITSIZE for structure         23950000
*                                      as specified in CFRM active      23960000
*                                      policy (number                   23970000
*                                      in multiple of 4K bytes)         23980000
*                                                                @L6A*/ 23990000
*      2    QUASTRPL# FIXED(31),    /* Number of records for preference 24000000
*                                      list entries for specified       24010000
*                                      structure (QUASTRPL)      @L2A*/ 24020000
*      2    QUASTRPLO FIXED(32),    /* Offset from QUASTR to QUASTRPL   24030000
*                                      records                   @L2A*/ 24040000
*      2    QUASTRXL# FIXED(31),    /* Number of records for exclusion  24050000
*                                      list entries for specified       24060000
*                                      structure (QUASTRXL)      @L2A*/ 24070000
*      2    QUASTRXLO FIXED(32),    /* Offset from QUASTR to QUASTRXL   24080000
*                                      records                   @L2A*/ 24090000
*      2    QUASTRCF# FIXED(31),    /* Number of records for coupling   24100000
*                                      facilities containing specified  24110000
*                                      structure (QUASTRCF)      @L2A*/ 24120000
*      2    QUASTRCFO FIXED(32),    /* Offset from QUASTR to QUASTRCF   24130000
*                                      records                   @L2A*/ 24140000
*      2    QUASTRUSER# FIXED(31),  /* Number of records for connector  24150000
*                                      to specified structure           24160000
*                                      (QUASTRUSER)              @L2A*/ 24170000
*      2    QUASTRUSERO FIXED(32),  /* Offset from QUASTR to            24180000
*                                      QUASTRUSER records        @L2A*/ 24190000
*      2    QUASTRTEXT,             /* CFRM active policy data   @L2A*/ 24200000
*       3   QUASTRPOLNAME CHAR(8),  /* Policy name.                     24210000
*                                      If SETXCF STOP,POLICY,TYPE=CFRM  24220000
*                                      has been issued then the name    24230000
*                                      will be blanks.                  24240000
*                                                                @L2A*/ 24250000
*       3   QUASTRUPDTIME CHAR(8),  /* Time policy was last updated by  24260000
*                                      the installation prior to this   24270000
*                                      policy being activated.          24280000
*                                      If SETXCF STOP,POLICY,TYPE=CFRM  24290000
*                                      has been issued then the time    24300000
*                                      will be the same time as         24310000
*                                      QUASTRSETTIME.            @L2A*/ 24320000
*       3   QUASTRSETTIME CHAR(8),  /* Time policy was activated via    24330000
*                                      operator command.         @L2A*/ 24340000
*       3   QUASTRREQ#STR FIXED(31), /* If non-zero value, indicates    24350000
*                                      that the policy is not formatted 24360000
*                                      to contain the maximum number of 24370000
*                                      structure records and is not     24380000
*                                      large enough to contain all the  24390000
*                                      enough to contain all the        24400000
*                                      structures that exist in         24410000
*                                      coupling facilities              24420000
*                                      represented in the policy.       24430000
*                                      Value should be used as input    24440000
*                                      to format a couple data set      24450000
*                                      for TYPE CFRM.                   24460000
*                                                                @L2A*/ 24470000
*       3   QUASTRREQ#CONN FIXED(15), /* If non-zero value indicates    24480000
*                                      that the policy is not large     24490000
*                                      enough to contain all the        24500000
*                                      connections that exist for       24510000
*                                      structures represented in        24520000
*                                      the policy.                      24530000
*                                      Value should be used as input    24540000
*                                      to format a couple data set      24550000
*                                      for TYPE CFRM.                   24560000
*                                                                @L2A*/ 24570000
*       3   * CHAR(6),               /* Reserved part of QUASTRTEXT     24580000
*                                                                @PBC*/ 24590000
*       3   QUASTREXTRA#STR FIXED(31), /* If non-zero value, indicates  24600000
*                                        that the policy is formatted   24610000
*                                        with the maximum number of     24620000
*                                        structure records (or a        24630000
*                                        recommendation was made to do  24640000
*                                        so - if non-zero QuaStrReq#Str 24650000
*                                        field) and represents the      24660000
*                                        number of structures that      24670000
*                                        must be removed from the       24680000
*                                        policy to contain all the      24690000
*                                        structures that exist in       24700000
*                                        coupling facilities            24710000
*                                        represented in the policy.     24720000
*                                                                @PBA*/ 24730000
*      2    QUASTRREBLDINFO,        /* IXLREBLD related information.    24740000
*                                                                @D4A*/ 24750000
*       3   QUASTRREBLDPHASE BIT(32), /* Phase for the rebuild          24760000
*                                      structure process.  Valid        24770000
*                                      when QuaStrStRebld is on.        24780000
*                                      Note that not all                24790000
*                                      phases are applicable            24800000
*                                      to all rebuild types or          24810000
*                                      methods.  Type (duplexed or      24820000
*                                      not duplexed) is indicated       24830000
*                                      by QuastrRebldDuplex.            24840000
*                                      Method (user- or system-         24850000
*                                      managed) is indicated by         24860000
*                                      QuaStrProcessMethod.      @LEC*/ 24870000
*        4  QUASTRREBLDPHASE1 BIT(8), /* 1st byte of phase indicators   24880000
*                                                                @LCA*/ 24890000
*         5 QUASTRREBLDQUIESCE BIT(1), /* QUIESCE - A structure rebuild 24900000
*                                      has been initiated. Connections  24910000
*                                      need to stop usage of the        24920000
*                                      structure and confirm.           24930000
*                                      This phase will be complete      24940000
*                                      when all connections have        24950000
*                                      issued IXLEERSP for              24960000
*                                      the Rebuild Quiesce event.       24970000
*                                                                @DCC*/ 24980000
*         5 QUASTRREBLDCOMPLETE BIT(1), /* COMPLETE - A structure       24990000
*                                      rebuild is in progress.          25000000
*                                      Connections can connect          25010000
*                                      and access the new structure.    25020000
*                                      This phase will be complete      25030000
*                                      when all connections             25040000
*                                      have issued                      25050000
*                                      IXLREBLD REQUEST=COMPLETE.       25060000
*                                                                @DCC*/ 25070000
*         5 QUASTRREBLDCLEANUP BIT(1), /* CLEANUP - A structure rebuild 25080000
*                                      is in progress. Connections      25090000
*                                      have completed their part of     25100000
*                                      the process and final cleanup    25110000
*                                      is in progress. This phase       25120000
*                                      will be complete when all        25130000
*                                      connections have issued          25140000
*                                      IXLEERSP for the Rebuild         25150000
*                                      Cleanup event.            @DCC*/ 25160000
*         5 QUASTRREBLDSTOP BIT(1), /* STOP - Structure rebuild         25170000
*                                      has been stopped.         @D4A*/ 25180000
*         5 QuaStrRebldDuplexEstablished BIT(1), /* DUPLEX ESTABLISHED- 25190000
*                                      Duplexing has been established   25200000
*                                      and all users may proceed with   25210000
*                                      duplexed structure operations.   25220000
*                                      This phase will be complete when 25230000
*                                      a switch to simplex mode using   25240000
*                                      the new structure has been       25250000
*                                      requested,  and all users have   25260000
*                                      issued IXLREBLD                  25270000
*                                      REQUEST=DUPLEXCOMPLETE    @06A*/ 25280000
*         5 QUASTRREBLDSTARTUP BIT(1), /* STARTUP - A system-managed    25290000
*                                      process is in the startup        25300000
*                                      phase.                    @LDC*/ 25310000
*         5 QUASTRREBLDALLOCATE BIT(1), /* ALLOCATE - A system-managed  25320000
*                                      process is in the allocate       25330000
*                                      phase.  The system               25340000
*                                      participating in the phase       25350000
*                                      is described in the              25360000
*                                      QUASTRSYS record.         @LDC*/ 25370000
*         5 QUASTRREBLDATTACH  BIT(1), /* ATTACH - A system-managed     25380000
*                                      process is in the attach         25390000
*                                      phase.  The system(s)            25400000
*                                      participating in the phase       25410000
*                                      are described in the             25420000
*                                      QUASTRSYS record.         @LDC*/ 25430000
*        4  QUASTRREBLDPHASE2 BIT(8), /* 2nd byte of phase indicators   25440000
*                                                                @LCA*/ 25450000
*         5 QUASTRREBLDCOPY    BIT(1), /* COPY - A system-managed       25460000
*                                      process is in the copy           25470000
*                                      phase.  The system(s)            25480000
*                                      participating in the phase       25490000
*                                      are described in the             25500000
*                                      QUASTRSYS record.         @LDC*/ 25510000
*         5 QUASTRREBLDCOPYSTOP BIT(1), /* COPY STOP - A system-managed 25520000
*                                      process is in the copy stop      25530000
*                                      phase.  The system(s)            25540000
*                                      participating in the phase       25550000
*                                      are described in the             25560000
*                                      QUASTRSYS record.         @LDA*/ 25570000
*        4  QUASTRREBLDPHASE3 BIT(8), /* 3rd byte of phase indicators   25580000
*                                                                @LCA*/ 25590000
*        4  QUASTRREBLDPHASE4 BIT(8), /* 4th byte of phase indicators   25600000
*                                                                @LCA*/ 25610000
*       3   QUASTRREBLDSTARTRSN BIT(32), /* Rebuild start reason @D4A*/ 25620000
*        4  QUASTRREBLDSTARTOPER BIT(1), /* Operator             @D4A*/ 25630000
*        4  QUASTRREBLDSTARTCONN BIT(1), /* Connector. See user code.   25640000
*                                      (QUASTRREBLDSTARTUCODE)   @D4A*/ 25650000
*        4  QUASTRREBLDSTARTLOSTCCF BIT(1), /* Lost connectivity to     25660000
*                                      coupling facility containing     25670000
*                                      structure                 @D4A*/ 25680000
*        4  QUASTRREBLDSTARTSTRFAIL BIT(1), /* Structure failed  @D4A*/ 25690000
*        4  QuaStrRebldStartPolicy  BIT(1), /* Policy-initiated         25700000
*                                      (DUPLEX(ENABLED) specified       25710000
*                                      for the structure)        @06A*/ 25720000
*       3   QUASTRREBLDSTARTUCODE FIXED(31), /* User code if rebuild    25730000
*                                      start reason was connector.      25740000
*                                      (QUASTRREBLDSTARTCONN)    @D4A*/ 25750000
*       3   QUASTRREBLDSTOPRSN BIT(32), /* Rebuild stop reason   @D4A*/ 25760000
*        4  QUASTRREBLDSTOPRSN1 BIT(8), /*                       @06A*/ 25770000
*         5 QUASTRREBLDSTOPOPER BIT(1), /* Operator              @D4A*/ 25780000
*         5 QUASTRREBLDSTOPCONN BIT(1), /* Connector. See user code.    25790000
*                                      (QUASTRREBLDSTOPUCODE)    @D4A*/ 25800000
*         5 QUASTRREBLDSTOPINSUFFCONN Bit(1), /* No coupling facility   25810000
*                                   in the preference list provided     25820000
*                                   better or equivalent connectivity   25830000
*                                   than the current facility.  The     25840000
*                                   rebuild was stopped to avoid a      25850000
*                                   degradation in connectivity for the 25860000
*                                   application.                 @L9A*/ 25870000
*         5 QUASTRREBLDSTOPNOBETTERCONN Bit(1), /* No coupling facility 25880000
*                                   in the preference list provided     25890000
*                                  better connectivity than the current 25900000
*                                   facility for this LOSSCONN rebuild. 25910000
*                                   The rebuild was stopped to avoid    25920000
*                                   further degradation in connectivity 25930000
*                                   for the application.         @L9A*/ 25940000
*         5 QUASTRREBLDSTOPLOSTCCFNEW BIT(1), /* Lost connectivity      25950000
*                                      to coupling facility containing  25960000
*                                      new structure             @D4A*/ 25970000
*         5 QUASTRREBLDSTOPLOSTCCFOLD BIT(1), /* Lost connectvity       25980000
*                                      to coupling facility containing  25990000
*                                      old structure             @D4A*/ 26000000
*         5 QUASTRREBLDSTOPSTRFAILNEW BIT(1), /* New structure failed.  26010000
*                                                                @D4A*/ 26020000
*         5 QUASTRREBLDSTOPSTRFAILOLD BIT(1), /* Old structure failed.  26030000
*                                                                @D4A*/ 26040000
*        4  QUASTRREBLDSTOPRSN2 BIT(8), /*                       @06A*/ 26050000
*         5 QuaStrRebldStopPolicy  BIT(1), /* Policy-initiated          26060000
*                                      (DUPLEX(DISABLED) specified for  26070000
*                                      the structure)            @06A*/ 26080000
*         5 QuaStrRebldStopStrfail BIT(1), /* Structure failure (for a  26090000
*                                      duplexing rebuild)        @06A*/ 26100000
*         5 QuaStrRebldStopLossconn BIT(1), /* Loss of connectivity     26110000
*                                      (for a duplexing rebuild) @06A*/ 26120000
*         5 QuaStrRebldStopInsuffConnChgCon BIT(1), /* Insufficient     26130000
*                                      connectivity due to a change in  26140000
*                                      the set of structure connectors  26150000
*                                      (for a duplexing rebuild) @06A*/ 26160000
*         5 QuaStrRebldStopPopCfNotSuitable BIT(1), /* This structure   26170000
*                                      was selected as a candidate for  26180000
*                                      a PopulateCF rebuild, but the    26190000
*                                      facility specified on the Start  26200000
*                                      PopCF rebuild was not a suitable 26210000
*                                      location compared to its current 26220000
*                                      location                  @LAA*/ 26230000
*       3   QUASTRREBLDSTOPUCODE FIXED(31), /* User code if rebuild     26240000
*                                      stop reason was connector.       26250000
*                                      (QUASTRREBLDSTOPCONN)     @D4A*/ 26260000
*       3   QUASTRREBLDPHASECONFIRMSTNG CHAR(32), /* Bit string         26270000
*                                      representing active connections  26280000
*                                      for this phase of rebuild.       26290000
*                                      The bit position maps to the     26300000
*                                      connection identifier.           26310000
*                                      See QUASTRUSERCONID.      @D6A*/ 26320000
*      2    QUASTRUSYNCINFO,        /* IXLUSYNC related information.    26330000
*                                                                @D9A*/ 26340000
*       3   QUASTRUSYNCCONFIRMSTNG CHAR(32), /* Bit string              26350000
*                                      representing active connections  26360000
*                                      needing to respond to User Sync  26370000
*                                      Point event represented          26380000
*                                      by QUASTRUSYNCNEXT.              26390000
*                                      The bit position maps to the     26400000
*                                      connection identifier.           26410000
*                                      See QUASTRUSERCONID.      @D9A*/ 26420000
*       3   QUASTRUSYNCNEXT FIXED(32), /* Next User Sync Point event.   26430000
*                                      This is the current event.       26440000
*                                      In the event exit, the user      26450000
*                                      receives this as the             26460000
*                                      next event.               @D9A*/ 26470000
*       3   QUASTRUSYNCNEXTUSTATE CHAR(32), /* Next User Sync Point     26480000
*                                      user state information    @D9A*/ 26490000
*       3   QUASTRUSYNCCOMPLETED FIXED(32), /* Completed User Sync      26500000
*                                      Point event. This is the         26510000
*                                      previous event which has         26520000
*                                      completed. In the event exit,    26530000
*                                      the user receives this as        26540000
*                                      the completed event.      @D9A*/ 26550000
*       3   QUASTRUSYNCCOMPLETEDUSTATE CHAR(32), /* Completed User      26560000
*                                      Sync Point user state            26570000
*                                      information               @D9A*/ 26580000
*      2    QUASTRPENDSIZE FIXED(32), /* Size of the structure in       26590000
*                                      the pending policy,  in units    26600000
*                                      of 4K bytes.  This field is      26610000
*                                      valid only when it contains a    26620000
*                                      nonzero value.  Note             26630000
*                                      that this field is set to the    26640000
*                                      pending policy INITSIZE (if      26650000
*                                      specified) or to the pending     26660000
*                                      policy SIZE (if INITSIZE is not  26670000
*                                      specified).               @01A*/ 26680000
*      2     QuaStrRebldFlags BIT(8),  /* Rebuild flags          @06A*/ 26690000
*         5    QuaStrRebldDuplex BIT(1),  /* Indicates whether or not   26700000
*                                      the in-progress rebuild is a     26710000
*                                      duplexing rebuild         @06A*/ 26720000
*         5    QuaStrRebldSwitchInProgress BIT(1),  /* Indicates        26730000
*                                      whether or not a switch to       26740000
*                                      simplex mode using the new       26750000
*                                      structure has been initiated     26760000
*                                      for a duplexing rebuild that     26770000
*                                      was in the rebuild duplex        26780000
*                                      established phase.        @06A*/ 26790000
*         5    * BIT(5),            /* Reserved                  @LDM*/ 26800000
*         5    QuaStrProcessMethod BIT(1), /* ON => the process         26810000
*                                      in progress is system-managed.   26820000
*                                      OFF=> the process in progress    26830000
*                                      is user-managed.  The process    26840000
*                                      type is identified by the        26850000
*                                      QuaStrStRebld and                26860000
*                                      QuaStrRebldDuplex flags.  @LDC*/ 26870000
*      2    QUASTRRSVD  CHAR(2),    /* Reserved                  @LHC*/ 26880000
*      2    QUASTRFULLTHRESHOLD FIXED(8), /* FULLTHRESHOLD for a        26890000
*                                      structure as specified or        26900000
*                                      defaulted to in the CFRM         26910000
*                                      active policy             @LHA*/ 26920000
*      2    QUASTRMINSIZE FIXED(32), /* MINSIZE for structure as        26930000
*                                      specified or defaulted to in     26940000
*                                      CFRM active policy               26950000
*                                      (number in multiple of 4K bytes  26960000
*                                                                @LHA*/ 26970000
*      2    QUASTRALTER,            /* Structure alter data             26980000
*                                      Only has data if                 26981000
*                                      QUASTRSTALTER is on.      @L6A*/ 26982000
*       3   QUASTRALTERFLG1 BIT(8), /* Structure alter status           26983000
*                                      flags                     @L6A*/ 26984000
*        4  QUASTRALTERSTOP BIT(1), /* Structure alter stopped          26985000
*                                                                @L6A*/ 26986000
*        4  QUASTRALTEROPSTART  BIT(1), /* Structure alter started      26987000
*                                      by SETXCF command         @L6A*/ 26988000
*        4  QUASTRALTEROPSTOP   BIT(1), /* Structure alter stopped      26989000
*                                      by SETXCF command         @L6A*/ 26990000
*        4  QUASTRALTERPGMSTART BIT(1), /* Structure alter started      27000000
*                                      by IXLALTER interface     @L6A*/ 27010000
*        4  QUASTRALTERPGMSTOP  BIT(1), /* Structure alter stopped      27020000
*                                      by IXLALTER interface     @L6A*/ 27030000
*        4  QUASTRALTERREBLDSTOP BIT(1), /* Structure alter stopped     27040000
*                                      due to structure rebuild  @L6A*/ 27050000
*        4  QUASTRALTERSYSSTART  BIT(1), /* Structure alter started     27060000
*                                      by system for AutoAlter   @PLA*/ 27070000
*        4  QUASTRALTERSYSSTOP   BIT(1), /* Structure alter stopped     27080000
*                                      by system for AutoAlter   @PLA*/ 27090000
*       3   QUASTRALTERFLG2 BIT(8), /* Structure alter consensus        27100000
*                                      from all connections and         27110000
*                                      alter request data        @L6A*/ 27120000
*        4  QUASTRALTERCHGSIZE BIT(1), /* Structure alter request       27130000
*                                      specified size change     @L6A*/ 27131000
*        4  QUASTRALTERCHGRATIO BIT(1), /* Structure alter request      27132000
*                                      specified ratio change    @L6A*/ 27133000
*        4  QUASTRALTERCHGEMC BIT(1), /* Structure alter request        27134000
*                                      specified EMC change      @05A*/ 27135000
*        4  QUASTRALTERNEW BIT(1),   /* Alter in progress against the   27136000
*                                       new structure during a          27137000
*                                       duplexing rebuild process@06A*/ 27138000
*        4  QUASTRALTEROLD BIT(1),   /* Alter in progress against the   27139000
*                                       old structure during a          27140000
*                                       duplexing rebuild process@PIA*/ 27150000
*        4  * BIT(2),                /* Reserved                 @PIC*/ 27160000
*        4  QUASTRALTERRATIO BIT(1), /* Structure alter permits         27170000
*                                      change to ratio           @L6A*/ 27180000
*       3   QUASTRALTERMINENTRY FIXED(8), /* Maximum                    27190000
*                                      for all connections              27200000
*                                      of the minimum percent of        27210000
*                                      entries                   @L6A*/ 27220000
*       3   QUASTRALTERMINELEMENT FIXED(8), /* Maximum                  27230000
*                                      for all connections              27240000
*                                      of the minimum percent of        27250000
*                                      elements                  @L6A*/ 27260000
*       3   QUASTRALTERTSIZE FIXED(32), /* Structure alter target       27270000
*                                      size                      @L6A*/ 27280000
*       3   QUASTRALTERTENTRYRATIO FIXED(16), /* Structure alter        27290000
*                                      target entry part of             27300000
*                                      entry-to-element ratio    @L6A*/ 27310000
*       3   QUASTRALTERTELEMENTRATIO FIXED(16), /* Structure alter      27320000
*                                      target element part of           27330000
*                                      entry-to-element ratio    @L6A*/ 27340000
*       3   QUASTRALTERTEMCSTGPCT FIXED(16), /* Structure alter target  27350000
*                                      for Event Monitor Control        27360000
*                                      storage Percent           @05A*/ 27370000
*       3   QUASTRALTERMINEMC    FIXED(8), /* Maximum                   27380000
*                                      for all connections              27390000
*                                      of the minimum percent of        27400000
*                                      EMC storage               @05A*/ 27410000
*      2    *           CHAR(1),    /* Reserved                  @LDA*/ 27420000
*      2    QUASTRSYSNUMRECS FIXED(31), /* Number of records for        27430000
*                                      system-related information       27440000
*                                      for specified structure          27450000
*                                      (QUASTRSYS)               @LDA*/ 27460000
*      2    QUASTRSYSO  FIXED(32),  /* Offset from QUASTR to            27470000
*                                      QUASTRSYS records         @LDA*/ 27480000
*      2    QUASTRRSVD2 CHAR(8);    /* Reserved                  @LDC*/ 27490000
*   DECLARE                                                             27500000
*     1    QUASTR1  BASED,          /* STR record data format           27510000
*                                      for QUAA level 1          @04A*/ 27520000
*       3    * CHAR(LENGTH(QUASTR)),  /* Mapped by QUASTR        @04A*/ 27530000
*       3    QUASTRUSYNCINFO2 CHAR(16) BDY(WORD), /* Additional         27540000
*                                      USYNC info                @04A*/ 27550000
*         5    QUASTRUSYNCNEXTCOMPCODE FIXED(32),  /* Next completion   27560000
*                                      code                      @04A*/ 27570000
*         5    QUASTRUSYNCCOMPLETEDCOMPCODE FIXED(32), /* Completed     27580000
*                                      completion code           @04A*/ 27590000
*         5    * CHAR(8),           /* Reserved                  @04A*/ 27600000
*       3    QUASTRREBLDPCTLOSSCONN FIXED(8), /* Percent loss of        27610000
*                                      connectivity associated with     27620000
*                                      a structure rebuild that was     27630000
*                                      initiated by MVS based on        27640000
*                                      REBUILDPERCENT            @04A*/ 27650000
*       3    * CHAR(3),             /* Reserved                  @06C*/ 27660000
*       3    QUASTRGRPNAME CHAR(8), /* XCF group name associated with   27670000
*                                      this structure,  if the          27680000
*                                      structure is being used as a     27690000
*                                      serialized structure.            27700000
*                                      Otherwise,  this field contains  27710000
*                                      binary zero               @04A*/ 27720000
*       3    QUASTRPOPCFNAME CHAR(8), /* Name of Coupling Facility      27730000
*                                      for this structure is a          27740000
*                                      PopulateCF candidate, if the     27750000
*                                      structure is a PopCF candidate.  27760000
*                                      Otherwise,  this field contains  27770000
*                                      binary zero               @LAA*/ 27780000
*       3    QUASTRAUTOVERSION BIT(64), /* If a system-managed          27790000
*                                      process affecting this           27800000
*                                      structure is in progress         27810000
*                                      (QUASTRPROCESSMETHOD = ON),      27820000
*                                      this field contains a token      27830000
*                                      that can be used to correlate    27840000
*                                      events related to that           27850000
*                                      process.  If no system-          27860000
*                                      managed process affecting        27870000
*                                      this structure is in progress,   27880000
*                                      this field contains zero. @LDA*/ 27890000
*       3    * CHAR(84);            /* Reserved                  @LDC*/ 27900000
*                                                                       27910000
*     /***************************************************************/ 27920000
*     /*                                                             */ 27930000
*     /* QUAA data for specified structure preference list       @L2A*/ 27940000
*     /*                                                             */ 27950000
*     /* WARNING! You must use the QUASTRPLLEN to determine the size */ 27960000
*     /* of QUASTRPL that is presented. This size can change at any  */ 27970000
*     /* time due to new XCF support or service.                 @L7A*/ 27980000
*     /*                                                             */ 27990000
*     /***************************************************************/ 28000000
*                                                                       28010000
*     DECLARE                                                           28020000
*       1    QUASTRPL BASED,        /* QUAA data for specified          28030000
*                                      structure preference list @L2A*/ 28040000
*        2    QUASTRPLTYP BIT(8),   /* X'21' structure preference       28050000
*                                      list entry record, X'A1' Last    28060000
*                                      structure preference list        28070000
*                                      entry record              @L2A*/ 28080000
*        2    *        CHAR(1),     /* Reserved X'00'            @L2A*/ 28090000
*        2    QUASTRPLLEN FIXED(16), /* Length of record         @L2A*/ 28100000
*        2    QUASTRPLRSVD CHAR(4), /* Reserved                  @L2A*/ 28110000
*        2    QUASTRPLNAME CHAR(8); /* Coupling facility named in       28120000
*                                      preference list entry     @L2A*/ 28130000
*   DECLARE                                                             28140000
*     1    QUASTRPL1  BASED,        /* STRPL record data format         28150000
*                                      for QUAA level 1          @04A*/ 28160000
*       3    * CHAR(LENGTH(QUASTRPL)),  /* Mapped by QUASTRPL    @04A*/ 28170000
*       3    * CHAR(32);            /* Reserved                  @04A*/ 28180000
*                                                                       28190000
*                                                                       28200000
*     /***************************************************************/ 28210000
*     /*                                                             */ 28220000
*     /* QUAA data for specified structure exclusion list        @L2A*/ 28230000
*     /*                                                             */ 28240000
*     /* WARNING! You must use the QUASTRXLLEN to determine the size */ 28250000
*     /* of the QUASTRX that is presented.  This size can change     */ 28260000
*     /* at any time due to new XCF support or service.          @L7A*/ 28270000
*     /*                                                             */ 28280000
*     /***************************************************************/ 28290000
*                                                                       28300000
*     DECLARE                                                           28310000
*       1    QUASTRXL BASED,        /* QUAA data for specified          28320000
*                                      structure exclusion list  @L2A*/ 28330000
*        2    QUASTRXLTYP BIT(8),   /* X'22' Structure exclusion        28340000
*                                      list entry record, X'A2' Last    28350000
*                                      structure exclusion list         28360000
*                                      entry record              @L2A*/ 28370000
*        2    *        CHAR(1),     /* Reserved X'00'            @L2A*/ 28380000
*        2    QUASTRXLLEN FIXED(16), /* Length of record         @L2A*/ 28390000
*        2    QUASTRXLRSVD CHAR(4), /* Reserved                  @L2A*/ 28400000
*        2    QUASTRXLNAME CHAR(16); /* Structure named in              28410000
*                                      exclusion list entry      @L2A*/ 28420000
*   DECLARE                                                             28430000
*     1    QUASTRXL1  BASED,        /* STRXL record data format         28440000
*                                      for QUAA level 1          @04A*/ 28450000
*       3    * CHAR(LENGTH(QUASTRXL)),  /* Mapped by QUASTRXL    @04A*/ 28460000
*       3    * CHAR(32);            /* Reserved                  @04A*/ 28470000
*                                                                       28480000
*   /*****************************************************************/ 28490000
*   /*                                                               */ 28500000
*   /* QUAA data for coupling facility of specified structure    @L2A*/ 28510000
*   /*                                                               */ 28520000
*   /* WARNING! You must use the QUASTRCFLEN to determine the size   */ 28530000
*   /* of the QUASTRCF that is presented.  This size can change      */ 28540000
*   /* at any time due to new XCF support or service.            @L7A*/ 28550000
*   /*                                                               */ 28560000
*   /*****************************************************************/ 28570000
*                                                                       28580000
*   DECLARE                                                             28590000
*     1    QUASTRCF BASED,          /* QUAA data for coupling facility  28600000
*                                      of specified structure           28610000
*                                                                @L2A*/ 28620000
*      2    QUASTRCFTYP BIT(8),     /* X'23' Coupling facility of       28630000
*                                      specified structure record,      28640000
*                                      X'A3' Last coupling facility     28650000
*                                      of specified structure record.   28660000
*                                                                @L2A*/ 28670000
*      2    *        CHAR(1),       /* Reserved X'00'            @L2A*/ 28680000
*      2    QUASTRCFLEN FIXED(16),  /* Length of record          @L2A*/ 28690000
*      2    QUASTRCFNAME CHAR(8),   /* Name of coupling facility where  28700000
*                                      structure is allocated    @L2A*/ 28710000
*      2    QUASTRCFFLG BIT(8),     /* Structure allocation status      28720000
*                                                                @L2A*/ 28730000
*       3    QUASTRCFACT BIT(1),       /* ON->Only 1 structure is       28740000
*                                      allocated with this structure    28750000
*                                      name.  Not part of a rebuild     28760000
*                                      pair.  OFF->2 structures are     28770000
*                                      allocated with this name.  See   28780000
*                                      QuaStrCFRebldNew and             28790000
*                                      QuaStrCFRebldOld to determine    28800000
*                                      if this record represents        28810000
*                                      either the rebuild new or        28820000
*                                      rebuild old structure.    @PHC*/ 28830000
*       3    QUASTRCFREBLDOLD BIT(1),  /* Rebuild/old.                  28840000
*                                      If structure rebuild (IXLREBLD)  28850000
*                                      has been initiated the original  28860000
*                                      active structure is now the      28870000
*                                      old structure.            @D4A*/ 28880000
*       3    QUASTRCFREBLDNEW BIT(1),  /* Rebuild/new.                  28890000
*                                      If structure rebuild (IXLREBLD)  28900000
*                                      has been initiated this          28910000
*                                      structure is the new             28920000
*                                      structure.                @D4A*/ 28930000
*       3    QUASTRCFTRAN BIT(1),   /* Transitional state.              28940000
*                                      The structure is either being    28950000
*                                      allocated in coupling facility   28960000
*                                      or being deallocated from        28970000
*                                      coupling facility.        @D4A*/ 28980000
*       3    QUASTRCFHOLD BIT(1),   /* Holding state.                   28990000
*                                      If structure was being deleted   29000000
*                                      from the coupling facility but   29010000
*                                      connectivity was lost, it is     29020000
*                                      tracked in the policy.    @D4A*/ 29030000
*       3    QUASTRCFDUMPTBL BIT(1), /* Structure can not be            29040000
*                                      deallocated since a dump table   29050000
*                                      is associated with the           29060000
*                                      structure.                @D4A*/ 29070000
*      2    QUASTRCFFLG2 BIT(8),    /* Structure state           @L3A*/ 29080000
*       3   QUASTRCFSTRFAIL BIT(1), /* Structure failure has been       29090000
*                                      recognized for this version of   29100000
*                                      the structure.            @L3A*/ 29110000
*       3   QUASTRCFACCESSTIMENOLIMIT BIT(1), /* Structure was          29120000
*                                      allocated with                   29130000
*                                      IXLCONN ACCESSTIME(NOLIMIT).     29140000
*                                      Valid only if structure is       29150000
*                                      QUASTRCFACT, QUASTRCFREBLDNEW,   29160000
*                                      or QUASTRCFREBLDOLD.      @DDA*/ 29170000
*       3   QUASTRCFNOSYSCON BIT(1), /* No systems have connectivity    29180000
*                                      to the facility in which the     29190000
*                                      structure is allocated.   @P4A*/ 29200000
*       3   QUASTRCFDUPALTERDEFER BIT(1), /* The structure is duplexed  29210000
*                                      and the alter of this structure  29220000
*                                      instance is deferred, waiting    29230000
*                                      for the alter of the other       29240000
*                                      structure instance to complete.  29250000
*                                                              @06A*/   29260000
*       3   QUASTRCFDUPALTERINPROGRESS BIT(1), /* The structure is      29270000
*                                      duplexed and the alter of this   29280000
*                                      structure instance is in         29290000
*                                      progress.               @06A*/   29300000
*      2    QUASTRCFACCESSTIMEMAXIMUM FIXED(16), /* Access time for     29310000
*                                      IXLCONN ACCESSTIME(MAXIMUM).     29320000
*                                      Valid only if structure is       29330000
*                                      QUASTRCFACT, QUASTRCFREBLDNEW,   29340000
*                                      or QUASTRCFREBLDOLD.      @DDA*/ 29350000
*      2    QUASTRCFND CHAR(32),    /* Node descriptor of               29360000
*                                      coupling facility                29370000
*                                      where structure is allocated.    29380000
*                                      IXLYNDE maps this field.  @D7C*/ 29390000
*       3   *       CHAR(4),        /* See IXLYNDE               @D7C*/ 29400000
*       3   QUASTRCFID CHAR(26),    /* EBCDIC portion of ND.            29410000
*                                      See IXLYNDE               @D7C*/ 29420000
*       3   *       CHAR(2),        /* See IXLYNDE               @D7C*/ 29430000
*      2    *        CHAR(4),       /* Reserved                  @D7C*/ 29440000
*      2    QUASTRCFVERSION BIT(64), /* Structure version.              29450000
*                                      Time structure was allocated.    29460000
*                                                                @P5C*/ 29470000
*        3  QUASTRCFPHYSICALVERSION BIT(64), /* Physical version for    29480000
*                                      the structure.  Changes          29490000
*                                      when a new physical instance     29500000
*                                      of the structure is allocated    29510000
*                                      (e.g., user- or system-managed   29520000
*                                      rebuild), and there is at least  29530000
*                                      one active connector to observe  29540000
*                                      the allocation.           @LEC*/ 29550000
*      2    QUASTRCFMAXCONN FIXED(16), /* Maximum number of connections 29560000
*                                      allowed when structure was       29570000
*                                      allocated in coupling facility.  29580000
*                                      Valid only if structure is       29590000
*                                      QUASTRCFACT, QUASTRCFREBLDOLD,   29600000
*                                      or QUASTRCFREBLDNEW.             29610000
*                                                                @D4A*/ 29620000
*      2    QUASTRCFSTRDUMPID  FIXED(16), /* Structure Dump ID.         29630000
*                                      Non zero value indicates         29640000
*                                      dump table associated with       29650000
*                                      structure.                       29660000
*                                      Valid only if structure is       29670000
*                                      QUASTRCFACT, QUASTRCFREBLDNEW,   29680000
*                                      QUASTRCFREBLDOLD, or             29690000
*                                      QUASTRCFDUMPTBL.                 29700000
*                                                                @D4C*/ 29710000
*      2    *        CHAR(8);       /* Reserved                  @D4C*/ 29720000
*   DECLARE                                                             29730000
*     1    QUASTRCF1  BASED,        /* STRCF record data format         29740000
*                                      for QUAA level 1          @04A*/ 29750000
*       3    * CHAR(LENGTH(QUASTRCF)),  /* Mapped by QUASTRCF    @04A*/ 29760000
*       3    QUASTRCFLOGICALVERSION BIT(64), /* Logical structure       29770000
*                                      version number.  Used in         29780000
*                                      conjunction with the physical    29790000
*                                      version number to identify       29800000
*                                      an instance of a structure.      29810000
*                                      The value of this field is       29820000
*                                      set equal to the physical        29830000
*                                      version number when the          29840000
*                                      structure is initially           29850000
*                                      allocated.  It changes when      29860000
*                                      a process that allocates a       29870000
*                                      new instance of the structure    29880000
*                                      (e.g., rebuild) is               29890000
*                                      user-managed, but not when       29900000
*                                      it is system-managed.     @LDA*/ 29910000
*       3    * CHAR(56);            /* Reserved                  @LCC*/ 29920000
*                                                                       29930000
*   /*****************************************************************/ 29940000
*   /*                                                               */ 29950000
*   /* QUAA data for connector to specified structure            @L2A*/ 29960000
*   /*                                                               */ 29970000
*   /* WARNING! You must use the QUASTRUSERLEN to determine the size */ 29980000
*   /* of the QUASTRUSER that is presented.  This size can change    */ 29990000
*   /* at any time due to new XCF support or service.            @L7A*/ 30000000
*   /*****************************************************************/ 30010000
*                                                                       30020000
*   DECLARE                                                             30030000
*     1    QUASTRUSER BASED,        /* QUAA data for connector to       30040000
*                                      specified structure       @L2A*/ 30050000
*      2    QUASTRUSERTYP BIT(8),   /* X'24' Connector to structure     30060000
*                                      record,                          30070000
*                                      X'A4' Last connector to          30080000
*                                      structure record.         @L2A*/ 30090000
*      2    *        CHAR(1),       /* Reserved X'00'            @L2A*/ 30100000
*      2    QUASTRUSERLEN  FIXED(16), /* Length of record        @L2A*/ 30110000
*      2    QUASTRUSERCONVERSION CHAR(4), /* Connection version  @L2A*/ 30120000
*      2    QUASTRUSERCDATA CHAR(8),  /* Connect data            @L2A*/ 30130000
*      2    QUASTRUSERCNAME CHAR(16), /* Connect name            @L2A*/ 30140000
*      2    QUASTRUSERCLEVEL CHAR(8), /* Connect level           @DBC*/ 30150000
*      2    QUASTRUSERSID  FIXED(32), /* System token for system on     30160000
*                                      which connector was last         30170000
*                                      active                    @D5A*/ 30180000
*       3   QUASTRUSERSNUM FIXED(8),  /* System slot number      @D5A*/ 30190000
*       3   *              FIXED(24), /* Reserved - do not use   @D5A*/ 30200000
*      2    *               CHAR(1),  /* Reserved                @DGC*/ 30210000
*      2    QUASTRUSERINFOLEVEL FIXED(8),  /* Indicates the level of    30220000
*                                      information returned for the     30230000
*                                      connection.               @DGA*/ 30240000
*      2    QUASTRUSERASID  CHAR(2),  /* ASID of connector when         30250000
*                                      last active               @D4A*/ 30260000
*      2    QUASTRUSERDDATA  CHAR(8), /* Disconnect data         @DEA*/ 30270000
*      2    QUASTRUSERCFLEVEL FIXED(32), /* Connect CFLEVEL      @P6A*/ 30280000
*      2    *                CHAR(4), /* Reserved                @P6C*/ 30290000
*      2    QUASTRUSERSYS    CHAR(8), /* System name for system on      30300000
*                                      which connector was last         30310000
*                                      active                    @L2A*/ 30320000
*      2    QUASTRUSERSTKN   CHAR(8), /* Stoken when connector          30330000
*                                      was last active           @L2A*/ 30340000
*      2    QUASTRUSERJOB    CHAR(8), /* Job name / Started task name   30350000
*                                      when connector was last active   30360000
*                                                                @L2A*/ 30370000
*      2    QUASTRUSERFLG1   BIT(8),  /* Flags for state of             30380000
*                                      connection                @L2A*/ 30390000
*       3   QUASTRUSERACT    BIT(1),  /* Active state - connection      30400000
*                                      established.              @L2A*/ 30410000
*       3   QUASTRUSERFAIL   BIT(1),  /* Failed Persistent state -      30420000
*                                      connection with CONDISP=KEEP     30430000
*                                      has failed and all of the        30440000
*                                      event exit responses have been   30450000
*                                      received with RELEASECONN=NO.    30460000
*                                                                @L2A*/ 30470000
*       3   QUASTRUSERTERM   BIT(1),  /* Failing state - connection     30480000
*                                      terminated abnormally and not    30490000
*                                      all of the event exit            30500000
*                                      responses have been received.    30510000
*                                                                @L2A*/ 30520000
*       3   QUASTRUSERDISC   BIT(1),  /* Disconnecting state -          30530000
*                                      connection disconnected and      30540000
*                                      not all of the event exit        30550000
*                                      responses have been received.    30560000
*                                                                @L2A*/ 30570000
*       3   QUASTRUSERDISP   BIT(1),  /* Connected with CONDISP=KEEP    30580000
*                                                                @L2A*/ 30590000
*       3   QUASTRUSERDUAL   BIT(1),  /* Connected to both structures   30600000
*                                      during structure rebuild         30610000
*                                      (IXLREBLD). If structure         30620000
*                                      rebuild has been initiated       30630000
*                                      and 2 structures exist (the      30640000
*                                      original active structure is     30650000
*                                      now the old structure and the    30660000
*                                      2nd structure is the new         30670000
*                                      structure) then the              30680000
*                                      connector is currently           30690000
*                                      connected to both.        @D8A*/ 30700000
*       3   QUASTRUSERALLOWREBLD BIT(1), /* Connected with              30710000
*                                      ALLOWREBLD=YES            @P6A*/ 30720000
*       3   QuaStrUserAllowDupRebld BIT(1), /* Connected with           30730000
*                                      ALLOWDUPREBLD=YES,  indicating   30740000
*                                      that this user allows and        30750000
*                                      supports duplexing rebuild       30760000
*                                      protocols for user-managed       30770000
*                                      duplexing.                @06A*/ 30780000
*      2    QUASTRUSERFLG2   BIT(8),  /* Flags for connectivity state   30790000
*                                      of connected user.        @DEC*/ 30800000
*       3   QUASTRUSERNCSTR  BIT(1), /* If QUASTRSTREBLD is off then    30810000
*                                      the connected user               30820000
*                                      lost connectivity                30830000
*                                      to the active/in use structure.  30840000
*                                      If QUASTRSTREBLD is on then      30850000
*                                      use QUASTRUSERNCSTRNEW and/or    30860000
*                                      QUASTRUSERNCSTROLD.              30870000
*                                                                @DEA*/ 30880000
*       3   QUASTRUSERNCSTRNEW BIT(1), /* If QUASTRSTREBLD is on and    30890000
*                                      QUASTRUSERDUAL is on then        30900000
*                                      the connected user               30910000
*                                      lost connectivity                30920000
*                                      to the new structure.            30930000
*                                                                @DEA*/ 30940000
*       3   QUASTRUSERNCSTROLD BIT(1), /* If QUASTRSTREBLD is on then   30950000
*                                      the connected user               30960000
*                                      lost connectivity                30970000
*                                      to the old structure.            30980000
*                                                                @DEA*/ 30990000
*       3   *                BIT(5), /* Reserved                 @DEA*/ 31000000
*      2    QUASTRUSERCONID  FIXED(8), /* Connection identifier.        31010000
*                                      The connection identifier is     31020000
*                                      used for the bit position within 31030000
*                                      confirm strings. These start     31040000
*                                      with bit position zero.          31050000
*                                      For example,                     31060000
*                                      if connections with connection   31070000
*                                      identifiers 1, 4, and 6 are      31080000
*                                      represented in a confirm string  31090000
*                                      the 1st byte would be '4A'X      31100000
*                                      with all remaining bytes '00'X.  31110000
*                                                                @L2A*/ 31120000
*      2    QUASTRUSERFLG3   BIT(8),  /* Flags for failure isolation    31130000
*                                      information for a user.   @DGC*/ 31140000
*       3   QUASTRUSERFAILISOLSTR  BIT(1), /* This information is only  31150000
*                                      available if QUASTRUSERACT is    31160000
*                                      on and QUASTRUSERINFOLEVEL       31170000
*                                      is equal to or greater than      31180000
*                                      QUASTRUSERINFOLEVEL1.            31190000
*                                      If QUASTRSTREBLD is off,         31200000
*                                      the system from which the user   31210000
*                                      has connected is failure         31220000
*                                      isolated                         31230000
*                                      from the active/in use           31240000
*                                      structure.                       31250000
*                                      If QUASTRSTREBLD is on then      31260000
*                                      use QUASTRUSERFAILISOLSTRNEW     31270000
*                                      and/or                           31280000
*                                      QUASTRUSERFAILISOLSTROLD. @DGA*/ 31290000
*       3   QUASTRUSERFAILISOLSTRNEW BIT(1), /* This information is     31300000
*                                      only                             31310000
*                                      available if QUASTRUSERACT is    31320000
*                                      on and QUASTRUSERINFOLEVEL       31330000
*                                      is equal to or greater than      31340000
*                                      QUASTRUSERINFOLEVEL1.            31350000
*                                      If QUASTRSTREBLD is on           31360000
*                                      and QUASTRUSERDUAL is on then    31370000
*                                      the system from which the user   31380000
*                                      has connected is failure         31390000
*                                      isolated                         31400000
*                                      from the new structure.   @DGA*/ 31410000
*       3   QUASTRUSERFAILISOLSTROLD BIT(1), /* This information is     31420000
*                                      only                             31430000
*                                      available if QUASTRUSERACT is    31440000
*                                      on and QUASTRUSERINFOLEVEL       31450000
*                                      is equal to or greater than      31460000
*                                      QUASTRUSERINFOLEVEL1.            31470000
*                                      If QUASTRSTREBLD is on,          31480000
*                                      the system from which the user   31490000
*                                      has connected is failure         31500000
*                                      isolated                         31510000
*                                      from the old structure.   @DGA*/ 31520000
*       3   QUASTRUSERNONVOLREQ BIT(1), /* When ON, the user            31530000
*                                      specified IXLCONN                31540000
*                                      NONVOLREQ=YES.  Valid only       31550000
*                                      when QUASTRUSERACT is on. @LDA*/ 31560000
*       3   *                BIT(4), /* Reserved                 @LDC*/ 31570000
*      2    QUASTRUSERFLG4   BIT(8),  /* Flags for rebuild              31580000
*                                      information for a user.   @LCA*/ 31590000
*       3   QUASTRUSERALLOWAUTO BIT(1), /* When ON, this field          31600000
*                                       indicates that the user         31610000
*                                       specified IXLCONN with          31620000
*                                       ALLOWAUTO=YES            @LCA*/ 31630000
*       3   * BIT(1),                /* Reserved                 @LEC*/ 31640000
*       3   QUASTRUSERSUSPEND BIT(1), /* When ON, the user specified    31650000
*                                       IXLCONN with ALLOWAUTO=YES      31660000
*                                       SUSPEND=YES.  See also          31670000
*                                       QUASTRUSERSUSPENDFAIL.          31680000
*                                       Valid only when                 31690000
*                                       QUASTRUSERALLOWAUTO is ON.      31700000
*                                       Applicable only when            31710000
*                                       QUASTRUSERACT is ON.     @0DC*/ 31720000
*       3   QUASTRUSERSUSPENDFAIL BIT(1), /* When ON, the user          31730000
*                                       IXLCONN with ALLOWAUTO=YES              
*                                       SUSPEND=FAIL.  When both                
*                                       QUASTRUSERSUSPEND and                   
*                                       QUASTRUSERSUSPENDFAIL                   
*                                       are OFF, the user                       
*                                       specified IXLCONN with                  
*                                       SUSPEND=NO.                             
*                                       Valid only when                         
*                                       QUASTRUSERALLOWAUTO is ON.              
*                                       Applicable only when                    
*                                       QUASTRUSERACT is ON.     @0DA*/         
*       3   *                BIT(4), /* Reserved                 @0DC*/         
*      2    QUASTRUSERRSVD   CHAR(11), /* Reserved               @DGC*/ 31750000
*      2    QUASTRUSERALTER,        /* Structure alter data             31760000
*                                      as specified by connection       31770000
*                                      via IXLCONN.              @L6A*/ 31780000
*       3   QUASTRUSERALTERFLG BIT(16), /* Structure alter flags        31790000
*                                                                @L6A*/ 31800000
*        4  QUASTRUSERALTERALLOWED BIT(1), /* Structure alter allowed.  31810000
*                                      IXLCONN specified with           31820000
*                                      ALLOWALTER=YES            @L6A*/ 31830000
*        4  QUASTRUSERALTERRATIO BIT(1), /* Structure alter permits     31840000
*                                      change to ratio.                 31850000
*                                      IXLCONN specified with           31860000
*                                      RATIO=YES.                @L6A*/ 31870000
*       3   QUASTRUSERALTERMINENTRY FIXED(8), /* Value specified on     31880000
*                                      IXLCONN for MINENTRY.     @L6A*/ 31890000
*       3   QUASTRUSERALTERMINELEMENT FIXED(8), /* Value specified on   31900000
*                                      IXLCONN for MINELEMENT.   @L6A*/ 31910000
*      2    QUASTRUSERCONTOKEN CHAR(16),  /* Contoken for the user.     31920000
*                                      This is always the original      31930000
*                                      contoken returned on IXLCONN.    31940000
*                                      The temporary contoken returned  31950000
*                                      on IXLCONN REBUILD is not        31960000
*                                      returned.                 @DGA*/ 31970000
*      2    QUASTRUSERALTER2,       /* More structure alter data        31980000
*                                      as specified by connection       31990000
*                                      via IXLCONN.              @05A*/ 32000000
*       3   QUASTRUSERALTERMINEMC FIXED(8), /* Value specified on       32010000
*                                      IXLCONN for MINEMC.       @05A*/ 32020000
*       3   *               CHAR(3),  /* Reserved                @05A*/ 32030000
*      2    QUASTRUSERRSVD2 CHAR(8);  /* Reserved                @05A*/ 32040000
*                                                                       32050000
*   DECLARE                                                             32060000
*     1    QUASTRUSER1  BASED,      /* STRUSER record data format       32070000
*                                      for QUAA level 1          @04A*/ 32080000
*       3    * CHAR(LENGTH(QUASTRUSER)), /* Mapped by QUASTRUSER @04A*/ 32090000
*       3    QUASTRUSERDISCFAILEDCONFSTRING CHAR(32), /* User's         32100000
*                                      current disconnect/failure       32110000
*                                      confirm string. Valid only for   32120000
*                                      unserialized structures   @04A*/ 32130000
*       3    * CHAR(88);            /* Reserved                  @04A*/ 32140000
*   /*****************************************************************/ 32150000
*   /*                                                               */ 32160000
*   /* QUAA data for system-specific information for specified       */ 32170000
*   /* structure                                                 @LDA*/ 32180000
*   /*                                                               */ 32190000
*   /* WARNING! You must use QUASTRSYSLEN to determine the size      */ 32200000
*   /* of the QUASTRSYS that is presented.  This size can change     */ 32210000
*   /* at any time due to new XCF support or service.            @LDA*/ 32220000
*   /*****************************************************************/ 32230000
*                                                                       32240000
*   DECLARE                                                             32250000
*     1    QUASTRSYS BASED,         /* QUAA data for system-specific    32260000
*                                      information for specified        32270000
*                                      structure                 @LDA*/ 32280000
*      2    QUASTRSYSTYP BIT(8),    /* X'25' System-info structure      32290000
*                                      record,                          32300000
*                                      X'A5' Last system-info           32310000
*                                      structure record.         @LDA*/ 32320000
*      2    *        CHAR(1),       /* Reserved X'00'            @LDA*/ 32330000
*      2    QUASTRSYSLEN  FIXED(16), /* Length of record         @LDA*/ 32340000
*      2    QUASTRSYSNAME CHAR(8),  /* System name               @LDA*/ 32350000
*      2    QUASTRSYSSID FIXED(32), /* System token              @LDA*/ 32360000
*        3   QUASTRSYSNUM FIXED(8), /* System slot number        @LDA*/ 32370000
*        3   *        FIXED(24),    /* Reserved - DO NOT USE     @LDA*/ 32380000
*      2    QUASTRSYSFLAGS BIT(32), /* System-related flags      @LDA*/ 32390000
*        3   QUASTRSYSFLAGS1 BIT(8), /* First byte of flags      @LDA*/ 32400000
*         4   QUASTRSYSALLOCATING BIT(1), /* This system is             32410000
*                                      in the process of allocating     32420000
*                                      the new structure during         32430000
*                                      the allocate phase of            32440000
*                                      a system-managed process         32450000
*                                      (e.g., rebuild)           @LDA*/ 32460000
*         4   QUASTRSYSATTACHING BIT(1), /* This system is              32470000
*                                      in the process of attaching      32480000
*                                      connectors to the new            32490000
*                                      structure during the             32500000
*                                      attach phase of a system-        32510000
*                                      managed process                  32520000
*                                      (e.g., rebuild)           @LDA*/ 32530000
*         4   QUASTRSYSATTACHED BIT(1), /* This system has              32540000
*                                      successfully attached            32550000
*                                      connectors to the new            32560000
*                                      structure during the             32570000
*                                      attach phase of a system-        32580000
*                                      managed process                  32590000
*                                      (e.g., rebuild)           @LDA*/ 32600000
*         4   QUASTRSYSCOPYWORKING BIT(1), /* This system is            32610000
*                                      participating in the copy        32620000
*                                      phase of a system-managed        32630000
*                                      process (e.g., rebuild)   @LDA*/ 32640000
*         4   QUASTRSYSCOPYFAILED BIT(1), /* This system was            32650000
*                                      participating in the copy        32660000
*                                      phase of a system-managed        32670000
*                                      process (e.g., rebuild),         32680000
*                                      but has failed.           @LDA*/ 32690000
*         4   QUASTRSYSCOPYSTOPPING BIT(1), /* This system is           32700000
*                                      participating in the copy        32710000
*                                      stop phase of a system-          32720000
*                                      managed process (e.g.,           32730000
*                                      rebuild), and is stopping        32740000
*                                      the copy process.         @LDA*/ 32750000
*         4   QUASTRSYSCOPYSTOPPED BIT(1), /* This system was           32760000
*                                      participating in the copy        32770000
*                                      stop phase of a system-          32780000
*                                      managed process (e.g.,           32790000
*                                      rebuild), and has now            32800000
*                                      stopped.                  @LDA*/ 32810000
*         4   * BIT(1),             /* Reserved                  @LDA*/ 32820000
*        3   QUASTRSYSFLAGS2 BIT(8), /* Second byte of flags     @LDA*/ 32830000
*        3   QUASTRSYSFLAGS3 BIT(8), /* Third byte of flags      @LDA*/ 32840000
*        3   QUASTRSYSFLAGS4 BIT(8), /* Fourth byte of flags     @LDA*/ 32850000
*      2    * CHAR(44);             /* Reserved                  @LDA*/ 32860000
*                                                                       32870000
*   /*****************************************************************/ 32880000
*   /*                                                               */ 32890000
*   /* QUAA data for ARM element status information                  */ 32900000
*   /*                                                           @L4A*/ 32910000
*   /* WARNING! You must use the QUAARMSLEN to determine the size    */ 32920000
*   /* of the QUAARMS that is presented.  This size can change       */ 32930000
*   /* at any time due to new XCF support or service.            @L7A*/ 32940000
*   /*                                                           @L4A*/ 32950000
*   /*****************************************************************/ 32960000
*                                                                       32970000
*   DECLARE                                                             32980000
*     1    QUAARMS    BASED,           /* QUAA data for ARM element     32990000
*                                         status.                @L4A*/ 33000000
*      2    QUAARMSTYP      BIT(8),    /* X'30' ARM element status      33010000
*                                         record,                       33020000
*                                         X'B0' Last ARM element        33030000
*                                         status record.         @L4A*/ 33040000
*      2    *               CHAR(1),   /* Reserved X'00'         @L4A*/ 33050000
*      2    QUAARMSLEN      FIXED(16), /* Length of record       @L4A*/ 33060000
*      2    QUAARMSELEMENT  CHAR(16),  /* Element name           @L4A*/ 33070000
*      2    QUAARMSINITSYS  CHAR(8),   /* Name of system on which       33080000
*                                         element initially registered  33090000
*                                         with ARM.  This will either   33100000
*                                         be the first registration or  33110000
*                                         the first registration after  33120000
*                                         the element was deregistered  33130000
*                                         (either explicitly or by      33140000
*                                         ARM).                         33150000
*                                                                @L4A*/ 33160000
*      2    QUAARMSCURRSYS  CHAR(8),   /* Name of system on which       33170000
*                                         element is now running        33180000
*                                         (or most recently ran if the  33190000
*                                         element state is FAILED)      33200000
*                                                                @L4A*/ 33210000
*      2    QUAARMSINITCLONE CHAR(2),  /* Clone ID of system on which   33220000
*                                         element initially             33230000
*                                         registered.            @L4A*/ 33240000
*      2    *               CHAR(2),   /* Reserved               @DFA*/ 33250000
*      2    QUAARMSTOTELEMENTS FIXED(31),/* The total number of         33260000
*                                         elements                      33270000
*                                         currently registered with     33280000
*                                         ARM.                   @DFA*/ 33290000
*      2    QUAARMSMAXELEMENTS FIXED(31),/* The maximum number of       33300000
*                                         elements that are able to be  33310000
*                                         registered with ARM.   @DFA*/ 33320000
*      2    *               CHAR(32),  /* Reserved               @DFC*/ 33330000
*      2    QUAARMSJESGROUP CHAR(8),   /* Name of JESGROUP to which     33340000
*                                         this element belongs and      33350000
*                                        under which this element runs. 33360003
*                                         Blank if element registered   33370000
*                                         with ELEMBIND=CURSYS.  @LFC*/ 33380000
*      2    QUAARMSRESTARTGROUP CHAR(16),/* Name of the restart group   33390000
*                                         to which this element belongs 33400000
*                                                                @P9C*/ 33410000
*      2    QUAARMSJOBNAME  CHAR(8),   /* Name of the address space     33420000
*                                         where the element registered. 33430000
*                                         Flags QUAARMSBATCHJOB and     33440000
*                                         QUAARMSSTARTEDTSK indicate    33450000
*                                         whether this name is of a     33460000
*                                         job or a started task. @LFC*/ 33470000
*      2    QUAARMSSTOKEN   CHAR(8),   /* STOKEN for the address space  33480000
*                                         under which the element       33490000
*                                         last registered.       @LFC*/ 33500000
*      2    QUAARMSASID     FIXED(16), /* ASID for the address space    33510000
*                                         under which the element       33520000
*                                         last registered.       @LFC*/ 33530000
*      2    QUAARMSLEVEL    FIXED(16), /* Level number for this         33540000
*                                         element, determined by        33550000
*                                         ELEMTYPE on the register      33560000
*                                         request and by LEVEL          33570000
*                                         specified in the current      33580000
*                                         policy.                @L4A*/ 33590000
*      2    QUAARMSELEMTYPE CHAR(8),   /* Element type specified on     33600000
*                                         the register request.  @L4A*/ 33610000
*      2    QUAARMSFLAGS    BIT(32),   /* Flags for status       @L4A*/ 33620000
*       3    QUAARMSSTATEFLAGS BIT(8), /* Flags for element status      33630000
*                                                                @L4A*/ 33640000
*        4    QUAARMSSTARTING  BIT(1), /* Element is starting    @L4A*/ 33650000
*        4    QUAARMSAVAILABLE BIT(1), /* Element is available   @L4A*/ 33660000
*        4    QUAARMSFAILED    BIT(1), /* Element is failed      @L4A*/ 33670000
*        4    QUAARMSRSTING    BIT(1), /* Element is restarting  @L4A*/ 33680000
*        4    QUAARMSRCVING    BIT(1), /* Element is recovering  @L4A*/ 33690000
*        4    *                BIT(3), /* Reserved               @L4A*/ 33700000
*       3    QUAARMSGENFLAGS   BIT(8), /* Flags for general ARM data    33710000
*                                                                @L4A*/ 33720000
*        4    QUAARMSENABLED   BIT(1), /* ARM restarts are presently    33730000
*                                         enabled in the sysplex @L4A*/ 33740000
*        4    QUAARMSFDSWARNING BIT(1),/* All ARM systems are not       33750000
*                                         currently connected to the    33760000
*                                         FDS.  Data may not be         33770000
*                                         current.               @L4A*/ 33780000
*        4    *                BIT(6), /* Reserved               @L4A*/ 33790000
*       3    QUAARMSFLAGS3     BIT(8), /* Third flag byte        @L4A*/ 33800000
*        4    QUAARMSBATCHJOB  BIT(1), /* Element is a batch job @L4A*/ 33810000
*        4    QUAARMSSTARTEDTSK BIT(1),/* Element is a started task     33820000
*                                                                @L4A*/ 33830000
*        4    QUAARMSBACKING   BIT(1), /* This element is backing up    33840000
*                                         the indicated associated      33850000
*                                         element.               @L4A*/ 33860000
*        4    QUAARMSBACKED    BIT(1), /* This element is being         33870000
*                                         backed up by the indicated    33880000
*                                         associated element.    @L4A*/ 33890000
*        4    QUAARMSOVERRIDEJCL BIT(1),/* This element has override    33900000
*                                         jcl.                          33910000
*                                                                @L4A*/ 33920000
*        4    QUAARMSOVERRIDESTART BIT(1),/* This element has override  33930000
*                                         start text.                   33940000
*                                                                @L4A*/ 33950000
*        4    QUAARMSTIMEDOUT  BIT(1), /* This element has become       33960000
*                                         AVAILABLE due to a Ready      33970000
*                                         Timeout                @DFA*/ 33980000
*        4    QUAARMSTERMTYPEALLTERM BIT(1), /* TERMTYPE=ALLTERM is     33990000
*                                         in effect.             @LFA*/ 34000000
*       3    QUAARMSFLAGS4     BIT(8), /* Fourth flag byte       @L4A*/ 34010000
*        4    QUAARMSNORESTART BIT(1), /* Current policy prohibits an   34020000
*                                         ARM restart of this element.  34030000
*                                         Restart_Attempts is zero.     34040000
*                                                                @L4A*/ 34050000
*        4    QUAARMSNOSYSRESTART BIT(1), /* Element is prohibited to   34060000
*                                         restart on another system.    34070000
*                                         This is determined by the     34080000
*                                         TERMTYPE values specified in  34090000
*                                         the current policy and on the 34100000
*                                         register request.      @L4A*/ 34110000
*         5    QUAARMSTERMTYPEELEMTERM BIT(1), /* TERMTYPE=ELEMTERM is  34120000
*                                         in effect.             @LFA*/ 34130000
*        4    QUAARMSTERMTYPESYSTERM BIT(1), /* TERMTYPE=SYSTERM is     34140000
*                                         in effect.                    34150000
*                             Value is determined from                  34160000
*                             TERMTYPE specification on the register    34170000
*                             request and TERMTYPE specification        34180000
*                             in the ARM policy.                        34190000
*                             On-> TERMTYPE specified is                34200000
*                             SYSTERM which prevents this               34210000
*                             element from being restarted on           34220000
*                             the system where it is                    34230000
*                             registered. This element will             34240000
*                             be restarted when the system it           34250000
*                             is registered on fails.                   34260000
*                             Off->Termination type does not            34270000
*                             prevent element from being restarted on   34280000
*                             the system where it is registered. @LFA*/ 34290000
*        4    QUAARMSELEMBINDCURSYS BIT(1),/*                           34300000
*                              On -> Element was registered with        34310000
*                              ELEMBIND=CURSYS.                         34320000
*                              Element has a minimum bind to the system 34330000
*                            on which it registered. The job or started 34340000
*                              task in QuaArmsJobName is not            34350000
*                              restarted when this element fails.       34360000
*                              QuaArmsJobName only indicates the        34370000
*                              job or started task under which          34380000
*                              this element was registered, if any.     34390000
*                           Off -> Element does not have a minimum bind 34400000
*                              to the system on which it registered.    34401000
*                                                                @LFA*/ 34402000
*        4    QUAARMSRSTINGINFO  BIT(4),  /* QUAARMSRSTING qualifying   34403000
*                                         information.  These bits      34404000
*                                         contain additional            34405000
*                                         qualifying information for    34406000
*                                         an element that is in a       34407000
*                                         restarting state.  NOTE:      34408000
*                                         THIS INFORMATION IS ONLY      34409000
*                                         PROVIDED ON THE SYSTEM WHERE  34409100
*                                         THE ELEMENT IS BEING          34409200
*                                         RESTARTED              @PFA*/ 34409300
*         5    QUAARMSRSTINGINERE BIT(1), /* Element is in a            34409400
*                                         restarting state.  The        34409500
*                                         automatic restart manager     34409600
*                                         has gotten to the point in    34409700
*                                         restart processing where it   34409800
*                                         calls the element restart     34409900
*                                         exits(s).  No exits may have  34410000
*                                         been called, an exit may be   34410100
*                                         in control, or all exits may  34410200
*                                         have returned.  NOTE: THIS    34410300
*                                         INFORMATION IS ONLY PROVIDED  34410400
*                                         ON THE SYSTEM WHERE THE       34410500
*                                         ELEMENT IS BEING RESTARTED    34410600
*                                                                @PFA*/ 34410700
*         5    QUAARMSRSTINGINEVE BIT(1), /* Element is in a            34410800
*                                         restarting The element's      34410900
*                                         event exit is currently in    34411000
*                                         control or has returned       34412000
*                                         control to ARM.  NOTEs: 1)    34413000
*                                         THIS INFORMATION IS ONLY      34414000
*                                         PROVIDED ON THE SYSTEM WHERE  34415000
*                                         THE ELEMENT IS BEING          34416000
*                                         RESTARTED 2) Unlike the       34417000
*                                         QUAARMSRSTINGINERE bit, this  34418000
*                                         bit is only set when the      34419000
*                                         element has provided an       34420000
*                                         Event Exit during             34430000
*                                         registration.          @PFA*/ 34440000
*         5    QUAARMSRSTCOMMITED BIT(1), /* Element is in a            34450000
*                                         restarting state.  ARM has    34460000
*                                         initiated the restart of the  34470000
*                                         element by implementing the   34480000
*                                         restart method.  NOTE: THIS   34490000
*                                         INFORMATION IS ONLY PROVIDED  34500000
*                                         ON THE SYSTEM WHERE THE       34510000
*                                         ELEMENT IS BEING RESTARTED    34520000
*                                                                @PFA*/ 34530000
*         5   *                BIT(1), /* Reserved               @PFC*/ 34540000
*      2    QUAARMSREGTIME  CHAR(8),   /* TOD Clock value when the      34550000
*                                         element initially registered  34560000
*                                         with ARM.  This will either   34570000
*                                         be the first registration or  34580000
*                                         the first registration after  34590000
*                                         the element was deregistered  34600000
*                                         (either explicitly or by      34610000
*                                         ARM).                         34620000
*                                                                @L4A*/ 34630000
*      2    QUAARMSFSTRSTRT CHAR(8),   /* TOD Clock value at first      34640000
*                                         restart                @L4A*/ 34650000
*      2    QUAARMSLSTRSTRT CHAR(8),   /* TOD Clock value at most       34660000
*                                         recent restart         @L4A*/ 34670000
*      2    QUAARMSRESTARTCOUNTS,      /* Restart counts         @L4A*/ 34680000
*        4    QUAARMSTOTALRESTARTS FIXED(31),/* Total number of         34690000
*                                         restarts since the elements   34700000
*                                         initial registration   @L4A*/ 34710000
*        4    QUAARMSNUMRESTARTS FIXED(16),/* Number of restarts of     34720000
*                                         the element that occurred     34730000
*                                         from the time this command    34740000
*                                         was invoked back the number   34750000
*                                         of seconds specified in the   34760000
*                                         current policy.        @L4A*/ 34770000
*        4    QUAARMSMAXRESTARTS FIXED(16),/* Maximum number of         34780000
*                                         restarts attempts ARM will    34790000
*                                         attempt in a given interval,  34800000
*                                         as specified in the current   34810000
*                                         policy.                @L4A*/ 34820000
*        4    QUAARMSRESTARTINT FIXED(31),/* Interval (in seconds)      34830000
*                                         over which the restarts       34840000
*                                         are counted, as specified     34850000
*                                         in the current policy. @L4A*/ 34860000
*      2    QUAARMSEVENTEXITNAME CHAR(8), /* Name of element's          34870000
*                                         event-exit routine     @L4A*/ 34880000
*      2    QUAARMSASSOCELEMENT  CHAR(16),/* Name of associated         34890000
*                                         element.  QUAARMSBACKING and  34900000
*                                         QUAARMSBACKED flags can be    34910000
*                                         used to determine if this     34920000
*                                         element name is the primary   34930000
*                                         element or the backup element 34940000
*                                                                @L4A*/ 34950000
*      2    QUAARMSASSOCSYSNAME  CHAR(8), /* Name of system on which    34960000
*                                         associated element is         34970000
*                                         running.               @L4A*/ 34980000
*      2    QUAARMSRESTARTTIMEOUT FIXED(31), /* Restart timeout         34990000
*                                         interval                      35000000
*                                         used to determine how long    35010000
*                                         how long the Automatic        35020000
*                                         Restart Manager should wait   35030000
*                                         for the element to reregister 35040000
*                                         after having been restarted   35050000
*                                                                @PDA*/ 35060000
*      2    QUAARMSREADYTIMEOUT  FIXED(31), /* Ready timeout interval   35070000
*                                         used to determine how long    35080000
*                                         the Automatic Restart Manager 35090000
*                                         should wait for the element   35100000
*                                         to become ready before        35110000
*                                         automatically considering     35120000
*                                         the element to be ready       35130000
*                                                                @PDA*/ 35140000
*      2    QUAARMSRESTARTPACING FIXED(31), /* Restart pacing           35150000
*                                         interval used between the     35160000
*                                         restart of each element in    35170000
*                                         the restart group.  It is     35180000
*                                         determined by the             35190000
*                                         RESTART_PACING interval       35200000
*                                         in the policy          @PDA*/ 35210000
*      2    QUAARMSFREECSA  FIXED(31), /* The number of kilobytes of    35220000
*                                         CSA that must be available    35230000
*                                         on the target system for this 35240000
*                                         restart group to be restarted 35250000
*                                                                @PDA*/ 35260000
*      2    QUAARMSFREEECSA  FIXED(31),/* The number of kilobytes of    35270000
*                                         ECSA that must be available   35280000
*                                         on the target system for this 35290000
*                                         restart group to be restarted 35300000
*                                                                @PDA*/ 35310000
*      2    QUAArmsRMToken  CHAR(16), /* RMtoken identifying this       35320000
*                                        registration. Same as          35330000
*                                       returned by the RMTOKEN keyword 35340002
*                                        on the register request, if    35350000
*                                        specified.              @LFA*/ 35360000
*      2    QUAARMSRSVD     CHAR(16);  /* Reserved               @PDC*/ 35370000
*                                                                       35380000
*                                                                       35390000
*                                                                       35400000
*   /*****************************************************************/ 35410000
*   /*                                                               */ 35420000
*   /* Mapping for area returned by IXCQUERY REQINFO=FEATURES        */ 35430000
*   /*                                                               */ 35440000
*   /* Note:  Does NOT conform to other QUAA submappings, in that    */ 35450000
*   /* it does NOT include TYPE or LAST indications, and is NOT      */ 35460000
*   /* subject to the QUAALEVEL keyword.                             */ 35470000
*   /*                                                           @03A*/ 35480000
*   /*****************************************************************/ 35490000
*                                                                       35500000
*   DECLARE                                                             35510000
*     1    QUREQFEATURES BASED CHAR(32), /* Data for Query              35520000
*                                         REQINFO=FEATURES       @03A*/ 35530000
*      3    QUREQFEATURES1  bit(32),    /* First word of Features       35540000
*                                         flags                  @03A*/ 35550000
*       4    QUREQFEATURES1a bit(8), /*                          @0CA*/ 35560004
*        5    QUREQRFPROXYRESPONSE BIT(1), /* ProxyResponse Feature is  35570004
*                                       available for IXLUSYNC,         35580004
*                                       IXLEERSP REQUEST=REBLDCOMPLETE  35590004
*                                       and IXLEERSP REQUEST=REBLDSTOP  35600004
*                                                                @03A*/ 35610004
*        5    QUREQRFUSYNCCOMPCODE BIT(1), /* IXLUSYNC COMPCODE         35620004
*                                         function is available on      35630004
*                                         this system            @04A*/ 35640004
*          6    QUREQRFREBUILDPCTLOSSCONN BIT(1), /* Percent lossconn   35650004
*                                         is available for rebuild      35660004
*                                         events on this system  @04A*/ 35670004
*        5    QuReqRfRebuildDuplex BIT(1), /* Duplexing rebuild support 35680004
*                                        for user-managed duplexing is  35690004
*                                        available on this              35700004
*                                        system                  @06A*/ 35710004
*        5    QUREQRFIXLMGHWSTATCF BIT(1), /* HWSTATISTICS(CF) for      35720004
*                                         IXLMG is supported on this    35730004
*                                         system                 @LBA*/ 35740004
*        5    QUREQRFIXLRTRDATATYPE BIT(1), /* IXLRT RDATATYPE          35750004
*                                         function is available on      35760004
*                                         this system            @07A*/ 35770004
*        5    QUREQRFIXLCONNSUSPENDFAIL BIT(1), /* IXLCONN                      
*                                             SUSPEND FAIL                      
*                                             supported on this                 
*                                             system             @0DC*/         
*        5    QUREQRFRETURNRDATATYPE BIT(1), /* IXLRT support to return 35772004
*                                         the RDATATYPE for record data 35773004
*                                         entries that are read is      35774004
*                                         available on this             35775004
*                                         system                 @0BA*/ 35776004
*        5    QUREQRFDeMeBufferSize BIT(1), /* DELETE_ENTRYLIST and             
*                                         MOVE_ENTRYLIST buffer size            
*                                         requirements relaxation               
*                                         available on this                     
*                                         system                 @0EC*/         
*       4    QUREQFEATURES1b   bit(8), /*                       @0CA*/  35778004
*        5    QUReqRfDetailedXcfStatus bit(1), /* IXCMG TYPE=MEMBER and 35779004
*                                      AMDALEVEL=1 support is available 35779104
*                                      on this system.           @0CA*/ 35779204
*        5    * bit(7),             /* Reserved                  @0CA*/ 35779304
*       4    QUREQFEATURES1c    bit(8), /* Reserved              @0CA*/ 35779404
*       4    QUREQFEATURES1d    bit(8), /* Reserved              @0CA*/ 35779504
*      3    * char(28);                /* Reserved               @03A*/ 35780000
*                                                                       35790000
*                                                                       35800000
*   /*****************************************************************/ 35810000
*   /*                                                               */ 35820000
*   /* Constants defining member states denoted by field QUAMSTA1    */ 35830000
*   /*                                                               */ 35840000
*   /*****************************************************************/ 35850000
*                                                                       35860000
*   DECLARE                                                             35870000
*     QUAMSCRE CONSTANT(2),         /* Member State = CREATED        */ 35880000
*     QUAMSACT CONSTANT(3),         /* Member State = ACTIVE         */ 35890000
*     QUAMSQUI CONSTANT(4),         /* Member State = QUIESCED       */ 35900000
*     QUAMSFLD CONSTANT(5);         /* Member State = FAILED         */ 35910000
*                                                                       35920000
*   /*****************************************************************/ 35930000
*   /*                                                               */ 35940000
*   /* Constants defining record types                           @L2A*/ 35950000
*   /*                                                               */ 35960000
*   /*****************************************************************/ 35970000
*                                                                       35980000
*   DECLARE                                                             35990000
*     QUATYPGRP BIT(8) CONSTANT('00'X), /* Record type - Group (QUAGRP) 36000000
*                                                                @L2A*/ 36010000
*     QUATYPGRP_LAST BIT(8) CONSTANT('80'X), /* Record type - Last      36020000
*                                      Group                            36030000
*                                                                @L2A*/ 36040000
*     QUATYPMEM BIT(8) CONSTANT('01'X), /* Record type - Member         36050000
*                                      (QUAMEM)                  @L2A*/ 36060000
*     QUATYPMEM_LAST BIT(8) CONSTANT('81'X), /* Record type - Last      36070000
*                                      Member                           36080000
*                                                                @L2A*/ 36090000
*     QUATYPSYS BIT(8) CONSTANT('02'X), /* Record type - Sysplex        36100000
*                                      (QUASYS)                         36110000
*                                                                @L2A*/ 36120000
*     QUATYPSYS_LAST BIT(8) CONSTANT('82'X), /* Record type - Last      36130000
*                                      Sysplex                          36140000
*                                                                @L2A*/ 36150000
*     QUATYPCF BIT(8) CONSTANT('10'X), /* Record type - Coupling        36160000
*                                      facility (QUACF)          @L2A*/ 36170000
*     QUATYPCF_LAST BIT(8) CONSTANT('90'X), /* Record type - Last       36180000
*                                      coupling facility         @L2A*/ 36190000
*     QUATYPCFSC BIT(8) CONSTANT('11'X), /* Record type - Systems       36200000
*                                      connected to specified           36210000
*                                      coupling facility (QUACFSC)      36220000
*                                                                @L2A*/ 36230000
*     QUATYPCFSC_LAST BIT(8) CONSTANT('91'X), /* Record type - Last     36240000
*                                      system connected to specified    36250000
*                                      coupling facility         @L2A*/ 36260000
*     QUATYPCFSTR BIT(8) CONSTANT('12'X), /* Record type - Structures   36270000
*                                      in specified coupling facility   36280000
*                                      (QUACFSTR)                @L2A*/ 36290000
*     QUATYPCFSTR_LAST BIT(8) CONSTANT('92'X), /* Record type - Last    36300000
*                                      structure in specified           36310000
*                                      coupling facility         @L2A*/ 36320000
*     QUATYPSTR BIT(8) CONSTANT('20'X), /* Record type - Structure      36330000
*                                      (QUASTR)                         36340000
*                                                                @L2A*/ 36350000
*     QUATYPSTR_LAST BIT(8) CONSTANT('A0'X), /* Record type - Last      36360000
*                                      structure                        36370000
*                                                                @L2A*/ 36380000
*     QUATYPSTRPL BIT(8) CONSTANT('21'X), /* Record type -              36390000
*                                      Structure preference list entry  36400000
*                                      (QUASTRPL)                @L2A*/ 36410000
*     QUATYPSTRPL_LAST BIT(8) CONSTANT('A1'X), /* Record type - Last    36420000
*                                      structure preference list        36430000
*                                      entry                     @L2A*/ 36440000
*     QUATYPSTRXL BIT(8) CONSTANT('22'X), /* Record type -              36450000
*                                      Structure exclusion list entry   36460000
*                                      (QUASTRXL)                @L2A*/ 36470000
*     QUATYPSTRXL_LAST BIT(8) CONSTANT('A2'X), /* Record type - Last    36480000
*                                      structure exclusion list         36490000
*                                      entry                     @L2A*/ 36500000
*     QUATYPSTRCF BIT(8) CONSTANT('23'X), /* Record type - Coupling     36510000
*                                      facility for allocated           36520000
*                                      structure (QUASTRCF)      @L2A*/ 36530000
*     QUATYPSTRCF_LAST BIT(8) CONSTANT('A3'X), /* Record type - Last    36540000
*                                      coupling facility for allocated  36550000
*                                      structure                 @L2A*/ 36560000
*     QUATYPSTRU BIT(8) CONSTANT('24'X), /* Record type - Structure     36570000
*                                      connector data (QUASTRUSER)      36580000
*                                                                @L2A*/ 36590000
*     QUATYPSTRU_LAST BIT(8) CONSTANT('A4'X), /* Record type - Last     36600000
*                                      structure connector data  @L2A*/ 36610000
*     QUATYPSTRSYS BIT(8) CONSTANT('25'X), /* Record type - Structure   36620000
*                                      system data (QUASTRSYS)   @LDA*/ 36630000
*     QUATYPSTRSYS_LAST BIT(8) CONSTANT('A5'X), /* Record type - Last   36640000
*                                      structure system data     @LDA*/ 36650000
*     QUATYPARMS BIT(8) CONSTANT('30'X), /* Record type - ARM element   36660000
*                                      Status (QUAARMS)          @L4A*/ 36670000
*     QUATYPARMS_LAST BIT(8) CONSTANT('B0'X); /* Record type - Last     36680000
*                                      ARM Element Status        @L4A*/ 36690000
*                                                                       36700000
*   /*****************************************************************/ 36710000
*   /*                                                               */ 36720000
*   /* Constants defining service codes                          @L2A*/ 36730000
*   /*                                                               */ 36740000
*   /*****************************************************************/ 36750000
*                                                                       36760000
*   DECLARE                                                             36770000
*     QUASERV_CFRM FIXED(8) CONSTANT(4); /* Query CFRM information      36780000
*                                      function code. It indicates      36790000
*                                      the request type (REQTYPE) and   36800000
*                                      is the 2nd byte of 1st word in   36810000
*                                      the IXCQUERY parameter list.     36820000
*                                      Note: This constant is used by   36830000
*                                            XCF Resource Management.   36840000
*                                            It is hardcoded in         36850000
*                                            IXCQUERY macro.            36860000
*                                                                @L2A*/ 36870000
*   /*****************************************************************/ 36880000
*   /*                                                               */ 36890000
*   /* Constants for QuaStrUserInfoLevel                         @DGA*/ 36900000
*   /*                                                               */ 36910000
*   /*****************************************************************/ 36920000
*                                                                       36930000
*   DECLARE                                                             36940000
*     QUASTRUSERINFOLEVEL1  FIXED(8) CONSTANT(1);              /*@DGA*/ 36950000
*                                                                       36960000
*   /*****************************************************************/ 36970000
*   /*                                                               */ 36980000
*   /* Constants defining reason codes                               */ 36990000
*   /*                                                               */ 37000000
*   /*****************************************************************/ 37010000
*   /* reason code for return code = '04'X (warning)                 */ 37020000
*   /*****************************************************************/ 37030000
*   DECLARE                                                             37040000
*     QUAARSNrecordsremain BIT(32) CONSTANT('00000004'X); /* Reason     37050000
*                                      code for IXCQUERY completed      37060000
*                                      successfully and provided some   37070000
*                                      data, however, ANSAREA is too    37080000
*                                      small to contain all the         37090000
*                                      requested data.           @D5A*/ 37100000
*   /*****************************************************************/ 37110000
*   /* reason code for return code = '08'X (invalid parameters)      */ 37120000
*   /*****************************************************************/ 37130000
*   DECLARE                                                             37140000
*     QUAARSNgroupnotfound BIT(32) CONSTANT('00000004'X); /* Reason     37150000
*                                      code for the group name          37160000
*                                      specified is not defined         37170000
*                                      to XCF.                   @D5A*/ 37180000
*   DECLARE                                                             37190000
*     QUAARSNreqinfonotvalid BIT(32) CONSTANT('00000008'X); /* Reason   37200000
*                                      code for the REQINFO information 37210000
*                                      is not valid.             @D5A*/ 37220000
*   DECLARE                                                             37230000
*     QUAARSNreqtypeincor    BIT(32) CONSTANT('0000000C'X); /* Reason   37240000
*                                      code for the caller specified    37250000
*                                      the REQTYPE control parameter    37260000
*                                      incorrectly.              @D5A*/ 37270000
*   DECLARE                                                             37280000
*     QUAARSNmembernotfound  BIT(32) CONSTANT('00000010'X); /* Reason   37290000
*                                      code for the member name         37300000
*                                      specified is not defined         37310000
*                                      within the specified group.      37320000
*                                                                @D5A*/ 37330000
*   DECLARE                                                             37340000
*     QUAARSNansareatoosmall BIT(32) CONSTANT('00000014'X); /*          37350000
*                                      Reason code for the length       37360000
*                                      the caller specified on ANSLEN   37370000
*                                      is too small to contain even     37380000
*                                      the header.               @D5A*/ 37390000
*   DECLARE                                                             37400000
*     QUAARSNansareanoaccess BIT(32) CONSTANT('00000018'X); /* Reason   37410000
*                                      code for XCF cannot access       37420000
*                                      ANSAREA.                  @D5A*/ 37430000
*   DECLARE                                                             37440000
*     QUAARSNansaletnotvalid BIT(32) CONSTANT('0000001C'X); /*          37450000
*                                      Reason code for the ALET that    37460000
*                                      qualifies the address of the     37470000
*                                      ANSAREA is neither zero nor      37480000
*                                      is it associated with a valid    37490000
*                                      public entry on the DU-AL.       37500000
*                                                                @D5A*/ 37510000
*   DECLARE                                                             37520000
*     QUAARSNcfnotfound BIT(32) CONSTANT('00000020'X); /* Reason        37530000
*                                      code for the                     37540000
*                                      coupling facility name           37550000
*                                      specified is not defined in      37560000
*                                      CFRM active policy.       @D5A*/ 37570000
*   DECLARE                                                             37580000
*     QUAARSNstrnotfound BIT(32) CONSTANT('00000024'X); /* Reason       37590000
*                                      code for the structure name      37600000
*                                      specified is not defined in      37610000
*                                      CFRM active policy.       @D5A*/ 37620000
*   DECLARE                                                             37630000
*     QUAARSNarmnamenotfound BIT(32) CONSTANT('00000028'X); /* Reason   37640000
*                                      code for there are no elements   37650000
*                                      with the specified element name, 37660000
*                                      restart group name, or job name. 37670000
*                                      Only returned if IXCQUERY        37680000
*                                      request (REQINFO) is for         37690000
*                                      ARMSTATUS.                @L4A*/ 37700000
*   DECLARE                                                             37710000
*     QUAARSNamode24         BIT(32) CONSTANT('00000034'X); /* Reason   37720000
*                                      code for the macro was issued    37730000
*                                      in 24-bit addressing mode.       37740000
*                                                                @L4A*/ 37750000
*   DECLARE                                                             37760000
*     QUAARSNbadplistrsvd BIT(32) CONSTANT('00000040'X); /* Reason      37770000
*                                      code for a reserved field in     37780000
*                                      the control parameter list is    37790000
*                                      not zero. Your program might     37800000
*                                      have inadvertently written       37810000
*                                      over an area in the control      37820000
*                                      parameter list.           @D5A*/ 37830000
*   DECLARE                                                             37840000
*     QUAARSNInvR0        BIT(32) CONSTANT('000000A0'X); /* Reason      37850000
*                                      code for register zero value     37860000
*                                      is not valid.  Only returned     37870000
*                                      if REQINFO is for ARMSTATUS or   37880000
*                                      ARMS_ALLDATA.             @L4A*/ 37890000
*   DECLARE                                                             37900000
*     QUAARSNR0TypeConfl  BIT(32) CONSTANT('000000A4'X); /* Reason      37910000
*                                      code for register zero value is  37920000
*                                      not correct for the requested    37930000
*                                      function. Only returned          37940000
*                                      if REQINFO is for ARMSTATUS or   37950000
*                                      ARMS_ALLDATA.             @L4A*/ 37960000
*   DECLARE                                                             37970000
*     QUAARSNplistaletnotvalid BIT(32) CONSTANT('00000100'X); /*        37980000
*                                      Reason code for the ALET that    37990000
*                                      qualifies the address of the     38000000
*                                      control parameter list           38010000
*                                      is neither zero nor              38020000
*                                      is it associated with a valid    38030000
*                                      public entry on the DU-AL.       38040000
*                                                                @D5A*/ 38050000
*   DECLARE                                                             38060000
*     QUAARSNversionnotvalid BIT(32) CONSTANT('00000104'X); /*          38070000
*                                      Reason code for the version      38080000
*                                      number in the control            38090000
*                                      parameter list is not valid.     38100000
*                                      Your program might have          38110000
*                                      inadvertently written over an    38120000
*                                      area in the control parameter    38130000
*                                      list.                     @D5A*/ 38140000
*   DECLARE                                                             38150000
*     QUAARSNfunccodenotvalid BIT(32) CONSTANT('00000108'X); /*         38160000
*                                      Reason code for the function     38170000
*                                      code in the control              38180000
*                                      parameter list is not valid.     38190000
*                                      Your program might have          38200000
*                                      inadvertently written over an    38210000
*                                      area in the control parameter    38220000
*                                      list.                     @D5A*/ 38230000
*   DECLARE                                                             38240000
*     QUAARSNplistnoaccess   BIT(32) CONSTANT('0000010C'X); /*          38250000
*                                      Reason code for XCF could not    38260000
*                                      access the control               38270000
*                                      parameter list.           @D5A*/ 38280000
*   DECLARE                                                             38290000
*     QUAARSNnottaskmode     BIT(32) CONSTANT('00000118'X); /*          38300000
*                                      Reason code for the caller is    38310000
*                                      not in task mode.         @D5A*/ 38320000
*   DECLARE                                                             38330000
*     QUAARSNnotenabled      BIT(32) CONSTANT('0000011C'X); /*          38340000
*                                      Reason code for the caller is    38350000
*                                      not enabled.              @D5A*/ 38360000
*   DECLARE                                                             38370000
*     QUAARSNHASLOCK         BIT(32) CONSTANT('00000120'X); /*          38380000
*                                      Reason code for the caller is    38390000
*                                      holding a lock.           @L4A*/ 38400000
*   DECLARE                                                             38410000
*     QUAARSNhaseutfrr       BIT(32) CONSTANT('00000124'X); /*          38420000
*                                      Reason code for the caller is    38430000
*                                      running under an EUT FRR. @L4A*/ 38440000
*   DECLARE                                                             38450000
*     QUAARSNquaalevelnotvalid BIT(32) CONSTANT('00000128'X); /*        38460000
*                                      Reason code for the caller has   38470000
*                                      specified an invalid value       38480000
*                                      for QUAALEVEL             @04A*/ 38490000
*   /*****************************************************************/ 38500000
*   /* reason code for return code = '0C'X (environmental error)     */ 38510000
*   /*****************************************************************/ 38520000
*   DECLARE                                                             38530000
*     QUAARSNdspservfail BIT(32) CONSTANT('00000004'X); /* Reason       38540000
*                                      code for XCF could not create    38550000
*                                      a data space for IXCQUERY        38560000
*                                      request (REQINFO) CF,            38570000
*                                      CF_ALLDATA, STR, or              38580000
*                                      STR_ALLDATA.              @D5A*/ 38590000
*   DECLARE                                                             38600000
*     QUAARSNaleservfail BIT(32) CONSTANT('00000008'X); /* Reason       38610000
*                                      code for XCF could not           38620000
*                                      associate the data space         38630000
*                                      created for IXCQUERY request     38640000
*                                      (REQINFO) CF, CF_ALLDATA,        38650000
*                                      STR, or STR_ALLDATA with the     38660000
*                                      XCF address space.        @D5A*/ 38670000
*   DECLARE                                                             38680000
*     QUAARSNtaskabended BIT(32) CONSTANT('00000018'X); /* Reason       38690000
*                                      code for while the issuing       38700000
*                                      task was suspended for XCF       38710000
*                                      processing, the task was abended 38720000
*                                      (ie. another unit of work        38730000
*                                      attempted to abnormally          38740000
*                                      terminate this task). No data    38750000
*                                      was returned in the ANSAREA.     38760000
*                                      This only applies to IXCQUERY    38770000
*                                      requests REQINFO(GROUP)          38780000
*                                      REQTYPE(DEFER).           @D5A*/ 38790000
*   DECLARE                                                             38800000
*     QUAARSNnoCFRMdsn   BIT(32) CONSTANT('00000144'X); /* Reason       38810000
*                                      code for the CFRM active policy  38820000
*                                      could not be read because        38830000
*                                      the couple data set supporting   38840000
*                                      TYPE CFRM is not accessible to   38850000
*                                      this system.                     38860000
*                                      Only returned if IXCQUERY        38870000
*                                      request (REQINFO) is for         38880000
*                                      CF, CF_ALLDATA, STR, or          38890000
*                                      STR_ALLDATA.              @D5A*/ 38900000
*   DECLARE                                                             38910000
*     QUAARSNnoCFRMpol   BIT(32) CONSTANT('00000154'X); /* Reason       38920000
*                                      code for a CFRM policy           38930000
*                                      has not been activated.          38940000
*                                      Only returned if IXCQUERY        38950000
*                                      request (REQINFO) is for         38960000
*                                      CF, CF_ALLDATA, STR, or          38970000
*                                      STR_ALLDATA.              @D5A*/ 38980000
*   DECLARE                                                             38990000
*     QUAARSNfailCFRMread BIT(32) CONSTANT('0000015C'X); /* Reason      39000000
*                                      code for the CFRM active policy  39010000
*                                      could not be read because the    39020000
*                                      couple data set supporting       39030000
*                                      TYPE CFRM is in error.           39040000
*                                      Only returned if IXCQUERY        39050000
*                                      request (REQINFO) is for         39060000
*                                      CF, CF_ALLDATA, STR, or          39070000
*                                      STR_ALLDATA.              @D5A*/ 39080000
*   DECLARE                                                             39090000
*     QUAARSNnoARMdsn    BIT(32) CONSTANT('00000160'X); /* Reason       39100000
*                                      code for the ARM data could      39110000
*                                      not be read because the          39120000
*                                      couple data set supporting       39130000
*                                      TYPE ARM is not accessible       39140000
*                                      to this system.                  39150000
*                                      Only returned if IXCQUERY        39160000
*                                      request (REQINFO) is for         39170000
*                                      ARMSTATUS or ARMS_ALLDATA @L4A*/ 39180000
*   DECLARE                                                             39190000
*     QUAARSNfailARMread BIT(32) CONSTANT('00000164'X); /* Reason       39200000
*                                      code for the ARM data            39210000
*                                      could not be read because the    39220000
*                                      couple data set supporting       39230000
*                                      TYPE ARM is in error.            39240000
*                                      Only returned if IXCQUERY        39250000
*                                      request (REQINFO) is for         39260000
*                                      ARMSTATUS or ARMS_ALLDATA @L4A*/ 39270000
