*                                                                       00050000
* %DCL IXCYMEPL_INCLUDED CHAR EXT;                                      00064200
* %DEACTIVATE IXCYMEPL_INCLUDED;                                        00078400
* %IF IXCYMEPL_INCLUDED = '' %THEN                                      00092600
* %DO;                                                                  00106800
*/* Macro made bi-lingual on 96351. CBGEN compile date 96059         */ 00121000
*% /*                                                                   00135200
         MACRO                                                          00150000
         IXCYMEPL &DSECT=YES,&LIST=YES,&TITLE=YES,&MEPL=YES,           *00164200
               &MEPLEX=COND                                             00178400
         GBLC  &IXCYMEPL_INCLUDED                                       00192800
         GBLC  &ZCBPRINT                                                00214200
&IXCYMEPL_INCLUDED SETC 'YES'                                           00235600
         AIF   ('&LIST' EQ 'NONE').P0                                   00242700
         AIF   ('&TITLE' EQ 'NO').P5                                    00249800
 TITLE   'IXCYMEPL  - Message Exit Parameter List                    '  00257000
.P5      ANOP                                                           00267700
**/ IXCYMEPL_1:;                                                        00278400
*/* START OF SPECIFICATIONS ******************************************* 00300000
*                                                                       00350000
*01* PROPRIETARY STATEMENT =                                            00386200
*                                                                       00422400
*    LICENSED MATERIALS - PROPERTY OF IBM                               00458600
*    THIS MODULE IS "RESTRICTED MATERIALS OF IBM"                       00494800
*    5645-001 (C) COPYRIGHT IBM CORP. 1990, 1997                        00531000
*                                                                       00567200
*01* STATUS = HBB6603                                                   00603400
*                                                                       00639600
*01* END OF PROPRIETARY STATEMENT                                       00675800
*                                                                       00712000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00748200
*01* END OF EXTERNAL CLASSIFICATION:                                    00784400
*                                                                       00821800
*01* DESCRIPTIVE NAME:  Message Exit Parameter List                     00831200
*02*  ACRONYM:  MEPL                                                    00840600
*                                                                       00850000
*01* MACRO NAME:  IXCYMEPL                                              01000000
*                                                                       01050000
*01* DSECT NAME:                                                        01100000
*     MEPL                                                              01150000
*     MEPLEX                                                            01200000
*                                                                       01250000
*01* COMPONENT:  Cross System Coupling Facility (SCXCF)                 01300000
*                                                                       01350000
*01* EYE-CATCHER:  NONE                                                 01375000
*02*  OFFSET:                                                           01400000
*02*  LENGTH:                                                           01425000
*                                                                       01450000
*01* STORAGE ATTRIBUTES:                                                01466600
*02*  SUBPOOL:  245, 248                                           @L1C 01483200
*02*  KEY:  0                                                           01499800
*02*  RESIDENCY:  Any                                                   01516400
*02* ALLOCATION-METHOD: GETMAIN                                    @O1C 01533200
*                                                                       01550000
*01* SIZE:                                                              01583300
*            MEPL   -- X'0074' bytes                                    01605500
*            MEPLEX -- X'0014' bytes                                    01627700
*                                                                       01650000
*01* CREATED BY:                                                        01683300
*      IXCS1DCM - getmain                                               01696600
*      IXCS1STB - initialization                                        01709900
*      IXCT1BER - initialization                                        01723200
*      IXCT1MPS - initialization                                        01736500
*                                                                       01750000
*01* POINTED TO BY:                                                     01783300
*     R1 on entry to a message exit routine                             01816600
*                                                                       01850000
*01* SERIALIZATION:                                                     01883300
*      Serialized by virtue of the fact that there is but one message   01905500
*      exit routine presented with a particular MEPL at any one time.   01927700
*                                                                       01950000
*01* FUNCTION:                                                          01983300
*02* Maps the parameters passed to a message exit routine               02020700
*                                                                       02058100
*01* METHOD OF ACCESS:                                                  02061100
*02*  ASM:  IXCYMEPL                                                    02072200
*02*  PL/AS:                                                            02083300
*      %INCLUDE SYSLIB(IXCYMEPL)                                        02094400
*                                                                       02105500
*01* DELETED BY:  IXCS1DCM                                         @O1C 02116600
*                                                                       02127700
*01* FREQUENCY:  One is created each time a message exit is called      02176300
*                                                                       02225000
*01* DEPENDENCIES:  None.                                               02250000
*                                                                       02300000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     02350000
*                                                                       02400000
*01* CHANGE ACTIVITY:                                                   02450000
*   $L0=COUPLXSI,HBB4410,870630,PDU8: XCF Initial release               02700000
*   $O1=OW05112, HBB4430,941115,PD00BJ: Change subpool from 248 to 245  02725000
*   $L1=XCFBC    HBB6603 950417 PD00DT: XCF Broadcast                   02733300
*   $D1=DCR0010  HBB6603 950803 PD00DT: ADD MEPL Extension              02738800
*   $L2=XCFBC    JBB6602 951113 PD00BJ: Restore MEPLLEN for ASM         02744300
*   $P1=PQC2914  HBB6603 961230 PD00DT: Documentation corrections       02747100
*                                                                       02750000
* END OF SPECIFICATIONS *********************************************/  02800000
*% /*                                                                   02850000
.P0      ANOP                                                           02875000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 02900000
         AIF   ('&LIST' EQ 'YES').P2                                    02950000
.P1      ANOP                                                           03000000
         PUSH  PRINT                                                    03050000
         PRINT OFF                                                      03100000
.P2      ANOP                                                           03150000
         AIF   ('&MEPL' EQ 'NO').L0002                                  03200000
         AIF   ('&DSECT' EQ 'YES').L0003                                03250000
         AIF   ('&MEPL' NE 'YES').L0002                                 03300000
MEPL     DS    0F        Message exit parameter list                    03350000
         AGO   .L0004                                                   03400000
.L0003   ANOP                                                           03450000
MEPL     DSECT           Message exit parameter list                    03500000
.L0004   ANOP                                                           03550000
MEPLMTOK DS    1BL4      Maintained for compatibility with users of    *03600000
                         version 0 parameter list. Use MeplMsgiToken   *03650000
                         for version 1 parameter lists. For initial    *03700000
                         delivery of a message (MeplSolicited='0'B),   *03750000
                         contains a token that can be supplied via the *03800000
                         MSGTOKEN keyword to the message-in service    *03850000
                         (IXCMSGI). Not defined for solicited message  *03900000
                         delivery (MeplSolicited='1'B) and will not be *03950000
                         accepted by message-in service as a message   *04000000
                         token.                                         04050000
MEPLMDAT DS    1BL8      Data associated with the message by the       *04100000
                         target member. Contains a copy of the member  *04150000
                         data specified by the MEMDATA keyword when    *04200000
                         the Join Service (IXCJOIN) was invoked by the *04250000
                         target member.                                 04300000
MEPLMLEN DS    1FL4      Total number of bytes of message data         *04350000
                         available (remaining) for delivery via the    *04400000
                         message-in service. The length is accurate    *04450000
                         only on entry to the exit routine. It is NOT  *04500000
                         updated while the exit routine is running to  *04550000
                         reflect any partial deliveries performed by   *04600000
                         the exit.                                      04650000
MEPLSRCE DS    1BL8      Member token of originator of the signal       04700000
MEPLCNTL DS    1CL0032   MSGCNTL value from originator of the signal    04750000
*                                                                       04800000
*  ------------------------------------------------------------------   04850000
*              Fields available with version 1 mapping                  04900000
*                                                                       04950000
*      Note: The MeplVersion field is not mapped in the version 0       05000000
*            MEPL, but users of the version 1 mapping can still test    05050000
*            this field to determine the contents of the parameter      05100000
*            list, regardless of the MVS release on which their code    05150000
*            is running.                                                05200000
*                                                                       05250000
*            The version 1 parameter list is passed to all message      05300000
*            exit routines as of MVS JBB6602.                  @P1C     05350000
*  ------------------------------------------------------------------   05400000
*                                                                       05450000
*                                                                       05500000
MEPLVERSION DS 1FL1      Version number of MEPL                         05550000
MEPLFLAGS DS   0BL3      Applies to version 1 Flags describing         *05600000
                         characteristics of the message or its         *05650000
                         delivery.                                      05700000
MEPLSOLICITED EQU X'80'  Applies to version 1 Indicates whether        *05707100
                         message exit was solicited by the user: '0'B  *05714200
                         when message delivery is initiated by XCF,    *05721300
                         '1'B for delivery solicited by the user (by   *05728400
                         invoking the message-control CALLEXIT service *05735500
                         to call a message exit routine.                05742600
MEPLNEEDSRESPONSE EQU X'40' Applies to version 1 Indicates whether the *05750000
                         sender requested that XCF manage the          *05800000
                         gathering of a response to this message: '1'B *05850000
                         if XCF is managing the response, '0'B if not. *05900000
                         If so, send a response using the IXCMSGO      *05950000
                         service, specifying ORIGINATOR for the SENDTO *06000000
                         keyword and supplying a RESPONSEID equal to   *06050000
                         the value provided in the MeplResponseID      *06100000
                         field below. Note that this flag reflects a   *06150000
                         specification made by the sender when the      06200000
*                        message was originally sent, and cannot be    *06250000
                         used to determine whether the desired         *06300000
                         response was sent or received.                 06350000
MEPLISARESPONSE EQU X'20' Applies to version 1 Indicates whether this  *06353300
                         message is a response that is being managed   *06356600
                         by XCF: '1'B if it is an XCF managed          *06359900
                         response, '0'B if not. This response message  *06361900
                         will be presented to the message exit driven  *06363900
                         by the Message Control (IXCMSGC) CallExit     *06365900
                         service for a saved response message. Note    *06367900
                         that MeplNeedsResponse and MeplIsaResponse    *06369900
                         are mutually exclusive.                        06373100
MEPLDELIVERED EQU X'10'  '1'B if some portion of the message was       *06376400
                         delivered by message-in service, '0'B if none *06379700
                         of the message was delivered. Applies to      *06383000
                         version 1                                      06386300
MEPLSAVED EQU  X'08'     '1'B if the message was saved with the        *06389600
                         message control SAVEMSG service. Applies to   *06392900
                         version 1                                      06396200
MEPLORDEREDMSG EQU X'04' '1'B if the sender requested ordered message  *06400000
                         delivery. Applies to version 1                 06450000
MEPLEXTENSIONDATA EQU X'01' '1'B if there is additional data to be     *06716400
                         presented to the message exit. The data       *06749700
                         presented will be mapped by MeplEx. Applies   *06783000
                         to version 1                                   06816300
         DS    1BL2      Reserved.                                      06850000
         ORG   MEPLFLAGS+X'00000003'                                    06900000
MEPLTARGETMEMTOKEN DS 1BL8 Applies to version 1 Member token of the    *06950000
                         member to which this message was sent.         07000000
MEPLMSGITOKEN DS 1CL0016 Applies to version 1 Token to identify the    *07050000
                         message being delivered. Specify this value   *07100000
                         for the IXCMSGI TOKEN() keyword when invoking *07150000
                         the message-in service (IXCMSGI) to receive   *07200000
                         the text of the message. Specify this value   *07228500
                         for the TOKEN keyword when invoking the       *07257000
                         message-control SAVE service (IXCMSGC) to     *07285500
                         save the message for later processing. This   *07314000
                         token is valid for use only in the context of *07342500
                         a message-exit routine.                        07371000
MEPLRESPONSEID DS 1CL0024 Applies to version 1 Message Response ID.    *07400000
                         Valid when the MeplNeedsResponse flag is      *07450000
                         '1'B, otherwise undefined. Specify this value *07500000
                         for the RESPONSEID keyword when invoking the  *07550000
                         message-out service (IXCMSGO) to reply to     *07600000
                         this message.                                  07650000
MEPLEXTENSIONADDR DS 1AL4 Applies to version 1 Address of additional   *07670000
                         data provided to the message exit. Valid when *07690000
                         MeplExtensionData flag is set to '1'B,        *07710000
                         otherwise undefined.                           07730000
MEPLSTREAMID DS 1FL4     Applies to version 1 StreamID for this        *07750000
                         message                                        07800000
MEPLLEN  EQU   116       Length in bytes of the latest version of the  *07812500
                         MEPL (name preserved for compatibility with   *07825000
                         with previous releases).                       07837500
*                                                                       07850000
* ********************************************************************  07900000
* *                                                                  *  07950000
* *                Version numbers for MeplVersion                      08000000
* *                                                                  *  08050000
* ********************************************************************  08100000
*                                                                       08150000
*                                                                       08200000
MEPLKVERSION0 EQU 0      Version 0                                      08250000
MEPLKVERSION1 EQU 1      Version 1                                      08300000
MEPL_LEN EQU   *-MEPL                                                   08350000
.L0002   ANOP                                                           08400000
*                                                                       08401200
* ********************************************************************  08402400
* *                                                                  *  08403600
* *                Mepl Extension Data                                  08404800
* *                                                                  *  08406000
* ********************************************************************  08407200
*                                                                       08408400
*                                                                       08409600
         AIF   ('&MEPLEX' EQ 'NO').L0005                                08410800
         AIF   ('&DSECT' EQ 'YES').L0006                                08412000
         AIF   ('&MEPLEX' NE 'YES').L0005                               08413200
MEPLEX   DS    0X        Message exit parameter list Extension.        *08414400
                         Additional data provided to the message exit  *08415600
                         when MeplExtensionData='1'B. Applies to       *08416800
                         version 1                                      08418000
         AGO   .L0007                                                   08419200
.L0006   ANOP                                                           08420400
MEPLEX   DSECT           Message exit parameter list Extension.        *08421600
                         Additional data provided to the message exit  *08422800
                         when MeplExtensionData='1'B. Applies to       *08424000
                         version 1                                      08425200
.L0007   ANOP                                                           08426400
MEPLEXUSERDATA DS 1BL8   Data associated with the saved message by the *08427600
                         target member. For user solicited delivery    *08428800
                         (MeplSolicited='1'B), contains a copy of the  *08430000
                         user data specified by the USERDATA keyword   *08431200
                         when the message was saved by the             *08432400
                         message-control service (IXCMSGC). If         *08433600
                         USERDATA was not specified, set to            *08434800
                         hexadecimal zero.                              08436000
MEPLEXFLAGS DS 1BL4      Reserved                                       08437200
MEPLEXEXITPARMS DS 1BL8  User parameters. Valid for user solicited     *08438400
                         delivery (MeplSolicited='1'B), in which case  *08439600
                         it contains a copy of the data specified for  *08440800
                         the EXITPARMS keyword when the message        *08442000
                         control service (IXCMSGC) was invoked to      *08443200
                         recall the message exit. If no EXITPARMS was  *08444400
                         specified, set to hexadecimal zero.            08445600
MEPLEX_LEN EQU *-MEPLEX                                                 08446800
.L0005   ANOP                                                           08448000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08450000
         AIF   ('&LIST' EQ 'YES').P4                                    08500000
.P3      ANOP                                                           08550000
         POP   PRINT                                                    08600000
.P4      ANOP                                                           08650000
.P_EXIT  ANOP                                                           08700000
         MEND                                                           08750000
**/ IXCYMEPL_2:;                                                        08800000
* %IXCYMEPL_INCLUDED = 'YES';                                           08850000
* %DCL ZCBPRINT CHAR EXT;                                               08900000
* %DEACTIVATE ZCBPRINT;                                                 08950000
* %DCL IXCYMEPL_LIST CHAR EXT;                                          09000000
* %DEACTIVATE IXCYMEPL_LIST;                                            09050000
* %IF IXCYMEPL_LIST ^= 'NO' &                                           09100000
*    ZCBPRINT ^= 'NO' %THEN                                             09150000
*   %GOTO IXCYMEPL_3;                                                   09200000
*   @LIST PUSH NOECHO;                                                  09250000
*   @LIST NOASSEMBLE NOECHO;                                            09300000
*   @LIST OFF C NOECHO;                                                 09350000
* %IXCYMEPL_3:;                                                         09400000
*/* Start of PL/X Source                                             */ 09450000
*DCL 1 MEPL BASED,                  /* Message exit parameter list   */ 09500000
*     3 MEPLMTOK BIT(32),           /* Maintained for compatibility     09550000
*                                      with users of version 0          09600000
*                                      parameter list.  Use             09650000
*                                      MeplMsgiToken for version 1      09700000
*                                      parameter lists.                 09750000
*                                                                       09800000
*                                      For initial delivery of a        09850000
*                                      message (MeplSolicited='0'B),    09900000
*                                      contains a token that can be     09950000
*                                      supplied via the MSGTOKEN        10000000
*                                      keyword to the message-in        10050000
*                                      service (IXCMSGI).  Not defined  10100000
*                                      for solicited message delivery   10150000
*                                      (MeplSolicited='1'B) and will    10200000
*                                      not be accepted by message-in    10250000
*                                      service as a message token.      10300000
*                                                                @L1C*/ 10350000
*     3 MEPLMDAT BIT(64),           /* Data associated with the message 10400000
*                                      by the target member. Contains a 10450000
*                                      copy of the member data          10500000
*                                      specified by the MEMDATA keyword 10550000
*                                      when the Join Service (IXCJOIN)  10600000
*                                      was invoked by the target        10650000
*                                      member.              @L1C @D1C*/ 10700000
*     3 MEPLMLEN FIXED(32),         /* Total number of bytes of message 10750000
*                                      data available (remaining) for   10800000
*                                      delivery via the message-in      10850000
*                                      service.  The length is accurate 10900000
*                                      only on entry to the exit        10950000
*                                      routine.  It is NOT updated      11000000
*                                      while the exit routine is        11050000
*                                      running to reflect any partial   11100000
*                                      deliveries performed by the      11150000
*                                      exit.                     @L1C*/ 11200000
*     3 MEPLSRCE BIT(64),           /* Member token of originator of    11250000
*                                      the signal                    */ 11300000
*     3 MEPLCNTL CHAR(32),          /* MSGCNTL value from originator of 11350000
*                                      the signal                    */ 11400000
*/*------------------------------------------------------------------*/ 11450000
*/*            Fields available with version 1 mapping               */ 11500000
*/*                                                                  */ 11550000
*/*    Note: The MeplVersion field is not mapped in the version 0    */ 11600000
*/*          MEPL, but users of the version 1 mapping can still test */ 11650000
*/*          this field to determine the contents of the parameter   */ 11700000
*/*          list, regardless of the MVS release on which their code */ 11750000
*/*          is running.                                             */ 11800000
*/*                                                                  */ 11850000
*/*          The version 1 parameter list is passed to all message   */ 11900000
*/*          exit routines as of MVS JBB6602.                    @P1C*/ 11950000
*/*------------------------------------------------------------------*/ 12000000
*     3 MeplVersion  FIXED(8),      /* Version number of MEPL    @L1A*/ 12050000
*                                                                       12100000
*     3 MeplFlags    BIT(24),       /* Applies to version 1      @L1A*/ 12150000
*                                   /* Flags describing characteristics 12200000
*                                      of the message or its            12250000
*                                      delivery.                 @L1A*/ 12300000
*       5 MeplSolicited BIT(1),     /* Applies to version 1      @L1A*/ 12315000
*                                   /* Indicates whether message exit   12330000
*                                      was solicited by the user:  '0'B 12345000
*                                      when message delivery is         12360000
*                                      initiated by XCF, '1'B for       12375000
*                                      delivery solicited by the user   12390000
*                                      (by invoking the message-control 12405000
*                                      CALLEXIT service to call a       12420000
*                                      message exit routine.     @L1A*/ 12435000
*       5 MeplNeedsResponse BIT(1), /* Applies to version 1      @L1A*/ 12450000
*                                   /* Indicates whether the sender     12500000
*                                      requested that XCF manage the    12550000
*                                      gathering of a response to this  12600000
*                                      message:  '1'B if XCF is         12650000
*                                      managing the response, '0'B if   12700000
*                                      not.  If so, send a response     12750000
*                                      using the IXCMSGO service,       12800000
*                                      specifying ORIGINATOR for the    12850000
*                                      SENDTO keyword and supplying a   12900000
*                                      RESPONSEID equal to the value    12950000
*                                      provided in the MeplResponseID   13000000
*                                      field below.                     13050000
*                                                                       13075000
*                                      Note that this flag reflects a   13100000
*                                      specification made by the sender 13150000
*                                      when the message was originally  13200000
*                                      sent, and cannot be used to      13250000
*                                      determine whether the desired    13300000
*                                      response was sent or received.   13350000
*                                                                @L1A*/ 13400000
*       5 MeplIsaResponse BIT(1),   /* Applies to version 1      @L1A*/ 13404500
*                                   /* Indicates whether this message   13409000
*                                      is a response that is being      13413500
*                                      managed by XCF: '1'B if it is an 13418000
*                                      XCF managed response, '0'B if    13422500
*                                      not. This response message will  13424400
*                                      be presented to the message      13426300
*                                      exit driven by the Message       13428200
*                                      Control (IXCMSGC) CallExit       13430100
*                                      service for a saved response     13432000
*                                      message.                         13433900
*                                      Note that MeplNeedsResponse and  13436000
*                                      MeplIsaResponse are mutually     13443500
*                                      exclusive.                @L1A*/ 13451000
*       5 MeplDelivered bit(1),     /* '1'B if some portion of          13458500
*                                      the message was delivered by     13463000
*                                      message-in service, '0'B if none 13467500
*                                      of the message was delivered.    13472000
*                                      Applies to version 1          */ 13476500
*       5 MeplSaved bit(1),         /* '1'B if the message was          13481000
*                                      saved with the message control   13485500
*                                      SAVEMSG service.                 13490000
*                                      Applies to version 1          */ 13494500
*       5 MeplOrderedMsg bit(1),    /* '1'B if the sender requested     13500000
*                                      ordered message delivery.        13550000
*                                      Applies to version 1      @L1A*/ 13600000
*       5 * BIT(1),                 /* Unused                    @L1A*/ 13650000
*       5 MeplExtensionData bit(1), /* '1'B if there is additional data 14020200
*                                      to be presented to the message   14058400
*                                      exit. The data presented will    14096600
*                                      be mapped by MeplEx.             14134800
*                                      Applies to version 1      @D1A*/ 14173000
*       5 * BIT(16),                /* Reserved.                 @L1A*/ 14211200
*     3 MeplTargetMemtoken bit(64), /* Applies to version 1      @L1A*/ 14250000
*                                   /* Member token of the member       14300000
*                                      to which this message was        14350000
*                                      sent.                     @L1A*/ 14400000
*     3 MeplMsgiToken CHAR(16),     /* Applies to version 1      @L1A*/ 14450000
*                                   /* Token to identify the message    14500000
*                                      being delivered.  Specify this   14550000
*                                      value for the IXCMSGI TOKEN()    14600000
*                                      keyword                          14650000
*                                      when invoking the message-in     14700000
*                                      service (IXCMSGI) to receive the 14750000
*                                      text of the message.  Specify    14768700
*                                      this value for the TOKEN keyword 14787400
*                                      when invoking the                14806100
*                                      message-control                  14824800
*                                      SAVE service (IXCMSGC) to        14843500
*                                      save the message for later       14862200
*                                      processing.  This token is valid 14880900
*                                      for use only in the context of   14900000
*                                      a message-exit routine.   @L1A*/ 14950000
*     3 MeplResponseID CHAR(24),    /* Applies to version 1      @L1A*/ 15000000
*                                   /* Message Response ID.  Valid when 15050000
*                                      the MeplNeedsResponse flag is    15100000
*                                      '1'B, otherwise undefined.       15150000
*                                      Specify this value for the       15200000
*                                      RESPONSEID keyword when invoking 15250000
*                                      the message-out service          15300000
*                                      (IXCMSGO) to reply to this       15350000
*                                      message.                  @L1A*/ 15400000
*     3 MeplExtensionAddr  ptr(31), /* Applies to version 1      @L1A*/ 15414200
*                                   /* Address of additional data       15428400
*                                      provided to the message exit.    15442600
*                                      Valid when MeplExtensionData     15456800
*                                      flag is set to '1'B, otherwise   15471000
*                                      undefined.           @L1A @D1C*/ 15485500
*     3 MeplStreamID fixed(32),     /* Applies to version 1      @L1A*/ 15500000
*                                   /* StreamID for this message @L1A*/ 15550000
*                                                                       15600000
*     3 * char(0);                  /*                           @L1A*/ 15650000
*                                                                       15700000
*DCL MEPLLEN constant( Length(MEPL) ); /* Length in bytes of the        15710000
*                                   latest version of the MEPL (name    15720000
*                                   preserved for compatibility with    15730000
*                                   with previous releases).     @L2A*/ 15740000
*/********************************************************************/ 15750000
*/*                                                                  */ 15800000
*/*                Version numbers for MeplVersion               @L1A*/ 15850000
*/*                                                                  */ 15900000
*/********************************************************************/ 15950000
*                                                                       16000000
*DCL MeplKVersion0  CONSTANT(0);    /* Version 0                 @L1A*/ 16050000
*DCL MeplKVersion1  CONSTANT(1);    /* Version 1                 @L1A*/ 16100000
*/********************************************************************/ 16101400
*/*                                                                  */ 16102800
*/*                Mepl Extension Data                           @D1A*/ 16104200
*/*                                                                  */ 16105600
*/********************************************************************/ 16107000
*DCL 1 MeplEx Based,                /* Message exit parameter list      16108400
*                                      Extension. Additional data       16109800
*                                      provided to the message exit     16111200
*                                      when MeplExtensionData='1'B.     16112600
*                                      Applies to version 1      @D1A*/ 16114000
*     3 MeplExUserData  bit(64),    /* Data associated with the saved   16115400
*                                      message by the target member.    16116800
*                                      For user solicited               16118200
*                                      delivery (MeplSolicited='1'B),   16119600
*                                      contains a copy of the user data 16121000
*                                      specified by the USERDATA        16122400
*                                      keyword when the message was     16123800
*                                      saved by the message-control     16125200
*                                      service (IXCMSGC). If USERDATA   16126600
*                                      was not specified, set to        16128000
*                                      hexadecimal zero.         @D1A*/ 16129400
*     3 MeplExFlags bit(32),        /* Reserved                  @P1C*/ 16131500
*     3 MeplExExitParms bit(64);    /* User parameters.  Valid for      16133600
*                                      user solicited delivery          16135000
*                                      (MeplSolicited='1'B), in which   16136400
*                                      case it contains a copy of the   16137800
*                                      data specified for the EXITPARMS 16139200
*                                      keyword when the message control 16140600
*                                      service (IXCMSGC) was invoked to 16142000
*                                      recall the message exit.  If no  16143400
*                                      EXITPARMS was specified, set to  16144800
*                                      hexadecimal zero.         @D1A*/ 16147400
*/* End of PL/X Source                                               */ 16150000
* %IF IXCYMEPL_LIST ^= 'NO' &                                           16200000
*    ZCBPRINT ^= 'NO' %THEN                                             16250000
*   %GOTO IXCYMEPL_4;                                                   16300000
*   @LIST POP NOECHO;                                                   16350000
* %IXCYMEPL_4:;                                                         16400000
* %END;                                                                 16450000
