*                                                                       00050000
*        %              /*                                              00100000
         MACRO                                                          00150000
         IXCYGEPL &DSECT=YES  */                                        00200000
* IXCYGEPL10 : ;                                                        00250000
*/* START OF SPECIFICATIONS ******************************************  00300000
*                                                                       00350000
*01* PROPRIETARY STATEMENT =                                            00388400
*                                                                       00426800
*    LICENSED MATERIALS - PROPERTY OF IBM                               00465200
*    THIS MODULE IS RESTRICTED MATERIALS OF IBM                         00503600
*    5645-001 (C) COPYRIGHT IBM CORP. 1990, 1996                        00542000
*                                                                       00580400
*01* STATUS = JBB6602                                                   00618800
*                                                                       00657200
*01* END OF PROPRIETARY STATEMENT                                       00695600
*                                                                       00734000
*01* EXTERNAL CLASSIFICATION: GUPI                                      00772400
*01* END OF EXTERNAL CLASSIFICATION:                                    00810800
*                                                                       00850000
*01* DESCRIPTIVE NAME:  Group Exit Parameter List                       00900000
*02*  ACRONYM:  GEPL                                                    00950000
*                                                                       01050000
*01* MACRO NAME:  IXCYGEPL                                              01100000
*                                                                       01300000
*01* DSECT NAME:                                                        01333300
*     GEPL                                                              01366600
*                                                                       01400000
*01* COMPONENT:  Cross System Coupling Facility (SCXCF)                 01450000
*                                                                       01500000
*01* EYE-CATCHER:  NONE                                                 01550000
*                                                                       01600000
*01* STORAGE ATTRIBUTES:                                                01620000
*02*  SUBPOOL:  245                                                     01640000
*02*  KEY:  0                                                           01660000
*02*  RESIDENCY:  Above the 16 megabyte line.                           01680000
*                                                                       01700000
*01* SIZE:  220 bytes + 32 bytes for user state field                   01750000
*                                                                       01800000
*01* CREATED BY:                                                        01833300
*     IXCGNTSK                                                          01866600
*                                                                       01900000
*01* POINTED TO BY:                                                     01933300
*     R1 on entry to the group exit                                     01966600
*                                                                       02000000
*01* SERIALIZATION:                                                     02033300
*     None required                                                     02066600
*                                                                       02100000
*01* FUNCTION:                                                          02133300
*02* Maps the parameters passed to the group exit                       02166600
*                                                                       02200000
*01* METHOD OF ACCESS:                                                  02216600
*02*  ASM:                                                              02233200
*      IXCYGEPL USING on GEPL                                           02249800
*02*  PL/AS:                                                            02266400
*      %INCLUDE SYSLIB(IXCYGEPL)                                        02283000
*                                                                       02300000
*01* DELETED BY:  IXCGNGNE                                              02350000
*                                                                       02400000
*01* FREQUENCY:  One is created each time for any given member exit     02450000
*                                                                       02500000
*01* DEPENDENCIES:  None                                                02550000
*                                                                       02600000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     02618700
*                                                                       02637400
*01* CHANGE ACTIVITY:                                                   02656100
*   $L0=COUPLXGP,HBB4410,870630,PDXB: Group Exit parameter list         02675000
*   $D1=DCR0066 ,HBB4410,880825,PDCJ: Added SUBMONREMOVED event         02700000
*   $P1=PEO1112 ,HBB4410,881010,PDCJ: A member's monitor FDI is         02725000
*                                     presented on ustate events.       02750000
*   $D2=DCR0090 ,HBB4410,881010,PDCJ: Removed the SUBNDISPMISS event    02775000
*   $P2=PEO2271 ,HBB4410,891023,PDT8: Warn user that group events       02779100
*                                     are presented in logic order      02783200
*   $P3=PEO2815 ,HBB4410,891127,PDEO: Warn user that the member token   02784200
*                                     is cleared for non member state   02785200
*                                     events                            02786200
*   $P4=PEO3097 ,HBB4410,890115,PDEO: Change GEPLGLBL field from dsect  02786500
*                                     to double boundary alignment      02786800
*                                     DS 0D in assembler def            02787100
*   $P5=PEO3192 ,HBB4410,890315,PDEO: Add GEPLMONR, GEPLMISR, GEPLMISD  02788700
*                                     GEPLMEME bits.                    02790300
*   $D3=DCR0333 ,HBB4410,900305,PDEO: Remove event types GEMPAUSE,      02791900
*                                     GEMRUN, GEMSUMRP, GEMSUMDP events 02793500
*                                     GEPLTTIM field removed            02795100
*   $P6=PEO4127, HBB4410,900505,PDEO: Add GEPLSECC bit                  02795900
*   $01=OW14220, HBB5510,950927,PDCJ: Added GEPLCleanupIntValid         02797200
*                                     and GEPLCleanupInt                02798500
* END OF SPECIFICATIONS *********************************************/  02800000
* %      /*                                                             02850000
         AIF   ('&DSECT' EQ 'NO').IXCYGEPL20                            02900000
GEPL     DSECT                                                          02950000
         AGO   .IXCYGEPL30                                              03000000
.IXCYGEPL20 ANOP                                                        03050000
GEPL     DS    0D                                                       03100000
.IXCYGEPL30 ANOP                                                        03150000
GEPLGLBL DS    0D             Align on doubleword boundary  @P4         03175000
GEPLMDAT DS    XL8            Member data value provided via the        03200000
*                             IXCJOIN which established the group exit  03225000
GEPLFLGS DS    0XL4                                                     03250000
GEPLTYPE DS    X                                                        03300000
*                     Note: Member events are presented in a logic      03310000
*                           order (ie. a user state field change may    03320000
*                           be seen before a member state change such   03330000
*                           as a JOIN).                        @P2A     03340000
*                  1  member status change (i.e. IXCJOIN, etc. )        03350000
*                  2  user state field change,                          03400000
*                     Note that a subsystem failure detection interval  03450000
*                     modification could also have occurred.            03500000
*                  4  Reserved                                 @D3D     03550000
*                  6  Reserved                                 @D3D     03600000
*                  7  member status update missing reported by          03650000
*                     subsystem's status exit                           03700000
*                  8  member status update missing detected by          03750000
*                     subsystem monitor DIE                             03800000
*                  9  member status update no longer missing            03850000
*                 10  Reserved                                          03900000
*                 11  system reported active                            03950000
*                 12  system update missing                             04000000
*                 13  system update resumed                             04050000
*                 14  system reported going                             04100000
*                 15  system reported gone                              04150000
*                 16  system detected missing                           04200000
*                 17  system detected gone                              04250000
*                 18  system failure detection interval updated         04400000
*                 19  Reserved                                @D3D      04450000
*                 20  Reserved                                @D3D      04500000
*                 21  subsystem failure detection interval updated.     04612500
*                     Note that a user state modification could also    04625000
*                     have occurred.                                    04637500
*                 22  system in partitioning (THIS SYSTEM).             04643700
*                 23  Monitoring removed for this member. @D1A          04646800
GEPLOLDS DS X                    Member state before action in          04650000
*                                type field                             04700000
*                           0-> not defined  (GENOTDEF)                 04750000
*                           2-> created      (GECREATE)                 04800000
*                           3-> active       (GEACTIVE)                 04850000
*                           4-> quiesced     (GEQUIESC)                 04900000
*                           5-> failed       (GEFAILED)                 04950000
GEPLNEWS DS X                   Member state after action in type field 05000000
*                           0-> not defined,                            05050000
*                           2-> created,                                05100000
*                           3-> active,                                 05150000
*                           4-> quiesced,                               05200000
*                           5-> failed                                  05250000
GEPLFLG2 DS    X            Bits to determine members current status    05280700
GEPLMEME EQU   X'80'        Bit is ON if event is Member-related        05311400
*                           (ie. JOIN), OFF if system related           05342100
*                           (ie System reported active) @P5A            05372800
GEPLMONR EQU   X'40'        Bit is ON if monitoring is removed for      05403500
*                           this member                 @P5A            05434200
GEPLMISR EQU   X'20'        Member status update missing was reported   05464900
*                           by the members status exit routine @P5A     05495600
GEPLMISD EQU   X'10'        Member status update missing assumed by     05526300
*                           the status monitoring service because       05557000
*                           members status exit did not execute in      05587700
*                           time or terminated abnormally  @P5A         05618400
GEPLSECC EQU   X'08'        Bit is ON if this is the second time        05623600
*                           the exit is called for this event. ie.      05628800
*                           The exit abended the first time before      05634000
*                           recovery was established. The exit will     05639200
*                           be called a second time.      @P6A          05644400
GEPLCLEANUPINTVALID EQU X'04'  Indicates whether GEPLCLEANUPINT         05645500
*                              is valid or not. On, indicates that      05646600
*                              it is valid and off indicates that       05647700
*                              it isn't valid.              @O1A        05648800
GEPLGNAM DS    CL8             Group Name                               05650000
GEPLMNAM DS    CL16            Member Name                              05700000
GEPLMTOK DS    XL8             Member token                             05750000
*                    Note: The Member Token, Group name, and Member     05760000
*                          fields are set to 0 for events which are     05770000
*                          not member-related (i.e. GESYSACT,           05780000
*                          GESYSFDI, etc.)                  @P3         05790000
GEPLSYS  DS    CL8             System name where member last/currently  05800000
*                              active                                   05850000
GEPLETIM DS    XL8             Time event occurred in STCK format       05900000
GEPLINTV DS    F         Monitoring interval (system/subsystem) in      06090000
*                        hundredths of seconds.  Provided for           06130000
*                        alterations in the system/subsystem FDI and    06170000
*                        for alterations in the member's user state.    06210000
GEPLUDAT DS    XL4              User data field.                        06250000
*                              -Contains the value passed back by       06300000
*                               the status exit in R0 the last time     06350000
*                               the exit reported status update         06400000
*                               missing or resumed                      06450000
GEPLUSLN DS    F                Actual length of user state field       06650000
GEPLSID  DS    0XL4             System token associated with system on  06658300
*                               which member was last active            06666600
GEPLSNUM DS    XL1              System slot number                      06674900
         DS    XL3              Reserved                                06683200
GEPLCLEANUPINT      DS F  Contains the current system (as defined by    06685600
*                   GEPLSID) cleanup interval. The                      06688000
*                   interval is specified in seconds and can change     06690400
*                   dynamically. The GEPLCLEANUPINTVALID bit indicates  06692800
*                   whether the value could be provided or not.    @O1A 06695200
         DS    XL8              Reserved                           @O1C 06697600
GEPLUSOF DS    F                Offset from GEPL of 32-byte user        06700000
*                               state field                             06750000
*                               The user state field can be addressed   06800000
*                               by ADDR(GEPL)+GEPLUSOF                  06850000
*             NOTE: It is possible that XCF can not determine a         06855000
*             member's user state. This occurs when a member leaves     06860000
*             on a system that has been partitioned out of the sysplex  06865000
*             and the signal containing the event is lost due to        06870000
*             the system's failure. In this case, XCF sets the          06875000
*             user state field to 32-bytes of X'FF'. It should also     06880000
*             be noted that a user can set a user state to this value.  06885000
*             As a result, it is recommended that this value is         06890000
*             not used.                                                 06895000
GEPLHSTY DS    0CL128            History Data                           06900000
GEPLHIST DS    0CL16      Eight sets of fields containing the event     06950000
*                            time and expected duration of the last     07000000
*                            eight events which affected                07050000
*                            the member in GEPLMNAM, in LIFO order      07100000
GEPLHTIM DS    XL8              Time event occurred in STCK format      07150000
GEPLHTTM DS    F                  Time event is expected to last,       07200000
*                      in units of hundredths of seconds, subsystem     07250000
*                      monitoring only, optional                        07300000
GEPLHFLG DS    XL4              Flags corresponding to GEPLFLGS,        07350000
*                               for prior events                        07400000
         ORG GEPLHSTY+L'GEPLHSTY  '                                     07450000
GEPLLEN  EQU   *-GEPL                                                   07500000
********************************************************************    07501200
*   Declaration of constants for use in group exits  -  (GEPLTYPE)      07502400
********************************************************************    07503600
GEMSTATE EQU   1                Member state event                      07504800
GEUSTATE EQU   2                User state event                        07506000
*                               4 Reserved                  @D3D        07507200
*                               6 Reserved                  @D3D        07508400
GEMSUMSE EQU   7                Member status update missing reported   07509600
*                               by subsystem's status exit              07510800
GEMSUMDI EQU   8                Member status update missing detected   07512000
*                               by subsystem monitor                    07513200
GEMNOSUM EQU   9                Member status update no longer missing  07514400
*                               10 is reserved     @D2C                 07515600
GESYSACT EQU   11               System reported active                  07516800
GESYSSUM EQU   12               System update missing                   07518000
GESYSSUR EQU   13               System update resume                    07519200
GESYSGO  EQU   14               System reported going                   07520400
GESYSGON EQU   15               System reported gone                    07521600
GESYSDM  EQU   16               System detected missing                 07522800
GESYSDG  EQU   17               System detected gone                    07524000
GESYSFDI EQU   18               System failure detection interval       07525200
*                               updated                                 07526400
*                               19 Reserved                @D3D         07528400
*                               20 Reserved                @D3D         07530400
GESUBFDI EQU   21               Subsystem failure detection interval    07532400
*                               updated                                 07533600
GESYSPRT EQU   22               System in partitioning                  07534800
GEMONREM EQU   23               Monitoring removed for this member @D1A 07535400
********************************************************************    07536000
*   Declaration of constants for use in group exits                     07537200
*         GEPLOLDS & GEPLNEWS                                           07538400
********************************************************************    07539600
GENOTDEF EQU    0               Member not defined                      07540800
GECREATE EQU    2               Member created                          07542000
GEACTIVE EQU    3               Member active                           07543200
GEQUIESC EQU    4               Member quiesced                         07544400
GEFAILED EQU    5               Member failed                           07545600
         MEND                                                           07550000
* */ IXCYGEPL20: ;                                                      07600000
*DCL 1 GEPL BASED BDY(WORD), /* Group exit parameter list            */ 07641600
*     2 GEPLGLBL,            /* Global GN control block parameters   */ 07683200
*      3 GEPLMDAT BIT(64), /* Member data value provided via the        07710900
*                           IXCJOIN which established the group exit */ 07738600
*      3 GEPLFLGS,                                                      07766400
*        4 GEPLTYPE FIXED(8), /*                                        07808000
*                     Note: Member events are presented in a logic      07816400
*                           order (ie. a user state field change may    07824800
*                           be seen before a member state change such   07833200
*                           as a JOIN).                       @P2A      07841600
*                  1  member status change (i.e. IXCJOIN etc.)          07850000
*                  2  user state field change,                          07900000
*                     Note that a subsystem failure detection interval  07950000
*                     modification could also have occurred.            08000000
*                  4  Reserved                               @D3D       08050000
*                  6  Reserved                               @D6D       08100000
*                  7  member status update missing reported by          08150000
*                     subsystem's status exit                           08200000
*                  8  member status update missing detected by          08250000
*                     subsystem monitor DIE                             08300000
*                  9  member status update no longer missing            08350000
*                 10  Reserved                               @D1C       08400000
*                 11  system reported active                            08450000
*                 12  system update missing                             08500000
*                 13  system update resumed                             08550000
*                 14  system reported going                             08600000
*                 15  system reported gone                              08650000
*                 16  system detected missing                           08700000
*                 17  system detected gone                              08750000
*                 18  system failure detection interval updated         08900000
*                 19  Reserved                               @D3D       08950000
*                 20  Reserved                               @D3D       09000000
*                 21  subsystem failure detection interval updated.     09120000
*                     Note that a user state modification could also    09140000
*                     have occurred.                                    09153300
*                 22  system in partitioning (THIS SYSTEM).             09162200
*                 23  monitoring removed for this member   @D1A       */09171100
*        4 GEPLOLDS FIXED(8), /* Member state before action in          09180000
*                                type field                             09200000
*                         X'00' not defined,                            09250000
*                         X'02' created,                                09300000
*                         X'03' active,                                 09350000
*                         X'04' quiesced,                               09400000
*                         X'05' failed */                               09450000
*        4 GEPLNEWS FIXED(8), /* Member state after action in type field09500000
*                         X'00' not defined,                            09550000
*                         X'02' created,                                09600000
*                         X'03' active,                                 09650000
*                         X'04' quiesced,                               09700000
*                         X'05' failed */                               09750000
*        4 GEPLFLG2  BIT(8),                      /* @P5A*/             09773500
*           5 GEPLMEME  BIT(1),   /* Bit is ON if event is a Member     09797000
*                                    related event (ie. JOIN), OFF      09820500
*                                    if system-related event            09844000
*                                    ie System reported active @P5A*/   09867500
*           5 GEPLMONR  BIT(1),   /* Bit is ON if monitoring is         09891000
*                                    removed for this member @P5A*/     09914500
*           5 GEPLMISR  BIT(1),   /* Member status update missing       09938000
*                                    was reported by the members        09961500
*                                    status exit             @P5A*/     09985000
*           5 GEPLMISD  BIT(1),   /* Member status update missing       10008500
*                                 assumed by the status monitoring      10032000
*                                 because the members status exit       10055500
*                                 did not execute in time or            10079000
*                                 terminated abnormally  @P5A*/         10102500
*           5 GEPLSECC  BIT(1),   /* Bit is ON if this is the second    10108400
*                                 time the exit is called for the same  10114300
*                                 event. (ie. The exit abended the first10120200
*                                 first time it was called for this     10126100
*                                 event before recovery was established 10132000
*                                                             @P6C*/    10137900
*           5 GEPLCLEANUPINTVALID BIT(1), /*                            10139600
*                                 Indicates whether GEPLCLEANUPINT      10141300
*                                 is valid or not. On, indicates that   10143000
*                                 it is valid and off indicates that    10144700
*                                 it isn't valid.            @O1A*/     10146400
*           5 *         BIT(2),   /* Reserved   @P6C @O1C*/             10148100
*      3 GEPLGNAM CHAR(8), /* Group Name  */                            10150000
*      3 GEPLMNAM CHAR(16), /* Member Name */                           10200000
*      3 GEPLMTOK BIT(64),  /* Member token */                          10250000
*                 /* Note: The Member Token, Group name, and Member     10260000
*                          fields are set to 0 for events which are     10270000
*                          not member-related (i.e. GESYSACT,           10280000
*                          GESYSFDI, etc.)   @P3A*/                     10290000
*      3 GEPLSYS CHAR(8),   /* System name where member last/currently  10300000
*                              active */                                10350000
*      3 GEPLETIM BIT(64),  /* Time event occurred in STCK format */    10400000
*      3 GEPLINTV FIXED(32),  /* Monitoring interval (system/subsystem) 10450000
*                                in hundredths of seconds. For system   10500000
*                                events contains the system FDI, for    10550000
*                                member events contains the subsystem   10600000
*                                FDI */                                 10650000
*      3 GEPLUDAT BIT(32),   /* User data field.                        10750000
*                              -Contains the value passed back by       10800000
*                               the status exit in R0 the last time     10850000
*                               the exit reported status update         10900000
*                               missing or resumed                  */  10950000
*      3 GEPLUSLN FIXED(32), /* Actual length of user state field   */  11114200
*      3 GEPLSID  FIXED(32), /* System token associated with system     11128400
*                               on which member was last active     */  11142600
*       4 GEPLSNUM FIXED(8), /* System slot number                  */  11156800
*       4 *        FIXED(24),/* Reserved                            */  11171000
*      3 GEPLCLEANUPINT FIXED(32), /* Contains the current system       11174600
*                   (as defined by GEPLSID) cleanup interval.  The      11178200
*                   interval is specified in seconds and can change     11181800
*                   dynamically.  The GEPLCLEANUPINTVALID bit           11185400
*                   indicates whether the value could be provided       11189000
*                   or not.                                     @O1A*/  11192600
*      3 *         CHAR(8),  /* Reserved                        @O1C*/  11196200
*     2 GEPLUSOF FIXED(32), /* Offset from GEPL of 32-byte user         11200000
*                               state field.                            11209000
*               NOTE: It is possible that XCF can not determine a       11218000
*               member's user state. This occurs when a member leaves   11227000
*               on a system that has been partitioned out of the sysplex11236000
*               and the signal containing the event is lost due to      11245000
*               the system's failure. In this case, XCF sets the        11254000
*               user state field to 32-bytes of X'FF'. It should also   11263000
*               be noted that a user can set a user state to this value.11272000
*               As a result, it is recommended that this value is       11281000
*               not used.  */                                           11290000
*     2 GEPLHSTY CHAR(128) BDY(WORD),  /* History Data */               11300000
*      3 GEPLHIST(8) CHAR(16) BDY(WORD), /*                             11350000
*                         Eight sets of fields containing the event     11400000
*                            time and expected duration of the last     11450000
*                            eight events which affected                11500000
*                            the member in GEPLMNAM, in LIFO order  */  11550000
*        4 GEPLHTIM BIT(64), /* Time event occurred in STCK format */   11600000
*        4 GEPLHTTM FIXED(32), /* Time event is expected to last,       11650000
*                      in units of hundredths of seconds, subsystem     11700000
*                      monitoring only, optional */                     11750000
*        4 GEPLHFLG BIT(32); /* Flags corresponding to GEPLFLGS,        11800000
*                               for prior events                   */   11850000
*DCL GEPLUSTA CHAR(32) BASED;  /* User State Field -- ADDR(GEPL)        11900000
*                               + GEPLUSOF. Length in GEPLUSLN.         11950000
*                               Maximum length is 32.              */   12000000
*                                                                       12050000
*/******************************************************************/   12100000
*/* Declaration of constants for use in group exits  -  (GEPLTYPE) */   12150000
*/******************************************************************/   12200000
*DCL  GEMSTATE  FIXED(8) CONSTANT(1), /* Member state event          */ 12250000
*     GEUSTATE  FIXED(8) CONSTANT(2), /* User state event            */ 12300000
*                                     /* 4  - Reserved           @D3D*/ 12350000
*                                     /* 6  - Reserved           @D3D*/ 12400000
*     GEMSUMSE  FIXED(8) CONSTANT(7), /* Member status update missing   12450000
                                         reported by status exit     */ 12500000
*     GEMSUMDI  FIXED(8) CONSTANT(8), /* Member status update missing   12550000
                                         detected by subsysmon DIE   */ 12600000
*     GEMNOSUM  FIXED(8) CONSTANT(9), /* Member status update           12650000
                                                         not missing */ 12700000
*                                     /* 10 - reserved           @D2C*/ 12750000
*     GESYSACT  FIXED(8) CONSTANT(11),/* SYSTEM reported active      */ 12850000
*     GESYSSUM  FIXED(8) CONSTANT(12),/* SYSTEM update missing       */ 12900000
*     GESYSSUR  FIXED(8) CONSTANT(13),/* SYSTEM update resume        */ 12950000
*     GESYSGO   FIXED(8) CONSTANT(14),/* SYSTEM reported going       */ 13000000
*     GESYSGON  FIXED(8) CONSTANT(15),/* SYSTEM reported gone        */ 13050000
*     GESYSDM   FIXED(8) CONSTANT(16),/* SYSTEM detected missing     */ 13100000
*     GESYSDG   FIXED(8) CONSTANT(17),/* SYSTEM detected gone        */ 13150000
*     GESYSFDI  FIXED(8) CONSTANT(18),/* SYSTEM failure detection       13200000
                                                   interval updated  */ 13250000
*                                     /* 19 - Reserved           @D3D*/ 13300000
*                                     /* 20 - Reserved           @D3D*/ 13350000
*     GESUBFDI  FIXED(8) CONSTANT(21),/* Subsystem failure detection    13500000
                                         interval updated            */ 13550000
*     GESYSPRT  FIXED(8) CONSTANT(22),/* System in partitioning      */ 13583300
*     GEMONREM  FIXED(8) CONSTANT(23);/* Monitoring removed     @D1A */ 13616600
*                                                                       13650000
*/******************************************************************/   13700000
*/* Declaration of constants for use in group exits                */   13750000
*/*       GEPLOLDS & GEPLNEWS                                      */   13800000
*/******************************************************************/   13850000
*DCL  GENOTDEF FIXED(8) CONSTANT(0), /* Member not defined           */ 13900000
*     GECREATE FIXED(8) CONSTANT(2), /* Member created               */ 13950000
*     GEACTIVE FIXED(8) CONSTANT(3), /* Member active                */ 14000000
*     GEQUIESC FIXED(8) CONSTANT(4), /* Member quiesced              */ 14050000
*     GEFAILED FIXED(8) CONSTANT(5); /* Member failed                */ 14100000
