*                                                                       00050000
* %DCL IXGENF_INCLUDED CHAR EXT;                                        00100000
* %DEACTIVATE IXGENF_INCLUDED;                                          00150000
* %IF IXGENF_INCLUDED = '' %THEN                                        00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 96088. CBGEN compile date 96059         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IXGENF &DSECT=YES,&LIST=YES,&TITLE=YES,&IXGENF=YES             00450000
         GBLC  &IXGENF_INCLUDED                                         00500000
         GBLC  &ZCBPRINT                                                00550000
&IXGENF_INCLUDED SETC 'YES'                                             00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00616600
         AIF   ('&TITLE' EQ 'NO').P5                                    00633200
 TITLE   'IXGENF  - Event Notification Facility Signal Parameter List  *00650000
               '                                                        00700000
.P5      ANOP                                                           00725000
**/ IXGENF_1:;                                                          00750000
*/*START OF SPECIFICATIONS ******************************************** 00800000
*                                                                       00850000
* ACRONYM: IXGENF                                                       00900000
*                                                                       00950000
* MACRO-NAME: IXGENF                                                    01000000
*                                                                       01050000
* DESCRIPTIVE-NAME: Event Notification Facility Signal Parameter List   01100000
*                                                                       01150000
**/                                                                     01200000
*/*01* PROPRIETARY STATEMENT=                                        */ 01300000
*/***PROPRIETARY_STATEMENT********************************************/ 01316600
*/*                                                                  */ 01333200
*/*                                                                  */ 01350000
*/*Licensed Materials - Property of IBM                              */ 01400000
*/*                                                                  */ 01600000
*/*"Restricted Materials of IBM"                                     */ 01608300
*/*                                                                  */ 01616600
*/* 5645-001                                                         */ 01624900
*/*                                                                  */ 01633200
*/*(C) COPYRIGHT IBM CORP. 1994, 1997                                */ 01641500
*/*                                                                  */ 01649800
*/*US Government Users Restricted Rights - Use, duplication or       */ 01658100
*/*disclosure restricted by GSA ADP Schedule Contract with           */ 01666400
*/*IBM Corp.                                                         */ 01674700
*/*                                                                  */ 01683000
*/*STATUS = FMID JBB6604                                             */ 01691300
*/*                                                                  */ 01700000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01750000
*/*                                                                     01800000
*                                                                       01850000
* FUNCTION: Mapping of parameter list passed to ENF listening           01900000
*           routine to communicate MVS System Logger                    01950000
*           event information.                                          02000000
*                                                                       02050000
*                                                                       02100000
*01* DSECT NAME:  IXGENF                                                02150000
*                                                                       02200000
*01* COMPONENT: System Logger (SCLOG)                                   02250000
*                                                                       02300000
*01* EYE CATCHER: ENF                                                   02350000
*02*   OFFSET:    0                                                     02400000
*02*   LENGTH:    4 bytes                                               02450000
*                                                                       02500000
*01* STORAGE ATTRIBUTES:                                                02550000
*02*   SUBPOOL:                                                         02600000
*02*   KEY: 0                                                           02650000
*02*   ALLOCATION-METHOD:  STORAGE OBTAIN                               02700000
*02*   FREQUENCY: Once per ENF signal issued                            02750000
*                                                                       02800000
*01* SIZE:                                                              02850000
*            IXGENF -- X'0056' bytes                                    02875000
*01*             IXGENF -- X'0056' bytes                                02900000
*                                                                       02950000
*01* CREATED BY: System Logger modules issuing an ?ENFREQ               02975000
*                ACTION(SIGNAL) macro to send the ENF 48 signal         03000000
*                to the registered listeners of ENF 48.                 03025000
*                                                                       03050000
*01* DELETED BY: ENF, once all ENF listen exits on the system have      03100000
*                been driven                                            03150000
*                                                                       03200000
*01* POINTED TO BY: On entry to the ENF listen exit, register 1 points  03250000
*                   to a word which contains the address of the         03300000
*                   IXGENF data area                                    03350000
*                                                                       03400000
*01* SERIALIZATION:  Serialized by the ENF component                    03450000
*                                                                       03500000
*01* EXTERNAL CLASSIFICATION: GUPI                                      03550000
*01* END OF EXTERNAL CLASSIFICATION:                                    03600000
*                                                                       03650000
*01* METHOD OF ACCESS:                                                  03700000
*                                                                       03750000
*    PLAS: %INCLUDE SYSLIB(IXGENF)                                      03800000
*    ASM:  IXGENF USING on IXGENF                                       03850000
*                                                                       03856200
*    Changes to the mapping of this macro should be documented          03862400
*    in "Conversion Notebook for MVS/ESA - System Product Version x"    03868600
*    so that all registered listeners of ENF Signal 48 are made         03874800
*    aware that programs using this mapping macro should                03881000
*    be reassembled to pick up the latest changes.                      03887200
*                                                                       03893400
*                                                                       03900000
* DEPENDENCIES:  Must be freed by the ENF component when all ENF        03950000
*                listen exits have been driven.                         04000000
*                                                                       04050000
*                                                                       04100000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04150000
*                                                                       04200000
* CHANGE-ACTIVITY:                                                      04250000
*                                                                       04300000
*   $L0=LOGR HBB5520 931202  PDC9: System Logger                        04350000
*   $L2=LOGR HBB5520 940310  PDC9: Add IxgenfVolatilityStateChange,     04362500
*                                  IxgenfVolatilityState and            04375000
*                                  IxgenfSystemLoggerNotAvailForIPL     04387500
*   $L3=LOGR HBB5520 940414  PDC9: Driver 8                             04393700
*   $L4=LOGR HBB5520 940602  PDC9: Driver 9                             04403000
*                                 - Add IxgenfLossOfData                04412300
*                                 - Complete re-alignment of events     04421600
*                                   and detailed information associated 04430900
*                                   with each event                     04440200
*   $L5=LOGR HBB5520 940728  PDC9: Driver 10                            04441400
*                                 - SHOWHDR compatability               04442600
*                                 - Add IxgenfXESrecommendaction        04443800
*                                   reason and IxgenfLossofConnectivity 04445000
*                                   specific information                04446200
*                                 - Rename IxgEnfStructureNotFull to    04447400
*                                   IxgEnfLogstreamStorageAvailable     04448600
*   $L6=LOGR HBB5520 940908  PDC9: Driver 10 ASAP                       04448900
*                                 - Add IxgenfComponentError reason     04449200
*                                   indicator                           04449500
*   $L7=LOGR HBB5520 940912  PDC9: Driver 11                            04449600
*                                 - Add IxgenfLogstreamDisconnected     04449700
*                                   specific information indicator      04449800
*   $Q1=PN71616 HBB5520 941031  PDC9: Staging Dataset Support           04456900
*                                 - Delete IxgenfVolatilityStateChange  04464000
*                                   and IxgenfVolatilityState           04471100
*                                 - Add IxgEnfStagingDsStorageAvailable 04478200
*   $01=OW11809 HBB5520 950321  PDC9: Structure Resource Change Support 04481700
*                                 - Add IxgenfStrResourceChange         04485200
*                                                   (TRSQ PTM PN72377)  04488700
*   $L8=RSR  HBB6603 960119  PDXD: Remote Site Recovery                 04489900
*   $L9=LOGR4   JBB6604 960930  PDDZ:  DASD Only Log Streams       @L9A 04490500
*                                                                       04491100
*END OF SPECIFICATIONS ***********************************************/ 04492400
*% /*                                                                   04500000
.P0      ANOP                                                           04525000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04550000
         AIF   ('&LIST' EQ 'YES').P2                                    04600000
.P1      ANOP                                                           04650000
         PUSH  PRINT                                                    04700000
         PRINT OFF                                                      04750000
.P2      ANOP                                                           04800000
         AIF   ('&IXGENF' EQ 'NO').L0002                                04850000
         AIF   ('&DSECT' EQ 'YES').L0003                                04900000
         AIF   ('&IXGENF' NE 'YES').L0002                               04950000
IXGENF   DS    0D        LOGR Event Notification Parameter List         05000000
         AGO   .L0004                                                   05050000
.L0003   ANOP                                                           05100000
IXGENF   DSECT           LOGR Event Notification Parameter List         05150000
.L0004   ANOP                                                           05200000
IXGENFCOMMON DS 0CL0060                                                 05250000
IXGENFACRONYM DS 1CL0004 Eyecatcher C'ENF '                             05300000
IXGENFCOMPONENT DS 1CL0005 Component Acronym                            05350000
         DS    1CL0003   Unused                                         05400000
IXGENFEVENTS DS 0BL4     Event Flags                                    05424000
IXGENFEVENTSBYTE0 DS 0BL1                                               05448000
IXGENFSYSTEMLOGGERAVAIL EQU X'80' MVS System Logger Services           *05472200
                         available.                                     05483300
IXGENFSYSTEMLOGGERNOTAVAILFORIPL EQU X'40' MVS System Logger Services  *05494400
                         are not available for the duration of this    *05505500
                         IPL. A Re-IPL of the system is necessary to   *05516600
                         activate MVS System Logger Services.           05527700
IXGENFLOGSTREAMSAVAILABLE EQU X'20' Logstream resources mapped to the  *05528500
                         structure named in IxgenfStrname are          *05529300
                         available for use. See IxgenfEventReasons for *05530100
                         the specific reason logstream resources for   *05530900
                         the affected logstreams are available.         05531700
IXGENFLOGSTREAMSNOTAVAILABLE EQU X'10' Logstream resources mapped to   *05532500
                         the structure named in IxgenfStrname are not  *05533300
                         available for use. See IxgenfEventReasons for *05534100
                         the specific reason logstream resources for   *05534900
                         the affected logstreams are not available.     05535700
IXGENFLOGSTREAMRESOURCECHANGE EQU X'08' A change in the state of the   *05536500
                         resources allocated to the logstreams listed  *05537300
                         has occurred.                                  05538100
IXGENFSYSTEMLOGGERRESOURCECHG EQU X'04' A change in the state of       *05538900
                         resources that the System Logger has interest *05539700
                         in has occurred (i.e. coupling facility       *05540500
                         resource change)                               05541300
IXGENFLOGSTREAMCONNDISC EQU X'02' A connection to or a disconnection   *05541500
                         from a log has been successful in the sysplex  05541800
         ORG   IXGENFEVENTSBYTE0+X'00000001'                            05542100
IXGENFEVENTSBYTE1 DS 0BL1                                               05542200
IXGENFLOGSTREAMDEFUPDATE EQU X'80' Either a log stream has been        *05542300
                         defined or its defintion has been updated      05542400
IXGENFLOGSTREAMDELETE EQU X'40' Log stream definition deleted from     *05542500
                         Logger inventory                               05542600
IXGENFLOGSTREAMOFFLOADCOMPLETE EQU X'20' A writer offload event for    *05542700
                         the log stream has completed                   05542800
IXGENFRMDISABLED EQU X'10' The resource manager associated with the    *05542900
                         log stream has been disabled because it       *05543000
                         abended and did not recover                    05543100
         ORG   IXGENFEVENTSBYTE1+X'00000001'                            05543200
IXGENFEVENTSBYTE2 DS 1BL1                                               05543700
IXGENFEVENTSBYTE3 DS 1BL1                                               05544500
IXGENFEVENTREASONS DS 0BL4 Specific reasons that the events are being  *05545300
                         reported for.                                  05546100
IXGENFEVENTREASONSBYTE0 DS 0BL1                                         05546900
IXGENFSTRREBUILDSTART EQU X'80' Structure Rebuild processing for a log *05547700
                         stream has begun. Programs connected to an    *05550000
                         affected log stream are expected to cease     *05600000
                         invoking MVS System Logger functions. If any  *05650000
                         functions are invoked against an affected log *05700000
                         stream, they are rejected. This reason is     *05750000
                         valid for event IxgenfLogstreamsNotAvailable   05800000
IXGENFSTRREBUILDCOMPLETE EQU X'40' Structure Rebuild processing for a  *05850000
                         log stream has completed. Programs may resume *05950000
                         invoking MVS System Logger functions This     *05965800
                         reason is valid for event                     *05981600
                         IxgenfLogstreamsAvailable.                     05997400
IXGENFSTRREBUILDFAILED EQU X'20' Structure Rebuild processing has      *06013200
                         failed. Connections to the structure named in *06029000
                         IxgenfStrName from this system are in a       *06043500
                         failed state. Requests for the affected log   *06058000
                         stream(s) are rejected. This reason is valid  *06068800
                         for event IxgenfLogstreamsNotAvailable         06079600
IXGENFSTAGINGDSSTORAGEAVAILABLE EQU X'10' Reclamation of staging data  *06085400
                         set space has completed. Staging data set     *06091200
                         space is now available for use by the subject *06097000
                         logstream. This reason is valid for event     *06102800
                         IxgenfLogstreamsAvailable.                     06108600
IXGENFLOGSTREAMSTORAGEAVAILABLE EQU X'08' Migration of logstream data  *06114800
                         to DASD to reach the low threshold value of   *06117100
                         the current logstream storage consumption     *06119400
                         limit has completed. Coupling facility        *06121700
                         storage is now available for use by the       *06124000
                         subject logstream. This reason is valid for   *06126300
                         event IxgenfLogstreamsAvailable.               06129000
IXGENFLOSSOFDATA EQU X'04' A loss of data condition may exist for the  *06134500
                         affected logstream(s). This reason is valid   *06140000
                         for event IxgenfLogstreamResourceChange.       06145500
IXGENFCFRESOURCECHANGE EQU X'02' A change in the state of coupling     *06151000
                         facility resources has occurred and reported  *06156500
                         by ENF 35. When the resource change is        *06162000
                         related to a specific coupling facility       *06167500
                         structure, IxgenfStrName will contain the     *06173000
                         name of the structure that was affected by    *06178500
                         the resource change. This reason is valid for *06184000
                         event IxgenfSystemLoggerResourceChg.           06189500
IXGENFXESRECOMMENDACTION EQU X'01' A XES Recommend Action event was    *06189900
                         received by the MVS System Logger Structure   *06190300
                         Event Exit instructing System Logger to       *06190700
                         discontinue use (disconnect from) of the      *06191100
                         structure named in IxgenfStrName. The XES     *06191500
                         recommended action is based on installation   *06191900
                         specified SFM and CFRM policy values.         *06192300
                         Connections to the affected logstream(s) have *06192700
                         been terminated by System Logger. This reason *06193100
                         is valid for event                             06193500
*                        IxgenfLogstreamsNotAvailable.                  06193900
         ORG   IXGENFEVENTREASONSBYTE0+X'00000001'                      06195000
IXGENFEVENTREASONSBYTE1 DS 0BL1                                         06195800
IXGENFCOMPONENTERROR EQU X'80' A system logger component error has     *06197400
                         occurred. The System Logger had to            *06199000
                         discontinue use (disconnect from) of the      *06200600
                         structure named in IxgenfStrName. Connections *06201400
                         to the affected logstream(s) have been        *06202200
                         terminated by System Logger. This reason is   *06203000
                         valid for event IxgenfLogstreamsNotAvailable.  06203800
IXGENFSTRRESOURCECHANGE EQU X'40' Resources in the structure named in  *06203900
                         IxgenfStrName have become available. Requests *06204000
                         that were rejected due to a structure         *06204100
                         resource shortage or structure full condition *06204200
                         should be attempted again.                     06204300
IxgenfReqLogResNotAvail EQU X'20' Logger required resources are not    *06204600
                         available (e.g. staging dataset               *06204900
                         could not be allocated)                   @L9A 06205200
         ORG   IXGENFEVENTREASONSBYTE1+X'00000001'                      06205500
IXGENFEVENTREASONSBYTE2 DS 1BL1                                         06206000
IXGENFEVENTREASONSBYTE3 DS 1BL1                                         06211500
IXGENFEVENTSPECIFICINFO DS 0BL4 Event Specific Information that        *06217000
                         provides additional information about the     *06222500
                         reported event and the reason that the event  *06228000
                         is reported.                                   06233500
IXGENFEVENTSPECIFICINFOBYTE0 DS 0BL1                                    06239000
IXGENFSTRREBUILDFAILLOSSCONN EQU X'80' This bit is only valid when     *06246500
                         IxgenfStrRebuildFailed is ON. Structure       *06261600
                         Rebuild processing has failed. A loss of      *06268300
                         connectivity to the structure named in        *06275000
                         IxgenfStrname has left this system with no    *06281700
                         coupling facility resources allocated to the  *06288400
                         affected log stream(s).                        06295100
IXGENFSTRREBUILDFAILSTRFAIL EQU X'40' This bit is only valid when      *06302200
                         IxgenfStrRebuildFailed is ON. Structure       *06308000
                         Rebuild processing has failed. A structure    *06318800
                         failure to the structure named in             *06329600
                         IxgenfStrname has left this system with no    *06340400
                         coupling facility resources allocated to the  *06351200
                         affected log stream(s).                        06362000
IXGENFLOSSOFCONNECTIVITY EQU X'10' This bit is only valid when         *06437400
                         IxgenfXESrecommendaction is ON. The XES       *06439000
                         Recommend Action event was initiated due to a *06440600
                         loss of connectivity between the coupling     *06442200
                         facility structure named in IxgenfStrName and *06443800
                         the system that the ENF Listener exit that    *06445400
                         receives this parameter list is executing on.  06447000
IXGENFLOGSTREAMDISCONNECTED EQU X'08' This bit is only valid when      *06447100
                         IxgenfXESrecommendaction is ON or             *06447200
                         IxgenfComponentError is ON. Connections to    *06447300
                         the affected logstream(s) have been           *06447400
                         terminated by System Logger. The streamtoken  *06447500
                         that uniquely defined the connection has been *06447600
                         invalidated. All connectors should clean up   *06447700
                         information related to the invalidated        *06447800
                         streamtoken.                                   06447900
IxgenfStgAllocErr           EQU x'04' Staging Data set could not be    *06448100
                         allocated                                 @L9A 06448300
         ORG   IXGENFEVENTSPECIFICINFOBYTE0+X'00000001'                 06448600
IXGENFEVENTSPECIFICINFOBYTE1 DS 1BL1                                    06461400
IXGENFEVENTSPECIFICINFOBYTE2 DS 1BL1                                    06474200
IXGENFEVENTSPECIFICINFOBYTE3 DS 1BL1                                    06487000
IXGENFSTRNAME DS 1CL0016 Structure name that is the subject of the     *06500000
                         event being signalled (not provided if the    *06550000
                         event is not structure related).               06600000
IXGENFLOGSTREAMCOUNT DS 1FL4 Number of log streams that are connected  *06650000
                         to the structure and affected by the reported *06700000
                         event                                          06750000
         DS    1CL0016   Unused - Available                             06775000
IXGENFUNION1 DS 0C                                                      06775300
         ORG   IXGENFUNION1                                             06775600
IXGENFRESMGRDISABLED DS 0CL0070 Resource Manager exit has been         *06775700
                         disabled                                       06775800
IXGENFRESMGRGMTTIMESTAMP DS 1BL8 Time stamp                             06775900
IXGENFRESMGRLOGSTREAMNAME DS 1CL0026 log stream name                    06776000
IXGENFRESMGRNAME DS 1CL0008 Resource Manager associated with this log  *06776100
                         stream.                                        06776200
IXGENFRESMGRDATA DS 1CL0008 Resource Manager Data.                      06776300
IXGENFRESMGRLSDESCRIPTION DS 1CL0016 Description associated with the   *06776400
                         log stream                                     06776500
IXGENFRESMGRABENDCODE DS 1CL0004 Copy of SDWAABCC if an sdwa was       *06776600
                         available when the resource manager was       *06776700
                         disabled else binary zeroes                    06776800
         ORG   IXGENFUNION1                                             06776900
IXGENFINVENTORYDEFUPDATE DS 0CL0148 Log stream define or update        *06777000
                         section                                        06777100
IXGENFINVENTORYGMTTIMESTAMP DS 1BL8 Time stamp                          06777200
IXGENFINVENTORYSYSNAME DS 1CL0008 System name on which the define or   *06777300
                         update occurred                                06777400
IXGENFINVENTORYLOGSTREAMNAME DS 1CL0026 Log stream name                 06777500
IXGENFINVENTORYLOGSTREAMDEFTIME DS 1BL8 Set to binary zeroes for log   *06777600
                         streams defined or changed prior to OS390R3.  *06777700
                         For log streams defined when OS390R3 is       *06777800
                         installed, this field contains the define     *06777900
                         time. For log streams defined before OS390R3  *06778000
                         and updated after OS390R3 is installed, this  *06778100
                         field contains the time of first update.       06778200
IXGENFINVENTORYRESMGRNAME DS 1CL0008 Resource Manager associated with  *06778300
                         this log stream. If binary zeroes, no         *06778400
                         resource mgr is associated with this log      *06778500
                         stream                                         06778600
IXGENFINVENTORYSTRUCTNAME DS 1CL0016 CF structure name to which the    *06778700
                         log stream maps                                06778900
IXGENFINVENTORYFLAGS DS 0BL2 Flags                                      06779200
IXGENFINVENTORYDEFINEREQ EQU X'80' If set, request is to define a log  *06779500
                         stream                                         06779800
IXGENFINVENTORYUPDATEREQ EQU X'40' If set, request is to update the    *06780100
                         log stream definition                          06780400
IXGENFINVENTORYSTGDUPLEXYES EQU X'20' If set, STG_DUPLEX=YES in effect  06780700
IXGENFINVENTORYSTGMODECOND EQU X'10' If set, Duplex_Mode=Cond in       *06781000
                         effect                                         06781300
IXGENFINVENTORYMODELYES EQU X'08' If set, this is a log stream model   *06781600
                         definition                                     06781900
IXGENFINVENTORYDASDONLYYES EQU X'04' If set, this is a DASD only log   *06782000
                         stream definition                         @L9A 06782100
         ORG   IXGENFINVENTORYFLAGS+X'00000002'                         06782200
IXGENFINVENTORYSTGDATACLAS DS 1CL0008 Data class for staging data sets  06782500
IXGENFINVENTORYSTGMGMTCLAS DS 1CL0008 Mgmt class for staging data sets  06782800
IXGENFINVENTORYSTGSTORCLAS DS 1CL0008 Storage class for staging data   *06783100
                         sets                                           06783400
IXGENFINVENTORYLSDATACLAS DS 1CL0008 Data class for log stream data    *06783700
                         sets                                           06784000
IXGENFINVENTORYLSMGMTCLAS DS 1CL0008 Mgmt class for log stream data    *06784300
                         sets                                           06784600
IXGENFINVENTORYLSSTORCLAS DS 1CL0008 Storage class for log stream data *06784900
                         sets                                           06785200
IXGENFINVENTORYLOWOFFLOAD DS 1FL4 Low offload threshold                 06785500
IXGENFINVENTORYHIGHOFFLOAD DS 1FL4 High offload threshold               06785800
IXGENFINVENTORYLSDESCRIPTION DS 1CL0016 Logstream description           06785900
         ORG   IXGENFUNION1                                             06786100
IXGENFINVENTORYDELETE DS 0CL0050 Log stream delete from inventory       06786400
IXGENFINVENTORYDELGMTTIMESTAMP DS 1BL8 Time stamp                       06786700
IXGENFINVENTORYDELSYSNAME DS 1CL0008 System name on which the log      *06786800
                         stream delete occurred                         06786900
IXGENFINVENTORYDELLOGSTREAMNAME DS 1CL0026 Log stream name              06787000
IXGENFINVENTORYDELRESMGRNAME DS 1CL0008 Resource Manager Name           06787300
         ORG   IXGENFUNION1                                             06787600
IXGENFCONNDISCINFO DS 0CL0100 Successful connect to or disconnect from *06787700
                         a log stream                                   06787800
IXGENFCONNDISCSYSNAME DS 1CL0008 System name on which the connect or   *06787900
                         disconnect occurred                            06788000
IXGENFCONNDISCGMTTIMESTAMP DS 1BL8 Time stamp Set for both connect and *06788300
                         disconnect events                              06788400
IXGENFCONNDISCLOGSTREAMNAME DS 1CL0026 log stream name. Set for both   *06788500
                         connect and disconnect events                  06788600
IXGENFCONNDISCLOGSTREAMDEFTIME DS 1BL8 Set to binary zeroes for log    *06788700
                         streams defined or changed prior to OS390R3.  *06788800
                         For log streams defined when OS390R3 is       *06788900
                         installed, this field contains the define     *06789000
                         time. For log streams defined before OS390R3  *06789100
                         and updated after OS390R3 is installed, this  *06789200
                         field contains the time of first update.       06789300
IXGENFCONNDISCLOGSTREAMSTRVER DS 0BL8 Version number of the CF         *06789400
                         structure associated with this log stream.    *06789500
                         Set for both ConnSuccess and DisconnSuccess   *06789600
                         events                                    @L9C 06789700
IXGENFCONNDISCLOGSTREAMINSVER DS 1BL8 Alternate name for DASD only     *06789800
                         log stream.  STCK value when the log stream   *06789900
                         staging data set was allocated            @L9A 06790000
IXGENFCONNDISCRESMGRNAME DS 1CL0008 Resource Manager associated with   *06790100
                         this log stream. If binary zeroes, no RM is   *06790200
                         associated with the log stream. This is the   *06790300
                         resource manager name specified on the log    *06790400
                         stream's inventory record. To check if the    *06790500
                         resource manager is connected, check field    *06790600
                         IxgenfConnDiscResMgr- -Connected. Set for     *06790700
                         both connect and disconnect events             06790800
IXGENFCONNDISCRESMGRDATA DS 1CL0008 Resource Manager Data. Contains    *06790900
                         valid data only if IxgenfConnDiscResMgr-      *06791000
                         -Connected is set. Set for both connect and   *06791100
                         disconnect events                              06791200
IXGENFCONNDISCRESMGREVENTS DS 0BL1 Monitored events. Contains valid    *06791300
                         data only if IxgenfConnDiscResMgr- -Connected *06791400
                         is set                                         06791500
IXGENFCONNDISCLBWRITES EQU X'80' If set, the resource manager is       *06791600
                         monitoring log block write events              06791700
IXGENFCONNDISCLBDELETES EQU X'40' If set, the resource manager is      *06791800
                         monitoring log block delete events             06791900
         ORG   IXGENFCONNDISCRESMGREVENTS+X'00000001'                   06792100
IXGENFCONNDISCFLAGS DS 0BL1 Additional flags                            06792400
IXGENFCONNDISCAUTHREAD EQU X'80' If set then AUTH=READ specified on    *06792700
                         the connect request. Set for successful       *06792900
                         connect requests.                              06793100
IXGENFCONNDISCAUTHWRITE EQU X'40' If set then AUTH=READ specified on   *06793300
                         the connect request. Set for successful       *06793400
                         connect requests                               06793500
IXGENFCONNDISCRESMGRMANAGED EQU X'20' If set, RMNAME keuword specified *06793600
                         on log stream definition                       06793700
IXGENFCONNDISCRESMGRCONNECTED EQU X'10' If set, resource manager is    *06793800
                         connected to the log stream. Valid for both   *06793900
                         connect and disconnect events                  06794000
IXGENFCONNDISCCONNECT EQU X'08' If set, this parmlist represents a     *06794100
                         connect request                                06794200
IXGENFCONNDISCDISCONNECT EQU X'04' If set, this parmlist represents a  *06794300
                         disconnect request                             06794400
         ORG   IXGENFCONNDISCFLAGS+X'00000001'                          06794500
IXGENFCONNDISCNUMOFREADS DS 1FL4 Number of read connections to this    *06794600
                         log stream. Set for both connect and          *06794700
                         disconnect events                              06794800
IXGENFCONNDISCNUMOFWRITES DS 1FL4 Number of write connections to this  *06794900
                         log stream. Set for both connect and          *06795000
                         disconnect events                              06795100
IXGENFCONNDISCLSDESCRIPTION DS 1CL0016 LS Description data specified   *06795200
                         when the log stream was defined or its        *06795300
                         definition updated in inventory                06795400
         ORG   IXGENFUNION1                                             06795500
IXGENFWROFFLOADINFO DS 0CL0042 Writer Offload has completed from       *06795700
                         Logger inventory                               06796000
IXGENFWROFFLOADGMTTIMESTAMP DS 1BL8 Time stamp                          06796300
IXGENFWROFFLOADLOGSTREAMNAME DS 1CL0026 log stream name                 06796600
IXGENFWROFFLOADSAFEIMPORTPOINT DS 1CL0008 Highest log block id, that   *06797000
                         is no longer in the coupling facility          06797400
         ORG   IXGENFUNION1                                             06797800
IXGENFLOGSTREAMNAMES DS 1CL0026 Name(s) of log streams that are        *06800000
                         connected to the structure and affected by    *06850000
                         the reported event                             06900000
IXGENFEYECATCHER EQU C'ENF '                                            06925000
IXGENF_LEN EQU *-IXGENF                                                 06950000
.L0002   ANOP                                                           07000000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 07050000
         AIF   ('&LIST' EQ 'YES').P4                                    07100000
.P3      ANOP                                                           07150000
         POP   PRINT                                                    07200000
.P4      ANOP                                                           07250000
.P_EXIT  ANOP                                                           07300000
         MEND                                                           07350000
**/ IXGENF_2:;                                                          07400000
* %IXGENF_INCLUDED = 'YES';                                             07450000
* %DCL ZCBPRINT CHAR EXT;                                               07500000
* %DEACTIVATE ZCBPRINT;                                                 07550000
* %DCL IXGENF_LIST CHAR EXT;                                            07600000
* %DEACTIVATE IXGENF_LIST;                                              07650000
* %IF IXGENF_LIST ^= 'NO' &                                             07700000
*    ZCBPRINT ^= 'NO' %THEN                                             07750000
*   %GOTO IXGENF_3;                                                     07800000
*   @LIST PUSH NOECHO;                                                  07850000
*   @LIST NOASSEMBLE NOECHO;                                            07900000
*   @LIST OFF C NOECHO;                                                 07950000
* %IXGENF_3:;                                                           08000000
*/* Start of PL/X Source                                             */ 08050000
*                                                                       08100000
*   DECLARE                                                             08150000
*     1    IXGENF BDY(DWORD) BASED,       /* LOGR Event Notification    08200000
*                                            Parameter List          */ 08250000
*                                                                       08300000
*      3   IxgenfCommon,                                                08350000
*       5    IxgenfAcronym CHAR(4),       /* Eyecatcher C'ENF '      */ 08400000
*       5    IxgenfComponent CHAR(5),     /* Component Acronym       */ 08450000
*       5    * CHAR(3),                   /* Unused                  */ 08500000
*       5    IxgenfEvents BIT(32),        /* Event Flags             */ 08527700
*                                                                       08555500
*          7   IxgenfEventsByte0      Bit(8),                 /* @L3A*/ 08561000
*                                                                       08566500
*            9  IxgenfSystemLoggerAvail  Bit(1),                        08572000
*                                         /* MVS System Logger          08577500
*                                            Services available.     */ 08583000
*                                                                       08588500
*            9  IxgenfSystemLoggerNotAvailForIPL Bit(1),                08594000
*                                         /* MVS System Logger Services 08599500
*                                            are not available for the  08605000
*                                            duration of this IPL. A    08610500
*                                            Re-IPL of the system is    08616000
*                                            necessary to activate      08621500
*                                            MVS System Logger          08627000
*                                            Services.           @L2A*/ 08632500
*                                                                       08638000
*            9  IxgenfLogstreamsAvailable        Bit(1),                08638100
*                                         /* Logstream resources mapped 08638200
*                                            to the structure named in  08638300
*                                            IxgenfStrname are          08638400
*                                            available for use. See     08638500
*                                            IxgenfEventReasons         08638600
*                                            for the specific reason    08638700
*                                            logstream resources for    08638800
*                                            the affected logstreams    08638900
*                                            are available.      @L4A*/ 08639000
*                                                                       08639100
*            9  IxgenfLogstreamsNotAvailable     Bit(1),                08639200
*                                         /* Logstream resources mapped 08639300
*                                            to the structure named in  08639400
*                                            IxgenfStrname are not      08639500
*                                            available for use. See     08639600
*                                            IxgenfEventReasons         08639700
*                                            for the specific reason    08639800
*                                            logstream resources for    08639900
*                                            the affected logstreams    08640000
*                                            are not available.  @L4A*/ 08640100
*                                                                       08640200
*            9  IxgenfLogstreamResourceChange    Bit(1),                08640300
*                                         /* A change in the state of   08640400
*                                            the resources allocated    08640500
*                                            to the logstreams listed   08640600
*                                            has occurred.       @L4A*/ 08640700
*                                                                       08640800
*            9  IxgenfSystemLoggerResourceChg    Bit(1),                08640900
*                                         /* A change in the state of   08641000
*                                            resources that the System  08641100
*                                            Logger has interest in has 08641200
*                                            occurred (i.e. coupling    08641300
*                                            facility resource change)  08641400
*                                                                @L4A*/ 08641500
*            9  IxgenfLogStreamConnDisc BIT(1), /* A connection to or a 08642900
*                                            disconnection from a log   08644300
*                                            has been successful in     08645700
*                                            the sysplex         @L7A*/ 08647100
*          7   IxgenfEventsByte1      Bit(8),                 /* @L3A*/ 08648500
*            9 IxgenfLogStreamDefUpdate BIT(1), /* Either a log stream  08649900
*                                            has been defined or its    08651300
*                                            defintion has been         08652700
*                                            updated             @L7A*/ 08654100
*            9 IxgenfLogStreamDelete BIT(1), /* Log stream definition   08655500
*                                            deleted from Logger        08656900
*                                            inventory           @L7A*/ 08658300
*            9 IxgenfLogStreamOffloadComplete BIT(1), /* A writer       08659700
*                                            offload event for the      08661100
*                                            log stream has completed   08662500
*                                                                @L8A*/ 08662900
*            9 IxgenfRMDisabled BIT(1),      /* The resource manager    08663300
*                                            associated with the log    08663700
*                                            stream has been disabled   08664100
*                                            because it abended and     08664500
*                                            did not recover     @L8A*/ 08664900
*          7   IxgenfEventsByte2      Bit(8),                 /* @L3A*/ 08665300
*                                                                       08666700
*          7   IxgenfEventsByte3      Bit(8),                 /* @L3A*/ 08668100
*                                                                       08669500
*       5    IxgenfEventReasons    BIT(32),                             08670900
*                                        /* Specific reasons that the   08672300
*                                           events are being reported   08673700
*                                           for.                 @L4C*/ 08675100
*                                                                       08676500
*          7   IxgenfEventReasonsByte0 Bit(8),                /* @L4C*/ 08677900
*                                                                       08679300
*            9  IxgenfStrRebuildStart    Bit(1),                        08680700
*                                    /* Structure Rebuild processing    08683200
*                                       for a log stream has begun.     08722900
*                                       Programs connected to an        08762600
*                                       affected log stream are         08802300
*                                       expected to cease invoking MVS  08842000
*                                       System Logger functions.  If    08881700
*                                       any functions are invoked       08921400
*                                       against an affected log         08961100
*                                       stream, they are rejected.      09000800
*                                       This reason is valid for event  09040500
*                                       IxgenfLogstreamsNotAvailable    09080200
*                                                                @L4C*/ 09119900
*                                                                       09159600
*                                                                       09200000
*            9  IxgenfStrRebuildComplete Bit(1),                        09250000
*                                    /* Structure Rebuild processing    09300000
*                                       for a log stream has completed. 09350000
*                                       Programs may resume invoking    09400000
*                                       MVS System Logger functions     09450000
*                                       This reason is valid for event  09500000
*                                       IxgenfLogstreamsAvailable.      09550000
*                                                                @L4C*/ 09600000
*                                                                       09650000
*                                                                       09783300
*            9  IxgenfStrRebuildFailed   Bit(1),                        09816600
*                                    /* Structure Rebuild processing    09827600
*                                       has failed. Connections to the  09838600
*                                       structure named in              09849600
*                                       IxgenfStrName from this system  09860600
*                                       are in a failed state. Requests 09871600
*                                       for the affected log stream(s)  09882600
*                                       are rejected.  This reason is   09893600
*                                       valid for event                 09904600
*                                       IxgenfLogstreamsNotAvailable    09915600
*                                                                @L4C*/ 09926600
*                                                                       09937600
*            9  IxgenfStagingDsStorageAvailable  BIT(1),                09950800
*                                    /* Reclamation of staging data set 09964000
*                                       space has completed. Staging    09977200
*                                       data set space is now available 09990400
*                                       for use by the subject          10003600
*                                       logstream.  This reason is      10016800
*                                       valid for event                 10030000
*                                       IxgenfLogstreamsAvailable.      10043200
*                                                                @Q1A*/ 10056600
*                                                                       10070000
*            9  IxgenfLogstreamStorageAvailable  BIT(1),                10071400
*                                    /* Migration of logstream data to  10072800
*                                       DASD to reach the low           10074200
*                                       threshold value of the current  10075600
*                                       logstream storage consumption   10077000
*                                       limit has completed. Coupling   10078400
*                                       facility storage is now         10079800
*                                       available for use by the        10081200
*                                       subject logstream.  This reason 10082600
*                                       is valid for event              10084000
*                                       IxgenfLogstreamsAvailable.      10085500
*                                                                @L5C*/ 10088700
*                                                                       10092000
*            9  IxgenfLossOfData         Bit(1),                        10093000
*                                    /* A loss of data condition        10094000
*                                       may exist for the affected      10095000
*                                       logstream(s).  This reason is   10096000
*                                       valid for event                 10097000
*                                       IxgenfLogstreamResourceChange.  10098000
*                                                                @L4A*/ 10099000
*            9  IxgenfCfResourceChange           Bit(1),                10100000
*                                    /* A change in the state of        10101000
*                                       coupling facility resources     10102000
*                                       has occurred and reported by    10103000
*                                       ENF 35.  When the resource      10104000
*                                       change is related to a          10105000
*                                       specific coupling facility      10106000
*                                       structure, IxgenfStrName will   10107000
*                                       contain the name of the         10108000
*                                       structure that was affected by  10109000
*                                       the resource change. This       10110000
*                                       reason is valid for event       10111000
*                                       IxgenfSystemLoggerResourceChg.  10112000
*                                                                @L4A*/ 10113000
*            9  IxgenfXESrecommendaction         Bit(1),                10113600
*                                    /* A XES Recommend Action event    10114200
*                                       was received by the MVS System  10114800
*                                       Logger Structure Event Exit     10115400
*                                       instructing System Logger       10116000
*                                       to discontinue use (disconnect  10116600
*                                       from) of the structure named    10117200
*                                       in IxgenfStrName. The XES       10117800
*                                       recommended action is based     10118400
*                                       on installation specified SFM   10119000
*                                       and CFRM policy values.         10119600
*                                       Connections to the affected     10120200
*                                       logstream(s) have been          10120800
*                                       terminated by System Logger.    10121400
*                                       This reason is valid for event  10122000
*                                       IxgenfLogstreamsNotAvailable.   10122600
*                                                                @L5A*/ 10123200
*                                                                       10123800
*          7   IxgenfEventReasonsByte1 Bit(8),                /* @L4C*/ 10125000
*                                                                       10136000
*            9  IxgenfComponentError  Bit(1),                           10136500
*                                    /* A system logger component       10137500
*                                       error has occurred.             10138500
*                                       The System Logger had           10139500
*                                       to discontinue use (disconnect  10140500
*                                       from) of the structure named    10141000
*                                       in IxgenfStrName.               10141500
*                                       Connections to the affected     10142000
*                                       logstream(s) have been          10142500
*                                       terminated by System Logger.    10143000
*                                       This reason is valid for event  10143500
*                                       IxgenfLogstreamsNotAvailable.   10144000
*                                                                @L6A*/ 10144500
*            9  IxgenfStrResourceChange           Bit(1),               10144700
*                                    /* Resources in the structure      10144900
*                                       named in IxgenfStrName have     10145100
*                                       become available. Requests      10145300
*                                       that were rejected due to       10145500
*                                       a structure resource shortage   10145700
*                                       or structure full condition     10145900
*                                       should be attempted again.      10146100
*                                                                @01A*/ 10146300
*            9  IxgenfReqLogResNotAvail          Bit(1),         ! @L9A 10146400
*                                    /* Logger required resources are   10146500
*                                       not available (e.g. staging     10146600
*                                       dataset could not be allocated) 10146700
*                                                                    */ 10146800
*                                                                       10146900
*          7   IxgenfEventReasonsByte2 Bit(8),                /* @L4C*/ 10147000
*                                                                       10158000
*          7   IxgenfEventReasonsByte3 Bit(8),                /* @L4C*/ 10159800
*                                                                       10161600
*       5    IxgenfEventSpecificInfo   BIT(32),                         10163400
*                                    /* Event Specific Information that 10165200
*                                       provides additional information 10167000
*                                       about the reported event and    10168800
*                                       the reason that the event is    10170600
*                                       reported.                @L4A*/ 10172400
*                                                                       10174200
*                                                                       10176000
*          7   IxgenfEventSpecificInfoByte0 Bit(8),           /* @L4A*/ 10177800
*                                                                       10180000
*            9  IxgenfStrRebuildFailLossConn Bit(1),                    10191000
*                                    /* This bit is only valid when     10193900
*                                       IxgenfStrRebuildFailed is ON.   10196800
*                                       Structure Rebuild processing    10199700
*                                       has failed. A loss of           10202600
*                                       connectivity to the structure   10205500
*                                       named in IxgenfStrname has left 10208400
*                                       this system with no coupling    10211300
*                                       facility resources allocated to 10214200
*                                       the affected log stream(s).     10217100
*                                                                @L4M*/ 10220000
*                                                                       10223800
*            9  IxgenfStrRebuildFailStrFail Bit(1),                     10225500
*                                    /* This bit is only valid when     10227300
*                                       IxgenfStrRebuildFailed is       10229100
*                                       ON. Structure Rebuild           10230900
*                                       processing has failed.          10232700
*                                       A structure failure to the      10234500
*                                       structure named in              10236300
*                                       IxgenfStrname has left this     10238100
*                                       system with no coupling         10239900
*                                       facility resources allocated to 10241700
*                                       the affected log stream(s).     10243500
*                                                                @L4M*/ 10245300
*            9  *      Bit(1),       /* Unused - Available       @01C*/ 10246400
*                                                                       10247600
*                                                                       10297600
*            9  IxgenfLossOfConnectivity Bit(1),                        10427400
*                                    /* This bit is only valid when     10428500
*                                       IxgenfXESrecommendaction is ON. 10429600
*                                       The XES Recommend Action event  10430700
*                                       was initiated due to a loss     10431800
*                                       of connectivity between the     10432900
*                                       coupling facility structure     10434000
*                                       named in IxgenfStrName and the  10435100
*                                       system that the ENF Listener    10436200
*                                       exit that receives this         10437300
*                                       parameter list is executing on. 10438400
*                                                                @L5A*/ 10439500
*                                                                       10441000
*            9  IxgenfLogstreamDisconnected Bit(1),                     10441100
*                                    /* This bit is only valid when     10441200
*                                       IxgenfXESrecommendaction is ON  10441300
*                                       or IxgenfComponentError is ON.  10441400
*                                       Connections to the affected     10441500
*                                       logstream(s) have been          10441600
*                                       terminated by System Logger.    10441700
*                                       The streamtoken that uniquely   10441800
*                                       defined the connection has been 10441900
*                                       invalidated. All connectors     10442000
*                                       should clean up information     10442100
*                                       related to the invalidated      10442200
*                                       streamtoken.             @L7A*/ 10442300
*            9  IxgenfStgAllocErr           Bit(1), ! @L9A              10442400
*                                    /* Staging Data set could not be   10442500
*                                       allocated                    */ 10442600
*                                                                       10442700
*                                                                       10442800
*          7   IxgenfEventSpecificInfoByte1 Bit(8),           /* @L4A*/ 10442900
*                                                                       10443400
*          7   IxgenfEventSpecificInfoByte2 Bit(8),           /* @L4A*/ 10444600
*                                                                       10445800
*          7   IxgenfEventSpecificInfoByte3 Bit(8),           /* @L4A*/ 10447000
*                                                                       10448200
*       5    IxgenfStrname CHAR(16),      /* Structure name that is     10450000
*                                            the subject of the event   10500000
*                                            being signalled (not       10550000
*                                            provided if the event      10600000
*                                            is not structure           10650000
*                                            related).               */ 10700000
*                                                                       10750000
*                                                                       10800000
*       5    IxgenfLogStreamCount Fixed(32),                            10850000
*                                         /* Number of log streams that 10900000
*                                            are connected to the       10950000
*                                            structure and affected by  11000000
*                                            the reported event      */ 11050000
*       5    *                    CHAR(16),                             11066600
*                                         /* Unused - Available      */ 11083200
*       3    IxgenfUnion1 UNION,          /*                    @L8A */ 11083300
*            5 IxgenfResMgrDisabled, /* Resource Manager exit has been  11083400
*                                       disabled                @L8A */ 11083500
*                7 IxgenfResMgrGMTTimeStamp BIT(64), /* Time stamp      11083600
*                                                               @L8A */ 11083700
*                7 IxgenfResMgrLogStreamName                            11083800
*                   CHAR(LENGTH(IxgenfLogStreamNames)), /* log stream   11083900
*                                             name              @L8A */ 11084000
*                7 IxgenfResMgrName CHAR(8),/* Resource Manager         11084100
*                                             associated with this log  11084200
*                                             stream.           @L8A */ 11084300
*                7 IxgenfResMgrData CHAR(8), /* Resource                11084400
*                                             Manager Data.     @L8A */ 11084500
*                7 IxgenfResMgrLSDescription  CHAR(16), /* Description  11084600
*                                            associated with the log    11084700
*                                            stream             @L8A */ 11084800
*                7 IxgenfResMgrAbendCode CHAR(4),/* Copy of SDWAABCC    11084900
*                                            if an sdwa was available   11085000
*                                            when the resource manager  11085100
*                                            was disabled else          11085200
*                                            binary zeroes      @L8A */ 11085300
*            5 IxgenfInventoryDefUpdate,  /* Log stream define or       11085400
*                                            update section     @L8A */ 11085500
*              7  IxgenfInventoryGMTTimeStamp BIT(64), /* Time          11085600
*                                            stamp              @L8A */ 11085700
*              7  IxgenfInventorySysName CHAR(8), /* System name on     11085800
*                                        which the define or update     11085900
*                                        occurred               @L8A */ 11086000
*              7  IxgenfInventoryLogStreamName                          11086100
*                  CHAR(LENGTH(IxgenfLogStreamNames)), /* Log stream    11086200
*                                            name               @L8A */ 11086300
*              7  IxgenfInventoryLogStreamDefTime BIT(64), /* Set to    11086400
*                                            binary zeroes for log      11086500
*                                            streams defined or         11086600
*                                            changed prior to OS390R3.  11086800
*                                            For log streams defined    11087100
*                                            when OS390R3 is installed, 11087400
*                                            this field contains the    11087700
*                                            define time. For log       11088000
*                                            streams defined before     11088300
*                                            OS390R3 and updated after  11088600
*                                            OS390R3 is installed, this 11088900
*                                            field contains the time of 11089200
*                                            first update.              11089500
*                                                               @L8A */ 11089800
*              7  IxgenfInventoryResMgrName CHAR(8), /* Resource        11090100
*                                            Manager associated with    11090400
*                                            this log stream. If binary 11090700
*                                            zeroes, no resource mgr    11091000
*                                            is associated with this    11091300
*                                            log stream         @L8A */ 11091600
*              7  IxgenfInventoryStructName CHAR(16), /* CF structure   11091900
*                                            name to which the log      11092200
*                                            stream maps        @L8A */ 11092500
*              7  IxgenfInventoryFlags BIT(16), /* Flags        @L8A */ 11092800
*                 9 IxgenfInventoryDefineReq BIT(1), /* If set, request 11093100
*                                            is to define a log stream  11093400
*                                                               @L8A */ 11093700
*                 9 IxgenfInventoryUpdateReq BIT(1), /* If set, request 11094000
*                                            is to update the log       11094300
*                                            stream definition  @L8A */ 11094600
*                 9 IxgenfInventoryStgDuplexYes BIT(1), /* If set,      11094900
*                                            STG_DUPLEX=YES in          11095200
*                                            effect             @L8A */ 11095500
*                 9 IxgenfInventoryStgModeCond BIT(1), /* If set,       11095800
*                                            Duplex_Mode=Cond in        11096100
*                                            effect             @L8A */ 11096400
*                 9 IxgenfInventoryModelYes BIT(1), /* If set, this is  11096700
*                                            a log stream model         11097000
*                                            definition         @L8A */ 11097300
*                 9 IxgenfInventoryDasdOnlyYes BIT(1), /* If set,       11097400
*                                            this is a DASD only log    11097500
*                                            stream definition  @L9A */ 11097600
*              7  IxgenfInventoryStGDataClas CHAR(8), /* Data class     11097700
*                                            for staging data sets      11097900
*                                                               @L8A */ 11098200
*              7  IxgenfInventoryStGMgmtClas CHAR(8), /* Mgmt class     11098500
*                                            for staging data sets      11098800
*                                                               @L8A */ 11099100
*              7  IxgenfInventoryStGStorClas CHAR(8), /* Storage class  11099400
*                                            for staging data sets      11099700
*                                                               @L8A */ 11100000
*              7  IxgenfInventoryLSDataClas CHAR(8), /* Data class      11100300
*                                            for log stream data sets   11100600
*                                                               @L8A */ 11100900
*              7  IxgenfInventoryLsMgmtClas CHAR(8), /* Mgmt class      11101200
*                                            for log stream data sets   11101500
*                                                               @L8A */ 11101800
*              7  IxgenfInventoryLsStorClas CHAR(8), /* Storage class   11102100
*                                            for log stream data sets   11102400
*                                                               @L8A */ 11102700
*              7 IxgenfInventoryLowOffload FIXED(31), /* Low offload    11103000
*                                            threshold          @L8A */ 11103300
*              7 IxgenfInventoryHighOffload FIXED(31), /* High offload  11103600
*                                            threshold          @L8A */ 11103900
*              7 IxgenfInventoryLSDescription CHAR(16), /* Logstream    11104000
*                                            description        @L8A */ 11104100
*            5 IxgenfInventoryDelete,     /* Log stream delete from     11104200
*                                            inventory          @L8A */ 11104500
*                7 IxgenfInventoryDelGMTTimeStamp BIT(64),              11104800
*                                         /* Time stamp         @L8A */ 11105100
*                7 IxgenfInventoryDelSysName CHAR(8), /* System name on 11105200
*                                        which the log stream delete    11105300
*                                        occurred               @L8A */ 11105400
*                7 IxgenfInventoryDelLogStreamName                      11105500
*                   CHAR(LENGTH(IxgenfLogStreamNames)), /* Log stream   11105700
*                                                          name @L8A */ 11106000
*                7 IxgenfInventoryDelResMgrName CHAR(8), /* Resource    11106300
*                                            Manager Name       @L8A */ 11106600
*            5   IxgenfConnDiscInfo,   /* Successful connect to or      11106700
*                                        disconnect from a log          11106800
*                                        stream                 @L8A */ 11106900
*                7 IxgenfConnDiscSysName CHAR(8), /* System name on     11107000
*                                       which the connect or disconnect 11107100
*                                        occurred               @L8A */ 11107200
*                7 IxgenfConnDiscGMTTimeStamp BIT(64), /* Time stamp    11107800
*                                             Set for both connect and  11108100
*                                             disconnect events @L8A */ 11108400
*                7 IxgenfConnDiscLogStreamName                          11108700
*                   CHAR(LENGTH(IxgenfLogStreamNames)), /* log stream   11109000
*                                             name. Set for both        11109300
*                                             connect and disconnect    11109600
*                                             events            @L8A */ 11109900
*                7 IxgenfConnDiscLogStreamDefTime BIT(64), /* Set to    11110200
*                                           binary zeroes for log       11110500
*                                           streams defined or          11110800
*                                           changed prior to OS390R3.   11111100
*                                           For log streams defined     11111400
*                                           when OS390R3 is installed,  11111700
*                                           this field contains the     11112000
*                                           define time. For log        11112300
*                                           streams defined before      11112600
*                                           OS390R3 and updated after   11112900
*                                           OS390R3 is installed, this  11113200
*                                           field contains the time of  11113500
*                                           first update.               11113800
*                                                              @L8A */  11114100
*                                                                       11114400
*                                                                       11114700
*                                                                       11115000
*                                                                       11115300
*                                                                       11115600
*                                                                       11115900
*                7 IxgenfConnDiscLogStreamStrVer BIT(64),               11116200
*                                          /* Version number of the     11116500
*                                             CF structure associated   11116800
*                                             with this log stream. Set 11117100
*                                             for both ConnSuccess and  11117400
*                                             DisconnSuccess events     11117700
*                                                               @L8A */ 11118000
*                                                                       11118300
*                  9 IxgenfConnDiscLogStreamInsVer BIT(64),             11118400
*                                          /* Alternate name for DASD   11118500
*                                             only log stream.  STCK    11118600
*                                             value when the log stream 11118700
*                                             staging data set was      11118800
*                                             allocated         @L9A */ 11118900
*                7 IxgenfConnDiscResMgrName CHAR(8),/* Resource Manager 11119000
*                                             associated with this log  11119100
*                                             stream. If binary zeroes, 11119200
*                                             no RM is associated with  11119500
*                                             the log stream. This is   11119800
*                                             the resource manager name 11120100
*                                             specified on the log      11120400
*                                             stream's inventory        11120700
*                                             record. To check if the   11121000
*                                             resource manager is       11121300
*                                             connected, check field    11121600
*                                             IxgenfConnDiscResMgr-     11121900
*                                             -Connected. Set for both  11122200
*                                             connect and disconnect    11122500
*                                             events            @L8A */ 11122800
*                                                                       11123100
*                                                                       11123400
*                7 IxgenfConnDiscResMgrData CHAR(8), /* Resource        11123700
*                                             Manager Data. Contains    11124000
*                                             valid data only if        11124300
*                                             IxgenfConnDiscResMgr-     11124600
*                                             -Connected is set. Set    11124900
*                                             for both connect and      11125200
*                                             disconnect events @L8A */ 11125500
*                7 IxgenfConnDiscResMgrEvents BIT(8), /* Monitored      11125800
*                                             events. Contains          11126100
*                                             valid data only if        11126400
*                                             IxgenfConnDiscResMgr-     11126700
*                                             -Connected is set @L8A */ 11127000
*                  9 IxgenfConnDiscLBWrites BIT(1), /* If set, the      11127300
*                                             resource manager is       11127600
*                                             monitoring log block      11127900
*                                             write events      @L8A */ 11128200
*                  9 IxgenfConnDiscLBDeletes BIT(1), /* If set, the     11128500
*                                             resource manager is       11128800
*                                             monitoring log block      11129100
*                                             delete events     @L8A */ 11129400
*                7 IxgenfConnDiscFlags BIT(8), /* Additional            11129700
*                                             flags             @L8A */ 11130000
*                  9 IxgenfConnDiscAuthRead BIT(1), /* If set then      11130300
*                                             AUTH=READ specified on    11130600
*                                             the connect request. Set  11130900
*                                             for successful connect    11131200
*                                             requests.         @L8A */ 11131500
*                  9 IxgenfConnDiscAuthWrite BIT(1), /* If set then     11131800
*                                             AUTH=READ specified on    11132100
*                                             the connect request. Set  11132400
*                                             for successful connect    11132700
*                                             requests          @L8A */ 11133000
*                  9 IxgenfConnDiscResMgrManaged bit(1), /* If set,     11133300
*                                             RMNAME keuword specified  11133600
*                                             on log stream definition  11133900
*                                                               @L8A */ 11134200
*                  9 IxgenfConnDiscResMgrConnected bit(1), /* If set,   11134500
*                                             resource manager is       11134800
*                                             connected to the log      11135100
*                                             stream. Valid for both    11135400
*                                             connect and disconnect    11135700
*                                             events            @L8A */ 11136000
*                  9 IxgenfConnDiscConnect bit(1), /* If set, this      11136300
*                                             parmlist represents a     11136600
*                                             connect request   @L8A */ 11136900
*                  9 IxgenfConnDiscDisConnect bit(1),                   11137200
*                                             /* If set, this           11137500
*                                             parmlist represents a     11137800
*                                             disconnect request        11138100
*                                                               @L8A */ 11138400
*                7 IxgenfConnDiscNumOfReads FIXED(31), /* Number of     11138700
*                                                read connections to    11139000
*                                                this log stream. Set   11139300
*                                                for both connect and   11139600
*                                                disconnect events      11139900
*                                                               @L8A */ 11140200
*                7 IxgenfConnDiscNumOfWrites FIXED(31), /* Number of    11140500
*                                                write connections to   11140800
*                                                this log stream. Set   11141100
*                                                for both connect and   11141400
*                                                disconnect events      11141700
*                                                               @L8A */ 11142000
*                7 IxgenfConnDiscLSDescription CHAR(16),                11142300
*                                             /* LS Description data    11142600
*                                                specified when the     11142900
*                                                log stream was         11143200
*                                                defined or its         11143500
*                                                definition updated in  11143800
*                                                inventory      @L8A */ 11144100
*            5   IxgenfWrOffLoadInfo, /* Writer Offload has completed   11144400
*                                        from Logger inventory          11144700
*                                                               @L8A */ 11145000
*                7 IxgenfWrOffLoadGMTTimeStamp BIT(64), /* Time stamp   11145300
*                                                               @L8A */ 11145600
*                7 IxgenfWrOffLoadLogStreamName                         11145900
*                   CHAR(LENGTH(IxgenfLogStreamNames)), /* log stream   11146200
*                                             name              @L8A */ 11146500
*                7 IxgenfWrOffLoadSafeImportPoint CHAR(8),/* Highest    11146800
*                                             log block id, that is     11147100
*                                             no longer in the          11147400
*                                             coupling facility @L8A */ 11147700
*                                                                       11148100
*                                                                       11148300
*            5   IxgenfLogStreamNames (*) CHAR(26);                     11148600
*                                         /* Name(s) of log streams     11150000
*                                            that are connected to the  11200000
*                                            structure and affected by  11250000
*                                            the reported event @L8A */ 11285000
*   DECLARE  IxgenfEyeCatcher CHAR(4) CONSTANT('ENF '),                 11320000
*                                                                       11330000
*            IxgenfCompId     CHAR(5) CONSTANT('SCLOG');                11340000
*                                                                       11341400
*@LOGIC;                                                                11342800
*#PRAGMA TOOL=CBGEN.                                                    11344200
*#DELETE.IXGENFCOMPID                                                   11345600
*#EPRAGMA.                                                              11347000
*@ENDLOGIC;                                                             11348400
*/* End of PL/X Source                                               */ 11350000
* %IF IXGENF_LIST ^= 'NO' &                                             11400000
*    ZCBPRINT ^= 'NO' %THEN                                             11450000
*   %GOTO IXGENF_4;                                                     11500000
*   @LIST POP NOECHO;                                                   11550000
* %IXGENF_4:;                                                           11600000
* %END;                                                                 11650000
