*                                                                       00002700
* %DCL IXGQBUF_INCLUDED CHAR EXT;                                       00005400
* %DEACTIVATE IXGQBUF_INCLUDED;                                         00008100
* %IF IXGQBUF_INCLUDED = '' %THEN                                       00010800
* %DO;                                                                  00013500
*/* Macro made bi-lingual on 96265. CBGEN compile date 96059         */ 00016200
*% /*                                                                   00018900
         MACRO                                                          00021600
         IXGQBUF &DSECT=YES,&LIST=YES,&TITLE=YES,&QBUF=YES              00024300
         GBLC  &IXGQBUF_INCLUDED                                        00027000
         GBLC  &ZCBPRINT                                                00029700
&IXGQBUF_INCLUDED SETC 'YES'                                            00032400
         AIF   ('&LIST' EQ 'NONE').P0                                   00035100
         AIF   ('&TITLE' EQ 'NO').P5                                    00037800
 TITLE   'IXGQBUF  - Query Buffer                                '      00040500
.P5      ANOP                                                           00043200
**/ IXGQBUF_1:;                                                         00045900
*/* START OF SPECIFICATIONS ******************************************/ 00050000
*/*                                                                  */ 00100000
*/*01* PROPRIETARY STATEMENT=                                        */ 00200000
*/***PROPRIETARY_STATEMENT********************************************/ 00216600
*/*                                                                  */ 00233200
*/*                                                                  */ 00250000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00300000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 00350000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1997, 1999                      */ 00400000
*/*                                                                  */ 00500000
*/* STATUS= HBB6608                                                  */ 00550000
*/*                                                                  */ 00600000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 00650000
*/*                                                                  */ 00700000
*/*                                                                  */ 00750000
*/*02* ACRONYM:  QBUF                                                */ 00800000
*/*                                                                  */ 00850000
*/*01* DESCRIPTIVE NAME: Query Buffer                                */ 00900000
*/*                                                                  */ 00950000
*/*01* MACRO NAME: IXGQBUF                                           */ 01000000
*/*                                                                  */ 01050000
*/*01* DSECT NAME: QBUF                                              */ 01100000
*/*                                                                  */ 01150000
*/*01* Component:  System Logger (SCLOG)                             */ 01200000
*/*                                                                  */ 01250000
*/*01* EYE-CATCHER:  NONE                                            */ 01300000
*/*                                                                  */ 01350000
*/*01* STORAGE ATTRIBUTES:                                           */ 01400000
*/*02*   MAIN STORAGE: Caller's storage or function dynamic storage  */ 01450000
*/*                                                                  */ 01500000
*/*01* SIZE:   72 bytes                                        @P5A  */ 01516600
*/*           QBUF -- X'0048' bytes                                  */ 01533200
*/*                                                                  */ 01550000
*/*01* CREATED BY: CALLER                                            */ 01600000
*/*                                                                  */ 01650000
*/*01* POINTED TO BY: CALLER                                         */ 01700000
*/*                                                                  */ 01750000
*/*                                                                  */ 01800000
*/*01* SERIALIZATION:                                                */ 01850000
*/*     None required                                                */ 01900000
*/*                                                                  */ 01950000
*/*01* FUNCTION: Maps information returned by IXGQUERY               */ 02000000
*/*02*                                                               */ 02050000
*/*                                                                  */ 02100000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 02150000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 02200000
*/*                                                                  */ 02250000
*/*01* METHOD OF ACCESS:                                             */ 02300000
*/*02*  ASM:  IXGQBUF  USING on QBUF                                 */ 02350000
*/*                                                                  */ 02400000
*/*02*  PLX:  %INCLUDE SYSLIB(IXGQBUF)                               */ 02450000
*/*     ASM:  Specify LIST=YES on macro call for listing             */ 02500000
*/*                                                                  */ 02550000
*/*01* DELETED BY: N/A                                               */ 02600000
*/*                                                                  */ 02650000
*/*01* FREQUENCY:  One per call to the Resource Manager exit         */ 02700000
*/*                                                                  */ 02750000
*/*01* DEPENDENCIES: N/A                                             */ 02800000
*/*                                                                  */ 02850000
*/*01* DISTRIBUTION LIBRARY: AMACLIB                                 */ 02900000
*/*                                                                  */ 02950000
*/*01* CHANGE ACTIVITY:                                              */ 03000000
*/*                                                                  */ 03250000
*/*   Flag LineItem  FMID    Date   ID    Comment                    */ 03300000
*/*                                                                  */ 03350000
*/*     $L0=RSR      HBB6603 960130 PDXD: Remote Site Recovery       */ 03357600
*/*     $P2=PQC1489  HBB6603 960617 PDXD: If the safe import point   */ 03365200
*/*                                       to be returned is the      */ 03372800
*/*                                       lowest valid block id      */ 03380400
*/*                                       (rather than the high      */ 03388000
*/*                                       committed rba), subtract 1 */ 03395600
*/*                                       from the low valid blkid   */ 03403200
*/*                                       before returning it to the */ 03410800
*/*                                       caller.                    */ 03418400
*/*     $P3=PQC1730  HBB6603 960717 PDXD: QBUF_LEN defined twice     */ 03420900
*/*                                       causing assembler errors   */ 03423400
*/*     $P4=PQC1931  HBB6603 960717 PDXD: SIZE comment missing from  */ 03424000
*/*                                       prolog causing SHOWHDR     */ 03424600
*/*                                       errors                     */ 03425200
*/*     $P5=PQC1798  HBB6603 960905 PDV6: Loss of Data Bounds        */ 03425600
*/*     $L1=LOGR4    JBB6604 961029 PDTT: Dasd only log stream   @L1A*/ 03437800
*/*                                                                  */ 03450000
*/*END OF SPECIFICATIONS *********************************************/ 03500000
*% /*                                                                   03500700
.P0      ANOP                                                           03501400
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03502100
         AIF   ('&LIST' EQ 'YES').P2                                    03502800
.P1      ANOP                                                           03503500
         PUSH  PRINT                                                    03504200
         PRINT OFF                                                      03504900
.P2      ANOP                                                           03505600
         AIF   ('&QBUF' EQ 'NO').L0002                                  03506300
         AIF   ('&DSECT' EQ 'YES').L0003                                03507000
         AIF   ('&QBUF' NE 'YES').L0002                                 03507700
QBUF     DS    0D        Mapping of returned buffer when IXGQUERY      *03508400
                         requested                                      03509100
         AGO   .L0004                                                   03509800
.L0003   ANOP                                                           03510500
QBUF     DSECT           Mapping of returned buffer when IXGQUERY      *03511200
                         requested                                      03511900
.L0004   ANOP                                                           03512600
QBUF_SECTION_BEGIN DS 0CL0068                                           03513300
QBUF_VERSION_NUMBER DS 1FL4 Version number of this mapping              03514000
QBUF_SAFE_IMPORT_POINT DS 1CL0008 All log blocks with a blockid less   *03514500
                         than or equal to this 8-byte integer can be   *03515000
                         safely imported into a log stream              03515500
QBUF_STRUCT_VERSION_NUMBER DS 0CL0008 Version number of the coupling   *03516100
                         facility being used to support this log       *03516800
                         stream                                    @L1C 03517200
QBUF_INSTANCE_VERSION_NUMBER DS 1CL0008  Alternate name            @L1A 03517600
QBUF_CONTROL_INFO_SIZE DS 1FL4 Number of bytes that System Logger adds *03518200
                         to a log block written via the IXGWRITE       *03518900
                         service                                        03519600
QBUF_LS_TIMESTAMP DS 1CL0008 8 Byte time stamp assigned to the log     *03520300
                         stream. If zero, no time stamp is assigned     03521000
QBUF_NEXT_BLOCKID_TO_BE_ASSIGNED DS 1CL0008 Next log block id to be    *03521700
                         assigned when a log block is successfully     *03522400
                         written to the log stream. May change over a  *03523100
                         rebuild operation                              03523800
QBUF_CF_TIMESTAMP_VALUE DS 1CL0008 GMT Time stamp value maintained in  *03524500
                         the coupling facility for this log stream.    *03525200
                         The next log block written or imported to     *03525900
                         this log stream must have a GMT time stamp    *03526600
                         value >= to this value                         03527300
QBUF_FLAGS DS  0BL1      Flag byte                                      03527400
QBUF_AUTODELETE EQU X'80' ON, log stream data may be deleted whenever  *03527500
                         the retention period expires or whenever the  *03527600
                         data has been deleted via an IXGDELET         *03527700
                         request. OFF, log data may be deleted only    *03527800
                         after the retention period expires and the    *03527900
                         data has been deleted via an IXGDELET         *03528000
                         request.                                       03528100
QBUF_LOSSOFDATA EQU X'40' ON, the log stream has a lost log data. The  *03528200
                         range of log data the is affected is          *03528300
                         identified by QBUF_low_loss_of_data_blkid and *03528400
                         QBUF_high_loss_of_data_blkid. OFF, the log    *03528500
                         stream has not encountered a loss of log      *03528600
                         data.                                          03528700
         ORG   QBUF_FLAGS+X'00000001'                                   03528800
QBUF_RETPD DS  1FL3      Log stream data retention period               03528900
*                                                                       03529000
*     ****************************************************************! 03529100
*     *                                                               ! 03529200
*     * The following two fields represent the loss of data bounds    ! 03529300
*     * for a log stream and are valid only when QBUF_LossOfData is   ! 03529400
*     * ON. The following examples are meant to help explain the      ! 03529500
*     * contents of these two fields, which are the "low loss of data ! 03529600
*     * bound" and the "high loss of data bound". Ex. 1 - assume the  ! 03529700
*     * log stream has 8 log blocks, with block ids 1 thru 8 before a ! 03529800
*     * loss of data occurs and time increase as the block ids        ! 03529900
*     * increase. BlkIDs in LS | 1 2 3 4 5 6 7 8 |. After a loss of   ! 03530000
*     * data that causes log blocks 5 and 6 to be lost, the log       ! 03530100
*     * stream looks like: BlkIDs in LS | 1 2 3 4 loss of data 7 8 |. ! 03530200
*     * IXGQUERY will return: QBUF_low_loss_of_data_blkid = 4         ! 03530300
*     * QBUF_high_loss_of_data_blkid = >8 where >8 means a block id   ! 03530400
*     * that will be the first block ID to be assign to the first log ! 03530500
*     * block write after the loss of data occurs. Ex. 2 - assume the ! 03530600
*     * log stream has 8 log blocks, with block ids 1 thru 8 before a ! 03530700
*     * loss of data occurs and time increase as the block ids        ! 03530800
*     * increase. BlkIDs in LS | 1 2 3 4 5 6 7 8 |. After a loss of   ! 03530900
*     * data that causes log blocks 5 thru 8 to be lost, the log      ! 03531000
*     * stream looks like: BlkIDs in LS | 1 2 3 4 loss of data |.     ! 03531100
*     * IXGQUERY will return: QBUF_low_loss_of_data_blkid = 4         ! 03531200
*     * QBUF_high_loss_of_data_blkid = > 8 where >8 means a block id  ! 03531300
*     * that will be the first block ID to be assign to the first log ! 03531400
*     * block write after the loss of data occurs. Ex. 3 - assume the ! 03531500
*     * log stream has 8 log blocks, 1 thru 8 before a loss of data   ! 03531600
*     * occurs and time increase as the block ids increase. BlkIDs in ! 03531700
*     * LS | 1 2 3 4 5 6 7 8 |. After a loss of data that causes log  ! 03531800
*     * blocks 1 thru 8 to be lost, the log stream looks like: BlkIDs ! 03531900
*     * in LS | loss of data. |. IXGQUERY will return:                ! 03532000
*     * QBUF_low_loss_of_data_blkid = < 1 where <1 means a block id   ! 03532100
*     * that will be less than any block ID in the log stream.        ! 03532200
*     * QBUF_high_loss_of_data_blkid = > 8 where >8 means a block id  ! 03532300
*     * that will be the first block ID to be assign to the first log ! 03532400
*     * block write after the loss of data occurs.                    ! 03532500
*     *                                                               ! 03532600
*     ****************************************************************! 03532700
*                                                                       03532800
*                                                                       03532900
QBUF_LOW_LOSS_OF_DATA_BLKID DS 1CL0008 If log stream has encountered a *03533000
                         loss of data condition, this field contains a *03533100
                         log block id just prior to (older than) the   *03533200
                         first occurance of the loss of data range in  *03533300
                         the log stream. Note, as the prior examples   *03533400
                         indicate, there is no guaranteed that this    *03533500
                         block ID represents a valid log block ID in   *03533600
                         the log stream (see Ex. 3).                    03533700
QBUF_HIGH_LOSS_OF_DATA_BLKID DS 1CL0008 If log stream has encountered  *03533800
                         a loss of data condition, this field contains *03533900
                         a log block id just after (younger than) the  *03534000
                         loss of data range in the log stream. Note,   *03534100
                         as the prior examples indicate, there is no   *03534200
                         guaranteed that this block ID represents a    *03534300
                         valid log block ID in the log stream (see Ex. *03534400
                         2).                                            03534500
QBUF_RESERVED DS 1CL0004 Insert filler bytes to insure QBUF section is *03534600
                         a multiple of doublewords in length            03534700
QBUFEND  DS    0C        End of QBUF                                    03534800
QBUF_LENGTH EQU 72                                                      03534900
QBUFVERNUM EQU 0                                                        03535000
QBUF_LEN EQU   *-QBUF                                                   03535100
.L0002   ANOP                                                           03535200
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 03535300
         AIF   ('&LIST' EQ 'YES').P4                                    03535400
.P3      ANOP                                                           03535500
         POP   PRINT                                                    03535600
.P4      ANOP                                                           03535700
.P_EXIT  ANOP                                                           03536400
         MEND                                                           03537100
**/ IXGQBUF_2:;                                                         03537800
* %IXGQBUF_INCLUDED = 'YES';                                            03538500
* %DCL ZCBPRINT CHAR EXT;                                               03539200
* %DEACTIVATE ZCBPRINT;                                                 03539900
* %DCL IXGQBUF_LIST CHAR EXT;                                           03540600
* %DEACTIVATE IXGQBUF_LIST;                                             03541300
* %IF IXGQBUF_LIST ^= 'NO' &                                            03542000
*    ZCBPRINT ^= 'NO' %THEN                                             03542700
*   %GOTO IXGQBUF_3;                                                    03543400
*   @LIST PUSH NOECHO;                                                  03544100
*   @LIST NOASSEMBLE NOECHO;                                            03544800
*   @LIST OFF C NOECHO;                                                 03545500
* %IXGQBUF_3:;                                                          03546200
*/* Start of PL/X Source                                             */ 03546900
* DCL 1 QBUF BDY(DWORD) BASED,     /* Mapping of returned buffer when   03550000
*                                     IXGQUERY requested             */ 03600000
*      2  QBUF_Section_Begin,                                           03650000
*                                                                       03700000
*         3 QBUF_Version_Number FIXED(31), /* Version number            03750000
*                                             of this mapping        */ 03800000
*         3 QBUF_Safe_Import_Point CHAR(8), /* All log blocks with a    03825000
*                                     blockid less than or equal to     03850000
*                                     this 8-byte integer can be        03875000
*                                     safely imported into a log        03900000
*                                     stream                    @P2C */ 03925000
*         3 QBUF_Struct_Version_Number CHAR(8),/* Version number of the 03950000
*                                     coupling facility being used to   04000000
*                                     support this log stream        */ 04050000
*           5 QBUF_Instance_Version_Number CHAR(8), /* Alternate name   04066600
*                                                                @L1A*/ 04083200
*         3 QBUF_Control_Info_Size FIXED(31),/* Number of bytes that    04100000
*                                     System Logger adds to a log block 04150000
*                                     written via the IXGWRITE service  04200000
*                                                                    */ 04250000
*         3 QBUF_LS_TimeStamp CHAR(8), /* 8 Byte time stamp assigned to 04300000
*                                     the log stream. If zero, no time  04350000
*                                     stamp is assigned              */ 04400000
*         3 QBUF_Next_BlockID_To_Be_Assigned CHAR(8), /* Next log block 04450000
*                                     id to be assigned when a log      04500000
*                                     block is successfully written to  04550000
*                                     the log stream. May change over a 04600000
*                                     rebuild operation              */ 04650000
*         3 QBUF_CF_TimeStamp_Value CHAR(8), /* GMT Time stamp value    04700000
*                                     maintained in the coupling        04750000
*                                     facility for this log stream. The 04800000
*                                     next log block written or         04850000
*                                     imported to this log stream must  04900000
*                                     have a GMT time stamp value >=    04950000
*                                     to this value                  */ 05000000
*         3 QBUF_FLAGS BIT(8),    /* Flag byte                       */ 05003800
*           5 QBUF_AutoDelete bit(1), /* ON, log stream data may be     05007600
*                   deleted whenever the retention period               05011400
*                   expires or whenever the data has been               05015200
*                   deleted via an IXGDELET request. OFF,               05019000
*                   log data may be deleted only after                  05022800
*                   the retention period expires and the                05026600
*                   data has been deleted via an IXGDELET               05030400
*                   request.                                         */ 05034200
*           5 QBUF_LossOfData bit(1), /* ON, the log stream has         05035000
*                   a lost log data. The range of log data the          05035800
*                   is affected is identified by                        05036600
*                   QBUF_low_loss_of_data_blkid and                     05037400
*                   QBUF_high_loss_of_data_blkid.                       05038200
*                   OFF, the log stream has not encountered             05039000
*                   a loss of log data.                          @P5A*/ 05039800
*           5 * BIT(6),           /* Reserved for expansion          */ 05040600
*         3 QBUF_Retpd FIXED(24), /* Log stream data retention          05041800
*                                    period                          */ 05045600
*         !                                                             05046100
*         ! The following two fields represent the loss of data         05046600
*         ! bounds for a log stream and are valid only when             05047100
*         ! QBUF_LossOfData is ON.                                      05047600
*         !                                                             05048100
*         ! The following examples are meant to help explain the        05048600
*         ! contents of these two fields,                               05049100
*         ! which are the "low loss of data bound"                      05049600
*         ! and the "high loss of data bound".                          05050100
*         !                                                             05050600
*         ! Ex. 1 - assume the log stream has 8 log blocks, with block  05051100
*         !         ids 1 thru 8 before a loss of data occurs           05051600
*         !         and time increase as the block ids increase.        05052100
*         !                                                             05052600
*         !     BlkIDs                                                  05053100
*         !     in LS  | 1  2  3  4  5  6  7  8          |.             05053600
*         !                                                             05054100
*         !   After a loss of data that causes log blocks 5 and         05054600
*         !   6 to be lost, the log stream looks like:                  05055100
*         !                                                             05055600
*         !     BlkIDs                                                  05056100
*         !     in LS  | 1  2  3  4  loss of data  7  8  |.             05056600
*         !                                                             05057100
*         !   IXGQUERY will return:                                     05057600
*         !       QBUF_low_loss_of_data_blkid = 4                       05058100
*         !       QBUF_high_loss_of_data_blkid = >8                     05058600
*         !           where >8 means a block id that will be            05059100
*         !           the first block ID to be assign to the            05059600
*         !           first log block write after the loss              05060100
*         !           of data occurs.                                   05060600
*         !                                                             05061100
*         ! Ex. 2 - assume the log stream has 8 log blocks, with block  05061600
*         !         ids 1 thru 8 before a loss of data occurs           05062100
*         !         and time increase as the block ids increase.        05062600
*         !                                                             05063100
*         !     BlkIDs                                                  05063600
*         !     in LS  | 1  2  3  4  5  6  7  8   |.                    05064100
*         !                                                             05064600
*         !   After a loss of data that causes log blocks 5 thru        05065100
*         !   8 to be lost, the log stream looks like:                  05065600
*         !                                                             05066100
*         !     BlkIDs                                                  05066600
*         !     in LS  | 1  2  3  4  loss of data |.                    05067100
*         !                                                             05067600
*         !   IXGQUERY will return:                                     05068100
*         !       QBUF_low_loss_of_data_blkid = 4                       05068600
*         !       QBUF_high_loss_of_data_blkid = > 8                    05069100
*         !           where >8 means a block id that will be            05069600
*         !           the first block ID to be assign to the            05070100
*         !           first log block write after the loss              05070600
*         !           of data occurs.                                   05071100
*         !                                                             05071600
*         ! Ex. 3 - assume the log stream has 8 log blocks,             05072100
*         !         1 thru 8 before a loss of data occurs               05072600
*         !         and time increase as the block ids increase.        05073100
*         !                                                             05073600
*         !     BlkIDs                                                  05074100
*         !     in LS  | 1  2  3  4  5  6  7  8   |.                    05074600
*         !                                                             05075100
*         !   After a loss of data that causes log blocks 1 thru        05075600
*         !   8 to be lost, the log stream looks like:                  05076100
*         !                                                             05076600
*         !     BlkIDs                                                  05077100
*         !     in LS  |       loss of data.      |.                    05077600
*         !                                                             05078100
*         !   IXGQUERY will return:                                     05078600
*         !       QBUF_low_loss_of_data_blkid = < 1                     05079100
*         !           where <1 means a block id that will be            05079600
*         !           less than any block ID in the log stream.         05080100
*         !       QBUF_high_loss_of_data_blkid = > 8                    05080600
*         !           where >8 means a block id that will be            05081100
*         !           the first block ID to be assign to the            05081600
*         !           first log block write after the loss              05082100
*         !           of data occurs.                                   05082600
*         !                                                             05083100
*         !                                                             05083600
*         3 QBUF_low_loss_of_data_blkid char(8), /* If log stream has   05084100
*            encountered a loss of data condition, this field contains  05084600
*            a log block id just prior to (older than) the first        05085100
*            occurance of the loss of data range in the log stream.     05085600
*            Note, as the prior examples indicate, there is no          05086100
*            guaranteed that this block ID represents a valid log       05086600
*            block ID in the log stream (see Ex. 3).             @P5A*/ 05087100
*         3 QBUF_high_loss_of_data_blkid char(8), /* If log stream has  05087600
*            encountered a loss of data condition, this field contains  05088100
*            a log block id just after (younger than) the loss of       05088600
*            data range in the log stream.                              05089100
*            Note, as the prior examples indicate, there is no          05089600
*            guaranteed that this block ID represents a valid log       05090100
*            block ID in the log stream (see Ex. 2).             @P5A*/ 05090600
*      2  QBUF_Reserved                                                 05091100
*           CHAR((((LENGTH(QBUF_Section_Begin)+7)/8)*8)-                05100000
*                  LENGTH(QBUF_Section_Begin)), /* Insert filler bytes  05150000
*                                          to insure QBUF section       05200000
*                                          is a multiple of             05250000
*                                          doublewords in length        05300000
*                                                                    */ 05350000
*      2  QBUFEnd CHAR(0) BDY(DWORD);  /* End of QBUF                */ 05400000
*                                                                       05450000
*  Dcl QBUF_Length Constant(Length(QBUF));  /*                  @P3C */ 05500000
*  Dcl QBUFVerNum  Constant(0);                                         05550000
*/* End of PL/X Source                                               */ 05600000
* %IF IXGQBUF_LIST ^= 'NO' &                                            05650000
*    ZCBPRINT ^= 'NO' %THEN                                             05700000
*   %GOTO IXGQBUF_4;                                                    05750000
*   @LIST POP NOECHO;                                                   05800000
* %IXGQBUF_4:;                                                          05850000
* %END;                                                                 05900000
