*                                                                       00050000
* %DCL IXGRMEPL_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IXGRMEPL_INCLUDED;                                        00150000
* %IF IXGRMEPL_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 96191. CBGEN compile date 96059         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IXGRMEPL &DSECT=YES,&LIST=YES,&TITLE=YES,&RMEPL=YES            00450000
         GBLC  &IXGRMEPL_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IXGRMEPL_INCLUDED SETC 'YES'                                           00600000
         AIF   ('&LIST' EQ 'NONE').P0                                   00616600
         AIF   ('&TITLE' EQ 'NO').P5                                    00633200
 TITLE   'IXGRMEPL  - Resource Manager Exit Parameter List        '     00650000
.P5      ANOP                                                           00675000
**/ IXGRMEPL_1:;                                                        00700000
*/* START OF SPECIFICATIONS ******************************************/ 00750000
*/*                                                                  */ 00800000
*/*01* PROPRIETARY STATEMENT=                                        */ 00900000
*/***PROPRIETARY_STATEMENT********************************************/ 00916600
*/*                                                                  */ 00933200
*/*                                                                  */ 00950000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01000000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01050000
*/* 5647-A01 (C) COPYRIGHT IBM CORP. 1997, 1999                      */ 01100000
*/*                                                                  */ 01200000
*/* STATUS= HBB6608                                                  */ 01250000
*/*                                                                  */ 01300000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01350000
*/*                                                                  */ 01400000
*/*                                                                  */ 01450000
*/*02* ACRONYM:  RMEPL                                               */ 01500000
*/*                                                                  */ 01550000
*/*01* DESCRIPTIVE NAME: Resource Manager Exit Parameter List        */ 01600000
*/*                                                                  */ 01650000
*/*01* MACRO NAME: IXGRMEPL                                          */ 01700000
*/*                                                                  */ 01750000
*/*01* DSECT NAME:  RMEPL                                            */ 01800000
*/*                                                                  */ 01850000
*/*01* Component:  System Logger (SCLOG)                             */ 01900000
*/*                                                                  */ 01950000
*/*01* EYE-CATCHER:  NONE                                            */ 02000000
*/*                                                                  */ 02050000
*/*01* STORAGE ATTRIBUTES:                                           */ 02100000
*/*02*  SUBPOOL:  229                                                */ 02150000
*/*02*  KEY:  Key 0                                                  */ 02200000
*/*02*  RESIDENCY:  Above 16 MB in virtual storage.                  */ 02250000
*/*                                                                  */ 02300000
*/*01* SIZE:  384 bytes                                        @P2A  */ 02316600
*/*           RMEPL -- X'0180' bytes                                 */ 02333200
*/*                                                                  */ 02350000
*/*01* CREATED BY: SCLOG                                             */ 02400000
*/*                                                                  */ 02450000
*/*01* POINTED TO BY:                                                */ 02500000
*/*     First word in parameter list provided toResource Manager Exit*/ 02550000
*/*                                                                  */ 02600000
*/*01* SERIALIZATION:                                                */ 02650000
*/*     None required                                                */ 02700000
*/*                                                                  */ 02750000
*/*01* FUNCTION: Maps parameter list to the Resource Manager exit    */ 02800000
*/*02*           specified on an IXGCONN request                     */ 02850000
*/*                                                                  */ 02900000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 02950000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 03000000
*/*                                                                  */ 03050000
*/*01* METHOD OF ACCESS:                                             */ 03100000
*/*02*  ASM:  IXGRMEPL USING on RMEPL                                */ 03150000
*/*                                                                  */ 03200000
*/*02*  PL/AS: %INCLUDE SYSLIB(IXGRMEPL)                             */ 03250000
*/*                                                                  */ 03300000
*/*01* DELETED BY: N/A                                               */ 03350000
*/*                                                                  */ 03400000
*/*01* FREQUENCY:  One per call to the Resource Manager exit         */ 03450000
*/*                                                                  */ 03500000
*/*01* DEPENDENCIES: N/A                                             */ 03550000
*/*                                                                  */ 03600000
*/*01* DISTRIBUTION LIBRARY: AMACLIB                                 */ 03650000
*/*                                                                  */ 03700000
*/*01* CHANGE ACTIVITY:                                              */ 03750000
*/*     $L0=RSR      HBB6603 960130 PDXD:    Remote Site Recovery    */ 03800000
*/*     $P1=PQC1730  HBB6603 960717 PDXD:    RMEPL_LEN defined twice */ 03816600
*/*                                          causing assembler errors*/ 03833200
*/*     $P2=PQC1931  HBB6603 960717 PDXD: SIZE comment missing from  */ 03837400
*/*                                       prolog causing SHOWHDR     */ 03841600
*/*                                       errors                     */ 03845800
*/*                                                                  */ 03850000
*/* NOTES: This control block must end on a doubleword boundary.     */ 03900000
*/*                                                                  */ 03950000
*/*                                                                  */ 04000000
*/*END OF SPECIFICATIONS *********************************************/ 04050000
*% /*                                                                   04100000
.P0      ANOP                                                           04125000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04150000
         AIF   ('&LIST' EQ 'YES').P2                                    04200000
.P1      ANOP                                                           04250000
         PUSH  PRINT                                                    04300000
         PRINT OFF                                                      04350000
.P2      ANOP                                                           04400000
         AIF   ('&RMEPL' EQ 'NO').L0002                                 04450000
         AIF   ('&DSECT' EQ 'YES').L0003                                04500000
         AIF   ('&RMEPL' NE 'YES').L0002                                04550000
RMEPL    DS    0D        Resource Manager exit parameter list           04600000
         AGO   .L0004                                                   04650000
.L0003   ANOP                                                           04700000
RMEPL    DSECT           Resource Manager exit parameter list           04750000
.L0004   ANOP                                                           04800000
RMEPLSECTIONBEGIN DS 0CL0128 Beginning of common section                04850000
RMEPLVERSIONNUMBER DS 1FL4 Version Number of this mapping of the RMEPL  04900000
RMEPLFLAGS DS  0BL4      Flags                                          04950000
RMEPLDELETEREQUEST EQU X'80' If on, this parameter list represents a   *05000000
                         delete request                                 05050000
RMEPLWRITEREQUEST EQU X'40' If on, this parameter list represents a    *05100000
                         write request. Log data are contained in a    *05150000
                         single buffer                                  05200000
         ORG   RMEPLFLAGS+X'00000004'                                   05250000
RMEPLGMTTIMESTAMP DS 1BL8 STCK value. Obtained immediately prior to    *05300000
                         calling the resource manager                   05350000
RMEPLRMNAME DS 1CL0008   Resource Manager Name                          05400000
RMEPLRMDATA DS 1CL0008   Associated RMDATA specified on the RM's       *05450000
                         IXGCONN request                                05500000
RMEPLIDENTIFICATION DS 1CL0016 System-unique identification of the     *05550000
                         connection on whose behalf the exit is being  *05600000
                         called                                         05650000
RMEPLLSDESCRIPTION DS 1CL0016 Log Stream Description from log stream   *05700000
                         inventory record. If binary zeroes, no        *05750000
                         description exists                             05800000
RMEPLLOGSTREAMNAME DS 1CL0026 Log stream name                           05850000
RMEPLRSVD1 DS  1CL0002   Reserved                                       05900000
RMEPLREQUESTINFO DS 0CL0036 Specific information about the request     *05950000
                         that caused the RM Exit to be given control    06000000
         ORG   RMEPLREQUESTINFO                                         06050000
RMEPLDELETEINFO DS 0CL0018 Delete request information                   06100000
RMEPLDELETEFLAGS DS 0BL2 Bits in this structure are set only if the    *06150000
                         parameter list represents a delete log block  *06200000
                         request                                        06250000
RMEPLBLOCKSALLSPECIFIED EQU X'80' If set, BLOCKS=ALL specified on      *06300000
                         IXGDELETE request                              06350000
RMEPLBLOCKSRANGESPECIFIED EQU X'40' If set, BLOCKS = RANGE specified   *06400000
                         in IXGDELETE request                           06450000
RMEPLFORCESPECIFIED EQU X'20' If set, the issue of the issuer of       *06500000
                         IXGDELETE specified FORCE=YES and this delete *06550000
                         request cannot be overriden.                   06600000
         ORG   RMEPLDELETEFLAGS+X'00000002'                             06650000
RMEPLDELETEBLOCKID DS 1CL0008 Blockid specified by the issuer of       *06700000
                         IXGDELET when BLOCK=RANGE specified            06750000
RMEPLDELETEOVERRIDEBLOCKID DS 1CL0008 Override block id. Resource      *06800000
                         Manager places the override blockid in this   *06850000
                         variable if it wishes to override the delete  *06900000
                         request. On entry to the exit, this field is  *06950000
                         initialized to binary zeroes. If still binary *07000000
                         zeroes upon return from the exit, then delete *07050000
                         request proceeds as requested by the issuer   *07100000
                         of IXGDELET. If FORCE=YES specified, content  *07150000
                         of this field is ignored.                      07200000
         ORG   RMEPLREQUESTINFO                                         07250000
RMEPLWRITEINFO DS 0CL0036 Write Information                             07300000
RMEPLADDEDBYTES DS 1FL4  Number of bytes that the Logger 'adds' to a   *07350000
                         user's log block (prefix and suffix           *07400000
                         information). The prefix and suffix areas are *07450000
                         not 'seen' in the copy of the user's buffer   *07500000
                         presented to the resource manager. Adding     *07550000
                         together RmeplWriteBlockID,                   *07600000
                         RmeplLogDataLength and RmeplAddedBytes can be *07650000
                         used to calculate the next block id to be     *07700000
                         assigned for a log block written to the log   *07750000
                         stream                                         07800000
RMEPLLOGDATALENGTH DS 1FL4 Number of bytes of user log data specified. *07850000
                         This is the BLOCKLEN value specified on the   *07900000
                         IXGWRITE request                               07950000
RMEPLWRITEBUFFERPTR DS 1AL4 Pointer to the buffer that contains the    *08000000
                         log data that were written to the log stream  *08050000
                         if RmeplWriteRequest is set to on              08100000
RMEPLWRITEBLOCKID DS 1CL0008 Block id assigned to the log block         08150000
RMEPLWRITEGMTTIMESTAMP DS 1BL8 Timestamp assigned to the log block      08200000
RMEPLWRITELOCALTIMESTAMP DS 1BL8 local time stamp assigned to the log  *08250000
                         block                                          08300000
RMEPL_RMEXIT_WORK_AREA DS 1CL0256 256 byte work area that the resource *08316600
                         manager exit can use                           08333200
RMEPL_RESERVED DS 0C     Insert filler bytes to insure RMEPL section   *08350000
                         is a multiple of doublewords in length         08400000
RMEPLEND DS    0C        End of RMEPL                                   08450000
RMEPL_LENGTH EQU 384                                                    08500000
RMEPLVERNUM EQU 0                                                       08550000
RMEPL_LEN EQU  *-RMEPL                                                  08600000
.L0002   ANOP                                                           08650000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08700000
         AIF   ('&LIST' EQ 'YES').P4                                    08750000
.P3      ANOP                                                           08800000
         POP   PRINT                                                    08850000
.P4      ANOP                                                           08900000
.P_EXIT  ANOP                                                           08950000
         MEND                                                           09000000
**/ IXGRMEPL_2:;                                                        09050000
* %IXGRMEPL_INCLUDED = 'YES';                                           09100000
* %DCL ZCBPRINT CHAR EXT;                                               09150000
* %DEACTIVATE ZCBPRINT;                                                 09200000
* %DCL IXGRMEPL_LIST CHAR EXT;                                          09250000
* %DEACTIVATE IXGRMEPL_LIST;                                            09300000
* %IF IXGRMEPL_LIST ^= 'NO' &                                           09350000
*    ZCBPRINT ^= 'NO' %THEN                                             09400000
*   %GOTO IXGRMEPL_3;                                                   09450000
*   @LIST PUSH NOECHO;                                                  09500000
*   @LIST NOASSEMBLE NOECHO;                                            09550000
*   @LIST OFF C NOECHO;                                                 09600000
* %IXGRMEPL_3:;                                                         09650000
*/* Start of PL/X Source                                             */ 09700000
* DCL 1 RMEPL BDY(DWORD) BASED,    /* Resource Manager exit parameter   09750000
*                                     list                           */ 09800000
*      2 RmeplSectionBegin,        /* Beginning of common section    */ 09850000
*        3 RmeplVersionNumber FIXED(31), /* Version Number of this      09900000
*                                     mapping of the RMEPL           */ 09950000
*        3 RmeplFlags BIT(32),     /* Flags                          */ 10000000
*          5 RmeplDeleteRequest BIT(1), /* If on, this parameter list   10050000
*                                     represents a delete request    */ 10100000
*          5 RmeplWriteRequest BIT(1), /* If on, this parameter list    10150000
*                                     represents a write request. Log   10200000
*                                     data are contained in a single    10250000
*                                     buffer                         */ 10300000
*      3 RmeplGMTTimeStamp BIT(64),/* STCK value. Obtained immediately  10350000
*                                     prior to calling the resource     10400000
*                                     manager                        */ 10450000
*      3 RmeplRMName CHAR(8),      /* Resource Manager Name          */ 10500000
*      3 RmeplRMData CHAR(8),      /* Associated RMDATA specified on    10550000
*                                     the RM's IXGCONN request       */ 10600000
*      3 RmeplIdentification CHAR(16), /* System-unique identification  10650000
*                                     of the connection on whose        10700000
*                                     behalf the exit is being called*/ 10750000
*      3 RmeplLSDescription CHAR(16), /* Log Stream Description from    10800000
*                                     log stream inventory record. If   10850000
*                                     binary zeroes, no description     10900000
*                                     exists                         */ 10950000
*      3 RmeplLogStreamName CHAR(26), /* Log stream name             */ 11000000
*      3 RmeplRsvd1 char(2),       /* Reserved                       */ 11050000
*      3 RmeplRequestInfo UNION,   /* Specific information about the    11100000
*                                     request that caused the RM Exit   11150000
*                                     to be given control            */ 11200000
*        4 RmeplDeleteInfo,        /* Delete request information     */ 11250000
*          5 RmeplDeleteFlags BIT(16), /* Bits in this structure are    11300000
*                                       set only if the parameter list  11350000
*                                       represents a delete log block   11400000
*                                       request                      */ 11450000
*            7 RmeplBlocksAllSpecified BIT(1), /* If set, BLOCKS=ALL    11500000
*                                       specified on IXGDELETE          11550000
*                                       request                      */ 11600000
*            7 RmeplBlocksRangeSpecified BIT(1), /* If set, BLOCKS =    11650000
*                                       RANGE specified in IXGDELETE    11700000
*                                       request                      */ 11750000
*            7 RmeplForceSpecified BIT(1),  /* If set, the issue of     11800000
*                                          the issuer of IXGDELETE      11850000
*                                          specified FORCE=YES and      11900000
*                                          this delete request cannot   11950000
*                                          be overriden.             */ 12000000
*          5 RmeplDeleteBlockID CHAR(8), /* Blockid specified by the    12050000
*                                           issuer of IXGDELET when     12100000
*                                           BLOCK=RANGE specified    */ 12150000
*          5 RmeplDeleteOverrideBlockID CHAR(8),                        12200000
*                                       /* Override block id.           12250000
*                                          Resource Manager places the  12300000
*                                          override blockid in this     12350000
*                                          variable if it wishes to     12400000
*                                          override the delete          12450000
*                                          request. On entry to the     12500000
*                                          exit, this field is          12550000
*                                          initialized to binary        12600000
*                                          zeroes. If still binary      12650000
*                                          zeroes upon return from the  12700000
*                                          exit, then delete request    12750000
*                                          proceeds as requested by the 12800000
*                                          issuer of IXGDELET. If       12850000
*                                          FORCE=YES specified,         12900000
*                                          content of this field is     12950000
*                                          ignored.                  */ 13000000
*        4 RmeplWriteInfo,              /* Write Information         */ 13050000
*          5 RmeplAddedBytes FIXED(31),     /* Number of bytes that the 13100000
*                                           Logger 'adds' to a user's   13150000
*                                           log block (prefix and       13200000
*                                           suffix information). The    13250000
*                                           prefix and suffix areas     13300000
*                                           are not 'seen' in the       13350000
*                                           copy of the user's buffer   13400000
*                                           presented to the resource   13450000
*                                           manager. Adding together    13500000
*                                           RmeplWriteBlockID,          13550000
*                                           RmeplLogDataLength and      13600000
*                                           RmeplAddedBytes can be      13650000
*                                           used to calculate the       13700000
*                                           next block id to be         13750000
*                                           assigned for a log block    13800000
*                                           written to the log          13850000
*                                           stream                  */  13900000
*          5 RmeplLogDataLength FIXED(31), /* Number of bytes of user   13950000
*                                          log data specified. This     14000000
*                                          is the BLOCKLEN value        14050000
*                                          specified on the IXGWRITE    14100000
*                                          request                   */ 14150000
*          5 RmeplWriteBufferPtr PTR(31),                               14200000
*                                       /* Pointer to the buffer        14250000
*                                          that contains the log data   14300000
*                                          that were written to the log 14350000
*                                          stream if RmeplWriteRequest  14400000
*                                          bit is set to on          */ 14450000
*          5 RmeplWriteBlockID CHAR(8), /* Block id assigned to the     14500000
*                                          log block                 */ 14550000
*          5 RmeplWriteGMTTimeStamp BIT(64), /* Timestamp assigned to   14600000
*                                          the log block             */ 14650000
*          5 RmeplWriteLocalTimeStamp BIT(64), /* local time stamp      14700000
*                                          assigned to the log block */ 14750000
*      2  RMEPL_RMExit_Work_Area CHAR(256), /* 256 byte work area that  14800000
*                                          the resource manager exit    14850000
*                                          can use                   */ 14900000
*      2  RMEPL_Reserved                                                14950000
*           CHAR((((LENGTH(RMEPLSectionBegin)+7)/8)*8)-                 15000000
*                  LENGTH(RMEPLSectionBegin)), /* Insert filler bytes   15050000
*                                          to insure RMEPL section      15100000
*                                          is a multiple of             15150000
*                                          doublewords in length        15200000
*                                                                */     15250000
*      2 RmeplEnd Char(0) Bdy(DWord); /*  End of RMEPL               */ 15300000
*  Dcl Rmepl_Length Constant(Length(RMEPL));    /*              @P1C */ 15350000
*  Dcl RmeplVerNum  Constant(0);                                        15400000
*                                                                       15450000
*/* End of PL/X Source                                               */ 15500000
* %IF IXGRMEPL_LIST ^= 'NO' &                                           15550000
*    ZCBPRINT ^= 'NO' %THEN                                             15600000
*   %GOTO IXGRMEPL_4;                                                   15650000
*   @LIST POP NOECHO;                                                   15700000
* %IXGRMEPL_4:;                                                         15750000
* %END;                                                                 15800000
