*                                                                       00050000
* %DCL IXGSMF88_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IXGSMF88_INCLUDED;                                        00150000
* %IF IXGSMF88_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 97322. CBGEN compile date 97252         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IXGSMF88 &DSECT=YES,&LIST=YES,&TITLE=YES,&SMFRCD88=YES,       *00437500
               &SMF88PSD=COND,&SMF88LSD=COND,&SMF88ESD=COND,           *00475000
               &SMF88SSD=COND,&SMF88ASD=COND                            00512500
         GBLC  &IXGSMF88_INCLUDED                                       00550000
         GBLC  &ZCBPRINT                                                00600000
&IXGSMF88_INCLUDED SETC 'YES'                                           00650000
         AIF   ('&LIST' EQ 'NONE').P0                                   00666600
         AIF   ('&TITLE' EQ 'NO').P5                                    00683200
 TITLE   'IXGSMF88  - LOGGER mapping for SMF Record Type 88       '     00700000
.P5      ANOP                                                           00725000
**/ IXGSMF88_1:;                                                        00750000
*/* START OF SPECIFICATIONS ******************************************/ 00800000
*/*                                                                  */ 00825000
*/*                                                                  */ 00850000
*/*01* PROPRIETARY STATEMENT=                                        */ 00900000
*/***PROPRIETARY_STATEMENT********************************************/ 00950000
*/*                                                                  */ 01000000
*/*                                                                  */ 01050000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 01100000
*/* THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      */ 01150000
*/* 5645-001 (C) COPYRIGHT IBM CORP. 1994, 1997                      */ 01200000
*/*                                                                  */ 01300000
*/* STATUS= JBB6604                                                  */ 01350000
*/*                                                                  */ 01400000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01450000
*/*                                                                  */ 01500000
*/*02* ACRONYM:  IXGSMF88                                            */ 01550000
*/*                                                                  */ 01600000
*/*01* DESCRIPTIVE NAME: LOGGER mapping for SMF Record Type 88       */ 01650000
*/*                                                                  */ 01700000
*/*01* MACRO NAME: IXGSMF88                                          */ 01750000
*/*                                                                  */ 01800000
*/*01* DSECT NAME:  SMFRCD88                                         */ 01850000
*/*                                                                  */ 01900000
*/*01* COMPONENT:  System Logger (SCLOG)                             */ 01950000
*/*                                                                  */ 02000000
*/*01* EYE CATCHER: None                                             */ 02050000
*/*02*   OFFSET:    N/A                                              */ 02100000
*/*02*   LENGTH:    N/A                                              */ 02150000
*/*                                                                  */ 02200000
*/*01* STORAGE ATTRIBUTES:                                           */ 02250000
*/*02*  Subpool: Caller-determined                             @L1C  */ 02300000
*/*02*  Key: Caller-determined                                 @L1A  */ 02350000
*/*02*  Residency: Caller-determined                           @L1A  */ 02400000
*/*                                                                  */ 02450000
*/*01* SIZE: Sum of component sections:                        @L5C  */ 02500000
*/*           SMFRCD88 -- X'0044' bytes                              */ 02550000
*/*           SMF88PSD -- X'001C' bytes                              */ 02600000
*/*           SMF88SSD -- X'0044' bytes                              */ 02650000
*/*           SMF88ESD -- X'0024' bytes                              */ 02700000
*/*           SMF88LSD -- X'0050' bytes                              */ 02737500
*/*           SMF88ASD -- X'0041' bytes                              */ 02775000
*/*                                                                  */ 02800000
*/*01* CREATED BY: IXGM1TSK (or caller)                        @L1C  */ 02850000
*/*                                                                  */ 02900000
*/*01* POINTED TO BY:  Basing set up by module that calls IFASMFRA   */ 02950000
*/*                                                                  */ 03000000
*/*01* SERIALIZATION:  None                                          */ 03050000
*/*                                                                  */ 03100000
*/*01* FUNCTION:  Mapping of LOGGER component SMF Record (Type 88)   */ 03150000
*/*                                                                  */ 03200000
*/*01* EXTERNAL CLASSIFICATION: GUPI                                 */ 03250000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 03300000
*/*                                                                  */ 03350000
*/*01* METHOD OF ACCESS:                                             */ 03400000
*/*                                                                  */ 03450000
*/*   PLX: %IXGSMF88_LIST = 'NO' suppresses printing of this macro,  */ 03500000
*/*                          any other value will list the macro.    */ 03550000
*/*        %IXGSMF88BASE = '' results in the SMFRCD88 structure      */ 03600000
*/*                   being declared 'BASED'.  %ISGSMF88BASE can be  */ 03650000
*/*                   set to override this to something else, for ex.*/ 03700000
*/*                   'BASED(SMF88PTR)' or ' '.                      */ 03750000
*/*                                                                  */ 03800000
*/*        %IFAR88 = 'YES' selects IXGSMF88 in IFASMFRA      @L1A    */ 03850000
*/*        %INCLUDE SYSLIB(IFASMFRA)                         @L1C    */ 03900000
*/*                                                                  */ 03950000
*/*   ASM: IRASMFRA IXGSMF88                                 @L1C    */ 04000000
*/*                                                                  */ 04050000
*/* DELETED-BY: Caller                                       @L1C    */ 04100000
*/*                                                                  */ 04150000
*/* DEPENDENCIES: N/A                                                */ 04200000
*/*                                                                  */ 04250000
*/* NOTES:                                                           */ 04300000
*/* 1-SYS1.SAMPLIB member IXGRPT1 uses this mapping macro,       @L1A*/ 04350000
*/*   and would need updating if incompatible changes were made. @L1A*/ 04400000
*/*   Any fields added/deleted to this macro has to be reflected @05A*/ 04410000
*/*   in the sort portion of SYS1.SAMPLIB members IXGRPT1 and    @05A*/ 04420000
*/*   IXGRPT1J.                                                  @05A*/ 04430000
*/*                                                                  */ 04450000
*/* 2-Any changes made to this macro has to be reflected in the  @05A*/ 04507990
*/*   "MVS System Management Facilities" book in section for     @05A*/ 04515980
*/*   SMF88 records.                                             @05A*/ 04523970
*/*                                                                  */ 04531960
*/* 3-LOGGR SMF counts of bytes written/deleted are internally   @05C*/ 04539950
*/*   rounded up to internal buffer sizes and/or to satisfy other@L3A*/ 04550000
*/*   internal requirements.  Additionally, many LOGGR services  @L3A*/ 04600000
*/*   may complete asynchronously so that the counts are not     @L3A*/ 04650000
*/*   incremented in the same interval that the LOGGR service    @L3A*/ 04700000
*/*   was invoked.  SMF data should therefore be regarded as     @L3A*/ 04750000
*/*   roughly proportional, sampled data.                        @L4C*/ 04800000
*/*                                                              @L4A*/ 04850000
*/* 4-LOGGR internally manages the coupling facility structure   @05C*/ 04919990
*/*   storage, offloading/migrating data to DASD when the        @L4C*/ 04950000
*/*   structure is full.  An ?IXGDELET request may be issued     @L4C*/ 05000000
*/*   while the data is still in the coupling facility, or AFTER @L4C*/ 05050000
*/*   the data has been migrated to DASD.   Field SMF88SIB tracks@L4C*/ 05100000
*/*   bytes deleted via ?IXGDELET where the data was still in the@L5C*/ 05150000
*/*   structure.   ?IXGDELETs where the bytes have been migrated @L5C*/ 05200000
*/*   to DASD are NOT tracked in this SMF record.  Field         @L5C*/ 05250000
*/*   SMF88SAB tracks bytes deleted from the coupling facility   @L5C*/ 05300000
*/*   due to LOGGR internal management (the deleted bytes were   @L5C*/ 05350000
*/*   offloaded to DASD via LOGGR internal management and then   @L5C*/ 05400000
*/*   deleted from the structure.)                               @L5C*/ 05450000
*/*                                                              @L5D*/ 05500000
*/* 5-'Interim Storage' refers to either the CF (Coupling        @05C*/ 05518490
*/*   Facility), or to Staging Data sets in the case when a          */ 05525000
*/*   DASD Only Logstream is being used.                         @03C*/ 05537500
*/*                                                                  */ 05550000
*/*01* CHANGE ACTIVITY:                                              */ 05600000
*/*                                                                  */ 05650000
*/*   Flag LineItem  FMID    Date   ID    Comment                    */ 05700000
*/*                                                                  */ 05750000
*/*    $L0=LOGGR   HBB5520 940414   PDA5:  Initial release.          */ 05800000
*/*    $L1=LOGGR   HBB5520 940602   PDA5:  prolog, comments, basing, */ 05850000
*/*        delete SMF88EWR, SMF88SC4, rename SMF88ESF.               */ 05900000
*/*    $L2=LOGGR   HBB5520 940728   PDA5:  more comments (use float) */ 05950000
*/*        delete SMF88SWI                                           */ 06000000
*/*    $L3=LOGGR   HBB5520 940728   PDA5:  more comments             */ 06050000
*/*    $L4=LOGGR   HBB5520 940912   PDA5:  correct comments          */ 06100000
*/*    $L5=LOGGR   HBB5520 941020   PDA5:  Staging Dataset support   */ 06150000
*/*    $01=OW11208 HBB5520 950210   PDDZ:  TRSQ PTN PN72437 SMF88EO  */ 06183300
*/*    $02=OW11809 HBB5520 950321   PDV6:  ADDED SMF88EFS            */ 06216600
*/*    $L6=LOGGR   HBB6603 960329   PDZJ:  Add alter statistics  @L6A*/ 06222100
*/*    $L7=RSR     HBB6603 960329   PDXD:  Remote Site Recovery  @L7A*/ 06227600
*/*    $P1=PQC1069 HBB6603 950404   PDV6:  Added SMF88ATW, SMF88LDS  */ 06233100
*/*    $03=OW27705 JBB6604 970616   PDA8:  DASDONLY SMF recording    */ 06238600
*/*                                        TRSQ PSY0666          @03A*/ 06244100
*/*    $04=OW29849 HBB6603 971006   PDC9:  Offload Performance   @04A*/ 06247000
*/*    $05=OW44839 HBB6603 000607   PDAJ:  IXGRPT1 sort error    @05A*/ 06248000
*/*END OF SPECIFICATIONS *********************************************/ 06250000
*% /*                                                                   06300000
.P0      ANOP                                                           06325000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 06350000
         AIF   ('&LIST' EQ 'YES').P2                                    06400000
.P1      ANOP                                                           06450000
         PUSH  PRINT                                                    06500000
         PRINT OFF                                                      06550000
.P2      ANOP                                                           06600000
         AIF   ('&SMFRCD88' EQ 'NO').L0002                              06650000
         AIF   ('&DSECT' EQ 'YES').L0003                                06700000
         AIF   ('&SMFRCD88' NE 'YES').L0002                             06750000
SMFRCD88 DS    0F                                                       06800000
         AGO   .L0004                                                   06850000
.L0003   ANOP                                                           06900000
SMFRCD88 DSECT                                                          06950000
.L0004   ANOP                                                           07000000
*                                                                       07050000
* ********************************************************************  07100000
* *   HEADER SECTION                                                    07150000
* ********************************************************************  07200000
*                                                                       07250000
*                                                                       07300000
SMF88RPS DS    0CL0024   Record Header Section                          07350000
SMF88LEN DS    1FL2      Record Length                                  07400000
SMF88SEG DS    1FL2      Segment Descriptor                             07450000
SMF88FLG DS    0CL0001   Header Flag Byte                               07500000
         ORG   SMF88FLG+X'00000001'                                     07550000
SMF88RTY DS    1CL0001   Record Type - 88                               07600000
SMF88TME DS    1FL4      Recd Written Time                              07650000
SMF88DTE DS    1CL0004   Record Written Date                            07700000
SMF88SID DS    1CL0004   System Identification (from SMFPRMxx SID      *07750000
                         Parameter)                                     07800000
SMF88WID DS    1CL0004   Subsystem ID = STC                             07850000
SMF88STP DS    1FL2      Record Subtype                                 07900000
*                                                                       07950000
* ********************************************************************  08000000
* *   SELF DEFINING SECTION                                             08050000
* ********************************************************************  08100000
*                                                                       08150000
*                                                                       08200000
SMF88SDS DS    0CL0044   Self Defining Section                          08250000
SMF88SDL DS    1FL4      Length of Self Defining Section                08300000
SMF88POF DS    1FL4      Offset to Product Section                      08350000
SMF88PLN DS    1FL2      Length of Product Section                      08400000
SMF88PON DS    1FL2      Number of Product Section                      08450000
SMF88LOF DS    1FL4      Offset to Log Stream Section                   08500000
SMF88LLN DS    1FL2      Length of Log Stream Section                   08550000
SMF88LON DS    1FL2      Number of Log Stream Sections                  08600000
SMF88EOF DS    1FL4      Offset to Event Section                        08650000
SMF88ELN DS    1FL2      Length of Event Section                        08700000
SMF88EON DS    1FL2      Number of Event Sections                       08750000
SMF88SOF DS    1FL4      Offset to Structure Section                    08800000
SMF88SLN DS    1FL2      Length of Structure Section                    08850000
SMF88SON DS    1FL2      Number of Structure Sections                   08900000
SMF88AOF DS    1FL4      Offset to Structure Alter section              08912500
SMF88ALN DS    1FL2      Length of Structure Alter section              08925000
SMF88AON DS    1FL2      Number of Structure Alter section              08937500
SMFRCD88_LEN EQU *-SMFRCD88                                             08950000
.L0002   ANOP                                                           09000000
*                                                                       09050000
* ********************************************************************  09100000
* *   PRODUCT SECTION                                                   09150000
* ********************************************************************  09200000
*                                                                       09250000
*                                                                       09300000
         AIF   ('&SMF88PSD' EQ 'NO').L0005                              09350000
         AIF   ('&DSECT' EQ 'YES').L0006                                09400000
         AIF   ('&SMF88PSD' NE 'YES').L0005                             09450000
SMF88PSD DS    0H                                                       09500000
         AGO   .L0007                                                   09550000
.L0006   ANOP                                                           09600000
SMF88PSD DSECT                                                          09650000
.L0007   ANOP                                                           09700000
SMF88TYP DS    1FL2      Record Sub-type 1 - Log stream Update          09750000
SMF88RVN DS    1CL0002   Record Version Num - '02'                      09800000
SMF88PNM DS    1CL0008   Product Name - 'SCLOG '                        09850000
SMF88OSL DS    1CL0008   MVS Product Level                              09900000
SMF88SYN DS    1CL0008   Current System Name (from SYSNAME PARMLIB     *09950000
                         option)                                        10000000
SMF88PSD_LEN EQU *-SMF88PSD                                             10050000
.L0005   ANOP                                                           10100000
*                                                                       10150000
* ********************************************************************  10200000
* *   LOG STREAM SECTION                                                10250000
* ********************************************************************  10300000
*                                                                       10350000
*                                                                       10400000
         AIF   ('&SMF88LSD' EQ 'NO').L0008                              10450000
         AIF   ('&DSECT' EQ 'YES').L0009                                10500000
         AIF   ('&SMF88LSD' NE 'YES').L0008                             10550000
SMF88LSD DS    0F        Section describing a Log Stream.               10600000
         AGO   .L000A                                                   10650000
.L0009   ANOP                                                           10700000
SMF88LSD DSECT           Section describing a Log Stream.               10750000
.L000A   ANOP                                                           10800000
SMF88LIT DS    1CL0008   SMF-counter Instance Token.                    10850000
SMF88LSN DS    1CL0026   Log Stream Name                                10900000
SMF88LFL DS    0CL0002   Log Stream Flags.                              10950000
SMF88LFT EQU   X'40'     If set, this logstream used staging datasets  *11000000
                         during the expiring SMF interval.              11050000
SMF88LDS EQU   X'20'     When ON, the SMF record has been generated as *11070000
                         a result of the log stream disconnecting from *11090000
                         the system.                                    11110000
         DS    1BL.013   Reserved.                                      11130000
         ORG   SMF88LFL+X'00000002'                                     11150000
SMF88LTD DS    1CL0008   TOD-time when SMF global interval expired     *11200000
                         (from parameter list of ENF event 37 which    *11250000
                         requested this SMF-record from Logger).        11300000
SMF88LWI DS    1FL4      IXGWRITE invocations for this Log Stream      *11350000
                         issued during the expiring SMF interval.       11400000
SMF88LIB DS    1FL4      Minimum BLOCKLEN value of IXGWRITE seen       *11450000
                         during the expiring SMF interval. Initialized *11500000
                         to X'7FFFFFFF' if no SMF activity occurs      *11550000
                         within the SMF interval.                       11600000
SMF88LAB DS    1FL4      Maximum BLOCKLEN value of IXGWRITE seen by    *11650000
                         this Log Stream during the expiring SMF       *11700000
                         interval Initialized to zero if no SMF        *11750000
                         activity occurs within the SMF interval.       11800000
SMF88LWB DS    1CL0008   Bytes REQUESTED by user application(s) on     *11850000
                         ?IXGWRITE invocations for this log stream     *11900000
                         during the expiring SMF interval (FORMAT=LONG *11950000
                         FLOATING POINT). See Notes.                    12000000
SMF88LDB DS    1CL0008   Count of bytes written to DASD during the     *12050000
                         expiring SMF interval (FORMAT=LONG FLOATING   *12100000
                         POINT). SMF88LDB = SMF88SAB + storage-for     *12150000
                         -LOGGR-internal-requirements (ex, rounding,   *12200000
                         internally-required control information.) See *12250000
                         Notes.                                         12300000
SMF88LIO DS    1FL4      Number of times a request was made by System  *12305500
                         Logger to write log stream data to DASD       *12311000
                         during the expiring SMF interval               12316500
SMF88LIS DS    1FL4      Number of times System Logger had to suspend  *12322000
                         before writing log stream data to DASD        *12327500
                         because a previously initiated write to DASD  *12333000
                         had not yet completed during the expiring SMF *12338500
                         interval                                       12344000
SMF88LSD_LEN EQU *-SMF88LSD                                             12350000
.L0008   ANOP                                                           12400000
*                                                                       12450000
* ********************************************************************  12500000
* *   EVENTS SECTION                                                    12550000
* ********************************************************************  12650000
*                                                                       12700000
*                                                                       12750000
         AIF   ('&SMF88ESD' EQ 'NO').L000B                              12800000
         AIF   ('&DSECT' EQ 'YES').L000C                                12850000
         AIF   ('&SMF88ESD' NE 'YES').L000B                             12900000
SMF88ESD DS    0F        Section describing Events                      12950000
         AGO   .L000D                                                   13000000
.L000C   ANOP                                                           13050000
SMF88ESD DSECT           Section describing Events                      13100000
.L000D   ANOP                                                           13150000
SMF88EDS DS    1FL4      Number of Log Stream DASD-shifts initiated by *13200000
                         this system during the expiring SMF interval   13250000
SMF88ERI DS    1FL4      Number of 'Structure Rebuild' events          *13300000
                         +initiated+ for this log stream during the    *13350000
                         expiring SMF interval.                         13400000
SMF88ERC DS    1FL4      Number of 'Structure Rebuild' events          *13450000
                         =completed= for this log stream during the    *13500000
                         expiring SMF interval.                         13550000
SMF88ESF DS    1FL4      Number of times IXGWRITE detected 'Structure  *13600000
                         full' condition for this logstream on this    *13650000
                         system during the expiring SMF interval.       13700000
SMF88ETT DS    1FL4      Number of times IXGLOGR detected              *13750000
                         'Staging-Dataset-Thre shold-Hit' condition    *13800000
                         for this logstream on this system during the  *13850000
                         expiring SMF interval.                         13900000
SMF88ETF DS    1FL4      Number of times IXGLOGR detected              *13950000
                         'Staging-Dataset-FULL' condition for this     *14000000
                         logstream on this system during the expiring  *14050000
                         SMF interval.                                  14100000
SMF88EO  DS    1FL4      Number of times IXGLOGR performed successful  *14104100
                         offload (>1 byte of data) for this logstream  *14108200
                         on this system during the expiring interval    14112300
SMF88EFS DS    1FL4      Number of times IXGLOGR performed an offload  *14116400
                         for all the log streams connected on this     *14120500
                         system to the structure due to the            *14124600
                         structure's total in-use list entries         *14128700
                         reaching 90% of the total available entries   *14132800
                         for the structure. This count is the number   *14136900
                         of occurances of this condition for the       *14141000
                         expiring interval.                             14145100
SMF88EDO DS    1FL4      Number of times a demand initiated offload    *14146000
                         was requested (via IXGOFFLD) for this         *14146900
                         logstream on this system during the expiring  *14147800
                         interval                                       14148700
SMF88ESD_LEN EQU *-SMF88ESD                                             14150000
.L000B   ANOP                                                           14200000
*                                                                       14250000
* ********************************************************************  14300000
* *   STRUCTURE (Interim Storage) Section.  See notes                   14350000
* ********************************************************************  14400000
*                                                                       14450000
*                                                                       14500000
         AIF   ('&SMF88SSD' EQ 'NO').L000E                              14550000
         AIF   ('&DSECT' EQ 'YES').L000F                                14600000
         AIF   ('&SMF88SSD' NE 'YES').L000E                             14650000
SMF88SSD DS    0F        Section describing a Structure                 14700000
         AGO   .L0010                                                   14750000
.L000F   ANOP                                                           14800000
SMF88SSD DSECT           Section describing a Structure                 14850000
.L0010   ANOP                                                           14900000
SMF88STN DS    1CL0016   Structure Name of structure used for this Log *14950000
                         Stream.                                        15000000
SMF88SWB DS    1CL0008   Current WRITTEN-Bytes-Structure. Count of     *15050000
                         bytes written to interim storage for this     *15100000
                         logstream for this interval. See Notes.       *15150000
                         (format=LONG FLOATING POINT).                  15200000
SMF88SIB DS    1CL0008   Current INSTEAD-Bytes count. Count of bytes   *15250000
                         deleted from interim storage during this      *15293700
                         interval INSTEAD OF being moved to DASD.      *15337400
                         (format = LONG FLOATING POINT). This field is *15381100
                         only incremented due to user ?IXGDELET        *15424800
                         invocations when the data had not yet been    *15468500
                         migrated from interim storage to DASD. See    *15512300
                         notes.                                         15556100
SMF88SAB DS    1CL0008   Current AFTER-Bytes count. Count of bytes     *15600000
                         deleted from interim storage during this      *15650000
                         interval AFTER being moved to DASD (format =  *15700000
                         LONG FLOATING POINT). This field is only      *15750000
                         incremented due to LOGGR internal management  *15800000
                         of interim storage. See Notes.                 15850000
         DS    1CL0004   Reserved                                       15900000
SMF88SII DS    1FL4      Current INSTEAD-Invoc count. Count of times a *15950000
                         deletion from interim storage was performed   *16000000
                         during this interval, where the data was NOT  *16050000
                         first migrated to DASD. See notes.             16100000
SMF88SAI DS    1FL4      Current AFTER-Invoc count. Count of times a   *16150000
                         deletion from interim storage was performed   *16200000
                         during this interval, AFTER being migrated to *16250000
                         DASD (occurs due to LOGGR management of       *16300000
                         interim storage.) See notes.                   16350000
SMF88SC1 DS    1FL4      Count of type-1 completions during the        *16400000
                         expired SMF interval. Log stream contents can *16450000
                         remain in interim storage. No need to move    *16500000
                         data from interim storage to DASD. See Notes.  16550000
SMF88SC2 DS    1FL4      Count of type-2 completions during the        *16600000
                         expired SMF interval. Log stream is filling   *16650000
                         interim storage but space is not critical.    *16687500
                         Logger must move data from interim storage to *16725000
                         DASD. See notes.                               16762500
SMF88SC3 DS    1FL4      Count of type-3 completions during the        *16800000
                         expired SMF interval. Space used in interim   *16840000
                         storage (by this log stream) is critical but  *16890000
                         does not exceed 100Dpercent. See notes.        16940000
         DS    1CL0004   Reserved                                       17000000
SMF88SSD_LEN EQU *-SMF88SSD                                             17000900
.L000E   ANOP                                                           17001800
*                                                                       17002700
* ********************************************************************  17003600
* *   STRUCTURE Alter SECTION - These are measurements that are      *  17004500
* *   reset each time a check is made to alter the structure            17005400
* ********************************************************************  17006300
*                                                                       17007200
*                                                                       17008100
         AIF   ('&SMF88ASD' EQ 'NO').L0011                              17009000
         AIF   ('&DSECT' EQ 'YES').L0012                                17009900
         AIF   ('&SMF88ASD' NE 'YES').L0011                             17010800
SMF88ASD DS    0F        Section describing Structure Alter info        17011700
         AGO   .L0013                                                   17012600
.L0012   ANOP                                                           17013500
SMF88ASD DSECT           Section describing Structure Alter info        17014400
.L0013   ANOP                                                           17015300
SMF88ANM DS    1CL0016   Structure Name                                 17016200
SMF88ATK DS    1CL0008   Alter Token which is a STCK timestamp,        *17017100
                         associated with the last time the element to  *17018000
                         entry ratio was altered to accomadate the     *17018900
                         average buffer size being written to the      *17019800
                         structure                                      17020700
SMF88AIT DS    1CL0008   SMF-counter Instance Token.                    17021600
SMF88AWB DS    1CL0008   Current WRITTEN-Bytes-Structure. Count of     *17022500
                         bytes written to the structure on this        *17023400
                         system, associated with this Alter token for  *17024300
                         this interval. See Notes. (format=LONG        *17025200
                         FLOATING POINT).                               17026100
SMF88AO  DS    1FL4      The number of offloads that occured on this   *17027000
                         system associated with this Alter token, for  *17027900
                         this interval.                                 17028800
SMF88ACB DS    1FL4      Current allocated average buffer size for the *17029700
                         structure.                                     17030600
SMF88ATB DS    1FL4      Targeted average buffer size, average buffer  *17031500
                         size System Logger attempted to achieve, by   *17032400
                         altering the element to entry ratio.           17033300
SMF88ASZ DS    1FL4      Structure Size. Represented in the number of  *17034200
                         4K blocks.                                     17035100
SMF88ATW DS    1FL4      Total number of log data writes to the        *17036000
                         structure during the recording interval.       17036900
SMF88ALS DS    1FL4      Total number of log streams connected to the  *17037800
                         structure on this system at the time of the   *17038700
                         recording interval.                            17039600
SMF88AFG DS    0BL1      Flags                                          17040500
SMF88ABC EQU   X'80'     Record was generated to report a change in    *17041400
                         the average buffer size being written to the  *17042300
                         structure                                      17043200
SMF88ADC EQU   X'40'     Record was generated due to the last          *17044100
                         logstream disconnecting which resulted in the *17045000
                         structure Being disconnect                     17045900
*                                                                       17050000
* ********************************************************************  17100000
* *   IXGSMF88 - CONSTANTS                                           *  17150000
* ********************************************************************  17200000
*                                                                       17250000
*                                                                       17300000
SMF88_SMF_RECORD_TYPE EQU 88 Value of SMF88RTY record-type 88          *17350000
                         (decimal)                                      17400000
SMF88_SMF_RECORD_SUBTYPE EQU 1 Subtype                                  17450000
SMF88_SSMF_RECORD_SUBTYPE EQU 11 Subtype for structure alter           *17475000
                         information                                    17500000
SMF88_SMF_RECORD_VERSION EQU C'03' Value of SMF88RVN = version of      *17525000
                         SMFRCD88                                       17550000
SMF88_BLOCKLEN_HIGH EQU X'7FFFFFFF' This constant is LARGER than the   *17600000
                         largest possible valid blocklen. SMF88 field  *17650000
                         SMF88LIB (minimum blocklen seen) is           *17700000
                         initialized to this high, invalid value if no *17750000
                         SMF activity occurs within an SMF interval.    17800000
SMF88_BLOCKLEN_ZERO EQU 0 This constant is SMALLER than the smallest   *17850000
                         possible valid blocklen. SMF88 field SMF88LAB *17900000
                         (maximum blocklen seen) is initialized to     *17950000
                         this low, invalid value if no SMF activity    *18000000
                         occurs within an SMF interval.                 18050000
         ORG   SMF88ASD+X'00000041'                                     18087500
SMF88ASD_LEN EQU *-SMF88ASD                                             18125000
.L0011   ANOP                                                           18162500
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 18200000
         AIF   ('&LIST' EQ 'YES').P4                                    18250000
.P3      ANOP                                                           18300000
         POP   PRINT                                                    18350000
.P4      ANOP                                                           18400000
.P_EXIT  ANOP                                                           18450000
         MEND                                                           18500000
**/ IXGSMF88_2:;                                                        18550000
* %IXGSMF88_INCLUDED = 'YES';                                           18600000
* %DCL ZCBPRINT CHAR EXT;                                               18650000
* %DEACTIVATE ZCBPRINT;                                                 18700000
* %DCL IXGSMF88_LIST CHAR EXT;                                          18750000
* %DEACTIVATE IXGSMF88_LIST;                                            18800000
* %IF IXGSMF88_LIST ^= 'NO' &                                           18850000
*    ZCBPRINT ^= 'NO' %THEN                                             18900000
*   %GOTO IXGSMF88_3;                                                   18950000
*   @LIST PUSH NOECHO;                                                  19000000
*   @LIST NOASSEMBLE NOECHO;                                            19050000
*   @LIST OFF C NOECHO;                                                 19100000
* %IXGSMF88_3:;                                                         19150000
*/* Start of PL/X Source                                             */ 19200000
* %IF IXGSMF88BASE = '' %THEN                                           19300000
*   %GOTO IXGSMF88_40;                                                  19350000
*DCL 1 SMFRCD88 IXGSMF88BASE,                                           19400000
*   %GOTO IXGSMF88_50;                                                  19450000
* %IXGSMF88_40:;                                                        19500000
*DCL 1 SMFRCD88 BASED,                                                  19550000
* %IXGSMF88_50:;                                                        19600000
*                                                                       19650000
*                                                                       19675000
*/********************************************************************/ 19700000
*/*   HEADER SECTION                                             @L5C*/ 19750000
*/********************************************************************/ 19800000
*                                                                       19850000
*      3 SMF88RPS,                  /* Record Header Section         */ 19900000
*        5 SMF88LEN FIXED(15),      /* Record Length                 */ 19950000
*        5 SMF88SEG FIXED(15),      /* Segment Descriptor            */ 20000000
*        5 SMF88FLG CHAR(1),        /* Header Flag Byte              */ 20050000
*          7 * BIT(1),              /* BIT 0 - SUBSYSTEM name follows   20100000
*                                      Standard Header               */ 20150000
*          7 * BIT(1),              /* BIT 1 - SUBTYPES Utilized     */ 20200000
*          7 * BIT(6),              /* BITS 2-7 Reserved             */ 20250000
*        5 SMF88RTY CHAR(1),        /* Record Type - 88              */ 20300000
*        5 SMF88TME FIXED(31) BDY(HWORD),  /* Recd Written Time      */ 20350000
*        5 SMF88DTE CHAR(4),        /* Record Written Date           */ 20400000
*        5 SMF88SID CHAR(4),        /* System Identification (from      20450000
*                                        SMFPRMxx SID Parameter)     */ 20500000
*        5 SMF88WID CHAR(4),        /* Subsystem ID = STC            */ 20550000
*        5 SMF88STP FIXED(15),      /* Record Subtype                */ 20600000
*                                                                       20650000
*/********************************************************************/ 20700000
*/*   SELF DEFINING SECTION                                      @L5C*/ 20750000
*/********************************************************************/ 20800000
*                                                                       20850000
*      3 SMF88SDS,                  /* Self Defining Section         */ 20900000
*        5 SMF88SDL FIXED(31),    /* Length of Self Defining Section */ 20950000
*        5 SMF88POF FIXED(31),      /* Offset to Product Section     */ 21000000
*        5 SMF88PLN FIXED(15),      /* Length of Product Section     */ 21050000
*        5 SMF88PON FIXED(15),      /* Number of Product Section     */ 21100000
*        5 SMF88LOF FIXED(31),      /* Offset to Log Stream Section  */ 21150000
*        5 SMF88LLN FIXED(15),      /* Length of Log Stream Section  */ 21200000
*        5 SMF88LON FIXED(15),      /* Number of Log Stream Sections */ 21250000
*        5 SMF88EOF FIXED(31),      /* Offset to Event Section       */ 21300000
*        5 SMF88ELN FIXED(15),      /* Length of Event Section       */ 21350000
*        5 SMF88EON FIXED(15),      /* Number of Event Sections      */ 21400000
*        5 SMF88SOF FIXED(31),      /* Offset to Structure Section   */ 21450000
*        5 SMF88SLN FIXED(15),      /* Length of Structure Section   */ 21500000
*        5 SMF88SON FIXED(15),      /* Number of Structure Sections  */ 21550000
*        5 SMF88AOF FIXED(31),      /* Offset to Structure Alter        21557100
*                                      section                   @L6A*/ 21564200
*        5 SMF88ALN FIXED(15),      /* Length of Structure Alter        21571300
*                                      section                   @L6A*/ 21578400
*        5 SMF88AON FIXED(15),      /* Number of Structure Alter        21585500
*                                      section                   @L6A*/ 21592600
*                                                                       21600000
*/********************************************************************/ 21650000
*/*   PRODUCT SECTION                                            @L5C*/ 21700000
*/********************************************************************/ 21750000
*                                                                       21800000
*    1 SMF88PSD BASED(ADDR(SMFRCD88)+SMF88POF),  /*                  */ 21850000
*      3 SMF88TYP FIXED(15),        /* Record Sub-type               */ 21900000
*                                   /*   1 - Log stream Update       */ 21950000
*      3 SMF88RVN CHAR(2),          /* Record Version Num - '02'     */ 22000000
*      3 SMF88PNM CHAR(8),          /* Product Name - 'SCLOG   '     */ 22050000
*      3 SMF88OSL CHAR(8),          /* MVS Product Level             */ 22100000
*      3 SMF88SYN CHAR(8),          /* Current System Name (from        22150000
*                                      SYSNAME PARMLIB option)       */ 22200000
*                                                                       22250000
*/********************************************************************/ 22300000
*/*   LOG STREAM SECTION                                         @L5C*/ 22350000
*/********************************************************************/ 22400000
*                                                                       22450000
*    1 SMF88LSD BASED(ADDR(SMFRCD88)+SMF88LOF),  /* Section             22500000
*                                      describing a Log Stream.      */ 22550000
*      3 SMF88LIT CHAR(8),          /* SMF-counter Instance             22600000
*                                      Token.                        */ 22650000
*      3 SMF88LSN CHAR(26),         /* Log Stream Name               */ 22700000
*      3 SMF88LFL CHAR(2),          /* Log Stream Flags.             */ 22750000
*        5 *        BIT(1),         /* Reserved.                 @5LA*/ 22800000
*        5 SMF88LFT BIT(1),         /* If set, this logstream used      22850000
*                                      staging datasets during the      22900000
*                                      expiring SMF interval.    @5LA*/ 22950000
*        5 SMF88LDS BIT(1),         /* When ON, the SMF record has      22966600
*                                      been generated as a result of    22983200
*                                      the log stream disconnecting     22999800
*                                      from the system.          @P1A*/ 23016400
*        5 *        BIT(13),        /* Reserved.                 @5LA*/ 23033000
*      3 SMF88LTD CHAR(8),          /* TOD-time when SMF global         23050000
*                                      interval expired (from parameter 23100000
*                                      list of ENF event 37 which       23150000
*                                      requested this SMF-record from   23200000
*                                      Logger).      */                 23250000
*      3 SMF88LWI FIXED(32),        /* IXGWRITE invocations for this    23300000
*                                      Log Stream issued during the     23350000
*                                      expiring SMF interval.    @L1C*/ 23400000
*      3 SMF88LIB FIXED(32),        /* Minimum BLOCKLEN value of        23450000
*                                      IXGWRITE seen during the         23500000
*                                      expiring SMF interval.           23550000
*                                      Initialized to X'7FFFFFFF' if    23600000
*                                      no SMF activity occurs within    23650000
*                                      the SMF interval.         @L3A*/ 23700000
*      3 SMF88LAB FIXED(32),        /* Maximum BLOCKLEN value of        23750000
*                                      IXGWRITE seen by this Log Stream 23800000
*                                      during the expiring SMF interval 23850000
*                                      Initialized to zero if no SMF    23900000
*                                      activity occurs within the SMF   23950000
*                                      interval.                 @L3A*/ 24000000
*      3 SMF88LWB CHAR(8),         /* Bytes REQUESTED by user           24050000
*                                     application(s) on ?IXGWRITE       24100000
*                                     invocations for this log stream   24150000
*                                     during the expiring SMF interval  24200000
*                                     (FORMAT=LONG FLOATING POINT).     24250000
*                                     See Notes.                 @L3C*/ 24300000
*                                                                       24350000
*      3 SMF88LDB CHAR(8),         /* Count of bytes written to DASD    24400000
*                                     during the expiring SMF interval  24450000
*                                     (FORMAT=LONG FLOATING POINT).     24500000
*                                                                       24550000
*                                     SMF88LDB = SMF88SAB + storage-for 24600000
*                                     -LOGGR-internal-requirements (ex, 24650000
*                                     rounding, internally-required     24700000
*                                     control information.)             24750000
*                                     See Notes.                 @L5C*/ 24800000
*                                                                       24850000
*                                                                       24853500
*      3 SMF88LIO FIXED(32),       /* Number of times a request was     24857000
*                                     made by System Logger to write    24860500
*                                     log stream data to DASD during    24864000
*                                     the expiring SMF interval  @04A*/ 24867500
*                                                                       24871000
*      3 SMF88LIS FIXED(32),       /* Number of times System Logger had 24874500
*                                     to suspend before writing log     24878000
*                                     stream data to DASD because a     24881500
*                                     previously initiated write to     24885000
*                                     DASD had not yet completed during 24888500
*                                     the expiring SMF interval  @04A*/ 24892000
*                                                                       24895500
*/********************************************************************/ 24900000
*/*   EVENTS SECTION                                             @L5C*/ 24950000
*/********************************************************************/ 25000000
*                                                                       25050000
*    1 SMF88ESD BASED(ADDR(SMFRCD88)+SMF88EOF),  /* Section             25100000
*                                      describing Events             */ 25150000
*      3 SMF88EDS FIXED(32),   /* Number of Log Stream DASD-shifts      25200000
*                                      initiated by this system during  25250000
*                                      the expiring SMF interval @L1C*/ 25300000
*                                                                       25350000
*      3 SMF88ERI FIXED(32),   /* Number of 'Structure Rebuild'         25400000
*                                      events +initiated+ for this      25450000
*                                      log stream during the expiring   25500000
*                                      SMF interval.             @L3C*/ 25550000
*                                                                       25600000
*      3 SMF88ERC FIXED(32),   /* Number of 'Structure Rebuild'         25650000
*                                      events =completed= for this      25700000
*                                      log stream during the expiring   25750000
*                                      SMF interval.             @L3C*/ 25800000
*                                                                       25850000
*      3 SMF88ESF FIXED(32),   /* Number of times IXGWRITE detected     25900000
*                                 'Structure full' condition for this   25950000
*                                  logstream on this system during the  26000000
*                                  expiring SMF interval.        @L1C*/ 26050000
*                                                                       26100000
*      3 SMF88ETT FIXED(32),   /* Number of times IXGLOGR detected      26150000
*                                'Staging-Dataset-Threshold-Hit'        26200000
*                                 condition for this logstream on       26250000
*                                 this system during the expiring       26300000
*                                 SMF interval.                  @L5A*/ 26350000
*                                                                       26400000
*      3 SMF88ETF FIXED(32),   /* Number of times IXGLOGR detected      26450000
*                                'Staging-Dataset-FULL' condition for   26500000
*                                 this logstream on this system during  26550000
*                                 the expiring SMF interval.     @P1C*/ 26600000
*                                                                       26650000
*      3 SMF88EO  FIXED(32),   /* Number of times IXGLOGR performed     26653100
*                                 successful offload (>1 byte of data)  26656200
*                                 for this logstream on this system     26659300
*                                 during the expiring interval   @01A*/ 26662400
*      3 SMF88EFS FIXED(32),   /* Number of times IXGLOGR performed     26665500
*                                 an offload for all the log streams    26668600
*                                 connected on this system to the       26671700
*                                 structure due to the structure's      26674800
*                                 total in-use list entries reaching    26677900
*                                 90% of the total available entries    26681000
*                                 for the structure. This count is      26684100
*                                 the number of occurances of this      26687200
*                                 condition for the                     26690300
*                                 expiring interval.             @01A*/ 26693400
*      3 SMF88EDO FIXED(32),   /* Number of times a demand initiated    26694000
*                                 offload was requested (via IXGOFFLD)  26694600
*                                 for this logstream on this system     26695200
*                                 during the expiring interval   @L8A*/ 26695800
*                                                                       26696500
*/********************************************************************/ 26700000
*/*   STRUCTURE (Interim Storage) Section.  See notes            @03C*/ 26750000
*/********************************************************************/ 26800000
*                                                                       26850000
*    1 SMF88SSD BASED(ADDR(SMFRCD88)+SMF88SOF),  /* Section             26900000
*                                      describing a Structure        */ 26950000
*      3 SMF88STN CHAR(16),        /* Structure Name of structure       27000000
*                                      used for this Log Stream.     */ 27050000
*      3 SMF88SWB CHAR(8),         /* Current WRITTEN-Bytes-Structure.  27100000
*                                     Count of bytes written to interim 27150000
*                                     storage for this logstream        27200000
*                                     for this interval.   See Notes.   27250000
*                                     (format=LONG FLOATING POINT).     27300000
*                                                                @03C*/ 27350000
*      3 SMF88SIB CHAR(8),         /* Current INSTEAD-Bytes count.      27400000
*                                     Count of bytes deleted from       27450000
*                                     interim storage during this       27495400
*                                     interval INSTEAD OF being moved   27540800
*                                     to DASD.  (format = LONG FLOATING 27586200
*                                     POINT).  This field is only       27631600
*                                     incremented due to user ?IXGDELET 27677000
*                                     invocations when the data had not 27722400
*                                     yet been migrated from interim    27767800
*                                     storage to DASD.                  27813200
*                                     See notes.                 @03C*/ 27858600
*                                                                       27904000
*      3 SMF88SAB CHAR(8),         /* Current AFTER-Bytes count.        27950000
*                                     Count of bytes deleted from       28000000
*                                  interim storage during this interval 28050000
*                                     AFTER being moved to DASD         28100000
*                                     (format = LONG FLOATING POINT).   28150000
*                                     This field is only incremented    28200000
*                                     due to LOGGR internal management  28250000
*                                     of interim storage.  See Notes.   28300000
*                                                                @03C*/ 28350000
*      3 *        CHAR(4),          /* Reserved                  @L2C*/ 28400000
*      3 SMF88SII FIXED(32),        /* Current INSTEAD-Invoc count.     28450000
*                                      Count of times a deletion from   28500000
*                                      interim storage was performed    28550000
*                                      during this interval, where the  28600000
*                                      data was NOT first migrated to   28650000
*                                      DASD.  See notes.         @03C*/ 28700000
*      3 SMF88SAI FIXED(32),        /* Current AFTER-Invoc count.       28750000
*                                      Count of times a deletion from   28800000
*                                      interim storage was performed    28850000
*                                      during this interval, AFTER      28900000
*                                      being migrated to DASD (occurs   28950000
*                                      due to LOGGR management of       29000000
*                                   interim storage.) See notes. @03C*/ 29050000
*      3 SMF88SC1 FIXED(32),        /* Count of type-1 completions      29150000
*                                      during the expired SMF interval. 29200000
*                                      Log stream contents can remain   29250000
*                                      in interim storage.  No need to  29300000
*                                      move data from interim storage   29350000
*                                      to DASD.  See Notes.      @03C*/ 29400000
*      3 SMF88SC2 FIXED(32),        /* Count of type-2 completions      29450000
*                                      during the expired SMF interval. 29500000
*                                      Log stream is filling interim    29550000
*                                      storage but space is             29600000
*                                      not critical.  Logger must       29650000
*                                      move data from interim storage   29700000
*                                      to DASD.  See notes.      @L1C*/ 29750000
*      3 SMF88SC3 FIXED(32),        /* Count of type-3 completions      29800000
*                                      during the expired SMF interval. 29850000
*                                      Space used in interim storage    29900000
*                                      (by this log stream) is          29950000
*                                      critical but does not exceed     30000000
*                                      100Dpercent.  See notes.  @03C*/ 30002400
*      3 *        CHAR(4),          /* Reserved                  @L1C*/ 30004800
*/********************************************************************/ 30007200
*/*   STRUCTURE Alter SECTION - These are measurements that are      */ 30009600
*/*   reset each time a check is made to alter the structure     @L6A*/ 30012000
*/********************************************************************/ 30014400
*                                                                       30016800
*    1 SMF88ASD BASED(ADDR(SMFRCD88)+SMF88AOF),  /* Section describing  30019200
*                                      Structure Alter info      @L6A*/ 30021600
*      3 SMF88ANM CHAR(16),        /* Structure Name                    30024000
*                                                                @L6A*/ 30026400
*      3 SMF88ATK CHAR(8),         /* Alter Token which is a STCK       30028800
*                                     timestamp, associated with the    30031200
*                                     last time the element to entry    30033600
*                                     ratio was altered to accomadate   30036000
*                                     the average buffer size being     30038400
*                                     written to the structure          30040800
*                                                                @L6A*/ 30043200
*      3 SMF88AIT CHAR(8),          /* SMF-counter Instance             30045600
*                                      Token.                    @L6A*/ 30048000
*      3 SMF88AWB CHAR(8),         /* Current WRITTEN-Bytes-Structure.  30050400
*                                     Count of bytes written to the     30052800
*                                     structure on this system,         30055200
*                                     associated with this Alter token  30057600
*                                     for this interval.   See Notes.   30060000
*                                     (format=LONG FLOATING POINT).     30062400
*                                                                @L6A*/ 30064800
*      3 SMF88AO  FIXED(32),       /* The number of offloads that       30067200
*                                     occured on this system associated 30069600
*                                     with this Alter token, for this   30072000
*                                     interval.                  @L6A*/ 30074400
*      3 SMF88ACB FIXED(32),        /* Current allocated average        30076800
*                                      buffer size for the              30079200
*                                      structure.                @L6A*/ 30081600
*      3 SMF88ATB FIXED(32),        /* Targeted average buffer size,    30084000
*                                      average buffer size System       30086400
*                                      Logger attempted to achieve, by  30088800
*                                      altering the element to entry    30091200
*                                      ratio.                           30093600
*                                                                @L6A*/ 30096000
*      3 SMF88ASZ FIXED(32),        /* Structure Size. Represented      30098400
*                                      in the number of 4K blocks.      30100800
*                                                                @L6A*/ 30103200
*      3 SMF88ATW FIXED(32),        /* Total number of log data         30105600
*                                      writes to the structure          30108000
*                                      during the recording             30110400
*                                      interval.                 @P1A*/ 30112800
*      3 SMF88ALS FIXED(32),        /* Total number of log streams      30115200
*                                      connected to the structure       30117600
*                                      on this system at the time of    30120000
*                                      the recording interval.   @P1A*/ 30122400
*      3 SMF88AFG Bit(8),           /* Flags                     @P2A*/ 30124800
*        5 SMF88ABC Bit(1),         /* Record was generated to report   30127200
*                                      a change in the average buffer   30129600
*                                      size being written to the        30132000
*                                      structure                 @P2A*/ 30134400
*        5 SMF88ADC Bit(1),         /* Record was generated due to      30136800
*                                      the last logstream disconnecting 30139200
*                                      which resulted in the structure  30141600
*                                      Being disconnect          @P2A*/ 30144000
*        5  *    Bit(6);            /* Reserved                  @P2A*/ 30146400
*                                                                       30150000
*/********************************************************************/ 30200000
*/*   IXGSMF88 - CONSTANTS                                           */ 30250000
*/********************************************************************/ 30300000
*                                                                       30350000
*DCL SMF88_SMF_record_type FIXED(8) constant(88); /* Value of SMF88RTY  30400000
*    record-type 88 (decimal)                                        */ 30450000
*                                                                       30500000
*DCL SMF88_SMF_record_subtype FIXED(8) constant(1);  /* Subtype      */ 30550000
*                                                                       30600000
*DCL SMF88_SSMF_record_subtype FIXED(8) constant(11);  /* Subtype       30621400
*                                                 for structure alter   30642800
*                                                 information   @L6A */ 30664200
*                                                                       30685600
*DCL SMF88_SMF_record_version CHAR(2) constant('03'); /* Value of       30707000
*    SMF88RVN = version of SMFRCD88                             @L6C */ 30728400
*                                                                       30750000
*DCL SMF88_blocklen_high BIT(32) CONSTANT('7FFFFFFF'X); /*This constant 30800000
*    is LARGER than the largest possible valid blocklen.   SMF88 field  30850000
*    SMF88LIB (minimum blocklen seen) is initialized to this high,      30900000
*    invalid value if no SMF activity occurs within an SMF interval. */ 30950000
*                                                                       31000000
*DCL SMF88_blocklen_zero FIXED(31) CONSTANT(0); /* This constant is     31050000
*    SMALLER than the smallest possible valid blocklen.   SMF88 field   31100000
*    SMF88LAB (maximum blocklen seen) is initialized to this low,       31150000
*    invalid value if no SMF activity occurs within an SMF interval. */ 31200000
*                                                                       31250000
*/* End of PL/X Source                                               */ 31300000
* %IF IXGSMF88_LIST ^= 'NO' &                                           31350000
*    ZCBPRINT ^= 'NO' %THEN                                             31400000
*   %GOTO IXGSMF88_4;                                                   31450000
*   @LIST POP NOECHO;                                                   31500000
* %IXGSMF88_4:;                                                         31550000
* %END;                                                                 31600000
