*        %GOTO SXCNPPRO;          /* Bilingual Mapping Macro            00050000
         MACRO                                                          00100000
         IXGSXCNP &DSECT=YES                                            00150000
*                                                                       00200000
.*/      %SXCNPPRO: ;                                             /* */ 00250000
*/**** START OF SPECIFICATIONS ***************************************/ 00300000
*/*                                                                  */ 00350000
*/*01* MACRO NAME = IXGSXCNP                                         */ 00400000
*/*                                                                  */ 00450000
*/*01* DESCRIPTIVE NAME = LOGR subsystem data set interface          */ 00500000
*/*                       exit converter specific parameter list     */ 00550000
*/*                                                                  */ 00600000
*/*02*  ACRONYM = IXGSXCNP                                           */ 00650000
*/*                                                                  */ 00700000
*/*01* PROPRIETARY STATEMENT=                                        */ 00750000
*/***PROPRIETARY_STATEMENT********************************************/ 00800000
*/*                                                                  */ 00850000
*/* LICENSED MATERIALS - PROPERTY OF IBM                             */ 00900000
*/* "RESTRICTED MATERIALS OF IBM"                                    */ 00950000
*/* 5647-A01                                                         */ 01000000
*/* (C) COPYRIGHT IBM CORP. 1994, 1999                               */ 01050000
*/*                                                                  */ 01100000
*/* US GOVERNMENT USERS RESTRICTED RIGHTS - USE, DUPLICATION OR      */ 01150000
*/* DISCLOSURE RESTRICTED BY GSA ADP SCHEDULE CONTRACT WITH          */ 01200000
*/* IBM CORP.                                                        */ 01250000
*/*                                                                  */ 01300000
*/* STATUS = HBB6608                                                 */ 01350000
*/*                                                                  */ 01400000
*/***END_OF_PROPRIETARY_STATEMENT*************************************/ 01450000
*/*                                                                  */ 01500000
*/*    FUNCTION =                                                    */ 01550000
*/*      Converter specific LOGR subsystem data set interface        */ 01600000
*/*      exit parameter list.                                        */ 01650000
*/*                                                                  */ 01700000
*/*01* EXTERNAL CLASSIFICATION:  PSPI                                */ 01750000
*/*01* END OF EXTERNAL CLASSIFICATION:                               */ 01800000
*/*                                                                  */ 01850000
*/*    NOTES =                                                       */ 01900000
*/*                                                                  */ 01950000
*/*        Bilingual Mapping Macro (PL/X and BAL)                    */ 02000000
*/*                                                                  */ 02050000
*/*      DEPENDENCIES =                                              */ 02100000
*/*        PL/X version:  Invoker must also include IXGSXCMP         */ 02150000
*/*                                                                  */ 02200000
*/*      RESTRICTIONS = None                                         */ 02250000
*/*                                                                  */ 02300000
*/**** INVOCATION ****************************************************/ 02350000
*/*                                                                  */ 02400000
*/*    METHOD OF ACCESS =                                            */ 02450000
*/*                                                                  */ 02500000
*/*      PL/X Invocation =                                           */ 02550000
*/*                                                                  */ 02600000
*/*  %INCLUDE SYSLIB(IXGSXCNP)                                       */ 02650000
*/*                                                                  */ 02700000
*/*    PARAMETER DESCRIPTION = None                                  */ 02750000
*/*                                                                  */ 02800000
*/*    PARAMETER INTERDEPENDENCIES = N/A                             */ 02850000
*/*                                                                  */ 02900000
*/*------------------------------------------------------------------*/ 02950000
*/*                                                                  */ 03000000
*/*      BAL Invocation =                                            */ 03050000
*/*                                                                  */ 03100000
*/*      name            name: symbol. Begin name in column 1.       */ 03150000
*/*  b                   one or more blanks (up to nine)             */ 03200000
*/*  IXGSXCNP            should start in column 10                   */ 03250000
*/*  b                   one or more blanks                          */ 03300000
*/*                                                                  */ 03350000
*/*   DSECT=YES|NO                                                   */ 03400000
*/*                                                                  */ 03450000
*/*    PARAMETER DESCRIPTION =                                       */ 03500000
*/*                                                                  */ 03550000
*/*      PARAMETER = DSECT                                           */ 03600000
*/*                                                                  */ 03650000
*/*        DESCRIPTION =                                             */ 03700000
*/*          If the DSECT keyword is specified, then it must be one  */ 03750000
*/*          of the following or an MNOTE will be issued.  See       */ 03800000
*/*          the MESSAGES section for details.                       */ 03850000
*/*                                                                  */ 03900000
*/*            DSECT=YES  - Provides DSECT (mapping) for IXGSXCNP    */ 03950000
*/*                         data area                                */ 04000000
*/*                                                                  */ 04050000
*/*            DSECT=NO   - Provides storage definition for IXGSXCNP */ 04100000
*/*                                                                  */ 04150000
*/*        TYPE = Optional keyword                                   */ 04200000
*/*                                                                  */ 04250000
*/*        FORM = Constant                                           */ 04300000
*/*                                                                  */ 04350000
*/*        DEFAULT = 'YES'                                           */ 04400000
*/*                                                                  */ 04450000
*/*    PARAMETER INTERDEPENDENCIES = None                            */ 04500000
*/*                                                                  */ 04550000
*/********************************************************************/ 04600000
*/*                                                                  */ 04650000
*/*    DSECT NAME = IXGSXCNP                                         */ 04700000
*/*                                                                  */ 04750000
*/*    COMPONENT =  System Logger (SCLOG)                            */ 04800000
*/*                                                                  */ 04850000
*/*    EYE CATCHER = 'IXGSXCNP'                                      */ 04900000
*/*     OFFSET = 0                                                   */ 04950000
*/*     LENGTH = 8                                                   */ 05000000
*/*                                                                  */ 05050000
*/*    CREATED BY = LOGR subsystem data set interface routine        */ 05100000
*/*                                                                  */ 05150000
*/*    POINTED TO BY =                                               */ 05200000
*/*        IXGSXCMP_SPECIFIC_PTR field in the IXGSXCMP data area     */ 05250000
*/*                                                                  */ 05300000
*/*    DELETED BY = LOGR subsystem data set interface routine        */ 05350000
*/*                                                                  */ 05400000
*/*    SERIALIZATION = None                                          */ 05450000
*/*                                                                  */ 05500000
*/*    Storage Attributes =                                          */ 05550000
*/*      Subpool  :  230                                             */ 05600000
*/*      Key      :  1                                               */ 05650000
*/*      Residency:  ANY                                             */ 05700000
*/*                                                                  */ 05750000
*/*    Size       =  32 bytes ('20'X)                                */ 05800000
*/*      Frequency:  1 per converter request of a LOGR subsystem     */ 05850000
*/*                  data set - DD SUBSYS=(LOGR,...)                 */ 05900000
*/*                                                                  */ 05950000
*/*    DISTRIBUTION LIBRARY = AMACLIB                                */ 06000000
*/*                                                                  */ 06050000
*/*    MESSAGES =                                                    */ 06100000
*/*                                                                  */ 06150000
*/*    BAL Version only =                                            */ 06200000
*/*                                                                  */ 06250000
*/*    MNOTE 12,'AHA0010 IXGSXCNP:  DSECT MUST BE EITHER YES OR NO'  */ 06300000
*/*                                                                  */ 06350000
*/*  CHANGE ACTIVITY =                                               */ 06400000
*/*                                                                  */ 06450000
*/*  $L0= LOGGR    HBB5520   940602  PDDZ:  System Logger            */ 06500000
*/*  $L1= ISERV    HBB6608   980923  PDDZ:  Copyright cleanup    @L1A*/ 06550000
*/*                                                                  */ 06600000
*/**** END OF SPECIFICATIONS *****************************************/ 06650000
*/* - Created to map LOGR subsystem data set converter specific      */ 06700000
*/*   parameter list to log stream owner exit.                       */ 06750000
*/*                                                                  */ 06800000
*/********************************************************************/ 06850000
*/*                                                                  */ 06900000
*        %GOTO SXCNPBEG;                                          /* *  06950000
*                                                                       07000000
         AIF   ('&DSECT' EQ 'YES').SXCNP10                              07050000
         AIF   ('&DSECT' EQ 'NO').SXCNP20                               07100000
         MNOTE 12,'AHA0010 IXGSXCNP:  DSECT MUST BE EITHER YES OR NO'   07150000
         AGO   .END                                                     07200000
.SXCNP10 ANOP                                                           07250000
IXGSXCNP           DSECT ,         IXGSXCNP data area mapping           07300000
         AGO   .SXCNP30                                                 07350000
.SXCNP20 ANOP                                                           07400000
IXGSXCNP           DS    0F        IXGSXCNP data area                   07450000
.SXCNP30 ANOP                                                           07500000
IXGSXCNP_START           DS     0F     Ensure word alignment            07550000
IXGSXCNP_ID              DS     CL8    Eye catcher 'IXGSXCNP'           07600000
IXGSXCNP_VERSION         DS     X      Version number                   07650000
IXGSXCNP_IN_RSVD1        DS     X      Reserved for IBM                 07700000
IXGSXCNP_LENGTH          DS     XL2    Length of IXGSXCNP               07750000
*                                                                       07800000
IXGSXCNP_MSG_PTR         DS     A      Pointer to message area (refer   07850000
*                                      to IXGSXMSP).  The length of the 07900000
*                                      area is set in IXGSXCNP_MSG_LEN  07950000
IXGSXCNP_MSG_LEN         DS     H      Size of area pointed to by       08000000
*                                      IXGSXCNP_MSG_PTR                 08050000
IXGSXCNP_IN_RSVD2        DS     CL6    Reserved for IBM                 08100000
*                                                                       08150000
*********************************************************************** 08200000
*   Start of output fields                                            * 08250000
*********************************************************************** 08300000
IXGSXCNP_OUT_FLAGS       DS     0XL2   Output flags                     08350000
IXGSXCNP_OUT_FLAG1       DS     X      Output flag byte 1               08400000
IXGSXCNP_ISSUE_MSG       EQU    X'80'  The message contained in the     08450000
*                                      area pointed to by               08500000
*                                      IXGSXCNP_MSG_PTR is to be issued 08550000
IXGSXCNP_OUT_FLAG2       DS     X      Reserved for IBM                 08600000
*                                                                       08650000
IXGSXCNP_OUT_RSVD1       DS     XL6    Reserved for IBM                 08700000
*                                                                       08750000
IXGSXCNP_END             DS     0F     End of mapping                   08800000
*                                                                       08850000
*********************************************************************** 08900000
*   Current Length and Id values                                      * 08950000
*********************************************************************** 09000000
IXGSXCNP_CURRENT_LENGTH  EQU    *-IXGSXCNP  Assembled length of mapping 09050000
*                                                                       09100000
IXGSXCNP_LATEST_VERSION  EQU    X'01'  Latest version of mapping        09150000
IXGSXCNP_1ST_VERSION     EQU    X'01'  First version of mapping         09200000
.*                                                                      09250000
.END     ANOP                                                           09300000
         MEND  ,                                                        09350000
.*                                                                      09400000
.*/      %SXCNPBEG: ;                                                   09450000
                                                                @SPACE; 09500000
 DCL                                                                    09550000
  1 IXGSXCNP BDY(WORD)  BASED(IXGSXCMP_specific_ptr),                   09600000
    2 IXGSXCNP_start,                                                   09650000
      3 IXGSXCNP_id         CHAR(8), /* Eye catcher 'IXGSXCNP'       */ 09700000
      3 IXGSXCNP_version    BIT(8), /* Version number                */ 09750000
      3 IXGSXCNP_in_rsvd1   BIT(8), /* Reserved for IBM              */ 09800000
      3 IXGSXCNP_length     FIXED(16), /* Length of IXGSXCNP         */ 09850000
      3 IXGSXCNP_msg_ptr    PTR(31), /* Pointer to message area (refer  09900000
                                      to IXGSXMSP). The length of the   09950000
                                      area is set in IXGSXCNP_MSG_LEN*/ 10000000
      3 IXGSXCNP_msg_len    FIXED(15), /* Size of area pointed to by    10050000
                                      IXGSXCNP_msg_ptr               */ 10100000
      3 IXGXXCNP_in_rsvd2   CHAR(6), /* Reserved for IBM             */ 10150000
                                                                @SPACE; 10200000
 /********************************************************************/ 10250000
 /* Start of output fields                                           */ 10300000
 /********************************************************************/ 10350000
      3 IXGSXCNP_out_flags  BIT(16), /* Output flags                 */ 10400000
        5 IXGSXCNP_out_flag1  BIT(8), /* Output flag byte 1          */ 10450000
          7 IXGSXCNP_issue_msg  BIT(1), /* The message contained in the 10500000
                                      area pointed to by                10550000
                                      IXGSXCNP_MSG_PTR is to be issued  10600000
                                                                     */ 10650000
        5 IXGSXCNP_out_flag2  BIT(8), /* Reserved for IBM            */ 10700000
      3 IXGSXCNP_out_rsvd1   CHAR(6), /* Reserved for IBM            */ 10750000
    2 IXGSXCNP_end         CHAR(0) BDY(WORD); /* End of mapping      */ 10800000
                                                                @SPACE; 10850000
 /********************************************************************/ 10900000
 /* Current Length and ID values                                     */ 10950000
 /********************************************************************/ 11000000
 DCL IXGSXCNP_Eyecatcher     CHAR(8)   CONSTANT('IXGSXCNP'),            11050000
     IXGSXCNP_current_length FIXED(16) CONSTANT(LENGTH(IXGSXCNP));      11100000
                                                                        11150000
 DCL IXGSXCNP_latest_version BIT(8) CONSTANT('01'X),                    11200000
     IXGSXCNP_1st_version    BIT(8) CONSTANT('01'X);                    11250000
