*                                                                       00002500
* %DCL IXLYCOMP_INCLUDED CHAR EXT;                                      00005000
* %DEACTIVATE IXLYCOMP_INCLUDED;                                        00007500
* %IF IXLYCOMP_INCLUDED = '' %THEN                                      00010000
* %DO;                                                                  00012500
*/* Macro made bi-lingual on 98239. CBGEN compile date 98009         */ 00015000
*% /*                                                                   00017500
         MACRO                                                          00020000
         IXLYCOMP &DSECT=YES,&LIST=YES,&TITLE=YES,&COMPDATANAME=YES,   *00022500
               &COMPINDEX=COND,&COMPSTRTRL=COND,&COMPSTRHDR=COND,      *00025000
               &COMPSTROBJMAPINDEX=COND,&COMPSTROBJMAP=COND,           *00027500
               &COMPHASHTABLEHDR=COND,&COMPHASHSLOTARRAY=COND,         *00030000
               &COMPHASHELEM=COND,&COMPENTRYCNTL=COND                   00032500
         GBLC  &IXLYCOMP_INCLUDED                                       00035000
         GBLC  &ZCBPRINT                                                00037500
&IXLYCOMP_INCLUDED SETC 'YES'                                           00040000
         AIF   ('&LIST' EQ 'NONE').P0                                   00041200
         AIF   ('&TITLE' EQ 'NO').P5                                    00042400
 TITLE   'IXLYCOMP  - CF Dumping Compdata Record Format Mappings     '  00043700
.P5      ANOP                                                           00045600
**/ IXLYCOMP_1:;                                                        00047500
*/* START OF SPECIFICATIONS ******************************************* 00050000
*                                                                       00100000
*****PROPRIETARY_STATEMENT********************************************* 00150000
*                                                                       00200000
*01* PROPRIETARY STATEMENT=                                             00242800
*                                                                       00285600
*   Licensed Materials - Property of IBM                                00335600
*                                                                       00500000
*   "Restricted Materials of IBM"                                       00505800
*                                                                       00511600
*    5647-A01                                                           00517400
*                                                                       00523200
*   (C) COPYRIGHT IBM CORP. 1993, 1999                                  00529000
*                                                                       00534800
*   US Government Users Restricted Rights - Use, duplication or         00540600
*   disclosure restricted by GSA ADP Schedule Contract with             00546400
*   IBM Corp.                                                           00552200
*                                                                       00558000
*    STATUS = FMID HBB6608                                              00563800
*                                                                       00569600
*****END_OF_PROPRIETARY_STATEMENT************************************** 00575400
*                                                                       00581200
*01* EXTERNAL CLASSIFICATION: GUPI                                      00587000
*01* END OF EXTERNAL CLASSIFICATION:                                    00592800
*                                                                       00600000
*01* DESCRIPTIVE NAME:  CF Dumping Compdata Record Format Mappings      00650000
*                                                                       00675000
*02*  ACRONYM:  N/A                                                     00700000
*                                                                       00750000
*01* MACRO NAME:  IXLYCOMP                                              00800000
*                                                                       00850000
*01* DSECT NAME:                                                        00900000
*     CompdataName                                                      00950000
*     CompIndex                                                         01000000
*     CompStrTrl                                                        01050000
*     CompStrHdr                                                        01100000
*     CompStrObjMapIndex                                                01150000
*     CompStrObjMap                                                     01200000
*     CompHashTableHdr                                                  01250000
*     CompHashTable                                                     01300000
*     CompHashElem                                                      01350000
*     CompEntryCntl                                                     01400000
*                                                                       01600000
*01* COMPONENT: Cross System Extended Services (SCIXL)                  01650000
*                                                                       01700000
*01* EYE-CATCHER:  None                                                 01750000
*02*  OFFSET:  N/A                                                      01800000
*02*  LENGTH:  N/A                                                      01850000
*                                                                       01900000
*01* STORAGE ATTRIBUTES:                                                01950000
*02*  SUBPOOL:  User Defined                                            02000000
*02*  KEY:  User Defined                                                02050000
*02*  RESIDENCY:  User Defined                                          02100000
*                                                                       02150000
*01* SIZE:                                                              02158300
*                COMPDATANAME       -- X'0008' bytes                    02166600
*                COMPINDEX          -- X'0100' bytes                    02174900
*                COMPSTRTRL         -- X'1000' bytes                    02183200
*                COMPSTRHDR         -- X'0008' bytes                    02191500
*                COMPSTROBJMAPINDEX -- X'005C' bytes                    02199800
*                COMPSTROBJMAP      -- X'0018' bytes                    02208100
*                COMPHASHTABLEHDR   -- X'0008' bytes                    02216400
*                COMPHASHSLOTARRAY  -- X'0004' bytes                    02224700
*                COMPHASHELEM       -- X'0018' bytes                    02233000
*                COMPENTRYCNTL      -- X'0018' bytes                    02241300
*                                                                       02250000
*01* CREATED BY: User                                                   02300000
*                                                                       02350000
*01* POINTED TO BY: User                                                02400000
*                                                                       02450000
*01* SERIALIZATION: None Required                                       02500000
*                                                                       02550000
*01* FUNCTION:                                                          02600000
*                                                                       02650000
*    This macro is used to map the dump of CF structure data written    02700000
*    to and accessed from the dump dataset.  The dump dataset is        02750000
*    organized into several compdata spaces.  Each compdata space       02800000
*    contains a specific type of data.                                  02850000
*                                                                       02900000
*    NOTE: All of the records in the compdata spaces start at address   02950000
*          hex 1000.  The first page of all compdata spaces are not     03000000
*          used                                                         03050000
*                                                                       03062500
*    NOTE: To interpret the dump reason code, include the IXLYSTRC      03075000
*          mapping in your program.                                     03087500
*                                                                       03137500
*01* METHOD OF ACCESS:                                                  03150000
*     ASM: IXLYCOMP                                                     03158300
*                                                                       03166600
*  NOTE!!! Invokers of Assembler Version of IXLYCOMP macro are          03174900
*          REQUIRED to declare the constant COMPDATATYPEINDEX           03183200
*          on their own.                                                03191600
*                                                                       03200000
*     PL/AS:                                                            03250000
*         %DCL COMPDATA_NAME_ATTR          CHAR                         03300000
*         %DCL COMPDATA_INDEX_ATTR         CHAR                         03350000
*         %DCL COMPDATA_STRTRL_ATTR        CHAR                         03400000
*         %DCL COMPDATA_STR_ATTR           CHAR                         03450000
*         %DCL COMPDATA_STROBJMAPINDX_ATTR CHAR                         03500000
*         %DCL COMPDATA_STROBJMAP_ATTR     CHAR                         03550000
*         %DCL COMPDATA_HASHTABLEHDR_ATTR  CHAR                         03600000
*         %DCL COMPDATA_HASHSLOT_ATTR      CHAR                         03650000
*         %DCL COMPDATA_HASHELEM_ATTR      CHAR                         03700000
*         %DCL COMPDATA_ENTRYCNTL_ATTR     CHAR                         03750000
*         %COMPDATA_NAME_ATTR          = 'based/defined/via attributes' 03800000
*         %COMPDATA_INDEX_ATTR         = 'based/defined/via attributes' 03850000
*         %COMPDATA_STRTRL_ATTR        = 'based/defined/via attributes' 03900000
*         %COMPDATA_STR_ATTR           = 'based/defined/via attributes' 03950000
*         %COMPDATA_STROBJMAPINDX_ATTR = 'based/defined/via attributes' 04000000
*         %COMPDATA_STROBJMAP_ATTR     = 'based/defined/via attributes' 04050000
*         %COMPDATA_HASHTABLEHDR_ATTR  = 'based/defined/via attributes' 04100000
*         %COMPDATA_HASHSLOT_ATTR      = 'based/defined/via attributes' 04150000
*         %COMPDATA_HASHELEM_ATTR      = 'based/defined/via attributes' 04200000
*         %COMPDATA_ENTRYCNTL_ATTR     = 'based/defined/via attributes' 04250000
*         %INCLUDE SYSLIB(IXLYCOMP)                                     04300000
*                                                                       04350000
*  Where:                                                               04400000
*                                                                       04450000
*    COMPDATA_NAME_ATTR is associated with the CompdataName mapping     04500000
*    COMPDATA_INDEX_ATTR is associated with the CompIndex mapping       04550000
*    COMPDATA_STRTRL_ATTR is associated with the CompStrTrl mapping     04600000
*    COMPDATA_STR_ATTR is associated with the CompStrHdr mapping        04650000
*    COMPDATA_STROBJMAPINDX_ATTR is associated with the                 04700000
*                             CompStrObjMapIndex mapping                04750000
*    COMPDATA_STROBJMAP_ATTR is associated with the CompStrObjMap       04800000
*                            mapping                                    04850000
*    COMPDATA_HASHTABLEHDR_ATTR is associated with the CompHashTableHdr 04900000
*                            mapping                                    04950000
*    COMPDATA_HASHSLOT_ATTR is associated with the CompHashSlotArray    05000000
*                            mapping                                    05050000
*    COMPDATA_HASHELEM_ATTR is associated with the CompHashElem mapping 05100000
*    COMPDATA_ENTRYCNTL_ATTR is associated with the CompEntryCntl       05150000
*                            mapping                                    05200000
*                                                                       05250000
*     If any of the above variables is not set,                         05300000
*     the associated mapping will declared as BASED.                    05350000
*                                                                       05400000
*01* STATUS:  HBB5510                                                   05450000
*                                                                       05500000
*01* DELETED BY: User                                                   05550000
*                                                                       05600000
*01* FREQUENCY:                                                         05650000
*     N/A                                                               05700000
*                                                                       05750000
*01* DEPENDENCIES:  None                                                05800000
*                                                                       05850000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     05870000
*                                                                       05950000
*01* CHANGE ACTIVITY:                                                   06000000
*     $L0=SYSLKDFM HBB5510 920812 PD00LA: XLS Initial Release           06050000
*     $D1=DIG0032  HBB5510 921105 PD00LA: Externalize Dumping Mappings  06062500
*     $D2=DIG0044  HBB5510 930520 PD00LA: Structure Dump ID support     06075000
*     $D3=DIG0076  HBB5510 930520 PD00LA: Rebuild Support               06087500
*     $D4=DIG0108  HBB5510 930715 PD00LA: CF name change                06090600
*     $L1=DMPMG    HBB5510 930715 PD00LA: Add Incident token to the     06093700
*                                         master index                  06096800
*     $P1=PIG3552  HBB5510 931110 PD00NT: Length constants moved        06097800
*     $P2=PIG5495  HBB5510 940722 PD00EA: Add CFLEVEL                   06098300
*     $01=OW24532  HBB5520 960701 PDHT:   Event monitoring controls     06098400
*                                         and event queues support @01A 06098500
*     $P3=PRR0045  HBB5520 970626 PDHT:   Nat'l char compliant var @P3A 06098600
*     $02=OW28460  HBB6603 970801 PDXM: User managed duplexing          06098700
*     $L2=AUTOR    HBB6608 980831 PD00GW: System managed rebuild        06099100
*                                                                       06099500
*                                                                       06100000
* END OF SPECIFICATIONS *********************************************/  06150000
*% /*                                                                   06200000
.P0      ANOP                                                           06225000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 06250000
         AIF   ('&LIST' EQ 'YES').P2                                    06300000
.P1      ANOP                                                           06350000
         PUSH  PRINT                                                    06400000
         PRINT OFF                                                      06450000
.P2      ANOP                                                           06500000
*                                                                       06550000
* ********************************************************************  06600000
* *                                                                  *  06650000
* *     Format of the COMPDATA names                                 *  06700000
* *                                                                  *  06750000
* *  !!!! NOTE !!!!  The CompdataNameStrNum component of the         *  06800000
* *  compdata name is dependent on the position of the structure     *  06850000
* *  within the master index.  The number of the first               *  06900000
* *  structure is 1 and therefore the compdata names for that        *  06950000
* *  structure will be CFDxx01z.  The same follows for all the       *  07000000
* *  structures within the master index.                             *  07050000
* *                                                                  *  07100000
* *  The CompdataSpaceNumber portion of the name must begin at 00.   *  07150000
* *  If another compdata space of that type is necessary, the        *  07200000
* *  number will be 01, etc.                                         *  07250000
* *                                                                  *  07300000
* ********************************************************************  07350000
*                                                                       07400000
*                                                                       07450000
         AIF   ('&COMPDATANAME' EQ 'NO').L0002                          07500000
         AIF   ('&DSECT' EQ 'YES').L0003                                07550000
         AIF   ('&COMPDATANAME' NE 'YES').L0002                         07600000
COMPDATANAME DS 0X                                                      07650000
         AGO   .L0004                                                   07700000
.L0003   ANOP                                                           07750000
COMPDATANAME DSECT                                                      07800000
.L0004   ANOP                                                           07850000
COMPDATANAMECOMPONENT DS 1CL0003 Indicates the component prefix         07900000
COMPDATASPACENUMBER DS 1CL0002 Nth compdata space of a specific type.  *07950000
                         The first compdata space should be numbered   *08000000
                         00.                                            08050000
COMPDATANAMESTRNUM DS 1CL0002 Nth structure dumped                      08100000
COMPDATANAMETYPE DS 1CL0001 Type of compdata record                     08150000
KCOMPDATANAME_LEN EQU 8  Length of CompDataName                         08175000
*                                                                       08200000
* ********************************************************************  08250000
* *                                                                  *  08300000
* * Constants defined for use in the Compdata name                   *  08350000
* *                                                                  *  08400000
* ********************************************************************  08450000
*                                                                       08500000
*                                                                       08550000
COMPDATACOMPONENT EQU C'CFD' Used to fill in the component section of  *08600000
                         the compdata name                              08650000
COMPDATATYPESTR EQU C'S' Structure type compdata                        08800000
COMPDATATYPEOBJ EQU C'O' Object header type compdata                    08850000
COMPDATATYPEHASH EQU C'H' Hash table type compdata                      08900000
COMPDATATYPEENTRYCNTL EQU C'C' Entry control information type compdata  08950000
COMPDATATYPEENTRYDATA EQU C'D' Entry data type compdata                 09000000
COMPDATATYPEADJ EQU C'A' Adjunct data type compdata                     09050000
COMPDATATYPELOCK EQU C'L' Lock table type compdata                      09100000
COMPDATATYPEUSER EQU C'U' User control type compdata                    09150000
COMPDATATYPEEMC EQU C'E' Event monitor control type compdata            09166600
COMPDATATYPEEVENTQ EQU C'Q' Event queue control type compdata           09183200
COMPDATANAME_LEN EQU *-COMPDATANAME                                     09200000
.L0002   ANOP                                                           09250000
*                                                                       09300000
* ********************************************************************  09350000
* *                                                                  *  09400000
* *     Format of the master index compdata space - CFD0000I         *  09450000
* *                                                                  *  09500000
* *  NOTE: The CompIndex records in the master index compdata space  *  09550000
* *        must fit evenly into a 4K record.                         *  09600000
* *                                                                  *  09650000
* ********************************************************************  09700000
*                                                                       09750000
*                                                                       09800000
         AIF   ('&COMPINDEX' EQ 'NO').L0005                             09850000
         AIF   ('&DSECT' EQ 'YES').L0006                                09900000
         AIF   ('&COMPINDEX' NE 'YES').L0005                            09950000
COMPINDEX DS   0F        There will be one CompIndex type entry in the *10000000
                         master index compdata space for every         *10050000
                         structure in the dump                          10100000
         AGO   .L0007                                                   10150000
.L0006   ANOP                                                           10200000
COMPINDEX DSECT          There will be one CompIndex type entry in the *10250000
                         master index compdata space for every         *10300000
                         structure in the dump                          10350000
.L0007   ANOP                                                           10400000
COMPINDEXSTRNAME DS 1CL0016 Name of the structure                       10450000
COMPINDEXSTRDUMPID DS 1FL2 Structure Dump ID                            10483300
         DS    1CL0002   Reserved                                       10516600
COMPINDEXCONNAME DS 1CL0016 Conname used in requesting the dump         10550000
COMPINDEXSTRTYPE DS 1FL1 Structure type                                 10600000
COMPINDEXUIDL DS 1FL1    User identifier limit (UIDL) used to          *10640000
                         determine the size of the list number         *10680000
                         controls for a list structure. This field     *10720000
                         will be 0 for a cache structure                10760000
COMPINDEXSTR#EBCDIC DS 0CL0002 Structure number in EBCDIC               10790000
COMPINDEXSTRNUMEBCDIC DS 1CL0002 Structure number in EBCDIC             10820000
COMPINDEXHDWND DS 1CL0032 Node element descriptor                       10850000
COMPINDEXLOCKTBLENTLEN DS 1FL4 Length of the lock table entries        *10900000
                         associated with this structure                 10950000
COMPINDEXSTRTRLPTR DS 1AL4 Pointer to the structure trailer associated *11000000
                         with this structure                            11050000
COMPINDEXNODUMPRSN DS 1FL4 Reason why the structure was not dumped -   *11100000
                         the no dump reason codes are defined in the   *11150000
                         IXLYSTRC mapping                               11200000
COMPINDEXFLAGS DS 0BL1   Master index flags                             11250000
COMPINDEXLASTSTR EQU X'80' Indicates that this is the last entry in    *11300000
                         the master index                               11350000
COMPINDEXCONNOTFOUND EQU X'40' Indicates that the conname or contoken  *11400000
                         specified for a cache structure was not found *11450000
                         in the policy                                  11500000
COMPINDEXSTRINREBLD EQU X'20' Indicates that the the structure is in   *11504500
                         the process of rebuild                         11509000
COMPINDEXREBLDOLDSTR EQU X'10' Indicates that the structure            *11513500
                         information pertains to the OLD structure     *11518000
                         NOTE: Bit is only valid if the                *11522500
                         CompIndexStrInRebld bit is set                 11527000
COMPINDEXREBLDNEWSTR EQU X'08' Indicates that the structure            *11531500
                         information pertains to the NEW structure     *11536000
                         NOTE: Bit is only valid if the                *11540500
                         CompIndexStrInRebld bit is set                 11545000
COMPINDEXREBLDDUPLEXSTR EQU X'04' ON indicates the structure rebuild   *11545800
                         is a duplexing rebuild. OFF indicates the     *11546600
                         structure rebuild is a normal rebuild. NOTE:  *11547400
                         Bit is only valid if the CompIndexStrInRebld  *11548200
                         bit is set                                     11549000
COMPINDEXREBLDMETHODSTR EQU X'02' ON indicates the structure rebuild   *11549100
                         is system managed. OFF indicates the          *11549200
                         structure rebuild is user managed. NOTE: Bit  *11549300
                         is only valid if the CompIndexStrInRebld bit  *11549400
                         is set                                         11549500
         ORG   COMPINDEXFLAGS+X'00000001'                               11550000
         DS    1CL0001   Reserved                                       11600000
COMPINDEXCONID DS 1FL2   Connection ID                                  11650000
COMPINDEXCFNAME DS 1CL0008 Facility name                                11680000
COMPINDEXINCIDENTTOKEN DS 1CL0032 Incident Token                        11710000
COMPINDEXCFLEVEL DS 1FL4 Coupling facility operational level of the    *11725000
                         facility in which the structure is allocated   11740000
         DS    1CL0124   Reserved                                       11755000
KCOMPINDEX_LEN EQU 256   Length of CompIndex                            11770000
COMPINDEX_LEN EQU *-COMPINDEX                                           11800000
.L0005   ANOP                                                           11850000
*                                                                       11900000
* ********************************************************************  11950000
* *                                                                  *  12000000
* *     Structure Trailer                                            *  12050000
* *                                                                  *  12100000
* *  NOTE: The Structure Trailer is part of the Master Index compdata*  12150000
* *        space                                                     *  12200000
* *                                                                  *  12250000
* ********************************************************************  12300000
*                                                                       12350000
*                                                                       12400000
         AIF   ('&COMPSTRTRL' EQ 'NO').L0008                            12450000
         AIF   ('&DSECT' EQ 'YES').L0009                                12500000
         AIF   ('&COMPSTRTRL' NE 'YES').L0008                           12550000
COMPSTRTRL DS  0F        There will be a structure trailer for each    *12600000
                         structure that is dumped (unless the dump     *12650000
                         dataset fills or an I/O error occurs while    *12700000
                         the structure is being dumped)                 12750000
         AGO   .L000A                                                   12800000
.L0009   ANOP                                                           12850000
COMPSTRTRL DSECT         There will be a structure trailer for each    *12900000
                         structure that is dumped (unless the dump     *12950000
                         dataset fills or an I/O error occurs while    *13000000
                         the structure is being dumped)                 13050000
.L000A   ANOP                                                           13100000
COMPSTRTRLDUMPRSN DS 1FL4 Reason for an incomplete dump of the         *13150000
                         structure - the dump reason codes are defined *13200000
                         in the IXLYSTRC mapping                        13250000
COMPSTRTRLOBJIDINCOMPLETE DS 1FL4 Object identifier of object that is  *13300000
                         incomplete                                     13350000
COMPSTRTRLDOTINCOMPLETE DS 1FL2 Dumping object type of object that is  *13400000
                         incomplete                                     13450000
COMPSTRTRLFLAGS DS 0BL1  Structure trailer flags                        13500000
COMPSTRTRLLOCKDUMPED EQU X'80' Indicates that some lock table entries  *13550000
                         were dumped for this structure                 13600000
COMPSTRTRLUSERDUMPED EQU X'40' Indicates that some user controls were  *13650000
                         dumped for this structure                      13700000
         ORG   COMPSTRTRLFLAGS+X'00000001'                              13750000
         DS    1CL0021   Reserved                                       13800000
KCOMPSTRTRL_LEN EQU 4096 Length of CompStrTrl                           13825000
         ORG   COMPSTRTRL+X'00001000'                                   13850000
COMPSTRTRL_LEN EQU *-COMPSTRTRL                                         13900000
.L0008   ANOP                                                           13950000
*                                                                       14000000
* ********************************************************************  14050000
* *                                                                  *  14100000
* *     Format of the STRUCTURE compdata type - CFDxxyyS             *  14150000
* *                                                                  *  14200000
* * The structure compdata space consists of up to four items.  The  *  14250000
* * first item that appears is the structure compdata space header   *  14300000
* * (CompStrHdr).  The header consists of pointers to the dump       *  14350000
* * header and the object map index.                                 *  14400000
* *                                                                  *  14450000
* * The dump header consists of structure information.  It is mapped *  14500000
* * by the macro IHADWHDR                                            *  14550000
* *                                                                  *  14600000
* * The object map index (CompStrObjMapIndex) is an index into the   *  14650000
* * object map.  It contains pointers to the first object map entry  *  14700000
* * of each type within that structure compdata space.               *  14750000
* *                                                                  *  14800000
* * The object map (CompStrObjMap) is a directory to the object      *  14850000
* * header in the object compdata space.  Each object has its own    *  14900000
* * entry.  The object map entries are grouped by type and are       *  14950000
* * ordered by the object identifier (CompStrObjMapObjId).           *  15000000
* *                                                                  *  15050000
* ********************************************************************  15100000
* ********************************************************************  15150000
* *                                                                  *  15200000
* *            Structure compdata space header                       *  15250000
* *                                                                  *  15300000
* ********************************************************************  15350000
*                                                                       15400000
*                                                                       15450000
         AIF   ('&COMPSTRHDR' EQ 'NO').L000B                            15500000
         AIF   ('&DSECT' EQ 'YES').L000C                                15550000
         AIF   ('&COMPSTRHDR' NE 'YES').L000B                           15600000
COMPSTRHDR DS  0F        Header for the structure compdata space.      *15650000
                         There will be a header in each structure      *15700000
                         compdata space for a structure                 15750000
         AGO   .L000D                                                   15800000
.L000C   ANOP                                                           15850000
COMPSTRHDR DSECT         Header for the structure compdata space.      *15900000
                         There will be a header in each structure      *15950000
                         compdata space for a structure                 16000000
.L000D   ANOP                                                           16050000
COMPSTRHDRDUMPHDR@ DS 0AL4 Pointer to the dump header for a given      *16100000
                         structure                                      16150000
COMPSTRHDRDUMPHDRPTR DS 1AL4 Pointer to the dump header for a given    *16175000
                         structure                                      16200000
COMPSTRHDROBJMAPINDEX@ DS 0AL4 Pointer to the object map index within  *16225000
                         the structure compdata space.                  16250000
COMPSTRHDROBJMAPINDEXPTR DS 1AL4 Pointer to the object map index       *16258300
                         within the structure compdata space.           16266600
KCOMPSTRHDR_LEN EQU 8    Length of CompStrHdr                           16275000
COMPSTRHDR_LEN EQU *-COMPSTRHDR                                         16300000
.L000B   ANOP                                                           16350000
*                                                                       16400000
* ********************************************************************  16450000
* *                                                                  *  16500000
* *            Structure compdata space object map index             *  16550000
* *                                                                  *  16600000
* ********************************************************************  16650000
*                                                                       16700000
*                                                                       16750000
         AIF   ('&COMPSTROBJMAPINDEX' EQ 'NO').L000E                    16800000
         AIF   ('&DSECT' EQ 'YES').L000F                                16850000
         AIF   ('&COMPSTROBJMAPINDEX' NE 'YES').L000E                   16900000
COMPSTROBJMAPINDEX DS 0F Index by object type in the object map.        16950000
         AGO   .L0010                                                   17000000
.L000F   ANOP                                                           17050000
COMPSTROBJMAPINDEX DSECT   Index by object type in the object map.      17100000
.L0010   ANOP                                                           17150000
COMPSTROBJMAPIDXLISTINFO DS 0CL0016 Information associated with list   *17200000
                         object map entries                             17250000
COMPSTROBJMAPIDXTYPELIST@ DS 0AL4 Pointer to the beginning of the      *17270000
                         listnum type object map entries within the    *17290000
                         structure compdata space.                      17310000
COMPSTROBJMAPIDXTYPELISTPTR DS 1AL4 Pointer to the beginning of the    *17330000
                         listnum type object map entries within the    *17350000
                         structure compdata space.                      17400000
COMPSTROBJMAPIDXLISTMINOBJID DS 1FL4 Minimum object identifier of the  *17450000
                         listnum object map entries                     17500000
COMPSTROBJMAPIDXLISTMAXOBJID DS 1FL4 Maximum object identifier of the  *17550000
                         listnum object map entries                     17600000
COMPSTROBJMAPIDXTOTALNUMLST DS 1FL4 Total number of list number object *17650000
                         map entries in this compdata space             17700000
COMPSTROBJMAPIDXSTGCINFO DS 0CL0016 Information associated with the    *17750000
                         storage class object map entries               17800000
COMPSTROBJMAPIDXTYPESTGCLASS@ DS 0AL4 Pointer to the beginning of the  *17850000
                         storage class type object map entries          17900000
COMPSTROBJMAPIDXTYPESTGCLASSPTR DS 1AL4 Pointer to the beginning of    *17916600
                         the storage class type object map entries      17933200
COMPSTROBJMAPIDXSTGCMINOBJID DS 1FL4 Minimum object identifier of the  *17950000
                         storage class object map entries               18000000
COMPSTROBJMAPIDXSTGCMAXOBJID DS 1FL4 Maximum object identifier of the  *18050000
                         storage class object map entries               18100000
COMPSTROBJMAPIDXTOTALNUMSTG DS 1FL4 Total number of Storage class      *18150000
                         object map entries in this compdata space      18200000
COMPSTROBJMAPIDXCOCINFO DS 0CL0016 Information associated with the     *18250000
                         castout class object map entries               18300000
COMPSTROBJMAPIDXTYPECOCLASS@ DS 0AL4 Pointer to the beginning of the   *18325000
                         castout class type object map entries          18350000
COMPSTROBJMAPIDXTYPECOCLASSPTR DS 1AL4 Pointer to the beginning of the *18375000
                         castout class type object map entries          18400000
COMPSTROBJMAPIDXCOCMINOBJID DS 1FL4 Minimum object identifier of the   *18450000
                         castout class object map entries               18500000
COMPSTROBJMAPIDXCOCMAXOBJID DS 1FL4 Maximum object identifier of the   *18550000
                         castout class object map entries               18600000
COMPSTROBJMAPIDXTOTALNUMCOC DS 1FL4 Total number of castout class      *18650000
                         object map entries in this compdata space      18700000
COMPSTROBJMAPIDXTYPELOCKTBL@ DS 0AL4 Pointer to the lock table type    *18750000
                         object map entries                             18800000
COMPSTROBJMAPIDXTYPELOCKTBLPTR DS 1AL4 Pointer to the lock table type  *18850000
                         object map entries                             18900000
COMPSTROBJMAPIDXTYPEUSER@ DS 0AL4 Pointer to the user control type     *18901200
                         object map entries                             18902400
COMPSTROBJMAPIDXTYPEUSERPTR DS 1AL4 Pointer to the user control type   *18903600
                         object map entries                             18904800
COMPSTROBJMAPIDXEVENTQINFO DS 0CL0016 Information associated with      *18906000
                         event queue control object map entries         18907200
COMPSTROBJMAPIDXTYPEEVENTQ@ DS 0AL4 Pointer to the beginning of the    *18908400
                         event queue control type object map entries   *18909600
                         within the structure compdata space.           18910800
COMPSTROBJMAPIDXTYPEEVENTQPTR DS 1AL4 Pointer to the beginning of the  *18912000
                         event queue control type object map entries   *18913200
                         within the structure compdata space.           18914400
COMPSTROBJMAPIDXEVENTQMINOBJID DS 1FL4 Minimum object identifier of    *18915600
                         the event queue control object map entries     18916800
COMPSTROBJMAPIDXEVENTQMAXOBJID DS 1FL4 Maximum object identifier of    *18918000
                         the event queue control object map entries     18919200
COMPSTROBJMAPIDXTOTALNUMEVENTQ DS 1FL4 Total number of event queue     *18920400
                         control object map entries in this compdata   *18921600
                         space                                          18922800
COMPSTROBJMAPIDXEMCINFO DS 0CL0020 Information associated with event   *18924000
                         monitor control object map entries             18925200
COMPSTROBJMAPIDXTYPEEMC@ DS 0AL4 Pointer to the beginning of the event *18926400
                         monitor control type object map entries       *18927600
                         within the structure compdata space.           18928800
COMPSTROBJMAPIDXTYPEEMCPTR DS 1AL4 Pointer to the beginning of the     *18930000
                         event monitor control type object map entries *18931200
                         within the structure compdata space.           18932400
COMPSTROBJMAPIDXTYPEEMCNUM DS 1CL0002 Compdata space number of the     *18933600
                         pointer to the beginning of the event monitor *18934800
                         control type object map entries within the    *18936000
                         structure compdata space.                      18937200
         DS    1CL0002   Reserved                                       18938400
COMPSTROBJMAPIDXEMCMINOBJID DS 1FL4 Minimum object identifier of the   *18939600
                         event monitor control object map entries       18940800
COMPSTROBJMAPIDXEMCMAXOBJID DS 1FL4 Maximum object identifier of the   *18942000
                         event monitor control object map entries       18943200
COMPSTROBJMAPIDXTOTALNUMEMC DS 1FL4 Total number of event monitor      *18944400
                         control object map entries in this compdata   *18945600
                         space                                          18946800
KCOMPSTROBJMAPINDEX_LEN EQU 92 Length of CompStrObjMapIndex             18948000
COMPSTROBJMAPINDEX_LEN EQU *-COMPSTROBJMAPINDEX                         18950000
.L000E   ANOP                                                           19000000
*                                                                       19050000
* ********************************************************************  19100000
* *                                                                  *  19150000
* *            Structure compdata space object map                   *  19200000
* *                                                                  *  19250000
* ********************************************************************  19300000
*                                                                       19350000
*                                                                       19400000
         AIF   ('&COMPSTROBJMAP' EQ 'NO').L0011                         19450000
         AIF   ('&DSECT' EQ 'YES').L0012                                19500000
         AIF   ('&COMPSTROBJMAP' NE 'YES').L0011                        19550000
COMPSTROBJMAP DS 0F      Object map contained in the structure         *19600000
                         compdata space                                 19650000
         AGO   .L0013                                                   19700000
.L0012   ANOP                                                           19750000
COMPSTROBJMAP DSECT      Object map contained in the structure         *19800000
                         compdata space                                 19850000
.L0013   ANOP                                                           19900000
COMPSTROBJMAPOBJID DS 1FL4 Object identifier                            19950000
COMPSTROBJMAPOBJTYPE DS 1FL2 Object type                                20000000
COMPSTROBJMAPFLAGS DS 0BL1 Flag byte                                    20050000
COMPSTROBJMAPSUMMARY EQU X'80' Indicates whether the summary option    *20100000
                         was specified for the object, If so, there    *20150000
                         will be no entry control, adjunct, or entry   *20200000
                         data for the object.                           20250000
COMPSTROBJMAPENTRYDATAREQUESTED EQU X'40' Indicates whether entry data *20300000
                         was requested for the given object             20350000
COMPSTROBJMAPADJREQUESTED EQU X'20' Indicates whether adjunct was      *20400000
                         requested for the given object                 20450000
COMPSTROBJMAPOBJDUMPED EQU X'10' Indicates that this object has been   *20500000
                         dumped. Note that this bit will NEVER be set  *20550000
                         in the dump - it is used ONLY for internal    *20600000
                         processing in the dump writing phase.          20650000
         ORG   COMPSTROBJMAPFLAGS+X'00000001'                           20700000
         DS    1CL0001                                                  20750000
COMPSTROBJMAPOBJHDRPTR DS 1AL4 Pointer to the object header into the   *20800000
                         object header compdata space                   20850000
         DS    1CL0002                                                  20900000
COMPSTROBJMAPOBJHDRNUMBER DS 1CL0002 Number, in EBCDIC, which          *20950000
                         indicates which object header compdata space  *21000000
                         the pointer pertains to                        21050000
         DS    1CL0008   Reserved                                       21100000
KCOMPSTROBJMAP_LEN EQU 24 Length of CompStrObjMap                       21125000
COMPSTROBJMAP_LEN EQU *-COMPSTROBJMAP                                   21150000
.L0011   ANOP                                                           21200000
*                                                                       21250000
* ********************************************************************  21300000
* *                                                                  *  21350000
* *     Format of the HASH TABLE compdata space - CFDxxyyH           *  21400000
* *                                                                  *  21450000
* ********************************************************************  21500000
*                                                                       21550000
*                                                                       21600000
         AIF   ('&COMPHASHTABLEHDR' EQ 'NO').L0014                      21650000
         AIF   ('&DSECT' EQ 'YES').L0015                                21700000
         AIF   ('&COMPHASHTABLEHDR' NE 'YES').L0014                     21750000
COMPHASHTABLEHDR DS 0F   Mapping for the hash table header              21800000
         AGO   .L0016                                                   21850000
.L0015   ANOP                                                           21900000
COMPHASHTABLEHDR DSECT   Mapping for the hash table header              21950000
.L0016   ANOP                                                           22000000
COMPHASHTABLENUMSLOTS DS 1FL4 Indicates the number of slots that are   *22050000
                         in the hash table                              22100000
COMPHASHTABLESLOTARRAY@ DS 0AL4 Pointer to the hash table slot array    22125000
COMPHASHTABLESLOTARRAYPTR DS 1AL4 Pointer to the hash table slot array  22150000
KCOMPHASHTABLEHDR_LEN EQU 8 Length of CompHashTableHdr                  22175000
COMPHASHTABLEHDR_LEN EQU *-COMPHASHTABLEHDR                             22200000
.L0014   ANOP                                                           22250000
         AIF   ('&COMPHASHSLOTARRAY' EQ 'NO').L0017                     22300000
         AIF   ('&DSECT' EQ 'YES').L0018                                22350000
         AIF   ('&COMPHASHSLOTARRAY' NE 'YES').L0017                    22400000
COMPHASHSLOTARRAY DS 0F  Mapping for the hash table                     22450000
         AGO   .L0019                                                   22500000
.L0018   ANOP                                                           22550000
COMPHASHSLOTARRAY DSECT   Mapping for the hash table                    22600000
.L0019   ANOP                                                           22650000
COMPHASHTABLESLOT DS 0CL0004                                            22700000
COMPHASHTABLEELEM@ DS 0AL4 Pointer to the first element on the list    *22720000
                         for the given hash table entry within the     *22740000
                         compdata space                                 22760000
COMPHASHTABLEELEMPTR DS 1AL4 Pointer to the first element on the list  *22780000
                         for the given hash table entry within the     *22800000
                         compdata space                                 22850000
KCOMPHASHTABLESLOT_LEN EQU 4 Length of CompHashTableSlot                22875000
COMPHASHSLOTARRAY_LEN EQU *-COMPHASHSLOTARRAY                           22900000
.L0017   ANOP                                                           22950000
         AIF   ('&COMPHASHELEM' EQ 'NO').L001A                          23000000
         AIF   ('&DSECT' EQ 'YES').L001B                                23050000
         AIF   ('&COMPHASHELEM' NE 'YES').L001A                         23100000
COMPHASHELEM DS 0F       Mapping for a hash table element               23150000
         AGO   .L001C                                                   23200000
.L001B   ANOP                                                           23250000
COMPHASHELEM DSECT       Mapping for a hash table element               23300000
.L001C   ANOP                                                           23350000
COMPHASHELEMFLAGS DS 0BL1 Flag byte                                     23400000
COMPHASHELEMBYNAME EQU X'80' Indicates that the hash element contains  *23450000
                         the name of the element                        23500000
COMPHASHELEMBYID EQU X'40' Indicates that the hash element contains    *23550000
                         the ID of the element                          23600000
COMPHASHELEMLAST EQU X'20' Indicates that the current hash table       *23650000
                         element is the last one on the list            23700000
         ORG   COMPHASHELEMFLAGS+X'00000001'                            23750000
         DS    1CL0001   Reserved                                       23800000
COMPHASHENTRYCNTLNUMBER DS 1CL0002 Number, in EBCDIC, which indicates  *23850000
                         which entry control compdata space the        *23900000
                         pointer pertains to                            23950000
COMPHASHELEMNAME DS 0CL0016 If the hash element is by name, contains   *24000000
                         the name of the element                        24050000
COMPHASHELEMID DS 1CL0012 IF the hash element is by ID, contains the   *24100000
                         ID of the element                              24150000
         DS    1CL0004   Reserved                                       24200000
COMPHASHENTRYCNTLPTR DS 1AL4 Pointer to the entry controls in the      *24250000
                         entry control compdata space                   24300000
KCOMPHASHELEM_LEN EQU 24 Length of CompHashElem                         24325000
COMPHASHELEM_LEN EQU *-COMPHASHELEM                                     24350000
.L001A   ANOP                                                           24400000
*                                                                       24450000
* ********************************************************************  24500000
* *                                                                  *  24550000
* *     Format of the ENTRY CONTROL compdata space - CFDxxyyC        *  24600000
* *                                                                  *  24650000
* ********************************************************************  24700000
*                                                                       24750000
*                                                                       24800000
         AIF   ('&COMPENTRYCNTL' EQ 'NO').L001D                         24850000
         AIF   ('&DSECT' EQ 'YES').L001E                                24900000
         AIF   ('&COMPENTRYCNTL' NE 'YES').L001D                        24950000
COMPENTRYCNTL DS 0F      Mapping of the information for one entry       25000000
         AGO   .L001F                                                   25050000
.L001E   ANOP                                                           25100000
COMPENTRYCNTL DSECT      Mapping of the information for one entry       25150000
.L001F   ANOP                                                           25200000
COMPENTRYCNTLHDR DS 0CL0024                                             25250000
COMPENTRYCNTLENTRYDATAPTR DS 1AL4 Pointer to the entry's entry data in *25300000
                         the entry data compdata space                  25350000
COMPENTRYCNTLFLAGS DS 0BL1                                              25400000
COMPENTRYCNTLEDATASERIALIZED EQU X'80' Indicates whether the entry     *25450000
                         data was dumped serialized. An ON setting     *25500000
                         indicates that the data was serialized         25550000
COMPENTRYCNTLADJSERIALIZED EQU X'40' Indicates whether the adjunct     *25600000
                         data was dumped serialized. An ON setting     *25650000
                         indicates that the data was serialized         25700000
         ORG   COMPENTRYCNTLFLAGS+X'00000001'                           25750000
         DS    1CL0001   Reserved                                       25800000
COMPENTRYCNTLENTRYDATANUMBER DS 1CL0002 Number, in EBCDIC, which       *25850000
                         indicates which entry data compdata space the *25900000
                         pointer pertains to                            25950000
COMPENTRYCNTLENTRYDATALEN DS 1FL4 Length of the entry data associated  *26000000
                         with this entry                                26050000
COMPENTRYCNTLADJPTR DS 1AL4 Pointer to the entry's adjunct data in the *26100000
                         adjunct compdata space                         26150000
         DS    1CL0002                                                  26200000
COMPENTRYCNTLADJNUMBER DS 1CL0002 Number, in EBCDIC, which indicates   *26250000
                         which adjunct compdata space the pointer      *26300000
                         pertains to                                    26350000
COMPENTRYCNTLPOSWTHINEKEY DS 1FL4 Indicates the position of the entry  *26400000
                         within the entrykey it has                     26450000
COMPENTRYCNTLINFO DS 0C  Control information for the current entry     *26500000
                         NOTE : This field is mapped by the DDil       *26550000
                         mapping in the IXLYDDIB macro if the          *26600000
                         structure is a list structure. This field is  *26650000
                         mapped by the DDic mapping in the IXLYDDIB    *26700000
                         macro if the structure is a cache structure.  *26750000
                         To obtain the length of this use the          *26800000
                         appropriate mappings and length constant in   *26850000
                         IXLYDDIB.                                      26900000
KCOMPENTRYCNTLHDR_LEN EQU 24 Length of CompEntryCntlHdr                 27800000
COMPENTRYCNTL_LEN EQU *-COMPENTRYCNTL                                   27850000
.L001D   ANOP                                                           27900000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 27950000
         AIF   ('&LIST' EQ 'YES').P4                                    28000000
.P3      ANOP                                                           28050000
         POP   PRINT                                                    28100000
.P4      ANOP                                                           28150000
.P_EXIT  ANOP                                                           28200000
         MEND                                                           28250000
**/ IXLYCOMP_2:;                                                        28300000
* %IXLYCOMP_INCLUDED = 'YES';                                           28350000
* %DCL ZCBPRINT CHAR EXT;                                               28400000
* %DEACTIVATE ZCBPRINT;                                                 28450000
* %DCL IXLYCOMP_LIST CHAR EXT;                                          28500000
* %DEACTIVATE IXLYCOMP_LIST;                                            28550000
* %IF IXLYCOMP_LIST ^= 'NO' &                                           28600000
*    ZCBPRINT ^= 'NO' %THEN                                             28650000
*   %GOTO IXLYCOMP_3;                                                   28700000
*   @LIST PUSH NOECHO;                                                  28750000
*   @LIST NOASSEMBLE NOECHO;                                            28800000
*   @LIST OFF C NOECHO;                                                 28850000
* %IXLYCOMP_3:;                                                         28900000
*/* Start of PL/X Source                                             */ 28950000
*                                                                       29000000
* %IF COMPDATA_NAME_ATTR = '' %THEN                                     29050000
*   %COMPDATA_NAME_ATTR = 'BASED';                                      29100000
*                                                                       29150000
* %IF COMPDATA_INDEX_ATTR = '' %THEN                                    29200000
*   %COMPDATA_INDEX_ATTR = 'BASED';                                     29250000
*                                                                       29300000
* %IF COMPDATA_STRTRL_ATTR = '' %THEN                                   29350000
*   %COMPDATA_STRTRL_ATTR = 'BASED';                                    29400000
*                                                                       29450000
* %IF COMPDATA_STR_ATTR = '' %THEN                                      29500000
*   %COMPDATA_STR_ATTR = 'BASED';                                       29550000
*                                                                       29600000
* %IF COMPDATA_STROBJMAPINDX_ATTR = '' %THEN                            29650000
*   %COMPDATA_STROBJMAPINDX_ATTR = 'BASED';                             29700000
*                                                                       29750000
* %IF COMPDATA_STROBJMAP_ATTR = '' %THEN                                29800000
*   %COMPDATA_STROBJMAP_ATTR = 'BASED';                                 29850000
*                                                                       29900000
* %IF COMPDATA_HASHTABLEHDR_ATTR = '' %THEN                             29950000
*   %COMPDATA_HASHTABLEHDR_ATTR = 'BASED';                              30000000
*                                                                       30050000
* %IF COMPDATA_HASHSLOT_ATTR = '' %THEN                                 30100000
*   %COMPDATA_HASHSLOT_ATTR = 'BASED';                                  30150000
*                                                                       30200000
* %IF COMPDATA_HASHELEM_ATTR = '' %THEN                                 30250000
*   %COMPDATA_HASHELEM_ATTR = 'BASED';                                  30300000
*                                                                       30350000
* %IF COMPDATA_ENTRYCNTL_ATTR = '' %THEN                                30400000
*   %COMPDATA_ENTRYCNTL_ATTR = 'BASED';                                 30450000
*                                                                       30500000
*/********************************************************************/ 30550000
*/*                                                                  */ 30600000
*/*     Format of the COMPDATA names                                 */ 30650000
*/*                                                                  */ 30700000
*/*  !!!! NOTE !!!!  The CompdataNameStrNum component of the         */ 30750000
*/*  compdata name is dependent on the position of the structure     */ 30800000
*/*  within the master index.  The number of the first               */ 30850000
*/*  structure is 1 and therefore the compdata names for that        */ 30900000
*/*  structure will be CFDxx01z.  The same follows for all the       */ 30950000
*/*  structures within the master index.                             */ 31000000
*/*                                                                  */ 31050000
*/*  The CompdataSpaceNumber portion of the name must begin at 00.   */ 31100000
*/*  If another compdata space of that type is necessary, the        */ 31150000
*/*  number will be 01, etc.                                         */ 31200000
*/*                                                                  */ 31250000
*/********************************************************************/ 31300000
*                                                                       31350000
*Dcl 1 CompdataName char(8) COMPDATA_NAME_ATTR,                         31400000
*      3 CompdataNameComponent char(3),  /* Indicates the component     31450000
*                                           prefix                   */ 31500000
*      3 CompdataSpaceNumber   char(2),  /* Nth compdata space          31550000
*                                           of a specific type.  The    31600000
*                                           first compdata space        31650000
*                                           should be numbered 00.   */ 31700000
*      3 CompdataNameStrNum    char(2),  /* Nth structure dumped     */ 31750000
*      3 CompdataNameType      char(1);  /* Type of compdata record  */ 31800000
*                                                                       31850000
*Dcl KCompDataName_Len fixed(31)                                        31875000
*         Constant(Length(CompDataName)); /* Length of CompDataName     31900000
*                                                               @P1M*/  31925000
*                                                                       31950000
*/********************************************************************/ 32000000
*/*                                                                  */ 32050000
*/* Constants defined for use in the Compdata name                   */ 32100000
*/*                                                                  */ 32150000
*/********************************************************************/ 32200000
*                                                                       32250000
*Dcl CompDataComponent char(3)                                          32300000
*               constant('CFD');      /* Used to fill in the component  32350000
*                                       section of the compdata name */ 32400000
*                                                                       32450000
*Dcl CompdataTypeStr char(1)                                            32700000
*                  constant('S');     /* Structure type compdata     */ 32750000
*                                                                       32760000
*Dcl CompdataTypeIndex char(8)                                          32770000
*               constant('CFD0000I'); /* Name of the master index       32780000
*                                        in the dump                 */ 32790000
*Dcl CompdataTypeObj char(1)                                            32800000
*                  constant('O');     /* Object header type compdata */ 32850000
*Dcl CompdataTypeHash char(1)                                           32900000
*                  constant('H');     /* Hash table type compdata    */ 32950000
*Dcl CompdataTypeEntryCntl char(1)                                      33000000
*                  constant('C');     /* Entry control information      33050000
*                                        type compdata               */ 33100000
*Dcl CompdataTypeEntryData char(1)                                      33150000
*                  constant('D');     /* Entry data type compdata    */ 33200000
*Dcl CompdataTypeAdj char(1)                                            33250000
*                  constant('A');     /* Adjunct data type compdata  */ 33300000
*Dcl CompdataTypeLock char(1)                                           33350000
*                  constant('L');     /* Lock table type compdata    */ 33400000
*Dcl CompdataTypeUser char(1)                                           33450000
*                  constant('U');     /* User control type compdata  */ 33500000
*Dcl CompdataTypeEmc  char(1)                                           33507100
*                  constant('E');     /* Event monitor control type     33514200
*                                        compdata                @01A*/ 33521300
*Dcl CompdataTypeEventQ char(1)                                         33528400
*                  constant('Q');     /* Event queue control type       33535500
*                                        compdata                @01A*/ 33542600
*                                                                       33550000
*                                                                       33600000
*                                                                       33650000
*/********************************************************************/ 33700000
*/*                                                                  */ 33750000
*/*     Format of the master index compdata space - CFD0000I         */ 33800000
*/*                                                                  */ 33850000
*/*  NOTE: The CompIndex records in the master index compdata space  */ 33900000
*/*        must fit evenly into a 4K record.                         */ 33950000
*/*                                                                  */ 34000000
*/********************************************************************/ 34050000
*                                                                       34100000
*                                                                       34150000
*Dcl 1 CompIndex COMPDATA_INDEX_ATTR,         /* There will be one      34200000
*                                                CompIndex type entry   34250000
*                                                in the master index    34300000
*                                                compdata space for     34350000
*                                                every structure in the 34400000
*                                                dump                */ 34450000
*       3 CompIndexStrname         char(16),  /* Name of the            34500000
*                                                structure           */ 34550000
*       3 CompIndexStrDumpID       fixed(16), /* Structure Dump ID      34587500
*                                                                @D2A*/ 34625000
*       3 *                        Char(2),   /* Reserved        @D2A*/ 34662500
*       3 CompIndexConname         char(16),  /* Conname used in        34700000
*                                                requesting the dump */ 34750000
*       3 CompIndexStrType         fixed(8),  /* Structure type      */ 34800000
*       3 CompIndexUIDL            fixed(8),  /* User identifier limit  34825000
*                                                (UIDL)                 34850000
*                                                used to determine      34875000
*                                                the size of the list   34900000
*                                                number controls for a  34950000
*                                                list structure.  This  35000000
*                                                field will be 0 for a  35050000
*                                                cache structure     */ 35100000
*       3 CompIndexStr#Ebcdic      char(2),   /* Structure number in    35150000
*                                                EBCDIC              */ 35200000
*         5 CompIndexStrNumEbcdic    char(2),   /* Structure number in  35216600
*                                                EBCDIC          @P3A*/ 35233200
*       3 CompIndexHdwNd           char(32),  /* Node element           35250000
*                                                descriptor          */ 35300000
*       3 CompIndexLockTblEntLen   fixed(32), /* Length of the lock     35350000
*                                                table entries          35400000
*                                                associated with this   35450000
*                                                structure           */ 35500000
*       3 CompIndexStrTrlPtr       ptr(31),   /* Pointer to the         35550000
*                                                structure trailer      35600000
*                                                associated with this   35650000
*                                                structure           */ 35700000
*       3 CompIndexNoDumpRsn       fixed(32), /* Reason why the         35750000
*                                                structure was not      35800000
*                                                dumped - the no dump   35850000
*                                                reason codes are       35900000
*                                                defined in the         35950000
*                                                IXLYSTRC mapping    */ 36000000
*       3 CompIndexFlags bit(8),              /* Master index flags  */ 36050000
*         5 CompIndexLastStr       bit(1),    /* Indicates that this    36100000
*                                                is the last            36150000
*                                                entry in the           36200000
*                                                master index        */ 36250000
*         5 CompIndexConNotFound   bit(1),    /* Indicates that the     36300000
*                                                conname or contoken    36350000
*                                                specified for a cache  36400000
*                                                structure was not      36450000
*                                                found in the policy */ 36500000
*         5 CompIndexStrInRebld    bit(1),    /* Indicates that the     36505000
*                                                the structure is in    36510000
*                                                the process of rebuild 36515000
*                                                                @D3A*/ 36520000
*         5 CompIndexRebldOldStr   bit(1), /* Indicates that the        36525000
*                                            structure information      36530000
*                                            pertains to the OLD        36535000
*                                            structure                  36540000
*                                            NOTE: Bit is only valid if 36545000
*                                            the CompIndexStrInRebld    36550000
*                                            bit is set          @D3A*/ 36555000
*         5 CompIndexRebldNewStr   bit(1), /* Indicates that the        36560000
*                                            structure information      36565000
*                                            pertains to the NEW        36570000
*                                            structure                  36575000
*                                            NOTE: Bit is only valid if 36580000
*                                            the CompIndexStrInRebld    36585000
*                                            bit is set          @D3A*/ 36590000
*         5 CompIndexRebldDuplexStr bit(1),/* ON indicates the          36590900
*                                            structure rebuild is a     36591800
*                                            duplexing rebuild. OFF     36592700
*                                            indicates the structure    36593600
*                                            rebuild is a normal        36594500
*                                            rebuild.                   36595400
*                                            NOTE: Bit is only valid if 36596300
*                                            the CompIndexStrInRebld    36597200
*                                            bit is set          @03A*/ 36598100
*         5 CompIndexRebldMethodStr bit(1),/* ON indicates the          36598200
*                                            structure rebuild is       36598300
*                                            system managed. OFF        36598400
*                                            indicates the structure    36598500
*                                            rebuild is user managed.   36598600
*                                            NOTE: Bit is only valid if 36598700
*                                            the CompIndexStrInRebld    36598800
*                                            bit is set          @L2A*/ 36598900
*         5 *                      bit(1),    /* Reserved        @L2C*/ 36599000
*       3 *                        char(1),   /* Reserved            */ 36600000
*       3 CompIndexConID           fixed(16), /* Connection ID       */ 36650000
*       3 CompIndexCfName          char(8),   /* Facility name   @D4C*/ 36687500
*       3 CompIndexIncidentToken   char(32),  /* Incident Token  @L1C*/ 36725000
*       3 CompIndexCflevel         fixed(32), /* Coupling facility      36731600
*                                             operational level of the  36738200
*                                             facility in which the     36744800
*                                             structure is allocated    36751400
*                                                                @P2A*/ 36758000
*       3 *                        char(124); /* Reserved        @P2C*/ 36764600
* Dcl                                                                   36771800
*    KCompIndex_Len fixed(31)                                           36781100
*         Constant(Length(CompIndex));    /* Length of CompIndex @P1M*/ 36790400
*                                                                       36800000
*/********************************************************************/ 36850000
*/*                                                                  */ 36900000
*/*     Structure Trailer                                            */ 36950000
*/*                                                                  */ 37000000
*/*  NOTE: The Structure Trailer is part of the Master Index compdata*/ 37050000
*/*        space                                                     */ 37100000
*/*                                                                  */ 37150000
*/********************************************************************/ 37200000
*                                                                       37250000
*Dcl 1 CompStrTrl char(4096) COMPDATA_STRTRL_ATTR bdy(word), /* There   37300000
*                                                will be a structure    37350000
*                                                trailer for each       37400000
*                                                structure that is      37450000
*                                                dumped (unless the     37500000
*                                                dump dataset fills or  37550000
*                                                an I/O error occurs    37600000
*                                                while the structure is 37650000
*                                                being dumped)       */ 37700000
*       3 CompStrTrlDumpRsn        fixed(32), /* Reason for an          37750000
*                                                incomplete dump of     37800000
*                                                the structure - the    37850000
*                                                dump reason codes are  37900000
*                                                defined in the         37950000
*                                                IXLYSTRC mapping    */ 38000000
*       3 CompStrTrlObjIdIncomplete fixed(32), /* Object identifier of  38050000
*                                                object that is         38100000
*                                                incomplete          */ 38150000
*       3 CompStrTrlDotIncomplete  fixed(16), /* Dumping object type    38200000
*                                                of object that is      38250000
*                                                incomplete          */ 38300000
*       3 CompStrTrlFlags bit(8),             /* Structure trailer      38350000
*                                                flags               */ 38400000
*         5 CompStrTrlLockDumped   bit(1),    /* Indicates that some    38450000
*                                                lock table entries     38500000
*                                                were dumped for this   38550000
*                                                structure           */ 38600000
*         5 CompStrTrlUserDumped   bit(1),    /* Indicates that some    38650000
*                                                user controls were     38700000
*                                                dumped for this        38750000
*                                                structure           */ 38800000
*         5 *                     bit(6),     /* Reserved            */ 38850000
*       3 *                        char(21);  /* Reserved            */ 38900000
* Dcl                                                                   38912500
*    KCompStrTrl_Len fixed(31)                                          38925000
*         Constant(Length(CompStrTrl));  /* Length of CompStrTrl @P1M*/ 38937500
*/********************************************************************/ 38950000
*/*                                                                  */ 39000000
*/*     Format of the STRUCTURE compdata type - CFDxxyyS             */ 39050000
*/*                                                                  */ 39100000
*/* The structure compdata space consists of up to four items.  The  */ 39150000
*/* first item that appears is the structure compdata space header   */ 39200000
*/* (CompStrHdr).  The header consists of pointers to the dump       */ 39250000
*/* header and the object map index.                                 */ 39300000
*/*                                                                  */ 39350000
*/* The dump header consists of structure information.  It is mapped */ 39400000
*/* by the macro IHADWHDR                                            */ 39450000
*/*                                                                  */ 39500000
*/* The object map index (CompStrObjMapIndex) is an index into the   */ 39550000
*/* object map.  It contains pointers to the first object map entry  */ 39600000
*/* of each type within that structure compdata space.               */ 39650000
*/*                                                                  */ 39700000
*/* The object map (CompStrObjMap) is a directory to the object      */ 39750000
*/* header in the object compdata space.  Each object has its own    */ 39800000
*/* entry.  The object map entries are grouped by type and are       */ 39850000
*/* ordered by the object identifier (CompStrObjMapObjId).           */ 39900000
*/*                                                                  */ 39950000
*/********************************************************************/ 40000000
*/********************************************************************/ 40050000
*/*                                                                  */ 40100000
*/*            Structure compdata space header                       */ 40150000
*/*                                                                  */ 40200000
*/********************************************************************/ 40250000
*                                                                       40300000
*Dcl 1 CompStrHdr COMPDATA_STR_ATTR,   /* Header for the structure      40350000
*                                         compdata space.  There will   40400000
*                                         be a header in each           40450000
*                                         structure compdata space for  40500000
*                                         a structure                */ 40550000
*      3 CompStrHdrDumpHdr@  ptr(31),  /* Pointer to the dump header    40600000
*                                         for a given structure      */ 40650000
*        5 CompStrHdrDumpHdrPtr ptr(31), /* Pointer to the dump header  40675000
*                                         for a given structure  @P3A*/ 40700000
*      3 CompStrHdrObjMapIndex@ ptr(31),/* Pointer to the object map    40725000
*                                         index within the structure    40750000
*                                         compdata space.            */ 40800000
*        5 CompStrHdrObjMapIndexPtr ptr(31); /* Pointer to the object   40802500
*                                         map index within the          40805000
*                                         structure compdata space.     40807500
*                                                                @P3A*/ 40810000
* Dcl                                                                   40812500
*    KCompStrHdr_Len fixed(31)                                          40825000
*         Constant(Length(CompStrHdr));  /* Length of CompStrHdr @P1M*/ 40837500
*                                                                       40850000
*/********************************************************************/ 40900000
*/*                                                                  */ 40950000
*/*            Structure compdata space object map index             */ 41000000
*/*                                                                  */ 41050000
*/********************************************************************/ 41100000
*                                                                       41150000
* Dcl 1 CompStrObjMapIndex COMPDATA_STROBJMAPINDX_ATTR,                 41200000
*                                             /* Index by object type   41250000
*                                                in the object map.  */ 41300000
*       3 CompStrObjMapIdxListInfo,           /* Information associated 41350000
*                                                with list object       41400000
*                                                map entries         */ 41450000
*         5 CompStrObjMapIdxTypeList@   ptr(31), /* Pointer to the      41500000
*                                                beginning of the       41507100
*                                                listnum type object    41514200
*                                                map entries within the 41521300
*                                                structure compdata     41528400
*                                                space.              */ 41535500
*           7 CompStrObjMapIdxTypeListPtr ptr(31), /* Pointer to the    41542600
*                                                beginning of the       41550000
*                                                listnum type object    41600000
*                                                map entries within the 41650000
*                                                structure compdata     41700000
*                                                space.          @P3A*/ 41750000
*         5 CompStrObjMapIdxListMinObjID fixed(32), /* Minimum object   41800000
*                                                identifier of the      41850000
*                                                listnum                41900000
*                                                object map entries  */ 41950000
*         5 CompStrObjMapIdxListMaxObjID fixed(32), /* Maximum object   42000000
*                                                identifier of the      42050000
*                                                listnum                42100000
*                                                object map entries  */ 42150000
*         5 CompStrObjMapIdxTotalNumLst  fixed(32), /* Total number of  42200000
*                                                list number            42250000
*                                                object map entries     42300000
*                                                in this                42350000
*                                                compdata space      */ 42400000
*       3 CompStrObjMapIdxStgCInfo,           /* Information associated 42450000
*                                                with the storage class 42500000
*                                                object map entries  */ 42550000
*         5 CompStrObjMapIdxTypeStgClass@  ptr(31), /* Pointer to the   42600000
*                                                beginning of the       42650000
*                                                storage class type     42700000
*                                                object map entries  */ 42750000
*           7 CompStrObjMapIdxTypeStgClassPtr ptr(31), /* Pointer to    42758300
*                                                the beginning of the   42766600
*                                                storage class type     42774900
*                                                object map entries     42783200
*                                                                @P3A*/ 42791500
*         5 CompStrObjMapIdxStgCMinObjID fixed(32), /* Minimum object   42800000
*                                                identifier of the      42850000
*                                                storage class          42900000
*                                                object map entries  */ 42950000
*         5 CompStrObjMapIdxStgCMaxObjID fixed(32), /* Maximum object   43000000
*                                                identifier of the      43050000
*                                                storage class          43100000
*                                                object map entries  */ 43150000
*         5 CompStrObjMapIdxTotalNumStg  fixed(32), /* Total number of  43200000
*                                                Storage class          43250000
*                                                object map entries     43300000
*                                                in this                43350000
*                                                compdata space      */ 43400000
*       3 CompStrObjMapIdxCOCInfo,            /* Information associated 43450000
*                                                with the castout class 43500000
*                                                object map entries  */ 43550000
*         5 CompStrObjMapIdxTypeCOClass@   ptr(31), /* Pointer to the   43600000
*                                                beginning of the       43650000
*                                                castout class type     43700000
*                                                object map entries  */ 43750000
*           7 CompStrObjMapIdxTypeCOClassPtr ptr(31), /* Pointer to the 43758300
*                                                beginning of the       43766600
*                                                castout class type     43774900
*                                                object map entries     43783200
*                                                                @P3A*/ 43791500
*         5 CompStrObjMapIdxCOCMinObjID fixed(32), /* Minimum object    43800000
*                                                identifier of the      43850000
*                                                castout class          43900000
*                                                object map entries  */ 43950000
*         5 CompStrObjMapIdxCOCMaxObjID fixed(32), /* Maximum object    44000000
*                                                identifier of the      44050000
*                                                castout class          44100000
*                                                object map entries  */ 44150000
*         5 CompStrObjMapIdxTotalNumCOC  fixed(32), /* Total number of  44200000
*                                                castout class          44250000
*                                                object map entries     44300000
*                                                in this                44350000
*                                                compdata space      */ 44400000
*       3 CompStrObjMapIdxTypeLockTbl@   ptr(31), /* Pointer to the     44450000
*                                                lock table type object 44500000
*                                                map entries         */ 44550000
*         5 CompStrObjMapIdxTypeLockTblPtr ptr(31), /* Pointer to the   44570000
*                                                lock table type object 44590000
*                                                map entries     @P3A*/ 44610000
*       3 CompStrObjMapIdxTypeUser@      ptr(31), /* Pointer to the     44630000
*                                                user control type      44650000
*                                                object map entries  */ 44700000
*         5 CompStrObjMapIdxTypeUserPtr    ptr(31), /* Pointer to the   44700100
*                                                user control type      44700200
*                                                object map entries     44700300
*                                                                @P3A*/ 44700400
*       3 CompStrObjMapIdxEventQInfo,         /* Information associated 44700500
*                                                with event queue       44700600
*                                                control object map     44700700
*                                                entries         @01A*/ 44700800
*         5 CompStrObjMapIdxTypeEventQ@ ptr(31), /* Pointer to the      44700900
*                                                beginning of the event 44701000
*                                                queue control type     44701100
*                                                object map entries     44701200
*                                                within the structure   44701300
*                                                compdata space. @01A*/ 44701400
*           7 CompStrObjMapIdxTypeEventQPtr ptr(31), /* Pointer to the  44701500
*                                                beginning of the event 44701600
*                                                queue control type     44701700
*                                                object map entries     44701800
*                                                within the structure   44701900
*                                                compdata space. @P3C*/ 44702000
*         5 CompStrObjMapIdxEventQMinObjID fixed(32), /* Minimum object 44702100
*                                                identifier of the      44702200
*                                                event queue control    44702300
*                                                object map entries     44702400
*                                                                @01A*/ 44702500
*         5 CompStrObjMapIdxEventQMaxObjID fixed(32), /* Maximum object 44702600
*                                                identifier of the      44702700
*                                                event queue control    44702800
*                                                object map entries     44702900
*                                                                @01A*/ 44703000
*         5 CompStrObjMapIdxTotalNumEventQ fixed(32), /* Total number   44703100
*                                                of event queue control 44703200
*                                                object map entries in  44703300
*                                                this compdata space    44703400
*                                                                @01A*/ 44703500
*       3 CompStrObjMapIdxEMCInfo,            /* Information associated 44703600
*                                                with event monitor     44703700
*                                                control object map     44703800
*                                                entries         @01A*/ 44703900
*         5 CompStrObjMapIdxTypeEMC@    ptr(31), /* Pointer to the      44704000
*                                                beginning of the event 44704100
*                                                monitor control type   44704200
*                                                object map entries     44704300
*                                                within the structure   44704400
*                                                compdata space. @01A*/ 44704500
*           7 CompStrObjMapIdxTypeEMCPtr  ptr(31), /* Pointer to the    44704600
*                                                beginning of the event 44704700
*                                                monitor control type   44704800
*                                                object map entries     44704900
*                                                within the structure   44705000
*                                                compdata space. @P3C*/ 44705100
*         5 CompStrObjMapIdxTypeEMCNum char(2),  /* Compdata space      44705200
*                                                number of the pointer  44705300
*                                                to the beginning of    44705400
*                                                the event monitor      44705500
*                                                control type object    44705600
*                                                map entries within the 44705700
*                                                structure compdata     44705800
*                                                space.          @01A*/ 44705900
*         5 * char(2),                           /* Reserved     @01A*/ 44706000
*         5 CompStrObjMapIdxEMCMinObjID fixed(32), /* Minimum object    44706100
*                                                identifier of the      44706200
*                                                event monitor control  44706300
*                                                object map entries     44706400
*                                                                @01A*/ 44706500
*         5 CompStrObjMapIdxEMCMaxObjID fixed(32), /* Maximum object    44706600
*                                                identifier of the      44706700
*                                                event monitor control  44706800
*                                                object map entries     44706900
*                                                                @01A*/ 44707000
*         5 CompStrObjMapIdxTotalNumEMC fixed(32); /* Total number of   44707100
*                                                event monitor control  44707200
*                                                object map entries in  44707300
*                                                this compdata space    44707400
*                                                                @01A*/ 44707500
* DCL                                                                   44710000
*    KCompStrObjMapIndex_Len fixed(31)                                  44720000
*         Constant(Length(CompStrObjMapIndex)); /* Length of            44730000
*                                             CompStrObjMapIndex @P1M*/ 44740000
*                                                                       44750000
*/********************************************************************/ 44800000
*/*                                                                  */ 44850000
*/*            Structure compdata space object map                   */ 44900000
*/*                                                                  */ 44950000
*/********************************************************************/ 45000000
*                                                                       45050000
*Dcl 1 CompStrObjMap COMPDATA_STROBJMAP_ATTR, /* Object map contained   45100000
*                                                in the structure       45150000
*                                                compdata space      */ 45200000
*      3 CompStrObjMapObjId        fixed(32), /* Object identifier   */ 45250000
*      3 CompStrObjMapObjType      fixed(16), /* Object type         */ 45300000
*      3 CompStrObjMapFlags        bit(8),    /* Flag byte           */ 45350000
*        5 CompStrObjMapSummary      bit(1),  /* Indicates              45400000
*                                                whether the summary    45450000
*                                                option was specified   45500000
*                                                for the object, If so, 45550000
*                                                there will be no entry 45600000
*                                                control, adjunct,      45650000
*                                                or entry data for the  45700000
*                                                object.             */ 45750000
*        5 CompStrObjMapEntryDataRequested bit(1),/* Indicates whether  45800000
*                                                entry data was         45850000
*                                                requested for the      45900000
*                                                given object        */ 45950000
*        5 CompStrObjMapAdjRequested  bit(1),  /* Indicates whether     46000000
*                                                adjunct was requested  46050000
*                                                for the given          46100000
*                                                object              */ 46150000
*        5 CompStrObjMapObjDumped    bit(1),  /* Indicates that this    46200000
*                                                object has been        46250000
*                                                dumped.                46300000
*                                                Note that this         46350000
*                                                bit will               46400000
*                                                NEVER be set in the    46450000
*                                                dump - it is used ONLY 46500000
*                                                for internal           46550000
*                                                processing             46600000
*                                                in the dump writing    46650000
*                                                phase.              */ 46700000
*        5 *                         bit(4),  /* Reserved            */ 46750000
*      3 *                         char(1),                             46800000
*      3 CompStrObjMapObjHdrPtr    ptr(31),   /* Pointer to the         46850000
*                                                object header          46900000
*                                                into the               46950000
*                                                object header          47000000
*                                                compdata space      */ 47050000
*      3 * char(2),                                                     47100000
*      3 CompStrObjMapObjHdrNumber char(2),   /* Number, in EBCDIC,     47150000
*                                                which indicates        47200000
*                                                which object header    47250000
*                                                compdata space the     47300000
*                                                pointer pertains to */ 47350000
*      3 *                           char(8); /* Reserved            */ 47400000
* DCL                                                                   47410000
*    KCompStrObjMap_Len fixed(31)                                       47420000
*         Constant(Length(CompStrObjMap));/* Length of CompStrObjMap    47430000
*                                                               @P1M*/  47440000
*                                                                       47450000
*/********************************************************************/ 47500000
*/*                                                                  */ 47550000
*/*     Format of the HASH TABLE compdata space - CFDxxyyH           */ 47600000
*/*                                                                  */ 47650000
*/********************************************************************/ 47700000
*                                                                       47750000
* Dcl 1 CompHashTableHdr COMPDATA_HASHTABLEHDR_ATTR,                    47800000
*                                            /* Mapping for the hash    47850000
*                                               table header         */ 47900000
*         5 CompHashTableNumSlots fixed(31), /* Indicates the number    47950000
*                                               of slots that are       48000000
*                                               in the hash table    */ 48050000
*         5 CompHashTableSlotArray@  ptr(31),/* Pointer to the hash     48100000
*                                               table slot array     */ 48150000
*           7 CompHashTableSlotArrayPtr ptr(31),/* Pointer to the hash  48166600
*                                               table slot array @P3A*/ 48183200
*       3 *              char(0) bdy(word);  /* Ensure that the length  48200000
*                                               of the hash table       48250000
*                                               header is evenly        48300000
*                                               divisible by four       48350000
*                                               bytes.               */ 48400000
* Dcl                                                                   48430000
*    KCompHashTableHdr_Len fixed(31)                                    48460000
*         Constant(Length(CompHashTableHdr));/* Length of               48490000
*                                          CompHashTableHdr     @P1M*/  48520000
*                                                                       48550000
* Dcl 1 CompHashSlotArray COMPDATA_HASHSLOT_ATTR, /* Mapping for        48600000
*                                               the hash table       */ 48650000
*       3 CompHashTableSlot(*),                                         48700000
*           7 CompHashTableElem@     ptr(31),/* Pointer to the first    48750000
*                                               element on the list     48800000
*                                               for the given hash      48850000
*                                               table entry within the  48900000
*                                               compdata space       */ 48950000
*             9 CompHashTableElemPtr   ptr(31),/* Pointer to the first  48958300
*                                               element on the list     48966600
*                                               for the given hash      48974900
*                                               table entry within the  48983200
*                                               compdata space   @P3A*/ 48991500
*         5 *              char(0) bdy(word);/* Ensure that the length  49000000
*                                               of a hash table slot is 49050000
*                                               evenly divisible by     49100000
*                                               four bytes.          */ 49150000
*                                                                       49350000
* DCL CompHashTableSlotElem@ ptr(31) BASED; /* Used to map over the     49400000
*                                              contents of a particular 49450000
*                                              slot in the hash table   49500000
*                                              slot array            */ 49550000
* DCL CompHashTableSlotElemPtr ptr(31) BASED; /* Used to map over the   49552000
*                                              contents of a particular 49554000
*                                              slot in the hash table   49556000
*                                              slot array        @P3A*/ 49558000
* Dcl                                                                   49560000
*    KCompHashTableSlot_Len fixed(31)                                   49570000
*         Constant(Length(CompHashTableSlot));/*  Length of             49580000
*                                           CompHashTableSlot    @P1M*/ 49590000
*                                                                       49600000
* Dcl 1 CompHashElem COMPDATA_HASHELEM_ATTR, /* Mapping for a hash      49650000
*                                              table element         */ 49700000
*       3 CompHashElemFlags      bit(8),    /* Flag byte             */ 49750000
*         5 CompHashElemByName   bit(1),    /* Indicates that the       49800000
*                                              hash element contains    49850000
*                                              the name of the          49900000
*                                              element               */ 49950000
*         5 CompHashElemByID     bit(1),    /* Indicates that the       50000000
*                                              hash element contains    50050000
*                                              the ID of the element */ 50100000
*         5 CompHashElemLast     bit(1),    /* Indicates that the       50150000
*                                              current hash table       50200000
*                                              element is the last      50250000
*                                              one on the list       */ 50300000
*         5 *                    bit(5),    /* Reserved              */ 50350000
*       3 *                      char(1),   /* Reserved              */ 50400000
*       3 CompHashEntryCntlNumber char(2),  /* Number, in EBCDIC, which 50450000
*                                              indicates which entry    50500000
*                                              control compdata space   50550000
*                                              the pointer pertains to  50600000
*                                                                    */ 50650000
*       3 CompHashElemName       char(16),  /* If the hash element is   50700000
*                                              by name, contains the    50750000
*                                              name of the element   */ 50800000
*         5 CompHashElemID       char(12),  /* IF the hash element is   50850000
*                                              by ID, contains the      50900000
*                                              ID of the element     */ 50950000
*         5 *                    char(4),   /* Reserved              */ 51000000
*       3 CompHashEntryCntlPtr   ptr(31);   /* Pointer to the entry     51050000
*                                              controls in the entry    51100000
*                                              control compdata         51150000
*                                              space                 */ 51200000
*  Dcl                                                                  51220000
*    KCompHashElem_Len fixed(31)                                        51240000
*         Constant(Length(CompHashElem)); /* Length of CompHashElem     51260000
*                                                                @P1M*/ 51280000
*                                                                       51300000
*/********************************************************************/ 51350000
*/*                                                                  */ 51400000
*/*     Format of the ENTRY CONTROL compdata space - CFDxxyyC        */ 51450000
*/*                                                                  */ 51500000
*/********************************************************************/ 51550000
*                                                                       51600000
*Dcl 1 CompEntryCntl COMPDATA_ENTRYCNTL_ATTR,     /* Mapping of the     51650000
*                                                   information for     51700000
*                                                   one entry        */ 51750000
*     3 CompEntryCntlHdr,                                               51800000
*      5 CompEntryCntlEntryDataPtr     ptr(31),  /* Pointer to the      51850000
*                                                   entry's entry       51900000
*                                                   data in the         51950000
*                                                   entry data          52000000
*                                                   compdata space   */ 52050000
*      5 CompEntryCntlFlags             bit(8),                         52100000
*        7 CompEntryCntlEDataSerialized bit(1), /* Indicates whether    52150000
*                                                   the entry data      52200000
*                                                   was dumped          52250000
*                                                   serialized.  An     52300000
*                                                   ON setting          52350000
*                                                   indicates that      52400000
*                                                   the data was        52450000
*                                                   serialized       */ 52500000
*        7 CompEntryCntlAdjSerialized bit(1),   /* Indicates whether    52550000
*                                                   the adjunct data    52600000
*                                                   was dumped          52650000
*                                                   serialized.  An     52700000
*                                                   ON setting          52750000
*                                                   indicates that      52800000
*                                                   the data was        52850000
*                                                   serialized       */ 52900000
*        7 *                           bit(6),   /* Reserved         */ 52950000
*      5 *                             char(1),  /* Reserved         */ 53000000
*      5 CompEntryCntlEntryDataNumber  char(2),  /* Number, in EBCDIC,  53050000
*                                                   which indicates     53100000
*                                                   which entry data    53150000
*                                                   compdata space the  53200000
*                                                   pointer pertains to 53250000
*                                                                    */ 53300000
*      5 CompEntryCntlEntryDataLen     fixed(32),/* Length of the       53350000
*                                                   entry data          53400000
*                                                   associated with     53450000
*                                                   this entry       */ 53500000
*      5 CompEntryCntlAdjPtr           ptr(31),  /* Pointer to the      53550000
*                                                   entry's adjunct     53600000
*                                                   data in the         53650000
*                                                   adjunct compdata    53700000
*                                                   space            */ 53750000
*      5 *                             char(2),                         53800000
*      5 CompEntryCntlAdjNumber        char(2),  /* Number, in EBCDIC,  53850000
*                                                   which indicates     53900000
*                                                   which adjunct       53950000
*                                                   compdata space the  54000000
*                                                   pointer pertains to 54050000
*                                                                    */ 54100000
*       5 CompEntryCntlPosWthinEkey    fixed(32),/* Indicates the       54150000
*                                                   position of the     54200000
*                                                   entry within the    54250000
*                                                   entrykey it has */  54300000
*     3 CompEntryCntlInfo              char(*);  /* Control             54350000
*                                                   information for the 54400000
*                                                   current entry       54450000
*                                                   NOTE : This field   54500000
*                                                   is mapped by the    54550000
*                                                   DDil mapping in     54600000
*                                                   the IXLYDDIB macro  54650000
*                                                   if the structure is 54700000
*                                                   a list structure.   54750000
*                                                   This field is       54800000
*                                                   mapped by the DDic  54850000
*                                                   mapping in the      54900000
*                                                   IXLYDDIB macro if   54950000
*                                                   the structure is    55000000
*                                                   a cache structure.  55050000
*                                                   To obtain the       55100000
*                                                   length of this      55150000
*                                                   use the appropriate 55200000
*                                                   mappings and        55250000
*                                                   length constant in  55300000
*                                                   IXLYDDIB.        */ 55350000
*                                                                       55400000
* Dcl                                                                   55410000
*    KCompEntryCntlHdr_Len fixed(31)                                    55420000
*         Constant(Length(CompEntryCntlHdr)); /*  Length                55430000
*                                            of CompEntryCntlHdr @P1M*/ 55440000
*/********************************************************************/ 55450000
*/*                                                                  */ 55500000
*/*     Length Constants for the COMPDATA mappings                   */ 55550000
*/*                                                                  */ 55600000
*/********************************************************************/ 55650000
*                                                                       55700000
*                                                                       57400000
*/* End of PL/X Source                                               */ 57450000
* %IF IXLYCOMP_LIST ^= 'NO' &                                           57500000
*    ZCBPRINT ^= 'NO' %THEN                                             57550000
*   %GOTO IXLYCOMP_4;                                                   57600000
*   @LIST POP NOECHO;                                                   57650000
* %IXLYCOMP_4:;                                                         57700000
* %END;                                                                 57750000
