*                                                                       00015700
* %DCL IXLYAMDA_INCLUDED CHAR EXT;                                      00031400
* %DEACTIVATE IXLYAMDA_INCLUDED;                                        00047100
* %IF IXLYAMDA_INCLUDED = '' %THEN                                      00062800
* %DO;                                                                  00078500
*/* Macro made bi-lingual on 00270. CBGEN compile date 00013         */ 00101190
*% /*                                                                   00109900
         MACRO                                                          00125600
         IXLYAMDA &DSECT=YES,&LIST=YES,&TITLE=YES,&IXLYAMDAREA=YES,    *00134300
               &IXLYAMDHD=COND,&IXLYAMDCF=COND,&IXLYAMDCF1=COND,       *00143000
               &IXLYAMDSLL=COND,&IXLYAMDSLL1=COND,&IXLYAMDSLC=COND,    *00151700
               &IXLYAMDSLC1=COND,&IXLYAMDCFMI=COND,                    *00160400
               &IXLYAMDCFMINFO=COND,&IXLYAMDSTRL=COND,                 *00169100
               &IXLYAMDSTRL1=COND,&IXLYAMDSTRC=COND,&IXLYAMDSTRC1=COND,*00177800
               &IXLYAMDSCSC=COND,&IXLYAMDSCSC1=COND,&IXLYAMDSCOC=COND, *00186500
               &IXLYAMDSCOCSTATS=COND,&IXLYAMDSC=COND,&IXLYAMDSC1=COND,*00192300
               &IXLYAMDSSCC=COND                                        00198100
         GBLC  &IXLYAMDA_INCLUDED                                       00204100
         GBLC  &ZCBPRINT                                                00219800
&IXLYAMDA_INCLUDED SETC 'YES'                                           00235500
         AIF   ('&LIST' EQ 'NONE').P0                                   00240700
         AIF   ('&TITLE' EQ 'NO').P5                                    00245900
 TITLE   'IXLYAMDA  - Accounting and Measurement Data Area            '*00251200
                                                                        00266900
.P5      ANOP                                                           00274700
**/ IXLYAMDA_1:;                                                        00282600
*/* START OF SPECIFICATIONS ******************************************* 00300000
*                                                                       00350000
*****PROPRIETARY_STATEMENT********************************************* 00356300
*                                                                     * 00362600
*01* PROPRIETARY STATEMENT=                                           * 00368900
*                                                                     * 00375200
*    Licensed Materials - Property of IBM                             * 00390900
*                                                                     * 00406700
*    "Restricted Materials of IBM"                                    * 00407700
*                                                                     * 00408700
*     5647-A01                                                        * 00409700
*                                                                     * 00410700
*    (C) COPYRIGHT IBM CORP. 1993, 2000                               * 00411700
*                                                                     * 00412700
*    US Government Users Restricted Rights - Use, duplication or      * 00413700
*    disclosure restricted by GSA ADP Schedule Contract with          * 00414700
*    IBM Corp.                                                        * 00415700
*                                                                     * 00416700
*    STATUS = FMID JBB6609                                            * 00418000
*                                                                     * 00419300
*****END_OF_PROPRIETARY_STATEMENT************************************** 00425600
*                                                                       00432500
*01* EXTERNAL CLASSIFICATION: GUPI                                      00436800
*01* END OF EXTERNAL CLASSIFICATION:                                    00441100
*                                                                       00445600
*01* DESCRIPTIVE NAME: Accounting and Measurement Data Area             00447700
*                                                                       00448400
*02*  ACRONYM:  AMDA                                                    00449100
*                                                                       00450000
*01* MACRO NAME: IXLYAMDA                                               00500000
*                                                                       00550000
*01* DSECT NAME:                                                        00600000
*     IXLYAMDAREA                                                       00650000
*     IXLYAMDCF                                                         00700000
*     IXLYAMDCF1                                                        00710000
*     IXLYAMDSLL                                                        00720000
*     IXLYAMDSLL1                                                       00730000
*     IXLYAMDSLC                                                        00740000
*     IXLYAMDSLC1                                                       00750000
*     IXLYAMDSTRL                                                       00760000
*     IXLYAMDSTRL1                                                      00770000
*     IXLYAMDSTRC                                                       00780000
*     IXLYAMDSTRC1                                                      00781100
*     IXLYAMDCFMI                                                       00782200
*     IXLYAMDCFMINFO                                                    00784400
*     IXLYAMDSCSC                                                       00786600
*     IXLYAMDSCSC1                                                      00789900
*     IXLYAMDSCOC                                                       00793200
*     IXLYAMDSCOCSTATS                                                  00796600
*     IXLYAMDSC                                                         00800000
*     IXLYAMDSC1                                                        00812500
*     IXLYAMDHD                                                         00825000
*     IXLYAMDSSCC                                          @L5A         00831200
*                                                                       00837500
*                                                                       00850000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 00916600
*                                                                       00950000
*01* EYE-CATCHER:  NONE                                                 00975000
*02*  OFFSET:  N/A                                                      01000000
*02*  LENGTH:  N/A                                                      01025000
*                                                                       01050000
*01* STORAGE ATTRIBUTES:                                                01055700
*                                                                       01061400
*02*  SUBPOOL: User-supplied                                            01067100
*02*  KEY: User-supplied                                                01072800
*02*  RESIDENCY: User-supplied                                          01078500
*                                                                       01084200
*01* SIZE: Variable                                                     01089900
*            IXLYAMDSSCC      -- X'0238' bytes                          01090100
*            IXLYAMDSLL1      -- X'00A4' bytes                          01090400
*            IXLYAMDSLC1      -- X'0040' bytes                          01090900
*            IXLYAMDSCSC1     -- X'00C0' bytes                          01091400
*            IXLYAMDAREA      -- X'0014' bytes                          01091900
*            IXLYAMDHD        -- X'000C' bytes                          01092400
*            IXLYAMDCF        -- X'0130' bytes                          01092900
*            IXLYAMDCF1       -- X'01B0' bytes                          01093400
*            IXLYAMDSLL       -- X'0024' bytes                          01093900
*            IXLYAMDSLC       -- X'0024' bytes                          01094400
*            IXLYAMDCFMI      -- X'0010' bytes                          01094900
*            IXLYAMDCFMINFO   -- X'0044' bytes                          01095400
*            IXLYAMDSTRL      -- X'0108' bytes                          01095900
*            IXLYAMDSTRL1     -- X'0188' bytes                          01096400
*            IXLYAMDSTRC      -- X'00F4' bytes                          01096900
*            IXLYAMDSTRC1     -- X'0174' bytes                          01097400
*            IXLYAMDSCSC      -- X'0078' bytes                          01097900
*            IXLYAMDSCOC      -- X'0010' bytes                          01098400
*            IXLYAMDSCOCSTATS -- X'0004' bytes                          01098900
*            IXLYAMDSC        -- X'0044' bytes                          01099400
*            IXLYAMDSC1       -- X'0080' bytes                          01099900
*       See declares                                                    01100400
*                                                                       01101300
*01* CREATED BY: IXLA1MG                                                01107000
*                                                                       01112700
*01* POINTED TO BY: DATAAREA_ADDR field in MG parameter list            01118400
*                                                                       01124100
*01* SERIALIZATION:                                                     01129800
*     None required                                                     01135500
*                                                                       01141200
*01* FUNCTION:                                                          01149100
*02*  Maps facility, structure, and subchannel accounting and           01157000
*     measurement data returned by the LFSS Measurement Gatherer        01164900
*     Service (IXLMG).                                                  01172800
*                                                                       01185300
*01* METHOD OF ACCESS:                                                  01186800
*02*  ASM:        IXLYAMDA                                              01192500
*                 DSECT=YES|NO  -- Request DSECT definition             01200000
*                 AREA=YES|NO  --  Request IXLYAMDAREA definition       01250000
*                 ENTRY=YES|NO --  Request IXLYAMDENTRY definition      01300000
*     Default: DSECT=YES                                                01350000
*                                                                       01375000
*02*  PL/AS: %INCLUDE SYSLIB(IXLYAMDA)                                  01400000
*                                                                       01500000
*01* DELETED BY: User                                                   01550000
*                                                                       01600000
*01* FREQUENCY: Created for response to IXLMG                           01650000
*                                                                       01700000
*01* DEPENDENCIES: None.                                                01750000
*                                                                       01800000
*01* NOTES:                                                             01806200
*                                                                       01812400
*       Note that the IXLYAMDAREA_VERSION field describes the level     01813800
*       of information contained in the IXLYAMDA mapping.  The level    01815200
*       of information cannot be greater than the maximum supported     01816600
*       CFLEVEL of the MVS system where IXLMG was invoked, so           01818000
*       IXLYAMDA_VERSION will equal the MAXCFLEVEL returned by          01819400
*       IXCQUERY.  Individual facilities may have a lower or higher     01820800
*       CFLEVEL than the MAXCFLEVEL understood by the MVS system.       01822200
*       In those cases, the level of information returned for the       01823600
*       specific facility or structure will be the lower of the         01825000
*       facility's CFLEVEL and the IXLYAMDA_VERSION.  Individual        01826400
*       fields include an indication of what CFLEVEL returns this       01827800
*       information.  (Example:  IXLYAMDSTRL_MREIPI indicates that      01829200
*       it is returned when the list structure is allocated in a        01830600
*       facility with CFLEVEL 4.  Therefore, the field only has         01832000
*       meaning when the IXLYAMDA_VERSION >= 4, and the CF where the    01833400
*       list structure is allocated has CFLEVEL>=4.)  Fields not        01834800
*       labeled in this way can be assumed to be returned at all        01836200
*       CFLEVELs, ie. at CFLEVEL 0 and above.                           01837600
*                                                                       01839000
*                                                                       01840400
*                                                                       01843400
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     01850000
*                                                                       01900000
*01* CHANGE ACTIVITY:                                                   01950000
*     $L0= SYSLKLAM HBB5510 910301 PD00FR: XES Initial Release          02000000
*     $L1= SYSLKLAM HBB5510 910923 PD00CD: Add architecture updates     02050000
*     $P1= PIG0981  HBB5510 930115 PD00DT: Add structure type contants  03156600
*     $P2= PIG1026  HBB5510 930202 PD00DT: Add subchannel status        03163200
*     $D1= DIG0101  HBB5510 930325 PD00DT: Add measurement information  03169800
*     $L2= SYSLKLAM HBB5510 930525 PD00DT: Add structure types          03176400
*     $P3= PIG5027  HBB5510 940105 PD00FR: Update descriptions          03177200
*     $P4= PIG5125  HBB5510 940207 PD00DT: Add Version number           03178000
*     $P5= PIG5158  HBB5510 940211 PD00FR: Castout Class Count defn     03178800
*     $P6= PIG5126  HBB5510 940201 PD00FR: CFLEVEL support              03179600
*     $P7= PIG5229  HBB5510 940331 PD00DT: Add Queue Total counts       03180400
*     $P8= PIG5178  HBB5510 940314 PD00DT: Performance                  03181200
*     $L3= DNXES    HBB5520 940414 PD00FR: XES Dynamic Reconfig         03182000
*     $L4= XESAC    HBB5520 940511 PD00FR: XES service/architecture     03182300
*                                          change                       03182600
*     $P9= PN70931  HBB5520 940616 PD00FR: Update descriptions          03182900
*     $D2= DN70083  HBB5520 940815 PD00EA: Update target descriptions   03183100
*     $PA= PN71955  HBB5520 941130 PD00DT: Update descriptions          03183200
*     $PB= PQC0939  HBB6603 960502 PD00DT: Add Rebuild information      03194300
*     $01= OW15589  HBB5520 950711 PD00BJ: Event monitor support        03199800
*     $02= OW24532  HBB5520 960711 PD00HV: Alter EMC support            03202600
*     $PC= PUX0505  HBB6605 970916 PD00HV: Fix prolog err from ow24532  03204000
*     $03= OW28460  HBB6603 960801 PDXM: User managed duplexing         03204700
*     $PD= PVT0195  HBB6603 971215 PDXM: UDF order queue support        03205000
*     $L5= AUTOR    HBB6608 980622 PDSL: System-managed (Auto)          03205100
*                                        rebuild support                03205200
*     $L6= DELNM   ,HBB6608,980716,PD00FR: Name class masks             03205300
*     $L7= AUTOR   ,HBB6608,980807,PDSL: System-managed (Auto)          03208100
*                                        rebuild support, con't.        03210900
*     $L8= AUTOR   ,HBB6608,980828,PD00GW: Auto Rebuild                 03211800
*     $PE= PWK0181 ,HBB6608 980821 PDSL: Flag CFLEVEL 8 fields          03212700
*     $PF= PWK0284 ,HBB6608 981102 PD00BN: Auto Rebuild updates         03213200
*     $04= OW28556  HBB6603 980430 PD00DT: Symphony support             03213300
*     $05= OW34698  HBB6601 980930 PD00DT: AMData sequence              03213400
*     $PG= PWK0652 ,HBB6608 990122 PD00BN: Comment mismatch             03213500
*     $L9= MQ      ,JBB6609,980902,PD00S7: MQ Series support            03213600
*     $06= OW43541  HBB6606 001006 PD00DT: Freeway Support              03213650
*                                                                       03213700
* END OF SPECIFICATIONS *********************************************/  03216600
*% /*                                                                   03266600
.P0      ANOP                                                           03291600
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03316600
         AIF   ('&LIST' EQ 'YES').P2                                    03366600
.P1      ANOP                                                           03416600
         PUSH  PRINT                                                    03466600
         PRINT OFF                                                      03516600
.P2      ANOP                                                           03566600
*                                                                       03616600
* ********************************************************************  03641600
* ****************** AMDA Header *************************************  03666600
* ********************************************************************  03691600
*                                                                       03716600
*                                                                       03766600
         AIF   ('&IXLYAMDAREA' EQ 'NO').L0002                           03816600
         AIF   ('&DSECT' EQ 'YES').L0003                                03866600
         AIF   ('&IXLYAMDAREA' NE 'YES').L0002                          03916600
IXLYAMDAREA DS 0F        Data area returned to caller                   03966600
         AGO   .L0004                                                   04016600
.L0003   ANOP                                                           04066600
IXLYAMDAREA DSECT        Data area returned to caller                   04116600
.L0004   ANOP                                                           04166600
IXLYAMDAREA_LENGTH DS 1FL4 Length of IXLYAMDAREA header mapping         04216600
IXLYAMDAREA_CFENT@ DS 1AL4 Address of first CF entry. A value of zero  *04266600
                         means that no CF entries were provided         04316600
IXLYAMDAREA_TLEN DS 1FL4 Total length of output data area needed to    *04366600
                         contain all the requested information. This   *04416600
                         length includes the area for the records that *04466600
                         WERE returned on this call.                    04516600
IXLYAMDAREA_#ENT DS 1FL4 Total number of entries of all kinds (not     *04566600
                         including the header)                          04616600
IXLYAMDAREA_VERSION DS 1FL1 Version number - Maximum CFLEVEL supported *04629900
                         by MVS on system where IXLMG was invoked. Can *04643200
                         be used to determine if specific fields have  *04656500
                         valid information. See notes in prolog for    *04669800
                         more information                               04683100
         DS    1CL0003   Unused                                         04696600
IXLYAMDAREA_LEN EQU *-IXLYAMDAREA                                       04716600
.L0002   ANOP                                                           04766600
*                                                                       04816600
* ********************************************************************  04841600
* *****  Mapping of portion of entry common to all entries  ****        04842200
* ********************************************************************  04842800
*                                                                       04843400
*                                                                       04844000
         AIF   ('&IXLYAMDHD' EQ 'NO').L0005                             04844600
         AIF   ('&DSECT' EQ 'YES').L0006                                04845200
         AIF   ('&IXLYAMDHD' NE 'YES').L0005                            04845800
IXLYAMDHD DS   0F        Common header mapping for IXLYAMDA entries     04846400
         AGO   .L0007                                                   04847000
.L0006   ANOP                                                           04847600
IXLYAMDHD DSECT          Common header mapping for IXLYAMDA entries     04848200
.L0007   ANOP                                                           04848800
IXLYAMDHD_TYPE DS 1BL1   Type of entry                                  04849400
         DS    1CL0003   Unused                                         04850000
IXLYAMDHD_LENGTH DS 1FL4 Length of entry                                04850600
IXLYAMDHD_NEXT DS 1AL4   Address of next entry.                         04851200
*                                                                       04851800
* ********************************************************************  04852400
* **************** Entry Types ********************************         04853000
* ********************************************************************  04853600
*                                                                       04854200
*                                                                       04854800
IXLYAMDA_TYPECF EQU X'10' Type for CF block                             04855400
IXLYAMDA_TYPESLL EQU X'11' Type for SLL block                           04856000
IXLYAMDA_TYPESLC EQU X'12' Type for SLC block                           04856600
IXLYAMDA_TYPECFMI EQU X'13' Type for CFMI block                         04857200
IXLYAMDA_TYPESTRL EQU X'21' Type for STRL block                         04857800
IXLYAMDA_TYPESTRC EQU X'22' Type for STRC block                         04858400
IXLYAMDA_TYPESCSC EQU X'23' Type for SCSC block                         04859000
IXLYAMDA_TYPESCOC EQU X'24' Type for SCOC block                         04859600
IXLYAMDA_TYPESSCC EQU X'25' Type for SSCC block                         04859900
IXLYAMDA_TYPESC EQU X'30' Type for SC block                             04860200
IXLYAMDHD_LEN EQU *-IXLYAMDHD                                           04860800
.L0005   ANOP                                                           04861400
*                                                                       04862000
* ********************************************************************  04862600
* ********************** Facility Entry  *****************************  04866600
* ********************************************************************  04891600
* ********************** Facility Entry ******************************  04916600
* ************************* Header ***********************************  04941600
*                                                                       04966600
*                                                                       05016600
         AIF   ('&IXLYAMDCF' EQ 'NO').L0008                             05066600
         AIF   ('&DSECT' EQ 'YES').L0009                                05116600
         AIF   ('&IXLYAMDCF' NE 'YES').L0008                            05166600
IXLYAMDCF DS   0F        Coupling Facility (CF) Entry                   05216600
         AGO   .L000A                                                   05266600
.L0009   ANOP                                                           05316600
IXLYAMDCF DSECT          Coupling Facility (CF) Entry                   05366600
.L000A   ANOP                                                           05416600
IXLYAMDCF_TYPE DS 1BL1   Indication of type of data X'10' indicates CF *05466600
                         entry                                          05516600
         DS    1CL0003   Unused                                         05566600
IXLYAMDCF_LENGTH DS 1FL4 Length of IXLYAMDCF entry mapping              05616600
IXLYAMDCF_CFNEXT DS 1AL4 Address of next CF entry. A value of 0        *05666600
                         indicates last entry.                          05716600
IXLYAMDCF_SL@ DS 1AL4    Address of first CF structure limits entry. A *05766600
                         value of 0 indicates last entry.               05816600
IXLYAMDCF_STR@ DS 1AL4   Address of first STR record for this CF. A    *05866600
                         value of zero means that no STR records were  *05916600
                         provided for this CF.                          05966600
IXLYAMDCF_SC@ DS 1AL4    Address of first subchannel entry for this    *06016600
                         CF. A value of zero means that no SC records  *06066600
                         were provided for this CF                      06116600
IXLYAMDCF_MI@ DS 1AL4    Address of the measurement information entry  *06129100
                         for this CF. a value of zero means that the   *06141600
                         MI record was not provided for this CF         06154100
*                                                                       06166600
* ********************** Facility Entry  *****************************  06216600
* *********************Configuration Data*****************************  06266600
*                                                                       06316600
*                                                                       06366600
IXLYAMDCF_CFID DS 1FL4   Facility ID number                             06416600
IXLYAMDCF_CFNAME DS 1CL0008 Facility Name                               06466600
IXLYAMDCF_ND DS 1CL0032  Hardware Node Descriptor for the facility.    *06499900
                         Mapped by IXLYNDE.                             06533200
         DS    1CL0002   Unused                                         06566600
IXLYAMDCF_SIDMAX DS 1FL2 Maximum SID value                              06616600
IXLYAMDCF_FLAGS DS 0BL1  Flags                                          06666600
IXLYAMDCF_CONNECTED EQU X'80' Connected = Managed + Available, which   *06679100
                         indicates operations can be allowed against   *06691600
                         the facility. If this bit is off the facility *06696600
                         control information returned will be from the *06701600
                         last time the facility was connected and may  *06706600
                         be downlevel.                                  06711600
IXLYAMDCF_MANAGED EQU X'40' The facility is in the XCF Policy and XCF  *06716600
                         wishes to use this facility                    06729100
IXLYAMDCF_AVAILABLE EQU X'20' This system has physical paths connected *06741600
                         to the facility                                06754100
IXLYAMDCF_VOLATILE EQU X'10' This facility's storage is volatile when  *06769700
                         this bit = 1 nonvolatile when this bit = 0     06785300
         ORG   IXLYAMDCF_FLAGS+X'00000001'                              06800900
         DS    1CL0003   Unused                                         06816600
IXLYAMDCF_PATHMASKS DS 0CL0008 Pathing masks currently in use           06823200
IXLYAMDCF_PHYSPM DS 1BL1 Physical path mask - paths which have a       *06829800
                         physical connection to the facility            06836400
IXLYAMDCF_VARYPM DS 1BL1 VARY path mask - paths which have a logical   *06843000
                         connection to the facility                     06849600
IXLYAMDCF_XCFPM DS 1BL1  XCF path mask - paths connected to the        *06856200
                         facility in the active policy                  06862800
IXLYAMDCF_COMPPM DS 1BL1 Composite path mask = PHYSPM + VARYPM + XCFPM  06869400
         DS    1CL0001   Unused                                         06876000
IXLYAMDCF_INVALID DS 1BL1 Invalid paths mask - paths not connected to  *06882600
                         correct facility                               06889200
IXLYAMDCF_NOTVALIDATED DS 1BL1 NotValidated paths mask -- paths not    *06895800
                         connected                                      06902400
         DS    1CL0001   Unused                                         06909000
IXLYAMDCF_SEQUENCE DS 1FL4 Sequence number. This sequence number is    *06916600
                         changed whenever a new "instance" of this     *06966600
                         entity comes into use                          07016600
IXLYAMDCF_CUID DS 1BL2   Control unit ID                                07066600
         DS    1CL0002   Unused                                         07116600
IXLYAMDCF_HWINFORMATION DS 1CL0064 Facility Hardware information        07141600
         DS    1CL0016   Unused                                         07166600
*                                                                       07216600
* ********************** Facility Entry  *****************************  07249900
* *************** Accounting and Measurement Data ********************  07283200
*                                                                       07316600
*                                                                       07366600
IXLYAMDCF_SUBCH_CONTENTION DS 1FL4 Count of times a free subchannel    *07416600
                         was not available for synchronous immediate   *07449900
                         operations                                     07483200
IXLYAMDCF_CONTENTIONTIME DS 1CL0008 Summed contention time for waiting *07516600
                         for subchannels to become free (u-sec) for    *07549900
                         synchronous immediate operations               07583200
IXLYAMDCF_CONTENTIONTIMESQR DS 1CL0008 Summed contention time for      *07616600
                         waiting for subchannels to become free (u-sec *07649900
                         squared) for synchronous immediate operations  07683200
IXLYAMDCF_SUBCH_ALLOCATED DS 1FL4 Count of number of subchannels that  *07716600
                         this facility has been allocated               07766600
IXLYAMDCF_SUBCH_INUSE DS 1FL4 Count of number of subchannels available *07816600
                         for use                                        07866600
IXLYAMDCF_SUBCH_MAXLIMIT DS 1FL4 Count of total number of subchannels  *07916600
                         that could be used for operations if          *07966600
                         available                                      08016600
IXLYAMDCF_STRUCTURE_COUNT DS 1FL4 Count of number of structures in use *08033200
                         by connectors from this system                 08049800
         DS    1CL0004   Unused                                         08091300
IXLYAMDCF_FAILEDOPTIMECOUNT DS 1FL4 Count of the number of summed      *08132800
                         times -- for unsuccessful operations           08149400
IXLYAMDCF_FAILEDOPSUMTIME DS 1CL0008 Summed service time of            *08166600
                         unsuccessful operations (u-sec)                08216600
IXLYAMDCF_FAILEDOPSUMTIMESQR DS 1CL0008 Square of the summed service   *08266600
                         time of unsuccessful operations (u-sec        *08306600
                         squared)                                       08346600
         DS    1CL0016   Unused                                         08386600
*                                                                       08426600
* ********************** Facility Entry  *****************************  08453200
* ******************* Control Information ****************************  08479800
*                                                                       08506600
*                                                                       08546600
IXLYAMDCF_TS DS 1FL4     Total facility space in 4K blocks. Facility   *08586600
                         space is made up of free space, dump space    *08626600
                         and structure space                            08666600
IXLYAMDCF_FS DS 1FL4     Total Free space in 4K blocks. Free Space =   *08706600
                         Free control space + free non-control space    08746600
IXLYAMDCF_TCS DS 1FL4    Total Control space in 4K blocks. Control     *08786600
                         space + non- control space = total space       08826600
IXLYAMDCF_FCS DS 1FL4    Total Free control space in 4K blocks          08866600
IXLYAMDCF_GDC DS 0CL0016 Global dumping controls                        08880800
IXLYAMDCF_TDS DS 1FL4    Total Dumping Space in 4K blocks. If TDS is   *08895000
                         lower than the MRDS then the dump space is    *08909200
                         not large enough to contain the largest       *08923400
                         structure that was dumped.                     08937600
IXLYAMDCF_FDS DS 1FL4    Free Dumping Space in 4K blocks. If FDS is    *08951800
                         smaller than the MRDS than there is not       *08966000
                         enough available dump space to contain the    *08980200
                         largest structure that was dumped.             08994400
IXLYAMDCF_ADTC DS 1FL4   Associated dump table count. If this count is *09008600
                         frequently more than one then multiple        *09022800
                         structures are being dumped at the same time   09037000
IXLYAMDCF_MRDS DS 1FL4   Maximum Requested Dumping Space in 4K blocks   09051200
IXLYAMDCF_MDX DS 1FL1    Largest Data Element size, where size in      *09066600
                         bytes is 256*(2**MDX)                          09116600
         DS    1CL0001                                                  09166600
IXLYAMDCF_STGI DS 1FL2   Storage increment in 4K blocks                 09216600
IXLYAMDCF_CFLEVEL DS 1FL4 Coupling facility architected function level  09249900
         DS    1CL0012   Unused                                         09283200
IXLYAMDCF_LEN EQU *-IXLYAMDCF                                           09316600
.L0008   ANOP                                                           09366600
         AIF   ('&IXLYAMDCF1' EQ 'NO').L000B                            09370400
         AIF   ('&DSECT' EQ 'YES').L000C                                09374200
         AIF   ('&IXLYAMDCF1' NE 'YES').L000B                           09378000
IXLYAMDCF1 DS  0X        Coupling Facility (CF) Entry, AmdaLevel1       09381800
         AGO   .L000D                                                   09385600
.L000C   ANOP                                                           09389400
IXLYAMDCF1 DSECT         Coupling Facility (CF) Entry, AmdaLevel1       09393200
.L000D   ANOP                                                           09397000
         DS    1CL0304   Mapped by IXLYAMDCF                            09400800
         DS    1CL0128   Reserved                                       09404600
IXLYAMDCF1_LEN EQU *-IXLYAMDCF1                                         09408400
.L000B   ANOP                                                           09412200
*                                                                       09416600
* ********************************************************************  09466600
* **************** List Structure Limits Entry************************  09516600
* ********************************************************************  09541600
* **************** List Structure Limits Entry************************  09566600
* *********************** Header *************************************  09591600
*                                                                       09616600
*                                                                       09666600
         AIF   ('&IXLYAMDSLL' EQ 'NO').L000E                            09716600
         AIF   ('&DSECT' EQ 'YES').L000F                                09766600
         AIF   ('&IXLYAMDSLL' NE 'YES').L000E                           09816600
IXLYAMDSLL DS  0F        Structure Limits for a List Structure (SLL)   *09866600
                         Entry                                          09916600
         AGO   .L0010                                                   09966600
.L000F   ANOP                                                           10016600
IXLYAMDSLL DSECT         Structure Limits for a List Structure (SLL)   *10066600
                         Entry                                          10116600
.L0010   ANOP                                                           10166600
IXLYAMDSLL_TYPE DS 1BL1  X'11' -- indicates SLL data for CF             10216600
         DS    1CL0003   Unused                                         10266600
IXLYAMDSLL_LENGTH DS 1FL4 Length of IXLYAMDSLL entry mapping            10316600
IXLYAMDSLL_SLNEXT DS 1AL4 Address of next limit entry. A value of 0    *10366600
                         means last entry for this facility.            10416600
*                                                                       10466600
* **************** List Structure Limits Entry************************  10491600
* ********************Structure Limits********************************  10516600
*                                                                       10566600
*                                                                       10616600
IXLYAMDSLL_LNL DS 1FL4   List Header Number limit                       10666600
IXLYAMDSLL_LTECHL DS 1FL1 List lock table entry characteristic limit.  *10685300
                         The maximum supported size of a lock table    *10704000
                         entry in bytes is 2**LTECHL.                   10722700
IXLYAMDSLL_UIDL DS 1FL1  Userid Limit                                   10741600
         DS    1CL0002   Unused                                         10766600
         DS    1CL0016   Unused                                         10816600
IXLYAMDSLL_LEN EQU *-IXLYAMDSLL                                         10866600
.L000E   ANOP                                                           10872800
         AIF   ('&IXLYAMDSLL1' EQ 'NO').L0011                           10879000
         AIF   ('&DSECT' EQ 'YES').L0012                                10885200
         AIF   ('&IXLYAMDSLL1' NE 'YES').L0011                          10891400
IXLYAMDSLL1 DS 0X        Structure Limits for a List Structure (SLL)   *10897600
                         Entry, AmdaLevel1                              10903800
         AGO   .L0013                                                   10910000
.L0012   ANOP                                                           10916200
IXLYAMDSLL1 DSECT        Structure Limits for a List Structure (SLL)   *10922400
                         Entry, AmdaLevel1                              10928600
.L0013   ANOP                                                           10934800
         DS    1CL0036   Mapped by IXLYAMDSLL                           10941000
         DS    1CL0128   Reserved                                       10947200
IXLYAMDSLL1_LEN EQU *-IXLYAMDSLL1                                       10953400
.L0011   ANOP                                                           10959600
*                                                                       10966600
* ********************************************************************  11016600
* **************** Cache Structure Limits Entry***********************  11066600
* ********************************************************************  11091600
* **************** Cache Structure Limits Entry***********************  11116600
* *************************** Header *********************************  11141600
*                                                                       11166600
*                                                                       11216600
         AIF   ('&IXLYAMDSLC' EQ 'NO').L0014                            11266600
         AIF   ('&DSECT' EQ 'YES').L0015                                11316600
         AIF   ('&IXLYAMDSLC' NE 'YES').L0014                           11366600
IXLYAMDSLC DS  0F        Structure Limits for Cache Structure (SLC)    *11416600
                         Entry                                          11466600
         AGO   .L0016                                                   11516600
.L0015   ANOP                                                           11566600
IXLYAMDSLC DSECT         Structure Limits for Cache Structure (SLC)    *11616600
                         Entry                                          11666600
.L0016   ANOP                                                           11716600
IXLYAMDSLC_TYPE DS 1BL1  X'12' -- indicates SLC data for CF             11766600
         DS    1CL0003   Unused                                         11816600
IXLYAMDSLC_LENGTH DS 1FL4 Length of IXLYAMDSLC entry mapping            11866600
IXLYAMDSLC_SLNEXT DS 1AL4 Address of next limit entry. A value of 0    *11916600
                         means last entry for this facility.            11966600
*                                                                       12016600
* **************** Cache Structure Limits Entry***********************  12049900
* ******************* Structure Limits *******************************  12083200
*                                                                       12116600
*                                                                       12166600
IXLYAMDSLC_LCIDLMT DS 1FL1 Cache local cache identifier limit           12216600
         DS    1CL0002   reserved                                       12266600
IXLYAMDSLC_SCLMT DS 1FL1 Cache storage class limit                      12316600
IXLYAMDSLC_CCLMT DS 1FL2 Cache cast-out class limit                     12366600
         DS    1CL0018   Unused                                         12416600
IXLYAMDSLC_LEN EQU *-IXLYAMDSLC                                         12466600
.L0014   ANOP                                                           12472800
         AIF   ('&IXLYAMDSLC1' EQ 'NO').L0017                           12479000
         AIF   ('&DSECT' EQ 'YES').L0018                                12485200
         AIF   ('&IXLYAMDSLC1' NE 'YES').L0017                          12491400
IXLYAMDSLC1 DS 0X        Structure Limits for a Cache Structure (SLC)  *12497600
                         Entry, AmdaLevel1                              12503800
         AGO   .L0019                                                   12510000
.L0018   ANOP                                                           12516200
IXLYAMDSLC1 DSECT        Structure Limits for a Cache Structure (SLC)  *12522400
                         Entry, AmdaLevel1                              12528600
.L0019   ANOP                                                           12534800
         DS    1CL0036   Mapped by IXLYAMDSLC                           12541000
         DS    1CL0028   Reserved                                       12547200
IXLYAMDSLC1_LEN EQU *-IXLYAMDSLC1                                       12553400
.L0017   ANOP                                                           12559600
*                                                                       12566600
* ********************************************************************  12616600
* **************** Facility Measurement Information Entry********       12617600
* ********************************************************************  12618200
* **************** Facility Measurement Information Header ******       12618800
*                                                                       12619600
*                                                                       12620600
         AIF   ('&IXLYAMDCFMI' EQ 'NO').L001A                           12621500
         AIF   ('&DSECT' EQ 'YES').L001B                                12622400
         AIF   ('&IXLYAMDCFMI' NE 'YES').L001A                          12623300
IXLYAMDCFMI DS 0F        Coupling Facility Measurement Information     *12624200
                         (CFMI) Entry                                   12624800
         AGO   .L001C                                                   12625600
.L001B   ANOP                                                           12626400
IXLYAMDCFMI DSECT        Coupling Facility Measurement Information     *12627200
                         (CFMI) Entry                                   12627800
.L001C   ANOP                                                           12628700
IXLYAMDCFMI_TYPE DS 1BL1 X'13' -- indicates CFMI data for CF            12629600
         DS    1CL0003   Unused                                         12630600
IXLYAMDCFMI_LENGTH DS 1FL4 Length of IXLYAMDCFMI entry                  12631600
IXLYAMDCFMI_INFO@ DS 1AL4 Address of the measurement information       *12632600
                         array. An address of 0 indicates no elements  *12633600
                         are provided                                   12634600
IXLYAMDCFMI_INFOELEM DS 1FL4 Number of elements in the array Each      *12635600
                         element contains the processor number and the *12636600
                         measurement block for each valid processor     12637600
IXLYAMDCFMI_LEN EQU *-IXLYAMDCFMI                                       12638600
.L001A   ANOP                                                           12639600
*                                                                       12640600
* *****************Facility Measurement Info Element******************  12641600
*                                                                       12642600
*                                                                       12643600
         AIF   ('&IXLYAMDCFMINFO' EQ 'NO').L001D                        12644600
         AIF   ('&DSECT' EQ 'YES').L001E                                12645600
         AIF   ('&IXLYAMDCFMINFO' NE 'YES').L001D                       12646600
IXLYAMDCFMINFO DS 0F     Facility Measurement Information Element       12647600
         AGO   .L001F                                                   12648600
.L001E   ANOP                                                           12649600
IXLYAMDCFMINFO DSECT     Facility Measurement Information Element       12650600
.L001F   ANOP                                                           12651600
IXLYAMDCFMINFO_PNUM DS 1FL4 Processor number for which measurement     *12652600
                         information is provided                        12653600
IXLYAMDCFMINFO_PMB DS 0CL0064 Processor measurement block               12654600
IXLYAMDCFMINFO_PEXTIME DS 1FL4 Processor execution time                 12655600
IXLYAMDCFMINFO_PWTTIME DS 1FL4 Processor wait time                      12656600
         DS    1CL0056   reserved                                       12657600
IXLYAMDCFMINFO_LEN EQU *-IXLYAMDCFMINFO                                 12658600
.L001D   ANOP                                                           12659600
*                                                                       12660600
* ********************************************************************  12661600
* **************** Structure Entry for List***************************  12666600
* ********************************************************************  12699900
* ******LIST*******Header*********************************************  12733200
*                                                                       12766600
*                                                                       12816600
         AIF   ('&IXLYAMDSTRL' EQ 'NO').L0020                           12866600
         AIF   ('&DSECT' EQ 'YES').L0021                                12916600
         AIF   ('&IXLYAMDSTRL' NE 'YES').L0020                          12966600
IXLYAMDSTRL DS 0F        Structure Entry for List Structure (STRL)      13016600
         AGO   .L0022                                                   13066600
.L0021   ANOP                                                           13116600
IXLYAMDSTRL DSECT        Structure Entry for List Structure (STRL)      13166600
.L0022   ANOP                                                           13216600
IXLYAMDSTRL_TYPE DS 1BL1 X'21' -- indicates STR data for CF             13266600
         DS    1CL0003   Unused                                         13316600
IXLYAMDSTRL_LENGTH DS 1FL4 Length of IXLYAMDSTR entry mapping           13366600
IXLYAMDSTRL_STRNEXT DS 1AL4 Address of next STR entry. A value of 0    *13416600
                         means last entry for this facility.            13466600
*                                                                       13516600
* *******LIST****Configuration Data ******************************** *  13566600
*                                                                       13616600
*                                                                       13666600
IXLYAMDSTRL_TTY DS 1FL1  Structure type identifier                      13716600
IXLYAMDSTRL_TTY_STATUS DS 0CL0001                                       13736600
IXLYAMDSTRL_TYPESERLIST EQU X'80' The List structure is a serialized   *13756600
                         list                                           13776600
IXLYAMDSTRL_RBLDVALID EQU X'40' The structure rebuild status           *13779400
                         indications reported in the                   *13782200
                         IXLYAMDSTRL_RBLDStatus are valid -- These     *13785000
                         values will only be valid and reported when   *13787800
                         information is requested for a particular     *13790600
                         structure                                      13793400
         ORG   IXLYAMDSTRL_TTY_STATUS+X'00000001'                       13796600
IXLYAMDSTRL_SID DS 1FL2  Structure ID                                   13816600
IXLYAMDSTRL_VERSION DS 0BL8 Structure version number. Changes when a   *13837500
                         new physical instance of the structure is     *13858400
                         allocated (e.g., user- or system-managed      *13879300
                         rebuild), and there is at least one active    *13900200
                         connector to observe the allocation.           13921100
IXLYAMDSTRL_PHYSICALVERSION DS 1BL8 Structure version number. Changes  *13942000
                         when a new physical instance of the structure *13962900
                         is allocated (e.g., user- or system-managed   *13983800
                         rebuild), and there is at least one active    *14005400
                         connector to observe the allocation.           14011000
IXLYAMDSTRL_STRNAME DS 1CL0016 Structure name                           14016600
IXLYAMDSTRL_RBLDSTATUS DS 0BL1 Rebuild status flags This information   *14024900
                         will only be valid if IXLYAMDSTRL_RBLDValid   *14033200
                         is set.                                        14041500
IXLYAMDSTRL_STRINREBLD EQU X'80' ON indicates that the structure is in *14049800
                         rebuild                                        14058100
IXLYAMDSTRL_REBLDOLDSTR EQU X'40' ON indicates that the structure      *14066400
                         information pertains to the OLD structure      14074700
IXLYAMDSTRL_REBLDNEWSTR EQU X'20' ON indicates that the structure      *14083000
                         information pertains to the NEW structure      14091300
IXLYAMDSTRL_REBLDDUPLEXSTR EQU X'10' ON indicates the structure        *14092600
                         rebuild is a duplexing rebuild. OFF indicates *14093900
                         the structure rebuild is a normal rebuild.    *14095200
                         This bit only applies when                    *14096500
                         IXLYAMDSTRL_StrInRebld is on.                  14097800
IXLYAMDSTRL_REBLDMETHODSTR EQU X'08' ON indicates the structure        *14098100
                         rebuild is system managed. OFF indicates the  *14098400
                         structure rebuild is user managed. This bit   *14098700
                         only applies when IXLYAMDSTRL_StrInRebld is   *14099000
                         on.                                            14099300
         ORG   IXLYAMDSTRL_RBLDSTATUS+X'00000001'                       14099600
         DS    1CL0003                                                  14107900
*                                                                       14116600
* ******LIST***************** Measurement Data ********************* *  14166600
*                                                                       14216600
*                                                                       14266600
IXLYAMDSTRL_STATUS DS 0CL0001 Structure status bits                     14272800
IXLYAMDSTRL_AMVALID EQU X'80' The following measurement data is valid   14279000
*                                                                       14279700
* ********************************************************************  14280400
* * Begin fields whose validity is indicated by the                     14281100
* * IXLYAMDSTRL_AMValid flag                                            14281800
* ********************************************************************  14282500
*                                                                       14283200
*                                                                       14283900
IXLYAMDSTRL_DUMPSERIALHELD EQU X'40' Dump serialization is held        *14285200
                         against this structure - internal operations  *14291400
                         are failed, - external operations are         *14294500
                         delayed. Hardware control data will not be    *14297600
                         available.                                     14300700
         ORG   IXLYAMDSTRL_STATUS+X'00000001'                           14303800
         DS    1CL0001   Unused                                         14307300
IXLYAMDSTRL_AMDATASEQUENCE DS 1FL2 Sequence number associated with     *14310800
                         this instance of Measurement Data from this   *14314300
                         system.                                        14317800
IXLYAMDSTRL_REQCT DS 1FL4 Total requests by structure (this relates to *14321300
                         external requests such as IXLLIST macro       *14332600
                         invocations, NOT to requests sent to the      *14343900
                         facility).                                     14355200
IXLYAMDSTRL_REQCTASYNC DS 1FL4 Total asynchronous requests started      14366600
IXLYAMDSTRL_CONTCT DS 1FL4 Total number of requests that encountered   *14379400
                         contention on a lock table entry (LOCK        *14392200
                         structure only)                                14405000
IXLYAMDSTRL_FCONTCT DS 1FL4 False contention count = Total number of   *14417800
                         requests that encountered false contention on *14430600
                         a lock table entry (LOCK structure only)       14443400
         DS    1FL4      Reserved                                       14456200
IXLYAMDSTRL_HIWORKQUEUECOUNT DS 1FL4 Current count of the number of    *14469000
                         operations queued for subchannel contention    14481800
IXLYAMDSTRL_WORKQUEUECOUNT DS 1FL4 Current count of the number of      *14494600
                         operations queued for subchannel contention    14507400
IXLYAMDSTRL_DELAYQUEUECOUNT DS 1FL4 Current count of the number of     *14520200
                         operations delayed for dump serialization     *14526600
                         and/or a system-managed process (e.g.,        *14533000
                         rebuild)                                       14539400
IXLYAMDSTRL_DUMPSERIALRELEASED DS 1FL4 Count of the number of times    *14545800
                         dump serialization was obtained and released  *14558600
                         for this structure                             14571400
IXLYAMDSTRL_SYNCTIMECOUNT DS 1FL4 Count of the number of summed times  *14584200
                         -- for successful operations. This count      *14590600
                         represents synchronous operations to the      *14597000
                         coupling facility.                             14603400
IXLYAMDSTRL_SYNCSUMTIME DS 1CL0008 Summed service time (u-sec)          14609800
IXLYAMDSTRL_SYNCSUMTIMESQR DS 1CL0008 Summed service time (u-sec       *14622600
                         squared)                                       14635400
IXLYAMDSTRL_ASYNCTIMECOUNT DS 1FL4 Count of the number of summed times *14648200
                         -- for asynchronous operations. This count    *14654600
                         represents asynchronous operations to the     *14661000
                         coupling facility.                             14667400
IXLYAMDSTRL_ASYNCSUMTIME DS 1CL0008 Summed service time (u-sec)         14673800
IXLYAMDSTRL_ASYNCSUMTIMESQR DS 1CL0008 Summed service time squared     *14686600
                         (u-sec squared)                                14699400
IXLYAMDSTRL_QUEUETIMECOUNT DS 1FL4 Count of the number of summed times *14712200
                         -- for operation queue time                    14725000
IXLYAMDSTRL_QUEUESUMTIME DS 1CL0008 Summed queue time (u-sec)           14737800
IXLYAMDSTRL_QUEUESUMTIMESQR DS 1CL0008 Summed queue time squared       *14750600
                         (u-sec squared)                                14763400
IXLYAMDSTRL_DELAYTIMECOUNT DS 1FL4 Count of the number of summed times *14776200
                         -- for operation delay time for dump          *14789000
                         serialization                                  14801800
IXLYAMDSTRL_DELAYSUMTIME DS 1CL0008 Summed delay time (u-sec)           14814600
IXLYAMDSTRL_DELAYSUMTIMESQR DS 1CL0008 Summed delay time squared       *14827400
                         (u-sec squared)                                14840200
IXLYAMDSTRL_SYNCTOASYNCCOUNT DS 1FL4 Count of the number of times a    *14844600
                         synchronous operation could not be performed  *14849000
                         synchronously and was changed to an           *14853400
                         asynchronous operation                         14857800
IXLYAMDSTRL_TOTALHIWORKCOUNT DS 1FL4 Total count of the number of      *14859200
                         operations queued for subchannel contention    14860600
IXLYAMDSTRL_TOTALWORKCOUNT DS 1FL4 Total count of the number of        *14862000
                         operations queued for subchannel contention    14863400
         DS    1CL0004   RESERVED                                       14865000
*                                                                       14866600
* ********************************************************************  14876600
* * End fields whose validity is indicated by the                       14886600
* * IXLYAMDSTRL_AMValid flag                                            14896600
* ********************************************************************  14906600
* ***LIST*****Control Structure Information ***********************  *  14916600
*                                                                       14966600
*                                                                       15016600
IXLYAMDSTRL_DATAFLAGS DS 0BL1                                           15066600
IXLYAMDSTRL_VALID EQU X'80' The following list control structure       *15099900
                         information is valid                           15133200
*                                                                       15134500
* ********************************************************************  15135800
* * Begin fields whose validity is indicated by the                     15137100
* * IXLYAMDSTRL_Valid flag                                              15138400
* ********************************************************************  15139700
*                                                                       15141000
*                                                                       15142300
IXLYAMDSTRL_DTSVALID EQU X'08' Structure dump table size information   *15144300
                         is valid                                       15155400
         ORG   IXLYAMDSTRL_DATAFLAGS+X'00000001'                        15166600
         DS    1CL0002   not used                                       15170700
IXLYAMDSTRL_FLAGS2 DS 0BL1 Flags                                        15174800
IXLYAMDSTRL_REIPI EQU X'80' Reapportionment in progress indicator.     *15178900
                         1=structure ALTER to change ratio is in       *15183000
                         progress (LEVEL1)                              15187100
IXLYAMDSTRL_SSCI EQU X'40' Structure size change in progress           *15191200
                         indicator. 1=structure ALTER to change        *15195300
                         structure size is in progress (LEVEL1)         15199400
IXLYAMDSTRL_MREIPI EQU X'20' Monitor Reapportionment change in         *15200200
                         progress indicator. 1=structure ALTER to      *15201000
                         change Event Monitor Controls is in progress  *15201800
                         (LEVEL4)                                       15202600
         ORG   IXLYAMDSTRL_FLAGS2+X'00000001'                           15203500
IXLYAMDSTRL_MDLES DS 1FL1 Maximum data list entry size (maximum number *15207600
                         of elements per entry)                         15211700
IXLYAMDSTRL_STFLAGS DS 0BL1                                             15216600
IXLYAMDSTRL_ST DS 0BL1   Structure type values                          15223200
IXLYAMDSTRL_ST_SKI EQU X'80' Secondary key indicator 0 ==> Secondary   *15229800
                         keys are not supported. 1 ==> Secondary keys  *15236400
                         are supported. (CF level >=9)                  15243000
IXLYAMDSTRL_ST_PLEIDI EQU X'40' Programmable LEID indicator (LEVEL8)    15249800
IXLYAMDSTRL_ST_CI EQU X'20' Count indicator. 1= list limit accounting  *15266500
                         by elements, 0 = list limit accounting by     *15283100
                         entries                                        15299700
IXLYAMDSTRL_ST_LI EQU X'10' Lock Indicator                              15316600
IXLYAMDSTRL_ST_DI EQU X'08' Data Indicator                              15366600
IXLYAMDSTRL_ST_AI EQU X'04' Adjunct indicator                           15416600
IXLYAMDSTRL_ST_NI EQU X'02' Name indicator                              15466600
IXLYAMDSTRL_ST_KI EQU X'01' Key indicator                               15516600
         ORG   IXLYAMDSTRL_STFLAGS+X'00000001'                          15566600
IXLYAMDSTRL_LTECH DS 1FL1 Lock table entry characteristic. The width   *15596600
                         of a lock table entry in bytes is 2**LTECH     15626600
IXLYAMDSTRL_LELX DS 1FL1 List element characteristic. The size of a    *15656600
                         list element in bytes is 256*(2**LELX)         15686600
IXLYAMDSTRL_NLE DS 1FL4  Lock table entry count                         15716600
IXLYAMDSTRL_LC DS 1FL4   List count - number of list headers in the    *15761000
                         structure                                      15805400
IXLYAMDSTRL_SS DS 1FL4   Structure size in 4k blocks                    15849900
IXLYAMDSTRL_MSS DS 1FL4  Maximum structure size in 4K blocks.           15852400
IXLYAMDSTRL_MINSS DS 1FL4 Minimum structure size in 4K blocks. The     *15854900
                         structure may actually be allocated smaller   *15857400
                         than this, but if so, structure attributes    *15859900
                         such as entry/element ratio will differ       *15862400
                         significantly from those which were           *15864900
                         requested.                                     15867400
IXLYAMDSTRL_MLSELC DS 1FL4 Maximum list set element count. This count  *15869900
                         is only substantially accurate.                15872400
IXLYAMDSTRL_LSELC DS 1FL4 List set element count (count of list        *15874900
                         elements currently in use)                     15877400
IXLYAMDSTRL_NLTEC DS 1FL4 Non-zero lock table entry count. This count  *15887600
                         is only substantially accurate.                15897800
IXLYAMDSTRL_MLSEC DS 1FL4 Maximum list set entry count. LIST Structure *15908000
                         = Total number of entries in the structure.   *15918200
                         LOCK Structure = Maximum number of record     *15928400
                         data elements. This count is only             *15938600
                         substantially accurate.                        15948800
IXLYAMDSTRL_LSEC DS 1FL4 List set entry count. LIST Structure = Number *15959000
                         of entries in the structure which are         *15969200
                         currently in use. LOCK Structure = Number of  *15979400
                         record entries in the structure which are     *15989600
                         currently in use.                              15999800
IXLYAMDSTRL_DTS DS 1FL4  Structure dump table size in 4k blocks         16010900
IXLYAMDSTRL_MRSS DS 1FL4 Marginal structure size. This is the true     *16012200
                         minimum size with which the structure can be  *16013500
                         allocated, regardless of ratio                *16014800
                         considerations. (LEVEL1)                       16016100
IXLYAMDSTRL_TSS DS 1FL4  Target structure size. For a CFLEVEL 0        *16016700
                         facility, the target structure size will be   *16017300
                         equal to the actual structure size. For a     *16017900
                         CFLEVEL 1 or higher facility, the target      *16018500
                         structure size will be equal to the target    *16019100
                         structure size specified on the initial       *16019700
                         allocate or subsequent expand or contract     *16020300
                         request. The target size may or may not be    *16020900
                         equal to the actual size. (LEVEL1)             16021500
IXLYAMDSTRL_TMELC DS 1FL4 Target maximum element count. For a CFLEVEL  *16022100
                         0 facility the target maximum element count   *16022700
                         will be equal to the actual maximum element   *16023300
                         count. For CFLEVEL 1 or higher facilities,    *16023900
                         the target maximum element count will reflect *16024500
                         the target ratio specified on the initial     *16025100
                         allocate or subsequent reapportionment        *16025700
                         request. This may or may not equal the actual *16026300
                         maximum element count. (LEVEL1)                16026900
IXLYAMDSTRL_TMEC DS 1FL4 Target maximum entry count. For a CFLEVEL 0   *16027500
                         facility the target maximum entry count will  *16028100
                         be equal to the actual maximum entry count.   *16028700
                         For CFLEVEL 1 or higher facilities, the       *16029300
                         target maximum entry count will reflect the   *16029900
                         target ratio specified on the initial         *16030500
                         allocate or subsequent reapportionment        *16031100
                         request. This may or may not equal the actual *16031700
                         maximum entry count. (LEVEL1)                  16032300
IXLYAMDSTRL_PETELR DS 0FL4 Pending entry to element ratio. This field  *16032900
                         is only applicable to CFLEVEL 1 or higher     *16033500
                         facilities. (LEVEL1)                           16034100
IXLYAMDSTRL_PETELR_ENTRY DS 1FL2 Entry ratio portion (LEVEL1)           16035600
IXLYAMDSTRL_PETELR_ELEMENT DS 1FL2 Element ratio portion (LEVEL1)       16036900
IXLYAMDSTRL_EMCCNT DS 1FL4 Count of Event Monitor Control (EMC)        *16039600
                         objects in use by the structure. Applicable   *16042300
                         only if structure allocated in CFLEVEL 3 or   *16045000
                         higher facility.                               16047700
IXLYAMDSTRL_MAXEMCCNT DS 1FL4 Maximum number of EMCs for the           *16050400
                         structure. Applicable only if structure       *16053100
                         allocated in CFLEVEL 3 or higher facility.     16055800
IXLYAMDSTRL_TMAXEMCCNT DS 1FL4 Target Maximum number of EMCs for the   *16058500
                         structure. Applicable only if structure       *16061200
                         allocated in CFLEVEL 3 or higher facility.     16063900
*                                                                       16064200
* ********************************************************************  16064500
* * End fields whose validity is indicated by the                       16064800
* * IXLYAMDSTRL_Valid flag                                              16065100
* ********************************************************************  16065400
*                                                                       16065700
*                                                                       16066000
IXLYAMDSTRL_LEN EQU *-IXLYAMDSTRL                                       16066600
.L0020   ANOP                                                           16071800
         AIF   ('&IXLYAMDSTRL1' EQ 'NO').L0023                          16077000
         AIF   ('&DSECT' EQ 'YES').L0024                                16082200
         AIF   ('&IXLYAMDSTRL1' NE 'YES').L0023                         16087400
IXLYAMDSTRL1 DS 0F       Structure Entry for a List Structure (STRL),  *16092600
                         AmdaLevel1                                     16097800
         AGO   .L0025                                                   16103000
.L0024   ANOP                                                           16108200
IXLYAMDSTRL1 DSECT       Structure Entry for a List Structure (STRL),  *16113400
                         AmdaLevel1                                     16118600
.L0025   ANOP                                                           16123800
         DS    1CL0264   Mapped by IXLYAMDSTRL                          16129000
*                                                                       16129600
* ********************************************************************  16130200
* * Begin fields whose validity is indicated by the                     16130800
* * IXLYAMDSTRL_Valid flag                                              16131400
* ********************************************************************  16132000
*                                                                       16132600
*                                                                       16133200
IXLYAMDSTRL_TEMCSTGPCT DS 1FL2 Pending percent of structure storage to *16134200
                         be used as EMCs, expressed in hundredths of a *16139400
                         percent (ie. range is 0 to 10000)              16144600
         DS    1CL0002   Reserved                                       16144900
IXLYAMDSTRL1_LSCUR DS 1FL4 List set cursor (LEVEL8)                     16145100
IXLYAMDSTRL1_SCCVN DS 1FL4 Structure copy controls version number      *16145300
                         (LEVEL8)                                       16145500
*                                                                       16145800
* ********************************************************************  16146100
* * End fields whose validity is indicated by the                       16146400
* * IXLYAMDSTRL_Valid flag                                              16146700
* ********************************************************************  16147000
*                                                                       16147300
*                                                                       16147600
         DS    1CL0104   Reserved                                       16147900
IXLYAMDSTRL1_LOGICALVERSION DS 1BL8 Logical structure version number.  *16148200
                         Used in conjunction with the physical version *16148500
                         number to identify an instance of a           *16148800
                         structure. The value of this field is set     *16149100
                         equal to the physical version number when the *16149400
                         structure is initially allocated. It changes  *16149700
                         when a process that allocates a new instance  *16150000
                         of the structure (e.g., rebuild) is           *16150300
                         user-managed, but not when it is              *16150600
                         system-managed.                                16150900
IXLYAMDSTRL1_SSCCADDR DS 1AL4 Address of the structure copy controls   *16151200
                         information entry for this structure. A value *16151500
                         of zero means that the SSCC record was not    *16151800
                         provided for this structure because it was    *16152100
                         not requested, not available, or contained no *16152400
                         information.                                   16152700
IXLYAMDSTRL1_LEN EQU *-IXLYAMDSTRL1                                     16155000
.L0023   ANOP                                                           16160200
*                                                                       16166600
* ********************************************************************  16216600
* **************** Structure Entry for Cache**************************  16266600
* ********************************************************************  16299900
* ***CACHE*********Header*********************************************  16333200
*                                                                       16366600
*                                                                       16416600
         AIF   ('&IXLYAMDSTRC' EQ 'NO').L0026                           16466600
         AIF   ('&DSECT' EQ 'YES').L0027                                16516600
         AIF   ('&IXLYAMDSTRC' NE 'YES').L0026                          16566600
IXLYAMDSTRC DS 0F        Structure Entry for a Cache Structure (STRC)   16616600
         AGO   .L0028                                                   16666600
.L0027   ANOP                                                           16716600
IXLYAMDSTRC DSECT        Structure Entry for a Cache Structure (STRC)   16766600
.L0028   ANOP                                                           16816600
IXLYAMDSTRC_TYPE DS 1BL1 X'22' -- indicates STR data for CF             16866600
         DS    1CL0003   Unused                                         16916600
IXLYAMDSTRC_LENGTH DS 1FL4 Length of IXLYAMDSTR entry mapping           16966600
IXLYAMDSTRC_STRNEXT DS 1AL4 Address of next STR entry. A value of 0    *17016600
                         means last entry for this facility.            17066600
IXLYAMDSTRC_SCSC@ DS 1AL4 Address of the SCSC entry. A value of 0      *17073700
                         means there is no entry for storage class     *17080800
                         data                                           17087900
IXLYAMDSTRC_SCOC@ DS 1AL4 Address of the SCOC entry. A value of 0      *17095000
                         means there is no entry for castout class     *17102100
                         data                                           17109200
*                                                                       17116600
* ***CACHE*******Configuration Data ******************************** *  17166600
*                                                                       17216600
*                                                                       17266600
IXLYAMDSTRC_TTY DS 1FL1  Structure type identifier                      17316600
IXLYAMDSTRC_TTY_STATUS DS 0CL0001                                       17327700
IXLYAMDSTRC_RBLDVALID EQU X'40' The structure rebuild status           *17338800
                         indications reported in the                   *17349900
                         IXLYAMDSTRC_RBLDStatus are valid -- These     *17361000
                         values will only be valid and reported when   *17372100
                         information is requested for a particular     *17383200
                         structure                                      17394300
         ORG   IXLYAMDSTRC_TTY_STATUS+X'00000001'                       17405400
IXLYAMDSTRC_SID DS 1FL2  Structure ID                                   17416600
IXLYAMDSTRC_VERSION DS 0BL8 Structure version number. Changes when a   *17466600
                         new physical instance of the structure is     *17516600
                         allocated (e.g., user- or system-managed      *17599800
                         rebuild), and there is at least one active    *17600700
                         connector to observe the allocation.           17601600
IXLYAMDSTRC_PHYSICALVERSION DS 1BL8 Structure version number. Changes  *17602500
                         when a new physical instance of the structure *17603400
                         is allocated (e.g., user- or system-managed   *17604300
                         rebuild), and there is at least one active    *17605400
                         connector to observe the allocation.           17611000
IXLYAMDSTRC_STRNAME DS 1CL0016 STR name                                 17616600
IXLYAMDSTRC_RBLDSTATUS DS 0BL1 Rebuild status flags This information   *17624900
                         will only be valid if IXLYAMDSTRC_RBLDValid   *17633200
                         is set.                                        17641500
IXLYAMDSTRC_STRINREBLD EQU X'80' ON indicates that the structure is in *17649800
                         rebuild                                        17658100
IXLYAMDSTRC_REBLDOLDSTR EQU X'40' ON indicates that the structure      *17666400
                         information pertains to the OLD structure      17674700
IXLYAMDSTRC_REBLDNEWSTR EQU X'20' ON indicates that the structure      *17683000
                         information pertains to the NEW structure      17691300
IXLYAMDSTRC_REBLDDUPLEXSTR EQU X'10' ON indicates the structure        *17692600
                         rebuild is a duplexing rebuild. OFF indicates *17693900
                         the structure rebuild is a normal rebuild.    *17695200
                         This bit only applies when                    *17696500
                         IXLYAMDSTRC_StrInRebld is on.                  17697800
IXLYAMDSTRC_REBLDMETHODSTR EQU X'08' ON indicates the structure        *17698100
                         rebuild is system managed. OFF indicates the  *17698400
                         structure rebuild is user managed. This bit   *17698700
                         only applies when IXLYAMDSTRC_StrInRebld is   *17699000
                         on.                                            17699300
         ORG   IXLYAMDSTRC_RBLDSTATUS+X'00000001'                       17699600
         DS    1CL0003                                                  17707900
*                                                                       17716600
* *****CACHE***************** Measurement Data ********************* *  17766600
*                                                                       17816600
*                                                                       17866600
IXLYAMDSTRC_STATUS DS 0CL0001 Structure status bits                     17872800
IXLYAMDSTRC_AMVALID EQU X'80' The following measurement data is valid   17879000
*                                                                       17879700
* ********************************************************************  17880400
* * Begin fields whose validity is indicated by the                     17881100
* * IXLYAMDSTRC_AMValid flag                                            17881800
* ********************************************************************  17882500
*                                                                       17883200
*                                                                       17883900
IXLYAMDSTRC_DUMPSERIALHELD EQU X'40' Dump serialization is held        *17885200
                         against this structure - internal operations  *17891400
                         are failed - external operations are delayed. *17895500
                         Hardware control data will not be available.   17899600
         ORG   IXLYAMDSTRC_STATUS+X'00000001'                           17903800
         DS    1CL0001   Unused                                         17907800
IXLYAMDSTRC_AMDATASEQUENCE DS 1FL2 Sequence number associated with     *17911800
                         this instance of Measurement Data from this   *17915800
                         system.                                        17919800
IXLYAMDSTRC_REQCT DS 1FL4 Total requests. This relates to external     *17924100
                         requests such as IXLCACHE macro invocations,  *17938200
                         not operations to the coupling facility.       17952300
IXLYAMDSTRC_REQCTASYNC DS 1FL4 Total asynchronous requests started      17966600
IXLYAMDSTRC_HIWORKQUEUECOUNT DS 1FL4 Current count of the number of    *17981700
                         operations queued for subchannel contention    17996800
IXLYAMDSTRC_WORKQUEUECOUNT DS 1FL4 Current count of the number of      *18011900
                         operations queued for subchannel contention    18027000
IXLYAMDSTRC_DELAYQUEUECOUNT DS 1FL4 Current count of the number of     *18042100
                         operations delayed for dump serialization     *18049600
                         and/or a system-managed process (e.g.,        *18057100
                         rebuild)                                       18064600
IXLYAMDSTRC_DUMPSERIALRELEASED DS 1FL4 Count of the number times dump  *18072300
                         serialization was obtained and released for   *18087400
                         this structure                                 18102500
IXLYAMDSTRC_SYNCTIMECOUNT DS 1FL4 Count of the number of summed times  *18117600
                         -- for successful synchronous operations to   *18127600
                         the facility                                   18137600
IXLYAMDSTRC_SYNCSUMTIME DS 1CL0008 Summed service time (u-sec)          18147800
IXLYAMDSTRC_SYNCSUMTIMESQR DS 1CL0008 Summed service time squared      *18162900
                         (u-sec squared)                                18179100
IXLYAMDSTRC_ASYNCTIMECOUNT DS 1FL4 Count of the number of summed times *18181100
                         -- for successful asynchronous operations to  *18182400
                         the facility                                   18183700
IXLYAMDSTRC_ASYNCSUMTIME DS 1CL0008 Summed service time (u-sec)         18185100
IXLYAMDSTRC_ASYNCSUMTIMESQR DS 1CL0008 Summed service time squared     *18187100
                         (u-sec squared)                                18189100
IXLYAMDSTRC_QUEUETIMECOUNT DS 1FL4 Count of the number of summed times *18191100
                         -- for operation queue time                    18193100
IXLYAMDSTRC_QUEUESUMTIME DS 1CL0008 Summed queue time (u-sec)           18195100
IXLYAMDSTRC_QUEUESUMTIMESQR DS 1CL0008 Summed queue time squared       *18197100
                         (u-sec squared)                                18199100
IXLYAMDSTRC_DELAYTIMECOUNT DS 1FL4 Count of the number of summed times *18201100
                         -- for operation delay time for dump          *18203100
                         serialization                                  18205100
IXLYAMDSTRC_DELAYSUMTIME DS 1CL0008 Summed delay time (u-sec)           18207100
IXLYAMDSTRC_DELAYSUMTIMESQR DS 1CL0008 Summed delay time squared       *18209100
                         (u-sec squared)                                18211100
IXLYAMDSTRC_SYNCTOASYNCCOUNT DS 1FL4 Count of the number times a       *18212000
                         synchronous operation could not be performed  *18212900
                         synchronously and was changed to an           *18213800
                         asynchronous operation                         18214700
IXLYAMDSTRC_TOTALHIWORKCOUNT DS 1FL4 Total count of the number of      *18215000
                         operations queued for subchannel contention    18215300
IXLYAMDSTRC_TOTALWORKCOUNT DS 1FL4 Total count of the number of        *18215600
                         operations queued for subchannel contention    18215900
         DS    1CL0004   RESERVED                                       18216200
*                                                                       18216600
* ********************************************************************  18226600
* * End fields whose validity is indicated by the                       18236600
* * IXLYAMDSTRC_AMValid flag                                            18246600
* ********************************************************************  18256600
* *************Control Structure Information *********************** *  18266600
*                                                                       18316600
*                                                                       18366600
IXLYAMDSTRC_DATAFLAGS DS 0BL1                                           18416600
IXLYAMDSTRC_VALID EQU X'80' The following cache control structure      *18466600
                         information is valid                           18516600
*                                                                       18518600
* ********************************************************************  18520600
* * Begin fields whose validity is indicated by the                     18522600
* * IXLYAMDSTRC_Valid flag                                              18524600
* ********************************************************************  18526600
*                                                                       18528600
*                                                                       18530600
IXLYAMDSTRC_DTSVALID EQU X'08' Structure dump table size information   *18533200
                         is valid                                       18549800
         ORG   IXLYAMDSTRC_DATAFLAGS+X'00000001'                        18566600
         DS    1CL0002   reserved                                       18598700
IXLYAMDSTRC_FLAGS2 DS 0BL1 Flags                                        18630800
IXLYAMDSTRC_REIPI EQU X'80' Reapportionment in progress indicator.     *18662900
                         1=structure ALTER to change ratio is in       *18695000
                         progress (LEVEL1)                              18727100
IXLYAMDSTRC_SSCI EQU X'40' Structure size change in progress           *18759200
                         indicator. 1=structure ALTER to change        *18791300
                         structure size is in progress (LEVEL1)         18823400
         ORG   IXLYAMDSTRC_FLAGS2+X'00000001'                           18855500
IXLYAMDSTRC_TDEC DS 1FL4 Total Directory entry count. This count is    *18887600
                         only substantially accurate                    18919700
IXLYAMDSTRC_TDAEC DS 1FL4 Total Data area element count. This count is *18951800
                         only substantially accurate                    18983900
IXLYAMDSTRC_BITS DS 0BL1                                                19016600
IXLYAMDSTRC_AAI EQU X'80' Adjunct Assignment indicator                  19066600
IXLYAMDSTRC_UDFOQI EQU X'40' UDF order queue indicator. CFLevel 5 or   *19083200
                         higher.                                        19099800
         ORG   IXLYAMDSTRC_BITS+X'00000001'                             19116600
IXLYAMDSTRC_MSCV DS 1FL1 Maximum storage class value                    19166600
IXLYAMDSTRC_NCM DS 1BL2  Name class mask. CFLEVEL=7 or higher           19216600
IXLYAMDSTRC_MCCV DS 1FL2 Maximum castout class value                    19266600
IXLYAMDSTRC_DAEX DS 1FL1 Data area element characteristic. The size of *19281000
                         a data element in bytes is 256*(2**DAEX)       19295400
IXLYAMDSTRC_MDAS DS 1FL1 Maximum data area size (i.e maximum number of *19309800
                         elements per entry)                            19324200
IXLYAMDSTRC_SS DS 1FL4   Structure size in 4K blocks                    19338600
IXLYAMDSTRC_MSS DS 1FL4  Maximum structure size in 4K blocks            19353000
IXLYAMDSTRC_MINSS DS 1FL4 Minimum structure size in 4K blocks. The     *19367400
                         structure may actually be allocated smaller   *19381800
                         than this, but if so, structure attributes    *19396200
                         such as entry/element ratio will differ       *19410600
                         significantly from those which were           *19425000
                         requested.                                     19439400
IXLYAMDSTRC_DTS DS 1FL4  Structure dump table size in 4k blocks         19454100
IXLYAMDSTRC_MRSS DS 1FL4 Marginal structure size. This is the true     *19454600
                         minimum size with which the structure can be  *19455100
                         allocated, regardless of ratio                *19455600
                         considerations. (LEVEL1)                       19456100
IXLYAMDSTRC_TSS DS 1FL4  Target structure size. For a CFLEVEL 0        *19456300
                         facility, the target structure size will be   *19456500
                         equal to the actual structure size. For a     *19456700
                         CFLEVEL 1 or higher facility, the target      *19456900
                         structure size will be equal to the target    *19457100
                         structure size specified on the initial       *19457300
                         allocate or subsequent expand or contract     *19457500
                         request. The target size may or may not be    *19457700
                         equal to the actual size. (LEVEL1)             19457900
IXLYAMDSTRC_TMELC DS 1FL4 Target maximum element count. For a CFLEVEL  *19458100
                         0 facility the target maximum element count   *19458300
                         will be equal to the actual maximum element   *19458500
                         count. For CFLEVEL 1 or higher facilities,    *19458700
                         the target maximum element count will reflect *19458900
                         the target ratio specified on the initial     *19459100
                         allocate or subsequent reapportionment        *19459300
                         request. This may or may not equal the actual *19459500
                         maximum element count. (LEVEL1)                19459700
IXLYAMDSTRC_TMEC DS 1FL4 Target maximum entry count. For a CFLEVEL 0   *19459900
                         facility the target maximum entry count will  *19460100
                         be equal to the actual maximum entry count.   *19460300
                         For CFLEVEL 1 or higher facilities, the       *19460500
                         target maximum entry count will reflect the   *19460700
                         target ratio specified on the initial         *19460900
                         allocate or subsequent reapportionment        *19461100
                         request. This may or may not equal the actual *19461300
                         maximum entry count. (LEVEL1)                  19461500
IXLYAMDSTRC_PDTDR DS 0FL4 Pending directory to data ratio. This field  *19461700
                         is only applicable to CFLEVEL 1 or higher     *19461900
                         facilities. (LEVEL1)                           19462100
IXLYAMDSTRC_PDTDR_DIR DS 1FL2 Directory ratio portion (LEVEL1)          19463600
IXLYAMDSTRC_PDTDR_DATA DS 1FL2 Data element ratio portion (LEVEL1)      19464100
IXLYAMDSTRC_TSCC DS 1FL4 Total structure changed entry count. This     *19470400
                         count is only substantially accurate (LEVEL1)  19476700
IXLYAMDSTRC_TCDEC DS 1FL4 Total structure changed data element count.  *19483000
                         This count is only substantially accurate     *19489300
                         (LEVEL1)                                       19495600
         DS    1CL0004   Reserved                                       19506100
*                                                                       19507400
* ********************************************************************  19508700
* * End fields whose validity is indicated by the                       19510000
* * IXLYAMDSTRC_Valid flag                                              19511300
* ********************************************************************  19512600
*                                                                       19513900
*                                                                       19515200
IXLYAMDSTRC_LEN EQU *-IXLYAMDSTRC                                       19516600
.L0026   ANOP                                                           19519700
         AIF   ('&IXLYAMDSTRC1' EQ 'NO').L0029                          19522800
         AIF   ('&DSECT' EQ 'YES').L002A                                19525900
         AIF   ('&IXLYAMDSTRC1' NE 'YES').L0029                         19529000
IXLYAMDSTRC1 DS 0F       Structure Entry for a Cache Structure (STRC), *19532100
                         AmdaLevel1                                     19535200
         AGO   .L002B                                                   19538300
.L002A   ANOP                                                           19541400
IXLYAMDSTRC1 DSECT       Structure Entry for a Cache Structure (STRC), *19544500
                         AmdaLevel1                                     19547600
.L002B   ANOP                                                           19550700
         DS    1CL0244   Mapped by IXLYAMDSTRC                          19553800
*                                                                       19553900
* ********************************************************************  19554000
* * Begin fields whose validity is indicated by the                     19554100
* * IXLYAMDSTRC_Valid flag                                              19554200
* ********************************************************************  19554300
*                                                                       19554400
*                                                                       19554500
IXLYAMDSTRC1_WQC DS 1FL4 Write-with-castout queue count (LEVEL8)        19554600
IXLYAMDSTRC1_SCCVN DS 1FL4 Structure copy controls version number      *19554700
                         (LEVEL8)                                       19554800
IXLYAMDSTRC1_GCUDRI DS 1FL4 Global count of unchanged directory        *19554900
                         entries with registered interest (LEVEL8)      19555000
IXLYAMDSTRC1_FDEC DS 1FL4 Free directory entry count (LEVEL8)           19555100
IXLYAMDSTRC1_FDAEC DS 1FL4 Free data area element count (LEVEL8)        19555200
IXLYAMDSTRC1_CCCUR DS 1FL2 Castout class cursor (LEVEL8)                19555300
         DS    1CL0002   Reserved                                       19555400
*                                                                       19555500
* ********************************************************************  19555600
* * End fields whose validity is indicated by the                       19555700
* * IXLYAMDSTRC_Valid flag                                              19555800
* ********************************************************************  19555900
*                                                                       19556000
*                                                                       19556100
         DS    1CL0092   Reserved                                       19556200
IXLYAMDSTRC1_LOGICALVERSION DS 1BL8 Logical structure version number.  *19556300
                         Used in conjunction with the physical version *19556400
                         number to identify an instance of a           *19556500
                         structure. The value of this field is set     *19556600
                         equal to the physical version number when the *19556700
                         structure is initially allocated. It changes  *19556800
                         when a process that allocates a new instance  *19556900
                         of the structure (e.g., rebuild) is           *19557000
                         user-managed, but not when it is              *19557100
                         system-managed.                                19557200
IXLYAMDSTRC1_SSCCADDR DS 1AL4 Address of the structure copy controls   *19557300
                         information entry for this structure. A value *19557400
                         of zero means that the SSCC record was not    *19557500
                         provided for this structure because it was    *19557600
                         not requested, not available, or contained no *19557700
                         information.                                   19557800
IXLYAMDSTRC1_LEN EQU *-IXLYAMDSTRC1                                     19560000
.L0029   ANOP                                                           19563100
*                                                                       19567500
* ********************************************************************  19568400
* **************** Structure Cache Storage Class Entry ***************  19569300
* ********************************************************************  19569700
* *****************Header*********************************************  19570200
*                                                                       19571100
*                                                                       19572000
         AIF   ('&IXLYAMDSCSC' EQ 'NO').L002C                           19572800
         AIF   ('&DSECT' EQ 'YES').L002D                                19573600
         AIF   ('&IXLYAMDSCSC' NE 'YES').L002C                          19574400
IXLYAMDSCSC DS 0F        Structure Entry for Cache Storage Class       *19575300
                         (SCSC)                                         19575900
         AGO   .L002E                                                   19576600
.L002D   ANOP                                                           19577300
IXLYAMDSCSC DSECT        Structure Entry for Cache Storage Class       *19578000
                         (SCSC)                                         19578600
.L002E   ANOP                                                           19579500
IXLYAMDSCSC_TYPE DS 1BL1 X'23' -- indicates STR data for Storage Class  19580500
         DS    1CL0003   Unused                                         19581900
IXLYAMDSCSC_LENGTH DS 1FL4 Length of IXLYAMDSCSC entry mapping          19582800
         DS    1CL0004   reserved                                       19583700
IXLYAMDSCSC_STATS DS 0CL0108 Storage Class information                  19583800
IXLYAMDSCSC_RHC DS 1FL4  Read hit counter                               19583900
IXLYAMDSCSC_RMDHC DS 1FL4 Read miss, directory hit counter              19584000
IXLYAMDSCSC_RMASC DS 1FL4 Read miss, assignment suppressed counter      19584100
IXLYAMDSCSC_RMNAC DS 1FL4 Read miss, name assigned counter              19584200
IXLYAMDSCSC_RMTSFC DS 1FL4 Read miss, target storage class full        *19584300
                         counter                                        19584400
IXLYAMDSCSC_WHCB0C DS 1FL4 Write hit change Bit 0 ctr                   19584500
IXLYAMDSCSC_WHCB1C DS 1FL4 Write hit change Bit 1 ctr                   19584600
IXLYAMDSCSC_WMNRC DS 1FL4 Write miss, not registered counter            19584700
IXLYAMDSCSC_WMISC DS 1FL4 Write miss, invalid state counter             19584800
IXLYAMDSCSC_WMTSFC DS 1FL4 Write miss, target storage class full       *19584900
                         counter                                        19585000
IXLYAMDSCSC_DERC DS 1FL4 Directory entry reclaim counter                19585100
IXLYAMDSCSC_DTERC DS 1FL4 Data entry reclaim counter                    19585200
IXLYAMDSCSC_XIFDRC DS 1FL4 XI directory reclaim counter                 19585300
IXLYAMDSCSC_XIFWC DS 1FL4 XI write counter                              19585400
IXLYAMDSCSC_XINIC DS 1FL4 XI name invalidation counter                  19585500
IXLYAMDSCSC_XICIC DS 1FL4 XI complement invalidation counter            19585600
IXLYAMDSCSC_COC DS 1FL4  Castout Counter                                19585700
IXLYAMDSCSC_RSMC DS 1FL4 Reference signal miss counter                  19585800
IXLYAMDSCSC_TSCFC DS 1FL4 Target storage class full counter             19585900
IXLYAMDSCSC_DEC DS 1FL4  Directory entry counter                        19586000
IXLYAMDSCSC_DAEC DS 1FL4 Data area element counter                      19586100
IXLYAMDSCSC_TCC DS 1FL4  Total changed counter                          19586200
IXLYAMDSCSC_DAC DS 1FL4  Data area counter                              19586300
IXLYAMDSCSC_CRLC DS 1FL4 Completed reference lists counter              19586400
IXLYAMDSCSC_PCRLC DS 1FL4 Partially completed reference lists counter   19586500
IXLYAMDSCSC_XILRC DS 1FL4 XI for local cache vector index replacement   19586600
IXLYAMDSCSC_WUXIC DS 1FL4 Write unchanged with XI counter               19586700
IXLYAMDSCSC_LEN EQU *-IXLYAMDSCSC                                       19586800
.L002C   ANOP                                                           19586900
         AIF   ('&IXLYAMDSCSC1' EQ 'NO').L002F                          19587000
         AIF   ('&DSECT' EQ 'YES').L0030                                19587100
         AIF   ('&IXLYAMDSCSC1' NE 'YES').L002F                         19587200
IXLYAMDSCSC1 DS 0F       Structure Entry for Cache Storage Class       *19587300
                         (SCSC), AmdaLevel1                             19587400
         AGO   .L0031                                                   19587500
.L0030   ANOP                                                           19587600
IXLYAMDSCSC1 DSECT       Structure Entry for Cache Storage Class       *19587700
                         (SCSC), AmdaLevel1                             19587800
.L0031   ANOP                                                           19587900
         DS    1CL0120   Mapped by IXLYAMDSCSC                          19588000
IXLYAMDSCSC1_UDERIC DS 1FL4 Unchanged directory entry with registered  *19588100
                         interest counter (LEVEL8)                      19588200
         DS    1CL0068   Reserved                                       19588300
IXLYAMDSCSC1_LEN EQU *-IXLYAMDSCSC1                                     19588400
.L002F   ANOP                                                           19588500
*                                                                       19588600
* ********************************************************************  19589100
* **************** Structure Cache CastOut Class Information Header***  19590000
* ********************************************************************  19590900
*                                                                       19591800
*                                                                       19592700
         AIF   ('&IXLYAMDSCOC' EQ 'NO').L0032                           19593500
         AIF   ('&DSECT' EQ 'YES').L0033                                19594300
         AIF   ('&IXLYAMDSCOC' NE 'YES').L0032                          19595100
IXLYAMDSCOC DS 0F        Structure Entry for Cache CastOut Class       *19596000
                         (SCOC)                                         19596600
         AGO   .L0034                                                   19597300
.L0033   ANOP                                                           19598000
IXLYAMDSCOC DSECT        Structure Entry for Cache CastOut Class       *19598700
                         (SCOC)                                         19599300
.L0034   ANOP                                                           19600200
IXLYAMDSCOC_TYPE DS 1BL1 X'24' -- indicates STR data for CastOut       *19601200
                         Classes                                        19602600
         DS    1CL0003   Unused                                         19603500
IXLYAMDSCOC_LENGTH DS 1FL4 Length of IXLYAMDSCOC entry mapping          19604400
IXLYAMDSCOCSTATS@ DS 1AL4 Address of the SCOC entry. An address of 0   *19605000
                         indicates no entries were processed            19605600
IXLYAMDSCOCBEG DS 1FL2   First castout class in the range of castout   *19606200
                         classes processed                              19607100
IXLYAMDSCOCEND DS 1FL2   Last castout class in the range of castout    *19608000
                         classes processed                              19608900
IXLYAMDSCOC_LEN EQU *-IXLYAMDSCOC                                       19611600
.L0032   ANOP                                                           19612100
*                                                                       19612700
* *****************Cast Out Class Statistics**************************  19612900
*                                                                       19613100
*                                                                       19613300
         AIF   ('&IXLYAMDSCOCSTATS' EQ 'NO').L0035                      19613500
         AIF   ('&DSECT' EQ 'YES').L0036                                19613700
         AIF   ('&IXLYAMDSCOCSTATS' NE 'YES').L0035                     19613900
IXLYAMDSCOCSTATS DS 0F   Cast Out Class Stats                           19614100
         AGO   .L0037                                                   19614300
.L0036   ANOP                                                           19614500
IXLYAMDSCOCSTATS DSECT   Cast Out Class Stats                           19614700
.L0037   ANOP                                                           19614800
IXLYAMDSCOCENTRY DS 1FL4 Number of data elements associated with       *19615000
                         entries in the indicated castout class         19615100
IXLYAMDSCOCSTATS_LEN EQU *-IXLYAMDSCOCSTATS                             19615300
.L0035   ANOP                                                           19615900
*                                                                       19616600
* ********************************************************************  19641600
* ******************** Subchannel Entry ******************************  19666600
* ********************************************************************  19716600
*                                                                       19766600
*                                                                       19816600
         AIF   ('&IXLYAMDSC' EQ 'NO').L0038                             19866600
         AIF   ('&DSECT' EQ 'YES').L0039                                19916600
         AIF   ('&IXLYAMDSC' NE 'YES').L0038                            19966600
IXLYAMDSC DS   0F        Subchannel Entry (SC)                          20016600
         AGO   .L003A                                                   20066600
.L0039   ANOP                                                           20116600
IXLYAMDSC DSECT          Subchannel Entry (SC)                          20166600
.L003A   ANOP                                                           20216600
IXLYAMDSC_TYPE DS 1BL1   X'30' -- indicates SC data                     20266600
         DS    1CL0003   Unused                                         20316600
IXLYAMDSC_LENGTH DS 1FL4 Length of IXLYAMDSC entry mapping              20366600
IXLYAMDSC_SCNEXT DS 1AL4 Address of next SC entry. A value of 0 means  *20416600
                         last entry for this facility                   20466600
*                                                                       20516600
* ******************* Configuration Data  *************************  *  20566600
*                                                                       20616600
*                                                                       20666600
IXLYAMDSC_SCNUMBER DS 1FL2 Subchannel number                            20716600
IXLYAMDSC_PAM DS 1BL1    Path available mask for coupling facility     *20746600
                         subchannels                                    20776600
IXLYAMDSC_PIM DS 1BL1    Path installed mask for coupling facility     *20806600
                         subchannels                                    20836600
IXLYAMDSC_CHPID_SET DS 0CL0008 Set of CHPIDs                            20866600
IXLYAMDSC_CHPIDS DS 1BL1 CHPID array for coupling facility subchannels  20916600
         ORG   IXLYAMDSC_CHPID_SET+X'00000008'                          20966600
IXLYAMDSC_SCDEVICE DS 1FL2 Subchannel device number                     20999900
IXLYAMDSC_SUBCH_STATUS DS 0BL2 Subchannel status                        21007300
IXLYAMDSC_NOTOPERATIONAL EQU X'80' Subchannel not operational           21014700
IXLYAMDSC_NOTINUSE EQU X'40' Subchannel operational but not being used *21022100
                         for operations                                 21029500
IXLYAMDSC_ACTIVE EQU X'20' Subchannel operational and used for         *21036900
                         operations                                     21044300
         ORG   IXLYAMDSC_SUBCH_STATUS+X'00000002'                       21051700
IXLYAMDSC_CHPIDSETTYPE DS 0CL0008 Set of CHPID Types                    21054600
IXLYAMDSC_CHPIDSTYPE DS 1FL1 CHPID array for channel path type          21057500
         ORG   IXLYAMDSC_CHPIDSETTYPE+X'00000008'                       21060400
         DS    1CL0004   Reserved                                       21063300
*                                                                       21066600
*   *************** Contention data  *******************************    21116600
*                                                                       21166600
*                                                                       21216600
IXLYAMDSC_SUBCH_BUSY DS 1FL4 Subchannel busy count. Compare to the     *21256600
                         utilization count below.                       21296600
IXLYAMDSC_ALLPATHS_BUSY DS 1FL4 All path busy termination count.       *21336600
                         Compare to the utilization count below.        21376600
IXLYAMDSC_UTILIZATION DS 1FL4 Utilization count -- Number of times     *21416600
                         this subchannel was picked for an operation    21466600
         DS    1CL0016                                                  21516600
IXLYAMDSC_LEN EQU *-IXLYAMDSC                                           21566600
.L0038   ANOP                                                           21616600
         AIF   ('&IXLYAMDSC1' EQ 'NO').L003B                            21666600
         AIF   ('&DSECT' EQ 'YES').L003C                                21716600
         AIF   ('&IXLYAMDSC1' NE 'YES').L003B                           21766600
IXLYAMDSC1 DS  0X        Subchannel Entry (SC), AmdaLevel1              21816600
         AGO   .L003D                                                   21866600
.L003C   ANOP                                                           21916600
IXLYAMDSC1 DSECT         Subchannel Entry (SC), AmdaLevel1              21966600
.L003D   ANOP                                                           22016600
         DS    1CL0068   Mapped by IXLYAMDSC                            22066600
         DS    1CL0060   Reserved                                       22116600
IXLYAMDSC1_LEN EQU *-IXLYAMDSC1                                         22134100
.L003B   ANOP                                                           22151600
*                                                                       22169100
* ********************************************************************  22186600
* *                   Structure copy controls                        *  22204100
* *                                                                  *  22221600
* * This record is returned only when AMDALEVEL of at least 1        *  22239100
* * is specified.                                                       22256600
* ********************************************************************  22274100
*                                                                       22291600
*                                                                       22309100
         AIF   ('&IXLYAMDSSCC' EQ 'NO').L003E                           22326600
         AIF   ('&DSECT' EQ 'YES').L003F                                22344100
         AIF   ('&IXLYAMDSSCC' NE 'YES').L003E                          22361600
IXLYAMDSSCC DS 0F        Structure copy controls record                 22379100
         AGO   .L0040                                                   22396600
.L003F   ANOP                                                           22414100
IXLYAMDSSCC DSECT        Structure copy controls record                 22431600
.L0040   ANOP                                                           22449100
IXLYAMDSSCC_TYPE DS 1BL1 X'25' -- indicates SSCC data                   22466600
         DS    1CL0003   Unused                                         22484100
IXLYAMDSSCC_LENGTH DS 1FL4 Length of IXLYAMDSSCC entry mapping          22501600
         DS    1CL0016   Reserved                                       22519100
IXLYAMDSSCC_COPYCONTROLS DS 1CL0512 Structure copy controls (LEVEL8)    22536600
         DS    1CL0032   Reserved                                       22554100
*                                                                       22573700
* ********************************************************************  22577200
* *****************Structure types************************************  22580800
* ********************************************************************  22584300
*                                                                       22587900
*                                                                       22595000
IXLYAMDA_LIST EQU X'03'  List structure                                 22602100
IXLYAMDA_CACHE EQU X'04' Cache Structure                                22609200
IXLYAMDA_LOCK EQU X'FF'  Lock Structure                                 22612900
*                                                                       22615900
* *****************Channel Path Types*********************************  22618900
* ********************************************************************  22621900
*                                                                       22624900
*                                                                       22627900
IXLYAMDA_CHPIDTYPE_CFS EQU X'0B' CHPID TYPE for CF Sender chpid         22630900
IXLYAMDA_CHPIDTYPE_CBS EQU X'16' CHPID TYPE for CF Cluster Bus Sender   22633900
IXLYAMDA_CHPIDTYPE_ICS EQU X'18' CHPID TYPE for CF Internal Coupling   *22636900
                         Sender                                         22639900
IXLYAMDA_CHPIDTYPE_CBP EQU X'21' CHPID TYPE for CF Integrated Cluster  *22642900
                         Bus Peer                                       22645900
IXLYAMDA_CHPIDTYPE_CFP EQU X'22' CHPID TYPE for CF Peer chpid           22648900
IXLYAMDA_CHPIDTYPE_ICP EQU X'23' CHPID TYPE for CF Internal Coupling   *22651900
                         Peer                                           22654900
IXLYAMDSSCC_LEN EQU *-IXLYAMDSSCC                                       22662900
.L003E   ANOP                                                           22712900
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 23216600
         AIF   ('&LIST' EQ 'YES').P4                                    23266600
.P3      ANOP                                                           23316600
         POP   PRINT                                                    23366600
.P4      ANOP                                                           23416600
.P_EXIT  ANOP                                                           23466600
         MEND                                                           23516600
**/ IXLYAMDA_2:;                                                        23566600
* %IXLYAMDA_INCLUDED = 'YES';                                           23616600
* %DCL ZCBPRINT CHAR EXT;                                               23666600
* %DEACTIVATE ZCBPRINT;                                                 23716600
* %DCL IXLYAMDA_LIST CHAR EXT;                                          23766600
* %DEACTIVATE IXLYAMDA_LIST;                                            23816600
* %IF IXLYAMDA_LIST ^= 'NO' &                                           23866600
*    ZCBPRINT ^= 'NO' %THEN                                             23916600
*   %GOTO IXLYAMDA_3;                                                   23966600
*   @LIST PUSH NOECHO;                                                  24016600
*   @LIST NOASSEMBLE NOECHO;                                            24066600
*   @LIST OFF C NOECHO;                                                 24116600
* %IXLYAMDA_3:;                                                         24166600
*/* Start of PL/X Source                                             */ 24216600
*  %IF IXLYAMDA_ALET = '' %THEN                                         24316600
*     %IXLYAMDA_ALET = '0';                                             24366600
*  %IXLYAMDA_VIA = '';                                                  24416600
*  %IF IXLYAMDA_ALET ^= '0' %THEN                                       24466600
*     %IXLYAMDA_VIA = 'VIA(IXLYAMDA_ALET)';                             24516600
*                                                                       24566600
*/********************************************************************/ 24591600
*/****************** AMDA Header *************************************/ 24616600
*/********************************************************************/ 24641600
*                                                                       24666600
*   DECLARE                                                             24708200
*     1    IXLYAMDAREA BASED IXLYAMDA_VIA, /* Data area returned to     24749800
*                                      caller                        */ 24791400
*       3    IXLYAMDAREA_Length FIXED(32), /* Length of IXLYAMDAREA     24833000
*                                      header mapping                */ 24874600
*       3    IXLYAMDAREA_CFEnt@ PTR(31), /* Address of first CF         24916200
*                                      entry. A value of zero means     24957800
*                                      that no CF entries were          24999400
*                                      provided                      */ 25041000
*       3    IXLYAMDAREA_TLen FIXED(32), /* Total length of output      25082600
*                                      data area needed to contain      25124200
*                                      all the requested information.   25165800
*                                      This length includes the area    25207400
*                                      for the records that WERE        25249000
*                                      returned on this call.        */ 25290600
*       3    IXLYAMDAREA_#Ent FIXED(32), /* Total number of entries     25332200
*                                      of all kinds (not including      25373800
*                                      the header)                   */ 25415400
*       3    IXLYAMDAREA_Version FIXED(8), /* Version number - Maximum  25441400
*                                      CFLEVEL supported by MVS on      25467400
*                                      system where IXLMG was invoked.  25493400
*                                      Can be used to determine if      25519400
*                                      specific fields have valid       25545400
*                                      information. See notes in prolog 25571400
*                                      for more information      @02C*/ 25597400
*       3    *        CHAR(3);      /* Unused                        */ 25623400
*                                                                       25624700
*/********************************************************************/ 25626000
*/*****  Mapping of portion of entry common to all entries  **** @01C*/ 25627300
*/********************************************************************/ 25628600
*                                                                       25629900
*   DECLARE                                                             25631200
*     1    IXLYAMDHD BASED,         /* Common header mapping for        25632500
*                                      IXLYAMDA entries              */ 25633800
*       3    IXLYAMDHD_Type BIT(8), /* Type of entry                 */ 25635100
*       3    *        CHAR(3),      /* Unused                        */ 25636400
*       3    IXLYAMDHD_Length FIXED(32), /* Length of entry          */ 25637700
*       3    IXLYAMDHD_Next PTR(31); /* Address of next entry.       */ 25639000
*                                                                       25640300
*/********************************************************************/ 25641600
*/**************** Entry Types ********************************  @01C*/ 25642900
*/********************************************************************/ 25644200
*                                                                       25645500
*   DECLARE                                                             25646800
*     IXLYAMDA_TypeCF BIT(8) CONSTANT('10'X), /* Type for CF block   */ 25648100
*     IXLYAMDA_TypeSLL BIT(8) CONSTANT('11'X), /* Type for SLL block */ 25649400
*     IXLYAMDA_TypeSLC BIT(8) CONSTANT('12'X), /* Type for SLC block */ 25650700
*     IXLYAMDA_TypeCFMI BIT(8) CONSTANT('13'X), /* Type for CFMI        25652000
*                                      block                     @D1A*/ 25653300
*     IXLYAMDA_TypeSTRL BIT(8) CONSTANT('21'X), /* Type for STRL        25654600
*                                      block                         */ 25655900
*     IXLYAMDA_TypeSTRC BIT(8) CONSTANT('22'X), /* Type for STRC        25657200
*                                      block                         */ 25658500
*     IXLYAMDA_TypeSCSC BIT(8) CONSTANT('23'X), /* Type for SCSC        25659800
*                                      block                         */ 25661100
*     IXLYAMDA_TypeSCOC BIT(8) CONSTANT('24'X), /* Type for SCOC        25662400
*                                      block                         */ 25663700
*     IXLYAMDA_TypeSSCC BIT(8) CONSTANT('25'X), /* Type for SSCC        25664100
*                                      block                     @PFC*/ 25664500
*     IXLYAMDA_TypeSC BIT(8) CONSTANT('30'X); /* Type for SC block   */ 25665000
*                                                                       25666600
*                                                                       25683200
*/********************************************************************/ 25699800
*/********************** Facility Entry  *****************************/ 25716600
*/********************************************************************/ 25736600
*                                                                       25756600
*/********************** Facility Entry ******************************/ 25776600
*/************************* Header ***********************************/ 25796600
*                                                                       25816600
*   DECLARE                                                             25854100
*     1    IXLYAMDCF BASED IXLYAMDA_VIA, /* Coupling Facility (CF)      25891600
*                                      Entry                         */ 25929100
*       3    IXLYAMDCF_Type BIT(8), /* Indication of type of data       25966600
*                                      X'10' indicates CF entry      */ 26004100
*       3    *        CHAR(3),      /* Unused                        */ 26041600
*       3    IXLYAMDCF_Length FIXED(32), /* Length of IXLYAMDCF entry   26079100
*                                      mapping                       */ 26116600
*       3    IXLYAMDCF_CFNext PTR(31), /* Address of next CF entry. A   26154100
*                                      value of 0 indicates last        26191600
*                                      entry.                        */ 26229100
*       3    IXLYAMDCF_SL@ PTR(31), /* Address of first CF structure    26266600
*                                      limits entry. A value of 0       26304100
*                                      indicates last entry.         */ 26341600
*       3    IXLYAMDCF_STR@ PTR(31), /* Address of first STR record     26379100
*                                      for this CF. A value of zero     26416600
*                                      means that no STR records were   26454100
*                                      provided for this CF.         */ 26491600
*       3    IXLYAMDCF_SC@ PTR(31), /* Address of first subchannel      26529100
*                                      entry for this CF. A value of    26566600
*                                      zero means that no SC records    26604100
*                                      were provided for this CF     */ 26641600
*       3    IXLYAMDCF_MI@ PTR(31), /* Address of the measurement       26679100
*                                      information entry for this CF.   26716600
*                                      a value of zero means that the   26754100
*                                      MI record was not provided for   26791600
*                                      this CF                       */ 26829100
*                                                                       26866600
*/********************** Facility Entry  *****************************/ 26916600
*/*********************Configuration Data*****************************/ 26966600
*                                                                       27116600
*       3    IXLYAMDCF_Cfid FIXED(32), /* Facility ID number         */ 27132900
*       3    IXLYAMDCF_CFname CHAR(8), /* Facility Name              */ 27149200
*       3    IXLYAMDCF_ND CHAR(32), /* Hardware Node Descriptor for     27165500
*                                      the facility. Mapped by          27181800
*                                      IXLYNDE.                      */ 27198100
*       3    *        CHAR(2),      /* Unused                        */ 27214400
*       3    IXLYAMDCF_SidMax FIXED(16), /* Maximum SID value        */ 27230700
*       3    IXLYAMDCF_Flags BIT(8), /* Flags                        */ 27247000
*         5    IXLYAMDCF_Connected BIT(1), /* Connected = Managed +     27263300
*                                      Available, which indicates       27279600
*                                      operations can be allowed        27295900
*                                      against the facility. If this    27312200
*                                      bit is off the facility          27328500
*                                      control information returned     27344800
*                                      will be from the last time the   27361100
*                                      facility was connected and may   27377400
*                                      be downlevel.                 */ 27393700
*         5    IXLYAMDCF_Managed BIT(1), /* The facility is in the      27410000
*                                      XCF Policy and XCF wishes to     27426300
*                                      use this facility             */ 27442600
*         5    IXLYAMDCF_Available BIT(1), /* This system has           27458900
*                                      physical paths connected to      27475200
*                                      the facility                  */ 27491500
*         5    IXLYAMDCF_Volatile BIT(1), /* This facility's storage    27507800
*                                      is volatile when this bit = 1    27524100
*                                      nonvolatile when this bit = 0 */ 27540400
*       3    *        CHAR(3),      /* Unused                        */ 27556700
*       3    IXLYAMDCF_PathMasks CHAR(8), /* Pathing masks currently    27573000
*                                      in use                        */ 27589300
*         5    IXLYAMDCF_PHYSPM BIT(8), /* Physical path mask - paths   27605600
*                                      which have a physical            27622000
*                                      connection to the facility    */ 27637100
*         5    IXLYAMDCF_VARYPM BIT(8), /* VARY path mask - paths       27652200
*                                      which have a logical             27667300
*                                      connection to the facility    */ 27682400
*         5    IXLYAMDCF_XCFPM BIT(8), /* XCF path mask - paths         27697500
*                                      connected to the facility in     27712600
*                                      the active policy             */ 27727700
*         5    IXLYAMDCF_COMPPM BIT(8), /* Composite path mask =        27742800
*                                      PHYSPM + VARYPM + XCFPM       */ 27757900
*         5    *        CHAR(1),    /* Unused                        */ 27773000
*         5    IXLYAMDCF_Invalid BIT(8), /* Invalid paths mask -        27788100
*                                      paths not connected to correct   27803200
*                                      facility                      */ 27818300
*         5    IXLYAMDCF_NotValidated BIT(8), /* NotValidated paths     27833400
*                                      mask -- paths not connected   */ 27848500
*         5    *        CHAR(1),    /* Unused                        */ 27863600
*       3    IXLYAMDCF_Sequence FIXED(32), /* Sequence number. This     27878700
*                                      sequence number is changed       27893800
*                                      whenever a new "instance" of     27908900
*                                      this entity comes into use    */ 27924000
*       3    IXLYAMDCF_CUID BIT(16), /* Control unit ID              */ 27939100
*       3    *        CHAR(2),      /* Unused                        */ 27954200
*       3    IXLYAMDCF_HWInformation CHAR(64), /* Facility Hardware     27969300
*                                      information                   */ 27984400
*       3    *        CHAR(16),     /* Unused                        */ 27999500
*                                                                       28016600
*/********************** Facility Entry  *****************************/ 28049900
*/*************** Accounting and Measurement Data ********************/ 28083200
*                                                                       28116600
*       3    IXLYAMDCF_Subch_Contention FIXED(32), /* Count of times    28151600
*                                      a free subchannel was not        28186600
*                                      available for synchronous        28221600
*                                      immediate operations          */ 28256600
*       3    IXLYAMDCF_ContentionTime CHAR(8), /* Summed contention     28291600
*                                      time for waiting for             28326600
*                                      subchannels to become free       28361600
*                                      (u-sec) for synchronous          28396600
*                                      immediate operations          */ 28431600
*       3    IXLYAMDCF_ContentionTimeSQR CHAR(8), /* Summed             28466600
*                                      contention time for waiting      28501600
*                                      for subchannels to become free   28536600
*                                      (u-sec squared) for              28571600
*                                      synchronous immediate            28606600
*                                      operations                    */ 28641600
*       3    IXLYAMDCF_Subch_Allocated FIXED(31), /* Count of number    28676600
*                                      of subchannels that this         28711600
*                                      facility has been allocated   */ 28746600
*       3    IXLYAMDCF_Subch_Inuse FIXED(32), /* Count of number of     28781600
*                                      subchannels available for use */ 28816600
*       3    IXLYAMDCF_Subch_MaxLimit FIXED(32), /* Count of total      28851600
*                                      number of subchannels that       28886600
*                                      could be used for operations     28921600
*                                      if available                  */ 28956600
*       3    IXLYAMDCF_Structure_Count FIXED(32), /* Count of number    28991600
*                                      of structures in use by          29026600
*                                      connectors from this system   */ 29061600
*       3    *        CHAR(4),      /* Unused                        */ 29096600
*       3    IXLYAMDCF_FailedOpTimeCount FIXED(32), /* Count of the     29131600
*                                      number of summed times -- for    29166600
*                                      unsuccessful operations       */ 29201600
*       3    IXLYAMDCF_FailedOpSumTime CHAR(8), /* Summed service       29236600
*                                      time of unsuccessful             29271600
*                                      operations (u-sec)            */ 29306600
*       3    IXLYAMDCF_FailedOpSumTimeSQR CHAR(8), /* Square of the     29341600
*                                      summed service time of           29376600
*                                      unsuccessful operations (u-sec   29411600
*                                      squared)                      */ 29446600
*       3    *        CHAR(16),     /* Unused                        */ 29481600
*                                                                       29516600
*/********************** Facility Entry  *****************************/ 29549900
*/******************* Control Information ****************************/ 29583200
*                                                                       29616600
*       3    IXLYAMDCF_TS FIXED(32), /* Total facility space in 4K      29643200
*                                      blocks. Facility space is made   29669800
*                                      up of free space, dump space     29696400
*                                      and structure space           */ 29723000
*       3    IXLYAMDCF_FS FIXED(32), /* Total Free space in 4K          29749600
*                                      blocks. Free Space = Free        29776200
*                                      control space + free             29802800
*                                      non-control space             */ 29829400
*       3    IXLYAMDCF_TCS FIXED(32), /* Total Control space in 4K      29856000
*                                      blocks. Control space + non-     29882600
*                                      control space = total space   */ 29909200
*       3    IXLYAMDCF_FCS FIXED(32), /* Total Free control space in    29935800
*                                      4K blocks                     */ 29962400
*       3    IXLYAMDCF_GDC,         /* Global dumping controls       */ 29989000
*         5    IXLYAMDCF_TDS FIXED(32), /* Total Dumping Space in 4K    30015600
*                                      blocks. If TDS is lower than     30042200
*                                      the MRDS then the dump space     30068800
*                                      is not large enough to contain   30095400
*                                      the largest structure that was   30122000
*                                      dumped.                       */ 30148600
*         5    IXLYAMDCF_FDS FIXED(32), /* Free Dumping Space in 4K     30175200
*                                      blocks. If FDS is smaller than   30201800
*                                      the MRDS than there is not       30228400
*                                      enough available dump space to   30255000
*                                      contain the largest structure    30281600
*                                      that was dumped.              */ 30308200
*         5    IXLYAMDCF_ADTC FIXED(32), /* Associated dump table       30334800
*                                      count. If this count is          30361400
*                                      frequently more than one then    30388000
*                                      multiple structures are being    30414600
*                                      dumped at the same time       */ 30441200
*         5    IXLYAMDCF_MRDS FIXED(32), /* Maximum Requested Dumping   30467800
*                                      Space in 4K blocks        @L1C*/ 30494400
*       3    IXLYAMDCF_MDX FIXED(8), /* Largest Data Element size,      30521000
*                                      where size in bytes is           30547600
*                                      256*(2**MDX)                  */ 30574200
*       3    *        CHAR(1),                                          30600800
*       3    IXLYAMDCF_STGI FIXED(16), /* Storage increment in 4K       30627400
*                                      blocks                        */ 30654000
*       3    IXLYAMDCF_CFLEVEL FIXED(32), /* Coupling facility          30680600
*                                      architected function level       30707200
*                                                                @P6A*/ 30733800
*       3    *        CHAR(12),     /* Unused                    @P6C*/ 30760400
*       3    *        CHAR(0);                                          30787000
*                                                                       30816600
*   DECLARE                                                             30823700
*     1    IXLYAMDCF1 BASED IXLYAMDA_VIA, /* Coupling Facility (CF)     30830800
*                                      Entry, AmdaLevel1         @02A*/ 30837900
*       3    * CHAR(LENGTH(IXLYAMDCF)), /* Mapped by IXLYAMDCF          30845000
*                                                                @02A*/ 30852100
*       3    * CHAR(128);           /* Reserved                  @02A*/ 30859200
*/********************************************************************/ 30866600
*/**************** List Structure Limits Entry************************/ 30916600
*/********************************************************************/ 30941600
*                                                                       30966600
*/**************** List Structure Limits Entry************************/ 30999900
*/*********************** Header *************************************/ 31033200
*                                                                       31066600
*   DECLARE                                                             31116600
*     1    IXLYAMDSLL BASED IXLYAMDA_VIA, /* Structure Limits for a     31166600
*                                      List Structure (SLL) Entry    */ 31216600
*       3    IXLYAMDSLL_Type BIT(8), /* X'11' -- indicates SLL data     31266600
*                                      for CF                        */ 31316600
*       3    *        CHAR(3),      /* Unused                        */ 31366600
*       3    IXLYAMDSLL_Length FIXED(32), /* Length of IXLYAMDSLL       31416600
*                                      entry mapping                 */ 31466600
*       3    IXLYAMDSLL_SLNext PTR(31), /* Address of next limit        31516600
*                                      entry. A value of 0 means last   31566600
*                                      entry for this facility.      */ 31616600
*                                                                       31666600
*/**************** List Structure Limits Entry************************/ 31691600
*/********************Structure Limits********************************/ 31716600
*                                                                       31766600
*       3    IXLYAMDSLL_LNL FIXED(32), /* List Header Number limit   */ 31796600
*       3    IXLYAMDSLL_LTECHL FIXED(8), /* List lock table entry       31826600
*                                      characteristic limit. The        31856600
*                                      maximum supported size of a      31886600
*                                      lock table entry in bytes is     31916600
*                                      2**LTECHL.                    */ 31946600
*       3    IXLYAMDSLL_UIDL FIXED(8), /* Userid Limit               */ 31976600
*       3    *        CHAR(2),      /* Unused                        */ 32006600
*       3    *        CHAR(16);     /* Unused                        */ 32036600
*                                                                       32066600
*   DECLARE                                                             32072100
*     1    IXLYAMDSLL1 BASED IXLYAMDA_VIA, /* Structure Limits for a    32077600
*                                      List Structure (SLL) Entry,      32083100
*                                      AmdaLevel1                @02A*/ 32088600
*       3    * CHAR(LENGTH(IXLYAMDSLL)), /* Mapped by IXLYAMDSLL        32094100
*                                                                @02A*/ 32099600
*       3    * CHAR(128);           /* Reserved                  @02A*/ 32105100
*                                                                       32110600
*/********************************************************************/ 32116600
*/**************** Cache Structure Limits Entry***********************/ 32166600
*/********************************************************************/ 32186600
*                                                                       32206600
*/**************** Cache Structure Limits Entry***********************/ 32226600
*/*************************** Header *********************************/ 32246600
*                                                                       32266600
*   DECLARE                                                             32316600
*     1    IXLYAMDSLC BASED IXLYAMDA_VIA, /* Structure Limits for       32366600
*                                      Cache Structure (SLC) Entry   */ 32416600
*       3    IXLYAMDSLC_Type BIT(8), /* X'12' -- indicates SLC data     32466600
*                                      for CF                        */ 32516600
*       3    *        CHAR(3),      /* Unused                        */ 32566600
*       3    IXLYAMDSLC_Length FIXED(32), /* Length of IXLYAMDSLC       32616600
*                                      entry mapping                 */ 32666600
*       3    IXLYAMDSLC_SLNext PTR(31), /* Address of next limit        32716600
*                                      entry. A value of 0 means last   32766600
*                                      entry for this facility.      */ 32816600
*                                                                       32866600
*/**************** Cache Structure Limits Entry***********************/ 32899900
*/******************* Structure Limits *******************************/ 32933200
*                                                                       32966600
*       3    IXLYAMDSLC_LCIDLMT FIXED(8), /* Cache local cache          33011000
*                                      identifier limit              */ 33055400
*       3    *        CHAR(2),      /* reserved                      */ 33099800
*       3    IXLYAMDSLC_SCLMT FIXED(8), /* Cache storage class limit */ 33144200
*       3    IXLYAMDSLC_CCLMT FIXED(16), /* Cache cast-out class        33188600
*                                      limit                         */ 33233000
*       3    *        CHAR(18),     /* Unused                        */ 33277400
*       3    *        CHAR(0);                                          33321800
*                                                                       33326700
*   DECLARE                                                             33331600
*     1    IXLYAMDSLC1 BASED IXLYAMDA_VIA, /* Structure Limits for a    33336500
*                                      Cache Structure (SLC) Entry,     33341400
*                                      AmdaLevel1                @02A*/ 33346300
*       3    * CHAR(LENGTH(IXLYAMDSLC)), /* Mapped by IXLYAMDSLC        33351200
*                                                                @02A*/ 33356100
*       3    * CHAR(28);            /* Reserved                  @02A*/ 33361000
*                                                                       33366600
*                                                                       33416600
*/********************************************************************/ 33466600
*/**************** Facility Measurement Information Entry********@D1A*/ 33499900
*/********************************************************************/ 33516500
*                                                                       33533100
*/**************** Facility Measurement Information Header ******@D1A*/ 33549700
*                                                                       33566600
*   DECLARE                                                             33567800
*     1    IXLYAMDCFMI BASED IXLYAMDA_VIA, /* Coupling Facility         33569000
*                                      Measurement Information (CFMI)   33570200
*                                      Entry                     @D1A*/ 33571400
*       3    IXLYAMDCFMI_Type BIT(8), /* X'13' -- indicates CFMI data   33572600
*                                      for CF                    @D1A*/ 33573800
*       3    *        CHAR(3),      /* Unused                    @D1A*/ 33575000
*       3    IXLYAMDCFMI_Length FIXED(32), /* Length of IXLYAMDCFMI     33576200
*                                      entry                     @D1A*/ 33577400
*       3    IXLYAMDCFMI_INFO@ PTR(31), /* Address of the measurement   33578600
*                                      information array. An address    33579800
*                                      of 0 indicates no elements are   33581000
*                                      provided                  @D1A*/ 33582200
*       3    IXLYAMDCFMI_INFOELEM FIXED(32); /* Number of elements in   33583400
*                                      the array Each element           33584600
*                                      contains the processor number    33585800
*                                      and the measurement block for    33587000
*                                      each valid processor      @D1A*/ 33588200
*                                                                       33589400
*/*****************Facility Measurement Info Element******************/ 33591300
*                                                                       33592600
*   DECLARE                                                             33593900
*     1    IXLYAMDCFMINFO BASED IXLYAMDA_VIA, /* Facility Measurement   33595200
*                                      Information Element       @D1A*/ 33596500
*       3    IXLYAMDCFMINFO_PNUM FIXED(32), /* Processor number for     33597800
*                                      which measurement information    33599100
*                                      is provided               @D1A*/ 33600400
*       3    IXLYAMDCFMINFO_PMB CHAR(64) BDY(WORD), /* Processor        33601700
*                                      measurement block         @D1A*/ 33603000
*         5    IXLYAMDCFMINFO_PEXTIME FIXED(32), /* Processor           33604300
*                                      execution time            @D1A*/ 33605600
*         5    IXLYAMDCFMINFO_PWTTIME FIXED(32), /* Processor wait      33606900
*                                      time                      @D1A*/ 33608200
*         5    *        CHAR(56);   /* reserved                  @D1A*/ 33609500
*                                                                       33610800
*/********************************************************************/ 33612100
*/**************** Structure Entry for List***************************/ 33613400
*/********************************************************************/ 33626700
*                                                                       33640000
*/******LIST*******Header*********************************************/ 33653300
*                                                                       33666600
*   DECLARE                                                             33712400
*     1    IXLYAMDSTRL BASED IXLYAMDA_VIA, /* Structure Entry for       33758200
*                                      List Structure (STRL)         */ 33804000
*       3    IXLYAMDSTRL_Type BIT(8), /* X'21' -- indicates STR data    33849800
*                                      for CF                        */ 33895600
*       3    *        CHAR(3),      /* Unused                        */ 33941400
*       3    IXLYAMDSTRL_Length FIXED(32), /* Length of IXLYAMDSTR      33987200
*                                      entry mapping                 */ 34033000
*       3    IXLYAMDSTRL_STRNext PTR(31), /* Address of next STR        34078800
*                                      entry. A value of 0 means last   34124600
*                                      entry for this facility.      */ 34170400
*                                                                       34216600
*/*******LIST****Configuration Data ******************************** */ 34266600
*                                                                       34316600
*       3    IXLYAMDSTRL_TTY FIXED(8), /* Structure type identifier  */ 34362400
*       3    IXLYAMDSTRL_TTY_Status CHAR(1),                            34408200
*         5    IXLYAMDSTRL_TypeSerList BIT(1), /* The List structure    34454000
*                                      is a serialized list      @L2A*/ 34499800
*         5    IXLYAMDSTRL_RBLDValid BIT(1), /* The structure rebuild   34505500
*                                      status indications reported in   34511200
*                                      the IXLYAMDSTRL_RBLDStatus are   34516900
*                                      valid -- These values will only  34522600
*                                      be valid and reported when       34528300
*                                      information is requested for a   34534000
*                                      particular structure      @PBA*/ 34539700
*       3    IXLYAMDSTRL_SID FIXED(16), /* Structure ID              */ 34545600
*       3    IXLYAMDSTRL_Version BIT(64), /* Structure version number.  34558300
*                                      Changes when a new physical      34571000
*                                      instance of the structure is     34583700
*                                      allocated (e.g., user- or        34596400
*                                      system-managed rebuild), and     34609100
*                                      there is at least one active     34621800
*                                      connector to observe the         34634500
*                                      allocation.               @PFC*/ 34647200
*         5    IXLYAMDSTRL_PhysicalVersion BIT(64), /* Structure        34659900
*                                      version number.                  34672600
*                                      Changes when a new physical      34685300
*                                      instance of the structure is     34698000
*                                      allocated (e.g., user- or        34710700
*                                      system-managed rebuild), and     34723400
*                                      there is at least one active     34736100
*                                      connector to observe the         34748800
*                                      allocation.               @L7A*/ 34761500
*       3    IXLYAMDSTRL_STRName CHAR(16), /* Structure name         */ 34774600
*       3    IXLYAMDSTRL_RBLDStatus BIT(8), /* Rebuild status flags     34780000
*                                      This information will only be    34785400
*                                      valid if IXLYAMDSTRL_RBLDValid   34790800
*                                      is set.                   @PBA*/ 34796200
*         5    IXLYAMDSTRL_StrInRebld BIT(1), /* ON indicates that      34801600
*                                      the structure is in rebuild      34807000
*                                                               @PBA*/  34812400
*         5    IXLYAMDSTRL_RebldOldStr BIT(1), /* ON indicates that     34817800
*                                      the structure information        34823200
*                                      pertains to the OLD structure    34828600
*                                                               @PBA*/  34834000
*         5    IXLYAMDSTRL_RebldNewStr BIT(1), /* ON indicates that     34839400
*                                      the structure information        34844800
*                                      pertains to the NEW structure    34850200
*                                                               @PBA*/  34855600
*         5    IXLYAMDSTRL_RebldDuplexStr BIT(1), /* ON indicates the   34856200
*                                      structure rebuild is a duplexing 34856800
*                                      rebuild.  OFF indicates the      34857400
*                                      structure rebuild is a normal    34858000
*                                      rebuild.  This bit only applies  34858600
*                                      when IXLYAMDSTRL_StrInRebld is   34859200
*                                      on.                       @03A*/ 34859800
*                                                                       34860400
*         5    IXLYAMDSTRL_RebldMethodStr  BIT(1), /* ON indicates the  34861000
*                                      structure rebuild is system      34861600
*                                      managed.  OFF indicates the      34862200
*                                      structure rebuild is user        34862800
*                                      managed.  This bit only applies  34863400
*                                      when IXLYAMDSTRL_StrInRebld is   34864000
*                                      on.                       @L8A*/ 34864600
*                                                                       34865200
*       3    *        CHAR(3),                                          34865800
*                                                                       34866600
*/******LIST***************** Measurement Data ********************* */ 34916600
*                                                                       34966600
*       3    IXLYAMDSTRL_Status CHAR(1), /* Structure status bits    */ 34970900
*         5    IXLYAMDSTRL_AMValid BIT(1), /* The following             34975200
*                                      measurement data is valid     */ 34979500
*/********************************************************************/ 34980300
*/* Begin fields whose validity is indicated by the              @L5A*/ 34981100
*/* IXLYAMDSTRL_AMValid flag                                     @L5A*/ 34981900
*/********************************************************************/ 34982700
*         5    IXLYAMDSTRL_DumpSerialHeld BIT(1), /* Dump               34983800
*                                      serialization is held against    34988100
*                                      this structure - internal        34992400
*                                      operations are failed, -         34996700
*                                      external operations are          35001000
*                                      delayed. Hardware control data   35005600
*                                      will not be available.        */ 35013700
*       3    *        CHAR(1),      /* Unused                    @05C*/ 35016400
*       3    IXLYAMDSTRL_AMDataSequence FIXED(16), /* Sequence number   35019100
*                                      associated with this instance    35021800
*                                      of Measurement Data from this    35024500
*                                      system.                   @05A*/ 35027200
*       3    IXLYAMDSTRL_Reqct FIXED(32), /* Total requests by          35029900
*                                      structure (this relates to       35038000
*                                      external requests such as        35046100
*                                      IXLLIST macro invocations, NOT   35054200
*                                      to requests sent to the          35062300
*                                      facility).                    */ 35070400
*       3    IXLYAMDSTRL_ReqctAsync FIXED(32), /* Total asynchronous    35078500
*                                      requests started              */ 35086600
*       3    IXLYAMDSTRL_ContCt FIXED(32), /* Total number of           35094700
*                                      requests that encountered        35102800
*                                      contention on a lock table       35110900
*                                      entry (LOCK structure only)   */ 35119000
*       3    IXLYAMDSTRL_FContCt FIXED(32), /* False contention count   35127100
*                                      = Total number of requests       35135200
*                                      that encountered false           35143300
*                                      contention on a lock table       35151400
*                                      entry (LOCK structure only)   */ 35159500
*       3    *        FIXED(32),    /* Reserved                      */ 35167600
*       3    IXLYAMDSTRL_HiWorkQueueCount FIXED(32), /* Current count   35175700
*                                      of the number of operations      35183800
*                                      queued for subchannel            35191900
*                                      contention                    */ 35200000
*       3    IXLYAMDSTRL_WorkQueueCount FIXED(32), /* Current count     35208100
*                                      of the number of operations      35216200
*                                      queued for subchannel            35224300
*                                      contention                    */ 35232400
*       3    IXLYAMDSTRL_DelayQueueCount FIXED(32), /* Current count    35240500
*                                      of the number of operations      35248600
*                                      delayed for dump serialization   35252600
*                                      and/or a system-managed process  35256600
*                                      (e.g., rebuild)           @L5C*/ 35260600
*       3    IXLYAMDSTRL_DumpSerialReleased FIXED(32), /* Count of      35264800
*                                      the number of times dump         35272900
*                                      serialization was obtained and   35281000
*                                      released for this structure   */ 35289100
*       3    IXLYAMDSTRL_SyncTimeCount FIXED(32), /* Count of the       35297200
*                                      number of summed times -- for    35305300
*                                      successful operations. This      35313400
*                                      count represents synchronous     35321500
*                                      operations to the coupling       35329600
*                                      facility.                     */ 35337700
*       3    IXLYAMDSTRL_SyncSumTime CHAR(8), /* Summed service time    35345800
*                                      (u-sec)                       */ 35353900
*       3    IXLYAMDSTRL_SyncSumTimeSQR CHAR(8), /* Summed service      35362000
*                                      time (u-sec squared)          */ 35370100
*       3    IXLYAMDSTRL_AsyncTimeCount FIXED(32), /* Count of the      35378200
*                                      number of summed times -- for    35386300
*                                      asynchronous operations. This    35394400
*                                      count represents asynchronous    35402500
*                                      operations to the coupling       35410600
*                                      facility.                     */ 35418700
*       3    IXLYAMDSTRL_AsyncSumTime CHAR(8), /* Summed service time   35426800
*                                      (u-sec)                       */ 35434900
*       3    IXLYAMDSTRL_AsyncSumTimeSQR CHAR(8), /* Summed service     35443000
*                                      time squared (u-sec squared)  */ 35451100
*       3    IXLYAMDSTRL_QueueTimeCount FIXED(32), /* Count of the      35459200
*                                      number of summed times -- for    35467300
*                                      operation queue time          */ 35475400
*       3    IXLYAMDSTRL_QueueSumTime CHAR(8), /* Summed queue time     35483500
*                                      (u-sec)                       */ 35491600
*       3    IXLYAMDSTRL_QueueSumTimeSQR CHAR(8), /* Summed queue       35499700
*                                      time squared (u-sec squared)  */ 35507800
*       3    IXLYAMDSTRL_DelayTimeCount FIXED(32), /* Count of the      35515900
*                                      number of summed times -- for    35524000
*                                      operation delay time for dump    35532100
*                                      serialization                 */ 35540200
*       3    IXLYAMDSTRL_DelaySumTime CHAR(8), /* Summed delay time     35548300
*                                      (u-sec)                       */ 35556400
*       3    IXLYAMDSTRL_DelaySumTimeSQR CHAR(8), /* Summed delay       35564500
*                                      time squared (u-sec squared)  */ 35572600
*       3    IXLYAMDSTRL_SyncToAsyncCount FIXED(32), /* Count of the    35580700
*                                      number of times a synchronous    35588800
*                                      operation could not be           35596900
*                                      performed synchronously and      35605000
*                                      was changed to an asynchronous   35613100
*                                      operation                     */ 35621200
*       3    IXLYAMDSTRL_TotalHiWorkCount FIXED(32), /* Total count     35629300
*                                      of the number of operations      35637400
*                                      queued for subchannel            35645500
*                                      contention                @P7A*/ 35653600
*       3    IXLYAMDSTRL_TotalWorkCount FIXED(32), /* Total count       35661700
*                                      of the number of operations      35669800
*                                      queued for subchannel            35677900
*                                      contention                @P7A*/ 35686000
*       3    *        CHAR(4),      /* RESERVED                      */ 35696900
*                                                                       35707800
*/********************************************************************/ 35708500
*/* End fields whose validity is indicated by the                @L5A*/ 35709200
*/* IXLYAMDSTRL_AMValid flag                                     @L5A*/ 35709900
*/********************************************************************/ 35710600
*                                                                       35711300
*/***LIST*****Control Structure Information ***********************  */ 35712200
*                                                                       35716600
*       3    IXLYAMDSTRL_DataFlags Bit(8),                              35728000
*         5    IXLYAMDSTRL_Valid BIT(1), /* The following list          35739400
*                                      control structure information    35750800
*                                      is valid                      */ 35762200
*/********************************************************************/ 35764400
*/* Begin fields whose validity is indicated by the              @L5A*/ 35766600
*/* IXLYAMDSTRL_Valid flag                                       @L5A*/ 35768800
*/********************************************************************/ 35771000
*         5    *        BIT(3),     /* reserved                      */ 35773600
*         5    IXLYAMDSTRL_DTSValid BIT(1), /* Structure dump table     35785000
*                                      size information is valid     */ 35796400
*       3    *        CHAR(2),      /* not used                  @L3C*/ 35807800
*       3    IXLYAMDSTRL_Flags2 BIT(8),  /* Flags                @L3A*/ 35819200
*         5    IXLYAMDSTRL_REIPI BIT(1), /* Reapportionment in          35830600
*                                      progress indicator.  1=structure 35842000
*                                      ALTER to change ratio is in      35853400
*                                      progress (LEVEL1)         @L3A*/ 35864800
*         5    IXLYAMDSTRL_SSCI BIT(1), /* Structure size change in     35876200
*                                      progress indicator.  1=structure 35887600
*                                      ALTER to change structure size   35899000
*                                      is in progress (LEVEL1)   @L3A*/ 35910400
*         5    IXLYAMDSTRL_MREIPI BIT(1), /* Monitor Reapportionment    35913600
*                                      change in progress indicator.    35916800
*                                      1=structure ALTER to change      35920000
*                                      Event Monitor Controls           35923200
*                                      is in progress (LEVEL4)   @02A*/ 35926400
*         5    * BIT(5),            /* unused                    @02C*/ 35929600
*       3    IXLYAMDSTRL_MDLES FIXED(8), /* Maximum data list entry     35933200
*                                      size (maximum number of          35944600
*                                      elements per entry)           */ 35956000
*       3    IXLYAMDSTRL_STFlags BIT(8),                                35967400
*         5    IXLYAMDSTRL_ST BIT(8), /* Structure type values   @L9C*/ 35970300
*           7    IXLYAMDSTRL_ST_SKI BIT(1), /* Secondary key indicator  35973200
*                                      0 ==> Secondary keys are not     35976100
*                                      supported.  1 ==> Secondary keys 35979000
*                                      are supported.                   35981900
*                                      (CF level >=9)            @L9A*/ 35984800
*           7    IXLYAMDSTRL_ST_PLEIDI BIT(1), /* Programmable          35987800
*                                      LEID indicator (LEVEL8)   @PEC*/ 35994700
*           7    IXLYAMDSTRL_ST_CI BIT(1), /* Count indicator. 1=       36001600
*                                      list limit accounting by         36013000
*                                      elements, 0 = list limit         36024400
*                                      accounting by entries         */ 36035800
*           7    IXLYAMDSTRL_ST_LI BIT(1), /* Lock Indicator         */ 36047200
*           7    IXLYAMDSTRL_ST_DI BIT(1), /* Data Indicator         */ 36058600
*           7    IXLYAMDSTRL_ST_AI BIT(1), /* Adjunct indicator      */ 36070000
*           7    IXLYAMDSTRL_ST_NI BIT(1), /* Name indicator         */ 36081400
*           7    IXLYAMDSTRL_ST_KI BIT(1), /* Key indicator          */ 36092800
*       3    IXLYAMDSTRL_LTECH FIXED(8), /* Lock table entry            36104200
*                                      characteristic. The width of a   36115600
*                                      lock table entry in bytes is     36127000
*                                      2**LTECH                      */ 36138400
*       3    IXLYAMDSTRL_LELX FIXED(8), /* List element                 36149800
*                                      characteristic. The size of a    36161200
*                                      list element in bytes is         36172600
*                                      256*(2**LELX)                 */ 36184000
*       3    IXLYAMDSTRL_NLE FIXED(32), /* Lock table entry count    */ 36195400
*       3    IXLYAMDSTRL_LC FIXED(32), /* List count - number of list   36206800
*                                      headers in the structure      */ 36218200
*       3    IXLYAMDSTRL_SS FIXED(32), /* Structure size in 4k blocks*/ 36229600
*       3    IXLYAMDSTRL_MSS FIXED(32), /* Maximum structure size in    36241000
*                                      4K blocks.                    */ 36252400
*       3    IXLYAMDSTRL_MINSS FIXED(32), /* Minimum structure size     36263800
*                                      in 4K blocks. The structure      36275200
*                                      may actually be allocated        36286600
*                                      smaller than this, but if so,    36298000
*                                      structure attributes such as     36309400
*                                      entry/element ratio will         36320800
*                                      differ significantly from        36332200
*                                      those which were requested.      36343600
*                                                                @P3C*/ 36355000
*       3    IXLYAMDSTRL_MLSELC FIXED(32), /* Maximum list set          36366400
*                                      element count. This count is     36377800
*                                      only substantially accurate.     36389200
*                                                                @P3C*/ 36400600
*       3    IXLYAMDSTRL_LSELC FIXED(32), /* List set element count     36412000
*                                      (count of list elements          36423400
*                                      currently in use)             */ 36434800
*       3    IXLYAMDSTRL_NLTEC FIXED(32), /* Non-zero lock table        36446200
*                                      entry count. This count is only  36453800
*                                      substantially accurate.   @PAC*/ 36461400
*       3    IXLYAMDSTRL_MLSEC FIXED(32), /* Maximum list set entry     36469000
*                                      count. LIST Structure = Total    36477100
*                                      number of entries in the         36485200
*                                      structure. LOCK Structure =      36493300
*                                      Maximum number of record data    36501400
*                                      elements. This count is only     36509500
*                                      substantially accurate.   @PAC*/ 36517600
*       3    IXLYAMDSTRL_LSEC FIXED(32), /* List set entry count.       36526000
*                                      LIST Structure = Number of       36531700
*                                      entries in the structure         36537400
*                                      which are currently in use.      36543100
*                                      LOCK Structure = Number of       36548800
*                                      record entries in the structure  36554500
*                                      which are currently in use.      36560200
*                                                                @PAC*/ 36565900
*       3    IXLYAMDSTRL_DTS FIXED(32), /* Structure dump table size    36571600
*                                      in 4k blocks                  */ 36583000
*       3    IXLYAMDSTRL_MRSS FIXED(32), /* Marginal structure size.    36594400
*                                      This is the true minimum size    36605800
*                                      with which the structure can     36617200
*                                      be allocated,  regardless of     36628600
*                                      ratio considerations.            36640000
*                                      (LEVEL1)                  @L3A*/ 36651400
*       3    IXLYAMDSTRL_TSS FIXED(32), /* Target structure size.       36662800
*                                      For a CFLEVEL 0 facility, the    36667100
*                                      target structure size will       36671400
*                                      be equal to the actual structure 36675700
*                                      size.  For a CFLEVEL 1 or higher 36680000
*                                      facility, the target structure   36684300
*                                      size will be equal to the target 36688600
*                                      structure size specified on the  36692900
*                                      initial allocate or subsequent   36697200
*                                      expand or contract request.      36701500
*                                      The target size may or may not   36705800
*                                      be equal to the actual size.     36710100
*                                      (LEVEL1)                  @D2C*/ 36714400
*       3    IXLYAMDSTRL_TMELC FIXED(32), /* Target maximum element     36719800
*                                      count.  For a CFLEVEL 0 facility 36723800
*                                      the target maximum element count 36727800
*                                      will be equal to the actual      36731800
*                                      maximum element count.  For      36735800
*                                      CFLEVEL 1 or higher facilities,  36739800
*                                      the target maximum element count 36743800
*                                      will reflect the target ratio    36747800
*                                      specified on the initial         36751800
*                                      allocate or subsequent           36755800
*                                      reapportionment request.  This   36759800
*                                      may or may not equal the actual  36763800
*                                      maximum element count.           36767800
*                                      (LEVEL1)                  @D2C*/ 36771800
*       3    IXLYAMDSTRL_TMEC FIXED(32), /* Target maximum entry        36776800
*                                      count.  For a CFLEVEL 0 facility 36780800
*                                      the target maximum entry count   36784800
*                                      will be equal to the actual      36788800
*                                      maximum entry count.  For        36792800
*                                      CFLEVEL 1 or higher facilities,  36796800
*                                      the target maximum entry count   36800800
*                                      will reflect the target ratio    36804800
*                                      specified on the initial         36808800
*                                      allocate or subsequent           36812800
*                                      reapportionment request.  This   36816800
*                                      may or may not equal the actual  36820800
*                                      maximum entry count.             36824800
*                                      (LEVEL1)                  @D2C*/ 36828800
*       3    IXLYAMDSTRL_PETELR FIXED(32), /* Pending entry to element  36833800
*                                      ratio.  This field is only       36845200
*                                      applicable to CFLEVEL 1 or       36856600
*                                      higher facilities.               36868000
*                                      (LEVEL1)                  @D2C*/ 36879400
*         5    IXLYAMDSTRL_PETELR_Entry FIXED(16), /* Entry ratio       36890800
*                                      portion (LEVEL1)          @L3A*/ 36902200
*         5    IXLYAMDSTRL_PETELR_Element FIXED(16), /* Element ratio   36913600
*                                      portion (LEVEL1)          @L3A*/ 36925000
*       3    Ixlyamdstrl_EmcCnt Fixed(32), /* Count of Event Monitor    36926300
*                                      Control (EMC) objects in use by  36927600
*                                      the structure.                   36928900
*                                      Applicable only if structure     36930200
*                                      allocated in CFLEVEL 3 or        36931500
*                                      higher facility.          @01A*/ 36932800
*       3    Ixlyamdstrl_MaxEmcCnt Fixed(32),  /* Maximum number of     36934100
*                                      EMCs for the structure.          36935400
*                                      Applicable only if structure     36936700
*                                      allocated in CFLEVEL 3 or        36938000
*                                      higher facility.          @01A*/ 36939300
*       3    Ixlyamdstrl_TMaxEmcCnt Fixed(32), /* Target Maximum        36940600
*                                      number of EMCs for the           36941900
*                                      structure.  Applicable only if   36943200
*                                      structure allocated in CFLEVEL 3 36944500
*                                      or higher facility.       @01A*/ 36945800
*/********************************************************************/ 36946200
*/* End fields whose validity is indicated by the                @L5A*/ 36946600
*/* IXLYAMDSTRL_Valid flag                                       @L5A*/ 36947000
*/********************************************************************/ 36947400
*       3    *        CHAR(0);                                          36947800
*                                                                       36966600
*   DECLARE                                                             36970400
*     1    IXLYAMDSTRL1 BASED IXLYAMDA_VIA, /* Structure Entry for a    36974200
*                                      List Structure (STRL),           36978000
*                                      AmdaLevel1                @02A*/ 36981800
*       3    * CHAR(LENGTH(IXLYAMDSTRL)), /* Mapped by IXLYAMDSTRL      36985600
*                                                                @02A*/ 36989400
*/********************************************************************/ 36990100
*/* Begin fields whose validity is indicated by the              @L5A*/ 36990800
*/* IXLYAMDSTRL_Valid flag                                       @L5A*/ 36991500
*/********************************************************************/ 36992200
*       3    Ixlyamdstrl_TEmcStgPct Fixed(16), /* Pending percent of    36993200
*                                      structure storage to be used as  36997000
*                                      EMCs, expressed in hundredths    37000800
*                                      of a percent (ie. range is       37004600
*                                      0 to 10000)               @02A*/ 37008400
*       3    * CHAR(2),             /* Reserved                  @L5A*/ 37008600
*       3    Ixlyamdstrl1_LSCUR Fixed(32), /* List set cursor           37008700
*                                      (LEVEL8)                  @PEC*/ 37008800
*       3    Ixlyamdstrl1_SCCVN Fixed(32), /* Structure copy            37009000
*                                      controls version number          37009100
*                                      (LEVEL8)                  @PEC*/ 37009200
*/********************************************************************/ 37009400
*/* End fields whose validity is indicated by the                @L5A*/ 37009600
*/* IXLYAMDSTRL_Valid flag                                       @L5A*/ 37009800
*/********************************************************************/ 37010000
*       3    * CHAR(104),           /* Reserved                  @L5C*/ 37010200
*       3    Ixlyamdstrl1_LogicalVersion BIT(64),  /* Logical           37010400
*                                      structure version number.        37010600
*                                      Used in conjunction with         37010800
*                                      the physical version             37011000
*                                      number to identify an            37011200
*                                      instance of a structure.         37011400
*                                      The value of this field          37011600
*                                      is set equal to the              37011800
*                                      physical version number          37012000
*                                      when the structure is            37012200
*                                      initially allocated.  It         37012400
*                                      changes when a process           37012600
*                                      that allocates a new             37012800
*                                      instance of the structure        37013000
*                                      (e.g., rebuild) is               37013200
*                                      user-managed, but not            37013400
*                                      when it is                       37013600
*                                      system-managed.           @L5A*/ 37013800
*       3    Ixlyamdstrl1_SSCCAddr PTR(31); /* Address of the           37014000
*                                      structure copy controls          37014200
*                                      information entry for this       37014400
*                                      structure.  A value of zero      37014600
*                                      means that the SSCC record       37014800
*                                      was not provided for this        37015000
*                                      structure because it was         37015200
*                                      not requested, not available,    37015400
*                                      or contained no information.     37015600
*                                                                @L5A*/ 37015800
*/********************************************************************/ 37016600
*/**************** Structure Entry for Cache**************************/ 37066600
*/********************************************************************/ 37091600
*                                                                       37116600
*/***CACHE*********Header*********************************************/ 37141600
*                                                                       37166600
*   DECLARE                                                             37197100
*     1    IXLYAMDSTRC BASED IXLYAMDA_VIA, /* Structure Entry for a     37227600
*                                      Cache Structure (STRC)        */ 37258100
*       3    IXLYAMDSTRC_Type BIT(8), /* X'22' -- indicates STR data    37288600
*                                      for CF                        */ 37319100
*       3    *        CHAR(3),      /* Unused                        */ 37349600
*       3    IXLYAMDSTRC_Length FIXED(32), /* Length of IXLYAMDSTR      37380100
*                                      entry mapping                 */ 37410600
*       3    IXLYAMDSTRC_STRNext PTR(31), /* Address of next STR        37441100
*                                      entry. A value of 0 means last   37471600
*                                      entry for this facility.      */ 37502100
*       3    IXLYAMDSTRC_SCSC@ PTR(31), /* Address of the SCSC entry.   37532600
*                                      A value of 0 means there is no   37563100
*                                      entry for storage class data  */ 37593600
*       3    IXLYAMDSTRC_SCOC@ PTR(31), /* Address of the SCOC entry.   37624100
*                                      A value of 0 means there is no   37654600
*                                      entry for castout class data  */ 37685100
*                                                                       37716600
*/***CACHE*******Configuration Data ******************************** */ 37766600
*                                                                       37816600
*       3    IXLYAMDSTRC_TTY FIXED(8), /* Structure type identifier  */ 37866600
*       3    IXLYAMDSTRC_TTY_Status CHAR(1),                            37876600
*         5    *            BIT(1),    /* not used               @PBA*/ 37886600
*         5    IXLYAMDSTRC_RBLDValid BIT(1), /* The structure rebuild   37896600
*                                      status indications reported in   37906600
*                                      the IXLYAMDSTRC_RBLDStatus are   37916600
*                                      valid -- These values will only  37926600
*                                      be valid and reported when       37936600
*                                      information is requested for a   37946600
*                                      particular structure      @PBA*/ 37956600
*       3    IXLYAMDSTRC_SID FIXED(16), /* Structure ID              */ 37966600
*       3    IXLYAMDSTRC_Version BIT(64), /* Structure version number.  37980400
*                                      Changes when a new physical      37994200
*                                      instance of the structure is     38008000
*                                      allocated (e.g., user- or        38021800
*                                      system-managed rebuild), and     38035600
*                                      there is at least one active     38049400
*                                      connector to observe the         38063200
*                                      allocation.               @PFC*/ 38077000
*         5    IXLYAMDSTRC_PhysicalVersion BIT(64), /* Structure        38090800
*                                      version number.                  38104600
*                                      Changes when a new physical      38118400
*                                      instance of the structure is     38132200
*                                      allocated (e.g., user- or        38146000
*                                      system-managed rebuild), and     38159800
*                                      there is at least one active     38173600
*                                      connector to observe the         38187400
*                                      allocation.               @L7A*/ 38201200
*       3    IXLYAMDSTRC_STRName CHAR(16), /* STR name               */ 38216600
*       3    IXLYAMDSTRC_RBLDStatus BIT(8), /* Rebuild status flags     38222400
*                                      This information will only be    38228200
*                                      valid if IXLYAMDSTRC_RBLDValid   38234000
*                                      is set.                   @PBA*/ 38239800
*         5    IXLYAMDSTRC_StrInRebld BIT(1), /* ON indicates that      38245600
*                                      the structure is in rebuild      38251400
*                                                                @PBA*/ 38257200
*         5    IXLYAMDSTRC_RebldOldStr BIT(1), /* ON indicates that     38263000
*                                      the structure information        38268800
*                                      pertains to the OLD structure    38274600
*                                                                @PBA*/ 38280400
*         5    IXLYAMDSTRC_RebldNewStr BIT(1), /* ON indicates that     38286200
*                                      the structure information        38292000
*                                      pertains to the NEW structure    38297800
*                                                                @PBA*/ 38303600
*         5    IXLYAMDSTRC_RebldDuplexStr BIT(1), /* ON indicates the   38304300
*                                      structure rebuild is a duplexing 38305000
*                                      rebuild.  OFF indicates the      38305700
*                                      structure rebuild is a normal    38306400
*                                      rebuild.  This bit only applies  38307100
*                                      when IXLYAMDSTRC_StrInRebld is   38307800
*                                      on.                       @03A*/ 38308500
*         5    IXLYAMDSTRC_RebldMethodStr  BIT(1), /* ON indicates the  38308600
*                                      structure rebuild is system      38308700
*                                      managed.  OFF indicates the      38308800
*                                      structure rebuild is user        38308900
*                                      managed.  This bit only applies  38309000
*                                      when IXLYAMDSTRC_StrInRebld is   38309100
*                                      on.                       @L8A*/ 38309200
*       3    *        CHAR(3),                                          38309400
*                                                                       38316600
*/*****CACHE***************** Measurement Data ********************* */ 38366600
*                                                                       38416600
*       3    IXLYAMDSTRC_Status CHAR(1), /* Structure status bits    */ 38420900
*         5    IXLYAMDSTRC_AMValid BIT(1), /* The following             38425200
*                                      measurement data is valid     */ 38429500
*/********************************************************************/ 38430300
*/* Begin fields whose validity is indicated by the              @L5A*/ 38431100
*/* IXLYAMDSTRC_AMValid flag                                     @L5A*/ 38431900
*/********************************************************************/ 38432700
*         5    IXLYAMDSTRC_DumpSerialHeld BIT(1), /* Dump               38433800
*                                      serialization is held against    38438100
*                                      this structure - internal        38442400
*                                      operations are failed -          38446700
*                                      external operations are          38451000
*                                      delayed. Hardware control data   38455600
*                                      will not be available.        */ 38460600
*       3    *        CHAR(1),      /* Unused                    @05C*/ 38462200
*       3    IXLYAMDSTRC_AMDataSequence FIXED(16), /* Sequence number   38463800
*                                      associated with this instance    38465400
*                                      of Measurement Data from this    38467000
*                                      system.                   @05A*/ 38468600
*       3    IXLYAMDSTRC_Reqct FIXED(32), /* Total requests. This       38470600
*                                      relates to external requests     38475600
*                                      such as IXLCACHE macro           38480600
*                                      invocations, not operations to   38485600
*                                      the coupling facility.        */ 38490600
*       3    IXLYAMDSTRC_ReqctAsync FIXED(32), /* Total asynchronous    38495600
*                                      requests started              */ 38500600
*       3    IXLYAMDSTRC_HiWorkQueueCount FIXED(32), /* Current count   38505600
*                                      of the number of operations      38510600
*                                      queued for subchannel            38515600
*                                      contention                    */ 38520600
*       3    IXLYAMDSTRC_WorkQueueCount FIXED(32), /* Current count     38525600
*                                      of the number of operations      38530600
*                                      queued for subchannel            38535600
*                                      contention                    */ 38540600
*       3    IXLYAMDSTRC_DelayQueueCount FIXED(32), /* Current count    38545600
*                                      of the number of operations      38550600
*                                      delayed for dump serialization   38553100
*                                      and/or a system-managed process  38555600
*                                      (e.g., rebuild)           @L5C*/ 38558100
*       3    IXLYAMDSTRC_DumpSerialReleased FIXED(32), /* Count of      38560600
*                                      the number times dump            38565600
*                                      serialization was obtained and   38570600
*                                      released for this structure   */ 38575600
*       3    IXLYAMDSTRC_SyncTimeCount FIXED(32), /* Count of the       38580600
*                                      number of summed times -- for    38585600
*                                      successful synchronous           38590600
*                                      operations to the facility    */ 38595600
*       3    IXLYAMDSTRC_SyncSumTime CHAR(8), /* Summed service time    38600600
*                                      (u-sec)                       */ 38605600
*       3    IXLYAMDSTRC_SyncSumTimeSQR CHAR(8), /* Summed service      38610600
*                                      time squared (u-sec squared)  */ 38615600
*       3    IXLYAMDSTRC_AsyncTimeCount FIXED(32), /* Count of the      38620600
*                                      number of summed times -- for    38625600
*                                      successful asynchronous          38630600
*                                      operations to the facility    */ 38635600
*       3    IXLYAMDSTRC_AsyncSumTime CHAR(8), /* Summed service time   38640600
*                                      (u-sec)                       */ 38645600
*       3    IXLYAMDSTRC_AsyncSumTimeSQR CHAR(8), /* Summed service     38650600
*                                      time squared (u-sec squared)  */ 38655600
*       3    IXLYAMDSTRC_QueueTimeCount FIXED(32), /* Count of the      38660600
*                                      number of summed times -- for    38665600
*                                      operation queue time          */ 38670600
*       3    IXLYAMDSTRC_QueueSumTime CHAR(8), /* Summed queue time     38675600
*                                      (u-sec)                       */ 38680600
*       3    IXLYAMDSTRC_QueueSumTimeSQR CHAR(8), /* Summed queue       38685600
*                                      time squared (u-sec squared)  */ 38690600
*       3    IXLYAMDSTRC_DelayTimeCount FIXED(32), /* Count of the      38695600
*                                      number of summed times -- for    38700600
*                                      operation delay time for dump    38705600
*                                      serialization                 */ 38710600
*       3    IXLYAMDSTRC_DelaySumTime CHAR(8), /* Summed delay time     38715600
*                                      (u-sec)                       */ 38720600
*       3    IXLYAMDSTRC_DelaySumTimeSQR CHAR(8), /* Summed delay       38725600
*                                      time squared (u-sec squared)  */ 38730600
*       3    IXLYAMDSTRC_SyncToAsyncCount FIXED(32), /* Count of the    38735600
*                                      number times a synchronous       38740600
*                                      operation could not be           38745600
*                                      performed synchronously and      38750600
*                                      was changed to an asynchronous   38755600
*                                      operation                     */ 38760600
*       3    IXLYAMDSTRC_TotalHiWorkCount FIXED(32), /* Total count     38765600
*                                      of the number of operations      38770600
*                                      queued for subchannel            38775600
*                                      contention                @P7A*/ 38780600
*       3    IXLYAMDSTRC_TotalWorkCount FIXED(32), /* Total count       38785600
*                                      of the number of operations      38790600
*                                      queued for subchannel            38795600
*                                      contention                @P7A*/ 38800600
*       3    *        CHAR(4),      /* RESERVED                      */ 38805600
*/********************************************************************/ 38807800
*/* End fields whose validity is indicated by the                @L5A*/ 38810000
*/* IXLYAMDSTRC_AMValid flag                                     @L5A*/ 38812200
*/********************************************************************/ 38814400
*                                                                       38816600
*/*************Control Structure Information *********************** */ 38866600
*                                                                       38916600
*       3    IXLYAMDSTRC_DataFlags Bit(8),                              38932100
*         5    IXLYAMDSTRC_Valid BIT(1), /* The following cache         38947600
*                                      control structure information    38963100
*                                      is valid                      */ 38978600
*/********************************************************************/ 38981700
*/* Begin fields whose validity is indicated by the              @L5A*/ 38984800
*/* IXLYAMDSTRC_Valid flag                                       @L5A*/ 38987900
*/********************************************************************/ 38991000
*         5    *        BIT(3),     /* reserved                      */ 38994100
*         5    IXLYAMDSTRC_DTSValid BIT(1), /* Structure dump table     39009600
*                                      size information is valid     */ 39025100
*       3    *        CHAR(2),      /* reserved                  @L3C*/ 39040600
*       3    IXLYAMDSTRC_Flags2 BIT(8),  /* Flags                @L3A*/ 39056100
*         5    IXLYAMDSTRC_REIPI BIT(1), /* Reapportionment in          39071600
*                                      progress indicator.  1=structure 39087100
*                                      ALTER to change ratio is in      39102600
*                                      progress (LEVEL1)         @L3A*/ 39118100
*         5    IXLYAMDSTRC_SSCI BIT(1), /* Structure size change in     39133600
*                                      progress indicator.  1=structure 39149100
*                                      ALTER to change structure size   39164600
*                                      is in progress (LEVEL1)   @L3A*/ 39180100
*         5    * BIT(6),            /* unused                    @L3A*/ 39195600
*       3    IXLYAMDSTRC_TDEC FIXED(32), /* Total Directory entry       39211100
*                                      count. This count is only        39226600
*                                      substantially accurate    @P3C*/ 39242100
*       3    IXLYAMDSTRC_TDAEC FIXED(32), /* Total Data area element    39257600
*                                      count. This count is only        39273100
*                                      substantially accurate    @P3C*/ 39288600
*       3    IXLYAMDSTRC_BITS BIT(8),                                   39304100
*         5    IXLYAMDSTRC_AAI BIT(1), /* Adjunct Assignment            39319600
*                                      indicator                     */ 39335100
*         5    IXLYAMDSTRC_UDFOQI BIT(1), /* UDF order queue            39341300
*                                      indicator.  CFLevel 5 or         39347500
*                                      higher.                   @PDA*/ 39353700
*         5    *        BIT(6),     /* reserved                  @PDC*/ 39359900
*       3    IXLYAMDSTRC_MSCV FIXED(8), /* Maximum storage class        39366100
*                                      value                         */ 39381600
*       3    IXLYAMDSTRC_NCM  BIT(16),  /* Name class mask. CFLEVEL=7   39391900
*                                      or higher                 @L6C*/ 39402200
*       3    IXLYAMDSTRC_MCCV FIXED(16), /* Maximum castout class       39412600
*                                      value                         */ 39428100
*       3    IXLYAMDSTRC_DAEX FIXED(8), /* Data area element            39443600
*                                      characteristic. The size of a    39459100
*                                      data element in bytes is         39474600
*                                      256*(2**DAEX)                 */ 39490100
*       3    IXLYAMDSTRC_MDAS FIXED(8), /* Maximum data area size       39505600
*                                      (i.e maximum number of           39521100
*                                      elements per entry)           */ 39536600
*       3    IXLYAMDSTRC_SS FIXED(32), /* Structure size in 4K blocks*/ 39552100
*       3    IXLYAMDSTRC_MSS Fixed(32), /* Maximum structure size in    39567600
*                                      4K blocks                     */ 39583100
*       3    IXLYAMDSTRC_MINSS Fixed(32), /* Minimum structure size     39598600
*                                      in 4K blocks. The structure      39614100
*                                      may actually be allocated        39629600
*                                      smaller than this, but if so,    39645100
*                                      structure attributes such as     39660600
*                                      entry/element ratio will         39676100
*                                      differ significantly from        39691600
*                                      those which were requested.      39707100
*                                                                @P3C*/ 39722600
*       3    IXLYAMDSTRC_DTS FIXED(32), /* Structure dump table size    39738100
*                                      in 4k blocks                  */ 39753600
*       3    IXLYAMDSTRC_MRSS FIXED(32), /* Marginal structure size.    39769100
*                                      This is the true minimum size    39784600
*                                      with which the structure can     39800100
*                                      be allocated,  regardless of     39815600
*                                      ratio considerations.            39831100
*                                      (LEVEL1)                  @L3A*/ 39846600
*       3    IXLYAMDSTRC_TSS FIXED(32), /* Target structure size.       39862100
*                                      For a CFLEVEL 0 facility, the    39868000
*                                      target structure size will       39873900
*                                      be equal to the actual structure 39879800
*                                      size.  For a CFLEVEL 1 or higher 39885700
*                                      facility, the target structure   39891600
*                                      size will be equal to the target 39897500
*                                      structure size specified on the  39903400
*                                      initial allocate or subsequent   39909300
*                                      expand or contract request.      39915200
*                                      The target size may or may not   39921100
*                                      be equal to the actual size.     39927000
*                                      (LEVEL1)                  @D2C*/ 39932900
*       3    IXLYAMDSTRC_TMELC FIXED(32), /* Target maximum element     39939600
*                                      count.  For a CFLEVEL 0 facility 39945100
*                                      the target maximum element count 39950600
*                                      will be equal to the actual      39956100
*                                      maximum element count.  For      39961600
*                                      CFLEVEL 1 or higher facilities,  39967100
*                                      the target maximum element count 39972600
*                                      will reflect the target ratio    39978100
*                                      specified on the initial         39983600
*                                      allocate or subsequent           39989100
*                                      reapportionment request.  This   39994600
*                                      may or may not equal the actual  40000100
*                                      maximum element count.           40005600
*                                      (LEVEL1)                  @D2C*/ 40011100
*       3    IXLYAMDSTRC_TMEC FIXED(32), /* Target maximum entry        40017100
*                                      count.  For a CFLEVEL 0 facility 40022600
*                                      the target maximum entry count   40028100
*                                      will be equal to the actual      40033600
*                                      maximum entry count.  For        40039100
*                                      CFLEVEL 1 or higher facilities,  40044600
*                                      the target maximum entry count   40050100
*                                      will reflect the target ratio    40055600
*                                      specified on the initial         40061100
*                                      allocate or subsequent           40066600
*                                      reapportionment request.  This   40072100
*                                      may or may not equal the actual  40077600
*                                      maximum entry count.             40083100
*                                      (LEVEL1)                  @D2C*/ 40088600
*       3    IXLYAMDSTRC_PDTDR FIXED(32), /* Pending directory to data  40094600
*                                      ratio.  This field is only       40110100
*                                      applicable to CFLEVEL 1 or       40125600
*                                      higher facilities.               40141100
*                                      (LEVEL1)                  @D2C*/ 40156600
*         5    IXLYAMDSTRC_PDTDR_Dir FIXED(16), /* Directory ratio      40172100
*                                      portion (LEVEL1)          @L3A*/ 40187600
*         5    IXLYAMDSTRC_PDTDR_Data FIXED(16), /* Data element ratio  40203100
*                                      portion (LEVEL1)          @L3A*/ 40218600
*       3    IXLYAMDSTRC_TSCC  FIXED(32), /* Total structure changed    40223000
*                                      entry count.  This count is      40225200
*                                      only substantially               40227400
*                                      accurate (LEVEL1)         @P9C*/ 40229600
*       3    IXLYAMDSTRC_TCDEC FIXED(32), /* Total structure changed    40231800
*                                      data element count.  This count  40235100
*                                      is only substantially            40238400
*                                      accurate (LEVEL1)         @P9C*/ 40241700
*       3    *        CHAR(4),      /* Reserved                  @L4C*/ 40245000
*/********************************************************************/ 40245900
*/* End fields whose validity is indicated by the                @L5A*/ 40246800
*/* IXLYAMDSTRC_Valid flag                                       @L5A*/ 40247700
*/********************************************************************/ 40248600
*       3    *        CHAR(0);                                          40249600
*                                                                       40267800
*   DECLARE                                                             40267900
*     1    IXLYAMDSTRC1 BASED IXLYAMDA_VIA, /* Structure Entry for a    40268000
*                                      Cache Structure (STRC),          40268100
*                                      AmdaLevel1                @02A*/ 40268200
*       3    * CHAR(LENGTH(IXLYAMDSTRC)), /* Mapped by IXLYAMDSTRC      40268300
*                                                                @02A*/ 40268400
*/********************************************************************/ 40268500
*/* Begin fields whose validity is indicated by the              @L5A*/ 40268600
*/* IXLYAMDSTRC_Valid flag                                       @L5A*/ 40268700
*/********************************************************************/ 40268800
*       3    Ixlyamdstrc1_WQC FIXED(32), /* Write-with-castout          40268900
*                                      queue count (LEVEL8)      @PEC*/ 40269000
*       3    Ixlyamdstrc1_SCCVN FIXED(32), /* Structure copy            40269100
*                                      controls version number          40269200
*                                      (LEVEL8)                  @PEC*/ 40269300
*       3    Ixlyamdstrc1_GCUDRI FIXED(32), /* Global count of          40269400
*                                      unchanged directory entries      40269500
*                                      with registered interest         40269600
*                                      (LEVEL8)                  @PEC*/ 40269700
*       3    Ixlyamdstrc1_FDEC FIXED(32), /* Free directory entry       40269800
*                                      count (LEVEL8)            @PEC*/ 40269900
*       3    Ixlyamdstrc1_FDAEC FIXED(32), /* Free data area            40270000
*                                      element count (LEVEL8)    @PEC*/ 40270100
*       3    Ixlyamdstrc1_CCCUR FIXED(16), /* Castout class cursor      40270200
*                                      (LEVEL8)                  @PEC*/ 40270300
*       3    * CHAR(2),             /* Reserved                  @L5A*/ 40270400
*/********************************************************************/ 40270500
*/* End fields whose validity is indicated by the                @L5A*/ 40270600
*/* IXLYAMDSTRC_Valid flag                                       @L5A*/ 40270700
*/********************************************************************/ 40270800
*       3    * CHAR(92),            /* Reserved                  @L5C*/ 40270900
*       3    Ixlyamdstrc1_LogicalVersion BIT(64),  /* Logical           40271000
*                                      structure version number.        40271100
*                                      Used in conjunction with         40271200
*                                      the physical version             40271300
*                                      number to identify an            40271400
*                                      instance of a structure.         40271500
*                                      The value of this field          40271600
*                                      is set equal to the              40271700
*                                      physical version number          40271800
*                                      when the structure is            40271900
*                                      initially allocated.  It         40272000
*                                      changes when a process           40272100
*                                      that allocates a new             40272200
*                                      instance of the structure        40272300
*                                      (e.g., rebuild) is               40272400
*                                      user-managed, but not            40272500
*                                      when it is                       40272600
*                                      system-managed.           @L5A*/ 40272700
*       3    Ixlyamdstrc1_SSCCAddr PTR(31); /* Address of the           40272800
*                                      structure copy controls          40272900
*                                      information entry for this       40273000
*                                      structure.  A value of zero      40273100
*                                      means that the SSCC record       40273200
*                                      was not provided for this        40273300
*                                      structure because it was         40273400
*                                      not requested, not available,    40273500
*                                      or contained no information.     40273600
*                                                                @L5A*/ 40273700
*/********************************************************************/ 40273800
*/**************** Structure Cache Storage Class Entry ***************/ 40273900
*/********************************************************************/ 40274000
*                                                                       40274100
*/*****************Header*********************************************/ 40274200
*                                                                       40274300
*   DECLARE                                                             40274400
*     1    IXLYAMDSCSC BASED IXLYAMDA_VIA, /* Structure Entry for       40274500
*                                      Cache Storage Class (SCSC)    */ 40274600
*       3    IXLYAMDSCSC_Type BIT(8), /* X'23' -- indicates STR data    40274700
*                                      for Storage Class             */ 40274800
*       3    *        CHAR(3),      /* Unused                        */ 40274900
*       3    IXLYAMDSCSC_Length FIXED(32), /* Length of IXLYAMDSCSC     40275000
*                                      entry mapping                 */ 40275100
*       3    *        CHAR(4),      /* reserved                      */ 40275200
*       3    IXLYAMDSCSC_STATS,     /* Storage Class information     */ 40275300
*         5    IXLYAMDSCSC_RHC FIXED(32), /* Read hit counter        */ 40275400
*         5    IXLYAMDSCSC_RMDHC FIXED(32), /* Read miss, directory     40275500
*                                      hit counter                   */ 40275600
*         5    IXLYAMDSCSC_RMASC FIXED(32), /* Read miss, assignment    40275700
*                                      suppressed counter            */ 40275800
*         5    IXLYAMDSCSC_RMNAC FIXED(32), /* Read miss, name          40275900
*                                      assigned counter              */ 40276000
*         5    IXLYAMDSCSC_RMTSFC FIXED(32), /* Read miss, target       40276200
*                                      storage class full counter    */ 40276400
*         5    IXLYAMDSCSC_WHCB0C FIXED(32), /* Write hit change Bit    40276600
*                                      0 ctr                         */ 40276800
*         5    IXLYAMDSCSC_WHCB1C FIXED(32), /* Write hit change Bit    40277000
*                                      1 ctr                         */ 40277200
*         5    IXLYAMDSCSC_WMNRC FIXED(32), /* Write miss, not          40277400
*                                      registered counter            */ 40277600
*         5    IXLYAMDSCSC_WMISC FIXED(32), /* Write miss, invalid      40277800
*                                      state counter                 */ 40278000
*         5    IXLYAMDSCSC_WMTSFC FIXED(32), /* Write miss, target      40278200
*                                      storage class full counter    */ 40278400
*         5    IXLYAMDSCSC_DERC FIXED(32), /* Directory entry reclaim   40278600
*                                      counter                       */ 40278800
*         5    IXLYAMDSCSC_DTERC FIXED(32), /* Data entry reclaim       40279000
*                                      counter                       */ 40279200
*         5    IXLYAMDSCSC_XIFDRC FIXED(32), /* XI directory reclaim    40279400
*                                      counter                       */ 40279600
*         5    IXLYAMDSCSC_XIFWC FIXED(32), /* XI write counter      */ 40279800
*         5    IXLYAMDSCSC_XINIC FIXED(32), /* XI name invalidation     40280000
*                                      counter                       */ 40280200
*         5    IXLYAMDSCSC_XICIC FIXED(32), /* XI complement            40280400
*                                      invalidation counter          */ 40280600
*         5    IXLYAMDSCSC_COC FIXED(32), /* Castout Counter         */ 40280800
*         5    IXLYAMDSCSC_RSMC FIXED(32), /* Reference signal miss     40281000
*                                      counter                       */ 40281200
*         5    IXLYAMDSCSC_TSCFC FIXED(32), /* Target storage class     40281400
*                                      full counter                  */ 40281600
*         5    IXLYAMDSCSC_DEC FIXED(32), /* Directory entry counter */ 40281800
*         5    IXLYAMDSCSC_DAEC FIXED(32), /* Data area element         40282000
*                                      counter                       */ 40282200
*         5    IXLYAMDSCSC_TCC FIXED(32), /* Total changed counter   */ 40282400
*         5    IXLYAMDSCSC_DAC FIXED(32), /* Data area counter       */ 40282600
*         5    IXLYAMDSCSC_CRLC FIXED(32), /* Completed reference       40282800
*                                      lists counter                 */ 40283000
*         5    IXLYAMDSCSC_PCRLC FIXED(32), /* Partially completed      40283200
*                                      reference lists counter       */ 40283400
*         5    IXLYAMDSCSC_XILRC FIXED(32), /* XI for local cache       40283600
*                                      vector index replacement      */ 40283800
*         5    IXLYAMDSCSC_WUXIC FIXED(32), /* Write unchanged with     40284000
*                                      XI counter                    */ 40284200
*       3    *        CHAR(0);                                          40284400
*   DECLARE                                                             40284900
*     1    IXLYAMDSCSC1 BASED IXLYAMDA_VIA, /* Structure Entry for      40285400
*                                      Cache Storage Class (SCSC),      40285900
*                                      AmdaLevel1                @02A*/ 40286400
*       3    * CHAR(LENGTH(IXLYAMDSCSC)), /* Mapped by IXLYAMDSCSC      40286900
*                                                                @02A*/ 40287400
*       3    IXLYAMDSCSC1_UDERIC FIXED(32), /* Unchanged directory      40287600
*                                      entry with registered            40287800
*                                      interest counter (LEVEL8) @PEC*/ 40288000
*       3    * CHAR(68);            /* Reserved                  @L5C*/ 40288200
*                                                                       40288400
*                                                                       40288900
*/********************************************************************/ 40289400
*/**************** Structure Cache CastOut Class Information Header***/ 40290600
*/********************************************************************/ 40291800
*                                                                       40293000
*   DECLARE                                                             40293900
*     1    IXLYAMDSCOC BASED IXLYAMDA_VIA, /* Structure Entry for       40294800
*                                      Cache CastOut Class (SCOC)    */ 40295700
*       3    IXLYAMDSCOC_Type BIT(8), /* X'24' -- indicates STR data    40296600
*                                      for CastOut Classes           */ 40297500
*       3    *        CHAR(3),      /* Unused                        */ 40298400
*       3    IXLYAMDSCOC_Length FIXED(32), /* Length of IXLYAMDSCOC     40299300
*                                      entry mapping                 */ 40300200
*       3    IXLYAMDSCOCSTATS@ PTR(31), /* Address of the SCOC entry.   40301100
*                                      An address of 0 indicates no     40302000
*                                      entries were processed        */ 40302900
*       3    IXLYAMDSCOCBeg FIXED(16), /* First castout class in the    40303800
*                                      range of castout classes         40304700
*                                      processed                     */ 40305600
*       3    IXLYAMDSCOCEnd FIXED(16); /* Last castout class in the     40306500
*                                      range of castout classes         40307400
*                                      processed                     */ 40308300
*                                                                       40309200
*/*****************Cast Out Class Statistics**************************/ 40311100
*                                                                       40311700
*   DECLARE                                                             40312300
*     1    IXLYAMDSCOCSTATS BASED IXLYAMDA_VIA, /* Cast Out Class       40312900
*                                      Stats                         */ 40313500
*       3    IXLYAMDSCOCEntry FIXED(32); /* Number of data elements     40314100
*                                      associated with entries in the   40314700
*                                      indicated castout class   @P5C*/ 40315300
*                                                                       40316600
*/********************************************************************/ 40341600
*/******************** Subchannel Entry ******************************/ 40366600
*/********************************************************************/ 40416600
*                                                                       40466600
*   DECLARE                                                             40516600
*     1    IXLYAMDSC BASED IXLYAMDA_VIA, /* Subchannel Entry (SC)    */ 40566600
*       3    IXLYAMDSC_Type BIT(8), /* X'30' -- indicates SC data    */ 40616600
*       3    *        CHAR(3),      /* Unused                        */ 40666600
*       3    IXLYAMDSC_Length FIXED(32), /* Length of IXLYAMDSC entry   40716600
*                                      mapping                       */ 40766600
*       3    IXLYAMDSC_ScNext PTR(31), /* Address of next SC entry. A   40816600
*                                      value of 0 means last entry      40866600
*                                      for this facility             */ 40916600
*                                                                       40966600
*/******************* Configuration Data  *************************  */ 41016600
*                                                                       41066600
*       3    IXLYAMDSC_ScNumber FIXED(16), /* Subchannel number      */ 41088000
*       3    IXLYAMDSC_PAM BIT(8),  /* Path available mask for          41109400
*                                      coupling facility subchannels */ 41130800
*       3    IXLYAMDSC_PIM BIT(8),  /* Path installed mask for          41152200
*                                      coupling facility subchannels */ 41173600
*       3    IXLYAMDSC_Chpid_Set CHAR(8), /* Set of CHPIDs           */ 41195000
*         5    IXLYAMDSC_Chpids(8) BIT(8), /* CHPID array for           41216400
*                                      coupling facility subchannels */ 41237800
*       3    IXLYAMDSC_ScDevice FIXED(16), /* Subchannel device         41259200
*                                      number                        */ 41280600
*       3    IXLYAMDSC_Subch_Status BIT(16), /* Subchannel status       41302000
*                                                                @P2A*/ 41323400
*         5    IXLYAMDSC_NotOperational BIT(1), /* Subchannel not       41344800
*                                      operational               @P2A*/ 41366200
*         5    IXLYAMDSC_NotInUse BIT(1), /* Subchannel operational     41387600
*                                      but not being used for           41409000
*                                      operations                @P2A*/ 41430400
*         5    IXLYAMDSC_Active BIT(1), /* Subchannel operational and   41451800
*                                      used for operations       @P2A*/ 41473200
*       3    IXLYAMDSC_CHPIDSetType  CHAR(8), /* Set of CHPID Types     41480400
*                                                                @04A*/ 41487600
*         5    IXLYAMDSC_CHPIDsType(8) FIXED(8), /* CHPID array for     41494800
*                                      channel path type         @04A*/ 41502000
*       3    *        CHAR(4),      /* Reserved                      */ 41509200
*                                                                       41516600
*/* *************** Contention data  ******************************* */ 41566600
*                                                                       41616600
*       3    IXLYAMDSC_Subch_Busy FIXED(32), /* Subchannel busy         41666600
*                                      count. Compare to the            41716600
*                                      utilization count below.      */ 41766600
*       3    IXLYAMDSC_ALLPATHS_Busy FIXED(32), /* All path busy        41816600
*                                      termination count. Compare to    41866600
*                                      the utilization count below.  */ 41916600
*       3    IXLYAMDSC_Utilization FIXED(32), /* Utilization count --   41966600
*                                      Number of times this             42016600
*                                      subchannel was picked for an     42066600
*                                      operation                     */ 42116600
*       3    *        CHAR(16);                                         42166600
*                                                                       42316600
*   DECLARE                                                             42319700
*     1    IXLYAMDSC1 BASED IXLYAMDA_VIA, /* Subchannel Entry (SC),     42322800
*                                      AmdaLevel1                @02A*/ 42325900
*       3    * CHAR(LENGTH(IXLYAMDSC)), /* Mapped by                    42329000
*                                      IXLYAMDSC                 @02A*/ 42332100
*       3    * CHAR(60);            /* Reserved                  @02A*/ 42335200
*                                                                       42338300
*/********************************************************************/ 42341600
*/*                   Structure copy controls                        */ 42366900
*/*                                                                  */ 42392200
*/* This record is returned only when AMDALEVEL of at least 1        */ 42417500
*/* is specified.                                                @PFC*/ 42442800
*/********************************************************************/ 42468100
*   DECLARE                                                             42493400
*     1    IXLYAMDSSCC BASED IXLYAMDA_VIA, /* Structure copy controls   42518700
*                                      record                    @L5A*/ 42544000
*       3    IXLYAMDSSCC_Type BIT(8), /* X'25' -- indicates SSCC        42569300
*                                      data                      @L5A*/ 42594600
*       3    *        CHAR(3),      /* Unused                    @L5A*/ 42619900
*       3    IXLYAMDSSCC_Length FIXED(32), /* Length of IXLYAMDSSCC     42645200
*                                      entry mapping             @L5A*/ 42670500
*       3    * CHAR(16),            /* Reserved                  @L5A*/ 42695800
*       3    IXLYAMDSSCC_CopyControls CHAR(512),  /* Structure          42721100
*                                      copy controls (LEVEL8)    @PEC*/ 42746400
*       3    * CHAR(32);            /* Reserved                  @L5A*/ 42771700
*/********************************************************************/ 42797000
*/*****************Structure types************************************/ 42823700
*/********************************************************************/ 42827200
*                                                                       42830800
*   DECLARE                                                             42836400
*     IXLYAMDA_LIST BIT(8) CONSTANT('03'X), /* List structure    @P1A*/ 42842000
*     IXLYAMDA_CACHE BIT(8) CONSTANT('04'X), /* Cache Structure  @P1A*/ 42847600
*     IXLYAMDA_LOCK BIT(8) CONSTANT('FF'X); /* Lock Structure    @L3A*/ 42853200
*                                                                       43380800
*                                                                       43395000
*/*****************Channel Path Types*********************************/ 43397000
*/********************************************************************/ 43399000
*                                                                       43401000
*   DECLARE                                                             43403000
*     IXLYAMDA_CHPIDTYPE_CFS  BIT(8) CONSTANT('0B'X), /* CHPID TYPE for 43405000
*                                        CF Sender chpid         @04A*/ 43407000
*     IXLYAMDA_CHPIDTYPE_CBS  BIT(8) CONSTANT('16'X), /* CHPID TYPE for 43409000
*                                        CF Cluster Bus Sender   @04A*/ 43411000
*     IXLYAMDA_CHPIDTYPE_ICS  BIT(8) CONSTANT('18'X), /* CHPID TYPE for 43413000
*                                        CF Internal Coupling Sender    43415000
*                                                                @04A*/ 43417000
*     IXLYAMDA_CHPIDTYPE_CBP  BIT(8) CONSTANT('21'X), /* CHPID TYPE for 43419000
*                                        CF Integrated Cluster Bus Peer 43421000
*                                                                @06A*/ 43423000
*     IXLYAMDA_CHPIDTYPE_CFP  BIT(8) CONSTANT('22'X), /* CHPID TYPE for 43425000
*                                        CF Peer chpid           @06A*/ 43427000
*     IXLYAMDA_CHPIDTYPE_ICP  BIT(8) CONSTANT('23'X); /* CHPID TYPE for 43429000
*                                        CF Internal Coupling Peer      43431000
*                                                                @06A*/ 43433000
*/* End of PL/X Source                                               */ 43451800
* %IF IXLYAMDA_LIST ^= 'NO' &                                           43466600
*    ZCBPRINT ^= 'NO' %THEN                                             43516600
*   %GOTO IXLYAMDA_4;                                                   43566600
*   @LIST POP NOECHO;                                                   43616600
* %IXLYAMDA_4:;                                                         43666600
* %END;                                                                 43716600
