*                                                                       00050000
* %DCL IXLYCRRB_INCLUDED CHAR EXT;                                      00100000
* %DEACTIVATE IXLYCRRB_INCLUDED;                                        00150000
* %IF IXLYCRRB_INCLUDED = '' %THEN                                      00200000
* %DO;                                                                  00250000
*/* Macro made bi-lingual on 95171. CBGEN compile date 94304         */ 00300000
*% /*                                                                   00350000
         MACRO                                                          00400000
         IXLYCRRB &DSECT=YES,&LIST=YES,&CRRB=YES                        00450000
         GBLC  &IXLYCRRB_INCLUDED                                       00500000
         GBLC  &ZCBPRINT                                                00550000
&IXLYCRRB_INCLUDED SETC 'YES'                                           00600000
 TITLE   'IXLYCRRB  - Cache Register Name List Registration Block     '*00650000
                                                                        00700000
**/ IXLYCRRB_1:;                                                        00750000
*/* START OF SPECIFICATIONS ******************************************* 00800000
*                                                                       00850000
*01* SECURITY:                                                          00900000
*                                                                       00950000
*01* PROPRIETARY STATEMENT =                                            01000000
*                                                                       01050000
*    LICENSED MATERIALS - PROPERTY OF IBM                               01100000
*    THIS MODULE IS RESTRICTED MATERIALS OF IBM                         01150000
*    5645-001 (C) COPYRIGHT IBM CORP. 1994, 1996                        01200000
*                                                                       01250000
*01* STATUS = JBB6602                                                   01300000
*                                                                       01350000
*01* END OF PROPRIETARY STATEMENT                                       01400000
*                                                                       01450000
*01* EXTERNAL CLASSIFICATION: GUPI                                      01500000
*01* END OF EXTERNAL CLASSIFICATION:                                    01550000
*                                                                       01600000
*02* ACRONYM:  CRRB                                                     01650000
*                                                                       01700000
*01* DESCRIPTIVE NAME: Cache Register Name List Registration Block      01750000
*                                                                       01800000
*01* MACRO NAME:  IXLYCRRB                                              01850000
*                                                                       01900000
*01* DSECT NAME:  CRRB                                                  01950000
*                                                                       02000000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 02050000
*                                                                       02100000
*01* EYE-CATCHER:  NONE                                                 02150000
*                                                                       02200000
*01* STORAGE ATTRIBUTES:                                                02250000
*02*  SUBPOOL:  User supplied                                           02300000
*02*  KEY:  User supplied                                               02350000
*02*  RESIDENCY:  User supplied                                         02400000
*                                                                       02450000
*01* SIZE:  64 bytes                                                    02500000
*01*             CRRB -- X'0040' bytes                                  02550000
*                                                                       02600000
*01* CREATED BY:  IXLCACHE invoker                                      02650000
*                                                                       02700000
*01* POINTED TO BY:  BUFFER or BUFLIST parameter on IXLCACHE            02750000
*                                                                       02800000
*01* SERIALIZATION:  See BUFFER and BUFLIST parameter requirements      02850000
*                    on the IXLCACHE interface description.             02900000
*                                                                       02950000
*01* FUNCTION:                                                          03000000
*02*  The CRRB maps the registration blocks provided when the IXLCACHE  03050000
*     macro is issued for a REG_NAMELIST request.                       03100000
*                                                                       03150000
*01* METHOD OF ACCESS:                                                  03200000
*02*  ASM:    IXLYCRRB USING on CRRB                                    03250000
*                                                                       03300000
*02*  PL/AS:  %DCL CRRB_DCL_ATTR CHAR                                   03350000
*             %CRRB_DCL_ATTR = 'based/defined/via attributes'           03400000
*             %INCLUDE SYSLIB(IXLYCRRB)                                 03450000
*                                                                       03500000
*             If CRRB_DCL_ATTR is not set the CRRB will be              03550000
*             declared as BASED.                                        03600000
*                                                                       03650000
*01* DELETED BY:  Invoker of IXLCACHE                                   03700000
*                                                                       03750000
*01* FREQUENCY:   One per cache entry for which registration            03800000
*                 is to be performed on an IXLCACHE REG_NAMELIST        03850000
*                 request.                                              03900000
*                                                                       03950000
*01* DEPENDENCIES:  See BUFFER and BUFLIST parameter requirements       04000000
*                   on the IXLCACHE interface description.              04050000
*                                                                       04100000
*01* DISTRIBUTION LIBRARY:  AMACLIB                                     04150000
*                                                                       04200000
*01* CHANGE ACTIVITY:                                                   04250000
*     $00=OW15587  HBB5520 950515 PD00HX: REG_NAMELIST support          04300000
*                                                                       04350000
*                                                                       04400000
* NOTES: This control block must start on a word boundary.              04450000
*                                                                       04500000
*     ALLOCATION-METHOD:  Specific to IXLCACHE invoker.                 04550000
*                         See BUFFER and BUFLIST parameter requirements 04600000
*                         on the IXLCACHE interface description.        04650000
*                                                                       04700000
*END OF SPECIFICATIONS ***********************************************/ 04750000
*% /*                                                                   04800000
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04850000
         AIF   ('&LIST' EQ 'YES').P2                                    04900000
.P1      ANOP                                                           04950000
         PUSH  PRINT                                                    05000000
         PRINT OFF                                                      05050000
.P2      ANOP                                                           05100000
         AIF   ('&CRRB' EQ 'NO').L0002                                  05150000
         AIF   ('&DSECT' EQ 'YES').L0003                                05200000
         AIF   ('&CRRB' NE 'YES').L0002                                 05250000
CRRB     DS    0F        Cache Register Name List Registration Block    05300000
         AGO   .L0004                                                   05350000
.L0003   ANOP                                                           05400000
CRRB     DSECT           Cache Register Name List Registration Block    05450000
.L0004   ANOP                                                           05500000
CRRBSTGCLASS DS 1FL1     Storage class to which the entry named in     *05550000
                         this registration block should be assigned.    05600000
CRRBFLAGS DS   0BL1      Flag byte                                      05650000
CRRBASSIGNCNTL EQU X'80' Assignment Control 1 ==> A directory entry    *05700000
                         should be assigned for the entry named in     *05750000
                         this registration block, if one does not      *05800000
                         currently exist 0 ==> A directory entry       *05850000
                         should not be assigned if one does not        *05900000
                         currently exist                                05950000
CRRBNAMEREPLACECNTL EQU X'40' Name-Replacement Control 1 ==> Any       *06000000
                         registered interest for the specified local   *06050000
                         cache vector index and the entry specified by *06100000
                         CrrbOldName in this registration block will   *06150000
                         be deregistered 0 ==> No deregistration of    *06200000
                         interest for the entry specified by           *06250000
                         CrrbOldName will be performed                  06300000
         ORG   CRRBFLAGS+X'00000001'                                    06350000
         DS    1CL0014   Reserved                                       06400000
CRRBNAME DS    1CL0016   Directory Entry Name                           06450000
CRRBOLDNAME DS 1CL0016   Old Name. When CrrbNameReplaceCntl is one and *06500000
                         CrrbName and CrrbOldName are not equal,       *06550000
                         interest will be deregistered in the          *06600000
                         directory entry designated by CrrbOldName for *06650000
                         the CrrbVectorIndex prior to registering      *06700000
                         interest in the entry designated by CrrbName.  06750000
CRRBVECTORINDEX DS 1FL4  Local Cache Vector Index                       06800000
         DS    1CL0012   Reserved                                       06850000
CRRBEND  DS    0C        End of CRRB                                    06900000
CRRB_LEN EQU   *-CRRB                                                   06950000
.L0002   ANOP                                                           07000000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 07050000
         AIF   ('&LIST' EQ 'YES').P4                                    07100000
.P3      ANOP                                                           07150000
         POP   PRINT                                                    07200000
.P4      ANOP                                                           07250000
.P_EXIT  ANOP                                                           07300000
         MEND                                                           07350000
**/ IXLYCRRB_2:;                                                        07400000
* %IXLYCRRB_INCLUDED = 'YES';                                           07450000
* %DCL ZCBPRINT CHAR EXT;                                               07500000
* %DEACTIVATE ZCBPRINT;                                                 07550000
* %DCL IXLYCRRB_LIST CHAR EXT;                                          07600000
* %DEACTIVATE IXLYCRRB_LIST;                                            07650000
* %IF IXLYCRRB_LIST ^= 'NO' &                                           07700000
*    ZCBPRINT ^= 'NO' %THEN                                             07750000
*   %GOTO IXLYCRRB_3;                                                   07800000
*   @LIST PUSH NOECHO;                                                  07850000
*   @LIST NOASSEMBLE NOECHO;                                            07900000
*   @LIST OFF C NOECHO;                                                 07950000
* %IXLYCRRB_3:;                                                         08000000
*/* Start of PL/X Source                                             */ 08050000
*                                                                       08100000
* %If Crrb_Dcl_Attr = '' %Then                                          08150000
*   %Crrb_Dcl_Attr = 'Based';                                           08200000
*                                                                       08250000
* DCL 1 CRRB Crrb_Dcl_Attr BDY(WORD), /* Cache Register Name List       08300000
*                                   Registration Block               */ 08350000
*       3 CrrbStgClass FIXED(8), /* Storage class to which the entry    08400000
*                                   named in this registration block    08450000
*                                   should be assigned.              */ 08500000
*       3 CrrbFlags BIT(8),      /* Flag byte                        */ 08550000
*        5 CrrbAssignCntl BIT(1), /* Assignment Control                 08600000
*                                   1 ==> A directory entry should be   08650000
*                                   assigned for the entry named in     08700000
*                                   this registration block, if one     08750000
*                                   does not currently exist            08800000
*                                   0 ==> A directory entry should not  08850000
*                                   be assigned if one does not         08900000
*                                   currently exist                  */ 08950000
*        5 CrrbNameReplaceCntl BIT(1), /* Name-Replacement Control      09000000
*                                   1 ==> Any registered interest for   09050000
*                                   the specified local cache vector    09100000
*                                   index and the entry specified by    09150000
*                                   CrrbOldName in this registration    09200000
*                                   block will be deregistered          09250000
*                                   0 ==> No deregistration of          09300000
*                                   interest for the entry specified    09350000
*                                   by CrrbOldName will be performed */ 09400000
*        5 *            BIT(6),  /* Reserved                         */ 09450000
*       3 *          CHAR(14),   /* Reserved                         */ 09500000
*       3 CrrbName   CHAR(16),   /* Directory Entry Name             */ 09550000
*       3 CrrbOldName CHAR(16),  /* Old Name.  When CrrbNameReplaceCntl 09600000
*                                   is one and CrrbName and CrrbOldName 09650000
*                                   are not equal, interest will be     09700000
*                                   deregistered in the directory entry 09750000
*                                   designated by CrrbOldName for the   09800000
*                                   CrrbVectorIndex prior to            09850000
*                                   registering interest in the entry   09900000
*                                   designated by CrrbName.          */ 09950000
*       3 CrrbVectorIndex FIXED(32), /* Local Cache Vector Index     */ 10000000
*       3 *            CHAR(12), /* Reserved                         */ 10050000
*       3 CrrbEnd CHAR(0);       /* End of CRRB                      */ 10100000
*                                                                       10150000
* %Deactivate Crrb_Dcl_Attr;                                            10200000
*                                                                       10250000
*/* End of PL/X Source                                               */ 10300000
* %IF IXLYCRRB_LIST ^= 'NO' &                                           10350000
*    ZCBPRINT ^= 'NO' %THEN                                             10400000
*   %GOTO IXLYCRRB_4;                                                   10450000
*   @LIST POP NOECHO;                                                   10500000
* %IXLYCRRB_4:;                                                         10550000
* %END;                                                                 10600000
