*                                                                       00050000
* %DCL IXLYCEPL_INCLUDED CHAR EXT;                                      00064200
* %DEACTIVATE IXLYCEPL_INCLUDED;                                        00078400
* %IF IXLYCEPL_INCLUDED = '' %THEN                                      00092600
* %DO;                                                                  00106800
*/* Macro made bi-lingual on 95179. CBGEN compile date 94304         */ 00121000
*% /*                                                                   00135200
         MACRO                                                          00150000
         IXLYCEPL &DSECT=YES,&LIST=YES,&CEPL=YES,&CEPLENT=COND          00168700
         GBLC  &IXLYCEPL_INCLUDED                                       00187400
         GBLC  &ZCBPRINT                                                00206100
&IXLYCEPL_INCLUDED SETC 'YES'                                           00224800
 TITLE   'IXLYCEPL  - Contention Exit Parameter List                  '*00243500
                                                                        00262200
**/ IXLYCEPL_1:;                                                        00280900
*/* START OF SPECIFICATIONS ******************************************* 00300000
*                                                                       00350000
*01* SECURITY:                                                          00366600
*                                                                       00383200
*01* PROPRIETARY STATEMENT =                                            00430600
*                                                                       00478000
*    LICENSED MATERIALS - PROPERTY OF IBM                               00525400
*    THIS MODULE IS RESTRICTED MATERIALS OF IBM                         00572800
*    5645-001 (C) COPYRIGHT IBM CORP. 1993, 1996                        00620200
*                                                                       00667600
*01* STATUS = JBB6602                                                   00715000
*                                                                       00762400
*01* END OF PROPRIETARY STATEMENT                                       00809800
*                                                                       00857200
*01* EXTERNAL CLASSIFICATION: GUPI                                      00904600
*01* END OF EXTERNAL CLASSIFICATION:                                    00952000
*                                                                       01000000
*02* ACRONYM:  CEPL                                                     01025000
*                                                                       01050000
*01* DESCRIPTIVE NAME: Contention Exit Parameter List                   01075000
*                                                                       01100000
*01* MACRO NAME: IXLYCEPL                                               01150000
*                                                                       01200000
*01* DSECT NAME:                                                        01250000
*     CEPL                                                              01300000
*     CEPLENT                                                           01350000
*                                                                       01450000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 01500000
*                                                                       01550000
*01* EYE-CATCHER:  NONE                                                 01600000
*                                                                       01700000
*01* STORAGE ATTRIBUTES:                                                01720000
*02*  SUBPOOL:  205                                                     01740000
*02*  KEY:  Key 0                                                       01760000
*02*  RESIDENCY:  Above 16 MB in virtual storage.                       01780000
*                                                                       01800000
*01* SIZE:  88 bytes + 184*CEPLENT# + length of resource name           01850000
*01*             CEPL    -- X'0058' bytes                               01866600
*01*             CEPLENT -- X'01A4' bytes                               01883200
*                                                                       01900000
*01* CREATED BY: IXLRQCEI                                               01950000
*                                                                       02000000
*01* POINTED TO BY:                                                     02033300
*     First word in parameter list provided to contention exit          02066600
*                                                                       02100000
*01* SERIALIZATION:                                                     02133300
*     None required                                                     02166600
*                                                                       02200000
*01* FUNCTION: Maps parameter list to contention exit interface to      02233300
*              connected user.                                          02266600
*                                                                       02300000
*01* METHOD OF ACCESS:                                                  02333300
*02*  ASM:   IXLYCEPL USING on CEPL and CEPLENT                         02366600
*                                                                       02400000
*02*  PL/AS: %INCLUDE SYSLIB(IXLYCEPL)                                  02450000
*                                                                       02500000
*01* DELETED BY: IXLRQCEI                                               02650000
*                                                                       02700000
*01* FREQUENCY: One for resolution of contention on a resource          02733300
*               name basis.                                             02766600
*                                                                       02800000
*01* DEPENDENCIES: Include IXLYCON                                      02812500
*                                                                       02825000
*01* DISTRIBUTION LIBRARY: AMACLIB                                      02837500
*                                                                       02850000
*01* CHANGE-ACTIVITY:                                                   02862500
*     $L0=SYSLKSRQ HBB5510 900112 PD00XB:  XES Support                  02868700
*     $D1=DIGxxxxx HBB5510 910920 PD00T8:  Increase size of userdata to 02874900
*                                          64 bytes                     02881100
*     $D2=DIG0039  HBB5510 930325 PD00EO:  Add Record data support      02884300
*     $P1=PIG5178  HBB5510 940314 PD00EO:  Performance                  02885900
*     $P1=PIG5392  HBB5510 940624 PD00EO:  Documentation Update         02886400
*     $P2=PN70769  HBB5520 940615 PD00LA:  Change comp stmt in prolog   02886900
*     $O1=OW14164  HBB5510 950801 PD00EO:  Defer Contention Exit        02891200
*                                          during rebuild support       02895500
*                                                                       02900000
* NOTES: This control block must end on a doubleword boundary.          02950000
*                                                                       03000000
*                                                                       03150000
*END OF SPECIFICATIONS ***********************************************/ 03200000
*% /*                                                                   03229100
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 03258200
         AIF   ('&LIST' EQ 'YES').P2                                    03287300
.P1      ANOP                                                           03316400
         PUSH  PRINT                                                    03345500
         PRINT OFF                                                      03374600
.P2      ANOP                                                           03403700
         AIF   ('&CEPL' EQ 'NO').L0002                                  03432800
         AIF   ('&DSECT' EQ 'YES').L0003                                03461900
         AIF   ('&CEPL' NE 'YES').L0002                                 03491000
CEPL     DS    0D        Contention exit parameter list                 03520100
         AGO   .L0004                                                   03549200
.L0003   ANOP                                                           03578300
CEPL     DSECT           Contention exit parameter list                 03607400
.L0004   ANOP                                                           03636500
CEPLCONTOKEN DS 1CL0016  Connect token identifying the connected user  *03645500
                         who has been chosen by XES to manage this     *03654500
                         instance of resource contention (i.e. the     *03663500
                         connector whose contention exit is executing)  03672500
CEPLCONDATA DS 1CL0008   Connect-time data of the connector whose      *03681500
                         contention exit is driven. This field is user *03690500
                         defined data provided as input to IXLCONN.     03699500
CEPLRNAME@ DS  1AL4      Name of the Resource for which the Contention *03708500
                         exit is executing. Please note, the Resource  *03717500
                         Name along with the Hash Value serves to      *03726500
                         fully qualify an IXLLOCK Resource              03735500
CEPLRNAMELEN DS 1FL4     Length of Resource Name                        03744500
CEPLHASHVAL DS 1FL4      Hash value of the Resource for which the      *03753500
                         Contention Exit is executing. Please note,    *03762500
                         the Hash Value along with the Resource Name   *03771500
                         fully qualifies an IXLLOCK Resource            03780500
CEPLWORK DS    1CL0032   Contention Exit Work area. Please note, this  *03789500
                         area is initialized to zero upon the first    *03798500
                         entry to the Contention Exit. Any updates     *03807500
                         will persist between invocations of the exit  *03816500
                         until this instance of Contention management  *03825500
                         has ceased.                                    03843500
CEPLNEW@ DS    1AL4      Address of the entry on the Resource Request  *03861500
                         queue for a new, pending request that has not *03870500
                         been previously presented to the exit. This   *03879500
                         field is only valid when a new request is     *03888500
                         present on the queue (i.e. CEPLNEW#=1). The   *03897500
                         new entry is mapped by CEPLENT                 03906500
CEPLFLAGS DS   0BL2      Informational Flags                            03915500
CEPLREASONFLAGS DS 0BL1  Flags indicating the Reason for which the     *03924500
                         exit has been given control                    03933500
CEPLRECOVERY EQU X'80'   Recovery scenario.This flag will be set to ON *03942500
                         on the initial invocation of the exit when    *03951500
                         contention management responsibilities have   *03960500
                         been assigned due to the connector who was    *03969500
                         previously assigned these duties having       *03978500
                         failed or disconnected. This flag will also   *03987500
                         be set ON when a connector with an interest   *03996500
                         in the resource (other than the contention    *04005500
                         manager) has failed or disconnected such that *04014500
                         its entry has been removed                     04023500
CEPLNOTIFYRESPONSE EQU X'40' Contention Exit is being invoked to       *04032500
                         present the results of executing Notify Exits *04041500
                         of selected resource owners as requested by   *04050500
                         the previous invocation of this exit. No new  *04059500
                         requests will be present on the resource      *04068500
                         request queue when the exit is being driven   *04077500
                         for this.                                      04086500
CEPLGRANTFAILED EQU X'20' XES was unable to grant one or more requests *04095500
                         as instructed by the previous invocation of   *04104500
                         this exit. The resource request queue is      *04113500
                         updated to reflect the results of the failing *04122500
                         requests(s). If a failed request was an       *04131500
                         attempt to obtain ownership of a resource     *04140500
                         (i.e. failed IXLLOCK REQUEST(OBTAIN)), the    *04149500
                         resultant request queue will not contain an   *04158500
                         entry for the failed request. Any requests to *04167500
                         execute the Notify exits of resource owners    04176500
*                        during the previous invocation of this exit   *04185500
                         will have been cancelled as a result of the   *04194500
                         failed attempt to grant a request. No New     *04203500
                         requests will be present during this          *04212500
                         invocation of the exit                         04221500
CEPLRESTARTAFTERDEFER EQU X'10' This flag is ON during the initial     *04221900
                         invocation of the contention exit after it    *04222300
                         has been deferred for rebuild processing      *04222700
                         (i.e. the exit has been restarted after       *04223100
                         rebuild). Please see the documentation for    *04223500
                         contention exit return code                   *04223900
                         IxlRcContExitRebuildDefer in mapping macro    *04224300
                         IXLYCON for more details on deferring a       *04224700
                         contention exit during rebuild processing.    *04225100
                         Please note, the content of the Contention     04225500
*                        Exit Parameter list during this invocation of *04225900
                         the exit will be identical to the Contention  *04226300
                         Exit parameter list that was presented to the *04226700
                         previous invocation of the exit (i.e. the     *04227100
                         invocation which requested that processing be *04227500
                         deferred) with the following exceptions...    *04227900
                         (1) Any work area updates that were made      *04228300
                         during the previous invocation of the exit    *04228700
                         will have been preserved (2) A connector      *04229100
                         whose interest in this resource was reflected  04229500
*                        on the resource request queue during the      *04229900
                         previous invocation of the exit may no longer *04230300
                         be represented due to recovery processing     *04230700
                         (i.e. the connector failed or disconnected    *04231100
                         and cleanup has occurred). Note, the          *04231500
                         CeplRecovery flag will be ON if cleanup has   *04231900
                         occurred.                                      04232300
         ORG   CEPLREASONFLAGS+X'00000001'                              04233000
CEPLMISCFLAGS DS 0BL1    Miscellaneous informational flags              04247500
CEPLREBUILD EQU X'80'    Resource in contention is for the new         *04262000
                         structure during the rebuild process.          04276700
CEPLREBUILDORIG EQU X'40' Resource in contention is for the original   *04325200
                         structure during the rebuild process.          04373700
         ORG   CEPLFLAGS+X'00000002'                                    04422200
CEPLNEW# DS    1FL2      Number of new requests present on the         *04438500
                         resource request queue. The resource request  *04454800
                         queue will contain at most one new request    *04471100
                         during any invocation of the exit. When this  *04487400
                         value is one, the new entry is pointed to by  *04503700
                         CeplNew                                        04520000
CEPLENT@ DS    1AL4      Address of the first entry on the resource    *04536300
                         request queue. Each entry is mapped by        *04552600
                         CEPLENT and contains a pointer to any         *04568900
                         subsequent entries. This field could possibly *04585200
                         contain the same value as the CeplNew          04601500
CEPLENT# DS    1FL4      Number of entries on the resource request     *04617800
                         queue. Please note, this value could          *04634100
                         potentially be zero.                           04659100
CEPLRETCODE DS 1FL4      Contention exit return code. Values are       *04684100
                         defined in IXLYCON.                            04734100
CEPL_LEN EQU   *-CEPL                                                   04800500
.L0002   ANOP                                                           04829600
         AIF   ('&CEPLENT' EQ 'NO').L0005                               04858700
         AIF   ('&DSECT' EQ 'YES').L0006                                04887800
         AIF   ('&CEPLENT' NE 'YES').L0005                              04916900
CEPLENT  DS    0F        Mapping of Resource Request queue elements     04946000
         AGO   .L0007                                                   04975100
.L0006   ANOP                                                           05004200
CEPLENT  DSECT           Mapping of Resource Request queue elements     05033300
.L0007   ANOP                                                           05062400
CEPLENEXT DS   1AL4      Output field indicating the address of next   *05073300
                         CEPLENT. This field will be zero if this is   *05084200
                         the last element                               05095100
CEPLECONVERSION DS 1CL0004 Output field indicating the Version Number  *05106000
                         of the connector whose interest in the        *05116900
                         resource for which the exit is being driven   *05127800
                         is reflected by this entry.                    05138700
         DS    1CL0005   Reserved                                       05149700
CEPLECONID DS  1FL1      Output field indicating the Connector ID of   *05161300
                         the connector whose interest in the resource  *05172900
                         for which the exit is being driven is         *05184500
                         reflected by this entry                        05196100
         DS    1CL0006   Reserved                                       05207900
CEPLECONNAME DS 1CL0016  Output field indicating the Connect name of   *05219500
                         the connector whose interest in the resource  *05231100
                         for which the exit is being driven is         *05242700
                         reflected by this entry                        05254300
         DS    1CL0016   Reserved                                       05266100
CEPLEWORK DS   1CL0032   Entry Work area. Input/Output field which is  *05271600
                         initialized to zero upon first presentation   *05277100
                         to the exit. This workarea is shared between  *05282600
                         this exit and the Notify exit of the          *05288100
                         connector represented by this entry.          *05293600
                         Specifically, if this exit requests that the  *05299100
                         Notify exit of the connector represented by   *05304600
                         this entry be executed (i.e. CepleNotify=ON), *05310100
                         the NEPLWork field will be initialized to the *05315600
                         value of this field. Similarly, any updates    05321100
*                        made to the NEPLWork field by the Notify exit *05326600
                         will be communicated to the Contention Exit   *05332100
                         via this field                                 05337600
CEPLEFLAGS DS  0CL0004                                                  05343700
CEPLESTATUSFLAGS DS 0BL1 Output flags representing this connector's    *05350000
                         interest in the specified resource. The       *05356300
                         condition indicated by the flags within this  *05362600
                         field are NOT mutually exclusive and as such  *05368900
                         may be set to ON singularly or in combination  05375200
CEPLEOWNED EQU X'80'     Set to ON if the connector represented by     *05381500
                         this entry is an owner of the resource for    *05387800
                         which the Contention exit is being executed    05394100
CEPLEPENDING EQU X'40'   Set to ON if the entry contains information   *05400400
                         for a pending request. Specific information   *05406700
                         regarding the pending request is available in *05413000
                         the CepleReq field.                            05419300
         ORG   CEPLESTATUSFLAGS+X'00000001'                             05426100
CEPLEACTIONFLAGS DS 0BL1 Input flag bits indicating actions,if any,    *05432700
                         should be taken against the resource/request. *05439300
                         Please note, the CepleGrant, CepleDeny, and   *05445900
                         CepleRegrant flags are mutually exclusive. If *05452500
                         more than one of these mutually exclusive     *05459100
                         flags is specified, the first encountered in  *05465700
                         the bit string will take precedence (i.e. If  *05472300
                         CepleGrant and CepleDeny are both ON, XES     *05478900
                         will process it as a request to grant).        05485500
CEPLEGRANT EQU X'80'     Grant this pending request with the           *05492100
                         attributes reflected in the CepleGrt fields.  *05498700
                         If this field is set and this entry does NOT  *05505300
                         represent a pending request (i.e.             *05511900
                         CeplePending = OFF), this entry will be       *05518500
                         ignored.                                       05525100
CEPLEDENY EQU  X'40'     Deny this pending request. The value of the   *05531700
                         CepleGudata field will be presented to the    *05538300
                         requestor via the appropriate means as part   *05544900
                         of request completion. This ability to "Deny  *05551500
                         with Updated User Data" could potentially     *05558100
                         allow informational data, such as why the     *05564700
                         request was denied, to be transported to the  *05571300
                         requestor. The values of the CepleGState and  *05577900
                         CepleGRdata are ignored when this option us   *05584500
                         used. If this field is set and this entry      05591100
*                        does NOT represent a pending request (i.e.    *05597700
                         CeplePending = OFF), this entry will be       *05604300
                         ignored.                                       05610900
CEPLEREGRANT EQU X'20'   Regrant the resource with the State and User  *05617500
                         data that are reflected in the appropriate    *05624100
                         CepleGrt fields. The current value of the     *05630700
                         Record data may not be changed via the        *05637300
                         regrant function and, as such, the value of   *05643900
                         the CepleGRData field is ignored when this    *05650500
                         option is specified. If this field is set and *05657100
                         this entry does NOT represent an owned        *05663700
                         resource (i.e. CepleOwned = OFF), this entry  *05670300
                         will be ignored.                               05676900
CEPLENOTIFY EQU X'10'    Execute the Notify Exit of the resource owner *05683500
                         who is reflected by this entry. If this field *05686100
                         is specified and this entry does NOT          *05688700
                         represent an owned resource (i.e. CepleOwned  *05691300
                         = OFF), this entry will be ignored.            05693900
         ORG   CEPLEACTIONFLAGS+X'00000001'                             05696700
         DS    1CL0002   Reserved                                       05719900
CEPLEHELDREQ DS 0CL0200  Held/Requested Info                            05728300
CEPLEHELD DS   0CL0068   Ownership information. The ownership          *05736700
                         information is only valid if this entry       *05745100
                         represents an owned resource as indicated by  *05753500
                         the CepleOwned flag being ON                   05761900
CEPLEHSTATE DS 1FL1      Output field indicating the State in which    *05770300
                         the connector whose interest is reflected by  *05778700
                         this entry currently owns the specified       *05787100
                         resource. Valid values for this field are     *05795500
                         provided via constants in the IXLYCON macro   *05803900
                         in the form of IXLSTATE....                    05812300
CEPLEHUDATA DS 1CL0064   Output field indicating the User data         *05820700
                         associated with the owned resource             05829100
         DS    1CL0003   Reserved                                       05838400
CEPLEREQ DS    0CL0132   Pending Request information                    05844500
CEPLERSTATE DS 1FL1      Output field indicating the State in which    *05850600
                         the connecter whose interest is reflected by  *05856700
                         this entry desires to own the specified       *05862800
                         resource. Valid values for this field are     *05868900
                         provided via constants in the IXLYCON macro   *05875000
                         in the form of IXLSTATExxxx. If this entry    *05881100
                         does not represent a pending request          *05887200
                         (CeplePending=OFF) this area will be          *05893300
                         initialized to the value of CepleHState.       05899400
CEPLERUDATA DS 1CL0064   Output field indicating the User Data value   *05905500
                         in which the connector whose interest is      *05911600
                         reflected by this entry desires to have       *05917700
                         associated with the specified resource. If    *05923800
                         this entry does not represent a pending       *05929900
                         request (CeplePending=OFF) this area will be  *05936000
                         initialized to the value of CepleHUData.       05942100
         DS    1CL0003   Reserved                                       05949900
CEPLERRDATA DS 1CL0064   Output area indicating the value that was     *05953100
                         specified via the RDATAVAL field on the       *05956300
                         pending IXLLOCK request. If this entry does   *05959500
                         not represent a pending request               *05962700
                         (CeplePending=OFF) or it represents an        *05965900
                         IXLLOCK request for which an RDATAVAL         *05969100
                         specification is not valid then this area     *05972300
                         will be initialized to zero.                   05975500
CEPLEGRT DS    0CL0132   Grant/ReGrant input area When CepleGrant=ON   *05978900
                         or CepleReGrant=ON indicates State and Udata  *05993600
                         values in which to Grant/Regrant the request. *06022700
                         This field will be initialized to CepleReq in *06051800
                         all invocations of the Contention exit with   *06080900
                         the following exception: (1) On a response    *06110000
                         from Notify exits, the CepleGrt field will    *06139100
                         have the same contents as on the previous     *06168200
                         invocation of the Contention Exit. That is,   *06197300
                         within any instance of a contention exit       06226400
*                        communicating with the Notify Exit, the       *06255500
                         CepleGrt field will persist                    06284600
CEPLEGSTATE DS 1FL1      Granted ownership state, Constants in IXLYCON  06313700
CEPLEGUDATA DS 1CL0064   Granted user data                              06342800
         DS    1CL0003   Reserved                                       06352500
CEPLEGRDATA DS 1CL0064   Granted Record Data                            06362200
CEPLENT_LEN EQU *-CEPLENT                                               06371900
.L0005   ANOP                                                           06401000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 06430100
         AIF   ('&LIST' EQ 'YES').P4                                    06459200
.P3      ANOP                                                           06488300
         POP   PRINT                                                    06517400
.P4      ANOP                                                           06546500
.P_EXIT  ANOP                                                           06575600
         MEND                                                           06604700
**/ IXLYCEPL_2:;                                                        06633800
* %IXLYCEPL_INCLUDED = 'YES';                                           06662900
* %DCL ZCBPRINT CHAR EXT;                                               06692000
* %DEACTIVATE ZCBPRINT;                                                 06721100
* %DCL IXLYCEPL_LIST CHAR EXT;                                          06750200
* %DEACTIVATE IXLYCEPL_LIST;                                            06779300
* %IF IXLYCEPL_LIST ^= 'NO' &                                           06808400
*    ZCBPRINT ^= 'NO' %THEN                                             06837500
*   %GOTO IXLYCEPL_3;                                                   06866600
*   @LIST PUSH NOECHO;                                                  06895700
*   @LIST NOASSEMBLE NOECHO;                                            06924800
*   @LIST OFF C NOECHO;                                                 06953900
* %IXLYCEPL_3:;                                                         06983000
*/* Start of PL/X Source                                             */ 07012100
* DCL 1 CEPL BASED,                 /* Contention exit parameter list   07062100
*                                                                    */ 07900000
*     2 CeplConToken CHAR(16),      /* Connect token identifying the    07906600
*                                      connected user who has been      07913200
*                                      chosen by XES to manage this     07919800
*                                      instance of resource contention  07926400
*                                      (i.e. the connector whose        07933000
*                                      contention exit is executing) */ 07939600
*     2 CeplConData CHAR(8),        /* Connect-time data of the         07946200
*                                      connector whose contention exit  07952800
*                                      is driven.  This field is user   07959400
*                                      defined data provided as input   07966000
*                                      to IXLCONN.                   */ 07972600
*     2 CeplRname@ PTR(31),         /* Name of the Resource for which   07979200
*                                      the Contention exit is           07985800
*                                      executing.  Please note, the     07992400
*                                      Resource Name along with the     07999000
*                                      Hash Value serves to fully       08005600
*                                      qualify an IXLLOCK Resource   */ 08012200
*     2 CeplRnameLen FIXED(32),     /* Length of Resource Name       */ 08018800
*     2 CeplHashVal FIXED(32),      /* Hash value of the Resource for   08025400
*                                      which the Contention Exit is     08032000
*                                      executing.  Please note, the     08038600
*                                      Hash Value along with the        08045200
*                                      Resource Name fully qualifies an 08051800
*                                      IXLLOCK Resource              */ 08058400
*     2 CeplWork CHAR(32),          /* Contention Exit Work area.       08065000
*                                      Please note, this area is        08071600
*                                      initialized to zero upon the     08078200
*                                      first entry to the Contention    08084800
*                                      Exit.  Any updates will persist  08091400
*                                      between invocations of the exit  08098000
*                                      until this instance of           08104600
*                                      Contention management has        08111200
*                                      ceased.                       */ 08127700
*     2 CeplNew@ PTR(31),           /* Address of the entry on the      08144200
*                                      Resource Request queue for a     08150800
*                                      new, pending request that has    08157400
*                                      not been previously presented to 08164000
*                                      the exit.  This field is only    08170600
*                                      valid when a new request is      08177200
*                                      present on the queue (i.e.       08183800
*                                      CEPLNEW#=1).  The new entry is   08190400
*                                      mapped by CEPLENT             */ 08197000
*     2 CeplFlags Bit(16),          /* Informational Flags           */ 08203600
*       3 CeplReasonFlags Bit(8),   /* Flags indicating the Reason for  08210200
*                                      which the exit has been given    08216800
*                                      control                       */ 08223400
*        4 CeplRecovery Bit(1),     /* Recovery scenario.This flag will 08230000
*                                      be set to ON on the initial      08236600
*                                      invocation of the exit when      08243200
*                                      contention management            08249800
*                                      responsibilities have been       08256400
*                                      assigned due to the connector    08263000
*                                      who was previously assigned      08269600
*                                      these duties having failed or    08276200
*                                      disconnected. This flag will     08282800
*                                      also be set ON when a connector  08289400
*                                      with an interest in the resource 08296000
*                                      (other than the contention       08302600
*                                      manager) has failed or           08309200
*                                      disconnected such that its       08315800
*                                      entry has been removed        */ 08322400
*        4 CeplNotifyResponse Bit(1), /* Contention Exit is being       08329000
*                                      invoked to present the results   08335600
*                                      of executing Notify Exits of     08342200
*                                      selected resource owners as      08348800
*                                      requested by the previous        08355400
*                                      invocation of this exit.  No new 08362000
*                                      requests will be present on the  08368600
*                                      resource request queue when the  08375200
*                                      exit is being driven for this.   08381800
*                                                                    */ 08388400
*        4 CeplGrantFailed    Bit(1), /* XES was unable to grant one or 08395000
*                                      more requests as instructed by   08401600
*                                      the previous invocation of this  08408200
*                                      exit.  The resource request      08414800
*                                      queue is updated to reflect the  08421400
*                                      results of the failing           08428000
*                                      requests(s).  If a failed        08434600
*                                      request was an attempt to obtain 08441200
*                                      ownership of a resource (i.e.    08447800
*                                      failed IXLLOCK REQUEST(OBTAIN)), 08454400
*                                      the resultant request queue will 08461000
*                                      not contain an entry for the     08467600
*                                      failed request.  Any requests to 08474200
*                                      execute the Notify exits of      08480800
*                                      resource owners during the       08487400
*                                      previous invocation of this exit 08494000
*                                      will have been cancelled as a    08500600
*                                      result of the failed attempt to  08507200
*                                      grant a request.  No New         08513800
*                                      requests will be present during  08520400
*                                      this invocation of the exit   */ 08527000
*        4 CeplRestartAfterDefer Bit(1), /* This flag is ON during the  08527100
*                                      initial invocation of the        08527200
*                                      contention exit after it has     08527300
*                                      been deferred for rebuild        08527400
*                                      processing (i.e. the exit has    08527500
*                                      been restarted after rebuild).   08527600
*                                      Please see the documentation     08527700
*                                      for contention exit return code  08527800
*                                      IxlRcContExitRebuildDefer in     08527900
*                                      mapping macro IXLYCON for more   08528000
*                                      details on deferring a           08528100
*                                      contention exit during rebuild   08528200
*                                      processing. Please note, the     08528300
*                                      content of the Contention Exit   08528400
*                                      Parameter list during this       08528500
*                                      invocation of the exit will be   08528600
*                                      identical to the Contention      08528700
*                                      Exit parameter list that was     08528800
*                                      presented to the previous        08528900
*                                      invocation of the exit (i.e.     08529000
*                                      the invocation which requested   08529100
*                                      that processing be deferred)     08529200
*                                      with the following exceptions... 08529300
*                                      (1) Any work area updates that   08529400
*                                      were made during the previous    08529500
*                                      invocation of the exit will      08529600
*                                      have been preserved (2) A        08529700
*                                      connector whose interest in      08529800
*                                      this resource was reflected      08529900
*                                      on the resource request queue    08530000
*                                      during the previous invocation   08530100
*                                      of the exit may no longer be     08530200
*                                      represented due to recovery      08530300
*                                      processing (i.e. the connector   08530400
*                                      failed or disconnected and       08530500
*                                      cleanup has occurred). Note,     08530600
*                                      the CeplRecovery flag will be    08530700
*                                      ON if cleanup has occurred.      08530800
*                                                                @O1A*/ 08530900
*       3 CeplMiscFlags Bit(8),     /* Miscellaneous informational      08533600
*                                      flags                         */ 08540200
*        4 CeplRebuild   Bit(1),    /* Resource in contention is for    08546800
*                                      the new structure during the     08553400
*                                      rebuild process.              */ 08560000
*        4 CeplRebuildOrig Bit(1),  /* Resource in contention is for    08561300
*                                      the original structure during    08562600
*                                      the rebuild process.      @O1A*/ 08563900
*        4 *               Bit(6),  /* Reserved                  @O1A*/ 08565200
*     2 CeplNew# FIXED(16),         /* Number of new requests present   08566600
*                                      on the resource request queue.   08573200
*                                      The resource request queue will  08579800
*                                      contain at most one new request  08586400
*                                      during any invocation of the     08593000
*                                      exit.  When this value is one,   08599600
*                                      the new entry is pointed to by   08606200
*                                      CeplNew@                      */ 08612800
*     2 CeplEnt@ PTR(31),           /* Address of the first entry on    08619400
*                                      the resource request queue.      08626000
*                                      Each entry is mapped by CEPLENT  08632600
*                                      and contains a pointer to any    08639200
*                                      subsequent entries.  This field  08645800
*                                      could possibly contain the same  08652400
*                                      value as the CeplNew@         */ 08659000
*     2 CeplEnt# FIXED(32),         /* Number of entries on the         08665600
*                                      resource request queue.  Please  08672200
*                                      note, this value could           08678800
*                                      potentially be zero.         */  08695300
*     2 CeplRetCode Fixed(32),      /* Contention exit return code.     08711800
*                                      Values are defined in IXLYCON.   08718400
*                                                                    */ 08734200
*     2 * CHAR(0) Bdy(Dword);                                           08750000
*DCL CeplRname CHAR(*) BASED;       /* Resource name                 */ 08764000
*DCL 1 CeplEnt BASED,               /* Mapping of Resource Request      08778000
*                                      queue elements                */ 08792000
*     2 CepleNext PTR(31),          /* Output field indicating the      08806000
*                                      address of next CEPLENT.  This   08820000
*                                      field will be zero if this is    08834000
*                                      the last element              */ 08848000
*     2 CepleConVersion CHAR(4),    /* Output field indicating the      08862000
*                                      Version Number of the connector  08876000
*                                      whose interest in the resource   08890000
*                                      for which the exit is being      08904000
*                                      driven is reflected by this      08918000
*                                      entry.                        */ 08932000
*     2 *               CHAR(5),    /* Reserved                      */ 08946600
*     2 CepleConID      Fixed(8),   /* Output field indicating the      08953200
*                                      Connector ID of the connector    08959800
*                                      whose interest in the resource   08966400
*                                      for which the exit is being      08973000
*                                      driven is reflected by this      08979600
*                                      entry                         */ 08986200
*     2 *               CHAR(6),    /* Reserved                      */ 08993200
*     2 CepleConName CHAR(16),      /* Output field indicating the      09000100
*                                      Connect name of the connector    09007000
*                                      whose interest in the resource   09013900
*                                      for which the exit is being      09020800
*                                      driven is reflected by this      09027700
*                                      entry                         */ 09034600
*     2 * CHAR(16),                 /* Reserved                      */ 09041600
*     2 CepleWork CHAR(32),         /* Entry Work area.  Input/Output   09046400
*                                      field which is initialized to    09051200
*                                      zero upon first presentation to  09056000
*                                      the exit.  This workarea is      09060800
*                                      shared between this exit and the 09065600
*                                      Notify exit of the connector     09070400
*                                      represented by this entry.       09075200
*                                      Specifically, if this exit       09080000
*                                      requests that the Notify exit of 09084800
*                                      the connector represented by     09089600
*                                      this entry be executed (i.e.     09094400
*                                      CepleNotify=ON), the NEPLWork    09099200
*                                      field will be initialized to the 09104000
*                                      value of this field.  Similarly, 09108800
*                                      any updates made to the NEPLWork 09113600
*                                      field by the Notify exit will be 09118400
*                                      communicated to the Contention   09123200
*                                      Exit via this field           */ 09128000
*     2 CepleFlags Char(4),         /*                               */ 09133300
*       3 CepleStatusFlags Bit(8),  /* Output flags representing this   09139600
*                                      connector's interest in the      09145900
*                                      specified resource.  The         09152200
*                                      condition indicated by the flags 09158500
*                                      within this field are NOT        09164800
*                                      mutually exclusive and as such   09171100
*                                      may be set to ON singularly or   09177400
*                                      in combination                */ 09183700
*         4 CepleOwned BIT(1),      /* Set to ON if the connector       09190000
*                                      represented by this entry is an  09196300
*                                      owner of the resource for which  09202600
*                                      the Contention exit is being     09208900
*                                      executed                      */ 09215200
*         4 CeplePending BIT(1),    /* Set to ON if the entry contains  09221500
*                                      information for a pending        09227800
*                                      request.  Specific information   09234100
*                                      regarding the pending request is 09240400
*                                      available in the CepleReq field. 09246700
*                                                                    */ 09253000
*         4 *            BIT(6),    /* Reserved                      */ 09261100
*       3 CepleActionFlags Bit(8),  /* Input flag bits indicating       09265100
*                                      actions,if any, should be taken  09269100
*                                      against the resource/request.    09273100
*                                      Please note, the CepleGrant,     09277100
*                                      CepleDeny, and CepleRegrant      09281100
*                                      flags are mutually exclusive.    09285100
*                                      If more than one of these        09289100
*                                      mutually exclusive flags is      09293100
*                                      specified, the first encountered 09297100
*                                      in the bit string will take      09301100
*                                      precedence (i.e.  If CepleGrant  09305100
*                                      and CepleDeny are both ON, XES   09309100
*                                      will process it as a request to  09313100
*                                      grant).                       */ 09317100
*         4 CepleGrant BIT(1),      /* Grant this pending request with  09321100
*                                      the attributes reflected in the  09325100
*                                      CepleGrt fields.  If this field  09329100
*                                      is set and this entry does NOT   09333100
*                                      represent a pending request      09337100
*                                      (i.e.  CeplePending = OFF), this 09341100
*                                      entry will be ignored.        */ 09345100
*         4 CepleDeny BIT(1),       /* Deny this pending request.  The  09349100
*                                      value of the CepleGudata field   09353100
*                                      will be presented to the         09357100
*                                      requestor via the appropriate    09361100
*                                      means as part of request         09365100
*                                      completion.  This ability to     09369100
*                                      "Deny with Updated User Data"    09373100
*                                      could potentially allow          09377100
*                                      informational data, such as why  09381100
*                                      the request was denied, to be    09385100
*                                      transported to the requestor.    09389100
*                                      The values of the CepleGState    09393100
*                                      and CepleGRdata are ignored when 09397100
*                                      this option us used.  If this    09401100
*                                      field is set and this entry does 09405100
*                                      NOT represent a pending request  09409100
*                                      (i.e.  CeplePending = OFF), this 09413100
*                                      entry will be ignored.        */ 09417100
*         4 CepleRegrant BIT(1),    /* Regrant the resource with the    09421100
*                                      State and User data that are     09425100
*                                      reflected in the appropriate     09429100
*                                      CepleGrt fields.  The current    09433100
*                                      value of the Record data may not 09437100
*                                      be changed via the regrant       09441100
*                                      function and, as such, the value 09445100
*                                      of the CepleGRData field is      09449100
*                                      ignored when this option is      09453100
*                                      specified.  If this field is set 09457100
*                                      and this entry does NOT          09461100
*                                      represent an owned resource      09465100
*                                      (i.e.  CepleOwned = OFF), this   09469100
*                                      entry will be ignored.        */ 09473100
*         4 CepleNotify BIT(1),     /* Execute the Notify Exit of the   09477100
*                                      resource owner who is reflected  09481100
*                                      by this entry. If this field is  09482600
*                                      specified and this entry does    09484100
*                                      NOT represent an owned resource  09485600
*                                      (i.e.  CepleOwned = OFF), this   09487100
*                                      entry will be ignored.        */ 09488600
*         4 *           Bit(4),     /* Reserved                      */ 09490100
*       3 *             Char(2),    /* Reserved                      */ 09495000
*     2 CepleHeldReq,               /* Held/Requested Info           */ 09506500
*       3 CepleHeld,                /* Ownership information.  The      09518000
*                                      ownership information is only    09529500
*                                      valid if this entry represents   09541000
*                                      an owned resource as indicated   09552500
*                                      by the CepleOwned flag being ON  09564000
*                                                                    */ 09575500
*         4 CepleHState FIXED(8),   /* Output field indicating the      09587000
*                                      State in which the connector     09598500
*                                      whose interest is reflected by   09610000
*                                      this entry currently owns the    09621500
*                                      specified resource.  Valid       09633000
*                                      values for this field are        09644500
*                                      provided via constants in the    09656000
*                                      IXLYCON macro in the form of     09667500
*                                      IXLSTATE....                  */ 09679000
*         4 CepleHUdata CHAR(64),   /* Output field indicating the User 09690500
*                                      data associated with the owned   09702000
*                                      resource                      */ 09713500
*         4 *           Char(3),    /* Reserved                      */ 09725000
*       3 CepleReq,                 /* Pending Request information   */ 09731800
*         4 CepleRState FIXED(8),   /* Output field indicating the      09738600
*                                      State in which the connecter     09745400
*                                      whose interest is reflected by   09752200
*                                      this entry desires to own the    09759000
*                                      specified resource.  Valid       09765800
*                                      values for this field are        09772600
*                                      provided via constants in the    09779400
*                                      IXLYCON macro in the form of     09786200
*                                      IXLSTATExxxx.  If this entry     09793000
*                                      does not represent a pending     09799800
*                                      request (CeplePending=OFF) this  09806600
*                                      area will be initialized to the  09813400
*                                      value of CepleHState.         */ 09820200
*         4 CepleRUdata CHAR(64),   /* Output field indicating the User 09827000
*                                      Data value in which the          09833800
*                                      connector whose interest is      09840600
*                                      reflected by this entry desires  09847400
*                                      to have associated with the      09854200
*                                      specified resource.  If this     09861000
*                                      entry does not represent a       09867800
*                                      pending request                  09874600
*                                      (CeplePending=OFF) this area     09881400
*                                      will be initialized to the value 09888200
*                                      of CepleHUData.               */ 09895000
*         4 *           Char(3),    /* Reserved                      */ 09902300
*         4 CepleRRdata CHAR(64),   /* Output area indicating the value 09902700
*                                      that was specified via the       09903100
*                                      RDATAVAL field on the pending    09903500
*                                      IXLLOCK request.  If this entry  09903900
*                                      does not represent a pending     09904300
*                                      request (CeplePending=OFF) or it 09904700
*                                      represents an IXLLOCK request    09905100
*                                      for which an RDATAVAL            09905500
*                                      specification is not valid then  09905900
*                                      this area will be initialized to 09906300
*                                      zero.                         */ 09906700
*     2 CepleGrt,                   /* Grant/ReGrant input area         09907100
*                                      When CepleGrant=ON or            09914200
*                                      CepleReGrant=ON indicates        09921300
*                                      State and Udata values in        09928400
*                                      which to Grant/Regrant the       09935500
*                                      request. This field will         09942600
*                                      be initialized to CepleReq       09949700
*                                      in all invocations of the        09956800
*                                      Contention exit with the         09963900
*                                      following exception:             09971000
*                                      (1) On a response from Notify    09978100
*                                        exits, the CepleGrt field      09985200
*                                        will have the same             09992300
*                                        contents as on the previous    09999400
*                                        invocation of the Contention   10006500
*                                        Exit. That is, within any      10013600
*                                        instance of a contention       10020700
*                                        exit communicating with the    10027800
*                                        Notify Exit, the CepleGrt      10034900
*                                        field will persist          */ 10042000
*       3 CepleGState FIXED(8),     /* Granted ownership state,         10050000
*                                      Constants in IXLYCON          */ 10100000
*       3 CepleGUdata CHAR(64),     /* Granted user data             */ 10125000
*       3 *           Char(3),      /* Reserved                      */ 10150000
*       3 CepleGRdata CHAR(64);     /* Granted Record Data       @D2A*/ 10175000
*/* End of PL/X Source                                               */ 10200000
* %IF IXLYCEPL_LIST ^= 'NO' &                                           10250000
*    ZCBPRINT ^= 'NO' %THEN                                             10300000
*   %GOTO IXLYCEPL_4;                                                   10350000
*   @LIST POP NOECHO;                                                   10400000
* %IXLYCEPL_4:;                                                         10450000
* %END;                                                                 10500000
