*                                                                       00043700
* %DCL IXLYDLIC_INCLUDED CHAR EXT;                                      00087400
* %DEACTIVATE IXLYDLIC_INCLUDED;                                        00131100
* %IF IXLYDLIC_INCLUDED = '' %THEN                                      00174800
* %DO;                                                                  00218500
*/* Macro made bi-lingual on 99021. CBGEN compile date 98009         */ 00262200
*% /*                                                                   00305900
         MACRO                                                          00350000
         IXLYDLIC &DSECT=YES,&LIST=YES,&TITLE=YES,&DLIC=YES             00400000
         GBLC  &IXLYDLIC_INCLUDED                                       00450000
         GBLC  &ZCBPRINT                                                00500000
&IXLYDLIC_INCLUDED SETC 'YES'                                           00550000
         AIF   ('&LIST' EQ 'NONE').P0                                   00566600
         AIF   ('&TITLE' EQ 'NO').P5                                    00583200
 TITLE   'IXLYDLIC  - Dumping List Structure Controls Mapping        '  00600000
.P5      ANOP                                                           00650000
**/ IXLYDLIC_1:;                                                        00700000
*/* START OF SPECIFICATIONS ******************************************* 00800000
*                                                                       00850000
*01* PROPRIETARY STATEMENT =                                            00900000
*                                                                       01200000
*    Licensed Materials - Property of IBM                               01209300
*    "Restricted Materials of IBM"                                      01218600
*    5647-A01                                                           01227900
*    (C) COPYRIGHT IBM CORP. 1993, 2000                                 01237300
*                                                                       01246800
*    US Government Users Restricted Rights - Use, duplication or        01248700
*    disclosure restricted by GSA ADP Schedule Contract with            01250600
*    IBM Corp.                                                          01252500
*                                                                       01254400
*01* STATUS = JBB6609                                                   01256300
*                                                                       01258200
*01* END OF PROPRIETARY STATEMENT                                       01260100
*                                                                       01262500
*01* EXTERNAL CLASSIFICATION: GUPI                                      01275000
*01* END OF EXTERNAL CLASSIFICATION:                                    01287500
*                                                                       01300000
*01* DESCRIPTIVE NAME:  Dumping List Structure Controls Mapping         01350000
*02*  ACRONYM:  DLIC                                                    01400000
*                                                                       01450000
*01* MACRO NAME:  IXLYDLIC                                              01500000
*                                                                       01550000
*01* DSECT NAME:                                                        01600000
*     DLIC                                                              01650000
*                                                                       01700000
*01* COMPONENT:  Cross System Extended Services (SCIXL)                 01750000
*                                                                       01800000
*01* EYE-CATCHER:  None                                                 01850000
*02*  OFFSET:  N/A                                                      01900000
*02*  LENGTH:  N/A                                                      01950000
*                                                                       02000000
*01* STORAGE ATTRIBUTES:                                                02050000
*02*  SUBPOOL:  User Defined                                            02100000
*02*  KEY:  User Defined                                                02150000
*02*  RESIDENCY:  User Defined                                          02200000
*                                                                       02250000
*01* SIZE:                                                              02283300
*           DLIC -- X'0100' bytes                                       02316600
*                                                                       02350000
*01* CREATED BY:  The IXLZSTR CF Structure Data Access Service in the   02383300
*                 user defined ANSAREA                                  02416600
*                                                                       02450000
*01* POINTED TO BY: User                                                02500000
*                                                                       02550000
*01* SERIALIZATION:                                                     02600000
*     None required                                                     02650000
*                                                                       02700000
*01* FUNCTION:                                                          02750000
*     Provides a map of the dumping List Structure controls.            02800000
*                                                                       02850000
*01* METHOD OF ACCESS:                                                  02900000
*                                                                       02950000
*     ASM:                                                              03000000
*         IXLYDLIC                                                      03050000
*     PL/AS:                                                            03100000
*         %dcl ListStrControlsAttr char                                 03150000
*         %ListStrControlsAttr = 'based/defined/via attributes'         03200000
*         %INCLUDE SYSLIB(IXLYDLIC)                                     03250000
*                                                                       03300000
*         If the ListStrControlsAttr macro variable is not set,         03350000
*         the associated mapping will be declared as based.             03400000
*                                                                       03450000
*01* DELETED BY:  N/A                                                   03600000
*                                                                       03650000
*01* FREQUENCY:  N/A                                                    03700000
*                                                                       03750000
*01* DEPENDENCIES:  N/A                                                 03800000
*                                                                       03850000
*01* DISTRIBUTION LIBRARY:                                              04000000
*     AMACLIB                                                           04050000
*                                                                       04100000
*01* CHANGE ACTIVITY:                                                   04150000
*     $L0= SYSLKDFM HBB5510 920518 PD00LA: XLS Initial Release          04183300
*     $D1= DIG0036  HBB5510 930114 PD00LA: Architecture upgrade         04216600
*     $P1= PIG5027  HBB5510 940105 PD00FR: Update descriptions          04227700
*     $L1= DNXES    HBB5520 940414 PD00FR: XES Dynamic Reconfig         04238800
*     $P2= PIG5539  HBB5510 940722 PD00LA: Change the maximum data list 04241600
*                                          entry size from a BIT(5)     04244400
*                                          field to a FIXED(8) field    04247200
*     $D2= DN70092  HBB5520 940815 PD00EA: MAXELEMNUM up to 255         04248600
*     $01= OW15589  HBB5520 960212 PD00FR: Event monitoring support     04249300
*     $02= OW24532  HBB5520 970220 PD00XM: EMC dumping support          04249600
*     $L2= AUTOR    HBB6608 980831 PD00GW: Auto Rebuild                 04249800
*     $L3= MQ       JBB6609 990114 PD00DT: MQSeries Support             04249900
*                                                                       04250000
*                                                                       04300000
* END OF SPECIFICATIONS *********************************************/  04350000
*% /*                                                                   04393700
.P0      ANOP                                                           04415500
         AIF   ('&ZCBPRINT' EQ 'NO').P1                                 04437400
         AIF   ('&LIST' EQ 'YES').P2                                    04481100
.P1      ANOP                                                           04524800
         PUSH  PRINT                                                    04568500
         PRINT OFF                                                      04612200
.P2      ANOP                                                           04655900
*                                                                       04700000
* ****************************************************************** *  04750000
* *                                                                  *  04800000
* *              Dumping List Structure Controls                     *  04850000
* *                                                                  *  04900000
* ****************************************************************** *  04950000
*                                                                       05000000
*                                                                       05050000
         AIF   ('&DLIC' EQ 'NO').L0002                                  05061100
         AIF   ('&DSECT' EQ 'YES').L0003                                05072200
         AIF   ('&DLIC' NE 'YES').L0002                                 05083300
DLIC     DS    0F        Mapping for List Structure controls            05094400
         AGO   .L0004                                                   05105500
.L0003   ANOP                                                           05116600
DLIC     DSECT           Mapping for List Structure controls            05127700
.L0004   ANOP                                                           05138800
         DS    1CL0023   Reserved                                       05146400
DLICFLAGBYTE3 DS 0CL0001 Flag Byte 3 (LEVEL1)                           05154000
DLICMONREAPPINPROGRESS EQU X'04' Monitor reapportionment in progress   *05155700
                         indicator (LEVEL4). 1 indicates that the list *05157400
                         structure monitor to entry storage ratio is   *05159100
                         being reapportioned. 0 indicates that the     *05160800
                         list structure monitor to entry storage ratio *05162500
                         is not being reapportioned.                    05164200
DLICREAPPINPROGRESS EQU X'02' Entry reapportionment in progress        *05165900
                         indicator (LEVEL1). 1 indicates that the list *05167600
                         structure entry to element storage ratio is   *05169300
                         being reapportioned. 0 indicates that the     *05171000
                         list structure entry to element storage ratio *05172700
                         is not being reapportioned.                    05174400
DLICSIZECHNGINPROGRESS EQU X'01' Structure size change in progress     *05176800
                         indicator (LEVEL1)                             05184400
         ORG   DLICFLAGBYTE3+X'00000001'                                05192000
DLICMAXDTLSTENTSIZE DS 1FL1 Maximum data list entry size - specifies   *05242000
                         the maximum size of a data list entry as an   *05300000
                         integral multiple of the list element size.   *05350000
                         The valid values are 1-255                     05400000
DLICFLAGBYTE2 DS 0CL0001 Flag Byte 2                                    05500000
DLICLISTSTRTYPE DS 0BL1  List Structure type - indicates the list      *05550000
                         objects created on allocation                  05600000
DLICLISTSTR_SKI EQU X'80' Secondary key indicator bit 0 0 ==>          *05600100
                         Secondary keys are not supported. 1 ==>       *05600200
                         Secondary keys are supported. (LEVEL9)         05600300
DLICLISTSTR_PLEIDI EQU X'40' PLEID indicator, bit 1 - 0 indicates that *05600500
                         the structure supports programmable list      *05601000
                         entry identifiers. (LEVEL8)                    05601500
DLICLISTSTR_CI EQU X'20' Counter indicator, bit 2 - 0 indicates that   *05602200
                         the list entry count and list entry count     *05604400
                         limit are defined. 1 indicates that the list  *05606600
                         element count and list element count limit    *05608800
                         are defined                                    05611000
DLICLISTSTR_LOCK EQU X'10' Locks requested, bit 3 - 0 indicates that   *05613200
                         no lock table is allocated. 1 indicates that  *05615400
                         a lock table is allocated                      05617600
DLICLISTSTR_DATA EQU X'08' Data requested, bit 4 - 0 indicates that    *05619800
                         the list entries do not have data. 1          *05622000
                         indicates that the list entries do have data   05624200
DLICLISTSTR_ADJ EQU X'04' Adj requested, bit 5 - 0 indicates that the  *05626400
                         list entries do not have adjunct data. 1      *05628600
                         indicates that the list entries so do have    *05630800
                         adjunct data                                   05633000
DLICLISTSTR_NSR EQU X'02' Name support, bit 6 - 0 indicates that the   *05635200
                         list entries are not named. 1 indicates that  *05637400
                         the list entries are named                     05639600
DLICLISTSTR_KSR EQU X'01' Key support, bit 7 - 0 indicates that the    *05641800
                         list entries are not keyed. 1 indicates that  *05644000
                         the list entries are keyed                     05646200
         ORG   DLICFLAGBYTE2+X'00000001'                                05650000
DLICLKTBLENTCHAR DS 1FL1 Lock-table-entry characteristic - specifies   *05700000
                         the number of bytes in each lock table entry. *05750000
                         This is ignored if a lock table is not        *05800000
                         created                                        05850000
DLICLSTELEMCHAR DS 1FL1  List element characteristic - specifies the   *05900000
                         number of bytes in each element                05950000
DLICMINSTRSIZE DS 1FL4   Minimum Structure Size - specifies the        *06000000
                         minimum number of 4K units of facility        *06050000
                         storage that can be allocated for the list    *06100000
                         with the requested attributes. Note that the  *06116600
                         structure can be allocated smaller than this, *06133200
                         but if so, structure attributes such as the   *06149800
                         entry/element ratio will differ significantly *06166400
                         from those which were requested.               06183000
DLICLKTBLENTCT DS 1FL4   Lock-table-entry count - specifies the number *06200000
                         of lock table entries allocated. This is      *06250000
                         ignored if a lock table is not created         06300000
DLICLISTCT DS  1FL4      List count - specifies the number of lists    *06350000
                         created                                        06400000
DLICSTRSIZE DS 1FL4      Structure size - specifies the number of 4K   *06450000
                         units of facility storage allocated for the   *06500000
                         structure                                      06550000
DLICMAXSTRSIZE DS 1FL4   Maximum Structure size - specifies the max    *06600000
                         number of of 4K units of storage blocks that  *06650000
                         can be allocated                               06672500
DLICTGTSTRSIZE DS 1FL4   Target Structure Size - specifies the target  *06695000
                         number of 4K units for facility storage to be *06717500
                         allocated for the list                         06740000
DLICTGTMAXELEMCT DS 1FL4 Target Maximum element count - specifies the  *06762500
                         target for the maximum number of list         *06785000
                         elements that are available for assignment to *06807500
                         list entries or retry data blocks, or both     06841200
DLICTGTMAXENTRYCT DS 1FL4 Target Maximum Entry Count - specifies the   *06875000
                         target for the maximum number of possible     *06897500
                         list entries in a list structure               06920000
DLICMAXLSTSTRELEMCT DS 1FL4 Maximum list structure element count -     *06942500
                         specifies the max number of list elements     *06965000
                         that are available for assignment to list     *06987500
                         entries. This count is only substantially     *07002500
                         accurate.                                      07017500
DLICLSTSTRELEMCT DS 1FL4 List Structure element count - specifies the  *07032500
                         number of list elements that have been        *07055000
                         assigned to list entries.                      07077500
DLICNZLKTBLENTCT DS 1FL4 Nonzero lock-table-entry count - specifies    *07100000
                         the number of nonzero lock table entries that *07150000
                         exist in the structure. This is ignored if    *07200000
                         the lock table is not created                  07250000
DLICMAXLSTENTCT DS 1FL4  Maximum list-structure-entry- count -         *07286300
                         specifies the maximum number of possible list *07322600
                         entries in a list structure. This count is    *07346800
                         only substantially accurate.                   07371000
DLICLSTENTCT DS 1FL4     List-structure-entry count - specifies the    *07395200
                         number of existing list entries in the list   *07431500
                         structure                                      07467800
DLICSTRAUTH DS 1CL0016   Structure Authority - A 16 byte value         *07504100
                         associated with each bit in the SID vector     07540400
DLICUSRSTRCNTL DS 1CL0032 User Structure Control - a 32 byte field     *07576700
                         defined by the user                            07613000
DLICUIDVECTOR DS 1BL32   UID Vector - A bit string with an initial     *07656500
                         value of zero. A bit is set to one when a     *07700000
                         user is assigned with a user ID of i. The bit *07750000
                         at position i is set to 0 when the user is    *07800000
                         unassigned                                     07850000
DLICPENDENTTOELEMRATIO DS 0FL4 Pending entry to element ratio (LEVEL1)  07860000
DLICPENDENTTOELEMENT DS 1FL2 Pending entry to element ratio, entry     *07870000
                         portion (LEVEL1)                               07880000
DLICPENDENTTOELEMELEM DS 1FL2 Pending entry to element ratio, element  *07890000
                         portion (LEVEL1)                               07900000
DLICMARGINALSTRSIZE DS 1FL4 Marginal structure size - true minimum     *07910000
                         size with which the structure can be          *07920000
                         allocated (LEVEL1)                             07930000
DLICEMCCT DS   1FL4      Event monitor controls count - the number of  *07931800
                         event monitor controls objects which are      *07933600
                         currently in use in the structure (LEVEL3)     07935400
DLICMAXEMCCT DS 1FL4     Maximum event monitor controls count - the    *07937200
                         maximum number of event monitor controls, as  *07939000
                         currently allocated in the structure (LEVEL3)  07940800
DLICTGTMAXEMCCT DS 1FL4  Target maximum event monitor controls count - *07942600
                         the target maximum number of event monitor    *07944400
                         controls (LEVEL3)                              07946200
DLICPENDMONTOENTRATIO DS 0FL4 Pending monitor to entry storage ratio   *07946600
                         (LEVEL 4)                                      07947000
DLICPENDMONTOENTMON DS 1FL2 Pending monitor to entry ratio, monitor    *07947400
                         portion (LEVEL4)                               07947800
DLICPENDMONTOENTENT DS 1FL2 Pending monitor to entry ratio, entry      *07948200
                         portion (LEVEL4)                               07948600
DLICLISTSETCURSOR DS 1FL4 List Set Cursor storage ratio (LEVEL 8)       07948800
DLICSTRCOPYCNTLVERSION DS 1FL4 Structure copy controls version number  *07949000
                         (LEVEL 8)                                      07949200
DLICEXTUSERSTRCONTROLS DS 1CL0032 Extended user structure controls     *07949400
                         (LEVEL 8)                                      07949600
         DS    1CL0032   Reserved                                       07949800
*                                                                       07950000
* ****************************************************************** *  08000000
* *                                                                  *  08050000
* *            Length Constants                                      *  08100000
* *                                                                  *  08150000
* ****************************************************************** *  08200000
*                                                                       08250000
*                                                                       08300000
KDLIC_LEN EQU  256       Length of DLIC                                 08314000
DLIC_LEN EQU   *-DLIC                                                   08328000
.L0002   ANOP                                                           08342000
         AIF   ('&ZCBPRINT' EQ 'NO').P3                                 08356000
         AIF   ('&LIST' EQ 'YES').P4                                    08370000
.P3      ANOP                                                           08384000
         POP   PRINT                                                    08398000
.P4      ANOP                                                           08412000
.P_EXIT  ANOP                                                           08426000
         MEND                                                           08440000
**/ IXLYDLIC_2:;                                                        08454000
* %IXLYDLIC_INCLUDED = 'YES';                                           08468000
* %DCL ZCBPRINT CHAR EXT;                                               08482000
* %DEACTIVATE ZCBPRINT;                                                 08496000
* %DCL IXLYDLIC_LIST CHAR EXT;                                          08510000
* %DEACTIVATE IXLYDLIC_LIST;                                            08524000
* %IF IXLYDLIC_LIST ^= 'NO' &                                           08538000
*    ZCBPRINT ^= 'NO' %THEN                                             08552000
*   %GOTO IXLYDLIC_3;                                                   08566000
*   @LIST PUSH NOECHO;                                                  08580000
*   @LIST NOASSEMBLE NOECHO;                                            08594000
*   @LIST OFF C NOECHO;                                                 08608000
* %IXLYDLIC_3:;                                                         08622000
*/* Start of PL/X Source                                             */ 08636000
*                                                                       08650000
* %IF ListStrControlsAttr = '' %THEN                                    08700000
*   %ListStrControlsAttr = 'based';                                     08750000
*                                                                       08800000
*/*******************************************************************/  08850000
*/*                                                                 */  08900000
*/*              Dumping List Structure Controls                    */  08950000
*/*                                                                 */  09000000
*/*******************************************************************/  09050000
*declare                                                                09100000
* 1   DLic char(256) bdy(word) ListStrControlsAttr, /* Mapping for      09150000
*                                      List Structure controls       */ 09200000
*   3   *                 char(23), /* Reserved                  @L1C*/ 09211100
*   3   DLicFlagByte3     char(1),  /* Flag Byte 3 (LEVEL1)      @L1A*/ 09222200
*     5   * BIT(5),                 /* Reserved                  @02C*/ 09224400
*     5   DlicMonReappInProgress BIT(1), /* Monitor reapportionment in  09226600
*                                      progress indicator (LEVEL4).     09228800
*                                      1 indicates that the list        09231000
*                                      structure monitor to entry       09233200
*                                      storage ratio is being           09235400
*                                      reapportioned.  0 indicates      09237600
*                                      that the list structure monitor  09239800
*                                      to entry storage ratio is not    09242000
*                                      being reapportioned.      @02A*/ 09244200
*     5   DlicReappInProgress BIT(1),  /* Entry reapportionment in      09246400
*                                      progress indicator (LEVEL1).     09248600
*                                      1 indicates that the list        09250800
*                                      structure entry to element       09253000
*                                      storage ratio is being           09255200
*                                      reapportioned.  0 indicates      09257400
*                                      that the list structure entry    09259600
*                                      to element storage ratio is not  09261800
*                                      being reapportioned.      @L1A*/ 09264000
*     5   DlicSizeChngInProgress BIT(1), /* Structure size change in    09266600
*                                      progress indicator (LEVEL1)      09277700
*                                                                @L1A*/ 09288800
*   3   DLicMaxDtLstEntSize fixed(8),  /* Maximum data list entry       09338800
*                                         size - specifies the maximum  09450000
*                                      size of a data list entry as an  09500000
*                                      integral multiple of the list    09550000
*                                      element size.  The valid values  09600000
*                                      are 1-255                 @D2C*/ 09650000
*   3  DLicFlagByte2,               /* Flag Byte 2                   */ 09700000
*     5   DLicListStrType  bit(8),  /* List Structure type - indicates  09750000
*                                      the list objects created on      09850000
*                                      allocation                @L3C*/ 09858300
*       7  DLicListStr_SKI BIT(1),  /* Secondary key indicator bit 0    09866600
*                                      0 ==> Secondary keys are not     09874900
*                                      supported.  1 ==> Secondary keys 09883200
*                                      are supported.                   09891500
*                                      (LEVEL9)                  @L3A*/ 09899800
*       7  DLicListStr_PLEIDI bit(1), /* PLEID indicator, bit 1 - 0     09908300
*                                      indicates that the structure     09916600
*                                      supports programmable list       09924900
*                                      entry identifiers.               09933200
*                                      (LEVEL8)                  @L2A*/ 09941500
*       7  DLicListStr_CI  bit(1),  /* Counter indicator, bit 2 - 0     09950000
*                                      indicates that the list entry    10000000
*                                      count and list entry count limit 10050000
*                                      are defined. 1 indicates that    10100000
*                                      the list element count and list  10150000
*                                      element count limit are defined  10200000
*                                                                    */ 10250000
*       7  DLicListStr_Lock bit(1), /* Locks requested, bit 3 - 0       10300000
*                                      indicates that no lock table is  10350000
*                                      allocated.  1 indicates that a   10400000
*                                      lock table is allocated       */ 10450000
*       7  DLicListStr_Data bit(1), /* Data requested, bit 4 - 0        10500000
*                                      indicates that the list entries  10550000
*                                      do not have data. 1 indicates    10600000
*                                      that the list entries do have    10650000
*                                      data                          */ 10700000
*       7  DLicListStr_Adj  bit(1), /* Adj requested, bit 5 - 0         10750000
*                                      indicates that the list entries  10800000
*                                      do not have adjunct data.  1     10850000
*                                      indicates that the list entries  10900000
*                                      so do have adjunct data       */ 10950000
*       7  DLicListStr_NSR  bit(1), /* Name support, bit 6 - 0          11000000
*                                      indicates that the list entries  11050000
*                                      are not named.  1 indicates that 11100000
*                                      the list entries are named    */ 11150000
*       7  DLicListStr_KSR  bit(1), /* Key support, bit 7 - 0 indicates 11200000
*                                      that the list entries are not    11250000
*                                      keyed.  1 indicates that the     11300000
*                                      list entries are keyed        */ 11350000
*   3   DLicLkTblEntChar fixed(8),  /* Lock-table-entry characteristic  11400000
*                                      - specifies the number of bytes  11450000
*                                      in each lock table entry.  This  11500000
*                                      is ignored if a lock table is    11550000
*                                      not created                   */ 11600000
*   3   DLicLstElemChar  fixed(8),  /* List element characteristic -    11650000
*                                      specifies the number of bytes in 11700000
*                                      each element                  */ 11750000
*   3   DLicMinStrSize   fixed(32), /* Minimum Structure Size -         11800000
*                                      specifies the minimum number of  11850000
*                                      4K units of facility storage     11900000
*                                      that can be allocated for the    11950000
*                                      list with the requested          11961100
*                                      attributes.  Note that the       11972200
*                                      structure can be allocated       11983300
*                                      smaller than this,  but if so,   11994400
*                                      structure attributes such as     12005500
*                                      the entry/element ratio will     12016600
*                                      differ significantly from those  12027700
*                                      which were requested.     @P1C*/ 12038800
*   3   DLicLkTblEntCt    fixed(32), /* Lock-table-entry count -        12050000
*                                      specifies the number of lock     12100000
*                                      table entries allocated.  This   12150000
*                                      is ignored if a lock table is    12200000
*                                      not created                   */ 12250000
*   3   DLicListCt        fixed(32), /* List count - specifies the      12300000
*                                      number of lists created       */ 12350000
*   3   DLicStrSize       fixed(32), /* Structure size - specifies the  12400000
*                                      number of 4K units of facility   12450000
*                                      storage allocated for the        12500000
*                                      structure                     */ 12550000
*   3   DLicMaxStrSize    fixed(32),   /* Maximum Structure size -      12600000
*                                      specifies the max number of of   12650000
*                                      4K units of storage blocks that  12700000
*                                      can be allocated          @D1A*/ 12710000
*   3   DLicTgtStrSize    fixed(32),   /* Target Structure Size -       12720000
*                                         specifies the target number   12730000
*                                         of 4K units for facility      12740000
*                                         storage to be allocated for   12750000
*                                         the list               @D1A*/ 12760000
*   3   DLicTgtMaxElemCt  fixed(32),   /* Target Maximum element        12770000
*                                         count - specifies the target  12780000
*                                         for the maximum number of     12790000
*                                         list elements that are        12800000
*                                         available for assignment to   12810000
*                                         list entries or retry data    12820000
*                                         blocks, or both        @D1A*/ 12830000
*   3   DLicTgtMaxEntryCt fixed(32),   /* Target Maximum Entry Count -  12840000
*                                         specifies the target for the  12850000
*                                         maximum number of possible    12860000
*                                         list entries in a list        12870000
*                                         structure              @D1A*/ 12880000
*   3   DLicMaxLstStrElemCt fixed(32),/* Maximum list structure element 12890000
*                                      count - specifies the max number 12900000
*                                      of list elements that are        12950000
*                                      available for assignment to list 13000000
*                                      entries.                         13025000
*                                      This count is only substantially 13050000
*                                      accurate.                 @P1C*/ 13075000
*   3   DLicLstStrElemCt fixed(32), /* List Structure element count -   13100000
*                                      specifies the number of list     13150000
*                                      elements that have been assigned 13200000
*                                      to list entries.              */ 13250000
*   3   DLicNzLkTblEntCt fixed(32),    /* Nonzero lock-table-entry      13300000
*                                         count - specifies the number  13350000
*                                      of nonzero lock table entries    13400000
*                                      that exist in the structure.     13450000
*                                      This is ignored if the lock      13500000
*                                      table is not created          */ 13550000
*   3   DLicMaxLstEntCt   fixed(32), /* Maximum list-structure-entry-   13600000
*                                      count - specifies the maximum    13650000
*                                      number of possible list entries  13700000
*                                      in a list structure.             13725000
*                                      This count is only substantially 13750000
*                                      accurate.                 @P1C*/ 13775000
*   3   DLicLstEntCt      fixed(32), /* List-structure-entry count -    13800000
*                                      specifies the number of existing 13900000
*                                      list entries in the list         13923800
*                                      structure                     */ 13947600
*   3   DLicStrAuth       char(16), /* Structure Authority - A 16 byte  13971400
*                                      value associated with each bit   13992800
*                                      in the SID vector             */ 14014200
*   3   DLicUsrStrCntl    char(32), /* User Structure Control - a 32    14035600
*                                      byte field defined by the        14057000
*                                      user                          */ 14078400
*   3   DLicUIDVector     bit(256), /* UID Vector - A bit string with   14100000
*                                      an initial value of zero.  A bit 14150000
*                                      is set to one when a user is     14200000
*                                      assigned with a user ID of i.    14250000
*                                      The bit at position i is set to  14300000
*                                      0 when the user is unassigned */ 14350000
*   3   DLicPendEntToElemRatio FIXED(32), /* Pending entry to element   14353800
*                                      ratio (LEVEL1)            @L1A*/ 14357600
*     5   DLicPendEntToElemEnt FIXED(16), /* Pending entry to element   14361400
*                                      ratio,  entry portion            14365200
*                                      (LEVEL1)                  @L1A*/ 14369000
*     5   DLicPendEntToElemElem FIXED(16), /* Pending entry to element  14372800
*                                      ratio,  element portion          14376600
*                                      (LEVEL1)                  @L1A*/ 14380400
*   3   DLicMarginalStrSize FIXED(32), /* Marginal structure size -     14384200
*                                      true minimum size with which     14388000
*                                      the structure can be allocated   14391800
*                                      (LEVEL1)                  @L1A*/ 14395600
*   3   DLicEmcCt FIXED(32),        /* Event monitor controls count -   14395800
*                                      the number of event monitor      14396000
*                                      controls objects which are       14396200
*                                      currently in use in the          14396400
*                                      structure (LEVEL3)        @01A*/ 14396600
*   3   DLicMaxEmcCt FIXED(32),     /* Maximum event monitor controls   14396800
*                                      count - the maximum number       14397000
*                                      of event monitor controls,       14397200
*                                      as currently allocated in the    14397400
*                                      structure (LEVEL3)        @01A*/ 14397600
*   3   DLicTgtMaxEmcCt FIXED(32),  /* Target maximum event monitor     14397800
*                                      controls count - the target      14398000
*                                      maximum number of event monitor  14398200
*                                      controls (LEVEL3)         @01A*/ 14398400
*   3   DLicPendMonToEntRatio FIXED(32), /* Pending monitor to entry    14398500
*                                      storage ratio (LEVEL 4)   @02A*/ 14398600
*     5   DLicPendMonToEntMon  FIXED(16), /* Pending monitor to entry   14398700
*                                      ratio, monitor portion           14398800
*                                      (LEVEL4)                  @02A*/ 14398900
*     5   DLicPendMonToEntEnt  FIXED(16), /* Pending monitor to entry   14399000
*                                      ratio,  entry portion            14399100
*                                      (LEVEL4)                  @02A*/ 14399200
*   3   DLicListSetCursor FIXED(32),   /* List Set Cursor               14412500
*                                      storage ratio (LEVEL 8)   @L2A*/ 14425000
*   3   DLicStrCopyCntlVersion FIXED(32),   /* Structure copy controls  14437500
*                                      version number (LEVEL 8)  @L2A*/ 14450000
*   3   DLicExtUserStrControls  CHAR(32),   /* Extended user structure  14462500
*                                      controls       (LEVEL 8)  @L2A*/ 14475000
*   3   *                 char(32); /* Reserved                  @02C*/ 14487500
*@space;                                                                14500000
*                                                                       14550000
*                                                                       14600000
*/*******************************************************************/  14650000
*/*                                                                 */  14700000
*/*            Length Constants                                     */  14750000
*/*                                                                 */  14800000
*/*******************************************************************/  14850000
*declare                                                                14900000
* KDLic_Len Fixed(32) Constant(Length(DLIC));  /* Length of DLIC     */ 14950000
*                                                                       15000000
*/* End of PL/X Source                                               */ 15035700
* %IF IXLYDLIC_LIST ^= 'NO' &                                           15071400
*    ZCBPRINT ^= 'NO' %THEN                                             15107100
*   %GOTO IXLYDLIC_4;                                                   15142800
*   @LIST POP NOECHO;                                                   15178500
* %IXLYDLIC_4:;                                                         15214200
* %END;                                                                 15250000
