*%/*                                                                    00060002
         MACRO                                                          00070002
&NAME    LOAD  &EP=,&EPLOC=,&DE=,&DCB=,&ERRET=,&HIARCHY=,&SF=, @G381P2AX00100000
               &ADRNAPF=,                                      @YA11577X00101600
               &GLOBAL=,&LSEARCH=,&ADDR=,&RELATED=,&LOADPT=,&EOM=       00103300
.*                                                             @G860P35 00106600
.********************************************************************** 00110100
.*                                                                    * 00111200
.* **PROPRIETARY_STATEMENT********************************************  00111700
.***01* PROPRIETARY STATEMENT=                                       *  00112200
.*                                                                   *  00112700
.*                                                                   *  00113200
.*  LICENSED MATERIALS - PROPERTY OF IBM                             *  00113700
.*  THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                      *  00114200
.*  5695-047 (C) COPYRIGHT IBM CORP. 1981,1990                       *  00114700
.*  SEE COPYRIGHT INSTRUCTIONS                                       *  00115200
.*                                                                   *  00115700
.*  STATUS= HBB4430                                                  *  00116200
.*                                                                   *  00116700
.* **END_OF_PROPRIETARY_STATEMENT*************************************  00117200
.*                                                                    * 00118900
.*      OY21876 - CHECK FOR NAME SYMBOL BEFORE CREATING NAME LABEL.   * 00119400
.*      OY29363 - REPLACE CNOP REMOVED BY OY21876.                    * 00119900
.*                                                                    * 00120400
.*  CHANGE-ACTIVITY:                                                  * 00120600
.*  $L1= ANVALLOD HBB4430 901112 PD00XB: Load enhancement             * 00120800
.********************************************************************** 00121100
         LCLB  &RET                                            @G381P2A 00122500
&RET     SETB  ('&ERRET' NE '')                                @G381P2A 00136000
         AIF   ('&NAME' EQ '' OR '&SF' EQ 'L').NONAME          @YA21876 00139300
&NAME    DS    0H                                              @YA21876 00142600
.NONAME  ANOP                                                  @YA21876 00145900
.* BRANCH IF ANY NEW OPERANDS REQUIRING EXTENDED SVC SPECIFIED          00149500
         AIF   ('&GLOBAL' NE '').NEWFORM   BRANCH IF EXTENDED FUNCTION  00163000
.*                                                             @G381P2A 00172000
         AIF   ('&LSEARCH' NE '').NEWFORM   BRANCH IF EXTENDED FUNCTION 00181000
.*                                                             @G381P2A 00190000
         AIF   ('&ADDR' NE '').NEWFORM   BRANCH IF EXTENDED FUNCTION    00199000
.*                                                             @G381P2A 00208000
         AIF   ('&ADRNAPF' NE '').NEWFORM   EXTENDED FUNCTION  @YA11577 00211000
.*                                                             @YA11577 00214000
         AIF   ('&SF' NE '').NEWFORM   BRANCH IF EXTENDED FUNCTION      00217000
.*                                                             @G381P2A 00226000
         AIF   ('&LOADPT' NE '').NEWFORM   BRANCH IF EXTENDED FUNCTION  00230800
.*                                                             @G860P35 00235600
         AIF   ('&EOM' NE '').NEWFORM   BRANCH IF EXTENDED FUNCTION     00240400
.*                                                             @G860P35 00245200
         CNOP  0,4                                             @YA29363 00247600
.NORC    AIF   ('&EP' NE '').PROCEP BRANCH IF EP PRESENT                00250002
         AIF   ('&EPLOC' EQ '' AND '&DE' EQ '').E1                      00300002
         AIF   ('&EPLOC' NE '' AND '&DE' NE '').E2                      00350002
         AIF   ('&DE&EPLOC'(1,1) NE '(').RXTYPE                         00450002
         AIF   ('&DE(1)&EPLOC(1)' NE '0').NOTZER                        00500002
         AGO   .EPHERE                                                  00550002
.NOTZER  ANOP                                                           00600002
         LA    0,0(0,&EPLOC(1)&DE(1))  LOAD PARAMETER INTO REG 0 YM1995 00650002
         AGO   .EPHERE                                                  00700002
.RXTYPE  ANOP                                                           00750002
         LA    0,&EPLOC&DE        LOAD PARAMETER INTO REG 0             00800002
.EPHERE  AIF   ('&DCB' NE '').DCB                                       00850002
.EPOK    AIF   (&RET).FIN                                               00900002
.SRONE   ANOP                                                           00950002
         SR    1,1                SHOW NO DCB PRESENT                   01000002
.SVC     AIF   ('&DE' EQ '').TERM                                       01050002
         LNR   0,0                LOAD NEGATIVE REG 0 TO INDICATE DE    01100002
.TERM    ANOP                                                           01150002
         SVC   8                                                        01200002
.RETTEST ANOP                                                 @G381P2A  01220000
         AIF   ('&ERRET' EQ '').END                                     01250002
         LTR   15,15              RETURN CODE TEST                      01300002
         AIF   ('&ERRET'(1,1) EQ '(').REGRET                            01350002
         BNZ   &ERRET           GO TO ERROR ROUTINE                     01400002
         AGO   .END                                                     01450002
.REGRET  ANOP                                                           01500002
         BCR   7,&ERRET(1)        GO TO ERROR ROUTINE                   01550002
         MEXIT                                                          01600002
.FIN     ANOP                                                           01650002
         L     1,*+8              NO DCB, RETURN CODE REQUESTED         01700002
.TESTO   ANOP                                                           01750002
         B     *+8                BRANCH AROUND CONSTANT                01800002
         DC    X'80000000'        RETURN CODE REQUESTED                 01850002
         AGO   .SVC                                                     01900002
.DCB     AIF   ('&DCB'(1,1) NE '(').RXSPEC                              01950002
         LA    1,0(0,&DCB(1))     LOAD ADDR. OF DCB INTO REG 1   YM1995 02000002
         AGO   .TESTRC                                                  02050002
.RXSPEC  ANOP                                                           02100002
         LA    1,&DCB             LOAD ADDR OF DCB INTO REG 1           02150002
.TESTRC  AIF   (NOT &RET).SVC                                           02200002
         O     1,*+8              INSERT RETURN CODE REQUEST INDICATOR  02250002
         AGO   .TESTO                                                   02300002
.PROCEP  AIF   ('&EPLOC' NE '' OR '&DE' NE '').E2                       02350002
         AIF   ('&EP'(1,1) EQ '(').E4                                   02400002
         AIF   (&RET).RCEPTST                                           02500002
         LA    0,*+8              LOAD PARAMETER INTO REGISTER ZERO     02550002
         B     *+12               BRANCH AROUND CONSTANT(S)             02600002
         DC    CL8'&EP'           ENTRY POINT NAME                      02650002
         AIF   ('&DCB' NE '').NEXTON                                    02700002
         AGO   .SRONE                                                   02750002
.NEXT    ANOP                                                           02800002
         LA    1,0(0,&DCB(1))     LOAD ADDR. OF DCB INTO REG 1   YM1995 02850002
         AGO   .SVC                                                     02900002
.NEXTON  AIF   ('&DCB'(1,1) EQ '(').NEXT                                02950002
         LA    1,&DCB             LOAD ADDR. OF DCB INTO REG 1          03000002
         AGO   .SVC                                                     03050002
.RCEPTST AIF   ('&DCB' NE '').PREDCB                                    03100002
         L     1,*+12             NO DCB SPECIFIED,RETURN CODE REQUEST  03150002
.COMPL   ANOP                                                           03200002
         LA    0,*+12             LOAD PARAMETER INTO REGISTER 0        03250002
         B     *+16               BRANCH AROUND CONSTANT(S)             03300002
         DC    X'80000000'        RETURN CODE REQUESTED                 03350002
         DC    CL8'&EP'           ENTRY POINT NAME                      03400002
         AGO   .TERM                                                    03450002
.PREDCB  AIF   ('&DCB'(1,1) EQ '(').NEXT1                               03500002
         LA    1,&DCB             LOAD DCB ADDRESS IN REGISTER 1        03550002
         O     1,*+12             INDICATE RETURN CODE REQUESTED        03600002
         AGO   .COMPL                                                   03650002
.NEXT1   ANOP                                                           03700002
         LA    1,0(0,&DCB(1))     LOAD DCB ADDRESS IN REGISTER 1 YM1995 03750002
         O     1,*+12             INDICATE RETURN CODE REQUESTED        03800002
         AGO   .COMPL                                                   03850002
.NEWFORM ANOP   PROCESS EXTENDED SVC FORMAT                   @G381P2A  03853000
         AIF   ('&SF' EQ '').NOSF                             @G381P2A  03856000
&NAME    IHBINNRX &EP,&EPLOC,&DE,&DCB,&LSEARCH,&GLOBAL,&ADDR,          X03859000
               &ERRET,LOAD,SF=&SF,LOADPT=&LOADPT,EOM=&EOM,    @ZMB2001 X03860300
               ADRNAPF=&ADRNAPF                               @YA11577  03861600
.*                                                            @G860P35  03863000
         AGO   .XSVC                                          @G381P2A  03865000
.NOSF    ANOP                                                 @G381P2A  03868000
&NAME    IHBINNRX &EP,&EPLOC,&DE,&DCB,&LSEARCH,&GLOBAL,&ADDR,          X03871000
               &ERRET,LOAD,SF=I,LOADPT=&LOADPT,EOM=&EOM,      @ZMB2001 X03872300
               ADRNAPF=&ADRNAPF                               @YA11577  03873600
.*                                                            @G860P35  03875000
.XSVC    ANOP                                                 @G381P2A  03877000
         AIF   ('&SF' EQ 'L').END  LIST FORM NO SVC ISSUED    @G381P2A  03880000
         LA    15,9            LOAD EXTENDED SVC ROUTING CODE @G381P2A  03883000
         SVC   122                ISSUE EXTENDED SVC          @G381P2A  03886000
         AGO   .RETTEST                                       @G381P2A  03889000
.E1      IHBERMAC      31                                               03900002
         MEXIT                                                          03950002
.E2      IHBERMAC      88                                               04000002
         MEXIT                                                          04050002
.E4      IHBERMAC      26                                               04100002
.END     MEND                                                           04150002
**/                                                                     04160002
*LOAD:   MACRO                                                          04200002
*        KEYS(EP,DE,DCB,ERRET,RELATED,GLOBAL,LSEARCH,ADDR,MF,LOADPT,    04233300
*                OUTEPA,OUTLEN,OUTDLEN,OUTR1,OUTR0,       /*     @L1A*/ 04237400
*                NOABEND,RETCODE,                         /*     @L1A*/ 04241500
*                ABENDCODE,ABENDRSNCODE,                  /*     @L1A*/ 04245600
*                ADRNAPF,                                 /* @YA11577*/ 04249900
*                EOM);                                    /* @G860P35*/ 04266600
*                                                         /* @ZMB0463*/ 04300000
*        ANS('?'||MACLABEL||'LOADP '||MACLIST||MACKEYS||';');           04350000
*                                                         /* @G381P2A*/ 04400000
*%END;                                                                  04450000
