*%/*                                                                    00750000
* /* MACCOMP Y-1 SC1CL/PZD81                                         */ 00800000
* /* MACSTAT Y-1 72273/DCR20593                                      */ 00900000
* /* MACSTAT Y-3 77277/OZ26071                               @ZA26071*/ 00925000
* /* MACSTAT Y-3 82039/OZ59816 MISSING & ON KEYREG PARAMETER @ZA59816*/ 00937500
* /*                                                                    00950000
*    COPYRIGHT=                                                    @D1A 00965000
*       5740-XC6 COPYRIGHT IBM CORP 1981,                      @G860PXB 00980000
*       LICENSED MATERIAL-PROGRAM, PROPERTY OF IBM,                @D1A 00995000
*       REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER                @D1A 01010000
*       G120-2083.                                                 @D1A 01025000
*                                                                  @D1A 01040000
*    STATUS= OS/VS2 HBB2102                                    @G860PXB 01055000
*                                                                  @D1A 01070000
* $D1=0057      JBB1326   800923   PDXB:   KEY 2,3,4,7 SUPPORT     @D1A 01085000
*                                          KEYREG,RELATED SUPPORT  @D1A 01092500
* $P1=0187      JBB1326   810130   PDXB                            @P1A 01096200
         MACRO                                                          01100000
&NAME    MODESET  &KEY=,&MODE=,&ENABLE=,&SYSMASK=,&REG=,&MF=,          X01400000
               &EXTKEY=,&SAVEKEY=,&KEYADDR=,&WORKREG=,&RELATED=,       X01600000
               &KEYREG=                                            @D1A 01800000
* MACDATE Y-3 81030                                                @D1A 01850000
         LCLA  &COUNT,&SAVE1,&SAVE2,&PSWKEY                             02100000
.* THE FOLLOWING ARE THE LOCAL SET SYMBOLS FOR THE 4 BYTE PARM LIST     02800000
         LCLB  &B0,&B1,&B2,&B3,&B4,&B5,&B6,&B7                          03500000
         LCLB  &B8,&B9,&B10,&B11,&B12,&B13,&B14,&B15                    04200000
         LCLB  &B16,&B17,&B18,&B19,&B20,&B21,&B22,&B23                  04900000
         LCLB  &B24,&B25,&B26,&B27,&B28,&B29,&B30,&B31                  05600000
         AIF  ((T'&KEY EQ 'O') AND (T'&MODE EQ 'O') AND (T'&ENABLE EQ 'X06300000
               O') AND (T'&SYSMASK EQ 'O') AND (T'&MF EQ 'O') AND (T'&RX07000000
               EG EQ 'O')).PCK                                          07700000
         AGO   .PCK1                                                    07800000
.PCK     AIF   ((T'&EXTKEY EQ 'O') AND (T'&SAVEKEY EQ 'O') AND         X07900000
               (T'&KEYADDR EQ 'O') AND (T'&WORKREG EQ 'O') AND         X07920000
               (T'&KEYREG EQ 'O')).ERROR9                      @ZA59816 07940000
.* @ZA00463                                                             07960000
.* TEST FOR PROTECTION KEY PARAMETERS                                   08000000
.PCK1    AIF   ((T'&EXTKEY NE 'O') OR (T'&SAVEKEY NE 'O') OR           X08100000
               (T'&KEYADDR NE 'O') OR (T'&WORKREG NE 'O') OR           X08150000
               (T'&KEYREG NE 'O')).PROT                            @D1A 08200000
         AIF   (T'&REG NE 'O').ERROR1  REG SPECIFIED             YM4244 09100000
         AIF   ((T'&MF NE 'O') AND ('&MF' NE 'L')).MF                   09800000
         AIF   (T'&KEY EQ 'O').MDE     KEY NOT SPECIFIED                10500000
         AIF   (('&KEY' NE 'ZERO') AND ('&KEY' NE 'NZERO')).ERROR2      11200000
&B26     SETB  1                                                        11900000
&B27     SETB  ('&KEY' EQ 'ZERO')      SET 0 KEY IF ZERO SPECIFIED      12600000
.MDE     ANOP                                                           13300000
         AIF   (T'&MODE EQ 'O').ENAB   MODE NOT SPECIFIED               14000000
         AIF   (('&MODE' NE 'PROB') AND ('&MODE' NE 'SUP')).ERROR3      14700000
&B29     SETB  1                                                        15400000
&B28     SETB  ('&MODE' EQ 'SUP')      INDICATE SUPV STATE IF SUP SPEC  16100000
.ENAB    ANOP                                                           16800000
         AIF   (T'&ENABLE EQ 'O').SMSK ENABLE OPERAND NOT SPECIFIED     17500000
         AGO   .ERROR10                                                 18200000
.SMSK    ANOP                                                           20300000
         AIF   (T'&SYSMASK EQ 'O').MF  SYSMASK NOT SPECIFIED            21000000
         AGO   .ERROR5                                           YM4244 21700000
.MF      ANOP                                                           50400000
         AIF   (T'&MF NE 'O').CK2      WAS MF OMITTED?                  51100000
         CNOP  0,4                                                      51800000
&NAME    BAL   1,*+8                                                    52500000
         AGO   .DC                                                      53200000
.CK2     ANOP                                                           53900000
         AIF   ('&MF' NE 'L').CK3      WAS MF=L SPECIFIED?              54600000
&NAME    DS    0F                                                       55300000
.DC      ANOP                                                           56000000
         DC    B'&B0&B1&B2&B3&B4&B5&B6&B7&B8&B9&B10&B11&B12&B13&B14&B15X56700000
               &B16&B17&B18&B19&B20&B21&B22&B23&B24&B25&B26&B27&B28&B29X57400000
               &B30&B31'                                                58100000
         AIF   (T'&MF EQ 'O').LD                                        58800000
         MEXIT                                                          59500000
.LD      ANOP                                                           60200000
         L     1,0(0,1)                                          YM1995 60900000
         AGO   .SVC                                                     61600000
.CK3     ANOP                                                           62300000
         AIF   ('&MF(1)' EQ 'E').CK4                                    63000000
         AGO   .ERROR6                                                  63700000
.CK4     ANOP                                                           64400000
         AIF  ((T'&KEY NE 'O') OR (T'&MODE NE 'O') OR (T'&ENABLE NE 'O'X65100000
               ) OR (T'&SYSMASK NE 'O') OR (T'&REG NE 'O')).ERROR8      65800000
.CK6     AIF   ('&MF(2)' NE '(1)').CK5                                  66500000
&NAME    L     1,0(1,0)                                          YM1995 67200000
         AGO   .SVC                                                     67900000
.CK5     ANOP                                                           68600000
         AIF   ('&MF(2)'(1,1) EQ '(').ERROR7                            69300000
         AIF   (T'&MF(2) EQ 'N').ERROR7                                 70000000
&NAME    L     1,&MF(2)                                                 70700000
.SVC     ANOP                                                           77700000
         SVC   107                                                      78400000
         MEXIT                                                          79100000
.* TEST THAT THE PROTECTION KEY PARAMETERS ARE MUTUALLY EXCLUSIVE       79107000
.* FROM OTHER MODESET PARAMETERS                                        79114000
.PROT    AIF   ((T'&KEY NE 'O') OR (T'&MODE NE 'O') OR                 X79121000
               (T'&ENABLE NE 'O') OR (T'&SYSMASK NE 'O') OR            X79128000
               (T'&REG NE 'O') OR (T'&MF NE 'O')).ERROR11               79135000
.EXTKEY  ANOP                                                           79163000
.* TEST IF EXTKEY PARAMETER SPECIFIED AND VALID                         79170000
         AIF   (T'&EXTKEY EQ 'O').KEYAD   TEST IF EXTKEY OMITTED        79177000
         AIF   (T'&KEYADDR NE 'O').ERROR15   ERROR IF KEYADDR ALSO      79180000
         AIF   (T'&KEYREG NE 'O').ERROR15    ERROR IF KEYREG ALSO  @D1A 79182000
         AIF   ('&EXTKEY' EQ 'SCHED').SCHED       SCHEDULER KEY         79184000
         AIF   (('&EXTKEY' EQ 'HASP') OR ('&EXTKEY' EQ 'JES')).JES      79187000
.*                                                JES KEY               79189000
         AIF   ('&EXTKEY' EQ 'RSM').RSM           RSM KEY               79191000
         AIF   ('&EXTKEY' EQ 'VSM').VSM           VSM KEY               79198000
         AIF   ('&EXTKEY' EQ 'SRM').SRM           SRM KEY               79205000
         AIF   ('&EXTKEY' EQ 'SUPR').SUPR         SUPREVISOR KEY        79212000
         AIF   ('&EXTKEY' EQ 'DATAMGT').DTMGT     DATA MGT KEY          79219000
         AIF   ('&EXTKEY' EQ 'TCAM').TCAM         TCAM KEY              79226000
         AIF   ('&EXTKEY' EQ 'VTAM').VTAM         VTAM KEY              79233000
         AIF   (('&EXTKEY' EQ 'TCB') OR ('&EXTKEY' EQ 'RBT1') OR       X79233700
               ('&EXTKEY' EQ 'RBT234')).EXTKEY0                         79234400
         AIF   ('&EXTKEY' EQ 'ZERO').ZEROK                              79234800
         AIF   ('&EXTKEY' EQ 'KEY2').KEY2                          @D1A 79234900
         AIF   ('&EXTKEY' EQ 'KEY3').KEY3                          @D1A 79235000
         AIF   ('&EXTKEY' EQ 'KEY4').KEY4                          @D1A 79235100
         AIF   ('&EXTKEY' EQ 'KEY7').KEY7                          @D1A 79235200
         AGO   .ERROR16                                                 79235300
.EXTKEY0 AIF   (T'&WORKREG EQ 'O').ERROR14                              79235800
         AIF   ((&WORKREG LT 0) OR (&WORKREG GT 15)).ERROR12            79236500
         AIF   (T'&SAVEKEY EQ 'O').EXTKEY1                              79237200
         AIF   ('&SAVEKEY' EQ '(2)').EXTKEY2                            79237300
         AIF   (&WORKREG EQ 2).WKREG2 SKIP REG SAVING IF REG2  @ZA26071 79238100
&NAME    LR    &WORKREG,2          SAVE REGISTER 2                      79238900
         IPK   0(0)                SAVE CURRENT PSW KEY                 79239700
         STC   2,&SAVEKEY                                               79240500
         LR    2,&WORKREG          RESTORE REGISTER 2                   79241300
         AGO   .EXTKEY1                                                 79242100
.WKREG2  ANOP                                                  @ZA26071 79242900
&NAME    IPK   0(0)                SAVE CURRENT PSW KEY        @ZA26071 79243700
         STC   2,&SAVEKEY                                      @ZA26071 79244500
         AGO   .EXTKEY1                                        @ZA26071 79245300
.EXTKEY2 ANOP                                                           79246800
&NAME    IPK   0(0)                SAVE CURRENT PSW KEY                 79256000
.EXTKEY1 ANOP                                                           79274000
         AIF   ('&EXTKEY' EQ 'TCB').TCB     KEY FROM TCB                79283000
         AIF   ('&EXTKEY' EQ 'RBT1').RBT1   KEY FROM SVRB               79292000
         AIF   ('&EXTKEY' EQ 'RBT234').RBT234  KEY FROM CALLERS RB      79301000
.* SYMBOLIC VALUES                                                      79310000
.SCHED   ANOP                                                           79317000
&PSWKEY  SETA  X'10'          SCHEDULER KEY IS 1                        79324000
         AGO   .SETKEY                                                  79331000
.JES     ANOP                                                           79332000
&PSWKEY  SETA  X'10'          JES KEY IS 1                              79333000
         AGO   .SETKEY                                                  79334000
.RSM     ANOP                                                           79338000
&PSWKEY  SETA  0              RSM KEY IS 0                              79345000
         AGO   .SETKEY                                                  79352000
.VSM     ANOP                                                           79359000
&PSWKEY  SETA  0              VSM KEY IS 0                              79366000
         AGO   .SETKEY                                                  79373000
.SRM     ANOP                                                           79380000
&PSWKEY  SETA  0              SYSTEM RESOURCE MANAGER KEY IS 0          79387000
         AGO   .SETKEY                                                  79394000
.SUPR    ANOP                                                           79401000
&PSWKEY  SETA  0              SUPERVISOR KEY IS 0                       79408000
         AGO   .SETKEY                                                  79415000
.DTMGT   ANOP                                                           79422000
&PSWKEY  SETA  X'50'          DATA MGT KEY IS 5                         79429000
         AGO   .SETKEY                                                  79436000
.TCAM    ANOP                                                           79443000
&PSWKEY  SETA  X'60'          TCAM KEY IS 6                             79450000
         AGO   .SETKEY                                                  79457000
.VTAM    ANOP                                                           79464000
&PSWKEY  SETA  X'60'          VTAM KEY IS 6                             79471000
         AGO   .SETKEY                                                  79478000
.ZEROK   ANOP                                                           79480000
&PSWKEY  SETA  0                                                        79482000
         AGO   .SETKEY                                                  79484000
.KEY2    ANOP                                                      @D1A 79484500
&PSWKEY  SETA  X'20'                                               @D1A 79485000
         AGO   .SETKEY                                             @D1A 79485500
.KEY3    ANOP                                                      @D1A 79486000
&PSWKEY  SETA  X'30'                                               @D1A 79486500
         AGO   .SETKEY                                             @D1A 79487000
.KEY4    ANOP                                                      @D1A 79487500
&PSWKEY  SETA  X'40'                                               @D1A 79488000
         AGO   .SETKEY                                             @D1A 79488500
.KEY7    ANOP                                                      @D1A 79489000
&PSWKEY  SETA  X'70'                                               @D1A 79489500
         AGO   .SETKEY                                             @D1A 79490000
.* GET KEY FROM TCB                                                     79490500
.TCB     ANOP                                                           79492000
         AIF   (T'&SAVEKEY NE 'O').TCB1                                 79499000
&NAME    IC    &WORKREG,TCBPKF     GET KEY FROM TCB                     79505000
         AGO   .TCB2                                                    79511000
.TCB1    ANOP                                                           79517000
         IC    &WORKREG,TCBPKF     GET KEY FROM TCB                     79523000
.TCB2    ANOP                                                           79529000
         SPKA  0(&WORKREG)         SET PSW KEY                          79535000
         MEXIT                                                          79541000
.* GET KEY FROM SVRB                                                    79548000
.RBT1    ANOP                                                           79555000
         AIF   (T'&SAVEKEY NE 'O').RBT11                                79562000
&NAME    L     &WORKREG,TCBRBP     RB POINTER FROM TCB                  79568000
         AGO   .RBT12                                                   79574000
.RBT11   ANOP                                                           79580000
         L     &WORKREG,TCBRBP     RB POINTER FROM TCB                  79586000
.RBT12   ANOP                                                           79592000
         IC    &WORKREG,RBOPSW+1-RBBASIC(,&WORKREG)  KEY FROM RB OPSW   79598000
         SPKA  0(&WORKREG)         SET PSW KEY                          79604000
         MEXIT                                                          79611000
.* GET KEY FROM CALLERS RB                                              79618000
.RBT234  ANOP                                                           79625000
         AIF   (T'&SAVEKEY NE 'O').RBT2341                              79632000
&NAME    L     &WORKREG,TCBRBP     RB POINTER FROM TCB                  79638000
         AGO   .RBT2342                                                 79644000
.RBT2341 ANOP                                                           79650000
         L     &WORKREG,TCBRBP     RB POINTER FROM TCB                  79656000
.RBT2342 ANOP                                                           79662000
         ICM   &WORKREG,7,RBLINKB-RBBASIC(&WORKREG)  NEXT RB   @G860PXB 79668000
         IC    &WORKREG,RBOPSW+1-RBBASIC(,&WORKREG)  KEY FROM RB OPSW   79674000
         SPKA  0(&WORKREG)         SET PSW KEY                          79680000
         MEXIT                                                          79688000
.* GENERATE SPKA INSTRUCTION                                            79695000
.SETKEY  ANOP                                                           79702000
         AIF   (T'&SAVEKEY NE 'O').SETKEYA                              79709000
&NAME    SPKA  &PSWKEY.(0)         SET PSW KEY                          79716000
         MEXIT                                                          79723000
.SETKEYA ANOP                                                           79730000
         AIF   ('&SAVEKEY' EQ '(2)').SETKEYD                            79730700
         AIF   (T'&WORKREG EQ 'O').ERROR14  TEST FOR WORKREG OPERAND    79731400
         AIF   ((&WORKREG LT 0) OR (&WORKREG GT 15)).ERROR12 VALID CHK  79732100
         AIF   (&WORKREG EQ 2).SETKEYB  TEST IF REG 2 TO BE SAVED       79732800
&NAME    LR    &WORKREG,2          SAVE REGISTER 2                      79733500
         IPK   0(0)                SAVE CURRENT PSW KEY                 79734200
         AGO   .SETKEYC                                                 79734900
.SETKEYB ANOP                                                           79735600
&NAME    IPK   0(0)               SAVE CURRENT PSW KEY                  79737000
.SETKEYC ANOP                                                           79740000
         SPKA  &PSWKEY.(0)         SET PSW KEY                          79744000
         STC   2,&SAVEKEY                                               79751000
         AIF   (&WORKREG EQ 2).EXIT                                     79753000
         LR    2,&WORKREG     RESTORE REGISTER 2                        79755000
         MEXIT                                                          79758000
.SETKEYD ANOP                                                           79765000
&NAME    IPK   0(0)               SAVE CURRENT PSW KEY                  79765100
         SPKA  &PSWKEY.(0)         SET PSW KEY                          79765200
         MEXIT                                                          79765300
.KEYAD   ANOP                                                           79765400
         AIF   (T'&KEYADDR EQ 'O').KREG      TEST IF KEYADDR OMITTED    79765500
         AIF   (T'&KEYREG NE 'O').ERROR15                          @D1A 79765600
         AIF   ('&KEYADDR' EQ '(2)').KEYAD10                            79765700
         AIF   (T'&WORKREG EQ 'O').ERROR14   TEST FOR WORKREG OPERAND   79765800
         AIF   ((&WORKREG LT 0) OR (&WORKREG GT 15)).ERROR12 VALID CHK  79765900
         AIF   (T'&SAVEKEY EQ 'O').KEYAD4                               79766000
         AIF   ('&SAVEKEY' EQ '(2)').KEYAD6                             79766100
         AIF   (&WORKREG EQ 2).KEYAD1   TEST IF REG 2 TO BE SAVED       79766200
&NAME    LR    &WORKREG,2          SAVE REGISTER 2                      79766300
         IPK   0(0)                SAVE CURRENT PSW KEY                 79766400
         AGO   .KEYAD3                                                  79766500
.KEYAD1  ANOP                                                           79766600
&NAME    IPK   0(0)                SAVE CURRENT PSW KEY                 79766700
.KEYAD3  ANOP                                                           79766800
         STC   2,&SAVEKEY                                               79766900
         AIF   (&WORKREG EQ 2).KEYAD2                                   79767000
         LR    2,&WORKREG          RESTORE REGISTER 2                   79767100
.KEYAD2  ANOP                                                           79767200
         IC    &WORKREG,&KEYADDR   GET KEY FROM SAVE LOCATION           79767300
         AGO   .KEYAD5                                                  79767400
.KEYAD4  ANOP                                                           79767500
&NAME    IC    &WORKREG,&KEYADDR   GET KEY FROM SAVE LOCATION           79767600
.KEYAD5  ANOP                                                           79767700
         SPKA  0(&WORKREG)         SET PSW KEY                          79767800
         MEXIT                                                          79767900
.KEYAD6  ANOP                                                           79768000
&NAME    IPK   0(0)                SAVE CURRENT PSW KEY                 79768100
         AGO   .KEYAD2                                                  79768200
.KEYAD10 AIF   (T'&SAVEKEY EQ 'O').KEYAD11                              79768300
         AIF   ('&SAVEKEY' EQ '(2)').ERROR18                            79768400
         AIF   (T'&WORKREG EQ 'O').ERROR14                              79768500
         AIF   (&WORKREG EQ 2).ERROR18                                  79768600
&NAME    LR    &WORKREG,2          SAVE REGISTER 2                      79768700
         IPK   0(0)                SAVE CURRENT PSW KEY                 79768800
         STC   2,&SAVEKEY                                               79768900
         LR    2,&WORKREG          RESTORE REGISTER 2                   79769000
         SPKA  0(2)               SET PSW KEY                           79769100
         MEXIT                                                          79769200
.KEYAD11 ANOP                                                           79769300
&NAME    SPKA  0(2)                SET PSW KEY                          79769400
         MEXIT                                                          79769500
.KREG    ANOP                                                      @D1A 79769600
         AIF   (T'&KEYREG EQ 'O').NKEYAD                           @D1A 79769700
         AIF   (T'&SAVEKEY EQ 'O').KREG11                          @D1A 79769800
         AIF   ('&SAVEKEY(1)' EQ '&KEYREG').ERROR19                @D1A 79769900
         AIF   ('&SAVEKEY' EQ '(2)').KREG10                        @D1A 79770000
         AIF   (T'&WORKREG EQ 'O').ERROR14                         @D1A 79770100
         AIF   ((&WORKREG LT 0) OR (&WORKREG GT 15)).ERROR12       @P1A 79770200
         AIF   (&WORKREG EQ 2).ERROR18                             @D1A 79770300
         AIF   ('&WORKREG' EQ '&KEYREG').ERROR19                   @D1A 79770400
&NAME    LR    &WORKREG,2          SAVE REGISTER 2                 @D1A 79770500
         IPK   0(0)                SAVE CURRENT PSW KEY            @D1A 79770600
         STC   2,&SAVEKEY                                          @D1A 79770700
         LR    2,&WORKREG          RESTORE REGISTER 2              @D1A 79770800
         SPKA  0(&KEYREG)          SET PSW KEY                     @D1A 79770900
         MEXIT                                                     @D1A 79771000
.KREG10  ANOP                                                      @D1A 79771100
&NAME    IPK   0(0)                GET CURRENT PSW KEY             @D1A 79771200
         SPKA  0(&KEYREG)          SET PSW KEY                     @D1A 79771300
         MEXIT                                                     @D1A 79771400
.KREG11  ANOP                                                      @D1A 79771500
&NAME    SPKA  0(&KEYREG)          SET PSW KEY                     @D1A 79771600
         MEXIT                                                     @D1A 79771700
.NKEYAD  ANOP                                                           79771800
         AIF   (T'&SAVEKEY EQ 'O').ERROR13   WORKREG ONLY OPERAND       79771900
         AIF   ('&SAVEKEY' EQ '(2)').NKEYAD4                            79772000
         AIF   (T'&WORKREG EQ 'O').ERROR14   TEST FOR WORKREG OPERAND   79772100
         AIF   ((&WORKREG LT 0) OR (&WORKREG GT 15)).ERROR12 VALID CHK  79772200
         AIF   (&WORKREG EQ 2).NKEYAD2  TEST IF REG 2 TO BE SAVED       79772300
&NAME    LR    &WORKREG,2          SAVE REGISTER 2                      79772400
         IPK   0(0)                SAVE CURRENT PSW KEY                 79772500
         AGO   .NKEYAD3                                                 79772600
.NKEYAD2 ANOP                                                           79772700
&NAME    IPK   0(0)               SAVE CURRENT PSW KEY                  79772800
.NKEYAD3 ANOP                                                           79775000
         STC   2,&SAVEKEY                                               79779000
         AIF   (&WORKREG EQ 2).EXIT                                     79779700
         LR    2,&WORKREG          RESTORE REGISTER 2                   79780400
         MEXIT                                                          79781100
.NKEYAD4 ANOP                                                           79781800
&NAME    IPK   0(0)                SAVE CURRENT PSW KEY                 79782500
         MEXIT                                                          79783200
.EXIT    ANOP                                                           79783900
         MEXIT                                                          79784600
         MEXIT                                                          79786000
.ERROR1  ANOP                                                           79800000
         MNOTE 12,'REG FUNCTION NO LONGER SUPPORTED'             YM4244 80500000
         MEXIT                                                          81200000
.ERROR2  ANOP                                                           81900000
         MNOTE 12,'INVALID KEY OPERAND SPECIFIED'                       82600000
         MEXIT                                                          83300000
.ERROR3  ANOP                                                           84000000
         MNOTE 12,'INVALID MODE OPERAND SPECIFIED'                      84700000
         MEXIT                                                          85400000
.ERROR5  ANOP                                                           88200000
         MNOTE 12,'SYSMASK FUNCTION NO LONGER SUPPORTED'         YM4244 88900000
         MEXIT                                                          89600000
.ERROR6  ANOP                                                           90300000
         MNOTE 12,'INVALID MF OPERAND'                                  91000000
         MEXIT                                                          91700000
.ERROR7  ANOP                                                           92400000
         MNOTE 12,'INVALID REGISTER SPECIFICATION'                      93100000
         MEXIT                                                          93800000
.ERROR8  ANOP                                                           94500000
         MNOTE 12,'MF=E SPECIFIED WITH OTHER OPERANDS'                  95200000
         AGO   .CK6                                                     95900000
.ERROR9  ANOP                                                           96600000
         MNOTE 12,'NO OPERANDS SPECIFIED'                               97300000
         MEXIT                                                          97400000
.ERROR10 ANOP                                                           97500000
         MNOTE 12,'ENABLE FUNCTION HAS BEEN REPLACED BY SETLOCK MACRO'  97600000
         MEXIT                                                          97700000
.ERROR11 ANOP                                                           97800000
         MNOTE 12,'PSW KEY OPERANDS SPECIFIED WITH OTHER OPERANDS'      97900000
         MEXIT                                                          97904000
.ERROR12 ANOP                                                           97908000
         MNOTE 12,'INVALID WORKREG PARAMETER'                           97912000
         MEXIT                                                          97916000
.ERROR13 ANOP                                                           97920000
         MNOTE 12,'WORKREG SPECIFIED ALONE'                             97924000
         MEXIT                                                          97928000
.ERROR14 ANOP                                                           97932000
         MNOTE 12,'WORKREG OPERAND MISSING'                             97936000
         MEXIT                                                          97940000
.ERROR15 ANOP                                                           97944000
         MNOTE 12,'EXTKEY, KEYADDR, AND KEYREG MUST BE MUTUALLY EXCLUSI*97946600
               VE'                                                      97949200
         MEXIT                                                          97952000
.ERROR16 ANOP                                                           97956000
         MNOTE 12,'INVALID EXTKEY OPERAND'                              97960000
         MEXIT                                                          97964000
.ERROR18 ANOP                                                           97980000
         MNOTE  12,'REGISTER 2 USAGE CONFLICT'                          97984000
         MEXIT                                                     @D1A 97988000
.ERROR19 ANOP                                                      @D1A 97992000
         MNOTE 12,'CONFLICT BETWEEN KEYREG AND WORKREG OR SAVEKEY' @D1A 97996000
         MEND                                                           98000000
* */                                                                    98050000
* MODESET:                                                              98100000
*/********************************************************************/ 98150000
*/* PL/S VERSION OF MODESET MACRO. WHEN ISSUED CAUSES A SUPERVISOR   */ 98200000
*/* ROUTINE TO ALTER THE SVC OLD PSW SO THAT THE DESIRED PSW WILL BE */ 98250000
*/* LOADED WHEN MODESET RETURNS TO THE USER. SOME FORMS, INSTEAD,    */ 98283300
*/* GENERATE INLINE CODE.                                            */ 98316600
*/********************************************************************/ 98350000
*  MACRO                                                                98400000
*    KEYS(KEY,                     /* KEY(NZERO OR ZERO)             */ 98450000
*         MODE,                    /* MODE(PROB OR SUP)              */ 98500000
*         SYSMASK,                 /* SYSMASK(RELOC,YES OR NO)       */ 98550000
*                                  /*  SYSMASK(IO,YES OR NO)         */ 98600000
*                                  /* SYSMASK(EXT,YES OR NO)         */ 98650000
*         MF,                      /* MF(L OR E,LIST NAME)           */ 98700000
*         REG,                     /* REG(VBL NAME)                  */ 98750000
*         RELATED,                 /* INFORMATIONAL PARAMETER    @D1A*/ 98775000
*         RTCD,                    /* RTCD(VBL NAME)-SVC RETURN CODE */ 98800000
*         EXTKEY,                  /* EXTKEY(SCHED OR RSM OR VSM OR  */ 98850000
*                                  /*        OPTIMZER OR SUPR OR     */ 98900000
*                                  /*        DATAMGT OR TCAM OR ATCAM*/ 98950000
*                                  /*     OR HASP OR TCB OR RBT1 OR     99000000
*                                            RBT234                  */ 99050000
*         KEYADDR,                 /* KEY CONTAINED IN A 1 BYTE LOC.    99100000
*                                     WITHIN ROUTINES WORK STORAGE   */ 99150000
*         KEYREG,                  /* KEY CONTAINED IN REGISTER  @D1A*/ 99175000
*         WORKREG,                 /* REGISTER INTO WHICH CONTENTS OF   99200000
*                                     REGISTER 2 ARE SAVED           */ 99250000
*         SAVEKEY);                /* SAVEKEY(VBL NAME)              */ 99300000
*        ANS('?'||MACLABEL||'MODESETP '||MACLIST||MACKEYS||';');        99350000
*%END;                                                                  99400000
