         MACRO                                                          00050000
&NAME    MRKBFR &RPL=,&MARK=                                            00100000
.*                                                                      00105000
.*  $MAC(MRKBFR):                                                       00110000
.*                                                                      00112000
.*  COPYRIGHT = NONE.                                          @WA04075 00114000
.*                                                             @WA04075 00116000
.*PROPRIETARY V3 STATEMENT                                     @WA04075 00118000
.*LICENSED MATERIALS - PROPERTY OF IBM                         @WA04075 00120000
.*"RESTRICTED MATERIALS OF IBM"                                @WA04075 00122000
.*5695-DF1                                                     @WA04075 00124000
.*(C) COPYRIGHT 1992  IBM CORP.                                @WA04075 00126000
.*END PROPRIETARY V3 STATEMENT                                 @WA04075 00129000
.*                                                                      00132000
.*  STATUS = DFSMS/MVS RELEASE 1.3.0                                    00134000
.*                                                                      00136000
.*  CHANGE ACTIVITY:                                                    00138000
.*                                                                      00140000
.*  PREVENT COPYRIGHT FROM SHOWING WHEN MACRO IS INVOKED       @WA04075 00142000
.*                                                                      00145000
         LCLA  &CODE                    CODE ACCUMULATOR                00150000
         LCLA  &I                       WORK VARIABLE                   00160000
         LCLB  &ERR                     ERROR INDICATOR                 00200000
         AIF   (N'&SYSLIST EQ 0).NOPOS  GO IF NO POSITIONAL OPERANDS    00250000
.POSLOOP ANOP                                                           00260000
&I       SETA  &I+1                     POINT TO NEXT POS OPERAND       00270000
         IDAERMAC 1,&SYSLIST(&I)        ISSUE WARNING MNOTE             00300000
         AIF   (&I LT N'&SYSLIST).POSLOOP  GO IF MORE OPERANDS          00310000
.NOPOS   ANOP                                                           00350000
         AIF   ('&RPL' NE '').ROKY      GO IF RPL SPECIFIED             00400000
         IDAERMAC 2,RPL                 ISSUE ERROR MNOTE               00450000
&ERR     SETB  1                        INDICATE ERROR                  00500000
.ROKY    ANOP                                                           00550000
         AIF   ('&MARK' NE '').MOKY     GO IF MARK SPECIFIED            00600000
         IDAERMAC 2,MARK                ISSUE ERROR MNOTE               00650000
&ERR     SETB  1                        INDICATE ERROR                  00700000
         AGO   .MARKB                   GO AROUND MARK ANALYSIS         00750000
.MOKY    ANOP                                                           00800000
         AIF   ('&MARK' NE 'OUT').MOUTB  GO IF NOT MARKING FOR OUTPUT   00850000
&CODE    SETA  0*256                    INDICATE MARK FOR OUTPUT        00900000
         AGO   .MARKB                   GO AROUND MARK ANALYSIS         00950000
.MOUTB   ANOP                                                           01000000
         AIF   ('&MARK' NE 'RLS').MDATC GO IF NOT MARKING FOR RELEASE   01050000
&CODE    SETA  4*256                    INDICATE MARK FOR RELEASE       01100000
         AGO   .MARKB                   GO AROUND MARK ANALYSIS         01150000
.MDATC   ANOP                                                           01155500
         AIF   ('&MARK' NE 'DINVALID').MINDC   NEXT IF NOT DINVALID     01161000
&CODE    SETA  8*256                    INDICATE MARK FOR DINVALID      01166500
         AGO   .MARKB                   GO AROUND MARK ANALYSIS         01172000
.MINDC   ANOP                                                           01177500
         AIF   ('&MARK' NE 'XINVALID').MRLSB   ERROR IF NOT XINVALID    01183000
&CODE    SETA  12*256                   INDICATE MARK FOR XINVALID      01188500
         AGO   .MARKB                   GO AROUND MARK ANALYSIS         01194000
.MRLSB   ANOP                                                           01200000
         IDAERMAC 3,MARK,&MARK          ISSUE ERROR MNOTE               01250000
&ERR     SETB  1                        INDICATE ERROR                  01300000
.MARKB   ANOP                                                           01350000
         AIF   (&ERR).END               GO IF ANY ERRORS                01400000
         AIF   ('&NAME' EQ '').NAMEB    GO IF NO NAME                   01410000
&NAME    DS    0H                                                       01450000
.NAMEB   ANOP                                                           01460000
         AIF   ('&RPL'(1,1) EQ '(').RPLR  GO IF RPL SPECIFIED AS REG    01500000
         LA    1,&RPL                   LOAD RPL ADDRESS                01550000
         AGO   .AREG                    GO AROUND REG CODE              01600000
.RPLR    ANOP                                                           01650000
         AIF   ('&RPL' EQ '(1)').AREG   GO IF RPL ADDRESS ALREADY IN 1  01700000
         LR    1,&RPL(1)                LOAD RPL ADDRESS                01750000
.AREG    ANOP                                                           01800000
&CODE    SETA  &CODE+14                 INDICATE MARK BUFFER            01850000
         LA    0,&CODE                  LOAD CODES                      01900000
         L     15,24(,1)                LOAD ACB ADDRESS FROM RPL       01950000
         L     15,8(,15)                LOAD VSAM INTERFACE RTN ADDR    02000000
         BALR  14,15                    LINK TO INTERFACE ROUTINE       02050000
.END     ANOP                                                           02100000
         MEND                                                           02150000
