*********************************************************************** 00004100
*PROPRIETARY V3 STATEMENT                                             * 00009200
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00014300
*"RESTRICTED MATERIALS OF IBM"                                        * 00019400
*5695-DF1                                                             * 00024500
*(C) COPYRIGHT 1992  IBM CORP.                                        * 00029600
*END PROPRIETARY V3 STATEMENT                                         * 00037300
*********************************************************************** 00045100
         MACRO                                                          00050000
         PDABD                                                          00100000
IHAPDAB  DSECT                                                          00150000
PDANODCB DS    H                        NO. OF DCB ADDRESSES IN LIST    00200000
PDAMAXCB DS    H                        MAXIMUM NO. ADDRESSES ALLOWABLE 00250000
PDAGRTNA DS    A                        ADDR OF PARALLEL GET ROUTINE    00300000
PDADCBAI DS    F                        DCB ADDRESS INCREMENT           00350000
PDADCBLA DS    A                        ADDR OF LAST DCB ENTRY          00400000
PDADCBEP DS    A                        ADDR OF DCB ENTRY LAST PROC     00450000
PDAECBIX DS    F                        INDEX TO ECB LIST               00500000
PDADCBAL EQU   *                        START OF DCB LIST               00550000
         MEND                                                           00600000
