*********************************************************************** 00004100
*PROPRIETARY V3 STATEMENT                                             * 00009200
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00014300
*"RESTRICTED MATERIALS OF IBM"                                        * 00019400
*5695-DF1                                                             * 00024500
*(C) COPYRIGHT 1992  IBM CORP.                                        * 00029600
*END PROPRIETARY V3 STATEMENT                                         * 00037300
*********************************************************************** 00045100
         MACRO                                                          00050000
&NAME    PDAB  &MAXDCB=                                                 00100000
         AIF   ('&MAXDCB' EQ '').E1                                     00150000
         AIF   (T'&MAXDCB NE 'N').PDAB01                                00200000
         AIF   (&MAXDCB LT 0 OR &MAXDCB GT 32767).E2                    00250000
.PDAB01  ANOP                                                           00300000
&NAME    DS    0F                                                       00350000
         DC    AL2(0)                                                   00400000
         DC    AL2(&MAXDCB)                                             00450000
         DC    5F'0'                                                    00500000
         DS    (8*&MAXDCB)F                                             00550000
         MEXIT                                                          00600000
.E1      IHBERMAC 1006,MAXDCB 12,IHB001  MAXDCB OPERAND REQUIRED        00650000
         MEXIT                                                          00700000
.E2      IHBERMAC 1001,MAXDCB,&MAXDCB 12,IHB002  INVALID OPERAND        00750000
         MEND                                                           00800000
