*%/*                                                                    00050000
         MACRO                                                          00850000
&LABEL   POST  &ECB,               ECB address                         *00851200
               &CODE,              Completion code                     *00852400
               &ASCB=,             ASCB address                        *00853600
               &ECBKEY=,           Storage protection key              *00854800
               &ERRET=,            Address of error routine            *00856000
               &MF=I,              I | E | L                           *00857200
               &BRANCH=,           NO | YES                            *00858400
               &MEMREL=,           YES | NO                            *00859600
               &LINKAGE=,          SVC | SYSTEM | BRANCH               *00860800
               &RELATED=           Any value                       @L1C 00862000
         AGO   .SKIP                                                 */ 00863200
*/****  START OF SPECIFICATIONS  *************************************/ 00864400
*/*                                                                  */ 00865600
*/*01*  MACRO NAME = POST                                            */ 00866800
*/*                                                                  */ 00868000
*/*01*  DESCRIPTIVE NAME = POST Macro                                */ 00869200
*/*                                                                  */ 00870400
*/*01*  COPYRIGHT=                                                   */ 00871600
*/*         5647-A01                                                 */ 00872800
*/*         THIS MACRO IS "RESTRICTED MATERIALS OF IBM"              */ 00874000
*/*         (C) COPYRIGHT IBM CORP. 1981, 2000                       */ 00875200
*/*         LICENSED MATERIALS - PROPERTY OF IBM                     */ 00876400
*/*                                                                  */ 00880000
*/*01*  STATUS =  HBB7703                                            */ 00880700
*/*                                                                  */ 00881500
*/*01*  EXTERNAL CLASSIFICATION: PI                                  */ 00881800
*/*01*  END OF EXTERNAL CLASSIFICATION:                              */ 00882100
*/*                                                                  */ 00882400
*/*01*  FUNCTION =                                                   */ 00883600
*/*       Provides an interface to the POST service routine          */ 00884800
*/*       (IEAVEPST).                                                */ 00886000
*/*                                                                  */ 00887200
*/*02*    OPERATION =                                                */ 00888400
*/*         The POST macro parses the keywords and invokes           */ 00889600
*/*         IEAVEPST via an SVC, a stacking PC or Branch entry.      */ 00890800
*/*         Reg 0, 1, 14 and 15 are set accordingly.                 */ 00892000
*/*         The POST service routine (IEAVEPST) is invoked using     */ 00893200
*/*         SVC(2), register 14 for the PC or BALR.                  */ 00894400
*/*                                                                  */ 00895600
*/*                                                                  */ 00896800
*/*01*  INPUT =  (BAL)                                               */ 00898000
*/*                                                                  */ 00899200
*/*       ,ECB              ECB address.                             */ 00900400
*/*                                                                  */ 00901600
*/*          ,CODE          Completion code.  Default: 0             */ 00902800
*/*                                                                  */ 00904000
*/*          ,ASCB=         ASCB address                             */ 00905200
*/*                                                                  */ 00906400
*/*          ,BRANCH=       NO | YES  Default: NO                    */ 00907600
*/*                         Indicates branch entry or SVC linkage.   */ 00908800
*/*                         This function has been replaced by       */ 00910000
*/*                         LINKAGE keyword.                         */ 00911200
*/*                                                                  */ 00912400
*/*          ,ERRET=        Error routine address                    */ 00913600
*/*                                                                  */ 00914800
*/*          ,ECBKEY=       Storage protection key of the ECB to be  */ 00916000
*/*                         POSTED.                                  */ 00917200
*/*                                                                  */ 00918400
*/*          ,LINKAGE=      SVC | SYSTEM | BRANCH  Default: SVC      */ 00919600
*/*                         SVC - specifies SVC linkage to the       */ 00920800
*/*                         service routine. Valid only in           */ 00922000
*/*                         primary (P=H=S) mode.                    */ 00923200
*/*                         SYSTEM - specifies PC linkage to the     */ 00924400
*/*                         service routine. Valid in both primary   */ 00925600
*/*                         (P=H) mode and primary (P^H) mode.       */ 00926800
*/*                         BRANCH - specifies branch entry linkage  */ 00928000
*/*                         to the service routine.                  */ 00929200
*/*                                                                  */ 00930400
*/*          ,MF=           I | E | L   Default: I                   */ 00931600
*/*                         I - In-line POST                         */ 00932800
*/*                         E - Execute form                         */ 00934000
*/*                         L - List form                            */ 00935200
*/*                                                                  */ 00936400
*/*          ,MEMREL=       YES | NO       Default: YES              */ 00937600
*/*                         Memory related.                          */ 00938800
*/*                         Can only be coded with LINKAGE=BRANCH    */ 00940000
*/*                                                                  */ 00941200
*/*          ,RELATED=      Any value                                */ 00942400
*/*                                                                  */ 00943600
*/*                                                                  */ 00944800
*/*01*  INPUT =  (PLAS)                                              */ 00946000
*/*                         See POSTP for PLAS input description.    */ 00947200
*/*                                                                  */ 00948400
*/*                                                                  */ 00949600
*/*02*    NOTES =                                                    */ 00950800
*/*         -  The BRANCH= parameter is provided for compatibility   */ 00952000
*/*            only. The LINKAGE= parameter should be used instead.  */ 00953200
*/*         -  The ERRET= parameter can only be coded without the    */ 00953600
*/*            ASCB= parameter if LINKAGE=SYSTEM.                    */ 00954000
*/*                                                                  */ 00954400
*/*                                                                  */ 00955600
*/*01*  NOTES =                                                      */ 00956800
*/*                                                                  */ 00958000
*/*02*    RESTRICTIONS = None                                        */ 00959200
*/*                                                                  */ 00960400
*/*02*    DEPENDENCIES = None                                        */ 00961600
*/*                                                                  */ 00962800
*/*03*      CHARACTER-CODE DEPENDENCIES= EBCDIC                      */ 00964000
*/*                                                                  */ 00965200
*/*01*  MODULE TYPE = BIL MACRO                                      */ 00966400
*/*                                                                  */ 00967600
*/*02*    PROCESSOR = ASSEMBLER-H  or  PLAS                          */ 00968800
*/*                                                                  */ 00970000
*/*02*    INVOCATION = See MACRO definition                          */ 00971200
*/*                                                                  */ 00972400
*/*01*  COMPONENT  =  SC1CL (TASK MANAGEMENT)                        */ 00973600
*/*                                                                  */ 00974800
*/*01*  DISTRIBUTION LIBRARY = AMACLIB                               */ 00976000
*/*                                                                  */ 00977200
*/**** END OF SPECIFICATIONS *****************************************/ 00978400
*/*                                                                     00979600
*                                                                       00980800
*    CHANGE ACTIVITY =                                                  00982000
*    $D1=28      JBB1326  800922  PDXL:    BRANCH Parameter             00983200
*    $D2=28      JBB1326  800922  PDXB:    MEMREL Parameter             00984400
*    $L1=AR      HBB3310  860825  PD16LD:  Access Registers             00985600
*    $D3=DCR0182 HBB3310  861229  PD16Q9:  Allow ERRET with             00986000
*                                          LINKAGE=SYSTEM               00986400
*    $L2=POSIX   HBB4430  920110  PD16FH:  Allow ECBKEY with            00986600
*                                          LINKAGE=BRANCH               00986800
*    OY32157  - Load completion code from Register 0 into      @YA32157 00987000
*               Register 10 on branch entry.         90183     @YA32157 00987200
*    $L3=64BITSUP HBB7703 981204 PD00XB: ESAME                          00987300
*                                                                       00987400
*********************************************************************** 00988000
.*                                                                      01000000
.SKIP    ANOP ,                                                    @L1A 01033300
*        MACDATE  07/02/90                                     @YA32157 01066600
.*                                                                      01100000
.********************************************************************** 01105500
.*                                                                    * 01111000
.*       Declare GLOBAL and LOCAL variables                           * 01116500
.*                                                                    * 01122000
.********************************************************************** 01127500
.*                                                                      01133000
         LCLA   &OSFT         Offset into System Function Table    @L1A 01138500
         LCLC   &LINKVAL      Value of LINKVAL or BRANCH           @L1A 01144000
         LCLA   &A                                               YM1995 01150000
         LCLC   &LIST,&MASK,&NX,&LISTA,&SHIFT,&B1                  @D1A 01200000
         GBLC   &SYSAM64                                           @PxA 01200900
         SYSSTATE TEST                                             @L3A 01201800
.*                                                                      01202900
.********************************************************************** 01205800
.*                                                                    * 01208700
.*       Constants                                                    * 01211600
.*                                                                    * 01214500
.********************************************************************** 01217400
.*                                                                      01220300
&OSFT    SETA   172           Offset into SFT for POST             @L1A 01223200
.*                                                                      01226100
.********************************************************************** 01229000
.*                                                                    * 01231900
.*       Initialization                                               * 01234800
.*                                                                    * 01237700
.********************************************************************** 01240600
         ACTR  10000          Set for infinite loop control        @L1A 01243500
.*                            Reset Global Variables               @L1A 01246400
&LIST    SETC   'PST'.'&SYSNDX'                                         01250000
&MASK    SETC   'POST'.'&SYSNDX'                                        01300000
&SHIFT   SETC   '16*'                                          @ZA15373 01350000
.*                                                                    * 01355700
.********************************************************************** 01361400
.*  EVALUATE BRANCH AND LINKAGE PARAMETERS                            * 01367100
.*  BRANCH parameter should not be used                            @L1A 01372800
.********************************************************************** 01378500
.*                                                                      01384200
         AIF   ('&BRANCH&LINKAGE' EQ '').LNKSVC    Both null       @L1A 01389900
         AIF   (T'&BRANCH NE 'O' AND T'&LINKAGE NE 'O').ERR14      @L1A 01395600
         AIF   ('&BRANCH' EQ 'NO' OR '&LINKAGE' EQ 'SVC').LNKSVC   @L1A 01401300
         AIF   ('&BRANCH' EQ 'YES').LNKBRAN        Issue MNOTE     @L1A 01407000
         AIF   ('&LINKAGE' EQ 'BRANCH').LNKBR      BRANCH linkage  @L1A 01412700
         AIF   ('&LINKAGE' EQ 'SYSTEM').LNKSYS     PC linkage      @L1A 01418400
         AIF   ('&BRANCH' NE '').ERR12             Invalid BRANCH  @L1A 01424100
         AGO   .ERR15                              Invalid LINKAGE @L1A 01429800
.LNKBRAN ANOP  ,                                                   @L1A 01435500
         MNOTE 0,' LINKAGE=BRANCH SHOULD BE USED INSTEAD OF BRANCH=YES' 01441200
.LNKBR   ANOP  ,                                                   @L1A 01446900
&LINKVAL SETC  'BRANCH'             Indicate branch entry linkage  @L1A 01452600
         AGO   .LNKEND                                             @L1A 01458300
.LNKSVC  ANOP                                                      @L1A 01464000
&LINKVAL SETC  'SVC'                Indicate SVC linkage (Default) @L1A 01469700
         AGO   .LNKEND                                             @L1A 01475400
.LNKSYS  ANOP  ,                                                   @L1A 01481100
&LINKVAL SETC  'SYSTEM'             Indicate SYSTEM linkage        @L1A 01486800
.LNKEND  ANOP  ,                                                   @L1A 01492500
.*                                                                    * 01498200
         AIF   ('&LINKAGE' EQ 'SYSTEM' AND '&ASCB' NE '' AND           x01503900
               '&ECBKEY' EQ '').ERR16                              @L1A 01509600
.*                                                                    * 01515300
.********************************************************************** 01521000
.*  SET BRANCH ENTRY DIGIT                                         @D1A 01526700
.********************************************************************** 01532400
.*  (USED TO CHANGE '0' TO '10' AND '1' TO '11' FOR BRANCH ENTRY        01538100
         AIF    ('&LINKVAL' NE 'BRANCH').LTST                      @L1C 01543800
&B1      SETC   '1'                                                @D1A 01550000
.LTST    ANOP                                                      @D1A 01600000
.*                                                                      01650000
.*  LIST FORMAT DOES NOT ALLOW THE CODE PARAMETER                       01700000
         AIF    ('&MF' EQ 'L').LIST1                                    01750000
.*                                                                      01800000
.*  SORT OUT POSSIBLE COMPLETION CODE FORMATS                           01850000
.*                                                                      01900000
         AIF    ('&CODE' EQ '' OR '&CODE' EQ '0').C1                    01950000
         AIF    ('&CODE'(1,1) EQ '(').C2                                02000000
         AIF    (T'&CODE NE 'N').C3                                     02050000
         AIF    (&CODE GT 4095).C4                                      02100000
.*                                                                      02150000
.*  ESTABLISH THE POST LABEL AND SET COMPLETION CODE IN REG 0 OR 10     02200000
.*                                                                      02250000
.* CODE IS NUMERIC, LESS THAN 4096                                      02300000
&LABEL   LA    &B1.0,&CODE.(0,0)      . SET POST CODE              @D1A 02350000
         AGO   .TYPE                                                    02400000
.*                                                                      02450000
.* CODE IS BLANK OR ZERO, SET ZERO COMPLETION CODE                      02500000
.C1      ANOP                                                           02550000
&LABEL   SR    &B1.0,&B1.0            . SET POST CODE              @D1A 02600000
         AGO   .TYPE                                                    02650000
.*                                                                      02700000
.* CODE IS IN A REGISTER                                                02750000
.C2      AIF   (N'&CODE GT 1).ERR3                                      02800000
         AIF   ('&LINKVAL' NE 'BRANCH' AND '&CODE(1)' EQ '0').C2A       02833300
.*                                                             @YA32157 02866600
&LABEL   LR    &B1.0,&CODE(1)         . SET POST CODE              @D1A 02900000
         AGO   .TYPE                                                    02950000
.C2A     AIF   ('&LABEL' EQ '').TYPE                                    03000000
&LABEL   DS    0H                                                       03050000
         AGO   .TYPE                                                    03100000
.* CODE IS NON-NUMERIC, E.G., A LABEL                                   03150000
.C3      ANOP                                                           03200000
&LABEL   LA    &B1.0,&CODE            . SET POST CODE              @D1A 03250000
         AGO   .TYPE                                                    03300000
.* CODE IS A NUMBER GREATER THAN 4095                                   03350000
.C4      CNOP  0,4                                                      03400000
&LABEL   B     *+8                    . BRANCH AROUND CONSTANT          03450000
         DC    A(&CODE)               . FULLWORD CODE VALUE             03500000
         L     &B1.0,*-4              . LOAD POST CODE             @D1A 03550000
.*                                                                      03600000
.*  DETERMINE MACRO FORM.                                               03650000
.*                                                                      03700000
.TYPE    AIF   ('&MEMREL' NE 'NO' AND '&MEMREL' NE 'YES'               *03750000
               AND '&MEMREL' NE '').ERR13                          @D2A 03850000
         AIF   ('&MF' NE 'I' OR '&ASCB' NE '').XMPOST                   03900000
         AIF   ('&ERRET' NE '' AND '&LINKAGE' NE 'SYSTEM').ERR7    @D3C 03950000
         AIF   ('&ECBKEY' NE '' AND '&LINKVAL' NE 'BRANCH').ERR8   @L1C 04000000
         AIF   ('&MEMREL' NE '').ERR8B                             @D2A 04050000
.*                                                                      04100000
.*  OLD FORM IN-LINE POST                                               04150000
.*    R0 IS ALREADY SET WITH THE COMPLETION CODE                        04200000
.*    R1 NEEDS THE ECB ADDRESS                                          04250000
         AIF   ('&ECB' EQ '').ERR2    . ECB MUST BE CODED               04300000
         AIF   ('&ECB'(1,1) NE '(').S1 . LABEL                          04350000
         LA    &B1.1,0(0,&ECB(1))     . LOAD ECB, CLEAR HI BYTE    @D1A 04400000
         AGO   .SVC                                                     04450000
.S1      LA    &B1.1,&ECB             . LOAD ECB ADDRESS           @D1A 04500000
         AGO   .SVC                                                     04550000
.********************************************************************** 04575000
.*                                                                      04600000
.*  XMPOST                                                              04650000
.*                                                                      04700000
.* FOR SVC ENTRY:                                                  @D1A 04750000
.*    R0  CONTAINS THE COMPLETION CODE AND ECBKEY BIT IF OPTION REQ     04800000
.*    R1  CONTAINS THE ADDRESS OF A LIST IN THE FORMAT:                 04850000
.*          WORD 1  ECB ADDRESS                                         04900000
.*          WORD 2  ASCB ADDRESS                                        04950000
.*          WORD 3  ERRET ADDRESS                                       05000000
.*          WORD 4  ECBKEY IN BYTE 0 IF OPTION REQUESTED       @ZA15373 05050000
.*         WITH THE HIGH ORDER BIT IN R1 ON TO INDICATE THE             05100000
.*         REQUEST TYPE                                                 05150000
.*                                                                      05200000
.* FOR BRANCH ENTRY:                                                    05250000
.*    R0  CONTAINS THE ECBKEY IF SPECIFIED                              05300000
.*    R10 CONTAINS THE COMPLETION CODE (HIGH BIT ON FOR ECBKEY)         05350000
.*    R11 CONTAINS THE ECB ADDRESS  (HIGH BIT ON FOR CROSS-ADDR)        05400000
.*    R12 CONTAINS THE ERRET SPECIFICATION                              05450000
.*    R13 CONTAINS THE ASCB ADDRESS                                     05500000
.*                                                                      05550000
.*                                                                      05600000
.XMPOST  AIF   (T'&ECB EQ 'O').XM1       SKIP SUBSTRING TEST            05650000
         AIF   ('&ECB'(1,1) EQ '(' AND N'&ECB GT 1).ERR3                05700000
.XM1     AIF   (T'&ASCB EQ 'O').XM2       SKIP SUBSTRING TEST           05750000
         AIF   ('&ASCB'(1,1) EQ '(' AND N'&ASCB GT 1).ERR3              05800000
.XM2     AIF   (T'&ERRET EQ 'O').XM3                                    05850000
         AIF   ('&ERRET'(1,1) EQ '(' AND N'&ERRET GT 1).ERR3            05900000
.XM3     AIF   (T'&ECBKEY EQ 'O').XM4                          @ZA15373 05950000
         AIF   ('&ECBKEY'(1,1) EQ '(' AND N'&ECBKEY GT 1).ERR3 @ZA15373 06000000
.XM4     AIF   ('&MF' NE 'I').EXECUTE                          @ZA15373 06050000
.********************************************************************** 06075000
.*                                                                      06100000
.*  INTERREGIONAL IN-LINE POST                                          06150000
.*                                                                      06200000
.*   SET REGISTER INDICATED VALUES IN THE PARAMETER LIST                06250000
         AIF   ('&ECB' EQ '').ERR2      ECB PARAMETER MUST BE CODED     06300000
         AIF   (T'&ASCB EQ 'O' AND T'&ERRET NE 'O').ERR7                06350000
         AIF   (T'&ERRET EQ 'O' AND T'&ASCB NE 'O').ERR1                06400000
         AIF   ('&LINKVAL' EQ 'BRANCH').BRAN                       @L1C 06450000
         AIF   ('&MEMREL' NE '').ERR8B                             @D2A 06500000
&A       SETA  12                       BASE LIST LENGTH       @ZA15373 06550000
         AIF   ('&ECB'(1,1) NE '(').R1                                  06600000
.*  SET ECB ADDRESS IN LIST                                    @ZA15373 06650000
         ST    &ECB(1),&LIST          . SET THE ECB ADDRESS             06700000
         AGO   .R1A                                                     06750000
.R1      LA    1,&ECB                 . ADDRESS THE ECB                 06800000
         ST    1,&LIST                . STORE IN PARM LIST              06850000
.*  SET ASCB ADDRESS IN LIST+4                                 @ZA15373 06900000
.R1A     AIF   (T'&ASCB EQ 'O').R3A                                     06950000
         AIF   ('&ASCB'(1,1) NE '(').R2                                 07000000
         ST    &ASCB(1),&LIST+4       . SET THE ASCB ADDRESS            07050000
         AGO   .R2A                                                     07100000
.R2      LA    1,&ASCB                . ADDRESS THE ASCB WORD           07150000
         ST    1,&LIST+4              . STORE IN PARM LIST              07200000
.*  SET ERRET ADDRESS IN LIST+8                                @ZA15373 07250000
.R2A     AIF   ('&ERRET'(1,1) NE '(').R3                                07300000
         ST    &ERRET(1),&LIST+8        . SET THE ERRET ADDRESS         07350000
         AGO   .R3A                                                     07400000
.R3      LA    1,&ERRET                 .                               07450000
         ST    1,&LIST+8              . STORE IN PARM LIST              07500000
.*  SET ECBKEY IN LIST+12                                      @ZA15373 07550000
.R3A     AIF   (T'&ECBKEY EQ 'O').R5                           @ZA15373 07600000
&A       SETA  &A+4                   ADD 4 BYTES FOR ECBKEY   @ZA15373 07650000
         AIF   ('&ECBKEY'(1,1) EQ '(').R4                      @ZA15373 07700000
         AIF   ('&ECBKEY' EQ 'YES').ERR9                       @ZA15373 07750000
         AIF   (T'&ECBKEY NE 'N').R3B                          @ZA15373 07800000
         AIF   (&ECBKEY GT 15).ERR9                            @ZA15373 07850000
.R3B     ANOP                                                  @ZA15373 07900000
         MVI   &LIST+12,&SHIFT&ECBKEY . SAVE ECBKEY IN LIST    @ZA15373 07950000
         AGO   .R4A                                            @ZA15373 08000000
.R4      STC   &ECBKEY(1),&LIST+12    . SAVE ECBKEY IN LIST    @ZA15373 08050000
.R4A     ANOP                                                  @ZA15373 08100000
         LA    1,X'800'(0,0)                                   @ZA15373 08150000
         SLL   1,20(0)                                         @ZA15373 08200000
         OR    0,1                    . SET ECBKEY BIT         @ZA15373 08250000
.*                                                                      08300000
.* ADDRESS AND DEFINE THE PARAMETER LIST                                08350000
.R5      CNOP  0,4                                                      08400000
         BAL   1,*+&A+4               . ADDRESS PARM LIST AND BYPASS IT 08450000
*                                     . AND TURN ON HIGH BIT       @D2A 08500000
&LIST    DC    A(0)                   . 1ST WORD - ECB ADDRESS          08550000
         DC    A(0)                   . 2ND WORD - ASCB ADDRESS         08600000
         DC    A(0)                   . 3RD WORD - ERRET ADDRESS        08650000
         AIF   (T'&ECBKEY EQ 'O').SVC                          @ZA15373 08700000
         DC    A(0)                   . 4TH WORD - BYTE0,ECBKEY@ZA15373 08750000
         AGO   .SVC                                                     08800000
.********************************************************************** 08825000
.*                                                                      08850000
.*  BRANCH ENTRY FORM                                                   08900000
.*                                                                      08950000
.BRAN    ANOP                                                      @D1A 09000000
.*                                                                 @D1A 09050000
.*                                                                 @D1A 09100000
.*  ECB ADDRESS IN R11                                             @D1A 09150000
.B2      ANOP                                                      @D1A 09200000
         AIF   ('&ECB'(1,1) NE '(').B2A                            @D1A 09250000
         AIF   ('&ECB(1)' EQ '11').B2B                             @D1A 09300000
         LR    11,&ECB(1)             . ECB ADDRESS                @D1A 09350000
         AGO   .B2B                                                @D1A 09400000
.B2A     LA    11,&ECB                . ECB ADDRESS                @D1A 09450000
.B2B     LA    15,X'800'(0,0)                                      @D1A 09500000
         SLL   15,20(0)                                            @D1A 09550000
         OR    11,15                  . SET CROSS ADDR BIT         @D1A 09600000
.*                                                                 @D1A 09650000
.*  ASCB ADDR IN R13                                               @D1A 09700000
.B3      AIF   (T'&ASCB EQ 'O').B5                                 @D1A 09750000
         AIF   ('&ASCB'(1,1) NE '(').B3A                           @D1A 09800000
         LR    13,&ASCB(1)            . ASCB ADDRESS               @D1A 09850000
         AGO   .B4                                                 @D1A 09900000
.B3A     LA    13,&ASCB               . ASCB ADDRESS               @D1A 09950000
.*                                                                 @D1A 10000000
.*  ERRET IN R12                                                   @D1A 10050000
.B4      AIF   ('&ERRET'(1,1) NE '(').B4A                          @D1A 10100000
         LA    12,0(,&ERRET(1))       . ERRET IN R12               @D2A 10150000
         AGO   .B6                                                 @D1A 10200000
.B4A     LA    12,&ERRET              . ERRET IN R12               @D1A 10250000
.B6      AIF   ('&MEMREL' NE 'NO').B5                              @D2A 10300000
         OR    12,15                  . NOT MEMORY RELATED         @D2A 10350000
.*                                                                 @D1A 10400000
.*  ECBKEY IN R0                                                   @D1A 10450000
.B5      AIF   (T'&ECBKEY EQ 'O').SVC                              @D1A 10500000
         AIF   ('&ECBKEY'(1,1) EQ '(').B5B                         @D1A 10550000
         AIF   ('&ECBKEY' EQ 'YES').ERR9                           @D1A 10600000
         AIF   (T'&ECBKEY NE 'N').B5A                              @D1A 10650000
         AIF   (&ECBKEY GT 15).ERR9                                @D1A 10700000
.B5A     LA    0,&SHIFT&ECBKEY        . ECBKEY IN R0               @D1A 10750000
         AGO   .B5C                                                @D1A 10800000
.B5B     LR    0,&ECBKEY(1)           . ECBKEY IN R0               @D1A 10850000
.B5C     OR    10,15                  . SET ECBKEY FLAG BIT        @D1A 10900000
         AGO   .SVC                                                @D1A 10950000
.********************************************************************** 10975000
.*                                                                      11000000
.*  INTERREGIONAL LIST FORM                                             11050000
.*                                                                      11100000
.LIST1   AIF   ('&CODE' NE '').ERR4     CC NOT ALLOWED IN LIST          11150000
         AIF   ('&LINKVAL' EQ 'BRANCH').ERR10                      @L1C 11200000
         AIF   ('&MEMREL' NE '').ERR8B                             @D2A 11250000
.L1A     AIF   (T'&ASCB EQ 'O').L1B                                     11300000
         AIF   ('&ASCB'(1,1) EQ '(').ERR5                               11350000
.L1B     AIF   (T'&ERRET EQ 'O').L1C                                    11400000
         AIF   ('&ERRET'(1,1) EQ '(').ERR5                              11450000
.L1C     AIF   (T'&ECBKEY EQ 'O').L1D                          @ZA15373 11500000
         AIF   ('&ECBKEY'(1,1) EQ '(').ERR5                    @ZA15373 11550000
.L1D     AIF   ('&ECB' EQ '').L2                                        11600000
         AIF   ('&ECB'(1,1) EQ '(').ERR5                                11650000
&LABEL   DC    A(&ECB)                . 1ST WORD - ECB ADDRESS          11700000
         AGO   .L3                                                      11750000
.L2      ANOP                                                           11800000
&LABEL   DC    A(0)                   . 1ST WORD - ECB ADDRESS          11850000
.L3      AIF   ('&ASCB' EQ '').L4                                       11900000
         DC    A(&ASCB)               . 2ND WORD - ASCB ADDRESS         11950000
         AGO   .L5                                                      12000000
.L4      DC    A(0)                   . 2ND WORD - ASCB ADDRESS         12050000
.L5      AIF   ('&ERRET' EQ '').L6                                      12100000
         DC    A(&ERRET)              . 3RD WORD - ERRET ADDRESS        12150000
         AGO   .L7                                                      12200000
.L6      DC    A(0)                   . 3RD WORD - ERRET ADDRESS        12250000
.L7      AIF   ('&ECBKEY' NE '').L7A                           @ZA15373 12300000
         MEXIT                                                 @ZA15373 12350000
.L7A     AIF   ('&ECBKEY'(1,3) NE 'YES').ERR9                  @ZA15373 12400000
         DC    A(0)                   . 4TH WORD - BYTE0,ECBKEY@ZA15373 12450000
         MEXIT                                                          12500000
.********************************************************************** 12525000
.*                                                                      12550000
.*  INTERREGIONAL EXECUTE FORM                                          12600000
.*                                                                      12650000
.EXECUTE AIF   ('&MF'(1,1) NE '(').ERR6                                 12700000
         AIF   ('&MF(1)' NE 'E').ERR6                                   12750000
         AIF   (N'&MF NE 2).ERR6                                        12800000
         AIF   ('&LINKVAL' EQ 'BRANCH').ERR11                      @L1C 12850000
         AIF   ('&MEMREL' NE '').ERR8B                             @D2A 12900000
.*   LIST PARAMETER                                                     12950000
         AIF   ('&MF(2)'(1,1) EQ '(').X1   CHECK LIST IN A REG   YM1995 13000000
&NX      SETC  '+'                             'PLUS' A LABEL           13050000
&LISTA   SETC   '&MF(2)'                                         YM1995 13100000
         AGO   .X2                                               YM1995 13150000
.X1      ANOP                                                    YM1995 13200000
&A       SETA  K'&MF-6                                           YM1995 13250000
&LISTA   SETC  '&MF'(5,&A)                                       YM1995 13300000
&LISTA   SETC  '(&LISTA)'                                      @ZA49183 13350000
.*                                                                      13400000
.*   ECB PARAMETER                                                      13450000
.X2      AIF   ('&ECB' EQ '').X4                                        13500000
         AIF   ('&ECB'(1,1) EQ '(').X3                                  13550000
         LA    15,&ECB               . ADDRESS OF ECB                   13600000
         ST    15,0&NX&LISTA         . STORE ECB ADDRESS         YM1995 13650000
         AGO   .X4                                                      13700000
.X3      ST    &ECB(1),0&NX&LISTA    . STORE ECB ADDRESS         YM1995 13750000
.*                                                                      13800000
.*   ASCB AND ERRET PARAMETERS                                          13850000
.X4      AIF   ('&ASCB' EQ '').X6                                       13900000
         AIF   ('&ASCB'(1,1) EQ '(').X5                                 13950000
         LA    15,&ASCB              . ADDRESS OF ASCB                  14000000
         ST    15,4&NX&LISTA         . STORE ASCB ADDRESS        YM1995 14050000
         AGO   .X6                                                      14100000
.X5      ST    &ASCB(1),4&NX&LISTA   . STORE ASCB ADDRESS        YM1995 14150000
.X6      AIF   ('&ERRET' EQ '').X8                                      14200000
         AIF   ('&ERRET'(1,1) EQ '(').X7                                14250000
         LA    15,&ERRET               . ADDRESS OF ERRET               14300000
         ST    15,8&NX&LISTA         . STORE ERRET ADDRESS       YM1995 14350000
         AGO   .X8                                                      14400000
.X7      ST    &ERRET(1),8&NX&LISTA    . STORE ERRET ADDRESS     YM1995 14450000
.*                                                             @ZA15373 14500000
.*  ECBKEY PARAMETER                                           @ZA15373 14550000
.X8      AIF   ('&ECBKEY' EQ '').X9                            @ZA15373 14600000
         AIF   ('&ECBKEY'(1,1) EQ '(').X8B                     @ZA15373 14650000
         AIF   ('&ECBKEY' EQ 'YES').ERR9                       @ZA15373 14700000
         AIF   (T'&ECBKEY NE 'N').X8A                          @ZA15373 14750000
         AIF   (&ECBKEY GT 15).ERR9                            @ZA15373 14800000
.X8A     ANOP                                                  @ZA15373 14850000
         MVI   12&NX&LISTA,&SHIFT&ECBKEY . STORE ECBKEY        @ZA15373 14900000
         AGO   .X8C                                            @ZA15373 14950000
.X8B     STC   &ECBKEY,12&NX&LISTA    . STORE ECBKEY           @ZA15373 15000000
.X8C     O     0,&MASK                . SET ECBKEY BIT         @ZA15373 15050000
.*                                                                      15100000
.*  ADDRESS LIST AND SET ON HIGH ORDER BIT                              15150000
.X9      AIF   ('&MF(2)'(1,1) EQ '(').X9A                               15200000
         LA    1,&MF(2)               . ADDRESS LIST                    15250000
         AGO   .X10                                                     15300000
.X9A     IHBINNRA &MF(2)              . SET REG 1                       15350000
.X10     CNOP  0,4                                                      15400000
         O     1,&MASK                . SET LIST FORM INDICATOR         15450000
         B     *+8                    . BRANCH AROUND MASK              15500000
&MASK    DC    X'80000000'                                              15550000
.*                                                                      15600000
.*  GENERATE LINKAGE                                                    15650000
.*                                                                      15700000
.SVC     ANOP                                                      @D1A 15750000
         AIF   ('&LINKVAL' EQ 'SVC').RSVC       SVC linkage        @L1C 15783300
         AIF   ('&LINKVAL' EQ 'SYSTEM').PCLINK  PC linkage         @L1A 15816600
         AIF   ('&ASCB' NE '' OR '&ECBKEY' EQ '').BRL15            @L2A 15817800
.********************************************************************** 15819000
.*                                                                      15820200
.*  LINKAGE=BRANCH WITH ECBKEY SUPPLIED ON LOCAL POST                   15821400
.*       R00 CONTAINS THE ECBKEY                                        15822600
.*       R10 HIGH BIT ON INDICATES ECBKEY SUPPLIED                      15823800
.*                                                                      15825000
         AIF   (T'&ECBKEY EQ 'O').BRL15                            @L2A 15826200
         AIF   ('&ECBKEY'(1,1) EQ '(').BRECBR                      @L2A 15827400
         AIF   ('&ECBKEY' EQ 'YES').ERR9                           @L2A 15828600
         AIF   (T'&ECBKEY NE 'N').BRECBN                           @L2A 15829800
         AIF   (&ECBKEY GT 15).ERR9                                @L2A 15831000
.BRECBN  ANOP                                                           15832200
         LA    0,&SHIFT&ECBKEY        . ECBKEY IN R0               @L2A 15833400
         AGO   .BRECBO                                             @L2A 15834600
.BRECBR  ANOP                                                           15835800
         LR    0,&ECBKEY(1)           . ECBKEY IN R0               @L2A 15837000
.BRECBO  ANOP                                                           15838200
         LA    15,X'800'(0,0)                                      @L2A 15839400
         SLL   15,20(0)               . MASK TO SET HIGH ORDER BIT @L2A 15840600
         OR    10,15                  . SET ECBKEY FLAG BIT        @L2A 15841800
.*                                                                      15843000
.*                                                                      15844200
.********************************************************************** 15845400
.BRL15   ANOP                                                      @L2A 15846600
         L     15,16(0,0)                                          @D1A 15873300
         L     15,CVT0PT01-CVTMAP(0,15)                            @D1A 15900000
         BALR  14,15                  . BRANCH ENTRY               @D1A 15950000
         MEXIT                                                     @D1A 16000000
.RSVC    SVC   2                      . ISSUE THE POST SVC         @D1A 16050000
         MEXIT                                                          16100000
.PCLINK  ANOP  ,                                                   @L1A 16107100
.*  Leave Reg 15 alone if execute form or if cross memory requested.    16107500
         AIF   ('&MF' NE 'I' OR '&ASCB' NE '').PC2                 @D3A 16107900
.*  Clear Reg 15 if no ERRET supplied.                                  16108300
         AIF   ('&ERRET' EQ '').NOERRET                            @D3A 16108700
.*  Error if ERRET specified improperly.                                16109100
         AIF   ('&ERRET'(1,1) EQ '(' AND N'&ERRET GT 1).ERR3       @D3A 16109500
.*  Use LR if ERRET in a register.                                      16109900
         AIF   ('&ERRET'(1,1) EQ '(').PC1                          @D3A 16110300
         LA    15,&ERRET                ERRET ADDRESS                   16110700
         AGO   .PC2                                                @D3A 16111100
.PC1     ANOP  ,                                                   @D3A 16111500
         LR    15,&ERRET(1)             ERRET ADDRESS                   16111900
         AGO   .PC2                                                @D3A 16112300
.NOERRET ANOP  ,                                                   @D3A 16112700
         SR    15,15                    CLEAR REG 15                    16113100
.PC2     ANOP  ,                                                   @D3A 16113500
         AIF   ('&SYSAM64' NE 'YES').NOT64B1                       @L3A 16113600
         LLGT  14,16(0,0)               CVT ADDRESS                @L1A 16113700
         AGO   .NOT64B2                                            @L3A 16113800
.NOT64B1 ANOP                                                      @L3A 16113900
         L     14,16(0,0)               CVT ADDRESS                @L1A 16114200
.NOT64B2 ANOP                                                      @L3A 16117700
         L     14,772(,14)              SYSTEM FUNCTION TABLE ADDR @L1A 16121300
         L     14,&OSFT.(,14)           GET LX/EX FROM SFT         @L1A 16128400
         PC    0(14)                    PC TO POST SERVICE ROUTINE @L1A 16135500
         MEXIT                                                     @L1A 16142600
.*                                                                      16150000
.*  ERROR EXITS                                                         16200000
.*                                                                      16250000
.ERR1    ANOP                                                           16300000
         IHBERMAC  1010,ASCB,ERRET      ASCB OPERAND REQUIRES ERRET OP  16350000
         MEXIT                                                          16400000
.ERR2    ANOP                                                           16450000
         IHBERMAC  11                   ECB MISSING                     16500000
         MEXIT                                                          16550000
.ERR3    ANOP                                                           16600000
         IHBERMAC  203                  REGISTER SPECIFICATION INVALID  16650000
         MEXIT                                                          16700000
.ERR4    ANOP                                                           16750000
         IHBERMAC  1009                 NO CC ALLOWED IN LIST FORM      16800000
         MEXIT                                                          16850000
.ERR5    ANOP                                                           16900000
         IHBERMAC  69                   INVALID REG SPEC WITH MF=L      16950000
         MEXIT                                                          17000000
.ERR6    ANOP                                                           17050000
         IHBERMAC  35,,&MF              EXECUTE FORM MF= ERROR          17100000
         MEXIT                                                          17150000
.ERR7    ANOP                                                           17200000
         IHBERMAC    1010,ERRET,ASCB    ERRET OPERAND REQUIRES ASCB     17250000
         MEXIT                                                 @ZA15373 17300000
.ERR8    IHBERMAC    1010,ECBKEY,ASCB   ECBKEY OP REQUIRES ASCB@ZA15373 17350000
         MEXIT                                                 @ZA15373 17400000
.*                     MEMORY RELATED OP REQUIRES ASCB,BRANCH      @D2A 17500000
.ERR8B   MNOTE 8,'MEMREL OPERAND SPECIFIED WITHOUT ASCB AND LINKAGE=BRAx17516600
               NCH OPERAND.'                                       @L1C 17533200
         MEXIT                                                     @D2A 17550000
.ERR9    IHBERMAC    1007,ECBKEY        INVALID ECBKEY OPERAND @ZA15373 17600000
         MEXIT                                                          17650000
.*             LINKAGE=BRANCH NOT ALLOWED WITH LIST FORM           @L1C 17700000
.ERR10   IHBERMAC    1020,LINKAGE,LIST-FORM                        @L1C 17750000
         MEXIT                                                     @D1A 17800000
.*             LINKAGE=BRANCH NOT ALLOWED WITH EXECUTE FORM        @L1C 17850000
.ERR11   IHBERMAC    1020,"LINKAGE=BRANCH",EXECUTE-FORM            @D3C 17900000
         MEXIT                                                     @D1A 17950000
.ERR12   IHBERMAC    1007,BRANCH        INVALID BRANCH OPERAND     @D1A 18000000
         MNOTE 0,'USE LINKAGE PARAMETER INSTEAD OF BRANCH.'        @L1A 18025000
         MEXIT                                                     @D2A 18050000
.ERR13   IHBERMAC    1007,MEMREL        INVALID MEMREL OPERAND     @D2A 18100000
         MEXIT                                                     @L1A 18106200
.ERR14   MNOTE 8,'BRANCH AND LINKAGE ARE MUTUALLY EXCLUSIVE. USE LINKAGx18112400
               E PARAMETER.'                                       @L1A 18118600
         MEXIT                                                     @L1A 18124800
.ERR15   IHBERMAC    1007,LINKAGE       INVALID LINKAGE OPERAND    @L1A 18131000
         MEXIT                                                     @L1A 18137200
.ERR16   MNOTE 8,'ECBKEY IS REQUIRED WITH ASCB AND LINKAGE=SYSTEM' @L1A 18143400
         MEND                                                           18150000
**/                                                                     18200000
* POST: /* PL/S VERSION OF POST MACRO                                */ 18250000
*/********************************************************************/ 18300000
*  MACRO                                                                18350000
*    KEYS(ASCB,                    /* ADDRESS OF ASCB                */ 18400000
*        ERRET,                    /* ADDRESS OF ERROR RETURN ENTRY  */ 18450000
*        ECBKEY,                   /* ECB STORAGE PROT KEY   @ZA15373*/ 18500000
*        BRANCH,                   /* BRANCH ENTRY INDICATOR     @D1A*/ 18550000
*        LINKAGE,                  /* LINKAGE INDICATOR          @L1A*/ 18575000
*        MEMREL,                   /* MEMORY RELATED XMPOST      @D2A*/ 18600000
*        RELATED,                                                       18650000
*        MF);                      /* INTERREGIONAL POST REQUEST     */ 18700000
*        ANS('?'||MACLABEL||'POSTP '||MACLIST||MACKEYS||';');           18750000
*% END;                                                                 18800000
