*********************************************************************** 00004500
*PROPRIETARY V3 STATEMENT                                             * 00009000
*LICENSED MATERIALS - PROPERTY OF IBM                                 * 00013500
*"RESTRICTED MATERIALS OF IBM"                                        * 00018000
*5695-DF1                                                             * 00022500
*(C) COPYRIGHT 1992  IBM CORP.                                        * 00027000
*END PROPRIETARY V3 STATEMENT                                         * 00033700
*$L1=31BIT,JDZ1110,,SJPLRK:  INVOCABLE IN 31-BIT MODE              @L1A 00040500
*$01=OY65116,JDZ1110,930625,SJPLPS: INVALID BRANCH FOR NON-PRINTER @01A 00042700
*********************************************************************** 00045000
         MACRO                                                          00050000
&NAME    PRTOV &DCB,&NO,&EXIT                                           00100000
         LCLA  &CTR                                                     00150000
         LCLB  &SWA,&SWB,&ERR                                           00200000
         AIF   ('&DCB' EQ '').E1             TEST FOR DCB ADDR MISSING  00250000
.D1      AIF   ('&NO' EQ '').E3                                         00300000
         AIF   ('&NO' NE '9' AND '&NO' NE '12').E2 TEST FOR INVALID NO. 00350000
         AIF   (&ERR).END                                               00400000
         AIF   ('&EXIT' EQ '').NOEXIT        IF NO EXIT TAKE BRANCH     00450000
&SWA     SETB  ('&DCB'(1,1) NE '(')                                     00500000
&SWB     SETB  ('&EXIT'(1,1) NE '(')                                    00550000
         AIF   ('&DCB'(1,1) EQ '(').REGDCB   TEST FOR DCB REG           00600000
&NAME    LA    14,&DCB                           LOAD  DCB ADDR         00650000
         AGO   .CONTA                                                   00700000
.REGDCB  ANOP                                                           00750000
&NAME    LR    14,&DCB(1)              LOAD DCB ADDR                    00800000
.CONTA   ANOP                                                           00850000
&CTR     SETA  54+2*&SWA+2*&SWB                                    @01C 00900000
         TM    17(14),X'48'            IS DEVICE A PRINTER              00950000
         BC    14,*+&CTR               IF NOT BRANCH AROUND             01000000
&CTR     SETA  &CTR-8                                                   01050000
         TM    17(14),X'B0'            FURTHER TESTING FOR PRINTER      01100000
         BNZ   *+&CTR                  IF NOT PRINTER BRANCH AROUND     01150000
         SLR   1,1                                                 @L1A 01187500
         ICM   1,7,69(14)              LOAD IOB ADDR FROM DCB      @L1C 01225000
         ICM   1,7,13(1)               LOAD ECB ADDR FROM IOB     @L1C  01262500
         TM    0(1),X'40'                        TEST  COMPLETION BIT   01300000
         BO    *+10                              BRANCH  IF BIT ON      01350000
         LA    0,1                           SET WAIT COUNT TO ONE      01400000
         SVC   1                                 ISSUE  WAIT SVC        01450000
         AIF   ('&DCB'(1,1) EQ '(').DCBREG   TEST FOR DCB REG           01500000
         LA    1,&DCB                            LOAD  DCB ADDR         01550000
         AGO   .CONTB                                                   01600000
.DCBREG  LR    1,&DCB(1)                         LOAD  DCB ADDR         01650000
.CONTB   ANOP                                                           01700000
&CTR     SETA  80-((&NO/3)*16)               COMPUTE MASK FOR TM        01750000
         TM    44(1),&CTR                        TEST BIT FOR OVERFLOW  01800000
&CTR     SETA  255-&CTR                                                 01850000
         AIF   ('&EXIT'(1,1) EQ '(').REGEX                              01900000
         BZ    *+14                              IF OFF BRANCH AROUND   01950000
         NI    44(1),&CTR                        IF ON TURN OFF AND     02000000
         LA    15,&EXIT                      LOAD ADDR OF USER RTN      02050000
         AGO   .FINISH                                                  02100000
.REGEX   BZ    *+12                              IF OFF BRANCH AROUND   02150000
         NI    44(1),&CTR                        IF ON TURN OFF AND     02200000
         LR    15,&EXIT(1)                   LOAD ADDR OF USER RTN      02250000
.FINISH  BALR  14,15                             AND LINK TO IT         02300000
         AGO   .END                                                     02350000
.NOEXIT  AIF   ('&DCB'(1,1) EQ '(').DCBRG    TEST FOR DCB REG           02400000
&NAME    LA    1,&DCB                            LOAD DCB ADDR          02450000
         AGO   .CONTC                                                   02500000
.DCBRG   ANOP                                                           02550000
&NAME    LR    1,&DCB(1)                         LOAD DCB ADDR          02600000
.CONTC   TM    17(1),X'48'                       IS DEVICE A PRINTER    02650000
         BC    14,*+16                       IF NOT BRANCH AROUND       02700000
         TM    17(1),X'B0'            FURTHER TESTING FOR PRINTER       02750000
         BNZ   *+8                    IF NOT BR AROUND                  02800000
&CTR     SETA  80-((&NO/3)*16)               COMPUTE MASK FOR OI        02850000
         OI    18(1),&CTR                        SET BIT ON IN DCB      02900000
         MEXIT                                                          02950000
.E1      IHBERMAC 6                     &DCB MISSING                    03000000
&ERR     SETB  1                        INDICATE ERROR                  03050000
         AGO   .D1                      AND CONTINUE DIAGNOSIS          03100000
.E2      IHBERMAC 37,,&NO               &NO INVALID                     03150000
         MEXIT                                                          03200000
.E3      IHBERMAC 3                     &NO MISSING                     03250000
.END     MEND                                                           03300000
