* $MAC(RACDEF) COMP(SC1BN) PROD(RACF):                                  00013100
*                                                                       00013900
* DESCRIPTIVE NAME = RESOURCE DEFINITION MACRO                          00014700
*                                                                       00014800
* *01* PROPRIETARY STATEMENT=                                         * 00038800
*  **PROPRIETARY_STATEMENT********************************************* 00062800
*                                                                     * 00086800
*                                                                     * 00110800
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00134800
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 00158800
*   5647-A01 (C) COPYRIGHT IBM CORP. 1976, 2000                       * 00182800
*                                                                     * 00206800
*   STATUS= HBB7703                                                   * 00230800
*                                                                     * 00254800
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00278800
*                                                                    *  00303600
*01* EXTERNAL CLASSIFICATION:                                        *  00307400
*02* GUPI:                                                           *  00311200
*01* END OF EXTERNAL CLASSIFICATION:                                 *  00315000
*                                                                    *  00319000
* FUNCTION = ISSUED WHENEVER A RESOURCE MANAGER                         00600000
*    DETERMINES THAT A RESOURCE SHOULD BE DEFINED, DELETED OR           00650000
*    CHANGED TO THE SECURITY PACKAGE.                              @L5A 00700000
*                                                                       00750000
* CHANGE ACTIVITY =  A 00000000-99999999                       @Y40RSGD 00800000
*                    RACF VERSION 1, RELEASE 2                 @PC002PY 00850000
*                    RACF VERSION 1, RELEASE 3                 @PC003PY 00900000
*                    $L4=HRF1402,RACF/140,810701,SJRDSD:           @L4A 00950000
*                    OZ56979                                   @ZA56979 01000000
*                    OZ56982                                   @ZA56982 01050000
*                    $T1=UZ90211,SAF/RF15,810702,CNTDSD:           @T1A 01100000
*                    $L5=HRF1502,RACF/150,820311,CNTDSD:           @L5A 01150000
*                    $L6=HRF1602,RACF/160,830307,CNTDSD:           @L6A 01200000
*                    UZ90283                                   @ZA90283 01250000
*                    UZ90284                                   @ZA90284 01300000
*                    UZ90285                                   @ZA90285 01350000
*                    $L7=HRF1702,RACF/170,840608,CNTDSD:           @L7A 01400000
*                    $L8=HRF1802,RACF/180,860904,CNTDSD:           @L8A 01407100
*                    $M1=JRF1812,RACF/181,871116,CNTDSD:           @M1A 01414200
* $M2=JBB3313  RACF/190 880330 PDLCL1 : MVS B1 SECURITY            @M2A 01421300
*                    OY12773                                   @YA12773 01428400
*                    $P1=PGW0010 RACF/190 880428                   @P1A 01435500
* $P2=PGW0054  RACF/190 890308 PDPWB1 : PGW0054                    @P2A 01442600
* $M3=VMSFS    RACF/190 890517 PDB_S1 : SHARED FILE SYSTEM         @M3A 01444400
*                    OY13562                                   @YA13562 01446200
* $P3=PGP0418  RACF/190 890517 PDB_S1 : PGP0418                    @P3A 01447100
* $P4=PGP0568  RACF/190 890923 PDB_S1 : PGP0568                    @P4A 01448000
* $M4=RELID    RACF/192 900904 PDAHW1 : SUPPORT FOR RACF 1.9.2     @M4A 01448600
* $P5=PJA0029  RACF/192 910524 PDPSB1 : PJA0029                    @P5A 01449200
* $01=OY50857  RACF/192 920206 PDMDC1 : Support for OY50857        @01A 01449600
* $M5=OW04015  RACF/210 930427 PDKAF1 : Support for RACF 2.1       @M5A 01449700
* $M6=OW10709  RACF/220 940510 PDJMV1 : SUPPORT FOR RACF 2.2       @M6A 01449800
* $M7=RELID    RACF/230 960422 PDJMV1 : SUPPORT FOR RACF 2.3       @M7A 01449900
* $P6=PQC2423  RACF/230 960913 PDAWC1 : PQC2423                    @P6A 01452700
* $M8=RELID    RACF/240 960904 PDJMV1 : SUPPORT FOR RACF 2.4       @M8A 01453600
* $M9=RELID    RACF/260 970728 PDCAM1 : SUPPORT FOR RACF 2.6       @M9A 01454000
* $MA=RELID    HRF2608  980624 PDRDS2 : SUPPORT FOR HRF2608        @MAA 01454200
* $MB=RELID   RACF/7703 990415 PDRDS2 : SUPPORT FOR HRF7703        @MBA 01454300
*                                                                       01454500
*                                                                       01455500
* CHANGE DESCRIPTION:                                                   01458300
*    A - SUPPORT FOR SECLABL KEYWORD                               @M2A 01466600
*    A - DELETE REGISTER CHECK                                     @P1A 01474900
*    A - Generate correct length plist for release < 1.8.X         @P2A 01483200
*    A - SUPPORT THE KEYWORDS ENTITYX, MENTX AND NEWNAMX FOR            01484300
*        SHARED FILE SYSTEM                                        @M3A 01485400
*    A - NO ACTUAL CHANGES IN THE CODE                         @YA13562 01486500
*    A - Issue mnote when racdef is invoked in standard form       @P3A 01487600
*        and neither entity nor entityx keyword is specified,      @P3A 01488700
*        for release 1.9 and later only.                           @P3A 01489800
*    D - Support to disallow specification of RESOWN, STORCLA      @P4A 01490200
*        and MGMTCLA when ENVIR is not equal to VERIFY.            @P4A 01490600
*    A - Add support for RACF release 1.9.2                        @M4A 01490900
*    C - Status to correctly correspond to MVS level               @P5A 01491200
*    M - Skip test for required keywords when model related        @01A 01491300
*        keywords are specified with MF not equal to S.            @01A 01491400
*    A - Allow RACF Release 2.1 to be specified                    @M5A 01494200
*    A - Allow RACF Release 2.2 to be specified                    @M6A 01495600
*    A - Allow RACF Release 2.3 to be specified                    @M7A 01496300
*    A - Fix setting tape flag when EXPDTX is specified            @P6A 01496500
*        for the standard form of the macro.                       @P6A 01496700
*    A - Allow RACF Release 2.4 to be specified                    @M8A 01496800
*    A - Allow RACF Release 2.6 to be specified for FMID HRF2260   @M9A 01496900
*    A - Allow RACF Release 2608 to be specified for FMID HRF2608  @MAA 01497900
*    A - Allow RACF Release 7703 to be specified for FMID HRF7703  @MBA 01498400
*                                                                       01498900
         MACRO                                                          01500000
&SYMBOL  RACDEF &ENTITY=,&VOLSER=,&DSTYPE=,&OLDVOL=,&NEWNAME=,         -01550000
               &TYPE=,&MF=S,&INSTLN=,&CLASS=,&MENTITY=,            @M3C-01600000
               &UNIT=,                                             @L4A-01650000
               &UACC=,                                             @L4A-01700000
               &OWNER=,                                            @L4A-01750000
               &LEVEL=,                                            @L4A-01800000
               &AUDIT=,                                            @L4A-01850000
               &DATA=,                                             @L4A-01900000
               &SPECIAL=,                                          @L4A-01950000
               &MVOLSER=,&ACEE=,                               @PC003PY-02000000
               &RACFIND=,&CHKAUTH=,                                @L5A-02050000
               &WARNING=,&GENERIC=,                                @L7A-02100000
               &FILESEQ=,&EXPDT=,&EXPDTX=,                         @L8A-02150000
               &RETPD=,&ACCLVL=,                                   @L7A-02200000
               &TAPELBL=,&ERASE=,                                  @L7A-02250000
               &SECLVL=,&CATGORY=,                                 @L7A-02300000
               &MCLASS=,&MGENER=,&NOTIFY=,                         @L7A-02350000
               &RELEASE=,                                          @L8A-02362500
               &ENVIR=,                                            @M1A-02375000
               &RESOWN=,                                           @M1A-02387500
               &MGMTCLA=,                                          @M1A-02400000
               &STORCLA=,                                          @M2C-02412500
               &DDNAME=,                                       @YA12773-02425000
               &SECLABL=,                                          @M3C-02430000
               &ENTITYX=,                                          @M3A-02435000
               &MENTX=,                                            @M3A-02440000
               &NEWNAMX=                                           @M3A 02445000
.* DEFINE LOCAL SET SYMBOLS                                        @L7A 02450000
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&CLNGTH     @PC002PY 02500000
         LCLA  &BIT6,&BIT7                                       @L4A   02550000
         LCLA  &BITA0,&BITA1,&BITA2                                @L5A 02600000
         LCLA  &BITA3,&BITA4,&BITA5,&BITA6,&BITA7                  @L6A 02650000
         LCLB  &UACC0,&UACC1,&UACC2,&UACC3,&UACC4,&UACC5         @L4A   02700000
         LCLB  &UACC6,&UACC7                                     @L4A   02750000
         LCLA  &UACCVAL                                          @L4A   02800000
         LCLB  &AUDIT0,&AUDIT1,&AUDIT2,&AUDIT3,&AUDIT4,&AUDIT5   @L4A   02850000
         LCLB  &AUDIT6,&AUDIT7                                   @L4A   02900000
         LCLA  &AUDITVL                                          @L4A   02950000
         LCLC  &AUDITRG,&AUD(2),&AUDQ(2)                           @L5A 03000000
         LCLA  &I,&J                                               @L5A 03050000
         LCLB  &MFFLAG                                                  03100000
         LCLC  &CHAR                                           @PC002PY 03150000
         LCLA  &BRPT                                               @L7A 03200000
         LCLA  &RLVL                                               @M3C 03225000
         LCLA  &RLVLSZ(10)                                         @M5C 03250000
         LCLA  &PARMLEN                                            @M3A 03275000
         LCLB  &RLVLCHK                                            @L7A 03300000
         LCLB  &COPENTY          1 => ENTITYX IS SPECIFIED         @M3A 03302600
         LCLB  &COPMENT          1 => MENTX IS SPECIFIED           @M3A 03305200
         LCLB  &COPNWNM          1 => NEWNAMX IS SPECIFIED         @M3A 03307800
         LCLC  &CMENTY1          COMMON ENTITY - FIRST OPERAND     @M3A 03310400
         LCLC  &CMENTY2          COMMON ENTITY - SECOND OPERAND    @M3A 03313000
         LCLC  &CMMENT           MENTITY OR MENTX AS SPECIFIED     @M3A 03315600
         LCLC  &CMNWNM           NEWNAME OR NEWNAMX AS SPECIFIED   @M3A 03318200
         LCLC  &LCTYPE           LOCAL VARIABLE FOR TYPE           @M3A 03320800
.*                                                                      03323400
.*       SET "TYPE" TO "DEFINE" FOR RELEASE 1.9, IF TYPE NOT       @M3A 03326000
.*       SPECIFIED WITH 'LIST' AND 'STANDARD' MACRO FORMAT.        @M3A 03328600
.*                                                                      03331200
&LCTYPE  SETC  '&TYPE'                                             @M3A 03333800
         AIF   ('&LCTYPE' NE '').NOCPTYP                           @M3A 03336400
         AIF   ('&MF' NE 'S' AND '&MF' NE 'L').NOCPTYP             @M3A 03339000
&LCTYPE  SETC  'DEFINE'                                            @M3A 03341600
.NOCPTYP ANOP                                                      @M3A 03344200
.*                                                                      03346800
.* DEFINE GLOBAL SET SYMBOLS                                       @T1A 03350000
.*                                                                      03375000
         GBLB  &ICHRAC             ICHRAC - A FLAG WHICH, WHEN     @T1A 03400000
.*                                 ON, INDICATES THAT THIS MACRO   @T1A 03450000
.*                                 IS BEING INVOKED INTERNALLY     @T1A 03500000
.*                                 BY THE RACROUTE MACRO.          @T1A 03550000
         GBLC  &ICHL               SETS ADDRESSABILITY TO THE      @T1A 03600000
.*                                 PARAMETER LIST FOR THE          @T1A 03650000
.*                                 RACROUTE MACRO.                 @T1A 03700000
         GBLC  &ICHRLVL             SYMBOL TO BRANCH TO            @L7A 03750000
.*                                  WHEN INCOMPATIBLE MACRO LEVEL. @L7A 03800000
         GBLB  &ICHCOM              ICHCOM - A flag which when on  @M3A 03807100
.*                                  indicates that the racheck is  @M3A 03814200
.*                                  invoked by command processors  @M3A 03821300
.*                                  It generates parameter list    @M3A 03828400
.*                                  with 31 bit addressing and     @M3A 03835500
.*                                  the SVC call.                  @M3A 03842600
.* INITIALIZE FOR, AND VALIDATE, RELEASE PARAMETER                 @L7A 03850000
&RLVLSZ(1) SETA 48                 R1.6 PARAMETER LIST SIZE        @L7A 03900000
&RLVLSZ(2) SETA 56                 R1.6 SIZE FOR RACROUTE CALL     @L7A 03950000
&RLVLSZ(3) SETA 104                R1.7 PARAMETER LIST SIZE        @L7A 04000000
&RLVLSZ(4) SETA 104                R1.8 PARAMETER LIST SIZE        @M3C 04002200
&RLVLSZ(5) SETA 104                R1.8.1 PARAMETER LIST SIZE      @M3C 04004400
&RLVLSZ(6) SETA 124                R1.8X PARAMETER SIZE            @M3C 04006600
&RLVLSZ(7) SETA 124                1.9 PARAMETER SIZE              @M3A 04008800
&RLVLSZ(8) SETA 124                1.9.2 PARAMETER LIST SIZE       @M5C 04009900
&RLVLSZ(9) SETA 124                2.1 PARAMETER LIST SIZE         @M5A 04010400
&RLVLSZ(10) SETA 124               2.2 PARAMETER LIST SIZE         @M6A 04010700
&RLVLSZ(11) SETA 124               2.3 PARAMETER LIST SIZE         @M7A 04010800
&RLVLSZ(12) SETA 124               2.4 PARAMETER LIST SIZE         @M8A 04010900
&RLVLSZ(13) SETA 124               2.6 PARAMETER LIST SIZE         @M9A 04011600
&RLVLSZ(14) SETA 124              2608 PARAMETER LIST SIZE         @MAA 04011900
&RLVLSZ(15) SETA 124              7703 PARAMETER LIST SIZE         @MBA 04012100
.*                                                                 @M3A 04012300
.*  INITIALIZE LOCAL VARIABLE SYMBOLS                              @M3A 04013200
.*                                                                 @M3A 04015400
&COPENTY SETB  0                   ASSUME ENTITY IS SPECIFIED      @M3A 04017600
&COPNWNM SETB  0                   ASSUME MENTITY IS SPECIFIED     @M3A 04019800
&COPMENT SETB  0                   ASSUME NEWNAME IS SPECIFIED     @M3A 04022000
         AIF   (N'&ENTITY GT 1).COPTWO1  Is entity two operand?    @M3A 04024200
&CMENTY1 SETC  '&ENTITY'          Copy only operand to Cmenty1     @M3A 04026400
&CMENTY2 SETC  ''                 Set second operand to null.      @M3A 04028600
         AGO   .COMFLO1           Goto common flow.                @M3A 04030800
.COPTWO1 ANOP                                                      @M3A 04033000
&CMENTY1 SETC  '&ENTITY(1)'       Copy first operand of entity     @M3A 04035200
&CMENTY2 SETC  '&ENTITY(2)'       Copy second operand of entity    @M3A 04037400
.COMFLO1 ANOP                                                      @M3A 04039600
&CMMENT  SETC  '&MENTITY'         Copy model entity name           @M3A 04041800
&CMNWNM  SETC  '&NEWNAME'         Copy newname                     @M3A 04044000
.*                                                                 @M3A 04046200
         AIF   (&ICHRAC).RLVL01                                    @L7A 04050000
&ICHRLVL SETC  'ICH&SYSNDX.X'      CREATE LABEL FOR SVC BYPASS     @L7A 04100000
&RLVL    SETA  1                   SET R1.6 PARAMETER LIST         @L7A 04150000
         AGO   .RLVL05                                             @L7A 04200000
.RLVL01  ANOP                                                      @L7A 04250000
&RLVL    SETA  2                   SET SIZE FOR CALL BY RACROUTE   @L7A 04300000
.RLVL05  ANOP                                                      @L7A 04350000
         AIF   ('&RELEASE' EQ '').NORLVL                           @L7A 04400000
         AIF   (N'&RELEASE GT 2).ERLVL1 INVALID RELEASE PARAMETER  @L7A 04450000
         AIF   ('&RELEASE(1)' EQ '1.6').RLVL06                     @M2C 04466600
         AIF   ('&RELEASE(1)' EQ '1.7').RLVL06                     @M2C 04483200
         AIF   ('&RELEASE(1)' EQ '1.8').RLVL06                     @M2C 04499800
         AIF   ('&RELEASE(1)' EQ '1.8.1').RLVL06                   @M2C 04516400
         AIF   ('&RELEASE(1)' EQ '1.8X').RLVL06                @YA12773 04533000
         AIF   ('&RELEASE(1)' EQ '1.9').LNGNMCK                    @M3C 04549600
         AIF   ('&RELEASE(1)' EQ '1.9.2').LNGNMCK                  @M4A 04557900
         AIF   ('&RELEASE(1)' EQ '2.1').LNGNMCK                    @M5A 04562000
         AIF   ('&RELEASE(1)' EQ '2.2').LNGNMCK                    @M6A 04564100
         AIF   ('&RELEASE(1)' EQ '2.3').LNGNMCK                    @M7A 04565100
         AIF   ('&RELEASE(1)' EQ '2.4').LNGNMCK                    @M8A 04565600
         AIF   ('&RELEASE(1)' EQ '2.6').LNGNMCK                    @M9A 04565900
         AIF   ('&RELEASE(1)' EQ '2608').LNGNMCK                   @MAA 04566000
         AIF   ('&RELEASE(1)' EQ '7703').LNGNMCK                   @MBA 04566100
         AGO   .ERLVL1                                             @M2A 04566200
.*                                                                 @M3A 04566600
.*  TEST THE FOLLOWING :                                           @M3A 04567000
.*    1. RACDEF IS INVOKED VIA RACROUTE FOR RELEASE 1.9.           @M3A 04567400
.*    2. THE FOLLOWING PAIRS OF KEYWORDS ARE NOT SPECIFIED         @M3A 04567800
.*       SIMULTANEOUSLY AS THEY ARE MUTUALLY EXCLUSIVE.            @M3A 04568200
.*       A. ENTITY AND ENTITYX.                                    @M3A 04568600
.*       B. MENTITY AND MENTX.                                     @M3A 04569000
.*       C. NEWNAME AND NEWNAMX.                                   @M3A 04569400
.*                                                                 @M3A 04569800
.LNGNMCK ANOP                                                      @M3A 04570200
         AIF   (&ICHCOM).ERTN34                                    @M3A 04570600
         AIF   (NOT &ICHRAC).ERR34   error if release=1.9 or later @M4C 04571000
.ERTN34  ANOP                        and not invoked via Racroute  @M4C 04571400
         AIF   ('&ENTITYX' NE '' AND '&ENTITY' NE '').ERR28   test @M3A 04571800
.ERTN28  ANOP                               for mutual exclusivity @M3A 04572200
         AIF   ('&ENTITYX' EQ '').CHKMENT    entityx not specified @M3A 04572600
&COPENTY SETB  1                             Set bit for entityx   @M3A 04573000
         AIF   (N'&ENTITYX GT 1).COPTWO2    branch not one operand @M3A 04573400
&CMENTY1 SETC  '&ENTITYX'                       Copy first operand @M3A 04573800
&CMENTY2 SETC  ''                      Set second operand to null  @M3A 04574200
         AGO   .COMFLO2                to common logic flow        @M3A 04574600
.COPTWO2 ANOP                                                      @M3A 04575000
&CMENTY1 SETC  '&ENTITYX(1)'          Copy first operand           @M3A 04575400
&CMENTY2 SETC  '&ENTITYX(2)'          copy second operand          @M3A 04575800
.COMFLO2 ANOP                        Common flow in logic          @M3A 04576200
.CHKMENT ANOP                                                      @M3A 04576600
         AIF   ('&MENTX' NE '' AND '&MENTITY' NE '').ERR29  test   @M3A 04577000
.ERTN29  ANOP                         mutual exclusivity           @M3A 04577400
         AIF   ('&MENTX' EQ '').CHKNWNM    skip-mentx not specfied @M3A 04577800
&COPMENT SETB  1                         Set indicator             @M3A 04578200
&CMMENT  SETC  '&MENTX'                  Copy model name           @M3A 04578600
.CHKNWNM ANOP                                                      @M3A 04579000
         AIF   ('&NEWNAMX' NE '' AND '&NEWNAME' NE '').ERR30  test @M3A 04579400
.ERTN30  ANOP                                 mutual exclusivity   @M3A 04579800
         AIF   ('&NEWNAMX' EQ '').RLVL06       skip-not specified  @M3A 04580200
&COPNWNM SETB  1                          Set newnamx indicator    @M3A 04580600
&CMNWNM  SETC  '&NEWNAMX'                 Copy new name            @M3A 04581000
.*                                                                 @M3A 04581400
.RLVL06  ANOP                                                      @M2A 04582800
         AIF   (N'&RELEASE EQ 1).NORLVLC CHECK NOT SPECIFIED       @L7A 04600000
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1 INVALID VALUE     @L7A 04650000
         AIF   ('&MF(1)' NE 'E').ERLVL2 CHECK ONLY WITH MF=E       @L7A 04700000
&RLVLCHK SETB  1                  INDICATE RELEASE-CHECK REQUESTED @L7A 04750000
.ERLVL2R ANOP                                                      @L7A 04800000
.NORLVLC ANOP                                                      @L7A 04850000
         AIF   ('&RELEASE(1)' NE '7703').RLVL7703                  @MBA 04850100
&RLVL    SETA  15                  INDICATE RELEASE=7703           @MBA 04850200
.RLVL7703 ANOP                                                     @MBA 04850300
         AIF   ('&RELEASE(1)' NE '2608').RLVL260                   @MAA 04850400
&RLVL    SETA  14                  INDICATE RELEASE=2608           @MAA 04850500
.RLVL260 ANOP                                                      @MAA 04850600
         AIF   ('&RELEASE(1)' NE '2.6').RLVL240                    @M9A 04850700
&RLVL    SETA  13                  INDICATE RELEASE=2.6            @M9A 04850800
.RLVL240 ANOP                                                      @M9A 04850900
         AIF   ('&RELEASE(1)' NE '2.4').RLVL230                    @M8A 04851000
&RLVL    SETA  12                  INDICATE RELEASE=2.4            @M8A 04851100
.RLVL230 ANOP                                                      @M8A 04851200
         AIF   ('&RELEASE(1)' NE '2.3').RLVL220                    @M7A 04851300
&RLVL    SETA  11                  INDICATE RELEASE=2.3            @M7A 04851400
.RLVL220 ANOP                                                      @M7A 04851500
         AIF   ('&RELEASE(1)' NE '2.2').RLVL210                    @M6A 04851600
&RLVL    SETA  10                  INDICATE RELEASE=2.2            @M6A 04851700
.RLVL210 ANOP                                                      @M6A 04851800
         AIF   ('&RELEASE(1)' NE '2.1').RLVL192                    @M5A 04851900
&RLVL    SETA  9                   INDICATE RELEASE=2.1            @M5A 04852000
.RLVL192 ANOP                                                      @M5A 04852100
         AIF   ('&RELEASE(1)' NE '1.9.2').RLVL190                  @M4A 04852200
&RLVL    SETA  8                   INDICATE RELEASE=1.9.2          @M4A 04852300
.RLVL190 ANOP                                                      @M4A 04853300
         AIF   ('&RELEASE(1)' NE '1.9').RLVL18X                    @M2A 04854500
&RLVL    SETA  7                   INDICATE RELEASE=1.9            @M2A 04859000
.RLVL18X ANOP                                                      @M2A 04863500
         AIF   ('&RELEASE(1)' NE '1.8X').RLVL18A               @YA12773 04868000
&RLVL    SETA  6                   INDICATE RELEASE=1.8X       @YA12773 04872500
.RLVL18A ANOP                                                  @YA12773 04877000
         AIF   ('&RELEASE(1)' NE '1.8.1').RLVL18B                  @M3C 04880000
&RLVL    SETA  5                   INDICATE RELEASE= 1.8.1         @M3A 04883000
.RLVL18B ANOP                                                      @M3A 04886000
         AIF   ('&RELEASE(1)' NE '1.8').RLVL18                     @M3C 04889000
&RLVL    SETA  4                   INDICATE RELEASE=1.8            @M1A 04892000
.RLVL18  ANOP                                                      @L8A 04895000
         AIF   ('&RELEASE(1)' NE '1.7').RLVL17                     @L7A 04900000
&RLVL    SETA  3                   INDICATE RELEASE=1.7            @L7A 04950000
.RLVL17  ANOP                                                      @L7A 05000000
.NORLVL  ANOP                                                      @L7A 05050000
.ERLVL1R ANOP                                                      @L7A 05100000
.*                                                                 @L7A 05150000
.* PERFORM PARAMETER DIAGNOSIS                                          05200000
.*                                                                 @L7A 05250000
.* CHECK SPECIFIED PARAMETERS AGAINST RACF LEVEL                   @L7A 05300000
         AIF   (&RLVL GE 7).RLVL20 1.9 PARAMETERS VALID            @M2A 05300800
         AIF   ('&ENTITYX' NE '').ERR31  no entityx with           @M3A 05301600
.ERTN31  ANOP                            down level release        @M3A 05302400
         AIF   ('&MENTX' NE '').ERR32    no mentx with             @M3A 05303200
.ERTN32  ANOP                            down level release        @M3A 05304000
         AIF   ('&NEWNAMX' NE '').ERR33  no newnamx with           @M3A 05304800
.ERTN33  ANOP                            down level release        @M3A 05305600
         AIF   ('&SECLABL' NE '').ERLVLC not with downlevel        @M2A 05306400
.*                                       release.                  @M2A 05307200
         AGO   .RLVL19A                                            @M2A 05308500
.ERLVLCR ANOP                                                      @M2A 05310200
&RLVL    SETA  7              1.9 PARAMETERS USED, SO ASSUME       @M2A 05311900
.*                            RELEASE 1.9 EXPANSION AFTER ERROR    @M2A 05313600
         AGO   .RLVL20                                             @M2A 05315300
.RLVL19A ANOP                                                      @M2A 05317000
         AIF   (&RLVL GE 6).RLVL20 1.8X PARAMETERS VALID           @M3A 05318000
         AIF   ('&DDNAME' NE '').ERLVLD                            @M3C 05319000
         AGO   .RLV18XA                                            @M3A 05320000
.ERLVLDR ANOP                                                      @M3A 05321000
&RLVL    SETA  6              1.8X PARAMETERS USED, SO ASSUME      @M2A 05322000
.*                            RELEASE 1.8X EXPANSION AFTER ERROR   @M2A 05323000
         AGO   .RLVL20                                             @M3A 05324000
.RLV18XA ANOP                                                      @M3A 05325000
         AIF   (&RLVL GE 5).RLVL20 1.8.1 PARAMETERS VALID          @M3A 05326000
         AIF   ('&ENVIR&RESOWN&MGMTCLA&STORCLA' NE '').ERLVLE      @M3A 05327000
         AGO   .RLV181A                                            @M3A 05328000
.ERLVLER ANOP                                                      @M3A 05329000
&RLVL    SETA  5              1.8.1 PARAMETERS USED, SO ASSUME RELEASE X05330000
                              1.8.1 EXPANSION AFTER ERROR          @M3A 05331000
         AGO   .RLVL20                                             @M3A 05332000
.RLV181A ANOP                                                      @M3A 05333000
         AIF   (&RLVL GE 4).RLVL20 1.8 PARAMETERS VALID            @L8A 05334000
         AIF   ('&EXPDTX' NE '').ERLVLB                            @M3C 05336500
         AGO   .RLVL19                                             @L8A 05339100
.ERLVLBR ANOP                                                      @L8A 05340800
&RLVL    SETA  4              1.8 PARAMETERS USED, SO ASSUME           X05342500
                              RELEASE 1.8 EXPANSION AFTER ERROR    @L8A 05344200
         AGO   .RLVL20                                             @L8A 05345900
.RLVL19  ANOP                                                      @L8A 05347600
         AIF   (&RLVL GE 3).RLVL20 1.7 PARAMETERS VALID            @L7A 05350000
         AIF   ('&CATGORY&FILESEQ&EXPDT&RETPD&ACCLVL&TAPELBL&ERASE&SECLX05400000
               VL&MCLASS&MGENER&NOTIFY' NE '').ERLVLA              @L7A 05450000
         AIF   ('&DSTYPE' EQ 'T').ERLVLA                           @L7A 05500000
         AGO   .RLVL20                                             @L7A 05550000
.ERLVLAR ANOP                                                      @L7A 05600000
&RLVL    SETA  3                   1.7 PARAMETERS USED, SO ASSUME      X05650000
                                   RELEASE 1.7 EXPANSION           @L7A 05700000
.RLVL20  ANOP                                                      @L7A 05750000
&PARMLEN SETA  &RLVLSZ(&RLVL)       LEN OF RACDEF  PARMETER LIST   @L7A 05800000
.*                                                                 @L7A 05850000
         AIF   (&RLVL LT 7).ERTN35        1.9 checks are needed.   @P3A 05860600
         AIF   ('&MF' EQ 'S' AND '&CMENTY1' EQ '').ERR35           @P3A 05871200
.ERTN35  ANOP                                                      @P3A 05881800
.*                                                                 @L7A 05892600
.*                                                                 @L7A 05896300
.* VALIDATE DSTYPE PARAMETER                                            05900000
         AIF   ('&DSTYPE' NE 'N' AND '&DSTYPE' NE 'V' AND '&DSTYPE' NE -05950000
               '' AND '&DSTYPE' NE 'M'                                 -06000000
               AND '&DSTYPE' NE 'T').ERR01                         @L7A 06050000
.ERTN01  ANOP                                                           06100000
.* VALIDATE MGENER PARAMETER                                       @L7A 06150000
         AIF   ('&MGENER' EQ '').ERTN01B                           @L7A 06200000
         AIF   ('&MGENER' NE 'ASIS' AND '&MGENER' NE 'YES').ERR01B @L7A 06250000
.ERTN01B ANOP  ,                                                   @L7A 06300000
.* VALIDATE SPECIAL PARAMETER.                                   @L4A   06350000
         AIF   ('&SPECIAL' NE 'NO' AND '&SPECIAL' NE 'YES' AND         -06400000
               '&SPECIAL' NE '').ERR13                           @L4A   06450000
.ERTN13  ANOP  ,                                                 @L4A   06500000
.* VALIDATE RACFIND PARAMETER                                      @L5A 06550000
         AIF   ('&RACFIND' NE 'YES' AND '&RACFIND' NE 'NO' AND         *06600000
               '&RACFIND' NE '').ERR14                             @L5A 06650000
.ERTN14  ANOP                                                      @L5A 06700000
.* VALIDATE CHKAUTH PARAMETER                                      @L5A 06750000
         AIF   ('&CHKAUTH' NE 'YES' AND '&CHKAUTH' NE 'NO' AND         *06800000
               '&CHKAUTH' NE '').ERR15                             @L5A 06850000
.ERTN15  ANOP                                                      @L5A 06900000
.* VALIDATE WARNING PARAMETER                                           06950000
         AIF   ('&WARNING' EQ '').ERTN16                           @L6A 07000000
         AIF   ('&WARNING' NE 'YES' AND '&WARNING' NE 'NO').ERR16  @L6A 07050000
.ERTN16  ANOP  ,                                                   @L6A 07100000
.* VALIDATE GENERIC PARAMETER                                           07150000
         AIF   ('&GENERIC' EQ '').ERTN17                           @L6A 07200000
         AIF   ('&GENERIC' NE 'ASIS' AND                               -07250000
               '&GENERIC' NE 'YES').ERR17                          @L6A 07300000
.ERTN17  ANOP  ,                                                   @L6A 07350000
.* VALIDATE TYPE PARAMETER                                              07400000
         AIF   ('&LCTYPE' EQ '').RDEF004                           @M3C 07444400
         AIF   ('&LCTYPE' NE 'DEFINE' AND '&LCTYPE' NE 'DELETE' AND    -07488800
               '&LCTYPE' NE 'CHGVOL' AND '&LCTYPE' NE 'ADDVOL').ERR02   07533200
.*                                                                 @M3C 07577600
         AIF   ('&LCTYPE' EQ 'DEFINE' AND                              *07622000
               '&CMNWNM' EQ '').RDEF005                            @M3C 07666400
         AIF   ('&CMNWNM' NE '' AND '&DSTYPE' EQ 'T').ERR020       @M3C 07710800
         AIF   ('&LCTYPE' EQ 'CHGVOL' AND '&DSTYPE' EQ 'T').ERR021 @M3C 07755200
         AIF   (&COPMENT).SKIP000                                  @M3A 07825000
&CHAR    SETC  'MENTITY'                                       @PC002PY 07850000
         AIF   ('&MENTITY' NE '').ERR07                        @PC002PY 07900000
         AGO   .SKIP001                                            @M3A 07908300
.SKIP000 ANOP                                                      @M3A 07916600
&CHAR    SETC  'MENTX'                                             @M3A 07924900
         AIF   ('&MENTX' NE '').ERR07                              @M3A 07933200
.SKIP001 ANOP                                                      @M3A 07941500
&CHAR    SETC  'MVOLSER'                                       @PC002PY 07950000
         AIF   ('&MVOLSER' NE '').ERR07                        @PC002PY 08000000
&CHAR    SETC  'WARNING'                                           @L6A 08050000
         AIF   ('&WARNING' NE '').ERR07                            @L6A 08100000
&CHAR    SETC  'MGENER'                                            @L7A 08150000
         AIF   ('&MGENER'  NE '').ERR07                            @L7A 08200000
&CHAR    SETC  'MCLASS'                                            @L7A 08250000
         AIF   ('&MCLASS'  NE '').ERR07                            @L7A 08300000
.RDEF005 ANOP                                                      @L7A 08350000
.RDEF004 ANOP  ,                                                   @01M 08375000
.ERTN02  ANOP                                                           08400000
.ERTN07  ANOP                                                  @PC002PY 08450000
.ERTN020 ANOP                                                      @L7A 08500000
.ERTN021 ANOP                                                      @L7A 08550000
.* VALIDATE EXPDT AND RETPD AND  EXPDTX PARAMETERS                 @L8A 08600000
         AIF   ('&EXPDT' NE '' AND '&RETPD' NE '').ERR22           @L7A 08650000
.ERTN22  ANOP                                                      @L7A 08700000
         AIF   ('&EXPDT' NE '' AND '&EXPDTX' NE '').ERR22A         @L8A 08708300
.ERTN22A ANOP                                                      @L8A 08716600
         AIF   ('&RETPD' NE '' AND '&EXPDTX' NE '').ERR22B         @L8A 08724900
.*                                                                 @L8A 08733200
.ERTN22B ANOP                                                      @L8A 08741500
.* VERIFY AND DECODE AUDIT                                         @L5A 08750000
         AIF   ('&AUDIT' EQ '').RDEFA99                            @L5A 08800000
         AIF   (N'&AUDIT GT 2).ERR10                               @L5A 08850000
         AIF   (N'&AUDIT NE 1 OR K'&AUDIT LT 5).RDEFA08            @L5A 08900000
         AIF   ('&AUDIT'(1,2) NE '((').RDEFA08                     @L5A 08950000
&AUDITRG SETC  '&AUDIT'(3,K'&AUDIT-4)  EXTRACT REGISTER "NAME"         X09000000
                (NOTE - V1R4 REGISTER NOTATION HANDLED AT .ERR10)  @L5A 09050000
         AGO   .RDEFA99                                            @L5A 09100000
.RDEFA08 ANOP                                                      @L5A 09150000
         AIF   ('&AUDIT' NE 'NONE').RDEFA10                        @L5A 09200000
&AUDIT3  SETB  1                   AUDIT=NONE                      @L5A 09250000
         AGO   .RDEFA90                                            @L5A 09300000
.RDEFA10 ANOP                                                      @L5A 09350000
&AUD(1)  SETC  '&AUDIT(1)'                                         @L5A 09400000
&AUDQ(1) SETC  'READ'              DEFAULT QUALIFIER               @L5A 09450000
&AUD(2)  SETC  '&AUDIT(2)'                                         @L5A 09500000
&AUDQ(2) SETC  'READ'              DEFAULT QUALIFIER               @L5A 09550000
&I       SETA  1                                                   @L5A 09600000
.RDEFA30 ANOP                                                      @L5A 09650000
&J       SETA  K'&AUD(&I)                                          @L5A 09700000
         AIF   ('&AUD(&I)'(&J,1) NE ')').RDEFA34                   @L5A 09750000
.RDEFA32 ANOP                                                      @L5A 09800000
&J       SETA  &J-1                                                @L5A 09850000
         AIF   (&J GE 2 AND '&AUD(&I)'(&J,1) NE '(').RDEFA32       @L5A 09900000
&AUDQ(&I) SETC '&AUD(&I)'(&J+1,K'&AUD(&I)-&J-1)                    @L5A 09950000
&AUD(&I) SETC  '&AUD(&I)'(1,&J-1)                                  @L5A 10000000
.RDEFA34 ANOP                                                      @L5A 10050000
         AIF   ('&AUD(&I)' NE 'ALL' AND '&AUD(&I)' NE 'SUCCESS' AND    X10100000
               '&AUD(&I)' NE 'FAILURES').ERR10                     @L5A 10150000
         AIF   ('&AUDQ(&I)' NE 'READ' AND '&AUDQ(&I)' NE 'UPDATE' AND  X10200000
               '&AUDQ(&I)' NE 'CONTROL' AND                            X10250000
               '&AUDQ(&I)' NE 'ALTER').ERR10                       @L5A 10300000
         AIF   ('&AUDQ(&I)' NE 'READ').RDEFA36                     @L5A 10350000
&AUDQ(&I) SETC 'XEAD'              CHANGE FOR PROPER SORT ORDER    @L5A 10400000
.RDEFA36 ANOP                                                      @L5A 10450000
&I       SETA  &I+1                                                @L5A 10500000
         AIF   (&I LE N'&AUDIT).RDEFA30                            @L5A 10550000
.* RESOLVE AUDIT CONFLICTS                                         @L5A 10600000
         AIF   (N'&AUDIT LT 2).RDEFA50                             @L5A 10650000
         AIF   ('&AUD(1)' NE 'ALL' OR                                  X10700000
               '&AUDQ(1)'(1,1) LE '&AUDQ(2)'(1,1)).RDEFA41         @L5A 10750000
&AUDQ(2) SETC  '&AUDQ(1)'                                          @L5A 10800000
.RDEFA41 ANOP                                                      @L5A 10850000
         AIF   ('&AUD(2)' NE 'ALL' OR                                  X10900000
               '&AUDQ(2)'(1,1) LE '&AUDQ(1)'(1,1)).RDEFA43         @L5A 10950000
&AUDQ(1) SETC  '&AUDQ(2)'                                          @L5A 11000000
.RDEFA43 ANOP                                                      @L5A 11050000
         AIF   ('&AUD(1)' EQ '&AUD(2)').RDEFA47                    @L5A 11100000
         AIF   ('&AUD(1)' NE 'ALL').RDEFA46                        @L5A 11150000
&AUD(1)  SETC  'SUCCESS'                                           @L5A 11200000
         AIF   ('&AUD(2)' EQ 'FAILURES').RDEFA46                   @L5A 11250000
&AUD(1)  SETC  'FAILURES'                                          @L5A 11300000
.RDEFA46 ANOP                                                      @L5A 11350000
         AIF   ('&AUD(2)' NE 'ALL').RDEFA47                        @L5A 11400000
&AUD(2)  SETC  'SUCCESS'                                           @L5A 11450000
         AIF   ('&AUD(1)' EQ 'FAILURES').RDEFA47                   @L5A 11500000
&AUD(2)  SETC  'FAILURES'                                          @L5A 11550000
.RDEFA47 ANOP                                                      @L5A 11600000
.RDEFA50 ANOP                      ENCODE AUDIT VALUE              @L5A 11650000
&I       SETA  1                   RESET COUNTER                   @L5A 11700000
.RDEFA51 ANOP                                                      @L5A 11750000
&AUDIT0  SETB  (&AUDIT0 OR '&AUD(&I)' EQ 'ALL')                    @L5A 11800000
&AUDIT1  SETB  (&AUDIT1 OR '&AUD(&I)' EQ 'SUCCESS')                @L5A 11850000
&AUDIT2  SETB  (&AUDIT2 OR '&AUD(&I)' EQ 'FAILURES')               @L5A 11900000
         AIF   ('&AUD(&I)' NE 'ALL' AND                                X11950000
               '&AUD(&I)' NE 'SUCCESS').RDEFA53                    @L5A 12000000
&AUDIT4  SETB  (&AUDIT4 OR '&AUDQ(&I)' EQ 'CONTROL' OR                 X12050000
               '&AUDQ(&I)' EQ 'ALTER')                             @L5A 12100000
&AUDIT5  SETB  (&AUDIT5 OR '&AUDQ(&I)' EQ 'UPDATE' OR                  X12150000
               '&AUDQ(&I)' EQ 'ALTER')                             @L5A 12200000
.RDEFA53 ANOP                                                      @L5A 12250000
         AIF   ('&AUD(&I)' NE 'ALL' AND                                X12300000
               '&AUD(&I)' NE 'FAILURES').RDEFA56                   @L5A 12350000
&AUDIT6  SETB  (&AUDIT6 OR '&AUDQ(&I)' EQ 'CONTROL' OR                 X12400000
               '&AUDQ(&I)' EQ 'ALTER')                             @L5A 12450000
&AUDIT7  SETB  (&AUDIT7 OR '&AUDQ(&I)' EQ 'UPDATE' OR                  X12500000
               '&AUDQ(&I)' EQ 'ALTER')                             @L5A 12550000
.RDEFA56 ANOP                                                      @L5A 12600000
&I       SETA  &I+1                                                @L5A 12650000
         AIF   (&I LE N'&AUDIT).RDEFA51                            @L5A 12700000
         AIF   (&AUDIT1+&AUDIT2 LT 2 AND NOT &AUDIT0).RDEFA59      @L5A 12750000
&AUDIT0  SETB  1                   FORCE                           @L5A 12800000
&AUDIT1  SETB  0                     AUDIT=ALL                     @L5A 12850000
&AUDIT2  SETB  0                                                   @L5A 12900000
.RDEFA59 ANOP                                                      @L5A 12950000
.RDEFA90 ANOP                                                      @L5A 13000000
&AUDITVL SETA  128*&AUDIT0+64*&AUDIT1+32*&AUDIT2+16*&AUDIT3+8*&AUDIT4+4X13050000
               *&AUDIT5+2*&AUDIT6+&AUDIT7                          @L5A 13100000
.RDEFA99 ANOP                                                      @L5A 13150000
.ERTN10  ANOP                                                      @L5A 13200000
.* VALIDATE TAPELBL PARAMETER                                      @L7A 13250000
         AIF   ('&TAPELBL' NE 'STD' AND '&TAPELBL' NE 'NL' AND         -13300000
                '&TAPELBL' NE 'BLP' AND '&TAPELBL' NE '').ERR18    @L7A 13350000
.ERTN18  ANOP                                                      @L7A 13400000
.* VALIDATE ERASE PARAMETER                                        @L7A 13450000
         AIF   ('&ERASE' NE 'YES' AND '&ERASE' NE 'NO'                 -13500000
               AND '&ERASE' NE '').ERR19                           @L7A 13550000
.ERTN19  ANOP                                                      @L7A 13600000
.* VALIDATE ENVIR PARAMETER                                        @M1A 13603300
         AIF   ('&ENVIR' NE '' AND '&ENVIR' NE 'VERIFY').ERR25     @M1A 13606600
.ERTN25  ANOP                                                      @M1A 13609900
.* FOR S FORM, VALIDATE COMBINATIONS                               @M1A 13613200
         AIF   ('&MF' NE 'S').REGCHK                              2@P4D 13623100
.* STORCLA/MGMTCLA REQUIRES RESOWN                                 @M1A 13633000
         AIF   ('&STORCLA&MGMTCLA' NE '' AND                           X13636300
               '&RESOWN' EQ '').ERR27                              @M1A 13639600
.ERTN27  ANOP                                                      @M1A 13642900
.REGCHK  ANOP                                                      @M1A 13646200
.* REGISTER FORMS OF ADDRESS PARAMETERS NOT VALID WITH LIST FORM        13650000
         AIF   ('&MF' NE 'L').ERTN03                               @L7A 13700000
         AIF   ('&CMENTY1' EQ '').RDEF010                          @M3C 13750000
         AIF   ('&CMENTY1'(1,1) EQ '(').ERR03                      @M3C 13800000
.RDEF010 ANOP                                                           13850000
         AIF   ('&VOLSER' EQ '').RDEF020                                13900000
         AIF   ('&VOLSER'(1,1) EQ '(').ERR03                            13950000
.RDEF020 ANOP                                                           14000000
         AIF   ('&OLDVOL' EQ '').RDEF040                                14050000
         AIF   ('&OLDVOL'(1,1) EQ '(').ERR03                            14100000
.RDEF040 ANOP                                                           14150000
         AIF   ('&CMNWNM' EQ '').RDEF050                           @M3C 14200000
         AIF   ('&CMNWNM'(1,1) EQ '(').ERR03                       @M3C 14250000
.RDEF050 ANOP                                                           14300000
         AIF   ('&INSTLN' NE '' AND '&INSTLN(1)' NE '&INSTLN').ERR03    14350000
         AIF   ('&CLASS' EQ '').RDEF052                        @PC002PY 14400000
         AIF   ('&CLASS'(1,1) EQ '(').ERR03                    @PC002PY 14450000
.RDEF052 ANOP                                                  @PC002PY 14500000
         AIF   ('&CMMENT' EQ '').RDEF053                           @M3C 14550000
         AIF   ('&CMMENT'(1,1) EQ '(').ERR03                       @M3C 14600000
.RDEF053 ANOP                                                  @PC002PY 14650000
         AIF   ('&MVOLSER' EQ '').RDEF054                      @PC002PY 14700000
         AIF   ('&MVOLSER'(1,1) EQ '(').ERR03                  @PC002PY 14750000
.RDEF054 ANOP                                                  @PC002PY 14800000
         AIF   ('&ACEE' EQ '').RDEF055                         @PC----  14850000
         AIF   ('&ACEE'(1,1) EQ '(').ERR03                     @PC003PY 14900000
.RDEF055 ANOP                                                  @PC003PY 14950000
         AIF   ('&UNIT' EQ '').RDEF056                             @L4A 15000000
         AIF   ('&UNIT'(1,1) EQ '(').ERR03                         @L4A 15050000
.RDEF056 ANOP  ,                                                   @L4A 15100000
         AIF   ('&UACC' EQ '').RDEF057                             @L4A 15150000
         AIF   ('&UACC'(1,1) EQ '(').ERR03                         @L4A 15200000
         AIF   ('&UACC' EQ 'ALTER').RDEF057                        @L4A 15250000
         AIF   ('&UACC' EQ 'CONTROL').RDEF057                      @L4A 15300000
         AIF   ('&UACC' EQ 'UPDATE').RDEF057                       @L4A 15350000
         AIF   ('&UACC' EQ 'READ').RDEF057                         @L4A 15400000
         AIF   ('&UACC' EQ 'EXECUTE').RDEF057                      @M1A 15425000
         AIF   ('&UACC' EQ 'NONE').RDEF057                         @L4A 15450000
         AGO   .ERR09                                              @L4A 15500000
.ERTN09  ANOP  ,                                                   @L4A 15550000
.RDEF057 ANOP  ,                                                   @L4A 15600000
         AIF   ('&OWNER' EQ '').RDEF058                            @L4A 15650000
         AIF   ('&OWNER'(1,1) EQ '(').ERR03                        @L4A 15700000
.RDEF058 ANOP  ,                                                   @L4A 15750000
         AIF   ('&LEVEL' EQ '').RDEF059                            @L4A 15800000
         AIF   ('&LEVEL'(1,1) EQ '(').ERR03                        @L4A 15850000
         AIF   (K'&LEVEL GT 2).ERR11                               @L4A 15900000
.ERTN11  ANOP  ,                                                   @L4A 15950000
.RDEF059 ANOP  ,                                                   @L4A 16000000
         AIF   ('&AUDITRG' NE '').ERR03                            @L5A 16050000
         AIF   ('&DATA' EQ '').RDEF05B                             @L4A 16100000
         AIF   ('&DATA'(1,1) EQ '(').ERR03                         @L4A 16150000
.RDEF05B ANOP  ,                                                   @L4A 16200000
         AIF   ('&FILESEQ' EQ '').RDEF05C                          @L7A 16250000
         AIF   ('&FILESEQ'(1,1) EQ '(').ERR03                      @L7A 16300000
.RDEF05C ANOP                                                      @L7A 16350000
         AIF   ('&EXPDT' EQ '').RDEF05D                            @L7A 16400000
         AIF   ('&EXPDT'(1,1) EQ '(').ERR03                        @L7A 16450000
.RDEF05D ANOP                                                      @L7A 16500000
         AIF   ('&RETPD' EQ '').RDEF05E                            @L7A 16550000
         AIF   ('&RETPD'(1,1) EQ '(').ERR03                        @L7A 16600000
.RDEF05E ANOP                                                      @L7A 16650000
         AIF   ('&ACCLVL' EQ '').RDEF05G                           @L7A 16700000
         AIF   (T'&ACCLVL(1) EQ 'O').RDEF05F                       @L7A 16750000
         AIF   ('&ACCLVL(1)'(1,1) EQ '(').ERR03                    @L7A 16800000
.RDEF05F ANOP                                                      @L7A 16850000
         AIF   (N'&ACCLVL EQ 1).RDEF05G                            @L7A 16900000
         AIF   ('&ACCLVL(2)'(1,1) EQ '(').ERR03                    @L7A 16950000
.RDEF05G ANOP                                                      @L7A 17000000
         AIF   ('&MCLASS' EQ '').RDEF05H                           @L7A 17050000
         AIF   ('&MCLASS'(1,1) EQ '(').ERR03                       @L7A 17100000
.RDEF05H ANOP                                                      @L7A 17150000
         AIF   ('&NOTIFY' EQ '').RDEF05I                           @L7A 17200000
         AIF   ('&NOTIFY'(1,1) EQ '(').ERR03                       @L7A 17250000
.RDEF05I ANOP                                                      @L7A 17300000
         AIF   ('&RESOWN' EQ '').RDEF05J                           @M1A 17302600
         AIF   ('&RESOWN'(1,1) EQ '(').ERR03                       @M1A 17305200
.RDEF05J ANOP                                                      @M1A 17307800
         AIF   ('&MGMTCLA' EQ '').RDEF05K                          @M1A 17310400
         AIF   ('&MGMTCLA'(1,1) EQ '(').ERR03                      @M1A 17313000
.RDEF05K ANOP                                                      @M1A 17315600
         AIF   ('&STORCLA' EQ '').RDEF05L                          @M1A 17318200
         AIF   ('&STORCLA'(1,1) EQ '(').ERR03                      @M1A 17320800
.RDEF05L ANOP                                                      @L8A 17323400
         AIF   ('&EXPDTX' EQ '').RDEF05P                           @L8A 17326000
         AIF   ('&EXPDTX'(1,1) EQ '(').ERR03                       @L8A 17328600
.RDEF05P ANOP                                                  @YA12773 17331200
         AIF   ('&DDNAME' EQ '').RDEF05M                       @YA12773 17333800
         AIF   ('&DDNAME'(1,1) EQ '(').ERR03                   @YA12773 17336400
.RDEF05M ANOP                                                      @M1A 17339000
         AIF   ('&SECLABL' EQ '').RDEF05N                          @M2A 17341600
         AIF   ('&SECLABL'(1,1) EQ '(').ERR03                      @M2A 17344200
.RDEF05N ANOP                                                      @M2A 17346800
.ERTN03  ANOP                                                           17350000
.ERTN05  ANOP                                                           22900000
.* PRODUCE LIST FORM IF REQUESTED                                       22950000
         AIF   ('&MF' NE 'L').RDEF269                                   23000000
.* PRODUCE FIRST FLAGS BYTE FROM TYPE,OLDVOL,NEWNAME,&DSTYPE PARMS      23050000
&SYMBOL  DS    0F                                                       23100000
.RDEF110 ANOP                                                           23150000
ICH0&SYSNDX EQU *                                                       23200000
.* PRODUCE LENGTH                                                       23250000
.**************************************************************    @T1A 23300000
.* IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO, THE 3 BYTES    @T1A 23350000
.* AFTER LENGTH ARE RESERVED, AND INSTLN IS GENERATED AT THE       @T1A 23400000
.* END OF THE LIST.                                                @T1A 23450000
.**************************************************************    @T1A 23500000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF111               @M3C 23550000
&ICHL    DC    AL1(&PARMLEN)  LENGTH OF PARAMETER LIST             @L7A 23600000
         DC    AL3(0)                                              @T1A 23650000
         AGO   .RDEF114                                            @T1A 23700000
.RDEF111 ANOP                                                      @T1A 23750000
         DC    AL1(&PARMLEN) - LENGTH OF PARAMETER LIST            @L7A 23800000
.* PRODUCE INSTALLATION DATA ADDRESS                                    23850000
         AIF   ('&INSTLN' EQ '' OR '&INSTLN(1)' NE '&INSTLN').RDEF112   23900000
         DC    AL3(&INSTLN) - INSTALLATION DATA ADDRESS                 23950000
         AGO   .RDEF114                                                 24000000
.RDEF112 ANOP                                                           24050000
         DC    AL3(0) - INSTALLATION DATA ADDRESS                       24100000
.RDEF114 ANOP                                                           24150000
.* PRODUCE FIRST FLAGS BYTE                                             24200000
         AIF   ('&LCTYPE' NE 'DELETE').RDEF120                     @M3C 24250000
&BIT0    SETA  1                                                        24300000
.RDEF120 ANOP                                                           24350000
         AIF   ('&LCTYPE' NE 'ADDVOL').RDEF130                     @M3C 24400000
&BIT1    SETA  1                                                        24450000
.RDEF130 ANOP                                                           24500000
         AIF   ('&LCTYPE' NE 'CHGVOL').RDEF135                     @M3C 24550000
&BIT0    SETA  1                                                   @L4A 24600000
&BIT1    SETA  1                                                   @L4A 24650000
.RDEF135 ANOP  ,                                                   @L4A 24700000
         AIF   ('&OLDVOL' EQ '').RDEF140                                24750000
&BIT2    SETA  1                                                        24800000
.RDEF140 ANOP                                                           24850000
         AIF   ('&CMNWNM' EQ '').RDEF145                           @M3C 24900000
&BIT3    SETA  1                                                        24950000
.RDEF145 ANOP                                                      @T1A 25000000
.******************************************************            @T1A 25050000
.* IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO, THE            @T1A 25100000
.* PARAMETER LIST HAS 31-BIT ADDRESSING.                           @T1A 25150000
.******************************************************            @T1A 25200000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF150               @M3C 25250000
&BIT4    SETA  1               31-BIT ADDRESSING IN LIST           @T1A 25300000
.RDEF150 ANOP                                                           25350000
         AIF   ('&DSTYPE' NE 'M').RDEF160                          @L4A 25400000
&BIT6    SETA  1                                                   @L4A 25450000
.RDEF160 ANOP  ,                                                   @L4A 25500000
         AIF   ('&DSTYPE' NE 'V').RDEF170                               25550000
&BIT5    SETA  1                                                        25600000
.RDEF170 ANOP                                                           25650000
         AIF   ('&SPECIAL' EQ 'NO' OR '&SPECIAL' EQ '').RDEF171  @L4A   25700000
&BIT7    SETA  1                                                 @L4A   25750000
.RDEF171 ANOP  ,                                                 @L4A   25800000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' FLAGS @L4A   25850000
.**************************************************************    @T1A 25900000
.* IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO, THE 3 BYTES    @T1A 25950000
.* AFTER FLAGS  ARE RESERVED, AND ENTITY IS GENERATED AT THE       @T1A 26000000
.* END OF THE LIST.                                                @T1A 26050000
.**************************************************************    @T1A 26100000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF175               @M3C 26150000
         DC    AL3(0)                                              @T1A 26200000
         AGO   .RDEF190                                            @T1A 26250000
.RDEF175 ANOP                                                      @T1A 26300000
.* PRODUCE ENTITY OR ENTITYX NAME ADDRESS                          @M3C 26350000
         AIF   ('&CMENTY1' EQ '').RDEF180                          @M3C 26400000
         AIF   ('&CMENTY1'(1,1) EQ '(').RDEF180                    @M3C 26450000
         DC    AL3(&CMENTY1) - ENTITY OR ENTITYX NAME ADDRESS      @M3C 26500000
         AGO   .RDEF190                                                 26550000
.RDEF180 ANOP                                                           26600000
         DC    AL3(0) -       ENTITY NAME ADDR FIELD                    26650000
.RDEF190 ANOP                                                           26700000
.* PRODUCE OLD VOLSER, OR NEWNAME ADDRESS                               26750000
         AIF   ('&OLDVOL' EQ '').RDEF210                                26800000
         AIF   ('&OLDVOL'(1,1) EQ '(').RDEF210                          26850000
         DC    A(&OLDVOL) -   OLD VOLSER ADDRESS                        26900000
         AGO   .RDEF230                                                 26950000
.RDEF210 ANOP                                                           27000000
         AIF   ('&CMNWNM' EQ '').RDEF220                           @M3C 27050000
         AIF   ('&CMNWNM'(1,1) EQ '(').RDEF220                     @M3C 27100000
         DC    A(&CMNWNM) -   NEW ENTITY NAME ADDRESS              @M3C 27150000
         AGO   .RDEF230                                                 27200000
.RDEF220 ANOP                                                           27250000
         DC    A(0) -         OLDVOL OR NEWNAME ADDRESS FIELD           27300000
.RDEF230 ANOP                                                           27350000
.* PRODUCE VOLSER ADDRESS                                               27400000
         AIF   ('&VOLSER' EQ '').RDEF24E NO VOLSER                      27450000
         AIF   ('&VOLSER'(1,1) EQ '(').RDEF24E                          27500000
         DC    A(&VOLSER) -   ENTITY VOLSER ADDRESS                     27550000
         AGO   .RDEF24F                                                 27600000
.RDEF24E ANOP                                                           27650000
         DC    A(0) -         ENTITY VOLSER ADDRESS FIELD               27700000
.RDEF24F ANOP                                                           27750000
.* PRODUCE CLASS ADDRESS                                       @PC002PY 27800000
         AIF   ('&CLASS' EQ '').RDEF251 NO CLASS               @PC002PY 27850000
         AIF   ('&CLASS'(1,1) EQ '(').RDEF251                  @PC002PY 27900000
         AIF   ('&CLASS'(1,1) EQ '''').RDEF250                 @PC002PY 27950000
         DC    A(&CLASS) -    ENTITY CLASS ADDRESS             @PC002PY 28000000
         AGO   .RDEF252                                        @PC002PY 28050000
.RDEF250 ANOP                                                  @PC002PY 28100000
         DC    A(ICH1&SYSNDX) -    ENTITY CLASS ADDRESS        @ZA56979 28150000
         AGO   .RDEF252                                        @PC002PY 28200000
.RDEF251 ANOP                                                  @PC002PY 28250000
         DC    A(0) -         ENTITY CLASS ADDRESS FIELD       @PC002PY 28300000
.RDEF252 ANOP                                                  @PC002PY 28350000
.* PRODUCE MENTITY OR MENTX ADDRESS                                @M3C 28400000
         AIF   ('&CMMENT' EQ '').RDEF253 NO MENTITY                @M3C 28450000
         AIF   ('&CMMENT'(1,1) EQ '(').RDEF253                     @M3C 28500000
         DC    A(&CMMENT) -   MENTITY ADDRESS                      @M3C 28550000
         AGO   .RDEF254                                        @PC002PY 28600000
.RDEF253 ANOP                                                  @PC002PY 28650000
         DC    A(0) -         MENTITY ADDRESS FIELD            @PC002PY 28700000
.RDEF254 ANOP                                                  @PC002PY 28750000
.* PRODUCE MVOLSER ADDRESS                                     @PC002PY 28800000
         AIF   ('&MVOLSER' EQ '').RDEF255 NO MVOLSER           @PC002PY 28850000
         AIF   ('&MVOLSER'(1,1) EQ '(').RDEF255                @PC002PY 28900000
         DC    A(&MVOLSER) -  ENTITY MVOLSER ADDRESS           @PC002PY 28950000
         AGO   .RDEF256                                        @PC002PY 29000000
.RDEF255 ANOP                                                  @PC002PY 29050000
         DC    A(0) -         ENTITY MVOLSER ADDRESS FIELD     @PC002PY 29100000
.RDEF256 ANOP                                                  @PC002PY 29150000
.* PRODUCE ACEE ADDRESS                                        @PC003PY 29200000
         AIF   ('&ACEE' EQ '').RDEF257 NO ACEE                 @PC003PY 29250000
         AIF   ('&ACEE'(1,1) EQ '(').RDEF257                   @PC003PY 29300000
         DC    A(&ACEE) -     ACEE ADDRESS                     @PC003PY 29350000
         AGO   .RDEF258                                        @PC003PY 29400000
.RDEF257 ANOP                                                  @PC003PY 29450000
         DC    A(0) -         ACEE ADDRESS FIELD               @PC003PY 29500000
.RDEF258 ANOP                                                  @PC003PY 29550000
.* PRODUCE UNIT ADDRESS.                                           @L4A 29600000
         AIF   ('&UNIT' EQ '').RDEF259                             @L4A 29650000
         AIF   ('&UNIT'(1,1) EQ '(').RDEF259                       @L4A 29700000
         DC    A(&UNIT) - UNIT ADDRESS.                            @L4A 29750000
         AGO   .RDEF25A                                            @L4A 29800000
.RDEF259 ANOP  ,                                                   @L4A 29850000
         DC    A(0) -         NO UNIT ADDRESS FIELD.               @L4A 29900000
.RDEF25A ANOP  ,                                                   @L4A 29950000
.* PRODUCE UACC VALUE.                                             @L4A 30000000
         AIF   ('&UACC' EQ '').RDEF25B                             @L4A 30050000
         AIF   ('&UACC'(1,1) EQ '(').RDEF25B                       @L4A 30100000
&UACC0   SETB  ('&UACC' EQ 'ALTER')                                @L4A 30150000
&UACC1   SETB  ('&UACC' EQ 'CONTROL')                              @L4A 30200000
&UACC2   SETB  ('&UACC' EQ 'UPDATE')                               @L4A 30250000
&UACC3   SETB  ('&UACC' EQ 'READ')                                 @L4A 30300000
&UACC4   SETB  ('&UACC' EQ 'EXECUTE')                              @M1A 30350000
&UACC5   SETB  0                                                   @L4A 30400000
&UACC6   SETB  0                                                   @L4A 30450000
&UACC7   SETB  ('&UACC' EQ 'NONE' OR '&UACC' EQ 'EXECUTE')         @M1A 30487500
&UACCVAL SETA  128*&UACC0+64*&UACC1+32*&UACC2+16*&UACC3+8*&UACC4+1*&UACX30525000
               C7                                                  @M1A 30562500
         DC    AL1(&UACCVAL) - UACC VALUE.                         @L4A 30600000
         AGO   .RDEF25C                                            @L4A 30650000
.RDEF25B ANOP  ,                                                   @L4A 30700000
         DC    AL1(0) -       NO UACC VALUE FIELD.                 @L4A 30750000
.RDEF25C ANOP  ,                                                   @L4A 30800000
.* PRODUCE LEVEL VALUE.                                            @L4A 30850000
         AIF   ('&LEVEL' EQ '').RDEF25D                            @L4A 30900000
         AIF   ('&LEVEL'(1,1) EQ '(').RDEF25D                      @L4A 30950000
         DC    AL1(&LEVEL) - LEVEL VALUE.                          @L4A 31000000
         AGO   .RDEF25E                                            @L4A 31050000
.RDEF25D ANOP  ,                                                   @L4A 31100000
         DC    AL1(0) -       NO LEVEL NUMBER PRESENT.             @L4A 31150000
.RDEF25E ANOP  ,                                                   @L4A 31200000
.* PRODUCE AUDIT VALUE.                                            @L4A 31250000
         AIF   ('&AUDIT' EQ '').RDEF25F                            @L4A 31300000
         AIF   ('&AUDITRG' NE '').RDEF25F                          @L5A 31350000
         DC    AL1(&AUDITVL) - AUDIT INDICATOR.                    @L4A 31400000
         AGO   .RDEF25G                                            @L4A 31450000
.RDEF25F ANOP  ,                                                   @L4A 31500000
         DC    AL1(0) -       NO AUDIT INDICATOR PRESENT.          @L4A 31550000
.RDEF25G ANOP  ,                                                   @L4A 31600000
.* PRODUCE SECOND FLAG BYTE                                        @L5A 31650000
.* INITIALIZE BIT SET VARIABLES                                         31700000
&BIT0    SETA  0                                                   @L5A 31750000
&BIT1    SETA  0                                                   @L5A 31800000
&BIT2    SETA  0                                                   @L5A 31850000
&BIT3    SETA  0                                                   @L6A 31900000
&BIT4    SETA  0                                                   @L6A 31950000
&BIT5    SETA  0                                                   @L6A 32000000
&BIT6    SETA  0                                                   @L6A 32050000
&BIT7    SETA  0                                                   @L6A 32100000
         AIF   ('&RACFIND' EQ '').RDEF25J                          @L5A 32150000
&BIT0    SETA  1              RACFIND CODED                        @L5A 32200000
         AIF   ('&RACFIND' EQ 'NO').RDEF25J                        @L5A 32250000
&BIT1    SETA  1              RACFIND=YES                          @L5A 32300000
.RDEF25J ANOP                                                      @L5A 32350000
         AIF   ('&CHKAUTH' NE 'YES').RDEF25K     DEFAULT IS NO     @L5A 32400000
&BIT2    SETA  1              CHKAUTH=YES                          @L5A 32450000
.RDEF25K ANOP                                                      @L5A 32500000
         AIF   (&RLVL LE 2).RDEF25P     BYPASS CODE IF 1.6 VERSION @L7A 32550000
         AIF   ('&DSTYPE' NE 'T').RDEF25N                          @L7A 32600000
&BIT3    SETA  1              DSTYPE=T                             @L7A 32650000
.RDEF25N ANOP                                                      @L7A 32700000
         AIF   ('&ERASE' NE 'YES').RDEF25O                         @L7A 32750000
&BIT4    SETA  1              ERASE=YES                            @L7A 32800000
.RDEF25O ANOP                                                      @L7A 32850000
         AIF   ('&MGENER' NE 'YES').RDEF25P                        @L7A 32900000
&BIT5    SETA  1              MGENER=YES                           @L7A 32950000
.RDEF25P ANOP                                                      @L7A 33000000
         AIF   ('&WARNING' NE 'YES').RDEF25L                       @L6A 33050000
&BIT6    SETA  1              WARNING=YES                          @L6A 33100000
.RDEF25L ANOP  ,                                                   @L6A 33150000
         AIF   ('&GENERIC' NE 'YES').RDEF25M                       @L6A 33200000
&BIT7    SETA  1              GENERIC=YES                          @L6A 33250000
.RDEF25M ANOP  ,                                                   @L6A 33300000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'         @L7A 33350000
.* PRODUCE OWNER ADDRESS.                                          @L4A 33400000
         AIF   ('&OWNER' EQ '').RDEF25H                            @L4A 33450000
         AIF   ('&OWNER'(1,1) EQ '(').RDEF25H                      @L4A 33500000
         DC    A(&OWNER) - OWNER ADDRESS.                          @L4A 33550000
         AGO   .RDEF260                                            @L4A 33600000
.RDEF25H ANOP  ,                                                   @L4A 33650000
         DC    A(0) -         NO OWNER ADDRESS FIELD.              @L4A 33700000
.RDEF260 ANOP  ,                                                   @L4A 33750000
.* PRODUCE DATA ADDRESS.                                           @L4A 33800000
         AIF   ('&DATA' EQ '').RDEF261                             @L4A 33850000
         AIF   ('&DATA'(1,1) EQ '(').RDEF261                       @L4A 33900000
         DC    A(&DATA) - DATA ADDRESS.                            @L4A 33950000
         AGO   .RDEF262                                            @L4A 34000000
.RDEF261 ANOP  ,                                                   @L4A 34050000
         DC    A(0) -         NO DATA ADDRESS FIELD.               @L4A 34100000
.RDEF262 ANOP  ,                                                   @L4A 34150000
.******************************************************            @T1A 34200000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 34250000
.* MACRO, INSTLN AND ENTITY ARE PRODUCED HERE AS                   @T1A 34300000
.* 31-BIT ADDRESSES.                                               @T1A 34350000
.******************************************************            @T1A 34400000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF267               @M3C 34450000
.* PRODUCE INSTALLATION DATA ADDRESS                               @T1A 34500000
         AIF   ('&INSTLN' EQ '' OR                                     *34550000
               '&INSTLN(1)' NE '&INSTLN').RDEF263                  @T1A 34600000
         DC    A(&INSTLN)          INSTALLATION DATA ADDRESS       @T1A 34650000
         AGO   .RDEF264                                            @T1A 34700000
.RDEF263 ANOP                                                      @T1A 34750000
         DC    A(0)           INSTALLATION DATA ADDRESS            @T1A 34800000
.RDEF264 ANOP                                                      @T1A 34850000
.* PRODUCE ENTITY NAME ADDRESS                                     @T1A 34900000
         AIF   ('&CMENTY1' EQ '').RDEF265                         @M3C  34950000
         AIF   ('&CMENTY1'(1,1) EQ '(').RDEF265                    @M3C 35000000
         DC    A(&CMENTY1)    ENTITY NAME ADDRESS                  @M3C 35050000
         AGO   .RDEFY10                                            @L7A 35100000
.RDEF265 ANOP                                                      @T1A 35150000
         DC    A(0)           ENTITY NAME ADDR FIELD               @T1A 35200000
         AGO   .RDEFY10                                            @L7A 35250000
.RDEF267 ANOP                                                      @T1A 35300000
         AIF   (&RLVL LE 2).RDEFR90  BYPASS CODE IF 1.6 VERSION    @L7A 35350000
         DC    A(0)           31 BIT INSTALLATION DATA ADDRESS     @L7A 35400000
         DC    A(0)           31 BIT ENTITY NAME ADDRESS           @L7A 35450000
.RDEFY10 ANOP                                                      @L7A 35500000
         AIF   (&RLVL LE 2).RDEFR90  BYPASS CODE IF 1.6 VERSION    @L7A 35550000
.* PRODUCE ACCESS LEVEL ADDRESS                                    @L7A 35600000
         AIF   ('&ACCLVL' EQ '').RDEFR05                           @L7A 35650000
         AIF   (T'&ACCLVL(1) EQ 'O').RDEFR05                       @L7A 35700000
         AIF   ('&ACCLVL(1)'(1,1) EQ '(').RDEFR05                  @L7A 35750000
         DC    A(&ACCLVL(1))  ACCESS LEVEL ADDRESS PART ONE        @L7A 35800000
         AGO   .RDEFR07                                            @L7A 35850000
.RDEFR05 ANOP                                                      @L7A 35900000
         DC    A(0)           ACCESS LEVEL ADDRESS PART ONE        @L7A 35950000
.RDEFR07 ANOP                                                      @L7A 36000000
         AIF   (T'&ACCLVL(2) EQ 'O').RDEFR0A                       @L7A 36050000
         AIF   ('&ACCLVL(2)'(1,1) EQ '(').RDEFR0A                  @L7A 36100000
         DC    A(&ACCLVL(2))  ACCESS LEVEL ADDRESS PART TWO        @L7A 36150000
         AGO   .RDEFR15                                            @L7A 36200000
.RDEFR0A ANOP                                                      @L7A 36250000
         DC    A(0)           ACCESS LEVEL ADDRESS PART TWO        @L7A 36300000
.RDEFR15 ANOP                                                      @L7A 36350000
.* PRODUCE SECURITY LEVEL ADDRESS                                  @L7A 36400000
         AIF   ('&SECLVL' EQ '').RDEFR20                           @L7A 36450000
         AIF   ('&SECLVL'(1,1) EQ '(').RDEFR20                     @L7A 36500000
         DC    A(&SECLVL)   SECURITY LEVEL ADDRESS                 @L7A 36550000
         AGO   .RDEFR25                                            @L7A 36600000
.RDEFR20 ANOP                                                      @L7A 36650000
         DC    A(0)           SECURITY LEVEL ADDRESS               @L7A 36700000
.RDEFR25 ANOP                                                      @L7A 36750000
.* PRODUCE DEPARTMENT LIST ADDRESS                                 @L7A 36800000
         AIF   ('&CATGORY' EQ '').RDEFR30                          @L7A 36850000
         AIF   ('&CATGORY'(1,1) EQ '(').RDEFR30                    @L7A 36900000
         DC    A(&CATGORY)  DEPARTMENT LIST ADDRESS                @L7A 36950000
         AGO   .RDEFR35                                            @L7A 37000000
.RDEFR30 ANOP                                                      @L7A 37050000
         DC    A(0)           DEPARTMENT LIST ADDRESS              @L7A 37100000
.RDEFR35 ANOP                                                      @L7A 37150000
.* PRODUCE EXPIRATION DATE OR RETENTION PERIOD ADDRESS             @L7A 37200000
         AIF   ('&RETPD' EQ '').RDEFR40                            @L7A 37250000
         AIF   ('&RETPD'(1,1) EQ '(').RDEFR40                      @L7A 37300000
         DC    A(&RETPD)      RETENTION PERIOD ADDRESS             @L7A 37350000
         AGO   .RDEFR47                                            @L7A 37400000
.RDEFR40 ANOP                                                      @L7A 37450000
         AIF   ('&EXPDT' EQ '').RDEFR42                            @L8A 37500000
         AIF   ('&EXPDT'(1,1) EQ '(').RDEFR42                      @L8A 37550000
         DC    A(&EXPDT)      EXPIRATION DATE ADDRESS              @L7A 37600000
         AGO   .RDEFR47                                            @L7A 37650000
.RDEFR42 ANOP                                                      @L8A 37658300
         AIF   ('&EXPDTX' EQ '').RDEFR45                           @L8A 37666600
         AIF   ('&EXPDTX'(1,1) EQ '(').RDEFR45                     @L8A 37674900
         DC    A(&EXPDTX)     EXTENDED EXPIRATION DATE ADDRESS     @L8A 37683200
         AGO   .RDEFR47                                            @L8A 37691500
.RDEFR45 ANOP                                                      @L7A 37700000
         DC    A(0)       EXT/EXP DATE OR RET PERIOD ADDRESS       @L7A 37750000
.RDEFR47 ANOP                                                      @L7A 37800000
.* PRODUCE FILE SEQUENCE NUMBER                                    @L7A 37850000
         AIF   ('&FILESEQ' EQ '').RDEFR50                          @L7A 37900000
         AIF   ('&FILESEQ'(1,1) EQ '(').RDEFR50                    @L7A 37950000
         DC    AL2(&FILESEQ)     FILE SEQUENCE NUMBER              @L7A 38000000
         AGO   .RDEFR55                                            @L7A 38050000
.RDEFR50 ANOP                                                      @L7A 38100000
         DC    AL2(0)           FILE SEQUENCE NUMBER               @L7A 38150000
.RDEFR55 ANOP                                                      @L7A 38200000
.* PRODUCE TAPE FLAG                                               @L7A 38250000
&BIT0    SETA  0                                                   @L7A 38300000
&BIT1    SETA  0                                                   @L7A 38350000
&BIT7    SETA  0                                                   @L7A 38400000
         AIF   ('&TAPELBL' EQ '' OR '&TAPELBL' EQ 'STD').RDEFR65   @L7A 38450000
         AIF   ('&TAPELBL' NE 'BLP').RDEFR60                       @L7A 38500000
&BIT0    SETA  1                                                   @L7A 38550000
         AGO   .RDEFR65                                            @L7A 38600000
.RDEFR60 ANOP                                                      @L7A 38650000
&BIT1    SETA  1                                                   @L7A 38700000
.RDEFR65 ANOP                                                      @L7A 38750000
         AIF   ('&RETPD' NE '' OR '&EXPDT' EQ '').RDEFR70          @L7A 38800000
&BIT7    SETA  1                                                   @L7A 38850000
         AGO   .RDEFR74                                            @L8A 38875000
.RDEFR70 ANOP                                                      @L7A 38900000
         AIF   ('&EXPDTX' EQ '').RDEFR74                           @L8A 38920000
&BIT6    SETA  1                                                   @L8A 38940000
&BIT7    SETA  1                                                   @P6A 38950000
.RDEFR74 ANOP                                                      @L8A 38960000
         DC    B'&BIT0&BIT1.0000&BIT6&BIT7'                        @L8A 38980000
         DC    X'00' -        RESERVED                             @L7A 39000000
.RDEFR77 ANOP                                                      @L7A 39050000
.* PRODUCE MCLASS ADDRESS                                          @L7A 39100000
         AIF   ('&MCLASS' EQ '').RDEFR79                           @L7A 39150000
         AIF   ('&MCLASS'(1,1) EQ '(').RDEFR79                     @L7A 39200000
         AIF   ('&MCLASS'(1,1) EQ '''').RDEFR78                    @L7A 39250000
         DC    A(&MCLASS) - MODEL CLASS ADDRESS                    @L7A 39300000
         AGO   .RDEFR80                                            @L7A 39350000
.RDEFR78 ANOP                                                      @L7A 39400000
         DC    A(ICH2&SYSNDX) - MODEL CLASS ADDRESS                @L7A 39450000
         AGO   .RDEFR80                                            @L7A 39500000
.RDEFR79 ANOP                                                      @L7A 39550000
         DC    A(0) - MODEL CLASS ADDRESS                          @L7A 39600000
.RDEFR80 ANOP                                                      @L7A 39650000
.* PRODUCE NOTIFY ID ADDRESS                                       @L7A 39700000
         AIF   ('&NOTIFY' EQ '').RDEFR83                           @L7A 39750000
         AIF   ('&NOTIFY'(1,1) EQ '(').RDEFR83                     @L7A 39800000
         DC    A(&NOTIFY) - NOTIFY ID ADDRESS                      @L7A 39850000
         AGO   .RDEFR85                                            @L7A 39900000
.RDEFR83 ANOP                                                      @L7A 39950000
         DC    A(0) - NOTIFY ID ADDRESS                            @L7A 40000000
.RDEFR85 ANOP                                                      @L7A 40100000
         AIF   (&RLVL GE 4).RDEFR86      V1.8 OR HIGHER            @M1A 40116600
.* RESERVE FOUR FULLWORDS FOR FUTURE EXPANSION                     @L7A 40133200
         DC    4A(0) - RESERVED                                    @L7A 40150000
         AGO   .RDEFR90                                            @M1A 40151100
.RDEFR86 ANOP                                                      @M1A 40152200
.* PRODUCE STORAGE CLASS ADDRESS                                   @M1A 40153300
         AIF   ('&STORCLA' EQ '').RDEFR87                          @M1A 40154400
         AIF   ('&STORCLA'(1,1) EQ '(').RDEFR87                    @M1A 40155500
         DC    A(&STORCLA) - STORAGE CLASS ADDRESS                 @M1A 40156600
         AGO   .RDEFR88                                            @M1A 40157700
.RDEFR87 ANOP                                                      @M1A 40158800
         DC    A(0) - STORAGE CLASS ADDRESS                        @M1A 40159900
.RDEFR88 ANOP                                                      @M1A 40161000
.* PRODUCE MANAGEMENT CLASS ADDRESS                                @M1A 40162100
         AIF   ('&MGMTCLA' EQ '').RDEFR89                          @M1A 40163200
         AIF   ('&MGMTCLA'(1,1) EQ '(').RDEFR89                    @M1A 40164300
         DC    A(&MGMTCLA) - MANAGEMENT CLASS ADDRESS              @M1A 40165400
         AGO   .RDEFR8A                                            @M1A 40166500
.RDEFR89 ANOP                                                      @M1A 40167600
         DC    A(0) - MANAGEMENT CLASS ADDRESS                     @M1A 40168700
.RDEFR8A ANOP                                                      @M1A 40169800
.* PRODUCE RESOURCE OWNER ADDRESS                                  @M1A 40170900
         AIF   ('&RESOWN' EQ '').RDEFR8B                           @M1A 40172000
         AIF   ('&RESOWN'(1,1) EQ '(').RDEFR8B                     @M1A 40173100
         DC    A(&RESOWN) - RESOURCE OWNER ADDRESS                 @M1A 40174200
         AGO   .RDEFR8C                                            @M1A 40175300
.RDEFR8B ANOP                                                      @M1A 40176400
         DC    A(0) - RESOURCE OWNER ADDRESS                       @M1A 40177500
.RDEFR8C ANOP                                                      @M1A 40178600
.* PRODUCE ENVIRONMENT FLAG BYTE                                   @M2C 40179700
&BIT0    SETA  0                                                   @M3A 40180200
         AIF   ('&ENVIR' EQ '').RDEFR8D                            @M1A 40180800
&BIT0    SETA  1                                    SET ENVIR FLAG @M3A 40182400
.RDEFR8D ANOP                                                      @M1A 40184100
&BIT1    SETA  &COPENTY                                            @M3A 40184800
&BIT2    SETA  &COPMENT                                            @M3A 40185500
&BIT3    SETA  &COPNWNM                                            @M3A 40186200
         DC    B'&BIT0&BIT1&BIT2&BIT3.0000' - SET ENVIRONMENT FLAG @M3A 40186900
         DC    XL3'0'           RESERVED                           @M1A 40187600
.RDEFR9D ANOP                                                  @YA12773 40188500
         AIF   (&RLVL LT 6).RDEFR90                                @M3A 40189600
.* PRODUCE DDNAME ADDRESS                                      @YA12773 40190700
         AIF   ('&DDNAME' EQ '').RDEFR9E                       @YA12773 40191800
         AIF   ('&DDNAME'(1,1) EQ '(').RDEFR9E                 @YA12773 40192900
         DC    A(&DDNAME) - DDNAME ADDRESS                     @YA12773 40194000
         AGO   .RDEFR9F                                            @M3C 40195100
.RDEFR9E ANOP                                                  @YA08770 40196200
         DC    A(0) - DDNAME ADDRESS                           @YA12773 40197300
.RDEFR9F ANOP                                                      @M3A 40200000
         AIF   (&RLVL GE 7).RDEFR9G                                @M3A 40203300
         DC    4A(0)                                               @M3A 40206600
         AGO   .RDEFR90                                            @M3A 40209900
.RDEFR9G ANOP                                                      @M3A 40213200
.* PRODUCE SECLABL ADDRESS                                         @M2A 40216500
         AIF   ('&SECLABL' EQ '').RDEFR9A                          @M2A 40219800
         AIF   ('&SECLABL'(1,1) EQ '(').RDEFR9A                    @M2A 40223100
         DC    A(&SECLABL) - SECURITY LABEL ADDRESS                @M2A 40226400
         AGO   .RDEFRA0                                            @M2A 40229700
.RDEFR9A ANOP                                                      @M2A 40233000
         DC    A(0) - SECURITY LABEL ADDRESS                       @M2A 40236300
.RDEFRA0 ANOP                                                      @M2A 40239600
         DC    3A(0) - RESERVED                                @YA12773 40242900
.RDEFR90 ANOP                                                      @P2M 40246200
.* IF CLASS NAME SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM       40250000
         AIF   ('&CLASS' EQ '').RDEF268                        @PC002PY 40300000
         AIF   ('&CLASS'(1,1) NE '''').RDEF268                 @PC002PY 40350000
&CLNGTH  SETA  K'&CLASS-2                                      @PC002PY 40400000
ICH1&SYSNDX EQU   *                                            @ZA56979 40450000
         DC    AL1(&CLNGTH) - CLASS NAME LENGTH                @PC002PY 40500000
         DC    CL9&CLASS    - CLASS NAME                       @PC002PY 40550000
.RDEF268 ANOP                                                  @PC002PY 40600000
.* IF MCLASS NAME SPECIFIED EXPLICITYLY, PRODUCE IT BELOW LIST     @L7A 40650000
         AIF   ('&MCLASS' EQ '').RDEFFF                            @L7A 40700000
         AIF   ('&MCLASS'(1,1) NE '''').RDEFFF                     @L7A 40750000
&CLNGTH  SETA  K'&MCLASS-2                                         @L7A 40800000
ICH2&SYSNDX EQU *                                                  @L7A 40850000
         DC    AL1(&CLNGTH) - MCLASS NAME LENGTH                   @L7A 40900000
         DC    CL9&MCLASS   - MCLASS NAME                          @L7A 40950000
.RDEFFF  ANOP                                                      @L7A 41000000
         AIF   (&MFFLAG).RDEF330                                        41050000
         MEXIT                                                          41100000
.* END OF LIST FORM GENERATION                                          41150000
.RDEF269 ANOP                                                           41200000
.* TEST FOR OTHER MACRO FORMS                                           41250000
         AIF   ('&MF' EQ 'S').RDEF270                                   41300000
         AIF   ('&MF(1)' NE 'E' AND                                    -41333300
                '&MF(1)' NE 'M').ERR06                             @M2C 41366600
         AGO   .RDEF345                                                 41400000
.RDEF270 ANOP                                                           41450000
.ERTN06  ANOP                                                           41500000
.* PRODUCE STANDARD FORM                                                41550000
&SYMBOL  DS    0H                                                       41600000
&MFFLAG  SETB  1              SET TRUE FOR STANDARD FORM PASS THRU LIST 41650000
.*                            FORM DEFINITION ABOVE                     41700000
.* PRODUCE LOGIC TO MODIFY IN-LINE LIST FORM                            41750000
.* PRODUCE INSTALLATION DATA                                            41800000
         AIF   ('&INSTLN(1)' EQ '&INSTLN').RDEF271                      41850000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF27A               @M3C 41900000
         ST    &INSTLN(1),ICH0&SYSNDX+48    INSTALLATION DATA ADDR @T1A 41950000
         AGO   .RDEF271                                            @T1A 42000000
.RDEF27A ANOP                                                      @T1A 42050000
         STCM  &INSTLN(1),7,ICH0&SYSNDX+1 - INSTALLATION DATA ADDRESS   42100000
.RDEF271 ANOP                                                           42150000
         AIF   ('&CMENTY1' EQ '').RDEF280                          @M3C 42190000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF275               @M3C 42230000
         AIF   ('&CMENTY1'(1,1) NE '(').RDEF280                    @M3C 42270000
         ST    &CMENTY1,ICH0&SYSNDX+52      STORE ENTITY NAME ADDR @M3C 42310000
         AGO   .RDEF280                                            @T1A 42350000
.RDEF275 ANOP                                                      @T1A 42400000
         AIF   ('&CMENTY1'(1,1) NE '(').RDEF280                    @M3C 42433300
         STCM  &CMENTY1,7,ICH0&SYSNDX+5     STORE ENTITY NAME ADDR @M3A 42466600
.RDEF280 ANOP                                                           42500000
         AIF   ('&OLDVOL' EQ '').RDEF300                                42550000
         AIF   ('&OLDVOL'(1,1) NE '(').RDEF300                          42600000
         ST    &OLDVOL(1),ICH0&SYSNDX+8 - STORE OLDVOL ADDR IN LIST     42650000
         AGO   .RDEF310                                                 42700000
.RDEF300 ANOP                                                           42750000
         AIF   ('&CMNWNM' EQ '').RDEF310                           @M3C 42800000
         AIF   ('&CMNWNM'(1,1) NE '(').RDEF310                     @M3C 42850000
         ST    &CMNWNM,ICH0&SYSNDX+8 - STORE NEW NAME IN LIST      @M3C 42900000
.RDEF310 ANOP                                                           42950000
         AIF   ('&VOLSER' EQ '').RDEF320                                43000000
         AIF   ('&VOLSER'(1,1) NE '(').RDEF320                          43050000
         ST    &VOLSER(1),ICH0&SYSNDX+12 - STORE VOLSER ADDR IN LIST    43100000
.RDEF320 ANOP                                                           43150000
         AIF   ('&CLASS' EQ '').RDEF321                        @PC002PY 43200000
         AIF   ('&CLASS'(1,1) NE '(').RDEF321                  @PC002PY 43250000
         ST    &CLASS(1),ICH0&SYSNDX+16 - STORE CLASS ADDR IN LIST      43300000
.RDEF321 ANOP                                                  @PC002PY 43350000
         AIF   ('&CMMENT' EQ '').RDEF322                           @M3C 43400000
         AIF   ('&CMMENT'(1,1) NE '(').RDEF322                     @M3C 43450000
         ST    &CMMENT,ICH0&SYSNDX+20 - STORE ADDR IN LIST         @M3C 43500000
.RDEF322 ANOP                                                  @PC002PY 43550000
         AIF   ('&MVOLSER' EQ '').RDEF323                      @PC002PY 43600000
         AIF   ('&MVOLSER'(1,1) NE '(').RDEF323                @PC002PY 43650000
         ST    &MVOLSER(1),ICH0&SYSNDX+24 - STORE MVOLSER ADDR IN LIST  43700000
.RDEF323 ANOP                                                  @PC003PY 43750000
         AIF   ('&ACEE' EQ '').RDEF324                         @PC003PY 43800000
         AIF   ('&ACEE'(1,1) NE '(').RDEF324                   @PC003PY 43850000
         ST    &ACEE(1),ICH0&SYSNDX+28 - STORE ACEE ADDR IN LIST        43900000
.RDEF324 ANOP                                                  @PC003PY 43950000
         AIF   ('&UNIT' EQ '').RDEF325                             @L4A 44000000
         AIF   ('&UNIT'(1,1) NE '(').RDEF325                       @L4A 44050000
         ST    &UNIT(1),ICH0&SYSNDX+32 - STORE UNIT ADDR IN LIST.  @L4A 44100000
.RDEF325 ANOP  ,                                                   @L4A 44150000
         AIF   ('&UACC' EQ '').RDEF326                             @L4A 44200000
         AIF   ('&UACC'(1,1) NE '(').RDEF326                       @L4A 44250000
         STC   &UACC(1),ICH0&SYSNDX+36 - STORE UACC VALUE IN LIST. @L4A 44300000
.RDEF326 ANOP  ,                                                   @L4A 44350000
         AIF   ('&LEVEL' EQ '').RDEF327                            @L4A 44400000
         AIF   ('&LEVEL'(1,1) NE '(').RDEF327                      @L4A 44450000
         STC   &LEVEL(1),ICH0&SYSNDX+37 - STORE LEVEL VALUE.       @L4A 44500000
.RDEF327 ANOP  ,                                                   @L4A 44550000
         AIF   ('&AUDITRG' EQ '').RDEF328                          @L5A 44600000
         STC   &AUDITRG,ICH0&SYSNDX+38 - STORE AUDIT VALUE.        @L5A 44650000
.RDEF328 ANOP  ,                                                   @L4A 44700000
         AIF   ('&OWNER' EQ '').RDEF329                            @L4A 44750000
         AIF   ('&OWNER'(1,1) NE '(').RDEF329                      @L4A 44800000
         ST    &OWNER(1),ICH0&SYSNDX+40 - STORE OWNER ADDRESS.     @L4A 44850000
.RDEF329 ANOP  ,                                                   @L4A 44900000
         AIF   ('&DATA' EQ '').RDEF32A                             @L4A 44950000
         AIF   ('&DATA'(1,1) NE '(').RDEF32A                       @L4A 45000000
         ST    &DATA(1),ICH0&SYSNDX+44 - STORE DATA ADDRESS.       @L4A 45050000
.RDEF32A ANOP  ,                                                   @L4A 45100000
         AIF   (&RLVL LE 2).RDEF32X  BYPASS CODE IF 1.6 VERSION    @M1A 45150000
         AIF   ('&ACCLVL' EQ '').RDEF32I                           @L7A 45200000
         AIF   (T'&ACCLVL(1) EQ 'O').RDEF32H                       @L7A 45250000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RDEF32H                  @L7A 45300000
         ST    &ACCLVL(1),ICH0&SYSNDX+56 - STORE ACCESS PART 1 ADR @L7A 45350000
.RDEF32H ANOP                                                      @L7A 45400000
         AIF   (T'&ACCLVL(2) EQ'O').RDEF32I                        @L7A 45450000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RDEF32I                  @L7A 45500000
         ST    &ACCLVL(2),ICH0&SYSNDX+60 - STORE ACCESS PART 2 ADR @L7A 45550000
.RDEF32I ANOP                                                      @L7A 45600000
         AIF   ('&SECLVL' EQ '').RDEF32J                           @L7A 45650000
         AIF   ('&SECLVL'(1,1) NE '(').RDEF32J                     @L7A 45700000
         ST    &SECLVL(1),ICH0&SYSNDX+64 - STORE SECLVL ADDRESS.   @L7A 45750000
.RDEF32J ANOP                                                      @L7A 45800000
         AIF   ('&CATGORY' EQ '').RDEF32K                          @L7A 45850000
         AIF   ('&CATGORY'(1,1) NE '(').RDEF32K                    @L7A 45900000
         ST    &CATGORY(1),ICH0&SYSNDX+68 - STORE CATGORY ADDRESS. @L7A 45950000
.RDEF32K ANOP                                                      @L7A 46000000
         AIF   ('&EXPDT' EQ '').RDF32L                             @L8A 46050000
         AIF   ('&EXPDT'(1,1) NE '(').RDEF32M                      @L7A 46100000
         ST    &EXPDT(1),ICH0&SYSNDX+72 - STORE EXP DATE ADDRESS.  @L7A 46150000
         AGO   .RDEF32M                                            @L7A 46200000
.RDF32L  ANOP                                                      @L8A 46208300
         AIF   ('&EXPDTX' EQ '').RDEF32L                           @L8A 46216600
         AIF   ('&EXPDTX'(1,1) NE '(').RDEF32M                     @L8A 46224900
         ST    &EXPDTX(1),ICH0&SYSNDX+72 - STORE EXTD DATE ADDRESS.@L8A 46233200
         AGO   .RDEF32M                                            @L8A 46241500
.RDEF32L ANOP                                                      @L7A 46250000
         AIF   ('&RETPD' EQ '').RDEF32M                            @L7A 46300000
         AIF   ('&RETPD'(1,1) NE '(').RDEF32M                      @L7A 46350000
         ST    &RETPD(1),ICH0&SYSNDX+72 - STORE RETENTION ADDRESS. @L7A 46400000
.RDEF32M ANOP                                                      @L7A 46450000
         AIF   ('&FILESEQ' EQ '').RDEF32N                          @L7A 46500000
         AIF   ('&FILESEQ'(1,1) NE '(').RDEF32N                    @L7A 46550000
         STH   &FILESEQ(1),ICH0&SYSNDX+76 - STORE FILESEQ ADDRESS. @L7A 46600000
.RDEF32N ANOP                                                      @L7A 46650000
         AIF   ('&MCLASS' EQ '').RDEF32O                           @L7A 46700000
         AIF   ('&MCLASS'(1,1) NE '(').RDEF32O                     @L7A 46750000
         ST    &MCLASS(1),ICH0&SYSNDX+80 - STORE MCLASS ADDRESS    @L7A 46800000
.RDEF32O ANOP                                                      @L7A 46850000
         AIF   ('&NOTIFY' EQ '').RDEF32P                           @L7A 46900000
         AIF   ('&NOTIFY'(1,1) NE '(').RDEF32P                     @L7A 46950000
         ST    &NOTIFY(1),ICH0&SYSNDX+84 - STORE NOTIFY ID ADDRESS @L7A 47000000
.RDEF32P ANOP                                                      @L7A 47050000
         AIF   (&RLVL LT 4).RDEF32X           LOWER THAN V1.8      @M1A 47052100
         AIF   ('&STORCLA' EQ '').RDEF32Q                          @M1A 47054200
         AIF   ('&STORCLA'(1,1) NE '(').RDEF32Q                    @M1A 47056300
         ST    &STORCLA(1),ICH0&SYSNDX+88 - STORE STORAGE CLASS    @M1A 47058400
.RDEF32Q ANOP                                                      @M1A 47060500
         AIF   ('&MGMTCLA' EQ '').RDEF32R                          @M1A 47062600
         AIF   ('&MGMTCLA'(1,1) NE '(').RDEF32R                    @M1A 47064700
         ST    &MGMTCLA(1),ICH0&SYSNDX+92 - STORE MANAGEMENT CLASS @M1A 47066800
.RDEF32R ANOP                                                      @M1A 47068900
         AIF   ('&RESOWN' EQ '').RDEF32U                           @M1A 47071000
         AIF   ('&RESOWN'(1,1) NE '(').RDEF32U                     @M1A 47073100
         ST    &RESOWN(1),ICH0&SYSNDX+96 - STORE RESOURCE OWNER    @M1A 47075200
.RDEF32U ANOP                                                  @YA12773 47077300
         AIF   ('&DDNAME' EQ '').RDEF32S                       @YA12773 47079400
         AIF   ('&DDNAME'(1,1) NE '(').RDEF32S                 @YA12773 47081500
         ST    &DDNAME(1),ICH0&SYSNDX+104 - STORE DDNAME ADDR  @YA12773 47083600
.RDEF32S ANOP                                                      @M1A 47085700
         AIF   ('&SECLABL' EQ '').RDEF32T                          @M2A 47087800
         AIF   ('&SECLABL'(1,1) NE '(').RDEF32T                    @M2A 47089900
         ST    &SECLABL(1),ICH0&SYSNDX+108 - STORE SECLABL ADDRESS @M2A 47092000
.RDEF32T ANOP                                                      @M2A 47094100
.RDEF32X ANOP                                                      @M1A 47096200
.* LIST FORM MODIFICATION COMPLETE - PRODUCE LIST FORM WITH BAL AROUND  47100000
         CNOP  0,4 -          ALIGN LIST FORM                           47150000
&BRPT    SETA  &PARMLEN+4                                          @L7A 47200000
         AIF   ('&CLASS' EQ '').RDEF32Y                            @M1A 47250000
         AIF   ('&CLASS'(1,1) NE '''' ).RDEF32Y                    @M1A 47300000
&BRPT    SETA  &BRPT+10                                            @L7A 47350000
.RDEF32Y ANOP                                                      @M1A 47400000
         AIF   ('&MCLASS' EQ '').RDEFBAL                           @L7A 47450000
         AIF   ('&MCLASS'(1,1) NE '''').RDEFBAL                    @L7A 47500000
&BRPT    SETA  &BRPT+10                                            @L7A 47550000
.RDEFBAL ANOP                                                      @L7A 47600000
         BAL   1,*+&BRPT      POINT REG 1 AT LIST FORM             @L7A 47650000
         AGO   .RDEF110                                            @L7A 47700000
.RDEF330 ANOP                                                           47750000
.***********************************************************       @T1A 47800000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 47850000
.* MACRO, SIMPLY EXIT RATHER THAN GOING TO THE RACF ROUTINE.       @T1A 47900000
.***********************************************************       @T1A 47950000
         AIF   (&ICHRAC).RDEF340                                   @T1A 48000000
.*                                                                 @M2A 48012500
.* IF MODIFY FORM (MF=M) THEN EXIT RATHER THAN GOING TO RACDEF     @M2A 48025000
         AIF   ('&MF(1)' EQ 'M').RDEF340                           @M2A 48037500
.* TAKE SVC                                                             48050000
         SVC   133           ISSUE RACDEF SVC                           48100000
         AIF   (NOT &RLVLCHK).RDEF340    GENERATE BRANCH LABEL     @L7A 48150000
&ICHRLVL DS    0H                                                  @L7A 48200000
.RDEF340 ANOP                                                      @T1A 48250000
         MEXIT                                                          48300000
.* PRODUCE EXECUTE FORM IF REQUESTED                                    48350000
.RDEF345 ANOP                                                           48400000
         AIF   (&ICHRAC).RDEF346                                   @T1A 48450000
&SYMBOL  IHBINNRA &MF(2) -    LOAD REG 1 WITH LIST FORM ADDRESS         48500000
         AGO   .RDEF34G                                            @T1A 48550000
.**********************************************************        @T1A 48600000
.*  IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE           @T1A 48650000
.*  MACRO, PICK UP THE ADDRESS OF THE RACDEF PARAMETER LIST        @T1A 48700000
.*  FROM THE RACROUTE PARAMETER LIST.                              @T1A 48750000
.**********************************************************        @T1A 48800000
.RDEF346 ANOP                                                      @T1A 48850000
         A     1,36(1)              POINT REG1 AT RACDEF LIST      @T1A 48900000
.RDEF34G ANOP                                                      @T1A 48950000
.* MODIFY INSTALLATION DATA                                             49000000
.* IF REQUESTED, CHECK SIZE OF LIST FORM VS EXECUTE FORM           @L7A 49050000
         AIF   (NOT &RLVLCHK).RLVL100                              @L7A 49100000
         CLI   0(1),&RLVLSZ(&RLVL)  LIST FORM LARGE ENOUGH?        @L7A 49150000
         BNL   *+12                 YES, CONTINUE                  @L7A 49200000
         LA    15,100               NO, SET BAD RETURN CODE        @L7A 49250000
         B     &ICHRLVL             DO NOT ISSUE THE SVC           @L7A 49300000
.RLVL100 ANOP  ,                                                   @L7A 49350000
.*                                                                 @L7A 49400000
         AIF   ('&INSTLN' EQ '').RDEF349                                49450000
         AIF   ('&INSTLN(1)' NE '&INSTLN').RDEF348                      49500000
         LA    0,&INSTLN - INSTALLATION DATA ADDRESS                    49550000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF347               @M3C 49600000
         ST    0,48(1)            STORE INSTALLATION DATA ADDR     @T1A 49650000
         AGO   .RDEF349                                            @T1A 49700000
.RDEF347 ANOP                                                      @T1A 49750000
         STCM  0,7,1(1) - STORE INSTALLATION DATA ADDRESS               49800000
         AGO   .RDEF349                                                 49850000
.RDEF348 ANOP                                                           49900000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF34F               @M3C 49950000
         ST    &INSTLN(1),48(1) STORE INSTALLATION DATA ADDR       @T1A 50000000
         AGO   .RDEF349                                            @T1A 50050000
.RDEF34F ANOP                                                      @T1A 50100000
         STCM  &INSTLN(1),7,1(1) - STORE INSTALLATION DATA ADDRESS      50150000
.RDEF349 ANOP                                                           50200000
.* MODIFY LIST FLAG FIELD AS REQUESTED                                  50250000
         AIF   ('&LCTYPE' EQ 'DELETE').RDF349A    For type to be   @M3C 50290000
         AIF   ('&LCTYPE' EQ 'ADDVOL').RDF349A    specified, alter @M3C 50330000
         AIF   ('&LCTYPE' EQ 'CHGVOL').RDF349A    the flags in     @M3C 50370000
         AIF   ('&LCTYPE' EQ 'DEFINE').RDF349A    modify form.     @M3A 50410000
         AIF   ('&SPECIAL' EQ 'YES').RDF349A                       @L4A 50450000
         AIF   ('&OLDVOL' NE '').RDF349A                           @L4A 50500000
         AIF   ('&CMNWNM' NE '').RDF349A                           @M3C 50550000
         AIF   ('&DSTYPE' NE 'N' AND '&DSTYPE' NE 'T' AND              -50600000
               '&DSTYPE' NE 'V' AND '&DSTYPE' NE 'M').RDEF410      @L7A 50650000
.RDF349A ANOP  ,                                                   @L4A 50700000
&BITA0   SETA  1                                                   @M3A 50725000
&BITA1   SETA  1                                                   @M3A 50750000
         AIF   ('&LCTYPE' NE 'CHGVOL').RDEF350                     @M3C 50775000
&BIT0    SETA  1                                                   @L4A 50800000
&BIT1    SETA  1                                                   @L4A 50850000
&BITA0   SETA  0                                                   @M3A 50870000
&BITA1   SETA  0                                                   @M3A 50890000
.RDEF350 ANOP                                                      @M3A 50910000
         AIF   ('&LCTYPE' NE 'DELETE').RDEF351                     @M3C 50930000
&BIT0    SETA  1                                                        50950000
&BITA0   SETA  0                                                   @M3A 50966600
&BITA1   SETA  0                                                   @M3A 50983200
.RDEF351 ANOP                                                      @M3A 50999800
         AIF   ('&LCTYPE' NE 'DEFINE').RDEF352                     @M3C 51016400
&BITA0   SETA  0                                                   @M3A 51033000
&BITA1   SETA  0                                                   @M3A 51049600
.RDEF352 ANOP                                                           51066200
         AIF   ('&LCTYPE' NE 'ADDVOL').RDEF360                     @M3C 51082800
&BIT1    SETA  1                                                        51100000
&BITA0   SETA  0                                                   @M3A 51116600
&BITA1   SETA  0                                                   @M3A 51133200
.RDEF360 ANOP                                                           51150000
         AIF   ('&OLDVOL' EQ '').RDEF370                                51200000
&BIT2    SETA  1                                                        51250000
.RDEF370 ANOP                                                           51300000
         AIF   ('&CMNWNM' EQ '').RDEF375                           @M3C 51350000
&BIT3    SETA  1                                                        51400000
.******************************************************            @T1A 51450000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 51500000
.* MACRO, THE PARAMETER LIST HAS 31-BIT ADDRESSING.                @T1A 51550000
.******************************************************            @T1A 51600000
.RDEF375 ANOP                                                      @T1A 51650000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF380               @M3C 51700000
&BIT4    SETA  1               31-BIT ADDRESSING IN PARAM LIST     @T1A 51750000
.RDEF380 ANOP                                                           51800000
         AIF   ('&DSTYPE' NE 'M').RDEF390                          @L4A 51850000
&BIT6    SETA  1                                                   @L4A 51900000
.RDEF390 ANOP  ,                                                   @L4A 51950000
         AIF   ('&DSTYPE' NE 'V').RDEF400                               52000000
&BIT5    SETA  1                                                        52050000
.RDEF400 ANOP                                                           52100000
         AIF   ('&SPECIAL' NE 'YES').RDEF401                     @L4A   52150000
&BIT7    SETA  1                                                 @L4A   52200000
.RDEF401 ANOP  ,                                                 @L4A   52250000
*                                SET FLAGS.                      @L4A   52300000
&BITA5   SETA  1                                                   @M3A 52318100
&BITA6   SETA  1                                                   @M3A 52336200
         AIF   ('&DSTYPE' EQ '').RDEF402                      @ZA56982  52354300
&BITA5   SETA  0                                                   @M3A 52372400
&BITA6   SETA  0                                                   @M3A 52390500
.RDEF402 ANOP                                                 @ZA56982  52408600
         AIF   ('&BITA0&BITA1&BIT2&BITA5&BITA6' EQ                     +52426700
               '11111').RDEF409                                    @M3A 52444800
         NI    4(1),B'&BITA0&BITA1.111&BITA5&BITA6.1' SETFIRSTFLAG @M3C 52462900
.RDEF409 ANOP                                                      @M3A 52481000
         AIF   ('&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' EQ          +52500000
               '00000000').RDEF410                                 @L7A 52550000
         OI    4(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'         52600000
.RDEF410 ANOP                                                           52650000
.* MODIFY ADDRESS PARAMETERS AS REQUIRED                                52700000
         AIF   ('&CMENTY1' EQ '').RDEF430                          @M3C 52750000
         AIF   ('&CMENTY1'(1,1) NE '(').RDEF420                    @M3C 52800000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF415               @M3C 52850000
         ST    &CMENTY1,52(1)     STORE ENTITY NAME ADDRESS        @M3C 52900000
         AGO   .RDEF430                                            @T1A 52950000
.RDEF415 ANOP                                                      @T1A 53000000
         STCM  &CMENTY1,7,5(1) - STORE ENTITY NAME ADDRESS         @M3C 53050000
         AGO   .RDEF430                                                 53100000
.RDEF420 ANOP                                                           53150000
         LA    0,&CMENTY1 - MOVE ENTITY NAME ADDRESS               @M3C 53200000
         AIF   (NOT &ICHRAC AND NOT &ICHCOM).RDEF425               @M3C 53250000
         ST    0,52(1)         INTO PARM LIST                      @T1A 53300000
         AGO   .RDEF430                                            @T1A 53350000
.RDEF425 ANOP                                                      @T1A 53400000
         STCM  0,7,5(1) -      INTO PARM LIST                           53450000
.RDEF430 ANOP                                                           53500000
         AIF   ('&OLDVOL' EQ '').RDEF470                                53550000
         AIF   ('&OLDVOL'(1,1) NE '(').RDEF460                          53600000
         ST    &OLDVOL(1),8(1) STORE OLD VOLSER ADDRESS                 53650000
         AGO   .RDEF490                                                 53700000
.RDEF460 ANOP                                                           53750000
         LA    0,&OLDVOL -    MOVE OLD VOLSER ADDRESS                   53800000
         ST    0,8(1) -        INTO PARM LIST                           53850000
         AGO   .RDEF490                                                 53900000
.RDEF470 ANOP                                                           53950000
         AIF   ('&CMNWNM' EQ '').RDEF490                           @M3C 54000000
         AIF   ('&CMNWNM'(1,1) NE '(').RDEF480                     @M3C 54050000
         ST    &CMNWNM,8(1) STORE NEW ENTITY NAME ADDRESS          @M3C 54100000
         AGO   .RDEF490                                                 54150000
.RDEF480 ANOP                                                           54200000
         LA    0,&CMNWNM -    MOVE NEW ENTITY NAME ADDRESS         @M3C 54250000
         ST    0,8(1) -        INTO PARM LIST                           54300000
.RDEF490 ANOP                                                           54350000
         AIF   ('&VOLSER' EQ '').RDEF510                                54400000
         AIF   ('&VOLSER'(1,1) NE '(').RDEF500                          54450000
         ST    &VOLSER(1),12(1) STORE VOLSER ADDRESS                    54500000
         AGO   .RDEF510                                                 54550000
.RDEF500 ANOP                                                           54600000
         LA    0,&VOLSER -    MOVE VOLSER ADDRESS                       54650000
         ST    0,12(1) -        INTO PARAMETER                          54700000
.RDEF510 ANOP                                                           54750000
         AIF   ('&CLASS' EQ '').RDEF530                        @PC002PY 54800000
         AIF   ('&CLASS'(1,1) EQ '''').ERR08                   @PC002PY 54850000
         AIF   ('&CLASS'(1,1) NE '(').RDEF520                  @PC002PY 54900000
         ST    &CLASS(1),16(1) STORE CLASS ADDRESS             @PC002PY 54950000
         AGO   .RDEF530                                        @PC002PY 55000000
.RDEF520 ANOP                                                  @PC002PY 55050000
         LA    0,&CLASS -     MOVE CLASS ADDRESS               @PC002PY 55100000
         ST    0,16(1) -        INTO PARAMETER                 @PC002PY 55150000
.ERTN08  ANOP                                                  @PC002PY 55200000
.RDEF530 ANOP                                                  @PC002PY 55250000
         AIF   ('&CMMENT' EQ '').RDEF550                           @M3C 55300000
         AIF   ('&CMMENT'(1,1) NE '(').RDEF540                     @M3C 55350000
         ST    &CMMENT,20(1) STORE MENTITY ADDRESS                 @M3C 55400000
         AGO   .RDEF550                                        @PC002PY 55450000
.RDEF540 ANOP                                                  @PC002PY 55500000
         LA    0,&CMMENT -    MOVE MENTITY ADDRESS                 @M3C 55550000
         ST    0,20(1) -        INTO PARAMETER                 @PC002PY 55600000
.RDEF550 ANOP                                                  @PC002PY 55650000
         AIF   ('&MVOLSER' EQ '').RDEF570                      @PC002PY 55700000
         AIF   ('&MVOLSER'(1,1) NE '(').RDEF560                @PC002PY 55750000
         ST    &MVOLSER(1),24(1) STORE MVOLSER ADDRESS         @PC002PY 55800000
         AGO   .RDEF570                                        @PC002PY 55850000
.RDEF560 ANOP                                                  @PC002PY 55900000
         LA    0,&MVOLSER -   MOVE MVOLSER ADDRESS             @PC002PY 55950000
         ST    0,24(1) -        INTO PARAMETER                 @PC002PY 56000000
.RDEF570 ANOP                                                           56050000
         AIF   ('&ACEE' EQ '').RDEF590                         @PC003PY 56100000
         AIF   ('&ACEE'(1,1) NE '(').RDEF580                   @PC003PY 56150000
         ST    &ACEE(1),28(1) STORE ACEE ADDRESS               @PC003PY 56200000
         AGO   .RDEF590                                        @PC003PY 56250000
.RDEF580 ANOP                                                  @PC003PY 56300000
         LA    0,&ACEE -      MOVE ACEE ADDRESS                @PC003PY 56350000
         ST    0,28(1) -        INTO PARAMETER                 @PC003PY 56400000
.RDEF590 ANOP                                                           56450000
         AIF   ('&UNIT' EQ '').RDEF610                             @L4A 56500000
         AIF   ('&UNIT'(1,1) NE '(').RDEF600                       @L4A 56550000
         ST    &UNIT(1),32(1) - STORE UNIT ADDRESS.                @L4A 56600000
         AGO   .RDEF610                                            @L4A 56650000
.RDEF600 ANOP  ,                                                   @L4A 56700000
         LA    0,&UNIT -      MOVE UNIT ADDRESS                    @L4A 56750000
         ST    0,32(1) -        INTO PARAMETER.                    @L4A 56800000
.RDEF610 ANOP  ,                                                   @L4A 56850000
         AIF   ('&UACC' EQ '').RDEF630                             @L4A 56900000
         AIF   ('&UACC'(1,1) NE '(').RDEF620                       @L4A 56950000
         STC   &UACC(1),36(1) - STORE UACC VALUE IN LIST.          @L4A 57000000
         AGO   .RDEF630                                            @L4A 57050000
.RDEF620 ANOP  ,                                                   @L4A 57100000
&UACC0   SETB  ('&UACC' EQ 'ALTER')                                @L4A 57150000
&UACC1   SETB  ('&UACC' EQ 'CONTROL')                              @L4A 57200000
&UACC2   SETB  ('&UACC' EQ 'UPDATE')                               @L4A 57250000
&UACC3   SETB  ('&UACC' EQ 'READ')                                 @L4A 57300000
&UACC4   SETB  ('&UACC' EQ 'EXECUTE')                              @M1A 57350000
&UACC5   SETB  0                                                   @L4A 57400000
&UACC6   SETB  0                                                   @L4A 57450000
&UACC7   SETB  ('&UACC' EQ 'NONE' OR '&UACC' EQ 'EXECUTE')         @M1A 57487500
&UACCVAL SETA  128*&UACC0+64*&UACC1+32*&UACC2+16*&UACC3+8*&UACC4+1*&UACX57525000
               C7                                                  @M1A 57562500
         MVI   36(1),&UACCVAL MOVE UACC VALUE INTO PARAMETER.      @L4A 57600000
.RDEF630 ANOP  ,                                                   @L4A 57650000
         AIF   ('&LEVEL' EQ '').RDEF650                            @L4A 57700000
         AIF   ('&LEVEL'(1,1) NE '(').RDEF640                      @L4A 57750000
         STC   &LEVEL(1),37(1) - STORE LEVEL VALUE.                @L4A 57800000
         AGO   .RDEF650                                            @L4A 57850000
.RDEF640 ANOP  ,                                                   @L4A 57900000
         AIF   (T'&LEVEL(1) EQ 'N' AND K'&LEVEL(1) LE 2).RDEF641   @L4A 57950000
         AGO   .ERR12                                              @L4A 58000000
.ERTN12  ANOP  ,                                                   @L4A 58050000
.RDEF641 ANOP  ,                                                   @L4A 58100000
         MVI   37(1),&LEVEL - MOVE LEVEL VALUE INTO PARAMETER.     @L4A 58150000
.RDEF650 ANOP  ,                                                   @L4A 58200000
         AIF   ('&AUDIT' EQ '').RDEF670                            @L4A 58250000
         AIF   ('&AUDITRG' EQ '').RDEF660                          @L5A 58300000
         STC   &AUDITRG,38(1) - STORE AUDIT VALUE.                 @L5A 58350000
         AGO   .RDEF670                                            @L4A 58400000
.RDEF660 ANOP  ,                                                   @L4A 58450000
         MVI   38(1),&AUDITVL MOVE AUDIT VALUE INTO PARAMETER.     @L4A 58500000
.RDEF670 ANOP  ,                                                   @L4A 58550000
         AIF   ('&RACFIND' EQ '' AND '&CHKAUTH' EQ '' AND '&WARNING' EQ*58600000
                '' AND '&GENERIC' EQ '' AND '&DSTYPE' NE 'T' AND       *58650000
               '&ERASE' NE '' AND '&MGENER' EQ '').RDEF6           @L7A 58700000
.* PRODUCE SECOND FLAG BYTE                                        @L5A 58750000
.* INITIALIZE BIT SET VARIABLES                                         58800000
&BITA1   SETA  1                                                   @L5A 58850000
&BITA2   SETA  1                                                   @L5A 58900000
&BITA3   SETA  1                                                   @L7A 58950000
&BITA4   SETA  1                                                   @L7A 59000000
&BITA5   SETA  1                                                   @L7A 59050000
&BITA6   SETA  1                                                   @L6A 59100000
&BITA7   SETA  1                                                   @L6A 59150000
&BIT0    SETA  0                                                   @L5A 59200000
&BIT1    SETA  0                                                   @L5A 59250000
&BIT2    SETA  0                                                   @L5A 59300000
&BIT3    SETA  0                                                   @L6A 59350000
&BIT4    SETA  0                                                   @L6A 59400000
&BIT5    SETA  0                                                   @L6A 59450000
&BIT6    SETA  0                                                   @L6A 59500000
&BIT7    SETA  0                                                   @L6A 59550000
         AIF   ('&RACFIND' NE 'NO').RDEF671                        @L5A 59600000
&BITA1   SETA  0            RACFIND=NO SPECIFIED                   @L5A 59650000
.RDEF671 ANOP                                                      @L5A 59700000
         AIF   ('&CHKAUTH' NE 'NO').RDEF672                        @L5A 59750000
&BITA2   SETA  0            CHKAUTH=NO SPECIFIED                   @L5A 59800000
.RDEF672 ANOP                                                      @L5A 59850000
         AIF   ('&WARNING' NE 'NO').RDEF673                        @L6A 59900000
&BITA6   SETA  0            WARNING=NO SPECIFIED                   @L6A 59950000
.RDEF673 ANOP  ,                                                   @L6A 60000000
         AIF   ('&GENERIC' NE 'ASIS').RDEF674                      @L6A 60050000
&BITA7   SETA  0            GENERIC=ASIS SPECIFIED                 @L6A 60100000
.RDEF674 ANOP  ,                                                   @L6A 60150000
         AIF   (&RLVL LE 2).RDEFZ15 BYPASS CODE IF 1.6 RELEASE     @L7A 60200000
         AIF   ('&DSTYPE' EQ 'T' OR '&DSTYPE' EQ '').RDEFZ05       @L7A 60250000
&BITA3   SETA   0                                                  @L7A 60300000
.RDEFZ05 ANOP                                                      @L7A 60350000
         AIF   ('&ERASE' NE 'NO').RDEFZ10                          @L7A 60400000
&BITA4   SETA  0            ERASE=NO SPECIFIED                     @L7A 60450000
.RDEFZ10 ANOP                                                      @L7A 60500000
         AIF   ('&MGENER' NE 'ASIS').RDEFZ15                       @L7A 60550000
&BITA5   SETA  0            MGENER=ASIS SPECIFIED                  @L7A 60600000
.RDEFZ15 ANOP                                                      @L7A 60650000
         AIF   ('&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7' EQ        -60700000
               '1111111').RDEF6                                    @L7A 60750000
         NI    39(1),B'1&BITA1&BITA2&BITA3&BITA4&BITA5&BITA6&BITA7'    X60800000
                                                                   @L7A 60850000
.RDEF6   ANOP                                                      @L7A 60900000
         AIF   ('&RACFIND' EQ '').RDEF676                          @L6A 60950000
&BIT0    SETA  1            RACFIND CODED                          @L5A 61000000
         AIF   ('&RACFIND' NE 'YES').RDEF676                       @L6A 61050000
&BIT1    SETA  1            RACFIND=YES SPECIFIED                  @L5A 61100000
.RDEF676 ANOP                                                      @L6A 61150000
         AIF   ('&CHKAUTH' NE 'YES').RDEF677                       @L6A 61200000
&BIT2    SETA  1            CHKAUTH=YES SPECIFIED                  @L5A 61250000
.RDEF677 ANOP                                                      @L6A 61300000
         AIF   ('&WARNING' NE 'YES').RDEF678                       @L6A 61350000
&BIT6    SETA  1            WARNING=YES SPECIFIED                  @L6A 61400000
.RDEF678 ANOP  ,                                                   @L6A 61450000
         AIF   ('&GENERIC' NE 'YES').RDEF679                       @L6A 61500000
&BIT7    SETA  1            GENERIC=YES SPECIFIED                  @L6A 61550000
.RDEF679 ANOP  ,                                                   @L6A 61600000
         AIF   (&RLVL LE 2).RDEFZ30   BYPASS CODE IF 1.6 RELEASE   @L7A 61650000
         AIF   ('&DSTYPE' NE 'T').RDEFZ20                          @L7A 61700000
&BIT3    SETA  1            DSTYPE=T SPECIFIED                     @L7A 61750000
.RDEFZ20 ANOP                                                      @L7A 61800000
         AIF   ('&ERASE' NE 'YES').RDEFZ25                         @L7A 61850000
&BIT4    SETA  1            ERASE=YES SPECIFIED                    @L7A 61900000
.RDEFZ25 ANOP                                                      @L7A 61950000
         AIF   ('&MGENER' NE 'YES').RDEFZ30                        @L7A 62000000
&BIT5    SETA  1            MGENER=YES SPECIFIED                   @L7A 62050000
.RDEFZ30 ANOP                                                      @L7A 62100000
         AIF   ('&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' EQ          -62150000
               '00000000').RD6                                     @L7A 62200000
         OI    39(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'   @L7A 62250000
.RD6     ANOP                                                      @L7A 62300000
         AIF   ('&OWNER' EQ '').RDEF690                            @L4A 62350000
         AIF   ('&OWNER'(1,1) NE '(').RDEF681                      @L6A 62400000
         ST    &OWNER(1),40(1) - STORE OWNER ADDRESS.              @L4A 62450000
         AGO   .RDEF690                                            @L4A 62500000
.RDEF681 ANOP  ,                                                   @L6A 62550000
         LA    0,&OWNER -     MOVE OWNER ADDRESS                   @L4A 62600000
         ST    0,40(1) -        INTO PARAMETER.                    @L4A 62650000
.RDEF690 ANOP  ,                                                   @L4A 62700000
         AIF   ('&DATA' EQ '').RDEF710                             @L4A 62750000
         AIF   ('&DATA'(1,1) NE '(').RDEF700                       @L4A 62800000
         ST    &DATA(1),44(1) - STORE DATA ADDRESS.                @L4A 62850000
         AGO   .RDEF710                                            @L4A 62900000
.RDEF700 ANOP  ,                                                   @L4A 62950000
         LA    0,&DATA -      MOVE DATA ADDRESS                    @L4A 63000000
         ST    0,44(1) -        INTO PARAMETER.                    @L4A 63050000
.RDEF710 ANOP  ,                                                   @L4A 63100000
         AIF   (&RLVL LE 2).RDEF900    BYPASS CODE IF 1.6 RELEASE  @M1A 63150000
         AIF   ('&ACCLVL' EQ '').RDEF730                           @L7A 63200000
         AIF   (T'&ACCLVL(1) EQ 'O').RDEF720                       @L7A 63250000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RDEF715                  @L7A 63300000
         ST    &ACCLVL(1),56(1) - STORE ACCESS LEVEL PART ONE      @L7A 63350000
         AGO   .RDEF720                                            @L7A 63400000
.RDEF715 ANOP                                                      @L7A 63450000
         LA    0,&ACCLVL(1) -      MOVE ACCLVL PART ONE ADDRESS    @L7A 63500000
         ST    0,56(1)               INTO PARAMETER.               @L7A 63550000
.RDEF720 ANOP                                                      @L7A 63600000
         AIF   (T'&ACCLVL(2) EQ 'O').RDEF730                       @L7A 63650000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RDEF725                  @L7A 63700000
         ST    &ACCLVL(2),60(1) - STORE ACCESS LEVEL PART TWO      @L7A 63750000
         AGO   .RDEF730                                            @L7A 63800000
.RDEF725 ANOP                                                      @L7A 63850000
         LA    0,&ACCLVL(2) -      MOVE ACCLVL PART TWO ADDRESS    @L7A 63900000
         ST    0,60(1)               INTO PARAMETER.               @L7A 63950000
.RDEF730 ANOP                                                      @L7A 64000000
         AIF   ('&SECLVL' EQ '').RDEF740                           @L7A 64050000
         AIF   ('&SECLVL'(1,1) NE '(').RDEF735                     @L7A 64100000
         ST    &SECLVL(1),64(1) - STORE SECURITY LEVEL ADDRESS     @L7A 64150000
         AGO   .RDEF740                                            @L7A 64200000
.RDEF735 ANOP                                                      @L7A 64250000
         LA    0,&SECLVL -          MOVE SECLVL ADDRESS            @L7A 64300000
         ST    0,64(1)                INTO PARAMETER.              @L7A 64350000
.RDEF740 ANOP                                                      @L7A 64400000
         AIF   ('&CATGORY' EQ '').RDEF750                          @L7A 64450000
         AIF   ('&CATGORY'(1,1) NE '(').RDEF745                    @L7A 64500000
         ST    &CATGORY(1),68(1) - STORE CATEGORY LIST ADDRESS     @L7A 64550000
         AGO   .RDEF750                                            @L7A 64600000
.RDEF745 ANOP                                                      @L7A 64650000
         LA    0,&CATGORY -          MOVE CATEGORY ADDRESS         @L7A 64700000
         ST    0,68(1)                INTO PARAMETER.              @L7A 64750000
.RDEF750 ANOP                                                      @L7A 64800000
         AIF   ('&EXPDT' EQ '').RDEF756                            @L8A 64850000
         AIF   ('&EXPDT'(1,1) NE '(').RDEF755                      @L7A 64900000
         ST    &EXPDT(1),72(1) - STORE EXPIRATION DATE ADDRESS     @L7A 64950000
         AGO   .RDEF770                                            @L7A 65000000
.RDEF755 ANOP                                                      @L7A 65050000
         LA    0,&EXPDT -           MOVE EXPIRATION DATE ADDRESS   @L7A 65100000
         ST    0,72(1)                INTO PARAMETER.              @L7A 65150000
         AGO   .RDEF770                                            @L7A 65200000
.RDEF756 ANOP                                                      @L7A 65205000
         AIF   ('&EXPDTX' EQ '').RDEF760                           @L8A 65210000
         AIF   ('&EXPDTX'(1,1) NE '(').RDEF758                     @L8A 65215000
         ST    &EXPDTX(1),72(1) - STORE EX EXPIRATION DATE ADDRESS @L8A 65220000
         AGO   .RDEF770                                            @L8A 65225000
.RDEF758 ANOP                                                      @L8A 65230000
         LA    0,&EXPDTX -       MOVE EX EXPIRATION DATE ADDRESS   @L8A 65235000
         ST    0,72(1)                INTO PARAMETER.              @L8A 65240000
         AGO   .RDEF770                                            @L8A 65245000
.RDEF760 ANOP                                                      @L7A 65250000
         AIF   ('&RETPD' EQ '').RDEF770                            @L7A 65300000
         AIF   ('&RETPD'(1,1) NE '(').RDEF765                      @L7A 65350000
         ST    &RETPD(1),72(1) - STORE RETENTION PERIOD ADDRESS    @L7A 65400000
         AGO   .RDEF770                                            @L7A 65450000
.RDEF765 ANOP                                                      @L7A 65500000
         LA    0,&RETPD -           MOVE RETENTION PERIOD ADDRESS  @L7A 65550000
         ST    0,72(1)                INTO PARAMETER.              @L7A 65600000
.RDEF770 ANOP                                                      @L7A 65650000
         AIF   ('&FILESEQ' EQ '').RDEF780                          @L7A 65700000
         AIF   ('&FILESEQ'(1,1) NE '(').RDEF775                    @L7A 65750000
         STH   &FILESEQ(1),76(1) -  STORE FILE SEQUENCE NUMBER     @L7A 65800000
         AGO   .RDEF780                                            @L7A 65850000
.RDEF775 ANOP                                                      @L7A 65900000
         ICM   0,3,=AL2(&FILESEQ)   MOVE FILE SEQUENCE NUMBER      @L7A 65950000
         STH   0,76(1)                INTO PARAMETER.              @L7A 66000000
.RDEF780 ANOP                                                      @L7A 66050000
.* PRODUCE TAPE FLAG BYTE                                          @L7A 66100000
&BIT0    SETA  0                                                   @L7A 66150000
&BIT1    SETA  0                                                   @L7A 66200000
&BIT7    SETA  0                                                   @L7A 66250000
&BITA0   SETA  1                                                   @L7A 66300000
&BITA1   SETA  1                                                   @L7A 66350000
&BITA7   SETA  1                                                   @L7A 66400000
         AIF   ('&TAPELBL' EQ '' AND '&RETPD' EQ '' AND '&EXPDT' EQ    -66450000
               '' AND '&EXPDTX' EQ '').RDEF795                     @L8A 66500000
         AIF   ('&TAPELBL' EQ '').RDEF781                          @L7A 66550000
&BITA0   SETA  0                         TAPELBL=STD SPECIFIED     @L7A 66600000
&BITA1   SETA  0                                                   @L7A 66650000
.RDEF781 ANOP                                                      @L7A 66700000
         AIF   ('&RETPD' EQ '').RDEF782                            @L7A 66750000
&BITA7   SETA  0                           EXPDT SPECIFIED         @L7A 66800000
.RDEF782 ANOP                                                      @L7A 66850000
         NI    78(1),B'&BITA0&BITA1.11111&BITA7'                   @L7A 66900000
.RDEF785 ANOP                                                      @L7A 66950000
         AIF   ('&TAPELBL' EQ 'STD' OR '&TAPELBL' EQ '').RDEF790   @L7A 67000000
         AIF   ('&TAPELBL' NE 'BLP').RDEF786                       @L7A 67050000
&BIT0    SETA  1                                                   @L7A 67100000
         AGO   .RDEF790                                            @L7A 67150000
.RDEF786 ANOP                                                      @L7A 67200000
&BIT1    SETA  1                                                   @L7A 67250000
.RDEF790 ANOP                                                      @L7A 67300000
         AIF   ('&EXPDTX' EQ '').RDEF791                           @L8A 67310000
&BIT6    SETA  1                                                   @L8A 67320000
&BIT7    SETA  1                                                   @P6A 67325000
         AGO   .RDEF792                                            @L8A 67330000
.RDEF791 ANOP                                                      @L8A 67340000
         AIF   ('&EXPDT' EQ '').RDEF792                            @L7A 67350000
&BIT7    SETA  1                                                   @L7A 67400000
.RDEF792 ANOP                                                      @L7A 67450000
         OI    78(1),B'&BIT0&BIT1.0000&BIT6&BIT7'                  @L8A 67500000
.RDEF795 ANOP                                                      @L7A 67550000
.* PRODUCE MCLASS ADDRESS                                          @L7A 67600000
         AIF   ('&MCLASS' EQ '').RDEF810                           @L7A 67650000
         AIF   ('&MCLASS'(1,1) EQ '''').ERR024                     @L7A 67700000
         AIF   ('&MCLASS'(1,1) NE '(').RDEF800                     @L7A 67750000
         ST    &MCLASS(1),80(1) - STORE MCLASS ADDRESS             @L7A 67800000
         AGO   .RDEF810                                            @L7A 67850000
.RDEF800 ANOP                                                      @L7A 67900000
         LA    0,&MCLASS - MOVE MCLASS ADDRESS                     @L7A 67950000
         ST    0,80(1)   - INTO PARAMETER LIST                     @L7A 68000000
.ERTN024 ANOP                                                      @L7A 68050000
.RDEF810 ANOP                                                      @L7A 68100000
.* PRODUCE NOTIFY ID ADDRESS                                       @L7A 68150000
         AIF   ('&NOTIFY' EQ '').RDEF820                           @L7A 68200000
         AIF   ('&NOTIFY'(1,1) NE '(').RDEF815                     @L7A 68250000
         ST    &NOTIFY,84(1) - STORE NOTIFY ID ADDRESS             @L7A 68300000
         AGO   .RDEF820                                            @L7A 68350000
.RDEF815 ANOP                                                      @L7A 68400000
         LA    0,&NOTIFY - MOVE NOTIFY ID ADDRESS                  @L7A 68450000
         ST    0,84(1)   - INTO PARAMETER LIST                     @L7A 68500000
.RDEF820 ANOP                                                      @L7A 68550000
         AIF   (&RLVL LT 4).RDEF900         LOWER THAN V1.8        @M1A 68551000
         AIF   ('&STORCLA' EQ '').RDEF830                          @M1A 68552000
         AIF   ('&STORCLA'(1,1) NE '(').RDEF825                    @M1A 68553000
         ST    &STORCLA,88(1) - STORE STORAGE CLASS ADDRESS        @M1A 68554000
         AGO   .RDEF830                                            @M1A 68555000
.RDEF825 ANOP                                                      @M1A 68556000
         LA    0,&STORCLA - MOVE STORAGE CLASS ADDRESS             @M1A 68557000
         ST    0,88(1)   - INTO PARAMETER LIST                     @M1A 68558000
.RDEF830 ANOP                                                      @M1A 68559000
         AIF   ('&MGMTCLA' EQ '').RDEF840                          @M1A 68560000
         AIF   ('&MGMTCLA'(1,1) NE '(').RDEF835                    @M1A 68561000
         ST    &MGMTCLA,92(1) - STORE MANAGEMENT CLASS ADDRESS     @M1A 68562000
         AGO   .RDEF840                                            @M1A 68563000
.RDEF835 ANOP                                                      @M1A 68564000
         LA    0,&MGMTCLA - MOVE MANAGEMENT CLASS ADDRESS          @M1A 68565000
         ST    0,92(1)   - INTO PARAMETER LIST                     @M1A 68566000
.RDEF840 ANOP                                                      @M1A 68567000
         AIF   ('&RESOWN' EQ '').RDEF850                           @M1A 68568000
         AIF   ('&RESOWN'(1,1) NE '(').RDEF845                     @M1A 68569000
         ST    &RESOWN,96(1) - STORE RESOURCE OWNER ADDRESS        @M1A 68570000
         AGO   .RDEF850                                            @M1A 68571000
.RDEF845 ANOP                                                      @M1A 68572000
         LA    0,&RESOWN - MOVE RESOURCE OWNER ADDRESS             @M1A 68573000
         ST    0,96(1)   - INTO PARAMETER LIST                     @M1A 68574000
.RDEF850 ANOP                                                      @M1A 68575000
&BIT0    SETA  0             to modify-initialize the bits needed  @M3A 68575100
&BITA0   SETA  1             to turn on and off the flags          @M3A 68575200
&BIT1    SETA  0             for environment, entity, model        @M3A 68575300
&BITA1   SETA  1             entity and new name. The bita's       @M3A 68575400
&BIT2    SETA  0             turn off the flags and bit's          @M3A 68575500
&BITA2   SETA  1             turn on the flags. Initialize the     @M3A 68575600
&BIT3    SETA  0             bits for nochange.                    @M3A 68575700
&BITA3   SETA  1             BIT'S=>OI          BITA'S=>NI         @M3A 68575800
         AIF   ('&ENVIR' EQ '').RDEF851                            @M1A 68576000
&BIT0    SETA  1                                                   @M3A 68577000
.RDEF851 ANOP                                                  @YA12773 68578000
         AIF   ('&ENTITY' EQ '').SKIPAA0     entity specified      @M3A 68578100
&BITA1   SETA  0                             turn off the flag     @M3A 68578200
.SKIPAA0 ANOP                                                      @M3A 68578300
         AIF   ('&ENTITYX' EQ '').SKIPAA1    entityx specified     @M3A 68578400
&BIT1    SETA  1                             turn on the flag      @M3A 68578500
.SKIPAA1 ANOP                                                      @M3A 68578600
         AIF   ('&MENTITY' EQ '').SKIPAA2    model entity          @M3A 68578700
&BITA2   SETA  0                       specified turn off the flag @M3A 68578800
.SKIPAA2 ANOP                                                      @M3A 68578900
         AIF   ('&MENTX' EQ '').SKIPAA3      mentx specified       @M3A 68579000
&BIT2    SETA  1                             turn on the flag      @M3A 68579100
.SKIPAA3 ANOP                                                      @M3A 68579200
         AIF   ('&NEWNAME' EQ '').SKIPAA4    newname specified     @M3A 68579300
&BITA3   SETA  0                             turn the flag off     @M3A 68579400
.SKIPAA4 ANOP                                                      @M3A 68579500
         AIF   ('&NEWNAMX' EQ '').SKIPAA5    newnamx specified     @M3A 68579600
&BIT3    SETA  1                             turn the flag on      @M3A 68579700
.SKIPAA5 ANOP                                                      @M3A 68579800
.*   if no flag is to be turned off then goto skipaa6              @M3A 68579900
         AIF   ('&BITA0&BITA1&BITA2&BITA3' EQ '1111').SKIPAA6      @M3A 68580000
         NI    100(1),B'&BITA0&BITA1&BITA2&BITA3.1111'             @M3A 68580100
.SKIPAA6 ANOP                                                      @M3A 68580200
.*   if no flag is to be turned on then goto skipaa7               @M3A 68580300
         AIF   ('&BIT0&BIT1&BIT2&BIT3' EQ '0000').SKIPAA7          @M3A 68580400
         OI    100(1),B'&BIT0&BIT1&BIT2&BIT3.0000'                 @M3A 68580500
.SKIPAA7 ANOP                                                      @M3A 68580600
         AIF   ('&DDNAME' EQ '').RDEF860                       @YA12773 68580700
         AIF   ('&DDNAME'(1,1) NE '(').RDEF852                 @YA12773 68580800
         ST    &DDNAME,104(1) - STORE DDNAME ADDRESS           @YA12773 68580900
         AGO   .RDEF860                                        @YA12773 68582000
.RDEF852 ANOP                                                  @YA12773 68583000
         LA    0,&DDNAME - MOVE DDNAME ADDRESS                 @YA12773 68584000
         ST    0,104(1)   - INTO THE PARAMETER LIST            @YA12773 68585000
.RDEF860 ANOP                                                      @M1A 68586000
         AIF   ('&SECLABL' EQ '').RDEF870                          @M2A 68587000
         AIF   ('&SECLABL'(1,1) NE '(').RDEF865                    @M2A 68588000
         ST    &SECLABL,108(1) - STORE SECURITY LABEL ADDRESS      @M2A 68589000
         AGO   .RDEF870                                            @M2A 68590000
.RDEF865 ANOP                                                      @M2A 68591000
         LA    0,&SECLABL - MOVE SECURITY LABEL ADDRESS            @M2A 68592000
         ST    0,108(1)   - INTO THE PARAMETER LIST                @M2A 68593000
.RDEF870 ANOP                                                      @M2A 68594000
.RDEF900 ANOP                                                      @M1A 68595000
.* PRODUCE ENTRY LOGIC & EXIT                                           68600000
         AGO   .RDEF330                                                 68650000
.* DIAGNOSTIC MESSAGES                                                  68700000
.ERR01   ANOP                                                           68750000
         MNOTE 8,'*** INVALID DSTYPE PARAMETER ***'                     68800000
         AGO   .ERTN01                                                  68850000
.ERR01B  ANOP                                                      @L7A 68900000
         MNOTE 8,'*** INVALID MGENER PARAMETER ***'                @L7A 68950000
         AGO   .ERTN01B                                            @L7A 69000000
.ERR02   ANOP                                                           69050000
         MNOTE 8,'*** INVALID TYPE PARAMETER ***'                       69100000
         AGO   .ERTN02                                                  69150000
.ERR03   ANOP                                                           69200000
         MNOTE 8,'*** REGISTER SPECIFICATION NOT VALID, LIST FORM ***'  69250000
         AGO   .ERTN03                                                  69300000
.ERR05   ANOP                                                           69350000
         MNOTE 8,'*** ONLY REGS 2-12 ALLOWED FOR PARAMETERS ***'        69400000
         AGO   .ERTN05                                                  69450000
.ERR06   ANOP                                                           69500000
         MNOTE 8,'*** INVALID MF PARAMETER ***'                         69550000
         AGO   .ERTN06                                                  69600000
.ERR07   ANOP                                                           69650000
         MNOTE 8,'*** &CHAR PARAMETER ONLY VALID WITH TYPE=DEFINE ***'  69700000
         AGO   .ERTN07                                                  69750000
.ERR08   ANOP                                                  @PC002PY 69800000
         MNOTE 8,'*** ''CLASSNAME'' FORM NOT ALLOWED WITH MF=E ***'     69850000
         AGO   .ERTN08                                         @PC002PY 69900000
.ERR09   ANOP  ,                                                   @L4A 69950000
         MNOTE 8,'*** INVALID UACC PARAMETER ***'                  @L4A 70000000
         AGO   .ERTN09                                             @L4A 70050000
.ERR10   ANOP  ,                   HANDLE V1R4 REGISTER NOTATION   @L5A 70100000
         AIF   (N'&AUDIT NE 1 OR '&AUDIT(1)' EQ '&AUDIT').ERR10M   @L5A 70150000
&AUDITRG SETC  '&AUDIT(1)'         SET V1R4 REGISTER "NAME"        @L5A 70200000
         AGO   .ERTN10                                             @L5A 70250000
.ERR10M  ANOP                                                      @L5A 70300000
         MNOTE 8,'*** INVALID AUDIT PARAMETER ***'                 @L4A 70350000
         AGO   .ERTN10                                             @L4A 70400000
.ERR11   ANOP  ,                                                   @L4A 70450000
         MNOTE 8,'*** INVALID LEVEL PARAMETER ***'                 @L4A 70500000
         AGO   .ERTN11                                             @L4A 70550000
.ERR12   ANOP  ,                                                   @L4A 70600000
         MNOTE 8,'*** INVALID LEVEL PARAMETER ***'                 @L4A 70650000
         AGO   .ERTN12                                             @L4A 70700000
.ERR13   ANOP  ,                                                   @L4A 70750000
         MNOTE 8,'*** ONLY YES OR NO ALLOWED ***'                  @L4A 70800000
         AGO   .ERTN13                                             @L4A 70850000
.ERR14   ANOP  ,                                                   @L5A 70900000
         MNOTE 8,'*** INVALID RACFIND PARAMETER ***'               @L5A 70950000
         AGO   .ERTN14                                             @L5A 71000000
.ERR15   ANOP  ,                                                   @L5A 71050000
         MNOTE 8,'*** INVALID CHKAUTH PARAMETER ***'               @L5A 71100000
         AGO   .ERTN15                                             @L5A 71150000
.ERR16   ANOP  ,                                                   @L6A 71200000
         MNOTE 8,'*** INVALID WARNING PARAMETER ***'               @L6A 71250000
         AGO   .ERTN16                                             @L6A 71300000
.ERR17   ANOP  ,                                                   @L6A 71350000
         MNOTE 8,'*** INVALID GENERIC PARAMETER ***'               @L6A 71400000
         AGO   .ERTN17                                             @L6A 71450000
.ERR18   ANOP                                                      @L7A 71500000
         MNOTE 8,'*** INVALID TAPE LABEL PARAMETER ***'            @L7A 71550000
         AGO   .ERTN18                                             @L7A 71600000
.ERR19   ANOP                                                      @L7A 71650000
         MNOTE 8,'** INVALID ERASE PARAMETER ***'                  @L7A 71700000
         AGO   .ERTN19                                             @L7A 71750000
.ERR020  ANOP                                                      @L7A 71800000
         MNOTE 8,'*** ''NEWNAME OR NEWNAMX'' PARAMETER CANNOT BE SPECIF-71850000
               IED WITH DS TYPE=T'                                 @M3C 71900000
         AGO   .ERTN020                                            @L7A 71950000
.ERR021  ANOP                                                      @L7A 72000000
         MNOTE 8,'*** TYPE PARAMETER ''CHGVOL'' MAY NOT BE SPECIFIED WI-72050000
               TH DSTYPE=T'                                        @L7A 72100000
         AGO   .ERTN021                                            @L7A 72150000
.ERR22   ANOP                                                      @L7A 72200000
         MNOTE 8,'*** EITHER ''EXPDT'' OR ''RETPD'' BUT NOT BOTH MAY BE-72250000
                CODED'                                             @L7A 72300000
         AGO   .ERTN22                                             @L7A 72350000
.ERR22A  ANOP                                                      @L7A 72355500
         MNOTE 8,'*** EITHER ''EXPDT'' OR ''EXPDTX'' BUT NOT BOTH MAY B-72361000
               E CODED'                                            @L8A 72366500
         AGO   .ERTN22A                                            @L7A 72372000
.ERR22B  ANOP                                                      @L7A 72377500
         MNOTE 8,'*** EITHER ''RETPD'' OR ''EXPDTX'' BUT NOT BOTH MAY B-72383000
               E CODED'                                            @L8A 72388500
         AGO   .ERTN22B                                            @L7A 72394000
.ERR024  ANOP                                                      @L7A 72400000
         MNOTE 8,'''MCLASSNAME'' FORM NOT ALLOWED WITH MF=E'       @L7A 72450000
         AGO   .ERTN024                                            @L7A 72500000
.ERR25   ANOP                                                      @M1A 72504100
         MNOTE 8,'*** INVALID ENVIR PARAMETER ***'                 @M1A 72508200
         AGO   .ERTN25                                            3@P4D 72520500
.ERR27   ANOP                                                      @M1A 72532800
         MNOTE 8,'*** RESOWN IS REQUIRED FOR ''STORCLA''/''MGMTCLA'' **X72536900
                *'                                                 @M1A 72541000
         AGO   .ERTN27                                             @M1A 72545100
.*                                                                 @M3A 72545200
.ERR28   ANOP                                                      @M3A 72545300
         MNOTE 8,'*** ENTITY AND ENTITYX ARE MUTUALLY EXCLUSIVE KEYWORDX72545400
               S ***'                                              @M3A 72545500
         AGO   .ERTN28                                             @M3A 72545600
.*                                                                 @M3A 72545700
.ERR29   ANOP                                                      @M3A 72545800
         MNOTE 8,'***  MENTITY AND MENTX ARE MUTUALLY EXCLUSIVE KEYWORDX72545900
               S ***'                                              @M3A 72546000
         AGO   .ERTN29                                             @M3A 72546100
.*                                                                 @M3A 72546200
.ERR30   ANOP                                                      @M3A 72546300
         MNOTE 8,'*** NEWNAME AND NEWNAMX ARE MUTUALLY EXCLUSIVE KEYWORX72546400
               DS ***'                                             @M3A 72546500
         AGO   .ERTN30                                             @M3A 72546600
.*                                                                 @M3A 72546700
.ERR31   ANOP                                                      @M3A 72546800
         MNOTE 8,'*** "ENTITYX" IS SUPPORTED BY RELEASE 1.9 AND LATER OX72546900
               NLY, ENTITYX IS IGNORED ***'                        @M3A 72547000
         AGO   .ERTN31                                             @M3A 72547100
.*                                                                 @M3A 72547200
.ERR32   ANOP                                                      @M3A 72547300
         MNOTE 8,'*** "MENTX" IS SUPPORTED BY RELEASE 1.9 AND LATER ONLX72547400
               Y, MENTX IS IGNORED ***'                            @M3A 72547500
         AGO   .ERTN32                                             @M3A 72547600
.*                                                                 @M3A 72547700
.ERR33   ANOP                                                      @M3A 72547800
         MNOTE 8,'*** "NEWNAMX" IS SUPPORTED BY RELEASE 1.9 AND LATER OX72547900
               NLY, NEWNAMX IS IGNORED ***'                        @M3A 72548000
         AGO   .ERTN33                                             @M3A 72548100
.*                                                                 @M3A 72548200
.ERR34   ANOP                                                      @M3A 72548300
         MNOTE 8,'*** RACDEF CAN BE INVOKED ONLY VIA RACROUTE FOR RELEAX72548400
               SE 1.9 AND LATER ***'                               @M3A 72548500
         AGO   .ERTN34                                             @M3A 72548600
.*                                                                 @M3A 72548700
.ERR35   ANOP                                                      @P3A 72548800
         MNOTE 8,'*** EITHER ''ENTITY'' OR ''ENTITYX'' MUST BE SPECIFIEX72548900
               D IN STANDARD FORM WITH RELEASE 1.9 AND LATER ***'  @P3A 72549000
         AGO   .ERTN35                                             @P3A 72549100
.*                                                                 @P3A 72549200
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L7A 72550000
         AGO   .ERLVL1R                                            @L7A 72600000
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X72650000
                                                                   @L7A 72700000
         AGO   .ERLVL2R                                            @L7A 72750000
.ERLVLA  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX72800000
               ) ***'                                              @L7A 72850000
         AGO   .ERLVLAR                                            @L7A 72900000
.ERLVLB  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX72903500
               ) ***'                                              @L8A 72907000
         AGO   .ERLVLBR                                            @L8A 72910500
.ERLVLC  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX72914000
               ) ***'                                              @M2A 72917500
         AGO   .ERLVLCR                                            @M2A 72921000
.ERLVLD  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX72924500
               ) ***'                                              @M3A 72928700
         AGO   .ERLVLDR                                            @M3A 72932900
.ERLVLE  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX72937100
               ) ***'                                              @M3A 72941300
         AGO   .ERLVLER                                            @M3A 72945500
.* DIAGNOSTICS COMPLETE                                                 72950000
         MEND                                                           73000000
