*********START OF SPECIFICATIONS*************************************** 00025000
* $MAC(RACHECK) COMP(SC1BN) PROD(RACF):                              *  00027300
*                                                                    *  00027600
* DESCRIPTIVE NAME:                                                  *  00027900
*   AUTHORIZATION CHECKING INTERFACE                                 *  00028200
*                                                                    *  00028500
* *01* PROPRIETARY STATEMENT=                                         * 00051600
*  **PROPRIETARY_STATEMENT********************************************* 00074700
*                                                                     * 00097800
*                                                                     * 00120900
*   LICENSED MATERIALS - PROPERTY OF IBM                              * 00144000
*   THIS MACRO IS "RESTRICTED MATERIALS OF IBM"                       * 00167100
*   5647-A01 (C) COPYRIGHT IBM CORP. 1980, 2000                       * 00190200
*                                                                     * 00213300
*   STATUS= HBB7703                                                   * 00236400
*                                                                     * 00259500
*  **END_OF_PROPRIETARY_STATEMENT************************************** 00282600
*                                                                    *  00306400
*01* EXTERNAL CLASSIFICATION:                                        *  00307400
*02* GUPI:                                                           *  00311200
*01* END OF EXTERNAL CLASSIFICATION:                                 *  00315000
*                                                                    *  00319000
*                                                                       00550000
* FUNCTION:                                                             00587500
*   THIS MACRO ALLOWS THE CALLER TO CHECK A USER'S AUTHORIZATION        00625000
*   TO A RESOURCE.                                                 @L5A 00662500
*                                                                       00700000
* CHANGE ACTIVITY:                                                      00725000
*   RACF VERSION 1 RELEASE 2                                   @PC002PY 00750000
*   RACF VERSION 1 RELEASE 3                                   @PC003PY 00775000
*   $L4=HRF1402,RACF/140,810701,SJRDSD:                            @L4A 00800000
*   OZ56981                                                    @ZA56981 00825000
*   OZ60572                                                    @ZA60572 00850000
*   $T1=UZ90210,SAF/RF15,810702,CNTDSD:                            @T1A 00875000
*   $L5=HRF1502,RACF/150,811218,CNTDSD:                            @L5A 00900000
*   OZ59764                                                    @ZA59764 00925000
*   $L6=HRF1602,RACF/160,830307,CNTDSD:                            @L6A 00950000
*   UZ90283                                                    @ZA90283 00975000
*   UZ90284                                                    @ZA90284 01000000
*   UZ90285                                                    @ZA90285 01025000
*   $L7=HRF1702,RACF/170,840601,CNTDSD:                            @L7A 01050000
*   $L8=HRF1802,RACF/180,860925,CNTDSD:                            @L8A 01075000
*   $P1=PEQ0070,RACF/180,870720,CNTDSD:                            @P1A 01100000
*   $M1=JRF1812,RACF/181,871123,CNTDSD: RELEASE=1.8.1 ALLOWED      @M1A 01125000
*   OY12773                                                    @YA12773 01150000
*   $M2= MVSB1   RACF/190 880328 PDV_Z1: MVS B1 SECURITY           @M2A 01175000
*   $P2= PGW0002 RACF/190 880427 PDV_Z1: PTM PGW0002               @P2A 01200000
*   $P3= PGW0011 RACF/190 880427 PDV_Z1: PTM PGW0011               @P3A 01225000
*   $P4= PGW0020 RACF/190 880615 PDI_H1: PTM PGW0020               @P4A 01250000
*   $D1= DGU0025 RACF/190 881221 PDTGB1: DCR 25                    @D1A 01275000
*   $D2= DGU0058 RACF/190 890201 PDI_H1: DCR 58                    @D2A 01300000
*   $M3= VMSFS   RACF/190 890517 PDB_S1: SHARED FILE SYSTEM        @M3A 01325000
*   $M4=HRF1822,RACF/182,871118,JCD1:                              @M4A 01350000
*   $D3=HRF1822,RACF/182,880206,JCD1: DCR3                         @D3A 01375000
*   $D4= DGU0088 RACF/190 890412 PDTGB1: DCR 88                    @D4A 01390000
*   $P5= PGW0066 RACF/190 890412 PDTGB1: PTM PGW0066               @P5A 01405000
*   $P6= PGP0563 RACF/190 890922 PDB_S1: PTM PGP0563               @P6A 01412500
*   $P7= PGP0575 RACF/190 890922 PDB_S1: PTM PGP0575               @P7A 01420000
*   $P8= PGP0572 RACF/190 890922 PDB_S1: PTM PGP0572               @P8A 01427500
*   $P9= PGP0611 RACF/190 890922 PDB_S1: PTM PGP0611               @P9A 01435000
*   $Q1= PGP0576 RACF/190 890922 PDTGB1: PTM PGP0576               @Q1A 01442500
*   $Q2= PI90010 RACF/190 891020 PDB_S1: PTM PI90010 (OY27097)     @Q2A 01446200
*   $Q3= PI90038 RACF/190 901002 PDJCD1: PTM PI90038 (OY36441)     @Q3A 01448100
*   $M5= RELID   RACF/192 900904 PDAHW1: SUPPORT FOR RACF 1.9.2    @M5A 01448700
*   $Q4= PJA0029 RACF/192 910524 PDPSB1: PTM PJA0029               @Q4A 01449300
*   $M6= OW04015 RACF/210 930426 PDKAF1: SUPPORT FOR RACF 2.1      @M6A 01449500
*   $M7= OW10709 RACF/220 940510 PDJMV1: SUPPORT FOR RACF 2.2      @M7A 01449700
*   $M8= RELID   RACF/230 960422 PDJMV1: SUPPORT FOR RACF 2.3      @M8A 01449800
*   $Q5= PQC1932 RACF/230 960722 PDJMV1: PTM PQC1932               @Q5C 01449900
*   $M9= RELID   RACF/240 960904 PDJMV1: SUPPORT FOR RACF 2.4      @M9A 01451200
*   $Q6= PSY0429 RACF/230 970305 PDPHW1: PTM PSY0429/ OW25078      @Q6A 01451800
*   $N1= RELID   RACF/260 970728 PDCAM1: SUPPORT FOR RACF HRF2260  @N1A 01452100
*   $Q7= PVT0078 RACF/260 971027 PDJJP1: FIN APAR OW29544          @Q7A 01452300
*   $N2= RELID   HRF2608  980624 PDRDS2: SUPPORT FOR HRF2608       @N2A 01452400
*   $N3= RELID   HRF7703  990415 PDRDS2: SUPPORT FOR HRF7703       @N3A 01452800
*                                                                       01453200
* CHANGE DESCRIPTIONS:                                                  01453800
*   A000000-999999 ORIGINAL CODE                               @PC002PY 01457600
*   A - SUPPORT FOR WRITER, LOGSTR, TOKEN, AND RECVR KEYWORDS      @M2A 01461400
*   A - SUPPORT FOR MF=M                                           @P2A 01465200
*   A - MNOTES IF NEW KEYWORDS USED WITHOUT RACROUTE               @P3A 01469000
*   A - 1.9 KEYWORDS ARE BYPASSED IF RELEASE=1.8                   @P4A 01472800
*   D - WRITER KEYWORD SUPPORT (IMPLEMENTED VIA WRITER CLASS)      @D1A 01476600
*   A - SUPPORT FOR STATUS=EVERDOM                                 @D2A 01480400
*   A - LONG NAME SUPPORT UNDER SHARED FILE SYSTEM. SUPPORT FOR    @M3A 01484200
*       KEYWORD "ENTITYX" AND ATTR=ACCESS                          @M3A 01488000
*   A - SUPPORT FOR STATUS=WRITEONLY                               @D4A 01491800
*   C - "NOT ALLOWED WITH MF=E" MNOTES TO INCLUDE MF=M             @P5A 01495600
*   C - GENERATE CORRECT PARAMETER LIST FOR RELEASE 1.8X           @P6A 01497800
*   A - SUPPORT TO VALIDATE SECOND ENTITY/ENTITYX PARAMETER        @P7A 01498100
*       ON THE MODIFY AND EXECUTE FORMS                            @P7A 01498400
*   A - SUPPORT TO DISALLOW RTOKEN KEYWORD WITH SECOND ENTITY      @P8A 01498700
*       OPERAND BEING 'PRIVATE' OR 'CSA' IN LIST AND STANDARD      @P8A 01499000
*       FORMS                                                      @P8A 01499300
*   C - '&RELEASE' TO '&RELEASE'(1,3) FOR LOGICAL COMPARISON       @P9A 01499400
*       WITH '1.9'                                                 @P9A 01499500
*   C - ATTR=ACCESS TO STATUS=ACCESS                               @Q1A 01499600
*   C - SUPPORT TO DISALLOW RTOKEN WITH MODIFY AND EXECUTE FORMS   @Q2A 01499800
*   C - ASSEMBLER F COMPATABILITY                                  @Q3A 01499900
*   C - ALLOW RACF RELEASE 1.9.2 TO BE SPECIFIED                   @M5A 01504900
*   C - STATUS TO CORRECTLY CORRESPOND TO MVS LEVEL, AND CHANGE    @Q4A 01509900
*       PRODUCT I.D. TO RACF/192                                   @Q4A 01514900
*   C - ALLOW RACF RELEASE 2.1 TO BE SPECIFIED                     @M6A 01517400
*   C - ALLOW RACF RELEASE 2.2 TO BE SPECIFIED                     @M7A 01518600
*   C - ALLOW RACF RELEASE 2.3 TO BE SPECIFIED                     @M8A 01519200
*   C - FIX PROGRAM NUMBER IN COPYRIGHT STATEMENT 2.3.0            @Q5C 01519500
*   A - ALLOW RACF RELEASE 2.4 TO BE SPECIFIED                     @M9A 01519700
*   A - STATUS=ACCESS IN EXECUTE FORM OF RACROUTE=AUTH GENERATES   @Q6A 01521000
*       INCORRECT PARM LIST X'30'.  THE CORRECT PARM LIST IS X'10' @Q6A 01522300
*   A - ALLOW RACF RELEASE 2.6 TO BE SPECIFIED FOR HRF2260         @N1A 01522900
*   A - HAD TO SHUT OFF ENTITY BIT WHEN PROFILE IS SPECIFIED       @Q7A 01523800
*   A - ALLOW RACF RELEASE 2608 TO BE SPECIFIED FOR HRF2608        @N2A 01524000
*   A - ALLOW RACF RELEASE 7703 TO BE SPECIFIED FOR HRF7703        @N3A 01524200
*                                                                       01524600
*********END OF SPECIFICATIONS***************************************** 01525000
         MACRO                                                          01550000
&SYMBOL  RACHECK &ENTITY=,&CLASS=,&PROFILE=,&VOLSER=,&OLDVOL=,         -01600000
               &ATTR=,&DSTYPE=,&LOG=,&MF=S,&INSTLN=,                   *01650000
               &OWNER=,                                          @L4A  *01700000
               &RACFIND=,                                        @L5A  *01750000
               &ACCLVL=,                                         @L5A  *01800000
               &ACEE=,&APPL=,                                    @L6A  *01850000
               &GENERIC=,                                        @L7A  *01900000
               &RELEASE=,                                        @L7A  *01950000
               &FILESEQ=,                                        @L7A  *02000000
               &TAPELBL=,                                        @L7A  *02050000
               &STATUS=,                                         @L7A  *02059000
               &USERID=,                                         @L8A  *02068000
               &GROUPID=,                                        @L8A  *02077000
               &DDNAME=,                                     @YA12773  *02086000
               &LOGSTR=,                                         @D1D  *02095000
               &RECVR=,                                          @M2A  *02104000
               &RTOKEN=,                                         @M2A  *02113000
               &ENTITYX=,                                        @M3A  *02122000
               &UTOKEN=                                          @M2A   02131000
.*                                                                      02140000
.* DEFINE LOCAL SET SYMBOLS                                             02150000
         LCLA  &BIT0,&BIT1,&BIT2,&BIT3,&BIT4,&BIT5,&BIT6,&BIT7,&CLNGTH  02200000
         LCLA  &BIX0,&BIX1,&BIX2,&BIX3,&BIX4,&BIX5,&BIX6,&BIX7          02250000
         LCLA  &OFFSET                                         @PC003PY 02300000
         LCLB  &MFFLAG                                                  02350000
         LCLC  &SUBSTR                                                  02400000
         LCLA  &RLVL,&RLVLSZ(10)                                   @M6C 02450000
         LCLB  &RLVLCHK                                            @L7A 02500000
         LCLA  &PARMLEN                                            @L7A 02550000
         LCLB  &LONGNAM          0 => ENTITY IS SPECIFIED          @M3A 02562500
         LCLC  &CMENTY1          FIRST OPERAND - ENTITY OR ENTITYX @M3A 02575000
         LCLC  &CMENTY2          SECOND OPERAND- ENTITY OR ENTITYX @M3A 02587500
.* DEFINE GLOBAL SET SYMBOLS                                       @T1A 02600000
         GBLB  &ICHRAC              ICHRAC - A FLAG WHICH, WHEN    @T1A 02650000
.*                                  ON, INDICATES THAT THIS MACRO  @T1A 02700000
.*                                  IS BEING INVOKED INTERNALLY    @T1A 02750000
.*                                  BY THE RACROUTE MACRO.         @T1A 02800000
         GBLC  &ICHL                THIS IS USED TO COMMUNICATE    @T1A 02850000
.*                                  TO THE RACROUTE MACRO THE      @T1A 02900000
.*                                  ADDRESS OF THE PARAMETER LIST. @T1A 02950000
         GBLC  &ICHRLVL             SYMBOL TO BRANCH TO            @L7A 03000000
.*                                  WHEN INCOMPATIBLE MACRO LEVEL. @L7A 03050000
.*                                                                      03052600
         GBLB  &ICHLFS              ICHLFS - A FLAG WHICH IS SET   @D3C 03055200
.*                                  BY RACROUTE TO COMMUNICATE     @D3C 03057800
.*                                  THAT THE LIMITED FUNCTION      @D3C 03060400
.*                                  SUPPORT FOR VM HAS BEEN        @D3C 03063000
.*                                  SELECTED.                      @D3C 03065600
         GBLB  &ICHCOM              ICHCOM - A FLAG WHICH WHEN ON  @M3A 03065900
.*                                  INDICATES THAT THE RACHECK IS  @M3A 03066200
.*                                  INVOKED BY COMMAND PROCESSORS  @M3A 03066500
.*                                  IT GENERATES PARAMETER LIST    @M3A 03066800
.*                                  WITH 31 BIT ADDRESSING AND     @M3A 03067100
.*                                  THE SVC CALL.                  @M3A 03067400
&LONGNAM SETB 0                     REFLECT ENTITY IS SPECIFIED.   @M3A 03068200
         AIF   (N'&ENTITY GT 1).COPTWO1                            @M3A 03070800
&CMENTY1 SETC  '&ENTITY'                                           @M3A 03073400
&CMENTY2 SETC  ''                                                  @M3A 03076000
         AIF   ('&CMENTY1' EQ '').COMFLO1                          @M3A 03078600
         AIF   ('&CMENTY1'(1,1) NE '(').COMFLO1                    @M3A 03081200
&CMENTY1 SETC  '&ENTITY(1)'                                        @M3A 03083800
         AGO   .COMFLO1                                            @M3A 03086400
.COPTWO1 ANOP                                                      @M3A 03089000
&CMENTY1 SETC  '&ENTITY(1)'                                        @M3A 03091600
&CMENTY2 SETC  '&ENTITY(2)'                                        @M3A 03094200
.COMFLO1 ANOP                                                      @M3A 03096800
.* INITIALIZE FOR, AND VALIDATE, RELEASE PARAMETER                 @L7A 03100000
&RLVLSZ(1) SETA 56                 DEFAULT PARAMETER LIST SIZE     @L7A 03150000
&RLVLSZ(2) SETA 56                 R1.6 PARAMETER LIST SIZE        @L7A 03200000
&RLVLSZ(3) SETA 60                 R1.7 PARAMETER LIST SIZE        @L7A 03250000
&RLVLSZ(4) SETA 68                 R1.8 PARAMETER LIST SIZE        @L8A 03260000
&RLVLSZ(5) SETA 68                 R1.8.1 PARAMETER LIST SIZE      @M1A 03270000
&RLVLSZ(6) SETA 88                 R1.8X PARAMETER LIST SIZE   @YA12773 03280000
&RLVLSZ(7) SETA 92                 R1.9   PARAMETER LIST SIZE      @M2A 03290000
&RLVLSZ(8) SETA 92                 R1.9.2 PARAMETER LIST SIZE      @M5C 03295000
&RLVLSZ(9) SETA 92                 R2.1   PARAMETER LIST SIZE      @M6A 03297500
&RLVLSZ(10) SETA 92                R2.2   PARAMETER LIST SIZE      @M7A 03298700
&RLVLSZ(11) SETA 92                R2.3   PARAMETER LIST SIZE      @M8A 03299300
&RLVLSZ(12) SETA 92                R2.4   PARAMETER LIST SIZE      @M9A 03299600
&RLVLSZ(13) SETA 92                R2.6   PARAMETER LIST SIZE      @N1A 03299800
&RLVLSZ(14) SETA 92                R2608  PARAMETER LIST SIZE      @N2A 03299900
&RLVLSZ(15) SETA 92                R7703  PARAMETER LIST SIZE      @N3A 03316600
         AIF   (&ICHRAC).RLVL01                                    @L7A 03333300
&ICHRLVL SETC  'ICH&SYSNDX.X'      CREATE LABEL FOR SVC BYPASS     @L7A 03350000
.RLVL01  ANOP                                                      @L7A 03400000
&RLVL    SETA  1                   DEFAULT IF NOT SPECIFIED        @L7A 03450000
         AIF   ('&RELEASE' EQ '').NORLVL                           @L7A 03500000
         AIF   (N'&RELEASE GT 2).ERLVL1 INVALID RELEASE PARAMETER  @L7A 03550000
         AIF   ('&RELEASE(1)' EQ '1.6' OR  '&RELEASE(1)' EQ '1.7' OR   X03554400
               '&RELEASE(1)' EQ '1.8' OR '&RELEASE(1)' EQ '1.8.1' OR   X03558800
               '&RELEASE(1)' EQ '1.8.2').RLVL02                    @M4C 03563200
         AIF   ('&RELEASE(1)' EQ '1.8X').RLVL02                @YA12773 03567600
         AIF   ('&RELEASE(1)' EQ '1.9').LNGNM19                    @M3C 03572000
         AIF   ('&RELEASE(1)' EQ '1.9.2').LNGNM19                  @M5C 03574200
         AIF   ('&RELEASE(1)' EQ '2.1').LNGNM19                    @M6A 03575300
         AIF   ('&RELEASE(1)' EQ '2.2').LNGNM19                    @M7A 03575800
         AIF   ('&RELEASE(1)' EQ '2.3').LNGNM19                    @M8A 03576100
         AIF   ('&RELEASE(1)' EQ '2.4').LNGNM19                    @M9A 03576200
         AIF   ('&RELEASE(1)' EQ '2.6').LNGNM19                    @N1A 03576300
         AIF   ('&RELEASE(1)' EQ '2608').LNGNM19                   @N2A 03577800
         AIF   ('&RELEASE(1)' EQ '7703').LNGNM19                   @N3A 03578500
         AGO   .ERLVL1                                         @YA12773 03579300
.*                                                                 @M3A 03580800
.*  TEST THE FOLLOWING :                                           @M3A 03585200
.*    1. FOR RELEASE 1.9 AND LATER, THE MACRO RACHECK IS INVOKED   @M5C 03589600
.*       ONLY VIA RACROUTE.                                        @M5C 03594000
.*    2. BOTH ENTITY AND ENTITYX ARE NOT SPECIFIED AS THEY ARE     @M3A 03598400
.*       MUTUALLY EXCLUSIVE KEYWORDS.                              @M3A 03602800
.*                                                                 @M3A 03607200
.LNGNM19 ANOP                                                      @M3A 03611600
         AIF   (&ICHCOM).ERTN19                                    @M3A 03613800
         AIF   (NOT &ICHRAC).ERR19                                 @M3A 03616000
.ERTN19  ANOP                                                      @M3A 03620400
         AIF   ('&ENTITYX' NE '' AND '&ENTITY' NE '').ERR18        @M3A 03624800
.ERTN18  ANOP                                                      @M3A 03629200
         AIF   ('&ENTITYX' EQ '').RLVL02                           @M3A 03633600
&LONGNAM SETB  1                     SINCE ENTITYX IS SPECIFIED,   @M3A 03638000
         AIF   (N'&ENTITYX GT 1).COPTWO2                           @M3A 03642400
&CMENTY1 SETC  '&ENTITYX'                                          @M3A 03646800
&CMENTY2 SETC  ''                                                  @M3A 03651200
         AIF   ('&CMENTY1' EQ '').COMFLO2                          @M3A 03655600
         AIF   ('&CMENTY1'(1,1) NE '(').COMFLO2                    @M3A 03660000
&CMENTY1 SETC  '&ENTITYX(1)'                                       @M3A 03664400
         AGO   .COMFLO2                                            @M3A 03668800
.COPTWO2 ANOP                                                      @M3A 03673200
&CMENTY1 SETC  '&ENTITYX(1)'                                       @M3A 03677600
&CMENTY2 SETC  '&ENTITYX(2)'                                       @M3A 03682000
.COMFLO2 ANOP                                                      @M3A 03686400
.*                                                                 @M3A 03690800
.RLVL02  ANOP                                                      @L7A 03695200
         AIF   (N'&RELEASE EQ 1).NORLVLC CHECK NOT SPECIFIED       @L7A 03700000
         AIF   ('&RELEASE(2)' NE 'CHECK').ERLVL1 INVALID VALUE     @L7A 03750000
         AIF   ('&MF(1)' NE 'E').ERLVL2 CHECK ONLY WITH MF=E       @L7A 03800000
         AIF   (&ICHLFS).ERLVLF  MF=E,CHECK SPECIFIED WITH         @M4A 03810000
.*                               RELEASE=1.8.2 AND LIMITED         @M4A 03820000
.*                               FUNCTION RACROUTE SELECTED IS     @M4A 03830000
.*                               INVALID.                          @M4A 03840000
&RLVLCHK SETB  1                  INDICATE RELEASE-CHECK REQUESTED @L7A 03850000
.ERLVL2R ANOP                                                      @L7A 03900000
.NORLVLC ANOP                                                      @L7A 03950000
.ERLVLFR ANOP                                                      @M4A 03975000
&RLVL    SETA  2                   ASSUME RELEASE=1.6              @L7A 04000000
         AIF   ('&RELEASE(1)' NE '1.7').RLVL17                     @L7A 04050000
&RLVL    SETA  3                   INDICATE RELEASE=1.7            @L7A 04100000
         AGO   .RLVL18                                             @L8A 04125000
.RLVL17  ANOP                                                      @L7A 04150000
         AIF   ('&RELEASE(1)' NE '1.8').RLVL18                     @L8A 04152700
&RLVL    SETA  4                   INDICATE RELEASE=1.8            @L8A 04155400
.RLVL18  ANOP                                                      @L8A 04158100
         AIF   ('&RELEASE(1)' NE '1.8.1').RLVL181                  @M1A 04160800
&RLVL    SETA  5                   INDICATE RELEASE=1.8.1          @M1A 04163500
.RLVL181 ANOP                                                      @M1C 04166200
         AIF   ('&RELEASE(1)' NE '1.8X').RLVL18X               @YA12773 04168900
&RLVL    SETA  6                   INDICATE RELEASE=1.8X       @YA12773 04171600
.RLVL18X ANOP                                                  @YA12773 04174300
         AIF   ('&RELEASE(1)' EQ '1.8.2' AND NOT &ICHLFS).ERLVL3   @M4A 04177000
         AIF   ('&RELEASE(1)' NE '1.8.2').RLVL182                  @M4A 04179700
&RLVL    SETA  4                   INDICATE RELEASE=1.8.2 USING    @M4A 04182400
.*                                 THE 1.8 PARAMETER LIST SIZE     @M4A 04185100
.RLVL182 ANOP                                                      @M4A 04187800
         AIF   ('&RELEASE(1)' NE '1.9').RLVL190                    @M2A 04190500
&RLVL    SETA  7                   INDICATE RELEASE=1.9.0          @M2A 04193200
.RLVL190 ANOP                                                      @M2A 04195900
         AIF   ('&RELEASE(1)' NE '1.9.2').RLVL192                  @M5C 04196900
&RLVL    SETA  8                   INDICATE RELEASE=1.9.2          @M5C 04197900
.RLVL192 ANOP                                                      @M5C 04198900
         AIF   ('&RELEASE(1)' NE '2.1').RLVL210                    @M6A 04199100
&RLVL    SETA  9                   INDICATE RELEASE=2.1            @M6A 04199300
.RLVL210 ANOP                                                      @M7A 04199400
         AIF   ('&RELEASE(1)' NE '2.2').RLVL220                    @M7A 04199500
&RLVL    SETA  10                  INDICATE RELEASE=2.2            @M7A 04199600
.RLVL220 ANOP                                                      @M8A 04208000
         AIF   ('&RELEASE(1)' NE '2.3').RLVL230                    @M8A 04216400
&RLVL    SETA  11                  INDICATE RELEASE=2.3            @M8A 04224800
.RLVL230 ANOP                                                      @M6C 04226900
         AIF   ('&RELEASE(1)' NE '2.4').RLVL240                    @M9A 04229000
&RLVL    SETA  12                  INDICATE RELEASE=2.4            @M9A 04231100
.RLVL240 ANOP                                                      @M9A 04236300
         AIF   ('&RELEASE(1)' NE '2.6').RLVL260                    @N1A 04237600
&RLVL    SETA  13                  INDICATE RELEASE=2.6            @N1A 04238900
.RLVL260 ANOP                                                      @N1A 04240200
         AIF   ('&RELEASE(1)' NE '2608').RLVL2608                  @N2A 04240500
&RLVL    SETA  14                  INDICATE RELEASE=2608           @N2A 04240800
.RLVL2608 ANOP                                                     @N2A 04241100
         AIF   ('&RELEASE(1)' NE '7703').RLVL7703                  @N3A 04241200
&RLVL    SETA  15                  INDICATE RELEASE=7703           @N3A 04241300
.RLVL7703 ANOP                                                     @N3A 04241400
.NORLVL  ANOP                                                      @L7A 04241600
.ERLVL1R ANOP                                                      @L7A 04250000
.ERLVL3R ANOP                                                      @M4A 04275000
.*                                                                 @L7A 04300000
.* PERFORM PARAMETER DIAGNOSIS                                          04350000
.*                                                                 @L7A 04400000
.* CHECK SPECIFIED PARAMETERS AGAINST RACF LEVEL                   @L7A 04450000
         AIF   (&RLVL LT 7 AND '&ENTITYX' NE '').ERR20             @M3A 04466600
.ERTN20  ANOP                                                      @M3A 04483200
         AIF   (&RLVL GE 3).RLVL20 1.7 PARAMETERS VALID            @L7A 04500000
         AIF   (T'&FILESEQ NE 'O' OR T'&TAPELBL NE 'O' OR              X04550000
               T'&STATUS NE 'O').ERLVLA                            @L7A 04600000
         AIF   ('&DSTYPE' EQ 'T').ERLVLA                           @L7A 04650000
         AIF   ('&CMENTY2' EQ 'PRIVATE').ERLVLA                    @M3C 04675000
         AGO   .RLVL20                                             @L7A 04700000
.ERLVLAR ANOP                                                      @L7A 04750000
&RLVL    SETA  3                   1.7 PARAMETERS USED, SO ASSUME      X04800000
                                   RELEASE 1.7 EXPANSION           @L7A 04850000
.RLVL20  ANOP                                                      @L7A 04900000
         AIF   (&RLVL GE 4).RLVL25 1.8 PARAMETERS VALID            @L7A 04902000
         AIF   (T'&USERID NE 'O' OR T'&GROUPID NE 'O').ERLVLB      @L8A 04904000
         AGO   .RLVL25                                             @L8A 04906000
.ERLVLBR ANOP                                                      @L8A 04908000
&RLVL    SETA  4                   1.8 PARAMETERS USED, SO ASSUME      X04910000
                                   RELEASE 1.8 EXPANSION           @L8A 04912000
.RLVL25  ANOP                                                      @L8A 04914000
         AIF   (&RLVL GE 6).RLVL25X 1.8X PARAMETERS VALID      @YA12773 04916000
         AIF   (T'&DDNAME NE 'O').ERLVLC                       @YA12773 04918000
         AGO   .RLVL25X                                        @YA12773 04920000
.ERLVLCR ANOP                                                  @YA12773 04922000
&RLVL    SETA  6                   1.8X PARAMETERS USED, SO ASSUME     X04924000
                                   RELEASE 1.8X EXPANSION      @YA12773 04926000
.RLVL25X ANOP                                                  @YA12773 04928000
         AIF   (&RLVL GE 7).RLVL30 1.9 PARAMETERS VALID            @M2A 04930000
         AIF   (T'&LOGSTR NE 'O').ERLVLD                           @M2A 04932000
         AIF   (T'&UTOKEN NE 'O').ERLVLD                           @M2A 04934000
         AIF   (T'&RTOKEN NE 'O').ERLVLD                           @M2A 04936000
         AIF   (T'&RECVR  NE 'O').ERLVLD                           @D1D 04938000
         AGO   .RLVL30                                             @M2A 04940000
.ERLVLDR ANOP                                                      @M2A 04942000
&RLVL    SETA  7                   1.9 PARAMETERS USED, SO ASSUME  @M2AX04944000
                                   RELEASE 1.9 EXPANSION           @M2A 04946000
.RLVL30  ANOP                                                      @M2A 04948000
&PARMLEN SETA  &RLVLSZ(&RLVL)       LEN OF RACHECK PARMETER LIST   @L7A 04950000
.*                                                                 @L7A 05000000
.* VALIDATE ENTITY/ENTITYX/PROFILE PARAMETER                       @L7A 05033300
         AIF   ('&CMENTY1' EQ '' AND '&PROFILE' EQ '' AND '&MF' EQ     -05066600
               'S' ).ERR00                                         @M3C 05099900
         AIF   ('&PROFILE' NE '' AND &ICHLFS).ERR00A               @M4A 05133200
         AIF   (&ICHLFS AND '&CMENTY2' NE '').ERR01                @D3A 05166500
.ERTN00  ANOP                                                           05200000
.ERTN01  ANOP                                                      @D3A 05204500
.*--------------------------------------------------------------*  @P3A 05209000
.* VALIDATE RACROUTE INTERFACE FOR NEW PARAMETERS               *  @P3A 05213500
.*--------------------------------------------------------------*  @P3A 05218000
         AIF   (&ICHCOM).ERLVLER    SKIP IF FROM COMMAND PROCESSOR @M3A 05220200
         AIF   (&ICHRAC).ERLVLER    SKIP IF FROM RACROUTE          @P3A 05222500
         AIF   (T'&LOGSTR NE 'O').ERLVLE                           @M2A 05227000
         AIF   (T'&UTOKEN NE 'O').ERLVLE                           @M2A 05231500
         AIF   (T'&RTOKEN NE 'O').ERLVLE                           @M2A 05236000
         AIF   (T'&RECVR  NE 'O').ERLVLE                           @D1D 05240500
.ERLVLER ANOP                                                      @M2A 05245000
.* VALIDATE SECOND ENTITY/ENTITYX PARAMETER                        @P7A 05245600
         AIF   ('&CMENTY2' EQ '').ERTN17                           @P7A 05246200
         AIF   ('&CMENTY2' EQ 'PRIVATE').ERTN17                    @P7A 05246800
         AIF   ('&CMENTY2' EQ 'NONE').ERTN17                       @P7A 05247400
         AIF   ('&CMENTY2' EQ 'CSA').ERTN17                        @P7A 05248000
         AGO   .ERR17                                              @P7A 05248600
.ERTN17  ANOP  ,                                                   @P7A 05249200
.* VALIDATE LOG PARAMETER                                               05250000
         AIF   ('&LOG' NE 'ASIS' AND '&LOG' NE 'NOFAIL' AND '&LOG' NE  -05300000
               'NONE' AND '&LOG' NE 'NOSTAT' AND                       -05350000
               '&LOG' NE '').ERR02                             @ZA60572 05400000
         AIF   ('&LOG' NE '' AND &ICHLFS).ERR02A                   @M4A 05425000
.ERTN02  ANOP                                                           05450000
.* VALIDATE DSTYPE PARAMETER                                            05500000
         AIF   ('&DSTYPE' NE 'N' AND '&DSTYPE' NE 'V'                  -05550000
               AND '&DSTYPE' NE 'M' AND '&DSTYPE' NE 'T'               -05600000
               AND '&DSTYPE' NE '').ERR03                          @L7A 05650000
         AIF   ('&DSTYPE' NE '' AND &ICHLFS).ERR03A                @M4A 05675000
.ERTN03  ANOP                                                           05700000
.* VALIDATE ATTR PARAMETER                                              05750000
         AIF   ('&ATTR' EQ 'READ' OR '&ATTR' EQ 'ALTER'                -05800000
                OR '&ATTR' EQ '').RCHK000                          @Q1C 05850000
         AIF   ( '&ATTR' EQ 'UPDATE' OR '&ATTR' EQ                     -05900000
               'CONTROL' OR '&ATTR'(1,1) EQ '(').RCHK000                05950000
         AGO   .ERR04                                                   06000000
.RCHK000 ANOP                                                           06050000
.ERTN04  ANOP                                                           06100000
.* VALIDATE RACFIND PARAMETER                                      @L5A 06150000
         AIF   ('&RACFIND' NE 'YES' AND '&RACFIND' NE 'NO' AND         *06200000
               T'&RACFIND NE 'O').ERR05                            @L5A 06250000
         AIF   ('&RACFIND' NE '' AND &ICHLFS).ERR05A               @M4A 06275000
.ERTN05  ANOP                                                      @L5A 06300000
.* VALIDATE GENERIC PARAMETER                                           06350000
         AIF   ('&GENERIC' EQ '').ERTN11                           @L6A 06400000
         AIF   ('&GENERIC' NE 'YES' AND                                *06450000
               '&GENERIC' NE 'ASIS').ERR11                         @L6A 06500000
         AIF   ('&GENERIC' NE '' AND &ICHLFS).ERR11A               @M4A 06525000
.ERTN11  ANOP  ,                                                   @L6A 06550000
.* VALIDATE MF PARAMETER                                                06600000
         AIF   ('&MF' NE 'S' AND '&MF' NE 'L' AND '&MF'(1,2) NE        -06650000
               '(E' AND '&MF'(1,2) NE '(M' ).ERR06                 @P2C 06700000
.ERTN06  ANOP                                                           06750000
.* VALIDATE TAPELBL PARAMETER                                     @L7A  06800000
        AIF    ('&TAPELBL' NE 'STD' AND '&TAPELBL' NE 'BLP' AND        -06850000
               '&TAPELBL' NE 'NL' AND T'&TAPELBL NE 'O').ERR12    @L7A  06900000
         AIF   ('&TAPELBL' NE '' AND &ICHLFS).ERR12A              @M4A  06925000
.ERTN12  ANOP                                                     @L7A  06950000
.* VALIDATE STATUS PARAMETER                                      @L7A  07000000
         AIF   ('&STATUS' NE '' AND '&STATUS' NE 'ERASE'               +07005000
               AND '&STATUS' NE 'NONE').CONT1A                    @Q3C  07010000
         AGO   .CONT1B                                            @Q3A  07015000
.CONT1A  ANOP                                                     @Q3A  07020000
         AIF   ('&STATUS' NE 'EVERDOM' AND '&STATUS' NE 'ACCESS'       +07025000
               AND '&STATUS' NE 'WRITEONLY').ERR13                 @Q1C 07030000
.CONT1B  ANOP                                                           07033000
         AIF   ('&STATUS' NE '' AND &ICHLFS).ERR13A                @M4A 07036000
.ERTN13  ANOP                                                      @L7A 07045000
.*                                                                      07045600
.* VALIDATE THE RTOKEN PARAMETER. IT SHOULD NOT BE SPECIFIED WITH       07046200
.* THE SECOND ENTITY OPERAND BEING 'PRIVATE' OR 'CSA' IN THE LIST       07046800
.* AND STANDARD FORMS.                                                  07047400
.*                                                                      07048000
         AIF   ('&RTOKEN' EQ '' OR '&CMENTY2' EQ '').ERTN21        @P8A 07048600
         AIF   ('&CMENTY2' NE 'PRIVATE' AND '&CMENTY2' NE 'CSA').ERTN21 07049200
         AGO   .ERR21                                              @P8A 07051000
.ERTN21  ANOP                                                      @P8A 07051600
.*                                                                      07052200
.* GROUPID IS INVALID IF SPECIFIED FOR THE LFR FUNCTION            @M4A 07054000
         AIF   ('&GROUPID' NE '' AND &ICHLFS).ERR14A               @M4A 07063000
.* GROUPID REQUIRES A USERID FOR S FORM                            @L8A 07072000
         AIF   ('&MF' EQ 'S' AND                                       X07081000
               T'&GROUPID NE 'O' AND T'&USERID EQ 'O').ERR14       @L8A 07090000
.ERTN14  ANOP                                                      @L8A 07099000
.*                                                                 @M4A 07108000
.* VOLSER, OLDVOL, INSTLN, OWNER, ACCLVL, ACEE, APPL, FILESEQ ARE  @M4A 07117000
.* INVALID IF SPECIFIED FOR THE LFI EXPANSION.                     @M4A 07126000
.*                                                                 @M4A 07135000
         AIF   (&ICHLFS AND ('&VOLSER' NE '' OR '&OLDVOL' NE '' OR     -07144000
                '&INSTLN' NE '' OR '&OWNER' NE '' OR '&ACCLVL' NE      -07153000
                '' OR '&ACEE' NE '' OR '&APPL' NE '')).ERR15A      @M4A 07162000
         AIF   (&ICHLFS AND ('&FILESEQ' NE '')).ERR15A             @M4A 07171000
.ERTN15A ANOP                                                      @M4A 07180000
.*                                                                 @M4A 07189000
.* REGISTER SPECIFICATION OF ADDR TYPE PARAMETERS NOT ALLOWED WITH LIST 07200000
.* FORM                                                                 07250000
         AIF   ('&MF' NE 'L').ERTN07                           @YA12773 07300000
         AIF   ('&INSTLN(1)' NE '&INSTLN').ERR07                        07350000
.RCHK006 ANOP                                                           07400000
         AIF   ('&CMENTY1' EQ '').RCHK010                          @M3C 07450000
         AIF   ('&CMENTY1'(1,1) EQ '(').ERR07                      @M3C 07500000
.RCHK010 ANOP                                                           07550000
         AIF   ('&CLASS' EQ '').RCHK020                                 07600000
         AIF   ('&CLASS'(1,1) EQ '(').ERR07                             07650000
.RCHK020 ANOP                                                           07700000
         AIF   ('&PROFILE' EQ '').RCHK030                               07750000
         AIF   ('&PROFILE'(1,1) EQ '(').ERR07                           07800000
.RCHK030 ANOP                                                           07850000
         AIF   ('&VOLSER' EQ '').RCHK060                                07900000
         AIF   ('&VOLSER'(1,1) EQ '(').ERR07                            07950000
.RCHK060 ANOP                                                           08000000
         AIF   ('&OLDVOL' EQ '').RCHK065                       @PC002PY 08050000
         AIF   ('&OLDVOL'(1,1) EQ '(').ERR07                   @PC002PY 08100000
.RCHK065 ANOP                                                           08150000
         AIF   ('&ATTR' EQ '').RCHK070                         @PC002PY 08200000
         AIF   ('&ATTR'(1,1) EQ '(').ERR07                     @PC002PY 08250000
.RCHK070 ANOP                                                           08300000
         AIF   ('&APPL' EQ '').RCHK075                         @PC003PY 08350000
         AIF   ('&APPL'(1,1) EQ '(').ERR07                     @PC003PY 08400000
.RCHK075 ANOP                                                  @PC003PY 08450000
         AIF   ('&ACEE' EQ '').RCHK080                         @PC003PY 08500000
         AIF   ('&ACEE'(1,1) EQ '(').ERR07                     @PC003PY 08550000
.RCHK080 ANOP                                                  @PC003PY 08600000
         AIF   ('&OWNER' EQ '').RCHK090                          @L4A   08650000
         AIF   ('&OWNER'(1,1) EQ '(').ERR07                      @L4A   08700000
.RCHK090 ANOP  ,                                                 @L4A   08750000
         AIF   ('&ACCLVL' EQ '').RCHK096                         @L7A   08800000
         AIF   (T'&ACCLVL(1) EQ 'O').RCHK095                     @L5A   08850000
         AIF   ('&ACCLVL(1)'(1,1) EQ '(').ERR07                  @L5A   08900000
.RCHK095 ANOP  ,                                                 @L4A   08950000
         AIF   (N'&ACCLVL EQ 1).RCHK096                          @L7A   09000000
         AIF   (T'&ACCLVL(2) EQ 'O').RCHK096                     @L7A   09050000
         AIF   ('&ACCLVL(2)'(1,1) EQ '(').ERR07                  @L5A   09100000
.RCHK096 ANOP                                                    @L7A   09150000
         AIF   ('&FILESEQ' EQ '').RCHK100                        @L7A   09200000
         AIF   ('&FILESEQ'(1,1) EQ '(').ERR07                    @L7A   09250000
.RCHK100 ANOP                                                  @PC003PY 09300000
         AIF   ('&USERID' EQ '').RCHK105                           @L8A 09302200
         AIF   ('&USERID'(1,1) EQ '(').ERR07                       @L8A 09304400
.RCHK105 ANOP                                                      @L8A 09306600
         AIF   ('&GROUPID' EQ '').RCHK110                          @L8A 09308800
         AIF   ('&GROUPID'(1,1) EQ '(').ERR07                      @L8A 09311000
.RCHK110 ANOP                                                      @L8A 09313200
         AIF   ('&DDNAME' EQ '').RCHK115                       @YA12773 09315400
         AIF   ('&DDNAME'(1,1) EQ '(').ERR07                   @YA12773 09317600
.RCHK115 ANOP                                                  @YA12773 09319800
         AIF   ('&LOGSTR' EQ '').RCHK120                           @M2A 09322000
         AIF   ('&LOGSTR'(1,1) EQ '(').ERR07                       @M2A 09324200
.RCHK120 ANOP                                                     3@D1D 09326400
         AIF   ('&UTOKEN' EQ '').RCHK130                           @M2A 09328600
         AIF   ('&UTOKEN'(1,1) EQ '(').ERR07                       @M2A 09330800
.RCHK130 ANOP                                                      @M2A 09333000
         AIF   ('&RTOKEN' EQ '').RCHK135                           @M2A 09335200
         AIF   ('&RTOKEN'(1,1) EQ '(').ERR07                       @M2A 09337400
.RCHK135 ANOP                                                      @M2A 09339600
         AIF   ('&RECVR' EQ '').RCHK140                            @M2A 09341800
         AIF   ('&RECVR'(1,1) EQ '(').ERR07                        @M2A 09344000
.RCHK140 ANOP                                                      @M2A 09346200
.ERTN07  ANOP                                                           09350000
.* PRODUCE LIST FORM IF REQUESTED                                       09400000
         AIF   ('&MF' NE 'L').RCHK430                                   09450000
         AIF   ('&SYMBOL' EQ '').RCHK160                                09500000
&SYMBOL  DS    0F                                                       09550000
         AGO   .RCHK16Y                                          @L4A   09600000
.RCHK160 ANOP                                                           09650000
         DS    0F                                                @L4A   09700000
.RCHK16Y ANOP  ,                                                 @L4A   09750000
ICH0&SYSNDX EQU *                                                       09800000
.RCHK16X ANOP                                                           09850000
.* PRODUCE LENGTH AND INSTALLATION DATA                                 09900000
.****** IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO            @T1A 09950000
.****** THE 3 BYTES AFTER LENGTH ARE RESERVED, AND INSTLN IS       @T1A 10000000
.****** GENERATED AT THE END OF THE LIST.                          @T1A 10050000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK16A               @M3C 10100000
&ICHL    DC    AL1(&PARMLEN)    LENGTH OF RACHECK PARAMETER LIST   @L7A 10150000
         DC    AL3(0)                                              @T1A 10200000
         AGO   .RCHK162         PRODUCE 1ST FLAG BYTE              @T1A 10250000
.RCHK16A ANOP                                                      @T1A 10300000
         DC    AL1(&PARMLEN)    LENGTH OF RACHECK PARAMETER LIST   @L7A 10350000
         AIF   ('&INSTLN' EQ '' OR                                     *10400000
               '&INSTLN(1)' NE '&INSTLN').RCHK161              @PC002PY 10450000
         DC    AL3(&INSTLN) - ADDRESS OF INSTALLATION DATA              10500000
         AGO   .RCHK162                                                 10550000
.RCHK161 ANOP                                                           10600000
         DC    AL3(0) - ADDRESS OF INSTALLATION DATA                    10650000
.RCHK162 ANOP                                                           10700000
.* PRODUCE FIRST FLAG BYTE IN LIST                                      10750000
         AIF   (T'&RACFIND EQ 'O').RCHK166                         @L5A 10800000
&BIT0    SETA  1                   RACFIND CODED                   @L5A 10850000
         AIF   ('&RACFIND' NE 'YES').RCHK166                       @L5A 10900000
&BIT1    SETA  1                   RACFIND=YES                     @L5A 10950000
.RCHK166 ANOP                                                      @L5A 11000000
&BIT2    SETA  &LONGNAM           INDICATE ENTITYX IS SPECIFIED.   @M3A 11050000
         AIF   ('&CMENTY2' NE 'CSA').RCHK170                       @M3C 11100000
&BIT7    SETA  1                                               @PC002PY 11150000
.RCHK170 ANOP                                                           11200000
         AIF   ('&DSTYPE' NE 'V').RCHK180                          @T1A 11250000
&BIT3    SETA  1                                                        11300000
.RCHK180 ANOP                                                      @T1A 11350000
.**************************************************                @T1A 11400000
.* IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO,                @T1A 11450000
.* THE PARAMETER LIST HAS 31-BIT ADDRESSING.                       @T1A 11500000
.**************************************************                @T1A 11550000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK200               @M3C 11600000
&BIT4    SETA  1                  31-BIT ADDRESSING IN PARM LIST   @T1A 11650000
.RCHK200 ANOP                                                           11700000
         AIF   ('&LOG' NE 'NOFAIL' AND                                 -11750000
               '&LOG' NE 'NOSTAT').RCHK220                     @ZA60572 11800000
&BIT5    SETA  1                                                        11850000
.RCHK220 ANOP                                                           11900000
         AIF   ('&LOG' NE 'NONE' AND                                   -11950000
               '&LOG' NE 'NOSTAT').RCHK230                     @ZA60572 12000000
&BIT6    SETA  1                                                        12050000
.RCHK230 ANOP                                                           12100000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7'              12150000
.****** IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO            @T1A 12200000
.****** THE NEXT 3 BYTES ARE RESERVED AND ENTITY AND PROFILE       @T1A 12250000
.****** GENERATED AT THE END OF THE LIST.                          @T1A 12300000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK235               @M3C 12350000
         DC    AL3(0)                                              @T1A 12400000
         AGO   .RCHK270                                            @T1A 12450000
.RCHK235 ANOP                                                      @T1A 12500000
.* PRODUCE ENTITY NAME OR PROFILE ADDRESS                      @PC002PY 12550000
         AIF   ('&CMENTY1' EQ '').RCHK240                          @M3C 12600000
         AIF   ('&CMENTY1'(1,1) EQ '(').RCHK240                    @M3C 12650000
         DC    AL3(&CMENTY1)         - ENTITY/ENTITYX NAME ADDRESS @M3C 12700000
         AGO   .RCHK270                                                 12750000
.RCHK240 ANOP                                                           12800000
         AIF   ('&PROFILE' EQ '').RCHK260                               12850000
         AIF   ('&PROFILE'(1,1) EQ '(').RCHK260                         12900000
         DC    AL3(&PROFILE) -PROFILE ADDRESS                           12950000
         AGO   .RCHK270                                                 13000000
.RCHK260 ANOP                                                           13050000
         DC    AL3(0) -       ENTITY OR PROFILE ADDRESS FIELD  @PC002PY 13100000
.RCHK270 ANOP                                                           13150000
.* PRODUCE SECOND FLAG BYTE WITH ATTR PARAMETER                         13200000
.* RESET BIT SET SYMBOLS                                                13250000
&BIT0    SETA  0                                                        13300000
&BIT1    SETA  0                                                        13350000
&BIT2    SETA  0                                                        13400000
&BIT3    SETA  0                                                        13450000
&BIT4    SETA  0                                                        13500000
&BIT5    SETA  0                                                        13550000
&BIT6    SETA  0                                                        13600000
&BIT7    SETA  0                                                        13650000
         AIF   ('&ATTR' EQ '').RCHK335                                  13700000
         AIF   ('&ATTR'(1,1) EQ '(').RCHK340                            13750000
         AIF   ('&ATTR' NE 'ALTER').RCHK280                             13800000
&BIT0    SETA  1                                                        13850000
         AGO   .RCHK340                                                 13900000
.RCHK280 ANOP                                                           13950000
         AIF   ('&ATTR' NE 'CONTROL').RCHK320                           14000000
&BIT4    SETA  1                                                        14050000
         AGO   .RCHK340                                                 14100000
.RCHK320 ANOP                                                           14150000
         AIF   ('&ATTR' NE 'UPDATE').RCHK330                            14200000
&BIT5    SETA  1                                                        14250000
         AGO   .RCHK340                                                 14300000
.RCHK330 ANOP                                                           14350000
         AIF   ('&ATTR' NE 'READ').RCHK340                              14400000
.RCHK335 ANOP                                                           14450000
&BIT6    SETA  1                                                        14500000
.RCHK340 ANOP                                                           14550000
         DC    B'&BIT0.000&BIT4&BIT5&BIT6.0'                       @Q1C 14600000
.****** IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO            @T1A 14650000
.****** THE NEXT 3 BYTES ARE RESERVED AND CLASS NAME ADDR IS       @T1A 14700000
.****** GENERATED AT THE END OF THE LIST.                          @T1A 14750000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK345               @M3C 14800000
         DC    AL3(0)                                              @T1A 14850000
         AGO   .RCHK370                                            @T1A 14900000
.RCHK345 ANOP                                                      @T1A 14950000
.* PRODUCE CLASS NAME ADDRESS IF REQUIRED                               15000000
         AIF   ('&CLASS' EQ '').RCHK360                                 15050000
         AIF   ('&CLASS'(1,1) EQ '(').RCHK360                           15100000
         AIF   ('&CLASS'(1,1) EQ '''').RCHK350                          15150000
         DC    AL3(&CLASS) -  CLASS NAME ADDRESS                        15200000
         AGO   .RCHK370                                                 15250000
.RCHK350 ANOP                                                           15300000
         DC    AL3(ICH1&SYSNDX) CLASS NAME ADDRESS WITHIN LIST @PC003PY 15350000
         AGO   .RCHK370                                                 15400000
.RCHK360 ANOP                                                           15450000
         DC    AL3(0) -       CLASS NAME ADDRESS FIELD                  15500000
.RCHK370 ANOP                                                           15550000
.* PRODUCE THIRD FLAG BYTE                                              15600000
&BIT0    SETA  0                                                   @L7A 15650000
&BIT1    SETA  0                                                   @L4A 15700000
&BIT2    SETA  0                                                        15750000
&BIT3    SETA  0                                                   @L6A 15800000
&BIT4    SETA  0                                                   @L6A 15850000
&BIT5    SETA  0                                                   @L6A 15900000
&BIT6    SETA  0                                                   @P1A 15925000
         AIF   ('&DSTYPE' NE 'M' AND '&DSTYPE' NE 'T').RCHK372     @L7A 15950000
         AIF   ('&DSTYPE' NE 'M').RCHK371                          @L7A 16000000
&BIT1    SETA  1                            DSTYPE=M X'40'         @L4A 16050000
         AGO   .RCHK372                                            @L7A 16100000
.RCHK371 ANOP                                                      @L7A 16150000
&BIT0    SETA  1                            DSTYPE=T X'80'         @L7A 16200000
.RCHK372 AIF   ('&PROFILE' EQ '').RCHK373                               16250000
&BIT2    SETA  1                                                        16300000
.RCHK373 ANOP                                                           16350000
         AIF   ('&GENERIC' EQ '' OR '&GENERIC' EQ 'ASIS').RCHK374  @L6A 16400000
&BIT5    SETA  1         GENERIC=YES SPECIFIED                     @L6A 16450000
.RCHK374 ANOP  ,                                                   @L6A 16500000
         AIF   ('&CMENTY2' NE 'PRIVATE').RCHK375                   @M3C 16520000
&BIT6    SETA  1           ENTITY/ENTITYX=(...,PRIVATE) SPECIFIED  @P1A 16540000
.RCHK375 ANOP  ,                                                   @P1A 16560000
         DC    B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6.0' 3RD FLAGS  @P1C 16580000
.****** IF THIS MACRO WAS INVOKED BY THE RACROUTE MACRO            @T1A 16600000
.****** THE NEXT 3 BYTES ARE RESERVED AND VOLSER ADDR IS           @T1A 16650000
.****** GENERATED AT THE END OF THE LIST.                          @T1A 16700000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK380               @M3C 16750000
         DC    AL3(0)                                              @T1A 16800000
         AGO   .RCHK410                                            @T1A 16850000
.RCHK380 ANOP                                                      @T1A 16900000
         AIF   ('&VOLSER' EQ '').RCHK400                                16950000
         AIF   ('&VOLSER'(1,1) EQ '(').RCHK400                          17000000
         DC    AL3(&VOLSER) - VOLSER ADDRESS                            17050000
         AGO   .RCHK410                                                 17100000
.RCHK400 ANOP                                                           17150000
         DC    AL3(0) -       VOLSER ADDR FIELD                         17200000
.RCHK410 ANOP                                                           17250000
         AIF   ('&OLDVOL' EQ '').RCHK415                       @PC002PY 17300000
         AIF   ('&OLDVOL'(1,1) EQ '(').RCHK415                 @PC002PY 17350000
         DC    A(&OLDVOL) - OLD VOLSER ADDRESS                 @PC002PY 17400000
         AGO   .RCHK416                                        @PC002PY 17450000
.RCHK415 ANOP                                                  @PC002PY 17500000
         DC    A(0) -       OLD VOLSER ADDR FIELD              @PC002PY 17550000
.RCHK416 ANOP                                                  @PC002PY 17600000
         AIF   ('&APPL' EQ '').RCHK41B                         @PC003PY 17650000
         AIF   ('&APPL'(1,1) EQ '(').RCHK41B                   @PC003PY 17700000
         AIF   ('&APPL'(1,1) EQ '''').RCHK41A                  @PC003PY 17750000
         DC    A(&APPL) - APPL NAME ADDRESS                    @PC003PY 17800000
         AGO   .RCHK41C                                        @PC003PY 17850000
.RCHK41A ANOP                                                  @PC003PY 17900000
         DC    A(ICH2&SYSNDX) - APPL NAME ADDRESS              @PC003PY 17950000
         AGO   .RCHK41C                                        @PC003PY 18000000
.RCHK41B ANOP                                                  @PC003PY 18050000
         DC    A(0)     - APPL ADDRESS                         @PC003PY 18100000
.RCHK41C ANOP                                                  @PC003PY 18150000
         AIF   ('&ACEE' EQ '').RCHK41D                         @PC003PY 18200000
         AIF   ('&ACEE'(1,1) EQ '(').RCHK41D                   @PC003PY 18250000
         DC    A(&ACEE) - ACEE NAME ADDRESS                    @PC003PY 18300000
         AGO   .RCHK41E                                        @PC003PY 18350000
.RCHK41D ANOP                                                  @PC003PY 18400000
         DC    A(0)     - ACEE ADDRESS                         @PC003PY 18450000
.RCHK41E ANOP                                                  @PC003PY 18500000
         AIF   ('&OWNER' EQ '').RCHK41F                          @L4A   18550000
         AIF   ('&OWNER'(1,1) EQ '(').RCHK41F                    @L4A   18600000
         DC    A(&OWNER) - OWNER NAME ADDRESS.                   @L4A   18650000
         AGO   .RCHK41G                                          @L4A   18700000
.RCHK41F ANOP  ,                                                 @L4A   18750000
         DC    A(0)     - OWNER ADDRESS.                         @L4A   18800000
.RCHK41G ANOP  ,                                                 @L4A   18850000
.******************************************************            @T1A 18900000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 18950000
.* MACRO, INSTLN,CLASS,ENTITY,PROFILE,AND VOLSER ARE               @T1A 19000000
.* PRODUCED HERE AS 31-BIT ADDRESSES.                              @T1A 19050000
.******************************************************            @T1A 19100000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK41Z               @M3C 19150000
.* PRODUCE INSTLN ADDRESS FIELD                                    @T1A 19200000
         AIF   ('&INSTLN' EQ '' OR                                     *19250000
               '&INSTLN(1)' NE '&INSTLN').RCHK41H                  @T1A 19300000
         DC    A(&INSTLN)   ADDRESS OF INSTALLATION DATA           @T1A 19350000
         AGO   .RCHK41J                                            @T1A 19400000
.RCHK41H ANOP                                                      @T1A 19450000
         DC    A(0)            ADDRESS OF INSTALLATION DATA        @T1A 19500000
.RCHK41J ANOP                                                      @T1A 19550000
.* PRODUCE ENTITY NAME OR PROFILE ADDRESS                          @T1A 19600000
         AIF   ('&CMENTY1' EQ '').RCHK41K                          @M3C 19650000
         AIF   ('&CMENTY1'(1,1) EQ '(').RCHK41K                    @M3C 19700000
         DC    A(&CMENTY1)      ENTITY NAME ADDRESS                @M3C 19750000
         AGO   .RCHK41M                                            @T1A 19800000
.RCHK41K ANOP                                                      @T1A 19850000
         AIF   ('&PROFILE' EQ '').RCHK41L                          @T1A 19900000
         AIF   ('&PROFILE'(1,1) EQ '(').RCHK41L                    @T1A 19950000
         DC    A(&PROFILE)      PROFILE ADDRESS                    @T1A 20000000
         AGO   .RCHK41M                                            @T1A 20050000
.RCHK41L ANOP                                                      @T1A 20100000
         DC    A(0)             ENTITY OR PROFILE ADDRESS FIELD    @T1A 20150000
.RCHK41M ANOP                                                      @T1A 20200000
.* PRODUCE CLASS NAME ADDRESS IF REQUIRED                          @T1A 20250000
         AIF   ('&CLASS' EQ '').RCHK41P                            @T1A 20300000
         AIF   ('&CLASS'(1,1) EQ '(').RCHK41P                      @T1A 20350000
         AIF   ('&CLASS'(1,1) EQ '''').RCHK41N                     @T1A 20400000
         DC    A(&CLASS)       CLASS NAME ADDRESS                  @T1A 20450000
         AGO   .RCHK41Q                                            @T1A 20500000
.RCHK41N ANOP                                                      @T1A 20550000
         DC    A(ICH1&SYSNDX) CLASS NAME ADDRESS WITHIN LIST       @T1A 20600000
         AGO   .RCHK41Q                                            @T1A 20650000
.RCHK41P ANOP                                                      @T1A 20700000
         DC    A(0)            CLASS NAME ADDRESS FIELD            @T1A 20750000
.RCHK41Q ANOP                                                      @T1A 20800000
.* PRODUCE VOLSER ADDRESS FIELD                                    @T1A 20850000
         AIF   ('&VOLSER' EQ '').RCHK41R                           @T1A 20900000
         AIF   ('&VOLSER'(1,1) EQ '(').RCHK41R                     @T1A 20950000
         DC    A(&VOLSER)      VOLSER ADDRESS                      @T1A 21000000
         AGO   .RCHK41Z                                            @T1A 21050000
.RCHK41R ANOP                                                      @T1A 21100000
         DC    A(0)            VOLSER ADDR FIELD                   @T1A 21150000
.RCHK41Z ANOP                                                      @T1A 21200000
         AIF   (&ICHCOM).RCHK41Y                                   @M3A 21225000
         AIF   (&ICHRAC).RCHK41Y                                   @L5A 21250000
.* GENERATE FOUR UNUSED FULLWORDS FOR 31-BIT COMPATIBILITY         @L5A 21300000
         DC    4A(0)                                               @L5A 21350000
.RCHK41Y ANOP                                                      @L5A 21400000
         AIF   ('&ACCLVL' NE '').RCHKACH                         @L5A   21450000
         DC    A(0)     - ACCESS VALUE ADDRESS.                  @L5A   21500000
         DC    A(0)     - 2ND ACCESS ADDRESS.                    @L5A   21550000
         AGO   .RCHKACI                                          @L5A   21600000
.RCHKACH ANOP  ,                                                 @L5A   21650000
         AIF   (T'&ACCLVL(1) NE 'O').RCHKACJ                     @L5A   21700000
         DC    A(0)     - ACCESS VALUE ADDRESS.                  @L5A   21750000
         AGO   .RCHKACL                                          @L5A   21800000
.RCHKACJ ANOP  ,                                                 @L5A   21850000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RCHKACK                @L5A   21900000
         DC    A(0)     - ACCESS VALUE ADDRESS.                  @L5A   21950000
         AGO   .RCHKACL                                          @L5A   22000000
.RCHKACK ANOP  ,                                                 @L5A   22050000
         DC    A(&ACCLVL(1)) - ACCESS VALUE ADDRESS.             @L5A   22100000
.RCHKACL ANOP  ,                                                 @L5A   22150000
         AIF   (T'&ACCLVL(2) NE 'O').RCHKACM                     @L5A   22200000
         DC    A(0)     - 2ND ACCESS ADDRESS.                    @L5A   22250000
         AGO   .RCHKACI                                          @L5A   22300000
.RCHKACM ANOP  ,                                                 @L5A   22350000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RCHKACN                @L5A   22400000
         DC    A(0)     - 2ND ACCESS ADDRESS.                    @L5A   22450000
         AGO   .RCHKACI                                          @L5A   22500000
.RCHKACN ANOP  ,                                                 @L5A   22550000
         DC    A(&ACCLVL(2)) - 2ND ACCESS ADDRESS.               @L5A   22600000
.RCHKACI ANOP  ,                                                 @L5A   22650000
         AIF   (&RLVL LE 2).RLVLX21 BYPASS CODE IF 1.6 VERSION    @L7A  22700000
.* PRODUCE FILESEQ CONSTANT                                       @L7A  22750000
.RCHKADA ANOP                                                     @L7A  22800000
         AIF   ('&FILESEQ' EQ '').RCHKADD        FILESEQ OMITTED  @L7A  22850000
         AIF   ('&FILESEQ'(1,1) EQ '(').RCHKADD  REG SPEC         @L7A  22900000
         DC    AL2(&FILESEQ)    FILESEQ CONSTANT                  @L7A  22950000
         AGO   .RCHKADZ                                           @L7A  23000000
.RCHKADD ANOP                                                     @L7A  23050000
         DC    AL2(0)          FILESEQ                            @L7A  23100000
.RCHKADZ ANOP                                                     @L7A  23150000
.* PRODUCE TAPE FLAG BYTE   X'00'=STD X'01'=NL X'10'=BLP          @L7A  23200000
.RCHKAEA ANOP                                                     @L7A  23250000
&BIT0    SETA  0                                                  @L7A  23300000
&BIT1    SETA  0                                                  @L7A  23350000
         AIF   ('&TAPELBL' EQ '' OR '&TAPELBL' EQ 'STD').RCHKAEX  @L7A  23400000
         AIF   ('&TAPELBL' NE 'BLP').RCHKAED                      @L7A  23450000
&BIT0    SETA  1                            TAPELBL=BLP           @L7A  23500000
         AGO   .RCHKAEX                                           @L7A  23550000
.RCHKAED ANOP                                                     @L7A  23600000
&BIT1    SETA  1                            TAPELBL=NL            @L7A  23650000
.RCHKAEX ANOP                                                     @L7A  23700000
         DC    B'&BIT0&BIT1.000000'                               @L7A  23750000
.RCHKAEZ ANOP                                                     @L7A  23800000
.* PRODUCE FOURTH FLAG BYTE                                       @L7A  23850000
.RCHKAFA ANOP                                                     @L7A  23900000
&BIT0    SETA  0                                                  @L7A  23950000
&BIT1    SETA  0                                                  @D2A  23966600
&BIT2    SETA  0                                                  @D4A  23983200
         AIF   ('&STATUS' NE 'ERASE').RCHKAFX                     @L7A  24000000
&BIT0    SETA  1                          STATUS=ERASE     -X'80' @L7A  24050000
.RCHKAFX ANOP                                                     @L7A  24100000
         AIF   ('&STATUS' NE 'EVERDOM').RCHKEV4                   @D2A  24112500
&BIT1    SETA  1                          STATUS=EVERDOM   -X'40' @D2A  24125000
.RCHKEV4 ANOP                                                     @D2A  24137500
         AIF   ('&STATUS' NE 'WRITEONLY').RCHKACC                 @Q1C  24150000
&BIT2    SETA  1                          STATUS=WRITEONLY -X'20' @D4A  24162500
.RCHKACC ANOP                                                     @Q1A  24165600
         AIF   ('&STATUS' NE 'ACCESS').RCHKAFY                    @Q1A  24168700
&BIT3    SETA  1                          STATUS=ACCESS    -X'10' @Q1A  24171800
.RCHKAFY ANOP                                                     @D4A  24175000
         DC    B'&BIT0&BIT1&BIT2&BIT3.0000'                       @Q1C  24187500
.RCHKAFZ ANOP                                                     @L7A  24200000
         AIF   (&RLVL LE 3).RLVLX21  BYPASS IF 1.7 OR LOWER       @L8A  24200700
         AIF   ('&USERID' EQ '').RCHKB10  USERID OMITTED          @L8A  24201400
         AIF   ('&USERID'(1,1) EQ '(').RCHKB10                    @L8A  24202100
         AIF   ('&USERID'(1,1) EQ '''').RCHKB05                   @L8A  24202800
         DC    A(&USERID) - USER NAME ADDRESS                     @L8A  24203500
         AGO   .RCHKB15                                           @L8A  24204200
.RCHKB05 ANOP                                                     @L8A  24204900
         DC    A(ICH3&SYSNDX) - USER NAME ADDRESS                 @L8A  24205600
         AGO   .RCHKB15                                           @L8A  24206300
.RCHKB10 ANOP                                                     @L8A  24207000
         DC    A(0) - USER NAME ADDRESS                           @L8A  24207700
.RCHKB15 ANOP                                                     @L8A  24208400
         AIF   ('&GROUPID' EQ '').RCHKB25 GROUPID OMITTED         @L8A  24209100
         AIF   ('&GROUPID'(1,1) EQ '(').RCHKB25                   @L8A  24209800
         AIF   ('&GROUPID'(1,1) EQ '''').RCHKB20                  @L8A  24210500
         DC    A(&GROUPID) - GROUP NAME ADDRESS                   @L8A  24211200
         AGO   .RCHKB30                                           @L8A  24211900
.RCHKB20 ANOP                                                     @L8A  24212600
         DC    A(ICH4&SYSNDX) - GROUP NAME ADDRESS                @L8A  24213300
         AGO   .RCHKB30                                           @L8A  24214000
.RCHKB25 ANOP                                                     @L8A  24214700
         DC    A(0) - GROUP NAME ADDRESS                          @L8A  24215400
.RCHKB30 ANOP                                                     @L8A  24216100
         AIF   (&RLVL LT 6).RLVLX21  SKIP IF BEFORE 1.8X          @P4C  24216800
         AIF   ('&DDNAME' EQ '').RCHKB35 DDNAME  OMITTED      @YA12773  24217500
         AIF   ('&DDNAME'(1,1) EQ '(').RCHKB35                @YA12773  24218200
         DC    A(&DDNAME) - DDNAME ADDRESS                    @YA12773  24218900
         AGO   .RCHKB40                                       @YA12773  24219600
.RCHKB35 ANOP                                                 @YA12773  24220300
         DC    A(0) - DDNAME ADDRESS                          @YA12773  24221000
.RCHKB40 ANOP                                                 @YA12773  24221700
         AIF   (&RLVL LT 7).RLVL20X  SKIP IF BEFORE 1.9            @P6C 24222400
         DC    A(0) - RESERVED                                     @M2A 24223100
.RCHKB48 ANOP                                                      @M2A 24223800
         AIF   ('&UTOKEN' EQ '').RCHKB50 UTOKEN OMITTED            @M2A 24224500
         AIF   ('&UTOKEN'(1,1) EQ '(').RCHKB50                     @M2A 24225200
         DC    A(&UTOKEN)    - UTOKEN NAME ADDRESS                 @M2A 24225900
         AGO   .RCHKB55                                            @M2A 24226600
.RCHKB50 ANOP                                                      @M2A 24227300
         DC    A(0) - UTOKEN ADDRESS                               @M2A 24228000
.RCHKB55 ANOP                                                      @M2A 24228700
         AIF   ('&RTOKEN' EQ '').RCHKB57 RTOKEN OMITTED            @M2A 24229400
         AIF   ('&RTOKEN'(1,1) EQ '(').RCHKB57                     @M2A 24230100
         DC    A(&RTOKEN)    - RTOKEN  ADDRESS                     @M2A 24230800
         AGO   .RCHKB59                                            @M2A 24231500
.RCHKB57 ANOP                                                      @M2A 24232200
         DC    A(0) - RTOKEN ADDRESS                               @M2A 24232900
.RCHKB59 ANOP                                                      @M2A 24233600
         AIF   ('&LOGSTR' EQ '').RCHKB60 LOGSTR OMITTED            @M2A 24234300
         AIF   ('&LOGSTR'(1,1) EQ '(').RCHKB60                     @M2A 24235000
         DC    A(&LOGSTR)    - LOGSTR ADDRESS                      @M2A 24235700
         AGO   .RCHKB65                                            @M2A 24236400
.RCHKB60 ANOP                                                      @M2A 24237100
         DC    A(0) - LOGSTR ADDRESS                               @M2A 24237800
.RCHKB65 ANOP                                                      @M2A 24238500
         AIF   ('&RECVR' EQ '').RCHKB70 RECVR OMITTED              @M2A 24239200
         AIF   ('&RECVR'(1,1) EQ '(').RCHKB70                      @M2A 24239900
         DC    A(&RECVR)     - RECEIVER ADDRESS                    @M2A 24240600
         AGO   .RCHKB75                                            @M2A 24241300
.RCHKB70 ANOP                                                      @M2A 24242000
         DC    A(0) - RECEIVER ADDRESS                             @M2A 24242700
.RCHKB75 ANOP                                                      @M2A 24243400
         AGO   .RLVLX21                                            @P6A 24245000
.RLVL20X ANOP                                                      @P6A 24246600
         DC    4F'0'       RESERVED                                @P6A 24248200
.RLVLX21 ANOP                      END OF 1.6 BYPASS              @L7A  24250000
.* IF CLASSNAME SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM        24300000
         AIF   ('&CLASS' EQ '').RCHK417                                 24350000
         AIF   ('&CLASS'(1,1) NE '''').RCHK417                          24400000
&CLNGTH  SETA  K'&CLASS-2                                               24450000
ICH1&SYSNDX EQU   *+1                                          @PC003PY 24500000
         DC    AL2(&CLNGTH) - CLASS NAME LENGTH                         24550000
.* NOTE THAT TWO BYTES MUST BE RESERVED FOR ALIGNMENT OF SVC THAT MAY   24600000
.* FOLLOW IN STANDARD FORM USAGE                                        24650000
         DC    CL8&CLASS                                                24700000
.* IF APPLNAME SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM         24750000
.RCHK417 ANOP                                                  @PC003PY 24800000
         AIF   ('&APPL' EQ '').RCHK418                             @L8A 24850000
         AIF   ('&APPL'(1,1) NE '''').RCHK418                      @L8A 24900000
ICH2&SYSNDX DC    CL8&APPL                                     @PC003PY 24950000
.* IF USERID SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM     @L8A  24954500
.RCHK418 ANOP                                                     @L8A  24959000
         AIF   ('&USERID' EQ '').RCHK419                          @L8A  24963500
         AIF   ('&USERID'(1,1) NE '''').RCHK419                   @L8A  24968000
ICH3&SYSNDX DC    CL8&USERID                     - USER NAME      @L8A  24972500
.* IF GROUPID SPECIFIED EXPLICITLY, PRODUCE IT BELOW LIST FORM    @L8A  24977000
.RCHK419 ANOP                                                     @L8A  24981500
         AIF   ('&GROUPID' EQ '').RCHK420                         @L8A  24986000
         AIF   ('&GROUPID'(1,1) NE '''').RCHK420                  @L8A  24990500
ICH4&SYSNDX DC    CL8&GROUPID                   - GROUP NAME      @L8A  24995000
.* LIST FORM COMPLETE - TEST FOR STANDARD FORM PASS THROUGH LIST FORM   25000000
.RCHK420 ANOP                                                           25050000
         AIF   (&MFFLAG).RCHK520                                        25100000
         MEXIT                                                          25150000
.RCHK430 ANOP                                                           25200000
         AIF   ('&MF'(1,2) EQ '(E' OR '&MF'(1,2) EQ '(M').RCHK530  @P2C 25250000
.* STANDARD FORM REQUESTED                                              25300000
&SYMBOL  DS    0H                                                       25350000
&MFFLAG  SETB  1              SET TRUE FOR PASS THROUGH LIST FORM       25400000
.* PRODUCE INSTRUCTIONS TO MODIFY IN-LINE LIST FORM WITH REGISTER ADDRS 25450000
         AIF   ('&INSTLN' EQ '' OR '&INSTLN(1)' EQ '&INSTLN').RCHK431   25500000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK43A               @M3C 25550000
         ST    &INSTLN(1),ICH0&SYSNDX+32  STORE INSTLN DATA ADDR   @T1A 25600000
         AGO   .RCHK431                                            @T1A 25650000
.RCHK43A ANOP                                                      @T1A 25700000
         STCM  &INSTLN(1),7,ICH0&SYSNDX+1 -STORE INSTALLATION DATA ADDR 25750000
.RCHK431 ANOP                                                           25800000
         AIF   ('&CMENTY1' EQ '').RCHK440                          @M3C 25850000
         AIF   ('&CMENTY1'(1,1) NE '(').RCHK440                    @M3C 25900000
&SUBSTR  SETC  '&CMENTY1'(2,K'&CMENTY1-2)                          @M3C 25950000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK435               @M3C 26000000
         ST    &SUBSTR,ICH0&SYSNDX+36     STORE ENTITY NAME ADDR   @T1A 26050000
         AGO   .RCHK440                                            @T1A 26100000
.RCHK435 ANOP                                                      @T1A 26150000
         STCM  &SUBSTR,7,ICH0&SYSNDX+5 - STORE ENTITY NAME ADDRESS      26200000
.RCHK440 ANOP                                                           26250000
         AIF   ('&PROFILE' EQ '').RCHK460                               26300000
         AIF   ('&PROFILE'(1,1) NE '(').RCHK460                         26350000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK450               @M3C 26400000
         ST    &PROFILE(1),ICH0&SYSNDX+36     STORE PROFILE ADDR   @T1A 26450000
         AGO   .RCHK460                                            @T1A 26500000
.RCHK450 ANOP                                                      @T1A 26550000
         STCM  &PROFILE(1),7,ICH0&SYSNDX+5 - STORE PROFILE ADDRESS      26600000
.RCHK460 ANOP                                                           26650000
         AIF   ('&CLASS' EQ '').RCHK470                                 26700000
         AIF   ('&CLASS'(1,1) NE '(').RCHK470                           26750000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK465               @M3C 26800000
         ST    &CLASS(1),ICH0&SYSNDX+40    STORE CLASS NAME ADDR   @T1A 26850000
         AGO   .RCHK470                                            @T1A 26900000
.RCHK465 ANOP                                                      @T1A 26950000
         STCM  &CLASS(1),7,ICH0&SYSNDX+9 - STORE CLASS NAME ADDRESS     27000000
.RCHK470 ANOP                                                           27050000
         AIF   ('&ATTR' EQ '').RCHK495                                  27100000
         AIF   ('&ATTR'(1,1) NE '(').RCHK495                            27150000
         STC   &ATTR(1),ICH0&SYSNDX+8 - STORE ATTR VALUE                27200000
.RCHK495 ANOP                                                           27250000
         AIF   ('&VOLSER' EQ '').RCHK500                                27300000
         AIF   ('&VOLSER'(1,1) NE '(').RCHK500                          27350000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK498               @M3C 27400000
         ST    &VOLSER(1),ICH0&SYSNDX+44    STORE VOLSER ADDR      @T1A 27450000
         AGO   .RCHK500                                            @T1A 27500000
.RCHK498 ANOP                                                      @T1A 27550000
         STCM  &VOLSER(1),7,ICH0&SYSNDX+13 - STORE VOLSER ADDRESS       27600000
.RCHK500 ANOP                                                           27650000
         AIF   ('&OLDVOL' EQ '').RCHK501                       @PC002PY 27700000
         AIF   ('&OLDVOL'(1,1) NE '(').RCHK501                 @PC002PY 27750000
         ST    &OLDVOL(1),ICH0&SYSNDX+16 - STORE OLD VOLSER    @PC002PY 27800000
.RCHK501 ANOP                                                           27850000
         AIF   ('&APPL' EQ '').RCHK502                         @PC003PY 27900000
         AIF   ('&APPL'(1,1) NE '(').RCHK502                   @PC003PY 27950000
         ST    &APPL(1),ICH0&SYSNDX+20 - STORE APPL ADDRESS    @PC003PY 28000000
.RCHK502 ANOP                                                  @PC003PY 28050000
         AIF   ('&ACEE' EQ '').RCHK503                         @PC003PY 28100000
         AIF   ('&ACEE'(1,1) NE '(').RCHK503                   @PC003PY 28150000
         ST    &ACEE(1),ICH0&SYSNDX+24 - STORE ACEE ADDRESS    @PC003PY 28200000
.RCHK503 ANOP                                                  @PC003PY 28250000
         AIF   ('&OWNER' EQ '').RCHK504                          @L4A   28300000
         AIF   ('&OWNER'(1,1) NE '(').RCHK504                    @L4A   28350000
         ST    &OWNER(1),ICH0&SYSNDX+28 - STORE OWNER ADDRESS.   @L4A   28400000
.RCHK504 ANOP  ,                                                 @L4A   28450000
         AIF   ('&ACCLVL' EQ '').RCHK506                         @L5A   28500000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RCHK505                @L5A   28550000
         AIF   (T'&ACCLVL(1) EQ 'O').RCHK505                     @L5A   28600000
         ST    &ACCLVL(1),ICH0&SYSNDX+48 - STORE ACCESS ADDRESS. @L5A   28650000
.RCHK505 ANOP  ,                                                 @L5A   28700000
         AIF   (T'&ACCLVL(2) EQ 'O').RCHK506                     @L5A   28750000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RCHK506                @L5A   28800000
         ST    &ACCLVL(2),ICH0&SYSNDX+52 - STORE 2ND ACC ADDR.   @L5A   28850000
.RCHK506 ANOP  ,                                                 @L5A   28900000
         AIF   ('&FILESEQ' EQ '').RCHK507                        @L7A   28950000
         AIF   ('&FILESEQ'(1,1) NE'(').RCHK507                   @L7A   29000000
         STH   &FILESEQ(1),ICH0&SYSNDX+56   STORE FILESEQ NUM    @L7A   29050000
.RCHK507 ANOP                                                    @L7A   29100000
         AIF   ('&USERID' EQ '').RCHK508                         @L8A   29101600
         AIF   ('&USERID'(1,1) NE '(').RCHK508                   @L8A   29103200
         ST    &USERID(1),ICH0&SYSNDX+60 - STORE USER ADDRESS    @L8A   29104800
.RCHK508 ANOP                                                    @L7A   29106400
         AIF   ('&GROUPID' EQ '').RCHK509                        @L8A   29108000
         AIF   ('&GROUPID'(1,1) NE '(').RCHK509                  @L8A   29109600
         ST    &GROUPID(1),ICH0&SYSNDX+64 - STORE GROUP ADDRESS  @L8A   29111200
.RCHK509 ANOP                                                    @L7A   29112800
         AIF   (&RLVL LT 6).RCHK510  SKIP IF BEFORE 1.8X     @YA12773   29114400
         AIF   ('&DDNAME' EQ '').RCHK510                     @YA12773   29116000
         AIF   ('&DDNAME'(1,1) NE '(').RCHK510               @YA12773   29117600
         ST    &DDNAME(1),ICH0&SYSNDX+68 - STORE DDNAME ADDR @YA12773   29119200
.RCHK510 ANOP                                                @YA12773   29120800
         AIF   ('&UTOKEN' EQ '').RCHK512                          4@D1D 29122400
         AIF   ('&UTOKEN'(1,1) NE '(').RCHK512                     @M2A 29124000
         ST    &UTOKEN(1),ICH0&SYSNDX+76 - STORE UTOKEN ADDRESS    @M2A 29125600
.RCHK512 ANOP                                                      @M2A 29127200
         AIF   ('&RTOKEN' EQ '').RCHK513                           @M2A 29128800
         AIF   ('&RTOKEN'(1,1) NE '(').RCHK513                     @M2A 29130400
         ST    &RTOKEN(1),ICH0&SYSNDX+80 - STORE RTOKEN ADDRESS    @M2A 29132000
.RCHK513 ANOP                                                      @M2A 29133600
         AIF   ('&LOGSTR' EQ '').RCHK514                           @M2A 29135200
         AIF   ('&LOGSTR'(1,1) NE '(').RCHK514                     @M2A 29136800
         ST    &LOGSTR(1),ICH0&SYSNDX+84 - STORE LOGSTR ADDRESS    @M2A 29138400
.RCHK514 ANOP                                                      @M2A 29140000
         AIF   ('&RECVR' EQ '').RCHK515                            @M2A 29141600
         AIF   ('&RECVR'(1,1) NE '(').RCHK515                      @M2A 29143200
         ST    &RECVR(1),ICH0&SYSNDX+88 - STORE RECVR ADDRESS      @M2A 29144800
.RCHK515 ANOP                                                      @M2A 29146400
.* LIST FORM MODIFICATION COMPLETE - PRODUCE LIST FORM WITH BAL AROUND  29150000
         CNOP  0,4                                                      29200000
&OFFSET  SETA  &PARMLEN+4                                        @L7A   29250000
         AIF   ('&CLASS' EQ '').RCHK518                                 29300000
         AIF   ('&CLASS'(1,1) NE '''').RCHK518                          29350000
&OFFSET  SETA  &OFFSET+10                                      @PC003PY 29400000
.RCHK518 ANOP                                                           29450000
         AIF   ('&APPL' EQ '').RCHK519                         @PC003PY 29500000
         AIF   ('&APPL'(1,1) NE '''').RCHK519                  @PC003PY 29550000
&OFFSET  SETA  &OFFSET+8                                       @PC003PY 29600000
.RCHK519 ANOP                                                           29610000
         AIF   ('&USERID' EQ '').RCHK51A                           @L8A 29620000
         AIF   ('&USERID'(1,1) NE '''').RCHK51A                    @L8A 29630000
&OFFSET  SETA  &OFFSET+8                                           @L8A 29640000
.RCHK51A ANOP                                                           29650000
         AIF   ('&GROUPID' EQ '').RCHK51B                          @L8A 29660000
         AIF   ('&GROUPID'(1,1) NE '''').RCHK51B                   @L8A 29670000
&OFFSET  SETA  &OFFSET+8                                       @PC003PY 29680000
.RCHK51B ANOP                                                  @PC003PY 29690000
         BAL   1,*+&OFFSET -  POINT REG 1 AT PARM LIST                  29700000
         AGO   .RCHK160                                                 29750000
.RCHK520 ANOP                                                           29800000
.************************************************************      @T1A 29850000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 29900000
.* MACRO, SIMPLY EXIT RATHER  THAN GOING TO THE RACF ROUTINE.      @T1A 29950000
.************************************************************      @T1A 30000000
         AIF   (&ICHRAC).RCHK525                                   @T1A 30050000
         AIF   ('&MF'(1,2) EQ '(M').RCHK525 SKIP SVC FOR MF=M      @P2A 30075000
.* RETURN FROM LIST FORM TO PRODUCE SVC                                 30100000
         SVC   130               INVOKE RACHECK SVC ROUTINE             30150000
         AIF   (NOT &RLVLCHK).RCHK525                              @L7A 30200000
&ICHRLVL DS    0H                                                  @L7A 30250000
.RCHK525 ANOP                                                      @T1A 30300000
         MEXIT                                                          30350000
.RCHK530 ANOP                                                           30400000
.* PRODUCE EXECUTE FORM OF MACRO                                        30450000
         AIF   (&ICHRAC).RCK530A                                   @T1A 30500000
&SYMBOL  IHBINNRA &MF(2) -    POINT REG1 AT LIST FORM                   30550000
         AGO   .RCHK53A                                            @T1A 30600000
.***********************************************************       @T1A 30650000
.* IF THIS MACRO IS BEING INVOKED INTERNALLY BY THE RACROUTE       @T1A 30700000
.* MACRO, PICK UP THE ADDRESS OF THE RACHECK PARAMETER LIST        @T1A 30750000
.* FROM THE RACROUTE PARAMETER LIST.                               @T1A 30800000
.***********************************************************       @T1A 30850000
.RCK530A ANOP                                                      @T1A 30900000
         A     1,36(1)        POINT REG 1 AT RACHECK LIST          @T1A 30950000
.RCHK53A ANOP                                                      @T1A 31000000
.* IF REQUESTED, CHECK SIZE OF LIST-FORM VS. EXECUTE-FORM          @L7A 31050000
         AIF   (NOT &RLVLCHK).RLVLX20                              @L7A 31100000
         CLI   0(1),&RLVLSZ(&RLVL) L-FORM LARGE ENOUGH?            @L7A 31150000
         BNL   *+12                YES                             @L7A 31200000
         LA    15,100              SET INCOMPATIBLE MACROS R.C.    @L7A 31250000
         B     &ICHRLVL                                            @L7A 31300000
.RLVLX20 ANOP                                                      @L7A 31350000
.* PRODUCE INSTRUCTIONS TO MODIFY LIST                                  31400000
.* PRODUCE INSTALLATION DATA ADDRESS                                    31450000
         AIF   ('&INSTLN' EQ '').RCHK531                                31500000
         AIF   ('&INSTLN'(1,1) NE '(').RCHK532                          31550000
         AIF   (NOT &ICHRAC).RCHK53B                               @T1A 31600000
         ST    &INSTLN(1),32(1)    STORE INSTALLATION ADDR         @T1A 31650000
         AGO   .RCHK531                                            @T1A 31700000
.RCHK53B ANOP                                                      @T1A 31750000
         STCM  &INSTLN(1),7,1(1) - STORE INSTALLATION ADDR              31800000
         AGO   .RCHK531                                                 31850000
.RCHK532 ANOP                                                           31900000
         LA    0,&INSTLN - ADDRESS INSTALLATION DATA ADDRESS            31950000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK53C               @M3C 32000000
         ST    0,32(1)    STORE INSTALLATION ADDR                  @T1A 32050000
         AGO   .RCHK531                                            @T1A 32100000
.RCHK53C ANOP                                                      @T1A 32150000
         STCM  0,7,1(1) - STORE INSTALLATION DATA ADDRESS               32200000
.RCHK531 ANOP                                                           32250000
.* FLAGS FIELD                                                          32300000
&BIT2    SETA  0                                                   @M3A 32312500
&BIX2    SETA  1                                                   @M3A 32325000
         AIF   ('&ENTITY' EQ '').NSTFLG1                           @M3A 32337500
         AIF   ('&CMENTY2' NE '').RCHK535                          @Q7A 32340600
         NI    12(1),B'11011111'     TURN OFF PROFILE BIT          @Q7A 32343700
.RCHK535 ANOP                                                      @Q7A 32346800
&BIX2    SETA  0        - SET BIT TO FLAG ENTITYX IN 'M' FORM      @M3A 32350000
.NSTFLG1 ANOP                                                      @M3A 32362500
         AIF   ('&ENTITYX' EQ '').NSTFLG2                          @M3A 32375000
         AIF   ('&CMENTY2' NE '').RCHK537                          @Q7A 32378100
         NI    12(1),B'11011111'     TURN OFF PROFILE BIT          @Q7A 32381200
.RCHK537 ANOP                                                      @Q7A 32384300
&BIT2    SETA  1        - SET BIT TO FLAG ENTITYX IN 'M' FORM      @M3A 32387500
.NSTFLG2 ANOP                                                      @M3A 32400000
         AIF   ('&CMENTY2' EQ '' AND '&DSTYPE' EQ '' AND '&LOG' EQ     X32412500
                '' AND '&RACFIND' EQ '' AND '&CMENTY1' EQ '').RCHK616   32425000
.*                                                                 @M3C 32437500
&BIX0    SETA  1                   ASSUME THAT                     @L5A 32450000
&BIX1    SETA  1                     RACFIND IS NOT CODED          @L5A 32500000
         AIF   ('&RACFIND' EQ '').RCHK540                          @L5A 32550000
&BIX0    SETA  0                   RACFIND                         @L5A 32600000
&BIX1    SETA  0                     IS                            @L5A 32650000
&BIT0    SETA  1                       CODED                       @L5A 32700000
         AIF   ('&RACFIND' EQ 'NO').RCHK540                        @L5A 32750000
&BIT1    SETA  1                   RACFIND=YES CODED               @L5A 32800000
.RCHK540 ANOP                                                      @L5A 32850000
&BIX7    SETA  1                  ASSUME ENTITY(2) OMMITTED    @PC002PY 32900000
         AIF   ('&CMENTY2' EQ '').RCHK550          SKIP IF OMMITED @M3C 32950000
&BIX7    SETA  0                  CLEAR CSA BIT                @PC002PY 33000000
         AIF   ('&CMENTY2' NE 'CSA').RCHK550          SKIP NOT CSA @M3C 33050000
&BIT7    SETA  1                  SET CSA OPTION BIT           @PC002PY 33100000
.RCHK550 ANOP                                                           33150000
&BIX3    SETA  1                  ASSUME DSTYPE OMMITED        @PC002PY 33200000
         AIF   ('&DSTYPE' EQ '' ).RCHK580 SKIP IF OMMITED      @PC002PY 33250000
&BIX3    SETA  0                  CLEAR DSTYPE BIT             @PC002PY 33300000
         AIF   ('&DSTYPE' NE 'V' ).RCHK580 SKIP NOT VSAM       @PC002PY 33350000
&BIT3    SETA  1                  SET DSTYPE=V BIT             @PC002PY 33400000
.RCHK580 ANOP                                                           33450000
&BIX5    SETA  1                  ASSUME LOG OMITTED           @PC002PY 33500000
&BIX6    SETA  1                  ASSUME LOG OMMITED           @PC002PY 33550000
         AIF   ('&LOG' EQ '').RCHK610 SKIP IF OMITTED          @PC002PY 33600000
&BIX5    SETA  0                  CLEAR LOG BITS               @PC002PY 33650000
&BIX6    SETA  0                                               @PC002PY 33700000
         AIF   ('&LOG' NE 'NOFAIL' AND                                 -33750000
               '&LOG' NE 'NOSTAT').RCHK600                     @ZA60572 33800000
&BIT5    SETA  1                                                        33850000
.RCHK600 ANOP                                                           33900000
         AIF   ('&LOG' NE 'NONE' AND                                   -33950000
               '&LOG' NE 'NOSTAT').RCHK610                     @ZA60572 34000000
&BIT6    SETA  1                                                        34050000
.RCHK610 ANOP                                                           34100000
.******************************************************            @T1A 34150000
.* IF THIS MACRO WAS INVOKED INTERNALLY BY THE RACROUTE            @T1A 34200000
.* MACRO, THE PARAMETER LIST HAS 31-BIT ADDRESSING.                @T1A 34250000
.******************************************************            @T1A 34300000
&BIX4    SETA  0                  ASSUME 24-BIT ADDRESSING         @T1A 34350000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK615               @M3C 34400000
&BIT4    SETA  1                  31-BIT ADDRESSING                @T1A 34450000
.RCHK615 ANOP                                                      @T1A 34500000
         NI    4(1),B'&BIX0&BIX1&BIX2&BIX3&BIX4&BIX5&BIX6&BIX7'         34550000
         OI    4(1),B'&BIT0&BIT1&BIT2&BIT3&BIT4&BIT5&BIT6&BIT7' FLAGS   34600000
.RCHK616 ANOP                                                     @L7A  34650000
.* PRODUCE THIRD FLAG BYTE                                        @L7A  34700000
         AIF   (T'&DSTYPE EQ 'O' AND T'&GENERIC EQ 'O' AND             -34750000
               T'&PROFILE EQ 'O' AND '&CMENTY2' EQ '').RCHK624    @M3C  34800000
&BIT0    SETA  0                             X'80': DSTYPE=T      @L7A  34850000
&BIT1    SETA  0                             X'40': DSTYPE=M      @L7A  34900000
&BIT2    SETA  0                             X'20': PROFILE SPEC  @L7A  34950000
&BIT5    SETA  0                             X'04': GENERIC=YES   @L7A  35000000
&BIT6    SETA  0                            X'02': ENTITY=PRIVATE @P1A  35025000
&BIX0    SETA  1                                                  @L7A  35050000
&BIX1    SETA  1                                                  @L7A  35100000
&BIX2    SETA  1                                                  @L7A  35150000
&BIX5    SETA  1                                                  @L7A  35200000
&BIX6    SETA  1                                                  @P1A  35225000
         AIF   (T'&DSTYPE EQ 'O').RCHK618                         @L7A  35250000
&BIX0    SETA  0                                                  @L7A  35300000
&BIX1    SETA  0                                                  @L7A  35350000
         AIF   ('&DSTYPE' NE 'T' AND '&DSTYPE' NE 'M').RCHK618    @L7A  35400000
         AIF   ('&DSTYPE' EQ 'M').RCHK617                         @L7A  35450000
&BIT0    SETA  1                             DSTYPE=T CODED       @L7A  35500000
         AGO   .RCHK618                                           @L7A  35550000
.RCHK617 ANOP                                DSTYPE=M CODED       @L7A  35600000
&BIT1    SETA  1                                                  @L7A  35650000
.* PROCESS GENERIC                                                @L7A  35700000
.RCHK618 ANOP                                                     @L7A  35750000
         AIF   ('&GENERIC' NE 'YES').RCHK619                      @L7A  35800000
&BIT5    SETA  1                                                  @L7A  35850000
.RCHK619 ANOP                                                     @L7A  35900000
         AIF   ('&GENERIC' NE 'ASIS').RCHK61A                     @L7A  35950000
&BIX5    SETA  0                                                  @L7A  36000000
.RCHK61A ANOP                                                     @L7A  36050000
.* PROCESS ENTITY=(,PRIVATE)                                      @P1A  36055000
         AIF   ('&CMENTY2' NE 'PRIVATE').RCHK61D                  @M3C  36060000
&BIT6    SETA  1                                                  @P1A  36065000
.RCHK61D ANOP                                                     @P1A  36070000
         AIF   ('&CMENTY2' EQ 'CSA').RCHK61E                      @M3C  36075000
         AIF   ('&CMENTY2' NE 'NONE').RCHK61F                     @M3C  36080000
.RCHK61E ANOP                                                     @P1A  36085000
&BIX6    SETA  0                                                  @P1A  36090000
.RCHK61F ANOP                                                     @P1A  36095000
.* PROCESS PROFILE/ENTITY                                         @L7A  36100000
         AIF   (T'&PROFILE EQ 'O').RCHK620                        @L7A  36150000
         NI    4(1),B'11011111'     TURN OFF ENTITYX BIT          @Q7A  36175000
&BIT2    SETA  1                                                  @L7A  36200000
.RCHK620 ANOP                                                     @L7A  36250000
         AIF   ('&CMENTY1' EQ '').RCHK621                         @M3C  36300000
&BIX2    SETA  0                                                  @L7A  36350000
.RCHK621 ANOP                                                     @L7A  36400000
.* SET BITS IN THIRD FLAG BYTE                                    @L7A  36450000
         AIF   ('&BIX0&BIX1&BIX2&BIX5&BIX6' EQ '11111').RCHK622   @P1C  36500000
         NI    12(1),B'&BIX0&BIX1&BIX2.11&BIX5&BIX6.1'            @P1C  36550000
.RCHK622 ANOP                                                     @L7A  36600000
         AIF   ('&BIT0&BIT1&BIT2&BIT5&BIT6' EQ '00000').RCHK624   @P1C  36650000
         OI    12(1),B'&BIT0&BIT1&BIT2.00&BIT5&BIT6.0'            @P1C  36700000
.RCHK624 ANOP  ,                                                  @L6A  36750000
.* HANDLE ADDRESS TYPE PARAMETERS                                       36800000
         AIF   ('&CMENTY1' EQ '').RCHK640                          @M3C 36850000
         AIF   ('&CMENTY1'(1,1) NE '(').RCHK630                    @M3C 36900000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK625               @M3C 36950000
         ST    &CMENTY1,36(1)            STORE ENTITY NAME ADDRESS @M3C 37000000
         AGO   .RCHK680                                            @T1A 37050000
.RCHK625 ANOP                                                      @T1A 37100000
         STCM  &CMENTY1,7,5(1)         - STORE ENTITY NAME ADDRESS @M3C 37150000
         AGO   .RCHK680                                                 37200000
.RCHK630 ANOP                                                           37250000
         LA    0,&CMENTY1               - MOVE ENTITY NAME ADDRESS @M3C 37300000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK635               @M3C 37350000
         ST    0,36(1)         INTO PARM LIST                      @T1A 37400000
         AGO   .RCHK680                                            @T1A 37450000
.RCHK635 ANOP                                                      @T1A 37500000
         STCM  0,7,5(1) -      INTO PARM LIST                           37550000
         AGO   .RCHK680                                                 37600000
.RCHK640 ANOP                                                           37650000
         AIF   ('&PROFILE' EQ '').RCHK680                               37700000
         AIF   ('&PROFILE'(1,1) NE '(').RCHK670                         37750000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK650               @M3C 37800000
         ST    &PROFILE(1),36(1)    STORE PROFILE ADDRESS          @T1A 37850000
         AGO   .RCHK680                                            @T1A 37900000
.RCHK650 ANOP                                                      @T1A 37950000
         STCM  &PROFILE(1),7,5(1) - STORE PROFILE ADDRESS               38000000
         AGO   .RCHK680                                                 38050000
.RCHK670 ANOP                                                           38100000
         LA    0,&PROFILE -   MOVE PROFILE ADDRESS                      38150000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK675               @M3C 38200000
         ST    0,36(1)         INTO PARM LIST                      @T1A 38250000
         AGO   .RCHK680                                            @T1A 38300000
.RCHK675 ANOP                                                      @T1A 38350000
         STCM  0,7,5(1) -      INTO PARM LIST                           38400000
.RCHK680 ANOP                                                           38450000
.* PRODUCE SECOND FLAGS BYTE WITH ATTR SPECS                            38500000
         AIF   ('&ATTR' EQ '').RCHK750                                  38550000
         AIF   ('&ATTR'(1,1) EQ '(').RCHK745                            38600000
         AIF   ('&ATTR' NE 'ALTER').RCHK690                             38650000
         MVI   8(1),X'80' -   SET FOR ALTER ACCESS                      38700000
         AGO   .RCHK750                                                 38750000
.RCHK690 ANOP                                                           38800000
         AIF   ('&ATTR' NE 'UPDATE').RCHK730                            38850000
         MVI   8(1),X'04'               SET FOR UPDATE ACCESS           38900000
         AGO   .RCHK750                                                 38950000
.RCHK730 ANOP                                                           39000000
         AIF   ('&ATTR' NE 'READ').RCHK740                              39050000
         MVI   8(1),X'02'               SET FOR READ ACCESS             39100000
         AGO   .RCHK750                                                 39150000
.RCHK740 ANOP                                                           39200000
         AIF   ('&ATTR' NE 'CONTROL').RCHK750                      @Q1C 39250000
         MVI   8(1),X'08'               SET FOR CONTROL ACCESS          39300000
         AGO   .RCHK750                                                 39350000
.RCHK745 ANOP                                                           39400000
         STC   &ATTR(1),8(1) - STORE ATTR VALUE IN LIST FORM            39450000
.RCHK750 ANOP                                                           39500000
.* HANDLE CLASS PARAMETER                                               39550000
         AIF   ('&CLASS' EQ '').RCHK756                                 39600000
         AIF   ('&CLASS'(1,1) EQ '''').ERR09                            39650000
         AIF   ('&CLASS'(1,1) NE '(').RCHK754                           39700000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK752               @M3C 39750000
         ST    &CLASS(1),40(1)   STORE CLASS NAME ADDRESS          @T1A 39800000
         AGO   .RCHK756                                            @T1A 39850000
.RCHK752 ANOP                                                      @T1A 39900000
         STCM  &CLASS(1),7,9(1) - STORE CLASS NAME ADDRESS              39950000
         AGO   .RCHK756                                                 40000000
.RCHK754 ANOP                                                           40050000
         LA    0,&CLASS -     MOVE CLASS NAME ADDRESS                   40100000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK755               @M3C 40150000
         ST    0,40(1)         INTO PARM LIST                      @T1A 40200000
         AGO   .RCHK756                                            @T1A 40250000
.RCHK755 ANOP                                                      @T1A 40300000
         STCM  0,7,9(1) -      INTO PARM LIST                           40350000
.ERTN09  ANOP                                                           40400000
.RCHK756 ANOP                                                           40450000
.* HANDLE VOLSER PARAMETERS                                             40500000
         AIF   ('&VOLSER' EQ '').RCHK810                                40550000
         AIF   ('&VOLSER'(1,1) NE '(').RCHK800                          40600000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK75A               @M3C 40650000
         ST    &VOLSER(1),44(1)    STORE VOLSER ADDRESS            @T1A 40700000
         AGO   .RCHK810                                            @T1A 40750000
.RCHK75A ANOP                                                      @T1A 40800000
         STCM  &VOLSER(1),7,13(1) -  STORE VOLSER ADDRESS               40850000
         AGO   .RCHK810                                                 40900000
.RCHK800 ANOP                                                           40950000
         LA    0,&VOLSER -    MOVE VOLSER ADDRESS                       41000000
         AIF   (NOT &ICHCOM AND NOT &ICHRAC).RCHK805               @M3C 41050000
         ST    0,44(1)          INTO PARM LIST                     @T1A 41100000
         AGO   .RCHK810                                            @T1A 41150000
.RCHK805 ANOP                                                      @T1A 41200000
         STCM  0,7,13(1) -      INTO PARM LIST                          41250000
.RCHK810 ANOP                                                           41300000
         AIF   ('&OLDVOL' EQ '').RCHK820                       @PC00P2Y 41350000
         AIF   ('&OLDVOL'(1,1) NE '(').RCHK815                 @PC002PY 41400000
         ST    &OLDVOL(1),16(1) - STORE OLD VOLSER ADDRESS     @PC002PY 41450000
         AGO   .RCHK820                                        @PC002PY 41500000
.RCHK815 ANOP                                                  @PC002PY 41550000
         LA    0,&OLDVOL -   MOVE OLD VOLSER ADDRESS           @PC002PY 41600000
         ST    0,16(1) -      INTO PARM LIST                   @PC002PY 41650000
.RCHK820 ANOP                                                  @PC002PY 41700000
         AIF   ('&APPL' EQ '').RCHK835                         @PC003PY 41750000
         AIF   ('&APPL'(1,1) EQ '''').ERR10                    @PC003PY 41800000
         AIF   ('&APPL'(1,1) NE '(').RCHK830                   @PC003PY 41850000
         ST    &APPL(1),20(1) - STORE APPL ADDRESS             @PC003PY 41900000
         AGO   .RCHK835                                        @PC003PY 41950000
.RCHK830 ANOP                                                  @PC003PY 42000000
         LA    0,&APPL -     MOVE APPL ADDRESS                 @PC003PY 42050000
         ST    0,20(1) -      INTO PARM LIST                   @PC003PY 42100000
.ERTN10  ANOP                                                  @PC003PY 42150000
.RCHK835 ANOP                                                  @PC003PY 42200000
         AIF   ('&ACEE' EQ '').RCHK845                         @PC003PY 42250000
         AIF   ('&ACEE'(1,1) NE '(').RCHK840                   @PC003PY 42300000
         ST    &ACEE(1),24(1) - STORE ACEE ADDRESS             @PC003PY 42350000
         AGO   .RCHK845                                        @PC003PY 42400000
.RCHK840 ANOP                                                  @PC003PY 42450000
         LA    0,&ACEE -     MOVE ACEE ADDRESS                 @PC003PY 42500000
         ST    0,24(1) -      INTO PARM LIST                   @PC003PY 42550000
.RCHK845 ANOP                                                  @PC003PY 42600000
         AIF   ('&OWNER' EQ '').RCHK855                          @L4A   42650000
         AIF   ('&OWNER'(1,1) NE '(').RCHK850                    @L4A   42700000
         ST    &OWNER(1),28(1) - STORE OWNER ADDRESS.            @L4A   42750000
         AGO   .RCHK855                                          @L4A   42800000
.RCHK850 ANOP  ,                                                 @L4A   42850000
         LA    0,&OWNER -    MOVE OWNER ADDRESS                  @L4A   42900000
         ST    0,28(1)  -     INTO PARM LIST.                    @L4A   42950000
.RCHK855 ANOP  ,                                                 @L4A   43000000
         AIF   ('&ACCLVL' EQ '').RCHK859                         @L5A   43050000
         AIF   (T'&ACCLVL(1) EQ 'O').RCHK857                     @L5A   43100000
         AIF   ('&ACCLVL(1)'(1,1) NE '(').RCHK856                @L5A   43150000
         ST    &ACCLVL(1),48(1) - STORE ACCESS VALUE ADDRESS.    @L5A   43200000
         AGO   .RCHK857                                          @L5A   43250000
.RCHK856 ANOP  ,                                                 @L5A   43300000
         LA    0,&ACCLVL(1) - MOVE ACCESS VALUE ADDRESS          @L5A   43350000
         ST    0,48(1)      -  INTO PARM LIST.                   @L5A   43400000
.RCHK857 ANOP  ,                                                 @L5A   43450000
         AIF   (T'&ACCLVL(2) EQ 'O').RCHK859                     @L5A   43500000
         AIF   ('&ACCLVL(2)'(1,1) NE '(').RCHK858                @L5A   43550000
         ST    &ACCLVL(2),52(1) - STORE 2ND ACC ADDRESS.         @L5A   43600000
         AGO   .RCHK859                                          @L5A   43650000
.RCHK858 ANOP  ,                                                 @L5A   43700000
         LA    0,&ACCLVL(2) - MOVE 2ND ACCESS ADDRESS            @L5A   43750000
         ST    0,52(1)      -  INTO PARM LIST.                   @L5A   43800000
.RCHK859 ANOP  ,                                                 @L5A   43850000
         AIF   (&RLVL LE 2).RLVLX22 BYPASS IF RELEASE 1.6          @L7A 43900000
         AIF   ('&FILESEQ' EQ '').RCHK870     OMITTED            @L7A   43950000
         AIF   ('&FILESEQ'(1,1) NE '(').RCHK865                  @L7A   44000000
         STH   &FILESEQ,56(1)                 REG SPEC           @L7A   44050000
         AGO   .RCHK870                                          @L7A   44100000
.RCHK865 ANOP                                                    @L7A   44150000
         LH    0,=AL2(&FILESEQ)       MOVE FILESEQUENCE NUMBER   @L7A   44200000
         STH   0,56(1)                INTO PARM LIST             @L7A   44250000
.* PRODUCE TAPES FLAG BYTE    X'00'=STD X'01'=NL X'10'=BLP       @L7A   44300000
.RCHK870 ANOP                                                    @L7A   44350000
&BIX0    SETA  1                                                 @L7A   44400000
&BIX1    SETA  1                                                 @L7A   44450000
&BIT0    SETA  0                                                 @L7A   44500000
&BIT1    SETA  0                                                 @L7A   44550000
         AIF   (T'&TAPELBL EQ 'O').RCHK87X                       @L7A   44600000
&BIX0    SETA  0              RESET FLAGS IF OPERAND SPEC        @L7A   44650000
&BIX1    SETA  0                                                 @L7A   44700000
         AIF   ('&TAPELBL' EQ 'STD').RCHK880                     @L7A   44750000
         AIF   ('&TAPELBL' NE 'BLP').RCHK873                     @L7A   44800000
&BIT0    SETA  1              BLP=X'10'                          @L7A   44850000
         AGO   .RCHK879                                          @L7A   44900000
.RCHK873 ANOP                                                    @L7A   44950000
&BIT1    SETA  1              NL=X'01'                           @L7A   45000000
.RCHK879 ANOP                                                    @L7A   45050000
         NI    58(1),B'&BIX0&BIX1.111111'                        @L7A   45100000
         OI    58(1),B'&BIT0&BIT1.000000'                        @L7A   45150000
         AGO   .RCHK87X                                          @L7A   45200000
.RCHK880 ANOP                                                    @L7A   45250000
         NI    58(1),B'00111111'                                 @L7A   45300000
.RCHK87X ANOP                                                    @L7A   45350000
.* PRODUCE FOURTH FLAG BYTE                                        @L7A 45356100
         AIF   ('&STATUS' NE 'NONE').RCHK90X                       @L7A 45362200
&BIX0    SETA  0                 STATUS=NONE X'00'                 @L7A 45368300
&BIX1    SETA  0                 TURN OFF EVERDOM                  @D2A 45374400
&BIX2    SETA  0                 TURN OFF WRITEONLY                @D4A 45380500
&BIX3    SETA  0                 TURN OFF ACCESS                   @Q1A 45384500
         NI    59(1),B'&BIX0&BIX1&BIX2&BIX3.1111'                  @Q1C 45388500
.RCHK90X ANOP                                                      @L7A 45392700
         AIF   ('&STATUS' NE 'ERASE').RCHKEV5                      @D2C 45398800
&BIT0    SETA  1                 STATUS=ERASE     -X'80'           @L7A 45404900
         OI    59(1),B'&BIT0.0000000'                              @L7A 45411000
.RCHKEV5 ANOP                                                      @D2A 45417100
         AIF   ('&STATUS' NE 'EVERDOM').RCHKWRO                    @D4C 45423200
&BIT1    SETA  1                 STATUS=EVERDOM   -X'40'           @D2A 45429300
         OI    59(1),B'0&BIT1.000000'                              @D2A 45432300
.RCHKWRO ANOP                                                      @D4A 45435400
         AIF   ('&STATUS' NE 'WRITEONLY').RCHKACD                  @Q1C 45441500
&BIT2    SETA  1                 STATUS=WRITEONLY -X'20'           @D4A 45447600
         OI    59(1),B'00&BIT2.00000'                              @Q6C 45451200
.RCHKACD ANOP                                                      @Q1A 45454900
         AIF   ('&STATUS' NE 'ACCESS').RCHK91X                     @Q1A 45456100
&BIT3    SETA  1                 STATUS=ACCESS    -X'10'           @Q1A 45457300
         OI    59(1),B'000&BIT3.0000'                              @Q6C 45458500
.RCHK91X ANOP                                                      @L7A 45459800
         AIF   (&RLVL LE 3).RLVLX22  BYPASS IF 1.7 OR LOWER       @L8A  45465900
         AIF   ('&USERID' EQ '').RCHK93X                          @L8A  45472000
         AIF   ('&USERID'(1,1) EQ '''').ERR15                     @L8A  45478100
         AIF   ('&USERID'(1,1) NE '(').RCHK92X                    @L8A  45484200
         ST    &USERID(1),60(1) - STORE USERID ADDRESS            @L8A  45490300
         AGO   .RCHK93X                                           @L8A  45496400
.RCHK92X ANOP                                                     @L8A  45502500
         LA    0,&USERID -   MOVE USERID ADDRESS                  @L8A  45508600
         ST    0,60(1) -      INTO PARM LIST                      @L8A  45514700
.ERTN15  ANOP                                                     @L8A  45520800
.RCHK93X ANOP                                                     @L8A  45526900
         AIF   ('&GROUPID' EQ '').RCHK95X                         @L8A  45533000
         AIF   ('&GROUPID'(1,1) EQ '''').ERR16                    @L8A  45539100
         AIF   ('&GROUPID'(1,1) NE '(').RCHK94X                   @L8A  45545200
         ST    &GROUPID(1),64(1) - STORE GROUPID ADDRESS          @L8A  45551300
         AGO   .RCHK95X                                           @L8A  45557400
.RCHK94X ANOP                                                     @L8A  45563500
         LA    0,&GROUPID -  MOVE GROUPID ADDRESS                 @L8A  45569600
         ST    0,64(1) -      INTO PARM LIST                      @L8A  45575700
.ERTN16  ANOP                                                     @L8A  45581800
.RCHK95X ANOP                                                     @L8A  45587900
         AIF   (&RLVL LT 6).RLVLX22  BYPASS IF NOT 1.8X       @YA12773  45594000
         AIF   ('&DDNAME' EQ '').RCHK97X                      @YA12773  45600100
         AIF   ('&DDNAME'(1,1) NE '(').RCHK96X                @YA12773  45606200
         ST    &DDNAME(1),68(1) - STORE DDNAME ADDRESS        @YA12773  45612300
         AGO   .RCHK97X                                       @YA12773  45618400
.RCHK96X ANOP                                                 @YA12773  45624500
         LA    0,&DDNAME -  MOVE DDNAME ADDRESS               @YA12773  45630600
         ST    0,68(1) -      INTO PARM LIST                  @YA12773  45636700
.RCHK97X ANOP                                                 @YA12773  45642800
         AIF   ('&UTOKEN' EQ '').RCHK0HX                          8@D1D 45648900
         AIF   ('&UTOKEN'(1,1) NE '(').RCHK0GX                     @M2A 45655000
         ST    &UTOKEN(1),76(1) - STORE UTOKEN ADDRESS             @M2A 45661100
         AGO   .RCHK0HX                                            @M2A 45667200
.RCHK0GX ANOP                                                      @M2A 45673300
         LA    0,&UTOKEN -   MOVE UTOKEN ADDRESS                   @M2A 45679400
         ST    0,76(1) -      INTO PARM LIST                       @M2A 45685500
.RCHK0HX ANOP                                                      @M2A 45691600
         AIF   ('&RTOKEN' EQ '').RCHK0QX                           @M2A 45697700
         AIF   ('&RTOKEN'(1,1) NE '(').RCHK0PX                     @M2A 45703800
         ST    &RTOKEN(1),80(1) - STORE RTOKEN ADDRESS             @M2A 45709900
         AGO   .RCHK0QX                                            @M2A 45716000
.RCHK0PX ANOP                                                      @M2A 45722100
         LA    0,&RTOKEN -   MOVE RTOKEN ADDRESS                   @M2A 45728200
         ST    0,80(1) -      INTO PARM LIST                       @M2A 45734300
.RCHK0QX ANOP                                                      @M2A 45740400
         AIF   ('&LOGSTR' EQ '').RCHK0MX                           @M2A 45746500
         AIF   ('&LOGSTR'(1,1) NE '(').RCHK0KX                     @M2A 45752600
         ST    &LOGSTR(1),84(1) - STORE LOGSTR ADDRESS             @M2A 45758700
         AGO   .RCHK0MX                                            @M2A 45764800
.RCHK0KX ANOP                                                      @M2A 45770900
         LA    0,&LOGSTR -   MOVE LOGSTR ADDRESS                   @M2A 45777000
         ST    0,84(1) -      INTO PARM LIST                       @M2A 45783100
.RCHK0MX ANOP                                                      @M2A 45789200
         AIF   ('&RECVR' EQ '').RCHK0OX                            @M2A 45795300
         AIF   ('&RECVR'(1,1) NE '(').RCHK0NX                      @M2A 45801400
         ST    &RECVR(1),88(1) - STORE RECVR ADDRESS               @M2A 45807500
         AGO   .RCHK0OX                                            @M2A 45813600
.RCHK0NX ANOP                                                      @M2A 45819700
         LA    0,&RECVR -    MOVE RECVR ADDRESS                    @M2A 45825800
         ST    0,88(1) -      INTO PARM LIST                       @M2A 45831900
.RCHK0OX ANOP                                                      @M2A 45838000
.RLVLX22 ANOP                      END OF 1.6 BYPASS               @L7A 45850000
.* MODIFICATION COMPLETE - AGO ABOVE TO PRODUCE ENTRY LOGIC             45900000
         AGO   .RCHK520                                                 45950000
.* DIAGNOSTICS                                                          46000000
.ERR00   ANOP                                                           46050000
         AIF   (&RLVL GE 7).NEWMSG1                                @P9C 46075000
         MNOTE 8,'*** ENTITY OR PROFILE PARM REQUIRED ***'              46100000
         AGO   .COMSG01                                            @M3A 46110000
.NEWMSG1 ANOP                                                      @M3A 46120000
         MNOTE 8,'*** ENTITY OR ENTITYX OR PROFILE PARM REQUIRED ***'   46130000
.COMSG01 ANOP                                                      @M3A 46140000
         AGO   .ERTN00                                                  46150000
.ERR01   ANOP                                                      @D3C 46155500
         MNOTE 8,'*** CSA PARAMETER INVALID WITH RELEASE=1.8.2 SPECIFIE-46161000
               D ***'                                              @D3C 46166500
         AGO   .ERTN01                                             @D3C 46172000
.ERR00A  ANOP                                                      @M4A 46177500
         MNOTE 4,'*** PROFILE PARAMETER IGNORED WHEN RELEASE=1.8.2 IS S-46183000
               PECIFIED ***'                                       @D3C 46188500
         AGO   .ERTN00                                             @M4A 46194000
.ERR02   ANOP                                                           46200000
         MNOTE 8,'*** INVALID LOG PARAMETER SPECIFIED ***'              46250000
         AGO   .ERTN02                                                  46300000
.ERR02A  ANOP                                                      @M4A 46310000
         MNOTE 4,'*** LOG PARAMETER IGNORED WHEN RELEASE=1.8.2 IS SPECI-46320000
               FIED ***'                                           @D3C 46330000
         AGO   .ERTN02                                             @M4A 46340000
.ERR03   ANOP                                                           46350000
         MNOTE 8,'*** INVALID DSTYPE PARAMETER SPECIFIED ***'           46400000
         AGO   .ERTN03                                                  46450000
.ERR03A  ANOP                                                      @M4A 46460000
         MNOTE 8,'*** DSTYPE PARAMETER INVALID WITH RELEASE=1.8.2 IS SP-46470000
               ECIFIED ***'                                        @D3C 46480000
         AGO   .ERTN03                                             @M4A 46490000
.ERR04   ANOP                                                           46500000
         MNOTE 8,'*** INVALID ATTR PARAMETER SPECIFIED ***'             46550000
         AGO   .ERTN04                                                  46600000
.ERR05   ANOP                                                      @L5A 46650000
         MNOTE 8,'*** INVALID RACFIND PARAMETER SPECIFIED ***'     @L5A 46700000
         AGO   .ERTN05                                             @L5A 46750000
.ERR05A  ANOP                                                      @M4A 46760000
         MNOTE 4,'*** RACFIND PARAMETER IGNORED WHEN RELEASE=1.8.2 IS S-46770000
               PECIFIED ***'                                       @D3C 46780000
         AGO   .ERTN05                                             @M4A 46790000
.ERR06   ANOP                                                           46800000
         MNOTE 8,'*** INVALID MF PARAMETER SPECIFIED ***'               46850000
         AGO   .ERTN06                                                  46900000
.ERR07   ANOP                                                           46950000
         MNOTE 8,'*** REGISTER NOTATION NOT ALLOWED WITH LIST FORM ***'+47000000
                                                                   @L7A 47050000
         AGO   .ERTN07                                                  47100000
.ERR09   ANOP                                                           47150000
         MNOTE 8,'*** ''CLASSNAME'' FORM NOT ALLOWED WITH MF=E OR MF=M +47183300
               ***'                                                @P5C 47216600
         AGO   .ERTN09                                                  47250000
.ERR10   ANOP                                                  @PC003PY 47300000
         MNOTE 8,'*** ''APPLNAME'' FORM NOT ALLOWED WITH MF=E OR MF=M *+47333300
               **'                                                 @P5C 47366600
         AGO   .ERTN10                                         @PC003PY 47400000
.ERR11   ANOP                                                  @PC003PY 47450000
         MNOTE 8,'*** INVALID GENERIC PARAMETER SPECIFIED ***'     @L6A 47500000
         AGO   .ERTN11                                             @L6A 47550000
.ERR11A  ANOP                                                      @M4A 47560000
         MNOTE 4,'*** GENERIC PARAMETER IGNORED WHEN RELEASE=1.8.2 IS S-47570000
               PECIFIED ***'                                       @M4A 47580000
         AGO   .ERTN11                                             @M4A 47590000
.ERR12   ANOP                                                      @L7A 47600000
         MNOTE 8,'*** INVALID TAPELBL PARAMETER SPECIFIED ***'     @L7A 47650000
         AGO   .ERTN12                                             @L7A 47700000
.ERR12A  ANOP                                                      @M4A 47710000
         MNOTE 4,'*** TAPELBL PARAMETER IGNORED WHEN RELEASE=1.8.2 IS S-47720000
               PECIFIED ***'                                       @D3C 47730000
         AGO   .ERTN12                                             @M4A 47740000
.ERR13   ANOP                                                      @L7A 47750000
         MNOTE 8,'*** INVALID STATUS PARAMETER SPECIFIED ***'      @L7A 47800000
         AGO   .ERTN13                                             @L7A 47850000
.ERR13A  ANOP                                                      @M4A 47851100
         MNOTE 8,'*** STATUS PARAMETER INVALID WITH RELEASE=1.8.2 ***'  47852200
         AGO   .ERTN13                                             @M4A 47853300
.ERR14   MNOTE 8,'*** ''GROUPID'' IS INVALID WITHOUT ''USERID'' KEYWORDX47854400
                ***'                                               @L8A 47855500
         AGO   .ERTN14                                             @L8A 47856600
.ERR14A  MNOTE 4,'*** GROUPID PARAMETER IS IGNORED WITH RELEASE=1.8.2 S-47857700
               PECIFIED ***'                                       @D3C 47858800
         AGO   .ERTN14                                             @M4A 47859900
.ERR15   ANOP                                                      @L8A 47861000
         MNOTE 8,'*** ''USERID'' FORM NOT ALLOWED WITH MF=E OR MF=M ***+47862100
               '                                                   @P5C 47863200
         AGO   .ERTN15                                             @L8A 47864300
.ERR15A  ANOP                                                      @M4A 47865400
         MNOTE 8,'*** INVALID KEYWORD(S) SPECIFIED FOR RELEASE=1.8.2 **X47866500
               *'                                                  @D3C 47867600
         AGO   .ERTN15A                                            @M4A 47868700
.ERR16   ANOP                                                      @L8A 47869800
         MNOTE 8,'*** ''GROUPID'' FORM NOT ALLOWED WITH MF=E OR MF=M **+47870900
               *'                                                  @P5C 47872000
         AGO   .ERTN16                                             @L8A 47873100
.ERR17   ANOP                                                      @P1A 47874200
         AIF   ('&ENTITYX' NE '').NEWMSG2                          @M3A 47875300
         MNOTE 8,'*** INCORRECT ''ENTITY'' PARAMETER, ''&CMENTY2'' ***' 47876400
.*                                                                 @M3C 47877500
         AGO   .COMSG02                                            @M3A 47878600
.NEWMSG2 ANOP                                                      @M3A 47879700
         MNOTE 8,'*** INCORRECT ''ENTITYX'' PARAMETER, ''&CMENTY2'' ***X47880800
                '                                                  @M3A 47881900
.COMSG02 ANOP                                                      @M3A 47883000
         AGO   .ERTN17                                             @P1A 47884100
.ERR18   ANOP                                                      @M3A 47885200
         MNOTE 8,'*** ENTITYX AND ENTITY ARE MUTUALLY EXCLUSIVE KEYWORDX47886300
               S ***'                                              @M3A 47887400
         AGO   .ERTN18                                             @M3A 47888500
.ERR19   ANOP                                                      @M3A 47889600
         MNOTE 8,'*** RACHECK CAN BE INVOKED ONLY VIA RACROUTE FOR RELEX47890700
               ASE 1.9 AND LATER ***'                              @M3A 47891800
         AGO   .ERTN19                                             @M3A 47892900
.ERR20   ANOP                                                      @M3A 47894000
         MNOTE 8,'*** "ENTITYX" IS SUPPORTED BY RELEASE 1.9 AND LATER OX47895100
               NLY, ENTITYX IS IGNORED ***'                        @M3A 47896200
         AGO   .ERTN20                                             @M3A 47897300
.ERR21   ANOP                                                      @P8A 47897800
         MNOTE 8,'*** "RTOKEN" CANNOT BE SPECIFIED WITH SECOND ENTITY/EX47898300
               NTITYX OPERAND "&CMENTY2" ***'                      @Q2C 47898800
         AGO   .ERTN21                                             @P8A 47899300
.ERLVL1  MNOTE 8,'*** INCORRECT SPECIFICATION OF ''RELEASE'' ***'  @L7A 47900000
         AGO   .ERLVL1R                                            @L7A 47950000
.ERLVL2  MNOTE 4,'*** ''RELEASE-CHECK'' ONLY VALID WITH ''MF=E'' ***'  X48000000
                                                                   @L7A 48050000
         AGO   .ERLVL2R                                            @L7A 48100000
.ERLVL3  MNOTE 4,'*** RELEASE=1.8.2 ONLY VALID WHEN SPECIFIED ON A RACRX48112500
               OUTE MACRO INVOCATION ***'                          @D3A 48125000
         AGO   .ERLVL3R                                            @M4A 48137500
.ERLVLA  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX48150000
               ) ***'                                              @L7A 48200000
         AGO   .ERLVLAR                                            @L7A 48250000
.ERLVLB  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX48253100
               ) ***'                                              @L8A 48256200
         AGO   .ERLVLBR                                            @L8A 48259300
.ERLVLC  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX48262400
               ) ***'                                          @YA12773 48265500
         AGO   .ERLVLCR                                        @YA12773 48268600
.ERLVLD  MNOTE 4,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX48271700
               ) ***'                                              @M2A 48274800
         AGO   .ERLVLDR                                            @M2A 48277900
.ERLVLE  MNOTE 8,'*** ''UTOKEN'', ''RTOKEN'', ''LOGSTR'', AND ''RECVR''X48281000
                ARE ALLOWED ONLY  ON RACROUTE REQUEST=AUTH ***'    @D1C 48284100
         AGO   .ERLVLER                                            @P3A 48287200
.ERLVLF  MNOTE 8,'*** ''RELEASE'' INCOMPATIBLE WITH SPECIFIED KEYWORD(SX48290300
               ) ***'                                              @M4A 48293400
         AGO   .ERLVLFR                                            @M4A 48296500
         MEND                                                           48300000
